{
    "VERSE": "41:10",
    "ARABIC": "وَجَعَلَ فِيهَا رَوَٰسِىَ مِن فَوْقِهَا وَبَٰرَكَ فِيهَا وَقَدَّرَ فِيهَآ أَقْوَٰتَهَا فِىٓ أَرْبَعَةِ أَيَّامٍ سَوَآءً لِّلسَّآئِلِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "He placed firmly embedded mountains on it, towering over it, and blessed it and measured out its nourishment in it, laid out for those who seek it - all in four days.",
        "TRANSLATION_1": "He placed firm stabilisers rising above its surface, blessed it with plenty and growth, and ingrained the means of growing its food within it, sufficient for all seekers, in four spans.\n",
        "TRANSLATION_2": "(After creating the earth) He set up firm mountains on it, blessed it, and provided it with sustenance in proportion to the needs of all who seek (sustenance). All this was done in four days.\n",
        "TRANSLATION_3": "In four days He placed the mountains on it, blessed it, and equally measured out sustenance for those who seek sustenance.\n",
        "TRANSLATION_4": "And in it He placed mountains as anchors from above it, and blessings in it, and appointed the sustenance for those who dwell in it – all this in four days; a proper answer to those who question.\n",
        "TRANSLATION_5": "He placed therein firm mountains from above it, and He blessed it, and measured therein its sustenance in four Days equal for all those who ask.\n",
        "TRANSLATION_6": "And He made in it mountains above its surface, and He blessed therein and made therein its foods, in four periods: alike for the seekers.\n",
        "TRANSLATION_7": "And He set therein firm mountains over it, and He blessed it, and He ordained therein its diverse sustenance in four days, equal to those who ask.'\n",
        "TRANSLATION_8": "He placed therein firm hills rising above it, and blessed it and measured therein its sustenance in four Days, alike for (all) who ask;\n",
        "TRANSLATION_9": "He placed firm mountains on the earth, and blessed it. He measured out its means of sustenance all in four Days; this is for those who ask for it.\n",
        "TRANSLATION_10": "And He placed therein mountains firmly rooted rising above it, and blessed it, and ordained therein the sustenance thereof, all this in four days: comglete: this for the inquirers.\n",
        "TRANSLATION_11": "He set in it firm mountains, [rising] above it, blessed it, and ordained in it, in four days, [various] means of sustenance, equally for all seekers.\n",
        "TRANSLATION_12": "He set on the (earth), mountains standing firm, high above it, and bestowed blessings on the earth, and measure therein all things to give them nourishment in due proportion, in four Days, in accordance with (the needs of) those who seek (Sustenance).\n",
        "TRANSLATION_13": "He placed therein (i.e. the earth) firm mountains from above it, and He blessed it, and measured therein its sustenance (for its dwellers) in four Days equal (i.e. all these four 'days' were equal in the length of time), for all those who ask (about its creation).\n",
        "TRANSLATION_14": "He set firm mountains on top (of the earth) and He blessed it. And in four days He ordained in it many provisions, equal to those who ask.\n",
        "TRANSLATION_15": "He placed stabilizers over it; and blessed it; and planned its provisions in four days, equally to the seekers.\n",
        "TRANSLATION_16": "And He placed on the earth firmly set mountains over its surface, and He blessed it and determined therein its [creatures'] sustenance in four days without distinction - for [the information] of those who ask.\n",
        "TRANSLATION_17": "[41:10] And He set (wa-ja‘ala, the beginning of a new [independent] sentence and cannot be a supplement to [the preceding] relative clause containing alladhī, ‘Who’, because of the intervening clause that is [syntactically] unrelated) therein firm mountains [rising] above it, and blessed it, with an abundance of water, crops and stock, and ordained, divided, therein its [various means of] sustenance, for human beings and beasts, in four, complete, days — in other words, the ‘setting therein [of mountains]’ together with what has been mentioned in addition [all] took place on Tuesday and Wednesday — evenly (sawā’an, in the accusative because it is a verbal noun) in other words, the four days were exactly four, neither less nor more, for [all] enquirers, about the creation of the earth and all that is in it.\n",
        "TRANSLATION_18": "(He placed therein) He created therein (firm hills rising above it) as pillars for it, (and blessed it) i.e. the earth with water, trees, vegetation and fruits (and measured therein its sustenance) its livelihoods, in each land there is a livelihood which is not found elsewhere (in four Days) He says: He created the spirits 4,000 years, of the years of the life of the world, before He created the bodies and He measured the sustenance of these bodies 4,000 years of the years of the life of this world before he measured the sustenance of the spirits, (alike for (all) who ask) alike for those who ask sustenance and those who do not; it is also said that this means: as an exposition to those who ask how He created them. It is thus that he created them;\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "41:10",
            "25:69",
            "29:55",
            "30:12",
            "30:14",
            "16:50",
            "26:155",
            "50:41",
            "20:101",
            "36:59"
        ],
        "BIBLE": [
            "prophets:ezekiel:7:20",
            "writings:esther:9:31",
            "writings:daniel:9:27",
            "torah:deuteronomy:30:19",
            "prophets:isaiah:46:10",
            "prophets:isaiah:40:12",
            "writings:ii%20chronicles:26:5",
            "torah:numbers:7:1",
            "prophets:isaiah:44:7",
            "prophets:jeremiah:16:19"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:5:2"
        ]
    }
}