{
    "VERSE": "41:11",
    "ARABIC": "ثُمَّ ٱسْتَوَىٰٓ إِلَى ٱلسَّمَآءِ وَهِىَ دُخَانٌ فَقَالَ لَهَا وَلِلْأَرْضِ ٱئْتِيَا طَوْعًا أَوْ كَرْهًا قَالَتَآ أَتَيْنَا طَآئِعِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Then He turned to heaven when it was smoke and said to it and to the earth, 'Come willingly or unwillingly.' They both said, 'We come willingly.'",
        "TRANSLATION_1": "Then He turned to the heavens, and it was smoke. So He said to it and the earth: \"Come with willing obedience or perforce.\" They said: \"We come willingly.\"\n",
        "TRANSLATION_2": "Then He turned to the heaven while it was all smoke. He said to the heaven and the earth: “Come (into being), willingly or unwillingly.” They said: “Here we come (into being) in willing obeisance.”\n",
        "TRANSLATION_3": "He established His dominance over the sky, which (for that time) was like smoke. Then He told the heavens and the earth, \"Take your shape either willingly or by force\" They said, \"We willingly obey\".\n",
        "TRANSLATION_4": "He then inclined towards the heavens and it was smoke – thereupon He said to it and to the earth, “Both of you present yourselves, willingly or with reluctance”; they said, “We present ourselves, with zeal.”\n",
        "TRANSLATION_5": "Then He rose over (Istawa ila) the heaven when it was smoke, and said to it and to the earth: \"Come both of you willingly or unwillingly.\" They both said: \"We come willingly.\"\n",
        "TRANSLATION_6": "Then He directed Himself to the heaven and it is a vapor, so He said to it and to the earth: Come both, willingly or unwillingly. They both said: We come willingly.\n",
        "TRANSLATION_7": "Then He lifted Himself to heaven when it was smoke, and said to it and to the earth, \"Come willingly, or unwillingly!\" They said, \"We come willingly.\"\n",
        "TRANSLATION_8": "Then turned He to the heaven when it was smoke, and said unto it and unto the earth: Come both of you, willingly or loth. They said: We come, obedient.\n",
        "TRANSLATION_9": "Then He turned to heaven when it was vapour and said to it and to the earth, \"Come willingly or unwillingly.\" They both said, \"We come willingly,\"\n",
        "TRANSLATION_10": "Thereafter turned He to the heaven and it was as smoke, and said Unto it and Unto the earth: come ye twain, willingly or loth. They said: we come willingly.\n",
        "TRANSLATION_11": "Then He turned to the heaven, and it was smoke, and He said to it and to the earth, ‘Come, willingly or unwillingly!’ They said, ‘We come obediently.’\n",
        "TRANSLATION_12": "Moreover He comprehended in His design the sky, and it had been (as) smoke: He said to it and to the earth: \"Come ye together, willingly or unwillingly.\" They said: \"We do come (together), in willing obedience.\"\n",
        "TRANSLATION_13": "Then He Istawa (rose over) towards the heaven when it was smoke, and said to it and to the earth: \"Come both of you willingly or unwillingly.\" They both said: \"We come, willingly.\"\n",
        "TRANSLATION_14": "Then He willed to the heaven when it was smoke, and to it and the earth He said: 'Come willingly, or unwillingly' 'We come willingly' they answered.\n",
        "TRANSLATION_15": "Then He turned to the sky, and it was smoke, and said to it and to the earth, “Come, willingly or unwillingly.” They said, “We come willingly.”\n",
        "TRANSLATION_16": "Then He directed Himself to the heaven while it was smoke and said to it and to the earth, \"Come [into being], willingly or by compulsion.\" They said, \"We have come willingly.\"\n",
        "TRANSLATION_17": "[41:11] Then He turned to the heaven when it was smoke, [consisting of] rising vapours, and He said to it and to the earth, “Come both of you, to what I desire from you, willingly, or unwillingly!” (taw‘an aw karhan, their [syntactical] locus is that of a circumstantial qualifier, in other words, ‘[Come] being obedient or coerced’). They said, “We come, together with all those inhabiting us, willingly!” (tā’i‘īna mainly indicates masculine rational beings; it may also be that they are referred to in this way because they are being addressed thus).\n",
        "TRANSLATION_18": "(Then turned He to the heaven) then He turned to the creation of the heaven (when it was smoke) steam of water, (and said unto it) unto the heaven (and unto the earth) after He had created both: (Come both of you) give both of you the water and vegetation that you have, (willingly or loth. They said: We come) we give, (obedient) to Allah, even though we dislike people's unresponsiveness.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "41:11",
            "3:83",
            "13:15",
            "44:29",
            "30:26",
            "57:5",
            "52:36",
            "12:105",
            "30:18",
            "20:4"
        ],
        "BIBLE": [
            "prophets:ii%20kings:10:15",
            "prophets:joshua:8:21",
            "torah:exodus:4:7",
            "prophets:zechariah:6:5",
            "prophets:ii%20kings:2:9",
            "prophets:judges:9:43",
            "torah:numbers:16:3",
            "prophets:i%20kings:20:33",
            "writings:daniel:5:20",
            "writings:i%20chronicles:21:11"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:3:4",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:11"
        ]
    }
}