{
    "VERSE": "41:13",
    "ARABIC": "فَإِنْ أَعْرَضُوا۟ فَقُلْ أَنذَرْتُكُمْ صَٰعِقَةً مِّثْلَ صَٰعِقَةِ عَادٍ وَثَمُودَ",
    "ENGLISH": {
        "TRANSLATION_0": "If they turn away, then say, 'I warn you of a lightning-bolt like the lightning-bolt of 'Ad and of Thamud.'",
        "TRANSLATION_1": "If even then they turn away, tell them: \"I forewarn you of a terrible punishment like the thunderbolt that fell upon the 'Ad and Thamud.\"\n",
        "TRANSLATION_2": "But if they turn away, tell them: “I warn you against a sudden scourge like that which struck Ad and Thamud.”\n",
        "TRANSLATION_3": "If they ignore (your message), tell them, \"I have warned you against a destructive blast of sound like that which struck the people of `Ad and Thamud.\n",
        "TRANSLATION_4": "Then if they turn away say, “I warn you of a thunderbolt like the thunderbolt which came upon A’ad and Thamud.”\n",
        "TRANSLATION_5": "But if they turn away, then say: \"I have warned you of a Sa`iqah like the Sa`iqah which overtook `Ad and Thamud.\"\n",
        "TRANSLATION_6": "But if they turn aside, then say: I have warned you of a scourge like the scourge of Ad and Samood.\n",
        "TRANSLATION_7": "And We adorned the lower heaven with lamps, and to reserve; that is the ordaining of the All-mighty, the All-knowing. But if they turn away, then say, 'I warn you of a thunderbolt like to the thunderbolt of Ad and Thamood.'\n",
        "TRANSLATION_8": "But if they turn away, then say: I warn you of a thunderbolt like the thunderbolt (which fell of old upon the tribes) of A'ad and Thamud;\n",
        "TRANSLATION_9": "If they turn away, then say, \"I warn you of a lightning-bolt like the one which struck the 'Ad and the Thamud:\n",
        "TRANSLATION_10": "Then if they Still turn away, say thou; I warn you of a calamity like the calamity of the 'Aad and Thamud.\n",
        "TRANSLATION_11": "But if they turn away, say, ‘I warn you of a thunderbolt, like the thunderbolt of ‘Ad and Thamud.’\n",
        "TRANSLATION_12": "But if they turn away, say thou: \"I have warned you of a stunning Punishment (as of thunder and lightning) like that which (overtook) the 'Ad and the Thamud!\"\n",
        "TRANSLATION_13": "But if they turn away, then say (O Muhammad SAW): \"I have warned you of a Sa'iqah (a destructive awful cry, torment, hit, a thunderbolt) like the Sa'iqah which overtook 'Ad and Thamud (people).\"\n",
        "TRANSLATION_14": "But if they turn away, say: 'I have given you warning of a thunderbolt similar to that which overtook Aad and Thamood'\n",
        "TRANSLATION_15": "But if they turn away, say, “I have warned you of a thunderbolt, like the thunderbolt of Aad and Thamood.”\n",
        "TRANSLATION_16": "But if they turn away, then say, \"I have warned you of a thunderbolt like the thunderbolt [that struck] 'Aad and Thamud.\n",
        "TRANSLATION_17": "[41:13] But if they, that is, the Meccan disbelievers, turn away, from belief, after this clear statement, then say, ‘I warn you of, I threaten you [with], a thunderbolt like the thunderbolt of ‘Ād and Thamūd’, in other words, a chastisement that will destroy you like the one that destroyed them.\n",
        "TRANSLATION_18": "(But if they) the disbelievers of Mecca: 'Utbah and his host (turn away) from faith, (then say: I warn you) by means of the Qur'an (of a thunderbolt) of a punishment (like the thunderbolt) like the punishment ((which fell of old upon the tribes) of 'Aad and Thamud; 551\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "41:13",
            "22:42",
            "10:38",
            "11:13",
            "52:34",
            "40:31",
            "53:50",
            "43:8",
            "7:194",
            "46:10"
        ],
        "BIBLE": [
            "prophets:i%20samuel:10:9",
            "prophets:ezekiel:3:20",
            "prophets:i%20kings:21:20",
            "prophets:jeremiah:30:3",
            "torah:numbers:11:4",
            "prophets:joshua:6:16",
            "prophets:joshua:2:9",
            "writings:ii%20chronicles:35:21",
            "writings:i%20chronicles:29:14",
            "torah:genesis:38:18"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:4:1"
        ]
    }
}