{
    "VERSE": "41:18",
    "ARABIC": "وَنَجَّيْنَا ٱلَّذِينَ ءَامَنُوا۟ وَكَانُوا۟ يَتَّقُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "And We rescued those who had iman and taqwa.",
        "TRANSLATION_1": "But We saved those who believed and took heed for themselves.\n",
        "TRANSLATION_2": "Yet We delivered those who believed and were God-fearing.\n",
        "TRANSLATION_3": "We only rescued the believers who had fear of God.\n",
        "TRANSLATION_4": "And We rescued those who accepted faith and were pious.\n",
        "TRANSLATION_5": "And We saved those who believed and had Taqwa.\n",
        "TRANSLATION_6": "And We delivered those who believed and guarded (against evil).\n",
        "TRANSLATION_7": "And We delivered those who believed and were godfearing.\n",
        "TRANSLATION_8": "And We delivered those who believed and used to keep their duty to Allah.\n",
        "TRANSLATION_9": "We saved those who had attained to faith and were God-fearing.\n",
        "TRANSLATION_10": "And We delivered those who believed and had been fearing.\n",
        "TRANSLATION_11": "And We delivered those who had faith and were Godwary.\n",
        "TRANSLATION_12": "But We delivered those who believed and practised righteousness.\n",
        "TRANSLATION_13": "And We saved those who believed and used to fear Allah, keep their duty to Him and avoid evil.\n",
        "TRANSLATION_14": "and We saved those who believed and feared Allah.\n",
        "TRANSLATION_15": "And We saved those who believed and were righteous.\n",
        "TRANSLATION_16": "And We saved those who believed and used to fear Allah.\n",
        "TRANSLATION_17": "[41:18] And We delivered, from it, those who believed and feared, God.\n",
        "TRANSLATION_18": "(And We delivered those who believed) in Salih (and used to keep their duty to Allah) and used to ward off disbelief, idolatry and hamstringing the camel.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "27:53",
            "41:18",
            "10:63",
            "26:79",
            "107:6",
            "92:16",
            "26:81",
            "87:3",
            "8:21",
            "43:69"
        ],
        "BIBLE": [
            "writings:psalms:31:2",
            "writings:psalms:7:2",
            "prophets:isaiah:49:24",
            "prophets:ezekiel:3:21",
            "writings:job:34:5",
            "prophets:isaiah:49:25",
            "writings:psalms:25:20",
            "writings:job:27:2",
            "writings:psalms:71:2",
            "prophets:ezekiel:33:5"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:6:3",
            
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:1:13",
            "Sefer%20Yetzirah:5:2"
        ]
    }
}