{
    "VERSE": "41:24",
    "ARABIC": "فَإِن يَصْبِرُوا۟ فَٱلنَّارُ مَثْوًى لَّهُمْ وَإِن يَسْتَعْتِبُوا۟ فَمَا هُم مِّنَ ٱلْمُعْتَبِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "If they are steadfast, the Fire will still be their residence! If they ask for favour, no favour will be given.",
        "TRANSLATION_1": "Even if they are patient, their abode is Hell; and if they beg for favour, none will favour them.\n",
        "TRANSLATION_2": "In this state, whether they bear with patience (or not), Fire alone shall be their abode. And if they seek to make amends, they will not be allowed to do so.\n",
        "TRANSLATION_3": "Even if they were to exercise patience, their dwelling would still be hell fire. Even if they were to seek favors, they would receive none.\n",
        "TRANSLATION_4": "Then if they are patient, even then the fire is their home; and if they plead, none will listen to their pleading.\n",
        "TRANSLATION_5": "Then, if they bear the torment patiently, then the Fire is the home for them, and if they seek to please Allah, yet they are not of those who will ever be allowed to please Allah.\n",
        "TRANSLATION_6": "Then if they will endure, still the fire is their abode, and if they ask for goodwill, then are they not of those who shall be granted goodwill.\n",
        "TRANSLATION_7": "Then if they persist, the Fire shall be a lodging for them; and if they ask amends yet no amends shall be made to them.\n",
        "TRANSLATION_8": "And though they are resigned, yet the Fire is still their home; and if they ask for favour, yet they are not of those unto whom favour can be shown.\n",
        "TRANSLATION_9": "Even if they are patient, the Fire will still be their homes. And if they pray to be allowed to make amends, they will not be allowed to do so.\n",
        "TRANSLATION_10": "Then if they are patient, the Fire is their home, and if they seek to please Allah, they will not be of those who are allowed to please Allah.\n",
        "TRANSLATION_11": "Should they be patient, the Fire is their abode; and should they seek to propitiate [Allah], they will not be redeemed.\n",
        "TRANSLATION_12": "If, then, they have patience, the Fire will be a home for them! and if they beg to be received into favour, into favour will they not (then) be received.\n",
        "TRANSLATION_13": "Then, if they have patience, yet the Fire will be a home for them, and if they beg for to be excused, yet they are not of those who will ever be excused.\n",
        "TRANSLATION_14": "Even if they are patient the Fire shall still be their lodging, and if they seek pardon, they shall not be among those who are pardoned.\n",
        "TRANSLATION_15": "If they endure patiently, the Fire will be their residence; and if they make up excuses, they will not be pardoned.\n",
        "TRANSLATION_16": "So [even] if they are patient, the Fire is a residence for them; and if they ask to appease [Allah], they will not be of those who are allowed to appease.\n",
        "TRANSLATION_17": "[41:24] So if they endure, the chastisement, the Fire will [still] be their abode; and if they seek reconciliation, if they seek the satisfaction [of God], then they will not be among the reconciled, those deemed satisfactory [by God].\n",
        "TRANSLATION_18": "(And though they are resigned) in the Fire or not resigned, (yet the Fire is still their home) it will be the home of Safwan Ibn Umayyah and his host; (and if they ask for favour) if they ask to return to the life of the world, (yet they are not of those unto whom favour can be shown) they are not to return to the life of the world.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "41:24",
            "55:15",
            "3:131",
            "45:34",
            "51:45",
            "10:8",
            "5:37",
            "51:13",
            "23:104",
            "11:106"
        ],
        "BIBLE": [
            "prophets:ezekiel:39:26",
            "torah:deuteronomy:30:12",
            "prophets:jeremiah:24:8",
            "torah:genesis:40:14",
            "writings:psalms:89:30",
            "prophets:jeremiah:20:9",
            "prophets:ii%20samuel:23:5",
            "torah:leviticus:10:17",
            "torah:genesis:2:18",
            "torah:numbers:30:16"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:12",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:6:5"
        ]
    }
}