{
    "VERSE": "41:27",
    "ARABIC": "فَلَنُذِيقَنَّ ٱلَّذِينَ كَفَرُوا۟ عَذَابًا شَدِيدًا وَلَنَجْزِيَنَّهُمْ أَسْوَأَ ٱلَّذِى كَانُوا۟ يَعْمَلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "We will make those who are kafir suffer a severe punishment and repay them for the worst of what they did.",
        "TRANSLATION_1": "We shall make the disbelievers taste the severest punishment, and retribute them for the worst that they had done.\n",
        "TRANSLATION_2": "We shall certainly make these unbelievers taste a terrible chastisement and shall fully requite them according to the worst deeds that they committed.\n",
        "TRANSLATION_3": "We shall certainly make the unbelievers suffer severe torment and will punish them far worse than what they deserve for their deeds.\n",
        "TRANSLATION_4": "So We will indeed make the disbelievers taste the severe punishment, and indeed We will repay them for their worst deeds.\n",
        "TRANSLATION_5": "But surely, We shall cause those who disbelieve to taste a severe torment, and certainly, We shall requite them the worst of what they used to do.\n",
        "TRANSLATION_6": "Therefore We will most certainly make those who disbelieve taste a severe punishment, and We will most certainly reward them for the evil deeds they used to do.\n",
        "TRANSLATION_7": "So We shall let the unbelievers taste a terrible chastisement, and shall recompense them with the worst of what they were working.\n",
        "TRANSLATION_8": "But verily We shall cause those who disbelieve to taste an awful doom, and verily We shall requite them the worst of what they used to do.\n",
        "TRANSLATION_9": "Therefore, We will most certainly make those who are bent on denying the truth taste a severe punishment and We will most certainly requite them according to the worst of their deeds,\n",
        "TRANSLATION_10": "Wherefore We will surely cause those who disbelieve to taste a severe tor ment, and We will surely requite them the worst of that which they have been working.\n",
        "TRANSLATION_11": "We will surely make the faithless taste a severe punishment, and We will surely requite them by the worst of what they used to do.\n",
        "TRANSLATION_12": "But We will certainly give the Unbelievers a taste of a severe Penalty, and We will requite them for the worst of their deeds.\n",
        "TRANSLATION_13": "But surely, We shall cause those who disbelieve to taste a severe torment, and certainly, We shall requite them the worst of what they used to do.\n",
        "TRANSLATION_14": "We will let the unbelievers taste a terrible punishment, and recompense them with the worst of what they were doing.\n",
        "TRANSLATION_15": "We will make those who disbelieve taste an intense agony, and We will recompense them according to the worst of what they used to do.\n",
        "TRANSLATION_16": "But We will surely cause those who disbelieve to taste a severe punishment, and We will surely recompense them for the worst of what they had been doing.\n",
        "TRANSLATION_17": "[41:27] God, exalted be He, says regarding them: But verily We will make those who disbelieve taste a severe chastisement, and We will verily requite them the worst of what they used to do, in other words, [with] the worst requital for their deeds.\n",
        "TRANSLATION_18": "(But verily We shall cause those who disbelieve) Abu Jahl and his host (to taste an awful doom) in the life of the world, at Badr, (and verily We shall requite them the worst of what they used to do) the most evil of what they used to do in the life of the world.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "41:27",
            "7:165",
            "27:21",
            "42:26",
            "14:7",
            "58:15",
            "3:56",
            "35:7",
            "35:10",
            "16:34"
        ],
        "BIBLE": [
            "writings:ezra:10:3",
            "torah:leviticus:5:18",
            "torah:exodus:34:10",
            "torah:leviticus:5:10",
            "prophets:ezekiel:35:11",
            "prophets:isaiah:61:8",
            "torah:exodus:30:37",
            "prophets:jeremiah:25:14",
            "torah:leviticus:5:26",
            "prophets:ezekiel:39:26"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:2:2",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:3"
        ]
    }
}