{
    "VERSE": "41:3",
    "ARABIC": "كِتَٰبٌ فُصِّلَتْ ءَايَٰتُهُۥ قُرْءَانًا عَرَبِيًّا لِّقَوْمٍ يَعْلَمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "A Book whose verses have been demarcated for people who know as an Arabic Qur'an,",
        "TRANSLATION_1": "A Book whose verses have been distinguished and explained, a lucid discourse for people who understand,\n",
        "TRANSLATION_2": "a Book whose verses have been well-expounded; an Arabic Qur'an for those who have knowledge,\n",
        "TRANSLATION_3": "The verses of this Book have been fully expounded. It is a reading in the Arabic language for the people of knowledge.\n",
        "TRANSLATION_4": "A Book the verses of which are explained in detail, the Qur’an in Arabic for people of intellect.\n",
        "TRANSLATION_5": "A Book whereof the Ayat are explained in detail -- a Qur'an in Arabic for people who know.\n",
        "TRANSLATION_6": "A Book of which the verses are made plain, an Arabic Quran for a people who know:\n",
        "TRANSLATION_7": "A Book whose signs have been distinguished as an Arabic Koran for a people having knowledge,\n",
        "TRANSLATION_8": "A Scripture whereof the verses are expounded, a Lecture in Arabic for people who have knowledge,\n",
        "TRANSLATION_9": "a Book whose revelations are well expounded, an Arabic Quran for people who possess knowledge,\n",
        "TRANSLATION_10": "A Book whereof the verses are detailed: an Arabic Qur'an: for a people who know:\n",
        "TRANSLATION_11": "[this is] a Book whose signs have been elaborated for a people who have knowledge, an Arabic Quran,\n",
        "TRANSLATION_12": "A Book, whereof the verses are explained in detail;- a Qur'an in Arabic, for people who understand;-\n",
        "TRANSLATION_13": "A Book whereof the Verses are explained in detail; A Quran in Arabic for people who know.\n",
        "TRANSLATION_14": "A Book, the verses of which are distinguished, an Arabic Koran for a nation who know.\n",
        "TRANSLATION_15": "A Scripture whose Verses are detailed, a Quran in Arabic for people who know.\n",
        "TRANSLATION_16": "A Book whose verses have been detailed, an Arabic Qur'an for a people who know,\n",
        "TRANSLATION_17": "[41:3] A Book (kitābun, the predicate thereof) whose signs have been set out in detail, [whose signs have been] expounded through [various] rulings, stories and admonitions, as an Arabic Qur’ān (qur’ānan ‘arabiyyan, a circumstantial qualifier referring to kitābun, ‘a Book’, by qualifying it adjectivally) for a people (li-qawmin is semantically connected to fussilat, ‘set out in detail’) who have knowledge, [who] understand this [fact] — and they are the Arabs;\n",
        "TRANSLATION_18": "A scripture) He says: this Scripture is a revelation from the Beneficent, the Merciful unto Muhammad (pbuh) (whereof the verses) explaining the commands and prohibitions, the lawful and unlawful (are exposited, a Lecture in Arabic) Allah sent Gabriel with it to Muhammad (pbuh) in the Arabic usage (for people who have knowledge) for people who believe in Muhammad, Allah bless him and give peace, and in the Qur'an.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "41:3",
            "27:1",
            "15:1",
            "98:3",
            "12:2",
            "43:3",
            "6:105",
            "13:7",
            "39:28",
            "20:113"
        ],
        "BIBLE": [
            "prophets:jeremiah:4:22",
            "torah:exodus:33:16",
            "writings:nehemiah:8:8",
            "prophets:isaiah:61:9",
            "torah:deuteronomy:32:28",
            "torah:exodus:33:13",
            "writings:proverbs:19:25",
            "torah:deuteronomy:4:6",
            "writings:psalms:98:2",
            "prophets:ezekiel:12:15"
        ]
    }
}