{
    "VERSE": "41:32",
    "ARABIC": "نُزُلًا مِّنْ غَفُورٍ رَّحِيمٍ",
    "ENGLISH": {
        "TRANSLATION_0": "Hospitality from One who is Ever-Forgiving, Most Merciful.'",
        "TRANSLATION_1": "As a gift from the forgiving, ever-merciful (God).\"\n",
        "TRANSLATION_2": "This is by way of hospitality from Him Who is Most Forgiving, Most Merciful.”\n",
        "TRANSLATION_3": "a hospitable welcome from the All-forgiving and All-merciful God\".\n",
        "TRANSLATION_4": "“The hospitality of the Oft Forgiving, Most Merciful.”\n",
        "TRANSLATION_5": "An entertainment from the Oft-Forgiving, Most Merciful.\"\n",
        "TRANSLATION_6": "A provision from the Forgiving, the Merciful.\n",
        "TRANSLATION_7": "as hospitality from One All-forgiving, One All-compassionate.'\n",
        "TRANSLATION_8": "A gift of welcome from One Forgiving, Merciful.\n",
        "TRANSLATION_9": "as a rich provision from One who is ever forgiving and most merciful.\"\n",
        "TRANSLATION_10": "And entertainment from the Forgiving, the Merciful.\n",
        "TRANSLATION_11": "as a hospitality from One all-forgiving, all-merciful.’\n",
        "TRANSLATION_12": "A hospitable gift from one Oft-Forgiving, Most Merciful!\"\n",
        "TRANSLATION_13": "An entertainment from (Allah), the Oft-Forgiving, Most Merciful.\"\n",
        "TRANSLATION_14": "as hospitality from One, the Forgiving, the Most Merciful'\n",
        "TRANSLATION_15": "As Hospitality from an All-Forgiving, Merciful One.”\n",
        "TRANSLATION_16": "As accommodation from a [Lord who is] Forgiving and Merciful.\"\n",
        "TRANSLATION_17": "[41:32] as a hospitality, a pre-prepared provision (nuzulan is in the accusative because of an implied [preceding verb] ‘appointed [for you]’) from One Forgiving, Merciful’, namely, God.\n",
        "TRANSLATION_18": "(A gift of welcome) food and drink for you (from the Forgiving) Who forgives those who repent, (the Merciful) towards those who die repentant.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "41:32",
            "56:93",
            "4:106",
            "33:73",
            "41:2",
            "4:96",
            "12:98",
            "9:27",
            "15:49",
            "28:16"
        ],
        "BIBLE": [
            "writings:psalms:77:14",
            "torah:deuteronomy:8:6",
            "writings:psalms:50:23",
            "prophets:ezekiel:14:23",
            "prophets:jeremiah:3:21",
            "writings:proverbs:15:9",
            "prophets:jeremiah:42:3",
            "writings:daniel:9:9",
            "prophets:isaiah:55:7",
            "writings:psalms:116:5"
        ]
    }
}