{
    "VERSE": "41:33",
    "ARABIC": "وَمَنْ أَحْسَنُ قَوْلًا مِّمَّن دَعَآ إِلَى ٱللَّهِ وَعَمِلَ صَٰلِحًا وَقَالَ إِنَّنِى مِنَ ٱلْمُسْلِمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Who could say anything better than someone who summons to Allah and acts rightly and says, 'I am one of the Muslims'?",
        "TRANSLATION_1": "Whose word is better than his who calls to God and does the right, and says: \"I am of the obedient?\"\n",
        "TRANSLATION_2": "And who is fairer in speech than he who calls to Allah and acts righteously and says: “I am a Muslim”?\n",
        "TRANSLATION_3": "Who speaks better than one who invites human beings to God, acts righteously and says, \"I am a Muslim\".\n",
        "TRANSLATION_4": "And whose speech is better than one who calls towards his Lord and does righteous deeds, and says, “I am a Muslim.”?\n",
        "TRANSLATION_5": "And who is better in speech than he who invites to Allah, and does righteous deeds, and says: \"I am one of the Muslims.\"\n",
        "TRANSLATION_6": "And who speaks better than he who calls to Allah while he himself does good, and says: I am surely of those who submit?\n",
        "TRANSLATION_7": "And who speaks fairer than he who calls unto God and does righteousness and says, 'Surely I am of them that surrender'?\n",
        "TRANSLATION_8": "And who is better in speech than him who prayeth unto his Lord and doeth right, and saith: Lo! I am of those who are muslims (surrender unto Him).\n",
        "TRANSLATION_9": "Who speaks better than one who calls to God and does good works and says, \"I am surely of those who submit\"?\n",
        "TRANSLATION_10": "And who is better in speech than he who summoneth Unto Allah, and worketh righteously, and saith: verily I am one of the Muslims.\n",
        "TRANSLATION_11": "Who has a better call than him who summons to Allah and acts righteously and says, ‘Indeed I am one of the Muslims’?\n",
        "TRANSLATION_12": "Who is better in speech than one who calls (men) to Allah, works righteousness, and says, \"I am of those who bow in Islam\"?\n",
        "TRANSLATION_13": "And who is better in speech than he who [says: \"My Lord is Allah (believes in His Oneness),\" and then stands straight (acts upon His Order), and] invites (men) to Allah's (Islamic Monotheism), and does righteous deeds, and says: \"I am one of the Muslims.\"\n",
        "TRANSLATION_14": "And, who is better in saying than he who invites to Allah, does what is right, and says: 'Surely, I am of those who surrender'\n",
        "TRANSLATION_15": "And who is better in speech than someone who calls to God, and acts with integrity, and says, “I am of those who submit”?\n",
        "TRANSLATION_16": "And who is better in speech than one who invites to Allah and does righteousness and says, \"Indeed, I am of the Muslims.\"\n",
        "TRANSLATION_17": "[41:33] And who speaks better [words] — in other words, no one speaks better [words] — than him who summons [others] to God, by affirming His Oneness, and acts righteously and says, ‘Indeed I am one of those who submit [to God]’?\n",
        "TRANSLATION_18": "(And who is better in speech) who is wiser in speech; and it is also said that this means: who is better in inviting others (than him who prayeth unto his Lord) than he who invites people to believe in Allah's divine Oneness; i.e. Muhammad (pbuh) (and doeth right) and perform the obligations; it is also said that this verse was revealed about the muezzins. He says: who is better in inviting people than he who calls to Allah through the call to prayer and then does right, i.e. performs two units of prayer after the call to prayer, except for the call to prayer of Maghrib, (and saith: Lo! I am of those who surrender (unto Him)) I adhere to the religion of Islam and says: I believe truly. The reference here is to Muhammad (pbuh) and his Companions.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "41:33",
            "8:64",
            "2:138",
            "33:64",
            "39:57",
            "24:38",
            "72:22",
            "39:18",
            "21:29",
            "2:156"
        ],
        "BIBLE": [
            "torah:genesis:3:9",
            "writings:daniel:10:11",
            "torah:numbers:36:5",
            "prophets:jeremiah:7:13",
            "prophets:malachi:2:17",
            "writings:i%20chronicles:4:10",
            "torah:exodus:4:10",
            "torah:numbers:22:20",
            "writings:ecclesiastes:9:16",
            "prophets:isaiah:41:4"
        ]
    }
}