{
    "VERSE": "41:38",
    "ARABIC": "فَإِنِ ٱسْتَكْبَرُوا۟ فَٱلَّذِينَ عِندَ رَبِّكَ يُسَبِّحُونَ لَهُۥ بِٱلَّيْلِ وَٱلنَّهَارِ وَهُمْ لَا يَسْـَٔمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "If they grow arrogant, those who are with your Lord glorify Him night and day and never grow tired.",
        "TRANSLATION_1": "But if they become haughty (then remember) that those who are close to your Lord sing His praises night and day and do not grow weary of (doing so).\n",
        "TRANSLATION_2": "But if they wax proud (and persist in their attitude, it does not matter, for) the angels near-stationed to your Lord glorify Him night and day, and never grow weary.\n",
        "TRANSLATION_3": "However, if people are too proud to prostrate before God, let them know that God's other creatures glorify Him both day and night without fatigue.\n",
        "TRANSLATION_4": "So if these (disbelievers) be haughty, so (in any case) those (the angels) who are with your Lord say His Purity night and day, and they do not get weary. (Command of prostration # 11)\n",
        "TRANSLATION_5": "But if they are too proud, then there are those who are with your Lord glorify Him night and day, and never are they tired.\n",
        "TRANSLATION_6": "But if they are proud, yet those with your Lord glorify Him during the night and the day, and they are not tired.\n",
        "TRANSLATION_7": "And if they wax proud, yet those who are with thy Lord do glorify Him by night and day, and grow not weary.\n",
        "TRANSLATION_8": "But if they are too proud - still those who are with thy Lord glorify Him night and day, and tire not.\n",
        "TRANSLATION_9": "If they grow arrogant, [remember that] those who are with your Lord glorify Him night and day and never grow tired.\n",
        "TRANSLATION_10": "And if they grow stiff-necked, then verily those who are with thy Lord, hallow Him night and day, and they weary not.\n",
        "TRANSLATION_11": "But if they disdain [the worship of Allah], those who are near your Lord glorify Him night and day, and they are not wearied.\n",
        "TRANSLATION_12": "But is the (Unbelievers) are arrogant, (no matter): for in the presence of thy Lord are those who celebrate His praises by night and by day. And they never flag (nor feel themselves above it).\n",
        "TRANSLATION_13": "But if they are too proud (to do so), then there are those who are with your Lord (angels) glorify Him night and day, and never are they tired.\n",
        "TRANSLATION_14": "But if they become proud, those who are with your Lord exalt Him by day and night, and never grow weary.\n",
        "TRANSLATION_15": "But if they are too proud—those in the presence of your Lord praise Him night and day, and without ever tiring.\n",
        "TRANSLATION_16": "But if they are arrogant - then those who are near your Lord exalt Him by night and by day, and they do not become weary.\n",
        "TRANSLATION_17": "[41:38] But if they disdain, to prostrate to God alone, still those who are with your Lord, that is to say, still the angels, glorify, perform prayers to, Him night and day, and they tire not, they never weary [thereof].\n",
        "TRANSLATION_18": "(But if they are too proud) to accept faith and worship Allah alone (still those who are with thy Lord) i.e. the angels (glorify Him) i.e. pray to Allah (night and day, and tire not) be not not bored of worshipping Allah.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "41:38",
            "21:20",
            "2:274",
            "23:80",
            "7:206",
            "51:34",
            "21:42",
            "43:49",
            "11:83",
            "6:127"
        ],
        "BIBLE": [
            "prophets:ezekiel:38:14",
            "prophets:joel:2:27",
            "torah:exodus:34:9",
            "writings:nehemiah:4:16",
            "torah:numbers:14:14",
            "torah:numbers:22:34",
            "prophets:i%20samuel:20:12",
            "prophets:ezekiel:28:22",
            "prophets:joshua:3:3",
            "torah:deuteronomy:8:2"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:6:5"
        ]
    }
}