{
    "VERSE": "41:4",
    "ARABIC": "بَشِيرًا وَنَذِيرًا فَأَعْرَضَ أَكْثَرُهُمْ فَهُمْ لَا يَسْمَعُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "bringing good news and giving warning; but most of them have turned away and do not hear.",
        "TRANSLATION_1": "Announcing happy news and warnings. And yet most of them are averse and do not listen,\n",
        "TRANSLATION_2": "one bearing good news and warning. Yet most of them turned away and are not wont to give heed.\n",
        "TRANSLATION_3": "It contains glad news and warnings (for the people), but most of them have ignored it and do not listen.\n",
        "TRANSLATION_4": "Giving glad tidings and heralding warning; so most of them turned away, therefore they cannot listen (to the truth).\n",
        "TRANSLATION_5": "Giving glad tidings and warning, but most of them turn away, so they hear not.\n",
        "TRANSLATION_6": "A herald of good news and a warner, but most of them turn aside so they hear not.\n",
        "TRANSLATION_7": "good tidings to bear, and warning, but most of them have turned away, and do not give ear.\n",
        "TRANSLATION_8": "Good tidings and a warning. But most of them turn away so that they hear not.\n",
        "TRANSLATION_9": "proclaiming good news and a warning. Yet most of them turn away and so do not listen.\n",
        "TRANSLATION_10": "A bearer of glad tidings and a warner. Yet most of them turn aside, so that they hearken not.\n",
        "TRANSLATION_11": "a bearer of good news and a warner. But most of them turn away [from it], [and] so they do not listen.\n",
        "TRANSLATION_12": "Giving good news and admonition: yet most of them turn away, and so they hear not.\n",
        "TRANSLATION_13": "Giving glad tidings [of Paradise to the one who believes in the Oneness of Allah (i.e. Islamic Monotheism) and fears Allah much (abstains from all kinds of sins and evil deeds) and loves Allah much (performing all kinds of good deeds which He has ordained)], and warning (of punishment in the Hell Fire to the one who disbelieves in the Oneness of Allah), but most of them turn away, so they listen not.\n",
        "TRANSLATION_14": "It bears glad tidings and a warning, yet most of them turn away and do not listen.\n",
        "TRANSLATION_15": "Bringing good news, and giving warnings. But most of them turn away, so they do not listen.\n",
        "TRANSLATION_16": "As a giver of good tidings and a warner; but most of them turn away, so they do not hear.\n",
        "TRANSLATION_17": "[41:4] [containing] good tidings (bashīran is an adjective describing qur’ānan, ‘a Qur’ān’) and a warning. But most of them turn away so that they do not hear, in a way so as to accept [its message].\n",
        "TRANSLATION_18": "(Good tidings) of Paradise (and a warning) from hell; it gives good tidings of the Garden to those who believe in the Qur'an and warns from the Fire those who disbelieve in the Qur'an. (But most of them) the disbelievers of Mecca (turn away) from believing in Muhammad (pbuh) and in the Qur'an (so that they hear not) they do not believe in Muhammad (pbuh) or in the Qur'an nor do they obey Allah.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "41:4",
            "34:28",
            "54:39",
            "2:119",
            "11:2",
            "36:7",
            "74:36",
            "25:56",
            "54:36",
            "48:8"
        ],
        "BIBLE": [
            "prophets:ezekiel:3:20",
            "writings:ii%20chronicles:6:27",
            "prophets:joshua:23:15",
            "writings:esther:3:11",
            "prophets:i%20kings:8:36",
            "prophets:jeremiah:23:22",
            "torah:numbers:20:12",
            "writings:song%20of%20songs:5:6",
            "writings:psalms:60:6",
            "prophets:ezekiel:16:52"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:3:2",
            
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:3:3"
        ]
    }
}