{
    "VERSE": "41:41",
    "ARABIC": "إِنَّ ٱلَّذِينَ كَفَرُوا۟ بِٱلذِّكْرِ لَمَّا جَآءَهُمْ وَإِنَّهُۥ لَكِتَٰبٌ عَزِيزٌ",
    "ENGLISH": {
        "TRANSLATION_0": "Those who reject the Remembrance when it comes to them - truly it is a Mighty Book;",
        "TRANSLATION_1": "Those who reject the Reminder when it has come to them (should know) that it is a Book inviolate.\n",
        "TRANSLATION_2": "These are the ones who rejected the Good Counsel when it came to them, although it is certainly a Mighty Book.\n",
        "TRANSLATION_3": "The disbelievers (do not know) that the Quran which was sent to them is certainly a glorious Book.\n",
        "TRANSLATION_4": "Indeed those who denied the Remembrance when it came to them – they are truly ruined; and indeed it is an honourable Book.\n",
        "TRANSLATION_5": "Verily, those who disbelieved in the Reminder when it came to them. And verily, it is an honorable well-fortified respected Book.\n",
        "TRANSLATION_6": "Surely those who disbelieve in the reminder when it comes to them, and most surely it is a Mighty Book:\n",
        "TRANSLATION_7": "Those who disbelieve in the Remembrance when it comes to them -- and surely it is a Book Sublime;\n",
        "TRANSLATION_8": "Lo! those who disbelieve in the Reminder when it cometh unto them (are guilty), for lo! it is an unassailable Scripture.\n",
        "TRANSLATION_9": "Those who reject the Reminder [the Quran] when it comes to them [are the losers] -- truly it is a mighty Book:\n",
        "TRANSLATION_10": "Verily those who disbelieve in the Admonition when it cometh Unto them are themselves to blame. Verily it is a Book mighty.\n",
        "TRANSLATION_11": "Those who reject the Reminder when it comes to them... Indeed, it is an august Book:\n",
        "TRANSLATION_12": "Those who reject the Message when it comes to them (are not hidden from Us). And indeed it is a Book of exalted power.\n",
        "TRANSLATION_13": "Verily, those who disbelieved in the Reminder (i.e. the Quran) when it came to them (shall receive the punishment). And verily, it is an honourable respected Book (because it is Allah's Speech, and He has protected it from corruption, etc.). (See V. 15:9]\n",
        "TRANSLATION_14": "Those who disbelieve in the Remembrance when it comes to them and indeed this is a Mighty Book\n",
        "TRANSLATION_15": "Those who reject the Reminder when it has come to them—it is an invincible Book.\n",
        "TRANSLATION_16": "Indeed, those who disbelieve in the message after it has come to them... And indeed, it is a mighty Book.\n",
        "TRANSLATION_17": "[41:41] Truly those who disbelieve in the Remembrance — the Qur’ān — when it comes to them …, We will requite them — and truly it is an unassailable Book:\n",
        "TRANSLATION_18": "(Lo! those who disbelieve in the Reminder) i.e. the Qur'an (when it cometh unto them) when Muhammad (pbuh) took it to them; the reference here is to Abu Jahl and his host, ((are guilty)) and in the Hereafter they will have the Fire of Gehenna, (for lo! It) i.e. the Qur'an (is an unassailable Scripture) a glorious and noble Scripture.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "41:41",
            "23:49",
            "37:117",
            "68:51",
            "28:52",
            "15:6",
            "26:44",
            "2:129",
            "40:70",
            "29:9"
        ],
        "BIBLE": [
            "prophets:i%20kings:10:7",
            "prophets:i%20kings:20:13",
            "prophets:isaiah:47:11",
            "prophets:judges:19:30",
            "writings:ii%20chronicles:9:6",
            "writings:ecclesiastes:2:16",
            "writings:ii%20chronicles:25:16",
            "prophets:i%20samuel:16:18",
            "prophets:i%20samuel:19:20",
            "writings:daniel:2:29"
        ]
    }
}