{
    "VERSE": "41:44",
    "ARABIC": "وَلَوْ جَعَلْنَٰهُ قُرْءَانًا أَعْجَمِيًّا لَّقَالُوا۟ لَوْلَا فُصِّلَتْ ءَايَٰتُهُۥٓ ءَا۬عْجَمِىٌّ وَعَرَبِىٌّ قُلْ هُوَ لِلَّذِينَ ءَامَنُوا۟ هُدًى وَشِفَآءٌ وَٱلَّذِينَ لَا يُؤْمِنُونَ فِىٓ ءَاذَانِهِمْ وَقْرٌ وَهُوَ عَلَيْهِمْ عَمًى أُو۟لَٰٓئِكَ يُنَادَوْنَ مِن مَّكَانٍۭ بَعِيدٍ",
    "ENGLISH": {
        "TRANSLATION_0": "If We had made it a Qur'an in a foreign tongue they would have said, 'Why have its Signs not been made plain? What! A foreign language for an Arab?' Say: 'It is guidance and healing for people who have iman. Those who do not have iman have heaviness in their ears and for them it is blindness. Such people are being called from a very distant place.'",
        "TRANSLATION_1": "If We had made it a discourse in an obscure tongue, they would have said: \"Why were its revelations not expounded distinctly? A foreign tongue and an Arab (audience)?\" Say: \"For those who believe it is a guidance and a healing; but for those who do not believe it is a deafness in the ears, and a blindness. They are those one calls to from far away.\n",
        "TRANSLATION_2": "Had We revealed this as a non-Arabic Qur'an they would have said: “Why were its verses not clearly expounded? How strange, a non-Arabic scripture and an Arab audience!” Tell them: “It is a guidance and a healing to the believers. But to those who do not believe, it serves as a plug in their ears and a covering over their eyes. It is as if they are being called from a place far away.\n",
        "TRANSLATION_3": "Had We sent down this Quran in a non-Arabic language, they would have said, \"Why have its verses not been well expounded?\" Could a non-Arabic Book be revealed to an Arabic speaking person? (Muhammad), say, \"It is a guide and a cure for the believers. As for those who do not believe, they are deaf and blind. It is as though they had been called from a distant place\".\n",
        "TRANSLATION_4": "And if We had made it as a Qur’an in a foreign language they would have certainly said, “Why were its verses not explained in detail?” What! The Book in a foreign language, and the Prophet an Arab?! Proclaim (O dear Prophet Mohammed – peace and blessings be upon him), “It is a guidance and a cure for the believers”; and there is deafness in the ears of those who do not believe, and it is blindness upon them; as if they are being called from a place far away!\n",
        "TRANSLATION_5": "And if We had sent this as a Qur'an in a foreign language, they would have said: \"Why are not its verses explained in detail What! Not in Arabic nor an Arab\" Say: \"It is for those who believe, a guide and a cure. And as for those who disbelieve, there is heaviness in their ears, and it is blindness for them. They are called from a place far away.\"\n",
        "TRANSLATION_6": "And if We had made it a Quran in a foreign tongue, they would certainly have said: Why have not its communications been made clear? What! a foreign (tongue) and an Arabian! Say: It is to those who believe a guidance and a healing; and (as for) those who do not believe, there is a heaviness in their ears and it is obscure to them; these shall be called to from a far-off place.\n",
        "TRANSLATION_7": "If We had made it a barbarous Koran, they would have said, 'Why are its signs not distinguished? What, barbarous and Arabic?' Say: 'To the believers it is a guidance, and a healing; but those who believe not, in their ears is a heaviness, and to them it is a blindness; those -- they are called from a far place.'\n",
        "TRANSLATION_8": "And if We had appointed it a Lecture in a foreign tongue they would assuredly have said: If only its verses were expounded (so that we might understand)? What! A foreign tongue and an Arab? - Say unto them (O Muhammad): For those who believe it is a guidance and a healing; and as for those who disbelieve, there is a deafness in their ears, and it is blindness for them. Such are called to from afar.\n",
        "TRANSLATION_9": "Had We sent this as a Quran [in a language] other than Arabic, they would have said, \"Why are its verses not clearly explained? What! An Arab Prophet, and a scripture in a foreign tongue?\" Say, \"It is a guide and a healing to those who believe; but for those who do not believe, there is a deafness in their ears, and a covering over their eyes: they are [as it were] being called from a very distant place.\"\n",
        "TRANSLATION_10": "And had We made it a recital in a foreign tongue, they would have surely said: wherefore are the verses thereof not detailed? A foreign tongue and an Arab! Say thou: Unto those who have believed it is a guidance and a healing: and those who believe not, - in their ears there is a heaviness, and Unto them it is blindness. These are they who are cried Unto from a place far-off.\n",
        "TRANSLATION_11": "Had We made it a non-Arabic Quran, they would have said, ‘Why have not its signs been articulated?’ ‘What! A non-Arabian [scripture] and an Arabian [prophet]!?’ Say, ‘It is guidance and healing for those who have faith. As for those who are faithless, there is a deafness in their ears and it is lost to their sight: [to them it is as if] they were called from a distant place.’\n",
        "TRANSLATION_12": "Had We sent this as a Qur'an (in the language) other than Arabic, they would have said: \"Why are not its verses explained in detail? What! (a Book) not in Arabic and (a Messenger an Arab?\" Say: \"It is a Guide and a Healing to those who believe; and for those who believe not, there is a deafness in their ears, and it is blindness in their (eyes): They are (as it were) being called from a place far distant!\"\n",
        "TRANSLATION_13": "And if We had sent this as a Quran in a foreign language other than Arabic, they would have said: \"Why are not its Verses explained in detail (in our language)? What! (A Book) not in Arabic and (the Messenger) an Arab?\" Say: \"It is for those who believe, a guide and a healing. And as for those who disbelieve, there is heaviness (deafness) in their ears, and it (the Quran) is blindness for them. They are those who are called from a place far away (so they neither listen nor understand).\n",
        "TRANSLATION_14": "Had We made the Koran in a nonArabic (language) they would have said: 'If only its verses were distinguished! Why in (a) nonArabic (language, when theProphet is) an Arab' Say: 'To the believers it is a guidance and a healing. But to those who do not believe, there is a heaviness in their ears, to them it is blindness. They are those called from afar'\n",
        "TRANSLATION_15": "Had We made it a Quran in a foreign language, they would have said, “If only its verses were made clear.” Non-Arabic and an Arab? Say, “For those who believe, it is guidance and healing. But as for those who do not believe: there is heaviness in their ears, and it is blindness for them. These are being called from a distant place.”\n",
        "TRANSLATION_16": "And if We had made it a non-Arabic Qur'an, they would have said, \"Why are its verses not explained in detail [in our language]? Is it a foreign [recitation] and an Arab [messenger]?\" Say, \"It is, for those who believe, a guidance and cure.\" And those who do not believe - in their ears is deafness, and it is upon them blindness. Those are being called from a distant place.\n",
        "TRANSLATION_17": "[41:44] And had We made it, namely, the Remembrance, a non-Arabic Qur’ān, they would have said, ‘Why have its signs not been explained [clearly]?, so that we might understand them? What!, a Qur’ān [that is], nonArabic and an Arab, prophet?’ (this is an interrogative of denial [spoken] by them; read [a-a‘jamiyyun] pronouncing [both the first and] the second hamza, or by changing it into an alif and either writing it out in full or not). Say: ‘For those who believe it is guidance, from error, and a healing, from [the disease of] ignorance; but as for those who do not believe, there is a deafness in their ears, a heaviness, and so they are unable to hear it, and they are blind to it, so they are unable to comprehend it. Those, they are [as if they were being] called from a distant place’, that is to say, they are like one who is called from far away, unable to hear or comprehend what is being called out to him.\n",
        "TRANSLATION_18": "(And if We had appointed it a Lecture in a foreign tongue) if We had sent Gabriel with a Qur'an which is not in the Arabic usage (they) the disbelievers of Mecca (would assuredly have said: If only its verses were exposited (so that we might understand)? What! A foreign tongue and an Arab) what, a Scripture in a foreign language brought by an Arab man? (Say) to them, Muhammad: (For those who believe) Abu Bakr and his fellow Muslims (it) i.e. the Qur'an (is a guidance) from error (and a healing) it removes the blindness which is in the hearts of people; (and as for those who disbelieve) in Muhammad (pbuh) and in the Qur'an, i.e. Abu Jahl and his host, (there is a deafness in their ears, and it) i.e. the Qur'an (is blindness for them) a proof against them. (Such) the people of Mecca: Abu Jahl and his host (are called to from afar) it is as if they are called to believe in Allah's divine Oneness from high, above the sky.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "41:44",
            "20:113",
            "41:3",
            "34:52",
            "18:57",
            "34:31",
            "28:82",
            "31:7",
            "41:17",
            "25:12"
        ],
        "BIBLE": [
            "prophets:i%20samuel:3:9",
            "prophets:i%20samuel:6:2",
            "torah:genesis:22:14",
            "torah:genesis:21:12",
            "prophets:isaiah:4:1",
            "prophets:ezekiel:20:29",
            "writings:daniel:9:18",
            "prophets:isaiah:41:9",
            "torah:exodus:17:7",
            "prophets:jeremiah:14:13"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:2:1"
        ]
    }
}