{
    "VERSE": "41:46",
    "ARABIC": "مَّنْ عَمِلَ صَٰلِحًا فَلِنَفْسِهِۦ وَمَنْ أَسَآءَ فَعَلَيْهَا وَمَا رَبُّكَ بِظَلَّٰمٍ لِّلْعَبِيدِ",
    "ENGLISH": {
        "TRANSLATION_0": "Whoever acts rightly, it is to his own good. Whoever does evil, it is to his detriment. Your Lord does not wrong His slaves.",
        "TRANSLATION_1": "Whoever does good does so for himself, and whoever does wrong bears the guilt thereof. Your Lord does no wrong to His creatures.\n",
        "TRANSLATION_2": "Whoever does good, does so to his own benefit; and whoever does evil, will suffer its evil consequence. Your Lord does no wrong to His servants.\n",
        "TRANSLATION_3": "Whoever acts righteously does so for his own good and whoever commits evil does so against his soul. Your Lord is not unjust to His servants.\n",
        "TRANSLATION_4": "Whoever does good deeds, so it is for his own good, and whoever commits evil, so it is for his own harm; and your Lord does not at all oppress the bondmen.\n",
        "TRANSLATION_5": "Whosoever does righteous good deed, it is for himself; and whosoever does evil, it is against himself. And your Lord is not at all unjust to (His) servants.\n",
        "TRANSLATION_6": "Whoever does good, it is for his own soul, and whoever does evil, it is against it; and your Lord is not in the least unjust to the servants.\n",
        "TRANSLATION_7": "Whoso does righteousness, it is to his own gain, and whoso does evil, it is to his own loss. Thy Lord wrongs not His servants.\n",
        "TRANSLATION_8": "Whoso doeth right it is for his soul, and whoso doeth wrong it is against it. And thy Lord is not at all a tyrant to His slaves.\n",
        "TRANSLATION_9": "Whoever does what is just and right, does so for his own good; and whoever does evil, does so to his own detriment: and God is never in the least unjust to His creatures.\n",
        "TRANSLATION_10": "Whosoever worketh righteously it is for his soul, and whosoever worketh evil it is against it. And thine Lord is not an oppressor Unto His bondmen.\n",
        "TRANSLATION_11": "Whoever acts righteously, it is for [the benefit of] his own soul, and whoever does evil, it is to its detriment, and your Lord is not tyrannical to His servants.\n",
        "TRANSLATION_12": "Whoever works righteousness benefits his own soul; whoever works evil, it is against his own soul: nor is thy Lord ever unjust (in the least) to His Servants.\n",
        "TRANSLATION_13": "Whosoever does righteous good deed it is for (the benefit of) his ownself, and whosoever does evil, it is against his ownself, and your Lord is not at all unjust to (His) slaves.\n",
        "TRANSLATION_14": "He who does good does it for himself; and he who does evil does so against it. Your Lord never wrongs His worshipers.\n",
        "TRANSLATION_15": "Whoever acts righteously does so for himself; and whoever works evil does so against himself. Your Lord is not unjust to the servants.\n",
        "TRANSLATION_16": "Whoever does righteousness - it is for his [own] soul; and whoever does evil [does so] against it. And your Lord is not ever unjust to [His] servants.\n",
        "TRANSLATION_17": "[41:46] Whoever acts righteously, it is for [the good of] his own soul, that he acts [thus], and whoever does evil, it is to the detriment thereof, in other words, the harm consequent from his evildoing will [only] be to him. And your Lord is not [at all] a tyrant to His servants, that is, He is not One of injustice, as He, exalted be He, says: Surely God shall not wrong so much as the weight of an atom [Q. 4:40].\n",
        "TRANSLATION_18": "(Whoso doeth right) sincerely between him and his Lord (it is for his soul) the reward of that is for his soul, (and whoso doeth wrong it is against it) and whosoever associates partners with Allah, the punishment of this association ism will be against his own soul. (And thy Lord) Muhammad (is not at all a tyrant to His slaves) such that He would punish them for no crime.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "41:46",
            "45:15",
            "50:29",
            "6:104",
            "27:19",
            "10:108",
            "2:207",
            "34:50",
            "17:25",
            "10:40"
        ],
        "BIBLE": [
            "prophets:isaiah:53:11",
            "prophets:isaiah:57:12",
            "writings:proverbs:10:3",
            "torah:deuteronomy:17:2",
            "writings:proverbs:16:3",
            "prophets:ezekiel:18:20",
            "prophets:joshua:1:9",
            "torah:exodus:35:2",
            "prophets:ezekiel:22:27",
            "torah:exodus:31:15"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:1"
        ]
    }
}