{
    "VERSE": "41:47",
    "ARABIC": "إِلَيْهِ يُرَدُّ عِلْمُ ٱلسَّاعَةِ وَمَا تَخْرُجُ مِن ثَمَرَٰتٍ مِّنْ أَكْمَامِهَا وَمَا تَحْمِلُ مِنْ أُنثَىٰ وَلَا تَضَعُ إِلَّا بِعِلْمِهِۦ وَيَوْمَ يُنَادِيهِمْ أَيْنَ شُرَكَآءِى قَالُوٓا۟ ءَاذَنَّٰكَ مَا مِنَّا مِن شَهِيدٍ",
    "ENGLISH": {
        "TRANSLATION_0": "Knowledge of the Hour is referred to Him. And no fruit emerges from its husk, nor does any female get pregnant or give birth, without His knowledge. On the Day He calls out to them: 'Where are My associates?' they will say, 'We declare to you that none of us is a witness.'",
        "TRANSLATION_1": "He alone has knowledge of the Hour (of change): No fruit comes Out of its spathe, no female conceives or gives birth, but He has knowledge of it. The day He will call them (and ask): \"Where are the compeers (you ascribed to Me)?\" They will answer: \"We profess to You not one of us can vouch for them.\"\n",
        "TRANSLATION_2": "The knowledge of the Hour rests solely with Him. Not a fruit comes forth from its sheath, nor does any female conceive nor give birth to a child but it is in His knowledge. On that Day He will call out to them: “Where are those associates of Mine?” They will answer: “We have declared to You that none of us can bear witness to that.”\n",
        "TRANSLATION_3": "It is He who has the knowledge of the Hour of Doom and the fruits that will come out of their covering. He knows what the females conceive and deliver. On the day when the unbelievers will be asked, \"Where are the idols which you considered equal to God?,\" they will reply, \"We declare that none of us have seen them\".\n",
        "TRANSLATION_4": "The knowledge of the Last Day is directed towards Him; and no fruit comes out from its cover, and nor does any female conceive or give birth, but with His knowledge; and on the day when He will call out to them, “Where are My partners?” They will say, “We have told you that none among us can testify.”\n",
        "TRANSLATION_5": "To Him is referred the knowledge of the Hour. No fruit comes out of its sheath, nor does a female conceive nor brings forth (young), except by His knowledge. And on the Day when He will call unto them (saying): \"Where are My (so-called) partners\" They will say: \"We inform You that none of us bears witness to it!\"\n",
        "TRANSLATION_6": "To Him is referred the knowledge of the hour, and there come not forth any of the fruits from their coverings, nor does a female bear, nor does she give birth, but with His knowledge; and on the day when He shall call out to them, Where are (those whom you called) My associates? They shall say: We declare to Thee, none of us is a witness.\n",
        "TRANSLATION_7": "To Him is referred the knowledge of the Hour. Not a fruit comes forth from its sheath, no female bears or brings forth, save with His knowledge. Upon the day when He shall call to them, 'Where now are My associates?' they shall say, 'We proclaim to Thee, there is not a witness among us.\n",
        "TRANSLATION_8": "Unto Him is referred (all) knowledge of the Hour. And no fruits burst forth from their sheaths, and no female carrieth or bringeth forth but with His knowledge. And on the day when He calleth unto them: Where are now My partners? they will say: We confess unto Thee, not one of us is a witness (for them).\n",
        "TRANSLATION_9": "He alone has knowledge of the Hour [of Judgment]. And no fruit emerges from its husk, nor does any female become pregnant or give birth, without His knowledge. On the Day He will call out to them, \"Where are My associates?\" They will reply, \"We declare to You that none of us can bear witness to them:\"\n",
        "TRANSLATION_10": "Unto Himl is remitted the knowledge of the Hour. And not a fruit cometh forth from the knops thereof; neither doth a female bear or bring forth but with His knowledge. And on the Day whereon He will call Unto them: where are my associates. they will say: we protet Unto Thee, none of us is a witness thereof.\n",
        "TRANSLATION_11": "On Him devolves the knowledge of the Hour, and no fruit emerges from its covering and no female conceives or delivers except with His knowledge. On the day when He will call out to them, ‘Where are My ‘partners’?’ They will say, ‘We informed You that there is no witness amongst us.’\n",
        "TRANSLATION_12": "To Him is referred the Knowledge of the Hour (of Judgment: He knows all): No date-fruit comes out of its sheath, nor does a female conceive (within her womb) nor bring forth the Day that (Allah) will propound to them the (question), \"Where are the partners (ye attributed to Me?\" They will say, \"We do assure thee not one of us can bear witness!\"\n",
        "TRANSLATION_13": "(The learned men) refer to Him (Alone) the knowledge of the Hour. No fruit comes out of its sheath, nor does a female conceive (within her womb), nor brings forth (young), except by His Knowledge. And on the Day when He will call unto them (polytheists) (saying): \"Where are My (so-called) partners (whom you did invent)?\" They will say: \"We inform You that none of us bears witness to it (that they are Your partners)!\"\n",
        "TRANSLATION_14": "To Him is referred the knowledge of the Hour. No fruit sprouts forth from its sheath, no female conceives or is delivered, except with His Knowledge. On the Day He will call to them: 'Where then are My associates' they will reply: 'We proclaim to You that none of us can bear witness'\n",
        "TRANSLATION_15": "To Him is referred the knowledge of the Hour. No fruit emerges from its sheath, and no female conceives or delivers, except with His knowledge. And on the Day when He calls out to them, “Where are My associates?” They will say, “We admit to you, none of us is a witness.”\n",
        "TRANSLATION_16": "To him [alone] is attributed knowledge of the Hour. And fruits emerge not from their coverings nor does a female conceive or give birth except with His knowledge. And the Day He will call to them, \"Where are My 'partners'?\" they will say, \"We announce to You that there is [no longer] among us any witness [to that].\"\n",
        "TRANSLATION_17": "[41:47] To Him devolves [all] knowledge of the Hour — when it shall come to pass, none other than Him knows this. And no fruit (thamaratin: a variant reading has [the plural] thamarātin, ‘fruits’) emerges from its sheath, its receptacle (akmām, the plural of kimm), except with His knowledge, and no female bears [child] or delivers except with His knowledge. And on the day when He will call out to them, ‘Where [then] are My associates?’ they will say, ‘We proclaim to You, we now apprise You, that there is no witness amongst us’, that is, a witness [who can testify to the allegation] that You have an associate.\n",
        "TRANSLATION_18": "(Unto Him is referred (all) knowledge of the Hour) the knowledge of the time of the Hour is known only by Allah. (And no fruits burst forth from their sheaths, and no female carrieth) a child (or bringeth forth) or delivers her child (but with His knowledge) except with His leave, and no one knows this except Him. (And on the day when He calleth unto them) while they are in the Fire and say: (Where are now My partners) where are those whom you worshipped and claimed to be My partners? (they will say: We confess unto Thee) We have told you and let you know before: (not one of us is a witness (for them)) none of us will testify against himself that he had worshipped anyone other than you.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "41:47",
            "16:27",
            "16:84",
            "28:74",
            "28:62",
            "10:45",
            "30:14",
            "30:12",
            "30:55",
            "45:17"
        ],
        "BIBLE": [
            "torah:genesis:19:5",
            "writings:ii%20chronicles:19:6",
            "prophets:i%20samuel:11:3",
            "writings:ii%20chronicles:35:21",
            "prophets:judges:16:18",
            "prophets:i%20kings:9:13",
            "writings:esther:4:11",
            "prophets:isaiah:50:2",
            "prophets:isaiah:41:22",
            "writings:ecclesiastes:3:10"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:4:12",
            
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:11"
        ]
    }
}