{
    "VERSE": "41:52",
    "ARABIC": "قُلْ أَرَءَيْتُمْ إِن كَانَ مِنْ عِندِ ٱللَّهِ ثُمَّ كَفَرْتُم بِهِۦ مَنْ أَضَلُّ مِمَّنْ هُوَ فِى شِقَاقٍۭ بَعِيدٍ",
    "ENGLISH": {
        "TRANSLATION_0": "Say: 'What do you think? If it is from Allah and you reject it, who could be more misguided than someone entrenched in hostility to it?'",
        "TRANSLATION_1": "Say: \"Just think. If this is from God and you deny it, who will be in greater error than he who is in open dissent?\"\n",
        "TRANSLATION_2": "Tell them, (O Prophet): “Did you ever consider: if this Qur'an is indeed from Allah and you still deny it, who can be in greater error than he who goes far in fiercely opposing it?”\n",
        "TRANSLATION_3": "Say, \"Think, if the (Quran) is from God and you have rejected it, then who has gone farther astray than the one who has wandered far from the truth?\n",
        "TRANSLATION_4": "Proclaim (O dear Prophet Mohammed – peace and blessings be upon him), “What is your opinion – if this Qur’an is from Allah and then you deny it – so who is more astray than whoever is in extreme opposition?”\n",
        "TRANSLATION_5": "Say: \"Tell me, if it is from Allah, and you disbelieve in it Who is more astray than one who is in opposition far away.\"\n",
        "TRANSLATION_6": "Say: Tell me if it is from Allah; then you disbelieve in it, who is in greater error than he who is in a prolonged opposition?\n",
        "TRANSLATION_7": "Say: 'What think you? If it is from God, then you disbelieve in it, who is further astray than he who is in wide schism?'\n",
        "TRANSLATION_8": "Bethink you: If it is from Allah and ye reject it - Who is further astray than one who is at open feud (with Allah)?\n",
        "TRANSLATION_9": "Say to them, \"Have you considered, if this Quran is really from God and you still reject it, then who could be more astray than someone who has drifted far away from the truth?\"\n",
        "TRANSLATION_10": "Say thou: bethink ye! if it is really from Allah and then ye disbelieve therein, then who is further astray than one who is in schism far-off?\n",
        "TRANSLATION_11": "Say, ‘Tell me, if it is from Allah and you disbelieve in it, who will be more astray than those who are in extreme defiance.’\n",
        "TRANSLATION_12": "Say: \"See ye if the (Revelation) is (really) from Allah, and yet do ye reject it? Who is more astray than one who is in a schism far (from any purpose)?\"\n",
        "TRANSLATION_13": "Say: \"Tell me, if it (the Quran) is from Allah, and you disbelieve in it, who is more astray than one who is in opposition far away (from Allah's Right Path and His obedience).\n",
        "TRANSLATION_14": "Say: 'Think, if this (Koran) is indeed from Allah, and you disbelieve in it, who is further astray than he who is in a wide schism'\n",
        "TRANSLATION_15": "Say, “Have you considered? If it is from God and you reject it—who is further astray than he who is cutoff and alienated?”\n",
        "TRANSLATION_16": "Say, \"Have you considered: if the Qur'an is from Allah and you disbelieved in it, who would be more astray than one who is in extreme dissension?\"\n",
        "TRANSLATION_17": "[41:52] Say: ‘Consider [this]: if it, the Qur’ān, is from God, as the Prophet says, and you disbelieve in it, who — in other words, none — will be further astray than one who is in extreme defiance?’, of the truth (this [third person singular address] is used instead of ‘[who will be further astray] than you’ in order to point out their status [as disbelievers]).\n",
        "TRANSLATION_18": "Say to them, Muhammad, (Bethink you: If it is from Allah) if this Qur'an is from Allah (and ye reject it) saying that it is not from Allah, what will Allah do to you? (Who is further astray) from the Truth and guidance (than one who is at open feud) than one who is in opposition to the Truth and guidance; and it is also said that this means: than one who is in enmity with the Prophet (pbuh)? The reference here is to Abu Jahl.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "41:52",
            "22:12",
            "36:47",
            "4:167",
            "4:116",
            "28:49",
            "2:76",
            "34:8",
            "26:97",
            "3:160"
        ],
        "BIBLE": [
            "writings:i%20chronicles:12:18",
            "torah:genesis:16:13",
            "prophets:ezekiel:8:15",
            "writings:i%20chronicles:29:17",
            "torah:genesis:15:2",
            "prophets:isaiah:59:8",
            "torah:deuteronomy:1:28",
            "writings:psalms:40:6",
            "prophets:i%20kings:13:12",
            "writings:ii%20chronicles:20:20"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:13",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:5"
        ]
    }
}