{
    "VERSE": "41:6",
    "ARABIC": "قُلْ إِنَّمَآ أَنَا۠ بَشَرٌ مِّثْلُكُمْ يُوحَىٰٓ إِلَىَّ أَنَّمَآ إِلَٰهُكُمْ إِلَٰهٌ وَٰحِدٌ فَٱسْتَقِيمُوٓا۟ إِلَيْهِ وَٱسْتَغْفِرُوهُ وَوَيْلٌ لِّلْمُشْرِكِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Say: 'I am only a human being like yourselves. It is revealed to me that your god is One God. So be straight with Him and ask His forgiveness.' Woe to those who associate others with Him:",
        "TRANSLATION_1": "Say: \"I am a man like you, (but) it is revealed to me that your God is one God, so take the straight path to Him, and ask Him to forgive your sins. Woe to the idolaters\n",
        "TRANSLATION_2": "Tell them, (O Prophet): “I am only a human being like you. It is revealed to me that your God is One God; so direct yourselves straight to Him, and seek His forgiveness. Woe to those who associate others with Allah in His Divinity,\n",
        "TRANSLATION_3": "(Muhammad), say, \"I am a mere mortal like you. I have received a revelation that your Lord is the only One. So be up-right and obedient to Him and seek forgiveness from Him.\n",
        "TRANSLATION_4": "Proclaim (O dear Prophet Mohammed – peace and blessings be upon him), “Physically I am a human like you – I receive the divine revelation that your God is only One God, therefore be upright towards Him and seek forgiveness from Him”; and woe is to the polytheists. –\n",
        "TRANSLATION_5": "Say: \"I am only a human being like you. It is revealed to me that your God is One God, therefore take straight path to Him and obedience to Him, and seek forgiveness of Him. And woe to the polytheists.\n",
        "TRANSLATION_6": "Say: I am only a mortal like you; it is revealed to me that your Allah is one Allah, therefore follow the right way to Him and ask His forgiveness; and woe to the polytheists;\n",
        "TRANSLATION_7": "Say: 'I am only a mortal, like you are. To me it has been revealed that your God is One God; so go straight with Him, and ask for His forgiveness; and woe to the idolaters\n",
        "TRANSLATION_8": "Say (unto them O Muhammad): I am only a mortal like you. It is inspired in me that your Allah is One Allah, therefor take the straight path unto Him and seek forgiveness of Him. And woe unto the idolaters,\n",
        "TRANSLATION_9": "Say, \"I am only a human being like yourselves. It has been revealed to me that your God is One God. So take the straight path to Him and ask His forgiveness.\" Woe to those who associate others with Him,\n",
        "TRANSLATION_10": "Say thou: I am only a human being like Unto you: only it is revealed Unto me that your God is but One God, wherefore take the straight path Unto Him and seek forgiveness of Him. And woe be Unto the associators.\n",
        "TRANSLATION_11": "Say, ‘I am just a human like you. It has been revealed to me that your God is the One God. So worship Him single-mindedly and plead to Him for forgiveness.’ And woe to the polytheists\n",
        "TRANSLATION_12": "Say thou: \"I am but a man like you: It is revealed to me by Inspiration, that your Allah is one Allah: so stand true to Him, and ask for His Forgiveness.\" And woe to those who join gods with Allah,-\n",
        "TRANSLATION_13": "Say (O Muhammad SAW): \"I am only a human being like you. It is inspired in me that your Ilah (God) is One Ilah (God - Allah), therefore take Straight Path to Him (with true Faith Islamic Monotheism) and obedience to Him, and seek forgiveness of Him. And woe to Al-Mushrikun (the disbelievers in the Oneness of Allah, polytheists, idolaters, etc. - see V. 2:105).\n",
        "TRANSLATION_14": "Say (Prophet Muhammad): 'I am only a human like you, to whom it is revealed that your God is One God. Therefore be straight with Him and ask Him to forgive you. Woe to the idolaters,\n",
        "TRANSLATION_15": "Say, “I am only a human like you; it is inspired in me that your God is One God. So be upright towards Him, and seek forgiveness from Him.” And woe to the idolaters.\n",
        "TRANSLATION_16": "Say, O [Muhammad], \"I am only a man like you to whom it has been revealed that your god is but one God; so take a straight course to Him and seek His forgiveness.\" And woe to those who associate others with Allah -\n",
        "TRANSLATION_17": "[41:6] Say: ‘I am only a human being like you. It has been revealed to me [simply] that your God is One God. So be upright [in your conduct] before Him, through faith and obedience, and seek forgiveness from Him. And woe (waylun is an expression implying ‘chastisement’) to the idolaters,\n",
        "TRANSLATION_18": "(Say) to them, Muhammad: (I am only a mortal) a human being (like you. It is inspired in me) Gabriel was sent to me with the Qur'an to convey to you (that your God is One God) He has no son or partner, (therefore take the straight path unto Him) therefore turn to Him with repentance from idolatry (and seek 550 forgiveness of Him) and declare His divine Oneness. (And woe) severe punishment; it is also said this means: a river of puss and blood in Gehenna (unto the idolaters) Abu Jahl and his host,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "41:6",
            "18:110",
            "21:108",
            "16:51",
            "16:74",
            "38:65",
            "16:22",
            "2:194",
            "40:12",
            "23:34"
        ],
        "BIBLE": [
            "writings:daniel:10:11",
            "prophets:joshua:7:13",
            "prophets:i%20kings:13:26",
            "prophets:ii%20kings:23:17",
            "writings:daniel:10:19",
            "writings:ruth:3:10",
            "torah:genesis:44:4",
            "prophets:i%20kings:17:18",
            "prophets:ii%20kings:6:19",
            "writings:ezra:8:21"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:6:3"
        ]
    }
}