{
    "VERSE": "41:7",
    "ARABIC": "ٱلَّذِينَ لَا يُؤْتُونَ ٱلزَّكَوٰةَ وَهُم بِٱلْءَاخِرَةِ هُمْ كَٰفِرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "those who do not pay zakat and reject the Next World.",
        "TRANSLATION_1": "Who do not give a due share of their wealth for the welfare of others, and do not believe in the Hereafter.\n",
        "TRANSLATION_2": "who do not pay Zakah, and who deny the Hereafter.\n",
        "TRANSLATION_3": "Woe to the pagans, who do not pay zakat and have no faith in the life to come.\n",
        "TRANSLATION_4": "Those who do not give the obligatory charity, and who deny the Hereafter.\n",
        "TRANSLATION_5": "Those who give not the Zakah and they are disbelievers in the Hereafter.\n",
        "TRANSLATION_6": "(To) those who do not give poor-rate and they are unbelievers in the hereafter.\n",
        "TRANSLATION_7": "who pay not the alms, and disbelieve in the world to come.\n",
        "TRANSLATION_8": "Who give not the poor-due, and who are disbelievers in the Hereafter.\n",
        "TRANSLATION_9": "who do not pay the zakat, and who deny the Hereafter.\n",
        "TRANSLATION_10": "Who give not the poor-rate; and they! in the Hereafter, they are disbelievers.\n",
        "TRANSLATION_11": "—those who do not pay the zakat and disbelieve in the Hereafter.\n",
        "TRANSLATION_12": "Those who practise not regular Charity, and who even deny the Hereafter.\n",
        "TRANSLATION_13": "Those who give not the Zakat and they are disbelievers in the Hereafter.\n",
        "TRANSLATION_14": "who do not pay charity and disbelieve in the Everlasting Life.\n",
        "TRANSLATION_15": "Those who do not pay the alms; and regarding the Hereafter, they are disbelievers.\n",
        "TRANSLATION_16": "Those who do not give zakah, and in the Hereafter they are disbelievers.\n",
        "TRANSLATION_17": "[41:7] who do not pay the alms and who are disbelievers in the Hereafter ([the repetition of] hum, ‘they’, is for emphasis).\n",
        "TRANSLATION_18": "(Who give not the poor-due) they do not testify that there is no deity except Allah, (and who are disbelievers in) deniers of (the Hereafter) resurrection after death, and Paradise and hell.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "41:7",
            "27:3",
            "31:4",
            "23:4",
            "6:113",
            "23:74",
            "75:21",
            "77:17",
            "37:119",
            "37:108"
        ],
        "BIBLE": [
            "prophets:i%20kings:1:12",
            "writings:daniel:12:2",
            "writings:proverbs:13:8",
            "writings:proverbs:4:22",
            "prophets:isaiah:41:23",
            "prophets:ezekiel:47:9",
            "writings:psalms:96:13",
            "writings:nehemiah:2:10",
            "torah:genesis:19:8",
            "writings:psalms:90:2"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:3:5",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:3:7",
            "Sefer%20Yetzirah:4:8",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:3:6"
        ]
    }
}