{
    "VERSE": "41:8",
    "ARABIC": "إِنَّ ٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّٰلِحَٰتِ لَهُمْ أَجْرٌ غَيْرُ مَمْنُونٍ",
    "ENGLISH": {
        "TRANSLATION_0": "Those who have iman and do right actions will have a wage which never fails.",
        "TRANSLATION_1": "But those who believe and do the right, will have a continuing reward.\n",
        "TRANSLATION_2": "As to those who have faith and do good works, surely theirs shall be a never-ending reward.\n",
        "TRANSLATION_3": "The righteously striving believers will have a never-ending reward\".\n",
        "TRANSLATION_4": "Indeed for those who believed and did good deeds, is a limitless reward.\n",
        "TRANSLATION_5": "Truly, those who believe and do righteous good deeds, for them will be an endless reward that will never stop.\n",
        "TRANSLATION_6": "(As for) those who believe and do good, they shall surely have a reward never to be cut off.\n",
        "TRANSLATION_7": "Surely those who believe, and do righteous deeds shall have a wage unfailing.'\n",
        "TRANSLATION_8": "Lo! as for those who believe and do good works, for them is a reward enduring.\n",
        "TRANSLATION_9": "The ones who believe and perform good deeds shall have a reward which will never be withheld from them.\"\n",
        "TRANSLATION_10": "Verily those who believe and work righteous works - Unto them shall be a hire unceasing.\n",
        "TRANSLATION_11": "As for those who have faith and do righteous deeds, there will be an everlasting reward for them.\n",
        "TRANSLATION_12": "For those who believe and work deeds of righteousness is a reward that will never fail.\n",
        "TRANSLATION_13": "Truly, those who believe (in the Oneness of Allah Islamic Monotheism, and in His Messenger Muhammad SAW) and do righteous good deeds, for them will be an endless reward that will never stop (i.e. Paradise).\n",
        "TRANSLATION_14": "For those who believe and do good works is an enduring wage'\n",
        "TRANSLATION_15": "As for those who believe and do righteous deeds—for them is a reward uninterrupted.\n",
        "TRANSLATION_16": "Indeed, those who believe and do righteous deeds - for them is a reward uninterrupted.\n",
        "TRANSLATION_17": "[41:8] Indeed those who believe and perform righteous deeds shall have an enduring reward’, [one that is] unceasing.\n",
        "TRANSLATION_18": "(Lo! as for those who believe) in Muhammad (pbuh) and in the Qur'an (and do good works) and do acts of obedience between them and their Lord, (for them is a reward enduring) and undiminished; it is also said that the reward of their works will be registered after they reach old age or die and will be recorded undiminished until the Day of Judgement.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "41:8",
            "84:25",
            "95:6",
            "68:3",
            "12:57",
            "67:12",
            "18:30",
            "1:7",
            "52:35",
            "7:113"
        ],
        "BIBLE": [
            "writings:ecclesiastes:2:11",
            "prophets:isaiah:26:12",
            "writings:ii%20chronicles:31:20",
            "prophets:isaiah:57:12",
            "prophets:habakkuk:1:5",
            "prophets:zephaniah:3:5",
            "prophets:nahum:2:1",
            "prophets:isaiah:56:5",
            "torah:exodus:34:10",
            "prophets:isaiah:42:4"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:13",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:6:2"
        ]
    }
}