{
    "VERSE": "77:14",
    "ARABIC": "وَمَآ أَدْرَىٰكَ مَا يَوْمُ ٱلْفَصْلِ",
    "ENGLISH": {
        "TRANSLATION_0": "And what will teach you what the Day of Decision is?",
        "TRANSLATION_1": "How will you comprehend what the Day of Judgement is?\n",
        "TRANSLATION_2": "What do you know what the Day of Judgement is?\n",
        "TRANSLATION_3": "Would that you knew about the Day of Judgment!\n",
        "TRANSLATION_4": "And what do you know, what the Day of Decision is!\n",
        "TRANSLATION_5": "And what will explain to you what is the Day of Sorting Out\n",
        "TRANSLATION_6": "And what will make you comprehend what the day of decision is?\n",
        "TRANSLATION_7": "And what shall teach thee what is the Day of Decision?\n",
        "TRANSLATION_8": "And what will convey unto thee what the Day of Decision is! -\n",
        "TRANSLATION_9": "What will explain to you what the Day of Judgement is?\n",
        "TRANSLATION_10": "And what knowest thou what the Day of Decision is?\n",
        "TRANSLATION_11": "And what will show you what is the Day of Judgement!?\n",
        "TRANSLATION_12": "And what will explain to thee what is the Day of Sorting out?\n",
        "TRANSLATION_13": "And what will explain to you what is the Day of sorting out?\n",
        "TRANSLATION_14": "Would that you knew what the Day of Decision is!\n",
        "TRANSLATION_15": "And what will teach you what the Day of Decision is?\n",
        "TRANSLATION_16": "And what can make you know what is the Day of Judgement?\n",
        "TRANSLATION_17": "[77:14] And how would you know what the Day of Decision is? — emphasising the enormity of its terror.\n",
        "TRANSLATION_18": "(And what will convey unto thee) Muhammad (what the Day of Decision is!) How would you know about the Day of Decision?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "77:14",
            "77:13",
            "77:38",
            "37:21",
            "82:17",
            "78:17",
            "36:59",
            "28:65",
            "82:18",
            "85:2"
        ],
        "BIBLE": [
            "prophets:hosea:5:9",
            "torah:leviticus:23:28",
            "writings:daniel:10:14",
            "torah:leviticus:25:9",
            "prophets:i%20samuel:16:3",
            "prophets:ezekiel:45:20",
            "writings:job:10:2",
            "prophets:isaiah:38:19",
            "writings:psalms:39:5",
            "prophets:ezekiel:43:26"
        ]
    }
}