{
    "VERSE": "77:27",
    "ARABIC": "وَجَعَلْنَا فِيهَا رَوَٰسِىَ شَٰمِخَٰتٍ وَأَسْقَيْنَٰكُم مَّآءً فُرَاتًا",
    "ENGLISH": {
        "TRANSLATION_0": "Did We not place firmly embedded mountains in it, soaring high into the air, and give you sweet fresh water to drink?",
        "TRANSLATION_1": "And placed in it lofty and broad stablisers, and gave you sweet water to drink?\n",
        "TRANSLATION_2": "and did We not firmly fix towering mountains on it and give you sweet water to drink?\n",
        "TRANSLATION_3": "place on it high mountains and provide you with fresh water?\n",
        "TRANSLATION_4": "And We placed high mountains as anchors in it and gave you sweet water to drink.\n",
        "TRANSLATION_5": "And have placed therein fixed towers, and have given you Furat water\n",
        "TRANSLATION_6": "And made therein lofty mountains, and given you to drink of sweet water?\n",
        "TRANSLATION_7": "Set We not therein soaring mountains? Sated you with sweetest water?\n",
        "TRANSLATION_8": "And placed therein high mountains and given you to drink sweet water therein?\n",
        "TRANSLATION_9": "Have We not placed high mountains upon it and given you fresh water to drink?\n",
        "TRANSLATION_10": "And have placed therein firm and tall mountains and given you to drink of water fresh\n",
        "TRANSLATION_11": "and set in it lofty [and] firm mountains, and given you agreeable water to drink?\n",
        "TRANSLATION_12": "And made therein mountains standing firm, lofty (in stature); and provided for you water sweet (and wholesome)?\n",
        "TRANSLATION_13": "And have placed therein firm, and tall mountains; and have given you to drink sweet water?\n",
        "TRANSLATION_14": "Have We not placed high mountains upon it and filled you with sweet water?\n",
        "TRANSLATION_15": "And set on it lofty mountains, and given you pure water to drink?\n",
        "TRANSLATION_16": "And We placed therein lofty, firmly set mountains and have given you to drink sweet water.\n",
        "TRANSLATION_17": "[77:27] and set therein soaring mountains and give you sweet water to drink?\n",
        "TRANSLATION_18": "(And placed therein) in the earth (high mountains) firm mountains well-steeped in their locations (and given you) repudiators (to drink sweet water therein) and it is said fine water?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "77:27",
            "79:31",
            "86:6",
            "56:31",
            "69:11",
            "78:14",
            "20:55",
            "71:18",
            "80:25",
            "25:76"
        ],
        "BIBLE": [
            "writings:psalms:31:9",
            "writings:ezra:8:17",
            "prophets:judges:20:36",
            "prophets:joshua:1:3",
            "prophets:ezekiel:16:19",
            "prophets:joshua:15:19",
            "writings:job:22:7",
            "torah:deuteronomy:12:21",
            "torah:deuteronomy:26:9",
            "prophets:amos:4:6"
        ]
    }
}