{
    "VERSE": "77:31",
    "ARABIC": "لَّا ظَلِيلٍ وَلَا يُغْنِى مِنَ ٱللَّهَبِ",
    "ENGLISH": {
        "TRANSLATION_0": "but gives no shade or protection from the flames,",
        "TRANSLATION_1": "Neither shady nor protecting against the blazing Fire.\n",
        "TRANSLATION_2": "which neither provides (cooling) shade nor protection against the flames;\n",
        "TRANSLATION_3": "which neither gives shade nor protects one from the flames.\n",
        "TRANSLATION_4": "“Which neither gives shade, nor saves from the flame.”\n",
        "TRANSLATION_5": "Neither shady nor of any use against the fierce flame of the Fire.\"\n",
        "TRANSLATION_6": "Neither having the coolness of the shade nor availing against the flame.\n",
        "TRANSLATION_7": "unshading against the blazing flame\n",
        "TRANSLATION_8": "(Which yet is) no relief nor shelter from the flame.\n",
        "TRANSLATION_9": "affording neither shade, nor protection from the flames,\n",
        "TRANSLATION_10": "Neither shading nor availing against the flame.\n",
        "TRANSLATION_11": "neither shady nor of any avail against the flames.\n",
        "TRANSLATION_12": "(Which yields) no shade of coolness, and is of no use against the fierce Blaze.\n",
        "TRANSLATION_13": "Neither shading, nor of any use against the fierce flame of the Fire.\"\n",
        "TRANSLATION_14": "wherein there is neither shade, nor freeing from the blazing flames\n",
        "TRANSLATION_15": "Offering no shade, and unavailing against the flames.\n",
        "TRANSLATION_16": "[But having] no cool shade and availing not against the flame.\"\n",
        "TRANSLATION_17": "[77:31] which is neither shady, [neither] protective, [unable] to shade them from the heat of that Day, nor of any avail against, [nor] wards off from them anything of, the flame, the Fire.\n",
        "TRANSLATION_18": "((Which yet is) no relief) from the heat of the Fire (nor shelter from the flame) of the Fire.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "77:31",
            "56:30",
            "35:21",
            "56:92",
            "20:112",
            "6:106",
            "39:66",
            "53:53",
            "7:120",
            "22:12"
        ],
        "BIBLE": [
            "torah:leviticus:6:10",
            "writings:i%20chronicles:29:14",
            "prophets:isaiah:43:28",
            "prophets:i%20samuel:1:4",
            "writings:nehemiah:13:10",
            "writings:ii%20chronicles:32:29",
            "torah:leviticus:19:24",
            "writings:psalms:105:32",
            "torah:genesis:1:30",
            "torah:genesis:9:3"
        ]
    }
}