{
    "VERSE": "77:38",
    "ARABIC": "هَٰذَا يَوْمُ ٱلْفَصْلِ جَمَعْنَٰكُمْ وَٱلْأَوَّلِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "This is the Day of Decision. We have gathered you and the earlier peoples.",
        "TRANSLATION_1": "That will be the Day of Reckoning. Gathered will be (you) and the earlier (generations).\n",
        "TRANSLATION_2": "That is the Day of Judgement on which We have assembled you as well as all those who went before you.\n",
        "TRANSLATION_3": "That is the Day of Judgment. We will bring you together with all the ancient peoples.\n",
        "TRANSLATION_4": "This is the Day of Decision; We have gathered you and all the earlier men.\n",
        "TRANSLATION_5": "That will be a Day of Decision! We have brought you and the men of old together!\n",
        "TRANSLATION_6": "This is the day of decision: We have gathered you and those of yore.\n",
        "TRANSLATION_7": "This is the Day of Decision; We have joined you with the ancients;\n",
        "TRANSLATION_8": "This is the Day of Decision, We have brought you and the men of old together.\n",
        "TRANSLATION_9": "This is the Day of Judgement. We have assembled you all together with past generations.\n",
        "TRANSLATION_10": "This is the Day of Decision, We have assembled both ye and the ancients.\n",
        "TRANSLATION_11": "‘This is the Day of Judgement. We have brought you together with the former generations.\n",
        "TRANSLATION_12": "That will be a Day of Sorting out! We shall gather you together and those before (you)!\n",
        "TRANSLATION_13": "That will be a Day of Decision! We have brought you and the men of old together!\n",
        "TRANSLATION_14": "Such is the Day of Decision. We will gather you with the ancients.\n",
        "TRANSLATION_15": "This is the Day of Separation; We have gathered you, together with the ancients.\n",
        "TRANSLATION_16": "This is the Day of Judgement; We will have assembled you and the former peoples.\n",
        "TRANSLATION_17": "[77:38] ‘This is the Day of Decision. We have brought you, O deniers from this community, and the ancients together, [the ancients] from among the deniers before you, so that you will [all] be reckoned with and chastised together;\n",
        "TRANSLATION_18": "(This is the Day of Decision) regarding created beings, (We have brought you) disbelievers (and the men of old together) as well as those who were after you.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "77:38",
            "37:21",
            "77:14",
            "77:13",
            "36:59",
            "78:17",
            "38:53",
            "28:65",
            "85:2",
            "37:20"
        ],
        "BIBLE": [
            "torah:genesis:18:16",
            "prophets:judges:9:6",
            "writings:ezra:10:9",
            "prophets:isaiah:43:9",
            "prophets:joshua:6:3",
            "torah:leviticus:23:15",
            "torah:exodus:16:27",
            "writings:ii%20chronicles:6:5",
            "prophets:joshua:7:4",
            "torah:leviticus:23:14"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:4:8",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:4:11",
            "Sefer%20Yetzirah:3:6",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:6:1"
        ]
    }
}