{
    "VERSE": "77:41",
    "ARABIC": "إِنَّ ٱلْمُتَّقِينَ فِى ظِلَٰلٍ وَعُيُونٍ",
    "ENGLISH": {
        "TRANSLATION_0": "The people with taqwa will be amid shade and fountains",
        "TRANSLATION_1": "Those who take heed for themselves and fear God, will be amidst shade and springs of water,\n",
        "TRANSLATION_2": "Behold, today the God-fearing will be amidst shades and springs,\n",
        "TRANSLATION_3": "The pious ones will rest amid the shade, springs,\n",
        "TRANSLATION_4": "Indeed the pious are in shade and springs.\n",
        "TRANSLATION_5": "Verily, those who had Taqwa, shall be amidst shades and springs.\n",
        "TRANSLATION_6": "Surely those who guard (against evil) shall be amid shades and fountains,\n",
        "TRANSLATION_7": "Truly the godfearing shall dwell amid shades and fountains,\n",
        "TRANSLATION_8": "Lo! those who kept their duty are amid shade and fountains,\n",
        "TRANSLATION_9": "The righteous shall dwell amidst cool shades and fountains,\n",
        "TRANSLATION_10": "Verily the God-fearing shall be amid shades and springs,\n",
        "TRANSLATION_11": "Indeed the Godwary will be amid shades and springs\n",
        "TRANSLATION_12": "As to the Righteous, they shall be amidst (cool) shades and springs (of water).\n",
        "TRANSLATION_13": "Verily, the Muttaqun (pious - see V. 2:2) shall be amidst shades and springs.\n",
        "TRANSLATION_14": "Indeed, the cautious, shall live amid shades and fountains\n",
        "TRANSLATION_15": "The righteous will be amidst shades and fountains.\n",
        "TRANSLATION_16": "Indeed, the righteous will be among shades and springs\n",
        "TRANSLATION_17": "[77:41] Truly the God-fearing will be amid shades, that is, amid clusters of trees, since there is no sun therein from whose heat to seek shade, and springs, issuing forth with water,\n",
        "TRANSLATION_18": "Allah then explained the abode of the believers, saying: (Lo! those who kept their duty) those who ward off disbelief, idolatry and indecencies (are amid shade) amid the shade of trees (and fountains) plain, running water,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "77:41",
            "51:15",
            "15:45",
            "83:28",
            "44:52",
            "26:147",
            "56:30",
            "88:12",
            "11:37",
            "55:50"
        ],
        "BIBLE": [
            "prophets:ezekiel:18:9",
            "prophets:zechariah:8:8",
            "prophets:ezekiel:18:19",
            "prophets:ezekiel:37:5",
            "prophets:isaiah:41:18",
            "prophets:i%20samuel:21:6",
            "prophets:i%20samuel:26:16",
            "prophets:i%20samuel:25:34",
            "prophets:jeremiah:2:13",
            "prophets:ezekiel:21:12"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:14",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:12",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:3:2"
        ]
    }
}