{
    "VERSE": "77:46",
    "ARABIC": "كُلُوا۟ وَتَمَتَّعُوا۟ قَلِيلًا إِنَّكُم مُّجْرِمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "'Eat and enjoy yourselves for a little while. You are evildoers.'",
        "TRANSLATION_1": "Eat and enjoy for a while: You are certainly sinners.\n",
        "TRANSLATION_2": "Eat and enjoy yourselves for a while. Surely you are evil-doers.\n",
        "TRANSLATION_3": "(Disbelievers), eat and enjoy yourselves for a little while. You are certainly sinful ones.\n",
        "TRANSLATION_4": "“Eat and enjoy for a while – indeed you are guilty.”\n",
        "TRANSLATION_5": "Eat and enjoy yourselves for a little while. Verily, you are criminals.\n",
        "TRANSLATION_6": "Eat and enjoy yourselves for a little; surely you are guilty.\n",
        "TRANSLATION_7": "Eat and take your joy a little; you are sinners!'\n",
        "TRANSLATION_8": "Eat and take your ease (on earth) a little. Lo! ye are guilty.\n",
        "TRANSLATION_9": "Eat [your fill] and enjoy your life for a little while, O you who are lost in sin.\n",
        "TRANSLATION_10": "Eat and enjoy a little; verily ye are culprits.\n",
        "TRANSLATION_11": "‘Eat and enjoy a little! You are indeed guilty.’\n",
        "TRANSLATION_12": "(O ye unjust!) Eat ye and enjoy yourselves (but) a little while, for that ye are Sinners.\n",
        "TRANSLATION_13": "(O you disbelievers)! Eat and enjoy yourselves (in this worldly life) for a little while. Verily, you are the Mujrimun (polytheists, disbelievers, sinners, criminals, etc.).\n",
        "TRANSLATION_14": "Eat and enjoy yourselves a little, for you are sinners'\n",
        "TRANSLATION_15": "“Eat and enjoy yourselves a little; you are indeed criminals.”\n",
        "TRANSLATION_16": "[O disbelievers], eat and enjoy yourselves a little; indeed, you are criminals.\n",
        "TRANSLATION_17": "[77:46] ‘Eat and enjoy — addressing the disbelievers in this world — for a little, time, at the end of which comes   death — this is meant as a threat for them. Indeed you are guilty!’\n",
        "TRANSLATION_18": "(Eat) disbelievers (and take your ease a little) in the life of the world. (Lo! ye are guilty) you are idolaters and your destination in the Hereafter will be the Fire. This is a threat to them from Allah.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "77:46",
            "53:34",
            "11:122",
            "37:24",
            "23:114",
            "44:15",
            "69:42",
            "25:66",
            "85:13",
            "74:18"
        ],
        "BIBLE": [
            "torah:numbers:35:31",
            "torah:genesis:9:4",
            "writings:proverbs:10:17",
            "writings:proverbs:12:28",
            "torah:deuteronomy:12:23",
            "writings:proverbs:1:18",
            "writings:psalms:17:14",
            "writings:proverbs:10:16",
            "writings:lamentations:4:13",
            "writings:psalms:74:19"
        ]
    }
}