{
    "VERSE": "72:11",
    "ARABIC": "وَأَنَّا مِنَّا ٱلصَّٰلِحُونَ وَمِنَّا دُونَ ذَٰلِكَ كُنَّا طَرَآئِقَ قِدَدًا",
    "ENGLISH": {
        "TRANSLATION_0": "Among us there are some who are righteous and some who are other than that. We follow many different paths.",
        "TRANSLATION_1": "For some of us are upright and some otherwise: Surely we follow different ways.\n",
        "TRANSLATION_2": "and that “some of us are upright and some of us are otherwise for we follow widely divergent paths”;\n",
        "TRANSLATION_3": "As for us, some of us are righteous and others are not. We have all followed different ways.\n",
        "TRANSLATION_4": "‘And among us some are virtuous and some are the other type; we are split into several branches.’\n",
        "TRANSLATION_5": "`There are among us some that are righteous, and some the contrary; we are groups having different ways.'\n",
        "TRANSLATION_6": "And that some of us are good and others of us are below that: we are sects following different ways:\n",
        "TRANSLATION_7": "And some of us are the righteous, and some of us are otherwise; we are sects differing.\n",
        "TRANSLATION_8": "And among us there are righteous folk and among us there are far from that. We are sects having different rules.\n",
        "TRANSLATION_9": "Some of us are righteous, while others are not; we follow divergent paths.\n",
        "TRANSLATION_10": "And of us there are some righteous, and of us are some otherwise; we have been following very diverse.\n",
        "TRANSLATION_11": "Among us some are righteous and some are otherwise: we are various sects.\n",
        "TRANSLATION_12": "There are among us some that are righteous, and some the contrary: we follow divergent paths.\n",
        "TRANSLATION_13": "There are among us some that are righteous, and some the contrary; we are groups each having a different way (religious sect, etc.).\n",
        "TRANSLATION_14": "Some of us are righteous, but some are otherwise, we are sects that differ.\n",
        "TRANSLATION_15": "Some of us are righteous, but some of us are less than that; we follow divergent paths.\n",
        "TRANSLATION_16": "And among us are the righteous, and among us are [others] not so; we were [of] divided ways.\n",
        "TRANSLATION_17": "[72:11] And that among us some have become righteous, after having listened to the Qur’ān, and some of us are otherwise, that is to say, a folk who are unrighteous; we are [made up of] different sects, opposing groups, [some] submitters to God and [others] disbelievers.\n",
        "TRANSLATION_18": "(And among us there are righteous folk) those who believe in Allah's divine Oneness; these are those who believe in Muhammad (pbuh) and the Qur'an (and among us there are far from that) and among us there are disbelievers, the disbelieving jinn. (We are sects having different rules) we followed different religions, i.e. Judaism and Christianity, before believing in Allah.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "72:11",
            "21:82",
            "22:62",
            "31:30",
            "7:168",
            "21:29",
            "32:21",
            "55:62",
            "16:86",
            "36:74"
        ],
        "BIBLE": [
            "writings:job:34:27",
            "prophets:ii%20kings:6:19",
            "writings:proverbs:2:15",
            "prophets:i%20kings:16:21",
            "prophets:jeremiah:3:19",
            "prophets:judges:2:19",
            "prophets:i%20kings:18:18",
            "writings:proverbs:10:9",
            "writings:psalms:38:21",
            "writings:psalms:23:6"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:3"
        ]
    }
}