{
    "VERSE": "72:14",
    "ARABIC": "وَأَنَّا مِنَّا ٱلْمُسْلِمُونَ وَمِنَّا ٱلْقَٰسِطُونَ فَمَنْ أَسْلَمَ فَأُو۟لَٰٓئِكَ تَحَرَّوْا۟ رَشَدًا",
    "ENGLISH": {
        "TRANSLATION_0": "Some of us are Muslims and some are deviators. Those who have become Muslim are those who sought right guidance;",
        "TRANSLATION_1": "Some of us have come to submission, and some of us are iniquitous.'\" Those who have submitted have taken the right course;\n",
        "TRANSLATION_2": "and that “among us some are Muslims (Those who have submitted to Allah), and some of us are deviant. So those who became Muslims found the Right Course;\n",
        "TRANSLATION_3": "Some of us are Muslims and some of us have deviated from the Truth. Whoever has embraced Islam has followed the right guidance.\n",
        "TRANSLATION_4": "‘And that some among us are Muslims and some are the unjust; and whoever has accepted Islam – it is they who have thought rightly.’\n",
        "TRANSLATION_5": "`And of us some are Muslims, and of us some are Al-Qasitun. And whosoever has embraced Islam, then such have sought the right path.' \"\n",
        "TRANSLATION_6": "And that some of us are those who submit, and some of us are the deviators; so whoever submits, these aim at the right way:\n",
        "TRANSLATION_7": "And some of us have surrendered, and some of us have deviated. Those who have surrendered sought rectitude;\n",
        "TRANSLATION_8": "And there are among us some who have surrendered (to Allah) and there are among us some who are unjust. And whoso hath surrendered to Allah, such have taken the right path purposefully.\n",
        "TRANSLATION_9": "Some of us are obedient while others are wrongdoers; it is the obedient who have found the right path,\n",
        "TRANSLATION_10": "And of us some are Muslims, and of us some are deviators. Then whosoever hath embraced Islam - such have endeavoured after a Path of rectitude.\n",
        "TRANSLATION_11": "Among us some are Muslims and some of us are perverse.” ’ Those who submit [to Allah]—it is they who pursue rectitude.\n",
        "TRANSLATION_12": "Amongst us are some that submit their wills (to Allah), and some that swerve from justice. Now those who submit their wills - they have sought out (the path) of right conduct:\n",
        "TRANSLATION_13": "And of us some are Muslims (who have submitted to Allah, after listening to this Quran), and of us some are Al-Qasitun (disbelievers those who have deviated from the Right Path)'. And whosoever has embraced Islam (i.e. has become a Muslim by submitting to Allah), then such have sought the Right Path.\"\n",
        "TRANSLATION_14": "Some of us have surrendered (Muslims) and some of us have deviated. Those who surrendered sought the Right Path,\n",
        "TRANSLATION_15": "Among us are those who are submitting, and among us are the compromisers. As for those who have submitted—it is they who pursue rectitude.\n",
        "TRANSLATION_16": "And among us are Muslims [in submission to Allah], and among us are the unjust. And whoever has become Muslim - those have sought out the right course.\n",
        "TRANSLATION_17": "[72:14] And that among us some have submitted [to God], while some of us are unjust, tyrants — on account of their disbelief. So whoever has submitted [to God], those are the ones who seek right guidance.\n",
        "TRANSLATION_18": "(And there are among us some who have surrendered (to Allah)) and there are among us those who are sincere in their belief in Allah's divine Oneness; these are the ones who believed in Muhammad (pbuh) and the Qur'an (and there are among us some who are unjust) i.e. disobedient ones who have deviated from the Truth and guidance; and these are the disbelievers among the jinn. (And whoso hath surrendered to Allah) and whoever is sincere in his belief in Allah's divine Oneness, (such have taken the right path purposefully) such have intended goodness and the correct course.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "72:14",
            "37:116",
            "59:4",
            "8:13",
            "7:178",
            "26:94",
            "23:48",
            "72:10",
            "28:67",
            "3:82"
        ],
        "BIBLE": [
            "prophets:isaiah:40:14",
            "writings:job:27:2",
            "writings:job:34:5",
            "writings:ii%20chronicles:34:33",
            "prophets:ii%20kings:10:15",
            "prophets:zephaniah:3:15",
            "prophets:malachi:1:13",
            "writings:i%20chronicles:17:7",
            "writings:psalms:94:15",
            "torah:genesis:31:16"
        ]
    }
}