{
    "VERSE": "72:16",
    "ARABIC": "وَأَلَّوِ ٱسْتَقَٰمُوا۟ عَلَى ٱلطَّرِيقَةِ لَأَسْقَيْنَٰهُم مَّآءً غَدَقًا",
    "ENGLISH": {
        "TRANSLATION_0": "If only they were to go straight on the Path, We would give them abundant water to drink",
        "TRANSLATION_1": "(Say): \"If they keep to the right path We shall give them water in abundance to drink\n",
        "TRANSLATION_2": "If people were to keep firmly to the Right Way, We would have vouchsafed them abundant rain\n",
        "TRANSLATION_3": "Had they (jinn and mankind) remained steadfast in their religion (Islam), We would certainly have given them abundant water to drink\n",
        "TRANSLATION_4": "And proclaim (O dear Prophet Mohammed – peace and blessings be upon him), “I have received the divine revelation that ‘Had they remained upright on the straight path, We would have given them abundant water.’\n",
        "TRANSLATION_5": "If they had believed in Allah, and went on the way, We would surely have bestowed on them water in abundance.\n",
        "TRANSLATION_6": "And that if they should keep to the (right) way, We would certainly give them to drink of abundant water,\n",
        "TRANSLATION_7": "Would they but go straight on the way, We would give them to drink of water copious,\n",
        "TRANSLATION_8": "If they (the idolaters) tread the right path, We shall give them to drink of water in abundance\n",
        "TRANSLATION_9": "If they had followed the right path, We would have provided them with abundant rain --\n",
        "TRANSLATION_10": "And had they kept to the path surely We would have watered them with rain plenteous.\n",
        "TRANSLATION_11": "If they are steadfast on the path [of Allah], We shall provide them with abundant water,\n",
        "TRANSLATION_12": "(And Allah's Message is): \"If they (the Pagans) had (only) remained on the (right) Way, We should certainly have bestowed on them Rain in abundance.\n",
        "TRANSLATION_13": "If they (non-Muslims) had believed in Allah, and went on the Right Way (i.e. Islam) We should surely have bestowed on them water (rain) in abundance.\n",
        "TRANSLATION_14": "If they had followed the Path We would give to them abundant water to drink,\n",
        "TRANSLATION_15": "Had they kept true to the Path, We would have given them plenty water to drink.\n",
        "TRANSLATION_16": "And [Allah revealed] that if they had remained straight on the way, We would have given them abundant provision\n",
        "TRANSLATION_17": "[72:16] God, exalted be He, says [the following] about the Meccan disbelievers: And [it has been revealed to me] that if they (allaw: softened in place of the hardened form, its subject having been omitted, that is to say, annahum [law], which is a supplement to annahu istama‘a, ‘that [a company of jinn] listened’) adopt the [right] path, the path of submission [to God], We will give them abundant water to drink, plenteous [water], from the heaven — this was after rain had been withheld from them for seven years —\n",
        "TRANSLATION_18": "If they (the idolaters) tread the right path) the path of disbelief; and it is said: the path of Islam, (We shall give them to drink of water in abundance) We shall give them abundant wealth and a comfortable life\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "72:16",
            "78:14",
            "80:25",
            "23:18",
            "86:6",
            "56:31",
            "69:11",
            "23:95",
            "79:31",
            "26:173"
        ],
        "BIBLE": [
            "prophets:i%20kings:14:8",
            "prophets:i%20kings:8:36",
            "writings:ii%20chronicles:6:27",
            "prophets:i%20kings:19:21",
            "torah:exodus:21:29",
            "prophets:ezekiel:18:13",
            "prophets:i%20kings:3:6",
            "torah:numbers:20:24",
            "prophets:joshua:3:16",
            "torah:genesis:25:34"
        ]
    }
}