{
    "VERSE": "72:2",
    "ARABIC": "يَهْدِىٓ إِلَى ٱلرُّشْدِ فَـَٔامَنَّا بِهِۦ وَلَن نُّشْرِكَ بِرَبِّنَآ أَحَدًا",
    "ENGLISH": {
        "TRANSLATION_0": "It leads to right guidance so we have iman in it and will not associate anyone with our Lord.",
        "TRANSLATION_1": "Which guides to the right path; and we have come to believe in it, and will not associate any one with our Lord.\n",
        "TRANSLATION_2": "“We have indeed heard a wonderful Qur'an which guides to the Right Way; so we have come to believe in it, and we will not associate aught with Our Lord in His Divinity”;\n",
        "TRANSLATION_3": "which guides people to the right path and we believe in it. We shall never consider anyone equal to our Lord;\n",
        "TRANSLATION_4": "‘That guides to the path of goodness, we have therefore accepted faith in it; and we shall never ascribe anyone as a partner to our Lord.’\n",
        "TRANSLATION_5": "`It guides to the right path, and we have believed therein, and we shall never join anything with our Lord.'\n",
        "TRANSLATION_6": "Guiding to the right way, so we believe in it, and we will not set up any one with our Lord:\n",
        "TRANSLATION_7": "guiding to rectitude. We believe in it, and we will not associate with our Lord anyone.\n",
        "TRANSLATION_8": "Which guideth unto righteousness, so we believe in it and we ascribe no partner unto our Lord.\n",
        "TRANSLATION_9": "which guides to the right path; so we have believed in it and we will not associate anyone with our Lord,\n",
        "TRANSLATION_10": "Guiding Unto rectitude; wherefore we have believed therein, and we shall by no means associate with our Lord anyone.\n",
        "TRANSLATION_11": "which guides to rectitude. Hence, we have believed in it and we will never ascribe any partner to our Lord.\n",
        "TRANSLATION_12": "It gives guidance to the Right, and we have believed therein: we shall not join (in worship) any (gods) with our Lord.\n",
        "TRANSLATION_13": "It guides to the Right Path, and we have believed therein, and we shall never join (in worship) anything with our Lord (Allah).\n",
        "TRANSLATION_14": "that guides to the Right Path. We believe in it and we will not associate anyone with our Lord.\n",
        "TRANSLATION_15": "It guides to rectitude, so we have believed in it; and we will never associate anyone with our Lord.\n",
        "TRANSLATION_16": "It guides to the right course, and we have believed in it. And we will never associate with our Lord anyone.\n",
        "TRANSLATION_17": "[72:2] which guides to rectitude, to faith and propriety. Therefore we believe in it and we will never, after this day, associate anyone with our Lord.\n",
        "TRANSLATION_18": "699 (Which guideth unto righteousness) which guides to the Truth, guidance and right course, i.e. to \"there is no deity except Allah\", (so we believe in it) we believe in Muhammad (pbuh) and we believe in the Qur'an (and we ascribe unto our Lord no partner) here meaning the devil.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "72:2",
            "72:20",
            "18:38",
            "72:10",
            "53:42",
            "79:19",
            "94:8",
            "36:27",
            "20:70",
            "15:98"
        ],
        "BIBLE": [
            "torah:deuteronomy:26:11",
            "torah:numbers:20:12",
            "prophets:judges:18:10",
            "prophets:amos:9:15",
            "prophets:joshua:23:15",
            "torah:numbers:11:18",
            "prophets:ezekiel:36:28",
            "torah:numbers:18:24",
            "torah:deuteronomy:16:17",
            "torah:deuteronomy:9:23"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:13",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:5"
        ]
    }
}