{
    "VERSE": "72:20",
    "ARABIC": "قُلْ إِنَّمَآ أَدْعُوا۟ رَبِّى وَلَآ أُشْرِكُ بِهِۦٓ أَحَدًا",
    "ENGLISH": {
        "TRANSLATION_0": "Say: 'I call only upon my Lord and do not associate anyone else with Him.'",
        "TRANSLATION_1": "Say: \"I call on my Lord alone and I do not associate any one with Him.\"\n",
        "TRANSLATION_2": "Say, (O Prophet): “I call on my Lord alone, and I do not associate aught with Him in His Divinity.”\n",
        "TRANSLATION_3": "(Muhammad), say, \"I worship only my Lord and do not consider anyone equal to Him\".\n",
        "TRANSLATION_4": "Say (O dear Prophet Mohammed – peace and blessings be upon him), “I worship only Allah, and I do not ascribe any partner to Him.”\n",
        "TRANSLATION_5": "Say: \"I invoke only my Lord, and I associate none as partners along with Him.\"\n",
        "TRANSLATION_6": "Say: I only call upon my Lord, and I do not associate any one with Him.\n",
        "TRANSLATION_7": "Say: 'I call only upon my Lord, and I do not associate with Him anyone.\n",
        "TRANSLATION_8": "Say (unto them, O Muhammad): I pray unto Allah only, and ascribe unto Him no partner.\n",
        "TRANSLATION_9": "Say, \"I call only upon my Lord and do not associate anyone else with Him.\"\n",
        "TRANSLATION_10": "Say thou: I simply call upon Allah, and I associate not with Him any-one.\n",
        "TRANSLATION_11": "Say, ‘I pray only to my Lord, and I do not ascribe any partner to Him.’\n",
        "TRANSLATION_12": "Say: \"I do no more than invoke my Lord, and I join not with Him any (false god).\"\n",
        "TRANSLATION_13": "Say (O Muhammad SAW): \"I invoke only my Lord (Allah Alone), and I associate none as partners along with Him.\"\n",
        "TRANSLATION_14": "Say: 'I supplicate only to my Lord and I do not associate any with Him'\n",
        "TRANSLATION_15": "Say, “I pray only to my Lord, and I never associate anyone with Him.”\n",
        "TRANSLATION_16": "Say, [O Muhammad], \"I only invoke my Lord and do not associate with Him anyone.\"\n",
        "TRANSLATION_17": "[72:20] He said, in response to the disbelievers saying, ‘Abandon this affair of yours!’ (a variant reading [for qāla, ‘he said’], has qul, ‘Say:’) ‘I invoke only my Lord, as God, and I do not associate anyone with Him’.\n",
        "TRANSLATION_18": "(Say (unto them, Muhammad): I pray unto Allah only) I worship Allah only and call people to worship none but Him, (and ascribe unto Him no partner.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "72:20",
            "18:38",
            "44:20",
            "72:2",
            "32:15",
            "23:59",
            "37:99",
            "38:35",
            "93:3",
            "36:25"
        ],
        "BIBLE": [
            "prophets:i%20samuel:3:17",
            "prophets:jeremiah:14:13",
            "prophets:ii%20kings:20:19",
            "prophets:jeremiah:42:2",
            "writings:job:1:8",
            "prophets:isaiah:39:8",
            "writings:i%20chronicles:29:10",
            "prophets:ii%20kings:19:15",
            "writings:daniel:10:19",
            "writings:job:2:3"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:6:3"
        ]
    }
}