{
    "VERSE": "72:21",
    "ARABIC": "قُلْ إِنِّى لَآ أَمْلِكُ لَكُمْ ضَرًّا وَلَا رَشَدًا",
    "ENGLISH": {
        "TRANSLATION_0": "Say: 'I possess no power to do you harm or to guide you right.'",
        "TRANSLATION_1": "Say: \"Neither is your loss within my power nor bringing you to guidance.\"\n",
        "TRANSLATION_2": "Say: “Surely neither it is in my power to hurt you nor to bring you to the Right Way.”\n",
        "TRANSLATION_3": "Say, \"I do not possess any power to harm or benefit you\".\n",
        "TRANSLATION_4": "Proclaim (O dear Prophet Mohammed – peace and blessings be upon him), “I am not the master of any harm or benefit for you.”\n",
        "TRANSLATION_5": "Say: \"It is not in my power to cause you harm, or to bring you to the right path.\"\n",
        "TRANSLATION_6": "Say: I do not control for you evil or good.\n",
        "TRANSLATION_7": "Say: 'Surely I possess no power over you, either for hurt or for rectitude.'\n",
        "TRANSLATION_8": "Say: Lo! I control not hurt nor benefit for you.\n",
        "TRANSLATION_9": "Say, \"It is not in my power to cause you either harm or good?\"\n",
        "TRANSLATION_10": "Say thou: 'verily own not for you power of hurt nor of benefit\n",
        "TRANSLATION_11": "Say, ‘I have no power to bring you any harm or good [of my own accord].’\n",
        "TRANSLATION_12": "Say: \"It is not in my power to cause you harm, or to bring you to right conduct.\"\n",
        "TRANSLATION_13": "Say: \"It is not in my power to cause you harm, or to bring you to the Right Path.\"\n",
        "TRANSLATION_14": "Say: 'Indeed, I possess no power over you, either for harm or for guidance'\n",
        "TRANSLATION_15": "Say, “It is not in my power to harm you, nor to bring you to right conduct.”\n",
        "TRANSLATION_16": "Say, \"Indeed, I do not possess for you [the power of] harm or right direction.\"\n",
        "TRANSLATION_17": "[72:21] Say: ‘I truly have no power to bring you any harm, to lead [you] astray, or any guidance’, any good.\n",
        "TRANSLATION_18": "Say) Muhammad, to the people of Mecca: (Lo! I control not hurt) I cannot drive away from you harm, forsakenness or chastisement (nor benefit for you) nor can I give you benefit and guidance.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "72:21",
            "71:9",
            "20:89",
            "74:14",
            "72:10",
            "20:118",
            "72:14",
            "77:36",
            "72:20",
            "7:21"
        ],
        "BIBLE": [
            "torah:genesis:31:29",
            "torah:genesis:26:29",
            "prophets:isaiah:59:8",
            "prophets:zephaniah:3:5",
            "torah:genesis:24:27",
            "torah:genesis:24:48",
            "torah:genesis:24:12",
            "prophets:joshua:1:7",
            "torah:numbers:27:7",
            "writings:job:34:6"
        ]
    }
}