{
    "VERSE": "72:22",
    "ARABIC": "قُلْ إِنِّى لَن يُجِيرَنِى مِنَ ٱللَّهِ أَحَدٌ وَلَنْ أَجِدَ مِن دُونِهِۦ مُلْتَحَدًا",
    "ENGLISH": {
        "TRANSLATION_0": "Say: 'No one can protect me from Allah and I will never find any refuge apart from Him -",
        "TRANSLATION_1": "Say: \"No one can save me from God, nor can I find a place of refuge apart from Him,\n",
        "TRANSLATION_2": "Say: “None can protect me from Allah, nor can I find a refuge apart from Him.\n",
        "TRANSLATION_3": "Say, \"No one can protect me from God, nor can I find any place of refuge but with him.\n",
        "TRANSLATION_4": "Say, “No one will ever save me from Allah, and other than Him, I will not find any refuge.”\n",
        "TRANSLATION_5": "Say: \"None can protect me from Allah's punishment, nor can I find refuge except in Him.\"\n",
        "TRANSLATION_6": "Say: Surely no one can protect me against Allah, nor can I find besides Him any place of refuge:\n",
        "TRANSLATION_7": "Say: 'From God shall protect me not anyone, and I shall find, apart from Him, no refuge,\n",
        "TRANSLATION_8": "Say: Lo! none can protect me from Allah, nor can I find any refuge beside Him\n",
        "TRANSLATION_9": "Say, \"Surely no one can protect me against God, nor can I find besides Him any place of refuge.\n",
        "TRANSLATION_10": "Say thou: 'verily none can protect me from Allah, nor can I find beside Him any refuge.\n",
        "TRANSLATION_11": "Say, ‘Neither can anyone shelter me from Allah, nor can I find any refuge besides Him.\n",
        "TRANSLATION_12": "Say: \"No one can deliver me from Allah (If I were to disobey Him), nor should I find refuge except in Him,\n",
        "TRANSLATION_13": "Say (O Muhammad SAW): \"None can protect me from Allah's punishment (if I were to disobey Him), nor should I find refuge except in Him.\n",
        "TRANSLATION_14": "Say: 'None shall protect me from Allah, and other than Him, I will find no refuge,\n",
        "TRANSLATION_15": "Say, “No one can protect me from God, and I will not find any refuge except with Him.\n",
        "TRANSLATION_16": "Say, \"Indeed, there will never protect me from Allah anyone [if I should disobey], nor will I find in other than Him a refuge.\n",
        "TRANSLATION_17": "[72:22] Say: ‘Indeed none shall protect me from God, from His chastisement, were I to disobey Him, and I shall never find besides Him, that is, other than Him, any refuge.\n",
        "TRANSLATION_18": "(Say) to them, Muhammad: (Lo! none can protect me from Allah) from Allah's chastisement if I disobey Him, (nor can I find any refuge beside Him) nor can I find any escape or hiding place from Allah's chastisement if I disobey Him.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "72:22",
            "36:74",
            "53:58",
            "72:7",
            "21:98",
            "112:1",
            "26:93",
            "27:43",
            "18:43",
            "21:29"
        ],
        "BIBLE": [
            "writings:psalms:7:2",
            "prophets:jeremiah:14:13",
            "prophets:judges:7:7",
            "torah:genesis:20:11",
            "writings:job:18:21",
            "writings:psalms:31:3",
            "torah:deuteronomy:33:29",
            "torah:deuteronomy:12:5",
            "writings:psalms:18:20",
            "prophets:ii%20samuel:22:20"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:1:12",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:4:12"
        ]
    }
}