{
    "VERSE": "72:26",
    "ARABIC": "عَٰلِمُ ٱلْغَيْبِ فَلَا يُظْهِرُ عَلَىٰ غَيْبِهِۦٓ أَحَدًا",
    "ENGLISH": {
        "TRANSLATION_0": "He is the Knower of the Unseen, and does not divulge His Unseen to anyone -",
        "TRANSLATION_1": "He is the knower of the Unknown, and He does not divulge His secret to any one\n",
        "TRANSLATION_2": "He is the Knower of the Unseen, and He does not disclose His Unseen to anyone\n",
        "TRANSLATION_3": "He knows the unseen and He does not allow anyone to know His secrets except those of His Messengers whom He chooses.\n",
        "TRANSLATION_4": "The All Knowing of all the hidden does not give anyone the control over His secrets.\n",
        "TRANSLATION_5": "The All-Knower of the Unseen, and He reveals to none His Unseen.\"\n",
        "TRANSLATION_6": "The Knower of the unseen! so He does not reveal His secrets to any,\n",
        "TRANSLATION_7": "Knower He of the Unseen, and He discloses not His Unseen to anyone,\n",
        "TRANSLATION_8": "(He is) the Knower of the Unseen, and He revealeth unto none His secret,\n",
        "TRANSLATION_9": "He alone has knowledge of what is hidden. He reveals this to none,\n",
        "TRANSLATION_10": "He is the Knower of the unseen, and He discloseth not His unseen Unto anyone.\n",
        "TRANSLATION_11": "Knower of the Unseen, He does not disclose His [knowledge of the] Unseen to anyone,\n",
        "TRANSLATION_12": "He (alone) knows the Unseen, nor does He make any one acquainted with His Mysteries,-\n",
        "TRANSLATION_13": "(He Alone) the All-Knower of the Gha'ib (unseen), and He reveals to none His Gha'ib (unseen).\"\n",
        "TRANSLATION_14": "He is the Knower of the Unseen and does not disclose His Unseen to anyone,\n",
        "TRANSLATION_15": "The Knower of the Invisible; He does not disclose His Invisible to anyone.\n",
        "TRANSLATION_16": "[He is] Knower of the unseen, and He does not disclose His [knowledge of the] unseen to anyone\n",
        "TRANSLATION_17": "[72:26] Knower [He is] of the Unseen, what is hidden from servants, and He does not disclose, He [does not] reveal, His Unseen to anyone, from mankind,\n",
        "TRANSLATION_18": "(He is) the knower of the Unseen) He knows when the chastisement will happen, (and He revealeth unto none His secret,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "72:26",
            "89:25",
            "69:47",
            "90:5",
            "23:92",
            "68:47",
            "52:41",
            "90:7",
            "53:35",
            "81:24"
        ],
        "BIBLE": [
            "writings:psalms:25:14",
            "prophets:ezekiel:35:11",
            "writings:daniel:5:15",
            "writings:job:13:23",
            "writings:job:10:2",
            "prophets:joshua:7:19",
            "writings:daniel:4:4",
            "prophets:isaiah:43:19",
            "writings:psalms:135:18",
            "writings:psalms:115:8"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:1:12",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:2:2",
            "Sefer%20Yetzirah:1:11"
        ]
    }
}