{
    "VERSE": "72:3",
    "ARABIC": "وَأَنَّهُۥ تَعَٰلَىٰ جَدُّ رَبِّنَا مَا ٱتَّخَذَ صَٰحِبَةً وَلَا وَلَدًا",
    "ENGLISH": {
        "TRANSLATION_0": "He - exalted be the Majesty of our Lord ! - has neither wife nor son.",
        "TRANSLATION_1": "Exalted is the glory of our Lord; He has neither wife nor son.\n",
        "TRANSLATION_2": "and that “He – exalted be His Majesty – has not taken to Himself either a wife or a son”;\n",
        "TRANSLATION_3": "our Lord is too exalted to have either a wife or son.\n",
        "TRANSLATION_4": "‘And that our Lord’s Majesty is Supreme – He has neither chosen a wife nor a child.’\n",
        "TRANSLATION_5": "`And He, exalted be the Jadd of our Lord, has taken neither a wife nor a son.'\n",
        "TRANSLATION_6": "And that He-- exalted be the majesty of our Lord-- has not taken a consort, nor a son:\n",
        "TRANSLATION_7": "He -- exalted be our Lord's majesty! has not taken to Himself either consort or a son.\n",
        "TRANSLATION_8": "And (we believe) that He - exalted be the glory of our Lord! - hath taken neither wife nor son,\n",
        "TRANSLATION_9": "and exalted is the majesty of our Lord, He has taken neither a wife nor a son.\n",
        "TRANSLATION_10": "And He - exalted be the majesty of our Lord!-hath taken neither a spouse nor a son.\n",
        "TRANSLATION_11": "Exalted be the majesty of our Lord; He has taken neither any spouse nor son.\n",
        "TRANSLATION_12": "And Exalted is the Majesty of our Lord: He has taken neither a wife nor a son.\n",
        "TRANSLATION_13": "And exalted be the Majesty of our Lord, He has taken neither a wife, nor a son (or offspring or children).\n",
        "TRANSLATION_14": "He exalted be the Majesty of our Lord, who has neither taken to Himself a wife, nor a son!\n",
        "TRANSLATION_15": "And Exalted is the Grandeur of our Lord—He never had a mate, nor a child.\n",
        "TRANSLATION_16": "And [it teaches] that exalted is the nobleness of our Lord; He has not taken a wife or a son\n",
        "TRANSLATION_17": "[72:3] And [we believe] that (annahu: the pronoun in this and in the next two instances is that of the matter) — exalted be the majesty of our Lord, transcendent is His majesty and magnificence above what is ascribed to Him — He has taken neither spouse nor son.\n",
        "TRANSLATION_18": "(And (we believe) that He-exalted be the glory of our Lord-) and that the dominion of our Lord is exalted; it is also said this means: the tremendousness, sovereignty, absoluteness and attributes of our Lord are far exalted, and He (hath taken neither wife nor son) as the disbelievers claim,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "72:3",
            "93:3",
            "53:2",
            "14:41",
            "71:21",
            "72:20",
            "2:46",
            "18:38",
            "43:88",
            "54:10"
        ],
        "BIBLE": [
            "writings:ezra:10:44",
            "torah:numbers:16:15",
            "writings:psalms:71:1",
            "torah:numbers:8:18",
            "torah:numbers:8:6",
            "writings:psalms:31:2",
            "torah:numbers:3:45",
            "torah:genesis:31:16",
            "torah:numbers:3:12",
            "writings:psalms:37:40"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:1:12",
            "Sefer%20Yetzirah:6:2"
        ]
    }
}