{
    "VERSE": "72:4",
    "ARABIC": "وَأَنَّهُۥ كَانَ يَقُولُ سَفِيهُنَا عَلَى ٱللَّهِ شَطَطًا",
    "ENGLISH": {
        "TRANSLATION_0": "The fools among us have uttered a vile slander against Allah.",
        "TRANSLATION_1": "Certainly the foolish among us say preposterous things of God.\n",
        "TRANSLATION_2": "and that “the foolish among us have been wont to say outrageous things about Allah”;\n",
        "TRANSLATION_3": "The dimwit one (the devil) among us has been telling confused lies about God.\n",
        "TRANSLATION_4": "‘And that the fool among us used to utter false exaggerations against Allah.’\n",
        "TRANSLATION_5": "`And that the foolish among us used to utter against Allah that which was an enormity in falsehood.'\n",
        "TRANSLATION_6": "And that the foolish amongst us used to forge extravagant things against Allah:\n",
        "TRANSLATION_7": "The fool among us spoke against God outrage,\n",
        "TRANSLATION_8": "And that the foolish one among us used to speak concerning Allah an atrocious lie.\n",
        "TRANSLATION_9": "And [now we know] that the foolish among us have been saying outrageous things about God.\n",
        "TRANSLATION_10": "And the foolish among us were wont to forge lie against Allah exceedingly.\n",
        "TRANSLATION_11": "The foolish ones among us used to speak atrocious lies concerning Allah.\n",
        "TRANSLATION_12": "There were some foolish ones among us, who used to utter extravagant lies against Allah;\n",
        "TRANSLATION_13": "And that the foolish among us [i.e. Iblis (Satan) or the polytheists amongst the jinns] used to utter against Allah that which was wrong and not right.\n",
        "TRANSLATION_14": "The ignorant fool among us has spoken outrageously against Allah,\n",
        "TRANSLATION_15": "But the fools among us used to say nonsense about God.\n",
        "TRANSLATION_16": "And that our foolish one has been saying about Allah an excessive transgression.\n",
        "TRANSLATION_17": "[72:4] And that the fool among us, the ignorant one among us, used to utter atrocious lies against God, extreme calumny by attributing to Him a spouse and a son.\n",
        "TRANSLATION_18": "(And that the foolish one among us) i.e. the devil (used to speak concerning Allah an atrocious lie.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "72:4",
            "2:156",
            "2:15",
            "37:152",
            "44:19",
            "72:19",
            "12:91",
            "24:7",
            "4:5",
            "53:62"
        ],
        "BIBLE": [
            "torah:genesis:19:21",
            "torah:exodus:33:17",
            "torah:genesis:50:17",
            "writings:psalms:119:128",
            "prophets:ii%20kings:8:4",
            "prophets:ezekiel:22:28",
            "writings:i%20chronicles:21:8",
            "prophets:i%20samuel:4:7",
            "prophets:i%20samuel:20:9",
            "prophets:jonah:1:10"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:2",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:14"
        ]
    }
}