{
    "VERSE": "72:7",
    "ARABIC": "وَأَنَّهُمْ ظَنُّوا۟ كَمَا ظَنَنتُمْ أَن لَّن يَبْعَثَ ٱللَّهُ أَحَدًا",
    "ENGLISH": {
        "TRANSLATION_0": "They thought - as you also think - that Allah would never raise up anyone.",
        "TRANSLATION_1": "So they began to think, even as you do, that God would not resurrect any one.\n",
        "TRANSLATION_2": "and that “they thought, even as you thought, that Allah would never raise anyone (as a Messenger)”;\n",
        "TRANSLATION_3": "Those people thought, like you, that God would never send down a Messenger.\n",
        "TRANSLATION_4": "‘And that they assumed, like you humans assume, that Allah would not send any Noble Messenger.’\n",
        "TRANSLATION_5": "`And they thought as you thought, that Allah will not send any Messenger.'\n",
        "TRANSLATION_6": "And that they thought as you think, that Allah would not raise anyone:\n",
        "TRANSLATION_7": "and they thought, even as you also thought, that God would never raise up anyone.\n",
        "TRANSLATION_8": "And indeed they supposed, even as ye suppose, that Allah would not raise anyone (from the dead) -\n",
        "TRANSLATION_9": "They thought, as you did, that God would never raise up anyone from the dead.\n",
        "TRANSLATION_10": "And indeed they imagined, even as ye imagined, that Allah will not raise any one.\n",
        "TRANSLATION_11": "They thought, just as you think, that Allah will not raise anyone from the dead.\n",
        "TRANSLATION_12": "And they (came to) think as ye thought, that Allah would not raise up any one (to Judgment).\n",
        "TRANSLATION_13": "And they thought as you thought, that Allah will not send any Messenger (to mankind or jinns).\n",
        "TRANSLATION_14": "Like you, they thought that Allah would never raise the dead.\n",
        "TRANSLATION_15": "They thought, as you thought, that God would never resurrect anyone.\n",
        "TRANSLATION_16": "And they had thought, as you thought, that Allah would never send anyone [as a messenger].\n",
        "TRANSLATION_17": "[72:7] And they, namely, the jinn, thought just as you, O humans, thought, that (an: softened in place of the hardened form, that is to say, annahu) God would never raise anyone, after his death.\n",
        "TRANSLATION_18": "(And indeed they) the disbelievers of the jinn before they accepted faith (supposed, even as you suppose) people of Mecca, (that Allah would not raise anyone (from the dead)) and it is also said that this means: and they supposed just as you did that Allah will not send anyone as a messenger.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "72:7",
            "112:1",
            "72:22",
            "18:38",
            "11:33",
            "72:18",
            "2:15",
            "71:3",
            "16:19",
            "2:77"
        ],
        "BIBLE": [
            "prophets:i%20samuel:11:4",
            "prophets:jonah:1:6",
            "prophets:ii%20samuel:3:35",
            "prophets:jeremiah:23:5",
            "torah:deuteronomy:2:16",
            "prophets:ii%20kings:6:33",
            "prophets:ii%20samuel:12:17",
            "prophets:i%20kings:18:21",
            "prophets:ii%20kings:23:17",
            "prophets:i%20samuel:5:10"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:3"
        ]
    }
}