{
    "VERSE": "72:8",
    "ARABIC": "وَأَنَّا لَمَسْنَا ٱلسَّمَآءَ فَوَجَدْنَٰهَا مُلِئَتْ حَرَسًا شَدِيدًا وَشُهُبًا",
    "ENGLISH": {
        "TRANSLATION_0": "We tried, as usual, to travel to heaven in search of news but found it filled with fierce guards and meteors.",
        "TRANSLATION_1": "We sought to pry into the secrets of the heavens, but found it full of fierce guards and shooting flames.\n",
        "TRANSLATION_2": "and that “we tried to pry (the secrets of) the heaven, but we found it full of terrible guards and shooting meteors”;\n",
        "TRANSLATION_3": "We went near the heavens but found it to be full of strong guards and shooting flames.\n",
        "TRANSLATION_4": "‘And we reached the sky, so we found it strongly guarded and filled with comets.’\n",
        "TRANSLATION_5": "`And we have sought to reach the heaven; but we found it filled with stern guards and flaming fires.'\n",
        "TRANSLATION_6": "And that we sought to reach heaven, but we found it filled with strong guards and flaming stars.\n",
        "TRANSLATION_7": "And we stretched towards heaven, but we found it filled with terrible guards and meteors.\n",
        "TRANSLATION_8": "And (the Jinn who had listened to the Qur'an said): We had sought the heaven but had found it filled with strong warders and meteors.\n",
        "TRANSLATION_9": "We sought to reach heaven, but found it filled with strong guards and flames --\n",
        "TRANSLATION_10": "And we sought to reach the heaven; then we found it filled with a strong guard and darting meteors.\n",
        "TRANSLATION_11": "Indeed we made for the heaven and found it full of mighty sentries and flames.\n",
        "TRANSLATION_12": "And we pried into the secrets of heaven; but we found it filled with stern guards and flaming fires.\n",
        "TRANSLATION_13": "And we have sought to reach the heaven; but found it filled with stern guards and flaming fires.\n",
        "TRANSLATION_14": "(The jinn continued saying): \"We made our way towards heaven, but we found it filled with stern guards and a flame.\n",
        "TRANSLATION_15": "We probed the heaven, and found it filled with stern guards and projectiles.\n",
        "TRANSLATION_16": "And we have sought [to reach] the heaven but found it filled with powerful guards and burning flames.\n",
        "TRANSLATION_17": "[72:8] The jinn say: And we made for the heaven, we desired to listen by stealth, but we found it filled with mighty guards, from among the angels, and meteors, scorching stars: this was at the time of the sending of the Prophet (s).\n",
        "TRANSLATION_18": "Allah then went back to the talk of the jinn, saying: (And (the jinn who had listened to the Qur'an said): We had sought the heaven) before we accepted faith (but had found it filled with strong warders) angels (and meteors) preventing them from listening.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "72:8",
            "91:5",
            "79:27",
            "78:19",
            "77:9",
            "81:11",
            "72:9",
            "51:47",
            "69:16",
            "15:16"
        ],
        "BIBLE": [
            "writings:nehemiah:8:10",
            "prophets:i%20samuel:20:37",
            "prophets:ii%20kings:10:25",
            "prophets:i%20samuel:1:18",
            "prophets:i%20samuel:26:25",
            "prophets:judges:3:19",
            "prophets:nahum:2:2",
            "prophets:judges:14:18",
            "prophets:ii%20kings:13:17",
            "torah:genesis:15:5"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:1:6",
            
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:14"
        ]
    }
}