{
    "VERSE": "72:9",
    "ARABIC": "وَأَنَّا كُنَّا نَقْعُدُ مِنْهَا مَقَٰعِدَ لِلسَّمْعِ فَمَن يَسْتَمِعِ ٱلْءَانَ يَجِدْ لَهُۥ شِهَابًا رَّصَدًا",
    "ENGLISH": {
        "TRANSLATION_0": "We used to sit there on special seats to listen in. But anyone listening now finds a fiery meteor in wait for him.",
        "TRANSLATION_1": "We sat in observatories to listen; but any one who listened found a shooting star in wait for him.\n",
        "TRANSLATION_2": "and that “we would take up stations in the heaven to try to hear but anyone who now attempts to listen finds a shooting meteor in wait for him”;\n",
        "TRANSLATION_3": "We used to sit near by and try to listen to the heavens, but shooting flames now await those who try to do that.\n",
        "TRANSLATION_4": "‘And that we sometimes used to sit in some places in the sky, to listen; so whoever now listens finds a fiery comet waiting for him.’\n",
        "TRANSLATION_5": "`And verily, we used to sit there in stations, to (steal) a hearing, but any who listens now will find a flaming fire watching him in ambush.'\n",
        "TRANSLATION_6": "And that we used to sit in some of the sitting-places thereof to steal a hearing, but he who would (try to) listen now would find a flame lying in wait for him:\n",
        "TRANSLATION_7": "We would sit there on seats to hear; but any listening now finds a meteor in wait for him.\n",
        "TRANSLATION_8": "And we used to sit on places (high) therein to listen. But he who listeneth now findeth a flame in wait for him;\n",
        "TRANSLATION_9": "we used to take up a position to listen, but whoever listens now finds a flaming fire lying in wait for him --\n",
        "TRANSLATION_10": "And we were wont to sit on seats therein to listen; but whosoever listeneth now findeth for him a dartin meteor in wait.\n",
        "TRANSLATION_11": "We used to sit in its positions to eavesdrop, but anyone listening now finds a flame waiting for him.\n",
        "TRANSLATION_12": "We used, indeed, to sit there in (hidden) stations, to (steal) a hearing; but any who listen now will find a flaming fire watching him in ambush.\n",
        "TRANSLATION_13": "And verily, we used to sit there in stations, to (steal) a hearing, but any who listens now will find a flaming fire watching him in ambush.\n",
        "TRANSLATION_14": "There, we would sit to eavesdrop, but now an eavesdropper finds a flame in wait for him.\n",
        "TRANSLATION_15": "We used to take up positions to listen in; but whoever listens now finds a projectile in wait for him.\n",
        "TRANSLATION_16": "And we used to sit therein in positions for hearing, but whoever listens now will find a burning flame lying in wait for him.\n",
        "TRANSLATION_17": "[72:9] And we used to, that is to say, before his Mission, sit in [certain] places therein to listen in; but anyone listening now will find a meteor lying in wait for him, aimed at him, ready to strike him.\n",
        "TRANSLATION_18": "(And we used to sit on places (high) therein) in heaven (to listen) before the advent of Muhammad (pbuh). (But he who listened now) after the advent of Muhammad (pbuh) (findeth a flame) a shining star (in wait for him) from the angels in order to prevent them from listening;\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "72:9",
            "15:18",
            "72:8",
            "2:127",
            "72:14",
            "20:85",
            "9:58",
            "3:121",
            "50:37",
            "23:78"
        ],
        "BIBLE": [
            "writings:psalms:64:5",
            "writings:lamentations:3:10",
            "writings:proverbs:8:2",
            "prophets:i%20samuel:20:37",
            "writings:daniel:7:9",
            "prophets:i%20samuel:20:25",
            "writings:proverbs:9:14",
            "torah:numbers:17:2",
            "prophets:jeremiah:23:24",
            "torah:exodus:21:13"
        ]
    }
}