{
    "VERSE": "20:10",
    "ARABIC": "إِذْ رَءَا نَارًا فَقَالَ لِأَهْلِهِ ٱمْكُثُوٓا۟ إِنِّىٓ ءَانَسْتُ نَارًا لَّعَلِّىٓ ءَاتِيكُم مِّنْهَا بِقَبَسٍ أَوْ أَجِدُ عَلَى ٱلنَّارِ هُدًى",
    "ENGLISH": {
        "TRANSLATION_0": "When he saw a fire and said to his family, 'Wait here. I can make out a fire. Maybe I will bring you a brand from it, or will find guidance there.'",
        "TRANSLATION_1": "When he saw a fire he said to his family: \"You wait here. I have seen a fire. I may haply be able to bring an ember from it, or find direction by the fire.\"\n",
        "TRANSLATION_2": "When he saw a fire and said to his family: \"Hold on! I have just perceived a fire; perhaps I will bring a brand from it for you, or I will find some guidance at the fire about the way to follow.\"\n",
        "TRANSLATION_3": "When he saw the fire, he said to his family, \"Wait here for I can see a fire. Perhaps I shall bring you a burning torch or find a way to some fire\".\n",
        "TRANSLATION_4": "When he saw a fire and said to his wife, “Wait – I have seen a fire – perhaps I may bring you an ember from it or find a way upon the fire.”\n",
        "TRANSLATION_5": "When he saw a fire, he said to his family: \"Wait! Verily, I have seen a fire; perhaps I can bring you some burning brand therefrom, or find some guidance at the fire.\"\n",
        "TRANSLATION_6": "When he saw fire, he said to his family: Stop, for surely I see a fire, haply I may bring to you therefrom a live coal or find a guidance at the fire.\n",
        "TRANSLATION_7": "When he saw a fire, and said to his family, 'Tarry you here; I observe a fire. Perhaps I shall bring you a brand from it, or I shall find at the fire guidance.'\n",
        "TRANSLATION_8": "When he saw a fire and said unto his folk: Lo! Wait! I see a fire afar off. Peradventure I may bring you a brand therefrom or may find guidance at the fire.\n",
        "TRANSLATION_9": "When he saw a fire, he said to his family, \"Wait here. I can see a fire. Perhaps I can bring you a brand from it, or find some guidance at the fire.\"\n",
        "TRANSLATION_10": "Recall what time he saw a fire and said to his household, bide ye! verily I have perceived a fire! haply I may bring you from it a brand or may find at the fire a guidance.\n",
        "TRANSLATION_11": "when he sighted a fire, and said to his family, ‘Wait! Indeed, I descry a fire! Maybe I will bring you a brand from it, or find some guidance at the fire.’\n",
        "TRANSLATION_12": "Behold, he saw a fire: So he said to his family, \"Tarry ye; I perceive a fire; perhaps I can bring you some burning brand therefrom, or find some guidance at the fire.\"\n",
        "TRANSLATION_13": "When he saw a fire, he said to his family: \"Wait! Verily, I have seen a fire, perhaps I can bring you some burning brand therefrom, or find some guidance at the fire.\"\n",
        "TRANSLATION_14": "When he saw a fire, he said to his family: 'Stay here, for I can see a fire. Perhaps I can bring you a lighted torch or find at the fire guidance'\n",
        "TRANSLATION_15": "When he saw a fire, he said to his family, “Stay; I have noticed a fire; Perhaps I can bring you a torch therefrom, or find some guidance by the fire.”\n",
        "TRANSLATION_16": "When he saw a fire and said to his family, \"Stay here; indeed, I have perceived a fire; perhaps I can bring you a torch or find at the fire some guidance.\"\n",
        "TRANSLATION_17": "[20:10] When he caught sight of a fire and said to his family, namely, to his wife, ‘Wait, here! — this was when he was leaving Midian, heading for Egypt — Indeed I see a fire [in the distance]. Perhaps I [can] bring you a brand from it, [bring you] a burning wick or a torch, or find at the fire some guidance’, that is, someone to guide me by showing me the [proper] route — for he had lost it in the darkness of the night. He [Moses] said, ‘perhaps’ (la‘alla) because he could not be certain of fulfilling his promise.\n",
        "TRANSLATION_18": "(When he saw a fire) on his left side (and said unto his folk: Wait) stay here! (I see a fire afar off. Peradventure I may bring you a brand therefrom) a brand of fire from there, for that night was very cold, (or may find guidance at the Fire) to show me the way.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "20:10",
            "27:7",
            "28:29",
            "7:123",
            "28:12",
            "14:30",
            "3:183",
            "28:37",
            "12:26",
            "33:13"
        ],
        "BIBLE": [
            "torah:genesis:24:5",
            "prophets:ii%20kings:6:19",
            "prophets:ii%20kings:5:21",
            "torah:genesis:24:56",
            "prophets:judges:13:22",
            "torah:genesis:24:39",
            "prophets:ii%20kings:9:27",
            "torah:genesis:42:21",
            "prophets:joshua:11:6",
            "writings:job:20:7"
        ]
    }
}