{
    "VERSE": "20:100",
    "ARABIC": "مَّنْ أَعْرَضَ عَنْهُ فَإِنَّهُۥ يَحْمِلُ يَوْمَ ٱلْقِيَٰمَةِ وِزْرًا",
    "ENGLISH": {
        "TRANSLATION_0": "Those who turn away from it will bear a heavy burden on the Day of Rising,",
        "TRANSLATION_1": "Whoever turns away from it will surely carry a burden on the Day of Judgement,\n",
        "TRANSLATION_2": "He who turns away from it will surely bear a heavy burden on the Day of Resurrection,\n",
        "TRANSLATION_3": "Whoever disregards (the Quran) will be heavily burdened with sin on the Day of Judgment\n",
        "TRANSLATION_4": "Whoever turns away from it, will bear a burden on the Day of Resurrection.\n",
        "TRANSLATION_5": "Whoever turns away from it, verily, they will bear a heavy burden on the Day of Resurrection.\n",
        "TRANSLATION_6": "Whoever turns aside from it, he shall surely bear a burden on the day of resurrection\n",
        "TRANSLATION_7": "Whosoever turns away from it, upon the Day of Resurrection He shall bear a fardel,\n",
        "TRANSLATION_8": "Whoso turneth away from it, he verily will bear a burden on the Day of Resurrection,\n",
        "TRANSLATION_9": "Whoever turns away from it will bear a heavy burden on the Day of Judgement,\n",
        "TRANSLATION_10": "Whosoever turnoth away therefrom--verily they shall bear on the Day of Judgment a burthen,\n",
        "TRANSLATION_11": "Whoever disregards it shall bear a burden [of punishment] on the Day of Resurrection,\n",
        "TRANSLATION_12": "If any do turn away therefrom, verily they will bear a burden on the Day of judgment;\n",
        "TRANSLATION_13": "Whoever turns away from it (this Quran i.e. does not believe in it, nor acts on its orders), verily, they will bear a heavy burden (of sins) on the Day of Resurrection,\n",
        "TRANSLATION_14": "Whosoever has turned away from it shall bear a burden on the Day of Resurrection.\n",
        "TRANSLATION_15": "Whoever turns away from it will carry on the Day of Resurrection a burden.\n",
        "TRANSLATION_16": "Whoever turns away from it - then indeed, he will bear on the Day of Resurrection a burden,\n",
        "TRANSLATION_17": "[20:100] Whoever turns away from it, and does not believe in it, he shall indeed, on the Day of Resurrection, bear a burden, a heavy load of sin;\n",
        "TRANSLATION_18": "(Whoso turneth away from it) whoever disbelieves in it, (he verily will bear a burden) idolatry (on the Day of Resurrection)\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "20:100",
            "23:16",
            "75:1",
            "75:6",
            "32:25",
            "20:124",
            "16:25",
            "40:32",
            "20:101",
            "23:111"
        ],
        "BIBLE": [
            "writings:lamentations:4:22",
            "writings:psalms:49:18",
            "prophets:jeremiah:29:14",
            "prophets:jeremiah:48:47",
            "torah:deuteronomy:31:18",
            "prophets:jeremiah:46:21",
            "torah:deuteronomy:11:28",
            "prophets:isaiah:57:13",
            "prophets:jeremiah:2:35",
            "prophets:isaiah:12:1"
        ]
    }
}