{
    "VERSE": "20:104",
    "ARABIC": "نَّحْنُ أَعْلَمُ بِمَا يَقُولُونَ إِذْ يَقُولُ أَمْثَلُهُمْ طَرِيقَةً إِن لَّبِثْتُمْ إِلَّا يَوْمًا",
    "ENGLISH": {
        "TRANSLATION_0": "We know best what they will say when the most correct of them will say, 'You only stayed a day.'",
        "TRANSLATION_1": "We know well what they will say when the most upright among them will say: \"You did not tarry more than a day.\"\n",
        "TRANSLATION_2": "We know well what they will say to one another: We also know that even the most cautious in his estimate will say: \"You lived in the world no more than a day.\"\n",
        "TRANSLATION_3": "We know best what they say. The moderate ones among them will say, \"You did not live on earth for more than a day.\"\n",
        "TRANSLATION_4": "We know well what they will utter, whereas the wisest among them will say, “You have stayed just for a day.”\n",
        "TRANSLATION_5": "We know very well what they will say, when the best among them in knowledge and wisdom will say: \"You stayed no longer than a day!\"\n",
        "TRANSLATION_6": "We know best what they say, when the fairest of them in course would say: You tarried but a day.\n",
        "TRANSLATION_7": "We know very well what they will say, when the justest of them in the way will say, 'You have tarried only a day.'\n",
        "TRANSLATION_8": "We are Best Aware of what they utter when their best in conduct say: Ye have tarried but a day.\n",
        "TRANSLATION_9": "We know best what they will say. The most perceptive of them will say, \"You stayed only one day.\"\n",
        "TRANSLATION_10": "We are the Best Knower of that which they will say, when the best of them in judgment Will say: ye tarried not save for a day.\n",
        "TRANSLATION_11": "We know best what they will say, when the smartest of them in approach will say, ‘You stayed only a day!’\n",
        "TRANSLATION_12": "We know best what they will say, when their leader most eminent in conduct will say: \"Ye tarried not longer than a day!\"\n",
        "TRANSLATION_13": "We know very well what they will say, when the best among them in knowledge and wisdom will say: \"You stayed no longer than a day!\"\n",
        "TRANSLATION_14": "We know well what they will say. The most just among them in the matter will declare: 'You have stayed away but one day'\n",
        "TRANSLATION_15": "We are fully aware of what they say, when the most exemplary of them in conduct will say, “You have lingered only a day.”\n",
        "TRANSLATION_16": "We are most knowing of what they say when the best of them in manner will say, \"You remained not but one day.\"\n",
        "TRANSLATION_17": "[20:104] We know very well what they will say, regarding this matter — that is, it is not as they say — when the justest, the most upright, of them in the way, in this, will say, ‘You have tarried only a day’: they will deem their stay in this world as having been very brief, on account of the terrors they will witness in the Hereafter.\n",
        "TRANSLATION_18": "(We are best aware of what they utter) regarding the resurrection (when their best in conduct) the best of them in intellect, the most sound of judgement and the most truthful in words (say: Ye have tarried) in your graves (but a day).\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "20:104",
            "17:47",
            "36:64",
            "10:102",
            "35:14",
            "26:188",
            "17:52",
            "26:112",
            "23:111",
            "16:25"
        ],
        "BIBLE": [
            "prophets:joshua:22:31",
            "prophets:ezekiel:28:22",
            "torah:numbers:22:34",
            "writings:ruth:3:18",
            "torah:deuteronomy:1:39",
            "torah:exodus:8:18",
            "prophets:ii%20samuel:19:23",
            "writings:esther:1:13",
            "prophets:isaiah:4:1",
            "prophets:isaiah:41:26"
        ]
    }
}