{
    "VERSE": "20:115",
    "ARABIC": "وَلَقَدْ عَهِدْنَآ إِلَىٰٓ ءَادَمَ مِن قَبْلُ فَنَسِىَ وَلَمْ نَجِدْ لَهُۥ عَزْمًا",
    "ENGLISH": {
        "TRANSLATION_0": "We made a contract with Adam before, but he forgot. We did not find that he had a firm resolve.",
        "TRANSLATION_1": "We had commanded Adam before, but he disregarded it: We found him lacking in resolution.\n",
        "TRANSLATION_2": "Most certainly We had given Adam a command before, but he forgot. We found him lacking in firmness of resolution.\n",
        "TRANSLATION_3": "We had commanded Adam (certain matters). He forgot Our commandment and We did not find in him the determination to fulfil Our commandments.\n",
        "TRANSLATION_4": "And indeed before this We made a covenant with Adam, so he forgot, and We did not find its intention (in him).\n",
        "TRANSLATION_5": "And indeed We made a covenant with Adam before, but he forgot, and We found on his part no firm willpower.\n",
        "TRANSLATION_6": "And certainly We gave a commandment to Adam before, but he forgot; and We did not find in him any determination.\n",
        "TRANSLATION_7": "And We made covenant with Adam before, but he forgot, and We found in him no constancy.\n",
        "TRANSLATION_8": "And verily We made a covenant of old with Adam, but he forgot, and We found no constancy in him.\n",
        "TRANSLATION_9": "We made a covenant with Adam before you, but he forgot, and We found him lacking in constancy.\n",
        "TRANSLATION_10": "And assuredly We covenanted with Adam aforetime, then he forgat, and We found not in him steadiness.\n",
        "TRANSLATION_11": "Certainly We had enjoined Adam earlier; but he forgot, and We did not find any resoluteness in him.\n",
        "TRANSLATION_12": "We had already, beforehand, taken the covenant of Adam, but he forgot: and We found on his part no firm resolve.\n",
        "TRANSLATION_13": "And indeed We made a covenant with Adam before, but he forgot, and We found on his part no firm will-power.\n",
        "TRANSLATION_14": "We made a covenant with Adam, but he forgot and We found in him no constancy.\n",
        "TRANSLATION_15": "And We covenanted with Adam before, but he forgot, and We found in him no resolve.\n",
        "TRANSLATION_16": "And We had already taken a promise from Adam before, but he forgot; and We found not in him determination.\n",
        "TRANSLATION_17": "[20:115] And We made a covenant with Adam, We enjoined him not to eat of the tree, before, that is, before he ate of it, but he forgot, he disregarded Our covenant, and We did not find in him any constancy, any resoluteness or patience in [abiding by] what We forbade him from.\n",
        "TRANSLATION_18": "(And verily We made a covenant of old) before he ate from the tree; it is also said that this means: before the advent of Muhammad (pbuh) (with Adam) We commanded him not to eat from the tree, (but he forgot) he left what he was commanded to do, (and We found no constancy in him) We found in him no firmness or resoluteness.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "20:115",
            "39:65",
            "21:51",
            "7:11",
            "41:48",
            "39:50",
            "21:41",
            "29:3",
            "4:164",
            "30:49"
        ],
        "BIBLE": [
            "prophets:ezekiel:18:13",
            "torah:genesis:21:27",
            "torah:numbers:8:16",
            "writings:nehemiah:2:1",
            "torah:genesis:31:9",
            "prophets:ezekiel:18:7",
            "prophets:ezekiel:18:16",
            "torah:deuteronomy:29:7",
            "writings:proverbs:8:29",
            "writings:psalms:105:44"
        ]
    }
}