{
    "VERSE": "20:116",
    "ARABIC": "وَإِذْ قُلْنَا لِلْمَلَٰٓئِكَةِ ٱسْجُدُوا۟ لِءَادَمَ فَسَجَدُوٓا۟ إِلَّآ إِبْلِيسَ أَبَىٰ",
    "ENGLISH": {
        "TRANSLATION_0": "When We said to the angels, 'Prostrate yourselves to Adam!' they prostrated, with the exception of Iblis who disdained to do it.",
        "TRANSLATION_1": "When We said to the angels: ''Bow before Adam,'' they all bowed but Iblis, who refused.\n",
        "TRANSLATION_2": "Recall when We said to the angels: \"Prostrate yourselves before Adam\"; all prostrated themselves save Iblis. He refused.\n",
        "TRANSLATION_3": "When We told the angels to prostrate before Adam they all obeyed except Iblis (satan) who refused.\n",
        "TRANSLATION_4": "And when We commanded the angels, “Prostrate before Adam” – so they all prostrated, except Iblis; he refused.\n",
        "TRANSLATION_5": "And (remember) when We said to the angels: \"Prostrate yourselves to Adam.\" They prostrated themselves (all) except Iblis; he refused.\n",
        "TRANSLATION_6": "And when We said to the angels: Make obeisance to Adam, they made obeisance, but Iblis (did it not); he refused.\n",
        "TRANSLATION_7": "And when We said to the angels, 'Bow yourselves to Adam'; so they bowed themselves, save Iblis; he refused.\n",
        "TRANSLATION_8": "And when We said unto the angels: Fall prostrate before Adam, they fell prostrate (all) save Iblis; he refused.\n",
        "TRANSLATION_9": "When We said to the angels, \"Prostrate yourselves before Adam,\" they all prostrated themselves, except for Satan, who refused,\n",
        "TRANSLATION_10": "And recall what time We said to the angels: prostrate yourselves before Adam. They fell prostrate, but Iblis did not; he refused.\n",
        "TRANSLATION_11": "When We said to the angels, ‘Prostrate before Adam,’ they prostrated, but not Iblis: he refused.\n",
        "TRANSLATION_12": "When We said to the angels, \"Prostrate yourselves to Adam\", they prostrated themselves, but not Iblis: he refused.\n",
        "TRANSLATION_13": "And (remember) when We said to the angels: \"Prostrate yourselves to Adam.\" They prostrated (all) except Iblis (Satan), who refused.\n",
        "TRANSLATION_14": "And when We said to the angels: 'Prostrate yourselves before Adam' they all prostrated themselves except iblis, who refused.\n",
        "TRANSLATION_15": "And when We said to the angels, “Bow down to Adam.” They bowed down, except for Satan; he refused.\n",
        "TRANSLATION_16": "And [mention] when We said to the angels, \"Prostrate to Adam,\" and they prostrated, except Iblees; he refused.\n",
        "TRANSLATION_17": "[20:116] And, mention, when We said to the angels, ‘Prostrate before Adam’; so they prostrated, except Iblīs, who was the father of the jinn — he used to keep company with the angels and worship God alongside them: he refused, to prostrate before Adam, he said: ‘I am better than him’ [Q. 7:12].\n",
        "TRANSLATION_18": "(And when We said unto the angels) Who were on the earth: (Fall prostrate before Adam) a prostration of greeting, (they fell prostrate (all) save Iblis) their chief; (he refused) he felt too proud to prostrate before 347 Adam.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "20:116",
            "2:34",
            "17:61",
            "7:11",
            "15:8",
            "37:116",
            "43:60",
            "38:74",
            "18:50",
            "89:22"
        ],
        "BIBLE": [
            "prophets:ii%20samuel:9:6",
            "prophets:jeremiah:6:15",
            "prophets:jeremiah:8:12",
            "writings:daniel:8:17",
            "writings:ruth:2:10",
            "prophets:judges:12:6",
            "prophets:ii%20samuel:14:4",
            "prophets:joshua:5:14",
            "prophets:jonah:1:7",
            "prophets:i%20kings:18:39"
        ]
    }
}