{
    "VERSE": "20:12",
    "ARABIC": "إِنِّىٓ أَنَا۠ رَبُّكَ فَٱخْلَعْ نَعْلَيْكَ إِنَّكَ بِٱلْوَادِ ٱلْمُقَدَّسِ طُوًى",
    "ENGLISH": {
        "TRANSLATION_0": "I am your Lord. Take off your sandals. You are in the holy valley of Tuwa.",
        "TRANSLATION_1": "O Moses, I am verily your Lord, so take off your shoes, for you are in the holy plain of Towa.\n",
        "TRANSLATION_2": "Verily I am your Lord! Take off your shoes. You are in the sacred valley, Tuwa!\n",
        "TRANSLATION_3": "I Am your Lord. Take off your shoes; you are in the holy valley of Tuwa.\n",
        "TRANSLATION_4": "“Indeed I am your Lord, therefore take off your shoes; indeed you are in the holy valley of Tuwa!”\n",
        "TRANSLATION_5": "Verily, I am your Lord! So take off your shoes; you are in the sacred valley, Tuwa.\"\n",
        "TRANSLATION_6": "Surely I am your Lord, therefore put off your shoes; surely you are in the sacred valley, Tuwa,\n",
        "TRANSLATION_7": "I am thy Lord; put off thy shoes; thou art in the holy valley, Towa.\n",
        "TRANSLATION_8": "Lo! I, even I, am thy Lord, So take off thy shoes, for lo! thou art in the holy valley of Tuwa.\n",
        "TRANSLATION_9": "I am your Lord! Take off your sandals, for you are in the sacred valley of Tuwa.\n",
        "TRANSLATION_10": "Verily I! I am thy Lord: so take off thy shoes; verily thou art into the holy valley, Tuwa.\n",
        "TRANSLATION_11": "Indeed I am your Lord! So take off your sandals. You are indeed in the sacred valley of Tuwa.\n",
        "TRANSLATION_12": "Verily I am thy Lord! therefore (in My presence) put off thy shoes: thou art in the sacred valley Tuwa.\n",
        "TRANSLATION_13": "Verily! I am your Lord! So take off your shoes, you are in the sacred valley, Tuwa.\n",
        "TRANSLATION_14": "I am your Lord. Take off your shoes, for you are in Towa, the sacred valley.\n",
        "TRANSLATION_15": "I—I am your Lord. Take off your shoes. You are in the sacred valley of Tuwa.\n",
        "TRANSLATION_16": "Indeed, I am your Lord, so remove your sandals. Indeed, you are in the sacred valley of Tuwa.\n",
        "TRANSLATION_17": "[20:12] Indeed (read as innī, if one understands nūdiya, ‘he was called’, as meaning qīla, ‘it was said’; or read it as annī, because of an implied [prefixed] bā’) I am (anā, reiterates the [first person indicator] yā’ [of innī] used by the [direct] speaker) your Lord. So take off your sandals, for lo! you are in the holy, [meaning] either the pure, or the blessed, valley of Tuwā ([this is] either a substitution, or an explicative supplement; read [Tuwan] with nunation or [Tuwā] without: it is [considered] declinable on account of it being a location; but [alternatively considered] indeclinable, if taken as considered a feminine proper noun denoting a place name).\n",
        "TRANSLATION_18": "(Lo! I, even I, am thy Lord. So take off thy shoes) for his shoes were made of the skin of a dead ass, (for Lo! thou art in the holy valley of Tuwa) Tuwa is the name of the valley; it also said that Tuwa means: this valley has been crossed (tawathu) by prophets before you; it is also said that Tuwa is a well which was filled with stones (tuwiyyat bi'l-sakhr) in the valley where he found the tree.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "20:12",
            "79:16",
            "36:25",
            "26:77",
            "34:48",
            "56:74",
            "69:52",
            "56:96",
            "28:30",
            "11:47"
        ],
        "BIBLE": [
            "writings:psalms:92:9",
            "prophets:isaiah:26:17",
            "prophets:joshua:5:15",
            "writings:psalms:119:12",
            "writings:psalms:119:151",
            "torah:exodus:3:5",
            "writings:psalms:114:7",
            "prophets:jeremiah:10:6",
            "prophets:ii%20kings:19:19",
            "prophets:isaiah:45:15"
        ]
    }
}