{
    "VERSE": "20:122",
    "ARABIC": "ثُمَّ ٱجْتَبَٰهُ رَبُّهُۥ فَتَابَ عَلَيْهِ وَهَدَىٰ",
    "ENGLISH": {
        "TRANSLATION_0": "But then his Lord chose him and turned to him and guided him.",
        "TRANSLATION_1": "Then his Lord chose him and relented towards him, and showed him the way;\n",
        "TRANSLATION_2": "Thereafter his Lord exalted him, accepted his repentance, and bestowed guidance upon him,\n",
        "TRANSLATION_3": "His Lord forgave him, accepted his repentance, and gave him guidance.\n",
        "TRANSLATION_4": "Then his Lord chose him, and inclined towards him with His mercy, and guided him.\n",
        "TRANSLATION_5": "Then his Lord chose him, and turned to him with forgiveness, and gave him guidance.\n",
        "TRANSLATION_6": "Then his Lord chose him, so He turned to him and guided (him).\n",
        "TRANSLATION_7": "Thereafter his Lord chose him, and turned again unto him, and He guided him.\n",
        "TRANSLATION_8": "Then his Lord chose him, and relented toward him, and guided him.\n",
        "TRANSLATION_9": "Then his Lord had mercy on him, accepted his repentance and guided him.\n",
        "TRANSLATION_10": "Thereafter his Lord accepted him, and relented toward him, and guided him.\n",
        "TRANSLATION_11": "Then his Lord chose him, and turned to him clemently, and guided him.\n",
        "TRANSLATION_12": "But his Lord chose him (for His Grace): He turned to him, and gave him Guidance.\n",
        "TRANSLATION_13": "Then his Lord chose him, and turned to him with forgiveness, and gave him guidance.\n",
        "TRANSLATION_14": "But afterwards his Lord chose him; He turned again towards him and guided him.\n",
        "TRANSLATION_15": "But then his Lord recalled him, and pardoned him, and guided him.\n",
        "TRANSLATION_16": "Then his Lord chose him and turned to him in forgiveness and guided [him].\n",
        "TRANSLATION_17": "[20:122]   Thereafter his Lord chose him, He brought him close [to Him], and relented to him, He accepted his repentance, and guided him, that is, He guided him to seek repentance regularly.\n",
        "TRANSLATION_18": "(Then his Lord chose him) by means of repentance, (and relented towards him) He overlooked his sin, (and guided him) to repentance.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "20:122",
            "79:19",
            "74:7",
            "94:8",
            "74:3",
            "16:42",
            "29:59",
            "84:5",
            "84:2",
            "68:50"
        ],
        "BIBLE": [
            "prophets:joshua:22:4",
            "torah:numbers:32:9",
            "prophets:i%20samuel:10:9",
            "torah:genesis:39:21",
            "writings:song%20of%20songs:5:6",
            "writings:psalms:118:18",
            "prophets:jeremiah:11:18",
            "torah:numbers:31:41",
            "torah:numbers:18:24",
            "torah:genesis:45:21"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:13",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:6:5"
        ]
    }
}