{
    "VERSE": "20:13",
    "ARABIC": "وَأَنَا ٱخْتَرْتُكَ فَٱسْتَمِعْ لِمَا يُوحَىٰٓ",
    "ENGLISH": {
        "TRANSLATION_0": "I have chosen you, so listen well to what is revealed.",
        "TRANSLATION_1": "I have chosen you, so listen to what is revealed to you.\n",
        "TRANSLATION_2": "I Myself have chosen you; therefore, give ear to what is revealed.\n",
        "TRANSLATION_3": "I have chosen you as My Messengers. Listen to the revelation.\n",
        "TRANSLATION_4": "“And I have chosen you, therefore listen carefully to what is divinely revealed to you.”\n",
        "TRANSLATION_5": "And I have chosen you. So listen to that which will be revealed (to you)\"\n",
        "TRANSLATION_6": "And I have chosen you, so listen to what is revealed:\n",
        "TRANSLATION_7": "I Myself have chosen thee; therefore give thou ear to this revelation.\n",
        "TRANSLATION_8": "And I have chosen thee, so hearken unto that which is inspired.\n",
        "TRANSLATION_9": "I have chosen you. So listen to what is being revealed.\n",
        "TRANSLATION_10": "And I! I have chosen thee hearken thou then to that which shall be revealed.\n",
        "TRANSLATION_11": "I have chosen you; so listen to what is revealed.\n",
        "TRANSLATION_12": "I have chosen thee: listen, then, to the inspiration (sent to thee).\n",
        "TRANSLATION_13": "And I have chosen you. So listen to that which is inspired to you.\n",
        "TRANSLATION_14": "I have chosen you. Therefore, listen to what shall be revealed.\n",
        "TRANSLATION_15": "I have chosen you, so listen to what is revealed.\n",
        "TRANSLATION_16": "And I have chosen you, so listen to what is revealed [to you].\n",
        "TRANSLATION_17": "[20:13] And I [Myself] have chosen you, from among [all of] your people, so listen to what is being revealed, to you from Me.\n",
        "TRANSLATION_18": "(And I have chosen thee) to carry the message to Pharaoh, (so hearken unto that which is inspired) so act upon that which you have been commanded.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "20:13",
            "2:152",
            "74:14",
            "37:161",
            "26:92",
            "44:21",
            "26:80",
            "84:4",
            "94:4",
            "26:211"
        ],
        "BIBLE": [
            "prophets:ii%20samuel:7:22",
            "writings:proverbs:17:11",
            "prophets:joshua:6:17",
            "writings:psalms:116:2",
            "torah:numbers:14:28",
            "torah:deuteronomy:18:14",
            "writings:psalms:32:8",
            "prophets:jeremiah:6:10",
            "prophets:jeremiah:25:4",
            "writings:psalms:118:28"
        ]
    }
}