{
    "VERSE": "20:133",
    "ARABIC": "وَقَالُوا۟ لَوْلَا يَأْتِينَا بِـَٔايَةٍ مِّن رَّبِّهِۦٓ أَوَلَمْ تَأْتِهِم بَيِّنَةُ مَا فِى ٱلصُّحُفِ ٱلْأُولَىٰ",
    "ENGLISH": {
        "TRANSLATION_0": "They say, 'If only he would bring us a Sign from his Lord!' Have they not received the Clear Sign of what is written in the earlier texts?",
        "TRANSLATION_1": "Yet they say: \"Why does he not bring a sign from his Lord?\" Have not clear proofs come to them in what is contained in the earlier Books?\n",
        "TRANSLATION_2": "They ask: \"Why does he not bring us a (miraculous) sign from his Lord?\" Has there not come to them a Book containing the teachings of the previous scriptures?\n",
        "TRANSLATION_3": "They have said, \"Why has he, (Muhammad), not brought some miracle from his Lord?\" Have they not received the previously revealed heavenly Books as the evidence of the Truth.\n",
        "TRANSLATION_4": "And the disbelievers said, “Why does he not bring to us a sign from his Lord?”; did not the explanation of what is in the former Books, come to them?\n",
        "TRANSLATION_5": "And they say, \"Why does he not bring us a sign from his Lord?\" Has there not come to them evidence of what was in the former scriptures?\n",
        "TRANSLATION_6": "And they say: Why does he not bring to us a sign from his Lord? Has not there come to them a clear evidence of what is in the previous books?\n",
        "TRANSLATION_7": "They say, 'Why does he not bring us a sign from his Lord?' Has there not come to them the clear sign of what is in the former scrolls?\n",
        "TRANSLATION_8": "And they say: If only he would bring us a miracle from his Lord! Hath there not come unto them the proof of what is in the former scriptures?\n",
        "TRANSLATION_9": "They say, \"Why does he not bring us a sign from his Lord?\" Have they not been given sufficient proof in previous scriptures?\n",
        "TRANSLATION_10": "And they Say: wherefore bringeth he not unto us a sign from his Lord? Hath not there came unto them the evidence of that which is in the former Scriptures?\n",
        "TRANSLATION_11": "They say, ‘Why does he not bring us a sign from his Lord?’ Has there not come to them a clear proof in that which is in the former scriptures?\n",
        "TRANSLATION_12": "They say: \"Why does he not bring us a sign from his Lord?\" Has not a Clear Sign come to them of all that was in the former Books of revelation?\n",
        "TRANSLATION_13": "They say: \"Why does he not bring us a sign (proof) from his Lord?\" Has there not come to them the proof of that which is (written) in the former papers [Scriptures, i.e. the Taurat (Torah), and the Injeel (Gospel), etc. about the coming of the Prophet Muhammad SAW].\n",
        "TRANSLATION_14": "They say: 'Why does he not bring us a sign from his Lord' Did not a clear sign come to them in the preceding Scrolls?\n",
        "TRANSLATION_15": "And they say, “Why does he not bring us a miracle from his Lord?” Were they not given enough miracles in the former scriptures?\n",
        "TRANSLATION_16": "And they say, \"Why does he not bring us a sign from his Lord?\" Has there not come to them evidence of what was in the former scriptures?\n",
        "TRANSLATION_17": "[20:133] And they, the idolaters, say, ‘Why does he, Muhammad (s), not bring us a sign from his Lord?’, of the sort which they request. Has there not come to them (read ta’tihim or ya’tihim) the clear proof, the statements, of what is in the former scriptures?, the tales contained in the Qur’ān relating to past communities and [the details of] their destruction for denying the messengers?\n",
        "TRANSLATION_18": "(And they say) i.e. the people of Mecca: (If only he would bring us) why does not Muhammad bring us (a miracle) a sign (from his Lord! Hath there not come unto them the proof) the exposition (of what is in the former Scriptures) what is in the Torah and the Gospel for they contained the attributes and description of the Prophet Muhammad (pbuh)?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "20:133",
            "28:36",
            "44:33",
            "29:49",
            "23:58",
            "36:46",
            "23:68",
            "28:47",
            "32:22",
            "35:37"
        ],
        "BIBLE": [
            "torah:genesis:38:18",
            "torah:numbers:20:12",
            "prophets:i%20samuel:30:23",
            "prophets:joshua:17:4",
            "torah:genesis:47:15",
            "prophets:ii%20kings:10:15",
            "writings:job:42:11",
            "writings:ii%20chronicles:34:14",
            "writings:ii%20chronicles:35:21",
            "prophets:i%20kings:13:3"
        ]
    }
}