{
    "VERSE": "20:135",
    "ARABIC": "قُلْ كُلٌّ مُّتَرَبِّصٌ فَتَرَبَّصُوا۟ فَسَتَعْلَمُونَ مَنْ أَصْحَٰبُ ٱلصِّرَٰطِ ٱلسَّوِىِّ وَمَنِ ٱهْتَدَىٰ",
    "ENGLISH": {
        "TRANSLATION_0": "Say: 'Everyone is waiting expectantly so wait expectantly. You will soon know who are the Companions of the Right Path and who is is guided.'",
        "TRANSLATION_1": "Say: \"Each one awaits the consequence; so you wait. You will come to know soon who are the men of the straight path and who have come to guidance.\n",
        "TRANSLATION_2": "Tell them, (O Muhammad): \"Everyone is waiting for his end. Wait, then, and you will soon know who are the people of the Right Way, and are rightly-guided.\"\n",
        "TRANSLATION_3": "(Muhammad), tell them, \"Everyone is waiting. Wait and you shall know very soon who will be the followers of the right path with the right guidance.\"\n",
        "TRANSLATION_4": "Proclaim, “Each one is waiting; so you too wait; very soon you will come to know who are the people of the right path, and who has attained guidance.”\n",
        "TRANSLATION_5": "(Say) \"Say, O Muhammad, to those who deny you, oppose you and continue in their disbelief and obstinance.\"\n",
        "TRANSLATION_6": "Say: Every one (of us) is awaiting, therefore do await: So you will come to know who is the follower of the even path and who goes aright.\n",
        "TRANSLATION_7": "Say: 'Everyone is waiting; so wait, and assuredly you shall know who are the travellers on the even path, and who is guided.'\n",
        "TRANSLATION_8": "Say: Each is awaiting; so await ye! Ye will come to know who are the owners of the path of equity, and who is right.\n",
        "TRANSLATION_9": "Say, \"Everyone is waiting; so wait if you will. You shall know who has followed the right path, and who has found guidance.\"\n",
        "TRANSLATION_10": "Say thou: everyone Is on the watch; so watch, and anon ye shall know who are the fellows of thee even path and who hath let himself be guided.\n",
        "TRANSLATION_11": "Say, ‘Everyone [of us] is waiting. So wait! Soon you will know who are the people of the right path, and who is [rightly] guided.’\n",
        "TRANSLATION_12": "Say: \"Each one (of us) is waiting: wait ye, therefore, and soon shall ye know who it is that is on the straight and even way, and who it is that has received Guidance.\"\n",
        "TRANSLATION_13": "Say (O Muhammad SAW): \"Each one (believer and disbeliever, etc.) is waiting, so wait you too, and you shall know who are they that are on the Straight and Even Path (i.e. Allah's Religion of Islamic Monotheism), and who are they that have let themselves be guided (on the Right Path).\n",
        "TRANSLATION_14": "Say: 'Everyone is waiting; so wait. Indeed, you shall know who are the companions of the Even Path, and those who are guided'\n",
        "TRANSLATION_15": "Say, “Everybody is waiting, so wait. You will know who the people of the straight path are, and who is rightly-guided.\n",
        "TRANSLATION_16": "Say, \"Each [of us] is waiting; so wait. For you will know who are the companions of the sound path and who is guided.\"\n",
        "TRANSLATION_17": "[20:135] Say, to them: ‘Each, [one] of us and you, is waiting, to [see] what this affair will lead to. So wait! For you shall indeed know, at the Resurrection, who are the followers of the even path, the straight way, and who is [rightly] guided’, away from error, us or you.\n",
        "TRANSLATION_18": "(Say) to them, Muhammad: (Each) one of us and you (is awaiting) the destruction of his opponent; (so await ye! Ye will come to know) upon the advent of chastisement on the Day of Judgement (who are the owners of the path of equity) the path of justice, (and who is right) and who among us is guided to faith'. And of the surah in which the Prophets are mentioned, which is all Meccan, and consists of 111 verses, 1,138 words and 4,860 letters: Surah 21: The Prophets (al-Anbiya') And of the surah in which the Prophets are mentioned, which is all Meccan, and consists of 1 1 1 verses, 1,138 words and 4,860 letters:\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "20:135",
            "50:14",
            "37:118",
            "19:43",
            "1:6",
            "7:86",
            "67:22",
            "22:24",
            "67:29",
            "38:19"
        ],
        "BIBLE": [
            "torah:exodus:33:13",
            "torah:genesis:44:4",
            "prophets:ii%20kings:6:19",
            "torah:exodus:8:18",
            "prophets:ii%20samuel:2:27",
            "prophets:ii%20samuel:2:26",
            "prophets:i%20samuel:9:27",
            "prophets:jeremiah:2:23",
            "torah:exodus:9:29",
            "prophets:joshua:3:16"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:1:5"
        ]
    }
}