{
    "VERSE": "20:16",
    "ARABIC": "فَلَا يَصُدَّنَّكَ عَنْهَا مَن لَّا يُؤْمِنُ بِهَا وَٱتَّبَعَ هَوَىٰهُ فَتَرْدَىٰ",
    "ENGLISH": {
        "TRANSLATION_0": "Do not let those who have no iman in it and follow their whims and desires debar you from it or you will be destroyed.",
        "TRANSLATION_1": "So do not let those who do not believe in it and follow their vain desires, turn you away from it.\n",
        "TRANSLATION_2": "Let him who does not believe in it and follows his lust not turn your thought away from it, lest you are ruined.\n",
        "TRANSLATION_3": "Let not the unbelievers who follow their vain desires make you forget the Day of Judgment, lest you will perish.\"\n",
        "TRANSLATION_4": "“Therefore never let one, who does not accept faith in it and follows his own desires, prevent you from accepting this, so then you become ruined.”\n",
        "TRANSLATION_5": "Therefore, let not the one who believes not therein, but follows his own lusts, divert you therefrom, lest you perish.\"\n",
        "TRANSLATION_6": "Therefore let not him who believes not in it and follows his low desires turn you away from it so that you should perish;\n",
        "TRANSLATION_7": "Let none bar thee from it, that believes not in it but follows after his own caprice, or thou wilt perish.\n",
        "TRANSLATION_8": "Therefor, let not him turn thee aside from (the thought of) it who believeth not therein but followeth his own desire, lest thou perish.\n",
        "TRANSLATION_9": "Do not let anyone who does not believe in it and follows his own desires turn you away from it and so bring you to ruin.\"\n",
        "TRANSLATION_10": "So let not him who believeth not therein and followeth his own desire keep thee away therefrom lest thou perish.\n",
        "TRANSLATION_11": "So do not let yourself be distracted from it by those who do not believe in it and who follow their desires, or you will perish.’\n",
        "TRANSLATION_12": "Therefore let not such as believe not therein but follow their own lusts, divert thee therefrom, lest thou perish!\"..\n",
        "TRANSLATION_13": "Therefore, let not the one who believes not therein (i.e. in the Day of Resurrection, Reckoning, Paradise and Hell, etc.), but follows his own lusts, divert you therefrom, lest you perish.\n",
        "TRANSLATION_14": "Do not let those who disbelieve in it and follow their desires bar you from it, or you will perish.\n",
        "TRANSLATION_15": "And do not let him who denies it and follows his desire turn you away from it, lest you fall.\n",
        "TRANSLATION_16": "So do not let one avert you from it who does not believe in it and follows his desire, for you [then] would perish.\n",
        "TRANSLATION_17": "[20:16] So do not let him bar you, distract you, from it, that is, from believing in it, who believes not in it but follows his own whim, in denying [the truth of] it, lest you perish, that is, lest you be ruined if you are barred from [remembering] it.\n",
        "TRANSLATION_18": "(Therefore, let not him turn thee aside from it) so let him not bar you from believing in it he (who believeth not therein but followeth his own desire) through denial and worship of idols, (lest thou perish).\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "20:16",
            "53:3",
            "45:18",
            "43:75",
            "56:19",
            "10:95",
            "52:16",
            "15:94",
            "5:79",
            "36:76"
        ],
        "BIBLE": [
            "torah:numbers:14:43",
            "prophets:zephaniah:3:20",
            "torah:deuteronomy:9:3",
            "prophets:i%20samuel:22:18",
            "writings:i%20chronicles:10:4",
            "torah:exodus:23:27",
            "prophets:isaiah:10:2",
            "prophets:ii%20samuel:2:21",
            "torah:genesis:38:16",
            "prophets:ezekiel:43:27"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:4:9"
        ]
    }
}