{
    "VERSE": "20:18",
    "ARABIC": "قَالَ هِىَ عَصَاىَ أَتَوَكَّؤُا۟ عَلَيْهَا وَأَهُشُّ بِهَا عَلَىٰ غَنَمِى وَلِىَ فِيهَا مَـَٔارِبُ أُخْرَىٰ",
    "ENGLISH": {
        "TRANSLATION_0": "He said, 'It is my staff. I lean on it and beat down leaves for my sheep with it and have other uses for it.'",
        "TRANSLATION_1": "It's my staff,\" he answered; \"I lean on it, and fell leaves for my goats with it, and I have other uses for it.\"\n",
        "TRANSLATION_2": "Moses answered: \"This is my staff. I lean on it (when I walk), and with it I beat down leaves for my flock, and I have many other uses for it.\"\n",
        "TRANSLATION_3": "He replied, \"It is my staff. I lean on it, bring down leaves for my sheep with it and I need it for other reasons.\n",
        "TRANSLATION_4": "He said, “This is my staff; I support myself on it, and I knock down leaves for my sheep with it, and there are other uses for me in it.”\n",
        "TRANSLATION_5": "He said: \"This is my stick, whereon I lean, and wherewith I beat down branches for my sheep, and wherein I find other uses.\"\n",
        "TRANSLATION_6": "He said: This is my staff: I recline on it and I beat the leaves with it to make them fall upon my sheep, and I have other uses for it.\n",
        "TRANSLATION_7": "Why, it is my staff,' said Moses. 'I lean upon it, and with it I beat down leaves to feed my sheep; other uses also I find in it.\n",
        "TRANSLATION_8": "He said: This is my staff whereon I lean, and wherewith I bear down branches for my sheep, and wherein I find other uses.\n",
        "TRANSLATION_9": "He replied, \"It is my staff. I lean on it, and with it, I beat down the leaves for my flock; I also have other uses for it.\"\n",
        "TRANSLATION_10": "He said: it is my staff; I lean there on; and therewith beat down fodder for my sheep; and for me therein are other purposes.\n",
        "TRANSLATION_11": "He said, ‘It is my staff. I lean on it, and with it I beat down leaves for my sheep; and I have other uses for it.’\n",
        "TRANSLATION_12": "He said, \"It is my rod: on it I lean; with it I beat down fodder for my flocks; and in it I find other uses.\"\n",
        "TRANSLATION_13": "He said: \"This is my stick, whereon I lean, and wherewith I beat down branches for my sheep, and wherein I find other uses.\"\n",
        "TRANSLATION_14": "It is my staff,\" Moses replied, \"upon it I lean and with it I beat down leaves to feed my sheep and for me there are other uses in it'\n",
        "TRANSLATION_15": "He said, “This is my staff. I lean on it, and herd my sheep with it, and I have other uses for it.”\n",
        "TRANSLATION_16": "He said, \"It is my staff; I lean upon it, and I bring down leaves for my sheep and I have therein other uses.\"\n",
        "TRANSLATION_17": "[20:18] He said, ‘It is my staff. I lean, I support myself, upon it, when I leap [across something] or walk, and I beat down [leaves], I strike the leaves on trees, with it, so that they fall, for my sheep, which then consume them; and I have uses for it (ma’ārib, ‘uses’, is the plural of ma’ruba, with the rā’ taking any [one] of the three vowels [sc. ma’ruba, ma’raba or ma’riba] meaning ‘needs’) in other ways, such as [using it] to carry food supplies and waterskins, as well as to drive away [undesirable] animals. He [Moses] gives an extensive response to indicate his [many] needs for it.\n",
        "TRANSLATION_18": "He said: This is my staff whereon I lean) when I am tired, (and wherewith I beat down branches for my 337 sheep, and wherein I find other uses) different other uses.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "20:18",
            "20:55",
            "44:28",
            "37:78",
            "37:129",
            "37:108",
            "37:119",
            "20:37",
            "24:23",
            "21:11"
        ],
        "BIBLE": [
            "prophets:ii%20kings:6:6",
            "writings:i%20chronicles:10:4",
            "prophets:joel:2:19",
            "prophets:ii%20kings:7:2",
            "prophets:ii%20kings:7:19",
            "prophets:ezekiel:37:19",
            "prophets:isaiah:44:19",
            "torah:exodus:5:14",
            "writings:daniel:5:17",
            "writings:daniel:2:5"
        ]
    }
}