{
    "VERSE": "20:22",
    "ARABIC": "وَٱضْمُمْ يَدَكَ إِلَىٰ جَنَاحِكَ تَخْرُجْ بَيْضَآءَ مِنْ غَيْرِ سُوٓءٍ ءَايَةً أُخْرَىٰ",
    "ENGLISH": {
        "TRANSLATION_0": "Put your hand under your arm and press it to your side. It will emerge pure white yet quite unharmed, another Sign.",
        "TRANSLATION_1": "And face what is to come with patience, your hand will not be tarnished with blame: Another sign\n",
        "TRANSLATION_2": "And place your hand in your armpit, it will come forth shining white, without blemish. This is another Sign of Allah,\n",
        "TRANSLATION_3": "Now - as another Sign - place your hand under your arm and it will come out sheer white without harm (or stain).\n",
        "TRANSLATION_4": "“And put your hand inside your armpit – it will come out shining white, not due to any illness – one more sign.”\n",
        "TRANSLATION_5": "And press your (right) hand to your (left) side: it will come forth white (and shining), without any disease as another sign,\"\n",
        "TRANSLATION_6": "And press your hand to your side, it shall come out white without evil: another sign:\n",
        "TRANSLATION_7": "Now clasp thy hand to thy arm-pit; it shall come forth white, without evil. That is a second sign.\n",
        "TRANSLATION_8": "And thrust thy hand within thine armpit, it will come forth white without hurt. (That will be) another token.\n",
        "TRANSLATION_9": "Put your hand under your armpit: it will come out [shining] white, without any blemish. This shall be another sign.\n",
        "TRANSLATION_10": "And press thy hand to thy side, it will come forth white, without hurt, as anot her sign.\n",
        "TRANSLATION_11": "Now clasp your hand to your armpit: it will emerge white, without any harm—[this is yet] another sign,\n",
        "TRANSLATION_12": "Now draw thy hand close to thy side: It shall come forth white (and shining), without harm (or stain),- as another Sign,-\n",
        "TRANSLATION_13": "And press your (right) hand to your (left) side, it will come forth white (and shining), without any disease as another sign,\n",
        "TRANSLATION_14": "Now, put your hand under your armpit. It shall come out white, without evil, a second sign.\n",
        "TRANSLATION_15": "And press your hand to your side; it will come out white, without a blemish—another sign.\n",
        "TRANSLATION_16": "And draw in your hand to your side; it will come out white without disease - another sign,\n",
        "TRANSLATION_17": "[20:22] And thrust your hand, the right one, meaning, the palm, into your flank — that is, your left side, below the arm into the armpit, and [then] take it out — it will emerge white, in contrast to the skin-colour that it was, without any fault, that is, [without any sign of] leprosy, radiating like the rays of the sun, blinding to the eyes [of onlookers]. [That is] yet another sign (āyatan ukhrā: this together with baydā’a, ‘white’, constitute two circumstantial qualifiers referring to the subject of [the verb] takhruj, ‘it will emerge’).\n",
        "TRANSLATION_18": "(And thrust thy hand within your armpit, it will come forth white) shining (without hurt) it is not touched by leprosy. ((That will be) another token) another sign in addition to the staff.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "20:22",
            "27:12",
            "28:32",
            "26:33",
            "24:1",
            "30:7",
            "28:47",
            "26:215",
            "7:73",
            "7:108"
        ],
        "BIBLE": [
            "writings:psalms:74:11",
            "torah:exodus:15:9",
            "writings:ii%20chronicles:6:32",
            "prophets:ezekiel:16:39",
            "writings:ii%20chronicles:34:25",
            "prophets:ii%20kings:22:17",
            "prophets:isaiah:25:10",
            "torah:genesis:47:29",
            "prophets:jeremiah:22:3",
            "writings:i%20chronicles:21:16"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:5:2",
            
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:13"
        ]
    }
}