{
    "VERSE": "20:42",
    "ARABIC": "ٱذْهَبْ أَنتَ وَأَخُوكَ بِـَٔايَٰتِى وَلَا تَنِيَا فِى ذِكْرِى",
    "ENGLISH": {
        "TRANSLATION_0": "Go, you and your brother, with My Signs and do not slacken in remembering Me.",
        "TRANSLATION_1": "Go with My signs, you and your brother, and do not be lax in remembering Me.\n",
        "TRANSLATION_2": "So go forth, both you and your brother, with My Signs, and do not slacken in remembering Me.\n",
        "TRANSLATION_3": "Go with your brother. Take My miracles and do not be reluctant in preaching My message.\n",
        "TRANSLATION_4": "“You and your brother, both go with My signs, and do not slacken in My remembrance.”\n",
        "TRANSLATION_5": "Go you and your brother with My Ayat, and do not, you both, slacken and become weak in My remembrance.\n",
        "TRANSLATION_6": "Go you and your brother with My communications and be not remiss in remembering Me;\n",
        "TRANSLATION_7": "go therefore, thou and thy brother; with My signs, and neglect not to remember Me.\n",
        "TRANSLATION_8": "Go, thou and thy brother, with My tokens, and be not faint in remembrance of Me.\n",
        "TRANSLATION_9": "Go, you and your brother, with My signs, and do not be remiss in remembering Me.\n",
        "TRANSLATION_10": "Go thou and thy brother with My signs, and slacken not in remembrance of Mine.\n",
        "TRANSLATION_11": "‘Go ahead, you and your brother, with My signs and do not flag in My remembrance.\n",
        "TRANSLATION_12": "Go, thou and thy brother, with My Signs, and slacken not, either of you, in keeping Me in remembrance.\n",
        "TRANSLATION_13": "Go you and your brother with My Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.), and do not, you both, slacken and become weak in My Remembrance.\n",
        "TRANSLATION_14": "Go, you and your brother with My signs, and do not be negligent of My Remembrance.\n",
        "TRANSLATION_15": "Go, you and your brother, with My signs, and do not neglect My remembrance.\n",
        "TRANSLATION_16": "Go, you and your brother, with My signs and do not slacken in My remembrance.\n",
        "TRANSLATION_17": "[20:42] Go, you and your brother, to the people, with My, nine, signs, and do not flag, be remiss, in remembrance of Me, by uttering glorifications and otherwise.\n",
        "TRANSLATION_18": "(Go, thou and thy brother) Aaron, (with My tokens) the hand and the staff, (and be not faint in remembrance of Me) do not weaken, wane or slacken in conveying My message to Pharaoh.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "20:42",
            "23:45",
            "78:28",
            "12:7",
            "12:69",
            "43:69",
            "28:35",
            "39:59",
            "37:14",
            "23:105"
        ],
        "BIBLE": [
            "torah:leviticus:25:36",
            "writings:psalms:16:1",
            "prophets:i%20kings:20:33",
            "writings:ii%20chronicles:30:23",
            "torah:exodus:16:33",
            "torah:genesis:4:15",
            "torah:genesis:12:19",
            "writings:job:22:6",
            "prophets:jeremiah:15:15",
            "prophets:jeremiah:48:7"
        ]
    }
}