{
    "VERSE": "20:43",
    "ARABIC": "ٱذْهَبَآ إِلَىٰ فِرْعَوْنَ إِنَّهُۥ طَغَىٰ",
    "ENGLISH": {
        "TRANSLATION_0": "Go to Pharaoh; he has overstepped the bounds.",
        "TRANSLATION_1": "Then go to the Pharaoh as he has become exceedingly rebellious.\n",
        "TRANSLATION_2": "Go both of you to Pharaoh, for he has transgressed all bounds,\n",
        "TRANSLATION_3": "Go both of you to the Pharaoh; he has become a rebel.\n",
        "TRANSLATION_4": "“Both of you go to Firaun; he has indeed rebelled.”\n",
        "TRANSLATION_5": "Go both of you to Fir`awn, verily, he has transgressed.\n",
        "TRANSLATION_6": "Go both to Firon, surely he has become inordinate;\n",
        "TRANSLATION_7": "Go to Pharaoh, for he has waxed insolent;\n",
        "TRANSLATION_8": "Go, both of you, unto Pharaoh. Lo! he hath transgressed (the bounds).\n",
        "TRANSLATION_9": "Go, both of you to Pharaoh, for he has transgressed all bounds.\n",
        "TRANSLATION_10": "Go ye twain unto Fir'awn, verily he hath waxen exorbitant,\n",
        "TRANSLATION_11": "Both of you go to Pharaoh, for he has indeed rebelled.\n",
        "TRANSLATION_12": "Go, both of you, to Pharaoh, for he has indeed transgressed all bounds;\n",
        "TRANSLATION_13": "Go, both of you, to Fir'aun (Pharaoh), verily, he has transgressed (all bounds in disbelief and disobedience and behaved as an arrogant and as a tyrant).\n",
        "TRANSLATION_14": "Go to Pharaoh, for he has become insolent.\n",
        "TRANSLATION_15": "Go to Pharaoh. He has tyrannized.\n",
        "TRANSLATION_16": "Go, both of you, to Pharaoh. Indeed, he has transgressed.\n",
        "TRANSLATION_17": "[20:43] Go the two of you to Pharaoh. Truly he has transgressed [the bounds], in claiming to be the Lord.\n",
        "TRANSLATION_18": "(Go, both of you, unto Pharaoh. Lo! he hath transgressed (the bounds)) he has become arrogant, overweening and a disbeliever.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "20:43",
            "79:17",
            "20:24",
            "44:31",
            "74:18",
            "85:13",
            "37:94",
            "10:56",
            "73:15",
            "84:14"
        ],
        "BIBLE": [
            "prophets:ii%20samuel:13:15",
            "prophets:jeremiah:5:23",
            "torah:genesis:47:10",
            "torah:exodus:10:18",
            "writings:lamentations:3:42",
            "torah:deuteronomy:1:43",
            "torah:exodus:7:10",
            "torah:exodus:8:26",
            "torah:genesis:49:4",
            "torah:exodus:9:33"
        ]
    }
}