{
    "VERSE": "20:44",
    "ARABIC": "فَقُولَا لَهُۥ قَوْلًا لَّيِّنًا لَّعَلَّهُۥ يَتَذَكَّرُ أَوْ يَخْشَىٰ",
    "ENGLISH": {
        "TRANSLATION_0": "But speak to him with gentle words so that hopefully he will pay heed or show some fear.'",
        "TRANSLATION_1": "Speak to him gently. He may possibly take heed or may come to have fear.\"\n",
        "TRANSLATION_2": "and speak to him gently, perhaps he may take heed or fear (Allah).\"\n",
        "TRANSLATION_3": "Both of you must speak with him in a gentle manner so that perhaps he may come to himself or have fear (of God).\"\n",
        "TRANSLATION_4": "“And speak to him courteously, that perhaps he may ponder or have some fear.”\n",
        "TRANSLATION_5": "And speak to him mildly, perhaps he may accept admonition or fear (Allah).\n",
        "TRANSLATION_6": "Then speak to him a gentle word haply he may mind or fear.\n",
        "TRANSLATION_7": "yet speak gently to him, that haply he may be mindful, or perchance fear.'\n",
        "TRANSLATION_8": "And speak unto him a gentle word, that peradventure he may heed or fear.\n",
        "TRANSLATION_9": "But speak gently to him; perhaps he may yet take heed or even feel afraid.\"\n",
        "TRANSLATION_10": "Then say to him a gentle saying; haply he may be admonished or he may fear.\n",
        "TRANSLATION_11": "Speak to him in a soft manner; maybe he will take admonition or fear.’\n",
        "TRANSLATION_12": "But speak to him mildly; perchance he may take warning or fear (Allah).\"\n",
        "TRANSLATION_13": "And speak to him mildly, perhaps he may accept admonition or fear Allah.\"\n",
        "TRANSLATION_14": "Speak to him with gentle words; perhaps he will ponder or fear'\n",
        "TRANSLATION_15": "But speak to him nicely. Perhaps he will remember, or have some fear.”\n",
        "TRANSLATION_16": "And speak to him with gentle speech that perhaps he may be reminded or fear [Allah].\"\n",
        "TRANSLATION_17": "[20:44] And speak to him gentle words, for him to renounce such [claims], that perhaps he may be mindful, be admonished, or fear’, God and so repent — the ‘hope’ [for Pharaoh’s repentance] is [expressed] from their perspective, for God knows that he was not going to repent.\n",
        "TRANSLATION_18": "(And speak unto him a gentle word) a kind word: \"there is no deity except Allah\"; it is also said that this means: call him by his agnomen, (that peradventure he may heed) that perhaps he may take admonition (or fear) or surrender [to Allah].\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "20:44",
            "75:34",
            "75:35",
            "76:26",
            "75:19",
            "37:143",
            "37:148",
            "74:14",
            "21:111",
            "71:9"
        ],
        "BIBLE": [
            "torah:exodus:20:1",
            "prophets:ezekiel:12:28",
            "prophets:jeremiah:30:2",
            "prophets:jeremiah:42:4",
            "prophets:joshua:1:13",
            "torah:exodus:19:9",
            "torah:numbers:23:27",
            "torah:genesis:39:19",
            "prophets:joshua:3:9",
            "torah:numbers:22:38"
        ]
    }
}