{
    "VERSE": "20:48",
    "ARABIC": "إِنَّا قَدْ أُوحِىَ إِلَيْنَآ أَنَّ ٱلْعَذَابَ عَلَىٰ مَن كَذَّبَ وَتَوَلَّىٰ",
    "ENGLISH": {
        "TRANSLATION_0": "It has been revealed to us that punishment is for him who denies the truth and turns away.'\"",
        "TRANSLATION_1": "It has been revealed to us that punishment will befall him who denies and turns away.\n",
        "TRANSLATION_2": "It has been revealed to us that chastisement awaits those who called the lie to the truth and turned away from it.' \"\n",
        "TRANSLATION_3": "It is revealed to us that those who call our message a lie or turn away from it will face the torment.\"\n",
        "TRANSLATION_4": "‘It has indeed been revealed to us that the punishment is upon the one who denies and turns away.’”\n",
        "TRANSLATION_5": "`Truly, it has been revealed to us that the torment will be for him who denies, and turns away.`\"\n",
        "TRANSLATION_6": "Surely it has been revealed to us that the chastisement will surely come upon him who rejects and turns back.\n",
        "TRANSLATION_7": "It has been revealed to us that chastisement shall light upon him who cries lies and turns his back.\"\n",
        "TRANSLATION_8": "Lo! it hath been revealed unto us that the doom will be for him who denieth and turneth away.\n",
        "TRANSLATION_9": "it has been revealed to us that punishment shall overtake him who rejects it and turns away!'\"\n",
        "TRANSLATION_10": "Verily We! it hath been revealed unto us that the torment will be for him who belieth and turneth away.\n",
        "TRANSLATION_11": "Indeed it has been revealed to us that punishment shall befall those who impugn us and turn their backs [on us].’’ ’\n",
        "TRANSLATION_12": "Verily it has been revealed to us that the Penalty (awaits) those who reject and turn away.'\"\n",
        "TRANSLATION_13": "Truly, it has been revealed to us that the torment will be for him who denies [believes not in the Oneness of Allah, and in His Messengers, etc.], and turns away.'(from the truth and obedience of Allah)\"\n",
        "TRANSLATION_14": "It is revealed to us that a punishment will fall on those who belie and turn away.\"\n",
        "TRANSLATION_15": "It was revealed to us that the punishment falls upon him who disbelieves and turns away.'“\n",
        "TRANSLATION_16": "Indeed, it has been revealed to us that the punishment will be upon whoever denies and turns away.' \"\n",
        "TRANSLATION_17": "[20:48] Indeed it has been revealed to us that the chastisement shall befall him who denies, [the truth of] what we have brought, and turns away” ’, [and who] rejects it. And so they came to him and said [to him] all of what has been mentioned.\n",
        "TRANSLATION_18": "(Lo! it hath been revealed unto us that the) continuous (doom will be for him who denieth) God's divine Oneness (and turneth away) from faith.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "20:48",
            "39:40",
            "22:4",
            "11:39",
            "29:54",
            "44:12",
            "44:30",
            "19:79",
            "37:9",
            "3:88"
        ],
        "BIBLE": [
            "prophets:joshua:7:8",
            "writings:song%20of%20songs:5:6",
            "writings:daniel:11:19",
            "prophets:joshua:7:26",
            "torah:exodus:3:4",
            "writings:ii%20chronicles:7:14",
            "prophets:hosea:14:5",
            "prophets:jeremiah:34:15",
            "torah:numbers:14:43",
            "prophets:jonah:3:9"
        ]
    }
}