{
    "VERSE": "20:55",
    "ARABIC": "مِنْهَا خَلَقْنَٰكُمْ وَفِيهَا نُعِيدُكُمْ وَمِنْهَا نُخْرِجُكُمْ تَارَةً أُخْرَىٰ",
    "ENGLISH": {
        "TRANSLATION_0": "From it We created you, to it We will return you, and from it We will bring you forth a second time.",
        "TRANSLATION_1": "We created you from the earth and will revert you back to it; and raise you up from it a second time.\n",
        "TRANSLATION_2": "From this very earth We created you and to the same earth We shall cause you to return, and from it We shall bring you forth to life again.\n",
        "TRANSLATION_3": "We have created you from the earth to which We will return you and will bring you back to life again.\n",
        "TRANSLATION_4": "From the earth We have created you, and to it We shall return you, and from it We shall raise you again.\n",
        "TRANSLATION_5": "Thereof We created you, and into it We shall return you, and from it We shall bring you out once again.\n",
        "TRANSLATION_6": "From it We created you and into it We shall send you back and from it will We raise you a second time.\n",
        "TRANSLATION_7": "Out of the earth We created you, and We shall restore you into it, and bring you forth from it a second time.'\n",
        "TRANSLATION_8": "Thereof We created you, and thereunto We return you, and thence We bring you forth a second time.\n",
        "TRANSLATION_9": "From the earth We have created you and We will return you to it, and from it We shall bring you forth a second time.\n",
        "TRANSLATION_10": "Thereof We created you, and thereunto We return you, and therefrom We shall bring You forth once again.\n",
        "TRANSLATION_11": "From it did We create you, into it shall We return you, and from it shall We bring you forth another time.\n",
        "TRANSLATION_12": "From the (earth) did We create you, and into it shall We return you, and from it shall We bring you out once again.\n",
        "TRANSLATION_13": "Thereof (the earth) We created you, and into it We shall return you, and from it We shall bring you out once again.\n",
        "TRANSLATION_14": "We created you from it (the earth), and to it We shall restore you; and from it We will bring you forth yet a second time.\n",
        "TRANSLATION_15": "From it We created you, and into it We will return you, and from it We will bring you out another time.\n",
        "TRANSLATION_16": "From the earth We created you, and into it We will return you, and from it We will extract you another time.\n",
        "TRANSLATION_17": "[20:55] From it, that is, from the earth, We created you, by creating your father Adam from it, and into it We shall restore you, [when you are] interred after death, and from it We shall bring you forth, at the Resurrection, a second time’, in the same way that We brought you forth [from it] when We initiated your creation.\n",
        "TRANSLATION_18": "(Thereof) from the earth (We created you) He says We created you from Adam and Adam is from dust, and the dust is from the earth, (and thereunto) to the earth (we return you) He says: We bury you (and thence) from the earth (We bring you forth) He says: from the grave We shall bring you forth (a second time) after death, i.e. for the Resurrection.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "20:55",
            "44:28",
            "37:78",
            "37:108",
            "37:119",
            "37:129",
            "17:69",
            "26:64",
            "37:136",
            "37:82"
        ],
        "BIBLE": [
            "prophets:micah:5:2",
            "prophets:hosea:6:2",
            "prophets:jeremiah:49:37",
            "torah:genesis:43:10",
            "writings:daniel:11:29",
            "prophets:jeremiah:25:32",
            "prophets:i%20samuel:2:35",
            "prophets:ezekiel:7:13",
            "prophets:jeremiah:31:8",
            "torah:genesis:18:14"
        ]
    }
}