{
    "VERSE": "20:66",
    "ARABIC": "قَالَ بَلْ أَلْقُوا۟ فَإِذَا حِبَالُهُمْ وَعِصِيُّهُمْ يُخَيَّلُ إِلَيْهِ مِن سِحْرِهِمْ أَنَّهَا تَسْعَىٰ",
    "ENGLISH": {
        "TRANSLATION_0": "He said, 'No, you throw!' And suddenly their ropes and staffs appeared to him, by their magic, to be slithering about.",
        "TRANSLATION_1": "Moses said: \"No. You cast it first\" Then it seemed to Moses that by their magic their cords and rods were flying;\n",
        "TRANSLATION_2": "Moses replied: \"No, let it be you to throw first.\" Then suddenly it appeared to Moses, owing to their magic, as if their ropes and staffs were running.\n",
        "TRANSLATION_3": "Moses said, \"You throw first.\" When they did, their ropes and staffs through their magic seemed to be moving.\n",
        "TRANSLATION_4": "He said, “Rather, you may throw”; thereupon their cords and their staves, by the strength of their magic, appeared to him as if they were (serpents) moving fast.\n",
        "TRANSLATION_5": "[Musa] said: \"Nay, throw you (first)!\" Then behold! their ropes and their sticks, by their magic, appeared to him as though they moved fast.\n",
        "TRANSLATION_6": "He said: Nay! cast down. then lo! their cords and their rods-- it was imaged to him on account of their magic as if they were running.\n",
        "TRANSLATION_7": "No,' said Moses. 'Do you cast!' And lo, it seemed to him, by their sorcery, their ropes and their staffs were sliding;\n",
        "TRANSLATION_8": "He said: Nay, do ye throw! Then lo! their cords and their staves, by their magic, appeared to him as though they ran.\n",
        "TRANSLATION_9": "Moses said, \"You throw down first.\" Suddenly their ropes and staffs appeared to him, by their magic, to be moving about rapidly,\n",
        "TRANSLATION_10": "He said: nay, cast ye down. And lo! their cords and their staves were made to appear to him by their magic as though they were running.\n",
        "TRANSLATION_11": "He said, ‘No, you throw first.’ Thereupon, behold, their ropes and staffs appeared to him by their magic to wriggle swiftly.\n",
        "TRANSLATION_12": "He said, \"Nay, throw ye first!\" Then behold their ropes and their rods-so it seemed to him on account of their magic - began to be in lively motion!\n",
        "TRANSLATION_13": "[Musa (Moses)] said: \"Nay, throw you (first)!\" Then behold, their ropes and their sticks, by their magic, appeared to him as though they moved fast.\n",
        "TRANSLATION_14": "Moses replied: 'No, you throw first' And by their sorcery it seemed to him that their ropes and staffs were sliding.\n",
        "TRANSLATION_15": "He said, “You throw.” And suddenly, their ropes and sticks appeared to him, because of their magic, to be crawling swiftly.\n",
        "TRANSLATION_16": "He said, \"Rather, you throw.\" And suddenly their ropes and staffs seemed to him from their magic that they were moving [like snakes].\n",
        "TRANSLATION_17": "[20:66] He said, ‘Nay, you cast!’, and so they cast, and lo! their ropes and their staffs (‘isiyyihim: derives from ‘isūwwun, but the two wāw [letters] have been changed into two yā’ [letters], with the kasra vowelling applied to both the ‘ayn and the sād) appeared to him by [the effect of] their sorcery as though they were, snakes, gliding swiftly, on their bellies.\n",
        "TRANSLATION_18": "(He said) Moses said to them: (Nay, do ye throw) you first! And so they threw 72 staffs and 72 ropes. (Then Lo! their cords and their staves, by their magic, appeared to him) to Moses (as though they ran) they moved about.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "20:66",
            "26:44",
            "7:117",
            "7:107",
            "51:18",
            "26:35",
            "26:45",
            "2:46",
            "37:15",
            "7:116"
        ],
        "BIBLE": [
            "prophets:judges:13:10",
            "prophets:ii%20samuel:18:19",
            "prophets:ii%20kings:6:6",
            "torah:numbers:11:27",
            "torah:exodus:9:23",
            "prophets:ii%20kings:5:20",
            "torah:exodus:4:3",
            "prophets:ii%20samuel:18:22",
            "prophets:ii%20samuel:18:23",
            "prophets:i%20kings:2:39"
        ]
    }
}