{
    "VERSE": "20:71",
    "ARABIC": "قَالَ ءَامَنتُمْ لَهُۥ قَبْلَ أَنْ ءَاذَنَ لَكُمْ إِنَّهُۥ لَكَبِيرُكُمُ ٱلَّذِى عَلَّمَكُمُ ٱلسِّحْرَ فَلَأُقَطِّعَنَّ أَيْدِيَكُمْ وَأَرْجُلَكُم مِّنْ خِلَٰفٍ وَلَأُصَلِّبَنَّكُمْ فِى جُذُوعِ ٱلنَّخْلِ وَلَتَعْلَمُنَّ أَيُّنَآ أَشَدُّ عَذَابًا وَأَبْقَىٰ",
    "ENGLISH": {
        "TRANSLATION_0": "Pharaoh said, 'Do you have iman in him before I have authorised you? He is your chief, the one who taught you magic. I will cut off your hands and feet alternately and have you crucified on palm trunks. Then you will know for certain which of us has the harsher and longer lasting punishment.'",
        "TRANSLATION_1": "(The Pharaoh) said: \"You have come to believe without my dispensation. Surely he is your chief who taught you magic. I will have your hands and feet cut off on alternate sides and crucify you on the trunks of date-palm trees. You will come to know whose punishment is harder and protracted.\"\n",
        "TRANSLATION_2": "Pharaoh said: \"What! Did you believe in Him even before I permitted you to do so? Surely, he must be your chief who taught you magic. Now I will certainly cut off your hands and your feet on opposite sides, and will crucify you on the trunks of palm-trees, and then you will come to know which of us can inflict sterner and more lasting torment.\"\n",
        "TRANSLATION_3": "The Pharaoh said, \"Since you believed in him without my permission, then Moses certainly must be your chief who has taught you magic. I shall cut your hands and feet on alternate sides and crucify you on the trunk of the palm-tree. You shall certainly find which among us can afflict a more severe and lasting punishment\".\n",
        "TRANSLATION_4": "Said Firaun, “You accepted faith in him before I permitted you! He is indeed your leader who taught you magic; I therefore swear, I will cut off your hands and your legs from alternate sides, and crucify you on the trunks of palm-trees, and you will surely come to know among us two, whose punishment is more severe and more lasting.”\n",
        "TRANSLATION_5": "(Fir`awn) said: \"Believe you in him before I give you permission Verily, he is your chief who has taught you magic. So I will surely cut off your hands and feet on opposite sides, and I will surely crucify you on the trunks of date palms, and you shall surely know which of us can give the severe and more lasting torment. \"\n",
        "TRANSLATION_6": "(Firon) said: You believe in him before I give you leave; most surely he is the chief of you who taught you enchantment, therefore I will certainly cut off your hands and your feet on opposite sides, and I will certainly crucify you on the trunks of the palm trees, and certainly you will come to know which of us is the more severe and the more abiding in chastising.\n",
        "TRANSLATION_7": "Pharaoh said, 'Have you believed him before I gave you leave? Why, he is the chief of you, the same that taught you sorcery; I shall assuredly cut off alternately your hands and feet, then I shall crucify you upon the trunks of palm-trees; you shall know of a certainty which of us is more terrible in chastisement, and more abiding.'\n",
        "TRANSLATION_8": "(Pharaoh) said: Ye put faith in him before I give you leave. Lo! he is your chief who taught you magic. Now surely I shall cut off your hands and your feet alternately, and I shall crucify you on the trunks of palm trees, and ye shall know for certain which of us hath sterner and more lasting punishment.\n",
        "TRANSLATION_9": "Pharaoh said, \"Have you believed in him before I permit you? He must be your master who has taught you magic. I will cut your hands and feet off on opposite sides, and have you crucified on the trunks of palm-trees. You shall know whose punishment is more severe and more lasting.\"\n",
        "TRANSLATION_10": "Fir'awn said; believed ye in him ere I gave you leave! verily he is your chief who hath taught you magic. So I will surely cut off your hands and feet on the opposite sides, and will surely crucify you on the trunks of palm-trees, and ye shall surely know whichever of us is severer in torment and more lasting.\n",
        "TRANSLATION_11": "He said, ‘Did you believe in him before I should permit you? He is indeed your chief who has taught you magic! Surely, I will cut off your hands and feet from opposite sides, and I will crucify you on the trunks of palm trees, and you will know which of us can inflict a severer and more lasting punishment.’\n",
        "TRANSLATION_12": "(Pharaoh) said: \"Believe ye in Him before I give you permission? Surely this must be your leader, who has taught you magic! be sure I will cut off your hands and feet on opposite sides, and I will have you crucified on trunks of palm-trees: so shall ye know for certain, which of us can give the more severe and the more lasting punishment!\"\n",
        "TRANSLATION_13": "[Fir'aun (Pharaoh)] said: \"Believe you in him [Musa (Moses)] before I give you permission? Verily! He is your chief who taught you magic. So I will surely cut off your hands and feet on opposite sides, and I will surely crucify you on the trunks of date-palms, and you shall surely know which of us [I (Fir'aun - Pharaoh) or the Lord of Musa (Moses) (Allah)] can give the severe and more lasting torment.\"\n",
        "TRANSLATION_14": "Have you believed him before I have given you permission' he (Pharaoh) said. 'Indeed, he (must be) your chief, the one who taught you sorcery. I will cut off on opposite sides a hand and a foot then crucify you on the trunks of palmtrees. Indeed, you shall know whose punishment is more stern, and more lasting'\n",
        "TRANSLATION_15": "He said, “Did you believe in him before I have given you permission? He must be your chief, who has taught you magic. I will cut off your hands and your feet on alternate sides, and I will crucify you on the trunks of the palm-trees. Then you will know which of us is more severe in punishment, and more lasting.”\n",
        "TRANSLATION_16": "[Pharaoh] said, \"You believed him before I gave you permission. Indeed, he is your leader who has taught you magic. So I will surely cut off your hands and your feet on opposite sides, and I will crucify you on the trunks of palm trees, and you will surely know which of us is more severe in [giving] punishment and more enduring.\"\n",
        "TRANSLATION_17": "[20:71] Said he, Pharaoh, ‘Do you profess belief (read a-āmantum pronouncing both hamzas, or with the second changed to an alif) in him before I, myself, give you permission? He is indeed your chief, your teacher, who taught you sorcery. I shall assuredly cut off your hands and feet on opposite sides (min khilāfin, a circumstantial qualifier meaning ‘alternate [hands and feet]’, in other words, the right hands and the left   feet) and I shall assuredly crucify you on the trunks of palm trees. And you shall then know which of us — meaning himself and the Lord of Moses — is harsher in [inflicting] chastisement, and [which of us is] more lasting’, more enduring in [sustaining] opposition to him [Moses].\n",
        "TRANSLATION_18": "(Pharaoh) said) to them: (Ye put faith in him before I give you leave) you believed in him before I commanded you to do so. (Lo! he is) i.e. Moses (your chief) the most erudite of you (who taught you magic. Now surely I shall cut off your hands and your feet alternately) the right hand with the left leg, (and I shall crucify you on the trunks of palm-trees, and ye shall know for certain which of us hath sterner and more 342 lasting punishment) me or the Lord of Moses and Aaron.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "20:71",
            "26:49",
            "7:124",
            "5:33",
            "50:36",
            "41:25",
            "35:7",
            "20:127",
            "19:23",
            "3:4"
        ],
        "BIBLE": [
            "prophets:jeremiah:8:14",
            "torah:numbers:20:12",
            "prophets:ezekiel:25:7",
            "prophets:i%20samuel:30:23",
            "prophets:jeremiah:32:36",
            "prophets:joshua:23:13",
            "torah:genesis:31:42",
            "prophets:joshua:6:2",
            "prophets:jeremiah:32:25",
            "torah:genesis:24:18"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:1:6"
        ]
    }
}