{
    "VERSE": "20:76",
    "ARABIC": "جَنَّٰتُ عَدْنٍ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَٰرُ خَٰلِدِينَ فِيهَا وَذَٰلِكَ جَزَآءُ مَن تَزَكَّىٰ",
    "ENGLISH": {
        "TRANSLATION_0": "Gardens of Eden with rivers flowing under them, remaining in them timelessly, for ever. That is the reward of those who purify themselves.",
        "TRANSLATION_1": "Gardens of Eden with rippling streams, where he will live for ever. This is the recompense of those who achieve integrity.\n",
        "TRANSLATION_2": "and shall live for ever in everlasting Gardens beneath which rivers flow. Such will be the reward of those who purify themselves.\n",
        "TRANSLATION_3": "will be rewarded by high status in the gardens of Eden wherein streams flow. Such will be the reward of those who purify themselves.\n",
        "TRANSLATION_4": "Everlasting Gardens of Eden beneath which rivers flow, abiding in them for ever; and this is the reward of one who became pure.\n",
        "TRANSLATION_5": "`Adn Gardens, under which rivers flow, wherein they will abide forever, and such is the reward of those who purify themselves.\n",
        "TRANSLATION_6": "The gardens of perpetuity, beneath which rivers flow, to abide therein; and this is the reward of him who has purified himself.\n",
        "TRANSLATION_7": "Gardens of Eden, underneath which rivers flow, therein dwelling forever; that is the recompense of the self-purified.\n",
        "TRANSLATION_8": "Gardens of Eden underneath which rivers flow, wherein they will abide for ever. That is the reward of him who groweth.\n",
        "TRANSLATION_9": "he will abide forever in the Gardens of eternity, through which rivers flow. That is the recompense for those who purify themselves.\n",
        "TRANSLATION_10": "Gardens Everlasting whereunder rivers flow: abiders therein; that is the meed of him who hath purified himself.\n",
        "TRANSLATION_11": "—the Gardens of Eden, with streams running in them, to abide in them [forever], and that is the reward of him who keeps pure.\n",
        "TRANSLATION_12": "Gardens of Eternity, beneath which flow rivers: they will dwell therein for aye: such is the reward of those who purify themselves (from evil).\n",
        "TRANSLATION_13": "Adn (Edn) Paradise (everlasting Gardens), under which rivers flow, wherein they will abide forever: such is the reward of those who purify themselves [(by abstaining from all kinds of sins and evil deeds) which Allah has forbidden and by doing all that which Allah has ordained)].\n",
        "TRANSLATION_14": "living for ever in the Gardens of Eden, underneath which rivers flow. Such shall be the recompense of he who purifies himself.\n",
        "TRANSLATION_15": "The Gardens of Perpetuity, beneath which rivers flow, dwelling therein forever. That is the reward for him who purifies himself.\n",
        "TRANSLATION_16": "Gardens of perpetual residence beneath which rivers flow, wherein they abide eternally. And that is the reward of one who purifies himself.\n",
        "TRANSLATION_17": "[20:76] the Gardens of Eden, that is to say, as a [place of] residence (this [jannātu ‘Adnin, ‘Gardens of Eden’] is an explication thereof [of al-darajātu’l-‘ulā, ‘the highest degrees’]) underneath which rivers flow, abiding therein, and that is the reward of him who keeps pure, of sins.\n",
        "TRANSLATION_18": "Then He explained, saying: (Gardens of Eden) this is the Abode of the All-Merciful which He created with His own Hand and power in the middle of the Gardens of Paradise (underneath which) beneath its trees and habitations (rivers) rivers of wine, water, honey and milk (flow, wherein they will abide for ever) living in Paradise, neither to die nor leave it. (That) that Garden and eternity (is the reward of him who groweth) is the reward of he who believes in Allah's divine Oneness and then does good works.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "20:76",
            "5:85",
            "16:31",
            "3:136",
            "98:8",
            "25:10",
            "22:14",
            "9:89",
            "46:14",
            "85:11"
        ],
        "BIBLE": [
            "torah:numbers:19:17",
            "prophets:ezekiel:1:14",
            "writings:psalms:19:12",
            "writings:proverbs:6:18",
            "torah:leviticus:15:13",
            "writings:ii%20chronicles:23:12",
            "writings:song%20of%20songs:1:4",
            "prophets:isaiah:55:5",
            "prophets:i%20samuel:8:11",
            "writings:song%20of%20songs:4:15"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:2:2",
            "Sefer%20Yetzirah:1:4"
        ]
    }
}