{
    "VERSE": "20:78",
    "ARABIC": "فَأَتْبَعَهُمْ فِرْعَوْنُ بِجُنُودِهِۦ فَغَشِيَهُم مِّنَ ٱلْيَمِّ مَا غَشِيَهُمْ",
    "ENGLISH": {
        "TRANSLATION_0": "Pharaoh pursued them with his troops and the sea overwhelmed them utterly.",
        "TRANSLATION_1": "Then the Pharaoh followed them with his army, but the sea overpowered and engulfed them.\n",
        "TRANSLATION_2": "Pharaoh pursued them with his hosts, but they were fully overwhelmed by the sea.\n",
        "TRANSLATION_3": "The Pharaoh and his army chased Moses and his people but were drowned by the sea.\n",
        "TRANSLATION_4": "So Firaun went after them with his army – therefore the sea enveloped them, the way it did.\n",
        "TRANSLATION_5": "Then Fir`awn pursued them with his hosts, but the sea [Al-Yamm] completely overwhelmed them and covered them up.\n",
        "TRANSLATION_6": "And Firon followed them with his armies, so there came upon them of the sea that which came upon them.\n",
        "TRANSLATION_7": "Pharaoh followed them with his hosts, but they were overwhelmed by the sea;\n",
        "TRANSLATION_8": "Then Pharaoh followed them with his hosts and there covered them that which did cover them of the sea.\n",
        "TRANSLATION_9": "Pharaoh pursued them with his hosts, but they were submerged by the sea, which was destined to overwhelm them.\n",
        "TRANSLATION_10": "Then Fir'awn followed them with his hosts; and there came upon them of the sea that which came upon them.\n",
        "TRANSLATION_11": "Then Pharaoh pursued them with his troops, whereat they were engulfed by what engulfed them of the sea.\n",
        "TRANSLATION_12": "Then Pharaoh pursued them with his forces, but the waters completely overwhelmed them and covered them up.\n",
        "TRANSLATION_13": "Then Fir'aun (Pharaoh) pursued them with his hosts, but the sea-water completely overwhelmed them and covered them up.\n",
        "TRANSLATION_14": "Pharaoh pursued them with his legions so they were overwhelmed from the sea with that which drowned them.\n",
        "TRANSLATION_15": "Pharaoh pursued them with his troops, but the sea overwhelmed them, and completely engulfed them.\n",
        "TRANSLATION_16": "So Pharaoh pursued them with his soldiers, and there covered them from the sea that which covered them,\n",
        "TRANSLATION_17": "[20:78] Then Pharaoh pursued them with his hosts, with him [Pharaoh] alongside them, and there engulfed them what did engulf them of the sea, and it drowned them.\n",
        "TRANSLATION_18": "(Then Pharaoh followed with his hosts and there covered them that which did cover them of the sea) they drowned in the sea.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "20:78",
            "51:40",
            "28:40",
            "28:6",
            "27:17",
            "23:48",
            "11:32",
            "37:141",
            "37:173",
            "7:136"
        ],
        "BIBLE": [
            "torah:exodus:14:28",
            "prophets:joshua:3:16",
            "prophets:ii%20kings:3:9",
            "torah:exodus:24:15",
            "torah:exodus:8:2",
            "prophets:ezekiel:31:15",
            "prophets:isaiah:37:1",
            "prophets:ii%20kings:19:1",
            "writings:psalms:124:4",
            "torah:deuteronomy:3:1"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:3:2",
            
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:3:7",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:11"
        ]
    }
}