{
    "VERSE": "20:79",
    "ARABIC": "وَأَضَلَّ فِرْعَوْنُ قَوْمَهُۥ وَمَا هَدَىٰ",
    "ENGLISH": {
        "TRANSLATION_0": "Pharoah misguided his people. He was no guide.",
        "TRANSLATION_1": "The Pharaoh had led his people astray, and did not rightly guide them.\n",
        "TRANSLATION_2": "Pharaoh led his people astray; he did not guide them aright.\n",
        "TRANSLATION_3": "The Pharaoh and his people had gone away from guidance.\n",
        "TRANSLATION_4": "And Firaun led his people astray, and did not guide them.\n",
        "TRANSLATION_5": "And Fir`awn led his people astray, and he did not guide them.\n",
        "TRANSLATION_6": "And Firon led astray his people and he did not guide (them) aright.\n",
        "TRANSLATION_7": "so Pharaoh had led his people astray, and was no guide to them.\n",
        "TRANSLATION_8": "And Pharaoh led his folk astray, he did not guide them.\n",
        "TRANSLATION_9": "For Pharaoh had led his people astray and did not guide them.\n",
        "TRANSLATION_10": "And Fir'awn led his nation astray, and guided them not.\n",
        "TRANSLATION_11": "Pharaoh led his people astray and did not guide them.\n",
        "TRANSLATION_12": "Pharaoh led his people astray instead of leading them aright.\n",
        "TRANSLATION_13": "And Fir'aun (Pharaoh) led his people astray, and he did not guide them.\n",
        "TRANSLATION_14": "For Pharaoh had misled his nation, and did not guide them.\n",
        "TRANSLATION_15": "Pharaoh misled his people, and did not guide them.\n",
        "TRANSLATION_16": "And Pharaoh led his people astray and did not guide [them].\n",
        "TRANSLATION_17": "[20:79] And Pharaoh led his people astray, by calling them to worship him, and he did not guide them, nay he led them to destruction, in contrast to what he said [to them], and I guide you only to the path of rectitude [Q. 40:29].\n",
        "TRANSLATION_18": "(And Pharaoh led his folk astray) Pharaoh destroyed his people in the sea, (he did not guide them) he did not save them; it is also said that this means: he misguided them regarding Allah's religion and did not guide them to the Truth.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "20:79",
            "26:11",
            "22:43",
            "23:46",
            "26:105",
            "15:62",
            "26:160",
            "37:164",
            "43:54",
            "26:70"
        ],
        "BIBLE": [
            "writings:i%20chronicles:16:20",
            "writings:psalms:105:13",
            "prophets:hosea:9:1",
            "prophets:ezekiel:23:30",
            "torah:exodus:13:18",
            "torah:exodus:5:10",
            "prophets:jeremiah:5:23",
            "prophets:jeremiah:50:6",
            "torah:deuteronomy:4:27",
            "prophets:ezekiel:36:20"
        ]
    }
}