{
    "VERSE": "20:83",
    "ARABIC": "وَمَآ أَعْجَلَكَ عَن قَوْمِكَ يَٰمُوسَىٰ",
    "ENGLISH": {
        "TRANSLATION_0": "'Why have you hurried on ahead of your people, Musa?'",
        "TRANSLATION_1": "What made you hurry away, O Moses, from your people?\"\n",
        "TRANSLATION_2": "But, O Moses, what has made you come in haste from your people?\"\n",
        "TRANSLATION_3": "The Lord asked, \"Moses, what made you attend your appointment with Me before your people?\"\n",
        "TRANSLATION_4": "“And why did you come in haste ahead of your people, O Moosa?”\n",
        "TRANSLATION_5": "And what made you hasten from your people, O Musa\n",
        "TRANSLATION_6": "And what caused you to hasten from your people, O Musa?\n",
        "TRANSLATION_7": "What has sped thee far from thy people, Moses?'\n",
        "TRANSLATION_8": "And (it was said): What hath made thee hasten from thy folk, O Moses?\n",
        "TRANSLATION_9": "[When Moses was upon the Mount, God said,] \"O Moses, why have you come with such haste from your people?\"\n",
        "TRANSLATION_10": "And what hath made thee hasten from thy people, O Musa?\n",
        "TRANSLATION_11": "[God said,] ‘O Moses, what has prompted you to hasten ahead of your people?’\n",
        "TRANSLATION_12": "(When Moses was up on the Mount, Allah said:) \"What made thee hasten in advance of thy people, O Moses?\"\n",
        "TRANSLATION_13": "And what made you hasten from your people, O Musa (Moses)?\"\n",
        "TRANSLATION_14": "Moses, why have you come with such haste from your nation'\n",
        "TRANSLATION_15": "“And what made you rush ahead of your people, O Moses?”\n",
        "TRANSLATION_16": "[Allah] said, \"And what made you hasten from your people, O Moses?\"\n",
        "TRANSLATION_17": "[20:83] ‘And what has hurried you [to depart] from your people, in order to come to the appointed time to receive the Torah, O Moses?’\n",
        "TRANSLATION_18": "When Moses was about to go with the seventy chosen men to the tryst, he hastened and went ahead of them; (And (it was said)) Allah said to him: (What hath made thee hasten from thy folk, Moses?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "20:83",
            "20:79",
            "51:53",
            "26:11",
            "10:84",
            "15:62",
            "26:160",
            "26:105",
            "20:17",
            "51:32"
        ],
        "BIBLE": [
            "writings:psalms:31:15",
            "torah:exodus:20:17",
            "torah:exodus:32:31",
            "torah:exodus:24:12",
            "prophets:jeremiah:26:16",
            "torah:numbers:21:7",
            "torah:numbers:12:13",
            "torah:deuteronomy:27:9",
            "prophets:ezekiel:36:22",
            "torah:exodus:16:4"
        ]
    }
}