{
    "VERSE": "20:84",
    "ARABIC": "قَالَ هُمْ أُو۟لَآءِ عَلَىٰٓ أَثَرِى وَعَجِلْتُ إِلَيْكَ رَبِّ لِتَرْضَىٰ",
    "ENGLISH": {
        "TRANSLATION_0": "He said, They are following in my tracks. I have hurried on ahead to you, My Lord, to gain Your good pleasure.'",
        "TRANSLATION_1": "He said: \"They are right behind me. I have hastened to You, O Lord, so that You may be pleased.\"\n",
        "TRANSLATION_2": "He said: \"They are close behind me, and I hastened to You, Lord, that You may be pleased with me.\"\n",
        "TRANSLATION_3": "Moses replied, \"They are just behind me. I came earlier to seek Your pleasure\".\n",
        "TRANSLATION_4": "He submitted, “They are here, just behind me – and O my Lord, I hastened towards You, in order to please You.”\n",
        "TRANSLATION_5": "He said: \"They are close on my footsteps, and I hastened to You, O my Lord, that You might be pleased.\"\n",
        "TRANSLATION_6": "He said: They are here on my track and I hastened on to Thee, my Lord, that Thou mightest be pleased.\n",
        "TRANSLATION_7": "They are upon my tracks,' Moses said. 'I have hastened, Lord, only that I may please Thee.'\n",
        "TRANSLATION_8": "He said: They are close upon my track. I hastened unto Thee, my Lord, that Thou mightest be well pleased.\n",
        "TRANSLATION_9": "He said, \"They are following in my footsteps, while I have hastened to You, my Lord, to please You.\"\n",
        "TRANSLATION_10": "He said: those! they are close on my footstep, and hastened to Thee, O my Lord; that Thou mightest be wellpleased.\n",
        "TRANSLATION_11": "He said, ‘They are close upon my heels, and I hurried on to You, my Lord, that You may be pleased.’\n",
        "TRANSLATION_12": "He replied: \"Behold, they are close on my footsteps: I hastened to thee, O my Lord, to please thee.\"\n",
        "TRANSLATION_13": "He said: \"They are close on my footsteps, and I hastened to You, O my Lord, that You might be pleased.\"\n",
        "TRANSLATION_14": "Moses replied: 'They are following me. My Lord, I made haste only so that I might please You'\n",
        "TRANSLATION_15": "He said, “They are following in my footsteps; and I hurried on to You, my Lord, that you may be pleased.”\n",
        "TRANSLATION_16": "He said, \"They are close upon my tracks, and I hastened to You, my Lord, that You be pleased.\"\n",
        "TRANSLATION_17": "[20:84] He said, ‘They are close, behind me, coming, upon my track, and I hastened to You, my Lord, that You may be pleased’, with me, in other words, to please you [even] more — before [giving] the response, he gives an excuse, according to what he supposed [was the situation with his people],\n",
        "TRANSLATION_18": "He said: They are close upon my track) they are following in my track. And (I hastened unto Thee that Thou mightest be well pleased) so that Your good pleasure with me is increased.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "20:84",
            "79:19",
            "94:8",
            "29:59",
            "16:42",
            "74:7",
            "74:3",
            "37:99",
            "108:2",
            "20:122"
        ],
        "BIBLE": [
            "prophets:i%20kings:19:9",
            "prophets:ii%20kings:9:5",
            "torah:exodus:19:9",
            "prophets:joshua:14:9",
            "prophets:ezekiel:24:20",
            "torah:genesis:24:5",
            "prophets:i%20kings:18:21",
            "writings:ii%20chronicles:14:10",
            "prophets:jeremiah:3:19",
            "torah:genesis:24:42"
        ]
    }
}