{
    "VERSE": "20:85",
    "ARABIC": "قَالَ فَإِنَّا قَدْ فَتَنَّا قَوْمَكَ مِنۢ بَعْدِكَ وَأَضَلَّهُمُ ٱلسَّامِرِىُّ",
    "ENGLISH": {
        "TRANSLATION_0": "He said, 'We tried your people after you left and the Samiri has misguided them.'",
        "TRANSLATION_1": "He said: \"We have put your people on trial in your absence; and Sameri has led them astray.\"\n",
        "TRANSLATION_2": "Said He: \"Verily We tested your people in your absence and the Samiri led them astray.\"\n",
        "TRANSLATION_3": "The Lord said, \"We tested your people after you left them and the Samiri made them go astray.\"\n",
        "TRANSLATION_4": "He said, “We have therefore tried your people after you came, and Samri has led them astray.”\n",
        "TRANSLATION_5": "(Allah) said: \"Verily, We have tried your people in your absence, and As-Samiri has led them astray.\"\n",
        "TRANSLATION_6": "He said: So surely We have tried your people after you, and the Samiri has led them astray.\n",
        "TRANSLATION_7": "Said He, 'We have tempted thy people since thou didst leave them. The Samaritan has misled them into error.'\n",
        "TRANSLATION_8": "He said: Lo! We have tried thy folk in thine absence, and As-Samiri hath misled them.\n",
        "TRANSLATION_9": "But God said, \"We have tested your people in your absence. The Samiri has led them astray.\"\n",
        "TRANSLATION_10": "He said: verily We have tempted thy people after thee, and the Samiri hath led them astray.\n",
        "TRANSLATION_11": "He said, ‘Indeed We tried your people in your absence, and the Samiri has led them astray.’\n",
        "TRANSLATION_12": "(Allah) said: \"We have tested thy people in thy absence: the Samiri has led them astray.\"\n",
        "TRANSLATION_13": "(Allah) said: \"Verily! We have tried your people in your absence, and As-Samiri has led them astray.\"\n",
        "TRANSLATION_14": "He (Allah) said: 'We tempted your nation in your absence, and the Samaritan has misled them into error'\n",
        "TRANSLATION_15": "He said, “We have tested your people in your absence, and the Samarian misled them.”\n",
        "TRANSLATION_16": "[Allah] said, \"But indeed, We have tried your people after you [departed], and the Samiri has led them astray.\"\n",
        "TRANSLATION_17": "[20:85] But those he supposed [to be following him] had remained behind, for He, exalted be He, said, ‘Indeed We tried your people after you, that is, after your departure from them, and the Samaritan led them astray’, so they took to worshipping the [golden] calf.\n",
        "TRANSLATION_18": "(He said) O Moses! (Lo! We have tried thy folk) with the worship of the calf (in thine absence) after you set off for the mountain, (and al-Samiri hath misled them) al-Samiri commanded them to do so.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "20:85",
            "36:28",
            "20:87",
            "16:65",
            "10:75",
            "51:32",
            "51:46",
            "10:86",
            "11:36",
            "46:30"
        ],
        "BIBLE": [
            "prophets:ii%20kings:2:4",
            "prophets:ezekiel:36:22",
            "prophets:jeremiah:4:10",
            "prophets:jonah:1:6",
            "prophets:joshua:9:9",
            "writings:ii%20chronicles:14:10",
            "prophets:i%20kings:11:2",
            "writings:ruth:2:11",
            "writings:ruth:1:16",
            "torah:exodus:18:15"
        ]
    }
}