{
    "VERSE": "20:89",
    "ARABIC": "أَفَلَا يَرَوْنَ أَلَّا يَرْجِعُ إِلَيْهِمْ قَوْلًا وَلَا يَمْلِكُ لَهُمْ ضَرًّا وَلَا نَفْعًا",
    "ENGLISH": {
        "TRANSLATION_0": "Could they not see that it did not reply to them and that it possessed no power to either harm or benefit them?",
        "TRANSLATION_1": "Did they not see that it did not give them any answer, nor had it power to do them harm or bring them gain?\n",
        "TRANSLATION_2": "Did they not see that it did not return a word to them, and had no power either to hurt them or to cause them any benefit?\n",
        "TRANSLATION_3": "Did they not consider that the calf could not give them any answer, nor it could harm or benefit them?\n",
        "TRANSLATION_4": "So do they not see that it does not answer to any of their speech? And has no power to cause them any harm or benefit?\n",
        "TRANSLATION_5": "Did they not see that it could not return them a word (for answer), and that it had no power either to harm them or to do them good\n",
        "TRANSLATION_6": "What! could they not see that it did not return to them a reply, and (that) it did not control any harm or benefit for them?\n",
        "TRANSLATION_7": "What? Did they not see that thing returned no speech unto them, neither had any power to hurt or profit them?\n",
        "TRANSLATION_8": "See they not, then, that it returneth no saying unto them and possesseth for them neither hurt nor use?\n",
        "TRANSLATION_9": "Why did they not see that it could not give them any response and had no power to harm or benefit them?\n",
        "TRANSLATION_10": "Observed they not that it returned not unto them a word, and owned not for them hurt or profit?\n",
        "TRANSLATION_11": "Did they not see that it did not answer them, nor could it bring them any benefit or harm?\n",
        "TRANSLATION_12": "Could they not see that it could not return them a word (for answer), and that it had no power either to harm them or to do them good?\n",
        "TRANSLATION_13": "Did they not see that it could not return them a word (for answer), and that it had no power either to harm them or to do them good?\n",
        "TRANSLATION_14": "What! Did they not see that it did not speak a word to them in return, and for them it could own neither harm nor benefit?\n",
        "TRANSLATION_15": "Did they not see that it cannot return a word to them, and has no power to harm them or benefit them?\n",
        "TRANSLATION_16": "Did they not see that it could not return to them any speech and that it did not possess for them any harm or benefit?\n",
        "TRANSLATION_17": "[20:89] Did they not see that ([in allā] an has been softened in place of the hardened form, with its subject omitted, in other words [it should be] annahu) it, the Calf, did not reciprocate their words, that is, that it did not give them any response in return, nor did it have any power over hurt for them, that is, [any power] to prevent it, or any benefit?, that is, [any power] to procure it [for them], in other words, how can such [a thing] be taken as a god?\n",
        "TRANSLATION_18": "Allah then said: (See they not) i.e. al-Samiri and his host, (then, that it) the calf (returneth no saying unto 344 them) does not answer them (and possesseth for them) and has no power (neither hurt) either to drive away harm from them (nor use) or bring benefit to them?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "20:89",
            "36:73",
            "34:42",
            "51:21",
            "72:21",
            "5:76",
            "23:115",
            "32:18",
            "7:192",
            "83:4"
        ],
        "BIBLE": [
            "torah:genesis:24:50",
            "prophets:jeremiah:3:7",
            "writings:job:33:13",
            "torah:deuteronomy:1:14",
            "torah:numbers:22:38",
            "prophets:zechariah:4:6",
            "torah:numbers:22:18",
            "torah:genesis:31:29",
            "torah:genesis:44:7",
            "prophets:isaiah:55:11"
        ]
    }
}