{
    "VERSE": "20:97",
    "ARABIC": "قَالَ فَٱذْهَبْ فَإِنَّ لَكَ فِى ٱلْحَيَوٰةِ أَن تَقُولَ لَا مِسَاسَ وَإِنَّ لَكَ مَوْعِدًا لَّن تُخْلَفَهُۥ وَٱنظُرْ إِلَىٰٓ إِلَٰهِكَ ٱلَّذِى ظَلْتَ عَلَيْهِ عَاكِفًا لَّنُحَرِّقَنَّهُۥ ثُمَّ لَنَنسِفَنَّهُۥ فِى ٱلْيَمِّ نَسْفًا",
    "ENGLISH": {
        "TRANSLATION_0": "He said, 'Go! In the this world you will have to say, \"Untouchable!\" And you have an appointment which you will not fail to keep. Look at your god to which you devoted so much time. We will burn it up and then scatter it as dust into the sea.",
        "TRANSLATION_1": "(Moses) said: \"Go hence! All your life you are (cursed) to say: 'Do not touch me; and a threat hangs over you which you will not be able to escape. Look at your god to whom you are so attached: We shall verily burn it, and disperse its ashes into the sea.\n",
        "TRANSLATION_2": "Moses said: \"Be gone, then. All your life you shall cry: 'Untouchable.' There awaits a term for your reckoning that you cannot fail to keep. Now look at your god that you devotedly adored: We shall burn it and scatter its remains in the sea.\n",
        "TRANSLATION_3": "Moses said, \"Go away! Throughout your life you will not be able to let anyone touch you. This will be your punishment in this life. The time for your final punishment is inevitable. You will never be able to avoid it. Look at your god which you have been worshipping. We will burn it in the fire and scatter its ashes into the sea.\"\n",
        "TRANSLATION_4": "Said Moosa, “Therefore go away, for in this life your punishment is that you exclaim ‘Do not touch!’* And indeed for you is a time appointed, which you cannot break; and look at your deity, in front of which you remained squatting the whole day; we swear we will surely burn it and, smashing it into bits, discharge it into the river.” (* He was cursed with a disease.)\n",
        "TRANSLATION_5": "Musa said: \"Then go away! And verily, your (punishment) in this life will be that you will say: `Touch me not;' and verily, you have a promise that will not fail. And look at your god to which you have been devoted. We will certainly burn it, and scatter its particles in the sea.\"\n",
        "TRANSLATION_6": "He said: Begone then, surely for you it will be in this life to say, Touch (me) not; and surely there is a threat for you, which shall not be made to fail to you, and look at your god to whose worship you kept (so long); we will certainly burn it, then we will certainly scatter it a (wide) scattering in the sea.\n",
        "TRANSLATION_7": "Depart!' said Moses. 'It shall be thine all this life to cry \"Untouchable!\" And thereafter a tryst awaits thee thou canst not fail to keep Behold thy god, to whom all the day thou wast cleaving! We will surely burn it and scatter its ashes into the sea.\n",
        "TRANSLATION_8": "(Moses) said: Then go! and lo! in this life it is for thee to say: Touch me not! and lo! there is for thee a tryst thou canst not break. Now look upon thy god of which thou hast remained a votary. Verily we will burn it and will scatter its dust over the sea.\n",
        "TRANSLATION_9": "Moses said, \"Begone! It shall be your lot to say throughout your life, \"Do not touch me,\" and you will be faced with a fate from which there will be no escape. Now look at your deity to which you have become so devoted: we shall burn it up, and then scatter it into the sea.\n",
        "TRANSLATION_10": "Musa said: begone thou! verily it shall be thine in life to say no contact; and verily thine is an appointment which thou shalt by no means fail. And look at thy god to which thou hast been assidauous; we shall surely burn it, and we shall scatter it into the sea a wide scattering.\n",
        "TRANSLATION_11": "He said, ‘Begone! It shall be your [lot] throughout life to say, ‘‘Do not touch me!’’ Indeed, there is a tryst for you which you will not fail to keep! Now look at your god to whom you went on clinging. We will burn it down and then scatter it[s ashes] into the sea.\n",
        "TRANSLATION_12": "(Moses) said: \"Get thee gone! but thy (punishment) in this life will be that thou wilt say, 'touch me not'; and moreover (for a future penalty) thou hast a promise that will not fail: Now look at thy god, of whom thou hast become a devoted worshipper: We will certainly (melt) it in a blazing fire and scatter it broadcast in the sea!\"\n",
        "TRANSLATION_13": "Musa (Moses) said: \"Then go away! And verily, your (punishment) in this life will be that you will say: \"Touch me not (i.e. you will live alone exiled away from mankind); and verily (for a future torment), you have a promise that will not fail. And look at your ilah (god), to which you have been devoted. We will certainly burn it, and scatter its particles in the sea.\"\n",
        "TRANSLATION_14": "Begone! Your lot in this life is to cry: \"untouchable!' said he (Moses). 'An appointment awaits you that you cannot fail to keep. Look at your god which you clung to indeed we will burn it and scatter its ashes upon the sea'\n",
        "TRANSLATION_15": "He said, “Begone! Your lot in this life is to say, ‘No contact.’ And you have an appointment that you will not miss. Now look at your god that you remained devoted to—we will burn it up, and then blow it away into the sea, as powder.”\n",
        "TRANSLATION_16": "[Moses] said, \"Then go. And indeed, it is [decreed] for you in [this] life to say, 'No contact.' And indeed, you have an appointment [in the Hereafter] you will not fail to keep. And look at your 'god' to which you remained devoted. We will surely burn it and blow it into the sea with a blast.\n",
        "TRANSLATION_17": "[20:97] Said he, Moses to him, ‘Begone! It shall be yours [as your lot] throughout life, that is, for the duration of your life, to say, to whomever you may see, “Do not touch [me]!”, that is, do not come near me — he used to wander about [aimlessly] throughout the land, and whenever he touched a person, or a person touched him, both would succumb to a fever. And indeed there will be a tryst for you, for you to be chastised, which you will not fail to keep (read lan tukhlifahu, meaning ‘[a tryst] which you shall not miss’; or lan tukhlafahu, ‘for which you will not be forgotten’, meaning: ‘nay you will be sent forth to [keep] it’). Now look at your god to whom you remained clinging! (zalta is actually zalilta, but the first lām has been omitted in order to soften it), that is to say, [you remained] by his [your god’s] side, worshipping him. We will surely burn it, in fire, and then scatter [the ashes of] it into the waters, we will disperse it into the winds of the sea; and, after having slaughtered it, Moses did [exactly] that which he has mentioned.\n",
        "TRANSLATION_18": "((Moses) said) to him: (Then go) Samiri! (And lo! in this life) for as long as you live (it is for thee to say: Touch me not) you do not interact with anyone and no one will interact with you! (and lo! there is for you a tryst) you have an appointed time on the Day of Judgement (thou canst not break) you cannot miss. (Now look upon your god of which thou hast remained a votary) look at the god which you worshipped. (Verily we will burn it and will scatter its dust over the sea)\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "20:97",
            "30:60",
            "21:87",
            "35:5",
            "9:55",
            "2:96",
            "6:33",
            "22:67",
            "40:77",
            "2:190"
        ],
        "BIBLE": [
            "prophets:i%20kings:20:39",
            "torah:deuteronomy:31:16",
            "prophets:jeremiah:14:17",
            "prophets:judges:16:9",
            "writings:daniel:12:7",
            "torah:exodus:19:24",
            "prophets:ezekiel:17:16",
            "prophets:jeremiah:48:12",
            "torah:genesis:7:11",
            "prophets:ii%20kings:10:24"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:5:2"
        ]
    }
}