{
    "VERSE": "20:98",
    "ARABIC": "إِنَّمَآ إِلَٰهُكُمُ ٱللَّهُ ٱلَّذِى لَآ إِلَٰهَ إِلَّا هُوَ وَسِعَ كُلَّ شَىْءٍ عِلْمًا",
    "ENGLISH": {
        "TRANSLATION_0": "Your god is Allah alone, there is no god but Him. He encompasses all things in His knowledge.'",
        "TRANSLATION_1": "Your god is only God. There is no other god but He. His knowledge extends over everything.\"\n",
        "TRANSLATION_2": "Your God is none else than Allah, beside Whom there is no god. His knowledge embraces everything.\"\n",
        "TRANSLATION_3": "Your Lord is the One who is the only God and He has the knowledge of all things.\n",
        "TRANSLATION_4": "“Your God is only Allah – other than for Whom there is no worship; His knowledge encompasses all things.”\n",
        "TRANSLATION_5": "Your God is only Allah, there is no God but Him. He has full knowledge of all things.\n",
        "TRANSLATION_6": "Your Allah is only Allah, there is no god but He; He comprehends all things in (His) knowledge.\n",
        "TRANSLATION_7": "Your God is only the One God; there is no god, but He alone who in His knowledge embraces everything.'\n",
        "TRANSLATION_8": "Your Allah is only Allah, than Whom there is no other Allah. He embraceth all things in His knowledge.\n",
        "TRANSLATION_9": "Your only deity is God, there is no deity but Him. His knowledge encompasses all things.\"\n",
        "TRANSLATION_10": "Your God is only Allah, the One other than whom there is no god. He comprehendeth everything in knowledge.\n",
        "TRANSLATION_11": "Indeed your God is Allah. There is no god except Him. He embraces all things in [His] knowledge.’\n",
        "TRANSLATION_12": "But the god of you all is the One Allah: there is no god but He: all things He comprehends in His knowledge.\n",
        "TRANSLATION_13": "Your Ilah (God) is only Allah, the One (La ilaha illa Huwa) (none has the right to be worshipped but He). He has full knowledge of all things.\n",
        "TRANSLATION_14": "Your God is only One, Allah. There is no god, except He, alone. His knowledge encompasses all things.\n",
        "TRANSLATION_15": "Surely your god is God, the One besides whom there is no other god. He comprehends everything in knowledge.\n",
        "TRANSLATION_16": "Your god is only Allah, except for whom there is no deity. He has encompassed all things in knowledge.\"\n",
        "TRANSLATION_17": "[20:98] Indeed your God is the One God, than whom there is no other god. He embraces all things in [His] knowledge’ (‘ilman, a specification derived from the subject of the verb, in other words, it means ‘His knowledge embraces all things’).\n",
        "TRANSLATION_18": "(Your God is only Allah, than Whom there is no other God) He has no children or partners. (He embraceth all 345 things in His knowledge) He knows all things.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "20:98",
            "33:54",
            "64:11",
            "9:115",
            "40:62",
            "6:80",
            "76:30",
            "3:92",
            "11:14",
            "29:62"
        ],
        "BIBLE": [
            "writings:psalms:72:18",
            "prophets:joshua:1:17",
            "torah:leviticus:4:22",
            "writings:psalms:40:6",
            "prophets:isaiah:49:4",
            "prophets:isaiah:46:9",
            "prophets:i%20samuel:3:17",
            "writings:nehemiah:9:6",
            "torah:deuteronomy:1:32",
            "prophets:isaiah:40:27"
        ]
    }
}