{
    "VERSE": "38:10",
    "ARABIC": "أَمْ لَهُم مُّلْكُ ٱلسَّمَٰوَٰتِ وَٱلْأَرْضِ وَمَا بَيْنَهُمَا فَلْيَرْتَقُوا۟ فِى ٱلْأَسْبَٰبِ",
    "ENGLISH": {
        "TRANSLATION_0": "Or does the kingdom of the heavens and earth and everything between them belong to them? Let them, in that case, climb the ropes to heaven!",
        "TRANSLATION_1": "Or is the kingdom of the heavens and the earth and all that lies between them, theirs? Then let them climb up the ladders (to the heavens).\n",
        "TRANSLATION_2": "Or do they possess the dominion of the heavens and the earth and of all that is in between them? If so, let them ascend the heights of the realm of causation and see!\n",
        "TRANSLATION_3": "Do they own the heavens and the earth and all that is between them? Let them try on their own to block (the ways of heavens so that Our revelations cannot come to you).\n",
        "TRANSLATION_4": "Is the kingdom of the heavens and the earth and all that is between them, for them? So would they not just ascend using ropes?\n",
        "TRANSLATION_5": "Or is it that the dominion of the heavens and the earth and all that is between them is theirs If so, let them ascend up with means!\n",
        "TRANSLATION_6": "Or is it that theirs is the kingdom of the heavens and the earth and what is between them? Then let them ascend by any\n",
        "TRANSLATION_7": "Or is theirs the kingdom of the heavens and earth and of what between them is? Why, then let them ascend the cords!\n",
        "TRANSLATION_8": "Or is the kingdom of the heavens and the earth and all that is between them theirs? Then let them ascend by ropes!\n",
        "TRANSLATION_9": "Have they control over heavens and earth and whatever [lies] between them? Then let them climb up to heaven by ropes:\n",
        "TRANSLATION_10": "Or, is theirs the dominion of the heavens and the earth and that which is in-between the twain? If so, let them ascend by steps.\n",
        "TRANSLATION_11": "Do they own the kingdom of the heavens and the earth and whatever is between them? [If so,] let them ascend [to the higher spheres] by the means [of ascension].\n",
        "TRANSLATION_12": "Or have they the dominion of the heavens and the earth and all between? If so, let them mount up with the ropes and means (to reach that end)!\n",
        "TRANSLATION_13": "Or is it that the dominion of the heavens and the earth and all that is between them is theirs? If so, let them ascend up with means (to the heavens)!\n",
        "TRANSLATION_14": "Or, is theirs the Kingdom of the heavens and the earth and all that is between them? Then let them ascend by (their) means!\n",
        "TRANSLATION_15": "Or do they possess the sovereignty of the heavens and the earth and what is between them? Then let them ascend the ropes.\n",
        "TRANSLATION_16": "Or is theirs the dominion of the heavens and the earth and what is between them? Then let them ascend through [any] ways of access.\n",
        "TRANSLATION_17": "[38:10] Or do they possess the kingdom of the heavens and the earth and whatever is between them? If this is what they claim: Then let them ascend by the means, [of ascension] that lead to the heaven and bring [down] some revelation (wahy) and then assign it exclusively to whomever they wish (am in both verses represents the [rhetorical] hamza of denial).\n",
        "TRANSLATION_18": "(Or is the kingdom of the heavens and the earth and all that is between them theirs?) Or do they have power over the heavens and the earth and over all created beings and marvels that are between the heavens and the earth? (Then let them ascend by ropes) to the gates of heavens! And if they have that power, then let them see whether or not He bestowed upon him prophethood and the Scripture.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "38:10",
            "21:16",
            "44:38",
            "44:7",
            "26:24",
            "43:85",
            "19:65",
            "38:27",
            "20:6",
            "37:5"
        ],
        "BIBLE": [
            "prophets:isaiah:55:9",
            "writings:daniel:4:8",
            "writings:daniel:4:19",
            "writings:job:31:4",
            "writings:psalms:72:8",
            "prophets:isaiah:13:5",
            "torah:genesis:28:12",
            "prophets:jeremiah:10:13",
            "prophets:jeremiah:51:16",
            "prophets:ezekiel:7:3"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:4:2",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:3:3"
        ]
    }
}