{
    "VERSE": "38:11",
    "ARABIC": "جُندٌ مَّا هُنَالِكَ مَهْزُومٌ مِّنَ ٱلْأَحْزَابِ",
    "ENGLISH": {
        "TRANSLATION_0": "Even a whole army of Confederates will be routed there!",
        "TRANSLATION_1": "They will be one more army vanquished among the many routed hordes.\n",
        "TRANSLATION_2": "This is only a small army out of the several armies that will suffer defeat here.\n",
        "TRANSLATION_3": "They are only a small band among the defeated confederate tribes.\n",
        "TRANSLATION_4": "This is just one of the disgraced armies, that will be routed there and then.\n",
        "TRANSLATION_5": "They will be a defeated host like the Confederates of the old times.\n",
        "TRANSLATION_6": "A host of deserters of the allies shall be here put to flight.\n",
        "TRANSLATION_7": "A very host of parties is routed there!\n",
        "TRANSLATION_8": "A defeated host are (all) the factions that are there.\n",
        "TRANSLATION_9": "this host too, among other hosts, is bound to suffer defeat.\n",
        "TRANSLATION_10": "Here there is a host of the confederates only to be defeated.\n",
        "TRANSLATION_11": "[They are but] a host routed out there of the factions.\n",
        "TRANSLATION_12": "But there - will be put to flight even a host of confederates.\n",
        "TRANSLATION_13": "(As they denied Allah's Message) they will be a defeated host like the confederates of the old times (who were defeated).\n",
        "TRANSLATION_14": "The army is defeated as (were) the confederates.\n",
        "TRANSLATION_15": "An army of confederates with be defeated there.\n",
        "TRANSLATION_16": "[They are but] soldiers [who will be] defeated there among the companies [of disbelievers].\n",
        "TRANSLATION_17": "[38:11]   A routed (mahzūmun is an adjectival qualification of jundun, ‘host’) host [is all that they are], in other words, they are [nothing but] a despicable host, nothing more — in their denial of you — from among the factions (mina’l-ahzābi, also an adjectival qualification of jundun) in other words, [they are] like those hosts of factions who were in confederation against prophets before you: these were defeated and destroyed, and likewise We shall destroy these [people].\n",
        "TRANSLATION_18": "(A defeated) and slain (host are (all) the factions) of disbelievers: the disbelievers of Mecca (that are there) they were defeated and killed on the Day of Badr when they intended to kill the Prophet (pbuh).\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "38:11",
            "37:173",
            "20:78",
            "28:6",
            "85:17",
            "18:12",
            "39:34",
            "36:28",
            "26:215",
            "46:14"
        ],
        "BIBLE": [
            "writings:ii%20chronicles:24:24",
            "writings:i%20chronicles:7:4",
            "prophets:isaiah:28:22",
            "prophets:isaiah:24:23",
            "writings:psalms:27:3",
            "prophets:jeremiah:11:22",
            "prophets:zechariah:8:22",
            "prophets:malachi:3:12",
            "prophets:malachi:3:1",
            "prophets:isaiah:5:9"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:3:2",
            
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:5:1"
        ]
    }
}