{
    "VERSE": "38:12",
    "ARABIC": "كَذَّبَتْ قَبْلَهُمْ قَوْمُ نُوحٍ وَعَادٌ وَفِرْعَوْنُ ذُو ٱلْأَوْتَادِ",
    "ENGLISH": {
        "TRANSLATION_0": "Before them the people of Nuh denied the truth, as did 'Ad and Pharaoh of the Stakes,",
        "TRANSLATION_1": "Even before them the people of Noah, 'Ad, the mighty Pharoah,\n",
        "TRANSLATION_2": "Before them the people of Noah, Ad, and Pharaoh of the tent-pegs gave the lie (to the Messengers)\n",
        "TRANSLATION_3": "The people of Noah, Ad and the dominating Pharaoh had rejected Our revelations.\n",
        "TRANSLATION_4": "Before them, the people of Nooh had denied, and the tribe of A’ad, and Firaun who used to crucify.\n",
        "TRANSLATION_5": "Before them denied -- the people of Nuh; and `Ad; and Fir`awn the man of stakes,\n",
        "TRANSLATION_6": "The people of Nuh and Ad, and Firon, the lord of spikes, rejected (apostles) before them.\n",
        "TRANSLATION_7": "Cried lies before them the people of Noah, and Ad, and Pharaoh, he of the tent-pegs,\n",
        "TRANSLATION_8": "The folk of Noah before them denied (their messenger) and (so did the tribe of) A'ad, and Pharaoh firmly planted,\n",
        "TRANSLATION_9": "Before them the people of Noah denied the truth, as did the 'Ad and Pharaoh of the Stakes,\n",
        "TRANSLATION_10": "Before them there have belied the people of Nuh and the 'Aad, and Fir'awn the owner of the stakes.\n",
        "TRANSLATION_11": "Before them Noah’s people impugned [their apostle] and [so did the people of] ‘Ad, and Pharaoh, the Impaler [of his victims],\n",
        "TRANSLATION_12": "Before them (were many who) rejected messengers,- the people of Noah, and 'Ad, and Pharaoh, the Lord of Stakes,\n",
        "TRANSLATION_13": "Before them (were many who) belied Messengers, the people of Nuh (Noah); and 'Ad; and Fir'aun (Pharaoh) the man of stakes (with which he used to punish the people),\n",
        "TRANSLATION_14": "Before them the nations of Noah, Aad and Pharaoh, and he of the tentpegs belied,\n",
        "TRANSLATION_15": "Before them the people of Noah denied the truth; as did Aad, and Pharaoh of the Stakes.\n",
        "TRANSLATION_16": "The people of Noah denied before them, and [the tribe of] 'Aad and Pharaoh, the owner of stakes,\n",
        "TRANSLATION_17": "[38:12] Before them the people of Noah denied (the inflection of [the verb kadhdabat, ‘denied’, that is governed by] qawmu, ‘people’, is in the feminine person because of the [implicit] sense), and [so did those of] ‘Ād and Pharaoh, he of the stakes — he used to fix four stakes for the person who incurred his wrath and tie to these [stakes] that person’s hands and feet and then torture him —\n",
        "TRANSLATION_18": "(The folk of Noah before them) before your folk, Muhammad (denied) Noah (and (so did the tribe of) 'Aad) the folk of Hud deny Hud, (and Pharaoh) denied Moses (firmly planted) who had an established kingdom; and it is said that this means: the one who tortured using posts; this is because whenever he got angry against someone he tortured him using four posts,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "38:12",
            "22:42",
            "54:9",
            "50:12",
            "51:46",
            "89:10",
            "26:105",
            "53:52",
            "9:70",
            "5:102"
        ],
        "BIBLE": [
            "writings:psalms:135:12",
            "torah:exodus:11:3",
            "prophets:jeremiah:44:20",
            "writings:ii%20chronicles:33:10",
            "prophets:joshua:6:2",
            "writings:lamentations:1:11",
            "writings:ii%20chronicles:19:6",
            "torah:genesis:3:12",
            "torah:deuteronomy:32:8",
            "prophets:ezekiel:20:11"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:4:11",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:5:2"
        ]
    }
}