{
    "VERSE": "38:15",
    "ARABIC": "وَمَا يَنظُرُ هَٰٓؤُلَآءِ إِلَّا صَيْحَةً وَٰحِدَةً مَّا لَهَا مِن فَوَاقٍ",
    "ENGLISH": {
        "TRANSLATION_0": "These people too are only awaiting a single Blast and it will not be repeated.",
        "TRANSLATION_1": "They await but a single blast which will not be repeated.\n",
        "TRANSLATION_2": "They are waiting for nothing except a single Cry, after which there will be no second Cry.\n",
        "TRANSLATION_3": "They had only to wait for the single inevitable blast.\n",
        "TRANSLATION_4": "They await just one Scream, which no one can avert.\n",
        "TRANSLATION_5": "And these only wait for a single Sayhah there will be no pause or ending thereto.\n",
        "TRANSLATION_6": "Nor do these await aught but a single cry, there being no delay in it.\n",
        "TRANSLATION_7": "These are only awaiting for a single Cry, to which there is no delay.\n",
        "TRANSLATION_8": "These wait for but one Shout, there will be no second thereto.\n",
        "TRANSLATION_9": "they have only to wait for one single blast [of punishment]: it shall not be delayed by one whit.\n",
        "TRANSLATION_10": "And these wait but for one shout, wherefrom there will be no deferment.\n",
        "TRANSLATION_11": "These [too] do not await but a single Cry, which will not grant [them] any respite.\n",
        "TRANSLATION_12": "These (today) only wait for a single mighty Blast, which (when it comes) will brook no delay.\n",
        "TRANSLATION_13": "And these only wait for a single Saihah [shout (i.e. the blowing of the Trumpet by the angel Israfil Sarafil)] there will be no pause or ending thereto [till everything will perish except Allah (the only God full of Majesty, Bounty and Honour)].\n",
        "TRANSLATION_14": "These only wait for a single Shout for which there will be no delay.\n",
        "TRANSLATION_15": "These can expect only a single scream, from which there is no recovery.\n",
        "TRANSLATION_16": "And these [disbelievers] await not but one blast [of the Horn]; for it there will be no delay.\n",
        "TRANSLATION_17": "[38:15] And these, that is, the disbelievers of Mecca, do not await but a single Cry, namely, the Blast of the Resurrection that will herald chastisement for them, for which there will be no revoking (read fawāq or fuwāq).\n",
        "TRANSLATION_18": "(These) i.e. your folk, in case they deny you (wait for but one Shout) which is not followed by a second: this is the blow of the Resurrection, (there will be no second thereto) there will be no respite or return.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "38:15",
            "36:49",
            "36:29",
            "36:53",
            "26:208",
            "54:31",
            "37:164",
            "16:50",
            "38:65",
            "74:11"
        ],
        "BIBLE": [
            "writings:ii%20chronicles:6:32",
            "writings:psalms:71:18",
            "prophets:jeremiah:49:9",
            "prophets:micah:1:15",
            "prophets:jonah:1:6",
            "prophets:ezekiel:4:14",
            "prophets:jeremiah:49:36",
            "prophets:i%20samuel:16:11",
            "writings:job:4:9",
            "prophets:judges:13:6"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:1:14",
            "Sefer%20Yetzirah:1:12",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:1:10"
        ]
    }
}