{
    "VERSE": "38:23",
    "ARABIC": "إِنَّ هَٰذَآ أَخِى لَهُۥ تِسْعٌ وَتِسْعُونَ نَعْجَةً وَلِىَ نَعْجَةٌ وَٰحِدَةٌ فَقَالَ أَكْفِلْنِيهَا وَعَزَّنِى فِى ٱلْخِطَابِ",
    "ENGLISH": {
        "TRANSLATION_0": "This brother of mine has ninety-nine ewes and I have only one. He said, \"Let me have charge of it,\" and got the better of me with his words.'",
        "TRANSLATION_1": "This man here is my brother. He has ninety and nine ewes while I have only one. He demands that I should give him my ewe, and wants to get the better of me in argument.\"\n",
        "TRANSLATION_2": "Behold, this is my brother; he has ninety-nine ewes and I have only one ewe.” And yet he said: “Give her into my charge,” and he got the better of me in argument.\n",
        "TRANSLATION_3": "One of them said, \"This is my brother who has ninety-nine ewes when I have only one. He has demanded me to place that one in his custody; he had the stronger argument\".\n",
        "TRANSLATION_4": "“This is my brother; he has ninety nine ewes and I have one ewe; and he now says ‘Give that one also to me’ – and he is very demanding in speech.”\n",
        "TRANSLATION_5": "Verily, this my brother (in religion) has ninety-nine ewes, while I have (only) one ewe, and he says: \"Hand it over to me, and he overpowered me in speech.\"\n",
        "TRANSLATION_6": "Surely this is my brother; he has ninety-nine ewes and I have a single ewe; but he said: Make it over to me, and he has prevailed against me in discourse.\n",
        "TRANSLATION_7": "Behold, this my brother has ninety-nine ewes, and I have one ewe. So he said, \"Give her into my charge\"; and he overcame me in the argument.'\n",
        "TRANSLATION_8": "Lo! this my brother hath ninety and nine ewes while I had one ewe; and he said: Entrust it to me, and he conquered me in speech.\n",
        "TRANSLATION_9": "This brother of mine has ninety-nine ewes and I have only one. He said, \"Let me have charge of it,\" and got the better of me with his words.\"\n",
        "TRANSLATION_10": "Verily this my brother hath nine and ninety ewes while I have one ewe; and he saith: entrust it to me, and he hath prevailed upon me in speech.\n",
        "TRANSLATION_11": "‘This brother of mine has ninety-nine ewes, while I have only a single ewe, and [yet] he says, ‘Commit it to my care,’ and he browbeats me in speech.’\n",
        "TRANSLATION_12": "This man is my brother: He has nine and ninety ewes, and I have (but) one: Yet he says, 'commit her to my care,' and is (moreover) harsh to me in speech.\"\n",
        "TRANSLATION_13": "Verily, this my brother (in religion) has ninety nine ewes, while I have (only) one ewe, and he says: \"Hand it over to me, and he overpowered me in speech.\"\n",
        "TRANSLATION_14": "This, my brother has ninetynine ewes, but I have only one ewe (a female sheep). He said: \"Give her into my keeping\" and overcame me in the argument'\n",
        "TRANSLATION_15": "“This brother of mine has ninety nine ewes, and I have one ewe, and he said, ‘Entrust it to me,’ and he pressured me with words.”\n",
        "TRANSLATION_16": "Indeed this, my brother, has ninety-nine ewes, and I have one ewe; so he said, 'Entrust her to me,' and he overpowered me in speech.\"\n",
        "TRANSLATION_17": "[38:23] ‘Behold, this brother of mine, in other words, my fellow co-religionist, has ninety-nine ewes — here used to represent the women — while I have a single ewe; yet he said, “Entrust it to me”, in other words, make me in charge of it, and he overcame me in speech’, in other words, in the argument; so the latter conceded charge of it to him.\n",
        "TRANSLATION_18": "(Lo! this my brother hath ninety and nine ewes) meaning 99 wives (while I had one ewe) i.e. one wife; (and he said: Entrust it to me, and he conquered me in speech) this is a similitude which they struck for David in order for him to understand what he did to Uriah. 522\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "38:23",
            "21:92",
            "23:52",
            "17:19",
            "7:111",
            "26:36",
            "7:151",
            "28:11",
            "5:30",
            "28:34"
        ],
        "BIBLE": [
            "prophets:ezekiel:11:15",
            "torah:genesis:12:20",
            "torah:genesis:20:16",
            "writings:nehemiah:7:2",
            "torah:numbers:31:47",
            "torah:deuteronomy:31:23",
            "torah:exodus:21:29",
            "prophets:ezekiel:4:15",
            "writings:ii%20chronicles:19:6",
            "prophets:ii%20samuel:18:11"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:3:6",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:4"
        ]
    }
}