{
    "VERSE": "38:25",
    "ARABIC": "فَغَفَرْنَا لَهُۥ ذَٰلِكَ وَإِنَّ لَهُۥ عِندَنَا لَزُلْفَىٰ وَحُسْنَ مَـَٔابٍ",
    "ENGLISH": {
        "TRANSLATION_0": "So We forgave him for that and he has nearness to Us and a good Homecoming.",
        "TRANSLATION_1": "So We forgave him. He has surely a high rank with Us and an excellent place of return.\n",
        "TRANSLATION_2": "Thereupon We forgave him his shortcoming and indeed (an exalted position of) nearness awaits him, and an excellent resort.\n",
        "TRANSLATION_3": "We forgave him for this. In Our eyes he certainly has a good position and the best share (of the world to come).\n",
        "TRANSLATION_4": "We therefore forgave him this; and indeed for him in Our presence are, surely, proximity and an excellent abode.\n",
        "TRANSLATION_5": "So, We forgave him that, and verily, for him is a near access to Us, and a good place of return.\n",
        "TRANSLATION_6": "Therefore We rectified for him this, and most surely he had a nearness to Us and an excellent resort.\n",
        "TRANSLATION_7": "Accordingly We forgave him that, and he has a near place in Our presence and a fair resort.\n",
        "TRANSLATION_8": "So We forgave him that; and lo! he had access to Our presence and a happy journey's end.\n",
        "TRANSLATION_9": "We forgave him his sins. His reward will be nearness to Us, a good place to return to.\n",
        "TRANSLATION_10": "So We forgave him that; and verily for him is an approach with us, and a happy retreat.\n",
        "TRANSLATION_11": "So We forgave him that, and indeed he has [a station of] nearness with Us and a good destination.\n",
        "TRANSLATION_12": "So We forgave him this (lapse): he enjoyed, indeed, a Near Approach to Us, and a beautiful place of (Final) Return.\n",
        "TRANSLATION_13": "So We forgave him that, and verily, for him is a near access to Us, and a good place of (final) return (Paradise).\n",
        "TRANSLATION_14": "So, We forgave him that, and he has a near place with Us and a fine return.\n",
        "TRANSLATION_15": "So We forgave him that. And for him is nearness to Us, and a good place of return.\n",
        "TRANSLATION_16": "So We forgave him that; and indeed, for him is nearness to Us and a good place of return.\n",
        "TRANSLATION_17": "[38:25] So We forgave him that and indeed he has [a station of] nearness with Us, that is, [even] more good [things] in this world, and a fair return, in the Hereafter.\n",
        "TRANSLATION_18": "(So We forgave him that) sin; (and lo! he had access to Our presence) he is close in rank (and a happy journey's end) in the Hereafter.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "38:25",
            "38:40",
            "38:49",
            "13:29",
            "16:96",
            "43:49",
            "32:12",
            "41:50",
            "34:37",
            "7:131"
        ],
        "BIBLE": [
            "prophets:i%20samuel:10:13",
            "writings:ii%20chronicles:1:13",
            "prophets:i%20kings:13:33",
            "writings:nehemiah:1:9",
            "torah:numbers:10:29",
            "prophets:isaiah:23:17",
            "writings:ecclesiastes:3:20",
            "writings:lamentations:4:18",
            "writings:job:16:22",
            "writings:daniel:4:31"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:4:4"
        ]
    }
}