{
    "VERSE": "38:3",
    "ARABIC": "كَمْ أَهْلَكْنَا مِن قَبْلِهِم مِّن قَرْنٍ فَنَادَوا۟ وَّلَاتَ حِينَ مَنَاصٍ",
    "ENGLISH": {
        "TRANSLATION_0": "How many generations We have destroyed before them! And they cried out when it was too late to escape.",
        "TRANSLATION_1": "How many generations have We destroyed before them who cried (for mercy) when it was too late for escape.\n",
        "TRANSLATION_2": "How many a nation did We destroy before them! (When they approached their doom) they cried out (for deliverance), but the time for deliverance was already past.\n",
        "TRANSLATION_3": "How many ancient generations did We destroy? (On facing Our torment) they cried out for help, but it was too late for them to escape.\n",
        "TRANSLATION_4": "Many a generation We did destroy before them – thereupon they cried out whereas it is not the time to escape!\n",
        "TRANSLATION_5": "How many a generation have We destroyed before them! And they cried out when there was no longer time for escape.\n",
        "TRANSLATION_6": "How many did We destroy before them of the generations, then they cried while the time of escaping had passed away.\n",
        "TRANSLATION_7": "How many a generation We destroyed before them, and they called, but time was none to escape.\n",
        "TRANSLATION_8": "How many a generation We destroyed before them, and they cried out when it was no longer the time for escape!\n",
        "TRANSLATION_9": "How many generations We have destroyed before them! And they cried out when it was too late to escape.\n",
        "TRANSLATION_10": "How many a generation have We destroyed afore them, and they cried when there was not time of fleeing.\n",
        "TRANSLATION_11": "How many a generation We have destroyed before them! They cried out [for help], but gone was the time for escape.\n",
        "TRANSLATION_12": "How many generations before them did We destroy? In the end they cried (for mercy)- when there was no longer time for being saved!\n",
        "TRANSLATION_13": "How many a generation We have destroyed before them, and they cried out when there was no longer time for escape!\n",
        "TRANSLATION_14": "How many generations have We destroyed before them. They called: 'The time is neither of escape, nor safety'\n",
        "TRANSLATION_15": "How many generations have We destroyed before them? They cried out when it was too late to escape.\n",
        "TRANSLATION_16": "How many a generation have We destroyed before them, and they [then] called out; but it was not a time for escape.\n",
        "TRANSLATION_17": "[38:3]   How many — in other words, many — a generation, a community of past communities, We have destroyed before them, and they cried out, when the chastisement was sent down on them, when it was no longer the time for escape, that is to say, the time was not one for fleeing (the [suffixed] tā’ [of wa-lāta] is extra; the sentence is a circumstantial qualifier referring to the subject of [the verb] nādaw, ‘they cried out’) in other words, they called for help but the situation was such that there could be no escape or deliverance; but still the Meccan disbelievers have not taken heed from their example.\n",
        "TRANSLATION_18": "(How many a generation) past generation (We destroyed before them) before the Quraysh, (and they cried out when it was no longer the time for escape!) the angels cried out to them upon their destruction: this is no context for attacking or fleeing; stop! And they stopped until Allah destroyed all of them. This is because before this, upon fighting an enemy, they used to say: attack all together! (Manas! Manas!). Some would therefore survive and others die. But when they were defeated by the enemy they used to cry: flee! Flee! (Manasa! Manasa!), and so they used to flee all together from the battlefield. These were two different signs whenever they engaged in fighting either to attack or to flee from the enemy. When Allah wished to destroy them, the angels cried out to them: this is no context for attacking or fleeing.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "38:3",
            "50:36",
            "19:74",
            "19:98",
            "36:31",
            "37:148",
            "37:174",
            "15:27",
            "21:6",
            "41:48"
        ],
        "BIBLE": [
            "prophets:i%20samuel:9:26",
            "prophets:jeremiah:14:9",
            "torah:exodus:33:7",
            "prophets:i%20kings:11:29",
            "prophets:i%20samuel:9:9",
            "prophets:judges:1:17",
            "prophets:isaiah:46:11",
            "torah:genesis:19:22",
            "prophets:i%20samuel:3:8",
            "prophets:isaiah:41:4"
        ]
    }
}