{
    "VERSE": "38:30",
    "ARABIC": "وَوَهَبْنَا لِدَاوُۥدَ سُلَيْمَٰنَ نِعْمَ ٱلْعَبْدُ إِنَّهُۥٓ أَوَّابٌ",
    "ENGLISH": {
        "TRANSLATION_0": "We gave Dawud Sulayman. What an excellent slave! He truly turned to his Lord.",
        "TRANSLATION_1": "We bestowed Solomon on David who was an excellent devotee, for he turned to God in penitence.\n",
        "TRANSLATION_2": "We bestowed upon David (an illustrious son), Solomon. How excellent a servant (of Ours he was)! Indeed he constantly turned to Us in devotion.\n",
        "TRANSLATION_3": "We granted Solomon to David, a blessed servant of Ours and certainly the most repentant person.\n",
        "TRANSLATION_4": "And We bestowed Sulaiman to Dawud; what an excellent bondman! He is indeed most inclined.\n",
        "TRANSLATION_5": "And to Dawud We gave Sulayman. How excellent a servant! Verily, he was ever turning in repentance (to Us)!\n",
        "TRANSLATION_6": "And We gave to Dawood Sulaiman, most excellent the servant! Surely he was frequent in returning (to Allah).\n",
        "TRANSLATION_7": "And We gave unto David Solomon; how excellent a servant he was! He was a penitent.\n",
        "TRANSLATION_8": "And We bestowed on David, Solomon. How excellent a slave! Lo! he was ever turning in repentance (toward Allah).\n",
        "TRANSLATION_9": "We gave David Solomon. He was an excellent servant who always turned to God.\n",
        "TRANSLATION_10": "And We vouchsafed Unto Da-ud Sulaiman. How excellent a bondman! j Verily he was oft-returning.'\n",
        "TRANSLATION_11": "And to David We gave Solomon—what an excellent servant he was! Indeed, he was a penitent [soul].\n",
        "TRANSLATION_12": "To David We gave Solomon (for a son),- How excellent in Our service! Ever did he turn (to Us)!\n",
        "TRANSLATION_13": "And to Dawud (David) We gave Sulaiman (Solomon). How excellent (a) slave! Verily, he was ever oft-returning in repentance (to Us)!\n",
        "TRANSLATION_14": "We gave Solomon to David; and he was an excellent worshiper, he was penitent.\n",
        "TRANSLATION_15": "And We granted David, Solomon, an excellent servant. He was penitent.\n",
        "TRANSLATION_16": "And to David We gave Solomon. An excellent servant, indeed he was one repeatedly turning back [to Allah].\n",
        "TRANSLATION_17": "[38:30] And We bestowed on David, Solomon, his son — what an excellent servant!, that is, Solomon. Truly he was a penitent [soul], always returning [to God] with glorification and remembrance at all times.\n",
        "TRANSLATION_18": "(And We bestowed on David, Solomon. How excellent a slave! Lo! he was ever turning in repentance (towards Allah)) he is ever betaking himself to Allah and engaged in His obedience.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "38:30",
            "38:17",
            "37:111",
            "38:44",
            "37:132",
            "37:81",
            "37:122",
            "26:52",
            "26:86",
            "42:25"
        ],
        "BIBLE": [
            "torah:numbers:7:7",
            "prophets:joshua:22:4",
            "prophets:joshua:1:15",
            "prophets:i%20kings:10:13",
            "writings:ii%20chronicles:9:12",
            "writings:ezra:8:20",
            "prophets:jeremiah:30:3",
            "torah:numbers:7:9",
            "writings:psalms:106:15",
            "writings:ezra:7:19"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:9",
            
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:2:2"
        ]
    }
}