{
    "VERSE": "38:32",
    "ARABIC": "فَقَالَ إِنِّىٓ أَحْبَبْتُ حُبَّ ٱلْخَيْرِ عَن ذِكْرِ رَبِّى حَتَّىٰ تَوَارَتْ بِٱلْحِجَابِ",
    "ENGLISH": {
        "TRANSLATION_0": "he said, 'I have put the love of good things above the remembrance of my Lord until the sun disappeared behind its veil.",
        "TRANSLATION_1": "He said: \"The love of horses is worthy of desire to me for the remembrance of my Lord;\" and when they were out of sight, (he said):\n",
        "TRANSLATION_2": "he said: “Lo! I have come to love this wealth on account of the remembrance of my Lord.” And when the horses disappeared,\n",
        "TRANSLATION_3": "he said, \"My love of horses for the cause of God has made me continue watching them until sunset, thus making me miss my prayer\".\n",
        "TRANSLATION_4": "Therefore Sulaiman said, “I cherish the love of these horses*, out of remembrance of my Lord”; he then ordered them to be raced until they vanished in a curtain out of sight. (To be used in holy war.)\n",
        "TRANSLATION_5": "He said: \"I did love the good instead of remembering my Lord,\" till the time was over, and (the sun) had hidden in the veil (of night).\n",
        "TRANSLATION_6": "Then he said: Surely I preferred the good things to the remembrance of my Lord-- until the sun set and time for Asr prayer was over, (he said):\n",
        "TRANSLATION_7": "he said, 'Lo, I have loved the love of good things better than the remembrance of my Lord, until the sun was bidden behind the veil.\n",
        "TRANSLATION_8": "And he said: Lo! I have preferred the good things (of the world) to the remembrance of my Lord; till they were taken out of sight behind the curtain.\n",
        "TRANSLATION_9": "he said, \"I have put the love of good things above the remembrance of my Lord,\" until [the sun] disappeared behind its veil and the horses disappeared from sight,\n",
        "TRANSLATION_10": "He said: verily I have loved the love of earthly good above the remembrance of my Lord until the sun hath disappeared behind the veil.\n",
        "TRANSLATION_11": "he said, ‘Indeed I have preferred the love of [worldly] niceties to the remembrance of my Lord until [the sun] disappeared behind the [night’s] veil.’\n",
        "TRANSLATION_12": "And he said, \"Truly do I love the love of good, with a view to the glory of my Lord,\"- until (the sun) was hidden in the veil (of night):\n",
        "TRANSLATION_13": "And he said: \"Alas! I did love the good (these horses) instead of remembering my Lord (in my 'Asr prayer)\" till the time was over, and (the sun) had hidden in the veil (of night).\n",
        "TRANSLATION_14": "he said: 'Indeed I have loved the love of good things better than the remembrance of my Lord until the sun has vanished behind a veil.\n",
        "TRANSLATION_15": "He said, “I have preferred the love of niceties to the remembrance of my Lord—until it disappeared behind the veil.\n",
        "TRANSLATION_16": "And he said, \"Indeed, I gave preference to the love of good [things] over the remembrance of my Lord until the sun disappeared into the curtain [of darkness].\"\n",
        "TRANSLATION_17": "[38:32] He said, ‘Lo! I have loved, I have desired, the love of [worldly] good things, that is, [of] horses, over the remembrance of my Lord’, that is, [over] the afternoon prayer, until it, that is, the sun, disappeared behind the [night’s] veil, [until] it was concealed by that which veils it from sight.\n",
        "TRANSLATION_18": "(And he said: Lo! I have preferred the good things (of the world)) I have preferred the wealth of this world (to the remembrance of my Lord) to the obedience of my Lord; (till they were taken out of sight behind the curtain) until the sun disappeared behind the mountain of Qaf.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "38:32",
            "23:118",
            "23:29",
            "100:8",
            "68:32",
            "23:72",
            "22:77",
            "28:24",
            "44:20",
            "44:12"
        ],
        "BIBLE": [
            "torah:genesis:3:6",
            "writings:job:1:21",
            "prophets:hosea:2:14",
            "writings:i%20chronicles:21:3",
            "prophets:ezekiel:18:13",
            "prophets:ii%20kings:23:11",
            "prophets:ii%20samuel:4:10",
            "writings:ii%20chronicles:14:6",
            "prophets:joshua:23:15",
            "writings:ecclesiastes:8:15"
        ]
    }
}