{
    "VERSE": "38:34",
    "ARABIC": "وَلَقَدْ فَتَنَّا سُلَيْمَٰنَ وَأَلْقَيْنَا عَلَىٰ كُرْسِيِّهِۦ جَسَدًا ثُمَّ أَنَابَ",
    "ENGLISH": {
        "TRANSLATION_0": "We tested Sulayman and placed a lifeless body on his throne. Then he made tawba.",
        "TRANSLATION_1": "We surely tried Solomon, and placed another body on his throne. So he turned to God\n",
        "TRANSLATION_2": "Surely We put Solomon to the test and cast upon his throne a mere body. Thereupon he penitently turned (to Us).\n",
        "TRANSLATION_3": "We tested Solomon by (causing death to his son) and leaving his body on Solomon's chair. Then he turned to Us in repentance,\n",
        "TRANSLATION_4": "And We indeed tested Sulaiman, and placed a dead body on his throne – he therefore inclined towards His Lord.\n",
        "TRANSLATION_5": "And indeed, We tried Sulayman and We placed on his throne Jasad (a body), and he returned.\n",
        "TRANSLATION_6": "And certainly We tried Sulaiman, and We put on his throne a (mere) body, so he turned (to Allah).\n",
        "TRANSLATION_7": "Certainly We tried Solomon, and We cast upon his throne a mere body; then he repented.\n",
        "TRANSLATION_8": "And verily We tried Solomon, and set upon his throne a (mere) body. Then did he repent.\n",
        "TRANSLATION_9": "We tried Solomon by placing upon his throne a [lifeless] body; and thereupon he turned towards Us].\n",
        "TRANSLATION_10": "And assuredly We tried Sulaiman, and set upon his throne a mere body. Thereafter he was penitent.\n",
        "TRANSLATION_11": "Certainly We tried Solomon, and cast a [lifeless] body on his throne. Thereupon he was penitent.\n",
        "TRANSLATION_12": "And We did try Solomon: We placed on his throne a body (without life); but he did turn (to Us in true devotion):\n",
        "TRANSLATION_13": "And, indeed We did try Sulaiman (Solomon) and We placed on his throne Jasadan (a devil, so he lost his kingdom for a while) but he did return (to his throne and kingdom by the Grace of Allah and he did return) to Allah with obedience and in repentance.\n",
        "TRANSLATION_14": "Indeed, We tried Solomon and placed a body (of a child) upon his throne, then he repented.\n",
        "TRANSLATION_15": "We tested Solomon, and placed a body on his throne; then he repented.\n",
        "TRANSLATION_16": "And We certainly tried Solomon and placed on his throne a body; then he returned.\n",
        "TRANSLATION_17": "[38:34]   And We certainly tried Solomon: We tested him by wresting his kingdom from him, because he had married a woman [solely] out of his desire for her. She used to worship idols in his [own] home without his knowledge. Now, [control of] his kingdom lay in his ring. On one occasion, needing to withdraw [to relieve himself], he took it off and left it with this woman of his, whose name was al-Amīna, as was his custom; but a jinn, [disguised] in the form of Solomon, came to her and seized it from her. And We cast upon his throne a [lifeless] body, which was that [very] jinn, and he was [the one known as] Sakhr — or it was some other [jinn]; he sat upon Solomon’s throne and so [as was the case with Solomon] the birds and other [creatures] devoted themselves to him [in service]. When Solomon came out [of his palace], having seen him [the jinn] upon his throne, he said to the people, ‘I am Solomon [not him]!’ But they did not recognise him. Then he repented — Solomon returned to his kingdom, many days later, after he had managed to acquire the ring. He wore it and sat upon his throne [again].\n",
        "TRANSLATION_18": "(And verily We tried Solomon) by the loss of his kingdom for 40 days, the number of days in which the idols were worshipped in his house, (and set upon his throne a (mere) body) a devil. (Then did he repent) then did he return to his kingdom and to the obedience of his Lord and repented from his sin.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "38:34",
            "37:114",
            "37:72",
            "37:75",
            "15:24",
            "21:51",
            "21:8",
            "28:51",
            "21:65",
            "12:91"
        ],
        "BIBLE": [
            "torah:genesis:3:24",
            "writings:i%20chronicles:10:14",
            "prophets:joel:2:14",
            "torah:deuteronomy:30:3",
            "prophets:ezekiel:29:14",
            "writings:daniel:4:33",
            "prophets:jeremiah:31:18",
            "writings:daniel:9:13",
            "torah:deuteronomy:17:20",
            "prophets:i%20kings:11:4"
        ]
    }
}