{
    "VERSE": "38:4",
    "ARABIC": "وَعَجِبُوٓا۟ أَن جَآءَهُم مُّنذِرٌ مِّنْهُمْ وَقَالَ ٱلْكَٰفِرُونَ هَٰذَا سَٰحِرٌ كَذَّابٌ",
    "ENGLISH": {
        "TRANSLATION_0": "They are surprised that a warner should come to them from among themselves. The kuffar say, This is a lying magician.",
        "TRANSLATION_1": "They were surprised that one of them had come to them as warner; and the unbelievers said: \"He is a deceiving sorcerer.\n",
        "TRANSLATION_2": "They wondered that a warner had come to them from among themselves, and the deniers of the Truth said: “This is a sorcerer, and a big liar.\n",
        "TRANSLATION_3": "It seems strange to the pagans that a man from their own people should come to them as a Prophet. The unbelievers have said, \"He is only a lying magician\".\n",
        "TRANSLATION_4": "And they were surprised that a Herald of Warning came to them from among themselves; and the disbelievers said, “He is a magician, a great liar!”\n",
        "TRANSLATION_5": "And they wonder that a warner has come to them from among themselves. And the disbelievers say: \"This is a sorcerer, a liar.\"\n",
        "TRANSLATION_6": "And they wonder that there has come to them a warner from among themselves, and the disbelievers say: This is an enchanter, a liar.\n",
        "TRANSLATION_7": "Now they marvel that a warner has come to them from among them; and the unbelievers say, 'This is a lying sorcerer.\n",
        "TRANSLATION_8": "And they marvel that a warner from among themselves hath come unto them, and the disbelievers say: This is a wizard, a charlatan.\n",
        "TRANSLATION_9": "They are surprised that a warner should come to them from among themselves. They say, \"This is a magician, a great liar.\n",
        "TRANSLATION_10": "And they marvel that there should come Unto them a warner from among themselves. And the infidels say: this is a magician and a liar!\n",
        "TRANSLATION_11": "They consider it odd that there should come to them a warner from among themselves, and the faithless say, ‘This is a magician, a mendacious liar.’\n",
        "TRANSLATION_12": "So they wonder that a Warner has come to them from among themselves! and the Unbelievers say, \"This is a sorcerer telling lies!\n",
        "TRANSLATION_13": "And they (Arab pagans) wonder that a warner (Prophet Muhammad SAW) has come to them from among themselves! And the disbelievers say: \"This (Prophet Muhammad SAW) is a sorcerer, a liar.\n",
        "TRANSLATION_14": "They marvel now that, from among themselves, a warner has come to them. The unbelievers say: 'This is a lying sorcerer.\n",
        "TRANSLATION_15": "And they marveled that a warner has come to them from among them. The disbelievers said, “This is a lying magician.”\n",
        "TRANSLATION_16": "And they wonder that there has come to them a warner from among themselves. And the disbelievers say, \"This is a magician and a liar.\n",
        "TRANSLATION_17": "[38:4] And they marvel that a warner has come to them from among themselves, a messenger from among their number, to warn them and to threaten them with [the punishment of] the Fire after resurrection — and this [warner] is the Prophet (s). And those who disbelieve (the overt noun [al-kāfirūnā] has replaced the [third person] pronominalisation) say, ‘This is a sorcerer, a liar.\n",
        "TRANSLATION_18": "(And they) i.e. the Quraysh (marvel that a warner) a warning messenger (from among themselves) from their own lineage (hath come unto them, and the disbelievers) the disbelievers of Mecca (say: This) meaning Muhammad (pbuh) (is a wizard) who sows dispute between people, (a charlatan) who lies about Allah.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "38:4",
            "40:24",
            "3:88",
            "2:162",
            "12:29",
            "5:113",
            "26:19",
            "56:92",
            "6:129",
            "54:25"
        ],
        "BIBLE": [
            "torah:numbers:22:20",
            "prophets:ii%20kings:1:7",
            "prophets:isaiah:39:3",
            "prophets:ii%20kings:20:14",
            "torah:genesis:15:4",
            "torah:numbers:22:9",
            "prophets:i%20samuel:4:14",
            "writings:daniel:2:10",
            "prophets:i%20samuel:26:15",
            "prophets:i%20samuel:11:5"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:4:11"
        ]
    }
}