{
    "VERSE": "38:40",
    "ARABIC": "وَإِنَّ لَهُۥ عِندَنَا لَزُلْفَىٰ وَحُسْنَ مَـَٔابٍ",
    "ENGLISH": {
        "TRANSLATION_0": "He will have nearness to Us and a good Homecoming.",
        "TRANSLATION_1": "He has a high position with Us and an excellent abode.\n",
        "TRANSLATION_2": "Indeed an exalted position of nearness awaits him and an excellent resort.\n",
        "TRANSLATION_3": "In Our eyes he certainly has a high position and the best place to return.\n",
        "TRANSLATION_4": "And indeed for him in Our presence are, surely, proximity and an excellent abode.\n",
        "TRANSLATION_5": "And verily, for him is a near access to Us, and a good (final) return.\n",
        "TRANSLATION_6": "And most surely he had a nearness to Us and an excellent resort.\n",
        "TRANSLATION_7": "And he had a near place in Our presence and a fair resort.\n",
        "TRANSLATION_8": "And lo! he hath favour with Us, and a happy journey's end.\n",
        "TRANSLATION_9": "His reward will be nearness to Us, a good place to return to.\n",
        "TRANSLATION_10": "And verily for him is an approach with us, and a happy end.\n",
        "TRANSLATION_11": "Indeed he has [a station of] nearness with Us and a good destination.\n",
        "TRANSLATION_12": "And he enjoyed, indeed, a Near Approach to Us, and a beautiful Place of (Final) Return.\n",
        "TRANSLATION_13": "And verily, he enjoyed a near access to Us, and a good final return (Paradise).\n",
        "TRANSLATION_14": "And he has a place near to Us, and a fine return.\n",
        "TRANSLATION_15": "For him is nearness to Us, and a beautiful resort.\n",
        "TRANSLATION_16": "And indeed, for him is nearness to Us and a good place of return.\n",
        "TRANSLATION_17": "[38:40] And indeed he has [a station of] nearness with Us and a fair resort — a similar [statement] has already appeared [in another verse above].\n",
        "TRANSLATION_18": "(And lo! he hath favour) close rank (with Us, and a happy journey's end) and a happy return in the Hereafter.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "38:40",
            "38:25",
            "38:49",
            "13:29",
            "16:96",
            "37:168",
            "43:49",
            "38:47",
            "16:122",
            "38:30"
        ],
        "BIBLE": [
            "writings:ecclesiastes:3:20",
            "prophets:i%20kings:13:33",
            "prophets:hosea:5:15",
            "writings:nehemiah:1:9",
            "writings:daniel:4:31",
            "prophets:i%20samuel:10:13",
            "prophets:jeremiah:29:10",
            "writings:daniel:11:28",
            "torah:genesis:18:33",
            "prophets:joel:4:7"
        ]
    }
}