{
    "VERSE": "38:42",
    "ARABIC": "ٱرْكُضْ بِرِجْلِكَ هَٰذَا مُغْتَسَلٌۢ بَارِدٌ وَشَرَابٌ",
    "ENGLISH": {
        "TRANSLATION_0": "'Stamp your foot! Here is a cool bath and water to drink.'",
        "TRANSLATION_1": "Go swiftly to the spring,\" (We said). \"This cold water is for bathing and for drinking.\"\n",
        "TRANSLATION_2": "(We commanded him): “Stamp your foot on earth, and here is cool water to wash with and to drink.”\n",
        "TRANSLATION_3": "(We answered his prayer, healed his sickness, and told him), \"Run on your feet. This is cool water (for you) to wash and drink\".\n",
        "TRANSLATION_4": "We said to him, “Strike the earth with your foot; this cool spring is for bathing and drinking.” (A spring of gushed forth when he struck the earth – this was a miracle.)\n",
        "TRANSLATION_5": "(Allah said to him): \"Strike the ground with your foot. This is (a spring of) water to wash in, cool and a drink.\"\n",
        "TRANSLATION_6": "Urge with your foot; here is a cool washing-place and a drink.\n",
        "TRANSLATION_7": "Stamp thy foot! This is a laving-place cool, and a drink.'\n",
        "TRANSLATION_8": "(And it was said unto him): Strike the ground with thy foot. This (spring) is a cool bath and a refreshing drink.\n",
        "TRANSLATION_9": "We said, \"Stamp your foot! Here is cool water for you to wash in and drink,\"\n",
        "TRANSLATION_10": "Stamp the ground with thy foot. yonder is water to wash in, cool, and water to drink.\n",
        "TRANSLATION_11": "[We told him:] ‘Stamp your foot on the ground; this [ensuing spring] will be a cooling bath and drink.’\n",
        "TRANSLATION_12": "(The command was given:) \"Strike with thy foot: here is (water) wherein to wash, cool and refreshing, and (water) to drink.\"\n",
        "TRANSLATION_13": "(Allah said to him): \"Strike the ground with your foot: This is a spring of water to wash in, cool and a (refreshing) drink.\"\n",
        "TRANSLATION_14": "(We said): 'Stamp your foot on the ground, here is cool water with which to wash and a drink'\n",
        "TRANSLATION_15": "“Stamp with your foot—here is cool water to wash with, and to drink.”\n",
        "TRANSLATION_16": "[So he was told], \"Strike [the ground] with your foot; this is a [spring for] a cool bath and drink.\"\n",
        "TRANSLATION_17": "[38:42] And it was said to him: ‘Stamp your foot, on the ground — and he stamped [it] and a spring of water gushed forth, and it was said: This is a cool bath, [cool] water for you to wash with, and a drink’, for you to drink of. So he washed himself and drank [from it] whereat every ailment that had affected him internally and externally disappeared.\n",
        "TRANSLATION_18": "Then Gabriel said to him: Job! (Strike the ground with thy foot) when he did so, a spring gushed out. Gabriel said to him: (This (spring) is a cool bath), take a bath in it. When he took a bath his wounds healed. Gabriel asked him to strike the ground with his foot again and another spring gushed out. Gabriel said: (and a refreshing drink) this is cool, sweet water, drink from it! When he drank, his inside ailment was cured.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "38:42",
            "78:24",
            "38:62",
            "26:155",
            "94:8",
            "74:7",
            "79:19",
            "38:51",
            "23:38",
            "7:63"
        ],
        "BIBLE": [
            "prophets:judges:19:21",
            "torah:genesis:24:32",
            "torah:genesis:43:24",
            "prophets:i%20kings:21:20",
            "prophets:ii%20kings:6:28",
            "torah:genesis:24:43",
            "prophets:i%20kings:3:27",
            "torah:numbers:20:19",
            "torah:exodus:17:2",
            "writings:daniel:7:4"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:3:7",
            
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:3:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:1:8"
        ]
    }
}