{
    "VERSE": "38:5",
    "ARABIC": "أَجَعَلَ ٱلْءَالِهَةَ إِلَٰهًا وَٰحِدًا إِنَّ هَٰذَا لَشَىْءٌ عُجَابٌ",
    "ENGLISH": {
        "TRANSLATION_0": "Has he turned all the gods into One God? That is truly astonishing!'",
        "TRANSLATION_1": "Has he turned so many gods into one deity? This is indeed a strange thing!\"\n",
        "TRANSLATION_2": "Has he made the gods one single God? This is truly astounding.”\n",
        "TRANSLATION_3": "They say, \"Has he condemned all other gods but One? This is certainly strange\".\n",
        "TRANSLATION_4": "“Has he made all the Gods into One God? This is really something very strange!”\n",
        "TRANSLATION_5": "Has he made the gods into One God. Verily, this is a curious thing!\"\n",
        "TRANSLATION_6": "What! makes he the gods a single Allah? A strange thing is this, to be sure!\n",
        "TRANSLATION_7": "What, has he made the gods One God? This is indeed a marvellous thing.'\n",
        "TRANSLATION_8": "Maketh he the gods One Allah? Lo! that is an astounding thing.\n",
        "TRANSLATION_9": "Does he make all the deities out to be one God? This is indeed a strange thing.\"\n",
        "TRANSLATION_10": "Maketh he the gods One God? Verily that is a thing astounding!\n",
        "TRANSLATION_11": "‘Has he reduced the gods to one god? This is indeed an odd thing!’\n",
        "TRANSLATION_12": "Has he made the gods (all) into one Allah? Truly this is a wonderful thing!\"\n",
        "TRANSLATION_13": "Has he made the aliha (gods) (all) into One Ilah (God - Allah). Verily, this is a curious thing!\"\n",
        "TRANSLATION_14": "What, has he made the gods One God? This is indeed a wondrous thing'\n",
        "TRANSLATION_15": "“Did he turn all the gods into one God? This is something strange.”\n",
        "TRANSLATION_16": "Has he made the gods [only] one God? Indeed, this is a curious thing.\"\n",
        "TRANSLATION_17": "[38:5] Has he made the gods One God? — for he had said to them, ‘Say: there is no god except God’ — in other words [they objected]: how could one god suffice for all of creation? Lo! that is indeed a curious thing’.\n",
        "TRANSLATION_18": "520 (Maketh he the gods One God) could one God be sufficient to fulfil all our needs, as Muhammad claims? (Lo! That) which Muhammad says (is an astounding thing) is a bizarre thing.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "38:5",
            "37:4",
            "38:6",
            "11:72",
            "6:19",
            "50:2",
            "21:108",
            "45:19",
            "38:65",
            "21:59"
        ],
        "BIBLE": [
            "writings:job:10:2",
            "torah:exodus:23:13",
            "writings:i%20chronicles:21:3",
            "prophets:isaiah:29:21",
            "writings:job:41:20",
            "torah:deuteronomy:13:15",
            "writings:proverbs:20:25",
            "writings:psalms:21:13",
            "writings:nehemiah:2:4",
            "prophets:joshua:7:19"
        ]
    }
}