{
    "VERSE": "38:50",
    "ARABIC": "جَنَّٰتِ عَدْنٍ مُّفَتَّحَةً لَّهُمُ ٱلْأَبْوَٰبُ",
    "ENGLISH": {
        "TRANSLATION_0": "Gardens of Eden, whose gates will be open to them,",
        "TRANSLATION_1": "Gardens of Eden with gates open wide to them,\n",
        "TRANSLATION_2": "-- everlasting Gardens with gates wide open for them\n",
        "TRANSLATION_3": "They will enter gardens of Eden with their gates open for them.\n",
        "TRANSLATION_4": "Everlasting Gardens – all its gates are open for them.\n",
        "TRANSLATION_5": "`Adn Paradise, whose doors will be opened for them.\n",
        "TRANSLATION_6": "The gardens of perpetuity, the doors are opened for them.\n",
        "TRANSLATION_7": "Gardens of Eden, whereof the gates are open to them,\n",
        "TRANSLATION_8": "Gardens of Eden, whereof the gates are opened for them,\n",
        "TRANSLATION_9": "the Gardens of eternity with gates thrown wide open to them.\n",
        "TRANSLATION_10": "Gardens Everlasting, whereof the portals remain opened for them.\n",
        "TRANSLATION_11": "the Gardens of Eden, whose gates will be flung open for them.\n",
        "TRANSLATION_12": "Gardens of Eternity, whose doors will (ever) be open to them;\n",
        "TRANSLATION_13": "Adn (Edn) Paradise (everlasting Gardens), whose doors will be open for them, [It is said (in Tafsir At-Tabari, Part 23, Page 174) that one can speak to the doors, just one tells it to open and close, and it will open or close as it is ordered].\n",
        "TRANSLATION_14": "the Gardens of Eden whose gates shall be open to them,\n",
        "TRANSLATION_15": "The Gardens of Eden, with their doors wide-open for them.\n",
        "TRANSLATION_16": "Gardens of perpetual residence, whose doors will be opened to them.\n",
        "TRANSLATION_17": "[38:50] Gardens of Eden (jannāti ‘Adnin is either a substitution for, or an explicative supplement to, husna ma’ābin, ‘a fair return’) whose gates are [flung] open for them;\n",
        "TRANSLATION_18": "Allah explained where they will dwell in the Hereafter, saying: (Gardens of Eden) the source of prophets and righteous, (whereof the gates are opened for them) on the Day of Judgement. 525\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "38:50",
            "26:90",
            "47:6",
            "43:70",
            "59:20",
            "74:40",
            "13:23",
            "79:41",
            "69:22",
            "88:10"
        ],
        "BIBLE": [
            "prophets:ezekiel:44:2",
            "prophets:ezekiel:46:8",
            "prophets:i%20samuel:23:7",
            "torah:leviticus:14:35",
            "writings:psalms:118:19",
            "torah:genesis:28:17",
            "prophets:ezekiel:46:2",
            "prophets:ezekiel:44:3",
            "prophets:ii%20kings:19:23",
            "writings:nehemiah:7:3"
        ]
    }
}