{
    "VERSE": "38:52",
    "ARABIC": "وَعِندَهُمْ قَٰصِرَٰتُ ٱلطَّرْفِ أَتْرَابٌ",
    "ENGLISH": {
        "TRANSLATION_0": "and there will be dark-eyed maidens with them with eyes reserved for them alone.",
        "TRANSLATION_1": "With companions of modest look, the same in age, by their side.\n",
        "TRANSLATION_2": "and wherein there shall be with them well-matched, bashful mates.\n",
        "TRANSLATION_3": "They will have bashful wives of equal age with them.\n",
        "TRANSLATION_4": "And with them are the pure spouses, who do not set gaze upon men except their husbands, of single age.\n",
        "TRANSLATION_5": "And beside them will be Qasirat-at-Tarf, (and) of equal ages.\n",
        "TRANSLATION_6": "And with them shall be those restraining their eyes, equals in age.\n",
        "TRANSLATION_7": "and with them maidens restraining their glances of equal age.\n",
        "TRANSLATION_8": "And with them are those of modest gaze, companions.\n",
        "TRANSLATION_9": "with them, they will have pure, modest women of an equal age.\n",
        "TRANSLATION_10": "And with them will be virgins of refraining looks and of equal age.\n",
        "TRANSLATION_11": "and there will be with them maidens of restrained glances, of a like age.\n",
        "TRANSLATION_12": "And beside them will be chaste women restraining their glances, (companions) of equal age.\n",
        "TRANSLATION_13": "And beside them will be chaste females (virgins) restraining their glances only for their husbands, (and) of equal ages.\n",
        "TRANSLATION_14": "And with them will be maidens of equal age with modest gaze.\n",
        "TRANSLATION_15": "With them will be attendants with modest gaze, of same age.\n",
        "TRANSLATION_16": "And with them will be women limiting [their] glances and of equal age.\n",
        "TRANSLATION_17": "[38:52] And with them [there] will be maidens of restrained glances, restricting their eyes to their spouses, of a like age, of the same age, girls who are thirty three years of age (atrāb is the plural of tirb).\n",
        "TRANSLATION_18": "(And with them are those of modest gaze) wives who are content with their husbands, (companions) who are of the same age.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "38:52",
            "37:48",
            "51:34",
            "52:37",
            "11:83",
            "68:47",
            "43:49",
            "52:41",
            "32:12",
            "38:47"
        ],
        "BIBLE": [
            "writings:psalms:101:3",
            "writings:job:7:20",
            "torah:numbers:5:30",
            "writings:song%20of%20songs:5:12",
            "torah:genesis:44:21",
            "writings:psalms:54:5",
            "writings:psalms:86:14",
            "prophets:amos:9:4",
            "torah:deuteronomy:28:56",
            "torah:leviticus:14:11"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:3:5",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:3:8",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:3:6"
        ]
    }
}