{
    "VERSE": "38:55",
    "ARABIC": "هَٰذَا وَإِنَّ لِلطَّٰغِينَ لَشَرَّ مَـَٔابٍ",
    "ENGLISH": {
        "TRANSLATION_0": "This! Whereas for the profligate there is an evil Homecoming:",
        "TRANSLATION_1": "This (for the virtuous); but for the transgressors the evil destination,\n",
        "TRANSLATION_2": "All this (is for the God-fearing). But for the transgressors, an evil resort awaits them --\n",
        "TRANSLATION_3": "However, the rebellious ones will have the worst place to return.\n",
        "TRANSLATION_4": "This is for the virtuous; and indeed for the rebellious is a wretched destination.\n",
        "TRANSLATION_5": "This is so! And for the Taghin will be an evil final return.\n",
        "TRANSLATION_6": "This (shall be so); and most surely there is an evil resort for the inordinate ones;\n",
        "TRANSLATION_7": "All this; but for the insolent awaits an ill resort,\n",
        "TRANSLATION_8": "This (is for the righteous). And lo! for the transgressors there with be an evil journey's end,\n",
        "TRANSLATION_9": "But the arrogant will have the worst return:\n",
        "TRANSLATION_10": "This: and verily for the exorbitant there shall be an evil retreat:\n",
        "TRANSLATION_11": "This [will be for the righteous], and as for the rebellious there will surely be a bad destination:\n",
        "TRANSLATION_12": "Yea, such! but - for the wrong-doers will be an evil place of (Final) Return!-\n",
        "TRANSLATION_13": "This is so! And for the Taghun (transgressors, disobedient to Allah and His Messenger - disbelievers in the Oneness of Allah, criminals, etc.), will be an evil final return (Fire),\n",
        "TRANSLATION_14": "All of this; but, for the proud there is an ill return.\n",
        "TRANSLATION_15": "All This. But the transgressors will have a miserable return.\n",
        "TRANSLATION_16": "This [is so]. But indeed, for the transgressors is an evil place of return -\n",
        "TRANSLATION_17": "[38:55] That, which is mentioned, will be [the reward] for the believers [is so]; but for the insolent (this is a new sentence) there will surely be an evil [place of] return —\n",
        "TRANSLATION_18": "(This) is for the believers. (And lo! for the transgressors) for the disbelievers: Abu Jahl and his host (there will be an evil journey's end) an evil return in the Hereafter,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "38:55",
            "38:49",
            "78:22",
            "92:13",
            "15:9",
            "26:196",
            "38:19",
            "38:30",
            "37:139",
            "37:133"
        ],
        "BIBLE": [
            "writings:ecclesiastes:3:20",
            "prophets:i%20kings:13:33",
            "writings:daniel:11:28",
            "writings:nehemiah:1:9",
            "prophets:jeremiah:29:10",
            "writings:psalms:51:15",
            "prophets:hosea:5:15",
            "prophets:joel:4:7",
            "prophets:i%20samuel:26:25",
            "prophets:ii%20samuel:15:19"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:1:12",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:1:14",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:5:1"
        ]
    }
}