{
    "VERSE": "38:57",
    "ARABIC": "هَٰذَا فَلْيَذُوقُوهُ حَمِيمٌ وَغَسَّاقٌ",
    "ENGLISH": {
        "TRANSLATION_0": "This! So let them taste it - boiling water and scalding pus,",
        "TRANSLATION_1": "There will be boiling water for them and cold, clammy, fetid drink to taste,\n",
        "TRANSLATION_2": "All this (is for them); so let them taste boiling water and pus,\n",
        "TRANSLATION_3": "(They will be told), \"This is your recompense.\n",
        "TRANSLATION_4": "This is for the criminals – so that they may taste it – boiling hot water and pus.\n",
        "TRANSLATION_5": "This is so! Then let them taste it - Hamim and Ghassaq.\n",
        "TRANSLATION_6": "This (shall be so); so let them taste it, boiling and intensely cold (drink).\n",
        "TRANSLATION_7": "All this; so let them taste it - boiling water and pus,\n",
        "TRANSLATION_8": "Here is a boiling and an ice-cold draught, so let them taste it,\n",
        "TRANSLATION_9": "all this will be theirs; let them taste it -- a scalding, dark, foul fluid,\n",
        "TRANSLATION_10": "This - let them taste it: scalding water and corruption.\n",
        "TRANSLATION_11": "[They will be told, ‘This is scalding water and pus; let them taste it,\n",
        "TRANSLATION_12": "Yea, such! - then shall they taste it,- a boiling fluid, and a fluid dark, murky, intensely cold!-\n",
        "TRANSLATION_13": "This is so! Then let them taste it, a boiling fluid and dirty wound discharges.\n",
        "TRANSLATION_14": "All of this; so let them taste it, boiling water and pus,\n",
        "TRANSLATION_15": "All this. Let them taste it—boiling and bitter cold.\n",
        "TRANSLATION_16": "This - so let them taste it - is scalding water and [foul] purulence.\n",
        "TRANSLATION_17": "[38:57] This, chastisement — inferred [as so] by what follows — let them then taste it: burning hot water and pus (read ghasāq or ghassāq), the festering matter excreted by the inhabitants of the Fire;\n",
        "TRANSLATION_18": "(Here is) for the disbelievers (a boiling and an ice cold draught) which burns them just as fire does, (so let them taste it) let them taste the torment of Gehenna,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "38:57",
            "78:25",
            "70:10",
            "96:17",
            "55:44",
            "56:42",
            "7:119",
            "21:88",
            "56:54",
            "26:60"
        ],
        "BIBLE": [
            "prophets:jonah:3:7",
            "torah:numbers:20:19",
            "torah:leviticus:11:34",
            "writings:psalms:32:6",
            "torah:exodus:17:6",
            "torah:genesis:24:14",
            "prophets:ii%20kings:2:21",
            "writings:job:15:31",
            "torah:deuteronomy:17:4",
            "prophets:i%20kings:13:16"
        ]
    }
}