{
    "VERSE": "38:61",
    "ARABIC": "قَالُوا۟ رَبَّنَا مَن قَدَّمَ لَنَا هَٰذَا فَزِدْهُ عَذَابًا ضِعْفًا فِى ٱلنَّارِ",
    "ENGLISH": {
        "TRANSLATION_0": "They will say, 'Our Lord, give him who brought this on us double the punishment in the Fire!'",
        "TRANSLATION_1": "They will say: \"O Lord, give him who has brought this upon us two times more the torment of Hell;\"\n",
        "TRANSLATION_2": "They will say: “Our Lord, give twofold punishment in the Fire to him who has led us to this.”\n",
        "TRANSLATION_3": "They will continue saying, \"Lord, double the torment of fire for those who led us into this.\n",
        "TRANSLATION_4": "They say, “Our Lord! Whoever has brought this calamity upon us – double the punishment of the fire for him!”\n",
        "TRANSLATION_5": "They will say: \"Our Lord! Whoever brought this upon us, add to him a double torment in the Fire!\"\n",
        "TRANSLATION_6": "They shall say: Our Lord! whoever prepared it first for us, add Thou to him a double chastisement in the fire.\n",
        "TRANSLATION_7": "They say, 'Our Lord, whoso forwarded this for us, give him a double chastisement in the Fire!'\n",
        "TRANSLATION_8": "They say: Our Lord! Whoever did prepare this for us, oh, give him double portion of the Fire!\n",
        "TRANSLATION_9": "adding, \"Our Lord, give double punishment to those who brought this upon us.\"\n",
        "TRANSLATION_10": "They Will say: our Lord! whosever hath brought this upon us, - Unto him increase doubly the torment of the Fire.\n",
        "TRANSLATION_11": "They will say, ‘Our Lord! Whoever has prepared this for us, double his punishment in the Fire!’\n",
        "TRANSLATION_12": "They will say: \"Our Lord! whoever brought this upon us,- Add to him a double Penalty in the Fire!\"\n",
        "TRANSLATION_13": "They will say: \"Our Lord! Whoever brought this upon us, add to him a double torment in the Fire!\"\n",
        "TRANSLATION_14": "They will say: 'Our Lord, give those who brought this upon us double the punishment of the Fire'\n",
        "TRANSLATION_15": "They will say, “Our Lord, whoever brought this upon us, give him double torment in the Fire.”\n",
        "TRANSLATION_16": "They will say, \"Our Lord, whoever brought this upon us - increase for him double punishment in the Fire.\"\n",
        "TRANSLATION_17": "[38:61] They, also, say, ‘Our Lord, whoever prepared this for us, give him double his chastisement, that is, [give him in addition] the like of his chastisement, for his disbelief, in the Fire!’\n",
        "TRANSLATION_18": "(They say) the first to enter the Fire and the last say: (Our Lord!) our Lord! (Whoever did prepare) whoever prescribed (this) religion; meaning here Satan and all the leaders of error (for us), oh, give him double portion of the Fire) double than what we have!\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "38:61",
            "3:16",
            "33:68",
            "5:37",
            "46:34",
            "2:201",
            "8:14",
            "23:76",
            "44:12",
            "40:49"
        ],
        "BIBLE": [
            "prophets:i%20kings:17:20",
            "prophets:isaiah:23:4",
            "torah:exodus:33:1",
            "torah:numbers:28:3",
            "prophets:joshua:7:7",
            "torah:deuteronomy:9:28",
            "torah:genesis:15:5",
            "writings:ii%20chronicles:28:13",
            "torah:exodus:32:21",
            "prophets:amos:3:1"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:14",
            "Sefer%20Yetzirah:1:10",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:5:1"
        ]
    }
}