{
    "VERSE": "38:63",
    "ARABIC": "أَتَّخَذْنَٰهُمْ سِخْرِيًّا أَمْ زَاغَتْ عَنْهُمُ ٱلْأَبْصَٰرُ",
    "ENGLISH": {
        "TRANSLATION_0": "Did we turn them into figures of fun? Did our eyes disdain to look at them?'",
        "TRANSLATION_1": "Did we laugh at them (for nothing), or our eyes fail to pick them out?\"\n",
        "TRANSLATION_2": "Is it that we mistakenly made fun of them; or have they disappeared from our sight?”\n",
        "TRANSLATION_3": "and whom we mocked? Have they been rescued or can our eyes not find them?\"\n",
        "TRANSLATION_4": "“Did we mock at them or did our eyes turn away from them?”\n",
        "TRANSLATION_5": "Did we take them as an object of mockery, or have (our) eyes failed to perceive them\"\n",
        "TRANSLATION_6": "Was it that we (only) took them in scorn, or have our eyes (now) turned aside from them?\n",
        "TRANSLATION_7": "What, did we take them for a laughing-stock? Or have our eyes swerved away from them?'\n",
        "TRANSLATION_8": "Did we take them (wrongly) for a laughing-stock, or have our eyes missed them?\n",
        "TRANSLATION_9": "[and] whom we made the target of our derision? Or are they here, and our eyes have missed them?\"\n",
        "TRANSLATION_10": "Took we them so unjustly for a butt of mockery, or are they deluding our eyes?\n",
        "TRANSLATION_11": "ridiculing them, or do [our] eyes miss them [here]?’\n",
        "TRANSLATION_12": "Did we treat them (as such) in ridicule, or have (our) eyes failed to perceive them?\"\n",
        "TRANSLATION_13": "Did we take them as an object of mockery, or have (our) eyes failed to perceive them?\"\n",
        "TRANSLATION_14": "Have we taken them in mockery? Or, have our eyes swerved from them?'\n",
        "TRANSLATION_15": "Did we take them for mockery, or have our eyes swerved from them?\n",
        "TRANSLATION_16": "Is it [because] we took them in ridicule, or has [our] vision turned away from them?\"\n",
        "TRANSLATION_17": "[38:63]   Did we treat them mockingly? (read sukhriyyan, or sikhriyyan), did we use to deride them in [the life of] the world (the [final] yā’ [in sikhriyyā] is attributive). In other words, are they missing? Or have [our] eyes missed them [here]?’, so that we have not caught sight of them. Such [men] were the poor among the Muslims, like ‘Ammār [b. Yāsir], Bilāl [al-Habashī], Suhayb [al-Rūmī] and Salmān [al-Fārisī].\n",
        "TRANSLATION_18": "(Did we take them (wrongly) for a laughing stock) we made them subservient to us in the life of the world, (or have our eyes missed them) and we did not see them?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "38:63",
            "53:17",
            "23:110",
            "79:9",
            "75:7",
            "67:4",
            "56:59",
            "56:64",
            "68:51",
            "27:27"
        ],
        "BIBLE": [
            "torah:genesis:42:24",
            "prophets:i%20samuel:8:3",
            "prophets:i%20kings:20:41",
            "prophets:i%20samuel:6:12",
            "torah:exodus:3:3",
            "prophets:isaiah:44:20",
            "writings:psalms:119:51",
            "torah:exodus:10:19",
            "writings:psalms:141:8",
            "writings:esther:2:15"
        ]
    }
}