{
    "VERSE": "38:65",
    "ARABIC": "قُلْ إِنَّمَآ أَنَا۠ مُنذِرٌ وَمَا مِنْ إِلَٰهٍ إِلَّا ٱللَّهُ ٱلْوَٰحِدُ ٱلْقَهَّارُ",
    "ENGLISH": {
        "TRANSLATION_0": "Say: 'I am only a warner. There is no god except Allah, the One, the All-Conquering,",
        "TRANSLATION_1": "Say: \"I am only a warner, and there is no other god but God, the one, the omnipotent,\n",
        "TRANSLATION_2": "Tell them, (O Prophet): “I am nothing but a warner. There is no deity but Allah, the One, the Supreme,\n",
        "TRANSLATION_3": "(Muhammad) say, \"I am only a warner. The only Lord is God, the Almighty.\n",
        "TRANSLATION_4": "Proclaim (O dear Prophet Mohammed – peace and blessings be upon him), “I am purely a Herald of Warning – and there is no God except Allah, the One, the All Dominant.”\n",
        "TRANSLATION_5": "Say: \"I am only a warner and there is no God (worthy of worship) except Allah the One, the Irresistible,\"\n",
        "TRANSLATION_6": "Say: I am only a warner, and there is no god but Allah, the One, the Subduer (of all):\n",
        "TRANSLATION_7": "Say: 'I am only a warner. There is not any god but God, the One, the Omnipotent,\n",
        "TRANSLATION_8": "Say (unto them, O Muhammad): I am only a warner, and there is no Allah save Allah, the One, the Absolute,\n",
        "TRANSLATION_9": "Say, [Prophet], \"I am only a warner. There is no god but God, the One, the All-Powerful,\n",
        "TRANSLATION_10": "Say thou: I am but warner, and there is no god but Allah, the One, the Subduer.\n",
        "TRANSLATION_11": "Say, ‘I am just a warner, and there is no god except Allah, the One, the All-paramount,\n",
        "TRANSLATION_12": "Say: \"Truly am I a Warner: no god is there but the one Allah, Supreme and Irresistible,-\n",
        "TRANSLATION_13": "Say (O Muhammad SAW): \"I am only a warner and there is no Ilah (God) except Allah (none has the right to be worshipped but Allah) the One, the Irresistible,\n",
        "TRANSLATION_14": "Say: 'I am only a warner. There is no god except Allah, the One, the Conqueror,\n",
        "TRANSLATION_15": "Say, “I am only a warner, and there is no god except God—the One, the Conqueror.\n",
        "TRANSLATION_16": "Say, [O Muhammad], \"I am only a warner, and there is not any deity except Allah, the One, the Prevailing.\n",
        "TRANSLATION_17": "[38:65] Say, O Muhammad (s), to the disbelievers of Mecca: ‘I am only a warner, to threaten [disbelievers] with [punishment in] the Fire. And there is no god except God, the One, the All-Compelling, of [all] His creatures;\n",
        "TRANSLATION_18": "(Say) to the people of Mecca, Muhammad: (I am only a warner) a warning messenger, (and there is no God save Allah) He has no son or partner, (the One, the Absolute) Superior over His creation,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "38:65",
            "39:4",
            "40:16",
            "14:48",
            "16:51",
            "21:108",
            "72:22",
            "20:14",
            "41:6",
            "87:7"
        ],
        "BIBLE": [
            "prophets:jeremiah:14:13",
            "writings:ii%20chronicles:14:10",
            "prophets:isaiah:49:4",
            "prophets:i%20kings:18:36",
            "prophets:jeremiah:4:10",
            "writings:psalms:40:6",
            "writings:ii%20chronicles:20:6",
            "prophets:ii%20kings:23:17",
            "prophets:i%20samuel:3:17",
            "prophets:jeremiah:7:2"
        ]
    }
}