{
    "VERSE": "38:66",
    "ARABIC": "رَبُّ ٱلسَّمَٰوَٰتِ وَٱلْأَرْضِ وَمَا بَيْنَهُمَا ٱلْعَزِيزُ ٱلْغَفَّٰرُ",
    "ENGLISH": {
        "TRANSLATION_0": "Lord of the heavens and the earth and everything between them, the Almighty, the Endlessly Forgiving.'",
        "TRANSLATION_1": "Lord of the heavens and the earth and all that lies between them, all-mighty, all-forgiving.\"\n",
        "TRANSLATION_2": "the Lord of the heavens and the earth and all that is in between them, the Most Mighty, the Most Forgiving.”\n",
        "TRANSLATION_3": "He is the Lord of the heavens, the earth, and all that is between them, the Majestic and All-forgiving\".\n",
        "TRANSLATION_4": "“Lord of the heavens and the earth and all that is between them – the Almighty, the Oft Forgiving.”\n",
        "TRANSLATION_5": "The Lord of the heavens and the earth and all that is between them, the Almighty, the Oft-Forgiving.\"\n",
        "TRANSLATION_6": "The Lord of the heavens and the earth and what is between them, the Mighty, the most Forgiving.\n",
        "TRANSLATION_7": "Lord of the heavens and earth, and of what between them is, the All-mighty, the All-forgiving.'\n",
        "TRANSLATION_8": "Lord of the heavens and the earth and all that is between them, the Mighty, the Pardoning.\n",
        "TRANSLATION_9": "Lord of the heavens and earth and everything between them, the Almighty, the Most Forgiving.\"\n",
        "TRANSLATION_10": "Lord of the heavens and the earth and whatsoever is in- between the twain, the Mighty, the Forgiver.\n",
        "TRANSLATION_11": "the Lord of the heavens and the earth and whatever is between them, the All-mighty, the All-forgiver.’\n",
        "TRANSLATION_12": "The Lord of the heavens and the earth, and all between,- Exalted in Might, able to enforce His Will, forgiving again and again.\"\n",
        "TRANSLATION_13": "The Lord of the heavens and the earth and all that is between them, the All-Mighty, the Oft-Forgiving.\"\n",
        "TRANSLATION_14": "the Lord of the heavens and the earth and all that is between them; the Almighty, the Forgiving'\n",
        "TRANSLATION_15": "The Lord of the heavens and the earth, and everything between them; the Mighty, the Forgiver.”\n",
        "TRANSLATION_16": "Lord of the heavens and the earth and whatever is between them, the Exalted in Might, the Perpetual Forgiver.\"\n",
        "TRANSLATION_17": "[38:66] Lord of the heavens and the earth and all that is between them, the Mighty, Whose way [always] prevails, the [ever] Forgiving’, of His friends.\n",
        "TRANSLATION_18": "(Lord of the heavens and the earth) the Creator of the heavens and the earth (and all that is between them) of created beings and marvels, (the Mighty) in retribution against those who disbelieve in Him, (the Pardoning) He pardons those who repent and believe in Him.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "38:66",
            "44:7",
            "26:24",
            "37:5",
            "21:16",
            "44:38",
            "19:65",
            "78:37",
            "20:6",
            "3:133"
        ],
        "BIBLE": [
            "writings:psalms:148:13",
            "writings:psalms:97:9",
            "writings:psalms:108:6",
            "writings:psalms:57:12",
            "writings:psalms:57:6",
            "writings:psalms:8:2",
            "torah:genesis:1:1",
            "writings:i%20chronicles:29:11",
            "writings:proverbs:3:19",
            "writings:psalms:115:15"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:4:9"
        ]
    }
}