{
    "VERSE": "38:69",
    "ARABIC": "مَا كَانَ لِىَ مِنْ عِلْمٍۭ بِٱلْمَلَإِ ٱلْأَعْلَىٰٓ إِذْ يَخْتَصِمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "I knew nothing of the Highest Assembly when they debated.",
        "TRANSLATION_1": "I had no knowledge of the higher Assembly when they discussed it among themselves.\n",
        "TRANSLATION_2": "(Tell them): “I had no knowledge of the High Council when they were disputing.\n",
        "TRANSLATION_3": "I have no knowledge of the dispute among the angels (concerning their attitude towards Adam).\n",
        "TRANSLATION_4": "“What did I know of the heavenly world, when the angels had disputed.”\n",
        "TRANSLATION_5": "I had no knowledge of the chiefs (angels) on high when they were disputing and discussing.\"\n",
        "TRANSLATION_6": "I had no knowledge of the exalted chiefs when they contended:\n",
        "TRANSLATION_7": "I had no knowledge of the High Council when they disputed.\n",
        "TRANSLATION_8": "I had no knowledge of the Highest Chiefs when they disputed;\n",
        "TRANSLATION_9": "I had no knowledge of the Exalted Assembly when they argued [against the creation of man]:\n",
        "TRANSLATION_10": "I had no knowledge of the chiefs on high when they disputed;\n",
        "TRANSLATION_11": "I have no knowledge of the Supernal Elite when they contend.\n",
        "TRANSLATION_12": "No knowledge have I of the Chiefs on high, when they discuss (matters) among themselves.\n",
        "TRANSLATION_13": "I had no knowledge of the chiefs (angels) on high when they were disputing and discussing (about the creation of Adam).\n",
        "TRANSLATION_14": "I had no knowledge of the High Assembly's dispute.\n",
        "TRANSLATION_15": "I have no knowledge of the Highest Assembly as they dispute.\n",
        "TRANSLATION_16": "I had no knowledge of the exalted assembly [of angels] when they were disputing [the creation of Adam].\n",
        "TRANSLATION_17": "[38:69] I had no knowledge of the High Council, that is to say, [of] the angels, when they disputed, in the matter of Adam, when God, exalted be He, said [to them]: ‘I am appointing on earth a vicegerent’, to the end [of the verse, Q. 2:30].\n",
        "TRANSLATION_18": "(I had no knowledge of the Highest Chiefs) i.e. of the angels, if it was not Allah Who sent me (when they disputed) when they spoke and said: (Wilt Thou place therein one who will do harm therein and will shed blood;\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "38:69",
            "37:8",
            "26:34",
            "26:112",
            "68:52",
            "43:20",
            "12:104",
            "38:87",
            "81:27",
            "7:109"
        ],
        "BIBLE": [
            "writings:psalms:73:11",
            "writings:daniel:4:14",
            "torah:exodus:18:16",
            "prophets:judges:13:6",
            "torah:genesis:43:7",
            "prophets:isaiah:19:12",
            "writings:psalms:46:11",
            "writings:ruth:3:18",
            "prophets:jonah:1:10",
            "prophets:judges:3:2"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:3:5",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:3:6",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:3:8",
            "Sefer%20Yetzirah:4:12"
        ]
    }
}