{
    "VERSE": "38:71",
    "ARABIC": "إِذْ قَالَ رَبُّكَ لِلْمَلَٰٓئِكَةِ إِنِّى خَٰلِقٌۢ بَشَرًا مِّن طِينٍ",
    "ENGLISH": {
        "TRANSLATION_0": "Your Lord said to the angels, 'I am going to create a human being out of clay.",
        "TRANSLATION_1": "When your Lord said to the angels: \"I am going to create a man from clay;\n",
        "TRANSLATION_2": "When your Lord said to the angels: “Verily I am creating a human being from clay.\n",
        "TRANSLATION_3": "When your Lord told the angels, \"I will create a mortal out of clay,\n",
        "TRANSLATION_4": "(Remember) When your Lord said to the angels, “I will create a human from clay.” –\n",
        "TRANSLATION_5": "(Remember) when your Lord said to the angels: \"Truly, I am going to create man from clay.\"\n",
        "TRANSLATION_6": "When your Lord said to the angels; Surely I am going to create a mortal from dust:\n",
        "TRANSLATION_7": "When thy Lord said to the angels, 'See, I am creating a mortal of a clay.\n",
        "TRANSLATION_8": "When thy Lord said unto the angels: Lo! I am about to create a mortal out of mire,\n",
        "TRANSLATION_9": "Your Lord said to the angels, \"I am about to create a human being out of clay;\n",
        "TRANSLATION_10": "Recall what time thy Lord said Unto the angels: verily I am about to create a human being from clay;\n",
        "TRANSLATION_11": "When your Lord said to the angels, ‘Indeed I am about to create a human being out of clay.\n",
        "TRANSLATION_12": "Behold, thy Lord said to the angels: \"I am about to create man from clay:\n",
        "TRANSLATION_13": "(Remember) when your Lord said to the angels: \"Truly, I am going to create man from clay\".\n",
        "TRANSLATION_14": "When your Lord said to the angels: 'I am creating a human from clay,\n",
        "TRANSLATION_15": "Your Lord said to the angels, “I am creating a human being from clay.\n",
        "TRANSLATION_16": "[So mention] when your Lord said to the angels, \"Indeed, I am going to create a human being from clay.\n",
        "TRANSLATION_17": "[38:71] Mention, when your Lord said to the angels, ‘Indeed I am about to create a human being out of clay, and this was Adam.\n",
        "TRANSLATION_18": "Then Allah explained the argument of the angels, saying: mention to them, Muhammad (When thy Lord said unto the angels: lo! I am about to create a mortal out of mire) i.e. Adam, 527\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "38:71",
            "15:28",
            "8:9",
            "89:22",
            "37:100",
            "2:131",
            "3:124",
            "38:35",
            "25:22",
            "17:61"
        ],
        "BIBLE": [
            "torah:numbers:22:35",
            "prophets:ezekiel:36:20",
            "prophets:ii%20kings:5:4",
            "prophets:ii%20samuel:19:20",
            "prophets:judges:6:16",
            "torah:exodus:2:13",
            "writings:job:1:12",
            "prophets:i%20kings:13:14",
            "prophets:ii%20kings:3:6",
            "torah:genesis:15:4"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:3:5",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:3:4",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:1:1"
        ]
    }
}