{
    "VERSE": "38:72",
    "ARABIC": "فَإِذَا سَوَّيْتُهُۥ وَنَفَخْتُ فِيهِ مِن رُّوحِى فَقَعُوا۟ لَهُۥ سَٰجِدِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "When I have formed him and breathed My Ruh into him, fall down in prostration to him!'",
        "TRANSLATION_1": "And when I have made him and have breathed into him of My spirit. Fall down in homage before him.\"\n",
        "TRANSLATION_2": "After I have created him and breathed into him of My spirit, fall you down, prostrating yourselves to him.”\n",
        "TRANSLATION_3": "and when I give it proper shape and blow My spirit into it, bow down in prostration to him,\"\n",
        "TRANSLATION_4": "“So when I have perfected him and breathed into him a spirit from Myself, (you all) fall down before him in prostration.”\n",
        "TRANSLATION_5": "So, when I have fashioned him and breathed into him (his) soul created by Me, then you fall down prostrate to him.\"\n",
        "TRANSLATION_6": "So when I have made him complete and breathed into him of My spirit, then fall down making obeisance to him.\n",
        "TRANSLATION_7": "When I have shaped him, and breathed My spirit in him, fall you down, bowing before him!'\n",
        "TRANSLATION_8": "And when I have fashioned him and breathed into him of My Spirit, then fall down before him prostrate,\n",
        "TRANSLATION_9": "and when I have formed him fully and breathed My spirit into him, prostrate yourselves before him.\"\n",
        "TRANSLATION_10": "Then when I have formed him and breathed into him of My spirit, fall down before him prostrate.\n",
        "TRANSLATION_11": "So when I have proportioned him and breathed into him of My spirit, then fall down in prostration before him.’\n",
        "TRANSLATION_12": "When I have fashioned him (in due proportion) and breathed into him of My spirit, fall ye down in obeisance unto him.\"\n",
        "TRANSLATION_13": "So when I have fashioned him and breathed into him (his) soul created by Me, then you fall down prostrate to him.\"\n",
        "TRANSLATION_14": "after I have shaped him and breathed of My spirit (I created) into him, fall down prostrate before him'\n",
        "TRANSLATION_15": "When I have formed him, and breathed into him of My spirit, fall prostrate before him.\n",
        "TRANSLATION_16": "So when I have proportioned him and breathed into him of My [created] soul, then fall down to him in prostration.\"\n",
        "TRANSLATION_17": "[38:72] So when I have proportioned him, completed him, and breathed in him, [when I have] caused to flow [therein], My spirit, so that he becomes a living [being] — the addition of ‘the spirit’ to Adam is an honour for him; the ‘spirit’ is a subtle body that gives life to a human being by permeating him — then fall down in prostration before him!’ — a prostration of salutation [that is actually] a bow.\n",
        "TRANSLATION_18": "(And when I have fashioned him) and when I have gathered his creation (and breathed into him of My spirit) and placed in him My spirit, (then fall down before him prostrate) then prostrate before him,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "15:29",
            "38:72",
            "26:80",
            "74:14",
            "26:21",
            "2:152",
            "21:18",
            "23:110",
            "44:21",
            "7:25"
        ],
        "BIBLE": [
            "prophets:isaiah:42:1",
            "torah:numbers:15:28",
            "torah:deuteronomy:22:8",
            "torah:exodus:30:37",
            "writings:psalms:19:8",
            "torah:exodus:28:3",
            "prophets:isaiah:19:10",
            "torah:exodus:30:15",
            "prophets:ezekiel:32:10",
            "prophets:i%20samuel:2:29"
        ]
    }
}