{
    "VERSE": "38:74",
    "ARABIC": "إِلَّآ إِبْلِيسَ ٱسْتَكْبَرَ وَكَانَ مِنَ ٱلْكَٰفِرِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "except for Iblis who was arrogant and was one of the kafirun.",
        "TRANSLATION_1": "Except Iblis. He was filled with pride and turned an unbeliever.\n",
        "TRANSLATION_2": "except Iblis. He waxed proud and became one of the unbelievers.\n",
        "TRANSLATION_3": "except Iblis who puffed himself up with pride and became a disbeliever.\n",
        "TRANSLATION_4": "Except Iblis; he was proud and was, from the beginning, a disbeliever.\n",
        "TRANSLATION_5": "Except Iblis, he was proud and was one of the disbelievers.\n",
        "TRANSLATION_6": "But not Iblis: he was proud and he was one of the unbelievers.\n",
        "TRANSLATION_7": "save Iblis; he waxed proud, and was one of the unbelievers.\n",
        "TRANSLATION_8": "Saving Iblis; he was scornful and became one of the disbelievers.\n",
        "TRANSLATION_9": "but not Satan, who was too proud. He became one of those who deny the truth.\n",
        "TRANSLATION_10": "Not so lblis. He grew stiffnecked and became of the infidels.\n",
        "TRANSLATION_11": "but not Iblis; he acted arrogantly and he was one of the faithless.\n",
        "TRANSLATION_12": "Not so Iblis: he was haughty, and became one of those who reject Faith.\n",
        "TRANSLATION_13": "Except Iblis (Satan) he was proud and was one of the disbelievers.\n",
        "TRANSLATION_14": "except iblis (satan, the father of the jinn), he became too proud, for he was one of the unbelievers.\n",
        "TRANSLATION_15": "Except for Satan. He was too proud, and one of the faithless.\n",
        "TRANSLATION_16": "Except Iblees; he was arrogant and became among the disbelievers.\n",
        "TRANSLATION_17": "[38:74]   except Iblīs, the father of the jinn, who was among the [audience of] angels; he was disdainful and he was one of the disbelievers, according to God’s knowledge, exalted be He.\n",
        "TRANSLATION_18": "(Saving Iblis, he was scornful) he was too proud to prostrate before Adam (and became one of the disbelievers) because of disobeying Allah's command.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "38:74",
            "53:53",
            "7:120",
            "15:31",
            "56:92",
            "26:99",
            "26:19",
            "70:25",
            "56:10",
            "37:133"
        ],
        "BIBLE": [
            "writings:ii%20chronicles:29:6",
            "writings:psalms:78:57",
            "prophets:jeremiah:2:27",
            "writings:ii%20chronicles:20:32",
            "writings:daniel:9:16",
            "prophets:i%20kings:22:43",
            "writings:psalms:119:51",
            "writings:ii%20chronicles:34:2",
            "prophets:malachi:3:7",
            "prophets:i%20kings:11:4"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:1:13"
        ]
    }
}