{
    "VERSE": "38:76",
    "ARABIC": "قَالَ أَنَا۠ خَيْرٌ مِّنْهُ خَلَقْتَنِى مِن نَّارٍ وَخَلَقْتَهُۥ مِن طِينٍ",
    "ENGLISH": {
        "TRANSLATION_0": "He said, 'I am better than him. You created me from fire but You created him from clay.'",
        "TRANSLATION_1": "He said: \"I am better than he. You created me from fire, and him from clay.\"\n",
        "TRANSLATION_2": "He replied: “I am nobler than he. You created me from fire and created him from clay.”\n",
        "TRANSLATION_3": "He said, \"I am better than him. You have created me from fire and him out of clay\".\n",
        "TRANSLATION_4": "Said Iblis, “I am better than him; You made me from fire, and You have created him from clay!”\n",
        "TRANSLATION_5": "[Iblis] said: \"I am better than he. You created me from fire, and You created him from clay.\"\n",
        "TRANSLATION_6": "He said: I am better than he; Thou hast created me of fire, and him Thou didst create of dust.\n",
        "TRANSLATION_7": "Said he, 'I am better than he; Thou createdst me of fire, and him Thou createdst of clay.'\n",
        "TRANSLATION_8": "He said: I am better than him. Thou createdst me of fire, whilst him Thou didst create of clay.\n",
        "TRANSLATION_9": "Satan replied, \"I am better than him. You created me from fire, but You created him from clay.\"\n",
        "TRANSLATION_10": "He said: I am better than he: me Thou hast created of fire, and him Thou hast created of clay.\n",
        "TRANSLATION_11": "‘I am better than him,’ he said. ‘You created me from fire and You created him from clay.’\n",
        "TRANSLATION_12": "(Iblis) said: \"I am better than he: thou createdst me from fire, and him thou createdst from clay.\"\n",
        "TRANSLATION_13": "[Iblis (Satan)] said: \"I am better than he, You created me from fire, and You created him from clay.\"\n",
        "TRANSLATION_14": "He (satan) replied: 'I am better than he. You created me from fire, and You created him from clay'\n",
        "TRANSLATION_15": "He said, “I am better than he; You created me from fire, and You created him from clay.”\n",
        "TRANSLATION_16": "He said, \"I am better than him. You created me from fire and created him from clay.\"\n",
        "TRANSLATION_17": "[38:76] He said, ‘I am better than him. You created me from fire and You created him from clay’.\n",
        "TRANSLATION_18": "(He said: I am better than him. Thou createdst me of fire, whilst him Thou didst create of clay) and the Fire consumes clay; this is why I did not prostrate before him.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "38:76",
            "7:12",
            "55:15",
            "3:131",
            "92:14",
            "23:118",
            "23:29",
            "70:21",
            "88:4",
            "43:52"
        ],
        "BIBLE": [
            "torah:genesis:29:19",
            "torah:genesis:33:9",
            "writings:job:11:4",
            "writings:ruth:3:5",
            "prophets:i%20samuel:1:8",
            "torah:genesis:27:24",
            "torah:genesis:3:13",
            "torah:genesis:6:7",
            "torah:exodus:4:23",
            "prophets:joshua:2:17"
        ]
    }
}