{
    "VERSE": "38:78",
    "ARABIC": "وَإِنَّ عَلَيْكَ لَعْنَتِىٓ إِلَىٰ يَوْمِ ٱلدِّينِ",
    "ENGLISH": {
        "TRANSLATION_0": "My curse is upon you until the Day of Reckoning.'",
        "TRANSLATION_1": "Upon you will be My damnation till the Day of Doom.\"\n",
        "TRANSLATION_2": "and My curse shall remain upon you till the Day of Resurrection.”\n",
        "TRANSLATION_3": "My condemnation will be with you until the Day of Judgment!\"\n",
        "TRANSLATION_4": "“And indeed My curse is upon you till the Day of Judgement.”\n",
        "TRANSLATION_5": "And verily, My curse is on you till the Day of Recompense.\"\n",
        "TRANSLATION_6": "And surely My curse is on you to the day of judgment.\n",
        "TRANSLATION_7": "Upon thee shall rest My curse, till the Day of Doom.'\n",
        "TRANSLATION_8": "And lo! My curse is on thee till the Day of Judgment.\n",
        "TRANSLATION_9": "My curse will remain upon you till the Day of Judgement!\"\n",
        "TRANSLATION_10": "And verily My curse shall be on thee till the Day of Requital,\n",
        "TRANSLATION_11": "and indeed My curse will be on you till the Day of Retribution.’\n",
        "TRANSLATION_12": "And My curse shall be on thee till the Day of Judgment.\"\n",
        "TRANSLATION_13": "And verily!, My Curse is on you till the Day of Recompense.\"\n",
        "TRANSLATION_14": "My curse shall rest on you until the Day of Recompense'\n",
        "TRANSLATION_15": "And My curse will be upon you until the Day of Judgment.”\n",
        "TRANSLATION_16": "And indeed, upon you is My curse until the Day of Recompense.\"\n",
        "TRANSLATION_17": "[38:78] And indeed My curse shall be on you until the Day of Judgement’, [the Day] of Requital.\n",
        "TRANSLATION_18": "(And lo! My curse) My wrath and chastisement; it is also said that Allah banished him to the isles of the sea and, hence, he goes to the land only in the form of a thief, wearing tattered clothes, and scaring people (is on you till the Day of Judgement) until the Day of Reckoning.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "38:78",
            "15:35",
            "82:17",
            "74:46",
            "1:4",
            "70:26",
            "82:18",
            "26:82",
            "83:11",
            "82:15"
        ],
        "BIBLE": [
            "writings:esther:9:17",
            "torah:leviticus:23:27",
            "prophets:zechariah:14:1",
            "torah:exodus:31:15",
            "writings:job:14:6",
            "torah:leviticus:23:15",
            "torah:genesis:8:4",
            "prophets:jeremiah:51:47",
            "torah:deuteronomy:11:28",
            "prophets:isaiah:34:8"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:4:8",
            "Sefer%20Yetzirah:2:6",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:11"
        ]
    }
}