{
    "VERSE": "38:79",
    "ARABIC": "قَالَ رَبِّ فَأَنظِرْنِىٓ إِلَىٰ يَوْمِ يُبْعَثُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "He said, 'My Lord, grant me a reprieve until the Day they are raised again.'",
        "TRANSLATION_1": "He said: \"O Lord, give me respite till the day the dead rise from their graves.\"\n",
        "TRANSLATION_2": "Satan said: “My Lord, then grant me respite till the Day that they are raised up.”\n",
        "TRANSLATION_3": "He said, \"Lord, grant me respite until the Day of Resurrection\".\n",
        "TRANSLATION_4": "He said, “My Lord! Therefore give me respite till the day when all will be raised.”\n",
        "TRANSLATION_5": "[Iblis] said: \"My Lord! Give me then respite till the Day the (dead) are resurrected.\"\n",
        "TRANSLATION_6": "He said: My Lord! then respite me to the day that they are raised.\n",
        "TRANSLATION_7": "Said he, 'My Lord, respite me till the day they shall be raised.'\n",
        "TRANSLATION_8": "He said: My Lord! Reprieve me till the day when they are raised.\n",
        "TRANSLATION_9": "But Satan said, \"My Lord, grant me respite until the Day of Resurrection,\"\n",
        "TRANSLATION_10": "He said: my Lord! respite me till the Day whereon they are raised up.\n",
        "TRANSLATION_11": "He said, ‘My Lord! Respite me till the day they will be resurrected.’\n",
        "TRANSLATION_12": "(Iblis) said: \"O my Lord! Give me then respite till the Day the (dead) are raised.\"\n",
        "TRANSLATION_13": "[Iblis (Satan)] said: \"My Lord! Give me then respite till the Day the (dead) are resurrected.\"\n",
        "TRANSLATION_14": "He (satan) replied: 'Respite me my Lord till the Day of Resurrection'\n",
        "TRANSLATION_15": "He said, “Lord, defer me until the Day they are resurrected.”\n",
        "TRANSLATION_16": "He said, \"My Lord, then reprieve me until the Day they are resurrected.\"\n",
        "TRANSLATION_17": "[38:79] He said, ‘My Lord, then reprieve me until the day when they, mankind, will be raised’.\n",
        "TRANSLATION_18": "(He said) Iblis said: (My Lord!) my Lord! (Reprieve me) give me a respite (till the day when they are raised) from the graves. The wicked one wanted to escape the taste of death.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "15:36",
            "38:79",
            "7:14",
            "14:41",
            "78:39",
            "52:45",
            "51:60",
            "43:83",
            "70:42",
            "28:21"
        ],
        "BIBLE": [
            "prophets:i%20samuel:11:3",
            "prophets:ii%20kings:6:29",
            "torah:genesis:29:21",
            "prophets:i%20kings:13:3",
            "torah:numbers:18:24",
            "prophets:i%20kings:9:13",
            "torah:genesis:15:18",
            "writings:lamentations:2:18",
            "torah:genesis:33:13",
            "writings:psalms:41:11"
        ]
    }
}