{
    "VERSE": "38:85",
    "ARABIC": "لَأَمْلَأَنَّ جَهَنَّمَ مِنكَ وَمِمَّن تَبِعَكَ مِنْهُمْ أَجْمَعِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "I will fill up Hell with you and every one of them who follows you.'",
        "TRANSLATION_1": "I will fill up Hell with you together with those who follow you.\"\n",
        "TRANSLATION_2": "I will certainly fill the Gehenna with you and with all those among them who follow you.”\n",
        "TRANSLATION_3": "that I shall certainly fill hell with you and your followers all together\".\n",
        "TRANSLATION_4": "“That I will fill hell with you and with those among them who follow you, all together.”\n",
        "TRANSLATION_5": "That I will fill Hell with you and those of them (mankind) that follow you, together.\"\n",
        "TRANSLATION_6": "That I will most certainly fill hell with you and with those among them who follow you, all.\n",
        "TRANSLATION_7": "I shall assuredly fill Gehenna with thee, and with whosoever of them follows thee, all together.'\n",
        "TRANSLATION_8": "That I shall fill hell with thee and with such of them as follow thee, together.\n",
        "TRANSLATION_9": "I will fill up Hell with you and every one of them who follows you.\"\n",
        "TRANSLATION_10": "That I shall fill Hell with thee and such of them as shall follow thee, all together.\n",
        "TRANSLATION_11": "I will surely fill hell with you and all those who follow you.’\n",
        "TRANSLATION_12": "That I will certainly fill Hell with thee and those that follow thee,- every one.\"\n",
        "TRANSLATION_13": "That I will fill Hell with you [Iblis (Satan)] and those of them (mankind) that follow you, together.\"\n",
        "TRANSLATION_14": "I shall certainly fill Gehenna with you and every one of them that follows you'\n",
        "TRANSLATION_15": "I will fill Hell with you, and with every one of them who follows you.”\n",
        "TRANSLATION_16": "[That] I will surely fill Hell with you and those of them that follow you all together.\"\n",
        "TRANSLATION_17": "[38:85] I shall assuredly fill Hell with you, by way of [filling it with] your progeny, and with whoever of them follows you, that is, of mankind, all together’.\n",
        "TRANSLATION_18": "That I shall fill hell with thee) and with your offspring (and with such of them as follow thee) of the Children of Adam, (together) all those who obey your way.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "38:85",
            "7:18",
            "26:65",
            "38:82",
            "15:43",
            "15:92",
            "11:119",
            "43:55",
            "15:39",
            "54:44"
        ],
        "BIBLE": [
            "torah:genesis:24:8",
            "torah:exodus:21:22",
            "torah:deuteronomy:1:36",
            "prophets:joshua:14:9",
            "torah:exodus:21:23",
            "prophets:i%20samuel:31:2",
            "writings:psalms:23:6",
            "torah:numbers:32:11",
            "torah:deuteronomy:16:20",
            "prophets:ii%20kings:6:19"
        ]
    }
}