{
    "VERSE": "38:86",
    "ARABIC": "قُلْ مَآ أَسْـَٔلُكُمْ عَلَيْهِ مِنْ أَجْرٍ وَمَآ أَنَا۠ مِنَ ٱلْمُتَكَلِّفِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Say: 'I do not ask you for any wage for it, nor am I a man of false pretensions.",
        "TRANSLATION_1": "Say: \"I do not ask any compensation of you for it, nor am I a specious pretender.\n",
        "TRANSLATION_2": "(O Prophet), tell them: “I do not ask you for any recompense for the performance of this task; nor am I given to affectation.\n",
        "TRANSLATION_3": "(Muhammad), say, \"I do not ask any reward for my preaching to you for I am not a pretender.\n",
        "TRANSLATION_4": "Say (O dear Prophet Mohammed – peace and blessings be upon him) “I do not ask any fee from you for the Qur’an, and I am not a fabricator.”\n",
        "TRANSLATION_5": "Say: \"No wage do I ask of you for this, nor am I one of the Mutakallifin.\"\n",
        "TRANSLATION_6": "Say: I do not ask you for any reward for it; nor am I of those who affect:\n",
        "TRANSLATION_7": "Say: 'I ask of you no wage for it, neither am I of those who take things upon themselves.\n",
        "TRANSLATION_8": "Say (O Muhammad, unto mankind): I ask of you no fee for this, and I am no simulating.\n",
        "TRANSLATION_9": "Say, \"I do not ask you for any recompense for this, nor am I a man of false pretentions:\n",
        "TRANSLATION_10": "Say thou: ask of you for it no hire, nor am I of the affecters.\n",
        "TRANSLATION_11": "Say, ‘I do not ask you any reward for it, and I am no impostor.\n",
        "TRANSLATION_12": "Say: \"No reward do I ask of you for this (Qur'an), nor am I a pretender.\n",
        "TRANSLATION_13": "Say (O Muhammad SAW): \"No wage do I ask of you for this (the Quran), nor am I one of the Mutakallifun (those who pretend and fabricate things which do not exist).\n",
        "TRANSLATION_14": "Say (Prophet Muhammad): 'For this I ask of you no wage, and I am not of those who take things upon themselves.\n",
        "TRANSLATION_15": "Say, “I ask of you no wage for this, and I am not a pretender.\n",
        "TRANSLATION_16": "Say, [O Muhammad], \"I do not ask you for the Qur'an any payment, and I am not of the pretentious\n",
        "TRANSLATION_17": "[38:86] Say: ‘I do not ask of you, in return for this, for delivering the Message [to you], any reward, any fee; nor am I an impostor, so as to make up the Qur’ān myself.\n",
        "TRANSLATION_18": "(Say) Muhammad, to the people of Mecca: (I ask of you no fee) no payment or provision (for this) for belief in Allah's divine Oneness and in the Qur'an, (and I am no impostor) and I am not inventing anything.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "38:86",
            "12:104",
            "26:109",
            "26:164",
            "26:180",
            "26:145",
            "26:127",
            "36:21",
            "10:72",
            "21:110"
        ],
        "BIBLE": [
            "writings:ii%20chronicles:19:6",
            "torah:deuteronomy:16:17",
            "torah:genesis:3:12",
            "prophets:ezekiel:4:15",
            "writings:proverbs:22:24",
            "prophets:ezekiel:33:24",
            "writings:ecclesiastes:1:13",
            "torah:deuteronomy:26:13",
            "prophets:ii%20samuel:18:11",
            "writings:proverbs:23:2"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:2"
        ]
    }
}