{
    "VERSE": "23:100",
    "ARABIC": "لَعَلِّىٓ أَعْمَلُ صَٰلِحًا فِيمَا تَرَكْتُ كَلَّآ إِنَّهَا كَلِمَةٌ هُوَ قَآئِلُهَا وَمِن وَرَآئِهِم بَرْزَخٌ إِلَىٰ يَوْمِ يُبْعَثُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "so that perhaps I may act rightly regarding the things I failed to do!' No indeed! It is just words he utters. Before them there is an interspace until the Day they are raised up.",
        "TRANSLATION_1": "That I may do some good I did not do (in the world).\" Not so. These are only words he utters. Behind them lies the intervening barrier (stretching) to the day of their resurrection.\n",
        "TRANSLATION_2": "that I have left behind. I am likely to do good.\" Nay, it is merely a word that he is uttering. There is a barrier behind all of them (who are dead) until the Day when they will be raised up.\n",
        "TRANSLATION_3": "so that perhaps I shall act righteously for the rest of my life.\" Although he will say so but his wish will never come true. After death they will be behind a barrier until the day of their resurrection.\n",
        "TRANSLATION_4": "“Perhaps I may do some good deeds in what I have left behind”; this is just a word that he utters from his mouth; and confronting them is a barrier until the day in which they will be raised.\n",
        "TRANSLATION_5": "So that I may do good in that which I have left behind!\" No! (Kalla) It is but a word that he speaks; and in front of them is Barzakh until the Day when they will be resurrected.\n",
        "TRANSLATION_6": "Haply I may do good in that which I have left. By no means! it is a (mere) word that he speaks; and before them is a barrier until the day they are raised.\n",
        "TRANSLATION_7": "haply I shall do righteousness in that I forsook.' Nay, it is but a word he speaks; and there; behind them, is a barrier until the day that they shall be raised up.\n",
        "TRANSLATION_8": "That I may do right in that which I have left behind! But nay! It is but a word that he speaketh; and behind them is a barrier until the day when they are raised.\n",
        "TRANSLATION_9": "so that I may do good works in the world I have left behind.\" Never! It is indeed but a meaningless word that he utters. A barrier shall stand behind such people till the Day they are raised up again.\n",
        "TRANSLATION_10": "That I may work righteously in that which have left. By no means! It is but a word he uttereth; and before them is a barrier until the Day when they shall be raised.\n",
        "TRANSLATION_11": "that I may act righteously in what I have left behind.’ ‘By no means! These are mere words that he says.’ And before them is a barrier until the day they will be resurrected.\n",
        "TRANSLATION_12": "In order that I may work righteousness in the things I neglected.\" - \"By no means! It is but a word he says.\"- Before them is a Partition till the Day they are raised up.\n",
        "TRANSLATION_13": "So that I may do good in that which I have left behind!\" No! It is but a word that he speaks, and behind them is Barzakh (a barrier) until the Day when they will be resurrected.\n",
        "TRANSLATION_14": "that I should do righteousness in that I forsook' No! It is only a word which he will speak. Behind them there shall stand a barrier till the Day that they shall be resurrected.\n",
        "TRANSLATION_15": "That I may do right in what I have neglected.” By no means! It is just a word that he utters. And behind them is a barrier, until the Day they are resurrected.\n",
        "TRANSLATION_16": "That I might do righteousness in that which I left behind.\" No! It is only a word he is saying; and behind them is a barrier until the Day they are resurrected.\n",
        "TRANSLATION_17": "[23:100] that I might act righteously, by witnessing that ‘there is no god but God’, that this might be, in that which I have left behind’, [in what] I have wasted of my life, in other words [that this affirmation might be] in its place. God, exalted be He, says: By no means!, that is, there shall be no return. It, namely, [the statement] ‘My Lord! Send me back’, is merely a word that he speaks, but [a word] in which there is no benefit for him; and behind them, ahead of them, there is a barrier, which prevents them from going back [to this world], until the day when they are raised, after which [day] there will be no more return.\n",
        "TRANSLATION_18": "(That I may do right) and believe in You (in that which I have left behind) in the life of the world and disbelieved in! (But nay!) he will not be returned to the life of the world. (It) his saying: \"Return me that I may do right\" (is but a word that he speaketh) is just a mere expression that he utters and which will not benefit him; (and behind them) in front of them (is a barrier) the grave (until the day when they are raised) from the graves. 383\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "23:100",
            "7:14",
            "23:111",
            "76:27",
            "26:87",
            "16:111",
            "40:27",
            "43:83",
            "70:42",
            "43:28"
        ],
        "BIBLE": [
            "torah:numbers:22:38",
            "torah:deuteronomy:18:18",
            "prophets:jeremiah:23:5",
            "prophets:joshua:6:10",
            "torah:exodus:34:10",
            "torah:exodus:35:2",
            "writings:daniel:6:13",
            "prophets:i%20kings:22:13",
            "torah:exodus:19:9",
            "writings:ezra:10:13"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:4:8",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:1:6"
        ]
    }
}