{
    "VERSE": "23:104",
    "ARABIC": "تَلْفَحُ وُجُوهَهُمُ ٱلنَّارُ وَهُمْ فِيهَا كَٰلِحُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "The Fire will sear their faces, making them grimace horribly in it, their lips drawn back from their teeth.",
        "TRANSLATION_1": "Their faces will be scorched by flames, and they will grin and scowl within it.\n",
        "TRANSLATION_2": "The Fire shall scorch their faces, exposing their jaws.\n",
        "TRANSLATION_3": "The fire will scorch their faces and they will be groaning therein in pain.\n",
        "TRANSLATION_4": "The fire shall scorch their faces, and they will remain dejected in it.\n",
        "TRANSLATION_5": "The Fire will burn their faces, and therein they will grin, with displaced lips (disfigured).\n",
        "TRANSLATION_6": "The fire shall scorch their faces, and they therein shall be in severe affliction.\n",
        "TRANSLATION_7": "the Fire smiting their faces the while they glower there.\n",
        "TRANSLATION_8": "The fire burneth their faces, and they are glum therein.\n",
        "TRANSLATION_9": "The Fire will scorch their faces and they will abide therein with their faces distorted.\n",
        "TRANSLATION_10": "The Fire will scorch their faces, and therein they shall be grinning.\n",
        "TRANSLATION_11": "The Fire will scorch their faces, while they snarl baring their teeth.\n",
        "TRANSLATION_12": "The Fire will burn their faces, and they will therein grin, with their lips displaced.\n",
        "TRANSLATION_13": "The Fire will burn their faces, and therein they will grin, with displaced lips (disfigured).\n",
        "TRANSLATION_14": "The fire lashes their faces and therein are shriveled lips.\n",
        "TRANSLATION_15": "The Fire lashes their faces, and therein they grimace.\n",
        "TRANSLATION_16": "The Fire will sear their faces, and they therein will have taut smiles.\n",
        "TRANSLATION_17": "[23:104] The Fire will scorch their faces, it will burn them, while they glower therein, their upper and lower lips having receded from their teeth, and it will be said to them:\n",
        "TRANSLATION_18": "(The fire burneth their faces) their faces are beaten up, and their flesh and bones are consumed by the Fire, (and they are glum) their faces are dark and their eyes blue (therein) in hell.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "23:104",
            "27:90",
            "55:15",
            "14:50",
            "54:48",
            "21:39",
            "3:131",
            "33:66",
            "40:72",
            "83:24"
        ],
        "BIBLE": [
            "torah:exodus:12:10",
            "torah:leviticus:6:6",
            "prophets:isaiah:47:14",
            "prophets:isaiah:13:8",
            "prophets:isaiah:33:12",
            "prophets:ezekiel:21:3",
            "prophets:isaiah:43:2",
            "writings:proverbs:26:23",
            "torah:leviticus:7:17",
            "writings:psalms:11:6"
        ]
    }
}