{
    "VERSE": "23:106",
    "ARABIC": "قَالُوا۟ رَبَّنَا غَلَبَتْ عَلَيْنَا شِقْوَتُنَا وَكُنَّا قَوْمًا ضَآلِّينَ",
    "ENGLISH": {
        "TRANSLATION_0": "They will say, 'Our Lord, our miserable destiny overpowered us. We were misguided people.",
        "TRANSLATION_1": "They will say: \"O Lord, our misery overwhelmed us, so we remained a people astray.\n",
        "TRANSLATION_2": "They will say: \"Our Lord! Our misfortune prevailed over us. We were indeed an erring people.\n",
        "TRANSLATION_3": "They will reply, \"Lord, our hard-heartedness overcame us and we went astray.\n",
        "TRANSLATION_4": "They will say, “Our Lord! Our ill-fate overcame us, and we were the astray people.”\n",
        "TRANSLATION_5": "They will say: \"Our Lord! Our wretchedness overcame us, and we were (an) erring people.\"\n",
        "TRANSLATION_6": "They shall say: O our Lord! our adversity overcame us and we were an erring people:\n",
        "TRANSLATION_7": "They shall say, 'Our Lord, our adversity prevailed over us; we were an erring people.\n",
        "TRANSLATION_8": "They will say: Our Lord! Our evil fortune conquered us, and we were erring folk.\n",
        "TRANSLATION_9": "They will answer, \"Lord, misfortune overcame us and we became an erring people.\n",
        "TRANSLATION_10": "They will say: our Lord! our wretchedness overcame, us, and we have been a people erring.\n",
        "TRANSLATION_11": "They will say, ‘Our Lord! Our wretchedness overcame us, and we were an astray lot.\n",
        "TRANSLATION_12": "They will say: \"our Lord! Our misfortune overwhelmed us, and we became a people astray!\n",
        "TRANSLATION_13": "They will say: \"Our Lord! Our wretchedness overcame us, and we were (an) erring people.\n",
        "TRANSLATION_14": "Lord' they will reply, 'adversity prevailed over us and we were erring.\n",
        "TRANSLATION_15": "They will say, “Our Lord, our wretchedness prevailed over us, and we were a people astray.\n",
        "TRANSLATION_16": "They will say, \"Our Lord, our wretchedness overcame us, and we were a people astray.\n",
        "TRANSLATION_17": "[23:106] They will say, ‘Our Lord, our wretchedness (shiqwatunā: a variant reading has shaqāwatunā, both of which are verbal nouns with the same meaning) overcame us, and we were an erring folk, [astray] from guidance.\n",
        "TRANSLATION_18": "(They will say) the disbelievers will say upon entering hell: (Our Lord!) O our Lord! (Our evil fortune) which was decreed upon us in the Guarded Tablet (conquered us) this is why we did not believe, (and we were erring folk) and we were disbelievers.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "23:106",
            "29:30",
            "26:117",
            "28:21",
            "26:10",
            "23:94",
            "29:59",
            "16:42",
            "25:64",
            "15:58"
        ],
        "BIBLE": [
            "prophets:zechariah:13:9",
            "prophets:i%20kings:18:24",
            "prophets:ii%20kings:2:21",
            "writings:ii%20chronicles:20:21",
            "prophets:i%20kings:20:4",
            "torah:exodus:19:8",
            "prophets:ii%20samuel:1:4",
            "prophets:joshua:24:16",
            "torah:exodus:5:10",
            "torah:genesis:23:10"
        ]
    }
}