{
    "VERSE": "23:107",
    "ARABIC": "رَبَّنَآ أَخْرِجْنَا مِنْهَا فَإِنْ عُدْنَا فَإِنَّا ظَٰلِمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Our Lord, remove us from it! Then if we revert again, we will definitely be wrongdoers.'",
        "TRANSLATION_1": "Get us out of this, O Lord. If we transgress we will surely be sinful.\"\n",
        "TRANSLATION_2": "Our Lord! Take us out of this. Then if we revert (to evil-doing) we shall indeed be wrongdoers.\"\n",
        "TRANSLATION_3": "Lord, take us out of this and if we sin again, we shall certainly be unjust\".\n",
        "TRANSLATION_4": "“Our Lord, remove us from hell – then if we do the same, we are the unjust.”\n",
        "TRANSLATION_5": "Our Lord! Bring us out of this. If ever we return (to evil), then indeed we shall be wrongdoers.\"\n",
        "TRANSLATION_6": "O our Lord! Take us out of it; then if we return (to evil) surely we shall be unjust.\n",
        "TRANSLATION_7": "Our Lord, bring us forth out of it! Then, if we revert, we shall be evildoers indeed.'\n",
        "TRANSLATION_8": "Our Lord! Oh, bring us forth from hence! If we return (to evil) then indeed we shall be wrong-doers.\n",
        "TRANSLATION_9": "Lord, deliver us from Hell. Then, if we revert again, we shall definitely be wrongdoers.\"\n",
        "TRANSLATION_10": "O our Lord! take us forth from it: then if we return, we shall be wrong-doers indeed.\n",
        "TRANSLATION_11": "Our Lord! Bring us out of this! Then, if we revert [to our previous conduct], we will indeed be wrongdoers.’\n",
        "TRANSLATION_12": "Our Lord! bring us out of this: if ever we return (to Evil), then shall we be wrong-doers indeed!\"\n",
        "TRANSLATION_13": "Our Lord! Bring us out of this; if ever we return (to evil), then indeed we shall be Zalimun: (polytheists, oppressors, unjust, and wrong-doers, etc.).\"\n",
        "TRANSLATION_14": "Our Lord, bring us out of it. If we return (to sin), then we shall indeed be harmdoers'\n",
        "TRANSLATION_15": "Our Lord! Bring us out of this. If we ever returned, we would truly be evil.”\n",
        "TRANSLATION_16": "Our Lord, remove us from it, and if we were to return [to evil], we would indeed be wrongdoers.\"\n",
        "TRANSLATION_17": "[23:107] Our Lord, bring us out of it! Then, if we revert, to disobedience, we will indeed be evildoers’.\n",
        "TRANSLATION_18": "(Our Lord!) O our Lord! (Oh, bring us forth from hence) take us out of hell! (If we return) to disbelief (then indeed we shall be wrong-doers) then we will be transgressing against ourselves.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "23:107",
            "37:31",
            "36:25",
            "7:125",
            "20:74",
            "54:10",
            "36:16",
            "68:50",
            "68:32",
            "75:23"
        ],
        "BIBLE": [
            "writings:psalms:31:2",
            "writings:psalms:7:2",
            "writings:psalms:25:20",
            "prophets:ezekiel:3:21",
            "writings:psalms:71:1",
            "torah:leviticus:5:23",
            "writings:job:1:21",
            "prophets:isaiah:49:25",
            "prophets:ii%20kings:14:14",
            "torah:exodus:14:11"
        ]
    }
}