{
    "VERSE": "23:111",
    "ARABIC": "إِنِّى جَزَيْتُهُمُ ٱلْيَوْمَ بِمَا صَبَرُوٓا۟ أَنَّهُمْ هُمُ ٱلْفَآئِزُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Today I have rewarded them for being steadfast. They are the ones who are victorious.'",
        "TRANSLATION_1": "I have rewarded them this day for they were constant, and they have come to attainment.\"\n",
        "TRANSLATION_2": "Lo! I have rewarded them this Day for their steadfastness, so that they, and they alone, are triumphant.\"\n",
        "TRANSLATION_3": "On this day I have given them their reward for their exercising patience and it is they who have triumphed.\"\n",
        "TRANSLATION_4": "“Indeed this day I have rewarded them for their endurance, so that it is they who are the successful.”\n",
        "TRANSLATION_5": "Verily, I have rewarded them this Day for their patience; they are indeed the ones that are successful.\n",
        "TRANSLATION_6": "Surely I have rewarded them this day because they were patient, that they are the achievers.\n",
        "TRANSLATION_7": "Now today I have recompensed them for their patient endurance; they are the triumphant.'\n",
        "TRANSLATION_8": "Lo! I have rewarded them this day forasmuch as they were steadfast in that they, even they, are the triumphant.\n",
        "TRANSLATION_9": "I have rewarded them this Day for their steadfastness, and it is they who have triumphed.\"\n",
        "TRANSLATION_10": "Verily I have recompensed them today for they bear patiently, verily they! are the achievers.\n",
        "TRANSLATION_11": "Indeed I have rewarded them today for their patience. They are indeed the triumphant.’\n",
        "TRANSLATION_12": "I have rewarded them this Day for their patience and constancy: they are indeed the ones that have achieved Bliss...\"\n",
        "TRANSLATION_13": "Verily! I have rewarded them this Day for their patience, they are indeed the ones that are successful.\n",
        "TRANSLATION_14": "Today I shall recompense them for their patience, for it is they that have won.\n",
        "TRANSLATION_15": "Today, I have rewarded them for their endurance. They are the ones who are the triumphant.”\n",
        "TRANSLATION_16": "Indeed, I have rewarded them this Day for their patient endurance - that they are the attainers [of success].\"\n",
        "TRANSLATION_17": "[23:111] Indeed I have rewarded them this day, abiding bliss, for the endurance they showed, while you mocked them and caused them hurt. They are indeed the winners’, of what they sought (read innahum as [indicating] a new sentence, or annahum as [indicating] a second direct object of the [verb] jazaytuhum, ‘I have rewarded them’).\n",
        "TRANSLATION_18": "384 (Lo! I have rewarded them this day) with Paradise (forasmuch as they were steadfast) in obeying me and withholding your harm; (and they verily are the triumphant) they have gained Paradise and become safe from hell. This verse was revealed about Abu Jahl and his host who mocked Salman [al-Farisi] and his fellow-believers\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "23:111",
            "36:64",
            "7:14",
            "38:53",
            "83:11",
            "66:7",
            "23:65",
            "70:26",
            "79:6",
            "40:32"
        ],
        "BIBLE": [
            "torah:numbers:15:23",
            "prophets:jeremiah:3:18",
            "prophets:i%20kings:5:18",
            "writings:ii%20chronicles:20:11",
            "torah:deuteronomy:3:19",
            "prophets:i%20kings:13:3",
            "prophets:joshua:23:15",
            "prophets:ezekiel:16:52",
            "torah:deuteronomy:16:17",
            "prophets:ii%20kings:25:30"
        ]
    }
}