{
    "VERSE": "23:113",
    "ARABIC": "قَالُوا۟ لَبِثْنَا يَوْمًا أَوْ بَعْضَ يَوْمٍ فَسْـَٔلِ ٱلْعَآدِّينَ",
    "ENGLISH": {
        "TRANSLATION_0": "They will say, 'We tarried there for a day or part of a day. Ask those able to count!'",
        "TRANSLATION_1": "They will say: \"A day or less than a day. Ask the enumerators of numbers.\"\n",
        "TRANSLATION_2": "They will say: \"We stayed for a day or part of a day. Ask of those who keep count of this.\"\n",
        "TRANSLATION_3": "They will reply. \"We remained for about a day or part of it, but ask those who have kept count\".\n",
        "TRANSLATION_4": "They will say, “We stayed a day or part of a day, so ask those who keep count.”\n",
        "TRANSLATION_5": "They will say: \"We stayed a day or part of a day. Ask of those who keep account.\"\n",
        "TRANSLATION_6": "They will say: We tarried a day or part of a day, but ask those who keep account.\n",
        "TRANSLATION_7": "They shall say, 'We have tarried a day, or part of a day; ask the numberers!'\n",
        "TRANSLATION_8": "They will say: We tarried by a day or part of a day. Ask of those who keep count!\n",
        "TRANSLATION_9": "They will say, \"We stayed a day or part of a day. Ask those who have kept count.\"\n",
        "TRANSLATION_10": "-They will say we tarried a day or part of a day; ask those who keep count.\n",
        "TRANSLATION_11": "They will say, ‘We remained for a day, or part of a day; yet ask those who keep the count.’\n",
        "TRANSLATION_12": "They will say: \"We stayed a day or part of a day: but ask those who keep account.\"\n",
        "TRANSLATION_13": "They will say: \"We stayed a day or part of a day. Ask of those who keep account.\"\n",
        "TRANSLATION_14": "They will reply: 'A day, or part of a day; ask those who have kept count'\n",
        "TRANSLATION_15": "They will say, “We remained a day, or part of a day; but ask those who keep count.”\n",
        "TRANSLATION_16": "They will say, \"We remained a day or part of a day; ask those who enumerate.\"\n",
        "TRANSLATION_17": "[23:113] They will say, ‘We tarried a day, or part of a day — they are uncertain thereof, deeming it shorter [than what it was] because of the gravity of the chastisement they are suffering. Yet ask those who keep count!’, namely, [ask] the angels who number the deeds of [all] creatures.\n",
        "TRANSLATION_18": "(They will say: We tarried but a day) upon saying this, they will have some doubt, and therefore will say: (or part of a day). Then, they said: we do not know: (Ask of those who keep count!) i.e. the angels who record people's deeds; it is also said that this refers to the angel of death and his helpers.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "23:113",
            "36:59",
            "70:42",
            "28:65",
            "43:83",
            "18:99",
            "34:42",
            "79:6",
            "30:14",
            "52:25"
        ],
        "BIBLE": [
            "writings:ezra:3:4",
            "torah:genesis:21:6",
            "writings:psalms:71:15",
            "torah:exodus:16:23",
            "prophets:ii%20samuel:11:12",
            "writings:psalms:2:7",
            "prophets:malachi:3:7",
            "prophets:judges:21:6",
            "writings:ii%20chronicles:30:5",
            "prophets:joshua:22:2"
        ]
    }
}