{
    "VERSE": "23:114",
    "ARABIC": "قَٰلَ إِن لَّبِثْتُمْ إِلَّا قَلِيلًا لَّوْ أَنَّكُمْ كُنتُمْ تَعْلَمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "He will say, 'You only tarried there for a little while if you did but know!",
        "TRANSLATION_1": "He will say: \"You stayed there only a moment, if you knew.\n",
        "TRANSLATION_2": "He will say: \"You stayed only for a while, if you only knew that.\n",
        "TRANSLATION_3": "God will say, \"You have indeed remained there for a short time. Would that you knew it during your life time.\n",
        "TRANSLATION_4": "He will say, “You stayed but only a little, if you knew.”\n",
        "TRANSLATION_5": "He will say: \"You stayed not but a little, if you had only known!\"\n",
        "TRANSLATION_6": "He will say: You did tarry but a little-- had you but known (it):\n",
        "TRANSLATION_7": "He shall say, 'You have tarried but a little, did you know.\n",
        "TRANSLATION_8": "He will say: Ye tarried but a little if ye only knew.\n",
        "TRANSLATION_9": "He will say, \"You only stayed for a little while, if only you knew.\n",
        "TRANSLATION_10": "He will say: ye tarried a little indeed; would that ye had known that:\n",
        "TRANSLATION_11": "He will say, ‘You only remained a little; if only you had known.\n",
        "TRANSLATION_12": "He will say: \"Ye stayed not but a little,- if ye had only known!\n",
        "TRANSLATION_13": "He (Allah) will say: \"You stayed not but a little, if you had only known!\n",
        "TRANSLATION_14": "He will say: 'You have tarried a little, did you know?\n",
        "TRANSLATION_15": "He will say, “You remained only for a little while, if you only knew.\n",
        "TRANSLATION_16": "He will say, \"You stayed not but a little - if only you had known.\n",
        "TRANSLATION_17": "[23:114] He, exalted, will say, to them, also by the tongue of Keeper [of Hell] (a variant reading [for qāla, ‘He will say’] has qul, ‘say’): ‘You tarried but a little, if only you knew, the length of time you tarried, [you would have realised that it is] trivial relative to how long you will tarry in the Fire.\n",
        "TRANSLATION_18": "(He will say) Allah will say to them: (Ye tarried) you remained in your graves (but a little) in comparison to your dwelling in hell (if ye only knew) this; He says: if you only believe what I say; it is also said that this means: if only you did believe in My prophets in the life of the world, you would know now that you remained in your graves but a short time.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "23:114",
            "77:46",
            "33:20",
            "53:34",
            "17:52",
            "33:16",
            "56:87",
            "69:41",
            "73:2",
            "4:66"
        ],
        "BIBLE": [
            "torah:numbers:22:34",
            "prophets:ezekiel:6:10",
            "prophets:ezekiel:28:22",
            "torah:numbers:14:31",
            "torah:genesis:15:8",
            "prophets:i%20samuel:20:12",
            "torah:genesis:44:15",
            "torah:numbers:16:28",
            "prophets:hosea:2:25",
            "writings:i%20chronicles:11:19"
        ]
    }
}