{
    "VERSE": "23:115",
    "ARABIC": "أَفَحَسِبْتُمْ أَنَّمَا خَلَقْنَٰكُمْ عَبَثًا وَأَنَّكُمْ إِلَيْنَا لَا تُرْجَعُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Did you suppose that We created you for amusement and that you would not return to Us?'",
        "TRANSLATION_1": "Do you think We created you for nothing, and that you will not return to Us?\"\n",
        "TRANSLATION_2": "Did you imagine that We created you without any purpose, and that you will not be brought back to Us?\"\n",
        "TRANSLATION_3": "Did you think that We had created you for a playful purpose and that you were not to return to Us?\"\n",
        "TRANSLATION_4": "So do you think that We have created you needlessly, and that you do not have to return to Us?\n",
        "TRANSLATION_5": "Did you think that We had created you in play, and that you would not be brought back to Us\"\n",
        "TRANSLATION_6": "What! did you then think that We had created you in vain and that you shall not be returned to Us?\n",
        "TRANSLATION_7": "What, did you think that We created you only for sport, and that you would not be returned to Us?'\n",
        "TRANSLATION_8": "Deemed ye then that We had created you for naught, and that ye would not be returned unto Us?\n",
        "TRANSLATION_9": "Do you imagine that We created you without any purpose and that you would not be brought back to Us?\"\n",
        "TRANSLATION_10": "Deem ye that We have created youl in vain and that unto Us ye are not to be returned?\n",
        "TRANSLATION_11": "Did you suppose that We created you aimlessly, and that you will not be brought back to Us?’\n",
        "TRANSLATION_12": "Did ye then think that We had created you in jest, and that ye would not be brought back to Us (for account)?\"\n",
        "TRANSLATION_13": "Did you think that We had created you in play (without any purpose), and that you would not be brought back to Us?\"\n",
        "TRANSLATION_14": "Did you think that We had created you only for play, and that you would never be returned to Us'\n",
        "TRANSLATION_15": "Did you think that We created you in vain, and that to Us you will not be returned?”\n",
        "TRANSLATION_16": "Then did you think that We created you uselessly and that to Us you would not be returned?\"\n",
        "TRANSLATION_17": "[23:115] Did you suppose that We created you aimlessly, and not for an underlying reason, and that you would not be returned to Us?’ (read active tarji‘ūna, ‘you [would not] return’, or passive turja‘ūna, ‘you [would not] be returned’) Nay! But [it was] so that We might enthral you with commands and prohibitions, where after you would be returned to Us for Us to requite [you] accordingly: And I did not create the jinn and mankind except that they may worship Me [Q. 51:56].\n",
        "TRANSLATION_18": "(Deemed ye then) people of Mecca (that We had created you for naught) in vain, without commands and prohibitions, reward and punishment, (and that ye would not be returned unto Us) after you die?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "23:115",
            "37:155",
            "20:89",
            "34:25",
            "109:4",
            "21:50",
            "51:21",
            "16:17",
            "51:27",
            "37:138"
        ],
        "BIBLE": [
            "prophets:amos:4:8",
            "prophets:isaiah:55:11",
            "prophets:jeremiah:23:20",
            "prophets:micah:5:2",
            "prophets:ii%20kings:1:5",
            "prophets:i%20samuel:26:25",
            "prophets:jeremiah:30:24",
            "writings:psalms:126:1",
            "writings:psalms:51:15",
            "torah:leviticus:25:28"
        ]
    }
}