{
    "VERSE": "23:116",
    "ARABIC": "فَتَعَٰلَى ٱللَّهُ ٱلْمَلِكُ ٱلْحَقُّ لَآ إِلَٰهَ إِلَّا هُوَ رَبُّ ٱلْعَرْشِ ٱلْكَرِيمِ",
    "ENGLISH": {
        "TRANSLATION_0": "Exalted be Allah, the King, the Real. There is no god but Him, Lord of the Noble Throne.",
        "TRANSLATION_1": "Exalted then be God, the King, the Real. There is no god but He, the Lord of the glorious throne.\n",
        "TRANSLATION_2": "So, exalted be Allah, the True King! There is no god but He, the Lord of the Great Throne.\n",
        "TRANSLATION_3": "God is the most exalted King and the Supreme Truth. He is the only God and the Lord of the Gracious Throne.\n",
        "TRANSLATION_4": "So Most Supreme is Allah, the True King; there is no God except Him; Lord of the Throne of Honour.\n",
        "TRANSLATION_5": "So Exalted be Allah, the True King: None has the right to be worshipped but He, the Lord of Al-`Arsh Al-Karim!\n",
        "TRANSLATION_6": "So exalted be Allah, the True King; no god is there but He, the Lord of the honorable dominion.\n",
        "TRANSLATION_7": "Then high exalted be God, the King, the True! There is no god but He? the Lord of the noble Throne.\n",
        "TRANSLATION_8": "Now Allah be Exalted, the True King! There is no Allah save Him, the Lord of the Throne of Grace.\n",
        "TRANSLATION_9": "Then, exalted be God, the true King, there is no deity except Him, the Lord of the Glorious Throne.\n",
        "TRANSLATION_10": "So exalted be Allah, the True King! there is no god but he, Lord of the Throne honoured.\n",
        "TRANSLATION_11": "So exalted is Allah, the True Sovereign, there is no god except Him, the Lord of the Noble Throne.\n",
        "TRANSLATION_12": "Therefore exalted be Allah, the King, the Reality: there is no god but He, the Lord of the Throne of Honour!\n",
        "TRANSLATION_13": "So Exalted be Allah, the True King, La ilaha illa Huwa (none has the right to be worshipped but He), the Lord of the Supreme Throne!\n",
        "TRANSLATION_14": "High Exalted be Allah, the King, the Truth. There is no god except He, the Lord of the Noble Throne.\n",
        "TRANSLATION_15": "So Exalted is God, the Ruler, the Real. There is no god except He, the Lord of the Noble Throne.\n",
        "TRANSLATION_16": "So exalted is Allah, the Sovereign, the Truth; there is no deity except Him, Lord of the Noble Throne.\n",
        "TRANSLATION_17": "[23:116] So exalted be God, above aimless action and other such things that do not befit Him, the King, the Truth!   There is no god except Him, the Lord of the Noble Throne (‘arsh), the throne (kursī), which is a seat [similar to a king’s] that is exquisite.\n",
        "TRANSLATION_18": "(Now Allah be exalted) Allah is exonerated from and far above having a son or partner, (the True King! There is no God save Him, the Lord of the Throne of Grace.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "23:116",
            "27:26",
            "9:129",
            "21:22",
            "39:75",
            "20:114",
            "81:29",
            "10:32",
            "5:84",
            "27:79"
        ],
        "BIBLE": [
            "prophets:isaiah:30:18",
            "prophets:i%20kings:10:9",
            "prophets:isaiah:37:20",
            "writings:job:36:7",
            "writings:ii%20chronicles:9:8",
            "writings:daniel:11:5",
            "prophets:i%20samuel:10:19",
            "writings:daniel:4:34",
            "writings:psalms:95:3",
            "prophets:ii%20kings:19:19"
        ]
    }
}