{
    "VERSE": "23:118",
    "ARABIC": "وَقُل رَّبِّ ٱغْفِرْ وَٱرْحَمْ وَأَنتَ خَيْرُ ٱلرَّٰحِمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Say: 'My Lord, forgive and be merciful! You are the Best of the Merciful.'",
        "TRANSLATION_1": "Say: \"My Lord, forgive and have mercy. You are the best of the merciful.\"\n",
        "TRANSLATION_2": "And say, (O Muhammad): \"My Lord, forgive us and have mercy on us, for You are the Best of those that are merciful.\"\n",
        "TRANSLATION_3": "(Muhammad), say, \"Lord, forgive me and grant me mercy; You are the best of the Merciful Ones.\n",
        "TRANSLATION_4": "And (O dear Prophet Mohammed – peace and blessings be upon him) say, “My Lord! Forgive and have mercy, and You are the Best of all the Merciful.\n",
        "TRANSLATION_5": "And say: \"My Lord! Forgive and have mercy, for You are the Best of those who show mercy!\"\n",
        "TRANSLATION_6": "And say: O my Lord! forgive and have mercy, and Thou art the best of the Merciful ones.\n",
        "TRANSLATION_7": "And say: 'My Lord, forgive and have mercy, for Thou art the best of the merciful.'\n",
        "TRANSLATION_8": "And (O Muhammad) say: My Lord! Forgive and have mercy, for Thou art Best of all who show mercy.\n",
        "TRANSLATION_9": "Say, \"Lord, forgive us and have mercy. You are the best of those who show mercy.\"\n",
        "TRANSLATION_10": "And say thou: my Lord! forgive and have mercy, and Thou art the Best of the merciful ones.\n",
        "TRANSLATION_11": "Say, ‘My Lord, forgive and have mercy, and You are the best of the merciful.’\n",
        "TRANSLATION_12": "So say: \"O my Lord! grant Thou forgiveness and mercy for Thou art the Best of those who show mercy!\"\n",
        "TRANSLATION_13": "And say (O Muhammad SAW): \"My Lord! Forgive and have mercy, for You are the Best of those who show mercy!\"\n",
        "TRANSLATION_14": "And say: 'My Lord, forgive and have mercy, for You are the Best of the merciful'\n",
        "TRANSLATION_15": "And say, “My Lord, forgive and have mercy, for You are the Best of the merciful.”\n",
        "TRANSLATION_16": "And, [O Muhammad], say, \"My Lord, forgive and have mercy, and You are the best of the merciful.\"\n",
        "TRANSLATION_17": "[23:118] And say: ‘My Lord, forgive and have mercy, on believers — [this] ‘mercy’ adds to the ‘forgiveness’ [in terms of God’s grace] — and You are the best of the merciful’, the most excellent of those who have mercy.\n",
        "TRANSLATION_18": "(And say) Muhammad: (My Lord! Forgive) my nation (and have mercy) on my nation by not punishing them, (for Thou art Best of all who show mercy) the most Merciful of all who show mercy'. And of the surah in which the light is mentioned, which is all Medinan, and consists of 64 verses, 1,316 words and 5,980 letters: Surah 24: The Light {al-Nur) And of the surah in which the light is mentioned, which is all Medinan, and consists of 64 verses, 1,316 words and 5,980 letters:\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "23:118",
            "23:29",
            "22:77",
            "23:72",
            "21:89",
            "18:36",
            "38:32",
            "36:27",
            "37:100",
            "23:109"
        ],
        "BIBLE": [
            "writings:psalms:85:8",
            "writings:daniel:9:4",
            "writings:psalms:118:4",
            "writings:psalms:94:18",
            "writings:psalms:86:5",
            "writings:nehemiah:1:5",
            "writings:psalms:109:21",
            "prophets:jonah:4:4",
            "prophets:i%20kings:8:23",
            "torah:genesis:26:29"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:2:6",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:4:8",
            "Sefer%20Yetzirah:6:2"
        ]
    }
}