{
    "VERSE": "23:18",
    "ARABIC": "وَأَنزَلْنَا مِنَ ٱلسَّمَآءِ مَآءًۢ بِقَدَرٍ فَأَسْكَنَّٰهُ فِى ٱلْأَرْضِ وَإِنَّا عَلَىٰ ذَهَابٍۭ بِهِۦ لَقَٰدِرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "We sent down a measured amount of water from heaven and lodged it firmly in the earth; and We are well able to remove it.",
        "TRANSLATION_1": "We send down water from the sky in determined measure, and store it up in the earth; and We have power to drain it away.\n",
        "TRANSLATION_2": "We sent down water from the sky in right measure, and caused it to stay in the earth, and We have the power to cause it to vanish (in the manner We please).\n",
        "TRANSLATION_3": "We have sent a measure of water from the sky to stay on earth and We have the power to take it away.\n",
        "TRANSLATION_4": "And We sent down water from the sky in proper measure, then stored it in the earth; and indeed We are Able to take it away!\n",
        "TRANSLATION_5": "And We sent down from the sky water in measure, and We gave it lodging in the earth, and verily, We are able to take it away.\n",
        "TRANSLATION_6": "And We send down water from the cloud according to a measure, then We cause it to settle in the earth, and most surely We are able to carry it away.\n",
        "TRANSLATION_7": "And We sent down out of heaven water in measure and lodged it in the earth; and We are able to take it away.\n",
        "TRANSLATION_8": "And we send down from the sky water in measure, and We give it lodging in the earth, and lo! We are Able to withdraw it.\n",
        "TRANSLATION_9": "We sent down water from the sky in due measure and lodged it in the earth, but if We please, We have the power to take it away,\n",
        "TRANSLATION_10": "And We sent down from the heaven water in measure, and We caused it to settle in the earth; and verily to take it away We are Able.\n",
        "TRANSLATION_11": "We sent down water from the sky in a measured manner, and We lodged it within the ground, and We are indeed able to take it away.\n",
        "TRANSLATION_12": "And We send down water from the sky according to (due) measure, and We cause it to soak in the soil; and We certainly are able to drain it off (with ease).\n",
        "TRANSLATION_13": "And We sent down from the sky water (rain) in (due) measure, and We gave it lodging in the earth, and verily, We are Able to take it away.\n",
        "TRANSLATION_14": "We sent down water from the sky in due measure, and lodged it in the earth, and We are able to take it all away.\n",
        "TRANSLATION_15": "And We sent down water from the sky in proper quantity, and settled it in the ground, and We are Able to take it away.\n",
        "TRANSLATION_16": "And We have sent down rain from the sky in a measured amount and settled it in the earth. And indeed, We are Able to take it away.\n",
        "TRANSLATION_17": "[23:18] And We sent down water out of the heaven in measure, that suffices them, and We lodged it within the earth; and We are indeed able to take it away, so that they die of thirst together with their livestock.\n",
        "TRANSLATION_18": "(And We send down from the sky water) rain (in measure) of livelihood; and it is also said that this means: in proportion of what you need, (and We give it lodging) and We deposit it (in the earth) thus making from it pools, fountains, rivers and brooks, (and lo! We are able to withdraw it) and We are Able to leave it unused in the depth of the earth.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "23:18",
            "41:39",
            "45:3",
            "16:65",
            "43:11",
            "34:24",
            "44:29",
            "23:71",
            "3:5",
            "51:47"
        ],
        "BIBLE": [
            "prophets:jeremiah:52:9",
            "prophets:ii%20kings:25:6",
            "prophets:jeremiah:10:13",
            "prophets:i%20samuel:20:40",
            "writings:ezra:5:12",
            "prophets:jeremiah:51:16",
            "writings:daniel:1:2",
            "writings:psalms:78:24",
            "prophets:i%20kings:17:19",
            "prophets:ii%20kings:21:8"
        ]
    }
}