{
    "VERSE": "23:19",
    "ARABIC": "فَأَنشَأْنَا لَكُم بِهِۦ جَنَّٰتٍ مِّن نَّخِيلٍ وَأَعْنَٰبٍ لَّكُمْ فِيهَا فَوَٰكِهُ كَثِيرَةٌ وَمِنْهَا تَأْكُلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "By means of it We produce gardens of dates and grapes for you, in which there are many fruits for you and from which you eat,",
        "TRANSLATION_1": "We grow orchards of dates and grapes from it for you, Which yield fruits in abundance that you eat.\n",
        "TRANSLATION_2": "Then through water We caused gardens of date-palms and vines to grow for you wherein you have an abundance of delicious fruits and from them you derive your livelihood.\n",
        "TRANSLATION_3": "We have established for you gardens of palm trees and vineyards with this water with many fruits for you to consume.\n",
        "TRANSLATION_4": "So with it We produced gardens of date-palms and grapes for you, in which is abundant fruit for you and you eat therefrom.\n",
        "TRANSLATION_5": "Then We brought forth for you therewith gardens of date palms and grapes, wherein is much fruit for you, and whereof you eat.\n",
        "TRANSLATION_6": "Then We cause to grow thereby gardens of palm trees and grapes for you; you have in them many fruits and from them do you eat;\n",
        "TRANSLATION_7": "Then We produced for you therewith gardens of palms and vines wherein are many fruits for you, and of them you eat,\n",
        "TRANSLATION_8": "Then We produce for you therewith gardens of date-palms and grapes, wherein is much fruit for you and whereof ye eat;\n",
        "TRANSLATION_9": "We have produced palm-groves and vineyards for you, in which there are abundant fruits for you; and you eat these,\n",
        "TRANSLATION_10": "Then We brought forth for you therewith gardens of date- palm and vines; for you therein are fruits many, and thereof ye eat.\n",
        "TRANSLATION_11": "Then with it We produced for you gardens of date palms and vines. There are abundant fruits in them for you, and you eat from them,\n",
        "TRANSLATION_12": "With it We grow for you gardens of date-palms and vines: in them have ye abundant fruits: and of them ye eat (and have enjoyment),-\n",
        "TRANSLATION_13": "Then We brought forth for you therewith gardens of date-palms and grapes, wherein is much fruit for you, and whereof you eat.\n",
        "TRANSLATION_14": "With it, We produced for you gardens of palms and vines, yielding abundant fruit for you to eat.\n",
        "TRANSLATION_15": "With it We produce for you gardens of palms and vines, yielding abundant fruit for you to eat.\n",
        "TRANSLATION_16": "And We brought forth for you thereby gardens of palm trees and grapevines in which for you are abundant fruits and from which you eat.\n",
        "TRANSLATION_17": "[23:19] Then We produced for you therewith gardens of date palms and vines — these being the most common fruits of the Arabs — wherein is abundant fruit for you, and whereof you eat, in summer and winter.\n",
        "TRANSLATION_18": "(Then We produce for you therewith) by means of water (gardens of date-palms and grapes, wherein) in the gardens (is much fruit) many kinds of fruit (for you and whereof) and of these kinds of fruit (ye eat;\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "23:19",
            "36:34",
            "43:73",
            "17:91",
            "38:51",
            "56:32",
            "18:32",
            "2:266",
            "55:68",
            "26:57"
        ],
        "BIBLE": [
            "torah:genesis:1:12",
            "prophets:jeremiah:17:8",
            "torah:leviticus:26:4",
            "writings:psalms:107:37",
            "torah:leviticus:19:25",
            "writings:ii%20chronicles:17:5",
            "prophets:isaiah:5:4",
            "torah:leviticus:25:19",
            "torah:genesis:1:11",
            "torah:leviticus:19:23"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:3:7",
            "Sefer%20Yetzirah:1:14",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:7"
        ]
    }
}