{
    "VERSE": "23:25",
    "ARABIC": "إِنْ هُوَ إِلَّا رَجُلٌۢ بِهِۦ جِنَّةٌ فَتَرَبَّصُوا۟ بِهِۦ حَتَّىٰ حِينٍ",
    "ENGLISH": {
        "TRANSLATION_0": "He is nothing but a man possessed so wait a while and see what happens to him.'",
        "TRANSLATION_1": "He is only a man possessed; so wait and watch him for a time.\"\n",
        "TRANSLATION_2": "He is a person who has been seized with a little madness; so wait for a while (perhaps he will improve).\"\n",
        "TRANSLATION_3": "He is only an insane person. Wait for some time. Perhaps he will come to his senses.\"\n",
        "TRANSLATION_4": "“He is not but a man insane, therefore wait for some time.”\n",
        "TRANSLATION_5": "He is only a man in whom is madness, so wait for him a while.\"\n",
        "TRANSLATION_6": "He is only a madman, so bear with him for a time.\n",
        "TRANSLATION_7": "He is naught but a man bedevilled; so wait on him for a time.\n",
        "TRANSLATION_8": "He is only a man in whom is a madness, so watch him for a while.\n",
        "TRANSLATION_9": "He is only a madman, so, as far as he is concerned wait for a while.\"\n",
        "TRANSLATION_10": "He is only a man in whom is madness wherefore await for him for a season.\n",
        "TRANSLATION_11": "He is just a man possessed by madness. So bear with him for a while.’\n",
        "TRANSLATION_12": "(And some said): \"He is only a man possessed: wait (and have patience) with him for a time.\"\n",
        "TRANSLATION_13": "He is only a man in whom is madness, so wait for him a while.\"\n",
        "TRANSLATION_14": "He is nothing else except a man who is mad, so watch him for awhile.\n",
        "TRANSLATION_15": "He is nothing but a man possessed. Just ignore him for a while.”\n",
        "TRANSLATION_16": "He is not but a man possessed with madness, so wait concerning him for a time.\"\n",
        "TRANSLATION_17": "[23:25] He, Noah, is just a man possessed by madness, a case of dementia. So bear with him for a while’, until he dies.\n",
        "TRANSLATION_18": "(He) i.e. Noah (is only a man in whom is a madness, so watch him) so wait (for a while) until he dies.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "23:25",
            "37:174",
            "25:8",
            "37:178",
            "23:54",
            "37:148",
            "16:6",
            "17:47",
            "51:43",
            "7:184"
        ],
        "BIBLE": [
            "torah:genesis:29:34",
            "prophets:ii%20kings:4:17",
            "torah:genesis:6:3",
            "torah:genesis:29:35",
            "prophets:zephaniah:1:12",
            "prophets:ii%20kings:4:16",
            "writings:daniel:3:25",
            "prophets:ii%20samuel:19:23",
            "prophets:i%20kings:1:6",
            "prophets:i%20samuel:21:15"
        ]
    }
}