{
    "VERSE": "23:29",
    "ARABIC": "وَقُل رَّبِّ أَنزِلْنِى مُنزَلًا مُّبَارَكًا وَأَنتَ خَيْرُ ٱلْمُنزِلِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "And say: \"My Lord, land me in a blessed landing-place. You are the best Bringer to Land.'\"",
        "TRANSLATION_1": "And say: 'O Lord, disembark me in a welcome place; You are the best of deliverers.'\n",
        "TRANSLATION_2": "And say: \"My Lord! Make my landing a blessed landing, for You are the Best of those Who can cause people to land in safety.\"\n",
        "TRANSLATION_3": "Say, \"Lord, grant us a blessed landing from the Ark; You are the One who provides the safest landing\".\n",
        "TRANSLATION_4": "And pray, “My Lord! Cause me to alight at a blessed place – and You are the Best of all who bring to settle.”\n",
        "TRANSLATION_5": "And say: `My Lord! Cause me to land at a blessed landing place, for You are the Best of those who bring to land.\"'\n",
        "TRANSLATION_6": "And say: O my Lord! cause me to disembark a blessed alighting, and Thou art the best to cause to alight.\n",
        "TRANSLATION_7": "And say, \"'O my Lord, do Thou harbour me in a blessed harbour, for Thou art the best of harbourers.\"\n",
        "TRANSLATION_8": "And say: My Lord! Cause me to land at a blessed landing-place, for Thou art Best of all who bring to land.\n",
        "TRANSLATION_9": "and say, 'My Lord, let me land with Your blessing in a blessed landing place. You alone can provide the best landings.'\"\n",
        "TRANSLATION_10": "And say thou, my Lord! cause me to land at a landing blest, and thou art the Best of these who bring to land.\n",
        "TRANSLATION_11": "And say, ‘‘My Lord! Land me with a blessed landing, for You are the best of those who bring ashore.’’ ’\n",
        "TRANSLATION_12": "And say: \"O my Lord! enable me to disembark with thy blessing: for Thou art the Best to enable (us) to disembark.\"\n",
        "TRANSLATION_13": "And say: \"My Lord! Cause me to land at a blessed landing-place, for You are the Best of those who bring to land.\"\n",
        "TRANSLATION_14": "And say: 'Lord, let me land a blessed landing. You are the Best of harborers'\n",
        "TRANSLATION_15": "And say, “My Lord, land me with a blessed landing, as you are the best of transporters.”\n",
        "TRANSLATION_16": "And say, 'My Lord, let me land at a blessed landing place, and You are the best to accommodate [us].' \"\n",
        "TRANSLATION_17": "[23:29] And say, upon disembarking from the ship: “My Lord, cause me to land with a landing (read munzalan as the verbal noun as well as the noun of place [for ‘landing’]; or manzilan as [meaning] the site of the landing) blessed, being that landing or place, for You are the best of all who bring to land” ’, that which has been mentioned.\n",
        "TRANSLATION_18": "(And say) when you come off the ship: (My Lord! Cause me to land at a blessed landing place) blessed with water and trees, (for Thou art Best of all who bring to land) in the life of this world and in the Hereafter.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "23:29",
            "23:118",
            "22:77",
            "23:72",
            "21:89",
            "18:36",
            "38:32",
            "36:27",
            "37:100",
            "23:109"
        ],
        "BIBLE": [
            "torah:deuteronomy:26:2",
            "prophets:joshua:3:3",
            "prophets:ezekiel:37:12",
            "prophets:ii%20samuel:3:12",
            "torah:deuteronomy:9:28",
            "prophets:judges:11:19",
            "prophets:joshua:7:7",
            "prophets:jonah:1:8",
            "torah:genesis:19:12",
            "writings:nehemiah:8:1"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:2:6",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:6:2"
        ]
    }
}