{
    "VERSE": "23:34",
    "ARABIC": "وَلَئِنْ أَطَعْتُم بَشَرًا مِّثْلَكُمْ إِنَّكُمْ إِذًا لَّخَٰسِرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "If you were to obey a human being like yourselves, you would, in that case, definitely be the losers.",
        "TRANSLATION_1": "So if you follow a man like yourself you will certainly be doomed.\n",
        "TRANSLATION_2": "If you were to obey a human being like yourselves, you will certainly be losers.\n",
        "TRANSLATION_3": "If you follow a mortal like yourselves you will certainly be lost.\n",
        "TRANSLATION_4": "“If you were to obey a human like yourselves, then surely you are losers!”\n",
        "TRANSLATION_5": "If you were to obey a human being like yourselves, then verily, you indeed would be losers.\"\n",
        "TRANSLATION_6": "And if you obey a mortal like yourselves, then most surely you will be losers:\n",
        "TRANSLATION_7": "If you obey a mortal like yourselves, then you will be losers.\n",
        "TRANSLATION_8": "If ye were to obey a mortal like yourselves, then, lo! ye surely would be losers.\n",
        "TRANSLATION_9": "if you obey a human being just like yourselves, then you will surely be lost.\n",
        "TRANSLATION_10": "And were ye to obey a human being like you, ye are forthwith to be losers.\n",
        "TRANSLATION_11": "If you obey a human being like yourselves, you will indeed be losers.\n",
        "TRANSLATION_12": "If ye obey a man like yourselves, behold, it is certain ye will be lost.\n",
        "TRANSLATION_13": "If you were to obey a human being like yourselves, then verily! You indeed would be losers.\n",
        "TRANSLATION_14": "If you obey a mortal like yourselves, you shall be lost.\n",
        "TRANSLATION_15": "If you obey a human being like yourselves, then you will be losers.\n",
        "TRANSLATION_16": "And if you should obey a man like yourselves, indeed, you would then be losers.\n",
        "TRANSLATION_17": "[23:34] And, by God, if you obey a human being like yourselves (this [clause] contains both an oath and a conditional; the response belongs to the former [the oath], which [at the same time] suffices in place of a response for the latter [the conditional]) you will surely then, that is, should you obey them, be losers, you will have been duped.\n",
        "TRANSLATION_18": "(If ye were to obey a mortal) a human being (like yourselves, ye surely would be losers) you would be ignorant and losers.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "23:34",
            "26:186",
            "36:15",
            "41:6",
            "16:126",
            "26:154",
            "23:47",
            "26:42",
            "54:24",
            "37:137"
        ],
        "BIBLE": [
            "writings:psalms:128:4",
            "torah:exodus:21:22",
            "prophets:ii%20kings:6:19",
            "torah:numbers:32:11",
            "torah:genesis:24:8",
            "prophets:i%20samuel:14:8",
            "writings:job:4:17",
            "prophets:ii%20samuel:20:2",
            "torah:leviticus:5:22",
            "writings:job:37:20"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:3:5",
            "Sefer%20Yetzirah:4:11",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:4:5"
        ]
    }
}