{
    "VERSE": "23:35",
    "ARABIC": "أَيَعِدُكُمْ أَنَّكُمْ إِذَا مِتُّمْ وَكُنتُمْ تُرَابًا وَعِظَٰمًا أَنَّكُم مُّخْرَجُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Does he promise you that when you have died and become dust and bones you will be brought forth again?",
        "TRANSLATION_1": "Does he give you a promise that when you are dead and turned to dust and bones, you will be raised to life again?\n",
        "TRANSLATION_2": "Does he promise you that when you are dead and are reduced to dust and bones, you will be brought forth to life?\n",
        "TRANSLATION_3": "Does he promise you that after you die and become dust and bones you will be brought back to life again?\n",
        "TRANSLATION_4": "“Does he promise you that when you die and turn into dust and bones, you will be raised again?”\n",
        "TRANSLATION_5": "Does he promise you that when you have died and have become dust and bones, you shall come out alive\"\n",
        "TRANSLATION_6": "What! does he threaten you that when you are dead and become dust and bones that you shall then be brought forth?\n",
        "TRANSLATION_7": "What, does he promise you that when you are dead, and become dust and bones, you shall be brought forth?\n",
        "TRANSLATION_8": "Doth he promise you that you, when ye are dead and have become dust and bones, will (again) be brought forth?\n",
        "TRANSLATION_9": "Does he promise you that when you die and have become dust and bones, that you will be brought forth again?\n",
        "TRANSLATION_10": "Promiseth he unto you that ye, when ye have died and have become dust and bones, ye are to be brought forth?\n",
        "TRANSLATION_11": "Does he promise you that when you have died and become bones and dust you will indeed be raised [from the dead]?\n",
        "TRANSLATION_12": "Does he promise that when ye die and become dust and bones, ye shall be brought forth (again)?\n",
        "TRANSLATION_13": "Does he promise you that when you have died and have become dust and bones, you shall come out alive (resurrected)?\n",
        "TRANSLATION_14": "What, does he promise you that when you are dead and turned to dust and bones, you will be brought forth?\n",
        "TRANSLATION_15": "Does he promise you that when you have died and become dust and bones, you will be brought out?\n",
        "TRANSLATION_16": "Does he promise you that when you have died and become dust and bones that you will be brought forth [once more]?\n",
        "TRANSLATION_17": "[23:35] Does he promise you that when you have died and become dust and bones, you shall be brought forth? (mukhrajūna, this is the predicate of the first annakum, ‘that … you’; the second annakum [simply] reiterates it because of the long separation [between the subject and its predicate]).\n",
        "TRANSLATION_18": "(Doth he) does this Messenger (promise you that you, when ye are dead and have become dust) after death (and bones) and decayed bones, (will (again) be brought forth) will be brought back to life after death?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "23:35",
            "37:16",
            "37:53",
            "23:82",
            "56:47",
            "79:11",
            "27:67",
            "50:3",
            "17:49",
            "56:76"
        ],
        "BIBLE": [
            "prophets:i%20samuel:18:11",
            "prophets:ezekiel:33:14",
            "torah:leviticus:13:16",
            "prophets:isaiah:42:17",
            "torah:deuteronomy:31:20",
            "torah:deuteronomy:18:18",
            "prophets:ezekiel:3:20",
            "prophets:i%20kings:20:39",
            "prophets:joshua:7:26",
            "prophets:jeremiah:38:22"
        ]
    }
}