{
    "VERSE": "23:37",
    "ARABIC": "إِنْ هِىَ إِلَّا حَيَاتُنَا ٱلدُّنْيَا نَمُوتُ وَنَحْيَا وَمَا نَحْنُ بِمَبْعُوثِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "What is there but our life in this world? We die and we live and we will not be raised again.",
        "TRANSLATION_1": "There is only the life of this world: We die and we live: there is no rising from the dead for us.\n",
        "TRANSLATION_2": "There is no other life than the life of the world. We shall live here and here shall we die; and we are not going to be raised again.\n",
        "TRANSLATION_3": "This is our only life. We live and will die but we will never be brought back to life again.\n",
        "TRANSLATION_4": "“There is nothing except our life of this world, we die and we live, and we are not to be raised.”\n",
        "TRANSLATION_5": "There is nothing but our life of this world! We die and we live! And we are not going to be resurrected!\"\n",
        "TRANSLATION_6": "There is naught but our life in this world; we die and we live and we shall not be raised again.\n",
        "TRANSLATION_7": "There is nothing but our present life; we die, and we live, and we shall not be raised up.\n",
        "TRANSLATION_8": "There is naught but our life of the world; we die and we live, and we shall not be raised (again).\n",
        "TRANSLATION_9": "There exists only our present life: we die and we live [but once], and shall never be raised up again.\n",
        "TRANSLATION_10": "There is nought but our life of the world; we die and we live, and we are not going to be raised Up.\n",
        "TRANSLATION_11": "There is nothing but the life of this world: we live and die, and we will not be resurrected.\n",
        "TRANSLATION_12": "There is nothing but our life in this world! We shall die and we live! But we shall never be raised up again!\n",
        "TRANSLATION_13": "There is nothing but our life of this world! We die and we live! And we are not going to be resurrected!\n",
        "TRANSLATION_14": "There is nothing but our present life; we die, and we live, and we shall not be resurrected.\n",
        "TRANSLATION_15": "There is nothing but our life in this world. We die, and we live, and we are not resurrected.\n",
        "TRANSLATION_16": "Life is not but our worldly life - we die and live, but we will not be resurrected.\n",
        "TRANSLATION_17": "[23:37] There is nothing, that is, there is no life, but our life in this world: we die, and we live, [again only] through the lives of our offspring, and we shall not be raised [again].\n",
        "TRANSLATION_18": "(There is naught but our life of the world; we die and we live) the fathers die and their children live, (and we shall not be raised (again)) after we die.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "23:37",
            "6:29",
            "53:29",
            "79:38",
            "45:24",
            "10:7",
            "87:16",
            "30:7",
            "20:72",
            "14:27"
        ],
        "BIBLE": [
            "prophets:ii%20samuel:12:17",
            "prophets:hosea:6:2",
            "prophets:i%20samuel:28:25",
            "torah:exodus:23:4",
            "writings:psalms:113:3",
            "writings:psalms:30:2",
            "prophets:jeremiah:21:9",
            "prophets:isaiah:14:9",
            "prophets:jeremiah:38:2",
            "torah:genesis:18:16"
        ]
    }
}