{
    "VERSE": "23:38",
    "ARABIC": "إِنْ هُوَ إِلَّا رَجُلٌ ٱفْتَرَىٰ عَلَى ٱللَّهِ كَذِبًا وَمَا نَحْنُ لَهُۥ بِمُؤْمِنِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "What is he but a man who has invented a lie against Allah? We do not have iman in him.'",
        "TRANSLATION_1": "He is just a man who invents a lie about God; we cannot believe in him.\"\n",
        "TRANSLATION_2": "This man has forged a mere lie in the name of Allah and we shall never believe what he says.\"\n",
        "TRANSLATION_3": "He is only a man who invents lies against God, so have no faith in him\".\n",
        "TRANSLATION_4": "“He is just a man who has fabricated a lie against Allah, and we are not going to believe him.”\n",
        "TRANSLATION_5": "He is only a man who has invented a lie against Allah, and we are not going to believe in him.\"\n",
        "TRANSLATION_6": "He is naught but a man who has forged a lie against Allah, and we are not going to believe in him.\n",
        "TRANSLATION_7": "He is naught but a man who has forged against God a lie, and we will not believe him.'\n",
        "TRANSLATION_8": "He is only a man who hath invented a lie about Allah. We are not going to put faith in him.\n",
        "TRANSLATION_9": "He is only a man who has invented a lie about God, and we are not going to believe him!\"\n",
        "TRANSLATION_10": "He is but a man who hath fabricated against God a lie, and in him we are not going to be believers.\n",
        "TRANSLATION_11": "He is just a man who has fabricated a lie against Allah, and we will not believe in him.’\n",
        "TRANSLATION_12": "He is only a man who invents a lie against Allah, but we are not the ones to believe in him!\"\n",
        "TRANSLATION_13": "He is only a man who has invented a lie against Allah, but we are not going to believe in him.\"\n",
        "TRANSLATION_14": "He is nothing but a man who has forged against Allah a lie, we will never believe him'\n",
        "TRANSLATION_15": "He is nothing but a man, making up lies about God. We have no faith in him.”\n",
        "TRANSLATION_16": "He is not but a man who has invented a lie about Allah, and we will not believe him.\"\n",
        "TRANSLATION_17": "[23:38] He is, the Messenger is, just a man who has invented a lie against God, and we will not believe in him’, we will [not] accept the truth of resurrection after death.\n",
        "TRANSLATION_18": "(He is only a man) they mean the Messenger is only a man (who hath invented a lie about Allah) in that which he says. (We are not going to put faith in him) we are not going to believe what he says.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "23:38",
            "10:69",
            "12:106",
            "20:61",
            "16:105",
            "11:33",
            "33:23",
            "72:5",
            "40:28",
            "11:86"
        ],
        "BIBLE": [
            "torah:genesis:2:18",
            "prophets:jeremiah:16:20",
            "torah:exodus:32:23",
            "prophets:jeremiah:50:3",
            "prophets:joshua:9:6",
            "prophets:ii%20kings:10:5",
            "torah:exodus:5:8",
            "prophets:joshua:9:7",
            "prophets:jeremiah:20:15",
            "prophets:ezekiel:26:21"
        ]
    }
}