{
    "VERSE": "23:45",
    "ARABIC": "ثُمَّ أَرْسَلْنَا مُوسَىٰ وَأَخَاهُ هَٰرُونَ بِـَٔايَٰتِنَا وَسُلْطَٰنٍ مُّبِينٍ",
    "ENGLISH": {
        "TRANSLATION_0": "Then We sent Musa and his brother Harun with Our Signs and clear authority",
        "TRANSLATION_1": "Then We sent Moses and his brother Aaron with Our miracles and clear proofs\n",
        "TRANSLATION_2": "Then We sent Moses and his brother Aaron with Our Signs and a clear authority\n",
        "TRANSLATION_3": "Then We sent Moses and his brother Aaron with Our miracles and clear authority\n",
        "TRANSLATION_4": "We then sent Moosa and his brother Haroon, with Our signs and a clear proof.\n",
        "TRANSLATION_5": "Then We sent Musa and his brother Harun, with Our Ayat and manifest authority,\n",
        "TRANSLATION_6": "Then We sent Musa and his brother Haroun, with Our communications and a clear authority,\n",
        "TRANSLATION_7": "Then We sent Moses and his brother Aaron with Our signs and a manifest authority\n",
        "TRANSLATION_8": "Then We sent Moses and his brother Aaron with Our tokens and a clear warrant\n",
        "TRANSLATION_9": "Then We sent Moses and his brother Aaron with Our signs and clear authority\n",
        "TRANSLATION_10": "Thereafter We sent Musa and his brother Harun with Our signs and an authority manifest.\n",
        "TRANSLATION_11": "Then We sent Moses and Aaron, his brother, with Our signs and a manifest authority\n",
        "TRANSLATION_12": "Then We sent Moses and his brother Aaron, with Our Signs and authority manifest,\n",
        "TRANSLATION_13": "Then We sent Musa (Moses) and his brother Harun (Aaron), with Our Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) and manifest authority,\n",
        "TRANSLATION_14": "Then We sent Moses and his brother Aaron with Our signs and clear authority\n",
        "TRANSLATION_15": "Then We sent Moses and his brother Aaron, with Our signs and a clear authority.\n",
        "TRANSLATION_16": "Then We sent Moses and his brother Aaron with Our signs and a clear authority\n",
        "TRANSLATION_17": "[23:45] Then We sent Moses and his brother Aaron with Our signs and a manifest warrant, a clear proof, namely, the hand, the staff and other signs,\n",
        "TRANSLATION_18": "(Then We sent Moses and his brother Aaron with Our) nine (tokens and a clear warrant) and a clear proof.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "23:45",
            "40:23",
            "11:96",
            "28:35",
            "20:42",
            "51:38",
            "78:28",
            "12:7",
            "43:69",
            "12:89"
        ],
        "BIBLE": [
            "torah:exodus:4:28",
            "writings:psalms:135:9",
            "torah:exodus:4:30",
            "writings:psalms:105:26",
            "torah:exodus:28:41",
            "torah:deuteronomy:34:11",
            "prophets:jeremiah:10:2",
            "torah:exodus:28:1",
            "torah:numbers:20:14",
            "torah:genesis:32:4"
        ]
    }
}