{
    "VERSE": "23:50",
    "ARABIC": "وَجَعَلْنَا ٱبْنَ مَرْيَمَ وَأُمَّهُۥٓ ءَايَةً وَءَاوَيْنَٰهُمَآ إِلَىٰ رَبْوَةٍ ذَاتِ قَرَارٍ وَمَعِينٍ",
    "ENGLISH": {
        "TRANSLATION_0": "And We made the son of Maryam and his mother a Sign and gave them shelter on a mountainside where there was a meadow and a flowing spring.",
        "TRANSLATION_1": "And We made the son of Mary and his mother a sign, and gave them shelter on an elevated ground, sequestered, watered by a spring.\n",
        "TRANSLATION_2": "And We made Mary's son, and his mother, a Sign, and We gave them refuge on a lofty ground, a peaceful site with springs flowing in it.\n",
        "TRANSLATION_3": "We made the son of Mary and his mother a miracle and settled them on a high land, quite secure and watered by a spring.\n",
        "TRANSLATION_4": "And We made the son of Maryam (Prophet Eisa) and his mother a sign, and We gave them shelter on a height, a place to stay and visible springs.\n",
        "TRANSLATION_5": "And We made the son of Maryam and his mother as a sign, and We gave them refuge on a Rabwah, Dhat Qarar, and Ma`in.\n",
        "TRANSLATION_6": "And We made the son of Marium and his mother a sign, and We gave them a shelter on a lofty ground having meadows and springs.\n",
        "TRANSLATION_7": "and We made Mary's son, and his mother, to be a sign, and gave them refuge upon a height, where was a hollow and a spring:\n",
        "TRANSLATION_8": "And We made the son of Mary and his mother a portent, and We gave them refuge on a height, a place of flocks and watersprings.\n",
        "TRANSLATION_9": "We made the son of Mary and his mother a sign and gave them shelter on a peaceful hillside watered by a fresh spring.\n",
        "TRANSLATION_10": "And We made the son of Maryam and his mother a sign; and We sheltered the twain on a height: a quiet abode and running water.\n",
        "TRANSLATION_11": "and We made the son of Mary and his mother a sign, and sheltered them in a level highland with flowing water.\n",
        "TRANSLATION_12": "And We made the son of Mary and his mother as a Sign: We gave them both shelter on high ground, affording rest and security and furnished with springs.\n",
        "TRANSLATION_13": "And We made the son of Maryam (Mary) and his mother as a sign, And We gave them refuge on high ground, a place of rest, security and flowing streams.\n",
        "TRANSLATION_14": "We made the son of Mary and his mother a sign, and gave them a refuge on a hillside where there was a hollow and a spring.\n",
        "TRANSLATION_15": "And We made Mary’s son and his mother a sign, and We sheltered them on high ground with security and flowing springs.\n",
        "TRANSLATION_16": "And We made the son of Mary and his mother a sign and sheltered them within a high ground having level [areas] and flowing water.\n",
        "TRANSLATION_17": "[23:50] And We made the son of Mary, Jesus, and his mother a sign — He did not say ‘two signs’ because the same sign is in both of them: his being born without [his mother’s having] a male spouse. And We gave them refuge on a height (rabwa), a highland — in this case [either] the Holy House [of Jerusalem], Damascus or Palestine, all of which are [alternative] opinions — level (dhāt qarār), an flat [high-] land on which its inhabitants are able to settle (yastaqirru), and watered by springs, running water, over ground, which the eyes can see.\n",
        "TRANSLATION_18": "(And We made the son of Mary) i.e. Jesus (and his mother a portent) a sign and admonition: a son without a father and a pregnancy without physical contact, (and We gave them refuge on a height) on an elevated location, (a place of flocks and water springs) the reference here is to Damascus.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "23:50",
            "25:74",
            "5:75",
            "32:24",
            "28:9",
            "80:35",
            "78:28",
            "21:91",
            "26:197",
            "43:57"
        ],
        "BIBLE": [
            "torah:deuteronomy:26:9",
            "prophets:jeremiah:7:7",
            "prophets:ezekiel:33:24",
            "torah:numbers:20:24",
            "writings:i%20chronicles:21:22",
            "torah:leviticus:10:14",
            "prophets:judges:18:10",
            "writings:i%20chronicles:6:42",
            "writings:i%20chronicles:28:11",
            "writings:i%20chronicles:6:52"
        ]
    }
}