{
    "VERSE": "23:52",
    "ARABIC": "وَإِنَّ هَٰذِهِۦٓ أُمَّتُكُمْ أُمَّةً وَٰحِدَةً وَأَنَا۠ رَبُّكُمْ فَٱتَّقُونِ",
    "ENGLISH": {
        "TRANSLATION_0": "This faith of yours is a single faith and I am your Lord, so have taqwa of Me.",
        "TRANSLATION_1": "Verily this your order is one order, and I am your Lord, so fear Me.\n",
        "TRANSLATION_2": "This community of yours is one community, and I am your Lord; so hold Me alone in fear.\n",
        "TRANSLATION_3": "Your religion is one and I am your Lord. Have fear of Me\".\n",
        "TRANSLATION_4": "“And indeed this religion of yours is one religion only and I am your Lord, therefore fear Me.”\n",
        "TRANSLATION_5": "And verily, this your religion is one religion, and I am your Lord, so have Taqwa.\"\n",
        "TRANSLATION_6": "And surely this your religion is one religion and I am your Lord, therefore be careful (of your duty) to Me.\n",
        "TRANSLATION_7": "Surely this community of yours is one community, and I am your Lord; so fear Me.'\n",
        "TRANSLATION_8": "And lo! this your religion is one religion and I am your Lord, so keep your duty unto Me.\n",
        "TRANSLATION_9": "Your religion is but one religion -- and I am your only Lord, therefore, fear Me.\n",
        "TRANSLATION_10": "And verily this religion of yours is one religion, and I am your Lord, so fear Me.\n",
        "TRANSLATION_11": "Indeed this community of yours is one community, and I am your Lord, so be wary of Me.\n",
        "TRANSLATION_12": "And verily this Brotherhood of yours is a single Brotherhood, and I am your Lord and Cherisher: therefore fear Me (and no other).\n",
        "TRANSLATION_13": "And verily! This your religion (of Islamic Monotheism) is one religion, and I am your Lord, so keep your duty to Me.\n",
        "TRANSLATION_14": "Your nation is but one nation, and I am your Lord, therefore fear Me.\n",
        "TRANSLATION_15": "This nation of yours is one nation, and I am your Lord, so fear Me.\n",
        "TRANSLATION_16": "And indeed this, your religion, is one religion, and I am your Lord, so fear Me.\"\n",
        "TRANSLATION_17": "[23:52] And know, that this, creed of Islam, is your community, your religion, O you being addressed, that is, you must adhere to it as, one community — a necessary state [of affairs] (a variant reading [for anna, ‘that’] has the softened form [in]; a variant has inna, ‘truly’, indicating the beginning of [an independent] new sentence) and I am your Lord, so fear Me’, so be fearful of Me.\n",
        "TRANSLATION_18": "(And lo! this your religion is one religion) and your belief is one chosen belief (and I am your Lord) One sole Lord who honoured you with it, (so keep your duty unto Me) so obey Me.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "23:52",
            "21:92",
            "11:118",
            "36:25",
            "72:20",
            "44:20",
            "43:64",
            "19:36",
            "3:51",
            "11:90"
        ],
        "BIBLE": [
            "prophets:isaiah:57:11",
            "prophets:joel:4:21",
            "torah:exodus:14:14",
            "prophets:jeremiah:6:11",
            "torah:deuteronomy:5:11",
            "torah:exodus:20:7",
            "prophets:isaiah:64:11",
            "writings:job:13:13",
            "writings:job:32:6",
            "writings:job:13:5"
        ]
    }
}