{
    "VERSE": "23:56",
    "ARABIC": "نُسَارِعُ لَهُمْ فِى ٱلْخَيْرَٰتِ بَل لَّا يَشْعُرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "We are hastening to them with good things? No indeed, but they have no awareness!",
        "TRANSLATION_1": "We are hastening to reward them for good deeds? No. They do not comprehend.\n",
        "TRANSLATION_2": "We are busy lavishing on them all kinds of good? Nay, they do not perceive the reality of the matter.\n",
        "TRANSLATION_3": "We provide them with the means of competing with each other in virtuous deeds, but they do not realize this.\n",
        "TRANSLATION_4": "Are quickly giving them goodness? In fact, they do not know.\n",
        "TRANSLATION_5": "We hasten unto them with good things. Nay, but they perceive not.\n",
        "TRANSLATION_6": "We are hastening to them of good things? Nay, they do not perceive.\n",
        "TRANSLATION_7": "We vie in good works for them? Nay, but they are not aware.\n",
        "TRANSLATION_8": "We hasten unto them with good things? Nay, but they perceive not.\n",
        "TRANSLATION_9": "have no other purpose except to help them in acquiring material benefits? No indeed. But they do not understand.\n",
        "TRANSLATION_10": "We are hastening them on to good things? Aye! they perceive not.\n",
        "TRANSLATION_11": "We are eager to bring them good? No, they are not aware!\n",
        "TRANSLATION_12": "We would hasten them on in every good? Nay, they do not understand.\n",
        "TRANSLATION_13": "We hasten unto them with good things (in this worldly life so that they will have no share of good things in the Hereafter)? Nay, but they perceive not.\n",
        "TRANSLATION_14": "We hasten in good works for them? No, they are not aware.\n",
        "TRANSLATION_15": "We race to give them the good things? In fact, they have no idea.\n",
        "TRANSLATION_16": "Is [because] We hasten for them good things? Rather, they do not perceive.\n",
        "TRANSLATION_17": "[23:56] We are hastening to [provide] them with good things? No. Rather, they are not aware, that this is a way of gradually drawing them [into their punishment].\n",
        "TRANSLATION_18": "(We hasten unto them with good things) in this world; and it is said: in the Hereafter? (Nay, but they perceive not) that We provide them in the life of this world but will humiliate them in the Hereafter.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "23:56",
            "23:61",
            "74:53",
            "70:2",
            "70:41",
            "85:19",
            "74:43",
            "12:57",
            "88:11",
            "23:29"
        ],
        "BIBLE": [
            "prophets:joshua:23:15",
            "prophets:joshua:23:16",
            "prophets:i%20samuel:2:6",
            "writings:ecclesiastes:8:15",
            "torah:genesis:9:3",
            "writings:daniel:2:23",
            "writings:job:38:36",
            "writings:i%20chronicles:29:14",
            "writings:ecclesiastes:5:17",
            "torah:genesis:1:30"
        ]
    }
}