{
    "VERSE": "23:57",
    "ARABIC": "إِنَّ ٱلَّذِينَ هُم مِّنْ خَشْيَةِ رَبِّهِم مُّشْفِقُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Those who are filled with the fear of their Lord,",
        "TRANSLATION_1": "Surely those who live in awe of their Lord,\n",
        "TRANSLATION_2": "Surely those who stand in awe for fear of their Lord,\n",
        "TRANSLATION_3": "Only those who are, out of fear of Him, humble before their Lord,\n",
        "TRANSLATION_4": "Indeed those who are overwhelmed due to the fear of their Lord –\n",
        "TRANSLATION_5": "Verily, those who live in awe for fear of their Lord;\n",
        "TRANSLATION_6": "Surely they who from fear of their Lord are cautious,\n",
        "TRANSLATION_7": "Surely those who tremble in fear of their Lord\n",
        "TRANSLATION_8": "Lo! those who go in awe for fear of their Lord.\n",
        "TRANSLATION_9": "Those who tremble with fear of their Lord;\n",
        "TRANSLATION_10": "Verily those who for fear of their Lord are in awe.\n",
        "TRANSLATION_11": "Indeed those who are apprehensive for the fear of their Lord,\n",
        "TRANSLATION_12": "Verily those who live in awe for fear of their Lord;\n",
        "TRANSLATION_13": "Verily! Those who live in awe for fear of their Lord;\n",
        "TRANSLATION_14": "Those who tremble in fear of their Lord,\n",
        "TRANSLATION_15": "Those who, from awe of their Lord, are fearful.\n",
        "TRANSLATION_16": "Indeed, they who are apprehensive from fear of their Lord\n",
        "TRANSLATION_17": "[23:57] Surely those who, for fear of their Lord, are apprehensive, are fearful of His chastisement,\n",
        "TRANSLATION_18": "Then Allah clarified to whom He hastens with good things in the life of this world, saying: (Lo! those who go in awe for fear of their Lord) of their Lord's chastisement; for these We hasten with good things;\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "23:57",
            "7:125",
            "16:42",
            "29:59",
            "2:46",
            "25:64",
            "68:32",
            "23:26",
            "26:12",
            "23:39"
        ],
        "BIBLE": [
            "writings:psalms:55:6",
            "writings:psalms:22:24",
            "writings:psalms:34:20",
            "writings:psalms:33:8",
            "writings:psalms:34:18",
            "writings:psalms:2:11",
            "writings:psalms:78:53",
            "prophets:ii%20kings:17:39",
            "torah:exodus:15:11",
            "prophets:jeremiah:5:2"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:2:6",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:6:4"
        ]
    }
}