{
    "VERSE": "23:61",
    "ARABIC": "أُو۟لَٰٓئِكَ يُسَٰرِعُونَ فِى ٱلْخَيْرَٰتِ وَهُمْ لَهَا سَٰبِقُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "such people are truly racing towards good things, and they are the first to reach them.",
        "TRANSLATION_1": "Are the ones who hasten to goodness and outpace the others.\n",
        "TRANSLATION_2": "it is these who hasten to do good works and vie in so doing with one another.\n",
        "TRANSLATION_3": "to God, these are the ones who really compete with each other in virtuous deeds and are the foremost ones in the task.\n",
        "TRANSLATION_4": "These people hasten to perform goodness, and it is they who shall reach it first.\n",
        "TRANSLATION_5": "It is these who hasten in the good deeds, and they are foremost in them.\n",
        "TRANSLATION_6": "These hasten to good things and they are foremost in (attaining) them.\n",
        "TRANSLATION_7": "those vie in good works, outracing to them.\n",
        "TRANSLATION_8": "These race for the good things, and they shall win them in the race.\n",
        "TRANSLATION_9": "it is they who vie with one another in doing good works and shall be the foremost in doing so.\n",
        "TRANSLATION_10": "These are hastening on to good, and they are therein foremost.\n",
        "TRANSLATION_11": "—it is they who are zealous in [performing] good works and take the lead in them.\n",
        "TRANSLATION_12": "It is these who hasten in every good work, and these who are foremost in them.\n",
        "TRANSLATION_13": "It is these who race for the good deeds, and they are foremost in them [e.g. offering the compulsory Salat (prayers) in their (early) stated, fixed times and so on].\n",
        "TRANSLATION_14": "those, hasten in good works, outracing to them.\n",
        "TRANSLATION_15": "It is they who race towards goodness. It is they who will reach it first.\n",
        "TRANSLATION_16": "It is those who hasten to good deeds, and they outstrip [others] therein.\n",
        "TRANSLATION_17": "[23:61] those [are the ones who] hasten to [perform] good works, and they [are the ones who] shall come out ahead in them, according to God’s knowledge.\n",
        "TRANSLATION_18": "(These) who have such traits (race for the good things) hasten to perform righteous works, (and they shall win them in the race. 379\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "23:61",
            "23:56",
            "98:7",
            "3:104",
            "23:118",
            "23:29",
            "3:114",
            "9:88",
            "12:57",
            "3:54"
        ],
        "BIBLE": [
            "writings:i%20chronicles:11:2",
            "prophets:jeremiah:7:23",
            "writings:i%20chronicles:29:17",
            "writings:ii%20chronicles:34:25",
            "writings:psalms:40:6",
            "writings:psalms:143:10",
            "writings:ecclesiastes:4:16",
            "torah:exodus:31:14",
            "prophets:ezekiel:37:23",
            "prophets:jeremiah:44:8"
        ]
    }
}