{
    "VERSE": "23:63",
    "ARABIC": "بَلْ قُلُوبُهُمْ فِى غَمْرَةٍ مِّنْ هَٰذَا وَلَهُمْ أَعْمَٰلٌ مِّن دُونِ ذَٰلِكَ هُمْ لَهَا عَٰمِلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "However, their hearts are overwhelmed by ignorance about this matter and they do other things as well.",
        "TRANSLATION_1": "Yet their hearts are oblivious of this; and besides, they are busy with other things,\n",
        "TRANSLATION_2": "Nay, their hearts are lost in ignorance of all this; and their deeds too vary from the way (mentioned above). They will persist in these deeds\n",
        "TRANSLATION_3": "In fact, the hearts of the unbelievers are in the dark because of their ignorance of real virtue; they act against it.\n",
        "TRANSLATION_4": "On the contrary, their hearts are in neglect of this and their works are different than those of the believers, the works that they are doing.\n",
        "TRANSLATION_5": "Nay, but their hearts are covered from this, and they have other deeds, besides which they are doing.\n",
        "TRANSLATION_6": "Nay, their hearts are in overwhelming ignorance with respect to it and they have besides this other deeds which they do.\n",
        "TRANSLATION_7": "Nay, but their hearts are in perplexity as to this, and they have deeds besides that that they are doing.\n",
        "TRANSLATION_8": "Nay, but their hearts are in ignorance of this (Qur'an), and they have other works, besides, which they are doing;\n",
        "TRANSLATION_9": "But their hearts are heedless of this. Moreover, there are other deeds besides this which they do.\n",
        "TRANSLATION_10": "Aye! their hearts are in bewilderment in respect thereof, and they have works beside that, of which they are workers.\n",
        "TRANSLATION_11": "Indeed, their hearts are in a stupor in regard to this, and there are other deeds besides which they perpetrate.\n",
        "TRANSLATION_12": "But their hearts are in confused ignorance of this; and there are, besides that, deeds of theirs, which they will (continue) to do,-\n",
        "TRANSLATION_13": "Nay, but their hearts are covered (blind) from understanding this (the Quran), and they have other (evil) deeds, besides, which they are doing.\n",
        "TRANSLATION_14": "But their hearts are in ignorance of this (Koran); and they have deeds besides that which they are doing.\n",
        "TRANSLATION_15": "But their hearts are puzzled because of this; and they have deeds that do not conform to this, which they continue to perpetrate.\n",
        "TRANSLATION_16": "But their hearts are covered with confusion over this, and they have [evil] deeds besides disbelief which they are doing,\n",
        "TRANSLATION_17": "[23:63] Nay, but their hearts, that is, [the hearts of] the disbelievers, are in ignorance of this, Qur’ān, and they have other deeds which they will perpetrate besides, the ones mentioned, against the believers, and they will therefore be chastised for them.\n",
        "TRANSLATION_18": "(Nay, but their hearts) the hearts of the people of Mecca: i.e. Abu Jahl and his host (are in ignorance) and heedlessness (of this) Qur'an, (and they have other works) decreed upon them, (besides) besides that which you enjoin them of good works, (which they are doing) in the life of this world until their appointed time comes, Muhammad;\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "23:63",
            "21:82",
            "3:22",
            "46:28",
            "39:45",
            "27:24",
            "15:12",
            "72:11",
            "51:11",
            "52:47"
        ],
        "BIBLE": [
            "torah:numbers:4:20",
            "prophets:isaiah:59:6",
            "prophets:jeremiah:4:18",
            "prophets:joshua:23:14",
            "writings:ecclesiastes:6:4",
            "torah:deuteronomy:15:10",
            "writings:psalms:44:16",
            "torah:numbers:9:15",
            "prophets:jeremiah:3:25",
            "prophets:ezekiel:1:23"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:3"
        ]
    }
}