{
    "VERSE": "23:64",
    "ARABIC": "حَتَّىٰٓ إِذَآ أَخَذْنَا مُتْرَفِيهِم بِٱلْعَذَابِ إِذَا هُمْ يَجْـَٔرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "But then when We seize the affluent among them with the punishment, they will suddenly start praying fervently.",
        "TRANSLATION_1": "So that when We seize the affluent among them with affliction, they will begin to implore for help.\n",
        "TRANSLATION_2": "until We seize with Our chastisement those of them that are given to luxuriant ways. They will then begin to groan.\n",
        "TRANSLATION_3": "But when We will strike with torment those (unbelievers) who are rich, they will start to cry for help.\n",
        "TRANSLATION_4": "To the extent that when We seized the wealthy among them with punishment, they immediately began imploring.\n",
        "TRANSLATION_5": "Until when We seize those of them who lead a luxurious life with punishment; behold, they make humble invocation with a loud voice.\n",
        "TRANSLATION_6": "Until when We overtake those who lead easy lives among them with punishment, lo! they cry for succor.\n",
        "TRANSLATION_7": "Till, when We seize with the chastisement the ones of them that live at ease, behold, they groan.\n",
        "TRANSLATION_8": "Till when We grasp their luxurious ones with the punishment, behold! they supplicate.\n",
        "TRANSLATION_9": "But then when We seize the affluent among them, they will cry out for help.\n",
        "TRANSLATION_10": "Until when We lay hold of the luxuriant ones of them with the torment, and lo! then they are imploring!\n",
        "TRANSLATION_11": "When We seize their affluent ones with punishment, behold, they make entreaties [to Us].\n",
        "TRANSLATION_12": "Until, when We seize in Punishment those of them who received the good things of this world, behold, they will groan in supplication!\n",
        "TRANSLATION_13": "Until, when We grasp those of them who lead a luxurious life with punishment, behold! They make humble invocation with a loud voice.\n",
        "TRANSLATION_14": "But when We seize with the punishment those of them that live in ease, they groan.\n",
        "TRANSLATION_15": "Until, when We seize the decadent among them with torment, they begin to groan.\n",
        "TRANSLATION_16": "Until when We seize their affluent ones with punishment, at once they are crying [to Allah] for help.\n",
        "TRANSLATION_17": "[23:64] Indeed (hattā is for inceptiveness) when We seize their affluent ones, their wealthy and their leaders, with chastisement, [with] the sword, on the day of Badr, behold! they are supplicating loudly, clamouring [in supplication]. It is [then] said to them:\n",
        "TRANSLATION_18": "(Till when We grasp their luxurious ones) their tyrants and leaders: Abu Jahl Ibn Hisham, al-Walid Ibn al- Mughirah al-Makhzumi, al-'As Ibn Wa'il al-Sahmi, 'Utbah and Shaybah and their friends (with the punishment) with hunger for seven years, (behold! they supplicate) they plead.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "23:64",
            "43:50",
            "37:176",
            "26:204",
            "16:85",
            "70:1",
            "26:201",
            "37:33",
            "6:49",
            "70:11"
        ],
        "BIBLE": [
            "torah:leviticus:17:11",
            "prophets:hosea:2:14",
            "writings:psalms:142:2",
            "prophets:isaiah:38:16",
            "writings:esther:4:8",
            "prophets:ii%20samuel:22:36",
            "prophets:nahum:1:14",
            "writings:ecclesiastes:8:15",
            "prophets:i%20kings:5:23",
            "torah:leviticus:10:17"
        ]
    }
}