{
    "VERSE": "23:65",
    "ARABIC": "لَا تَجْـَٔرُوا۟ ٱلْيَوْمَ إِنَّكُم مِّنَّا لَا تُنصَرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "'Do not pray fervently today. You will not get any help from Us.",
        "TRANSLATION_1": "Do not supplicate for help today; you will not be rescued by Us;\n",
        "TRANSLATION_2": "Put a stop to your groaning now! Surely no help shall be provided to you from Us.\n",
        "TRANSLATION_3": "We shall tell them, \"Do not cry for help on this day; you will receive none from Us\".\n",
        "TRANSLATION_4": "“Do not implore this day; you will not be helped by Us.”\n",
        "TRANSLATION_5": "Invoke not loudly this day! Certainly you shall not be helped by Us.\n",
        "TRANSLATION_6": "Cry not for succor this day; surely you shall not be given help from Us.\n",
        "TRANSLATION_7": "Groan not today; surely you shall not be helped from Us.\n",
        "TRANSLATION_8": "Supplicate not this day! Assuredly ye will not be helped by Us.\n",
        "TRANSLATION_9": "Do not cry out for help this day, for surely you shall not be helped by Us.\n",
        "TRANSLATION_10": "Implore not to-day; verily ye from Us are not to be succoured.\n",
        "TRANSLATION_11": "‘Do not make entreaties today! Indeed, you will not receive any help from Us.\n",
        "TRANSLATION_12": "(It will be said): \"Groan not in supplication this day: for ye shall certainly not be helped by Us.\n",
        "TRANSLATION_13": "Invoke not loudly this day! Certainly, you shall not be helped by Us.\n",
        "TRANSLATION_14": "(We shall say): 'Do not groan today, surely you shall receive no help from Us'\n",
        "TRANSLATION_15": "Do not groan today. You will receive no help from Us.\n",
        "TRANSLATION_16": "Do not cry out today. Indeed, by Us you will not be helped.\n",
        "TRANSLATION_17": "[23:65] ‘Do not supplicate [out loud] on this day! Truly you will not receive help, you will not be protected, against Us.\n",
        "TRANSLATION_18": "Say to them, Muhammad: (Supplicate not this day) to escape Our punishment! (Assuredly you will not be helped) you will not be saved (by Us) from Our punishment.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "23:65",
            "66:7",
            "36:64",
            "23:16",
            "23:111",
            "36:59",
            "75:1",
            "38:53",
            "79:6",
            "40:32"
        ],
        "BIBLE": [
            "prophets:ezekiel:12:23",
            "prophets:jeremiah:15:11",
            "prophets:isaiah:3:7",
            "prophets:hosea:5:9",
            "prophets:jeremiah:3:16",
            "prophets:i%20kings:2:42",
            "writings:job:10:2",
            "prophets:ii%20kings:18:30",
            "prophets:isaiah:36:15",
            "torah:leviticus:23:28"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:6:1"
        ]
    }
}