{
    "VERSE": "23:66",
    "ARABIC": "قَدْ كَانَتْ ءَايَٰتِى تُتْلَىٰ عَلَيْكُمْ فَكُنتُمْ عَلَىٰٓ أَعْقَٰبِكُمْ تَنكِصُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "My Signs were recited to you and you turned round on your heels,",
        "TRANSLATION_1": "For when My revelations were read out to you, you turned back on your heels and fled\n",
        "TRANSLATION_2": "My Signs were rehearsed to you and you turned back on your heels and took to flight,\n",
        "TRANSLATION_3": "Our revelations had certainly been recited to you, but you turned your backs to them\n",
        "TRANSLATION_4": "“My verses were recited to you, so you used to turn back on your heels.”\n",
        "TRANSLATION_5": "Indeed My Ayat used to be recited to you, but you used to turn back on your heels.\n",
        "TRANSLATION_6": "My communications were indeed recited to you, but you used to turn back on your heels,\n",
        "TRANSLATION_7": "My signs were recited to you, but upon your heels you withdrew,\n",
        "TRANSLATION_8": "My revelations were recited unto you, but ye used to turn back on your heels,\n",
        "TRANSLATION_9": "My revelations were recited to you, but you turned your backs\n",
        "TRANSLATION_10": "Surely My signs have been rehearsed unto you, and upon your heel ye were wont to draw back.\n",
        "TRANSLATION_11": "Certainly My signs used to be recited to you, but you used to take to your heels,\n",
        "TRANSLATION_12": "My Signs used to be rehearsed to you, but ye used to turn back on your heels-\n",
        "TRANSLATION_13": "Indeed My Verses used to be recited to you, but you used to turn back on your heels (denying them, and with hatred to listen to them).\n",
        "TRANSLATION_14": "My verses were recited to you, but you turned upon your heels,\n",
        "TRANSLATION_15": "My Verses were recited to you, but you turned back on your heels.\n",
        "TRANSLATION_16": "My verses had already been recited to you, but you were turning back on your heels\n",
        "TRANSLATION_17": "[23:66] Verily My signs, in the Qur’ān, used to be recited to you, but you used to take to your heels, falling back in retreat,\n",
        "TRANSLATION_18": "(My revelations) the Qur'an (were recited) and shown (unto you, but ye used to turn back on your heels) to your initial religion,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "23:66",
            "39:59",
            "54:15",
            "23:105",
            "15:81",
            "26:15",
            "3:149",
            "43:47",
            "45:31",
            "22:57"
        ],
        "BIBLE": [
            "torah:exodus:4:7",
            "torah:genesis:42:24",
            "prophets:i%20samuel:8:3",
            "prophets:joshua:8:21",
            "torah:deuteronomy:2:1",
            "prophets:joshua:7:8",
            "prophets:i%20samuel:6:12",
            "torah:exodus:10:19",
            "prophets:joshua:11:10",
            "prophets:ezekiel:33:5"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:2:3",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:5:1"
        ]
    }
}