{
    "VERSE": "23:69",
    "ARABIC": "أَمْ لَمْ يَعْرِفُوا۟ رَسُولَهُمْ فَهُمْ لَهُۥ مُنكِرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Or is it that they do not recognise their Messenger and therefore do not acknowledge him?",
        "TRANSLATION_1": "Or did they not recognise their apostle, and rejected him?\n",
        "TRANSLATION_2": "Or is it that they were unaware of their Messenger and were therefore repelled by him for he was a stranger to them?\n",
        "TRANSLATION_3": "Or did you not recognize your Messenger and, thus, denied him (Muhammad)\n",
        "TRANSLATION_4": "Or is it that they did not recognise their Noble Messenger, therefore they consider him alien?\n",
        "TRANSLATION_5": "Or is it that they did not recognize their Messenger so they deny him\n",
        "TRANSLATION_6": "Or is it that they have not recognized their Apostle, so that they deny him?\n",
        "TRANSLATION_7": "Or did they not recognise their Messenger and so denied him?\n",
        "TRANSLATION_8": "Or know they not their messenger, and so reject him?\n",
        "TRANSLATION_9": "Or do they not recognize their Messenger, and so deny him?\n",
        "TRANSLATION_10": "Or, is it that they recognised not their apostle, and so of him they become deniers?\n",
        "TRANSLATION_11": "Is it that they do not recognize their apostle, and so they deny him?\n",
        "TRANSLATION_12": "Or do they not recognise their Messenger, that they deny him?\n",
        "TRANSLATION_13": "Or is it that they did not recognize their Messenger (Muhammad SAW) so they deny him?\n",
        "TRANSLATION_14": "Or, is it because they do not recognize their Messenger that they denied him?\n",
        "TRANSLATION_15": "Or is it that they did not recognize their messenger, so they are denying him?\n",
        "TRANSLATION_16": "Or did they not know their Messenger, so they are toward him disacknowledging?\n",
        "TRANSLATION_17": "[23:69] Or is it that they do not recognise their [own] Messenger and so they reject him?\n",
        "TRANSLATION_18": "Or know they not their messenger) the lineage of their Messenger, (and so reject him) and so deny him?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "23:69",
            "15:11",
            "69:10",
            "48:13",
            "21:41",
            "40:70",
            "3:32",
            "16:113",
            "3:53",
            "51:45"
        ],
        "BIBLE": [
            "prophets:jeremiah:22:16",
            "writings:job:42:3",
            "writings:psalms:118:22",
            "prophets:judges:18:14",
            "prophets:isaiah:44:8",
            "prophets:isaiah:41:22",
            "prophets:isaiah:41:20",
            "torah:exodus:4:14",
            "prophets:jeremiah:4:22",
            "torah:exodus:33:13"
        ]
    }
}