{
    "VERSE": "23:70",
    "ARABIC": "أَمْ يَقُولُونَ بِهِۦ جِنَّةٌۢ بَلْ جَآءَهُم بِٱلْحَقِّ وَأَكْثَرُهُمْ لِلْحَقِّ كَٰرِهُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Or do they say, 'He is a man possessed,' when he has brought the truth to them? But most of them hate the truth.",
        "TRANSLATION_1": "Or do they say that he is possessed? In fact, he has brought the truth to them, but most of them abhor the truth.\n",
        "TRANSLATION_2": "Or do they say that there is madness in him? Nay, he has brought them the Truth and it is the Truth that most of them disdain.\n",
        "TRANSLATION_3": "or you said that he is possessed by satan? In fact, he has brought you the truth, but most of you dislike it.\n",
        "TRANSLATION_4": "Or they say, “He is afflicted by a demon”; in fact he brought the Truth to them, and most of them dislike the Truth.\n",
        "TRANSLATION_5": "Or they say: There is madness in him Nay, but he brought them the truth, but most of them are averse to the truth.\n",
        "TRANSLATION_6": "Or do they say: There is madness in him? Nay! he has brought them the truth, and most of them are averse from the truth.\n",
        "TRANSLATION_7": "Or do they say, 'He is bedevilled'? Nay, he has brought them the truth, but most of them are averse from the truth.\n",
        "TRANSLATION_8": "Or say they: There is a madness in him? Nay, but he bringeth them the Truth; and most of them are haters of the Truth.\n",
        "TRANSLATION_9": "Do they say he is possessed? Rather he has brought them the truth, but most of them are averse to the truth.\n",
        "TRANSLATION_10": "Or, say they: in him is madness? O Aye he brought them the truth, and most of them to the truth are averse.\n",
        "TRANSLATION_11": "Do they say, ‘There is madness in him’? No, he has brought them the truth, and most of them are averse to the truth.\n",
        "TRANSLATION_12": "Or do they say, \"He is possessed\"? Nay, he has brought them the Truth, but most of them hate the Truth.\n",
        "TRANSLATION_13": "Or say they: \"There is madness in him?\" Nay, but he brought them the truth [i.e. \"(A) Tauhid: Worshipping Allah Alone in all aspects (B) The Quran (C) The religion of Islam,\"] but most of them (the disbelievers) are averse to the truth.\n",
        "TRANSLATION_14": "Do they say he is mad! No, he came to them with the truth, but most of them hate the truth.\n",
        "TRANSLATION_15": "Or do they say, “He is possessed?” In fact, he brought them the truth, but most of them hate the truth.\n",
        "TRANSLATION_16": "Or do they say, \"In him is madness?\" Rather, he brought them the truth, but most of them, to the truth, are averse.\n",
        "TRANSLATION_17": "[23:70] Or do they say, ‘There is a madness in him’? — this interrogative is meant as an affirmation of the truth of the Prophet’s sincerity, and [of the fact] that messengers did come to past communities, and [of the fact] that they [do indeed] recognise their Messenger to be truthful and trustworthy, and [of the fact] that there is no madness in him. Nay (bal is for transition), he has brought them the truth, namely, the Qur’ān that comprises [affirmations of] the Oneness [of God] and the Laws of Islam; but most of them are averse to the truth.\n",
        "TRANSLATION_18": "(Or say they) indeed they say: (There is a madness in him? Nay, but he bringeth them the Truth) Muhammad (pbuh) brought them the Qur'an, the profession of Allah's divine Oneness and the Message; (and most of them are haters) deniers (of the Truth) of the Qur'an.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "23:70",
            "43:78",
            "44:39",
            "37:37",
            "23:90",
            "24:49",
            "21:55",
            "34:41",
            "47:6",
            "26:90"
        ],
        "BIBLE": [
            "prophets:i%20kings:17:18",
            "prophets:i%20kings:2:30",
            "torah:genesis:39:17",
            "prophets:micah:1:15",
            "prophets:i%20kings:1:53",
            "prophets:ii%20kings:5:6",
            "torah:genesis:37:14",
            "torah:genesis:27:18",
            "torah:exodus:2:18",
            "prophets:i%20kings:17:20"
        ]
    }
}