{
    "VERSE": "23:73",
    "ARABIC": "وَإِنَّكَ لَتَدْعُوهُمْ إِلَىٰ صِرَٰطٍ مُّسْتَقِيمٍ",
    "ENGLISH": {
        "TRANSLATION_0": "You are calling them to a straight path.",
        "TRANSLATION_1": "You are surely calling them to the right path.\n",
        "TRANSLATION_2": "You are calling them to a Straight Way,\n",
        "TRANSLATION_3": "(Muhammad), you certainly have called them to the right path,\n",
        "TRANSLATION_4": "And indeed you call them to the Straight Path.\n",
        "TRANSLATION_5": "And certainly, you call them to the straight path.\n",
        "TRANSLATION_6": "And most surely you invite them to a right way.\n",
        "TRANSLATION_7": "Assuredly thou art calling them to a straight path;\n",
        "TRANSLATION_8": "And lo! thou summonest them indeed unto a straight path.\n",
        "TRANSLATION_9": "and, most surely, you are calling them to a straight path.\n",
        "TRANSLATION_10": "And verily thou! thou callest them unto a Path straight.\n",
        "TRANSLATION_11": "Indeed you invite them to a straight path,\n",
        "TRANSLATION_12": "But verily thou callest them to the Straight Way;\n",
        "TRANSLATION_13": "And certainly, you (O Muhammad SAW) call them to a Straight Path (true religion Islamic Monotheism).\n",
        "TRANSLATION_14": "Indeed you are calling them to a Straight Path,\n",
        "TRANSLATION_15": "You are inviting them to a straight path.\n",
        "TRANSLATION_16": "And indeed, you invite them to a straight path.\n",
        "TRANSLATION_17": "[23:73] And truly you summon them to a straight path, a [straight] route, that is, the religion of Islam.\n",
        "TRANSLATION_18": "(And lo! thou) Muhammad (summonest them indeed unto a right path) to an established religion which Allah is pleased with: Islam.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "23:73",
            "4:68",
            "43:43",
            "23:74",
            "37:137",
            "26:55",
            "16:121",
            "37:118",
            "36:4",
            "15:41"
        ],
        "BIBLE": [
            "prophets:isaiah:43:1",
            "prophets:isaiah:26:7",
            "torah:genesis:3:9",
            "prophets:isaiah:43:22",
            "prophets:isaiah:35:8",
            "writings:psalms:130:1",
            "prophets:jeremiah:14:9",
            "writings:psalms:116:4",
            "writings:psalms:88:10",
            "prophets:isaiah:48:15"
        ]
    }
}