{
    "VERSE": "23:74",
    "ARABIC": "وَإِنَّ ٱلَّذِينَ لَا يُؤْمِنُونَ بِٱلْءَاخِرَةِ عَنِ ٱلصِّرَٰطِ لَنَٰكِبُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "But those who do not have iman in the akhira recoil from the path.",
        "TRANSLATION_1": "But those who believe not in the Hereafter turn away from the straight path.\n",
        "TRANSLATION_2": "but those who do not believe in the Hereafter are ever prone to deviate from the Right Way.\n",
        "TRANSLATION_3": "but those who disbelieve the life hereafter deviate from the right path.\n",
        "TRANSLATION_4": "And indeed those who do not believe in the Hereafter are deviated from the Straight Path.\n",
        "TRANSLATION_5": "And verily, those who believe not in the Hereafter are indeed deviating far astray from the path.\n",
        "TRANSLATION_6": "And most surely those who do not believe in the hereafter are deviating from the way.\n",
        "TRANSLATION_7": "and surely they that believe not in the world to come are deviating from the path.\n",
        "TRANSLATION_8": "And lo! those who believe not in the Hereafter are indeed astray from the path.\n",
        "TRANSLATION_9": "But those who do not believe in the Hereafter have indeed deviated from that path.\n",
        "TRANSLATION_10": "And verily those who believe not in the Hereafter are from the path deviating.\n",
        "TRANSLATION_11": "and those who do not believe in the Hereafter surely deviate from the path.\n",
        "TRANSLATION_12": "And verily those who believe not in the Hereafter are deviating from that Way.\n",
        "TRANSLATION_13": "And verily, those who believe not in the Hereafter are indeed deviating far astray from the Path (true religion Islamic Monotheism).\n",
        "TRANSLATION_14": "but those who disbelieve in the Everlasting Life deviate from the Path.\n",
        "TRANSLATION_15": "But those who do not believe in the Hereafter are swerving from the path.\n",
        "TRANSLATION_16": "But indeed, those who do not believe in the Hereafter are deviating from the path.\n",
        "TRANSLATION_17": "[23:74] And truly those who do not believe in the Hereafter, in resurrection, reward and punishment, deviate, swerve away, from the path, that is, the route [to salvation].\n",
        "TRANSLATION_18": "(And lo! those who believe not in the Hereafter) those who do not believe in resurrection after death (are indeed astray from the path) from Allah's religion.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "23:74",
            "23:73",
            "41:7",
            "53:27",
            "1:7",
            "27:4",
            "6:113",
            "4:68",
            "77:17",
            "75:21"
        ],
        "BIBLE": [
            "writings:psalms:139:24",
            "writings:proverbs:12:28",
            "writings:psalms:5:9",
            "prophets:i%20kings:13:10",
            "writings:proverbs:5:8",
            "prophets:ezekiel:46:9",
            "writings:proverbs:5:6",
            "torah:genesis:3:24",
            "torah:genesis:48:7",
            "prophets:isaiah:26:7"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:4:8",
            "Sefer%20Yetzirah:3:6",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:3:3"
        ]
    }
}