{
    "VERSE": "23:75",
    "ARABIC": "وَلَوْ رَحِمْنَٰهُمْ وَكَشَفْنَا مَا بِهِم مِّن ضُرٍّ لَّلَجُّوا۟ فِى طُغْيَٰنِهِمْ يَعْمَهُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "If We did have mercy on them and removed the harm afflicting them, they would still obstinately persist in wandering blindly in their excessive insolence.",
        "TRANSLATION_1": "If We took compassion on them and removed the affliction they are in, they would only wander lost in confusion.\n",
        "TRANSLATION_2": "Were We to be merciful to them and remove from them their present afflictions, they would persist in their transgression, blindly wandering on.\n",
        "TRANSLATION_3": "Even if We were to grant them mercy and rescue them from hardship, they would still blindly persist in their rebellion.\n",
        "TRANSLATION_4": "And if We have mercy upon them and remove the calamity which has befallen them, they would still stubbornly persist, wandering in their rebellion.\n",
        "TRANSLATION_5": "And though We had mercy on them and removed the distress which is on them, still they would obstinately persist in their transgression, wandering blindly.\n",
        "TRANSLATION_6": "And if We show mercy to them and remove the distress they have, they would persist in their inordinacy, blindly wandering on.\n",
        "TRANSLATION_7": "Did We have mercy on them, and remove the affliction that is upon them, they would persist in their insolence wandering blindly.\n",
        "TRANSLATION_8": "Though We had mercy on them and relieved them of the harm afflicting them, they still would wander blindly on in their contumacy.\n",
        "TRANSLATION_9": "Even if We showed them mercy and relieved them of their afflictions, they would still persist in their transgression, wandering blindly.\n",
        "TRANSLATION_10": "And though We have mercy on them We may remove whatsoever of hurt is with them, surely they would persist in their exorbitance, wandering perplexed.\n",
        "TRANSLATION_11": "Should We have mercy upon them and remove their distress, they would surely persist, bewildered in their rebellion.\n",
        "TRANSLATION_12": "If We had mercy on them and removed the distress which is on them, they would obstinately persist in their transgression, wandering in distraction to and fro.\n",
        "TRANSLATION_13": "And though We had mercy on them and removed the distress which is on them, still they would obstinately persist in their transgression, wandering blindly.\n",
        "TRANSLATION_14": "If We had mercy on them and removed their afflictions, they would still persist in their insolence, blindly wandering.\n",
        "TRANSLATION_15": "Even if We had mercy on them, and relieved their problems, they would still blindly persist in their defiance.\n",
        "TRANSLATION_16": "And even if We gave them mercy and removed what was upon them of affliction, they would persist in their transgression, wandering blindly.\n",
        "TRANSLATION_17": "[23:75] And had We shown them mercy and relieved them of the harm afflicting them — the famine that befell them in Mecca for seven years — they would surely persist in their insolence, [in] their error, bewildered, hesitating.\n",
        "TRANSLATION_18": "(Though We had mercy on them) i.e. the people of Mecca (and relieved them of the harm) and relieved them of the hunger which was (afflicting them, they still would wander blindly on) they still would carry on blind to the Truth and guidance (in their contumacy) in their disbelief and error.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "23:75",
            "37:72",
            "43:60",
            "50:35",
            "29:9",
            "23:95",
            "6:9",
            "85:7",
            "69:49",
            "37:167"
        ],
        "BIBLE": [
            "prophets:ezekiel:18:13",
            "torah:deuteronomy:29:7",
            "writings:psalms:105:44",
            "prophets:joshua:11:23",
            "writings:daniel:1:16",
            "torah:numbers:7:6",
            "torah:numbers:8:16",
            "prophets:judges:3:6",
            "torah:genesis:21:27",
            "writings:nehemiah:2:1"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:7",
            
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:4:12"
        ]
    }
}