{
    "VERSE": "23:8",
    "ARABIC": "وَٱلَّذِينَ هُمْ لِأَمَٰنَٰتِهِمْ وَعَهْدِهِمْ رَٰعُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "those who honour their trusts and their contracts;",
        "TRANSLATION_1": "And those who fulfil their trusts and keep their promises;\n",
        "TRANSLATION_2": "who are true to their trusts and their covenants,\n",
        "TRANSLATION_3": "those who are true to their trust,\n",
        "TRANSLATION_4": "And those who keep proper regard for their trusts and their pledges.\n",
        "TRANSLATION_5": "Those who are faithfully true to their Amanat and to their covenants are Ra`un.\n",
        "TRANSLATION_6": "And those who are keepers of their trusts and their covenant,\n",
        "TRANSLATION_7": "and who preserve their trusts and their covenant\n",
        "TRANSLATION_8": "And who are shepherds of their pledge and their covenant,\n",
        "TRANSLATION_9": "those who are faithful to their trusts and promises;\n",
        "TRANSLATION_10": "And those who of their trusts and covenant are keepers.\n",
        "TRANSLATION_11": "and those who keep their trusts and covenants\n",
        "TRANSLATION_12": "Those who faithfully observe their trusts and their covenants;\n",
        "TRANSLATION_13": "Those who are faithfully true to their Amanat (all the duties which Allah has ordained, honesty, moral responsibility and trusts etc.) and to their covenants;\n",
        "TRANSLATION_14": "(Prosperous are those) who preserve their trusts and pledges\n",
        "TRANSLATION_15": "Those who are faithful to their trusts and pledges.\n",
        "TRANSLATION_16": "And they who are to their trusts and their promises attentive\n",
        "TRANSLATION_17": "[23:8] And who are keepers of their trusts (may be read as plural, amānātihim, ‘their trusts’, or singular, amānatihim, ‘their trust’) and covenants, [made] between them, or between them and God, such as [the observance of] prayer and so on.\n",
        "TRANSLATION_18": "(And who are shepherds) preserve that with which they have been entrusted (of their pledge) such as fasting, major ritual ablution, trusts and the like, (and their covenant) with Allah or with other people,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "23:8",
            "70:32",
            "70:33",
            "8:56",
            "6:82",
            "13:20",
            "2:40",
            "9:12",
            "3:12",
            "9:4"
        ],
        "BIBLE": [
            "writings:psalms:119:4",
            "torah:exodus:31:16",
            "prophets:isaiah:49:8",
            "writings:psalms:25:10",
            "writings:psalms:31:7",
            "prophets:ezekiel:37:24",
            "prophets:i%20kings:8:24",
            "writings:ii%20chronicles:6:15",
            "torah:deuteronomy:7:9",
            "torah:numbers:15:22"
        ]
    }
}