{
    "VERSE": "23:81",
    "ARABIC": "بَلْ قَالُوا۟ مِثْلَ مَا قَالَ ٱلْأَوَّلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "However, they say the same as previous peoples said.",
        "TRANSLATION_1": "And talk as did the people of old.\n",
        "TRANSLATION_2": "Nay, but they say the like of what their predecessors of yore had said.\n",
        "TRANSLATION_3": "They say exactly the same thing as the people who lived before.\n",
        "TRANSLATION_4": "On the contrary, they said the same as what the former people used to say.\n",
        "TRANSLATION_5": "Nay, but they say the like of what the men of old said.\n",
        "TRANSLATION_6": "Nay, they say the like of what the ancients said:\n",
        "TRANSLATION_7": "Nay, but they said the like of what the ancients said.\n",
        "TRANSLATION_8": "Nay, but they say the like of that which said the men of old;\n",
        "TRANSLATION_9": "But they say the same as the ancients said,\n",
        "TRANSLATION_10": "Aye! they say the like of that which said the ancients.\n",
        "TRANSLATION_11": "Indeed, they say, just like what the former peoples said.\n",
        "TRANSLATION_12": "On the contrary they say things similar to what the ancients said.\n",
        "TRANSLATION_13": "Nay, but they say the like of what the men of old said.\n",
        "TRANSLATION_14": "No, but they said what the ancients said before them:\n",
        "TRANSLATION_15": "But they say the like of what the ancients said.\n",
        "TRANSLATION_16": "Rather, they say like what the former peoples said.\n",
        "TRANSLATION_17": "[23:81] Nay, but they say the like of what the ancients said.\n",
        "TRANSLATION_18": "(Nay, but they) i.e. the people of Mecca (say the like of that which) disbelieve in resurrection after death in the same was as (said the men of old) the people of old disbelieved in resurrection after death;\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "23:81",
            "43:8",
            "56:13",
            "56:39",
            "36:42",
            "77:16",
            "23:68",
            "8:31",
            "39:12",
            "26:184"
        ],
        "BIBLE": [
            "prophets:ezekiel:20:8",
            "prophets:ii%20samuel:23:17",
            "prophets:i%20samuel:2:23",
            "prophets:jeremiah:7:23",
            "writings:i%20chronicles:11:24",
            "prophets:isaiah:7:13",
            "prophets:ezekiel:24:19",
            "prophets:ii%20kings:23:17",
            "writings:nehemiah:7:65",
            "writings:i%20chronicles:11:19"
        ]
    }
}