{
    "VERSE": "23:84",
    "ARABIC": "قُل لِّمَنِ ٱلْأَرْضُ وَمَن فِيهَآ إِن كُنتُمْ تَعْلَمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Say: To whom does the earth belong, and everyone in it, if you have any knowledge?'",
        "TRANSLATION_1": "Say: \"To whom does the earth and whosoever is upon it then belong, if you know?\"\n",
        "TRANSLATION_2": "Ask them: \"Whose is the earth and those who are in it? Tell us if you know\"\n",
        "TRANSLATION_3": "(Muhammad), say to them, \"Tell me, if you know, to whom does the earth and its contents belong?\"\n",
        "TRANSLATION_4": "Say O dear Prophet (Mohammed – peace and blessings be upon him), “To Whom does the earth and all that is in it belong to, if you know?”\n",
        "TRANSLATION_5": "Say: \"Whose is the earth and whosoever is therein If you know!\"\n",
        "TRANSLATION_6": "Say: Whose is the earth, and whoever is therein, if you know?\n",
        "TRANSLATION_7": "Say: 'Whose is the earth, and whoso is in it, if you have knowledge?'\n",
        "TRANSLATION_8": "Say: Unto Whom (belongeth) the earth and whosoever is therein, if ye have knowledge?\n",
        "TRANSLATION_9": "Say, \"To whom do the earth and all therein belong? Tell me, if you have any knowledge?\"\n",
        "TRANSLATION_10": "Say thou: whose is the earth and whosoever is therein, if you know?\n",
        "TRANSLATION_11": "Say, ‘To whom does the earth belong and whoever it contains, if you know?’\n",
        "TRANSLATION_12": "Say: \"To whom belong the earth and all beings therein? (say) if ye know!\"\n",
        "TRANSLATION_13": "Say: \"Whose is the earth and whosoever is therein? If you know!\"\n",
        "TRANSLATION_14": "Say: \"If you have knowledge, 'to whom belongs the earth' and, 'whoever is in it? '\"\n",
        "TRANSLATION_15": "Say, “To whom does the earth belong, and everyone in it, if you happen to know?”\n",
        "TRANSLATION_16": "Say, [O Muhammad], \"To whom belongs the earth and whoever is in it, if you should know?\"\n",
        "TRANSLATION_17": "[23:84] Say, to them: ‘To whom does the earth and whoever is in it, of creatures, belong, if you [truly] knew?’, their Creator and Owner.\n",
        "TRANSLATION_18": "(Say) Muhammad: (Unto Whom (belongeth) the earth and whosoever is therein) of created beings; answer me, (if ye have knowledge?)\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "23:84",
            "23:79",
            "91:6",
            "38:28",
            "26:152",
            "19:40",
            "55:10",
            "51:48",
            "67:24",
            "70:14"
        ],
        "BIBLE": [
            "prophets:i%20samuel:20:7",
            "writings:ii%20chronicles:25:16",
            "writings:ruth:4:4",
            "prophets:i%20kings:18:36",
            "prophets:jeremiah:10:11",
            "torah:genesis:40:8",
            "torah:exodus:9:29",
            "writings:daniel:10:19",
            "prophets:jonah:1:10",
            "writings:psalms:73:11"
        ]
    }
}