{
    "VERSE": "23:94",
    "ARABIC": "رَبِّ فَلَا تَجْعَلْنِى فِى ٱلْقَوْمِ ٱلظَّٰلِمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "do not then, my Lord, put me among the wrongdoing people!'",
        "TRANSLATION_1": "Then do not, O Lord, put me among the sinners.\"\n",
        "TRANSLATION_2": "then do not include me, my Lord, among these wrong-doing people.\"\n",
        "TRANSLATION_3": "exclude me from the unjust people\".\n",
        "TRANSLATION_4": "“Therefore my Lord, do not group me with the unjust.”\n",
        "TRANSLATION_5": "My Lord! Then, put me not amongst the people who are the wrongdoers.\"\n",
        "TRANSLATION_6": "My Lord! then place me not with the unjust.\n",
        "TRANSLATION_7": "O my Lord, put me not among the people of the evildoers.'\n",
        "TRANSLATION_8": "My Lord! then set me not among the wrongdoing folk.\n",
        "TRANSLATION_9": "then do not place me, Lord, with the wrongdoers.\"\n",
        "TRANSLATION_10": "My Lord! then place me not among the wrong-doing people.\n",
        "TRANSLATION_11": "then do not put me, my Lord, among the wrongdoing lot.’\n",
        "TRANSLATION_12": "Then, O my Lord! put me not amongst the people who do wrong!\"\n",
        "TRANSLATION_13": "My Lord! Then (save me from Your Punishment), and put me not amongst the people who are the Zalimun (polytheists and wrong-doing).\"\n",
        "TRANSLATION_14": "O my Lord, do not put me among the harmdoing people'\n",
        "TRANSLATION_15": "My Lord, do not place me among the wicked people.”\n",
        "TRANSLATION_16": "My Lord, then do not place me among the wrongdoing people.\"\n",
        "TRANSLATION_17": "[23:94] my Lord, then do no put me among the evildoing folk’, lest I be destroyed when they are destroyed.\n",
        "TRANSLATION_18": "(My Lord! then set me not among the wrong-doing folk) do not place me with the disbelieving people on the Day of Badr.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "23:94",
            "28:21",
            "29:30",
            "26:117",
            "44:22",
            "10:85",
            "26:10",
            "3:60",
            "23:106",
            "7:79"
        ],
        "BIBLE": [
            "writings:psalms:113:8",
            "prophets:i%20samuel:12:13",
            "prophets:amos:7:8",
            "prophets:isaiah:50:7",
            "torah:leviticus:20:26",
            "torah:deuteronomy:10:11",
            "writings:ii%20chronicles:12:14",
            "writings:song%20of%20songs:6:12",
            "torah:leviticus:20:24",
            "prophets:ezekiel:28:6"
        ]
    }
}