{
    "VERSE": "23:97",
    "ARABIC": "وَقُل رَّبِّ أَعُوذُ بِكَ مِنْ هَمَزَٰتِ ٱلشَّيَٰطِينِ",
    "ENGLISH": {
        "TRANSLATION_0": "Say: 'My Lord, I seek refuge with You from the goadings of the shaytans,",
        "TRANSLATION_1": "Say: \"My Lord, I seek refuge in You from the evil promptings of the devils.\n",
        "TRANSLATION_2": "And pray: \"My Lord! I seek Your refuge from the suggestions of the evil ones;\n",
        "TRANSLATION_3": "Say, \"Lord, I seek your protection against the strong temptations of the devils.\n",
        "TRANSLATION_4": "And submit, “My Lord! I seek Your refuge from the instigation of the devils.”\n",
        "TRANSLATION_5": "And say: \"My Lord! I seek refuge with You from the whisperings of the Shayatin.\"\n",
        "TRANSLATION_6": "And say: O my Lord! I seek refuge in Thee from the evil suggestions of the Shaitans;\n",
        "TRANSLATION_7": "And say: 'O my Lord, I take refuge in Thee from the evil suggestions of the Satans,\n",
        "TRANSLATION_8": "And say: My Lord! I seek refuge in Thee from suggestions of the evil ones,\n",
        "TRANSLATION_9": "and say, \"My Lord, I seek refuge with You from the prompting of the devils.\n",
        "TRANSLATION_10": "And say thou: my Lord! I seek refuge with Thee against the whisperings of the satans;\n",
        "TRANSLATION_11": "Say, ‘My Lord! I seek Your protection from the promptings of devils,\n",
        "TRANSLATION_12": "And say \"O my Lord! I seek refuge with Thee from the suggestions of the Evil Ones.\n",
        "TRANSLATION_13": "And say: \"My Lord! I seek refuge with You from the whisperings (suggestions) of the Shayatin (devils).\n",
        "TRANSLATION_14": "And say: 'O my Lord, I seek refuge in You from evil suggestions of the satans.\n",
        "TRANSLATION_15": "And say, “My Lord, I seek refuge with You from the urgings of the devils.\n",
        "TRANSLATION_16": "And say, \"My Lord, I seek refuge in You from the incitements of the devils,\n",
        "TRANSLATION_17": "[23:97] And say: ‘My Lord, I seek protection in You from the promptings of devils, [from] their [evil] suggestions, which they whisper.\n",
        "TRANSLATION_18": "(And say: My Lord! I seek refuge in Thee from suggestions) from the insinuations (of the evil ones) that bewitch humans,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "23:97",
            "36:27",
            "26:210",
            "37:100",
            "38:41",
            "19:68",
            "26:83",
            "37:57",
            "17:27",
            "23:98"
        ],
        "BIBLE": [
            "writings:psalms:142:6",
            "prophets:jonah:4:2",
            "prophets:i%20samuel:3:17",
            "prophets:jeremiah:16:19",
            "writings:psalms:91:2",
            "prophets:jeremiah:45:2",
            "prophets:ezekiel:26:17",
            "torah:exodus:4:13",
            "prophets:ezekiel:44:6",
            "writings:psalms:31:15"
        ]
    }
}