{
    "VERSE": "23:98",
    "ARABIC": "وَأَعُوذُ بِكَ رَبِّ أَن يَحْضُرُونِ",
    "ENGLISH": {
        "TRANSLATION_0": "and I seek refuge with You, my Lord, from their presence.'",
        "TRANSLATION_1": "I seek refuge in You lest they come to me.\"\n",
        "TRANSLATION_2": "I even seek Your refuge, my Lord, lest they should approach me.\"\n",
        "TRANSLATION_3": "I seek your protection should they approach me.\"\n",
        "TRANSLATION_4": "“And my Lord, (I seek) Your refuge from their coming to me.”\n",
        "TRANSLATION_5": "And I seek refuge with You, My Lord! lest they should come near me.\"\n",
        "TRANSLATION_6": "And I seek refuge in Thee! O my Lord! from their presence.\n",
        "TRANSLATION_7": "and I take refuge in Thee, O my Lord, lest they attend me.'\n",
        "TRANSLATION_8": "And I seek refuge in Thee, my Lord, lest they be present with me,\n",
        "TRANSLATION_9": "I seek refuge with You, Lord, lest they should come near me.\"\n",
        "TRANSLATION_10": "And I seek refuge with Thee, my Lord! lest they may be present with me\n",
        "TRANSLATION_11": "and I seek Your protection, my Lord, from their presence near me.’\n",
        "TRANSLATION_12": "And I seek refuge with Thee O my Lord! lest they should come near me.\"\n",
        "TRANSLATION_13": "And I seek refuge with You, My Lord! lest they may attend (or come near) me.\"\n",
        "TRANSLATION_14": "O my Lord, I seek refuge in You lest they attend me'\n",
        "TRANSLATION_15": "And I seek refuge with You, my Lord, lest they become present.”\n",
        "TRANSLATION_16": "And I seek refuge in You, my Lord, lest they be present with me.\"\n",
        "TRANSLATION_17": "[23:98] And I seek protection in You, my Lord, lest they visit me’, in any of my affairs, for they only visit to bring ill.\n",
        "TRANSLATION_18": "(And I seek refuge in Thee, my Lord, lest they) the devils (be present with me) upon praying, upon recitation and upon death,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "23:98",
            "44:20",
            "23:26",
            "26:12",
            "23:39",
            "23:59",
            "29:59",
            "16:42",
            "84:5",
            "84:2"
        ],
        "BIBLE": [
            "writings:psalms:102:2",
            "writings:psalms:95:1",
            "writings:psalms:119:41",
            "writings:psalms:86:9",
            "writings:psalms:95:6",
            "torah:genesis:43:25",
            "prophets:zechariah:2:14",
            "torah:numbers:35:32",
            "writings:daniel:2:29",
            "prophets:jeremiah:16:19"
        ]
    }
}