{
    "VERSE": "23:99",
    "ARABIC": "حَتَّىٰٓ إِذَا جَآءَ أَحَدَهُمُ ٱلْمَوْتُ قَالَ رَبِّ ٱرْجِعُونِ",
    "ENGLISH": {
        "TRANSLATION_0": "When death comes to one of them, he says, 'My Lord, send me back again.",
        "TRANSLATION_1": "(But the unbelievers will persist) until when death comes to one of them he will say: \"O Lord, send me back again\n",
        "TRANSLATION_2": "(They shall persist in their deeds) until when death comes to anyone of them he will say: \"My Lord, send me back to the world\n",
        "TRANSLATION_3": "When death approaches one of the unbelievers, he says, \"Lord, send me back again\n",
        "TRANSLATION_4": "Until, when death comes to one* of them, he says, “O my Lord, send me back!” (The disbelievers)\n",
        "TRANSLATION_5": "Until, when death comes to one of them, he says: \"My Lord! Send me back,\"\n",
        "TRANSLATION_6": "Until when death overtakes one of them, he says: Send me back, my Lord, send me back;\n",
        "TRANSLATION_7": "Till, when death comes to one of them, he says, 'My Lord, return me;\n",
        "TRANSLATION_8": "Until, when death cometh unto one of them, he saith: My Lord! Send me back,\n",
        "TRANSLATION_9": "When death comes to any of them, he says, \"My Lord, send me back\n",
        "TRANSLATION_10": "lt ceaseth not until when death cometh to one of them, and he saith: my Lord! send me back.\n",
        "TRANSLATION_11": "When death comes to one of them, he says, ‘My Lord! Take me back,\n",
        "TRANSLATION_12": "(In Falsehood will they be) Until, when death comes to one of them, he says: \"O my Lord! send me back (to life),-\n",
        "TRANSLATION_13": "Until, when death comes to one of them (those who join partners with Allah), he says: \"My Lord! Send me back,\n",
        "TRANSLATION_14": "Until, when death comes to one of them he says: 'My Lord, let me go back,\n",
        "TRANSLATION_15": "Until, when death comes to one of them, he says, “My Lord, send me back.\n",
        "TRANSLATION_16": "[For such is the state of the disbelievers], until, when death comes to one of them, he says, \"My Lord, send me back\n",
        "TRANSLATION_17": "[23:99] Until (hattā is for inceptiveness) when death comes to one of them, and he sees his place in the Fire and his [would-be] place in Paradise, had he been a believer, he says, ‘My Lord! Send me back (arji‘ūn, the plural [person] is [used] to indicate the gravity [of the plea]),\n",
        "TRANSLATION_18": "(Until, when death) the angels of death and his helpers (cometh unto one of them) i.e. the disbelievers of Mecca, (he saith: My Lord! Send me back) to the life of the world,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "23:99",
            "6:61",
            "63:10",
            "32:11",
            "4:18",
            "2:180",
            "72:20",
            "72:2",
            "37:100",
            "38:35"
        ],
        "BIBLE": [
            "prophets:judges:13:8",
            "writings:job:1:21",
            "writings:i%20chronicles:21:11",
            "prophets:ii%20kings:2:9",
            "prophets:ii%20kings:9:17",
            "prophets:ii%20kings:2:16",
            "torah:deuteronomy:20:7",
            "writings:psalms:71:1",
            "torah:genesis:18:31",
            "torah:genesis:20:3"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:8",
            "Sefer%20Yetzirah:3:6",
            "Sefer%20Yetzirah:3:5"
        ]
    }
}