{
    "VERSE": "42:11",
    "ARABIC": "فَاطِرُ ٱلسَّمَٰوَٰتِ وَٱلْأَرْضِ جَعَلَ لَكُم مِّنْ أَنفُسِكُمْ أَزْوَٰجًا وَمِنَ ٱلْأَنْعَٰمِ أَزْوَٰجًا يَذْرَؤُكُمْ فِيهِ لَيْسَ كَمِثْلِهِۦ شَىْءٌ وَهُوَ ٱلسَّمِيعُ ٱلْبَصِيرُ",
    "ENGLISH": {
        "TRANSLATION_0": "the Bringer into Being of the heavens and the earth: He has given you mates from among yourselves, and given mates to the livestock, in that way multiplying you. Nothing is like Him. He is the All-Hearing, the All- Seeing.",
        "TRANSLATION_1": "Originator of the heavens and the earth, He has made your consorts from among you, and made pairs of cattle. He multiplies you in this way. There is no other like Him. He is all-hearing and all-seeing.\n",
        "TRANSLATION_2": "The Originator of the heavens and the earth, He has appointed for you pairs of your own kind, and pairs also of cattle. Thus does He multiply you. Naught in the universe is like Him. He is All-Hearing, All-Seeing.\n",
        "TRANSLATION_3": "He is the Originator of the heavens and the earth. He has made you and the cattle in pairs and has multiplied you by His creation. There is certainly nothing like Him. He is All-hearing and All-aware.\n",
        "TRANSLATION_4": "The Maker of the heavens and the earth; He has created pairs for you from yourselves and pairs from the animals; He spreads your generation; nothing is like Him; and He only is the All Hearing, the All Seeing.\n",
        "TRANSLATION_5": "The Creator of the heavens and the earth. He has made for you mates from yourselves, and for the cattle (also) mates. By this means He creates you. There is nothing like Him, and He is the All-Hearer, the All-Seer.\n",
        "TRANSLATION_6": "The Originator of the heavens and the earth; He made mates for you from among yourselves, and mates of the cattle too, multiplying you thereby; nothing like a likeness of Him; and He is the Hearing, the Seeing.\n",
        "TRANSLATION_7": "The Originator of the heavens and the earth; He has appointed for you, of yourselves, pairs, and pairs also of the cattle, therein multiplying you. Like Him there is naught; He is the All-hearing, the All-seeing.\n",
        "TRANSLATION_8": "The Creator of the heavens and the earth. He hath made for you pairs of yourselves, and of the cattle also pairs, whereby He multiplieth you. Naught is as His likeness; and He is the Hearer, the Seer.\n",
        "TRANSLATION_9": "Creator of the Heavens and the Earth, He has made spouses for you from among yourselves, as well as pairs of livestock by means of which He multiplies His creatures. Nothing can be compared with Him! He is the All Hearing, the All Seeing.\n",
        "TRANSLATION_10": "The Creator of the heavens and the earth: He hath made for you mates of yourselves, and of the cattle also mates, whereby He diffuseth you. Not like Unto Him is aught, and He is the Hearer, the Beholder!\n",
        "TRANSLATION_11": "The originator of the heavens and the earth, He made for you mates from your own selves, and mates of the cattle, by which means He multiplies you. Nothing is like Him, and He is the All-hearing, the All-seeing.\n",
        "TRANSLATION_12": "(He is) the Creator of the heavens and the earth: He has made for you pairs from among yourselves, and pairs among cattle: by this means does He multiply you: there is nothing whatever like unto Him, and He is the One that hears and sees (all things).\n",
        "TRANSLATION_13": "The Creator of the heavens and the earth. He has made for you mates from yourselves, and for the cattle (also) mates. By this means He creates you (in the wombs). There is nothing like unto Him, and He is the All-Hearer, the All-Seer.\n",
        "TRANSLATION_14": "The Originator of the heavens and the earth, He has given you from yourselves, pairs, and also pairs of cattle, thereby multiplying you. There is nothing like Him. He is the Hearer, the Seer.\n",
        "TRANSLATION_15": "Originator of the heavens and the earth. He made for you mates from among yourselves, and pairs of animals, by means of which He multiplies you. There is nothing like Him. He is the Hearing, the Seeing.\n",
        "TRANSLATION_16": "[He is] Creator of the heavens and the earth. He has made for you from yourselves, mates, and among the cattle, mates; He multiplies you thereby. There is nothing like unto Him, and He is the Hearing, the Seeing.\n",
        "TRANSLATION_17": "[42:11] The Originator of the heavens and the earth, the One Who created them [without precedent]. He has made for you, from your own selves, pairs, when He created Eve from Adam’s rib, and [also] pairs, males and females, of the cattle: He multiplies you (read yadhra’ukum) by such [means], by the mentioned ‘making’, that is to say, He multiplies you through this [means] by way of propagation (the [suffixed] pronoun [-kum in yadhra’ukum, ‘He multiplies you’] refers to both human beings and cattle, but predominantly [to humans]). There is nothing like Him (ka-mithlihi: the kāf is extra, as there is no likeness of Him, exalted be He). He is the Hearer, of what is said, the Seer, of what is done.\n",
        "TRANSLATION_18": "The Creator of the heavens and the earth. He hath made for you pairs) males and females (of yourselves) a human being like yourselves, (and of the cattle also pairs) males and females, (whereby He multiplieth you) He creates you in the wombs; it is also said that this means: He multiplies you through marriage. (Naught is as His likeness) in attribute, knowledge, power and providence; (and He is the Hearer) of what you say, (the Seer) of your works.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "42:11",
            "21:4",
            "3:5",
            "2:284",
            "49:18",
            "36:36",
            "26:183",
            "58:1",
            "17:44",
            "16:73"
        ],
        "BIBLE": [
            "torah:genesis:1:30",
            "writings:ecclesiastes:1:13",
            "writings:psalms:115:16",
            "writings:proverbs:8:29",
            "prophets:jeremiah:10:13",
            "prophets:ezekiel:16:34",
            "prophets:jeremiah:51:16",
            "torah:numbers:18:19",
            "torah:numbers:18:8",
            "prophets:jeremiah:35:15"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:4:4"
        ]
    }
}