{
    "VERSE": "42:13",
    "ARABIC": "شَرَعَ لَكُم مِّنَ ٱلدِّينِ مَا وَصَّىٰ بِهِۦ نُوحًا وَٱلَّذِىٓ أَوْحَيْنَآ إِلَيْكَ وَمَا وَصَّيْنَا بِهِۦٓ إِبْرَٰهِيمَ وَمُوسَىٰ وَعِيسَىٰٓ أَنْ أَقِيمُوا۟ ٱلدِّينَ وَلَا تَتَفَرَّقُوا۟ فِيهِ كَبُرَ عَلَى ٱلْمُشْرِكِينَ مَا تَدْعُوهُمْ إِلَيْهِ ٱللَّهُ يَجْتَبِىٓ إِلَيْهِ مَن يَشَآءُ وَيَهْدِىٓ إِلَيْهِ مَن يُنِيبُ",
    "ENGLISH": {
        "TRANSLATION_0": "He has laid down the same deen for you as He enjoined on Nuh: that which We have revealed to you and which We enjoined on Ibrahim, Musa and 'Isa: 'Establish the deen and do not make divisions in it.' What you call the idolaters to follow is very hard for them. Allah chooses for Himself anyone He wills and guides to Himself those who turn to Him.",
        "TRANSLATION_1": "He has laid down for you the (same) way of life and belief which He had commended to Noah, and which We have enjoined on you, and which We had bequeathed to Abraham, Moses and Jesus, so that they should maintain the order and not be divided among themselves. Heavy is to idolaters what you invite them to. God chooses whom He please for Himself, and guides to Himself whoever turns to Him.\n",
        "TRANSLATION_2": "He has prescribed for you the religion which He enjoined upon Noah and which We revealed to you (O Muhammad), and which We enjoined upon Abraham and Moses and Jesus, commanding: “Establish this religion and do not split up regarding it.” What you are calling to is very hard upon those who associate others with Allah in His Divinity. Allah chooses for Himself whomsoever He pleases and guides to Himself whoever penitently turns to Him.\n",
        "TRANSLATION_3": "He has plainly clarified the religion which is revealed to you and that which Noah, Abraham, Moses, and Jesus were commanded to follow (He has explained it) so that you would be steadfast and united in your religion. What you call the pagans to is extremely grave for them. God attracts to (the religion) whomever He wants and guides to it whoever turns to Him in repentance.\n",
        "TRANSLATION_4": "He has kept for you the same path of religion which He commanded Nooh, and what We divinely reveal to you (O dear Prophet Mohammed – peace and blessings be upon him), and what We had commanded to Ibrahim and Moosa and Eisa that, “Keep the religion proper, and do not create divisions in it”; the polytheists find the matter what you call them to as intolerable; Allah chooses for His proximity whomever He wills, and guides towards Himself whoever inclines (towards Him).\n",
        "TRANSLATION_5": "He (Allah) has ordained for you the same religion which He ordained for Nuh, and that which We have revealed to you, and that which We ordained for Ibrahim, Musa and `Isa saying you should establish religion and make no divisions in it. Intolerable for the idolators is that to which you call them. Allah chooses for Himself whom He wills, and guides unto Himself who turns to Him in repentance.\n",
        "TRANSLATION_6": "He has made plain to you of the religion what He enjoined upon Nuh and that which We have revealed to you and that which We enjoined upon Ibrahim and Musa and Isa that keep to obedience and be not divided therein; hard to the unbelievers is that which you call them to; Allah chooses for Himself whom He pleases, and guides to Himself him who turns (to Him), frequently.\n",
        "TRANSLATION_7": "He has laid down for you as religion that He charged Noah with, and that We have revealed to thee, and that We charged Abraham with, Moses and Jesus: 'Perform the religion, and scatter not regarding it. Very hateful is that for the idolaters, that thou callest them to. God chooses unto Himself whomsoever He will, and He guides to Himself whosoever turns, penitent.\n",
        "TRANSLATION_8": "He hath ordained for you that religion which He commended unto Noah, and that which We inspire in thee (Muhammad), and that which We commended unto Abraham and Moses and Jesus, saying: Establish the religion, and be not divided therein. Dreadful for the idolaters is that unto which thou callest them. Allah chooseth for Himself whom He will, and guideth unto Himself him who turneth (toward Him).\n",
        "TRANSLATION_9": "God has ordained for you the same religion which He enjoined on Noah, and which We have revealed to you, and which We enjoined upon Abraham and Moses and Jesus, so that you should remain steadfast in religion and not become divided in it. What you call upon the polytheists to do is hard for them; God chooses for Himself whoever He pleases and guides towards Himself those who turn to Him.\n",
        "TRANSLATION_10": "He hath instituted for you in religion that which He had enjoined upon Nuh, and which We have revealed Unto thee, and which We had enjoined upon Ibrahim and Musa and Isa, saying: establish the religion, and be not divided therein. Grievous Unto the associaters is that Unto which thou callest them. Allah chooseth for Himself whomsoever He will and guideth Unto Himself whomsoever turneth in penitence.\n",
        "TRANSLATION_11": "He has prescribed for you the religion which He had enjoined upon Noah and which We have [also] revealed to you, and which We had enjoined upon Abraham, Moses and Jesus, declaring, ‘Maintain the religion, and do not be divided in it.’ Hard on the polytheists is that to which you summon them. Allah chooses for it whomever He wishes, and He guides to it whomever returns penitently [to Him].\n",
        "TRANSLATION_12": "The same religion has He established for you as that which He enjoined on Noah - the which We have sent by inspiration to thee - and that which We enjoined on Abraham, Moses, and Jesus: Namely, that ye should remain steadfast in religion, and make no divisions therein: to those who worship other things than Allah, hard is the (way) to which thou callest them. Allah chooses to Himself those whom He pleases, and guides to Himself those who turn (to Him).\n",
        "TRANSLATION_13": "He (Allah) has ordained for you the same religion (Islam) which He ordained for Nuh (Noah), and that which We have inspired in you (O Muhammad SAW), and that which We ordained for Ibrahim (Abraham), Musa (Moses) and 'Iesa (Jesus) saying you should establish religion (i.e. to do what it orders you to do practically), and make no divisions in it (religion) (i.e. various sects in religion). Intolerable for the Mushrikun, is that to which you (O Muhammad SAW) call them. Allah chooses for Himself whom He wills, and guides unto Himself who turns to Him in repentance and in obedience.\n",
        "TRANSLATION_14": "He has made plain for you the Religion with which He charged Noah and that which We have revealed to you, and that with which We charged (Prophets) Abraham, Moses and Jesus, (saying): 'Establish the Religion and do not be divided therein' That which you invite them to is too overwhelming for the idolaters. Allah brings close to Himself whom He will, and guides to Him those who turn in repentance.\n",
        "TRANSLATION_15": "He prescribed for you the same religion He enjoined upon Noah, and what We inspired to you, and what We enjoined upon Abraham, and Moses, and Jesus: “You shall uphold the religion, and be not divided therein.” As for the idolaters, what you call them to is outrageous to them. God chooses to Himself whom He wills, and He guides to Himself whoever repents.\n",
        "TRANSLATION_16": "He has ordained for you of religion what He enjoined upon Noah and that which We have revealed to you, [O Muhammad], and what We enjoined upon Abraham and Moses and Jesus - to establish the religion and not be divided therein. Difficult for those who associate others with Allah is that to which you invite them. Allah chooses for Himself whom He wills and guides to Himself whoever turns back [to Him].\n",
        "TRANSLATION_17": "[42:13] He has prescribed for you as a religion that which He enjoined upon Noah — for he was the first of the prophets [sent] with a [Divine] Law — and that which We have revealed to you, and that which We enjoined upon Abraham, and Moses, and Jesus [declaring], ‘Establish religion and do not be divided in it’: this is what has been prescribed and enjoined upon [those mentioned above], and what has been revealed to Muhammad (s), and it is the affirmation of [God’s] Oneness. Dreadful is for the idolaters that to which you summon them, in the way of affirming the Oneness [of God]. God chooses for it, for the [task of] affirming [His] Oneness, whomever He will, and He guides to it whomever turns penitently, [whomever] applies himself to obedience of Him.\n",
        "TRANSLATION_18": "(He hath ordained for you) He has chosen for you, community of Muhammad (pbuh) (that religion) the religion of Islam (which He commended unto Noah) that which We revealed to Noah and commanded him to invite people to and to be upright in following it, (and that which We inspire in thee (Muhammad)) in the Qur'an: We commanded you to call people to Islam and be upright in following it, (and that which We commended unto Abraham) and We choose Abraham for Islam and commanded him to call people to it and be upright in following it (and Moses and Jesus) likewise, (saying: Establish the religion) Allah commanded all the prophets to establish Religion and to be in agreement about Religion, (and be not divided therein) do not disagree regarding Religion. (Dreadful for the idolaters) Abu Jahl and his host (is that unto which thou callest them) of Allah's divine Oneness and the Qur'an. (Allah chooseth for Himself) for His religion (whom He will) this he who is born a Muslim and dies as a Muslim, (and guideth unto Himself him who turneth (towards Him)) and guides to His religion whoever turns to Him of the disbelievers.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "42:13",
            "60:8",
            "60:9",
            "40:14",
            "39:11",
            "9:43",
            "39:14",
            "49:17",
            "6:159",
            "2:136"
        ],
        "BIBLE": [
            "prophets:i%20samuel:28:15",
            "writings:ii%20chronicles:30:5",
            "prophets:i%20kings:2:42",
            "torah:exodus:32:8",
            "prophets:ii%20samuel:3:13",
            "prophets:jeremiah:35:15",
            "prophets:zechariah:1:6",
            "prophets:isaiah:48:15",
            "prophets:isaiah:63:17",
            "torah:exodus:23:13"
        ]
    }
}