{
    "VERSE": "42:16",
    "ARABIC": "وَٱلَّذِينَ يُحَآجُّونَ فِى ٱللَّهِ مِنۢ بَعْدِ مَا ٱسْتُجِيبَ لَهُۥ حُجَّتُهُمْ دَاحِضَةٌ عِندَ رَبِّهِمْ وَعَلَيْهِمْ غَضَبٌ وَلَهُمْ عَذَابٌ شَدِيدٌ",
    "ENGLISH": {
        "TRANSLATION_0": "The argument of those who argue about Allah, once He has been acknowledged, has no basis whatsoever with their Lord. There is anger upon them and they will have a harsh punishment.",
        "TRANSLATION_1": "As for those who argue in the matter of God after He has been fully acknowledged, their disputing has no force with their Lord. Upon them is (God's) anger, and the punishment for them will be severe.\n",
        "TRANSLATION_2": "Those who contend concerning Allah (after His call has been responded to), their contention is absolutely void in the sight of their Lord. Allah's wrath is upon them and a grievous chastisement awaits them.\n",
        "TRANSLATION_3": "The disputes of those who quarrel about God, after pledging obedience to Him, will be void in the eyes of their Lord. Such people will be subject to His wrath and will suffer a severe torment.\n",
        "TRANSLATION_4": "And those who fight regarding Allah after the Muslims have accepted His call, their reasoning does not hold at all before their Lord, and upon them is wrath, and for them is a severe punishment.\n",
        "TRANSLATION_5": "And those who dispute concerning Allah, after it has been accepted, of no use is their dispute before their Lord and on them is wrath, and for them will be a severe torment.\n",
        "TRANSLATION_6": "And (as for) those who dispute about Allah after that obedience has been rendered to Him, their plea is null with their Lord, and upon them is wrath, and for them is severe punishment.\n",
        "TRANSLATION_7": "And those who argue concerning God after that answer has been made to Him, their argument is null and void in the sight of their Lord; anger shall rest upon them, and there awaits them a terrible chastisement.\n",
        "TRANSLATION_8": "And those who argue concerning Allah after He hath been acknowledged, their argument hath no weight with their Lord, and wrath is upon them and theirs will be an awful doom.\n",
        "TRANSLATION_9": "As for those who argue about God after He has been accepted, their arguments will carry no weight with their Lord, and His wrath will fall upon them. Severe punishment awaits them.\n",
        "TRANSLATION_10": "And those who contend respecting the religion of Allah after it hath been acknowledged, their contention is void in the sight of their Lord, and upon them shall befall wrath, and theirs shall be a severe torment.\n",
        "TRANSLATION_11": "Those who argue concerning Allah, after His call has been answered, their argument stands refuted with their Lord, and upon them shall be [His] wrath, and there is a severe punishment for them.\n",
        "TRANSLATION_12": "But those who dispute concerning Allah after He has been accepted,- futile is their dispute in the Sight of their Lord: on them will be a Penalty terrible.\n",
        "TRANSLATION_13": "And those who dispute concerning Allah (His Religion of Islamic Monotheism, with which Muhammad SAW has been sent), after it has been accepted (by the people), of no use is their dispute before their Lord, and on them is wrath, and for them will be a severe torment.\n",
        "TRANSLATION_14": "As for those who argue concerning Allah after being answered, their arguments will be annulled before their Lord, and His Wrath will fall upon them, and for them there is a terrible punishment.\n",
        "TRANSLATION_15": "As for those who dispute about God after having answered His call, their argument is invalid with their Lord; and upon them falls wrath; and a grievous torment awaits them.\n",
        "TRANSLATION_16": "And those who argue concerning Allah after He has been responded to - their argument is invalid with their Lord, and upon them is [His] wrath, and for them is a severe punishment.\n",
        "TRANSLATION_17": "[42:16] And those who argue, with the Prophet, concerning, the religion of, God after His call has been answered, through faith, on account of His miracle having been manifested — and they are the Jews — their argument stands refuted, [is] invalid, with their Lord, and [His] wrath shall be upon them, and there will be a severe chastisement for them.\n",
        "TRANSLATION_18": "Allah then commanded fighting, saying: (And those who argue concerning Allah) i.e. the Jews and Christians (after He hath been acknowledged) in the Scripture; it is also said that this refers to the idolaters after they answered on the day of the covenant, (their argument has no weight) their argument is void (with their Lord, and wrath is upon them and theirs will be an awful doom) the most severe torment.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "42:16",
            "58:15",
            "14:2",
            "2:76",
            "7:164",
            "50:26",
            "29:50",
            "22:47",
            "6:124",
            "70:27"
        ],
        "BIBLE": [
            "prophets:jeremiah:20:4",
            "writings:ii%20chronicles:14:12",
            "prophets:ezekiel:6:9",
            "writings:psalms:5:11",
            "prophets:ii%20kings:18:36",
            "prophets:ezekiel:24:21",
            "prophets:isaiah:49:22",
            "torah:numbers:11:12",
            "prophets:jeremiah:13:17",
            "writings:i%20chronicles:15:2"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:3"
        ]
    }
}