{
    "VERSE": "42:19",
    "ARABIC": "ٱللَّهُ لَطِيفٌۢ بِعِبَادِهِۦ يَرْزُقُ مَن يَشَآءُ وَهُوَ ٱلْقَوِىُّ ٱلْعَزِيزُ",
    "ENGLISH": {
        "TRANSLATION_0": "Allah is very gentle with His slaves. He provides for anyone He wills. He is the Most Strong, the Almighty.",
        "TRANSLATION_1": "God is gracious to His creatures, and bestows favours on whosoever He will. He is all-powerful and all-mighty.\n",
        "TRANSLATION_2": "Allah is Most Gentle to His servants and grants sustenance to whomsoever He pleases. He is All-Strong, Most Mighty.\n",
        "TRANSLATION_3": "God is kind to His servants. He gives sustenance to whomever He wants. He is All-powerful and Majestic.\n",
        "TRANSLATION_4": "Allah is Benevolent upon His bondmen – He bestows sustenance to whomever He wills; and He only is the All Powerful, the Most Honourable.\n",
        "TRANSLATION_5": "Allah is very Gracious and Kind to His servants. He gives provisions to whom He wills. And He is the All-Strong, the Almighty.\n",
        "TRANSLATION_6": "Allah is Benignant to His servants; He gives sustenance to whom He pleases, and He is the Strong, the Mighty.\n",
        "TRANSLATION_7": "God is All-gentle to His servants, providing for whomsoever He will. He is the All-strong, the All-mighty.\n",
        "TRANSLATION_8": "Allah is gracious unto His slaves. He provideth for whom He will. And He is the Strong, the Mighty.\n",
        "TRANSLATION_9": "God is most Gracious to His creatures: He provides sustenance for whoever He wills -- for He alone is the Powerful One, the Almighty.\n",
        "TRANSLATION_10": "Allah is Gentle Unto His bondmen: He provideth for whomsoever He will, and He is the Strong, the Mighty.\n",
        "TRANSLATION_11": "Allah is all-attentive to His servants. He provides for whomever He wishes, and He is the All-strong, the All-mighty.\n",
        "TRANSLATION_12": "Gracious is Allah to His servants: He gives Sustenance to whom He pleases: and He has power and can carry out His Will.\n",
        "TRANSLATION_13": "Allah is very Gracious and Kind to His slaves. He gives provisions to whom He wills. And He is the All-Strong, the All-Mighty.\n",
        "TRANSLATION_14": "Allah is Subtle towards His worshipers, and provides for whosoever He will. He is the Strong, the Almighty.\n",
        "TRANSLATION_15": "God is kind towards His worshipers. He provides for whomever He wills. He is the Powerful, the Honorable.\n",
        "TRANSLATION_16": "Allah is Subtle with His servants; He gives provisions to whom He wills. And He is the Powerful, the Exalted in Might.\n",
        "TRANSLATION_17": "[42:19] God is Gracious to His servants, both the pious and the profligate, for He does not destroy them through hunger, despite their acts of disobedience. He provides for whomever He will, from among each of the two [classes of individuals] whatever He will. And He is the Strong, in [effecting] what He wants, the Mighty, Whose way [always] prevails.\n",
        "TRANSLATION_18": "(Allah is gracious unto His slaves) the pious as well as the sinful; it is also said that this means: His knowledge is gracious with His slaves, both the pious and sinful among them. (He provideth for whom He will) He expands the wealth of whomever He will. (And He is the Strong) in providing the sustenance of the slaves, (the Mighty) in retribution against those who do not believe.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "42:19",
            "33:25",
            "58:21",
            "37:169",
            "2:207",
            "29:62",
            "30:5",
            "37:160",
            "37:128",
            "37:74"
        ],
        "BIBLE": [
            "writings:ii%20chronicles:32:29",
            "writings:psalms:86:16",
            "writings:daniel:2:37",
            "writings:ecclesiastes:5:18",
            "writings:psalms:111:5",
            "prophets:joshua:1:15",
            "writings:esther:2:18",
            "torah:exodus:11:3",
            "writings:daniel:2:23",
            "prophets:i%20samuel:22:14"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:6",
            
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:5:4"
        ]
    }
}