{
    "VERSE": "42:2",
    "ARABIC": "عٓسٓقٓ",
    "ENGLISH": {
        "TRANSLATION_0": "'Ayn Sin Qaf",
        "TRANSLATION_1": "Am Sin Qaf.\n",
        "TRANSLATION_2": "Ayn. Sin. Qaf.\n",
        "TRANSLATION_3": "Ayn. Sin. Qaf.\n",
        "TRANSLATION_4": "A’in-Seen-Qaf. (Alphabets of the Arabic language – Allah, and to whomever He reveals, know their precise meanings.)\n",
        "TRANSLATION_5": "`Ain Sin Qaf.\n",
        "TRANSLATION_6": "Ain Sin Qaf.\n",
        "TRANSLATION_7": "Ain Sin Qaf\n",
        "TRANSLATION_8": "A'in. Sin. Qaf.\n",
        "TRANSLATION_9": "Ayn Sin Qaf.\n",
        "TRANSLATION_10": "Ain. Sin. Qaf.\n",
        "TRANSLATION_11": "‘Ayn, Seen, Qaf.\n",
        "TRANSLATION_12": "Ain. Sin. Qaf.\n",
        "TRANSLATION_13": "Ain-Sin-Qaf. [These letters are one of the miracles of the Quran, and none but Allah (Alone) knows their meanings].\n",
        "TRANSLATION_14": "AeenSeenQaaf\n",
        "TRANSLATION_15": "Ayn, Seen, Qaf.\n",
        "TRANSLATION_16": "Ayn, Seen, Qaf.\n",
        "TRANSLATION_17": "[42:2] ‘ayn sīn qāf: God knows best what He means by these [letters].\n",
        "TRANSLATION_18": "And from his narration on the authority of Ibn 'Abbas that he said regarding the interpretation of Allah's saying: (Ha. Mim. 'Ayn. Sin. Qaf.): '(Ha. Mim. 'Ayn. Sin. Qaf.) this is an expression of praise by which Allah is praising Himself. He says: the (Ha) stands for His clemency (hilmuhu), the (Mim) stand for His sovereignty (mulkuhu), the ('Ayn) stands for His knowledge ('ilmuhu), the (Sin) stands for His majesty (sana'uhu), and the (Qaf) stands for his power (quwwatuhu) over His created beings; it is also said that the (Ha) stands for war (harb) that will ever be, the (Mim) stand for the transformation of every sovereignty (mulk) that will ever be, the ('Ayn) stands for every promise (wa'd) that will ever be made, the (Sin) stands for years (sinun) like the hard years of Joseph, and the (Qaf) stands for his slander (qadhf) that will ever be made; and it is also said that it is an oath sworn by Allah that He will not punish eternally in the Fire anyone who sincerely says: \"there is no deity but Allah\", and meets Allah believing in it.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "36:1",
            "20:1",
            "32:1",
            "3:1",
            "42:2",
            "42:1",
            "29:1",
            "31:1",
            "28:1",
            "40:1"
        ],
        "BIBLE": [
            "torah:leviticus:5:1",
            "torah:exodus:23:9",
            "prophets:ii%20kings:10:2",
            "torah:exodus:3:7",
            "writings:psalms:25:18",
            "writings:job:21:22",
            "writings:psalms:51:5",
            "writings:daniel:2:47",
            "torah:numbers:18:32",
            "prophets:judges:17:13"
        ]
    }
}