{
    "VERSE": "42:20",
    "ARABIC": "مَن كَانَ يُرِيدُ حَرْثَ ٱلْءَاخِرَةِ نَزِدْ لَهُۥ فِى حَرْثِهِۦ وَمَن كَانَ يُرِيدُ حَرْثَ ٱلدُّنْيَا نُؤْتِهِۦ مِنْهَا وَمَا لَهُۥ فِى ٱلْءَاخِرَةِ مِن نَّصِيبٍ",
    "ENGLISH": {
        "TRANSLATION_0": "If anyone desires to cultivate the Next World, We will increase him in his cultivation. If anyone desires to cultivate this world, We will give him some of it but he will have no share in the Next World.",
        "TRANSLATION_1": "Whoever desires the fruits of the Hereafter, We shall add to his fruit. As for him who desires the fruits of this world, We shall give to him of these, but he will have no share in the Hereafter.\n",
        "TRANSLATION_2": "Whoever seeks the harvest of the Hereafter, We shall increase for him his harvest, and whoever seeks the harvest of this world, We shall give him thereof; but he will have no share in the Hereafter.\n",
        "TRANSLATION_3": "We shall increase the harvest of those who seek a good harvest in the life hereafter. However, those who want to have their harvest in this life will be given it but will have no share in the hereafter.\n",
        "TRANSLATION_4": "Whoever aspires for the yield of the Hereafter – We increase its yield for him; and whoever aspires for the yield of this world – We give him part of it, and he has no portion in the Hereafter.\n",
        "TRANSLATION_5": "Whosoever desires the reward of the Hereafter, We give him increase in his reward, and whosoever desires the reward of this world, We give him thereof, and he has no portion in the Hereafter.\n",
        "TRANSLATION_6": "Whoever desires the gain of the hereafter, We will give him more of that gain; and whoever desires the gain of this world, We give him of it, and in the hereafter he has no portion.\n",
        "TRANSLATION_7": "Whoso desires the tillage of the world to come, We shall give him increase in his tillage; and whoso desires the tillage of this world, We shall give him of it, but in the world to come he will have no share.\n",
        "TRANSLATION_8": "Whoso desireth the harvest of the Hereafter, We give him increase in its harvest. And whoso desireth the harvest of the world, We give him thereof, and he hath no portion in the Hereafter.\n",
        "TRANSLATION_9": "To him who desires a harvest in the life to come, We shall grant an increase in his harvest; whereas to him who desires [but] a harvest in this world, We [may] give something thereof -- but he will have no share in [the blessings of] the life to come.\n",
        "TRANSLATION_10": "Whosoever seeketh the tillage of the Hereafter Unto him We shall give increase in his tillage; and whosoever seeketh the tillage of the world We shall give him somewhat thereof, and in the Hereafter his shall be no portion.\n",
        "TRANSLATION_11": "Whoever desires the tillage of the Hereafter, We will enhance for him his tillage, and whoever desires the tillage of the world, We will give it to him, but he will have no share in the Hereafter.\n",
        "TRANSLATION_12": "To any that desires the tilth of the Hereafter, We give increase in his tilth, and to any that desires the tilth of this world, We grant somewhat thereof, but he has no share or lot in the Hereafter.\n",
        "TRANSLATION_13": "Whosoever desires (with his deeds) the reward of the Hereafter, We give him increase in his reward, and whosoever desires the reward of this world (with his deeds), We give him thereof (what is written for him), and he has no portion in the Hereafter.\n",
        "TRANSLATION_14": "Whoever hopes for the tillage of the Everlasting Life, We will increase his tillage; and whoever hopes for the tillage of this world, We give him some of it, but in the Everlasting Life he shall have no share.\n",
        "TRANSLATION_15": "Whoever desires the harvest of the Hereafter, We increase for him his harvest; and whoever desires the harvest of this world, We give him thereof, and he has no share of the Hereafter.\n",
        "TRANSLATION_16": "Whoever desires the harvest of the Hereafter - We increase for him in his harvest. And whoever desires the harvest of this world - We give him thereof, but there is not for him in the Hereafter any share.\n",
        "TRANSLATION_17": "[42:20] And whoever desires, in return for his actions, the harvest of the Hereafter, in other words, its gains, and that is reward, We will enhance for him his harvest, by multiplying in it the good deed up tenfold or more; and whoever desires the harvest of this world, We will give him of it, without multiplying [any of it], [giving him] only what is his [preordained] share; but in the Hereafter he will have no share.\n",
        "TRANSLATION_18": "(Whoso desireth the harvest of the Hereafter) the reward of the Hereafter through his works for Allah, (We give him increase in its harvest) We give him increase in his reward; it is also said: We give him increase in his strength, activity and reward in the Hereafter. (And Whoso desireth the harvest of the world) and whoever desires the reward of the life of the world through the works that Allah has made obligatory upon him, (We give him thereof) We give him of the life of the world and drive away from him some of its hardship, (and he hath no portion) he has no reward (in the Hereafter) in Paradise because he did not work for Allah.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "42:20",
            "30:7",
            "3:22",
            "16:122",
            "41:31",
            "28:77",
            "14:27",
            "24:23",
            "3:56",
            "11:16"
        ],
        "BIBLE": [
            "torah:deuteronomy:14:29",
            "prophets:jeremiah:45:5",
            "writings:psalms:17:14",
            "torah:genesis:15:1",
            "writings:esther:1:19",
            "writings:psalms:34:13",
            "writings:psalms:102:19",
            "writings:psalms:133:3",
            "prophets:jeremiah:34:20",
            "prophets:ezekiel:47:9"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:3:6"
        ]
    }
}