{
    "VERSE": "42:22",
    "ARABIC": "تَرَى ٱلظَّٰلِمِينَ مُشْفِقِينَ مِمَّا كَسَبُوا۟ وَهُوَ وَاقِعٌۢ بِهِمْ وَٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّٰلِحَٰتِ فِى رَوْضَاتِ ٱلْجَنَّاتِ لَهُم مَّا يَشَآءُونَ عِندَ رَبِّهِمْ ذَٰلِكَ هُوَ ٱلْفَضْلُ ٱلْكَبِيرُ",
    "ENGLISH": {
        "TRANSLATION_0": "You will see the wrongdoers afraid of what they have earned, when it is about to land right on top of them, whereas those who have iman and do right actions will be in the lush Meadows of the Gardens. They will have whatever they wish for with their Lord. That is the great favour.",
        "TRANSLATION_1": "You will see the evil-doers full of fear of what they deserve, yet it will come to pass. But those who believe and do the right will be in gardens of Paradise. They will receive what they wish from their Lord; and this will be the greatest favour.\n",
        "TRANSLATION_2": "You will see the wrongdoers fearful of the consequence of their deeds which will certainly overtake them. But those who have faith and do good deeds will be in the meadows of the Gardens, wherein they shall have whatever they desire from their Lord; that is the great Bounty.\n",
        "TRANSLATION_3": "You can see that the unjust are afraid of the consequences of their deeds which will inevitably strike them. However, the righteously striving believers will live in the gardens wherein they will have whatever they want from their Lord. This is certainly the greatest reward.\n",
        "TRANSLATION_4": "You will see the unjust getting terrified of their own deeds, and (evil of) their deeds will certainly befall them; and (that) those who accepted faith and performed good deeds are in blossoming Gardens of Paradise; for them is whatever they wish from their Lord; this only is the great munificence (of Allah).\n",
        "TRANSLATION_5": "You will see the wrongdoers fearful of that which they have earned, and it will surely befall them. But those who believe and do righteous deeds (will be) in the flowering meadows of the Gardens. They shall have whatsoever they desire with their Lord. That is the supreme grace.\n",
        "TRANSLATION_6": "You will see the unjust fearing on account of what they have earned, and it must befall them; and those who believe and do good shall be in the meadows of the gardens; they shall have what they please with their Lord: that is the great grace.\n",
        "TRANSLATION_7": "Thou seest the evildoers going in fear of that they have earned, that is about to fall on them; but those who believe and do righteous deeds are in Meadows of the Gardens; whatsoever they will they shall have with their Lord; that is the great bounty.\n",
        "TRANSLATION_8": "Thou seest the wrong-doers fearful of that which they have earned, and it will surely befall them, while those who believe and do good works (will be) in flowering meadows of the Gardens, having what they wish from their Lord. This is the great preferment.\n",
        "TRANSLATION_9": "You will see the wrongdoers fearful of the consequences of their deeds, which will be inescapable. Whereas, those who have believed and done righteous deeds, will be in the meadows of the Garden and shall have whatever they desire from their Lord. That will be the supreme favour.\n",
        "TRANSLATION_10": "Thou shalt see the wrong-doers fearful on account of that which they have earned, and it is sure to befall them. And those who believe and work righteous works will be in meadows of the Gardens theirs will be whatsoever they list, in the presence of their Lord. That! that is the supreme grace.\n",
        "TRANSLATION_11": "When it is about to befall them, You will see the wrongdoers fearful because of what they have earned; but those who have faith and do righteous deeds will be in the gardens of paradise: they will have whatever they wish near their Lord. That is the mighty grace.\n",
        "TRANSLATION_12": "Thou wilt see the Wrong-doers in fear on account of what they have earned, and (the burden of) that must (necessarily) fall on them. But those who believe and work righteous deeds will be in the luxuriant meads of the Gardens: they shall have, before their Lord, all that they wish for. That will indeed be the magnificent Bounty (of Allah).\n",
        "TRANSLATION_13": "You will see (on the Day of Resurrection), the Zalimun (polytheists and wrong-doers, etc.) fearful of that which they have earned, and it (Allah's Torment) will surely befall them, while those who believe (in the Oneness of Allah Islamic Monotheism) and do righteous deeds (will be) in the flowering meadows of the Gardens (Paradise), having what they wish from their Lord. That is the supreme Grace, (Paradise).\n",
        "TRANSLATION_14": "You shall see the harmdoers in fear of what they have earned as it is about to fall on them. But those who believe and do good deeds shall live in the meadows of the Gardens and from their Lord they will have all that they desire that is the great bounty.\n",
        "TRANSLATION_15": "You will see the unjust terrified of what they have earned, and it will befall them. As for those who believe and do good deeds, they will be in the Meadows of the Gardens; they will have whatever they please in the presence of their Lord; that is the supreme blessing.\n",
        "TRANSLATION_16": "You will see the wrongdoers fearful of what they have earned, and it will [certainly] befall them. And those who have believed and done righteous deeds will be in lush regions of the gardens [in Paradise] having whatever they will in the presence of their Lord. That is what is the great bounty.\n",
        "TRANSLATION_17": "[42:22] You will see the wrongdoers, on the Day of Resurrection, apprehensive because of what they had earned, in this world, in the way of evil deeds, lest they be requited for these; and it, that is, the requital for these [deeds], will surely befall them, on the Day of Resurrection, inevitably; but those who believe and perform righteous deeds will be in the lushest Gardens, in other words, in the best of these [Gardens] in comparison with the other ones. They will have whatever they wish near their Lord; that is the great favour.\n",
        "TRANSLATION_18": "Thou seest the wrong-doers) the disbelievers on the Day of Judgement (fearful of that which they have earned) of that which they have said and done in their state of disbelief, (and it will surely befall them) that which they fear; (while those who believe) in Muhammad (pbuh) and in the Qur'an (and do good works) between them and their Lord, i.e. Abu Bakr and his fellow believers ((will be) in flowering meadows of the Gardens, having what they wish from their Lord) in Paradise. (This) Paradise (is the great preferment) is the great bounty.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "42:22",
            "39:34",
            "33:68",
            "68:34",
            "43:49",
            "33:47",
            "85:11",
            "11:83",
            "6:127",
            "51:34"
        ],
        "BIBLE": [
            "prophets:jeremiah:17:24",
            "prophets:joshua:23:14",
            "prophets:i%20samuel:29:6",
            "prophets:isaiah:10:12",
            "prophets:jeremiah:16:10",
            "prophets:jeremiah:3:16",
            "torah:deuteronomy:30:1",
            "prophets:isaiah:14:3",
            "torah:deuteronomy:28:15",
            "torah:deuteronomy:28:63"
        ]
    }
}