{
    "VERSE": "42:25",
    "ARABIC": "وَهُوَ ٱلَّذِى يَقْبَلُ ٱلتَّوْبَةَ عَنْ عِبَادِهِۦ وَيَعْفُوا۟ عَنِ ٱلسَّيِّـَٔاتِ وَيَعْلَمُ مَا تَفْعَلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "It is He who accepts tawba from His slaves and pardons evil acts and knows what they do.",
        "TRANSLATION_1": "It is He who accepts repentance from His creatures and forgives their trespasses, for He knows what you do.\n",
        "TRANSLATION_2": "He it is Who accepts repentance from His servants and forgives sins and knows all what you do,\n",
        "TRANSLATION_3": "It is He who accepts the repentance of His servants, forgives their evil deeds and knows all about what you do.\n",
        "TRANSLATION_4": "And it is He Who accepts repentance from His bondmen, and pardons sins*, and knows all your deeds. (Repentance for the cardinal sins, while lesser sins are wiped out by good deeds.)\n",
        "TRANSLATION_5": "And He it is Who accepts repentance from His servants, and forgives sins, and He knows what you do.\n",
        "TRANSLATION_6": "And He it is Who accepts repentance from His servants and pardons the evil deeds and He knows what you do;\n",
        "TRANSLATION_7": "It is He who accepts repentance from His servants, and pardons evil deeds; He knows the things you do.\n",
        "TRANSLATION_8": "And He it is Who accepteth repentance from His bondmen, and pardoneth the evil deeds, and knoweth what ye do,\n",
        "TRANSLATION_9": "He accepts repentance from His servants and pardons their sins. He knows everything you do.\n",
        "TRANSLATION_10": "And He it is Who accepteth repentances from His bondmen, and pardoneth the evil deeds and knoweth that which ye do.\n",
        "TRANSLATION_11": "It is He who accepts the repentance of His servants, and excuses their misdeeds and knows what you do.\n",
        "TRANSLATION_12": "He is the One that accepts repentance from His Servants and forgives sins: and He knows all that ye do.\n",
        "TRANSLATION_13": "And He it is Who accepts repentance from His slaves, and forgives sins, and He knows what you do.\n",
        "TRANSLATION_14": "It is He who accepts the repentance of His worshipers and pardons their evil deeds. He has knowledge of what you do.\n",
        "TRANSLATION_15": "It is He who accepts the repentance of His worshipers, and remits the sins, and knows what you do.\n",
        "TRANSLATION_16": "And it is He who accepts repentance from his servants and pardons misdeeds, and He knows what you do.\n",
        "TRANSLATION_17": "[42:25] And He it is Who accepts repentance from His servants, and pardons evil deeds, those from which repentance has been made, and knows what they do (yaf‘alūna, may also be read taf‘alūna, ‘you do’).\n",
        "TRANSLATION_18": "(And He it is Who accepteth repentance from his bondmen, and pardoneth the evil deeds, and knoweth what ye do) of good or evil.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "42:25",
            "39:48",
            "45:33",
            "38:30",
            "29:4",
            "38:17",
            "16:34",
            "7:165",
            "29:7",
            "53:10"
        ],
        "BIBLE": [
            "torah:leviticus:5:17",
            "writings:psalms:119:91",
            "torah:genesis:41:37",
            "writings:i%20chronicles:17:26",
            "writings:job:42:3",
            "prophets:ii%20samuel:14:20",
            "prophets:isaiah:41:23",
            "torah:genesis:24:66",
            "prophets:jeremiah:5:25",
            "writings:proverbs:30:18"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:2",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:1:2"
        ]
    }
}