{
    "VERSE": "42:27",
    "ARABIC": "وَلَوْ بَسَطَ ٱللَّهُ ٱلرِّزْقَ لِعِبَادِهِۦ لَبَغَوْا۟ فِى ٱلْأَرْضِ وَلَٰكِن يُنَزِّلُ بِقَدَرٍ مَّا يَشَآءُ إِنَّهُۥ بِعِبَادِهِۦ خَبِيرٌۢ بَصِيرٌ",
    "ENGLISH": {
        "TRANSLATION_0": "Were Allah to expand the provision of His slaves, they would act as tyrants on the earth. But He sends down whatever He wills in a measured way. He is aware of and He sees His slaves.",
        "TRANSLATION_1": "If God were to give in abundance to His creatures they would fill the earth with oppression. So He gives according to measure as He will. He knows (what is good for) His creatures. He is all-aware and all-seeing.\n",
        "TRANSLATION_2": "If Allah were to grant ample sustenance to His servants they would go about transgressing in the land. But He sends down in due measure whatever (sustenance) He wills. Surely He is Well-Aware and All-Seeing concerning matters that relate to His servants.\n",
        "TRANSLATION_3": "Had God given abundant sustenance to His servants, they would have certainly rebelled on earth, but He sends them a known measure of sustenance as He wills. He is All-aware of His servants and watches over them all.\n",
        "TRANSLATION_4": "And had Allah increased the sustenance for all His slaves, they would have surely caused turmoil in the land, but He sends it down by a proper assessment as He wills; indeed He is Well Aware of, Seeing His bondmen.\n",
        "TRANSLATION_5": "And if Allah were to extend the provision for His servants, they would surely rebel in the earth, but He sends down by measure as He wills. Verily, He is, in respect of His servants, the Well-Aware, the All-Seer.\n",
        "TRANSLATION_6": "And if Allah should amplify the provision for His servants they would certainly revolt in the earth; but He sends it down according to a measure as He pleases; surely He is Aware of, Seeing, His servants.\n",
        "TRANSLATION_7": "Had God expanded His provision to His servants, they would have been insolent in the earth; but He sends down in measure whatsoever He will; surely He is aware of and sees His servants.\n",
        "TRANSLATION_8": "And if Allah were to enlarge the provision for His slaves they would surely rebel in the earth, but He sendeth down by measure as He willeth. Lo! He is Informed, a Seer of His bondmen.\n",
        "TRANSLATION_9": "If God were to grant His abundant provision to [all] His creatures, they would act insolently on earth, but He sends down in due measure whatever He will, for He is well aware of His servants and watchful over them:\n",
        "TRANSLATION_10": "And had Allah expanded the provision for His bondmen they surely would have rebelled in the earth, but He sendeth down by measure as He willeth; verily He is, in respect of His bondmen. Aware and Beholder.\n",
        "TRANSLATION_11": "Were Allah to expand the provision for [all] His servants, they would surely create havoc on the earth. But He sends down in a [precise] measure whatever He wishes. Indeed, He is all-aware, all-seeing about His servants.\n",
        "TRANSLATION_12": "If Allah were to enlarge the provision for His Servants, they would indeed transgress beyond all bounds through the earth; but he sends (it) down in due measure as He pleases. For He is with His Servants Well-acquainted, Watchful.\n",
        "TRANSLATION_13": "And if Allah were to enlarge the provision for His slaves, they would surely rebel in the earth, but He sends down by measure as He wills. Verily! He is in respect of His slaves, the Well-Aware, the All-Seer (of things that benefit them).\n",
        "TRANSLATION_14": "If Allah had expanded His provision to His worshipers, they would become tyrannical in the earth, but He sends down to them what He will in due measure; He is Aware and sees His worshipers.\n",
        "TRANSLATION_15": "If God were to increase the provision to His servants, they would transgress on earth; but He sends down in precise measure whatever He wills. Surely, regarding His servants, He is Expert and Observant.\n",
        "TRANSLATION_16": "And if Allah had extended [excessively] provision for His servants, they would have committed tyranny throughout the earth. But He sends [it] down in an amount which He wills. Indeed He is, of His servants, Acquainted and Seeing.\n",
        "TRANSLATION_17": "[42:27] For were God to extend His provision to His servants, [to] all of them, they would, all of them, surely become covetous, in other words, they would become tyrants, in the earth; but He sends down (read yunzilu or yunazzilu) of provisions, in the measure that He will, thus extending it for some of His servants to the exclusion of others — and from [such] extending [of provision to some] emerges tyranny. Surely He is Aware, Seer of His servants.\n",
        "TRANSLATION_18": "(And if Allah were to enlarge the provision for His slaves) if Allah were to give abundant wealth to His slaves (they would surely rebel) they would surely transgress and become too arrogant (in the earth, but He sendeth down) but He enlarges (by measure as He wills) for whomever He will. (Lo! He is Informed) of what is good for His slaves, (a Seer of His bondmen) and of their works.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "42:27",
            "17:30",
            "35:31",
            "40:44",
            "17:96",
            "28:82",
            "24:30",
            "29:62",
            "7:128",
            "49:18"
        ],
        "BIBLE": [
            "prophets:joshua:23:15",
            "writings:ecclesiastes:5:17",
            "prophets:ii%20kings:21:8",
            "prophets:judges:18:10",
            "prophets:joshua:23:16",
            "torah:deuteronomy:26:13",
            "prophets:i%20kings:8:36",
            "writings:ezra:9:13",
            "writings:proverbs:8:29",
            "writings:ii%20chronicles:6:27"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:7"
        ]
    }
}