{
    "VERSE": "42:28",
    "ARABIC": "وَهُوَ ٱلَّذِى يُنَزِّلُ ٱلْغَيْثَ مِنۢ بَعْدِ مَا قَنَطُوا۟ وَيَنشُرُ رَحْمَتَهُۥ وَهُوَ ٱلْوَلِىُّ ٱلْحَمِيدُ",
    "ENGLISH": {
        "TRANSLATION_0": "It is He who sends down abundant rain, after they have lost all hope, and unfolds His mercy. He is the Protector, the Praiseworthy.",
        "TRANSLATION_1": "It is He who sends down rain when they had despaired of it, and showers His benevolence. He is the protector worthy of praise.\n",
        "TRANSLATION_2": "He it is Who sends down the rain after they despair of it, spreading out His Mercy. He is the Protector, the Immensely Praiseworthy.\n",
        "TRANSLATION_3": "It is He who sends down the rain after they had lost hope and spreads out His mercy. He is the Guardian and the Most Praiseworthy.\n",
        "TRANSLATION_4": "And it is He Who sends down the rain when they have despaired, and spreads out His mercy; and He is the Benefactor, the Most Praiseworthy.\n",
        "TRANSLATION_5": "And He it is Who sends down the rain after they have despaired, and spreads His mercy. And He is the Wali, Worthy of all praise.\n",
        "TRANSLATION_6": "And He it is Who sends down the rain after they have despaired, and He unfolds His mercy; and He is the Guardian, the Praised One.\n",
        "TRANSLATION_7": "And it is He who sends down the rain after they have despaired, and He unfolds His mercy; He is the Protector, the All-laudable.\n",
        "TRANSLATION_8": "And He it is Who sendeth down the saving rain after they have despaired, and spreadeth out His mercy. He is the Protecting Friend, the Praiseworthy.\n",
        "TRANSLATION_9": "it is He who sends rain after they have despaired and spreads His mercy far and wide. He is the Protector, Worthy of All Praise.\n",
        "TRANSLATION_10": "And He it is Who sendeth down the rain after men have despaired, and spreadeth abroad His mercy. And He is the Patron of all, the Praiseworthy.\n",
        "TRANSLATION_11": "It is He who sends down the rain after they have been despondent, and unfolds His mercy, and He is the Guardian, the All-laudable.\n",
        "TRANSLATION_12": "He is the One that sends down rain (even) after (men) have given up all hope, and scatters His Mercy (far and wide). And He is the Protector, Worthy of all Praise.\n",
        "TRANSLATION_13": "And He it is Who sends down the rain after they have despaired, and spreads abroad His Mercy. And He is the Wali (Helper, Supporter, Protector, etc.), Worthy of all Praise.\n",
        "TRANSLATION_14": "It is He who sends down rain for them after they despaired, and He unfolds His Mercy. He is the Guardian, the Praised.\n",
        "TRANSLATION_15": "It is He who brings down the rain after they have despaired, and unfolds His mercy. He is the Guardian, the Praised.\n",
        "TRANSLATION_16": "And it is He who sends down the rain after they had despaired and spreads His mercy. And He is the Protector, the Praiseworthy.\n",
        "TRANSLATION_17": "[42:28] And He it is Who sends down the [saving] rain after they have despaired, [after] they have given up hope of its being sent down, and unfolds His mercy, He extends His rain, and He is the [true] Patron, the Benevolent towards believers, the Praised, by them.\n",
        "TRANSLATION_18": "561 (And He it is Who sendeth down the saving rain after they have despaired) they have despaired of its coming down, (and spreadeth out His mercy) i.e. rain. (He is the Protecting Friend) Who sends rain year after year, (the Praiseworthy) in His acts.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "42:28",
            "16:110",
            "7:153",
            "35:2",
            "19:88",
            "22:24",
            "3:89",
            "24:5",
            "13:37",
            "26:5"
        ],
        "BIBLE": [
            "torah:genesis:12:20",
            "torah:deuteronomy:16:17",
            "writings:ii%20chronicles:26:8",
            "torah:leviticus:19:20",
            "writings:psalms:60:13",
            "writings:psalms:108:13",
            "writings:proverbs:22:24",
            "prophets:jeremiah:44:20",
            "prophets:i%20samuel:11:3",
            "writings:ezra:3:11"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:3:6",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:2:6",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:4:4"
        ]
    }
}