{
    "VERSE": "42:34",
    "ARABIC": "أَوْ يُوبِقْهُنَّ بِمَا كَسَبُوا۟ وَيَعْفُ عَن كَثِيرٍ",
    "ENGLISH": {
        "TRANSLATION_0": "Or He wrecks them for what they have earned though He pardons much.",
        "TRANSLATION_1": "Or He could wreck them for what they have done; yet there is much that He pardons.\n",
        "TRANSLATION_2": "He may, while forgiving much of the sins of those that ride these ships, drown them on account of some of their misdeeds.\n",
        "TRANSLATION_3": "or He could have destroyed them as punishment for the human being's deeds. However, God pardons many sins.\n",
        "TRANSLATION_4": "Or He can ruin them due to peoples’ sins and He can forgive a great deal.\n",
        "TRANSLATION_5": "Or He may destroy them because of that which their (people) have earned. And He pardons much.\n",
        "TRANSLATION_6": "Or He may make them founder for what they have earned, and (even then) pardon most;\n",
        "TRANSLATION_7": "Or He wrecks them for what they have earned; and He pardons much;\n",
        "TRANSLATION_8": "Or He causeth them to perish on account of that which they have earned - And He forgiveth much -\n",
        "TRANSLATION_9": "or He may cause them to founder because of people's misdeeds, He pardons many of them,\n",
        "TRANSLATION_10": "Or He may destroy them because of that which they have earned, and He may pardon many of them.\n",
        "TRANSLATION_11": "Or He wrecks them because of what they have earned, and He excuses many [an offense].\n",
        "TRANSLATION_12": "Or He can cause them to perish because of the (evil) which (the men) have earned; but much doth He forgive.\n",
        "TRANSLATION_13": "Or He may destroy them (by drowning) because of that which their (people) have earned. And He pardons much.\n",
        "TRANSLATION_14": "Or, He wrecks them for what they have earned, but He pardons a lot.\n",
        "TRANSLATION_15": "Or He could wreck them, because of what they have earned. And yet He pardons much.\n",
        "TRANSLATION_16": "Or He could destroy them for what they earned; but He pardons much.\n",
        "TRANSLATION_17": "[42:34] Or He wrecks them (yūbiqhunna, a supplement to yuskin, ‘He stills’), that is to say, [or] He sinks them, including their passengers, by sending violent winds [upon them], because of what they, that is, the passengers of these [ships], have earned, of sins. And He pardons much, of such [sin] and does not cause those who have sinned to drown.\n",
        "TRANSLATION_18": "(Or he causeth them to perish) i.e. the ships (on account of that which they have earned) on account of the sins of their people. (And He forgiveth much) He does not take them to task for it.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "42:34",
            "42:30",
            "20:34",
            "9:82",
            "34:35",
            "12:106",
            "85:7",
            "21:23",
            "44:39",
            "12:103"
        ],
        "BIBLE": [
            "prophets:jeremiah:16:20",
            "writings:ezra:6:8",
            "writings:daniel:6:27",
            "writings:i%20chronicles:17:22",
            "torah:deuteronomy:7:24",
            "torah:genesis:2:18",
            "torah:leviticus:19:22",
            "writings:psalms:59:12",
            "torah:exodus:30:32",
            "torah:leviticus:16:16"
        ]
    }
}