{
    "VERSE": "42:36",
    "ARABIC": "فَمَآ أُوتِيتُم مِّن شَىْءٍ فَمَتَٰعُ ٱلْحَيَوٰةِ ٱلدُّنْيَا وَمَا عِندَ ٱللَّهِ خَيْرٌ وَأَبْقَىٰ لِلَّذِينَ ءَامَنُوا۟ وَعَلَىٰ رَبِّهِمْ يَتَوَكَّلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Whatever you have been given is only the enjoyment of the life of this world. What is with Allah is better and longer lasting for those who have iman and trust in their Lord:",
        "TRANSLATION_1": "Whatsoever you have been given is only this life's merchandise; but what is with God is better and more lasting for those who believe and place their trust in their Lord,\n",
        "TRANSLATION_2": "That which has been given to you is only the wherewithal of the transient life of this world. But that which is with Allah is better and more enduring for those who believe and put their trust in their Lord;\n",
        "TRANSLATION_3": "Whatever you have received is just a means of enjoyment for this life but the reward of God for the believers and those who trust in their Lord will be better and everlasting.\n",
        "TRANSLATION_4": "Whatever you have received is only for usage in the life of this world, and that which is with Allah is much better and more lasting – for those who believe and rely upon their Lord.\n",
        "TRANSLATION_5": "So whatever you have been given is but (a passing) enjoyment for this worldly life, but that which is with Allah is better and more lasting for those who believe and put their trust in their Lord.\n",
        "TRANSLATION_6": "So whatever thing you are given, that is only a provision of this world's life, and what is with Allah is better and more lasting for those who believe and rely on their Lord.\n",
        "TRANSLATION_7": "Whatever thing you have been given is the enjoyment of the present life; but what is with God is better and more enduring for those who believe and put their trust in their Lord.\n",
        "TRANSLATION_8": "Now whatever ye have been given is but a passing comfort for the life of the world, and that which Allah hath is better and more lasting for those who believe and put their trust in their Lord,\n",
        "TRANSLATION_9": "Whatever you have been given is only a temporary provision of this life, but that which is with God is better and more lasting for those who believe and put their trust in their Lord;\n",
        "TRANSLATION_10": "So whatsoever things are vouchsafed Unto you are but a Passing enjoyment for the life of the world, and that which is with Allah, better and more lasting, is for those who believe and in their Lord put their trust.\n",
        "TRANSLATION_11": "Whatever you have been given are the wares of the life of this world, but what is with Allah is better and more lasting for those who have faith and who put their trust in their Lord\n",
        "TRANSLATION_12": "Whatever ye are given (here) is (but) a convenience of this life: but that which is with Allah is better and more lasting: (it is) for those who believe and put their trust in their Lord:\n",
        "TRANSLATION_13": "So whatever you have been given is but a passing enjoyment for this worldly life, but that which is with Allah (Paradise) is better and more lasting for those who believe (in the Oneness of Allah Islamic Monotheism) and put their trust in their Lord (concerning all of their affairs).\n",
        "TRANSLATION_14": "That which you have been given is but the enjoyment of the present life. Better and more enduring is that which Allah has for those who believe and put their trust in their Lord.\n",
        "TRANSLATION_15": "Whatever thing you are given is only the provision of this life. But what God possesses is better and more lasting for those who believe and rely on their Lord.\n",
        "TRANSLATION_16": "So whatever thing you have been given - it is but [for] enjoyment of the worldly life. But what is with Allah is better and more lasting for those who have believed and upon their Lord rely\n",
        "TRANSLATION_17": "[42:36] So whatever you — [this is] an address is to believers and others — have been given, of the luxuries of this world, is [but] the enjoyment of the life of this world, enjoyed for the duration of it but then perishes. But what is with God, of reward, is better and more lasting for those who believe and put their trust in their Lord (li’lladhīna āmanū wa-‘alā rabbihim yatawakkalūna, is supplemented by [the following clause]),\n",
        "TRANSLATION_18": "(Now whatever ye have been given) of wealth and adornment of life (is but a passing comfort for the life of the world) and it will not last, (and that which Allah hath) of reward (is better) than that which you have in the life of this world (and more lasting) than the comfort of the life of the world which is perishing; and then He explained to them by saying: (for those who believe) in Muhammad (pbuh) and in the Qur'an: i.e. Abu Bakr and his fellow believers (and put their trust in their Lord) not in their wealth.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "42:36",
            "28:60",
            "13:26",
            "6:57",
            "14:27",
            "19:76",
            "9:38",
            "22:30",
            "43:35",
            "20:73"
        ],
        "BIBLE": [
            "writings:ecclesiastes:8:15",
            "prophets:joshua:23:15",
            "writings:ecclesiastes:1:13",
            "writings:ecclesiastes:5:17",
            "torah:deuteronomy:9:23",
            "torah:numbers:18:19",
            "prophets:i%20kings:5:18",
            "torah:deuteronomy:26:13",
            "prophets:judges:11:24",
            "torah:deuteronomy:3:20"
        ]
    }
}