{
    "VERSE": "42:42",
    "ARABIC": "إِنَّمَا ٱلسَّبِيلُ عَلَى ٱلَّذِينَ يَظْلِمُونَ ٱلنَّاسَ وَيَبْغُونَ فِى ٱلْأَرْضِ بِغَيْرِ ٱلْحَقِّ أُو۟لَٰٓئِكَ لَهُمْ عَذَابٌ أَلِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "There are only grounds against those who wrong people and act as tyrants in the earth without any right to do so. Such people will have a painful punishment.",
        "TRANSLATION_1": "Blame lies on those who oppress, and terrorise the land unjustly. For them there is painful punishment.\n",
        "TRANSLATION_2": "Blame attaches only to those who subject people to wrong and commit excesses on earth. A painful chastisement awaits them.\n",
        "TRANSLATION_3": "Only those who do injustice to people and commit rebellion on earth for no reason will be questioned. They will suffer a painful torment.\n",
        "TRANSLATION_4": "Reproach is only against those who oppress people, and wrongfully spread rebellion in the land; for them is a painful punishment.\n",
        "TRANSLATION_5": "The way is only against those who oppress men and rebel in the earth without justification; for such there will be a painful torment.\n",
        "TRANSLATION_6": "The way (to blame) is only against those who oppress men and revolt in the earth unjustly; these shall have a painful punishment.\n",
        "TRANSLATION_7": "The way is only open against those who do wrong to the people, and are insolent in the earth wrongfully; there awaits them a painful chastisement.\n",
        "TRANSLATION_8": "The way (of blame) is only against those who oppress mankind, and wrongfully rebel in the earth. For such there is a painful doom.\n",
        "TRANSLATION_9": "blame falls only on those who wrong men and transgress on this earth without justification, such will have a painful punishment,\n",
        "TRANSLATION_10": "The way of blame is only against those who wrong mankind, and rebel in the earth without justice; these! for them is a torment afflictive.\n",
        "TRANSLATION_11": "The ground for action is only against those who oppress the people and commit tyranny in the land in violation of justice. For such there will be a painful punishment.\n",
        "TRANSLATION_12": "The blame is only against those who oppress men and wrong-doing and insolently transgress beyond bounds through the land, defying right and justice: for such there will be a penalty grievous.\n",
        "TRANSLATION_13": "The way (of blame) is only against those who oppress men and wrongly rebel in the earth, for such there will be a painful torment.\n",
        "TRANSLATION_14": "The blame is only against those who wrong people, and are wrongfully insolent in the earth, for them there is a painful punishment.\n",
        "TRANSLATION_15": "Blame lies on those who wrong people, and commit aggression in the land without right. These will have a painful punishment.\n",
        "TRANSLATION_16": "The cause is only against the ones who wrong the people and tyrannize upon the earth without right. Those will have a painful punishment.\n",
        "TRANSLATION_17": "[42:42] A course [of action] is only [open] against those who wrong people and seek [to commit], [who] commit, in the earth what is not right, [what are] acts of disobedience. For such there will be a painful chastisement.\n",
        "TRANSLATION_18": "(The way (of blame)) sin (is only against those who oppress mankind) i.e. who initiate wrong in the first place, (and wrongfully rebel in the earth. For such there is a painful doom.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "42:42",
            "3:21",
            "40:75",
            "46:20",
            "38:26",
            "22:25",
            "31:6",
            "44:11",
            "10:23",
            "51:37"
        ],
        "BIBLE": [
            "prophets:ii%20samuel:17:12",
            "prophets:jeremiah:46:12",
            "prophets:ezekiel:38:20",
            "writings:esther:9:2",
            "prophets:isaiah:24:20",
            "prophets:ii%20samuel:15:4",
            "prophets:ezekiel:31:12",
            "prophets:ezekiel:32:24",
            "prophets:ezekiel:32:23",
            "prophets:jeremiah:44:12"
        ]
    }
}