{
    "VERSE": "42:43",
    "ARABIC": "وَلَمَن صَبَرَ وَغَفَرَ إِنَّ ذَٰلِكَ لَمِنْ عَزْمِ ٱلْأُمُورِ",
    "ENGLISH": {
        "TRANSLATION_0": "But if someone is steadfast and forgives, that is the most resolute course to follow.",
        "TRANSLATION_1": "But he who bears with patience and forgives, surely complies with divine resolve.\n",
        "TRANSLATION_2": "But he who patiently endures and forgives, that is a conduct of great resolve.\n",
        "TRANSLATION_3": "To exercise patience and forgive (the wrong done to one) is the proof of genuine determination.\n",
        "TRANSLATION_4": "And indeed whoever patiently endured and forgave – then indeed these are acts of great courage.\n",
        "TRANSLATION_5": "And verily, whosoever shows patience and forgives, that would truly be from the things recommended by Allah.\n",
        "TRANSLATION_6": "And whoever is patient and forgiving, these most surely are actions due to courage.\n",
        "TRANSLATION_7": "But surely he who bears patiently and is forgiving -- surely that is true constancy.\n",
        "TRANSLATION_8": "And verily whoso is patient and forgiveth - lo! that, verily, is (of) the steadfast heart of things.\n",
        "TRANSLATION_9": "whoever is patient and forgiving, acts with great courage and resolution.\n",
        "TRANSLATION_10": "And whosoever forbeareth and forgiveth -that verily is of the firmness of affairs.\n",
        "TRANSLATION_11": "As for someone who endures patiently and forgives—that is indeed the steadiest of courses.\n",
        "TRANSLATION_12": "But indeed if any show patience and forgive, that would truly be an exercise of courageous will and resolution in the conduct of affairs.\n",
        "TRANSLATION_13": "And verily, whosoever shows patience and forgives that would truly be from the things recommended by Allah.\n",
        "TRANSLATION_14": "Surely, he who bears patiently and forgives indeed that is true constancy.\n",
        "TRANSLATION_15": "But whoever endures patiently and forgives—that is a sign of real resolve.\n",
        "TRANSLATION_16": "And whoever is patient and forgives - indeed, that is of the matters [requiring] determination.\n",
        "TRANSLATION_17": "[42:43] But verily he who is patient, and defend himself [by retaliating], and forgives, excuses [the wrong done to him] — surely that, patience and excusing, is [true] constancy in [such] affairs, that is to say, it is one of those [courses of action] for which one must have firm resolve, meaning those which are required [of the believer] by [God’s] Law.\n",
        "TRANSLATION_18": "And verily whoso is patient) for the iniquity he suffers (and forgiveth) and forgoes retaliation, (lo! That) patience and forgiveness, (verily, is (of) the steadfast heart of things) verily is the best of matters; it is also said this means: of the most resolute of matters. The verses from (And those who shun the worst of sins and indecencies...) to (...lo! that, verily, is (of) the steadfast heart of things) were revealed about Abu Bakr and his fellow believer 'Amr Ibn Ghazyah al-Ansari in relation to a dispute which happened between the two. Al-Ansari had, in this dispute, abused Abu Bakr al-Siddiq.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "42:43",
            "31:17",
            "3:186",
            "79:5",
            "51:4",
            "15:66",
            "26:151",
            "21:27",
            "20:26",
            "37:123"
        ],
        "BIBLE": [
            "writings:psalms:131:1",
            "torah:deuteronomy:15:10",
            "prophets:i%20samuel:12:24",
            "writings:i%20chronicles:29:19",
            "prophets:jeremiah:14:14",
            "writings:ecclesiastes:1:13",
            "prophets:ezekiel:44:13",
            "torah:leviticus:5:17",
            "prophets:jeremiah:13:22",
            "writings:nehemiah:6:8"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:2",
            "Sefer%20Yetzirah:1:11"
        ]
    }
}