{
    "VERSE": "42:44",
    "ARABIC": "وَمَن يُضْلِلِ ٱللَّهُ فَمَا لَهُۥ مِن وَلِىٍّ مِّنۢ بَعْدِهِۦ وَتَرَى ٱلظَّٰلِمِينَ لَمَّا رَأَوُا۟ ٱلْعَذَابَ يَقُولُونَ هَلْ إِلَىٰ مَرَدٍّ مِّن سَبِيلٍ",
    "ENGLISH": {
        "TRANSLATION_0": "Whoever Allah misguides has no one to protect them after that. You will see the wrongdoers saying, when they see the punishment, 'Is there no way back?'",
        "TRANSLATION_1": "He whom God leads astray has no one except God to protect him. You should see the sinners when they face the punishment. They will say: \"Isn't there a way of going back?\"\n",
        "TRANSLATION_2": "He whom Allah lets go astray, none after Him can be his protector. You will see that when the wrong-doers observe the chastisement, they will exclaim: “Is there any way to go back?”\n",
        "TRANSLATION_3": "Whomever God has caused to go astray will find no guardian after this. You will see the unjust, on facing the torment, say, \"Is there any way to turn back?\n",
        "TRANSLATION_4": "And whomever Allah sends astray, there is no friend for him against Allah; and you will see the unjust when they behold the punishment saying, “Is there a way to return?”\n",
        "TRANSLATION_5": "And whomsoever Allah sends astray, for him there is no protector after Him. And you will see the wrongdoers, when they behold the torment, they will say: \"Is there any way of return\"\n",
        "TRANSLATION_6": "And whomsoever Allah makes err, he has no guardian after Him; and you shall see the unjust, when they see the punishment, saying: Is there any way to return?\n",
        "TRANSLATION_7": "Whomsoever God leads astray, he has no protector after him; and thou shalt see the evildoers, when they see the chastisement, saying, 'Is there any way to be sent back?'\n",
        "TRANSLATION_8": "He whom Allah sendeth astray, for him there is no protecting friend after Him. And thou (Muhammad) wilt see the evil-doers when they see the doom, (how) they say: Is there any way of return?\n",
        "TRANSLATION_9": "Anyone whom God lets go astray will thereafter have no protector whatsoever: you will see the wrongdoers, when they face the punishment, exclaiming, \"Is there no way back?\"\n",
        "TRANSLATION_10": "And whomsoever Allah will send astray, for him there will be no protecting friend to take His place. And thou wilt behold the wrong- doers when they behold the torment saying: is there Unto return any way?\n",
        "TRANSLATION_11": "Those whom Allah leads astray have no guardian apart from Him. You will see the wrongdoers, when they sight the punishment, saying, ‘Is there any way for a retreat?’\n",
        "TRANSLATION_12": "For any whom Allah leaves astray, there is no protector thereafter. And thou wilt see the Wrong-doers, when in sight of the Penalty, Say: \"Is there any way (to effect) a return?\"\n",
        "TRANSLATION_13": "And whomsoever Allah sends astray, for him there is no Wali (protector) after Him. And you will see the Zalimun (polytheists, wrong-doers, oppressors, etc.) when they behold the torment, they will say: \"Is there any way of return (to the world)?\"\n",
        "TRANSLATION_14": "He whom Allah leads astray has none to protect him thereafter. You will see the harmdoers when they see the punishment saying: 'Is there a way back'\n",
        "TRANSLATION_15": "Whoever God leaves astray has no protector apart from Him. And you will see the transgressors, when they see the torment, saying, “Is there a way of going back?”\n",
        "TRANSLATION_16": "And he whom Allah sends astray - for him there is no protector beyond Him. And you will see the wrongdoers, when they see the punishment, saying, \"Is there for return [to the former world] any way?\"\n",
        "TRANSLATION_17": "[42:44] And whomever God leads astray has no protector after Him, that is to say, none to take charge of guiding him after God has led him astray. And you will see the wrongdoers, when they sight the chastisement, saying, ‘Is there any way, any route [by which], to return?’, to this world.\n",
        "TRANSLATION_18": "(He whom Allah sendeth astray) from His religion, (for him there is no protecting friend after Him) for him there is none to guard him after Allah. (And thou (Muhammad) wilt see the evil-doers) the idolaters (when they see the doom, (how) they say: Is there any way of return) is there any way we can go back to the life of the world?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "42:44",
            "42:46",
            "11:20",
            "16:88",
            "40:45",
            "3:160",
            "5:115",
            "2:190",
            "47:32",
            "13:37"
        ],
        "BIBLE": [
            "prophets:i%20samuel:26:25",
            "torah:genesis:18:33",
            "prophets:isaiah:42:16",
            "prophets:ezekiel:26:14",
            "prophets:i%20samuel:29:4",
            "prophets:ii%20kings:7:19",
            "torah:exodus:20:21",
            "torah:exodus:34:10",
            "prophets:amos:6:10",
            "writings:psalms:51:15"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:3:7"
        ]
    }
}