{
    "VERSE": "42:53",
    "ARABIC": "صِرَٰطِ ٱللَّهِ ٱلَّذِى لَهُۥ مَا فِى ٱلسَّمَٰوَٰتِ وَمَا فِى ٱلْأَرْضِ أَلَآ إِلَى ٱللَّهِ تَصِيرُ ٱلْأُمُورُ",
    "ENGLISH": {
        "TRANSLATION_0": "the Path of Allah to Whom everything in the heavens and everything on the earth belongs. Indeed all",
        "TRANSLATION_1": "The path of God to whom belongs the kingdom of the heavens and the earth. And will not all things go back to God?\n",
        "TRANSLATION_2": "the Way of Allah, to Whom belongs the dominion of all that is in the heavens and the earth. Lo, it is to Allah that all things ultimately revert.\n",
        "TRANSLATION_3": "the path of God who is the owner of all that is in the heavens and the earth. To God certainly do all matters return.\n",
        "TRANSLATION_4": "The path of Allah – the One to Whom only belongs all whatever is in the heavens and all whatever is in the earth; pay heed! Towards Allah only do all matters return.\n",
        "TRANSLATION_5": "The path of Allah to Whom belongs all that is in the heavens and all that is on the earth. Verily, all matters at the end go to Allah.\n",
        "TRANSLATION_6": "The path of Allah, Whose is whatsoever is in the heavens and whatsoever is in the earth; now surely to Allah do all affairs eventually come.\n",
        "TRANSLATION_7": "the path of God, to whom belongs whatsoever is in the heavens, and whatsoever is in the earth. Surely unto God all things come home.\n",
        "TRANSLATION_8": "The path of Allah, unto Whom belongeth whatsoever is in the heavens and whatsoever is in the earth. Do not all things reach Allah at last?\n",
        "TRANSLATION_9": "the path of God, to whom belongs all that is in the heavens and on the earth. Indeed all matters return eventually to God.\n",
        "TRANSLATION_10": "The path of Allah, Whose is whatsoever is in the heavens and whatsoever is in the earth. Lo! Unto Allah trend all affairs.\n",
        "TRANSLATION_11": "the path of Allah, to whom belongs whatever is in the heavens and whatever is in the earth. Indeed all matters return to Allah!\n",
        "TRANSLATION_12": "The Way of Allah, to Whom belongs whatever is in the heavens and whatever is on earth. Behold (how) all affairs tend towards Allah!\n",
        "TRANSLATION_13": "The Path of Allah, to Whom belongs all that is in the heavens and all that is in the earth. Verily, all the matters at the end go to Allah (for decision).\n",
        "TRANSLATION_14": "The Path of Allah, to whom belongs all that is in the heavens and all that is in the earth. Surely, to Allah all things return.\n",
        "TRANSLATION_15": "The path of God, to whom belongs everything in the heavens and everything on earth. Indeed, to God all matters revert.\n",
        "TRANSLATION_16": "The path of Allah, to whom belongs whatever is in the heavens and whatever is on the earth. Unquestionably, to Allah do [all] matters evolve.\n",
        "TRANSLATION_17": "[42:53] the path of God, to Whom belongs whatever is in the heavens and whatever is in the earth, as possessions, creatures and servants. Surely with God all matters end [their journey], [all matters] return. Meccan [entirely], or as some say [Meccan] with the exception of verse 45, which is Medinese; it consists of 89 verses, revealed after [sūrat] al-Shūrā.\n",
        "TRANSLATION_18": "(The path of Allah) the religion of Allah, (unto Whom belongeth whatsoever is in the heavens and whatsoever is in the earth) of created beings. (Do not all things reach Allah at last?) the consequence of things in the Hereafter reach to the Wise Sovereign'. And of the surah in which Ornaments of Gold are mentioned, which is all Meccan and consists of 87 verses, 564 833 words and 3,400 letters: Surah 43: Ornaments of Gold (al-Zukhruf) And of the surah in which Ornaments of Gold are mentioned, which is all Meccan and consists of 87 verses, 833 words and 3,400 letters:\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "42:53",
            "3:109",
            "57:5",
            "53:31",
            "4:132",
            "27:25",
            "6:3",
            "57:1",
            "16:49",
            "49:18"
        ],
        "BIBLE": [
            "writings:job:16:22",
            "prophets:isaiah:13:5",
            "prophets:ii%20samuel:14:20",
            "writings:daniel:4:19",
            "prophets:isaiah:23:17",
            "prophets:jeremiah:3:5",
            "writings:daniel:5:26",
            "torah:deuteronomy:4:32",
            "prophets:jeremiah:16:19",
            "writings:daniel:4:31"
        ]
    }
}