{
    "VERSE": "42:6",
    "ARABIC": "وَٱلَّذِينَ ٱتَّخَذُوا۟ مِن دُونِهِۦٓ أَوْلِيَآءَ ٱللَّهُ حَفِيظٌ عَلَيْهِمْ وَمَآ أَنتَ عَلَيْهِم بِوَكِيلٍ",
    "ENGLISH": {
        "TRANSLATION_0": "As for those who take others besides Him as protectors, Allah takes care of them. You are not set over them as a guardian.",
        "TRANSLATION_1": "Those who have taken protectors other than Him, are watched over by God. It is not for you to be their guardian.\n",
        "TRANSLATION_2": "Those who have taken others than Him as their protectors beside Him, it is Allah Who oversees them; you are no guardian over them.\n",
        "TRANSLATION_3": "God is the guardian of even those who have chosen others (idols) besides Him as their guardians (Muhammad), you will not have to answer for them.\n",
        "TRANSLATION_4": "And Allah is watching those who have chosen supporters besides Him; and you are not responsible for them.\n",
        "TRANSLATION_5": "And as for those who take as protecting friends others besides Him -- Allah is Hafiz over them, and you are not a trustee over them.\n",
        "TRANSLATION_6": "And (as for) those who take guardians besides Him, Allah watches over them, and you have not charge over them.\n",
        "TRANSLATION_7": "And those who have taken to them protectors apart from Him -- God is Warden over them; thou art not a guardian over them.\n",
        "TRANSLATION_8": "And as for those who choose protecting friends beside Him, Allah is Warden over them, and thou art in no wise a guardian over them.\n",
        "TRANSLATION_9": "And [as for] those who take protectors besides Him, God is watching them and you are not a guardian over them.\n",
        "TRANSLATION_10": "And those who take Patrons beside Him, Allah is Warden over them, and thou art not over them a trustee.\n",
        "TRANSLATION_11": "As for those who have taken awliya besides Him, Allah is watchful over them, and you are not their keeper.\n",
        "TRANSLATION_12": "And those who take as protectors others besides Him,- Allah doth watch over them; and thou art not the disposer of their affairs.\n",
        "TRANSLATION_13": "And as for those who take as Auliya' (guardians, supporters, helpers, protectors, etc.) others besides Him [i.e. they take false deities other than Allah (as) protectors, and they worship them] Allah is Hafiz (Protector) over them (i.e. takes care of their deeds and will recompense them), and you (O Muhammad SAW) are not a Wakil (guardian or a disposer of their affairs) over them (to protect their deeds, etc.).\n",
        "TRANSLATION_14": "As for those who take guardians for themselves, other than Him, Allah is the Warden over them. You are not a guardian over them.\n",
        "TRANSLATION_15": "As for those who take masters other than Him: God is in charge of them, and you are not responsible for them.\n",
        "TRANSLATION_16": "And those who take as allies other than Him - Allah is [yet] Guardian over them; and you, [O Muhammad], are not over them a manager.\n",
        "TRANSLATION_17": "[42:6] And those who have taken besides Him, namely, idols [as], guardians, God is watchful over them, He keeps count [of their deeds], that He may requite them; and you are not a guardian over them, in order to secure what is demanded of them: your duty is only to deliver the Message.\n",
        "TRANSLATION_18": "(And as for those who choose) worship (protecting friends) deities from among the idols (beside Him) beside Allah, (Allah is Warden over them) Allah is Witness of them and of their works, (and thou art in nowise a guardian over them) you are not responsible for them such that you are taken to task on their account. Later, the Prophet (pbuh) was commanded to fight them.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "42:6",
            "42:46",
            "16:20",
            "11:113",
            "18:43",
            "33:3",
            "36:74",
            "6:107",
            "39:36",
            "53:58"
        ],
        "BIBLE": [
            "torah:numbers:31:49",
            "torah:deuteronomy:24:5",
            "writings:psalms:141:8",
            "prophets:isaiah:36:7",
            "prophets:jeremiah:27:4",
            "writings:psalms:25:20",
            "writings:i%20chronicles:9:28",
            "writings:ecclesiastes:3:14",
            "writings:psalms:16:1",
            "writings:psalms:71:1"
        ]
    }
}