{
    "VERSE": "42:9",
    "ARABIC": "أَمِ ٱتَّخَذُوا۟ مِن دُونِهِۦٓ أَوْلِيَآءَ فَٱللَّهُ هُوَ ٱلْوَلِىُّ وَهُوَ يُحْىِ ٱلْمَوْتَىٰ وَهُوَ عَلَىٰ كُلِّ شَىْءٍ قَدِيرٌ",
    "ENGLISH": {
        "TRANSLATION_0": "Have they then taken others besides Him as protectors? But Allah is the Protector. He gives life to the dead. He has power over all things.",
        "TRANSLATION_1": "Have they taken others beside Him as protectors? It is God who protects; it is He who gives life to the dead, for He has power over everything.\n",
        "TRANSLATION_2": "(Are they so foolish that) they have chosen others rather than Allah as their protectors? Yet it is Allah Who is the Protector and Who resurrects the dead and Who has power over everything.\n",
        "TRANSLATION_3": "Have they chosen other guardians besides Him? God is the real Guardian and it is He who will bring the dead back to life. He has power over all things.\n",
        "TRANSLATION_4": "What! Have they appointed supporters other than Allah? So (know that) Allah only is the Supporter, and He will revive the dead; and He is Able to do all things.\n",
        "TRANSLATION_5": "Or have they taken protecting friends besides Him But Allah --- He Alone is the protector. And He Who gives life to the dead, and He is Able to do all things.\n",
        "TRANSLATION_6": "Or have they taken guardians besides Him? But Allah is the Guardian, and He gives life to the dead, and He has power over all things.\n",
        "TRANSLATION_7": "Or have they taken to them protectors apart from Him? But God -- He is the Protector; He quickens the dead, and He is powerful over everything.\n",
        "TRANSLATION_8": "Or have they chosen protecting friends besides Him? But Allah, He (alone) is the Protecting Friend. He quickeneth the dead, and He is Able to do all things.\n",
        "TRANSLATION_9": "Have they taken for themselves protectors other than Him? But it is God who is the real Protector. He resurrects the dead, and He has power over all things.\n",
        "TRANSLATION_10": "Have they taken patrons besides Him! But Allah! He is the Patron, HE quickeneth the dead, and He is over every-thing Potent.\n",
        "TRANSLATION_11": "Have they taken awliya besides Him? [Say,] ‘It is Allah, who is the [true] Wali, and He revives the dead, and He has power over all things.\n",
        "TRANSLATION_12": "What! Have they taken (for worship) protectors besides Him? But it is Allah,- He is the Protector, and it is He Who gives life to the dead: It is He Who has power over all things,\n",
        "TRANSLATION_13": "Or have they taken (for worship) Auliya' (guardians, supporters, helpers, protectors, etc.) besides Him? But Allah, He Alone is the Wali (Protector, etc.). And it is He Who gives life to the dead, and He is Able to do all things.\n",
        "TRANSLATION_14": "Or have they taken to themselves guardians other than Him? But Allah, He is the Guardian. He revives the dead and has power over all things.\n",
        "TRANSLATION_15": "Or have they adopted protectors besides him? But God is the Protector, and He gives life to the dead, and He has power over all things.\n",
        "TRANSLATION_16": "Or have they taken protectors [or allies] besides him? But Allah - He is the Protector, and He gives life to the dead, and He is over all things competent.\n",
        "TRANSLATION_17": "[42:9] Or have they taken, idols [as], guardians besides Him? (am, ‘or’, is disjunctive, functioning with the sense of bal, ‘nay, but’, the one used to denote a shift [in the subject matter]; the hamza is for denial, in other words ‘those who are taken’ [as guardians] are not [in fact] guardians [of anything]). But God, He [alone] is the Guardian, in other words, then One who helps believers (the fā’ [of fa’Llāhu] is merely for coordination) and He revives the dead, and He has power over all things.\n",
        "TRANSLATION_18": "(Or have they chosen protecting friends besides Him) or have they worshipped deities beside Allah? (But Allah, He (alone) is the Protecting Friend) of all of them. (He quickeneth the dead) for the Resurrection, (and He is Able to do all things) whether it is taking away life or giving it.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "42:9",
            "22:6",
            "33:27",
            "2:284",
            "3:189",
            "3:29",
            "46:33",
            "11:4",
            "16:20",
            "41:39"
        ],
        "BIBLE": [
            "torah:genesis:31:9",
            "torah:numbers:8:16",
            "prophets:ezekiel:18:13",
            "prophets:i%20samuel:4:19",
            "writings:ecclesiastes:3:14",
            "prophets:joshua:23:15",
            "prophets:judges:3:6",
            "prophets:i%20samuel:2:6",
            "prophets:ii%20samuel:4:10",
            "torah:leviticus:7:34"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:2",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:3"
        ]
    }
}