{
    "VERSE": "102:8",
    "ARABIC": "ثُمَّ لَتُسْـَٔلُنَّ يَوْمَئِذٍ عَنِ ٱلنَّعِيمِ",
    "ENGLISH": {
        "TRANSLATION_0": "Then you will be asked that Day about the pleasures you enjoyed.",
        "TRANSLATION_1": "Then on that day you will surely be asked about the verity of pleasures.\n",
        "TRANSLATION_2": "Then, on that Day, you will be called to account for all the bounties you enjoyed.\n",
        "TRANSLATION_3": "Then, on that day, you will be questioned about the bounties (of God).\n",
        "TRANSLATION_4": "Then, on that day, you will surely be questioned regarding the favours.\n",
        "TRANSLATION_5": "Then on that Day you shall be asked about the delights!\n",
        "TRANSLATION_6": "Then on that day you shall most certainly be questioned about the boons.\n",
        "TRANSLATION_7": "then you shall be questioned that day concerning true bliss.\n",
        "TRANSLATION_8": "Then, on that day, ye will be asked concerning pleasure.\n",
        "TRANSLATION_9": "Then on that Day you shall be questioned about your worldly favours.\n",
        "TRANSLATION_10": "Then, on that Day, ye shall surely be asked of the delights.\n",
        "TRANSLATION_11": "Then, on that day, you will surely be questioned concerning the Blessing.\n",
        "TRANSLATION_12": "Then, shall ye be questioned that Day about the joy (ye indulged in!).\n",
        "TRANSLATION_13": "Then, on that Day, you shall be asked about the delight (you indulged in, in this world)!\n",
        "TRANSLATION_14": "On that Day, you shall be questioned about the pleasures.\n",
        "TRANSLATION_15": "Then, on that Day, you will be questioned about the Bliss.\n",
        "TRANSLATION_16": "Then you will surely be asked that Day about pleasure.\n",
        "TRANSLATION_17": "[102:8] Then, on that day, the day you see it, you will assuredly be questioned (la-tus’alunna: the nūn of the indicative has been omitted because of one nūn coming after the other; likewise [omitted] is the wāw indicating the plural person [of the verb] because of two unvocalised consonants coming together) about the comforts [of the world], the health, leisure, security, food, drink and other things which one enjoys in this world.\n",
        "TRANSLATION_18": "(Then, on that day) on the Day of Judgement, (ye will be asked concerning pleasure) you will be asked about whether you gave thanks for all the bounties you enjoyed, of food, drink, clothing, etc'. And of the surah in which the Declining Day is mentioned, which is all Meccan, and consists of 3 verses, 14 words and 68 letters. Surah 103: The Declining Day (al-'Asr) And of the surah in which the Declining Day is mentioned, which is all Meccan, and consists of 3 verses, 14 words and 68 letters:\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "102:8",
            "26:85",
            "83:22",
            "82:13",
            "37:57",
            "56:12",
            "37:43",
            "52:17",
            "31:8",
            "44:27"
        ],
        "BIBLE": [
            "torah:genesis:1:8",
            "torah:genesis:1:5",
            "prophets:i%20samuel:29:6",
            "torah:genesis:49:1",
            "torah:genesis:26:33",
            "writings:psalms:138:3",
            "torah:genesis:35:10",
            "torah:exodus:10:16",
            "prophets:jeremiah:23:6",
            "prophets:jeremiah:33:16"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:3:5",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:4:3"
        ]
    }
}