{
    "VERSE": "21:10",
    "ARABIC": "لَقَدْ أَنزَلْنَآ إِلَيْكُمْ كِتَٰبًا فِيهِ ذِكْرُكُمْ أَفَلَا تَعْقِلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "We have sent down to you a Book containing your Reminder. So will you not use your intellect?",
        "TRANSLATION_1": "We have sent down to you a Book which has a reminder for you. Do you not understand?\n",
        "TRANSLATION_2": "We have bestowed upon you a Book that mentions you. Do you not understand?\n",
        "TRANSLATION_3": "We have sent a Book, (the Quran), which is an honor for you. Will you then not understand?\n",
        "TRANSLATION_4": "We have indeed sent down towards you a Book, in which is your repute; so do you not have sense?\n",
        "TRANSLATION_5": "Indeed, We have sent down for you a Book in which there is Dhikrukum. Will you not then understand\n",
        "TRANSLATION_6": "Certainly We have revealed to you a Book in which is your good remembrance; what! do you not then understand?\n",
        "TRANSLATION_7": "Now We have sent down to you a Book wherein is your Remembrance; will you not understand?\n",
        "TRANSLATION_8": "Now We have revealed unto you a Scripture wherein is your Reminder. Have ye then no sense?\n",
        "TRANSLATION_9": "We have revealed a Book to you which is admonition for you. Will you not then understand?\n",
        "TRANSLATION_10": "And assuredly We have sent down unto you a Book wherein is admonition for you; will ye not then reflect?\n",
        "TRANSLATION_11": "Certainly We have sent down to you a Book in which there is an admonition for you. Do you not exercise your reason?\n",
        "TRANSLATION_12": "We have revealed for you (O men!) a book in which is a Message for you: will ye not then understand?\n",
        "TRANSLATION_13": "Indeed, We have sent down for you (O mankind) a Book, (the Quran) in which there is Dhikrukum, (your Reminder or an honour for you i.e. honour for the one who follows the teaching of the Quran and acts on its orders). Will you not then understand?\n",
        "TRANSLATION_14": "Now, We have sent down to you a Book in which is your Remembrance. Will you not understand?\n",
        "TRANSLATION_15": "We have sent down to you a Book, containing your message. Do you not understand?\n",
        "TRANSLATION_16": "We have certainly sent down to you a Book in which is your mention. Then will you not reason?\n",
        "TRANSLATION_17": "[21:10] Now We have sent down [as revelation] to you, O clan of Quraysh, a Book in which there is the remembrance that is yours, for it is in your language. Will you not understand?, and so believe in it?\n",
        "TRANSLATION_18": "(Now We have revealed unto you) unto your Prophet (a Scripture) We sent Gabriel with a Scripture (wherein is your Reminder) wherein lies your eminence and dignity if you believe in it. (Have ye then no sense) do you not believe then in your eminence and dignity?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "21:10",
            "68:37",
            "56:78",
            "23:49",
            "37:155",
            "37:157",
            "3:65",
            "36:62",
            "2:44",
            "16:17"
        ],
        "BIBLE": [
            "prophets:ii%20kings:6:19",
            "torah:genesis:44:4",
            "torah:numbers:32:11",
            "prophets:i%20kings:17:18",
            "writings:proverbs:28:2",
            "writings:psalms:38:21",
            "torah:genesis:19:8",
            "prophets:malachi:2:10",
            "prophets:judges:19:24",
            "prophets:i%20samuel:20:12"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:4:12"
        ]
    }
}