{
    "VERSE": "21:101",
    "ARABIC": "إِنَّ ٱلَّذِينَ سَبَقَتْ لَهُم مِّنَّا ٱلْحُسْنَىٰٓ أُو۟لَٰٓئِكَ عَنْهَا مُبْعَدُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Those for whom the Best from Us was pre-ordained, will be far away from it.",
        "TRANSLATION_1": "But those for whom a good reward had been fore-ordained by Us, will be far removed from it,\n",
        "TRANSLATION_2": "But for those whom We had decided to favour with good reward, they shall be kept far removed from Hell.\n",
        "TRANSLATION_3": "But those to whom We have already promised blessings will be far away from hell.\n",
        "TRANSLATION_4": "Indeed those to whom Our promise of goodness has been made, have been kept far away from hell.\n",
        "TRANSLATION_5": "Verily, those for whom the good has preceded from Us, they will be removed far therefrom (Hell).\n",
        "TRANSLATION_6": "Surely (as for) those for whom the good has already gone forth from Us, they shall be kept far off from it;\n",
        "TRANSLATION_7": "But as for those unto whom already the reward most fair has gone forth from Us,\n",
        "TRANSLATION_8": "Lo! those unto whom kindness hath gone forth before from Us, they will be far removed from thence.\n",
        "TRANSLATION_9": "But those who have been promised a good reward by Us will be kept far away from Hell --\n",
        "TRANSLATION_10": "Verily those for whom the good reward hath preceded from Us, they therefrom shall be kept far away.\n",
        "TRANSLATION_11": "Indeed those to whom there has gone beforehand [the promise of] the best reward from Us will be kept away from it.\n",
        "TRANSLATION_12": "Those for whom the good (record) from Us has gone before, will be removed far therefrom.\n",
        "TRANSLATION_13": "Verily those for whom the good has preceded from Us, they will be removed far therefrom (Hell) [e.g. 'Iesa (Jesus), son of Maryam (Mary); 'Uzair (Ezra), etc.].\n",
        "TRANSLATION_14": "But those whom We have surpassed with the finest (rank) from Us shall be far removed from it,\n",
        "TRANSLATION_15": "As for those who deserved goodness from Us—these will be kept away from it.\n",
        "TRANSLATION_16": "Indeed, those for whom the best [reward] has preceded from Us - they are from it far removed.\n",
        "TRANSLATION_17": "[21:101] Indeed those to whom [the promise of] the best reward, the [best] status, went beforehand from Us, and among such are those who have just been mentioned: they will be kept away from it.\n",
        "TRANSLATION_18": "(Lo! those unto whom kindness hath gone forth before) those to whom Paradise has been enjoined; the reference here is to Ezra and Jesus (from Us, they will be far removed from thence) they will be saved from the Fire.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "21:101",
            "92:9",
            "92:6",
            "13:29",
            "41:33",
            "37:131",
            "37:121",
            "37:80",
            "77:44",
            "7:15"
        ],
        "BIBLE": [
            "prophets:i%20kings:11:11",
            "prophets:ezekiel:48:11",
            "prophets:i%20samuel:29:6",
            "torah:exodus:9:29",
            "prophets:haggai:1:10",
            "prophets:ezekiel:44:15",
            "writings:psalms:19:12",
            "torah:genesis:21:23",
            "prophets:ii%20kings:8:9",
            "torah:deuteronomy:23:24"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:2:5"
        ]
    }
}