{
    "VERSE": "21:102",
    "ARABIC": "لَا يَسْمَعُونَ حَسِيسَهَا وَهُمْ فِى مَا ٱشْتَهَتْ أَنفُسُهُمْ خَٰلِدُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "They will not hear the slightest hint of it and they will remain there timelessly, for ever, among everything their selves desire.",
        "TRANSLATION_1": "And will not hear its hissing, and will live for ever in the midst of what their hearts desire.\n",
        "TRANSLATION_2": "They shall not hear even a whisper of it, and they shall live for ever in the delights which they had desired.\n",
        "TRANSLATION_3": "They will not even hear the slightest sound from it while enjoying the best that they can wish for in their everlasting life.\n",
        "TRANSLATION_4": "And they will not hear its faintest sound; and they will forever abide in whatever their hearts desire.\n",
        "TRANSLATION_5": "They shall not hear the slightest sound of it (Hell), while they abide in that which their own selves desire.\n",
        "TRANSLATION_6": "They will not hear its faintest sound, and they shall abide in that which their souls long for.\n",
        "TRANSLATION_7": "they shall be, kept far from it neither shall they hear any whisper of it, and they shall dwell forever in that their souls desired;\n",
        "TRANSLATION_8": "They will not hear the slightest sound thereof, while they abide in that which their souls desire.\n",
        "TRANSLATION_9": "they will not hear the slightest sound of it, and they shall forever abide in a state of bliss, among everything their souls longed for.\n",
        "TRANSLATION_10": "They shall not hear the least sound thereof, and in that felicity which their souls desire they shall be abiders.\n",
        "TRANSLATION_11": "They will not hear even its faint sound and they will remain [forever] in what their souls desire.\n",
        "TRANSLATION_12": "Not the slightest sound will they hear of Hell: what their souls desired, in that will they dwell.\n",
        "TRANSLATION_13": "They shall not hear the slightest sound of it (Hell), while they abide in that which their ownselves desire.\n",
        "TRANSLATION_14": "neither shall they hear any of its whisper, but shall live for ever in that their souls desired.\n",
        "TRANSLATION_15": "They will not hear its hissing, and they will forever abide in what their hearts desire.\n",
        "TRANSLATION_16": "They will not hear its sound, while they are, in that which their souls desire, abiding eternally.\n",
        "TRANSLATION_17": "[21:102] They will not hear the faintest sound from it and they will abide in what their souls desired, of bliss.\n",
        "TRANSLATION_18": "(They will not hear the slightest sound thereof, while they abide in that which their souls desire) in Paradise for eternity.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "21:102",
            "91:7",
            "82:5",
            "11:21",
            "51:21",
            "7:192",
            "81:14",
            "16:111",
            "20:41",
            "6:24"
        ],
        "BIBLE": [
            "writings:proverbs:4:21",
            "writings:ecclesiastes:2:10",
            "torah:deuteronomy:23:17",
            "writings:job:27:6",
            "prophets:i%20samuel:13:14",
            "torah:deuteronomy:19:20",
            "prophets:ezekiel:43:9",
            "writings:psalms:143:3",
            "prophets:isaiah:7:4",
            "torah:genesis:2:9"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:8",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:4:1"
        ]
    }
}