{
    "VERSE": "21:104",
    "ARABIC": "يَوْمَ نَطْوِى ٱلسَّمَآءَ كَطَىِّ ٱلسِّجِلِّ لِلْكُتُبِ كَمَا بَدَأْنَآ أَوَّلَ خَلْقٍ نُّعِيدُهُۥ وَعْدًا عَلَيْنَآ إِنَّا كُنَّا فَٰعِلِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "That Day We will fold up heaven like folding up the pages of a book. As We originated the first creation so We will regenerate it. It is a promise binding on Us. That is what We will do.",
        "TRANSLATION_1": "The day We shall roll up the heavens like a written scroll, We shall revert it (to nothing) as it was before We first created it. This is a promise incumbent on Us; We will certainly fulfil it.\n",
        "TRANSLATION_2": "On that Day We shall roll up the heavens like a scroll for writing. Even as We originated the creation first so We shall repeat it. This is a promise binding on Us; and so We shall do.\n",
        "TRANSLATION_3": "(This will happen) on the day when We roll up the heavens as if it were a written scroll and bring it back into existence just as though We had created it for the first time. This is what We have promised and We have always been true to Our promise.\n",
        "TRANSLATION_4": "The day when We shall roll up the heavens as the recording angel rolls up the register of deeds; We shall make him similar to Our making him the first time; this is a promise upon Us; We certainly have to do it.\n",
        "TRANSLATION_5": "And (remember) the Day when We shall roll up the heaven like a Sijill for books. As We began the first creation, We shall repeat it. (It is) a promise binding upon Us. Truly, We shall do it.\n",
        "TRANSLATION_6": "On the day when We will roll up heaven like the rolling up of the scroll for writings, as We originated the first creation, (so) We shall reproduce it; a promise (binding on Us); surely We will bring it about.\n",
        "TRANSLATION_7": "On the day when We shall roll up heaven as a scroll is rolled for the writings; as We originated the first creation, so We shall bring it back again -- a promise binding on Us; so We shall do.\n",
        "TRANSLATION_8": "The Day when We shall roll up the heavens as a recorder rolleth up a written scroll. As We began the first creation, We shall repeat it. (It is) a promise (binding) upon Us. Lo! We are to perform it.\n",
        "TRANSLATION_9": "On that Day We shall roll up the heavens like a scroll of parchment. As We originated the first creation, so shall We repeat it. This is a promise binding on Us. Truly, We shall fulfill it.\n",
        "TRANSLATION_10": "The Day whereon We shall roll up the heaven like as the rolling up of a scroll for books. Even as We began the first creation, We shall restore it: a promise binding upon Us; verily We have been the Doers.\n",
        "TRANSLATION_11": "The day We shall roll up the heaven, like rolling of the scrolls [meant] for writings. We will bring it back just as We began the first creation—a promise [binding] on Us. [That] indeed We will do.\n",
        "TRANSLATION_12": "The Day that We roll up the heavens like a scroll rolled up for books (completed),- even as We produced the first creation, so shall We produce a new one: a promise We have undertaken: truly shall We fulfil it.\n",
        "TRANSLATION_13": "And (remember) the Day when We shall roll up the heavens like a scroll rolled up for books, as We began the first creation, We shall repeat it, (it is) a promise binding upon Us. Truly, We shall do it.\n",
        "TRANSLATION_14": "On that Day, We shall roll up the heaven like a written scroll is rolled. As We originated the first creation, so will We bring it back again. This is a binding promise on Us which We shall assuredly fulfill.\n",
        "TRANSLATION_15": "On the Day when We fold the heaven, like the folding of a book. Just as We began the first creation, We will repeat it—a promise binding on Us. We will act.\n",
        "TRANSLATION_16": "The Day when We will fold the heaven like the folding of a [written] sheet for the records. As We began the first creation, We will repeat it. [That is] a promise binding upon Us. Indeed, We will do it.\n",
        "TRANSLATION_17": "[21:104] The day (yawma is in the accusative because of an implied preceding udhkur, ‘mention’) when We shall roll up the heaven as the Scribe, [al-sijill being] the name of an angel, rolls up the written scroll, that is, the scroll of the son of Adam when he dies (the lām [of li’l-kitāb] is extra; alternatively, [one may read the verse so that] al-sijill is ‘the scroll’, and al-kitāb means al-maktūb ‘what is written’, in which case the lām [of li’lkitāb] has the sense of [the particle] ‘alā, ‘over’; a variant reading [for li’l-kitāb] has the plural, li’l-kutub, ‘the books’). As We began the first creation, from non-existence, We shall repeat it, after making it non-existent (the kāf [of ka-mā, ‘as’] is semantically connected to nu‘īdu, ‘We shall repeat [it]’, and its [suffixed] pronoun [-hu, ‘it’] refers back to awwala, ‘the first’; the mā relates to the verbal noun) — a promise binding on Us   (wa‘dan is in the accusative because [it is the direct object] of an implied preceding wa‘adnā, ‘We promised’, and [the clause] constitutes a confirmation of the import of the preceding [verse, 103]). Truly We shall do [that], which We have promised.\n",
        "TRANSLATION_18": "(The Day) this is the Day of Judgement (when We shall rolleth up the heavens) with the right hand (and a recorder rolls up a written scroll. As We began the first creation) through a sperm, (We shall repeat it) We shall resurrect from dust. ((It is) a promise (binding) upon Us) this is incumbent upon Us. (Lo! We are to perform it) We will bring them back to life after they die.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "21:104",
            "73:18",
            "17:13",
            "19:54",
            "3:194",
            "45:28",
            "42:29",
            "36:28",
            "70:8",
            "28:43"
        ],
        "BIBLE": [
            "prophets:joshua:1:8",
            "writings:ii%20chronicles:30:5",
            "writings:daniel:10:14",
            "prophets:jeremiah:3:16",
            "torah:deuteronomy:32:35",
            "torah:genesis:35:3",
            "torah:deuteronomy:13:15",
            "torah:leviticus:16:16",
            "writings:psalms:89:30",
            "prophets:isaiah:66:22"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:1:12",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:5:2"
        ]
    }
}