{
    "VERSE": "21:107",
    "ARABIC": "وَمَآ أَرْسَلْنَٰكَ إِلَّا رَحْمَةً لِّلْعَٰلَمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "We have only sent you as a mercy to all the worlds.",
        "TRANSLATION_1": "We have sent you as a benevolence to the creatures of the world.\n",
        "TRANSLATION_2": "We have sent you forth as nothing but mercy to people of the whole world.\n",
        "TRANSLATION_3": "(Muhammad), We have sent you for no other reason but to be a mercy for mankind.\n",
        "TRANSLATION_4": "And We did not send you (O dear Prophet Mohammed – peace and blessings be upon him) except as a mercy for the entire world. (Prophet Mohammed – peace and blessings be upon him – is the Prophet towards all mankind.)\n",
        "TRANSLATION_5": "And We have sent you (O Muhammad) not but as a mercy for the `Alamin.\n",
        "TRANSLATION_6": "And We have not sent you but as a mercy to the worlds.\n",
        "TRANSLATION_7": "We have not sent thee, save as a mercy unto all beings.\n",
        "TRANSLATION_8": "We sent thee not save as a mercy for the peoples.\n",
        "TRANSLATION_9": "We have sent you forth as a mercy to all mankind.\n",
        "TRANSLATION_10": "And We have not sent thee except as a mercy unto the Worlds.\n",
        "TRANSLATION_11": "We did not send you but as a mercy to all the nations.\n",
        "TRANSLATION_12": "We sent thee not, but as a Mercy for all creatures.\n",
        "TRANSLATION_13": "And We have sent you (O Muhammad SAW) not but as a mercy for the 'Alamin (mankind, jinns and all that exists).\n",
        "TRANSLATION_14": "We have not sent you (Prophet Muhammad) except as a mercy to all the worlds.\n",
        "TRANSLATION_15": "We did not send you except as mercy to mankind.\n",
        "TRANSLATION_16": "And We have not sent you, [O Muhammad], except as a mercy to the worlds.\n",
        "TRANSLATION_17": "[21:107] We did not send you, O Muhammad (s), except as a mercy, that is, to [give] mercy, to all the worlds, [the worlds of] mankind and jinn through you.\n",
        "TRANSLATION_18": "(We sent thee) Muhammad (not save as a mercy) that shields from chastisement (for the peoples) from among the jinn, humans and all those who believe in you; it is also said that mercy here means blessing.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "21:107",
            "43:20",
            "68:52",
            "38:87",
            "81:27",
            "26:5",
            "12:104",
            "21:75",
            "21:86",
            "26:99"
        ],
        "BIBLE": [
            "prophets:isaiah:34:1",
            "prophets:isaiah:45:17",
            "prophets:zechariah:8:13",
            "writings:psalms:96:10",
            "writings:daniel:6:26",
            "writings:nehemiah:9:30",
            "writings:psalms:109:26",
            "writings:psalms:108:4",
            "writings:psalms:57:10",
            "writings:psalms:57:4"
        ]
    }
}