{
    "VERSE": "21:109",
    "ARABIC": "فَإِن تَوَلَّوْا۟ فَقُلْ ءَاذَنتُكُمْ عَلَىٰ سَوَآءٍ وَإِنْ أَدْرِىٓ أَقَرِيبٌ أَم بَعِيدٌ مَّا تُوعَدُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "If they turn their backs, then say: 'I have informed all of you equally and I do not know if what you have been promised is near or far.",
        "TRANSLATION_1": "If they turn away, tell them: \"I have warned you all alike. I do not know if what has been promised you is near or far away.\n",
        "TRANSLATION_2": "If they turn away, say to them: \"I have warned you all alike; and I cannot say whether what you have been promised is near or distant.\n",
        "TRANSLATION_3": "If they turn away, tell them, \"I have warned every one of you equally. I do not know when the torment which you have to suffer will take place.\n",
        "TRANSLATION_4": "Then if they turn away, proclaim, “I have proclaimed a war against you on equal terms; and what do I know whether the promise which is given to you, is close or far?”\n",
        "TRANSLATION_5": "But if they turn away say: \"I give you a notice to be known to us all alike. And I know not whether that which you are promised is near or far.\"\n",
        "TRANSLATION_6": "But if they turn back, say: I have given you warning in fairness and I do not know whether what you are threatened with is near or far;\n",
        "TRANSLATION_7": "Then, if they should turn their backs, say: 'I have proclaimed to you all equally, even though I know not whether near or far is that you are promised.'\n",
        "TRANSLATION_8": "But if they are averse, then say: I have warned you all alike, although I know not whether nigh or far is that which ye are promised.\n",
        "TRANSLATION_9": "If they turn away, say, \"I have warned you all alike, though I do not know whether [the scourge] which you are promised is near at hand or far off.\n",
        "TRANSLATION_10": "Then if they turn away, say thou: I have proclaimed unto you all alike, and I know not whether nigh or far is that which ye are promised,\n",
        "TRANSLATION_11": "But if they turn away, say, ‘I have proclaimed to you all alike, and I do not know whether what you have been promised is far or near.\n",
        "TRANSLATION_12": "But if they turn back, Say: \"I have proclaimed the Message to you all alike and in truth; but I know not whether that which ye are promised is near or far.\n",
        "TRANSLATION_13": "But if they (disbelievers, idolaters, Jews, Christians, polytheists, etc.) turn away (from Islamic Monotheism) say (to them O Muhammad SAW): \"I give you a notice (of war as) to be known to us all alike. And I know not whether that which you are promised (i.e. the torment or the Day of Resurrection) is near or far.\"\n",
        "TRANSLATION_14": "If they turn back, say: 'I have warned you all alike, though I cannot tell whether what you are promised is imminent or distant.\n",
        "TRANSLATION_15": "But if they turn away, say, “I have informed you sufficiently. Although I do not know whether what you are promised is near or far.”\n",
        "TRANSLATION_16": "But if they turn away, then say, \"I have announced to [all of] you equally. And I know not whether near or far is that which you are promised.\n",
        "TRANSLATION_17": "[21:109] But if they turn away, from this, say: ‘I have proclaimed to you, I have notified you of [my declaration of] war [on you], all alike (‘alā sawā’ is a circumstantial qualifier referring to both the subject of the verb and the object) that is to say, you are [all] equal in having knowledge of this: I shall not proceed independently without [having first informed] you, in order for you to make preparations, although I do not know whether near or far is that which you have been promised’, with respect to chastisement, or to the [Day of] Resurrection that comprises this [chastisement]; only God knows it.\n",
        "TRANSLATION_18": "(But if they are averse) from faith and sincerity, (then say) to them, Muhammad: (I have warned you) I have informed you, and as such you and I have become (all alike) both of us are openly aware of the matter and there is no secret, (although I know not whether nigh or far is that which ye are promised) of chastisement.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "21:109",
            "72:25",
            "11:35",
            "7:193",
            "16:71",
            "36:10",
            "52:16",
            "34:50",
            "2:6",
            "3:106"
        ],
        "BIBLE": [
            "prophets:isaiah:12:1",
            "prophets:ezekiel:3:20",
            "prophets:i%20samuel:10:9",
            "writings:ii%20chronicles:35:21",
            "torah:genesis:28:6",
            "prophets:ezekiel:35:12",
            "prophets:i%20kings:21:20",
            "torah:genesis:15:18",
            "writings:song%20of%20songs:5:6",
            "prophets:i%20kings:9:13"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:6:4"
        ]
    }
}