{
    "VERSE": "21:110",
    "ARABIC": "إِنَّهُۥ يَعْلَمُ ٱلْجَهْرَ مِنَ ٱلْقَوْلِ وَيَعْلَمُ مَا تَكْتُمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "He knows what is said openly and He knows what you hide.",
        "TRANSLATION_1": "He knows surely what you say aloud, and what you hide within your breasts.\n",
        "TRANSLATION_2": "Indeed He knows what you say loudly and what you hide.\n",
        "TRANSLATION_3": "God knows well all that is spoken aloud and all that you hide.\n",
        "TRANSLATION_4": "“Indeed Allah knows whatever is said, and knows all what you conceal.”\n",
        "TRANSLATION_5": "Verily, He knows that which is spoken aloud and He knows that which you conceal.\"\n",
        "TRANSLATION_6": "Surely He knows what is spoken openly and He knows what you hide;\n",
        "TRANSLATION_7": "Surely He knows what is spoken aloud and He knows what you hide.\n",
        "TRANSLATION_8": "Lo! He knoweth that which is said openly, and that which ye conceal.\n",
        "TRANSLATION_9": "God surely knows what you say openly and also knows what you conceal.\n",
        "TRANSLATION_10": "Verily He knoweth that which is public in speech, and He knoweth that which ye hide.\n",
        "TRANSLATION_11": "Indeed He knows whatever is spoken aloud, and He knows whatever you conceal.\n",
        "TRANSLATION_12": "It is He Who knows what is open in speech and what ye hide (in your hearts).\n",
        "TRANSLATION_13": "(Say O Muhammad SAW) Verily, He (Allah) knows that which is spoken aloud (openly) and that which you conceal.\n",
        "TRANSLATION_14": "He knows your spoken words and what you hide.\n",
        "TRANSLATION_15": "He knows what is said openly, and He knows what you conceal.\n",
        "TRANSLATION_16": "Indeed, He knows what is declared of speech, and He knows what you conceal.\n",
        "TRANSLATION_17": "[21:110] Indeed He, exalted be He, knows whatever is spoken aloud, and what you and others do, and He knows what you conceal, both you and others, of secrets.\n",
        "TRANSLATION_18": "(Lo! He knoweth that which is said) and done (openly, and that which ye conceal) of words and deeds, just as He knows the time of your chastisement.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "21:110",
            "87:7",
            "38:86",
            "7:114",
            "71:8",
            "26:19",
            "44:31",
            "26:185",
            "26:153",
            "75:28"
        ],
        "BIBLE": [
            "torah:deuteronomy:18:21",
            "torah:genesis:15:8",
            "writings:ecclesiastes:3:18",
            "torah:exodus:8:15",
            "writings:psalms:139:23",
            "torah:exodus:4:14",
            "writings:psalms:10:13",
            "torah:genesis:20:6",
            "writings:ii%20chronicles:6:14",
            "prophets:i%20kings:8:23"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:10",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:5"
        ]
    }
}