{
    "VERSE": "21:112",
    "ARABIC": "قَٰلَ رَبِّ ٱحْكُم بِٱلْحَقِّ وَرَبُّنَا ٱلرَّحْمَٰنُ ٱلْمُسْتَعَانُ عَلَىٰ مَا تَصِفُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Say: 'Lord, judge with truth! Our Lord is the All-Merciful, the One whose help is sought in the face of what you describe.'",
        "TRANSLATION_1": "Judge in truth (between us), O Lord,\" he said. \"Our Lord is merciful, whose help we seek against what you attribute.\"\n",
        "TRANSLATION_2": "The Messenger said: \"My Lord! Judge with truth. Our Compassionate Lord alone is our support against your (blasphemous) utterances.\"\n",
        "TRANSLATION_3": "He also said, \"Lord, judge (us) with Truth. Our Lord is the Beneficent One whose help I ask against the blasphemies you say about Him\".\n",
        "TRANSLATION_4": "And the Prophet submitted, “My Lord – render the true judgement”; “And only the help of Our Lord, the Most Gracious, is sought against all what you fabricate.”\n",
        "TRANSLATION_5": "He said:\"My Lord! Judge You in truth! Our Lord is the Most Gracious, Whose help is to be sought against that which you attribute!\"\n",
        "TRANSLATION_6": "He said: O my Lord! judge Thou with truth; and our Lord is the Beneficent Allah, Whose help is sought against what you ascribe (to Him).\n",
        "TRANSLATION_7": "He said: 'My Lord, judge Thou with truth! And our Lord is the All-merciful; His succour is ever to be sought against that you describe.'\n",
        "TRANSLATION_8": "He saith: My Lord! Judge Thou with truth. Our Lord is the Beneficent, Whose help is to be implored against that which ye ascribe (unto Him).\n",
        "TRANSLATION_9": "Say, \"My Lord, judge with truth. Our Lord is the Gracious One whose help we seek against what you utter.\"\n",
        "TRANSLATION_10": "He saith: my Lord! judge Thou with truth. And our Lord is the Compassionate Whose help is to be sought against that which ye utter.\n",
        "TRANSLATION_11": "He said, ‘My Lord! Judge [between us and the polytheists] with justice.’ ‘Our Lord is the All-beneficent; [He is our] resort against what you allege.’\n",
        "TRANSLATION_12": "Say: \"O my Lord! judge Thou in truth!\" \"Our Lord Most Gracious is the One Whose assistance should be sought against the blasphemies ye utter!\"\n",
        "TRANSLATION_13": "He (Muhammad SAW) said:\"My Lord! Judge You in truth! Our Lord is the Most Beneficent, Whose Help is to be sought against that which you attribute (unto Allah that He has offspring, and unto Muhammad SAW that he is a sorcerer, and unto the Quran that it is poetry, etc.)!\"\n",
        "TRANSLATION_14": "He said: 'My Lord, judge in truth. Our Lord is the Merciful whose help is ever to be sought against what you describe'\n",
        "TRANSLATION_15": "He said, “My Lord, judge with justice.” And, “Our Lord is the Gracious, Whose help is sought against what you allege.”\n",
        "TRANSLATION_16": "[The Prophet] has said, \"My Lord, judge [between us] in truth. And our Lord is the Most Merciful, the one whose help is sought against that which you describe.\"\n",
        "TRANSLATION_17": "[21:112] Say (qul, a variant reading has qāla, ‘He said’): ‘My Lord! Judge, between me and my deniers, with truth, by [assigning] chastisement for them or victory [for me] over them. And so they were chastised at [the battles of] Badr, Uhud, Hunayn, al-Ahzāb and al-Khandaq and he [the Prophet] was given victory over them. And our Lord is the Compassionate One, Whose help is to be sought against what you allege’, when you invent lies against God, saying that ‘[God] has taken a son’ [cf. Q. 2:116]; and against me, when you say, ‘[he is] a   sorcerer’ [cf. Q. 38:4], or against the Qur’ān, when you say, ‘[it is] poetry’ [cf. Q. 52:30]. Medinese, except for verses 52, 53, 54 and 55, which were [revealed] between Mecca and Medina; it consists of 78 verses, revealed after [sūrat] al-Nūr.\n",
        "TRANSLATION_18": "(He saith) Muhammad (pbuh) says: (My Lord! Judge Thou with truth) judge between me and the people of Mecca with justice. (Our Lord is the Beneficent, whose help is to be implored) we seek His help (against that which ye ascribe (unto Him)) against the lies which you utter about Him'. And of the surah in which the pilgrimage is mentioned, which is all Meccan except for five verses-(And among mankind is he who worshippeth Allah upon a narrow marge so that if good befalleth him he is content therewith, but if a trial befalleth him, he falleth away utterly. He loseth both the world and the Hereafter. That is the sheer loss. He calleth, beside Allah, unto that which hurts him not nor benefits him. That is the far error), and (Sanction is given unto those who fight because they have been wronged; and Allah is indeed Able to give them victory; Those who have been driven from their homes unjustly only because they said: Our Lord is Allah. For had it not been for Allah's repelling some men by means of others, cloisters and churches and oratories and mosques, wherein the name of Allah is oft mentioned, would assuredly have been pulled down. Verily Allah helpeth one who helpeth Him. Lo! Allah is Strong, Almighty), and the verse of the last prostration (0 ye who believe! Bow down and prostrate yourselves, and worship your Lord, and do good, that haply ye may prosper)-which are Medinan, and consists of 75 verses, 1,291 words and 5,135 letters: (Al-Hajj) Surah 22: The Pilgrimage (al-Hajj) And of the surah in which the pilgrimage is mentioned, which is all Meccan except for five verses— (And among mankind is he who worshippeth Allah upon a narrow marge so that if good befalleth him he is content therewith, but if a trial befalleth him, he falleth away utterly. He loseth both the world and the Hereafter. That is the sheer loss. He 362 calleth, beside Allah, unto that which hurts him not nor benefits him. That is the far error), and (Sanction is given unto those who fight because they have been wronged; and Allah is indeed Able to give them victory; Those who have been driven from their homes unjustly only because they said: Our Lord is Allah. For had it not been for Allah's repelling some men by means of others, cloisters and churches and oratories and mosques, wherein the name of Allah is oft mentioned, would assuredly have been pulled down. Verily Allah helpeth one who helpeth Him. Lo! Allah is Strong, Almighty), and the verse of the last prostration (0 ye who believe! Bow down and prostrate yourselves, and worship your Lord, and do good, that haply ye may prosper)— which are Medinan, and consists of 75 verses, 1,291 words and 5,135 letters:\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "21:112",
            "36:27",
            "15:56",
            "28:53",
            "6:30",
            "47:2",
            "3:60",
            "26:83",
            "46:34",
            "34:48"
        ],
        "BIBLE": [
            "prophets:jonah:4:2",
            "prophets:jeremiah:23:33",
            "writings:psalms:86:15",
            "writings:psalms:41:5",
            "prophets:zechariah:7:9",
            "prophets:ezekiel:21:33",
            "prophets:ii%20kings:6:33",
            "prophets:jeremiah:42:2",
            "prophets:isaiah:39:8",
            "writings:psalms:142:6"
        ]
    }
}