{
    "VERSE": "21:12",
    "ARABIC": "فَلَمَّآ أَحَسُّوا۟ بَأْسَنَآ إِذَا هُم مِّنْهَا يَرْكُضُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "When they perceived Our violent force they ran away from it.",
        "TRANSLATION_1": "Whensoever they sensed Our punishment they fled from them.\n",
        "TRANSLATION_2": "Then, when they perceived Our chastisement they took to their heels and fled.\n",
        "TRANSLATION_3": "When they found Our torment approaching them they started to run away from the town.\n",
        "TRANSLATION_4": "And when they tasted Our punishment, they immediately started fleeing from it.\n",
        "TRANSLATION_5": "Then, when they sensed Our torment, behold, they (tried to) flee from it.\n",
        "TRANSLATION_6": "So when they felt Our punishment, lo! they began to fly\n",
        "TRANSLATION_7": "Then, when they perceived Our might, behold, they ran headlong out of it.\n",
        "TRANSLATION_8": "And, when they felt Our might, behold them fleeing from it!\n",
        "TRANSLATION_9": "When they felt Our punishment coming upon them, they began to flee from it.\n",
        "TRANSLATION_10": "Then when they perceived Our violence, lo! they were from it fleeing.\n",
        "TRANSLATION_11": "So when they sighted Our punishment, behold, they ran away from it.\n",
        "TRANSLATION_12": "Yet, when they felt Our Punishment (coming), behold, they (tried to) flee from it.\n",
        "TRANSLATION_13": "Then, when they perceived (saw) Our Torment (coming), behold, they (tried to) flee from it.\n",
        "TRANSLATION_14": "And when they felt Our Might they fled from it.\n",
        "TRANSLATION_15": "Then, when they sensed Our might, they started running away from it.\n",
        "TRANSLATION_16": "And when its inhabitants perceived Our punishment, at once they fled from it.\n",
        "TRANSLATION_17": "[21:12] And when they felt Our might, [when] the inhabitants of the town sensed destruction [to be near], behold, they ran away from it, they flee hastily [therefrom].\n",
        "TRANSLATION_18": "(And, when they felt Our might) when they saw Our chastisement which was to destroy them, (behold them fleeing from it) they run away from Our might!\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "21:12",
            "43:47",
            "40:84",
            "68:26",
            "7:4",
            "26:157",
            "43:50",
            "7:165",
            "21:80",
            "36:72"
        ],
        "BIBLE": [
            "torah:numbers:17:12",
            "prophets:i%20samuel:17:51",
            "prophets:joshua:8:19",
            "prophets:i%20kings:2:39",
            "prophets:judges:9:43",
            "prophets:isaiah:20:1",
            "prophets:jeremiah:49:20",
            "prophets:ii%20samuel:4:4",
            "prophets:isaiah:57:1",
            "prophets:i%20samuel:17:17"
        ]
    }
}