{
    "VERSE": "21:16",
    "ARABIC": "وَمَا خَلَقْنَا ٱلسَّمَآءَ وَٱلْأَرْضَ وَمَا بَيْنَهُمَا لَٰعِبِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "We did not create heaven and earth and everything in between them as a game.",
        "TRANSLATION_1": "We have not created the heavens and the earth, and all that lies between them, out of fun.\n",
        "TRANSLATION_2": "We did not create in sport the heavens and the earth and all that lies between the two.\n",
        "TRANSLATION_3": "We did not create the heavens and the earth just for fun.\n",
        "TRANSLATION_4": "And We have not created the heavens and the earth and all that is between them, unnecessarily.\n",
        "TRANSLATION_5": "We created not the heavens and the earth and all that is between them for play.\n",
        "TRANSLATION_6": "And We did not create the heaven and the earth and what is between them for sport.\n",
        "TRANSLATION_7": "We created not the heaven and the earth, and whatsoever between them is, as playing;\n",
        "TRANSLATION_8": "We created not the heaven and the earth and all that is between them in play.\n",
        "TRANSLATION_9": "It was not in play that We created the heavens and the earth and all that lies between them.\n",
        "TRANSLATION_10": "And We created not the heaven and the earth and that which is in between in play.\n",
        "TRANSLATION_11": "We did not create the sky and the earth and whatever is between them for play.\n",
        "TRANSLATION_12": "Not for (idle) sport did We create the heavens and the earth and all that is between!\n",
        "TRANSLATION_13": "We created not the heavens and the earth and all that is between them for a (mere) play.\n",
        "TRANSLATION_14": "It was not in play that We created the heavens and the earth and all that lies between them.\n",
        "TRANSLATION_15": "We did not create the sky and the earth and what is between them for amusement.\n",
        "TRANSLATION_16": "And We did not create the heaven and earth and that between them in play.\n",
        "TRANSLATION_17": "[21:16] And We did not create the heaven and the earth and all that is between them, playing, being frivolous, but to indicate Our power and to benefit Our servants.\n",
        "TRANSLATION_18": "(We created not the heaven and the earth and all that is between them) of created beings (in play) without ordaining commands and prohibitions.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "21:16",
            "44:38",
            "44:7",
            "26:24",
            "37:5",
            "46:3",
            "38:27",
            "20:6",
            "50:38",
            "19:65"
        ],
        "BIBLE": [
            "torah:genesis:1:1",
            "prophets:isaiah:45:8",
            "prophets:isaiah:65:17",
            "writings:psalms:134:3",
            "torah:deuteronomy:4:32",
            "torah:genesis:2:4",
            "writings:psalms:115:3",
            "writings:psalms:73:25",
            "writings:psalms:102:26",
            "prophets:ii%20samuel:7:9"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:8"
        ]
    }
}