{
    "VERSE": "21:21",
    "ARABIC": "أَمِ ٱتَّخَذُوٓا۟ ءَالِهَةً مِّنَ ٱلْأَرْضِ هُمْ يُنشِرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Or have they taken gods out of the earth who can bring the dead to life?",
        "TRANSLATION_1": "Or have they taken gods from the earth who can raise the dead?\n",
        "TRANSLATION_2": "Have they taken earthly gods who are such that they raise up the dead to life?\n",
        "TRANSLATION_3": "Have they chosen deities from earth? Can such deities give life to anyone?\n",
        "TRANSLATION_4": "Have they appointed from the earth, Gods that create something?\n",
        "TRANSLATION_5": "Or have they taken (for worship) gods from the earth who raise the dead\n",
        "TRANSLATION_6": "Or have they taken gods from the earth who raise (the dead).\n",
        "TRANSLATION_7": "Or have they taken gods out of the earth who raise the dead?\n",
        "TRANSLATION_8": "Or have they chosen gods from the earth who raise the dead?\n",
        "TRANSLATION_9": "Have they taken deities from the earth who can bring the dead to life?\n",
        "TRANSLATION_10": "Have they taken gods from the earth who raise the deed?\n",
        "TRANSLATION_11": "Have they taken gods from the earth who raise [the dead]?\n",
        "TRANSLATION_12": "Or have they taken (for worship) gods from the earth who can raise (the dead)?\n",
        "TRANSLATION_13": "Or have they taken (for worship) aliha (gods) from the earth who raise the dead?\n",
        "TRANSLATION_14": "Or, have they taken earthly gods who revive the dead?\n",
        "TRANSLATION_15": "Or have they taken to themselves gods from the earth who resurrect?\n",
        "TRANSLATION_16": "Or have men taken for themselves gods from the earth who resurrect [the dead]?\n",
        "TRANSLATION_17": "[21:21]   Or (am, functions with the meaning of bal, ‘nay’, to effect a transition [in subject-matter]; the hamza is for [rhetorical] denial) have they chosen gods, that are, from the earth, such as stones, gold or silver, who, that is, gods [who], resurrect? who bring the dead back to life? No! Indeed only one who brings the dead back to life can be God.\n",
        "TRANSLATION_18": "(Or have they chosen) or have they, i.e. the people of Mecca, worshipped (gods from the earth) on the earth (who raise the dead) or create human beings?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "21:21",
            "38:28",
            "71:19",
            "71:17",
            "12:85",
            "12:73",
            "26:152",
            "72:12",
            "91:6",
            "84:3"
        ],
        "BIBLE": [
            "writings:ecclesiastes:3:14",
            "torah:genesis:2:22",
            "torah:numbers:1:17",
            "torah:numbers:24:23",
            "torah:numbers:31:53",
            "torah:numbers:31:49",
            "torah:deuteronomy:1:23",
            "prophets:jeremiah:51:56",
            "writings:psalms:31:14",
            "prophets:isaiah:57:1"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:4:8",
            "Sefer%20Yetzirah:3:5",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:3:6",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:1:6"
        ]
    }
}