{
    "VERSE": "21:26",
    "ARABIC": "وَقَالُوا۟ ٱتَّخَذَ ٱلرَّحْمَٰنُ وَلَدًا سُبْحَٰنَهُۥ بَلْ عِبَادٌ مُّكْرَمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "They say, 'The All-Merciful has a son.' Glory be to Him! No, they are honoured slaves!",
        "TRANSLATION_1": "And yet they say: \"Ar-Rahman has begotten a son.\" Too exalted is He! In fact, those (they call His sons) were His honoured votaries.\n",
        "TRANSLATION_2": "They say: \"The Most Compassionate Lord has taken to Himself a son.\" Glory be to Him! Those whom they so designate are only His honoured servants.\n",
        "TRANSLATION_3": "They said, \"The Beneficent God has given birth to a son. He is too Exalted to give birth to a son.\" (Those whom they think are God's sons) are only His honorable servants.\n",
        "TRANSLATION_4": "And they said, “The Most Gracious has chosen a son – Purity is to Him! In fact they are honourable bondmen.”\n",
        "TRANSLATION_5": "And they say: \"The Most Gracious has begotten children.\" Glory to Him! They are but honored servants.\n",
        "TRANSLATION_6": "And they say: The Beneficent Allah has taken to Himself a son. Glory be to Him. Nay! they are honored servants\n",
        "TRANSLATION_7": "They say:' 'The All-merciful has taken to Him a son.' Glory be to Him! Nay, but they are honoured servants\n",
        "TRANSLATION_8": "And they say: The Beneficent hath taken unto Himself a son. Be He Glorified! Nay, but (those whom they call sons) are honoured slaves;\n",
        "TRANSLATION_9": "They say, \"The All Merciful has taken a son!\" Glory be to Him! They are only His honoured servants:\n",
        "TRANSLATION_10": "And they say; the Compaionate hath taken a son. Hallowed be He! aye! they are bondmen honoured.\n",
        "TRANSLATION_11": "They say, ‘The All-beneficent has taken offsprings.’ Immaculate is He! Indeed, they are [His] honoured servants.\n",
        "TRANSLATION_12": "And they say: \"(Allah) Most Gracious has begotten offspring.\" Glory to Him! they are (but) servants raised to honour.\n",
        "TRANSLATION_13": "And they say: \"The Most Beneficent (Allah) has begotten a son (or children).\" Glory to Him! They [those whom they call children of Allah i.e. the angels, 'Iesa (Jesus) son of Maryam (Mary), 'Uzair (Ezra), etc.], are but honoured slaves.\n",
        "TRANSLATION_14": "They say 'The Merciful has taken a son' Exaltations to Him! No, they are only His honored worshipers,\n",
        "TRANSLATION_15": "And they say, “The Most Merciful has taken to himself a son.” Be He glorified; they are but honored servants.\n",
        "TRANSLATION_16": "And they say, \"The Most Merciful has taken a son.\" Exalted is He! Rather, they are [but] honored servants.\n",
        "TRANSLATION_17": "[21:26] And they say, ‘The Compassionate One has taken a son’, from the angels. Glory be to Him! Nay, but they are [merely] servants who are honoured, in His presence; for [the very] servitude [of all creatures to Him] is inconsistent with [the attribution of any of them as] progeny [of His].\n",
        "TRANSLATION_18": "(And they say) i.e. the people of Mecca: (The Beneficent hath taken unto Himself a child) angels as daughters. (Be He glorified!) Allah exonerated Himself from having children or partners (Nay, but are honoured slaves) rather they are, i.e. the angels, are servants whom Allah has honoured with obeying Him;\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "21:26",
            "19:88",
            "19:91",
            "19:92",
            "2:116",
            "25:63",
            "27:19",
            "43:81",
            "15:49",
            "26:5"
        ],
        "BIBLE": [
            "torah:genesis:31:9",
            "torah:genesis:33:5",
            "torah:leviticus:7:34",
            "writings:job:1:21",
            "torah:numbers:18:6",
            "torah:numbers:8:16",
            "prophets:judges:15:6",
            "torah:genesis:48:9",
            "prophets:judges:3:6",
            "torah:numbers:20:12"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:12",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:5:1"
        ]
    }
}