{
    "VERSE": "21:29",
    "ARABIC": "وَمَن يَقُلْ مِنْهُمْ إِنِّىٓ إِلَٰهٌ مِّن دُونِهِۦ فَذَٰلِكَ نَجْزِيهِ جَهَنَّمَ كَذَٰلِكَ نَجْزِى ٱلظَّٰلِمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Were any of them to say, 'I am a god apart from Him,' We would repay him with Hell. That is how We repay wrongdoers.",
        "TRANSLATION_1": "If any one of them said: \"I am God besides Him,\" We should award him Hell; for this is how We requite the evil-doers.\n",
        "TRANSLATION_2": "And if anyone of them were to claim: \"Indeed I am a god apart from Him,\" We shall recompense both with Hell. Thus do We recompense the wrong-doers.\n",
        "TRANSLATION_3": "The recompense of those of them who say that they are the Lord instead of God will be hell; thus, do We recompense the unjust ones.\n",
        "TRANSLATION_4": "And the one among them who says, “I am a God beside Allah” – We shall reward him with hell; this is how We punish the unjust.\n",
        "TRANSLATION_5": "And if any of them should say: \"Verily, I am a god besides Him,\" such We should recompense with Hell. Thus We recompense the wrongdoers.\n",
        "TRANSLATION_6": "And whoever of them should say: Surely I am a god besides Him, such a one do We recompense with hell; thus do, We recompense the unjust.\n",
        "TRANSLATION_7": "If any of them says, 'I am a god apart from Him', such a one We recompense with Gehenna; even so We recompense the evildoers.\n",
        "TRANSLATION_8": "And one of them who should say: Lo! I am a god beside Him, that one We should repay with hell. Thus We Repay wrong-doers.\n",
        "TRANSLATION_9": "Whoever of them should say, \"I am a deity besides Him,\" shall be requited with Hell. Thus do We reward the wrongdoers.\n",
        "TRANSLATION_10": "And whosoever of them should say: verily I am a god beside Him, such a one We shall requite with Hell; Thus We requite the wrong- doers.\n",
        "TRANSLATION_11": "Should any of them say, ‘I am a god besides Him,’ We will requite him with hell. Thus do We requite the wrongdoers.\n",
        "TRANSLATION_12": "If any of them should say, \"I am a god besides Him\", such a one We should reward with Hell: thus do We reward those who do wrong.\n",
        "TRANSLATION_13": "And if any of them should say: \"Verily, I am an ilah (a god) besides Him (Allah),\" such a one We should recompense with Hell. Thus We recompense the Zalimun (polytheists and wrong-doers, etc.).\n",
        "TRANSLATION_14": "If any one of them says: 'I am a god other than Him' We will recompense him with Gehenna (Hell). As such We recompense the harmdoers.\n",
        "TRANSLATION_15": "And whoever of them says, “I am a god besides Him,” We will reward him with Hell. Thus We reward the wrongdoers.\n",
        "TRANSLATION_16": "And whoever of them should say, \"Indeed, I am a god besides Him\"- that one We would recompense with Hell. Thus do We recompense the wrongdoers.\n",
        "TRANSLATION_17": "[21:29] And should any of them say, ‘I am a god besides Him’, that is, [besides] God, in other words, [a god] other than Him — and this is Iblīs, who summoned [others] to worship his soul and commanded that it be obeyed — such a one We will requite with Hell. Thus, in the same way that We requite him, We requite wrongdoers, idolaters.\n",
        "TRANSLATION_18": "(And one of them) of the angels; and it is said this means: of created beings (who should say: Lo! I am a God beside Him) beside Allah, (that one We should repay with hell) Hell will be his lot because of this. (Thus We repay wrong-doers) thus We repay disbelievers.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "21:29",
            "36:74",
            "10:106",
            "72:22",
            "21:98",
            "39:36",
            "53:58",
            "21:59",
            "26:93",
            "22:12"
        ],
        "BIBLE": [
            "prophets:isaiah:49:4",
            "prophets:i%20samuel:2:30",
            "prophets:i%20kings:1:30",
            "prophets:jeremiah:45:2",
            "prophets:zechariah:4:14",
            "prophets:jeremiah:10:11",
            "prophets:ii%20kings:8:10",
            "prophets:i%20kings:20:23",
            "prophets:ezekiel:6:10",
            "prophets:hosea:10:3"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:4:12"
        ]
    }
}