{
    "VERSE": "21:31",
    "ARABIC": "وَجَعَلْنَا فِى ٱلْأَرْضِ رَوَٰسِىَ أَن تَمِيدَ بِهِمْ وَجَعَلْنَا فِيهَا فِجَاجًا سُبُلًا لَّعَلَّهُمْ يَهْتَدُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "We placed firmly embedded mountains on the earth, so it would not move under them, and We put broad valleys as roadways in it, so that perhaps they might be guided.",
        "TRANSLATION_1": "We placed stabilisers in the earth so that as it revolved with them you lived undisturbed; and We provided passageways between them so that men may find their way;\n",
        "TRANSLATION_2": "And We placed firm mountains on earth lest it should sway with them, and We made wide paths in them that they may find their way;\n",
        "TRANSLATION_3": "We placed firm mountains on earth lest it would shake them away. We made wide roads for them so that they might have the right guidance.\n",
        "TRANSLATION_4": "And We have placed mountains as anchors in the earth so that it may not shake with them; and We kept wide roads in it, so that they may find guidance.\n",
        "TRANSLATION_5": "And We have placed on the earth firm mountains, lest it should shake with them, and We placed therein broad highways for them to pass through, that they may be guided.\n",
        "TRANSLATION_6": "And We have made great mountains in the earth lest it might be convulsed with them, and We have made in it wide ways that they may follow a right direction.\n",
        "TRANSLATION_7": "And We set in the earth firm mountains lest it should shake with them, and We set in it ravines to serve as ways, that haply so they may be guided;\n",
        "TRANSLATION_8": "And We have placed in the earth firm hills lest it quake with them, and We have placed therein ravines as roads that haply they may find their way.\n",
        "TRANSLATION_9": "We set firm mountains upon the earth lest it should sway under them, and We placed therein passages for paths so that they might find their way.\n",
        "TRANSLATION_10": "And We have placed in the earth firm mountains lest it should move away with them, and We placed therein Passages for paths, that haply they may be guided.\n",
        "TRANSLATION_11": "We set firm mountains in the earth lest it should shake with them, and We made broad ways in them so that they may be guided [to their destinations].\n",
        "TRANSLATION_12": "And We have set on the earth mountains standing firm, lest it should shake with them, and We have made therein broad highways (between mountains) for them to pass through: that they may receive Guidance.\n",
        "TRANSLATION_13": "And We have placed on the earth firm mountains, lest it should shake with them, and We placed therein broad highways for them to pass through, that they may be guided.\n",
        "TRANSLATION_14": "We set firm mountains upon the earth lest it should shake with them, and We placed therein ravines to be paths so that they might be guided.\n",
        "TRANSLATION_15": "And We placed on earth stabilizers, lest it sways with them, and We placed therein signposts and passages, that they may be guided.\n",
        "TRANSLATION_16": "And We placed within the earth firmly set mountains, lest it should shift with them, and We made therein [mountain] passes [as] roads that they might be guided.\n",
        "TRANSLATION_17": "[21:31] And We set in the earth firm mountains lest it should shake with them, and We set in them, [in] the firm mountains, ravines, as roads (subulan substitutes [for fijājan, ‘ravines’, which are wide through-routes]), that perhaps they may be guided, to their destinations during travel.\n",
        "TRANSLATION_18": "(And We have placed in the earth firm hills) the mountains as pillars for it (lest it quake with them) lest the earth trembles with them on it, (and We have placed therein) in the earth (ravines) valleys (as roads) as spacious roads (that haply they may find their way) in their goings and comings.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "21:31",
            "16:15",
            "43:10",
            "19:40",
            "51:48",
            "71:20",
            "38:28",
            "26:152",
            "72:12",
            "28:5"
        ],
        "BIBLE": [
            "prophets:i%20kings:9:6",
            "prophets:judges:2:19",
            "torah:numbers:21:9",
            "prophets:i%20kings:14:8",
            "writings:psalms:17:4",
            "prophets:ii%20kings:12:10",
            "writings:psalms:50:21",
            "prophets:ii%20kings:6:19",
            "prophets:judges:9:25",
            "writings:psalms:104:9"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:13",
            "Sefer%20Yetzirah:4:3"
        ]
    }
}