{
    "VERSE": "21:33",
    "ARABIC": "وَهُوَ ٱلَّذِى خَلَقَ ٱلَّيْلَ وَٱلنَّهَارَ وَٱلشَّمْسَ وَٱلْقَمَرَ كُلٌّ فِى فَلَكٍ يَسْبَحُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "It is He who created night and day and the sun and moon, each one swimming in a sphere.",
        "TRANSLATION_1": "It is He who created night and day, the sun and the moon, revolving on its orbit.\n",
        "TRANSLATION_2": "It is He Who created the night and the day, and the sun and the moon. Each of them is floating in its orbit.\n",
        "TRANSLATION_3": "It is God who has created the night, the day, the Sun, and Moon and has made them swim in a certain orbit.\n",
        "TRANSLATION_4": "And it is He Who created the night and the day, and the sun and the moon; each one floats in an orbit.\n",
        "TRANSLATION_5": "And He it is Who has created the night and the day, and the sun and the moon, each in an orbit floating.\n",
        "TRANSLATION_6": "And He it is Who created the night and the day and the sun and the moon; all (orbs) travel along swiftly in their celestial spheres.\n",
        "TRANSLATION_7": "It is He who created the night and the day, the sun and the moon, each swimming in a sky.\n",
        "TRANSLATION_8": "And He it is Who created the night and the day, and the sun and the moon. They float, each in an orbit.\n",
        "TRANSLATION_9": "It is He who created the night and the day, and the sun and the moon, each gliding in its orbit.\n",
        "TRANSLATION_10": "And He it is Who hath created the night and the day, and the sun and the moon, each in an orb floating.\n",
        "TRANSLATION_11": "It is He who created the night and the day, the sun and the moon, each swimming in an orbit.\n",
        "TRANSLATION_12": "It is He Who created the Night and the Day, and the sun and the moon: all (the celestial bodies) swim along, each in its rounded course.\n",
        "TRANSLATION_13": "And He it is Who has created the night and the day, and the sun and the moon, each in an orbit floating.\n",
        "TRANSLATION_14": "It is He who created the night and the day, and the sun and the moon; each floating in an orbit.\n",
        "TRANSLATION_15": "It is He who created the night and the day, and the sun and the moon; each floating in an orbit.\n",
        "TRANSLATION_16": "And it is He who created the night and the day and the sun and the moon; all [heavenly bodies] in an orbit are swimming.\n",
        "TRANSLATION_17": "[21:33] And He it is Who created the night and the day, and the sun and the moon, each (kullun, the nunation of this [particle] stands in place of the second noun [of the genitive construction] that would have been alshams, ‘the sun’, or al-qamar, ‘the moon’, or their subsidiaries, namely, al-nujūm, ‘the stars’) in an orbit, a circular [one] like a mill in the sky, swimming, moving with speed, like a swimmer in water. In order to effect the analogy with the latter, the plural person [of the verb employed] for rational beings is used.\n",
        "TRANSLATION_18": "(And He it is Who created the night and the day, and the sun and the moon) He made the sun and the moon subservient. (They float, each in an orbit) each one of them rotate around its orbit.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "21:33",
            "36:40",
            "14:33",
            "31:29",
            "35:13",
            "41:37",
            "16:12",
            "39:5",
            "21:20",
            "75:9"
        ],
        "BIBLE": [
            "writings:psalms:121:6",
            "torah:genesis:2:4",
            "writings:psalms:22:3",
            "writings:psalms:74:16",
            "prophets:jeremiah:31:35",
            "torah:genesis:2:3",
            "writings:psalms:42:4",
            "torah:genesis:1:16",
            "torah:deuteronomy:4:32",
            "prophets:isaiah:60:19"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:11",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:14"
        ]
    }
}