{
    "VERSE": "21:35",
    "ARABIC": "كُلُّ نَفْسٍ ذَآئِقَةُ ٱلْمَوْتِ وَنَبْلُوكُم بِٱلشَّرِّ وَٱلْخَيْرِ فِتْنَةً وَإِلَيْنَا تُرْجَعُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Every self will taste death. We test you with both good and evil as a trial. And you will be returned to Us.",
        "TRANSLATION_1": "Every soul will know the taste of death. We tempt you with evil and with good as a trial; and to Us you will return.\n",
        "TRANSLATION_2": "Every living being shall taste death and We shall subject you to ill and good by way of trial, and to Us shall all of you be eventually sent back.\n",
        "TRANSLATION_3": "Every soul has to experience the taste of death. We test you with both hardships and blessings. In the end you will all return to Us.\n",
        "TRANSLATION_4": "Every living being must taste death; and We test you with harm and with good – a trial; and to Us only you have to return.\n",
        "TRANSLATION_5": "Everyone is going to taste death, and We shall test you with evil and with good by way of trial. And to Us you will be returned.\n",
        "TRANSLATION_6": "Every soul must taste of death and We try you by evil and good by way of probation; and to Us you shall be brought back.\n",
        "TRANSLATION_7": "Every soul shall taste of death; and We try you with evil and good for a testing, then unto Us you shall be returned.\n",
        "TRANSLATION_8": "Every soul must taste of death, and We try you with evil and with good, for ordeal. And unto Us ye will be returned.\n",
        "TRANSLATION_9": "Every soul shall taste death; We test you with both good and evil [circumstances] as a trial. To Us you shall return.\n",
        "TRANSLATION_10": "Every soul is going to taste of death, and We shall prove you with evil and good as a temptation; and unto Us ye shall be returned.\n",
        "TRANSLATION_11": "Every soul shall taste death, and We will test you with good and ill by way of test, and to Us you will be brought back.\n",
        "TRANSLATION_12": "Every soul shall have a taste of death: and We test you by evil and by good by way of trial. to Us must ye return.\n",
        "TRANSLATION_13": "Everyone is going to taste death, and We shall make a trial of you with evil and with good, and to Us you will be returned.\n",
        "TRANSLATION_14": "Every soul shall taste death. We will try you with a trial of evil and good. Then, to Us you shall be returned.\n",
        "TRANSLATION_15": "Every soul will taste death. We burden you with adversity and prosperity—a test. And to Us you will be returned.\n",
        "TRANSLATION_16": "Every soul will taste death. And We test you with evil and with good as trial; and to Us you will be returned.\n",
        "TRANSLATION_17": "[21:35] Every soul shall taste death, in this world, and We will try you, We will test you, with ill and good, such as poverty and wealth, sickness and health, as an ordeal (fitnatan, an object denoting reason, in other words, for the purpose of seeing whether you will be patient and give thanks or not). And then unto Us you shall be brought back, that We may requite you.\n",
        "TRANSLATION_18": "(Every soul) that is possessed of breath (must taste of death, and We try you) We test you (with evil and with good) with hardship and comfort, (for ordeal) both are a test from Allah. (And unto Us ye will be returned) after you die and then He will requite you for your works.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "21:35",
            "29:57",
            "24:12",
            "39:70",
            "9:88",
            "38:48",
            "16:111",
            "17:11",
            "56:60",
            "20:15"
        ],
        "BIBLE": [
            "prophets:ezekiel:35:9",
            "prophets:isaiah:48:15",
            "prophets:i%20samuel:9:27",
            "prophets:joshua:1:8",
            "torah:genesis:35:3",
            "prophets:isaiah:63:17",
            "prophets:isaiah:43:19",
            "torah:deuteronomy:31:29",
            "writings:nehemiah:8:12",
            "writings:daniel:2:25"
        ]
    }
}