{
    "VERSE": "21:37",
    "ARABIC": "خُلِقَ ٱلْإِنسَٰنُ مِنْ عَجَلٍ سَأُو۟رِيكُمْ ءَايَٰتِى فَلَا تَسْتَعْجِلُونِ",
    "ENGLISH": {
        "TRANSLATION_0": "Man was created hasty. I will show you My Signs so do not try to hasten Me.",
        "TRANSLATION_1": "Man is made of inordinate haste. We will show you Our signs, then you will not desire to hasten (the punishment).\n",
        "TRANSLATION_2": "Man is hasty by nature. I shall certainly show you My Signs. Do not ask Me to be hasty.\n",
        "TRANSLATION_3": "The human being is created hasty. Tell them, \"Do not be hasty, for God will soon show you the evidence of His existence\".\n",
        "TRANSLATION_4": "Man has been created hasty; very soon I shall show you My signs, do not be impatient.\n",
        "TRANSLATION_5": "Man is created of haste. I will show you My Ayat. So ask Me not to hasten (them).\n",
        "TRANSLATION_6": "Man is created of haste; now will I show to you My signs, therefore do not ask Me to hasten (them) on.\n",
        "TRANSLATION_7": "Man was created of haste. Assuredly I shall show you My signs; so demand not that I make haste.\n",
        "TRANSLATION_8": "Man is made of haste. I shall show you My portents, but ask Me not to hasten.\n",
        "TRANSLATION_9": "Man is a creature of haste. Soon I will show you My signs, but do not ask Me to hasten them.\n",
        "TRANSLATION_10": "Man was created of hast, surely I shall show you MY signs, so ask Me not to hasten.\n",
        "TRANSLATION_11": "Man is a creature of haste. Soon I will show you My signs. So do not ask Me to hasten.\n",
        "TRANSLATION_12": "Man is a creature of haste: soon (enough) will I show you My Signs; then ye will not ask Me to hasten them!\n",
        "TRANSLATION_13": "Man is created of haste, I will show you My Ayat (torments, proofs, evidences, verses, lessons, signs, revelations, etc.). So ask Me not to hasten (them).\n",
        "TRANSLATION_14": "The human was created of haste. Indeed, I will show you My signs; so do not ask Me to hasten them.\n",
        "TRANSLATION_15": "The human being was created of haste. I will show you My signs, so do not seek to rush Me.\n",
        "TRANSLATION_16": "Man was created of haste. I will show you My signs, so do not impatiently urge Me.\n",
        "TRANSLATION_17": "[21:37] The following was revealed regarding their demand that chastisement be hastened: Man was created of   haste, that is to say, because he is so hasty in his affairs, it is as if he had been created out of it. Assuredly I shall show you My signs, My promises of chastisement, so do not demand that I hasten, in [sending] it. And so He [God] made them suffer death at [the battle of] Badr.\n",
        "TRANSLATION_18": "(Man) i.e. Adam (is made of haste) he is hasty; it is also said that this means: man, al-Nadr Ibn al-Harth, was created hasty, for he wanted chastisement to be hastened for him. (I shall show you My portents) I shall show you the signs of My divine Oneness in the horizons; it is also said that this means: I will show the signs of My punishment of you through the sword on the Day of Badr, (but ask Me not to hasten) My chastisement before its appointed time.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "21:37",
            "96:2",
            "80:24",
            "55:3",
            "39:59",
            "4:28",
            "80:17",
            "26:4",
            "99:3",
            "23:66"
        ],
        "BIBLE": [
            "torah:exodus:30:32",
            "prophets:jeremiah:16:20",
            "writings:job:10:2",
            "torah:exodus:32:23",
            "torah:genesis:2:18",
            "torah:exodus:22:13",
            "prophets:ii%20samuel:23:5",
            "prophets:ezekiel:12:23",
            "writings:daniel:6:8",
            "torah:genesis:13:16"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:3:5",
            "Sefer%20Yetzirah:4:12"
        ]
    }
}