{
    "VERSE": "21:38",
    "ARABIC": "وَيَقُولُونَ مَتَىٰ هَٰذَا ٱلْوَعْدُ إِن كُنتُمْ صَٰدِقِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "They say, 'When will this promise come about if you are telling the truth?'",
        "TRANSLATION_1": "Yet they say: \"When will the promised threat come to pass, if you speak the truth?\"\n",
        "TRANSLATION_2": "They say: \"(Tell us) when will the threat of punishment come to pass if you are truthful?\"\n",
        "TRANSLATION_3": "They say, \"When shall the Day of Judgment come to pass if you are true in your claim?\"\n",
        "TRANSLATION_4": "And they say, “When will this promise occur, if you are truthful?\n",
        "TRANSLATION_5": "And they say: \"When will this promise (come to pass), if you are truthful.\"\n",
        "TRANSLATION_6": "And they say: When will this threat come to pass if you are truthful?\n",
        "TRANSLATION_7": "They say, 'And when shall the promise come to pass, if you speak truly?'\n",
        "TRANSLATION_8": "And they say: When will this promise (be fulfilled), if ye are truthful?\n",
        "TRANSLATION_9": "They ask, \"When will this promise be fulfilled, if what you say be true?\"\n",
        "TRANSLATION_10": "And they say: when cometh this torment if ye are truth- tellers!\n",
        "TRANSLATION_11": "And they say, ‘When will this promise be fulfilled, if you are truthful?’\n",
        "TRANSLATION_12": "They say: \"When will this promise come to pass, if ye are telling the truth?\"\n",
        "TRANSLATION_13": "And they say: \"When will this promise (come to pass), if you are truthful.\"\n",
        "TRANSLATION_14": "They say: 'If you are truthful, when will this promise come'\n",
        "TRANSLATION_15": "And they say, “When will this promise come true, if you are truthful?”\n",
        "TRANSLATION_16": "And they say, \"When is this promise, if you should be truthful?\"\n",
        "TRANSLATION_17": "[21:38] And they say, ‘When will this promise, of resurrection, be [fulfilled], if you are truthful?’, about it.\n",
        "TRANSLATION_18": "(And they say) i.e. the disbelievers of Mecca: (When will this promise) that you have promised us, Muhammad, ((be fulfilled), if ye are truthful?)\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "27:71",
            "10:48",
            "21:38",
            "36:48",
            "34:29",
            "67:25",
            "21:9",
            "32:28",
            "50:28",
            "17:108"
        ],
        "BIBLE": [
            "torah:genesis:46:33",
            "prophets:isaiah:65:24",
            "prophets:nahum:3:7",
            "prophets:jeremiah:15:2",
            "prophets:judges:21:3",
            "prophets:zechariah:13:3",
            "prophets:jeremiah:16:10",
            "torah:genesis:12:12",
            "torah:exodus:12:26",
            "prophets:jeremiah:3:16"
        ]
    }
}