{
    "VERSE": "21:40",
    "ARABIC": "بَلْ تَأْتِيهِم بَغْتَةً فَتَبْهَتُهُمْ فَلَا يَسْتَطِيعُونَ رَدَّهَا وَلَا هُمْ يُنظَرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "No, it will come upon them suddenly, confounding them, taking them completely by surprise, and they will not be able to ward it off. They will be granted no reprieve.",
        "TRANSLATION_1": "It will come upon them unawares confounding them, and they will not be able to keep it back, nor will they be given respite.\n",
        "TRANSLATION_2": "That will suddenly come upon them and stupefy them. They shall not be able to ward it off, nor shall they be granted any respite.\n",
        "TRANSLATION_3": "The fire will suddenly strike and confound them. They will not be able to repel it, nor will they be given any respite.\n",
        "TRANSLATION_4": "In fact it will suddenly come upon them, therefore shocking them, and they will not be able to repel it nor will they be given respite.\n",
        "TRANSLATION_5": "Nay, it will come upon them all of a sudden and will perplex them, and they will have no power to avert it nor will they get respite.\n",
        "TRANSLATION_6": "Nay, it shall come on them all of a sudden and cause them to become confounded, so they shall not have the power to avert it, nor shall they be respited.\n",
        "TRANSLATION_7": "Nay, but it shall come upon them suddenly, dumbfounding them, and they shall not be able to repel it, nor shall they be respited.\n",
        "TRANSLATION_8": "Nay, but it will come upon them unawares so that it will stupefy them, and they will be unable to repel it, neither will they be reprieved.\n",
        "TRANSLATION_9": "Indeed, it will come upon them suddenly and confound them; and they will not be able to ward it off, nor shall they be reprieved.\n",
        "TRANSLATION_10": "Aye! it would come upon them on a sudden and shall dumbfound them; they shall not be able to avert it, nor shall they be respited.\n",
        "TRANSLATION_11": "Indeed, it will overtake them suddenly, dumbfounding them. So they will neither be able to avert it, nor will they be granted any respite.\n",
        "TRANSLATION_12": "Nay, it may come to them all of a sudden and confound them: no power will they have then to avert it, nor will they (then) get respite.\n",
        "TRANSLATION_13": "Nay, it (the Fire or the Day of Resurrection) will come upon them all of a sudden and will perplex them, and they will have no power to avert it, nor will they get respite.\n",
        "TRANSLATION_14": "It will overtake them suddenly, dumbfounding them. They shall be unable to ward it off, and they shall not be respited.\n",
        "TRANSLATION_15": "In fact, it will come upon them suddenly, and bewilder them. They will not be able to repel it, and they will not be reprieved.\n",
        "TRANSLATION_16": "Rather, it will come to them unexpectedly and bewilder them, and they will not be able to repel it, nor will they be reprieved.\n",
        "TRANSLATION_17": "[21:40] Nay, but it, the Resurrection, shall come upon them suddenly, dumbfounding them, confusing them, and they shall not be able to ward it off, nor shall they be granted any respite, [nor shall they] be given any [extra] time to make a repentance or offer an excuse.\n",
        "TRANSLATION_18": "(Nay, but it) the Last Hour (will come upon them unawares) suddenly (so that it will stupefy them) so it will take them by surprise, (and they will be unable to repel it) from themselves, (neither will they be reprieved) nor will their chastisement be postponed.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "21:40",
            "26:202",
            "78:24",
            "26:157",
            "68:18",
            "51:45",
            "54:29",
            "52:33",
            "77:36",
            "7:119"
        ],
        "BIBLE": [
            "prophets:i%20samuel:26:8",
            "torah:leviticus:26:37",
            "torah:deuteronomy:8:18",
            "prophets:ezekiel:38:16",
            "prophets:ezekiel:22:4",
            "prophets:jeremiah:46:21",
            "writings:daniel:10:14",
            "torah:leviticus:23:27",
            "torah:numbers:29:1",
            "prophets:zechariah:14:18"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:12"
        ]
    }
}