{
    "VERSE": "21:42",
    "ARABIC": "قُلْ مَن يَكْلَؤُكُم بِٱلَّيْلِ وَٱلنَّهَارِ مِنَ ٱلرَّحْمَٰنِ بَلْ هُمْ عَن ذِكْرِ رَبِّهِم مُّعْرِضُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Say: 'Who will protect you night and day from the All-Merciful?' Yet they turn away from the remembrance of their Lord.",
        "TRANSLATION_1": "Say: \"Who guards you from Ar-Rahman by night and by day?\" Yet from a mention of their Lord they turn away.\n",
        "TRANSLATION_2": "Tell them, (O Muhammad): \"Who protects you, during the night or the day from the Most Compassionate Lord?\" And yet they turn away from the Admonition of their Lord.\n",
        "TRANSLATION_3": "Ask them, \"Who can protect them from (the wrath of) the Beneficent God during the night and day?\" Yet they are neglectful about their Lord.\n",
        "TRANSLATION_4": "Proclaim, “Who guards you night and day from the Most Gracious?” In fact they have turned away from the remembrance of their Lord.\n",
        "TRANSLATION_5": "Say: \"Who can guard and protect you in the night or in the day from the Most Gracious\" Nay, but they turn away from the remembrance of their Lord.\n",
        "TRANSLATION_6": "Say: Who guards you by night and by day from the Beneficent Allah? Nay, they turn aside at the mention of their Lord.\n",
        "TRANSLATION_7": "Say: 'Who shall guard you by night and in the daytime from the All-merciful?' Nay, but from the Remembrance of their Lord they are turning away.\n",
        "TRANSLATION_8": "Say: Who guardeth you in the night or in the day from the Beneficent? Nay, but they turn away from mention of their Lord!\n",
        "TRANSLATION_9": "Say, \"Who will save you from the wrath of the Most Gracious, by night and by day?\" Yet they turn away from the remembrance of their Lord.\n",
        "TRANSLATION_10": "Say thou: who guardeth you by night and by day from the Compassionate! O Yet from the remembrance of their Lord they avert themselves!\n",
        "TRANSLATION_11": "Say, ‘Who can guard you, day and night, against [the punishment of] the All-beneficent [should He want to punish you]?’ Indeed, they are disregardful of their Lord’s remembrance.\n",
        "TRANSLATION_12": "Say: \"Who can keep you safe by night and by day from (the Wrath of) (Allah) Most Gracious?\" Yet they turn away from the mention of their Lord.\n",
        "TRANSLATION_13": "Say: \"Who can guard and protect you in the night or in the day from the (punishment of the) Most Beneficent (Allah)?\" Nay, but they turn away from the remembrance of their Lord.\n",
        "TRANSLATION_14": "Say: 'Who will guard you, by night and by day from the Merciful' But no, they turn away from their Lord's remembrance.\n",
        "TRANSLATION_15": "Say, “Who guards you against the Merciful by night and by day?” But they turn away from the mention of their Lord.\n",
        "TRANSLATION_16": "Say, \"Who can protect you at night or by day from the Most Merciful?\" But they are, from the remembrance of their Lord, turning away.\n",
        "TRANSLATION_17": "[21:42] Say, to them: ‘Who can guard you, preserve you, by night and day from the Compassionate One?’, from His chastisement, if it should befall you? In other words, no one can do such a thing. Those being addressed [here] do not fear God’s chastisement because they deny [the truth of] it. Nay, but of the Remembrance of their Lord, that is, the Qur’ān, they are disregardful, failing to reflect on it.\n",
        "TRANSLATION_18": "(Say) Muhammad to the people of Mecca: (Who guardeth you) who protects you (in the night or in the day from the Beneficent) from the chastisement of the Beneficent? It is also said that this means: who protects you from the punishment of other than the Beneficent? (Nay, but they turn away from) but they disbelieve and discard the (the mention of their Lord) from the profession of Allah's divine Oneness and the Scripture of their Lord,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "21:42",
            "13:10",
            "21:20",
            "41:38",
            "28:73",
            "15:56",
            "23:80",
            "71:5",
            "3:27",
            "21:112"
        ],
        "BIBLE": [
            "prophets:isaiah:12:1",
            "writings:lamentations:5:21",
            "prophets:malachi:3:7",
            "writings:lamentations:5:22",
            "prophets:joel:2:13",
            "prophets:isaiah:25:9",
            "torah:deuteronomy:31:18",
            "prophets:jonah:3:9",
            "prophets:jeremiah:15:5",
            "torah:deuteronomy:5:29"
        ]
    }
}