{
    "VERSE": "21:44",
    "ARABIC": "بَلْ مَتَّعْنَا هَٰٓؤُلَآءِ وَءَابَآءَهُمْ حَتَّىٰ طَالَ عَلَيْهِمُ ٱلْعُمُرُ أَفَلَا يَرَوْنَ أَنَّا نَأْتِى ٱلْأَرْضَ نَنقُصُهَا مِنْ أَطْرَافِهَآ أَفَهُمُ ٱلْغَٰلِبُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "No indeed! We have given these people enjoyment, as We did their fathers, until life seemed long and good to them. Do they not see how We come to the land eroding it from its extremities? Or are they the victors?",
        "TRANSLATION_1": "We allowed them and their fathers time to enjoy till the very end of their lives. Do they not see Us advancing into the land, reducing its frontiers? Would they still prevail?\n",
        "TRANSLATION_2": "Nay, We generously provided them and their fathers, and they enjoyed Our provision for long. Do they not see that We are now advancing into their territory, diminishing it from different sides? Is it they, then, who will triumph?\"\n",
        "TRANSLATION_3": "We have been providing these men and their fathers with the means of enjoyment for a long time. Have they not ever considered that We populated the earth and then caused many of the inhabitants to pass away? Can they have any success (in their wickedness)?\n",
        "TRANSLATION_4": "But in fact We have given these (disbelievers) and their fathers a benefit to the extent that life became long for them; so do they not see that We are reducing the land from its borders? So will these be victorious?\n",
        "TRANSLATION_5": "Nay, We gave the luxuries of this life to these men and their fathers until the period grew long for them. See they not that We gradually reduce the land from its outlying borders Is it then they who will overcome\n",
        "TRANSLATION_6": "Nay, We gave provision to these and their fathers until life was prolonged to them. Do they not then see that We are visiting the land, curtailing it of its sides? Shall they then prevail?\n",
        "TRANSLATION_7": "Nay, but Ourselves gave these and their fathers enjoyment of days, until their life had lasted long while upon them. What, do they not see how We come to the land, diminishing it in its extremities? Or are they the victors?\n",
        "TRANSLATION_8": "Nay, but We gave these and their fathers ease until life grew long for them. See they not how we aim to the land, reducing it of its outlying parts? Can they then be the victors?\n",
        "TRANSLATION_9": "Yet We bestowed the good things [of life] upon their fathers for a great length of time. But do they not see how We are shrinking their borders? Is it they who will prevail?\n",
        "TRANSLATION_10": "Aye! We let these people and their fathers enjoy until there grew long upon them the life. Behold they not that We come unto the land diminishing it by the borders thereof? Shall they then be the victors?\n",
        "TRANSLATION_11": "Indeed, We have provided for them and their fathers until they lived on for long years. Do they not see how We visit the land diminishing it at its edges? Are they the ones who will prevail?\n",
        "TRANSLATION_12": "Nay, We gave the good things of this life to these men and their fathers until the period grew long for them; See they not that We gradually reduce the land (in their control) from its outlying borders? Is it then they who will win?\n",
        "TRANSLATION_13": "Nay, We gave the luxuries of this life to these men and their fathers until the period grew long for them. See they not that We gradually reduce the land (in their control) from its outlying borders? Is it then they who will overcome.\n",
        "TRANSLATION_14": "We gave days of enjoyment to them and their fathers until their life became long. Are they unable to see how We come to their land and reduce its borders. Or, is it they who are the victors?\n",
        "TRANSLATION_15": "We have given these enjoyments, and their ancestors, until time grew long upon them. Do they not see how We gradually reduce the land from its extremities? Are they then the victors?\n",
        "TRANSLATION_16": "But, [on the contrary], We have provided good things for these [disbelievers] and their fathers until life was prolonged for them. Then do they not see that We set upon the land, reducing it from its borders? So it is they who will overcome?\n",
        "TRANSLATION_17": "[21:44] Nay, but We provided [comforts] for these and their fathers, in the way of the graces which We bestowed on them, until life lasted long for them, so that they were deluded by such [longevity]. Do they not see how We visit the land, [how] We target their land, diminishing it at its edges?, by granting the Prophet victory [through conquest]. Are they the ones who will prevail? No, it is rather the Prophet and his Companions [who will do so].\n",
        "TRANSLATION_18": "(Nay, but We gave these) the people of Mecca (and their fathers) before them (ease) a reprieve (until life grew long for them) until their lifespan grew long for them. (See they) i.e. the people of Mecca (not how we visit the land) how We seize the land, (reducing it) conquering it, for Muhammad (of its outlying parts) from its sides? (Can they then be the victors) are they then going to be victorious over Muhammad (pbuh)?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "21:44",
            "13:41",
            "10:78",
            "19:40",
            "52:36",
            "17:90",
            "26:152",
            "32:27",
            "44:29",
            "21:56"
        ],
        "BIBLE": [
            "writings:ecclesiastes:5:17",
            "writings:ecclesiastes:8:15",
            "prophets:jeremiah:16:19",
            "prophets:joshua:19:49",
            "torah:deuteronomy:12:1",
            "prophets:joshua:23:15",
            "prophets:jeremiah:30:3",
            "prophets:judges:18:10",
            "writings:ecclesiastes:7:15",
            "prophets:jeremiah:25:31"
        ]
    }
}