{
    "VERSE": "21:48",
    "ARABIC": "وَلَقَدْ ءَاتَيْنَا مُوسَىٰ وَهَٰرُونَ ٱلْفُرْقَانَ وَضِيَآءً وَذِكْرًا لِّلْمُتَّقِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "We gave to Musa and Harun the Discrimination and a Shining Light and a Reminder for those with taqwa:",
        "TRANSLATION_1": "We gave Moses and Aaron the Criterion, and a light and reminder for those who take heed for themselves,\n",
        "TRANSLATION_2": "Surely We had granted to Moses and Aaron the Criterion (between right and wrong), and Light and Admonition for the good of the God-fearing,\n",
        "TRANSLATION_3": "To Moses and Aaron We granted the criteria of discerning right from wrong, and We gave them the light and a reminder to the pious ones\n",
        "TRANSLATION_4": "And indeed We gave Moosa and Haroon the Judgement* and a light and an advice for the pious. (* The Holy Book Taurat.)\n",
        "TRANSLATION_5": "And indeed We granted to Musa and Harun the criterion, and a shining light and a Reminder for those who have Taqwa.\n",
        "TRANSLATION_6": "And certainly We gave to Musa and Haroun the Furqan and a light and a reminder for those who would guard (against evil).\n",
        "TRANSLATION_7": "We gave Moses and Aaron the Salvation and a Radiance, and a Remembrance for the godfearing\n",
        "TRANSLATION_8": "And We verily gave Moses and Aaron the Criterion (of right and wrong) and a light and a Reminder for those who keep from evil,\n",
        "TRANSLATION_9": "We gave Moses and Aaron the criterion of right and wrong and a light and reminder for the righteous,\n",
        "TRANSLATION_10": "And assuredly We vcuchsafed unto Musa and Harun the distinction and illumination and an admonition for the God-fearing.\n",
        "TRANSLATION_11": "Certainly We gave Moses and Aaron the Criterion, a light and reminder for the Godwary\n",
        "TRANSLATION_12": "In the past We granted to Moses and Aaron the criterion (for judgment), and a Light and a Message for those who would do right,-\n",
        "TRANSLATION_13": "And indeed We granted to Musa (Moses) and Harun (Aaron) the criterion (of right and wrong), and a shining light [i.e. the Taurat (Torah)] and a Reminder for Al-Muttaqun (the pious - see V. 2:2).\n",
        "TRANSLATION_14": "We gave Moses and Aaron the Criterion, and gave them a light and a Remembrance for the cautious:\n",
        "TRANSLATION_15": "We gave Moses and Aaron the Criterion, and illumination, and a reminder for the righteous.\n",
        "TRANSLATION_16": "And We had already given Moses and Aaron the criterion and a light and a reminder for the righteous\n",
        "TRANSLATION_17": "[21:48] And verily We gave Moses and Aaron the Criterion, the Torah that discriminates between truth and falsehood, and [between] what is lawful and unlawful, and an illumination, by it, and remembrance, an admonition therein, for those who are wary of God,\n",
        "TRANSLATION_18": "(And We verily gave Moses and Aaron the Criterion) the deliverer from dubious matters; it is also said that the Criterion means: victory and the upper hand over Pharaoh (and a light) which shows error (and a Reader) and an admonition (for those who keep from evil) for those who ward off idolatry, disbelief and indecencies.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "21:48",
            "37:114",
            "54:40",
            "54:32",
            "54:22",
            "54:17",
            "28:51",
            "15:24",
            "37:75",
            "34:20"
        ],
        "BIBLE": [
            "writings:nehemiah:8:8",
            "writings:psalms:72:1",
            "writings:psalms:18:36",
            "torah:genesis:31:42",
            "writings:psalms:118:27",
            "prophets:ezekiel:16:52",
            "writings:ii%20chronicles:34:14",
            "writings:psalms:28:4",
            "torah:numbers:20:12",
            "writings:job:3:20"
        ]
    }
}