{
    "VERSE": "21:49",
    "ARABIC": "ٱلَّذِينَ يَخْشَوْنَ رَبَّهُم بِٱلْغَيْبِ وَهُم مِّنَ ٱلسَّاعَةِ مُشْفِقُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "those who fear their Lord in the Unseen and are apprehensive about the Hour.",
        "TRANSLATION_1": "Who are fearful of their Lord inwardly and dread the Hour.\n",
        "TRANSLATION_2": "for those who fear their Lord without seeing Him and dread the Hour (of Reckoning).\n",
        "TRANSLATION_3": "who fear their unseen Lord and are anxious about the Day of Judgment.\n",
        "TRANSLATION_4": "Those who fear their Lord without seeing and who apprehend the Last Day.\n",
        "TRANSLATION_5": "Those who fear their Lord in the unseen, and they are afraid of the Hour.\n",
        "TRANSLATION_6": "(For) those who fear their Lord in secret and they are fearful of the hour.\n",
        "TRANSLATION_7": "such as fear God in the Unseen, trembling because of the Hour.\n",
        "TRANSLATION_8": "Those who fear their Lord in secret and who dread the Hour (of doom).\n",
        "TRANSLATION_9": "those who fear their Lord in the unseen, also dread the Hour of Judgement.\n",
        "TRANSLATION_10": "These who fear their Lord unseen, and who are of the Hour fearful.\n",
        "TRANSLATION_11": "—those who fear their Lord in secret, and who are apprehensive of the Hour.\n",
        "TRANSLATION_12": "Those who fear their Lord in their most secret thoughts, and who hold the Hour (of Judgment) in awe.\n",
        "TRANSLATION_13": "Those who fear their Lord without seeing Him, while they are afraid of the Hour.\n",
        "TRANSLATION_14": "those who fear Allah in the Unseen, tremble because of the Hour.\n",
        "TRANSLATION_15": "Those who fear their Lord in private, and are apprehensive of the Hour.\n",
        "TRANSLATION_16": "Who fear their Lord unseen, while they are of the Hour apprehensive.\n",
        "TRANSLATION_17": "[21:49] those who fear their Lord in concealment, from people, that is, when they are in seclusion from them, and who, on account of the Hour, that is, [on account of] its terrors, are apprehensive, fearful.\n",
        "TRANSLATION_18": "355 (Those who fear their Lord) those who work for their Lord (in secret) even if He is invisible to them (and who dread the Hour) and who dread the chastisement of the Last Day.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "21:49",
            "36:27",
            "2:3",
            "23:59",
            "16:42",
            "29:59",
            "18:36",
            "25:64",
            "23:58",
            "67:12"
        ],
        "BIBLE": [
            "prophets:i%20kings:3:28",
            "prophets:judges:6:22",
            "torah:exodus:20:7",
            "torah:deuteronomy:5:11",
            "writings:daniel:2:47",
            "writings:job:21:22",
            "prophets:joshua:23:3",
            "torah:genesis:16:13",
            "prophets:zephaniah:3:15",
            "torah:genesis:48:17"
        ]
    }
}