{
    "VERSE": "21:5",
    "ARABIC": "بَلْ قَالُوٓا۟ أَضْغَٰثُ أَحْلَٰمٍۭ بَلِ ٱفْتَرَىٰهُ بَلْ هُوَ شَاعِرٌ فَلْيَأْتِنَا بِـَٔايَةٍ كَمَآ أُرْسِلَ ٱلْأَوَّلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Furthermore they say, 'A muddled jumble of dreams!' and, 'He has invented it!' and, 'He is a poet!' and, 'Let him bring us a Sign like those sent to previous peoples.'",
        "TRANSLATION_1": "Yet they say: \"These are only confused dreams,\" or rather: \"He has invented them;\" or: \"He is only a poet. Let him therefore bring a miracle to us as the earlier (apostles) were sent with.\"\n",
        "TRANSLATION_2": "They say: \"Nay, these are confused dreams; nay, he has forged it; nay, he is a poet. So let him bring us a sign, even as the Messengers of the past were sent with signs.\"\n",
        "TRANSLATION_3": "They have said, \"It, (the Quran), is only the result of some confused dreams. He is only a poet. He should show us some miracles, as the ancient Prophets had done.\"\n",
        "TRANSLATION_4": "Rather they said, “These are confused dreams, but in fact he has fabricated it – but in fact he is a poet; so he must bring us some sign, like those who were sent before.”\n",
        "TRANSLATION_5": "Nay, they say: \"These are mixed up false dreams! Nay, he has invented it! -- Nay, he is a poet! Let him then bring us an Ayah like the ones that were sent before!\"\n",
        "TRANSLATION_6": "Nay! say they: Medleys of dreams; nay! he has forged it; nay! he is a poet; so let him bring to us a sign as the former (prophets) were sent (with).\n",
        "TRANSLATION_7": "Nay, but they say: 'A hotchpotch of nightmares! Nay, he has forged it; nay, he is a poet! Now therefore let him bring us a sign, even as the ancient ones were sent as Messengers.'\n",
        "TRANSLATION_8": "Nay, say they, (these are but) muddled dreams; nay, he hath but invented it; nay, he is but a poet. Let him bring us a portent even as those of old (who were Allah's messengers) were sent (with portents).\n",
        "TRANSLATION_9": "Some say, \"These are his confused dreams.\" Others say, \"He has invented it himself,\" and yet others say, \"He is a poet. Let him bring us a sign as previous messengers did.\"\n",
        "TRANSLATION_10": "Aye! they say: a medley of dreams; aye! he hath fabricated it; aye! he is a poet; so let him bring us a sign even as the ancients were sent with.\n",
        "TRANSLATION_11": "But they said, ‘[They are] muddled dreams!’ ‘Indeed, he has fabricated it!’ ‘Indeed, he is a poet!’ ‘Let him bring us a sign, like those sent to the former generations.’\n",
        "TRANSLATION_12": "Nay,\" they say, \"(these are) medleys of dream! - Nay, He forged it! - Nay, He is (but) a poet! Let him then bring us a Sign like the ones that were sent to (Prophets) of old!\"\n",
        "TRANSLATION_13": "Nay, they say:\"These (revelations of the Quran which are inspired to Muhammad SAW) are mixed up false dreams! Nay, he has invented it! Nay, he is a poet! Let him then bring us an Ayah (sign as a proof) like the ones (Prophets) that were sent before (with signs)!\"\n",
        "TRANSLATION_14": "Some say: 'No, it is only mixed dreams' 'No, he has forged it himself', or, 'no, he is a poet! Let him bring us a sign, just as the ancient ones were sent asMessengers'\n",
        "TRANSLATION_15": "And they said, “A jumble of dreams,” and, “He made it up,” and, “He is a poet,” “let him bring us a sign, like those sent to the ancients.”\n",
        "TRANSLATION_16": "But they say, \"[The revelation is but] a mixture of false dreams; rather, he has invented it; rather, he is a poet. So let him bring us a sign just as the previous [messengers] were sent [with miracles].\"\n",
        "TRANSLATION_17": "[21:5] Nay (bal, in the three instances [below] effects a transition from one subject to another) but they say, regarding those parts of the Qur’ān he [the Prophet] has brought [to them] are: ‘A muddle of nightmares, a confusion [of things] he has seen in [his] sleep. Nay, he has fabricated it, he has invented it; nay, he is a poet, and what he has brought is [merely] poetry! So let him bring us a sign, such as was sent to the ancients’, like the she-camel [Sālih], the staff and the [glowing] hand [of Moses]. God, exalted be He, says:\n",
        "TRANSLATION_18": "(Nay, say they) some of them say, ((these are but) muddled dreams) false dreams, that which Muhammad (pbuh) brought to us is but false dreams; (nay, he hath but invented it) some others say: Muhammad (pbuh) invented the Qur'an; (nay, he is but a poet) some of them said: no, he is a poet. (Let him bring us a 350 portent) a sign (even as those of old (who were God's messengers) were sent (with portents)) just as the messengers of old were sent with signs to their people, as he claims.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "21:5",
            "12:44",
            "17:59",
            "68:15",
            "83:13",
            "23:81",
            "24:59",
            "25:36",
            "26:154",
            "28:36"
        ],
        "BIBLE": [
            "prophets:isaiah:45:21",
            "torah:genesis:37:20",
            "prophets:isaiah:43:9",
            "prophets:i%20samuel:28:15",
            "torah:genesis:37:8",
            "torah:exodus:3:15",
            "torah:exodus:16:32",
            "torah:exodus:31:13",
            "prophets:ii%20kings:5:22",
            "torah:leviticus:21:17"
        ]
    }
}