{
    "VERSE": "21:51",
    "ARABIC": "وَلَقَدْ ءَاتَيْنَآ إِبْرَٰهِيمَ رُشْدَهُۥ مِن قَبْلُ وَكُنَّا بِهِۦ عَٰلِمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "We gave Ibrahim his right guidance early on, and We had complete knowledge of him.",
        "TRANSLATION_1": "We had earlier given Abraham true direction, for We knew him well.\n",
        "TRANSLATION_2": "Surely We had bestowed wisdom upon Abraham even earlier, and We knew him well.\n",
        "TRANSLATION_3": "To Abraham We gave the right guidance and We knew him very well.\n",
        "TRANSLATION_4": "And indeed We bestowed Ibrahim with guidance from the beginning, and We were Aware of him.\n",
        "TRANSLATION_5": "And indeed We bestowed aforetime on Ibrahim his guidance, and We were Well-Acquainted with him.\n",
        "TRANSLATION_6": "And certainly We gave to Ibrahim his rectitude before, and We knew him fully well.\n",
        "TRANSLATION_7": "We gave Abraham aforetime his rectitude -- for We knew him --\n",
        "TRANSLATION_8": "And We verily gave Abraham of old his proper course, and We were Aware of him,\n",
        "TRANSLATION_9": "Before this We gave Abraham his guidance. We knew him well.\n",
        "TRANSLATION_10": "And assuredly We vouchsafed un to lbrahim his rectitude aforetime, and him We had ever known.\n",
        "TRANSLATION_11": "Certainly We had given Abraham his probity before, and We knew him\n",
        "TRANSLATION_12": "We bestowed aforetime on Abraham his rectitude of conduct, and well were We acquainted with him.\n",
        "TRANSLATION_13": "And indeed We bestowed aforetime on Ibrahim (Abraham) his (portion of) guidance, and We were Well-Acquainted with him (as to his Belief in the Oneness of Allah, etc.).\n",
        "TRANSLATION_14": "Before this We gave Abraham his virtue, for We knew him.\n",
        "TRANSLATION_15": "We gave Abraham his integrity formerly, and We knew him well.\n",
        "TRANSLATION_16": "And We had certainly given Abraham his sound judgement before, and We were of him well-Knowing\n",
        "TRANSLATION_17": "[21:51] And verily We had given Abraham his rectitude before, that is, his [right] guidance before he came of age — and We were Aware of him, in that he was deserving of such [guidance],\n",
        "TRANSLATION_18": "(And We verily gave Abraham of old) before he reached the age of puberty; it is also said that this means: We honoured him with prophethood before Moses and Aaron; and it said that this means: before Muhammad (pbuh) (his proper course) i.e. knowledge and understanding, (and We were Aware of him) i.e. that he deserved it,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "21:51",
            "30:49",
            "21:41",
            "29:3",
            "20:115",
            "10:91",
            "15:10",
            "33:15",
            "69:9",
            "6:10"
        ],
        "BIBLE": [
            "torah:leviticus:6:10",
            "torah:genesis:25:5",
            "torah:genesis:47:22",
            "torah:deuteronomy:21:17",
            "prophets:jeremiah:11:18",
            "writings:nehemiah:13:10",
            "writings:daniel:2:23",
            "torah:genesis:25:6",
            "torah:genesis:35:12",
            "writings:job:38:36"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:1:13",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:1:4"
        ]
    }
}