{
    "VERSE": "21:54",
    "ARABIC": "قَالَ لَقَدْ كُنتُمْ أَنتُمْ وَءَابَآؤُكُمْ فِى ضَلَٰلٍ مُّبِينٍ",
    "ENGLISH": {
        "TRANSLATION_0": "He said, 'You and your fathers are clearly misguided.'",
        "TRANSLATION_1": "He said: \"You and your fathers were in clear error.\"\n",
        "TRANSLATION_2": "He said: \"Certainly you and your fathers have all been in manifest error.\"\n",
        "TRANSLATION_3": "He said, \"Both you and your fathers have certainly been in error.\"\n",
        "TRANSLATION_4": "He said, “Indeed you all – you and your forefathers – were in open error.”\n",
        "TRANSLATION_5": "He said: \"Indeed you and your fathers have been in manifest error.\"\n",
        "TRANSLATION_6": "He said: Certainly you have been, (both) you and your fathers, in manifest error.\n",
        "TRANSLATION_7": "He said, 'Then assuredly you and your fathers have been in manifest error.'\n",
        "TRANSLATION_8": "He said: Verily ye and your fathers were in plain error.\n",
        "TRANSLATION_9": "Abraham said, \"Indeed, you and your fathers have been clearly misguided.\"\n",
        "TRANSLATION_10": "He said: assuredlY ye, ye and your fathers, have been in error manifest.\n",
        "TRANSLATION_11": "He said, ‘Certainly you and your fathers have been in manifest error.’\n",
        "TRANSLATION_12": "He said, \"Indeed ye have been in manifest error - ye and your fathers.\"\n",
        "TRANSLATION_13": "He said: \"Indeed you and your fathers have been in manifest error.\"\n",
        "TRANSLATION_14": "He said: 'Truly, you and your fathers are in clear error'\n",
        "TRANSLATION_15": "He said, “You and your parents are in evident error.”\n",
        "TRANSLATION_16": "He said, \"You were certainly, you and your fathers, in manifest error.\"\n",
        "TRANSLATION_17": "[21:54] He said, to them, ‘Truly you and your fathers, by worshipping them, have been in manifest error’.\n",
        "TRANSLATION_18": "(He said) Abraham said to them: (Verily ye and your fathers) before you (were in plain error) in disbelief and manifest error.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "21:54",
            "12:8",
            "37:72",
            "21:53",
            "12:61",
            "36:24",
            "26:97",
            "15:24",
            "44:36",
            "37:69"
        ],
        "BIBLE": [
            "torah:genesis:31:5",
            "torah:genesis:47:9",
            "prophets:i%20samuel:20:9",
            "prophets:jeremiah:50:7",
            "prophets:i%20kings:21:3",
            "torah:genesis:24:34",
            "torah:genesis:27:18",
            "torah:genesis:27:26",
            "prophets:i%20samuel:20:32",
            "torah:exodus:2:18"
        ]
    }
}