{
    "VERSE": "21:55",
    "ARABIC": "قَالُوٓا۟ أَجِئْتَنَا بِٱلْحَقِّ أَمْ أَنتَ مِنَ ٱللَّٰعِبِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "They said, 'Have you brought us the truth or are you playing games?'",
        "TRANSLATION_1": "They said: \"Are you speaking in earnest, or only jesting?\"\n",
        "TRANSLATION_2": "They said: \"Are you expressing your true ideas before us or are you jesting?\"\n",
        "TRANSLATION_3": "They exclaimed, \"Have you brought the Truth or are you joking?\"\n",
        "TRANSLATION_4": "They said, “Have you brought the Truth to us, or are you just making fun?”\n",
        "TRANSLATION_5": "They said: \"Have you brought us the Truth, or are you one of those who play about\"\n",
        "TRANSLATION_6": "They said: Have you brought to us the truth, or are you one of the triflers?\n",
        "TRANSLATION_7": "They said, 'What, hast thou come to us with the truth, or art thou one of those that play?'\n",
        "TRANSLATION_8": "They said: Bringest thou unto us the truth, or art thou some jester?\n",
        "TRANSLATION_9": "They said, \"Have you brought us the truth or are you jesting?\"\n",
        "TRANSLATION_10": "They said: hast thou come unto us with the truth, or art thou of those who sport?\n",
        "TRANSLATION_11": "They said, ‘Are you telling the truth, or are you [just] kidding?’\n",
        "TRANSLATION_12": "They said, \"Have you brought us the Truth, or are you one of those who jest?\"\n",
        "TRANSLATION_13": "They said: \"Have you brought us the truth, or are you one of those who play about?\"\n",
        "TRANSLATION_14": "They said: 'Is it the truth you have brought us, or are you one of those that play'\n",
        "TRANSLATION_15": "They said, “Are you telling us the truth, or are you just playing?”\n",
        "TRANSLATION_16": "They said, \"Have you come to us with truth, or are you of those who jest?\"\n",
        "TRANSLATION_17": "[21:55] They said, ‘Do you bring us the truth, in that which you are saying, or are you being frivolous?’, in this regard.\n",
        "TRANSLATION_18": "(They said) to Abraham: (Bringest thou unto us the Truth) is what you say serious, Abraham, (or art thou some jester) or are you mocking us?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "21:55",
            "15:55",
            "15:64",
            "23:90",
            "37:37",
            "7:181",
            "27:27",
            "2:42",
            "24:49",
            "7:118"
        ],
        "BIBLE": [
            "torah:deuteronomy:30:13",
            "torah:deuteronomy:30:12",
            "writings:esther:5:5",
            "prophets:ii%20samuel:3:13",
            "prophets:joshua:7:19",
            "prophets:i%20kings:17:13",
            "writings:daniel:2:25",
            "torah:genesis:38:24",
            "writings:nehemiah:2:4",
            "writings:esther:1:17"
        ]
    }
}