{
    "VERSE": "21:57",
    "ARABIC": "وَتَٱللَّهِ لَأَكِيدَنَّ أَصْنَٰمَكُم بَعْدَ أَن تُوَلُّوا۟ مُدْبِرِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "By Allah, I will devise some scheme against your idols when your backs are turned.'",
        "TRANSLATION_1": "I swear by God I will do something to your idols when you have turned your backs and gone.\"\n",
        "TRANSLATION_2": "By Allah, I shall certainly carry out my plan against your gods after you are gone.\"\n",
        "TRANSLATION_3": "Abraham said to himself, \"By God! I will devise a plan against their idols when they are away.\"\n",
        "TRANSLATION_4": "“And, by oath of Allah, I shall seek to harm your idols after you have gone away and turned your backs.”\n",
        "TRANSLATION_5": "And by Allah, I shall plot a plan for your idols after you have gone away and turned your backs.\"\n",
        "TRANSLATION_6": "And, by Allah! I will certainly do something against your idols after you go away, turning back.\n",
        "TRANSLATION_7": "And, by God, I shall assuredly outwit your idols, after you have gone away turning your backs.'\n",
        "TRANSLATION_8": "And, by Allah, I shall circumvent your idols after ye have gone away and turned your backs.\n",
        "TRANSLATION_9": "By the Lord, I will devise a plan against your deities after you have gone away and turned your backs!\"\n",
        "TRANSLATION_10": "And by Allah I shall surely devise a plot against your idols after ye turned away backward.\n",
        "TRANSLATION_11": "By Allah, I will devise a stratagem against your idols after you have gone away.’\n",
        "TRANSLATION_12": "And by Allah, I have a plan for your idols - after ye go away and turn your backs\"..\n",
        "TRANSLATION_13": "And by Allah, I shall plot a plan (to destroy) your idols after you have gone away and turned your backs.\"\n",
        "TRANSLATION_14": "By Allah, I will certainly outwit your idols as soon as you have turned your backs and gone'\n",
        "TRANSLATION_15": "“By God, I will have a plan for your statues after you have gone away.”\n",
        "TRANSLATION_16": "And [I swear] by Allah, I will surely plan against your idols after you have turned and gone away.\"\n",
        "TRANSLATION_17": "[21:57] And, by God, I shall devise [a stratagem] against your idols after you have gone away, with your backs turned’.\n",
        "TRANSLATION_18": "(And, by Allah) he said this to himself, (I shall circumvent) I shall demolish (your idols after ye have gone away and turned your backs) to go to the festival.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "21:57",
            "4:118",
            "16:56",
            "48:24",
            "28:87",
            "71:3",
            "3:158",
            "2:64",
            "37:152",
            "29:11"
        ],
        "BIBLE": [
            "prophets:joshua:7:8",
            "torah:genesis:18:22",
            "prophets:isaiah:50:5",
            "prophets:judges:4:18",
            "prophets:isaiah:42:17",
            "prophets:ii%20kings:5:11",
            "writings:song%20of%20songs:6:1",
            "prophets:joshua:7:12",
            "prophets:judges:2:17",
            "prophets:jeremiah:31:18"
        ]
    }
}