{
    "VERSE": "21:6",
    "ARABIC": "مَآ ءَامَنَتْ قَبْلَهُم مِّن قَرْيَةٍ أَهْلَكْنَٰهَآ أَفَهُمْ يُؤْمِنُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "None of the cities which We destroyed before them had iman. So will they?",
        "TRANSLATION_1": "Not one habitation that We destroyed before them had believed. So how can they believe?\n",
        "TRANSLATION_2": "Not one township that We destroyed before them believed. Would they, then, believe?\n",
        "TRANSLATION_3": "The people of the town whom We had destroyed also had no faith. Will these people then believe in God?\n",
        "TRANSLATION_4": "There is not a township before them which did not believe which We have not destroyed; so will they believe?\n",
        "TRANSLATION_5": "Not one of the towns of those which We destroyed, believed before them; will they then believe.\n",
        "TRANSLATION_6": "There did not believe before them any town which We destroyed, will they then believe?\n",
        "TRANSLATION_7": "Not one city that We destroyed before them believed; what then, will they not believe?\n",
        "TRANSLATION_8": "Not a township believed of those which We destroyed before them (though We sent them portents): would they then believe?\n",
        "TRANSLATION_9": "Before them, not one of the communities which We destroyed believed either. Will these believe?\n",
        "TRANSLATION_10": "Not a city before them which We destroyed believed; will they then believe?\n",
        "TRANSLATION_11": "No town that We destroyed before them believed. Will these then have faith [if they are sent signs]?\n",
        "TRANSLATION_12": "(As to those) before them, not one of the populations which We destroyed believed: will these believe?\n",
        "TRANSLATION_13": "Not one of the towns (populations), of those which We destroyed, believed before them (though We sent them signs), will they then believe?\n",
        "TRANSLATION_14": "Of the villages We destroyed, there was not one that believed. What, will they not believe?\n",
        "TRANSLATION_15": "None of the towns We destroyed before them had believed. Will they, then, believe?\n",
        "TRANSLATION_16": "Not a [single] city which We destroyed believed before them, so will they believe?\n",
        "TRANSLATION_17": "[21:6] No town before them ever believed — meaning [none of] its inhabitants — of those that We destroyed, for the denial of the signs brought to them. Would they then believe? No.\n",
        "TRANSLATION_18": "Allah then says: (Not a township) not a single population of a township (believed of those which We destroyed) when they disbelieved in the signs (before them) before your people: (would they then believe) would your people then believe in the signs? Nay, they will not.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "21:6",
            "36:31",
            "26:208",
            "41:48",
            "39:50",
            "34:44",
            "10:91",
            "21:34",
            "32:26",
            "15:4"
        ],
        "BIBLE": [
            "torah:numbers:14:11",
            "prophets:hosea:2:25",
            "prophets:ezekiel:26:17",
            "writings:i%20chronicles:4:33",
            "writings:ii%20chronicles:32:14",
            "prophets:hosea:4:6",
            "prophets:zephaniah:3:6",
            "prophets:jeremiah:10:2",
            "writings:ii%20chronicles:32:15",
            "torah:numbers:21:2"
        ]
    }
}