{
    "VERSE": "21:61",
    "ARABIC": "قَالُوا۟ فَأْتُوا۟ بِهِۦ عَلَىٰٓ أَعْيُنِ ٱلنَّاسِ لَعَلَّهُمْ يَشْهَدُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "They said, 'Bring him before the people's eyes so they can be witnesses.'",
        "TRANSLATION_1": "Bring him before the people,\" they said, \"that they may bear witness.\"\n",
        "TRANSLATION_2": "The others said: \"Bring him, then, before the eyes of the people that they may see (what will be done to him).\"\n",
        "TRANSLATION_3": "Their chiefs said, \"Bring him before the eyes of the people and let them testify that he has spoken against the idols.\"\n",
        "TRANSLATION_4": "They said, “Therefore bring him in front of the people, perhaps they may testify.”\n",
        "TRANSLATION_5": "They said: \"Then bring him before the eyes of the people, that they may testify.\"\n",
        "TRANSLATION_6": "Said they: Then bring him before the eyes of the people, perhaps they may bear witness.\n",
        "TRANSLATION_7": "They said, 'Bring him before the people's eyes; haply they shall bear witness.'\n",
        "TRANSLATION_8": "They said: Then bring him (hither) before the people's eyes that they may testify.\n",
        "TRANSLATION_9": "They said, \"Then bring him here in the sight of all the people, so that they may act as witnesses.\"\n",
        "TRANSLATION_10": "They said: bring him then before the eyes of the people, haply they may bear witness.\n",
        "TRANSLATION_11": "They said, ‘Bring him before the people’s eyes so that they may bear witness [against him].’\n",
        "TRANSLATION_12": "They said, \"Then bring him before the eyes of the people, that they may bear witness.\"\n",
        "TRANSLATION_13": "They said: \"Then bring him before the eyes of the people, that they may testify.\"\n",
        "TRANSLATION_14": "They said: 'Then bring him here so that the people may see, so that they may bear witness'\n",
        "TRANSLATION_15": "They said, “Bring him before the eyes of the people, so that they may witness.”\n",
        "TRANSLATION_16": "They said, \"Then bring him before the eyes of the people that they may testify.\"\n",
        "TRANSLATION_17": "[21:61] They said, ‘Then bring him before the people’s eyes, that is, openly, that they may testify’, against him as being the perpetrator.\n",
        "TRANSLATION_18": "(They said) Nimrod said to them: (Then bring him (hither) before the people's eyes) in the presence of people (that they may testify) that he did it; and it is said that this means: that they may testify that he said he will demolish them; and it is also said that this means: that they may witness his punishment.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "21:61",
            "7:116",
            "83:28",
            "83:2",
            "26:39",
            "16:44",
            "37:45",
            "114:1",
            "36:66",
            "8:26"
        ],
        "BIBLE": [
            "torah:exodus:33:12",
            "prophets:joshua:24:27",
            "prophets:i%20kings:18:24",
            "torah:exodus:3:12",
            "writings:ruth:2:13",
            "torah:deuteronomy:4:6",
            "prophets:jeremiah:15:1",
            "torah:deuteronomy:28:67",
            "torah:exodus:33:17",
            "torah:numbers:32:5"
        ]
    }
}