{
    "VERSE": "21:62",
    "ARABIC": "قَالُوٓا۟ ءَأَنتَ فَعَلْتَ هَٰذَا بِـَٔالِهَتِنَا يَٰٓإِبْرَٰهِيمُ",
    "ENGLISH": {
        "TRANSLATION_0": "They said, 'Did you do this to our gods, Ibrahim?'",
        "TRANSLATION_1": "Did you do this to our gods, O Abraham?\" they enquired.\n",
        "TRANSLATION_2": "(On Abraham's arrival) they said: \"Abraham, are you he who has done this to our gods?\"\n",
        "TRANSLATION_3": "They asked, \"Abraham, did you do this to our idols?\"\n",
        "TRANSLATION_4": "They said, “Did you do this to our Gods, O Ibrahim?”\n",
        "TRANSLATION_5": "They said: \"Are you the one who has done this to our gods, O Ibrahim\"\n",
        "TRANSLATION_6": "They said: Have you done this to our gods, O Ibrahim?\n",
        "TRANSLATION_7": "They said, 'So, art thou the man who did this unto our gods, Abraham?'\n",
        "TRANSLATION_8": "They said: Is it thou who hast done this to our gods, O Abraham?\n",
        "TRANSLATION_9": "They said, \"Abraham, was it you who did this to our deities?\"\n",
        "TRANSLATION_10": "They said: art thou the one who hath wrought this unto our gods, O Ibrahim?\n",
        "TRANSLATION_11": "They said, ‘Was it you who did this to our gods, O Abraham?’\n",
        "TRANSLATION_12": "They said, \"Art thou the one that did this with our gods, O Abraham?\"\n",
        "TRANSLATION_13": "They said: \"Are you the one who has done this to our gods, O Ibrahim (Abraham)?\"\n",
        "TRANSLATION_14": "Abraham' they said, 'was it you who did this to our gods'\n",
        "TRANSLATION_15": "They said, “Are you the one who did this to our gods, O Abraham?”\n",
        "TRANSLATION_16": "They said, \"Have you done this to our gods, O Abraham?\"\n",
        "TRANSLATION_17": "[21:62] They said, to him, after he had been brought [before them]: ‘So, is it you (read a-anta, [either] pronouncing fully the two hamzas; or substituting an alif for the second one, or not pronouncing it [the second one], and inserting an alif between the one not pronounced and the other one, or without [this insertion]) who has done this to our gods, O Abraham?’\n",
        "TRANSLATION_18": "(They said) Nimrod said to him: (Is it thou who hast done this) i.e. breaking them (to our gods, Abraham?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "21:62",
            "46:22",
            "2:15",
            "21:59",
            "19:46",
            "37:91",
            "11:53",
            "96:14",
            "40:63",
            "9:43"
        ],
        "BIBLE": [
            "prophets:i%20kings:17:18",
            "writings:job:36:23",
            "writings:ruth:2:19",
            "torah:genesis:3:9",
            "prophets:ezekiel:37:3",
            "writings:psalms:68:29",
            "torah:numbers:23:23",
            "prophets:i%20kings:13:14",
            "torah:numbers:22:9",
            "prophets:i%20samuel:11:13"
        ]
    }
}