{
    "VERSE": "21:63",
    "ARABIC": "قَالَ بَلْ فَعَلَهُۥ كَبِيرُهُمْ هَٰذَا فَسْـَٔلُوهُمْ إِن كَانُوا۟ يَنطِقُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "He said, 'No, this one, the biggest of them, did it. Ask them if they are able to speak!'",
        "TRANSLATION_1": "No,\" he said. \"It was done by that chief of theirs. Ask him in case they can speak.\"\n",
        "TRANSLATION_2": "He answered: \"Rather it was this supreme one who has done it. So ask them, if they can speak.\"\n",
        "TRANSLATION_3": "He replied, \"I think the biggest among them has broken the smaller ones. Ask them if they are able to speak\".\n",
        "TRANSLATION_4": "Said he, “Rather, their chief may have done it; so question them, if they can speak.”\n",
        "TRANSLATION_5": "He said: \"Nay, this one, the biggest of them did it. Ask them, if they can speak!\"\n",
        "TRANSLATION_6": "He said: Surely (some doer) has done it; the chief of them is this, therefore ask them, if they can speak.\n",
        "TRANSLATION_7": "He said, 'No; it was this great one of them that did it. Question them; if they are able to speak!'\n",
        "TRANSLATION_8": "He said: But this, their chief hath done it. So question them, if they can speak.\n",
        "TRANSLATION_9": "He answered, \"Rather this biggest one of them did it. Ask them, if they can speak.\"\n",
        "TRANSLATION_10": "He said: rather he hath wrought it: this big one of them: so question them, if they ever speak.\n",
        "TRANSLATION_11": "He said, ‘No, it was this biggest one of them who did it! Ask them, if they can speak.’\n",
        "TRANSLATION_12": "He said: \"Nay, this was done by - this is their biggest one! ask them, if they can speak intelligently!\"\n",
        "TRANSLATION_13": "[Ibrahim (Abraham)] said: \"Nay, this one, the biggest of them (idols) did it. Ask them, if they can speak!\"\n",
        "TRANSLATION_14": "No' he replied. 'It was their great one amongst them that did it. Ask them, if they are able to speak'\n",
        "TRANSLATION_15": "He said, “But it was this biggest of them that did it. Ask them, if they can speak.”\n",
        "TRANSLATION_16": "He said, \"Rather, this - the largest of them - did it, so ask them, if they should [be able to] speak.\"\n",
        "TRANSLATION_17": "[21:63] He said, concealing his deed: ‘Rather it was this principal one among them did it. So question them, about the perpetrator of this, if they can speak!’ (here the response to the conditional statement precedes [the conditional clause]; in the preceding clause there is an intimation for them that an idol, acknowledged as being incapable of action, cannot be a god).\n",
        "TRANSLATION_18": "He said) Abraham said: (But this, their chief) who has the axe on its shoulder (hath done it. So question them, if they can speak) so that they can inform you who broke them.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "21:63",
            "21:58",
            "79:20",
            "11:35",
            "26:60",
            "26:216",
            "68:21",
            "15:54",
            "37:157",
            "25:52"
        ],
        "BIBLE": [
            "writings:ezra:10:2",
            "writings:psalms:60:3",
            "writings:ii%20chronicles:20:37",
            "writings:nehemiah:1:3",
            "prophets:jonah:1:4",
            "prophets:jeremiah:1:14",
            "prophets:jeremiah:33:21",
            "writings:ezra:10:10",
            "prophets:jeremiah:28:2",
            "prophets:isaiah:21:9"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:1:13",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:4:3"
        ]
    }
}