{
    "VERSE": "21:64",
    "ARABIC": "فَرَجَعُوٓا۟ إِلَىٰٓ أَنفُسِهِمْ فَقَالُوٓا۟ إِنَّكُمْ أَنتُمُ ٱلظَّٰلِمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "They consulted among themselves and said, 'It is you yourselves who are wrongdoers.'",
        "TRANSLATION_1": "Then they thought and observed: \"Surely you are yourselves unjust.\"\n",
        "TRANSLATION_2": "Thereupon they turned to their (inner) selves and said (to themselves): \"Surely it is you who are the wrong-doers.\"\n",
        "TRANSLATION_3": "Thereupon they realized their own foolishness and said, \"We ourselves are wrong-doers\".\n",
        "TRANSLATION_4": "So they turned towards their own selves and (inwardly) said, “Indeed you yourselves are unjust.”\n",
        "TRANSLATION_5": "So they turned to themselves and said: \"Verily, you are the wrongdoers.\"\n",
        "TRANSLATION_6": "Then they turned to themselves and said: Surely you yourselves are the unjust;\n",
        "TRANSLATION_7": "So they returned one to another, and they said, 'Surely it is you who are the evildoers.'\n",
        "TRANSLATION_8": "Then gathered they apart and said: Lo! ye yourselves are the wrong-doers.\n",
        "TRANSLATION_9": "Then they turned to one another and said, \"It is you yourselves who are in the wrong,\"\n",
        "TRANSLATION_10": "They then turned to themselves, and said: verily ye it is who are the wrong-doers.\n",
        "TRANSLATION_11": "Thereat they came to themselves and said [to one another], ‘Indeed it is you who are the wrongdoers!’\n",
        "TRANSLATION_12": "So they turned to themselves and said, \"Surely ye are the ones in the wrong!\"\n",
        "TRANSLATION_13": "So they turned to themselves and said: \"Verily, you are the Zalimun (polytheists and wrong-doers).\"\n",
        "TRANSLATION_14": "So they returned one to another saying, 'Surely, it is you who are the harmdoers'\n",
        "TRANSLATION_15": "Then they turned to one another, and said, “You yourselves are the wrongdoers.”\n",
        "TRANSLATION_16": "So they returned to [blaming] themselves and said [to each other], \"Indeed, you are the wrongdoers.\"\n",
        "TRANSLATION_17": "[21:64] So they turned [thinking] to themselves, in reflection, and they said, to themselves: ‘Truly it is you who are the evildoers’, for worshipping that which cannot speak.\n",
        "TRANSLATION_18": "(Then gathered they apart) blaming themselves (and said) and their king Nimrod said: (Lo! ye yourselves are the wrong-doers) towards Abraham.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "21:64",
            "5:30",
            "28:33",
            "27:92",
            "81:7",
            "23:48",
            "20:41",
            "45:15",
            "11:21",
            "15:37"
        ],
        "BIBLE": [
            "prophets:ii%20kings:1:5",
            "prophets:jeremiah:36:16",
            "prophets:ii%20samuel:15:31",
            "prophets:i%20kings:22:32",
            "writings:ruth:4:1",
            "torah:genesis:32:7",
            "prophets:ii%20samuel:6:20",
            "writings:ii%20chronicles:18:31",
            "torah:genesis:42:28",
            "torah:genesis:30:30"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:1:13"
        ]
    }
}