{
    "VERSE": "21:65",
    "ARABIC": "ثُمَّ نُكِسُوا۟ عَلَىٰ رُءُوسِهِمْ لَقَدْ عَلِمْتَ مَا هَٰٓؤُلَآءِ يَنطِقُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "But then they relapsed back into their kufr: 'You know full well these idols cannot talk.'",
        "TRANSLATION_1": "Then crestfallen (they confessed): \"Truly, as you know, they cannot speak.\"\n",
        "TRANSLATION_2": "Then their minds were turned upside down, and they said: \"You know well that they do not speak.\"\n",
        "TRANSLATION_3": "With their heads cast down they said, \"Abraham, you know that idols do not speak. How then can you ask such a question?\"\n",
        "TRANSLATION_4": "Again they were inverted upon their heads; saying, “You know well that these do not speak.”\n",
        "TRANSLATION_5": "Then they turned to themselves: \"Indeed you know well that these speak not!\"\n",
        "TRANSLATION_6": "Then they were made to hang down their heads: Certainly you know that they do not speak.\n",
        "TRANSLATION_7": "Then they were utterly put to confusion saying, 'Very well indeed thou knowest these do not speak.'\n",
        "TRANSLATION_8": "And they were utterly confounded, and they said: Well thou knowest that these speak not.\n",
        "TRANSLATION_9": "then they hung their heads, and said, \"O Abraham! You know they cannot speak.\"\n",
        "TRANSLATION_10": "Thereafter they were made to turn over upon their heads, saying, assuredly thou knowest that they speak not.\n",
        "TRANSLATION_11": "Then they hung their heads. [However, they said,] ‘You certainly know that they cannot speak.’\n",
        "TRANSLATION_12": "Then were they confounded with shame: (they said), \"Thou knowest full well that these (idols) do not speak!\"\n",
        "TRANSLATION_13": "Then they turned to themselves (their first thought and said): \"Indeed you [Ibrahim (Abraham)] know well that these (idols) speak not!\"\n",
        "TRANSLATION_14": "But then they reversed their minds: 'You know they do not speak'\n",
        "TRANSLATION_15": "But they reverted to their old ideas: “You certainly know that these do not speak.”\n",
        "TRANSLATION_16": "Then they reversed themselves, [saying], \"You have already known that these do not speak!\"\n",
        "TRANSLATION_17": "[21:65] Then they were turned, by God, on their heads, that is to say, they were made to return to their disbelief and said, ‘By God, you are certainly aware that these [idols] cannot speak’, in other words, how can you thus command us to question them?\n",
        "TRANSLATION_18": "(And they were utterly confounded) and went back to their initial statement, (and they said) Nimrod said: (Well thou knowest) Abraham (that these speak not) that the idols do not speak, and this is why you broke them.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "21:65",
            "83:33",
            "17:41",
            "37:72",
            "15:97",
            "12:91",
            "26:199",
            "23:95",
            "4:80",
            "20:37"
        ],
        "BIBLE": [
            "prophets:judges:11:8",
            "torah:genesis:48:18",
            "writings:psalms:18:44",
            "prophets:ii%20kings:6:31",
            "writings:ezra:9:6",
            "writings:i%20chronicles:29:20",
            "torah:genesis:43:28",
            "prophets:ii%20kings:2:3",
            "prophets:ii%20kings:10:8",
            "writings:lamentations:3:54"
        ]
    }
}