{
    "VERSE": "21:67",
    "ARABIC": "أُفٍّ لَّكُمْ وَلِمَا تَعْبُدُونَ مِن دُونِ ٱللَّهِ أَفَلَا تَعْقِلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Shame on you and what you worship besides Allah! Will you not use your intellect?'",
        "TRANSLATION_1": "Fie on you and those you worship besides God! Will you not understand?\"\n",
        "TRANSLATION_2": "Fie upon you and upon all that you worship beside Allah. Do you have no sense?\"\n",
        "TRANSLATION_3": "Woe to you for what you worship instead of God. Have you no understanding?\"\n",
        "TRANSLATION_4": "“Disgrace be upon you and all the idols whom you worship instead of Allah; so do you not have sense?”\n",
        "TRANSLATION_5": "Fie upon you, and upon that which you worship besides Allah! Have you then no sense\"\n",
        "TRANSLATION_6": "Fie on you and on what you serve besides Allah; what! do you not then understand?\n",
        "TRANSLATION_7": "Fie upon you and that you serve apart from God! Do you not understand?'\n",
        "TRANSLATION_8": "Fie on you and all that ye worship instead of Allah! Have ye then no sense?\n",
        "TRANSLATION_9": "Shame on you and on whatever you worship instead of God. Can you not understand?\"\n",
        "TRANSLATION_10": "Fie upon you and upon that which ye worship beside Allah! Will ye not then reflect?\n",
        "TRANSLATION_11": "Fie on you and what you worship besides Allah! Do you not exercise your reason?’\n",
        "TRANSLATION_12": "Fie upon you, and upon the things that ye worship besides Allah! Have ye no sense?\"..\n",
        "TRANSLATION_13": "Fie upon you, and upon that which you worship besides Allah! Have you then no sense?\"\n",
        "TRANSLATION_14": "Shame on you and on that you worship other than Allah! Have you no understanding'\n",
        "TRANSLATION_15": "Fie on you, and on what you worship instead of God. Do you not understand?”\n",
        "TRANSLATION_16": "Uff to you and to what you worship instead of Allah. Then will you not use reason?\"\n",
        "TRANSLATION_17": "[21:67] Fie (read uffin or uffan, with the sense of a verbal noun, meaning ‘a putrid thing or a vile thing [be]’) on you and what you worship besides God, that is, other than Him. Do you not comprehend?’, that these idols are not worthy of being worshipped and are not fit for such [a purpose] — only God, exalted be He, is worthy of it.\n",
        "TRANSLATION_18": "(Fie on you and all that ye worship instead of Allah ! Have ye then no sense) do you not then have the common sense that human beings have? It does not befit one to worship something that does not benefit or harm.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "21:67",
            "21:66",
            "53:58",
            "26:93",
            "18:43",
            "16:20",
            "21:98",
            "39:36",
            "36:74",
            "37:86"
        ],
        "BIBLE": [
            "prophets:ii%20kings:17:12",
            "torah:deuteronomy:28:47",
            "writings:psalms:97:7",
            "prophets:jeremiah:25:6",
            "prophets:jeremiah:5:19",
            "prophets:jeremiah:22:9",
            "torah:numbers:18:32",
            "writings:job:12:3",
            "prophets:joshua:23:7",
            "writings:ii%20chronicles:7:19"
        ]
    }
}