{
    "VERSE": "21:68",
    "ARABIC": "قَالُوا۟ حَرِّقُوهُ وَٱنصُرُوٓا۟ ءَالِهَتَكُمْ إِن كُنتُمْ فَٰعِلِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "They said, 'Burn him and support your gods if you are resolved to do something.'",
        "TRANSLATION_1": "They said: \"Burn him, and save your gods, if you are men of action.\"\n",
        "TRANSLATION_2": "They said: \"Burn him, and come to the support of your gods, if you are going to do anything.\"\n",
        "TRANSLATION_3": "They said, \"Burn him to ashes if you want to help your gods\".\n",
        "TRANSLATION_4": "They said, “Burn him and help your Gods, if you want to.”\n",
        "TRANSLATION_5": "They said: \"Burn him and help your gods, if you will be doing.\"\n",
        "TRANSLATION_6": "They said: Burn him and help your gods, if you are going to do (anything).\n",
        "TRANSLATION_7": "They said, 'Burn him, and help your gods, if you would do aught.'\n",
        "TRANSLATION_8": "They cried: Burn him and stand by your gods, if ye will be doing.\n",
        "TRANSLATION_9": "They said, \"Burn him and help your deities, if you are resolved to do something.\"\n",
        "TRANSLATION_10": "They said: burn him, and succour your gods, if ye will be doing.\n",
        "TRANSLATION_11": "They said, ‘Burn him, and help your gods, if you are to do anything!’\n",
        "TRANSLATION_12": "They said, \"Burn him and protect your gods, If ye do (anything at all)!\"\n",
        "TRANSLATION_13": "They said: \"Burn him and help your aliha (gods), if you will be doing.\"\n",
        "TRANSLATION_14": "They said: 'Burn him and help your gods, if you are going to do anything'\n",
        "TRANSLATION_15": "They said, “Burn him and support your gods, if you are going to act.”\n",
        "TRANSLATION_16": "They said, \"Burn him and support your gods - if you are to act.\"\n",
        "TRANSLATION_17": "[21:68] They said, ‘Burn him, that is, [burn] Abraham, and stand by your gods, by having him burnt, if you are to do anything’, in the way of standing by them. Thus they gathered lots of firewood and lit a fire throughout it. They then tied up Abraham, placed him in a ballista and had him hurled into the fire. God, exalted be He, says:\n",
        "TRANSLATION_18": "(They cried) their king Nimrod said to them: (Burn him) in the Fire (and stand by your gods) and avenge your deities, (if ye will be doing) something to him; and they threw him in the Fire.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "21:68",
            "11:33",
            "2:15",
            "71:3",
            "3:158",
            "16:19",
            "37:152",
            "12:91",
            "47:7",
            "3:200"
        ],
        "BIBLE": [
            "writings:job:34:9",
            "torah:numbers:23:3",
            "torah:numbers:13:31",
            "prophets:i%20samuel:9:10",
            "prophets:i%20kings:13:14",
            "prophets:i%20samuel:30:22",
            "prophets:judges:9:7",
            "writings:ii%20chronicles:14:10",
            "torah:numbers:31:21",
            "torah:genesis:14:24"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:3:6"
        ]
    }
}