{
    "VERSE": "21:7",
    "ARABIC": "وَمَآ أَرْسَلْنَا قَبْلَكَ إِلَّا رِجَالًا نُّوحِىٓ إِلَيْهِمْ فَسْـَٔلُوٓا۟ أَهْلَ ٱلذِّكْرِ إِن كُنتُمْ لَا تَعْلَمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "We have only ever sent before you men who were given Revelation. Ask the People of the Reminder if you do not know.",
        "TRANSLATION_1": "Never did We send a message before you but through a man, whom We inspired. If you do not know, then ask the keepers of the oracles of God.\n",
        "TRANSLATION_2": "(O Muhammad), even before you We never sent any other than human beings as Messengers, and to them We sent revelation. Ask the People of the Book if you do not know.\n",
        "TRANSLATION_3": "The messengers that We had sent before you were only men to whom We had given revelation. Ask the People of the Book if you do not know.\n",
        "TRANSLATION_4": "And We did not send (Prophets) before you except men, to whom We sent divine revelations – therefore, O people, ask the people of knowledge if you do not know.\n",
        "TRANSLATION_5": "And We sent not before you but men to whom We revealed. So ask the people of the Reminder if you do not know.\n",
        "TRANSLATION_6": "And We did not send before you any but men to whom We sent revelation, so ask the followers of the reminder if you do not\n",
        "TRANSLATION_7": "And We sent none before thee, but men to whom We made revelation -- question the People of the Remembrance, if you do not know --\n",
        "TRANSLATION_8": "And We sent not (as Our messengers) before thee other than men, whom We inspired. Ask the followers of the Reminder if ye know not?\n",
        "TRANSLATION_9": "The messengers We sent before you were but men whom We had sent revelations. Ask the People of the Book if you do not know this --\n",
        "TRANSLATION_10": "And We sent not before thee but men unto whom We revealed; so ask the people of the Admonition if ye know not.\n",
        "TRANSLATION_11": "We did not send [any apostles] before you except as men to whom We revealed. Ask the People of the Reminder if you do not know.\n",
        "TRANSLATION_12": "Before thee, also, the messengers We sent were but men, to whom We granted inspiration: If ye realise this not, ask of those who possess the Message.\n",
        "TRANSLATION_13": "And We sent not before you (O Muhammad SAW) but men to whom We inspired, so ask the people of the Reminder [Scriptures - the Taurat (Torah), the Injeel (Gospel)] if you do not know.\n",
        "TRANSLATION_14": "We never sent (anyone) before you except men to whom We revealed to them. 'Ask the people of the Remembrance if you do not know'\n",
        "TRANSLATION_15": "We did not send before you except men, whom We inspired. Ask the people of knowledge, if you do not know.\n",
        "TRANSLATION_16": "And We sent not before you, [O Muhammad], except men to whom We revealed [the message], so ask the people of the message if you do not know.\n",
        "TRANSLATION_17": "[21:7] And We sent none before you other than men to whom We revealed (read nūhī or yūhā, ‘[to whom] it is revealed’) and [We sent] not any angels. Ask the People of the Remembrance, those with knowledge of the Torah and the Gospel, if you do not know, this; for they will know it. Since you are more likely to believe them than the believers are to believing Muhammad (s).\n",
        "TRANSLATION_18": "(And We sent not (as Our messengers) before you other than men) human beings like you (whom We inspired) to whom We sent angels just as We have sent to you. (Ask the followers of the Reminder) the people of the Torah and the Gospel (if you know not) that Allah sent only human messengers?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "21:7",
            "16:43",
            "36:50",
            "21:25",
            "52:26",
            "28:12",
            "12:109",
            "29:18",
            "27:57",
            "2:4"
        ],
        "BIBLE": [
            "prophets:jeremiah:44:20",
            "prophets:jeremiah:35:15",
            "writings:daniel:2:23",
            "torah:deuteronomy:3:20",
            "prophets:i%20samuel:22:8",
            "torah:deuteronomy:25:19",
            "writings:ii%20chronicles:19:6",
            "torah:deuteronomy:16:17",
            "torah:leviticus:19:20",
            "writings:ecclesiastes:5:18"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:3:6",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:1:6"
        ]
    }
}