{
    "VERSE": "21:72",
    "ARABIC": "وَوَهَبْنَا لَهُۥٓ إِسْحَٰقَ وَيَعْقُوبَ نَافِلَةً وَكُلًّا جَعَلْنَا صَٰلِحِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "And in addition to that We gave him Ishaq and Ya'qub and made both of them salihun.",
        "TRANSLATION_1": "And We bestowed on him Isaac, and Jacob as an additional gift, and made them righteous.\n",
        "TRANSLATION_2": "And We bestowed upon him Isaac and Jacob as an additional gift, making each of them righteous.\n",
        "TRANSLATION_3": "We granted him Isaac and Jacob as a gift and helped both of them to become righteous people.\n",
        "TRANSLATION_4": "And We bestowed him Ishaq, and Yaqub the grandson; and We made all of them worthy of Our proximity.\n",
        "TRANSLATION_5": "And We bestowed upon him Ishaq, and Ya`qub Nafilatan. Each one We made righteous.\n",
        "TRANSLATION_6": "And We gave him Ishaq and Yaqoub, a son's son, and We made (them) all good.\n",
        "TRANSLATION_7": "And We gave him Isaac and Jacob in superfluity, and every one made We righteous\n",
        "TRANSLATION_8": "And We bestowed upon him Isaac, and Jacob as a grandson. Each of them We made righteous.\n",
        "TRANSLATION_9": "We bestowed Isaac and then Jacob on him as an additional boon and We made all of them righteous.\n",
        "TRANSLATION_10": "And We bestowed upon him ls-haq and Ya qub as a grandson; and each one We made righteous.\n",
        "TRANSLATION_11": "And We gave him Isaac, and Jacob as well for a grandson, and each of them We made righteous.\n",
        "TRANSLATION_12": "And We bestowed on him Isaac and, as an additional gift, (a grandson), Jacob, and We made righteous men of every one (of them).\n",
        "TRANSLATION_13": "And We bestowed upon him Ishaque (Isaac), and (a grandson) Ya'qub (Jacob). Each one We made righteous.\n",
        "TRANSLATION_14": "We gave him, in excess, Isaac, and Jacob (for a grandson); and We made each righteous\n",
        "TRANSLATION_15": "And We granted him Isaac and Jacob as a gift; and each We made righteous.\n",
        "TRANSLATION_16": "And We gave him Isaac and Jacob in addition, and all [of them] We made righteous.\n",
        "TRANSLATION_17": "[21:72] And We gave him, namely, Abraham — for he had asked for a child, as mentioned in [sūrat] al-Sāffāt [Q. 37:100] — Isaac, and Jacob as a gift, that is, as [something] in addition to what was requested; or it means ‘a grandson’; and each of them, that is, himself and the two born of him, We made righteous, [We made them] prophets.\n",
        "TRANSLATION_18": "(And We bestowed upon him) i.e. upon Abraham (Isaac) as a son, (and Jacob) as a grandson. (Each of them) i.e. Abraham, Isaac, Jacob and their sons (We made righteous) in their religion, and messengers.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "21:72",
            "25:39",
            "39:70",
            "21:85",
            "19:49",
            "6:86",
            "29:57",
            "94:4",
            "10:79",
            "50:21"
        ],
        "BIBLE": [
            "torah:exodus:36:6",
            "writings:psalms:60:13",
            "writings:psalms:108:13",
            "prophets:nahum:1:14",
            "prophets:ii%20samuel:22:36",
            "writings:esther:4:8",
            "torah:leviticus:17:11",
            "prophets:jeremiah:44:20",
            "torah:genesis:2:18",
            "torah:genesis:3:6"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:3:5"
        ]
    }
}