{
    "VERSE": "21:75",
    "ARABIC": "وَأَدْخَلْنَٰهُ فِى رَحْمَتِنَآ إِنَّهُۥ مِنَ ٱلصَّٰلِحِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "We admitted him into Our mercy. He was one of the righteoys.",
        "TRANSLATION_1": "Thus We admitted him to Our grace. He is surely one of the righteous.\n",
        "TRANSLATION_2": "And We admitted him into Our mercy. Verily he was of the righteous.\n",
        "TRANSLATION_3": "We encompassed him in Our mercy; he was a righteous man.\n",
        "TRANSLATION_4": "And We admitted him into Our mercy; indeed he is among those who deserve Our proximity.\n",
        "TRANSLATION_5": "And We admitted him to Our mercy; truly, he was of the righteous.\n",
        "TRANSLATION_6": "And We took him into Our mercy; surely he was of the good.\n",
        "TRANSLATION_7": "and We admitted him into Our mercy; he was of the righteous.\n",
        "TRANSLATION_8": "And We brought him in unto Our mercy. Lo! he was of the righteous.\n",
        "TRANSLATION_9": "We admitted him to Our mercy; he was a righteous man.\n",
        "TRANSLATION_10": "And We caused him to enter into Our mercy; verily he was of the righteous.\n",
        "TRANSLATION_11": "And We admitted him into Our mercy. Indeed, he was one of the righteous.\n",
        "TRANSLATION_12": "And We admitted him to Our Mercy: for he was one of the Righteous.\n",
        "TRANSLATION_13": "And We admitted him to Our Mercy, truly, he was of the righteous.\n",
        "TRANSLATION_14": "We admitted him to Our Mercy, he was among the righteous.\n",
        "TRANSLATION_15": "And We admitted him into Our mercy; for He was one of the righteous.\n",
        "TRANSLATION_16": "And We admitted him into Our mercy. Indeed, he was of the righteous.\n",
        "TRANSLATION_17": "[21:75] And We admitted him into Our mercy, by Our saving him from his people. He was indeed one of the righteous.\n",
        "TRANSLATION_18": "(And We brought him in) and We will enter him in the Hereafter (unto Our mercy) into Our Paradise; it is also said that this means: We honoured him in this worldly life with prophethood. (Lo! he was of the righteous) in his religion, and was one of the messengers.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "21:75",
            "21:86",
            "26:5",
            "10:86",
            "15:56",
            "27:77",
            "52:28",
            "21:107",
            "11:9",
            "19:96"
        ],
        "BIBLE": [
            "prophets:joshua:7:17",
            "torah:genesis:2:22",
            "torah:numbers:17:24",
            "torah:numbers:31:11",
            "prophets:i%20kings:13:29",
            "prophets:joshua:7:18",
            "torah:deuteronomy:1:23",
            "prophets:ezekiel:3:21",
            "torah:genesis:42:30",
            "prophets:i%20samuel:5:1"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:3:6",
            "Sefer%20Yetzirah:4:11",
            "Sefer%20Yetzirah:6:4"
        ]
    }
}