{
    "VERSE": "21:8",
    "ARABIC": "وَمَا جَعَلْنَٰهُمْ جَسَدًا لَّا يَأْكُلُونَ ٱلطَّعَامَ وَمَا كَانُوا۟ خَٰلِدِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "We did not give them bodies which did not eat food, nor were they immortal.",
        "TRANSLATION_1": "We did not make their bodies immune to hunger, nor were they immortal.\n",
        "TRANSLATION_2": "We did not endow the Messengers with bodies that would need no food; nor were they immortals.\n",
        "TRANSLATION_3": "We had not made them such bodies that would not eat any food nor were they immortal.\n",
        "TRANSLATION_4": "And We did not create them without bodies so they would not eat food – nor that they abide on earth forever.\n",
        "TRANSLATION_5": "And We did not place them in bodies that did not eat food, nor were they immortals.\n",
        "TRANSLATION_6": "And We did not make them bodies not eating the food, and they were not to abide (forever).\n",
        "TRANSLATION_7": "nor did We fashion them as bodies that ate not food, neither were they immortal;\n",
        "TRANSLATION_8": "We gave them not bodies that would not eat food, nor were they immortals.\n",
        "TRANSLATION_9": "We did not give them bodies that needed no food, nor were they to live forever.\n",
        "TRANSLATION_10": "And We made them not bodies not eating food; nor were they to be abiders.\n",
        "TRANSLATION_11": "We did not make them bodies that did not eat food, nor were they immortal.\n",
        "TRANSLATION_12": "Nor did We give them bodies that ate no food, nor were they exempt from death.\n",
        "TRANSLATION_13": "And We did not create them (the Messengers, with) bodies that ate not food, nor were they immortals,\n",
        "TRANSLATION_14": "Nor did We make them bodies that ate no food, nor were they immortal.\n",
        "TRANSLATION_15": "We did not make them mere bodies that ate no food, nor were they immortal.\n",
        "TRANSLATION_16": "And We did not make the prophets forms not eating food, nor were they immortal [on earth].\n",
        "TRANSLATION_17": "[21:8] And We did not make them, namely, the messengers, bodies that did not eat food, nay, they eat it; and they were not immortal, in this world.\n",
        "TRANSLATION_18": "(We gave them not) i.e. the Prophet (bodies that would not eat food) or drink, (nor were they immortals) in this worldly life. Rather, they ate and drank and died. This verse was revealed about the people of Mecca when they said: how come this Messenger eats food and walks in the marketplace?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "21:8",
            "43:76",
            "89:18",
            "26:99",
            "107:3",
            "69:34",
            "27:85",
            "18:30",
            "37:116",
            "109:3"
        ],
        "BIBLE": [
            "torah:leviticus:17:11",
            "prophets:hosea:2:14",
            "prophets:ii%20samuel:22:36",
            "torah:leviticus:10:17",
            "writings:job:31:15",
            "torah:genesis:3:6",
            "torah:genesis:27:7",
            "writings:esther:4:8",
            "writings:psalms:118:18",
            "prophets:nahum:1:14"
        ]
    }
}