{
    "VERSE": "21:80",
    "ARABIC": "وَعَلَّمْنَٰهُ صَنْعَةَ لَبُوسٍ لَّكُمْ لِتُحْصِنَكُم مِّنۢ بَأْسِكُمْ فَهَلْ أَنتُمْ شَٰكِرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "We taught him the art of making garments for you to protect you against each others' violence, But do you show any thanks?",
        "TRANSLATION_1": "And We taught him the art of making coats of mail to shield you from each other's violence. Will you not be grateful even then?\n",
        "TRANSLATION_2": "It was We Who taught him the art of making coats of mail for your benefit so that it may protect you from each other's violence. Do you, then, give thanks?\n",
        "TRANSLATION_3": "We taught him the art of making coats of mail so that you could protect yourselves during a war. Will you then give thanks?\n",
        "TRANSLATION_4": "And We taught him to make a garment for you, to protect you from your hurt; so will you be thankful?\n",
        "TRANSLATION_5": "And We taught him the making of metal coats of mail (for battles), to protect you in your fighting. Are you then grateful\n",
        "TRANSLATION_6": "And We taught him the making of coats of mail for you, that they might protect you in your wars; will you then be grateful?\n",
        "TRANSLATION_7": "And We taught him the fashioning of garments for you, to fortify you against your violence; then are you thankful?\n",
        "TRANSLATION_8": "And We taught him the art of making garments (of mail) to protect you in your daring. Are ye then thankful?\n",
        "TRANSLATION_9": "We taught him the art of making coats of mail for you, to protect you in battle. Will you then give thanks?\n",
        "TRANSLATION_10": "And We taught him the art of making the coats of mail for you that it may protect you from your violence; are ye then thankful?\n",
        "TRANSLATION_11": "We taught him the making of coats of mail for you, to protect you from your [own] violence. Will you then be grateful?\n",
        "TRANSLATION_12": "It was We Who taught him the making of coats of mail for your benefit, to guard you from each other's violence: will ye then be grateful?\n",
        "TRANSLATION_13": "And We taught him the making of metal coats of mail (for battles), to protect you in your fighting. Are you then grateful?\n",
        "TRANSLATION_14": "We taught him the craft of making garments that fortify you against your own violence. Are you thankful?\n",
        "TRANSLATION_15": "And We taught him the making of shields for you, to protect you from your violence. Are you, then, appreciative?\n",
        "TRANSLATION_16": "And We taught him the fashioning of coats of armor to protect you from your [enemy in] battle. So will you then be grateful?\n",
        "TRANSLATION_17": "[21:80] And We taught him the art of making garments, namely, coats of mail — [which are called labūs] because they are worn (tulbas). He was the first [human being] to make them; hitherto there were [only] plates [of armour] — for you, as well as all mankind, to protect you (read nuhsinakum, [the subject being] ‘God’; or yuhsinakum, [the subject being] ‘David’; or tuhsinakum, [the subject being] ‘garments’) against your [mutual] violence, your wars against your enemies. Will you then, O people of Mecca, be thankful?, for My favours, by believing in the Messenger — in other words, be thankful to Me by [doing] this.\n",
        "TRANSLATION_18": "(And We taught him the art of making garments (of mail)) the art of making armours (to protect you in your daring) to protect you from the weapons of your enemy. (Are ye then thankful) of His blessings, which are these armours?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "21:80",
            "21:12",
            "69:8",
            "26:129",
            "6:43",
            "29:15",
            "40:84",
            "40:85",
            "40:79",
            "54:51"
        ],
        "BIBLE": [
            "writings:psalms:119:98",
            "torah:leviticus:11:43",
            "writings:job:31:15",
            "torah:leviticus:5:26",
            "torah:deuteronomy:20:12",
            "torah:exodus:30:37",
            "torah:leviticus:16:32",
            "writings:job:40:30",
            "writings:job:40:28",
            "prophets:micah:4:7"
        ]
    }
}