{
    "VERSE": "21:85",
    "ARABIC": "وَإِسْمَٰعِيلَ وَإِدْرِيسَ وَذَا ٱلْكِفْلِ كُلٌّ مِّنَ ٱلصَّٰبِرِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "And Ismail and Idris and Dhu'l-Kifl - each one was among the steadfast.",
        "TRANSLATION_1": "(Remember) Ishmael, Edris and Dhu'l-Kifl. They were men of fortitude,\n",
        "TRANSLATION_2": "And (We bestowed the same favour) upon Ishmael, Idris and Dhu al-Kifl, for they were all steadfast.\n",
        "TRANSLATION_3": "Ismael, Idris and Dhul Kifl all were people of great patience.\n",
        "TRANSLATION_4": "And remember Ismail, and Idrees, and Zul-Kifl; they were all patiently enduring.\n",
        "TRANSLATION_5": "And (remember) Isma`il, Idris and Dhul-Kifl: All were from among the patient.\n",
        "TRANSLATION_6": "And Ismail and Idris and Zulkifl; all were of the patient ones;\n",
        "TRANSLATION_7": "And Ishmael, Idris, Dhul Kifl -- each was of the patient,\n",
        "TRANSLATION_8": "And (mention) Ishmael, and Idris, and Dhu'l-Kifl. All were of the steadfast.\n",
        "TRANSLATION_9": "Remember Ishmael and Idris and Dhul Kifl: they were all patient and steadfast.\n",
        "TRANSLATION_10": "And Isma'il and ldris and Zul-Kifl! each were of the patient.\n",
        "TRANSLATION_11": "And [remember] Ishmael, Idris, and Dhul-Kifl—each of them was among the patient.\n",
        "TRANSLATION_12": "And (remember) Isma'il, Idris, and Zul-kifl, all (men) of constancy and patience;\n",
        "TRANSLATION_13": "And (remember) Isma'il (Ishmael), and Idris (Enoch) and Dhul-Kifl (Isaiah), all were from among As-Sabirin (the patient ones, etc.).\n",
        "TRANSLATION_14": "And Ishmael, Idris, and ThulKifl (the son of Job) each were patient.\n",
        "TRANSLATION_15": "And Ishmael, and Enoch, and Ezekiel; each was one of the steadfast.\n",
        "TRANSLATION_16": "And [mention] Ishmael and Idrees and Dhul-Kifl; all were of the patient.\n",
        "TRANSLATION_17": "[21:85] And, mention, Ishmael and Idrīs and Dhū’l-Kifl — all were of the patient, in [maintaining] obedience to God and staying away from acts of disobedience to Him.\n",
        "TRANSLATION_18": "(And (mention) Ishmael, and Idris, and Dhu'l-Kifl. All were of the steadfast) in fulfilling Allah's commands and avoiding all evil deeds.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "21:85",
            "38:48",
            "6:85",
            "21:72",
            "6:86",
            "25:39",
            "38:19",
            "37:7",
            "43:12",
            "23:22"
        ],
        "BIBLE": [
            "writings:job:32:1",
            "writings:job:34:36",
            "prophets:i%20samuel:2:26",
            "prophets:ezekiel:14:14",
            "writings:psalms:106:4",
            "writings:job:34:7",
            "prophets:i%20samuel:14:20",
            "writings:psalms:89:48",
            "prophets:zechariah:7:2",
            "prophets:i%20samuel:30:6"
        ]
    }
}