{
    "VERSE": "21:86",
    "ARABIC": "وَأَدْخَلْنَٰهُمْ فِى رَحْمَتِنَآ إِنَّهُم مِّنَ ٱلصَّٰلِحِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "We admitted them into Our mercy. They were among the righteous.",
        "TRANSLATION_1": "And they were admitted to Our grace. Verily they were among the doers of good.\n",
        "TRANSLATION_2": "And We admitted them into Our mercy, for they were of the righteous.\n",
        "TRANSLATION_3": "We encompassed them in Our mercy; they were righteous people.\n",
        "TRANSLATION_4": "And We admitted them into Our mercy; indeed they are among those who deserve Our proximity.\n",
        "TRANSLATION_5": "And We admitted them to Our mercy. Verily, they were of the righteous.\n",
        "TRANSLATION_6": "And We caused them to enter into Our mercy, surely they were of the good ones.\n",
        "TRANSLATION_7": "and We admitted them into Our mercy; they were of the righteous.\n",
        "TRANSLATION_8": "And We brought them in unto Our mercy. Lo! they are among the righteous.\n",
        "TRANSLATION_9": "We admitted them to Our mercy. They were all righteous men.\n",
        "TRANSLATION_10": "And We caused them to enter into our mercy, verily they are of the righteous.\n",
        "TRANSLATION_11": "We admitted them into Our mercy. Indeed, they were among the righteous.\n",
        "TRANSLATION_12": "We admitted them to Our mercy: for they were of the righteous ones.\n",
        "TRANSLATION_13": "And We admitted them to Our Mercy. Verily, they were of the righteous.\n",
        "TRANSLATION_14": "We admitted them to Our Mercy, for they were of the righteous.\n",
        "TRANSLATION_15": "And We admitted them into Our mercy. They were among the righteous.\n",
        "TRANSLATION_16": "And We admitted them into Our mercy. Indeed, they were of the righteous.\n",
        "TRANSLATION_17": "[21:86] And We admitted them into Our mercy, through [granting them] prophethood. Indeed they were among the worthy, of it. Dhū’l-Kifl was so called because he undertook (takaffala) to fast every day and stay up every night in prayer, and to pass judgement between people without succumbing to anger, and fulfilled this [undertaking]. It is also said, however, that he was not a prophet.\n",
        "TRANSLATION_18": "(And We brought them in) We shall enter them in the Hereafter (unto Our mercy) to Our Paradise. (Lo! they are among the righteous) they were messengers, except for Dhu'l-Kifl who was not a messenger but a righteous man.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "21:86",
            "21:75",
            "26:5",
            "10:86",
            "19:96",
            "15:56",
            "90:17",
            "27:77",
            "21:107",
            "36:52"
        ],
        "BIBLE": [
            "writings:proverbs:3:4",
            "writings:ecclesiastes:7:20",
            "prophets:jeremiah:32:42",
            "writings:psalms:105:43",
            "writings:psalms:136:11",
            "writings:psalms:86:5",
            "prophets:jeremiah:9:1",
            "writings:proverbs:2:20",
            "torah:genesis:19:8",
            "writings:psalms:58:2"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:2:4"
        ]
    }
}