{
    "VERSE": "21:88",
    "ARABIC": "فَٱسْتَجَبْنَا لَهُۥ وَنَجَّيْنَٰهُ مِنَ ٱلْغَمِّ وَكَذَٰلِكَ نُۨجِى ٱلْمُؤْمِنِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "We responded to him and rescued him from his grief. That is how We rescue the muminun.",
        "TRANSLATION_1": "We heard his cry, and saved him from the anguish. That is how We deliver those who believe.\n",
        "TRANSLATION_2": "Thereupon We accepted his prayer, and rescued him from grief. Thus do We rescue the believers.\n",
        "TRANSLATION_3": "We answered his prayer and saved him from his grief. Thus We save the faithful ones.\n",
        "TRANSLATION_4": "We therefore heard his prayer and rescued him from grief; and similarly We shall rescue the Muslims.\n",
        "TRANSLATION_5": "So We answered his call, and delivered him from the distress. And thus We do deliver the believers.\n",
        "TRANSLATION_6": "So We responded to him and delivered him from the grief and thus do We deliver the believers.\n",
        "TRANSLATION_7": "So We answered him, and delivered him out of grief; even so do, We deliver the believers.\n",
        "TRANSLATION_8": "Then we heard his prayer and saved him from the anguish. Thus we save believers.\n",
        "TRANSLATION_9": "So We heard his prayer and delivered him from sorrow. Thus shall We deliver the true believers.\n",
        "TRANSLATION_10": "So We answered him, and We delivered him from the distress, and Thus do We deliver the believers.\n",
        "TRANSLATION_11": "So We answered his prayer and delivered him from the agony; and thus do We deliver the faithful.\n",
        "TRANSLATION_12": "So We listened to him: and delivered him from distress: and thus do We deliver those who have faith.\n",
        "TRANSLATION_13": "So We answered his call, and delivered him from the distress. And thus We do deliver the believers (who believe in the Oneness of Allah, abstain from evil and work righteousness).\n",
        "TRANSLATION_14": "We heard his prayer and saved him from grief. As such We shall save the believers.\n",
        "TRANSLATION_15": "So We answered him, and saved him from the affliction. Thus We save the faithful.\n",
        "TRANSLATION_16": "So We responded to him and saved him from the distress. And thus do We save the believers.\n",
        "TRANSLATION_17": "[21:88] So We responded to him and delivered him from the distress, by [means of] those words, and thus, in the same way that We delivered him, We deliver the believers, from their anguish when they call out to Us seeking succour.\n",
        "TRANSLATION_18": "(Then We heard his prayer and saved him from the anguish) and We saved him from the pit of darkness. (Thus We save believers) when they call upon Us. 359\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "21:88",
            "37:116",
            "77:44",
            "37:121",
            "37:131",
            "37:80",
            "37:141",
            "37:110",
            "20:126",
            "37:34"
        ],
        "BIBLE": [
            "writings:psalms:71:2",
            "writings:psalms:108:7",
            "writings:psalms:60:7",
            "writings:psalms:4:2",
            "writings:psalms:107:6",
            "prophets:jeremiah:7:13",
            "writings:psalms:34:18",
            "writings:proverbs:11:6",
            "writings:psalms:34:5",
            "prophets:ezekiel:14:20"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:7"
        ]
    }
}