{
    "VERSE": "21:91",
    "ARABIC": "وَٱلَّتِىٓ أَحْصَنَتْ فَرْجَهَا فَنَفَخْنَا فِيهَا مِن رُّوحِنَا وَجَعَلْنَٰهَا وَٱبْنَهَآ ءَايَةً لِّلْعَٰلَمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "And she who protected her private parts. We breathed into her some of Our Ruh and made her and her son a Sign for all the worlds.",
        "TRANSLATION_1": "(Remember) her who preserved her chastity, into whom We breathed a new life from Us, and made her and her son a token for mankind.\n",
        "TRANSLATION_2": "And also recall the woman who guarded her chastity: We breathed into her of Our spirit, and made her and her son a Sign to the whole world.\n",
        "TRANSLATION_3": "Into the woman who maintained her chastity We breathed Our Spirit and made her and her son a miracle for all people.\n",
        "TRANSLATION_4": "And remember the woman who maintained her chastity, We therefore breathed Our Spirit into her and made her and her son a sign for the entire world.\n",
        "TRANSLATION_5": "And she who guarded her chastity, We breathed into her through Our Ruh, and We made her and her son a sign for nations.\n",
        "TRANSLATION_6": "And she who guarded her chastity, so We breathed into her of Our inspiration and made her and her son a sign for the nations.\n",
        "TRANSLATION_7": "And she who guarded her virginity, so We breathed into her of Our spirit and appointed her and her son to be a sign unto all beings.\n",
        "TRANSLATION_8": "And she who was chaste, therefor We breathed into her (something) of Our Spirit and made her and her son a token for (all) peoples.\n",
        "TRANSLATION_9": "Remember the one who guarded her chastity; so We breathed Our Spirit into her, and made her and her son a sign for all people.\n",
        "TRANSLATION_10": "And she who guarded her chastity! Then We breathed into her of Our spirit, and made her and her son a sign unto the worlds.\n",
        "TRANSLATION_11": "And [remember] her who guarded her chastity, so We breathed into her Our spirit, and made her and her son a sign for all the nations.\n",
        "TRANSLATION_12": "And (remember) her who guarded her chastity: We breathed into her of Our spirit, and We made her and her son a sign for all peoples.\n",
        "TRANSLATION_13": "And (remember) she who guarded her chastity [Virgin Maryam (Mary)], We breathed into (the sleeves of) her (shirt or garment) [through Our Ruh - Jibrael (Gabriel)], and We made her and her son ['Iesa (Jesus)] a sign for Al-'Alamin (the mankind and jinns).\n",
        "TRANSLATION_14": "And she (Mary) who guarded her virginity. We breathed into her of Our spirit (Gabriel), and made her and her son a sign for the worlds.\n",
        "TRANSLATION_15": "And she who guarded her virginity. We breathed into her of Our spirit, and made her and her son a sign to the world.\n",
        "TRANSLATION_16": "And [mention] the one who guarded her chastity, so We blew into her [garment] through Our angel [Gabriel], and We made her and her son a sign for the worlds.\n",
        "TRANSLATION_17": "[21:91] And, mention Mary, the one who guarded her virginity, [the one who] preserved it from being taken, so We breathed into her of Our spirit, namely, Gabriel, when he breathed into the opening of her garment and she conceived Jesus. And We made her and her son a sign for all the worlds, that is, [for] mankind, jinn and angels, because she bore him without [having] a male [partner].\n",
        "TRANSLATION_18": "(And) and mention (she who was chaste, therefore We breathed into her (something) of Our Spirit) therefore, by Our command, Gabriel breathed into her (and made her and her son a token) a sign and admonition (for (all) peoples) for the children of Israel: a son without a father; and a birth without physical contact.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "21:91",
            "29:15",
            "66:12",
            "42:32",
            "51:37",
            "2:39",
            "7:36",
            "21:71",
            "34:5",
            "6:98"
        ],
        "BIBLE": [
            "prophets:ii%20samuel:20:22",
            "writings:psalms:96:10",
            "prophets:ii%20samuel:20:1",
            "prophets:judges:6:34",
            "prophets:i%20kings:20:42",
            "prophets:ii%20kings:11:14",
            "writings:lamentations:1:7",
            "writings:job:10:12",
            "prophets:isaiah:18:3",
            "torah:genesis:2:7"
        ]
    }
}