{
    "VERSE": "21:92",
    "ARABIC": "إِنَّ هَٰذِهِۦٓ أُمَّتُكُمْ أُمَّةً وَٰحِدَةً وَأَنَا۠ رَبُّكُمْ فَٱعْبُدُونِ",
    "ENGLISH": {
        "TRANSLATION_0": "This nation of yours is one nation and I am your Lord, so worship Me.",
        "TRANSLATION_1": "Verily this your order is one order, and I am your Lord; so worship Me.\n",
        "TRANSLATION_2": "Verily this community of yours is a single community, and I am your Lord; so worship Me.\n",
        "TRANSLATION_3": "People, you are one nation and I am your Lord. Worship Me.\n",
        "TRANSLATION_4": "Indeed this religion of yours, is one religion; and I am your Lord, therefore worship Me.\n",
        "TRANSLATION_5": "Truly, this, your Ummah is one, and I am your Lord, therefore worship Me.\n",
        "TRANSLATION_6": "Surely this Islam is your religion, one religion (only), and I am your Lord, therefore serve Me.\n",
        "TRANSLATION_7": "Surely this community of yours is one community, and I am your Lord; so serve Me.'\n",
        "TRANSLATION_8": "Lo! this, your religion, is one religion, and I am your Lord, so worship Me.\n",
        "TRANSLATION_9": "This community of yours is one community and I am your Lord, so worship Me.\n",
        "TRANSLATION_10": "Verily this community of yours is a single community, and I am your Lord; so worship Me.\n",
        "TRANSLATION_11": "Indeed this community of yours is one community, and I am your Lord. So worship Me.\n",
        "TRANSLATION_12": "Verily, this brotherhood of yours is a single brotherhood, and I am your Lord and Cherisher: therefore serve Me (and no other).\n",
        "TRANSLATION_13": "Truly! This, your Ummah [Sharia or religion (Islamic Monotheism)] is one religion, and I am your Lord, therefore worship Me (Alone). [Tafsir Ibn Kathir]\n",
        "TRANSLATION_14": "Indeed, this nation of yours is one nation, and I am Your Lord, therefore worship Me.\n",
        "TRANSLATION_15": "This community of yours is one community, and I am your Lord, so worship Me.\n",
        "TRANSLATION_16": "Indeed this, your religion, is one religion, and I am your Lord, so worship Me.\n",
        "TRANSLATION_17": "[21:92] ‘Truly this, creed of Islam, is your community, your religion, O you who are being addressed — in other words, you must adhere to it as, one community, [this being] a necessary state [of affairs], and I am your Lord, so worship Me’, affirm My Oneness.\n",
        "TRANSLATION_18": "(Lo! this, your religion, is one religion) a well-pleasing religion, (and I am your Lord) one Lord, (so worship Me) so obey Me.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "23:52",
            "21:92",
            "11:118",
            "72:20",
            "36:25",
            "44:20",
            "19:36",
            "43:64",
            "3:51",
            "11:90"
        ],
        "BIBLE": [
            "torah:deuteronomy:8:19",
            "torah:genesis:25:23",
            "writings:psalms:102:23",
            "prophets:joshua:23:16",
            "prophets:jeremiah:22:9",
            "writings:ii%20chronicles:7:22",
            "prophets:i%20kings:9:9",
            "torah:genesis:27:29",
            "prophets:zephaniah:3:9",
            "prophets:jeremiah:13:10"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:3:1",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:4:1"
        ]
    }
}