{
    "VERSE": "21:94",
    "ARABIC": "فَمَن يَعْمَلْ مِنَ ٱلصَّٰلِحَٰتِ وَهُوَ مُؤْمِنٌ فَلَا كُفْرَانَ لِسَعْيِهِۦ وَإِنَّا لَهُۥ كَٰتِبُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "As for anyone who does right actions and is a mumin, his striving certainly does not go unthanked. We are writing it down on his behalf.",
        "TRANSLATION_1": "So he who does the right and is a believer, will not have his labour denied, for We are congnisant of it.\n",
        "TRANSLATION_2": "Then whosoever does righteous works, while believing, his striving will not go unappreciated. We record them all for him.\n",
        "TRANSLATION_3": "The reward of the righteously striving believers will not be neglected. We are keeping the record of their good deeds.\n",
        "TRANSLATION_4": "So whoever does some good deeds, and is a believer, then his efforts will not be ignored; and We are recording it.\n",
        "TRANSLATION_5": "So whoever does righteous good deeds while he is a believer, his efforts will not be rejected. Verily, We record it for him (in his Book of deeds).\n",
        "TRANSLATION_6": "Therefore whoever shall do of good deeds and he is a believer, there shall be no denying of his exertion, and surely We will write (It) down for him.\n",
        "TRANSLATION_7": "And whosoever does deeds of righteousness, being a believer, no unthankfulness shall befall his endeavour; We Ourselves write it down for him.\n",
        "TRANSLATION_8": "Then whoso doeth some good works and is a believer, there will be no rejection of his effort. Lo! We record (it) for him.\n",
        "TRANSLATION_9": "He who does good works while he is a believer, shall not see his efforts disregarded: We record them all.\n",
        "TRANSLATION_10": "Whosoever worketh righteous works, and he is a believer, there shall be no denial of his endeavour; and We are for him the Writers.\n",
        "TRANSLATION_11": "Whoever is faithful and does righteous deeds, his endeavour shall not go unappreciated, and We will indeed record it for him.\n",
        "TRANSLATION_12": "Whoever works any act of righteousness and has faith,- His endeavour will not be rejected: We shall record it in his favour.\n",
        "TRANSLATION_13": "So whoever does righteous good deeds while he is a believer (in the Oneness of Allah Islamic Monotheism), his efforts will not be rejected. Verily! We record it in his Book of deeds.\n",
        "TRANSLATION_14": "The endeavors of he who believes and does good works shall not go unthanked. We write it down for him.\n",
        "TRANSLATION_15": "Whoever does righteous deeds, and is a believer, his effort will not be denied. We are writing it down for him.\n",
        "TRANSLATION_16": "So whoever does righteous deeds while he is a believer - no denial will there be for his effort, and indeed We, of it, are recorders.\n",
        "TRANSLATION_17": "[21:94] And whoever performs righteous deeds, being a believer — no rejection, that is, no denial, will there be of his endeavour, and We will indeed write it down for him, by commanding the guardian angels to record it and then We requite him for it.\n",
        "TRANSLATION_18": "(Then whoso doeth good works) righteous works between him and his Lord (and is a believer) sincere in his faith, (there will be no rejection of his effort) the reward for his works will not be forgotten. (Lo! We record (it) for him) We will reward and requite him.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "21:94",
            "17:19",
            "30:44",
            "48:13",
            "76:3",
            "47:34",
            "53:40",
            "31:23",
            "27:92",
            "22:4"
        ],
        "BIBLE": [
            "writings:ecclesiastes:2:11",
            "writings:ii%20chronicles:31:20",
            "prophets:habakkuk:1:5",
            "writings:ecclesiastes:2:17",
            "prophets:joshua:23:6",
            "writings:ii%20chronicles:34:21",
            "prophets:joshua:1:8",
            "prophets:i%20kings:16:20",
            "writings:ecclesiastes:4:9",
            "torah:exodus:34:10"
        ]
    }
}