{
    "VERSE": "21:96",
    "ARABIC": "حَتَّىٰٓ إِذَا فُتِحَتْ يَأْجُوجُ وَمَأْجُوجُ وَهُم مِّن كُلِّ حَدَبٍ يَنسِلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "When Yajuj and Majuj are let loose and rush down from every slope,",
        "TRANSLATION_1": "Until when the way is opened up for Gog and Magog and they press from every elevated place,\n",
        "TRANSLATION_2": "until Gog and Magog are let loose, and begin swooping from every mound,\n",
        "TRANSLATION_3": "until Gog and Magog are let loose to rush down from the hills.\n",
        "TRANSLATION_4": "Till the time when Yajuj and Majuj are released, and they will be flowing down from every height.\n",
        "TRANSLATION_5": "Until, when Ya'juj and Ma'juj (Gog and Magog people) are let loose, and they swoop down from every Hadab.\n",
        "TRANSLATION_6": "Even when Gog and Magog are let loose and they shall break forth from every elevated place.\n",
        "TRANSLATION_7": "till, when Gog and Magog are unloosed, and they slide down out of every slope,\n",
        "TRANSLATION_8": "Until, when Gog and Magog are let loose, and they hasten out of every mound,\n",
        "TRANSLATION_9": "but when Gog and Magog are let loose and swarm down from every hillside and they spread out, [leaping across every barrier of land and sea],\n",
        "TRANSLATION_10": "Until when Ya'juj and Ma'juj are let out, and from every mound they are trickling down.\n",
        "TRANSLATION_11": "until when Gog and Magog are let loose, and they race down from every slope,\n",
        "TRANSLATION_12": "Until the Gog and Magog (people) are let through (their barrier), and they swiftly swarm from every hill.\n",
        "TRANSLATION_13": "Until, when Ya'juj and Ma'juj (Gog and Magog) are let loose (from their barrier), and they swiftly swarm from every mound.\n",
        "TRANSLATION_14": "till Gog and Magog are let loose and slide down out of every slope;\n",
        "TRANSLATION_15": "Until, when Gog and Magog are let loose, and they swarm down from every mound.\n",
        "TRANSLATION_16": "Until when [the dam of] Gog and Magog has been opened and they, from every elevation, descend\n",
        "TRANSLATION_17": "[21:96]   Until (hattā, [a particle] expressing the end of the prohibition of their return) when Gog and Magog (read Ya’jūju wa-Ma’jūju or Yājūju wa-Mājūju, [these are] non-Arabic names of two tribes; there is an implicit genitive annexation before this clause, namely, the [gates of the] sadd, ‘the barrier’, [built] against them) are let loose (read futihat or futtihat) — and this will happen near the [time of the] Resurrection — and they slide down, they hasten, from every slope, [every] highland.\n",
        "TRANSLATION_18": "(Until, when Gog and Magog are let loose) then they will emerge, (and they) i.e. Gog and Magog (hasten out of every mound) and elevated location.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "21:96",
            "6:85",
            "6:64",
            "19:49",
            "21:72",
            "6:132",
            "14:15",
            "17:20",
            "83:30",
            "10:79"
        ],
        "BIBLE": [
            "prophets:hosea:13:13",
            "prophets:jeremiah:1:14",
            "prophets:ezekiel:17:16",
            "writings:daniel:8:22",
            "prophets:ezekiel:6:6",
            "writings:daniel:12:7",
            "prophets:jeremiah:48:38",
            "prophets:isaiah:14:25",
            "prophets:isaiah:55:12",
            "torah:deuteronomy:31:20"
        ]
    }
}