{
    "VERSE": "21:97",
    "ARABIC": "وَٱقْتَرَبَ ٱلْوَعْدُ ٱلْحَقُّ فَإِذَا هِىَ شَٰخِصَةٌ أَبْصَٰرُ ٱلَّذِينَ كَفَرُوا۟ يَٰوَيْلَنَا قَدْ كُنَّا فِى غَفْلَةٍ مِّنْ هَٰذَا بَلْ كُنَّا ظَٰلِمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "and the True Promise is very close, the eyes of those who were kafir will be transfixed: 'Alas for us! We were unmindful of this! No, rather we were definitely wrongdoers.'",
        "TRANSLATION_1": "And the certain promise (of Doom) comes near. Then the eyes of unbelievers will be fixed in horror, (and they will cry:) \"Ah, woe betide, we were indeed heedless of this, and were oppressors and unjust.\"\n",
        "TRANSLATION_2": "and the time for the fulfilment of the true promise of Allah draws near, whereupon the eyes of those who disbelieved will stare in fear, and they will say: \"Woe to us, we were indeed heedless of this; nay, we were wrongdoers.\"\n",
        "TRANSLATION_3": "The Day of Judgment will then draw near and the unbelievers will stare amazedly and cry, \"Woe to us! We had neglected this day. We have done wrong\".\n",
        "TRANSLATION_4": "And the True Promise has come near – thereupon the eyes of the disbelievers will become fixed, staring wide; saying “Woe to us – we were in neglect of this, but in fact we were unjust.”\n",
        "TRANSLATION_5": "And the true promise shall draw near. Then, you shall see the eyes of the disbelievers fixedly staring in horror. (They will say:) \"Woe to us! We were indeed heedless of this -- nay, but we were wrongdoers.\"\n",
        "TRANSLATION_6": "And the true promise shall draw nigh, then lo! the eyes of those who disbelieved shall be fixedly open: O woe to us! surely we were in a state of heedlessness as to this; nay, we were unjust.\n",
        "TRANSLATION_7": "and nigh has drawn the true promise, and behold, the eyes of the unbelievers staring: 'Alas for us! We were heedless of this; 'nay, we were evildoers.'\n",
        "TRANSLATION_8": "And the True Promise draweth nigh; then behold them, staring wide (in terror), the eyes of those who disbelieve! (They say): Alas for us! We (lived) in forgetfulness of this. Ah, but we were wrong-doers!\n",
        "TRANSLATION_9": "when the true promise of God draws near, those who denied the truth will stare in amazement, crying, \"Woe to us! We have been so heedless of this. Indeed, we were wrongdoers.\"\n",
        "TRANSLATION_10": "And there shall approach the true promise; and lo! the eyes of those who disbelieved shall be staring: woe unto us! surely we have been in neglect thereof; aye! we have been the wrong-doers.\n",
        "TRANSLATION_11": "and the true promise draws near [to its fulfillment], behold, the faithless will look on with a fixed gaze: ‘Woe to us! We have certainly been oblivious of this! Indeed, we have been wrongdoers!’\n",
        "TRANSLATION_12": "Then will the true promise draw nigh (of fulfilment): then behold! the eyes of the Unbelievers will fixedly stare in horror: \"Ah! Woe to us! we were indeed heedless of this; nay, we truly did wrong!\"\n",
        "TRANSLATION_13": "And the true promise (Day of Resurrection) shall draw near (of fulfillment). Then (when mankind is resurrected from their graves), you shall see the eyes of the disbelievers fixedly stare in horror. (They will say): \"Woe to us! We were indeed heedless of this; nay, but we were Zalimun (polytheists and wrong-doers, etc.).\"\n",
        "TRANSLATION_14": "when the true promise draws near; the eyes of the unbelievers will stare (and they will say): 'Alas for us! Of this we have been heedless. We have beenharmdoers'\n",
        "TRANSLATION_15": "The promise of truth has drawn near. The eyes of those who disbelieved will stare in horror: “Woe to us. We were oblivious to this. In fact, we were wrongdoers.”\n",
        "TRANSLATION_16": "And [when] the true promise has approached; then suddenly the eyes of those who disbelieved will be staring [in horror, while they say], \"O woe to us; we had been unmindful of this; rather, we were wrongdoers.\"\n",
        "TRANSLATION_17": "[21:97] And the true promise, that is, the Day of Resurrection, draws near and behold, when, the gaze of the disbelievers will be fixed, on that Day, because of its severity, saying: ‘O (yā is for exclamation) woe to us!, [this is] our destruction! Verily, in the [life of the] world, we were oblivious to this, Day. Nay, but we were doing wrong’, to our souls by our denial of the messengers.\n",
        "TRANSLATION_18": "(And the True Promise draweth nigh) the Hour would be near upon their coming out of the barrier; (then behold them, staring wide (in terror)) humbled, hardly seeing, (the eyes of those who disbelieve) in 360 Muhammad (pbuh) and the Qur'an! ((They say): Alas for us) what a regret for us! (We (lived) in forgetfulness) in ignorance (of this) Day. (Ah, but we were wrong-doers) but we were disbelievers in Muhammad (pbuh) and in the Qur'an!\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "21:97",
            "50:22",
            "18:98",
            "21:18",
            "7:118",
            "40:77",
            "30:60",
            "43:29",
            "75:7",
            "103:3"
        ],
        "BIBLE": [
            "prophets:judges:19:9",
            "prophets:i%20kings:13:4",
            "prophets:ezekiel:28:22",
            "torah:deuteronomy:25:9",
            "writings:ecclesiastes:12:1",
            "prophets:ezekiel:22:3",
            "prophets:jeremiah:50:31",
            "prophets:joshua:5:13",
            "prophets:jeremiah:51:47",
            "torah:deuteronomy:20:3"
        ]
    }
}