{
    "VERSE": "21:99",
    "ARABIC": "لَوْ كَانَ هَٰٓؤُلَآءِ ءَالِهَةً مَّا وَرَدُوهَا وَكُلٌّ فِيهَا خَٰلِدُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "If those had really been gods, they would not have gone down into it. Each one will be in it timelessly, for ever.",
        "TRANSLATION_1": "Had they really been gods they would not have entered it: They will all abide in it for ever.\n",
        "TRANSLATION_2": "Had these indeed been gods they would not have gone there. But (as it is), all of you shall ever abide in it.\"\n",
        "TRANSLATION_3": "Had the idols been true lords, they would not have gone to hell. \"All of you will live therein forever\".\n",
        "TRANSLATION_4": "“Had these been Gods they would not go into hell; and they have to remain in it.”\n",
        "TRANSLATION_5": "Had these been gods, they would not have entered there (Hell), and all of them will abide therein forever.\n",
        "TRANSLATION_6": "Had these been gods, they would not have come to it and all shall abide therein.\n",
        "TRANSLATION_7": "If those had been gods, they would never have gone down to it; yet every one of them shall therein abide forever;'\n",
        "TRANSLATION_8": "If these had been gods they would not have come thither, but all will abide therein.\n",
        "TRANSLATION_9": "if those had really been deities, they would not have been led there; but there they will remain forever.\n",
        "TRANSLATION_10": "Had these been gods, they would not have gone down thereunto; and all of them therein shall be abiders.\n",
        "TRANSLATION_11": "Had they been gods, they would not have entered it, and they will all remain in it [forever].\n",
        "TRANSLATION_12": "If these had been gods, they would not have got there! but each one will abide therein.\n",
        "TRANSLATION_13": "Had these (idols, etc.) been aliha (gods), they would not have entered there (Hell), and all of them will abide therein.\n",
        "TRANSLATION_14": "If those had been gods, they would never have gone down to it, but in it they shall live for ever.\n",
        "TRANSLATION_15": "Had these been gods, they would not have descended into it. All will abide in it.\n",
        "TRANSLATION_16": "Had these [false deities] been [actual] gods, they would not have come to it, but all are eternal therein.\n",
        "TRANSLATION_17": "[21:99] Had these, graven images, been gods, as you claim, they would never have come to it, [they would never have] entered it, and they will all, both the worshippers and the worshipped, abide therein.\n",
        "TRANSLATION_18": "(If these) idols (had been Gods they would not have come thither) they would not have entered the Fire, (but all) the worshipped and the worshipper (will abide therein) in hell they will remain forever.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "21:99",
            "6:107",
            "21:68",
            "2:15",
            "6:64",
            "8:33",
            "2:281",
            "44:55",
            "11:33",
            "17:20"
        ],
        "BIBLE": [
            "prophets:judges:2:17",
            "prophets:jeremiah:2:17",
            "torah:deuteronomy:1:19",
            "writings:psalms:121:8",
            "torah:deuteronomy:1:31",
            "prophets:hosea:6:3",
            "prophets:i%20samuel:24:4",
            "prophets:ii%20samuel:2:24",
            "prophets:ii%20samuel:15:24",
            "torah:exodus:13:18"
        ]
    }
}