{
    "VERSE": "99:1",
    "ARABIC": "بِسْمِ ٱللَّهِ ٱلرَّحْمَٰنِ ٱلرَّحِيمِ إِذَا زُلْزِلَتِ ٱلْأَرْضُ زِلْزَالَهَا",
    "ENGLISH": {
        "TRANSLATION_0": "When the earth is convulsed with its quaking",
        "TRANSLATION_1": "WHEN THE WORLD is shaken up by its cataclysm,\n",
        "TRANSLATION_2": "When the earth will be shaken with a mighty shaking,\n",
        "TRANSLATION_3": "When the earth is shaken by a terrible quake\n",
        "TRANSLATION_4": "When the earth is shaken with its appointed tremor.\n",
        "TRANSLATION_5": "When the earth quakes with its Zilzal.\n",
        "TRANSLATION_6": "When the earth is shaken with her (violent) shaking,\n",
        "TRANSLATION_7": "When earth is shaken with a mighty shaking\n",
        "TRANSLATION_8": "When Earth is shaken with her (final) earthquake\n",
        "TRANSLATION_9": "When the earth is shaken with its violent shaking,\n",
        "TRANSLATION_10": "When the earth is shaken by the shaking thereof,\n",
        "TRANSLATION_11": "When the earth is rocked with a terrible quake\n",
        "TRANSLATION_12": "When the earth is shaken to her (utmost) convulsion,\n",
        "TRANSLATION_13": "When the earth is shaken with its (final) earthquake.\n",
        "TRANSLATION_14": "When the earth is shaken with its mighty shaking,\n",
        "TRANSLATION_15": "When the earth is shaken with its quake.\n",
        "TRANSLATION_16": "When the earth is shaken with its [final] earthquake\n",
        "TRANSLATION_17": "[99:1] When earth is shaken, [when] it is rocked for the rising of the Hour, with its [final] quake, with its most violent rocking, one that befits its magnitude,\n",
        "TRANSLATION_18": "And from his narration on the authority of Ibn 'Abbas that he said about the interpretation of Allah's saying (When Earth is shaken with her (final) earthquake): '(When Earth is shaken with her (final) earthquake) He says: the earth is shaken and quaking and all that which is on it of trees, mountains and building is crumbling down\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "99:1",
            "56:4",
            "84:3",
            "89:21",
            "91:6",
            "51:48",
            "99:2",
            "77:25",
            "79:30",
            "23:84"
        ],
        "BIBLE": [
            "writings:i%20chronicles:16:30",
            "writings:psalms:18:8",
            "prophets:isaiah:2:19",
            "writings:job:38:13",
            "writings:psalms:89:12",
            "prophets:isaiah:2:21",
            "writings:psalms:10:18",
            "prophets:nahum:1:5",
            "writings:psalms:97:4",
            "writings:psalms:24:1"
        ]
    }
}