{
    "VERSE": "99:7",
    "ARABIC": "فَمَن يَعْمَلْ مِثْقَالَ ذَرَّةٍ خَيْرًا يَرَهُۥ",
    "ENGLISH": {
        "TRANSLATION_0": "Whoever does an atom's weight of good will see it.",
        "TRANSLATION_1": "Whosoever has done even an atom's weight of good will behold it;\n",
        "TRANSLATION_2": "So, whoever does an atom's weight of good shall see it;\n",
        "TRANSLATION_3": "Whoever has done an atom's weight of good,\n",
        "TRANSLATION_4": "So whoever does a good deed equal to the weight of the minutest particle, will see it.\n",
        "TRANSLATION_5": "So, whosoever does good equal to the weight of a speck of dust shall see it.\n",
        "TRANSLATION_6": "So. he who has done an atom's weight of good shall see it\n",
        "TRANSLATION_7": "and whoso has done an atom's weight of good shall see it,\n",
        "TRANSLATION_8": "And whoso doeth good an atom's weight will see it then,\n",
        "TRANSLATION_9": "whoever has done the smallest particle of good will see it;\n",
        "TRANSLATION_10": "Then whosoever hath worked good of an atom's weight shall behold it\n",
        "TRANSLATION_11": "So whoever does an atom’s weight of good will see it,\n",
        "TRANSLATION_12": "Then shall anyone who has done an atom's weight of good, see it!\n",
        "TRANSLATION_13": "So whosoever does good equal to the weight of an atom (or a small ant), shall see it.\n",
        "TRANSLATION_14": "Whosoever has done an atom's weight of good shall see it,\n",
        "TRANSLATION_15": "Whoever has done an atom's weight of good will see it.\n",
        "TRANSLATION_16": "So whoever does an atom's weight of good will see it,\n",
        "TRANSLATION_17": "[99:7] So whoever does an atom’s weight of good shall see it: he shall see its reward,\n",
        "TRANSLATION_18": "Allah then revealed the following verse about a group of people who thought that they are not rewarded for any small goodness they do nor punished for any small evil they commit, and so Allah urged them to do acts of goodness even if they are small and warned them against acts of evil even if they are small acts: (And whoso doeth good an atom's weight) the weight of the smallest ant (will see it then) in his register and then will be happy with it; it is also said: the believer sees his works in the Hereafter while the disbeliever sees his works in the life of the world,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "99:7",
            "99:8",
            "80:12",
            "74:55",
            "16:126",
            "4:40",
            "70:41",
            "3:54",
            "8:23",
            "37:77"
        ],
        "BIBLE": [
            "torah:exodus:35:2",
            "torah:exodus:31:15",
            "writings:daniel:3:32",
            "torah:numbers:10:32",
            "writings:ezra:7:18",
            "prophets:isaiah:40:15",
            "torah:exodus:34:10",
            "torah:leviticus:23:3",
            "prophets:isaiah:57:12",
            "prophets:habakkuk:1:5"
        ]
    }
}