{
    "VERSE": "32:10",
    "ARABIC": "وَقَالُوٓا۟ أَءِذَا ضَلَلْنَا فِى ٱلْأَرْضِ أَءِنَّا لَفِى خَلْقٍ جَدِيدٍۭ بَلْ هُم بِلِقَآءِ رَبِّهِمْ كَٰفِرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "They say, 'When we have been absorbed into the earth, are we then to be in a new creation?' In fact they reject the meeting with their Lord.",
        "TRANSLATION_1": "But they say: \"When we have mingled with the earth, shall we be created anew?\" In fact they deny the meeting with their Lord.\n",
        "TRANSLATION_2": "They say: “Shall we be created afresh after we have become lost in the earth?” Nay, the fact is that they deny that they will meet their Lord.\n",
        "TRANSLATION_3": "They have said, \"How can we be brought to life again after we have been lost in the earth?\" In fact, they have no faith in the Day of Judgment\n",
        "TRANSLATION_4": "And they said, “When we have mingled into the earth, will we be created again?”; in fact they disbelieve in the meeting with their Lord.\n",
        "TRANSLATION_5": "And they say: \"When we are lost in the earth, shall we indeed be created anew\" Nay, but they deny the meeting with their Lord!\n",
        "TRANSLATION_6": "And they say: What! when we have become lost in the earth, shall we then certainly be in a new creation? Nay! they are disbelievers in the meeting of their Lord.\n",
        "TRANSLATION_7": "They say, 'What, when we have gone astray in the earth, shall we indeed be in a new creation?' Nay, but they disbelieve in the encounter with their Lord.\n",
        "TRANSLATION_8": "And they say: When we are lost in the earth, how can we then be re-created? Nay but they are disbelievers in the meeting with their Lord.\n",
        "TRANSLATION_9": "They say, \"When we are lost in the earth, how can we then be recreated?\" Indeed, they deny they will ever meet their Lord.\n",
        "TRANSLATION_10": "And they say: when we are vanished in the earth, shall we then be raised in a new creation? Aye! in the meeting with their Lord they are disbelieving.\n",
        "TRANSLATION_11": "They say, ‘When we have been lost in the dust, shall we be indeed created anew?’ Indeed, they disbelieve in the encounter with their Lord.\n",
        "TRANSLATION_12": "And they say: \"What! when we lie, hidden and lost, in the earth, shall we indeed be in a Creation renewed? Nay, they deny the Meeting with their Lord.\n",
        "TRANSLATION_13": "And they say: \"When we are (dead and become) lost in the earth, shall we indeed be recreated anew?\" Nay, but they deny the Meeting with their Lord!\n",
        "TRANSLATION_14": "They say: 'What, when we have been destroyed in the earth, shall we indeed be in a new creation' Indeed, they disbelieve that they will meet their Lord.\n",
        "TRANSLATION_15": "And they say, “When we are lost into the earth, shall we be in a new creation?” In fact, they deny the meeting with their Lord.\n",
        "TRANSLATION_16": "And they say, \"When we are lost within the earth, will we indeed be [recreated] in a new creation?\" Rather, they are, in [the matter of] the meeting with their Lord, disbelievers.\n",
        "TRANSLATION_17": "[32:10] And they, namely, the deniers of resurrection, say, ‘When we are lost beneath the earth, [when] we have gone thereunder, having become dust mixed with its dust, shall we be indeed created anew?’ (an interrogative of denial; [read a-innā] by pronouncing both hamzas, or by not pronouncing the second one and inserting an alif between them either way, in both places). God, exalted be He, says: Nay, but they disbelieve in the encounter with their Lord, through resurrection.\n",
        "TRANSLATION_18": "(And they say) i.e. Abu Jahl and his host: (When we are lost) perished (in the earth) after we die, (how can we then be recreated) it is impossible that we be recreated after we die? (Nay but they are disbelievers in) they deny (the meeting with their Lord) resurrection after death.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "32:10",
            "13:5",
            "17:49",
            "34:7",
            "50:15",
            "14:19",
            "17:98",
            "35:16",
            "72:10",
            "41:9"
        ],
        "BIBLE": [
            "prophets:i%20samuel:15:20",
            "writings:job:1:7",
            "writings:job:2:2",
            "prophets:jeremiah:25:32",
            "torah:exodus:9:29",
            "prophets:ii%20kings:2:21",
            "prophets:jeremiah:29:15",
            "prophets:ezekiel:37:21",
            "prophets:isaiah:14:9",
            "prophets:i%20kings:20:39"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:8",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:4:12"
        ]
    }
}