{
    "VERSE": "32:11",
    "ARABIC": "قُلْ يَتَوَفَّىٰكُم مَّلَكُ ٱلْمَوْتِ ٱلَّذِى وُكِّلَ بِكُمْ ثُمَّ إِلَىٰ رَبِّكُمْ تُرْجَعُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Say: 'The Angel of Death, who has been given charge of you, will take you back and then you will be sent back to your Lord.'",
        "TRANSLATION_1": "Say: \"The angel of death appointed over you will take away your soul, then you will be sent back to your Lord.\"\n",
        "TRANSLATION_2": "Tell them: “The angel of death who has been charged with your souls shall gather you, and then you shall be brought back to your Lord.”\n",
        "TRANSLATION_3": "(Muhammad), say, \"The angel of death, who is appointed over everyone of you, will cause you to die and to your Lord you will all return.\"\n",
        "TRANSLATION_4": "Proclaim, “The angel of death, who is appointed over you, causes you to die and then towards your Lord you will return.”\n",
        "TRANSLATION_5": "Say: \"The angel of death, who is set over you, will take your souls. Then you shall be brought to your Lord.\"\n",
        "TRANSLATION_6": "Say: The angel of death who is given charge of you shall cause you to die, then to your Lord you shall be brought back.\n",
        "TRANSLATION_7": "Say: 'Death's angel, who has been charged with you, shall gather you, then to your Lord you shall be returned.'\n",
        "TRANSLATION_8": "Say: The angel of death, who hath charge concerning you, will gather you, and afterward unto your Lord ye will be returned.\n",
        "TRANSLATION_9": "Say, \"The Angel of Death who has been given charge of you will gather in your souls. Then you will [all] be returned to your Lord.\"\n",
        "TRANSLATION_10": "Say thou: the angel of death who is set over you shall cause you to die, thereafter unto your Lord ye shall be returned.\n",
        "TRANSLATION_11": "Say, ‘You will be taken away by the angel of death, who has been charged with you. Then you will be brought back to your Lord.’\n",
        "TRANSLATION_12": "Say: \"The Angel of Death, put in charge of you, will (duly) take your souls: then shall ye be brought back to your Lord.\"\n",
        "TRANSLATION_13": "Say: \"The angel of death, who is set over you, will take your souls, then you shall be brought to your Lord.\"\n",
        "TRANSLATION_14": "Say: 'The Angel of Death, who has been given charge of you will gather you then to your Lord you shall be returned'\n",
        "TRANSLATION_15": "Say, “The angel of death put in charge of you will reclaim you. Then to your Lord you will be returned.”\n",
        "TRANSLATION_16": "Say, \"The angel of death will take you who has been entrusted with you. Then to your Lord you will be returned.\"\n",
        "TRANSLATION_17": "[32:11]   Say, to them: ‘The Angel of death, who has been charged with you, shall receive you [in death], in other words, he shall seize your spirits, then to your Lord you shall be returned’, alive, whereat He will requite you for your deeds.\n",
        "TRANSLATION_18": "(Say) to them, Muhammad: (The angel of death, who hath charge concerning you, will gather you) will take away your souls, (and afterward unto your Lord ye will be returned) in the Hereafter.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "32:11",
            "89:22",
            "41:30",
            "8:9",
            "96:1",
            "29:57",
            "23:99",
            "36:27",
            "26:98",
            "3:125"
        ],
        "BIBLE": [
            "writings:job:1:21",
            "prophets:jeremiah:47:7",
            "torah:genesis:28:6",
            "writings:esther:8:2",
            "torah:numbers:31:47",
            "prophets:jeremiah:25:5",
            "torah:genesis:12:20",
            "prophets:i%20samuel:21:7",
            "prophets:ezekiel:18:13",
            "prophets:i%20samuel:9:23"
        ]
    }
}