{
    "VERSE": "32:12",
    "ARABIC": "وَلَوْ تَرَىٰٓ إِذِ ٱلْمُجْرِمُونَ نَاكِسُوا۟ رُءُوسِهِمْ عِندَ رَبِّهِمْ رَبَّنَآ أَبْصَرْنَا وَسَمِعْنَا فَٱرْجِعْنَا نَعْمَلْ صَٰلِحًا إِنَّا مُوقِنُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "If only you could see the evildoers hanging their heads in shame before their Lord: 'Our Lord, we have seen and we have heard, so send us back again and we will act rightly. Truly we now have certainty.'",
        "TRANSLATION_1": "If only you could see when the sinners will stand before their Lord, heads hung low, (and say:) \"O Lord, we have seen and heard. So send us back. We shall do the right, for we have come to believe with certainty.\"\n",
        "TRANSLATION_2": "Would that you could see the guilty standing before their Lord with their heads downcast, (saying to Him): “Our Lord, we have now seen and heard, so send us back (to the world) that we might act righteously. For now we have come to have firm faith.”\n",
        "TRANSLATION_3": "Would that you could see (on the Day of Judgment) that criminals, with their heads hanging down before their Lord, saying, \"Our Lord, we have seen and heard. Send us back to act righteously. Now we have strong faith\".\n",
        "TRANSLATION_4": "And if you see when the guilty will hang their heads before their Lord; “Our Lord! We have seen and heard, therefore send us back in order that we do good deeds – we are now convinced!”\n",
        "TRANSLATION_5": "And if you only could see when the criminals shall hang their heads before their Lord (saying): \"Our Lord! We have now seen and heard, so send us back that we will do righteous good deeds. Verily, we now believe with certainty.\"\n",
        "TRANSLATION_6": "And could you but see when the guilty shall hang down their heads before their Lord: Our Lord! we have seen and we have heard, therefore send us back, we will do good; surely (now) we are certain.\n",
        "TRANSLATION_7": "Ah, if thou couldst see the guilty hanging their heads before their Lord! 'Our Lord, we have seen and heard; now return us, that we may do righteousness, for we have sure faith.'\n",
        "TRANSLATION_8": "Couldst thou but see when the guilty hang their heads before their Lord, (and say): Our Lord! We have now seen and heard, so send us back; we will do right, now we are sure.\n",
        "TRANSLATION_9": "If only you could see the evil-doers hanging their heads in shame before their Lord, \"Our Lord, we have seen and we have heard, so send us back again and we will act rightly. For we do indeed now believe.\"\n",
        "TRANSLATION_10": "Couldst thou but see when the culprits shall hang their heads before their Lord, saying: our Lord! we have now seen and heard; so send us back; we shall work righteously, verily we are convinced.\n",
        "TRANSLATION_11": "Were you to see when the guilty hang their heads before their Lord [confessing], ‘Our Lord! We have seen and heard. Send us back so that we may act righteously. Indeed we are [now] convinced.’\n",
        "TRANSLATION_12": "If only thou couldst see when the guilty ones will bend low their heads before their Lord, (saying:) \"Our Lord! We have seen and we have heard: Now then send us back (to the world): we will work righteousness: for we do indeed (now) believe.\"\n",
        "TRANSLATION_13": "And if you only could see when the Mujrimun (criminals, disbelievers, polytheists, sinners, etc.) shall hang their heads before their Lord (saying): \"Our Lord! We have now seen and heard, so send us back (to the world), we will do righteous good deeds. Verily! We now believe with certainty.\"\n",
        "TRANSLATION_14": "Would that you could see the wrongdoers when they lower their heads before their Lord! They will say: 'Our Lord, we have now seen and heard. Send us back and we will do righteous deeds, we are certain'\n",
        "TRANSLATION_15": "If only you could see the guilty, bowing their heads before their Lord: “Our Lord, we have seen and we have heard, so send us back, and we will act righteously; we are now convinced.”\n",
        "TRANSLATION_16": "If you could but see when the criminals are hanging their heads before their Lord, [saying], \"Our Lord, we have seen and heard, so return us [to the world]; we will work righteousness. Indeed, we are [now] certain.\"\n",
        "TRANSLATION_17": "[32:12] And if could you but see the guilty, the disbelievers, hanging their heads [low] before their Lord, lowering them in shame, saying: ‘Our Lord! We have seen, the resurrection that we denied, and heard, from You the confirmation of [the truth of] the messengers concerning that in which we used to call them liars. So send us back, to the world, so that we may act righteously, therein, for indeed we are convinced’, now. But none of this is of any use to them and they will not be sent back (the response to [the conditional clause beginning with] law, ‘if’, is [an implicit] ‘you would see a terrible thing’).\n",
        "TRANSLATION_18": "469 (Couldst thou but see when the guilty) the idolaters (hang their heads) lower down their heads (before their Lord) on the Day of Judgement, ((and say): Our Lord!) our Lord! (We have now seen) we know now that which we did not (and heard) and become certain about that which we were not certain of, (so send us back) so that we believe in You; (we will do right) sincerely to You, (now we are sure) we believe in You, in Your Book, Messenger and in resurrection after death.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "32:12",
            "43:49",
            "51:34",
            "7:206",
            "52:37",
            "34:31",
            "41:38",
            "39:31",
            "68:34",
            "11:83"
        ],
        "BIBLE": [
            "prophets:micah:3:11",
            "prophets:i%20samuel:29:4",
            "prophets:ii%20kings:6:31",
            "torah:exodus:4:31",
            "prophets:obadiah:1:15",
            "prophets:i%20kings:2:44",
            "prophets:jeremiah:14:3",
            "prophets:i%20kings:2:33",
            "torah:numbers:22:31",
            "prophets:isaiah:51:11"
        ]
    }
}