{
    "VERSE": "32:18",
    "ARABIC": "أَفَمَن كَانَ مُؤْمِنًا كَمَن كَانَ فَاسِقًا لَّا يَسْتَوُۥنَ",
    "ENGLISH": {
        "TRANSLATION_0": "Is someone who has iman like someone who is a deviator? They are not the same!",
        "TRANSLATION_1": "Is one who is a believer like one who is a transgressor? No, they are not alike.\n",
        "TRANSLATION_2": "Would a true believer be like him who was an evil-doer? Surely they are not equal.\n",
        "TRANSLATION_3": "Is a believer equal to an evil-doer? They are not equal at all.\n",
        "TRANSLATION_4": "So will the believer ever be equal to the one who is lawless? They are not equal!\n",
        "TRANSLATION_5": "Is then he who is a believer like him who is rebellious Not equal are they.\n",
        "TRANSLATION_6": "Is he then who is a believer like him who is a transgressor? They are not equal.\n",
        "TRANSLATION_7": "What? Is he who has been a believer like unto him who has been ungodly? They are not equal.\n",
        "TRANSLATION_8": "Is he who is a believer like unto him who is an evil-liver? They are not alike.\n",
        "TRANSLATION_9": "So, is someone who believes equal to someone who defies God? No, they are not equal.\n",
        "TRANSLATION_10": "Shall he, therefore, who is a believer, be like unto him who is a transgressor? They are not equal.\n",
        "TRANSLATION_11": "Is someone who is faithful like someone who is a transgressor? They are not equal.\n",
        "TRANSLATION_12": "Is then the man who believes no better than the man who is rebellious and wicked? Not equal are they.\n",
        "TRANSLATION_13": "Is then he who is a believer like him who is Fasiq (disbeliever and disobedient to Allah)? Not equal are they.\n",
        "TRANSLATION_14": "Can he, then, who is a believer, be compared to he who is wicked? They are not equal.\n",
        "TRANSLATION_15": "Is someone who is faithful like someone who is a sinner? They are not equal.\n",
        "TRANSLATION_16": "Then is one who was a believer like one who was defiantly disobedient? They are not equal.\n",
        "TRANSLATION_17": "[32:18] Is he who is a believer like him who is a transgressor? They are not equal, namely, the believers and the transgressors.\n",
        "TRANSLATION_18": "(Is he who is a believer) a sincere believer; the reference here is to 'AN Ibn Abi Talib (like unto him who is an evil-liver?) I.e. a hypocrite; the reference here is to al-Walid Ibn 'Uqbah Ibn Abi Ma'it. (They are not alike) in the life of this world in relation to their obedience nor are they alike in the Hereafter in relation to the reward and honour bestowed by Allah. This is because these two had an argument and exchanged words until 'AN Ibn Abi Talib, may Allah be well pleased with him, said to him: \"0 sinner!\".\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "32:18",
            "16:17",
            "37:155",
            "36:68",
            "10:42",
            "10:43",
            "68:35",
            "53:33",
            "26:75",
            "56:58"
        ],
        "BIBLE": [
            "writings:proverbs:17:11",
            "prophets:ezekiel:20:3",
            "torah:numbers:23:19",
            "writings:psalms:56:12",
            "prophets:jeremiah:29:32",
            "prophets:ezekiel:33:12",
            "writings:job:8:20",
            "prophets:jeremiah:35:19",
            "torah:genesis:2:18",
            "prophets:ezekiel:44:2"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:3:5",
            "Sefer%20Yetzirah:4:4"
        ]
    }
}