{
    "VERSE": "32:21",
    "ARABIC": "وَلَنُذِيقَنَّهُم مِّنَ ٱلْعَذَابِ ٱلْأَدْنَىٰ دُونَ ٱلْعَذَابِ ٱلْأَكْبَرِ لَعَلَّهُمْ يَرْجِعُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "We will give them a taste of lesser punishment before the greater punishment, so that hopefully they will turn back.",
        "TRANSLATION_1": "But We shall make them taste the affliction of this world before the greater torment, so that they may retract.\n",
        "TRANSLATION_2": "We shall certainly have them taste some chastisement in this world in addition to the greater chastisement (of the Hereafter); perhaps they will retract (from their transgression).\n",
        "TRANSLATION_3": "We shall certainly make them suffer worldly torment before suffering the great torment so that perhaps they may return to Us.\n",
        "TRANSLATION_4": "And We shall indeed make them taste the smaller punishment before the greater punishment, so that they may return.\n",
        "TRANSLATION_5": "And verily, We will make them taste of the near lighter torment prior to the greater torment, in order that they may return.\n",
        "TRANSLATION_6": "And most certainly We will make them taste of the nearer chastisement before the greater chastisement that haply they may turn.\n",
        "TRANSLATION_7": "And We shall surely let them taste the nearer chastisement, before the greater; haply so they will return.\n",
        "TRANSLATION_8": "And verily We make them taste the lower punishment before the greater, that haply they may return.\n",
        "TRANSLATION_9": "And most surely We will make them taste a lesser punishment before the greater punishment, so that perhaps they may return to Us in repentance.\n",
        "TRANSLATION_10": "And surely We shall make them taste of the smaller torment prior to the greater torment, that haply they may yet return.\n",
        "TRANSLATION_11": "We shall surely make them taste the nearer punishment prior to the greater punishment, so that they may come back.\n",
        "TRANSLATION_12": "And indeed We will make them taste of the Penalty of this (life) prior to the supreme Penalty, in order that they may (repent and) return.\n",
        "TRANSLATION_13": "And verily, We will make them taste of the near torment (i.e. the torment in the life of this world, i.e. disasters, calamities, etc.) prior to the supreme torment (in the Hereafter), in order that they may (repent and) return (i.e. accept Islam).\n",
        "TRANSLATION_14": "But We will let them taste the nearest punishment (in this life) before the greater punishment, so that they may return (to faith).\n",
        "TRANSLATION_15": "We will make them taste the lesser torment, prior to the greater torment, so that they may return.\n",
        "TRANSLATION_16": "And we will surely let them taste the nearer punishment short of the greater punishment that perhaps they will repent.\n",
        "TRANSLATION_17": "[32:21] And We shall surely make them taste the nearer chastisement, that is, the chastisement of this world — in their being killed or taken captive, or [through] years of drought and disease — before the greater chastisement, the chastisement of the Hereafter, that perhaps they, namely, those remaining of them, may return, to belief.\n",
        "TRANSLATION_18": "(And verily We make them taste) We will inflict on them, i.e. on the people of Mecca (the lower punishment) the punishment of the life of this world: dryness of the land, drought, hunger, assassination, etc; it is also said that this refers to the torment of the grave (before the greater) before the torment of the Fire; this is a warning to them, (that haply they may return) from their disbelief and accept faith.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "32:21",
            "68:33",
            "52:47",
            "39:26",
            "43:48",
            "33:68",
            "29:54",
            "24:23",
            "22:62",
            "31:30"
        ],
        "BIBLE": [
            "prophets:zephaniah:3:20",
            "prophets:ezekiel:35:9",
            "writings:psalms:21:13",
            "torah:exodus:23:27",
            "writings:ii%20chronicles:6:24",
            "prophets:isaiah:10:2",
            "writings:ezra:5:5",
            "prophets:isaiah:55:11",
            "prophets:jeremiah:31:13",
            "prophets:isaiah:29:21"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:8"
        ]
    }
}