{
    "VERSE": "32:22",
    "ARABIC": "وَمَنْ أَظْلَمُ مِمَّن ذُكِّرَ بِـَٔايَٰتِ رَبِّهِۦ ثُمَّ أَعْرَضَ عَنْهَآ إِنَّا مِنَ ٱلْمُجْرِمِينَ مُنتَقِمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Who could do greater wrong than someone who is reminded of the Signs of his Lord and then turns away from them? We will take revenge on the evildoers.",
        "TRANSLATION_1": "Who is more wicked than he who is reminded of his Lord's revelations yet turns away from them; We will surely requite the sinners.\n",
        "TRANSLATION_2": "And who is more unjust than he who is given good counsel through the Signs of his Lord and yet he turns away from them? Surely We will exact full retribution from such criminals.\n",
        "TRANSLATION_3": "Who are more unjust than those who are reminded of the revelation of their Lord, but have ignored them? We will take revenge on the criminal.\n",
        "TRANSLATION_4": "And who is more unjust than one who is preached to from the verses his Lord, then he turns away from them? We will indeed take revenge from the guilty.\n",
        "TRANSLATION_5": "And who does more wrong than he who is reminded of the Ayat of his Lord, then turns aside therefrom Verily, We shall exact retribution from the criminals.\n",
        "TRANSLATION_6": "And who is more unjust than he who is reminded of the communications of his Lord, then he turns away from them? Surely We will give punishment to the guilty.\n",
        "TRANSLATION_7": "And who does greater evil than he who is reminded of the signs of his Lord, then turns away from them? We shall take vengeance upon the sinners.\n",
        "TRANSLATION_8": "And who doth greater wrong than he who is reminded of the revelations of his Lord, then turneth from them. Lo! We shall requite the guilty.\n",
        "TRANSLATION_9": "Who does greater wrong than someone who, when revelations of his Lord are recited to him, turns away from them? We shall inflict retribution on the guilty.\n",
        "TRANSLATION_10": "And who is a greater wrong-doer than he who is reminded of His signs, then he turneth aside therefrom? Verily unto the culprits We are going to be Avenger.\n",
        "TRANSLATION_11": "Who is a greater wrongdoer than him who is reminded of his Lord’s signs, whereat he disregards them? Indeed, We shall take vengeance upon the guilty.\n",
        "TRANSLATION_12": "And who does more wrong than one to whom are recited the Signs of his Lord, and who then turns away therefrom? Verily from those who transgress We shall exact (due) Retribution.\n",
        "TRANSLATION_13": "And who does more wrong than he who is reminded of the Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) of his Lord, then he turns aside therefrom? Verily, We shall exact retribution from the Mujrimun (criminals, disbelievers, polytheists, sinners, etc.).\n",
        "TRANSLATION_14": "And who is more wicked than he who, when reminded of the verses of his Lord turns away from them? We take revenge on the sinners.\n",
        "TRANSLATION_15": "Who is more wrong than he, who, when reminded of his Lord’s revelations, turns away from them? We will certainly wreak vengeance upon the criminals.\n",
        "TRANSLATION_16": "And who is more unjust than one who is reminded of the verses of his Lord; then he turns away from them? Indeed We, from the criminals, will take retribution.\n",
        "TRANSLATION_17": "[32:22] And who does greater wrong than he who is reminded of the signs of his Lord, [such as] the Qur’ān, but then turns away from them?, in other words, none does greater wrong than such [a person]. Assuredly We shall take vengeance upon the criminals, the idolaters.\n",
        "TRANSLATION_18": "(And who doth greater wrong) no one is more insolent and iniquitous (than he who is reminded of) admonished by (the revelations of his Lord) this was revealed about the hypocrites and the deriders of the Qur'an, (then turneth from them) in denial. (Lo! We shall requite) We will chastise (the guilty) the idolaters.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "32:22",
            "23:58",
            "10:17",
            "36:46",
            "6:117",
            "13:27",
            "6:21",
            "18:57",
            "27:93",
            "43:46"
        ],
        "BIBLE": [
            "prophets:ezekiel:3:20",
            "torah:numbers:32:7",
            "torah:numbers:32:9",
            "prophets:joshua:23:16",
            "writings:song%20of%20songs:5:6",
            "prophets:ii%20samuel:8:14",
            "writings:ezra:9:13",
            "torah:numbers:18:29",
            "prophets:ii%20samuel:8:6",
            "prophets:i%20samuel:10:9"
        ]
    }
}