{
    "VERSE": "32:24",
    "ARABIC": "وَجَعَلْنَا مِنْهُمْ أَئِمَّةً يَهْدُونَ بِأَمْرِنَا لَمَّا صَبَرُوا۟ وَكَانُوا۟ بِـَٔايَٰتِنَا يُوقِنُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "We appointed leaders from among them, guiding by Our command when they were steadfast and when they had certainty about Our Signs.",
        "TRANSLATION_1": "When they persevered and firmly believed Our revelations We appointed learned men among them who guided them by Our command.\n",
        "TRANSLATION_2": "and when they remained steadfast and firmly believed in Our Signs, We created among them leaders who guided people by Our command.\n",
        "TRANSLATION_3": "We appointed some of the Israelites as leaders for their exercising patience to guide the others to Our commands. They had firm belief in Our revelations.\n",
        "TRANSLATION_4": "And We made some leaders among them, guiding by Our command, when they had persevered; and they used to accept faith in Our signs.\n",
        "TRANSLATION_5": "And We made from among them, leaders, giving guidance under Our command, when they were patient and used to believe with certainty in Our Ayat.\n",
        "TRANSLATION_6": "And We made of them Imams to guide by Our command when they were patient, and they were certain of Our communications.\n",
        "TRANSLATION_7": "And We appointed from among them leaders guiding by Our command, when they endured patiently, and had sure faith in Our signs.\n",
        "TRANSLATION_8": "And when they became steadfast and believed firmly in Our revelations, We appointed from among them leaders who guided by Our command.\n",
        "TRANSLATION_9": "We appointed leaders from among them, guiding by Our command when they were steadfast and when they had firm faith in Our signs.\n",
        "TRANSLATION_10": "And We appointed, from amongst them, leaders guiding others by Our command, when they had persevered, and of Our signs they were convinced.\n",
        "TRANSLATION_11": "When they had been patient and had conviction in Our signs, We appointed amongst them imams to guide [the people] by Our command.\n",
        "TRANSLATION_12": "And We appointed, from among them, leaders, giving guidance under Our command, so long as they persevered with patience and continued to have faith in Our Signs.\n",
        "TRANSLATION_13": "And We made from among them (Children of Israel), leaders, giving guidance under Our Command, when they were patient and used to believe with certainty in Our Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.).\n",
        "TRANSLATION_14": "When they were patient, We made from them leaders, guiding with Our Command and they were certain of Our verses.\n",
        "TRANSLATION_15": "And We appointed leaders from among them, guiding by Our command, as long as they persevered and were certain of Our communications.\n",
        "TRANSLATION_16": "And We made from among them leaders guiding by Our command when they were patient and [when] they were certain of Our signs.\n",
        "TRANSLATION_17": "[32:24] And We appointed among them leaders (read a-immatan by pronouncing both hamzas, or by substituting the second one with a yā) who guided, people, by Our command, when they had endured [patiently], in [observing] their religion, and against the hardships [they suffered] because of their enemies (lammā, ‘when’: a variant reading has limā, ‘because’) and had conviction in Our signs, [the ones] indicating Our power and Our Oneness.\n",
        "TRANSLATION_18": "(And when they became steadfast) in their faith in and obedience of Me (and believed firmly) believed from their Scripture (in Our revelations) in Muhammad (pbuh) and in the Qur'an, (We appointed from among them) from among the children of Israel (leaders) of goodness (who guided by Our command) who invite people to Our command.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "32:24",
            "78:28",
            "43:69",
            "43:47",
            "37:14",
            "20:26",
            "21:27",
            "15:79",
            "15:81",
            "42:35"
        ],
        "BIBLE": [
            "torah:deuteronomy:32:8",
            "writings:psalms:115:16",
            "writings:ecclesiastes:3:10",
            "prophets:isaiah:8:18",
            "prophets:joshua:21:3",
            "torah:deuteronomy:3:18",
            "prophets:i%20kings:13:5",
            "writings:psalms:119:73",
            "torah:numbers:3:9",
            "torah:numbers:17:21"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:3:5",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:2:5"
        ]
    }
}