{
    "VERSE": "32:25",
    "ARABIC": "إِنَّ رَبَّكَ هُوَ يَفْصِلُ بَيْنَهُمْ يَوْمَ ٱلْقِيَٰمَةِ فِيمَا كَانُوا۟ فِيهِ يَخْتَلِفُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "On the Day of Rising your Lord will decide between them regarding everything about which they differed.",
        "TRANSLATION_1": "Surely your Lord will decide between them about what they were at variance, on the Day of Resurrection.\n",
        "TRANSLATION_2": "Surely your Lord will judge among them on the Day of Resurrection concerning the matters about which the Children of Israel used to differ.\n",
        "TRANSLATION_3": "Your Lord will issue His decree about their (believers and disbeliever's) differences on the Day of Judgment.\n",
        "TRANSLATION_4": "Indeed your Lord will judge between them on the Day of Resurrection concerning the matters in which they used to differ.\n",
        "TRANSLATION_5": "Verily, your Lord will judge between them on the Day of Resurrection, concerning that wherein they used to differ.\n",
        "TRANSLATION_6": "Surely your Lord will judge between them on the day of resurrection concerning that wherein they differ.\n",
        "TRANSLATION_7": "Surely thy Lord will distinguish between them on the Resurrection Day, touching that whereon they were at variance.\n",
        "TRANSLATION_8": "Lo! thy Lord will judge between them on the Day of Resurrection concerning that wherein they used to differ.\n",
        "TRANSLATION_9": "Surely your Lord will judge between them on the Day of Resurrection concerning that wherein they used to differ.\n",
        "TRANSLATION_10": "Verily thy Lord! He shall decide between them on the Day of Judgment concerning that wherein they have been differing.\n",
        "TRANSLATION_11": "Indeed your Lord will judge between them on the Day of Resurrection concerning that about which they used to differ.\n",
        "TRANSLATION_12": "Verily thy Lord will judge between them on the Day of Judgment, in the matters wherein they differ (among themselves)\n",
        "TRANSLATION_13": "Verily, your Lord will judge between them on the Day of Resurrection, concerning that wherein they used to differ.\n",
        "TRANSLATION_14": "On the Day of Resurrection your Lord will distinguish between them that on which they varied.\n",
        "TRANSLATION_15": "Your Lord will judge between them on the Day of Resurrection regarding everything they had disputed.\n",
        "TRANSLATION_16": "Indeed, your Lord will judge between them on the Day of Resurrection concerning that over which they used to differ.\n",
        "TRANSLATION_17": "[32:25] Surely your Lord will judge between them on the Day of Resurrection concerning that wherein they used to differ, in matters of religion.\n",
        "TRANSLATION_18": "(Lo! thy Lord) Muhammad (will judge between them) between the believer and disbeliever; it is also said: between the Children of Israel (on the Day of Resurrection concerning that wherein) in Religion (they used to differ) they used to oppose.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "32:25",
            "16:124",
            "22:69",
            "45:17",
            "10:93",
            "39:31",
            "3:55",
            "3:194",
            "26:117",
            "23:16"
        ],
        "BIBLE": [
            "prophets:i%20samuel:20:23",
            "prophets:judges:21:5",
            "prophets:joshua:22:24",
            "torah:leviticus:23:34",
            "torah:numbers:8:20",
            "prophets:judges:20:27",
            "prophets:joshua:4:7",
            "prophets:isaiah:27:12",
            "torah:leviticus:7:36",
            "torah:leviticus:23:27"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:3:1",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:5"
        ]
    }
}