{
    "VERSE": "32:26",
    "ARABIC": "أَوَلَمْ يَهْدِ لَهُمْ كَمْ أَهْلَكْنَا مِن قَبْلِهِم مِّنَ ٱلْقُرُونِ يَمْشُونَ فِى مَسَٰكِنِهِمْ إِنَّ فِى ذَٰلِكَ لَءَايَٰتٍ أَفَلَا يَسْمَعُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Are they not guided by the many generations We destroyed before them, among whose ruined homes they walk around? There are certainly Signs in that. So will they not listen?",
        "TRANSLATION_1": "Did they not find guidance in the many generations We had destroyed before them, over whose dwellings they (now) walk? There were indeed signs in this. Will they even then not listen?\n",
        "TRANSLATION_2": "Did (these historical events) not make them realise that We destroyed many nations before them amidst whose dwellings they now move about? Surely there are many Signs in this. Are they unable to hear?\n",
        "TRANSLATION_3": "Was it not a lesson for them, (the unbelievers), that We destroyed the many generations living before them among whose ruined dwellings they are now walking. In this there is many evidence (of the truth). Will they not then listen?\n",
        "TRANSLATION_4": "And did they not obtain guidance by the fact that We did destroy many generations before them, so now they walk in their houses? Indeed in this are signs; so do they not heed?\n",
        "TRANSLATION_5": "Is it not a guidance for them: how many generations We have destroyed before them in whose dwellings they do walk about Verily, therein indeed are signs. Would they not then listen\n",
        "TRANSLATION_6": "Does it not point out to them the right way, how many of the generations, in whose abodes they go about, did We destroy before them? Most surely there are signs in this; will they not then hear?\n",
        "TRANSLATION_7": "Is it not a guidance to them, how many generations We destroyed before them in whose dwelling-places they walk? Surely in that are signs; what, will they not hear?\n",
        "TRANSLATION_8": "Is it not a guidance for them (to observe) how many generations We destroyed before them, amid whose dwelling places they do walk? Lo! therein verily are portents! Will they not then heed?\n",
        "TRANSLATION_9": "Does it not guide them [to see] how many generations We destroyed before them, among whose ruined dwellings they now walk about? There truly are signs in this -- will they not listen?\n",
        "TRANSLATION_10": "Hath this not guided them: how many generations We have destroyed before them amidst whose dwellings they walk? Verily therein are signs; will they not therefore hearken?\n",
        "TRANSLATION_11": "Does it not dawn upon them how many generations We have destroyed before them, amid [the ruins of] whose dwellings they walk? There are indeed signs in that. Will they not then listen?\n",
        "TRANSLATION_12": "Does it not teach them a lesson, how many generations We destroyed before them, in whose dwellings they (now) go to and fro? Verily in that are Signs: Do they not then listen?\n",
        "TRANSLATION_13": "Is it not a guidance for them, how many generations We have destroyed before them in whose dwellings they do walk about? Verily, therein indeed are signs. Would they not then listen?\n",
        "TRANSLATION_14": "Is it not a guidance to them, how many generations We destroyed before them in whose dwelling places they walk? Surely, in this there are signs. Will they not then hear!\n",
        "TRANSLATION_15": "Is it not a lesson for them, how many generations We have destroyed before them, in whose habitations they walk? Surely in that are signs. Do they not hear?\n",
        "TRANSLATION_16": "Has it not become clear to them how many generations We destroyed before them, [as] they walk among their dwellings? Indeed in that are signs; then do they not hear?\n",
        "TRANSLATION_17": "[32:26] Or is it not an indication for them how many generations, communities, on account of their disbelief, We destroyed before them, that is to say, has [not] Our destruction of many [generations] become clear to the disbelievers of Mecca, amid whose dwellings they walk (yamshūna is a circumstantial qualifier referring to the person of the pronoun lahum, ‘for them’) during their travels to Syria and other places, so that they might take heed? Surely in that there are signs, indications of Our power. Are they not able to hear?, in a way so as to reflect and be admonished.\n",
        "TRANSLATION_18": "(Is it not a guidance for them (to observe)) has not been explained to the disbelievers of Mecca (how many generations He destroyed before them) through His chastisement, (amid whose dwelling places they do walk) they walk amid the dwellings of the people of Shu'ayb, Salih and Hud? (Lo, therein) in that which We have done to them (verily are portents) signs and lessons for those who came after them! (Will they not then heed) will they not obey He Who did this to them?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "32:26",
            "20:128",
            "36:31",
            "19:67",
            "15:75",
            "15:77",
            "27:86",
            "39:52",
            "30:37",
            "21:6"
        ],
        "BIBLE": [
            "prophets:i%20kings:8:13",
            "prophets:ezekiel:26:20",
            "torah:deuteronomy:13:15",
            "prophets:ezekiel:39:7",
            "prophets:jeremiah:19:12",
            "torah:leviticus:23:21",
            "prophets:i%20kings:16:19",
            "prophets:jeremiah:4:7",
            "writings:psalms:45:18",
            "torah:leviticus:16:16"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:5:1"
        ]
    }
}