{
    "VERSE": "32:3",
    "ARABIC": "أَمْ يَقُولُونَ ٱفْتَرَىٰهُ بَلْ هُوَ ٱلْحَقُّ مِن رَّبِّكَ لِتُنذِرَ قَوْمًا مَّآ أَتَىٰهُم مِّن نَّذِيرٍ مِّن قَبْلِكَ لَعَلَّهُمْ يَهْتَدُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Or do they say, 'He has invented it'? No indeed! It is the truth from your Lord to warn a people to whom, before you, no warner came, so that hopefully they will be guided.",
        "TRANSLATION_1": "Or do they say he has fabricated it? In fact, it is the truth from your Lord so that you may warn the people to whom no admonisher was sent before you. They may haply come to guidance.\n",
        "TRANSLATION_2": "Or do they say: “He has fabricated it?” Nay, it is the Truth from your Lord so that you may warn a people to whom no warner came before you; perhaps they will be guided to the Right Way.\n",
        "TRANSLATION_3": "Do they say that he, (Muhammad), has invented it? No, it is the truth from your Lord so that you will warn the people who have not received a warning before you. Perhaps they will seek guidance.\n",
        "TRANSLATION_4": "What! They dare say that, “He has fabricated it”? In fact it is the Truth from your Lord, in order that you warn a nation towards whom no Herald of Warning came before you, in the hope of their attaining guidance.\n",
        "TRANSLATION_5": "Or say they: \"He has fabricated it\" Nay, it is the truth from your Lord, so that you may warn a people to whom no warner has come before you, in order that they may be guided.\n",
        "TRANSLATION_6": "Or do they say: He has forged it? Nay! it is the truth from your Lord that you may warn a people to whom no warner has come before you, that they may follow the right direction.\n",
        "TRANSLATION_7": "Or do they say, 'He has forged it'? Say: 'Not so; it is the truth from thy Lord that thou mayest warn a people to whom no warner came before thee, that haply so they may be guided.\n",
        "TRANSLATION_8": "Or say they: He hath invented it? Nay, but it is the Truth from thy Lord, that thou mayst warn a folk to whom no warner came before thee, that haply they may walk aright.\n",
        "TRANSLATION_9": "Do they say, \"He has invented it himself.\"? No indeed! It is the truth from your Lord to warn a people to whom, before you, no warner came, so that hopefully they may be rightly guided.\n",
        "TRANSLATION_10": "Will they say: he hath fabricated it? Aye! it is the truth from thy Lord, that thou mayest warn therewith a people unto whom no warner came before thee, that haply they may be guided.\n",
        "TRANSLATION_11": "But they say, ‘He has fabricated it.’ No, it is the truth from your Lord, that you may warn a people to whom there did not come any warner before you, so that they may be guided [to the right path].\n",
        "TRANSLATION_12": "Or do they say, \"He has forged it\"? Nay, it is the Truth from thy Lord, that thou mayest admonish a people to whom no warner has come before thee: in order that they may receive guidance.\n",
        "TRANSLATION_13": "Or say they: \"He (Muhammad SAW) has fabricated it?\" Nay, it is the truth from your Lord, that you may warn a people to whom no warner has come before you (O Muhammad SAW), in order that they may be guided.\n",
        "TRANSLATION_14": "Or do they say: 'He has forged it himself' Say: 'No, it is the truth from your Lord so that you can warn a nation to whom none has warned before you, in order that they are guided.\n",
        "TRANSLATION_15": "Yet they say, “He made it up.” In fact, it is the Truth from your Lord, to warn a people who received no warner before you, that they may be guided.\n",
        "TRANSLATION_16": "Or do they say, \"He invented it\"? Rather, it is the truth from your Lord, [O Muhammad], that you may warn a people to whom no warner has come before you [so] perhaps they will be guided.\n",
        "TRANSLATION_17": "[32:3]   Or do they say, ‘He, Muhammad (s), has invented it’? Nay, but it is the truth from your Lord, that you may warn, thereby, a people to whom no warner came before you (mā is for negation) that perhaps they may find [right] guidance, by your warning.\n",
        "TRANSLATION_18": "468 Or say they) the disbelievers of Mecca say: (He hath invented it) Muhammad invented the Qur'an? (Nay, but it) i.e. the Qur'an (is the Truth from thy Lord) Gabriel brought down to you, (that thou mayst warn a folk) i.e. the Quraysh (to whom no warner came before you) no warning messenger came to them before you, Muhammad, (that haply they may walk aright) that they may be guided from error.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "32:3",
            "28:46",
            "28:53",
            "17:105",
            "29:30",
            "51:46",
            "2:147",
            "3:60",
            "34:44",
            "54:33"
        ],
        "BIBLE": [
            "prophets:jeremiah:2:31",
            "prophets:isaiah:8:11",
            "prophets:i%20kings:18:21",
            "prophets:ezekiel:36:22",
            "prophets:judges:21:5",
            "torah:deuteronomy:9:12",
            "writings:ruth:1:16",
            "torah:deuteronomy:12:30",
            "writings:ruth:3:10",
            "prophets:jeremiah:7:28"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:13",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:7"
        ]
    }
}