{
    "VERSE": "32:30",
    "ARABIC": "فَأَعْرِضْ عَنْهُمْ وَٱنتَظِرْ إِنَّهُم مُّنتَظِرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "So turn from them and wait. They too are waiting,",
        "TRANSLATION_1": "Therefore turn away from them and wait as they are waiting.\n",
        "TRANSLATION_2": "So (leave them to themselves and) turn away from them and wait; they too are waiting.\n",
        "TRANSLATION_3": "Turn away from them and wait. They are, also, waiting.\n",
        "TRANSLATION_4": "Therefore turn away from them and wait – indeed they too have to wait.\n",
        "TRANSLATION_5": "So turn aside from them and await, verily, they (too) are awaiting.\n",
        "TRANSLATION_6": "Therefore turn away from them and wait, surely they too are waiting.\n",
        "TRANSLATION_7": "So turn thou away from them, and wait; they too are waiting.\n",
        "TRANSLATION_8": "So withdraw from them (O Muhammad), and await (the event). Lo! they (also) are awaiting (it).\n",
        "TRANSLATION_9": "So turn away from them and wait. They too are waiting.\n",
        "TRANSLATION_10": "Wherefore turn aside thou from them, and await; verily they are awaiting.\n",
        "TRANSLATION_11": "So turn away from them, and wait. They too are waiting.\n",
        "TRANSLATION_12": "So turn away from them, and wait: they too are waiting.\n",
        "TRANSLATION_13": "So turn aside from them (O Muhammad SAW) and await, verily they (too) are awaiting.\n",
        "TRANSLATION_14": "Therefore turn away from them, and wait, they are waiting.\n",
        "TRANSLATION_15": "So turn away from them, and wait. They too are waiting.\n",
        "TRANSLATION_16": "So turn away from them and wait. Indeed, they are waiting.\n",
        "TRANSLATION_17": "[32:30] So turn away from them, and wait, for the chastisement to be sent down on them. They too are waiting, for your death to take place or [for you] to be killed and so be rid of you — this was [revealed] before the command to fight them. Medinese; it consists of 73 verses, revealed after [sūrat] Āl ‘Imrān.\n",
        "TRANSLATION_18": "(So withdraw from them (0 Muhammad)) from Banu Khuzaymah and do not preoccupy yourself with them, (and await (the event)) await their destruction on the day of the conquest of Mecca. (Lo! they also are awaiting (it)) they are also awaiting their destruction. And Allah did indeed destroy them upon the conquest of Mecca'. And of the surah in which the clans are mentioned, which is all Medinan and consists of 93 (sic) verses, 1,282 words and 5,700 letters: Surah 33: The Clans (al-Ahzab) And of the surah in which the clans are mentioned, which is all Medinan and consists of 93 (sic) verses, 1,282 words and 5,700 letters:\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "32:30",
            "44:59",
            "37:24",
            "37:90",
            "51:45",
            "44:14",
            "7:119",
            "36:76",
            "26:94",
            "37:137"
        ],
        "BIBLE": [
            "writings:lamentations:5:21",
            "prophets:jeremiah:31:18",
            "writings:psalms:85:4",
            "writings:lamentations:5:22",
            "prophets:ezekiel:33:11",
            "prophets:jeremiah:15:5",
            "prophets:isaiah:12:1",
            "prophets:jeremiah:2:35",
            "prophets:joel:2:14",
            "writings:psalms:119:102"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:10",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:5:1"
        ]
    }
}