{
    "VERSE": "32:5",
    "ARABIC": "يُدَبِّرُ ٱلْأَمْرَ مِنَ ٱلسَّمَآءِ إِلَى ٱلْأَرْضِ ثُمَّ يَعْرُجُ إِلَيْهِ فِى يَوْمٍ كَانَ مِقْدَارُهُۥٓ أَلْفَ سَنَةٍ مِّمَّا تَعُدُّونَ",
    "ENGLISH": {
        "TRANSLATION_0": "He directs the whole affair from heaven to earth. Then it will again ascend to Him on a Day whose length is a thousand years by the way you measure.",
        "TRANSLATION_1": "He regulates all affairs from high to low, then they rise to perfection step by step in a (heavenly) day whose measure is a thousand years of your reckoning.\n",
        "TRANSLATION_2": "He governs from the heaven to the earth and then the record (of this governance) goes up to Him in a day whose measure is a thousand years in your reckoning.\n",
        "TRANSLATION_3": "He sends the regulation of the affair from the heavens to the earth, then on the day which is equal to one thousand years of yours, it will ascend to Him.\n",
        "TRANSLATION_4": "He plans (all) the job(s) from the heaven to the earth – then it will return to Him on the Day which amounts to a thousand years in your count.\n",
        "TRANSLATION_5": "He directs the command from the heavens to the earth; then it will go up to Him, in one Day, the space whereof is a thousand years of your reckoning.\n",
        "TRANSLATION_6": "He regulates the affair from the heaven to the earth; then shall it ascend to Him in a day the measure of which is a thousand years of what you count.\n",
        "TRANSLATION_7": "He directs the affair from heaven to earth, then it goes up to Him in one day, whose measure is a thousand years of your counting.\n",
        "TRANSLATION_8": "He directeth the ordinance from the heaven unto the earth; then it ascendeth unto Him in a Day, whereof the measure is a thousand years of that ye reckon.\n",
        "TRANSLATION_9": "He directs all affairs from heaven to earth. Then all will again ascend to Him on a Day whose length is a thousand years by the way you measure.\n",
        "TRANSLATION_10": "He disposeth every affair from the heaven unto the earth; thereafter it shall ascend unto Him in a Day the measure whereof is one thousand years of that which ye compute.\n",
        "TRANSLATION_11": "He directs the command from the heaven to the earth; then it ascends toward Him in a day whose span is a thousand years by your reckoning.\n",
        "TRANSLATION_12": "He rules (all) affairs from the heavens to the earth: in the end will (all affairs) go up to Him, on a Day, the space whereof will be (as) a thousand years of your reckoning.\n",
        "TRANSLATION_13": "He arranges (every) affair from the heavens to the earth, then it (affair) will go up to Him, in one Day, the space whereof is a thousand years of your reckoning (i.e. reckoning of our present world's time).\n",
        "TRANSLATION_14": "He directs the affair from heaven to earth. Then it will ascend to Him in one day, a day whose value is a thousand years by your reckoning.\n",
        "TRANSLATION_15": "He regulates all affairs, from the heavens, to the earth. Then it ascends to Him on a Day the length of which is a thousand years by your count.\n",
        "TRANSLATION_16": "He arranges [each] matter from the heaven to the earth; then it will ascend to Him in a Day, the extent of which is a thousand years of those which you count.\n",
        "TRANSLATION_17": "[32:5] He directs the command from the heaven to the earth, for the duration of this world, then it ascends, then the command and the direction [thereof] returns, to Him in a day whose measure is a thousand years by your reckoning, in this world. In sūrat sa’ala, [An asker] asked [the measure is said to be]: ‘fifty thousand years’ [Q. 70:4] — and this [day] is the Day of Resurrection, [reckoned so] because of the severity of its terrors for the disbeliever. As for the believer, however, for him it will be easier than performing any one of [his] obligatory prayers in this world — as is stated in hadīth.\n",
        "TRANSLATION_18": "(He directeth the ordinance from the heaven unto the earth) He sends the angels with revelation, Scriptures and misfortunes; (then it ascendeth unto Him) the angels ascend to Him (in a Day, whereof the measure) the measure of its ascent for other than the angels (is a thousand years of that you reckon) of the years of the life of this world.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "32:5",
            "70:4",
            "3:109",
            "55:29",
            "42:53",
            "30:25",
            "57:5",
            "2:284",
            "23:18",
            "10:3"
        ],
        "BIBLE": [
            "writings:job:1:5",
            "prophets:jeremiah:23:20",
            "prophets:jeremiah:30:24",
            "torah:genesis:35:3",
            "writings:ruth:1:7",
            "prophets:joshua:2:22",
            "prophets:isaiah:23:17",
            "prophets:i%20samuel:29:11",
            "torah:leviticus:25:27",
            "prophets:ii%20kings:7:15"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:3:4",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:3:6",
            "Sefer%20Yetzirah:6:4"
        ]
    }
}