{
    "VERSE": "32:7",
    "ARABIC": "ٱلَّذِىٓ أَحْسَنَ كُلَّ شَىْءٍ خَلَقَهُۥ وَبَدَأَ خَلْقَ ٱلْإِنسَٰنِ مِن طِينٍ",
    "ENGLISH": {
        "TRANSLATION_0": "He who has created all things in the best possible way. He commenced the creation of man from clay;",
        "TRANSLATION_1": "Who made all things He created excellent; and first fashioned man from clay,\n",
        "TRANSLATION_2": "He Who excelled in the creation of all that He created. He originated the creation of man from clay,\n",
        "TRANSLATION_3": "It is He Who created everything in the best manner and began the creation of the human being from clay.\n",
        "TRANSLATION_4": "The One Who created all things excellent, and Who initiated the creation of man from clay.\n",
        "TRANSLATION_5": "Who made everything He has created good and He began the creation of man from clay.\n",
        "TRANSLATION_6": "Who made good everything that He has created, and He began the creation of man from dust.\n",
        "TRANSLATION_7": "who has created all things well. And He originated the creation of man out of clay,\n",
        "TRANSLATION_8": "Who made all things good which He created, and He began the creation of man from clay;\n",
        "TRANSLATION_9": "who gave everything its perfect form. He originated the creation of man from clay,\n",
        "TRANSLATION_10": "Who hath made everything exceeding good which He hath created. And He originated the creation of man from clay;\n",
        "TRANSLATION_11": "who perfected everything that He created and commenced man’s creation from clay.\n",
        "TRANSLATION_12": "He Who has made everything which He has created most good: He began the creation of man with (nothing more than) clay,\n",
        "TRANSLATION_13": "Who made everything He has created good, and He began the creation of man from clay.\n",
        "TRANSLATION_14": "who perfected everything He created. He originated the creation of the human from clay,\n",
        "TRANSLATION_15": "He who perfected everything He created, and originated the creation of man from clay.\n",
        "TRANSLATION_16": "Who perfected everything which He created and began the creation of man from clay.\n",
        "TRANSLATION_17": "[32:7] Who perfected everything that He created (read khalaqahu, as a past tense functioning as an adjectival qualification [of what He perfected]; or khalqahu, ‘its creation’, as an inclusive substitution [for kulla shay’in, ‘everything’]). And He began the creation of man, Adam, from clay,\n",
        "TRANSLATION_18": "(Who made all things good which He created) He Who perfected everything He created, (and He began the creation of man) i.e. Adam (from clay) from the surface of the earth;\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "32:7",
            "20:50",
            "54:52",
            "15:19",
            "23:12",
            "67:1",
            "18:84",
            "78:29",
            "19:67",
            "51:49"
        ],
        "BIBLE": [
            "writings:ecclesiastes:8:15",
            "prophets:joshua:23:15",
            "writings:ruth:4:7",
            "writings:ecclesiastes:1:13",
            "writings:proverbs:22:24",
            "torah:exodus:2:21",
            "torah:deuteronomy:16:17",
            "writings:ecclesiastes:6:10",
            "writings:psalms:119:73",
            "torah:numbers:18:29"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:3:5",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:4:9"
        ]
    }
}