{
    "VERSE": "32:8",
    "ARABIC": "ثُمَّ جَعَلَ نَسْلَهُۥ مِن سُلَٰلَةٍ مِّن مَّآءٍ مَّهِينٍ",
    "ENGLISH": {
        "TRANSLATION_0": "then produced his seed from an extract of base fluid;",
        "TRANSLATION_1": "Then made his offspring from the extract of base fluid,\n",
        "TRANSLATION_2": "then made his progeny from the extract of a mean fluid,\n",
        "TRANSLATION_3": "He made His offspring come into existence from an extract of insignificant fluid,\n",
        "TRANSLATION_4": "Then kept his posterity with a part of an abject fluid.\n",
        "TRANSLATION_5": "Then He made his offspring from semen of despised water.\n",
        "TRANSLATION_6": "Then He made his progeny of an extract, of water held in light estimation.\n",
        "TRANSLATION_7": "then He fashioned his progeny of an extraction of mean water,\n",
        "TRANSLATION_8": "Then He made his seed from a draught of despised fluid;\n",
        "TRANSLATION_9": "then He made his progeny from an extract of a humble fluid.\n",
        "TRANSLATION_10": "Then He made his progeny from an extract of water base.\n",
        "TRANSLATION_11": "Then He made his progeny from an extract of a base fluid.\n",
        "TRANSLATION_12": "And made his progeny from a quintessence of the nature of a fluid despised:\n",
        "TRANSLATION_13": "Then He made his offspring from semen of worthless water (male and female sexual discharge).\n",
        "TRANSLATION_14": "then He made his offspring from a clot of weak water (semen).\n",
        "TRANSLATION_15": "Then made his reproduction from an extract of an insignificant fluid.\n",
        "TRANSLATION_16": "Then He made his posterity out of the extract of a liquid disdained.\n",
        "TRANSLATION_17": "[32:8] then He made his progeny, his offspring, from an extract, a blood clot, of a base, delicate, fluid, namely, the sperm-drop;\n",
        "TRANSLATION_18": "(Then He made his seed) his offspring (from a drought of despised fluid) from a weak drop of the water of man and woman;\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "32:8",
            "77:20",
            "86:6",
            "78:14",
            "56:31",
            "79:31",
            "14:16",
            "23:12",
            "80:25",
            "15:22"
        ],
        "BIBLE": [
            "prophets:i%20samuel:10:27",
            "prophets:malachi:2:9",
            "writings:ii%20chronicles:7:9",
            "writings:job:23:11",
            "torah:leviticus:5:9",
            "prophets:i%20kings:7:37",
            "prophets:jeremiah:2:13",
            "torah:numbers:8:4",
            "torah:numbers:19:9",
            "writings:ii%20chronicles:4:14"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:14",
            "Sefer%20Yetzirah:2:1",
            
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:3:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:3:7"
        ]
    }
}