{
    "VERSE": "32:9",
    "ARABIC": "ثُمَّ سَوَّىٰهُ وَنَفَخَ فِيهِ مِن رُّوحِهِۦ وَجَعَلَ لَكُمُ ٱلسَّمْعَ وَٱلْأَبْصَٰرَ وَٱلْأَفْـِٔدَةَ قَلِيلًا مَّا تَشْكُرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "then formed him and breathed His Ruh into him and gave you hearing, sight and hearts. What little thanks you show!",
        "TRANSLATION_1": "Then proportioned and breathed into him of His spirit, and gave you the senses of hearing, sight and feeling. And yet how little are the thanks you offer!\n",
        "TRANSLATION_2": "then He duly proportioned him, and breathed into him of His spirit, and bestowed upon you ears and eyes and hearts. And yet, little thanks do you give.\n",
        "TRANSLATION_3": "then He gave it proper shape and blew His spirit in it. He made ears, eyes and hearts for you, but you give Him very little thanks.\n",
        "TRANSLATION_4": "Then made him proper and blew into him a spirit from Him, and bestowed ears and eyes and hearts to you; very little thanks do you offer!\n",
        "TRANSLATION_5": "Then He fashioned him in due proportion, and breathed into him the soul; and He gave you hearing, sight and the sense of deduction. Little is the thanks you give!\n",
        "TRANSLATION_6": "Then He made him complete and breathed into him of His spirit, and made for you the ears and the eyes and the hearts; little is it that you give thanks.\n",
        "TRANSLATION_7": "then He shaped him, and breathed His spirit in him. And He appointed for you hearing, and sight, and hearts; little thanks you show.\n",
        "TRANSLATION_8": "Then He fashioned him and breathed into him of His Spirit; and appointed for you hearing and sight and hearts. Small thanks give ye!\n",
        "TRANSLATION_9": "Then He moulded him; He breathed His Spirit into him; He gave you hearing, sight, and hearts. How seldom you are grateful!\n",
        "TRANSLATION_10": "Then He fashioned him and breathed into him something of a spirit from Him; and He ordained for you hearing and sight and hearts. Little is the thanks ye return.\n",
        "TRANSLATION_11": "Then He proportioned him and breathed into him of His Spirit, and made for you hearing, sight, and hearts. Little do you thank.\n",
        "TRANSLATION_12": "But He fashioned him in due proportion, and breathed into him something of His spirit. And He gave you (the faculties of) hearing and sight and feeling (and understanding): little thanks do ye give!\n",
        "TRANSLATION_13": "Then He fashioned him in due proportion, and breathed into him the soul (created by Allah for that person), and He gave you hearing (ears), sight (eyes) and hearts. Little is the thanks you give!\n",
        "TRANSLATION_14": "Then He created him and (caused the angel to) breathe into him his (created) spirit. He gave you eyes and ears, and hearts, yet little do you thank.\n",
        "TRANSLATION_15": "Then He proportioned him, and breathed into him of His Spirit. Then He gave you the hearing, and the eyesight, and the brains—but rarely do you give thanks.\n",
        "TRANSLATION_16": "Then He proportioned him and breathed into him from His [created] soul and made for you hearing and vision and hearts; little are you grateful.\n",
        "TRANSLATION_17": "[32:9] then He proportioned him, that is to say, He created Adam, and breathed into him of His spirit, in other words, He made him a living sensory being after having been an inanimate thing. And He made for you, in other words, for [you] his descendants, hearing, meaning, ears, and sight and hearts. Little thanks do you give (mā here is extra, emphasising the ‘littleness’ [of the thanks]).\n",
        "TRANSLATION_18": "(Then He fashioned him) He gathered his creation in the womb of his mother (and breathed into him of His Spirit) He placed the spirit in him; (and appointed for you hearing) He created for you hearing so that you hear the Truth and guidance (and sight) so that you see through them the Truth and guidance (and hearts) in order to perceive the Truth and guidance. (Small thanks give you) for that which you have been given!\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "32:9",
            "67:23",
            "23:78",
            "17:36",
            "46:26",
            "16:78",
            "40:58",
            "16:108",
            "17:85",
            "6:110"
        ],
        "BIBLE": [
            "torah:deuteronomy:29:3",
            "prophets:i%20kings:3:12",
            "prophets:isaiah:6:10",
            "writings:psalms:119:34",
            "writings:psalms:119:73",
            "prophets:i%20kings:5:9",
            "prophets:jeremiah:35:15",
            "writings:nehemiah:12:31",
            "prophets:i%20kings:3:9",
            "writings:ecclesiastes:12:7"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:2:2",
            "Sefer%20Yetzirah:4:5"
        ]
    }
}