{
    "VERSE": "95:4",
    "ARABIC": "لَقَدْ خَلَقْنَا ٱلْإِنسَٰنَ فِىٓ أَحْسَنِ تَقْوِيمٍ",
    "ENGLISH": {
        "TRANSLATION_0": "We created man in the finest mould.",
        "TRANSLATION_1": "That We created man of finest possibilities,\n",
        "TRANSLATION_2": "surely We created man in the best mould;\n",
        "TRANSLATION_3": "We have created the human being in the best form\n",
        "TRANSLATION_4": "We have indeed created man in the best shape.\n",
        "TRANSLATION_5": "Verily, We created man in the best form.\n",
        "TRANSLATION_6": "Certainly We created man in the best make.\n",
        "TRANSLATION_7": "We indeed created Man in the fairest stature\n",
        "TRANSLATION_8": "Surely We created man of the best stature\n",
        "TRANSLATION_9": "We have indeed created man in the best of mould,\n",
        "TRANSLATION_10": "Assuredly We have created man in goodliest mould,\n",
        "TRANSLATION_11": "We certainly created man in the best of forms;\n",
        "TRANSLATION_12": "We have indeed created man in the best of moulds,\n",
        "TRANSLATION_13": "Verily, We created man of the best stature (mould),\n",
        "TRANSLATION_14": "Indeed, We created the human with the fairest stature\n",
        "TRANSLATION_15": "We created man in the best design.\n",
        "TRANSLATION_16": "We have certainly created man in the best of stature;\n",
        "TRANSLATION_17": "[95:4] Verily We created man (al-insān: the generic) in the best of forms, [in the best] proportioning of his shape.\n",
        "TRANSLATION_18": "(Surely We created man) the disbelieving man, referring here to al-Walid Ibn al-Mughirah, and it is also said it refers to Kildah Ibn Usayd (of the best stature) in the best of forms; and this is the reason why the oath was made.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "95:4",
            "90:4",
            "23:12",
            "55:3",
            "15:26",
            "96:6",
            "80:17",
            "99:3",
            "29:7",
            "103:2"
        ],
        "BIBLE": [
            "torah:deuteronomy:21:11",
            "prophets:i%20samuel:25:3",
            "prophets:ezekiel:10:8",
            "prophets:isaiah:52:14",
            "writings:proverbs:30:2",
            "writings:proverbs:14:14",
            "writings:proverbs:13:2",
            "torah:genesis:1:27",
            "writings:job:13:9",
            "writings:lamentations:3:26"
        ]
    }
}