{
    "VERSE": "95:5",
    "ARABIC": "ثُمَّ رَدَدْنَٰهُ أَسْفَلَ سَٰفِلِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Then We reduced him to the lowest of the low,",
        "TRANSLATION_1": "Then brought him down to the lowest of the low,\n",
        "TRANSLATION_2": "then We reverted him to the lowest of the low,\n",
        "TRANSLATION_3": "and We shall make him the lowest of low\n",
        "TRANSLATION_4": "We then turned him towards all the lowest of the low states.\n",
        "TRANSLATION_5": "Then We reduced him to the lowest of the low.\n",
        "TRANSLATION_6": "Then We render him the lowest of the low.\n",
        "TRANSLATION_7": "then We restored him the lowest of the low --\n",
        "TRANSLATION_8": "Then we reduced him to the lowest of the low,\n",
        "TRANSLATION_9": "then We cast him down as the lowest of the low,\n",
        "TRANSLATION_10": "Thereafter We cause him to return to the lowest of the low,\n",
        "TRANSLATION_11": "then We relegated him to the lowest of the low,\n",
        "TRANSLATION_12": "Then do We abase him (to be) the lowest of the low,-\n",
        "TRANSLATION_13": "Then We reduced him to the lowest of the low,\n",
        "TRANSLATION_14": "and We shall return him to the lowest of the low,\n",
        "TRANSLATION_15": "Then reduced him to the lowest of the low.\n",
        "TRANSLATION_16": "Then We return him to the lowest of the low,\n",
        "TRANSLATION_17": "[95:5] Then, in the case of certain individuals of his [species], We reduced him to the lowest of the low — a metaphor for old age and weakness, at which point a believer’s deeds are fewer than when he was young; but he will still have his reward, as God, exalted be He, says:\n",
        "TRANSLATION_18": "(Then We reduced him) in the Hereafter (to the lowest of the low) i.e. the Fire; it is also said that the above means: We have created the children of Adam in the best of forms when they are in the pick of their youth, then We reduce them to abject old age whereby no good deed is recorded in their favour except that which they used to do in their youth and prime,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "95:5",
            "37:98",
            "80:20",
            "26:119",
            "80:21",
            "74:45",
            "44:14",
            "80:22",
            "75:33",
            "70:13"
        ],
        "BIBLE": [
            "writings:job:41:20",
            "writings:psalms:21:13",
            "prophets:jeremiah:31:13",
            "prophets:ezekiel:35:9",
            "prophets:hosea:11:8",
            "prophets:jeremiah:34:11",
            "prophets:zephaniah:3:20",
            "torah:numbers:14:4",
            "prophets:jeremiah:34:22",
            "torah:exodus:23:27"
        ]
    }
}