{
    "VERSE": "95:6",
    "ARABIC": "إِلَّا ٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّٰلِحَٰتِ فَلَهُمْ أَجْرٌ غَيْرُ مَمْنُونٍ",
    "ENGLISH": {
        "TRANSLATION_0": "except for those who have iman and do right actions: they will have a wage which never fails.",
        "TRANSLATION_1": "Except those who believe and do the right, for whom there is reward undiminished.\n",
        "TRANSLATION_2": "except those who have faith and do righteous deeds. Theirs is a never ending reward.\n",
        "TRANSLATION_3": "except the righteously striving believers who will have a never ending reward.\n",
        "TRANSLATION_4": "Except those who accepted faith and did good deeds – for them is a never ending reward.\n",
        "TRANSLATION_5": "Save those who believe and do righteous deeds. Then they shall have a reward without end.\n",
        "TRANSLATION_6": "Except those who believe and do good, so they shall have a reward never to be cut off.\n",
        "TRANSLATION_7": "save those who believe, and do righteous deeds; they shall have a wage unfailing.\n",
        "TRANSLATION_8": "Save those who believe and do good works, and theirs is a reward unfailing.\n",
        "TRANSLATION_9": "except for those who believe and do good deeds -- theirs shall be an unending reward!\n",
        "TRANSLATION_10": "Save those who believe and work righteous Works. Theirs shall be hire unending.\n",
        "TRANSLATION_11": "except those who have faith and do righteous deeds. There will be an everlasting reward for them.\n",
        "TRANSLATION_12": "Except such as believe and do righteous deeds: For they shall have a reward unfailing.\n",
        "TRANSLATION_13": "Save those who believe (in Islamic Monotheism) and do righteous deeds, then they shall have a reward without end (Paradise).\n",
        "TRANSLATION_14": "except the believers who do good works, for theirs shall be an unfailing recompense.\n",
        "TRANSLATION_15": "Except those who believe and do righteous deeds; for them is a reward without end.\n",
        "TRANSLATION_16": "Except for those who believe and do righteous deeds, for they will have a reward uninterrupted.\n",
        "TRANSLATION_17": "[95:6] except those who believe and perform righteous deeds, for they shall have an unfailing reward, one unending — in a hadīth [it is stated], ‘When a believer reaches that stage of old age which prevents him from performing [good] deeds, then what he used to do is recorded in his favour [instead]’.\n",
        "TRANSLATION_18": "(Save those who believe) in Muhammad (pbuh) and the Qur'an (and do good works) and do acts of obedience in private between themselves and their Lord, (and theirs is a reward unfailing) their reward is 763 undiminished and unspoilt, good deeds will still be written for them even in old age and after they die.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "95:6",
            "84:25",
            "41:8",
            "68:3",
            "12:57",
            "11:11",
            "33:58",
            "1:7",
            "52:40",
            "52:35"
        ],
        "BIBLE": [
            "writings:ecclesiastes:2:11",
            "prophets:habakkuk:1:5",
            "writings:ii%20chronicles:31:20",
            "prophets:isaiah:45:17",
            "prophets:i%20kings:7:40",
            "writings:ii%20chronicles:4:11",
            "prophets:isaiah:56:5",
            "torah:exodus:34:10",
            "prophets:isaiah:62:11",
            "prophets:isaiah:43:13"
        ]
    }
}