{
    "VERSE": "95:8",
    "ARABIC": "أَلَيْسَ ٱللَّهُ بِأَحْكَمِ ٱلْحَٰكِمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Is Allah not the Justest of Judges?",
        "TRANSLATION_1": "Is not God the most equitable of all judges?\n",
        "TRANSLATION_2": "Is not Allah the Greatest of all sovereigns?\n",
        "TRANSLATION_3": "Is God not the best of the Judges?\n",
        "TRANSLATION_4": "Is not Allah the Greatest Judge upon all judges?\n",
        "TRANSLATION_5": "Is not Allah the best of judges\n",
        "TRANSLATION_6": "Is not Allah the best of the Judges?\n",
        "TRANSLATION_7": "Is not God the justest of judges?\n",
        "TRANSLATION_8": "Is not Allah the most conclusive of all judges?\n",
        "TRANSLATION_9": "Is not God the greatest of the judges?\n",
        "TRANSLATION_10": "Is not Allah the Greatest of the rulers?\n",
        "TRANSLATION_11": "Is not Allah the fairest of all judges?\n",
        "TRANSLATION_12": "Is not Allah the wisest of judges?\n",
        "TRANSLATION_13": "Is not Allah the Best of judges?\n",
        "TRANSLATION_14": "Is Allah not the Most Just of judges!\n",
        "TRANSLATION_15": "Is God not the Wisest of the wise?\n",
        "TRANSLATION_16": "Is not Allah the most just of judges?\n",
        "TRANSLATION_17": "[95:8] Is not God the fairest of all judges?, the most just of all judges. His passing judgement by means of [the process of] requital is one such example. In a hadīth [it is stated], ‘Whoever recites [sūrat] wa’l-tīni, ‘By the fig’, to the end of it, let him then say, “Yes Indeed! And I am of those who bear witness to this!” ’\n",
        "TRANSLATION_18": "(Is not Allah the most conclusive of all judges?) Is not Allah the most just of those who are just and the best of those who are best and is, therefore, able to bring you back to life, Walid!' And of the surah in which the Clot is mentioned, which is all Meccan and consists of 19 verses, 72 words and 122 letters: Surah 96: The Clot (al-'Alaq) And of the surah in which the Clot is mentioned, which is all Meccan and consists of 19 verses, 72 words and 122 letters:\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "95:8",
            "24:18",
            "96:14",
            "45:2",
            "39:1",
            "46:2",
            "9:112",
            "34:27",
            "5:50",
            "4:158"
        ],
        "BIBLE": [
            "writings:psalms:68:6",
            "writings:job:31:28",
            "torah:deuteronomy:31:6",
            "writings:psalms:147:1",
            "writings:job:22:12",
            "writings:proverbs:24:23",
            "writings:psalms:75:8",
            "prophets:ezekiel:21:5",
            "writings:ii%20chronicles:32:13",
            "writings:psalms:50:6"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:14",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:6:1"
        ]
    }
}