{
    "VERSE": "67:1",
    "ARABIC": "بِسْمِ ٱللَّهِ ٱلرَّحْمَٰنِ ٱلرَّحِيمِ تَبَٰرَكَ ٱلَّذِى بِيَدِهِ ٱلْمُلْكُ وَهُوَ عَلَىٰ كُلِّ شَىْءٍ قَدِيرٌ",
    "ENGLISH": {
        "TRANSLATION_0": "Blessed be He who has the Kingdom in His Hand! He has power over all things.",
        "TRANSLATION_1": "BLESSED BE HE who holds the (reins of) Kingship in His hand, who has power over everything,\n",
        "TRANSLATION_2": "Blessed is He in Whose Hand is the dominion of the Universe, and Who has power over everything;\n",
        "TRANSLATION_3": "Blessed is He in whose hands is the Kingdom and who has power over all things.\n",
        "TRANSLATION_4": "Most Auspicious is He in Whose control is the entire kingship; and He is Able to do all things.\n",
        "TRANSLATION_5": "Blessed be He in Whose Hand is the dominion; and He is Able to do all things.\n",
        "TRANSLATION_6": "Blessed is He in Whose hand is the kingdom, and He has power over all things,\n",
        "TRANSLATION_7": "Blessed be He in whose hand is the Kingdom -- He is powerful over everything --\n",
        "TRANSLATION_8": "Blessed is He in Whose hand is the Sovereignty, and, He is Able to do all things.\n",
        "TRANSLATION_9": "Blessed is He in whose hand is the Kingdom: He has power over all things;\n",
        "TRANSLATION_10": "Blest be He in whose hand is the dominion, and He is over everything Potent.\n",
        "TRANSLATION_11": "Blessed is He in whose hands is all sovereignty, and He has power over all things.\n",
        "TRANSLATION_12": "Blessed be He in Whose hands is Dominion; and He over all things hath Power;-\n",
        "TRANSLATION_13": "Blessed is He in Whose Hand is the dominion, and He is Able to do all things.\n",
        "TRANSLATION_14": "Blessed be He in whose Hand is the Kingdom, He is powerful over all things,\n",
        "TRANSLATION_15": "Blessed is He in whose hand is the sovereignty, and Who has power over everything.\n",
        "TRANSLATION_16": "Blessed is He in whose hand is dominion, and He is over all things competent -\n",
        "TRANSLATION_17": "[67:1] Blessed, exalted above the attributes of created beings, is He in Whose hand, at Whose disposal, is [all] sovereignty, [all] authority and power, and He has power over all things.\n",
        "TRANSLATION_18": "And from his narration on the authority of Ibn 'Abbas that he said regarding the interpretation of Allah's saying (Blessed is He): '(Blessed is He) He says: He possesses grace; it is also said this means: exalted, transcendent, exonerated is He, and He is too holy to have children or partners (in Whose hand is the Sovereignty) the power to bestow might and abasement and the power over the stores of all things, (and He is Able to do all things) to elevate or to abase.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "67:1",
            "3:26",
            "23:88",
            "57:2",
            "36:83",
            "54:49",
            "5:120",
            "64:1",
            "5:40",
            "3:189"
        ],
        "BIBLE": [
            "writings:proverbs:31:19",
            "writings:psalms:139:10",
            "writings:psalms:8:7",
            "writings:ii%20chronicles:20:6",
            "writings:i%20chronicles:13:9",
            "torah:leviticus:8:36",
            "prophets:isaiah:33:15",
            "writings:job:1:10",
            "prophets:isaiah:64:11",
            "prophets:i%20kings:11:35"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:4:2",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:1:1"
        ]
    }
}