{
    "VERSE": "67:10",
    "ARABIC": "وَقَالُوا۟ لَوْ كُنَّا نَسْمَعُ أَوْ نَعْقِلُ مَا كُنَّا فِىٓ أَصْحَٰبِ ٱلسَّعِيرِ",
    "ENGLISH": {
        "TRANSLATION_0": "They will say, 'If only we had really listened and used our intellect, we would not have been Companions of the Blaze.'",
        "TRANSLATION_1": "They will say: \"If we had listened and been wise, we would not have been among the inmates of Hell.\"\n",
        "TRANSLATION_2": "They will say: 'If we had only listened and understood, we would not be among the inmates of the Blazing Fire.'”\n",
        "TRANSLATION_3": "They will also say, \"Had We listened or used our minds, we would not have become the dwellers of hell\".\n",
        "TRANSLATION_4": "And they will say, “Had we listened or understood, we would not have been among the people of hell.”\n",
        "TRANSLATION_5": "And they will say: \"Had we but listened or used our intelligence, we would not have been among the dwellers of the blazing Fire!\"\n",
        "TRANSLATION_6": "And they shall say: Had we but listened or pondered, we should not have been among the inmates of the burning fire.\n",
        "TRANSLATION_7": "They also say, 'If we had only heard, or had understood, we would not have been of the inhabitants of the Blaze.'\n",
        "TRANSLATION_8": "And they say: Had we been wont to listen or have sense, we had not been among the dwellers in the flames.\n",
        "TRANSLATION_9": "They will say, \"If we had only listened or understood, we should not now be among the inmates of Hell,\"\n",
        "TRANSLATION_10": "And they will say: had we been wont to hearken or to reflect, we had not been among the fellows of the Blaze.\n",
        "TRANSLATION_11": "And they will say, ‘Had we listened or applied reason, we would not have been among inmates of the Blaze.’\n",
        "TRANSLATION_12": "They will further say: \"Had we but listened or used our intelligence, we should not (now) be among the Companions of the Blazing Fire!\"\n",
        "TRANSLATION_13": "And they will say: \"Had we but listened or used our intelligence, we would not have been among the dwellers of the blazing Fire!\"\n",
        "TRANSLATION_14": "And they will then say: 'If only we had listened and understood we should not now be among the inhabitants of the Blaze'\n",
        "TRANSLATION_15": "And they will say, “Had we listened or reasoned, we would not have been among the inmates of the Blaze.”\n",
        "TRANSLATION_16": "And they will say, \"If only we had been listening or reasoning, we would not be among the companions of the Blaze.\"\n",
        "TRANSLATION_17": "[67:10] And they will say, ‘Had we listened, that is, listening so as to understand, or comprehended, that is, comprehension entailing reflection [upon the truth], we would not have been among the inhabitants of the Blaze’.\n",
        "TRANSLATION_18": "(And they say) to the wardens: (Had we been wont to listen) to the Truth and guidance (or have sense) or desired the Truth in the life of the world, (we had not been among the dwellers in the flames) in Gehenna today.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "67:10",
            "67:11",
            "53:2",
            "84:12",
            "7:48",
            "25:11",
            "26:176",
            "7:42",
            "22:51",
            "15:78"
        ],
        "BIBLE": [
            "prophets:hosea:2:25",
            "prophets:isaiah:40:21",
            "prophets:isaiah:33:24",
            "prophets:i%20kings:20:8",
            "torah:exodus:3:7",
            "writings:daniel:12:8",
            "torah:deuteronomy:4:6",
            "prophets:jeremiah:2:31",
            "torah:numbers:14:15",
            "torah:exodus:8:5"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:12",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:1:14",
            "Sefer%20Yetzirah:3:8",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:5:1"
        ]
    }
}