{
    "VERSE": "67:11",
    "ARABIC": "فَٱعْتَرَفُوا۟ بِذَنۢبِهِمْ فَسُحْقًا لِّأَصْحَٰبِ ٱلسَّعِيرِ",
    "ENGLISH": {
        "TRANSLATION_0": "Then they will acknowledge their wrong actions. Away with the Companions of the Blaze!",
        "TRANSLATION_1": "So will they confess their guilt. Deprived (of all joys) will be the inmates of Hell.\n",
        "TRANSLATION_2": "Thus will they confess their sins. Damned are these inmates of the Blazing Fire.\n",
        "TRANSLATION_3": "They will confess to their sins, but the dwellers of hell will be far away from God's (mercy).\n",
        "TRANSLATION_4": "So now they admit their sins! Therefore accursed be the people of hell!\n",
        "TRANSLATION_5": "Then they will confess their sin. So, away with the dwellers of the blazing Fire!\n",
        "TRANSLATION_6": "So they shall acknowledge their sins, but far will be (forgiveness) from the inmates of the burning fire.\n",
        "TRANSLATION_7": "So they confess their sins. Curse the inhabitants of the Blaze!\n",
        "TRANSLATION_8": "So they acknowledge their sins; but far removed (from mercy) are the dwellers in the flames.\n",
        "TRANSLATION_9": "and thus they will confess their sin; far from God's mercy are the inmates of Hell.\n",
        "TRANSLATION_10": "So they shall confess their sin. Far away they-be, the fellows of the Blaze!\n",
        "TRANSLATION_11": "Thus they will admit their sin. So away with the inmates of the Blaze!\n",
        "TRANSLATION_12": "They will then confess their sins: but far will be (Forgiveness) from the Companions of the Blazing Fire!\n",
        "TRANSLATION_13": "Then they will confess their sin. So, away with the dwellers of the blazing Fire.\n",
        "TRANSLATION_14": "So it is that they confess their sins. Curse the inhabitants of the Blaze!\n",
        "TRANSLATION_15": "So they will acknowledge their sins. So away with the inmates of the Blaze.\n",
        "TRANSLATION_16": "And they will admit their sin, so [it is] alienation for the companions of the Blaze.\n",
        "TRANSLATION_17": "[67:11] Thus they will confess, when confession is of no avail, their sin, which was their denial of the warners. So away (suhqan or suhuqan) with the inhabitants of the Blaze!, so far away may they be from God’s mercy.\n",
        "TRANSLATION_18": "(So they acknowledge their sins) they acknowledge their idolatry; (but far removed) from Allah's mercy and banished (are the dwellers in the flames) in the Fire today.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "67:11",
            "67:10",
            "35:6",
            "51:59",
            "26:14",
            "26:176",
            "56:91",
            "22:4",
            "54:29",
            "91:14"
        ],
        "BIBLE": [
            "prophets:isaiah:33:24",
            "prophets:isaiah:10:16",
            "prophets:isaiah:24:6",
            "prophets:isaiah:61:9",
            "writings:daniel:2:18",
            "torah:exodus:20:17",
            "prophets:ezekiel:12:19",
            "prophets:jeremiah:14:10",
            "prophets:hosea:2:25",
            "prophets:jeremiah:32:38"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:14",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:1:12",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:3:8"
        ]
    }
}