{
    "VERSE": "67:12",
    "ARABIC": "إِنَّ ٱلَّذِينَ يَخْشَوْنَ رَبَّهُم بِٱلْغَيْبِ لَهُم مَّغْفِرَةٌ وَأَجْرٌ كَبِيرٌ",
    "ENGLISH": {
        "TRANSLATION_0": "Those who fear their Lord in the Unseen will have forgiveness and an immense reward.",
        "TRANSLATION_1": "For those who fear their Lord in secret is forgiveness and a great reward.\n",
        "TRANSLATION_2": "Surely forgiveness and a mighty reward await those who fear Allah without seeing Him.\n",
        "TRANSLATION_3": "Those who fear their Lord in secret will receive forgiveness and a great reward.\n",
        "TRANSLATION_4": "Indeed for those who fear their Lord without seeing is forgiveness, and a great reward.\n",
        "TRANSLATION_5": "Verily, those who fear their Lord unseen, theirs will be forgiveness and a great reward.\n",
        "TRANSLATION_6": "(As for) those who fear their Lord in secret, they shall surely have forgiveness and a great reward.\n",
        "TRANSLATION_7": "Surely those who fear their Lord in the Unseen -- there awaits them forgiveness and a great wage.\n",
        "TRANSLATION_8": "Lo! those who fear their Lord in secret, theirs will be forgiveness and a great reward.\n",
        "TRANSLATION_9": "As for those who fear their Lord in the unseen will have forgiveness and a rich reward.\n",
        "TRANSLATION_10": "Verily those who dread their Lord unseen, theirs shall be forgiveness and a great hire.\n",
        "TRANSLATION_11": "Indeed for those who fear their Lord in secret there will be forgiveness and a great reward.\n",
        "TRANSLATION_12": "As for those who fear their Lord unseen, for them is Forgiveness and a great Reward.\n",
        "TRANSLATION_13": "Verily! Those who fear their Lord unseen (i.e. they do not see Him, nor His Punishment in the Hereafter, etc.), theirs will be forgiveness and a great reward (i.e. Paradise).\n",
        "TRANSLATION_14": "But those who fear their Lord in the Unseen, for them there is forgiveness and a great wage.\n",
        "TRANSLATION_15": "As for those who fear their Lord in secret—for them is forgiveness and a great reward.\n",
        "TRANSLATION_16": "Indeed, those who fear their Lord unseen will have forgiveness and great reward.\n",
        "TRANSLATION_17": "[67:12] Assuredly those who fear their Lord in secret, while they are absent from people’s eyes, being obedient to Him in secret, such that openly [before people] it is all the more likely [that they fear their Lord] — there will be for them forgiveness and a great reward, namely, Paradise.\n",
        "TRANSLATION_18": "679 (Lo! those who fear their Lord) those who work for their Lord (in secret) even though they do not see Him, (theirs will be forgiveness) of their sins in the life of the world (and a great reward) in the Garden.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "67:12",
            "11:11",
            "35:7",
            "36:11",
            "41:8",
            "84:25",
            "17:9",
            "21:49",
            "25:64",
            "5:9"
        ],
        "BIBLE": [
            "prophets:judges:21:7",
            "torah:genesis:18:18",
            "torah:deuteronomy:11:7",
            "writings:ecclesiastes:9:13",
            "torah:numbers:14:41",
            "torah:deuteronomy:11:2",
            "prophets:joshua:23:3",
            "writings:daniel:2:6",
            "writings:job:21:22",
            "writings:psalms:22:9"
        ]
    }
}