{
    "VERSE": "67:14",
    "ARABIC": "أَلَا يَعْلَمُ مَنْ خَلَقَ وَهُوَ ٱللَّطِيفُ ٱلْخَبِيرُ",
    "ENGLISH": {
        "TRANSLATION_0": "Does He who created not then know? He is the All-Pervading, the All-Aware.",
        "TRANSLATION_1": "Can He who has created not know (His creation)? He is all-penetrating, all-aware.\n",
        "TRANSLATION_2": "Would He not know, He Who has created, when He is All-Subtle, All-Aware?\n",
        "TRANSLATION_3": "Does the One Who is Subtle, All-aware, and Who created all things not know all about them?\n",
        "TRANSLATION_4": "What! Will He Who has created not know? Whereas He knows every detail, the All Aware!\n",
        "TRANSLATION_5": "Should not He Who has created know And He is the Most Kind and Courteous, All-Aware.\n",
        "TRANSLATION_6": "Does He not know, Who created? And He is the Knower of the subtleties, the Aware.\n",
        "TRANSLATION_7": "Shall He not know, who created? And He is the All-subtle, the All-aware.\n",
        "TRANSLATION_8": "Should He not know what He created? And He is the Subtile, the Aware.\n",
        "TRANSLATION_9": "How could He who created not know His own creation, when He alone is the Most Subtle in His wisdom and the All Aware?\n",
        "TRANSLATION_10": "Shall not He Who hath created know? And He is the Subtile, the Aware.\n",
        "TRANSLATION_11": "Would He who has created not know? And He is the All-attentive, the All-aware.\n",
        "TRANSLATION_12": "Should He not know,- He that created? and He is the One that understands the finest mysteries (and) is well-acquainted (with them).\n",
        "TRANSLATION_13": "Should not He Who has created know? And He is the Most Kind and Courteous (to His slaves) All-Aware (of everything).\n",
        "TRANSLATION_14": "Shall He who has created (all things) not know? He is the Subtle, the Aware.\n",
        "TRANSLATION_15": "Would He not know, He Who created? He is the Refined, the Expert.\n",
        "TRANSLATION_16": "Does He who created not know, while He is the Subtle, the Acquainted?\n",
        "TRANSLATION_17": "[67:14] Will He Who has created not know?, what you keep secret, in other words: will His knowledge of [things] be precluded by such [secret speech]? And He is the Subtle, in His knowledge, the Aware, therein.\n",
        "TRANSLATION_18": "(Should He not know) people's secrets (what He created) He Who created that which is secret? (And He is the Subtile) His subtle knowledge penetrates into that which is in the hearts, (the Aware) of what is in the hearts of good and evil; it is also said: His knowledge penetrates all things whether they are good or evil and He is Aware of them.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "67:14",
            "6:103",
            "22:63",
            "33:34",
            "36:68",
            "9:16",
            "100:9",
            "18:68",
            "99:4",
            "26:111"
        ],
        "BIBLE": [
            "writings:job:42:3",
            "writings:proverbs:30:18",
            "writings:ecclesiastes:3:14",
            "writings:job:12:3",
            "writings:daniel:5:15",
            "prophets:ii%20samuel:14:20",
            "torah:leviticus:5:17",
            "writings:daniel:2:30",
            "prophets:isaiah:56:11",
            "prophets:isaiah:48:6"
        ]
    }
}