{
    "VERSE": "67:18",
    "ARABIC": "وَلَقَدْ كَذَّبَ ٱلَّذِينَ مِن قَبْلِهِمْ فَكَيْفَ كَانَ نَكِيرِ",
    "ENGLISH": {
        "TRANSLATION_0": "Those before them also denied but then how great was My denial!",
        "TRANSLATION_1": "Those before them had also denied. And how was My punishment then!\n",
        "TRANSLATION_2": "Those who came before them also gave the lie (to the Messengers): then how awesome was My chastisement!\n",
        "TRANSLATION_3": "Those who lived before them had also rejected Our warning, and how terrible was Our retribution!\n",
        "TRANSLATION_4": "And indeed those before them had denied – therefore how did My rejection turn out!\n",
        "TRANSLATION_5": "And indeed those before them rejected, then how terrible was My reproach\n",
        "TRANSLATION_6": "And certainly those before them rejected (the truth), then how was My disapproval.\n",
        "TRANSLATION_7": "Those that were before them also cried lies; then how was My horror!\n",
        "TRANSLATION_8": "And verily those before them denied, then (see) the manner of My wrath (with them)!\n",
        "TRANSLATION_9": "Those who went before them belied [the truth]: then how great was My rejection of them.\n",
        "TRANSLATION_10": "And assuredly those before them belied; then what wise hath been My wrath!\n",
        "TRANSLATION_11": "Certainly those who were before them had impugned [My apostles]; but then how was My rebuttal!\n",
        "TRANSLATION_12": "But indeed men before them rejected (My warning): then how (terrible) was My rejection (of them)?\n",
        "TRANSLATION_13": "And indeed those before them belied (the Messengers of Allah), then how terrible was My denial (punishment)?\n",
        "TRANSLATION_14": "Those who have gone before you also belied (their Messengers) then how was My disapproval!\n",
        "TRANSLATION_15": "Those before them also denied the truth; and how was My disapproval?\n",
        "TRANSLATION_16": "And already had those before them denied, and how [terrible] was My reproach.\n",
        "TRANSLATION_17": "[67:18] And verily those, communities, who were before them denied, then [see] how was My rebuttal!, [how was] My rebuttal of them in destroying them when they denied: in other words, [how] it was true.\n",
        "TRANSLATION_18": "(And verily those before them) before your own folk, Muhammad, (denied, then (see) the manner of My wrath (with them)) see how I turned against them with My chastisement!\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "67:18",
            "34:45",
            "13:32",
            "35:26",
            "39:50",
            "21:41",
            "6:10",
            "22:44",
            "3:137",
            "43:25"
        ],
        "BIBLE": [
            "prophets:i%20samuel:2:15",
            "prophets:judges:14:19",
            "writings:ii%20chronicles:13:15",
            "writings:job:42:11",
            "torah:genesis:24:32",
            "prophets:judges:14:9",
            "prophets:ii%20samuel:8:6",
            "writings:nehemiah:12:31",
            "writings:nehemiah:2:9",
            "torah:exodus:21:29"
        ]
    }
}