{
    "VERSE": "67:19",
    "ARABIC": "أَوَلَمْ يَرَوْا۟ إِلَى ٱلطَّيْرِ فَوْقَهُمْ صَٰٓفَّٰتٍ وَيَقْبِضْنَ مَا يُمْسِكُهُنَّ إِلَّا ٱلرَّحْمَٰنُ إِنَّهُۥ بِكُلِّ شَىْءٍۭ بَصِيرٌ",
    "ENGLISH": {
        "TRANSLATION_0": "Have they not looked at the birds above them, with wings outspread and folded back? Nothing holds them up but the All-Merciful. He sees all things.",
        "TRANSLATION_1": "Do they not see the birds above them flying wings spread out or folded? Nothing holds them aloft but God. All things are within His purview.\n",
        "TRANSLATION_2": "Have they not seen birds above them spreading and closing their wings, with none holding them except the Merciful One? He oversees everything.\n",
        "TRANSLATION_3": "Did they not see the birds above them, stretching out, and flapping their wings. No one keeps them up in the sky except the Beneficent God. He certainly watches over all things.\n",
        "TRANSLATION_4": "And did they not see the birds above them, spreading and closing their wings? None except the Most Gracious holds them up; indeed He sees all things.\n",
        "TRANSLATION_5": "Do they not see the birds above them, spreading out their wings and folding them in None upholds them except the Most Gracious. Verily, He is the All-Seer of everything.\n",
        "TRANSLATION_6": "Have they not seen the birds above them expanding (their wings) and contracting (them)? What is it that withholds them save the Beneficent Allah? Surely He sees everything.\n",
        "TRANSLATION_7": "Have they not regarded the birds above them spreading their wings, and closing them? Naught holds them but the All-merciful. Surely He sees everything.\n",
        "TRANSLATION_8": "Have they not seen the birds above them spreading out their wings and closing them? Naught upholdeth them save the Beneficent. Lo! He is Seer of all things.\n",
        "TRANSLATION_9": "Do they not see the birds above them spreading and closing their wings? None save the Merciful sustains them. Surely, He observes all things.\n",
        "TRANSLATION_10": "Behold they not the birds above them, outstretching their wings and they also withdraw them? Naught holdeth them except the Compassionate. Verily He is of everything Beholder.\n",
        "TRANSLATION_11": "Have they not regarded the birds above them spreading and closing their wings? No one sustains them except the All-beneficent. Indeed, He watches all things.\n",
        "TRANSLATION_12": "Do they not observe the birds above them, spreading their wings and folding them in? None can uphold them except (Allah) Most Gracious: Truly (Allah) Most Gracious: Truly it is He that watches over all things.\n",
        "TRANSLATION_13": "Do they not see the birds above them, spreading out their wings and folding them in? None upholds them except the Most Beneficent (Allah). Verily, He is the All-Seer of everything.\n",
        "TRANSLATION_14": "Do they not observe the birds above them, spreading their wings and folding them? None, except the Merciful holds them. Surely, He sees all things.\n",
        "TRANSLATION_15": "Have they not seen the birds above them, spreading their wings, and folding them? None holds them except the Compassionate. He is Perceiver of everything.\n",
        "TRANSLATION_16": "Do they not see the birds above them with wings outspread and [sometimes] folded in? None holds them [aloft] except the Most Merciful. Indeed He is, of all things, Seeing.\n",
        "TRANSLATION_17": "[67:19] Or have they not seen the birds above them, in the air, spreading their wings and closing?, their wings after spreading them? (in other words [read wa-yaqbidna] as wa-qābidātin [similar to sāffātin, ‘spreading’]). Nothing sustains them, from falling, either when they are spreading them or closing them, except the Compassionate One, by His power. Indeed He is Seer of all things. The meaning is: have they not inferred from the fact that the birds [are able to] remain in the air that We have the power to do with them what has been mentioned above as well as [inflicting upon them] other kinds of chastisement?\n",
        "TRANSLATION_18": "(Have they) i.e. the disbelievers of Mecca (not seen the birds above them) above their heads (spreading out their wings and closing them? Naught upholdeth them) after their spreading out (save the Beneficent. Lo! He is Seer of all things) whether it is spreading out or closing.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "67:19",
            "54:52",
            "36:15",
            "26:5",
            "13:8",
            "11:57",
            "36:12",
            "46:33",
            "54:49",
            "40:20"
        ],
        "BIBLE": [
            "prophets:ii%20samuel:22:11",
            "writings:lamentations:1:10",
            "prophets:isaiah:42:20",
            "torah:exodus:19:4",
            "writings:i%20chronicles:29:17",
            "torah:deuteronomy:10:21",
            "writings:job:28:21",
            "torah:genesis:22:12",
            "torah:genesis:16:13",
            "prophets:isaiah:33:23"
        ]
    }
}