{
    "VERSE": "67:22",
    "ARABIC": "أَفَمَن يَمْشِى مُكِبًّا عَلَىٰ وَجْهِهِۦٓ أَهْدَىٰٓ أَمَّن يَمْشِى سَوِيًّا عَلَىٰ صِرَٰطٍ مُّسْتَقِيمٍ",
    "ENGLISH": {
        "TRANSLATION_0": "Who is better guided: he who goes grovelling on his face or he who walks upright on a straight path?",
        "TRANSLATION_1": "Will he find the way who grovels flat on his face, or he who walks straight on the right path?\n",
        "TRANSLATION_2": "Who is better guided: he who walks grovelling on his face, or he who walks upright on a Straight Path?\n",
        "TRANSLATION_3": "Can one who walks with his head hanging down be better guided that one who walks with his head upright?\n",
        "TRANSLATION_4": "So is one who walks inverted upon his face more rightly guided, or one who walks upright on the Straight Path?\n",
        "TRANSLATION_5": "Is he who walks prone on his face, more rightly guided, or he who walks upright on a straight path\n",
        "TRANSLATION_6": "What! is he who goes prone upon his face better guided or he who walks upright upon a straight path?\n",
        "TRANSLATION_7": "What, is he who walks prone upon his face better guided than he who walks upright on a straight path?\n",
        "TRANSLATION_8": "Is he who goeth groping on his face more rightly guided, or he who walketh upright on a straight road?\n",
        "TRANSLATION_9": "Is he who walks grovelling upon his face better guided, or he who walks upright upon a straight path?\n",
        "TRANSLATION_10": "Is he, then, who goeth about grovelling upon his face better directed, or he who walketh evenly on a straight path?\n",
        "TRANSLATION_11": "Is he who walks prone on his face better guided, or he who walks upright on a straight path?\n",
        "TRANSLATION_12": "Is then one who walks headlong, with his face grovelling, better guided,- or one who walks evenly on a Straight Way?\n",
        "TRANSLATION_13": "Is he who walks without seeing on his face, more rightly guided, or he who (sees and) walks on a Straight Way (i.e. Islamic Monotheism).\n",
        "TRANSLATION_14": "What, is he who walks, falling upon his face, more guided than he who walks upright on a Straight Path!\n",
        "TRANSLATION_15": "Is he who walks bent on his own design better guided, or he who walks upright on a straight path?\n",
        "TRANSLATION_16": "Then is one who walks fallen on his face better guided or one who walks erect on a straight path?\n",
        "TRANSLATION_17": "[67:22] Is he who walks cast down, fallen, on his face more rightly guided, or he who walks upright on a straight path? (the predicate of the second man, ‘who’, has been omitted, but is indicated by the predicate of the first, namely, ahdā, ‘more rightly guided’; the similitude refers to the believer and the disbeliever and to which of the two is more rightly guided).\n",
        "TRANSLATION_18": "(Is he who goeth groping on his face) bent down in his error and disbelief, i.e. Abu Jahl Ibn Hisham (more rightly guided) more correct in his religion, (or he who walketh upright on a beaten road) on an established religion with which Allah is pleased, i.e. Islam? This refers to Muhammad (pbuh).\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "67:22",
            "20:135",
            "36:4",
            "39:24",
            "7:193",
            "15:41",
            "39:60",
            "43:24",
            "96:11",
            "1:6"
        ],
        "BIBLE": [
            "prophets:i%20samuel:26:12",
            "torah:numbers:22:31",
            "prophets:isaiah:1:5",
            "writings:lamentations:5:16",
            "torah:leviticus:13:41",
            "writings:ii%20chronicles:20:18",
            "prophets:i%20samuel:5:4",
            "prophets:joshua:7:6",
            "torah:leviticus:13:40",
            "prophets:ezekiel:42:12"
        ]
    }
}