{
    "VERSE": "67:26",
    "ARABIC": "قُلْ إِنَّمَا ٱلْعِلْمُ عِندَ ٱللَّهِ وَإِنَّمَآ أَنَا۠ نَذِيرٌ مُّبِينٌ",
    "ENGLISH": {
        "TRANSLATION_0": "Say: 'The knowledge is with Allah alone and I am only a clear warner.'",
        "TRANSLATION_1": "Say: \"God alone has knowledge. My duty is only to warn you clearly.\"\n",
        "TRANSLATION_2": "Say: “Allah alone knows about that; and I am no more than a plain warner.”\n",
        "TRANSLATION_3": "Say, \"God knows best. I am only one who gives warning\".\n",
        "TRANSLATION_4": "Proclaim, “Surely Allah has its knowledge; and I am only a Herald of plain warning.”\n",
        "TRANSLATION_5": "Say: \"The knowledge is with Allah only, and I am only a plain warner.\"\n",
        "TRANSLATION_6": "Say: The knowledge (thereof is only with Allah and I am only a plain warner.\n",
        "TRANSLATION_7": "Say: 'The knowledge is with God; I am only a clear warner.'\n",
        "TRANSLATION_8": "Say: The knowledge is with Allah only, and I am but a plain warner;\n",
        "TRANSLATION_9": "Say, \"God alone has knowledge of that; and I am only a plain warner.\"\n",
        "TRANSLATION_10": "Say thou: the knowledge is only with Allah, and but a warner manifest.\n",
        "TRANSLATION_11": "Say, ‘Its knowledge is only with Allah; I am only a manifest warner.’\n",
        "TRANSLATION_12": "Say: \"As to the knowledge of the time, it is with Allah alone: I am (sent) only to warn plainly in public.\"\n",
        "TRANSLATION_13": "Say (O Muhammad SAW): \"The knowledge (of its exact time) is with Allah only, and I am only a plain warner.\"\n",
        "TRANSLATION_14": "Say: 'The knowledge (of that) is with Allah; I am only a clear warner'\n",
        "TRANSLATION_15": "Say, “Knowledge is with God, and I am only a clear warner.”\n",
        "TRANSLATION_16": "Say, \"The knowledge is only with Allah, and I am only a clear warner.\"\n",
        "TRANSLATION_17": "[67:26] Say: ‘The knowledge, of its coming, is only with God, and I am but a plain warner’, one whose warning is plain.\n",
        "TRANSLATION_18": "(Say) to them, Muhammad: (The knowledge) of the coming of the Hour and of the befalling of chastisement (is with Allah only, and I am but a plain warner) a warning messenger speaking to you with a language you understand;\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "67:26",
            "46:23",
            "29:50",
            "33:63",
            "6:58",
            "13:39",
            "28:56",
            "8:55",
            "15:89",
            "13:43"
        ],
        "BIBLE": [
            "prophets:ii%20samuel:17:7",
            "prophets:jeremiah:11:18",
            "writings:daniel:2:23",
            "torah:numbers:18:29",
            "prophets:isaiah:47:8",
            "torah:deuteronomy:26:14",
            "torah:genesis:38:26",
            "writings:psalms:60:6",
            "prophets:isaiah:50:4",
            "torah:deuteronomy:8:10"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:3:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:2"
        ]
    }
}