{
    "VERSE": "67:28",
    "ARABIC": "قُلْ أَرَءَيْتُمْ إِنْ أَهْلَكَنِىَ ٱللَّهُ وَمَن مَّعِىَ أَوْ رَحِمَنَا فَمَن يُجِيرُ ٱلْكَٰفِرِينَ مِنْ عَذَابٍ أَلِيمٍ",
    "ENGLISH": {
        "TRANSLATION_0": "Say: 'What do you think? If Allah destroys me and those with me, or if He has mercy on us, who can shelter the kafirun from a painful punishment?'",
        "TRANSLATION_1": "Say: \"Just think: If God destroys me and those with me, or is benevolent to us, who will then protect the unbelievers from a painful doom?\"\n",
        "TRANSLATION_2": "Say to them: “Did you ever consider: whether Allah destroys me and those that are with me, or shows mercy to us, who can protect the unbelievers from a grievous chastisement?”\n",
        "TRANSLATION_3": "(Muhammad), say, \"Have you not considered that regardless whether God forgives me and my followers or grants us mercy, but who will protect the disbelievers from a painful torment?\n",
        "TRANSLATION_4": "Say (O dear Prophet Mohammed – peace and blessings be upon him), “What is your opinion –Allah may either destroy me and those with me, or have mercy on us – so who is such that will protect the disbelievers from the painful punishment?”\n",
        "TRANSLATION_5": "Say: \"Tell me! If Allah destroys me, and those with me, or He bestows His mercy on us - who can save the disbelievers from a painful torment\"\n",
        "TRANSLATION_6": "Say: Have you considered if Allah should destroy me and those with me-- rather He will have mercy on us; yet who will protect the unbelievers from a painful punishment?\n",
        "TRANSLATION_7": "Say: 'What think you? If God destroys me and those with me, or has mercy on us, then who will protect the unbelievers from a painful chastisement?'\n",
        "TRANSLATION_8": "Say (O Muhammad): Have ye thought: Whether Allah causeth me (Muhammad) and those with me to perish or hath mercy on us, still, who will protect the disbelievers from a painful doom?\n",
        "TRANSLATION_9": "Say, \"Have you thought: if God destroys me and those who are with me, or treats us mercifully, then who will protect those who deny the truth from a painful chastisement?\"\n",
        "TRANSLATION_10": "Say thou: bethink ye if Allah destroy me and those with me; or have mercy on us, who will protect the infidels from a torment afflictive?\n",
        "TRANSLATION_11": "Say, ‘Tell me, whether Allah destroys me and those who are with me, or He has mercy on us, who will shelter the faithless from a painful punishment?’\n",
        "TRANSLATION_12": "Say: \"See ye?- If Allah were to destroy me, and those with me, or if He bestows His Mercy on us,- yet who can deliver the Unbelievers from a grievous Penalty?\"\n",
        "TRANSLATION_13": "Say (O Muhammad SAW): \"Tell me! If Allah destroys me, and those with me, or He bestows His Mercy on us, - who can save the disbelievers from a painful torment?\"\n",
        "TRANSLATION_14": "Say: 'What do you think, if Allah destroys me and those with me, or has mercy upon us, who then will protect the unbelievers from the painful punishment'\n",
        "TRANSLATION_15": "Say, “Have you considered? Should God make me perish, and those with me; or else He bestows His mercy on us; who will protect the disbelievers from an agonizing torment?”\n",
        "TRANSLATION_16": "Say, [O Muhammad], \"Have you considered: whether Allah should cause my death and those with me or have mercy upon us, who can protect the disbelievers from a painful punishment?\"\n",
        "TRANSLATION_17": "[67:28] Say: ‘Have you considered: If God destroys me and those with me, of believers, by His chastisement, as you would have it, or has mercy on us, and does not chastise us, who then will protect the disbelievers from a painful chastisement?’: in other words, they will have no protector from it.\n",
        "TRANSLATION_18": "(Say (0 Muhammad): Have ye thought) people of Mecca: (Whether Allah causeth me (Muhammad) and those with me) among the believers (to perish) by chastising us (or hath mercy on us) by sparing us from the chastisement; he said: it is Allah Who has forgiven us such that He did not torment us; and it is Him Who has the power to show mercy towards us or destroy us, (still, who will protect the disbelievers from a painful doom?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "67:28",
            "4:147",
            "15:50",
            "36:18",
            "46:31",
            "52:27",
            "2:104",
            "9:90",
            "76:31",
            "16:104"
        ],
        "BIBLE": [
            "torah:deuteronomy:7:2",
            "writings:job:10:2",
            "torah:deuteronomy:32:39",
            "prophets:joshua:7:19",
            "torah:genesis:26:28",
            "writings:daniel:6:13",
            "torah:exodus:34:10",
            "prophets:joel:2:17",
            "torah:exodus:32:1",
            "prophets:i%20samuel:28:15"
        ]
    }
}