{
    "VERSE": "67:5",
    "ARABIC": "وَلَقَدْ زَيَّنَّا ٱلسَّمَآءَ ٱلدُّنْيَا بِمَصَٰبِيحَ وَجَعَلْنَٰهَا رُجُومًا لِّلشَّيَٰطِينِ وَأَعْتَدْنَا لَهُمْ عَذَابَ ٱلسَّعِيرِ",
    "ENGLISH": {
        "TRANSLATION_0": "We have adorned the lowest heaven with lamps and made some of them stones for the shaytans for whom We have prepared the punishment of the Blaze.",
        "TRANSLATION_1": "We have adorned the lowest sky with lamps, and made them missiles against the devils, for whom We have prepared a torment of most intense fire.\n",
        "TRANSLATION_2": "We have adorned the lower heaven with lamps, and have made them a means to drive away the satans. We have prepared for them the chastisement of the Blazing Fire.\n",
        "TRANSLATION_3": "We have decked the lowest heavens with torches. With these torches We have stoned the devils and We have prepared for them the torment of hell.\n",
        "TRANSLATION_4": "And indeed We have beautified the lower heaven with lamps, and have made them weapons against the devils, and have kept prepared for them the punishment of the blazing fire.\n",
        "TRANSLATION_5": "And indeed We have adorned the nearest heaven with lamps, and We have made such lamps (as) missiles to drive away the Shayatin, and have prepared for them the torment of the blazing Fire.\n",
        "TRANSLATION_6": "And certainly We have adorned this lower heaven with lamps and We have made these missiles for the Shaitans, and We have prepared for them the chastisement of burning.\n",
        "TRANSLATION_7": "And We adorned the lower heaven with lamps, and made them things to stone Satans; and We have prepared for them the chastisement of the Blaze.\n",
        "TRANSLATION_8": "And verily We have beautified the world's heaven with lamps, and We have made them missiles for the devils, and for them We have prepared the doom of flame.\n",
        "TRANSLATION_9": "We have adorned the lowest heaven with lamps, and We have made them for driving away devils. For them We have prepared the punishment of the blazing Fire.\n",
        "TRANSLATION_10": "And assuredly We have bedecked the nearest heaven with lamps, and We have made them missiles for satans: and for them We have gotten ready the torment of the Blaze.\n",
        "TRANSLATION_11": "We have certainly adorned the lowest heaven with lamps, and made them [the means of pelting] missiles against the devils, and We have prepared for them a punishment of the Blaze.\n",
        "TRANSLATION_12": "And we have, (from of old), adorned the lowest heaven with Lamps, and We have made such (Lamps) (as) missiles to drive away the Evil Ones, and have prepared for them the Penalty of the Blazing Fire.\n",
        "TRANSLATION_13": "And indeed We have adorned the nearest heaven with lamps, and We have made such lamps (as) missiles to drive away the Shayatin (devils), and have prepared for them the torment of the blazing Fire.\n",
        "TRANSLATION_14": "We have adorned the lower heaven with lamps, and We made them a stoning for the satans, We have prepared the punishment of the Blaze for them.\n",
        "TRANSLATION_15": "We have adorned the lower heaven with lanterns, and made them missiles against the devils; and We have prepared for them the punishment of the Blaze.\n",
        "TRANSLATION_16": "And We have certainly beautified the nearest heaven with stars and have made [from] them what is thrown at the devils and have prepared for them the punishment of the Blaze.\n",
        "TRANSLATION_17": "[67:5] And verily We have adorned the lowest heaven, the one closest to the earth, with lamps, with stars, and made them missiles against the devils, should they [attempt to] listen by stealth, in which case a meteor of fire detaches itself from the star, just like a brand is taken from a fire, and either kills that jinn or deprives him of his senses: it is not that the star itself is displaced from its position; and We have prepared for them the chastisement of the Blaze, the ignited Fire.\n",
        "TRANSLATION_18": "(And verily We have beatified the world's heaven) the first heaven (with lamps) with stars, (and We have made them) i.e. the stars (missiles for the devils) such that some of them become bewitched, some are killed while others are burnt, (and for them) for the devils (We have prepared) in the Hereafter (the doom of flame.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "67:5",
            "15:16",
            "23:76",
            "4:161",
            "10:70",
            "38:41",
            "81:25",
            "31:21",
            "44:30",
            "5:37"
        ],
        "BIBLE": [
            "torah:leviticus:5:23",
            "torah:deuteronomy:18:12",
            "writings:proverbs:20:21",
            "writings:proverbs:21:6",
            "torah:leviticus:6:6",
            "prophets:ezekiel:28:4",
            "torah:exodus:15:16",
            "writings:daniel:4:30",
            "prophets:jeremiah:29:18",
            "prophets:ii%20samuel:7:23"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:12",
            "Sefer%20Yetzirah:3:8"
        ]
    }
}