{
    "VERSE": "67:6",
    "ARABIC": "وَلِلَّذِينَ كَفَرُوا۟ بِرَبِّهِمْ عَذَابُ جَهَنَّمَ وَبِئْسَ ٱلْمَصِيرُ",
    "ENGLISH": {
        "TRANSLATION_0": "Those who reject their Lord will have the punishment of Hell. What an evil destination!",
        "TRANSLATION_1": "For those who believe not in their Lord there is the punishment of Hell; and what a wretched destination\n",
        "TRANSLATION_2": "The chastisement of Hell awaits those who disbelieve in their Lord. What a wretched destination!\n",
        "TRANSLATION_3": "For those who have disbelieved in their Lord, We have prepared the torment of hell, the most terrible place to return.\n",
        "TRANSLATION_4": "And for those who disbelieved in their Lord, is the punishment of hell; and what a wretched outcome!\n",
        "TRANSLATION_5": "And for those who disbelieve in their Lord is the torment of Hell, and worst indeed is that destination.\n",
        "TRANSLATION_6": "And for those who disbelieve in their Lord is the punishment of hell, and evil is the resort.\n",
        "TRANSLATION_7": "And for those who disbelieve in their Lord there awaits the chastisement of Gehenna -- an evil homecoming!\n",
        "TRANSLATION_8": "And for those who disbelieve in their Lord there is the doom of hell, a hapless journey's end!\n",
        "TRANSLATION_9": "Those who are bent on blaspheming against their Lord will have the punishment of Hell: an evil destination.\n",
        "TRANSLATION_10": "And for those who disbelieve in their Lord will be the torment of Hell; and a hapless destination!\n",
        "TRANSLATION_11": "For those who defy their Lord is the punishment of hell, and it is an evil destination.\n",
        "TRANSLATION_12": "For those who reject their Lord (and Cherisher) is the Penalty of Hell: and evil is (such), Destination.\n",
        "TRANSLATION_13": "And for those who disbelieve in their Lord (Allah) is the torment of Hell, and worst indeed is that destination.\n",
        "TRANSLATION_14": "And for those who disbelieve in their Lord there awaits the punishment of Gehenna (Hell) an evil arrival!\n",
        "TRANSLATION_15": "For those who reject their Lord, there is the torment of Hell. What an evil destination!\n",
        "TRANSLATION_16": "And for those who disbelieved in their Lord is the punishment of Hell, and wretched is the destination.\n",
        "TRANSLATION_17": "[67:6] And for those who disbelieve in their Lord there is the chastisement of Hell, and [what] an evil journey’s end!, it is.\n",
        "TRANSLATION_18": "And for those who disbelieve in their Lord there is the doom of hell, a hapless journey's end) they shall come to in Gehenna!\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "67:6",
            "70:27",
            "23:76",
            "44:12",
            "52:18",
            "3:16",
            "72:17",
            "25:65",
            "85:10",
            "38:61"
        ],
        "BIBLE": [
            "prophets:jeremiah:29:10",
            "torah:genesis:38:22",
            "prophets:i%20kings:13:33",
            "torah:genesis:18:33",
            "prophets:zephaniah:2:11",
            "prophets:jeremiah:22:11",
            "prophets:amos:4:6",
            "prophets:joel:4:7",
            "torah:deuteronomy:17:16",
            "prophets:jeremiah:36:7"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:2:4"
        ]
    }
}