{
    "VERSE": "67:8",
    "ARABIC": "تَكَادُ تَمَيَّزُ مِنَ ٱلْغَيْظِ كُلَّمَآ أُلْقِىَ فِيهَا فَوْجٌ سَأَلَهُمْ خَزَنَتُهَآ أَلَمْ يَأْتِكُمْ نَذِيرٌ",
    "ENGLISH": {
        "TRANSLATION_0": "It all but bursts with rage. Each time a group is flung into it its custodians will question them: 'Did no warner come to you?'",
        "TRANSLATION_1": "As though it would burst with fury. Every time a crowd is thrown into it, its wardens will ask: \"Did no warner come to you?\"\n",
        "TRANSLATION_2": "as though it will burst with rage. Every time a multitude is cast into it, its keepers will ask them: “Did no warner come to you?”\n",
        "TRANSLATION_3": "It almost explodes in rage. Whenever a group is thrown into it, its keepers will ask them, \"Did no one come to warn you?\"\n",
        "TRANSLATION_4": "As if about to explode with rage; whenever a group is thrown into it, the guardians of hell will ask them, “Did not a Herald of Warning come to you?”\n",
        "TRANSLATION_5": "It almost bursts up with fury. Every time a group is cast therein, its keepers will ask: \"Did no warner come to you\"\n",
        "TRANSLATION_6": "Almost bursting for fury. Whenever a group is cast into it, its keeper shall ask them: Did there not come to you a warner?\n",
        "TRANSLATION_7": "and wellnigh bursts asunder with rage. As often as a troop is cast into it, its keepers ask them, 'Came there no warner to you?';\n",
        "TRANSLATION_8": "As it would burst with rage. Whenever a (fresh) host is flung therein the wardens thereof ask them: Came there unto you no warner?\n",
        "TRANSLATION_9": "as though bursting with rage. Each time a group is cast into it, its keepers will ask them, \"Did no warner come to you?\"\n",
        "TRANSLATION_10": "Well-nigh it bursteth with rage. So oft as a company is cast thereinto, the keepers thereof will ask them: came there not Unto you a warner?\n",
        "TRANSLATION_11": "almost exploding with rage. Whenever a group is thrown in it, its keepers will ask them, ‘Did not any warner come to you?’\n",
        "TRANSLATION_12": "Almost bursting with fury: Every time a Group is cast therein, its Keepers will ask, \"Did no Warner come to you?\"\n",
        "TRANSLATION_13": "It almost bursts up with fury. Every time a group is cast therein, its keeper will ask: \"Did no warner come to you?\"\n",
        "TRANSLATION_14": "nearly bursting apart out of rage. Every time a host is cast therein, its keepers will ask them: 'Did no one come to warn you'\n",
        "TRANSLATION_15": "It almost bursts with fury. Every time a batch is thrown into it, its keepers will ask them, “Has no warner come to you?”\n",
        "TRANSLATION_16": "It almost bursts with rage. Every time a company is thrown into it, its keepers ask them, \"Did there not come to you a warner?\"\n",
        "TRANSLATION_17": "[67:8] almost exploding (tamayyazu: a variant reading has the original [form] tatamayyazu) ripped apart, with rage, in wrath against the disbelievers. Whenever a host, a group of them, is flung into it, its keepers ask them, an interrogation of rebuke: ‘Did there not come to you a warner?’, a messenger to warn you of God’s chastisement.\n",
        "TRANSLATION_18": "As it would burst with rage) towards the disbelievers. (Whenever a (fresh) host) of disbelievers, i.e. the Jews, Christians, Magians and all other disbelievers (flung therein) in Gehenna (the wardens thereof) the wardens of Gehenna (ask them: Came there unto you no warner) a warning messenger?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "67:8",
            "26:7",
            "35:37",
            "26:225",
            "22:22",
            "25:51",
            "32:20",
            "39:71",
            "74:43",
            "43:12"
        ],
        "BIBLE": [
            "prophets:haggai:1:2",
            "writings:ii%20chronicles:16:7",
            "prophets:ezekiel:7:12",
            "torah:genesis:21:22",
            "writings:ii%20chronicles:28:9",
            "prophets:ii%20samuel:14:29",
            "prophets:i%20samuel:17:20",
            "prophets:malachi:3:11",
            "prophets:jeremiah:50:31",
            "prophets:zechariah:6:15"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:3:4"
        ]
    }
}