{
    "VERSE": "79:10",
    "ARABIC": "يَقُولُونَ أَءِنَّا لَمَرْدُودُونَ فِى ٱلْحَافِرَةِ",
    "ENGLISH": {
        "TRANSLATION_0": "They will say, 'Are we to be restored to how we were?",
        "TRANSLATION_1": "They say: \"Shall we go back to our original state\n",
        "TRANSLATION_2": "They say: “Shall we indeed be restored to life,\n",
        "TRANSLATION_3": "(The disbelievers) say, \"Shall we be brought back to life again\n",
        "TRANSLATION_4": "The disbelievers say, “Will we really return to our former state?”\n",
        "TRANSLATION_5": "They say: \"Shall we indeed be brought back from Al-Hafirah\"\n",
        "TRANSLATION_6": "They say: Shall we indeed be restored to (our) first state?\n",
        "TRANSLATION_7": "They shall say, 'What, are we being restored as we were before?\n",
        "TRANSLATION_8": "(Now) they are saying: Shall we really be restored to our first state\n",
        "TRANSLATION_9": "They say, \"What? shall we be brought back to life,\n",
        "TRANSLATION_10": "They say: shall we indeed be restored to the first state,\n",
        "TRANSLATION_11": "They will say, ‘Are we being returned to our earlier state?\n",
        "TRANSLATION_12": "They say (now): \"What! shall we indeed be returned to (our) former state?\n",
        "TRANSLATION_13": "They say: \"Shall we indeed be returned to (our) former state of life?\n",
        "TRANSLATION_14": "They say: 'What, are we being restored as we were before,\n",
        "TRANSLATION_15": "They say, “Are we to be restored to the original condition?\n",
        "TRANSLATION_16": "They are [presently] saying, \"Will we indeed be returned to [our] former state [of life]?\n",
        "TRANSLATION_17": "[79:10] They, those of the [mentioned] hearts and eyes, will say, mockingly and in rejection of the Resurrection: ‘Are we indeed (read a-innā pronouncing both hamzas, or by not pronouncing the second, and inserting an alif between them in both cases, and in both instances) being restored as before? Shall we be restored to   life after death (al-hāfira is a noun signifying the ‘first part’ of anything, from which is derived the expression raja‘a fī hāfiratihi to mean that so and so ‘returned whence he had come’).\n",
        "TRANSLATION_18": "((Now) they) the disbelievers of Mecca: al-Nadr Ibn al-Harith and his host (are saying: Shall we really be restored to our first state) to the life of the world; and it is also said: from the graves\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "79:10",
            "37:52",
            "15:9",
            "15:23",
            "21:86",
            "26:41",
            "36:3",
            "37:165",
            "37:166",
            "23:90"
        ],
        "BIBLE": [
            "prophets:ii%20kings:1:5",
            "writings:daniel:10:20",
            "prophets:ii%20kings:8:1",
            "torah:genesis:37:30",
            "torah:deuteronomy:5:27",
            "prophets:jeremiah:3:1",
            "prophets:judges:7:3",
            "torah:genesis:43:18",
            "prophets:micah:5:2",
            "prophets:ezekiel:7:13"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:4:8",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:3:4",
            "Sefer%20Yetzirah:2:1"
        ]
    }
}