{
    "VERSE": "79:16",
    "ARABIC": "إِذْ نَادَىٰهُ رَبُّهُۥ بِٱلْوَادِ ٱلْمُقَدَّسِ طُوًى",
    "ENGLISH": {
        "TRANSLATION_0": "when his Lord called out to him in the holy valley of Tuwa?",
        "TRANSLATION_1": "When his Lord called to him in Tuwa's holy vale?\n",
        "TRANSLATION_2": "When his Lord called him in the sacred valley of Tuwa,\n",
        "TRANSLATION_3": "when his Lord called him in the holy valley of Tuwa,\n",
        "TRANSLATION_4": "When his Lord called him in the holy valley of Tuwa.\n",
        "TRANSLATION_5": "When his Lord called him in the holy valley of Tuwa,\n",
        "TRANSLATION_6": "When his Lord called upon him in the holy valley, twice,\n",
        "TRANSLATION_7": "When his Lord called to him in the holy valley, Towa:\n",
        "TRANSLATION_8": "How his Lord called him in the holy vale of Tuwa,\n",
        "TRANSLATION_9": "His Lord called out to him by the sacred valley of Tuwa:\n",
        "TRANSLATION_10": "Recall what time his Lord called Unto him in the holy vale of Tuwa.\n",
        "TRANSLATION_11": "when his Lord called out to him in the holy valley of Tuwa?\n",
        "TRANSLATION_12": "Behold, thy Lord did call to him in the sacred valley of Tuwa:-\n",
        "TRANSLATION_13": "When his Lord called him in the sacred valley of Tuwa,\n",
        "TRANSLATION_14": "His Lord called to him in the Sacred Valley of Towa,\n",
        "TRANSLATION_15": "When His Lord called out to him in the sacred valley of Tuwa.\n",
        "TRANSLATION_16": "When his Lord called to him in the sacred valley of Tuwa,\n",
        "TRANSLATION_17": "[79:16] when his Lord called out to him in the holy valley of Tuwā? — this is the name of the valley (it may be read with nunation, Tuwan, or without) — and He said:\n",
        "TRANSLATION_18": "(How his Lord called him in the holy vale of Tuwa) the name of the valley; it was called so because it was traversed by so many prophets; it is also said: tread (Ta'), Moses, with your feet on this valley because of its goodness and grace.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "79:16",
            "20:12",
            "19:3",
            "26:98",
            "37:100",
            "75:12",
            "68:50",
            "2:131",
            "114:1",
            "20:70"
        ],
        "BIBLE": [
            "torah:genesis:22:15",
            "prophets:isaiah:55:6",
            "prophets:judges:2:5",
            "prophets:isaiah:6:3",
            "torah:genesis:3:9",
            "torah:exodus:9:27",
            "prophets:i%20samuel:3:8",
            "prophets:i%20kings:18:3",
            "prophets:i%20samuel:10:17",
            "prophets:i%20samuel:3:4"
        ]
    }
}