{
    "VERSE": "79:25",
    "ARABIC": "فَأَخَذَهُ ٱللَّهُ نَكَالَ ٱلْءَاخِرَةِ وَٱلْأُولَىٰٓ",
    "ENGLISH": {
        "TRANSLATION_0": "So Allah made an example of him seizing him with punishment in the next World and this world.",
        "TRANSLATION_1": "So God seized him for the punishment of the Hereafter and this world.\n",
        "TRANSLATION_2": "Thereupon Allah seized him for the chastisement of the World to Come as well as of the present.\n",
        "TRANSLATION_3": "So God struck him with the torment of this life and the life hereafter.\n",
        "TRANSLATION_4": "Allah therefore seized him, in the punishment of this world and the Hereafter.\n",
        "TRANSLATION_5": "So Allah seized him with punishing example for the Hereafter and the first (life).\n",
        "TRANSLATION_6": "So Allah seized him with the punishment of the hereafter and the former life.\n",
        "TRANSLATION_7": "So God seized him with the chastisement of the Last World and the First.\n",
        "TRANSLATION_8": "So Allah seized him (and made him) an example for the after (life) and for the former.\n",
        "TRANSLATION_9": "but God seized him and meted out to him the chastisement of both the next world and the present:\n",
        "TRANSLATION_10": "Wherefore Allah laid hold of him with the punishment of the Hereafter and of the present.\n",
        "TRANSLATION_11": "So Allah seized him with the punishment of this life and the Hereafter.\n",
        "TRANSLATION_12": "But Allah did punish him, (and made an) example of him, - in the Hereafter, as in this life.\n",
        "TRANSLATION_13": "So Allah, seized him with punishment for his last [i.e. his saying: \"I am your lord, most high\") (see Verse 79:24)] and first [(i.e. his saying, \"O chiefs! I know not that you have a god other than I\" (see Verse 28:38)] transgression.\n",
        "TRANSLATION_14": "So Allah seized him with the punishment of the Everlasting Life, and of this world.\n",
        "TRANSLATION_15": "So God seized him with an exemplary punishment, in the last and in the first.\n",
        "TRANSLATION_16": "So Allah seized him in exemplary punishment for the last and the first [transgression].\n",
        "TRANSLATION_17": "[79:25] So God seized him, He destroyed him by drowning him, as punishment for the latter, that is to say, these [last] words [of his], and for the former, that is to say, his saying previously, ‘I do not know of any god for you other than me’ [Q. 28:38] — and between the two [claims made by Pharaoh] was an interval of forty years.\n",
        "TRANSLATION_18": "(So Allah seized him) Allah punished him ((and made him) an example for the after (life) and for the former) the punishment that he suffered in the life of the world is drowning and the punishment of the Hereafter will be in the Fire; it is also said that this means: Allah has punished him because of his former and latter pronouncements. His first pronouncement being: \"I do not know of any other god for you except Me\" and the second being (I am your Lord the Highest) and it is said that there is an interval of 40 years between the first and second pronouncements.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "79:25",
            "53:25",
            "56:49",
            "28:70",
            "92:13",
            "75:21",
            "37:126",
            "14:27",
            "17:22",
            "26:213"
        ],
        "BIBLE": [
            "torah:genesis:3:22",
            "prophets:ezekiel:36:22",
            "prophets:i%20samuel:1:26",
            "prophets:i%20kings:18:36",
            "prophets:i%20kings:20:28",
            "prophets:jonah:1:14",
            "prophets:i%20samuel:20:21",
            "prophets:ii%20kings:5:8",
            "prophets:ezekiel:28:22",
            "writings:ii%20chronicles:11:2"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:8",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:10",
            "Sefer%20Yetzirah:3:5"
        ]
    }
}