{
    "VERSE": "79:27",
    "ARABIC": "ءَأَنتُمْ أَشَدُّ خَلْقًا أَمِ ٱلسَّمَآءُ بَنَىٰهَا",
    "ENGLISH": {
        "TRANSLATION_0": "Are you stronger in structure or is heaven? He built it.",
        "TRANSLATION_1": "Are you more difficult to create or the heavens? He built it,\n",
        "TRANSLATION_2": "Is it harder to create you or the heaven? But Allah built it,\n",
        "TRANSLATION_3": "(People), is your creation harder for God than that of the heavens, which He created, raised and established\n",
        "TRANSLATION_4": "Do you think that it is harder to create you or the heavens? Allah has created it.\n",
        "TRANSLATION_5": "Are you more difficult to create or is the heaven that He constructed\n",
        "TRANSLATION_6": "Are you the harder to create or the heaven? He made it.\n",
        "TRANSLATION_7": "What, are you stronger in constitution or the heaven He built?\n",
        "TRANSLATION_8": "Are ye the harder to create, or is the heaven that He built?\n",
        "TRANSLATION_9": "[O Men!] Are you more difficult to create than the heaven which He has built,\n",
        "TRANSLATION_10": "Are ye harder to create or the heaven which He hath builded?\n",
        "TRANSLATION_11": "Is your creation more prodigious or that of the heaven He has built?\n",
        "TRANSLATION_12": "What! Are ye the more difficult to create or the heaven (above)? (Allah) hath constructed it:\n",
        "TRANSLATION_13": "Are you more difficult to create, or is the heaven that He constructed?\n",
        "TRANSLATION_14": "What, are you harder to create than the heaven which He has built?\n",
        "TRANSLATION_15": "Are you more difficult to create, or the heaven? He constructed it.\n",
        "TRANSLATION_16": "Are you a more difficult creation or is the heaven? Allah constructed it.\n",
        "TRANSLATION_17": "[79:27] Are you (read a-antum pronouncing both hamzas, or by substituting an alif for the second one, not pronouncing it and inserting an alif between the one not pronounced and the former, or without [this insertion]), namely, [you] the deniers of the Resurrection, harder to create or the heaven which He has built?, harder to create (banāhā: an explication of the manner of [its] creation).\n",
        "TRANSLATION_18": "(Are ye) people of Mecca (the harder to create) harder to resurrect and more perfect in your creation, (or is the heaven that He built?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "79:27",
            "37:11",
            "91:5",
            "18:51",
            "14:19",
            "81:11",
            "77:9",
            "72:8",
            "69:16",
            "55:7"
        ],
        "BIBLE": [
            "prophets:amos:2:11",
            "torah:deuteronomy:32:6",
            "prophets:i%20kings:5:27",
            "writings:psalms:41:11",
            "writings:ii%20chronicles:6:18",
            "prophets:ii%20samuel:23:1",
            "prophets:i%20samuel:2:35",
            "prophets:isaiah:7:13",
            "writings:daniel:6:8",
            "prophets:jeremiah:29:15"
        ]
    }
}