{
    "VERSE": "79:35",
    "ARABIC": "يَوْمَ يَتَذَكَّرُ ٱلْإِنسَٰنُ مَا سَعَىٰ",
    "ENGLISH": {
        "TRANSLATION_0": "that Day man will remember what he has striven for",
        "TRANSLATION_1": "The day when man remembers all that he had done,\n",
        "TRANSLATION_2": "on the Day when man will recall all his strivings,\n",
        "TRANSLATION_3": "the human being will recall whatever he has done.\n",
        "TRANSLATION_4": "On that day man will recall all what he strove for.\n",
        "TRANSLATION_5": "The Day when man shall remember what he strove for.\n",
        "TRANSLATION_6": "The day on which man shall recollect what he strove after,\n",
        "TRANSLATION_7": "upon the day when man shall remember what he has striven,\n",
        "TRANSLATION_8": "The day when man will call to mind his (whole) endeavour,\n",
        "TRANSLATION_9": "on the Day that man remembers what he strove for\n",
        "TRANSLATION_10": "The Day whereon man shall rember whatsoever he had striven for.\n",
        "TRANSLATION_11": "—the day when man will remember his endeavours\n",
        "TRANSLATION_12": "The Day when man shall remember (all) that he strove for,\n",
        "TRANSLATION_13": "The Day when man shall remember what he strove for,\n",
        "TRANSLATION_14": "the Day when the human will remember what he has worked for,\n",
        "TRANSLATION_15": "A Day when man will remember what he has endeavored.\n",
        "TRANSLATION_16": "The Day when man will remember that for which he strove,\n",
        "TRANSLATION_17": "[79:35] the day when man will remember (yawma yatadhakkaru’l-insānu substitutes for idhā, ‘when’) his efforts, in the [life of the] world, in the way of good or evil,\n",
        "TRANSLATION_18": "(The day when man will call to mind) when the disbeliever, al-Nadr Ibn al-Harith and his host, will remember and know (his (whole) endeavour) the works he did in his state of disbelief,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "79:35",
            "79:6",
            "96:5",
            "55:3",
            "75:13",
            "53:24",
            "80:17",
            "86:9",
            "36:64",
            "38:53"
        ],
        "BIBLE": [
            "prophets:i%20samuel:11:13",
            "prophets:isaiah:43:13",
            "torah:leviticus:23:3",
            "torah:deuteronomy:12:8",
            "torah:exodus:35:2",
            "torah:exodus:31:15",
            "torah:exodus:12:16",
            "writings:proverbs:24:29",
            "writings:ecclesiastes:11:8",
            "writings:job:36:24"
        ]
    }
}