{
    "VERSE": "79:40",
    "ARABIC": "وَأَمَّا مَنْ خَافَ مَقَامَ رَبِّهِۦ وَنَهَى ٱلنَّفْسَ عَنِ ٱلْهَوَىٰ",
    "ENGLISH": {
        "TRANSLATION_0": "But as for him who feared the Station of his Lord and forbade the lower self its appetites,",
        "TRANSLATION_1": "But he who feared standing before his Lord, and restrained his self from vain desires,\n",
        "TRANSLATION_2": "But he who feared to stand before his Lord, and restrained himself from evil desires,\n",
        "TRANSLATION_3": "However, those who had feared their Lord and restrained their souls from acting according to its desires.\n",
        "TRANSLATION_4": "And for one who feared to stand before his Lord and restrained his soul from desire,\n",
        "TRANSLATION_5": "But as for him who feared standing before his Lord, and forbade himself from desire.\n",
        "TRANSLATION_6": "And as for him who fears to stand in the presence of his Lord and forbids the soul from low desires,\n",
        "TRANSLATION_7": "But as for him who feared the Station of his Lord and forbade the soul its caprice,\n",
        "TRANSLATION_8": "But as for him who feared to stand before his Lord and restrained his soul from lust,\n",
        "TRANSLATION_9": "but one who fears to stand before his Lord and restrained himself from base desires,\n",
        "TRANSLATION_10": "And as for him who dreaded standing before his Lord, and restrained his soul from lust,\n",
        "TRANSLATION_11": "But as for him who is awed to stand before his Lord and restrains his soul from [following] desires,\n",
        "TRANSLATION_12": "And for such as had entertained the fear of standing before their Lord's (tribunal) and had restrained (their) soul from lower desires,\n",
        "TRANSLATION_13": "But as for him who feared standing before his Lord, and restrained himself from impure evil desires, and lusts.\n",
        "TRANSLATION_14": "But, whosoever feared the standing before his Lord and prevented the self from desires,\n",
        "TRANSLATION_15": "But as for him who feared the Standing of his Lord, and restrained the self from desires.\n",
        "TRANSLATION_16": "But as for he who feared the position of his Lord and prevented the soul from [unlawful] inclination,\n",
        "TRANSLATION_17": "[79:40] But as for him who feared the stance before his Lord, his standing before Him, and forbade the, evil-bidding, soul from [pursuing] desire, that leads to perdition as a result of [that person’s] lusting after [carnal] desires,\n",
        "TRANSLATION_18": "(But as for him who feared) upon committing a sin (to stand before his Lord) his standing before his Lord and abstains from engaging in sin (and restrained his soul from lust) from that which is unlawful, even though he desires it, this refers to Mus'ab Ibn 'Umayr.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "79:40",
            "55:46",
            "29:30",
            "17:79",
            "7:23",
            "45:15",
            "5:25",
            "2:286",
            "53:3",
            "28:21"
        ],
        "BIBLE": [
            "torah:numbers:8:4",
            "prophets:i%20samuel:25:17",
            "prophets:malachi:2:9",
            "writings:ii%20chronicles:6:12",
            "writings:ezra:3:3",
            "torah:deuteronomy:15:9",
            "torah:leviticus:5:9",
            "prophets:i%20kings:7:37",
            "prophets:jeremiah:27:19",
            "prophets:i%20kings:21:26"
        ]
    }
}