{
    "VERSE": "4:101",
    "ARABIC": "وَإِذَا ضَرَبْتُمْ فِى ٱلْأَرْضِ فَلَيْسَ عَلَيْكُمْ جُنَاحٌ أَن تَقْصُرُوا۟ مِنَ ٱلصَّلَوٰةِ إِنْ خِفْتُمْ أَن يَفْتِنَكُمُ ٱلَّذِينَ كَفَرُوٓا۟ إِنَّ ٱلْكَٰفِرِينَ كَانُوا۟ لَكُمْ عَدُوًّا مُّبِينًا",
    "ENGLISH": {
        "TRANSLATION_0": "When you are travelling in the land, there is nothing wrong in your shortening your salat if you fear that those who are kafir may harass you. The kuffar are your clear-cut enemies.",
        "TRANSLATION_1": "When you travel in the land there is no sin if you curtail your service of prayer if you fear the unbelievers may harass you, for indeed your open enemies are the infidels.\n",
        "TRANSLATION_2": "When you go forth journeying in the land, there is no blame on you if you shorten the Prayer, (especially) if you fear that the unbelievers might cause you harm. Surely the unbelievers are your open enemies.\n",
        "TRANSLATION_3": "When you are on a journey, it is no sin to shorten your prayers if you are afraid of the mischief of the unbelievers. The unbelievers have always been your sworn enemies\n",
        "TRANSLATION_4": "And when you travel in the land, it is no sin for you to curtail some of your obligatory prayers; if you fear that disbelievers may cause you harm; undoubtedly the disbelievers are open enemies to you.\n",
        "TRANSLATION_5": "And when you Darabtum in the land, there is no sin on you if you shorten the Salah if you fear that the disbelievers may put you in trial, verily, the disbelievers are ever unto you open enemies.\n",
        "TRANSLATION_6": "And when you journey in the earth, there is no blame on you if you shorten the prayer, if you fear that those who disbelieve will cause you distress, surely the unbelievers are your open enemy.\n",
        "TRANSLATION_7": "And when you are journeying in the land there is no fault in you that you shorten the prayer, if you fear the unbelievers may afflict you; the unbelievers are for you a manifest foe.\n",
        "TRANSLATION_8": "And when ye go forth in the land, it is no sin for you to curtail (your) worship if ye fear that those who disbelieve may attack you. In truth the disbelievers are an open enemy to you.\n",
        "TRANSLATION_9": "When you [believers] are travelling in the land, you will not be blamed for shortening your prayers, if you fear the disbelievers may harm you. They are your avowed enemies.\n",
        "TRANSLATION_10": "And when ye are journeying in the earth there shall be no fault in you that ye shorten the prayer if ye fear that those who disbelieve shall molest you, verily the infidels are ever unto you an avowed enemy.\n",
        "TRANSLATION_11": "When you journey in the land, there is no sin upon you in shortening the prayers, if you fear that the faithless may trouble you; indeed the faithless are your manifest enemies.\n",
        "TRANSLATION_12": "When ye travel through the earth, there is no blame on you if ye shorten your prayers, for fear the Unbelievers May attack you: For the Unbelievers are unto you open enemies.\n",
        "TRANSLATION_13": "And when you (Muslims) travel in the land, there is no sin on you if you shorten your Salat (prayer) if you fear that the disbelievers may attack you, verily, the disbelievers are ever unto you open enemies.\n",
        "TRANSLATION_14": "And when you are journeying in the land, there is no fault in you that you shorten the prayer if you fear that those who disbelieve will afflict you. Indeed, the unbelievers are a clear enemy for you.\n",
        "TRANSLATION_15": "When you travel in the land, there is no blame on you for shortening the prayers, if you fear that the disbelievers may harm you. The disbelievers are your manifest enemies.\n",
        "TRANSLATION_16": "And when you travel throughout the land, there is no blame upon you for shortening the prayer, [especially] if you fear that those who disbelieve may disrupt [or attack] you. Indeed, the disbelievers are ever to you a clear enemy.\n",
        "TRANSLATION_17": "[4:101] And when you are going forth, travelling, in the land you would not be at fault if you shorten the prayer, by making it two [genuflexions] instead of four, if you fear that you may be afflicted by those who do not believe, that is, [if you fear] that you may be harmed [by them]: this [fear of affliction at the hands of the disbelievers] is [just intended as] an explication of the reality [of the situation] at that time and the point no longer applies. In the Sunna, it is pointed out that ‘travel’ (safar) means long-distance [travel], which is [approximately] 50 miles. God’s words ‘you would not be at fault’ should be understood as [denoting] a dispensation and not a requirement, and this is the opinion of al-Shāfi‘ī; the disbelievers are a manifest foe to you, their enmity being evident.\n",
        "TRANSLATION_18": "(And when ye go forth in the land) when you travel, (it is no sin for you to curtail (your) worship) curtail the prayer that a sedentary Muslim would usually perform (if ye fear) if you know (that those who disbelieve may attack you) may kill you while in prayer. (In truth the disbelievers are an open enemy to you) this is what is called the prayer of fear (salat al-khawf).\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "4:101",
            "2:11",
            "4:102",
            "62:10",
            "67:24",
            "2:168",
            "6:72",
            "28:19",
            "60:9",
            "5:93"
        ],
        "BIBLE": [
            "prophets:ezekiel:38:8",
            "torah:exodus:12:25",
            "torah:deuteronomy:31:21",
            "torah:exodus:13:5",
            "torah:deuteronomy:28:25",
            "writings:job:7:1",
            "writings:psalms:19:14",
            "torah:leviticus:7:24",
            "prophets:ii%20samuel:15:8",
            "prophets:ezekiel:30:13"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:3:7"
        ]
    }
}