{
    "VERSE": "4:102",
    "ARABIC": "وَإِذَا كُنتَ فِيهِمْ فَأَقَمْتَ لَهُمُ ٱلصَّلَوٰةَ فَلْتَقُمْ طَآئِفَةٌ مِّنْهُم مَّعَكَ وَلْيَأْخُذُوٓا۟ أَسْلِحَتَهُمْ فَإِذَا سَجَدُوا۟ فَلْيَكُونُوا۟ مِن وَرَآئِكُمْ وَلْتَأْتِ طَآئِفَةٌ أُخْرَىٰ لَمْ يُصَلُّوا۟ فَلْيُصَلُّوا۟ مَعَكَ وَلْيَأْخُذُوا۟ حِذْرَهُمْ وَأَسْلِحَتَهُمْ وَدَّ ٱلَّذِينَ كَفَرُوا۟ لَوْ تَغْفُلُونَ عَنْ أَسْلِحَتِكُمْ وَأَمْتِعَتِكُمْ فَيَمِيلُونَ عَلَيْكُم مَّيْلَةً وَٰحِدَةً وَلَا جُنَاحَ عَلَيْكُمْ إِن كَانَ بِكُمْ أَذًى مِّن مَّطَرٍ أَوْ كُنتُم مَّرْضَىٰٓ أَن تَضَعُوٓا۟ أَسْلِحَتَكُمْ وَخُذُوا۟ حِذْرَكُمْ إِنَّ ٱللَّهَ أَعَدَّ لِلْكَٰفِرِينَ عَذَابًا مُّهِينًا",
    "ENGLISH": {
        "TRANSLATION_0": "When you are with them and leading them in salat, a group of them should stand with you, keeping hold of their weapons. When they prostrate, the others should guard your backs. Then the other group who have not yet prayed should come and pray with you. They too should be careful and keep hold of their weapons. Those who are kafir would like you to be negligent of your arms and equipment so that they can swoop down on you once and for all. There is nothing wrong, if you are bothered by rain or you are ill, in laying your weapons down; but take every precaution. Allah has prepared a humiliating punishment for the kafirun.",
        "TRANSLATION_1": "When you are among them, and have to lead the service of prayer, let one group stand up with you, but let them keep their arms. After they have paid their homage they should go to the rear, and let the group which has not done so yet offer their service of prayer with you, remaining cautious and armed, The infidels wish to find you neglectful of your arms and provisions, to attack you unawares. It will not be a sin if you put aside your arms when you are troubled by rain, or you are ill; but take full precautions. God has reserved for infidels a despicable punishment\n",
        "TRANSLATION_2": "(O Messenger!) If you are among the believers and rise (in the state of war) to lead the Prayer for them, let a party of them stand with you to worship, keeping their arms. When they have performed their prostration, let them go behind you, and let another party who have not prayed, pray with you, remaining on guard and keeping their arms, for the unbelievers love to see you heedless of your arms and your baggage so that they might swoop upon you in a surprise attack. But there shall be no blame upon you if you were to lay aside your arms if you are either troubled by rain or are sick; but remain on guard. Surely Allah has prepared a humiliating chastisement for the unbelievers.\n",
        "TRANSLATION_3": "(Muhammad), if you are among them (your followers during a battle) and you call them for prayer, let a group of them carry their arms during prayer. After they have made their prostrations, let them go back to watch the enemy and let the other group who has not yet prayed, join you, carrying their arms with due precaution. The unbelievers would love to find you neglecting your arms and property and would attack you suddenly. If rain or illness make you suffer, you may place your arms aside during prayer but still observe due precaution. God has prepared a humiliating torment for the unbelievers.\n",
        "TRANSLATION_4": "And when you (O dear Prophet Mohammed – peace and blessings be upon him) are among them and lead them in prayer, only a group of them should be with you, and they must keep their weapons with them; so when they have performed their prostrations they should move away behind you; and the other group that had not prayed, must come and offer prayers in your leadership, keeping their guard and weapons with them; the disbelievers wish that you neglect your arms and your means so they may overpower you with a single attack; it is no sin for you to lay aside your arms due to rain or if you are sick; and keep your guard; undoubtedly Allah has kept prepared a disgraceful punishment for the disbelievers.\n",
        "TRANSLATION_5": "When you (O Messenger Muhammad) are among them, and lead them in Salah, let one party of them stand up [in prayer] with you, taking their arms with them; when they finish their prostrations, let them take their positions in the rear and let the other party come up which have not yet prayed, and let them pray with you, taking all the precautions and bearing arms. Those who disbelieve wish, if you were negligent of your arms and your baggage, to attack you in a single rush, but there is no sin on you if you put away your arms because of the inconvenience of rain or because you are ill, but take every precaution for yourselves. Verily, Allah has prepared a humiliating torment for the disbelievers.\n",
        "TRANSLATION_6": "And when you are among them and keep up the prayer for them, let a party of them stand up with you, and let them take their arms; then when they have prostrated themselves let them go to your rear, and let another party who have not prayed come forward and pray with you, and let them take their precautions and their arms; (for) those who disbelieve desire that you may be careless of your arms and your luggage, so that they may then turn upon you with a sudden united attack, and there is no blame on you, if you are annoyed with rain or if you are sick, that you lay down your arms, and take your precautions; surely Allah has prepared a disgraceful chastisement for the unbelievers.\n",
        "TRANSLATION_7": "When thou art amongst them, and performest for them the prayer, let a party of them stand with thee, and let them take their weapons. When they bow themselves, let them be behind you; and let another party who have not prayed come and pray with thee, taking their precautions and their weapons. The unbelievers wish that you should be heedless of your weapons and your baggage, then they would wheel on you all at once. There is no fault in you, if rain molests you, or you are sick, to lay aside your weapons; but take your precautions. God has prepared for the unbelievers a humbling chastisement.\n",
        "TRANSLATION_8": "And when thou (O Muhammad) art among them and arrangest (their) worship for them, let only a party of them stand with thee (to worship) and let them take their arms. Then when they have performed their prostrations let them fall to the rear and let another party come that hath not worshipped and let them worship with thee, and let them take their precaution and their arms. Those who disbelieve long for you to neglect your arms and your baggage that they may attack you once for all. It is no sin for you to lay aside your arms, if rain impedeth you or ye are sick. But take your precaution. Lo! Allah prepareth for the disbelievers shameful punishment.\n",
        "TRANSLATION_9": "When you are among the believers and lead them in prayer, let only part of them stand up along with you, armed with their weapons. After they have prostrated themselves, let them withdraw to the rear to stand guard and then let another party, who have not yet prayed, come forward and pray with you. And let them also be on their guard, armed with their weapons. Those who deny the truth want you to be negligent of your arms and your baggage, so that they may fall upon you suddenly. It is no offence for you to lay aside your arms when overtaken by heavy rain or illness, and always take every precaution for defence. God has prepared a humiliating punishment for those who deny the truth.\n",
        "TRANSLATION_10": "And when thou art amidst them and hast set up the prayer for them, then let a party of them stand with thee and let them retain their arms; then when they have prostrated themselves, let them go behind you, and let anot her party who have not yet prayed, come and pray with thee; and let them also take their caution and their arms. Pain would those who disbelieve that ye neglected your arms and your baggage, so that they might swoop down upon you at one swoop. And there shall be no fault in you, if there be an injury to you from rain or ye are ailing, that ye lay down your arms and yet take your caution. Verily Allah hath gotten ready for the infidels a torment ignominious.\n",
        "TRANSLATION_11": "When you are among them, leading them in prayers, let a group of them stand with you, carrying their weapons. And when they have done the prostrations, let them withdraw to the rear, then let the other group which has not prayed come and pray with you, taking their precautions and [bearing] their weapons. The faithless are eager that you should be oblivious of your weapons and your baggage, so that they could assault you all at once. But there is no sin upon you, if you are troubled by rain or are sick, to set aside your weapons; but take your precautions. Indeed Allah has prepared for the faithless a humiliating punishment.\n",
        "TRANSLATION_12": "When thou (O Messenger) art with them, and standest to lead them in prayer, Let one party of them stand up (in prayer) with thee, Taking their arms with them: When they finish their prostrations, let them Take their position in the rear. And let the other party come up which hath not yet prayed - and let them pray with thee, Taking all precaution, and bearing arms: the Unbelievers wish, if ye were negligent of your arms and your baggage, to assault you in a single rush. But there is no blame on you if ye put away your arms because of the inconvenience of rain or because ye are ill; but take (every) precaution for yourselves. For the Unbelievers Allah hath prepared a humiliating punishment.\n",
        "TRANSLATION_13": "When you (O Messenger Muhammad SAW) are among them, and lead them in As-Salat (the prayer), let one party of them stand up [in Salat (prayer)] with you taking their arms with them; when they finish their prostrations, let them take their positions in the rear and let the other party come up which has not yet prayed, and let them pray with you taking all the precautions and bearing arms. Those who disbelieve wish, if you were negligent of your arms and your baggage, to attack you in a single rush, but there is no sin on you if you put away your arms because of the inconvenience of rain or because you are ill, but take every precaution for yourselves. Verily, Allah has prepared a humiliating torment for the disbelievers.\n",
        "TRANSLATION_14": "When you are with them, and establish the prayer, let a party of them stand with you, and let them take their weapons. After making their prostrations, let them be behind you, and let another party who have not prayed come and pray with you, taking their precautions and their weapons. Those who disbelieve wish that you should be inattentive of your weapons and your baggage, so that they might swoop upon you with one assault. But there is no fault in you if you are harmed by rain, or you are sick to lay aside your weapons, but take your precautions. Allah has prepared a humiliating punishment for the unbelievers.\n",
        "TRANSLATION_15": "When you are among them, and you stand to lead them in prayer, let a group of them stand with you, and let them hold their weapons. Then, when they have done their prostrations, let them withdraw to the rear, and let another group, that have not prayed yet, come forward and pray with you; and let them take their precautions and their weapons. Those who disbelieve would like you to neglect your weapons and your equipment, so they can attack you in a single assault. You commit no error, if you are hampered by rain or are sick, by putting down your weapons; but take precautions. Indeed, God has prepared for the disbelievers a demeaning punishment.\n",
        "TRANSLATION_16": "And when you are among them and lead them in prayer, let a group of them stand [in prayer] with you and let them carry their arms. And when they have prostrated, let them be [in position] behind you and have the other group come forward which has not [yet] prayed and let them pray with you, taking precaution and carrying their arms. Those who disbelieve wish that you would neglect your weapons and your baggage so they could come down upon you in one [single] attack. But there is no blame upon you, if you are troubled by rain or are ill, for putting down your arms, but take precaution. Indeed, Allah has prepared for the disbelievers a humiliating punishment.\n",
        "TRANSLATION_17": "[4:102] When you, O Muhammad (s), are, present, among them, while you [all] fear an enemy, and you stand to lead them in prayer (this type of address is customary in the Qur’ān), let a party of them stand with you, while another party stand back, and let them, the party standing with you, take their weapons, with them. Then when they have performed their prostrations, that is, [when] they have prayed, let them, the other party, be behind you, on guard until you complete the prayers; thereupon, let this party go on guard, and let another party who have not prayed come and pray with you, taking their precautions and their weapons, with them until you have completed the prayers. The Prophet (s) did this once at Batn Nakhla, as reported by the two Shaykhs [Bukhārī and Muslim]. The disbelievers wish, when you have stood up to pray, that you should be heedless of your weapons and your baggage that they may descend upon you all at once, by making an assault against you and capturing you, and herein is the reasoning behind keeping weapons on oneself. You are not at fault, if rain bothers you, or if you are sick, to lay aside your weapons, and not carry them: this implies that when there is no such excuse, it is compulsory to carry them, and this is one of two opinions held by al-Shāfi‘ī [on this matter]; the other [opinion] is that this [precaution] constitutes a sunna, and this is the more preferable opinion. But take your precautions, against the enemy and be on your guard as best you can; God has prepared for the disbelievers a humiliating chastisement.\n",
        "TRANSLATION_18": "Allah said: (And when thou (O Muhammad) art among them) present with them (and arranges (their) worship for them) and stand to lead the prayer for them, begin by saying Allah is the greatest (Allahu akbar) and let them repeat the same after you, (let only a party of them stand with thee) in prayer (and let them take their arms. Then when they have performed their prostrations) when they have prayed one unit (let them fall) let them retreat (to the rear) to the position of their fellow believers who are facing the enemy (and let another party) who were facing the enemy (come that hath not worshipped) that has not performed the first unit of prayer with you (and let them worship with thee) let them pray with you the second unit of prayer, (and let them take their precaution) against the enemy (and their arms) let them take their arms with them. (Those who disbelieve) i.e. the Banu Anmar (long for you to neglect your arms) and be oblivious 99 to them (and your baggage) and they also long that you forget the means of war (that they may attack you once for all) while you are performing the prayers. Then Allah gave the believers a legal dispensation to put down their arms, saying: (It is no sin for you) there is no harm for you (to lay aside your arms, if rain) intense rain (impedeth you or ye are sick) wounded. (But take your precaution) against your enemy. (Lo! Allah prepareth for the disbelievers) the Banu Anmar (shameful punishment) by means of which they will be humiliated; it is also said that this means: a severe punishment.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "4:102",
            "4:101",
            "24:19",
            "49:9",
            "24:2",
            "4:24",
            "2:240",
            "2:222",
            "33:57",
            "9:83"
        ],
        "BIBLE": [
            "prophets:jeremiah:20:4",
            "prophets:joshua:4:3",
            "torah:numbers:17:11",
            "prophets:nahum:2:2",
            "torah:exodus:23:27",
            "prophets:jeremiah:40:1",
            "writings:i%20chronicles:10:4",
            "prophets:jeremiah:20:9",
            "torah:leviticus:4:35",
            "prophets:i%20kings:8:47"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:12"
        ]
    }
}