{
    "VERSE": "4:103",
    "ARABIC": "فَإِذَا قَضَيْتُمُ ٱلصَّلَوٰةَ فَٱذْكُرُوا۟ ٱللَّهَ قِيَٰمًا وَقُعُودًا وَعَلَىٰ جُنُوبِكُمْ فَإِذَا ٱطْمَأْنَنتُمْ فَأَقِيمُوا۟ ٱلصَّلَوٰةَ إِنَّ ٱلصَّلَوٰةَ كَانَتْ عَلَى ٱلْمُؤْمِنِينَ كِتَٰبًا مَّوْقُوتًا",
    "ENGLISH": {
        "TRANSLATION_0": "When you have finished salat remember Allah standing, sitting and lying on your sides. When you are safe again do salat in the normal way. The salat is prescribed for the muminun at specific times.",
        "TRANSLATION_1": "If you are late in performing your service of prayer honour God by remembering Him, standing or sitting or lying on your sides. And when you have security perform your act of prayer befittingly; and praying at fixed hours is prescribed for the faithful.\n",
        "TRANSLATION_2": "When you have finished the Prayer, remember Allah -standing, and sitting, and reclining. And when you become secure, perform the regular Prayer. The Prayer is enjoined upon the believers at stated times.\n",
        "TRANSLATION_3": "When you complete your prayer, remember God all the time while standing, sitting, or reclining. When you are safe, say your prayers properly. It is a constant duty of the believers.\n",
        "TRANSLATION_4": "So when you have offered your prayers remember Allah while standing, sitting and reclining; and when you feel secure, offer prayers in the usual manner; indeed prayers are a time bound obligatory duty upon the Muslims.\n",
        "TRANSLATION_5": "When you have finished the Salah, remember Allah standing, sitting down, and on your sides, but when you are free from danger, perform the Salah. Verily, Salah is kitaban on the believers at fixed hours.\n",
        "TRANSLATION_6": "Then when you have finished the prayer, remember Allah standing and sitting and reclining; but when you are secure (from danger) keep up prayer; surely prayer is a timed ordinance for the believers.\n",
        "TRANSLATION_7": "When you have performed the prayer, remember God, standing and sitting and on your sides. Then, when you are secure, perform the prayer; surely the prayer is a timed prescription for the believers.\n",
        "TRANSLATION_8": "When ye have performed the act of worship, remember Allah, standing, sitting and reclining. And when ye are in safety, observe proper worship. Worship at fixed times hath been enjoined on the believers.\n",
        "TRANSLATION_9": "When you have finished the prayer, remember God while standing, and sitting, and lying on your sides. When you feel secure, say your prayers in the prescribed form. Believers are under the obligation to say their prayers at the appointed hours.\n",
        "TRANSLATION_10": "Then when ye have finished the prayer, remember Allah, standing and sitting and lying on Your sides. Then when ye are secure, establish the prayer verily the prayer is prescribed unto the believers at definite times.\n",
        "TRANSLATION_11": "When you have finished the prayers, remember Allah, standing, sitting, and lying down, and when you feel secure, perform the [complete] prayers, for the prayer is indeed a timed prescription for the faithful.\n",
        "TRANSLATION_12": "When ye pass (Congregational) prayers, celebrate Allah's praises, standing, sitting down, or lying down on your sides; but when ye are free from danger, set up Regular Prayers: For such prayers are enjoined on believers at stated times.\n",
        "TRANSLATION_13": "When you have finished As-Salat (the prayer - congregational), remember Allah standing, sitting down, and lying down on your sides, but when you are free from danger, perform As-Salat (Iqamat-as- Salat). Verily, the prayer is enjoined on the believers at fixed hours.\n",
        "TRANSLATION_14": "When you have established the prayer, remember Allah standing, sitting, and on your sides. Then, when you are secure, establish the prayer, surely, prayer is timely written upon the believer.\n",
        "TRANSLATION_15": "When you have completed the prayer, remember God, standing, or sitting, or on your sides. And when you feel secure, perform the prayer. The prayer is obligatory for believers at specific times.\n",
        "TRANSLATION_16": "And when you have completed the prayer, remember Allah standing, sitting, or [lying] on your sides. But when you become secure, re-establish [regular] prayer. Indeed, prayer has been decreed upon the believers a decree of specified times.\n",
        "TRANSLATION_17": "[4:103] When you have performed the prayer, [when] you have completed it, remember God, by [repeating] ‘There is no god but God’ (tahlīl) and ‘Glory be to God’ (tasbīh), standing and sitting and on your sides, lying down, in other words, in all states. Then, when you are reassured, [when] you are secure, observe the prayer, perform it with its proper due, surely the prayer is for believers a prescription, enjoined, that is, an obligation, at specific times, that is, its appointed times are set, and so it should not be postponed from these times.\n",
        "TRANSLATION_18": "(When ye have performed the act of worship) when you have finished performing the prayer of fear, (remember Allah) pray to Allah, (standing) for the one who is healthy, (sitting) for the one who is sick (and reclining) for the one who is wounded or sick. (And when ye are in safety) when you return home and feel no more fear, (observe proper worship) perform the prayer in full: four units of prayer. (Worship at fixed hours hath been) performing the prayer is (enjoined on the believers) prescribed and known both while in residence and during travel: the traveller performs two units of prayer and the resident four.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "4:103",
            "29:45",
            "20:14",
            "62:10",
            "2:238",
            "35:29",
            "7:196",
            "19:30",
            "4:142",
            "22:35"
        ],
        "BIBLE": [
            "torah:exodus:12:26",
            "torah:exodus:12:25",
            "writings:ii%20chronicles:8:14",
            "writings:ii%20chronicles:30:5",
            "writings:i%20chronicles:17:11",
            "prophets:jeremiah:5:19",
            "prophets:isaiah:14:24",
            "writings:ezra:3:4",
            "prophets:i%20samuel:2:36",
            "prophets:joshua:22:27"
        ]
    }
}