{
    "VERSE": "4:106",
    "ARABIC": "وَٱسْتَغْفِرِ ٱللَّهَ إِنَّ ٱللَّهَ كَانَ غَفُورًا رَّحِيمًا",
    "ENGLISH": {
        "TRANSLATION_0": "And ask Allah's forgiveness. Allah is Ever-Forgiving, Most Merciful.",
        "TRANSLATION_1": "And seek God's forgiveness, for God is surely forgiving and kind.\n",
        "TRANSLATION_2": "and seek forgiveness from Allah. Surely Allah is All-Forgiving, All-Compassionate.\n",
        "TRANSLATION_3": "Seek forgiveness from God. He is All-forgiving and All-merciful.\n",
        "TRANSLATION_4": "And seek forgiveness from Allah; indeed Allah is Oft Forgiving, Most Merciful.\n",
        "TRANSLATION_5": "And seek the forgiveness of Allah, certainly, Allah is Ever Oft-Forgiving, Most Merciful.\n",
        "TRANSLATION_6": "And ask forgiveness of Allah; surely Allah is Forgiving, Merciful.\n",
        "TRANSLATION_7": "and pray forgiveness of God; surely God is All-forgiving, All-compassionate.\n",
        "TRANSLATION_8": "And seek forgiveness of Allah. Lo! Allah is ever Forgiving, Merciful.\n",
        "TRANSLATION_9": "Ask God for forgiveness: He is most forgiving and merciful.\n",
        "TRANSLATION_10": "And beg thou forgiveness of verily Allah is ever Forgiving.\n",
        "TRANSLATION_11": "and plead to Allah for forgiveness; indeed Allah is all-forgiving, all-merciful.\n",
        "TRANSLATION_12": "But seek the forgiveness of Allah; for Allah is Oft-forgiving, Most Merciful.\n",
        "TRANSLATION_13": "And seek the Forgiveness of Allah, certainly, Allah is Ever Oft-Forgiving, Most Merciful.\n",
        "TRANSLATION_14": "And ask the forgiveness of Allah, surely Allah is the Forgiver, the Most Merciful.\n",
        "TRANSLATION_15": "And ask God for forgiveness. God is Forgiver and Merciful.\n",
        "TRANSLATION_16": "And seek forgiveness of Allah. Indeed, Allah is ever Forgiving and Merciful.\n",
        "TRANSLATION_17": "[4:106] And pray for forgiveness from God, for that which you considered doing; surely God is ever Forgiving, Merciful.\n",
        "TRANSLATION_18": "(And seek forgiveness of Allah) repent to Allah for being on the verge of hitting the Jew, Zayd Ibn Samin. (Lo! Allah is ever Forgiving, Merciful) of him who dies repentant; it is also said that this means: Allah is Forgiving of the transgression you were about to commit, Merciful towards you.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "4:106",
            "2:192",
            "33:73",
            "2:218",
            "5:74",
            "4:96",
            "16:18",
            "24:5",
            "3:89",
            "3:31"
        ],
        "BIBLE": [
            "writings:daniel:9:9",
            "prophets:jonah:4:2",
            "writings:psalms:130:4",
            "prophets:i%20samuel:3:17",
            "prophets:hosea:2:25",
            "writings:psalms:99:8",
            "torah:genesis:32:30",
            "writings:psalms:42:10",
            "prophets:ii%20kings:19:15",
            "writings:psalms:86:15"
        ]
    }
}