{
    "VERSE": "4:11",
    "ARABIC": "يُوصِيكُمُ ٱللَّهُ فِىٓ أَوْلَٰدِكُمْ لِلذَّكَرِ مِثْلُ حَظِّ ٱلْأُنثَيَيْنِ فَإِن كُنَّ نِسَآءً فَوْقَ ٱثْنَتَيْنِ فَلَهُنَّ ثُلُثَا مَا تَرَكَ وَإِن كَانَتْ وَٰحِدَةً فَلَهَا ٱلنِّصْفُ وَلِأَبَوَيْهِ لِكُلِّ وَٰحِدٍ مِّنْهُمَا ٱلسُّدُسُ مِمَّا تَرَكَ إِن كَانَ لَهُۥ وَلَدٌ فَإِن لَّمْ يَكُن لَّهُۥ وَلَدٌ وَوَرِثَهُۥٓ أَبَوَاهُ فَلِأُمِّهِ ٱلثُّلُثُ فَإِن كَانَ لَهُۥٓ إِخْوَةٌ فَلِأُمِّهِ ٱلسُّدُسُ مِنۢ بَعْدِ وَصِيَّةٍ يُوصِى بِهَآ أَوْ دَيْنٍ ءَابَآؤُكُمْ وَأَبْنَآؤُكُمْ لَا تَدْرُونَ أَيُّهُمْ أَقْرَبُ لَكُمْ نَفْعًا فَرِيضَةً مِّنَ ٱللَّهِ إِنَّ ٱللَّهَ كَانَ عَلِيمًا حَكِيمًا",
    "ENGLISH": {
        "TRANSLATION_0": "Allah instructs you regarding your children: A male receives the same as the share of two females. If there are more than two daughters they receive two-thirds of what you leave. If she is one on her own she receives a half. Each of your parents receives a sixth of what you leave if you have children. If you are childless and your heirs are your parents your mother receives a third. If you have brothers or sisters your you do not know which of them is going to benefit you more. These are obligatory shares from Allah. Allah is All-Knowing, All-Wise.",
        "TRANSLATION_1": "As for the children, God decrees that the share of the male is equivalent to that of two females. If they consist of women only, and of them more than two, they will get two-thirds of the inheritance; but in case there is one, she will inherit one half. The parents will each inherit a sixth of the estate if it happens the deceased has left a child; but if he has left no children, and his parents are his heirs, then the mother will inherit one-third; but if he has left brothers, the mother will inherit one-sixth after payment of legacies and debts. Of parents and children you do not know who are more useful to you. These are the decrees of God who knows all and is wise.\n",
        "TRANSLATION_2": "Allah thus commands you concerning your children: the share of the male is like that of two females. If (the heirs of the deceased are) more than two daughters, they shall have two-thirds of the inheritance; and if there is only one daughter, then she shall have half the inheritance. If the deceased has any offspring, each of his parents shall have a sixth of the inheritance; and if the deceased has no child and his parents alone inherit him, then one-third shall go to his mother; and if the deceased has brothers and sisters, then one-sixth shall go to his mother. All these shares are to be given after payment of the bequest he might have made or any debts outstanding against him. You do not know which of them, your parents or your children, are more beneficial to you. But these portions have been determined by Allah, for He indeed knows all, is cognizant of all beneficent considerations.\n",
        "TRANSLATION_3": "This is a commandment from your Lord: After the payment of debts or anything bequeathed, let the male inherit twice as much as the female. If there are more than two girls, they will have two-thirds of the legacy. If there is only one girl, she will inherit half of the legacy. Parents of the deceased will each inherit one-sixth of the legacy, if the deceased has a surviving child, however, if no children survive the deceased, and the heirs are the parents, the mother will receive one-third of the legacy. The mother will receive one-sixth of the legacy if the deceased has more than one surviving brother. These are the decreed shares according to the laws of God. Regardless of how you feel about your parents or children, you do not know which of them is more beneficial to you. God is All-knowing and All-wise.\n",
        "TRANSLATION_4": "Allah commands you concerning your children; the son’s share is equal to that of two daughters; and if there are only daughters, for them is two-thirds of the inheritance, even if they are more than two; and if there is only one daughter, for her is half; and to each of the deceased’s parents a sixth of the inheritance, if he has children; and if the deceased has no children but leaves behind parents, then one third for the mother; and if he has several brothers and sisters, a sixth for the mother, after any will he may have made and payment of debt; your fathers and your sons – you do not know which of them will be more useful to you; this is the share fixed by Allah; indeed Allah is All Knowing, Wise.\n",
        "TRANSLATION_5": "Allah commands you for your children's (inheritance): to the male, a portion equal to that of two - females; if only daughters, two or more, their share is two thirds of the inheritance; if only one, her share is half. For parents, a sixth share of inheritance to each if the deceased left children; if no children, and the parents are the (only) heirs, the mother has a third; if the deceased left brothers or (sisters), the mother has a sixth. (The distribution in all cases is) after the payment of legacies he may have bequeathed or debts. You know not which of them, whether your parents or your children, are nearest to you in benefit, (these fixed shares) are ordained by Allah. And Allah is Ever All-Knower, All-Wise.\n",
        "TRANSLATION_6": "Allah enjoins you concerning your children: The male shall have the equal of the portion of two females; then if they are more than two females, they shall have two-thirds of what the deceased has left, and if there is one, she shall have the half; and as for his parents, each of them shall have the sixth of what he has left if he has a child, but if he has no child and (only) his two parents inherit him, then his mother shall have the third; but if he has brothers, then his mother shall have the sixth after (the payment of) a bequest he may have bequeathed or a debt; your parents and your children, you know not which of them is the nearer to you in usefulness; this is an ordinance from Allah: Surely Allah is Knowing, Wise.\n",
        "TRANSLATION_7": "God charges you, concerning your children: to the male the like of the portion of two females, and if they be women above two, then for them two-thirds of what he leaves, but if she be one then to her a half; and to his parents to each one of the two the sixth of what he leaves, if he has children; but if he has no children, and his heirs are his parents, a third to his mother, or, if he has brothers, to his mother a sixth, after any bequest he may bequeath, or any debt. Your fathers and your sons -- you know not which out of them is nearer in profit to you. So God apportions; surely God is All-knowing, All-wise.\n",
        "TRANSLATION_8": "Allah chargeth you concerning (the provision for) your children: to the male the equivalent of the portion of two females, and if there be women more than two, then theirs is two-thirds of the inheritance, and if there be one (only) then the half. And to each of his parents a sixth of the inheritance, if he have a son; and if he have no son and his parents are his heirs, then to his mother appertaineth the third; and if he have brethren, then to his mother appertaineth the sixth, after any legacy he may have bequeathed, or debt (hath been paid). Your parents and your children: Ye know not which of them is nearer unto you in usefulness. It is an injunction from Allah. Lo! Allah is Knower, Wise.\n",
        "TRANSLATION_9": "Concerning your children, God enjoins you that a male shall receive a share equivalent to that of two females. But if there are more than two females, then their share is two thirds of the inheritance. If there is only one, she will receive the half. Each of your parents receives a sixth of what you leave if you have children. If you are childless and your heirs are your parents, your mother receives a third. If you have brothers [or sisters] your mother receives a sixth, after [the deduction of] any bequest you make or the repayment of any debts with regard to your father and your sons. You do not know which of them is going to benefit you more: but this fixing of portions is by God and He is all knowing and all wise.\n",
        "TRANSLATION_10": "Allah enjoineth you in the matter of your children; the male will have as much as the portion of two females, but if they be females more than two, then they will have two-thirds of that which he hath left, and if only one, she will have a half; and as far as his parents, each of the twain shall have a sixth of that which he hath left if he have a child, but if he hath no child and his parents be his heirs, then his mother shall have a third; but if he have brothers, then his mother shall have a sixth: all after paying a bequest he may have bequeathed or a debt. Your fathers and your sons - ye know not which of them is higher unto you in benefit: an ordinance this from Allah, verily Allah is Knowing, Wise.\n",
        "TRANSLATION_11": "Allah enjoins you concerning your children: for the male shall be the like of the share of two females, and if there be [two or] more than two females, then for them shall be two-thirds of what he leaves; but if she be alone, then for her shall be a half; and for each of his parents a sixth of what he leaves, if he has children; but if he has no children, and his parents are his [sole] heirs, then it shall be a third for his mother; but if he has brothers, then a sixth for his mother, after [paying off] any bequest he may have made or any debt [he may have incurred]. Your parents and your children—you do not know which of them is likelier to be beneficial for you. This is an ordinance from Allah. Indeed Allah is all-knowing, all-wise.\n",
        "TRANSLATION_12": "Allah (thus) directs you as regards your Children's (Inheritance): to the male, a portion equal to that of two females: if only daughters, two or more, their share is two-thirds of the inheritance; if only one, her share is a half. For parents, a sixth share of the inheritance to each, if the deceased left children; if no children, and the parents are the (only) heirs, the mother has a third; if the deceased Left brothers (or sisters) the mother has a sixth. (The distribution in all cases ('s) after the payment of legacies and debts. Ye know not whether your parents or your children are nearest to you in benefit. These are settled portions ordained by Allah; and Allah is All-knowing, Al-wise.\n",
        "TRANSLATION_13": "Allah commands you as regards your children's (inheritance); to the male, a portion equal to that of two females; if (there are) only daughters, two or more, their share is two thirds of the inheritance; if only one, her share is half. For parents, a sixth share of inheritance to each if the deceased left children; if no children, and the parents are the (only) heirs, the mother has a third; if the deceased left brothers or (sisters), the mother has a sixth. (The distribution in all cases is) after the payment of legacies he may have bequeathed or debts. You know not which of them, whether your parents or your children, are nearest to you in benefit, (these fixed shares) are ordained by Allah. And Allah is Ever All-Knower, All-Wise.\n",
        "TRANSLATION_14": "Allah charges you concerning your children, for a male like the share of two females. If they are women, above two, they shall have two thirds of what he left, but if she is one, then to her a half. While for his parents, to each one of the two a sixth of what he left, if he has a child. But if he has no child and his heirs are his parents, his mother shall have a third. If he has siblings, to his mother a sixth after any bequest he had bequeathed, or any debt. Your fathers and your children, you do not know which of them is nearer in benefit to you. This is an obligation from Allah. Surely, Allah is the Knower, the Wise.\n",
        "TRANSLATION_15": "God instructs you regarding your children: The male receives the equivalent of the share of two females. If they are daughters, more than two, they get two-thirds of what he leaves. If there is only one, she gets one-half. As for the parents, each gets one-sixth of what he leaves, if he had children. If he had no children, and his parents inherit from him, his mother gets one-third. If he has siblings, his mother gets one-sixth. After fulfilling any bequest and paying off debts. Your parents and your children—you do not know which are closer to you in welfare. This is God's Law. God is Knowing and Judicious.\n",
        "TRANSLATION_16": "Allah instructs you concerning your children: for the male, what is equal to the share of two females. But if there are [only] daughters, two or more, for them is two thirds of one's estate. And if there is only one, for her is half. And for one's parents, to each one of them is a sixth of his estate if he left children. But if he had no children and the parents [alone] inherit from him, then for his mother is one third. And if he had brothers [or sisters], for his mother is a sixth, after any bequest he [may have] made or debt. Your parents or your children - you know not which of them are nearest to you in benefit. [These shares are] an obligation [imposed] by Allah. Indeed, Allah is ever Knowing and Wise.\n",
        "TRANSLATION_17": "[4:11] God charges you, He commands you, concerning, the matter of, your children, with what He will mention: to the male, of them, the equivalent of the portion, the lot, of two females, if there are two [women] with him, so that half the property is his, and the other half is theirs; if there is only one female with him, then she has a third, and he receives two thirds; if he is the only one, he takes it all; and if they, the offspring, be, only, women more than two, then for them two-thirds of what he, the deceased, leaves; likewise if they be two women, since in the case of two sisters, more deserving of such a share, God says, They shall receive twothirds of what he leaves [Q. 4:176]; and since a female is entitled to a third with a male, she is all the more deserving [of the same share] with a female. It is said that fawq, ‘more than’, introduces a relative clause; it is also said to guard against the wrong impression that the greater the number [of females] the greater the portion [they are entitled to], since, it is [mistakenly] thought that the entitlement of two females to twothirds derives from the fact that a female is entitled to one third when with a male; but if she, the daughter, be one (wāhidatan, is also read wāhidatun, making the kāna [construction] syntactically complete) then to her a half; and to his parents, the deceased’s, to each one of the two (li-kulli wāhidin minhumā, substitutes for the previous li-abawayhi, ‘to his parents’) the sixth of what he leaves, if he has a child, male or female: the point of the substitution is to show that they do not share the sixth [but receive one each]. [The term] ‘child’ (walad) also applies to a grandchild, and likewise ‘parent’ (abb) to a grandparent; but if he has no   child, and his heirs are his parents, alone or along with a spouse, then to his mother (read li-ummihi; also read, in both places [here and further down], li-immihi in order to avoid the cumbersome transition from a damma [‘u’] to a kasra [‘I’]) a third, of the property, or what remains after the spouse, the rest being for the father; or, if he has siblings, two or more, males or females, to his mother a sixth, and the rest for the father, and nothing for the siblings. The inheritance stipulated for those mentioned shall take place, after, the fulfilment of, any bequest that he may bequeath (read active yūsī, or passive yūsā), or, the repayment of, any debt, that he may owe. ‘Bequest’ comes before ‘debt’, even though it should only be fulfilled after the latter [has been repayed], to show that it should be taken seriously. Your parents and children (ābā’ukum wa-abnā’ukum, is the subject, its predicate being [what follows]) — you know not which of them is nearer in benefit to you, in this world and the Hereafter. It may be that one supposes his son to be beneficial to him, leaves him an inheritance, and then it turns out that the father had been the more beneficial [of the two], and vice versa. The only One with knowledge of this [reality] is God, and for this reason He has prescribed for you inheritance: a prescription from God; surely God is ever Knowing, of His creation, Wise, in what He has ordained for them, that is to say, He is ever possessed of such attributes.\n",
        "TRANSLATION_18": "Allah then exposited the share of the male and female in inheritance, saying: (Allah chargeth you) Allah expounds to you (concerning your children) concerning the inheritance of your children after you die: (to the male the equivalent of the portion of two females) the share of two females, (and if there be women) blood daughters (more than two) two or more daughters, (then theirs is two-thirds of the inheritance, and if there be one) daughter ((only) then the half) of the inheritance. (And to his parents a sixth of the inheritance, if he) the deceased person (have a son) or daughter; (and if he) the deceased person (have no son) or daughter (and his parents are his heirs, then to his mother appertaineth the third) and the reminder is the share of the father; (and if he) the deceased person (have brethren) full brothers or half brothers from either the father or the mother, (then to his mother appertaineth the sixth, after any legacy he may have bequeathed, or debt (hath been paid)) after paying the debt of the deceased and extracting any bequest which does not exceed a third of the inheritance. (Your parents or your children: Ye know not) in this world (which of them is nearer unto you in usefulness) in the Hereafter in terms of rank; it is also said that this means: you do not know which of them is nearer in usefulness in this world with regard to inheritance. (It is an injunction from Allah) upon you that you divide the estates. (Lo! Allah is Knower) in relation to the division of inheritance, (Wise) in relation to the difference between the shares of the male and female.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "4:11",
            "4:176",
            "4:12",
            "4:24",
            "4:23",
            "4:32",
            "3:61",
            "4:104",
            "2:215",
            "4:127"
        ],
        "BIBLE": [
            "prophets:ii%20kings:17:15",
            "writings:psalms:78:5",
            "writings:daniel:9:27",
            "writings:ezra:10:3",
            "torah:numbers:6:7",
            "prophets:ezekiel:35:11",
            "prophets:joshua:17:4",
            "torah:numbers:27:11",
            "writings:ezra:6:8",
            "writings:daniel:6:13"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:3:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:13",
            "Sefer%20Yetzirah:4:12"
        ]
    }
}