{
    "VERSE": "4:111",
    "ARABIC": "وَمَن يَكْسِبْ إِثْمًا فَإِنَّمَا يَكْسِبُهُۥ عَلَىٰ نَفْسِهِۦ وَكَانَ ٱللَّهُ عَلِيمًا حَكِيمًا",
    "ENGLISH": {
        "TRANSLATION_0": "If anyone commits an evil action the responsibility for it is his alone. Allah is All-Knowing, All-Wise.",
        "TRANSLATION_1": "He who earns the wages of sin does so for himself; and God is aware of everything and is wise.\n",
        "TRANSLATION_2": "He who commits a sin, commits it only to his detriment. Surely Allah is All-Knowing, All-Wise.\n",
        "TRANSLATION_3": "One who commits sins has committed them against his own soul. God is All-knowing and All-wise.\n",
        "TRANSLATION_4": "And whoever earns sin, his earnings will only be against himself; and Allah is the Knowing, Wise.\n",
        "TRANSLATION_5": "And whoever earns sin, he earns it only against himself. And Allah is Ever All-Knowing, All-Wise.\n",
        "TRANSLATION_6": "And whoever commits a sin, he only commits it against his own soul; and Allah is Knowing, Wise.\n",
        "TRANSLATION_7": "And whosoever earns a sin, earns it against himself only; and God is ever All-knowing, All-wise.\n",
        "TRANSLATION_8": "Whoso committeth sin committeth it only against himself. Allah is ever Knower, Wise.\n",
        "TRANSLATION_9": "He who commits sin does so against his own soul. God is all knowing and wise.\n",
        "TRANSLATION_10": "And whosoever earnoth a sin, only against his own soul he earnoth it; and Allah is ever Knowing, Wise.\n",
        "TRANSLATION_11": "Whoever commits a sin, commits it only against himself; and Allah is all-knowing, all-wise.\n",
        "TRANSLATION_12": "And if any one earns sin. he earns it against His own soul: for Allah is full of knowledge and wisdom.\n",
        "TRANSLATION_13": "And whoever earns sin, he earns it only against himself. And Allah is Ever All-Knowing, All-Wise.\n",
        "TRANSLATION_14": "Whosoever earns a sin, he only earns it against himself. Allah is the Knower, the Wise.\n",
        "TRANSLATION_15": "And Whoever earns a sin, earns it against himself. God is Aware and Wise.\n",
        "TRANSLATION_16": "And whoever commits a sin only earns it against himself. And Allah is ever Knowing and Wise.\n",
        "TRANSLATION_17": "[4:111] And whoever commits a sin commits it against himself only, since the evil consequences fall on him, harming no one else; and God is ever Knower, Wise, in His actions.\n",
        "TRANSLATION_18": "(Whoso commiteth a sin) steals and falsely swears by Allah (commiteth it only against himself) he only earns the punishment of that sin. (Allah is ever Knower) of the one who stole the armour, (Wise) by commanding that his hand be cut.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "4:111",
            "29:6",
            "2:181",
            "76:30",
            "31:12",
            "35:8",
            "4:107",
            "4:26",
            "24:18",
            "12:83"
        ],
        "BIBLE": [
            "writings:proverbs:19:2",
            "writings:proverbs:19:8",
            "writings:proverbs:29:24",
            "writings:psalms:66:16",
            "writings:proverbs:14:6",
            "prophets:ezekiel:33:16",
            "writings:psalms:62:6",
            "writings:psalms:62:2",
            "torah:exodus:35:31",
            "prophets:ezekiel:18:27"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:2:2",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:3:7",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:1"
        ]
    }
}