{
    "VERSE": "4:113",
    "ARABIC": "وَلَوْلَا فَضْلُ ٱللَّهِ عَلَيْكَ وَرَحْمَتُهُۥ لَهَمَّت طَّآئِفَةٌ مِّنْهُمْ أَن يُضِلُّوكَ وَمَا يُضِلُّونَ إِلَّآ أَنفُسَهُمْ وَمَا يَضُرُّونَكَ مِن شَىْءٍ وَأَنزَلَ ٱللَّهُ عَلَيْكَ ٱلْكِتَٰبَ وَٱلْحِكْمَةَ وَعَلَّمَكَ مَا لَمْ تَكُن تَعْلَمُ وَكَانَ فَضْلُ ٱللَّهِ عَلَيْكَ عَظِيمًا",
    "ENGLISH": {
        "TRANSLATION_0": "Were it not for Allah's favour to you and His mercy, a group of them would almost have managed to the Book and Wisdom to you and taught you what you did not know before. Allah's favour to you is indeed immense.",
        "TRANSLATION_1": "But for the mercy of God and His grace you would certainly have been misled by a section of them; yet they could not mislead you but themselves alone, and could do you no harm, for God has revealed to you the Book and the Law, and taught you what you did not know. Great have been the blessings of God on you.\n",
        "TRANSLATION_2": "(O Messenger!) But for Allah's favour and mercy upon you, a party of them had resolved to mislead you, yet they only misled them selves, and could not have harmed you in any way. Allah revealed to you the Book and Wisdom, and He taught you what you knew not. Great indeed has been Allah's favour upon you.\n",
        "TRANSLATION_3": "Were it not for the favor and mercy of God, some of them would have certainly tried to make you (Muhammad) go astray. However, they cannot lead any one astray but themselves nor can they harm you. God has revealed the Book to you, has given you wisdom, and has taught you what you did not know. Certainly God's favor to you has been great.\n",
        "TRANSLATION_4": "And O dear Prophet, were it not for Allah’s munificence and His mercy upon you, a group among them would have wished to deceive you; and they only mislead themselves and will not harm you at all; and Allah has sent down upon you the Book and wisdom, and taught you all what you did not know*; and upon you is Allah’s great munificence. (Allah gave the knowledge of the hidden to the Holy Prophet – peace and blessings be upon him.)\n",
        "TRANSLATION_5": "Had not the grace of Allah and His mercy been upon you, a party of them would certainly have made a decision to mislead you, but they mislead none except their own selves, and no harm can they do to you in the least. Allah has sent down to you the Book, and the Hikmah, and taught you that which you knew not. And ever great is the grace of Allah unto you.\n",
        "TRANSLATION_6": "And were it not for Allah's grace upon you and His mercy a party of them had certainly designed to bring you to perdition and they do not bring (aught) to perdition but their own souls, and they shall not harm you in any way, and Allah has revealed to you the Book and the wisdom, and He has taught you what you did not know, and Allah's grace on you is very great.\n",
        "TRANSLATION_7": "But for God's bounty to thee and His mercy a party of them purposed to lead thee astray; but they lead only themselves astray; they do not hurt thee in anything. God has sent down on thee the Book and the Wisdom, and He has taught thee that thou knewest not; God's' bounty to thee is ever great.\n",
        "TRANSLATION_8": "But for the grace of Allah upon thee (Muhammad), and His mercy, a party of them had resolved to mislead thee, but they will mislead only themselves and they will hurt thee not at all. Allah revealeth unto thee the Scripture and wisdom, and teacheth thee that which thou knewest not. The grace of Allah toward thee hath been infinite.\n",
        "TRANSLATION_9": "If it were not for the grace of God and His mercy to you, some of them had resolved to lead you astray but they lead astray no one but themselves. Nor can they do you any harm. God has sent down to you the Book and Wisdom and has taught you what you did not know. God's favour to you has been great indeed.\n",
        "TRANSLATION_10": "Were not the grace of Allah on thee and His mercy, a party of them had surely resolved to mislead thee; whereas they mislead not but themselves, and they shall not hurt thee in aught. And Allah hath sent down unto thee the Book and wisdom, and hath taught thee that which thou knowest not; and the grace of Allah on thee is ever mighty.\n",
        "TRANSLATION_11": "Were it not for Allah’s grace and His mercy on you, a group of them were bent on leading you astray; but they do not mislead anyone except themselves, and they cannot do you any harm. Allah has sent down to you the Book and wisdom, and He has taught you what you did not know, and great is Allah’s grace upon you.\n",
        "TRANSLATION_12": "But for the Grace of Allah to thee and his Mercy, a party of them would certainly have plotted to lead thee astray. But (in fact) they will only Lead their own souls astray, and to thee they can do no harm in the least. For Allah hath sent down to thee the Book and wisdom and taught thee what thou Knewest not (before): And great is the Grace of Allah unto thee.\n",
        "TRANSLATION_13": "Had not the Grace of Allah and His Mercy been upon you (O Muhammad SAW), a party of them would certainly have made a decision to mislead you, but (in fact) they mislead none except their own selves, and no harm can they do to you in the least. Allah has sent down to you the Book (The Quran), and Al-Hikmah (Islamic laws, knowledge of legal and illegal things i.e. the Prophet's Sunnah - legal ways), and taught you that which you knew not. And Ever Great is the Grace of Allah unto you (O Muhammad SAW).\n",
        "TRANSLATION_14": "But for the Favor of Allah to you (Prophet Muhammad) and His Mercy, a party of them intended to lead you astray, but they only lead themselves astray, and they did not harm you a thing. Allah has sent down to you the Book and the Wisdom and He has taught you what you did not know. The Bounty of Allah to you is ever great.\n",
        "TRANSLATION_15": "Were it not for God’s grace towards you, and His mercy, a faction of them would have managed to mislead you. But they only mislead themselves, and they cannot harm you in any way. God has revealed to you the Scripture and wisdom, and has taught you what you did not know. God’s goodness towards you is great.\n",
        "TRANSLATION_16": "And if it was not for the favor of Allah upon you, [O Muhammad], and His mercy, a group of them would have determined to mislead you. But they do not mislead except themselves, and they will not harm you at all. And Allah has revealed to you the Book and wisdom and has taught you that which you did not know. And ever has the favor of Allah upon you been great.\n",
        "TRANSLATION_17": "[4:113] Were it not for God’s bounty to you, O Muhammad (s), and His mercy, by way of protecting you, a party of them, of Tu‘ma’s clan, would have intended, [would have] conspired, to lead you astray, from judging with   truth by deceiving you; but they lead only themselves astray; they will not hurt you at all, since the evil consequence of their leading you astray would have fallen on them. God has revealed to you the Book, the Qur’ān, and wisdom, the rulings contained therein, and He has taught you what you did not know, of rulings and the Unseen; and God’s bounty to you, in this and other respects, is ever great.\n",
        "TRANSLATION_18": "(But for the grace of Allah upon thee (Muhammad)) by bestowing upon you prophethood, (and His mercy) by sending Gabriel to you, (a party of them) of the clan of Tu'mah (had resolved) wanted and was planning (to mislead thee) in issuing the right judgement, (but they will mislead only themselves) regarding the judgement (and they will hurt thee not at all) because the hurt will befall those who committed perjury. (Allah revealeth unto thee the Scripture) He has sent you Gabriel with the Qur'an (and wisdom) expositing in it the lawful and the unlawful as well judicial decision (qada'), (and teacheth thee) by means of the Qur'an, legal rulings and legal punishments (that which thou knewest not) before the revelation of the Qur'an. (The grace of Allah towards you) by bestowing upon you prophethood (hath been infinite).\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "4:113",
            "2:105",
            "57:29",
            "4:54",
            "24:14",
            "3:74",
            "3:164",
            "3:69",
            "2:64",
            "2:251"
        ],
        "BIBLE": [
            "prophets:isaiah:42:16",
            "writings:daniel:2:23",
            "prophets:isaiah:43:19",
            "writings:daniel:6:13",
            "prophets:joshua:1:8",
            "torah:leviticus:17:11",
            "writings:daniel:5:15",
            "prophets:nahum:1:14",
            "torah:leviticus:10:17",
            "prophets:ii%20samuel:22:36"
        ]
    }
}