{
    "VERSE": "4:115",
    "ARABIC": "وَمَن يُشَاقِقِ ٱلرَّسُولَ مِنۢ بَعْدِ مَا تَبَيَّنَ لَهُ ٱلْهُدَىٰ وَيَتَّبِعْ غَيْرَ سَبِيلِ ٱلْمُؤْمِنِينَ نُوَلِّهِۦ مَا تَوَلَّىٰ وَنُصْلِهِۦ جَهَنَّمَ وَسَآءَتْ مَصِيرًا",
    "ENGLISH": {
        "TRANSLATION_0": "But if anyone opposes the Messenger after the guidance has become clear to him, and follows other than the path of the muminun, We will hand him over to whatever he has turned to, and We will roast him in Hell. What an evil destination!",
        "TRANSLATION_1": "And he who opposes the Prophet even after the way has become clear to him, and follows a path other than the way of believers, We shall lead him to what he has chosen for himself, and shall take him to Hell: How evil a journey's end.\n",
        "TRANSLATION_2": "As for him who sets himself against the Messenger and follows a path other than that of the believers even after true guidance had become clear to him, We will let him go to the way he has turned to, and We will cast him into Hell - an evil destination.\n",
        "TRANSLATION_3": "Whoever gives the Messenger a hard time, even after having received clear guidance, and follows a path other than that of the believers, will be left alone. We will cast him into hell, a terrible destination.\n",
        "TRANSLATION_4": "And whoever opposes the Noble Messenger after the right path has been made clear to him, and follows a way other than that of the Muslims, We shall leave him as he is, and put him in hell; and what a wretched place to return!\n",
        "TRANSLATION_5": "And whoever contradicts and opposes the Messenger after the right path has been shown clearly to him, and follows other than the believers' way, We shall keep him in the path he has chosen, and burn him in Hell what an evil destination!\n",
        "TRANSLATION_6": "And whoever acts hostilely to the Apostle after that guidance has become manifest to him, and follows other than the way of the believers, We will turn him to that to which he has (himself) turned and make him enter hell; and it is an evil resort.\n",
        "TRANSLATION_7": "But whoso makes a breach with the Messenger after the guidance has become clear to him and follows a way other than the believers', him We shall turn over to what he has turned to and We shall roast him in Gehenna - an evil homecoming!\n",
        "TRANSLATION_8": "And whoso opposeth the messenger after the guidance (of Allah) hath been manifested unto him, and followeth other than the believer's way, We appoint for him that unto which he himself hath turned, and expose him unto hell - a hapless journey's end!\n",
        "TRANSLATION_9": "But if anyone opposes the Messenger after his guidance has become clear to him, and follows a path other than that of the faithful, We shall let him pursue his chosen path and shall cast him into Hell: an evil destination.\n",
        "TRANSLATION_10": "And whosoever opposeth the apostle after the truth hath become manifest unto him, and followeth other way than that of the believers, We shall let him follow that to which he hath turned, and shall roast him in Hell - an evil retreat!\n",
        "TRANSLATION_11": "Whoever defies the Apostle, after the guidance has become manifest to him, and follows a way other than that of the faithful, We shall abandon him to his devices and We shall make him enter hell, and it is an evil destination.\n",
        "TRANSLATION_12": "If anyone contends with the Messenger even after guidance has been plainly conveyed to him, and follows a path other than that becoming to men of Faith, We shall leave him in the path he has chosen, and land him in Hell,- what an evil refuge!\n",
        "TRANSLATION_13": "And whoever contradicts and opposes the Messenger (Muhammad SAW) after the right path has been shown clearly to him, and follows other than the believers' way. We shall keep him in the path he has chosen, and burn him in Hell - what an evil destination.\n",
        "TRANSLATION_14": "But whosoever opposes the Messenger after guidance has been made clear to him and follows a path other than that of the believers, We shall let him follow what he has turned to and We shall roast him in Gehenna (Hell) an evil arrival.\n",
        "TRANSLATION_15": "Whoever makes a breach with the Messenger, after the guidance has become clear to him, and follows other than the path of the believers, We will direct him in the direction he has chosen, and commit him to Hell—what a terrible destination!\n",
        "TRANSLATION_16": "And whoever opposes the Messenger after guidance has become clear to him and follows other than the way of the believers - We will give him what he has taken and drive him into Hell, and evil it is as a destination.\n",
        "TRANSLATION_17": "[4:115] But whoever makes a breach with, [whoever] opposes, the Messenger, in the truth that he brings, after guidance has become clear to him, [after] the truth has become manifest to him through miracles, and follows, a path, other than the way of the believers, that is to say, [other than] the path they follow in religion, by disbelieving, We shall turn him over to what he has turned to, We shall make him a leader of the misguidance which he has followed, by leaving this as it is between them in this world, and We shall expose him, We shall admit him in the Hereafter, in Hell, where he will burn — an evil journey’s end, an [evil] return it is.\n",
        "TRANSLATION_18": "(And whoso opposeth the messenger) regarding Allah's divine Oneness and his judgement, i.e. Tu'mah (after the guidance (of Allah) hath been manifested unto him, and followth other than the believer's way) and prefers the religion of the people of Mecca, idolatry, over the religion of the believers, (We appoint for him that unto which he himself hath turned) We shall leave him to that which he has chosen in this world, (and expose him unto hell) in the Hereafter (a hapless journey's end) will be his ultimate consequence!\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "4:115",
            "47:32",
            "42:44",
            "47:25",
            "50:31",
            "42:41",
            "5:99",
            "9:105",
            "61:9",
            "14:30"
        ],
        "BIBLE": [
            "prophets:i%20kings:5:23",
            "prophets:jeremiah:50:9",
            "prophets:ezekiel:18:8",
            "torah:leviticus:10:17",
            "torah:genesis:3:6",
            "prophets:i%20samuel:21:7",
            "prophets:jeremiah:35:15",
            "prophets:jeremiah:24:9",
            "prophets:judges:20:36",
            "prophets:isaiah:42:16"
        ]
    }
}