{
    "VERSE": "4:117",
    "ARABIC": "إِن يَدْعُونَ مِن دُونِهِۦٓ إِلَّآ إِنَٰثًا وَإِن يَدْعُونَ إِلَّا شَيْطَٰنًا مَّرِيدًا",
    "ENGLISH": {
        "TRANSLATION_0": "What they call on apart from Him are female idols. What they call on is an arrogant shaytan",
        "TRANSLATION_1": "In His place they invoke only females (the pagan deities); and instead of Him they invoke Satan the obstinate rebel\n",
        "TRANSLATION_2": "Rather than call upon Him, they call upon goddesses, and call upon a rebellious Satan\n",
        "TRANSLATION_3": "They (the pagans) only worship idols and Satan, the persistent rebel.\n",
        "TRANSLATION_4": "The polytheists do not worship Allah, except some females; and they do not worship anyone except the rebellious Satan.\n",
        "TRANSLATION_5": "They invoke nothing but female deities besides Him (Allah), and they invoke nothing but Shaytan, a persistent rebel!\n",
        "TRANSLATION_6": "They do not call besides Him on anything but idols, and they do not call on anything but a rebellious Shaitan.\n",
        "TRANSLATION_7": "In stead of Him, they pray not except to female beings; they pray not except to a rebel Satan accursed by God.\n",
        "TRANSLATION_8": "They invoke in His stead only females; they pray to none else than Satan, a rebel\n",
        "TRANSLATION_9": "They [the polytheists] call upon female deities, and they invoke none but Satan, the rebellious one,\n",
        "TRANSLATION_10": "They invoke beside Him but females, and they invoke not but a Satan rebellious.\n",
        "TRANSLATION_11": "They invoke none but females besides Him, and invoke none but a froward Satan,\n",
        "TRANSLATION_12": "(The Pagans), leaving Him, call but upon female deities: They call but upon satan the persistent rebel!\n",
        "TRANSLATION_13": "They (all those who worship others than Allah) invoke nothing but female deities besides Him (Allah), and they invoke nothing but Shaitan (Satan), a persistent rebel!\n",
        "TRANSLATION_14": "Instead of Him they supplicate to none but females, and indeed they supplicate to none except the rebellious satan,\n",
        "TRANSLATION_15": "They invoke in His stead only females. In fact, they invoke none but a rebellious devil.\n",
        "TRANSLATION_16": "They call upon instead of Him none but female [deities], and they [actually] call upon none but a rebellious Satan.\n",
        "TRANSLATION_17": "[4:117] What (in, is [to be understand as] mā, ‘only’) they pray to, [what] the idolaters worship, instead of Him, God, that is, other than Him, are but females, idols with feminine names, such as al-Lāt, al-‘Uzza and Manāt; and they (in, is [to be understand as] mā, ‘only’) only pray to, they [only] worship, by worshipping [these female idols], a rebellious satan, one who has rebelled against obedience [to God], for they are obeying him in this [worship of female idols].\n",
        "TRANSLATION_18": "(They invoke in His stead) the people of Mecca worship in place of Allah (only females) lifeless idols such as 101 al-Lat, al-'Uzza and Manat; (they pray to) they worship (none else than Satan, a rebel) who is intense in his rebellion\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "4:117",
            "21:82",
            "81:25",
            "4:120",
            "43:86",
            "43:62",
            "36:74",
            "72:22",
            "16:20",
            "10:38"
        ],
        "BIBLE": [
            "prophets:zephaniah:2:11",
            "writings:job:18:21",
            "torah:genesis:50:19",
            "writings:ecclesiastes:10:4",
            "prophets:jeremiah:14:13",
            "prophets:ii%20kings:18:22",
            "writings:ii%20chronicles:6:21",
            "prophets:isaiah:36:7",
            "torah:genesis:20:11",
            "prophets:i%20kings:8:30"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:3:7",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:3"
        ]
    }
}