{
    "VERSE": "4:12",
    "ARABIC": "وَلَكُمْ نِصْفُ مَا تَرَكَ أَزْوَٰجُكُمْ إِن لَّمْ يَكُن لَّهُنَّ وَلَدٌ فَإِن كَانَ لَهُنَّ وَلَدٌ فَلَكُمُ ٱلرُّبُعُ مِمَّا تَرَكْنَ مِنۢ بَعْدِ وَصِيَّةٍ يُوصِينَ بِهَآ أَوْ دَيْنٍ وَلَهُنَّ ٱلرُّبُعُ مِمَّا تَرَكْتُمْ إِن لَّمْ يَكُن لَّكُمْ وَلَدٌ فَإِن كَانَ لَكُمْ وَلَدٌ فَلَهُنَّ ٱلثُّمُنُ مِمَّا تَرَكْتُم مِّنۢ بَعْدِ وَصِيَّةٍ تُوصُونَ بِهَآ أَوْ دَيْنٍ وَإِن كَانَ رَجُلٌ يُورَثُ كَلَٰلَةً أَوِ ٱمْرَأَةٌ وَلَهُۥٓ أَخٌ أَوْ أُخْتٌ فَلِكُلِّ وَٰحِدٍ مِّنْهُمَا ٱلسُّدُسُ فَإِن كَانُوٓا۟ أَكْثَرَ مِن ذَٰلِكَ فَهُمْ شُرَكَآءُ فِى ٱلثُّلُثِ مِنۢ بَعْدِ وَصِيَّةٍ يُوصَىٰ بِهَآ أَوْ دَيْنٍ غَيْرَ مُضَآرٍّ وَصِيَّةً مِّنَ ٱللَّهِ وَٱللَّهُ عَلِيمٌ حَلِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "You receive half of what your wives leave if they are childless. If they have children you receive a quarter of what they leave after any bequest they make or any debts. They receive a quarter of what you leave if you are childless. If you have children they receive an eighth of what you leave after any bequest you make or any debts. If a man or woman has no direct heirs, but has a brother or sister, each of them receives a sixth. If there are more than that they share in a third after any bequest you make or any debts, making sure that no one's rights are prejudiced. This is an instruction from Allah. Allah is All-Knowing, All-Forbearing.",
        "TRANSLATION_1": "Your share in the property the wives leave behind is half if they die without an issue, but in case they have left children, then your share is one-fourth after the payment of legacies and debts; and your wife shall inherit one-fourth of what you leave at death if you die childless, if not, she will get one-eighth of what you leave behind after payment of legacies and debts. If a man or a woman should die without leaving either children or parents behind but have brother and sister, they shall each inherit one-sixth. In case there are more, they will share one-third of the estate after payment of legacies and debts without prejudice to others. This is the decree of God who knows all and is kind.\n",
        "TRANSLATION_2": "And to you belongs half of whatever has been left behind by your wives if they die childless; but if they have any children then to you belongs a fourth of what they have left behind, after payment of the bequest they might have made or any debts outstanding against them. And to them belongs a fourth of what you leave behind, if you die childless; and if you have any child then to them belongs one-eighth of what you have left behind, after the payment of the bequest you might have made or any debts outstanding against you. And if the man or woman has no heir in the direct line, but has a brother or sister, then each of these shall inherit one-sixth; but if they are more than two, then they shall inherit one-third of the inheritance, after the payment of the bequest that might have been made or any debts outstanding against the deceased, providing that the bequest causes no injury. This is a commandment from Allah; Allah is All-Knowing, All-Forbearing.\n",
        "TRANSLATION_3": "If your wives die without any surviving children, you will inherit half of their legacy. If they have children, you will inherit one-fourth of their legacy after the debts and things bequeathed have been excluded from the legacy. After the payment of debts and things bequeathed have been excluded from the legacy, your wives will inherit one-fourth of your legacy if you have no surviving children. If you leave a child, they will inherit one eighth of your legacy. If the deceased, either male or female, has no surviving heirs such as parents or children but has a brother or a sister, the brother or sister will each inherit one-sixth of the legacy. If there are more than just a brother or a sister, they will share one-third of the legacy. This is after the payment of any debts and things bequeathed have been excluded from the legacy, so that no one will be caused to suffer any loss. It is a guide from God, the All-knowing and Forbearing.\n",
        "TRANSLATION_4": "And from what your wives leave, half is for you if they do not have any child; or if they have a child for you is a fourth of what they leave, after any will they may have made or debt to be paid; and to the women is a fourth of what you leave behind, if you do not have any child; or if you have a child then an eighth of what you leave behind, after any will you may have made, or debt to be paid; and if a deceased does not leave behind a mother, father or children but has a brother or a sister through a common mother, then to each of them a sixth; and if they (brothers and sisters) are more than two, then they shall all share in a third, after any will that may have been made or debt to be paid, in which the deceased has not caused a loss (to the heirs); this is the decree of Allah; and Allah is All Knowing, Most Forbearing.\n",
        "TRANSLATION_5": "In that which your wives leave, your share is half if they have no child; but if they leave a child, you get a fourth of that which they leave after payment of legacies that they may have bequeathed or debts. In that which you leave, their (your wives) share is a fourth if you leave no child; but if you leave a child, they get an eighth of that which you leave after payment of legacies that you may have bequeathed or debts. If the man or woman whose inheritance is in Kalalah has left neither ascendants nor descendants, but has left a brother or a sister, each one of the two gets a sixth; but if more than two, they share in a third; after payment of legacies he (or she) may have bequeathed or debts, so that no loss is caused (to anyone). This is a Commandment from Allah; and Allah is Ever All-Knowing, Most Forbearing.\n",
        "TRANSLATION_6": "And you shall have half of what your wives leave if they have no child, but if they have a child, then you shall have a fourth of what they leave after (payment of) any bequest they may have bequeathed or a debt; and they shall have the fourth of what you leave if you have no child, but if you have a child then they shall have the eighth of what you leave after (payment of) a bequest you may have bequeathed or a debt; and if a man or a woman leaves property to be inherited by neither parents nor offspring, and he (or she) has a brother or a sister, then each of them two shall have the sixth, but if they are more than that, they shall be sharers in the third after (payment of) any bequest that may have been bequeathed or a debt that does not harm (others); this is an ordinance from Allah: and Allah is Knowing, Forbearing.\n",
        "TRANSLATION_7": "And for you a half of what your wives leave, if they have no children; but if they have children, then for you of what they leave a fourth, after any bequest they may bequeath, or any debt. And for them a fourth of what you leave, if you have no children; but if you have children, then for them of what you leave an eighth, after any bequest you may bequeath, or any debt. If a man or a woman have no heir direct, but have a brother or a sister, to each of the two a sixth; but if they are more numerous than that, they share equally a third, after any bequest he may bequeath, or any debt not prejudicial; a charge from God. God is All-knowing, All-clement.\n",
        "TRANSLATION_8": "And unto you belongeth a half of that which your wives leave, if they have no child; but if they have a child then unto you the fourth of that which they leave, after any legacy they may have bequeathed, or debt (they may have contracted, hath been paid). And unto them belongeth the fourth of that which ye leave if ye have no child, but if ye have a child then the eighth of that which ye leave, after any legacy ye may have bequeathed, or debt (ye may have contracted, hath been paid). And if a man or a woman have a distant heir (having left neither parent nor child), and he (or she) have a brother or a sister (only on the mother's side) then to each of them twain (the brother and the sister) the sixth, and if they be more than two, then they shall be sharers in the third, after any legacy that may have been bequeathed or debt (contracted) not injuring (the heirs by willing away more than a third of the heritage) hath been paid. A commandment from Allah. Allah is Knower, Indulgent.\n",
        "TRANSLATION_9": "You will inherit half of what your wives leave, provided they have left no children. But if they leave children then you inherit a quarter of what they leave, after payment of any bequests they may have made or any debts they may have incurred. Your wives shall inherit one quarter of what you leave if you are childless. But if you leave children, your wives shall inherit one eighth, after payment of any bequest or debts. If a man or woman has no direct heirs [neither children or parents] but has left a brother or a sister, they shall each inherit one sixth, but if they are more than two, they share one third between them, after payment of any bequests or debts, so that no harm is done to anyone. That is a commandment from God: God is all knowing and forbearing.\n",
        "TRANSLATION_10": "And ye will have half of that which your wives may leave, if they have no Child, but if they have a child then ye shall have one- fourth of that which they may leave, after paying a bequest they may have bequeathed or a debt. And they shall have one-fourth of that which ye may leaves if ye have no child; but if ye have a child then they will have one-eighth of that which ye may leave, after paying a bequest ye may have bequeathed or a debt. And if a man or a woman who leaveth the heritage hath no direct heirs but hath a brother or a sister, each of the twain will have a sixth; and if more than one, then they will have equal shares in one third after paying a bequest they may have bequeathed or a debt without prejudice: an ordinance this from Allah; and Allah Is Knowing, Forbearing.\n",
        "TRANSLATION_11": "For you shall be a half of what your wives leave, if they have no children; but if they have children, then for you shall be a fourth of what they leave, after [paying off] any bequest they may have made or any debt [they may have incurred]. And for them [it shall be] a fourth of what you leave, if you have no children; but if you have children, then for them shall be an eighth of what you leave, after [paying off] any bequest you may have made or any debt [you may have incurred]. If a man or woman is inherited by siblings and has a brother or a sister, then each of them shall receive a sixth; but if they are more than that, then they shall share in one third, after [paying off] any bequest he may have made or any debt [he may have incurred] without prejudice. [This is] an enjoinment from Allah, and Allah is all-knowing, all-forbearing.\n",
        "TRANSLATION_12": "In what your wives leave, your share is a half, if they leave no child; but if they leave a child, ye get a fourth; after payment of legacies and debts. In what ye leave, their share is a fourth, if ye leave no child; but if ye leave a child, they get an eighth; after payment of legacies and debts. If the man or woman whose inheritance is in question, has left neither ascendants nor descendants, but has left a brother or a sister, each one of the two gets a sixth; but if more than two, they share in a third; after payment of legacies and debts; so that no loss is caused (to any one). Thus is it ordained by Allah; and Allah is All-knowing, Most Forbearing.\n",
        "TRANSLATION_13": "In that which your wives leave, your share is a half if they have no child; but if they leave a child, you get a fourth of that which they leave after payment of legacies that they may have bequeathed or debts. In that which you leave, their (your wives) share is a fourth if you leave no child; but if you leave a child, they get an eighth of that which you leave after payment of legacies that you may have bequeathed or debts. If the man or woman whose inheritance is in question has left neither ascendants nor descendants, but has left a brother or a sister, each one of the two gets a sixth; but if more than two, they share in a third; after payment of lagacies he (or she) may have bequeathed or debts, so that no loss is caused (to anyone). This is a Commandment from Allah; and Allah is Ever All-Knowing, Most-Forbearing.\n",
        "TRANSLATION_14": "For you half of what your wives leave if they have no child. If they have a child, a quarter of what they leave shall be yours after any bequest she had bequeathed, or any debt. And for them (the females) they shall inherit one quarter of what you leave if you have no child. If you have a child, they shall inherit one eighth, after any bequest you had bequeathed, or any debt. If a man or a woman have no direct heirs, but have a brother or a sister, to each of the two a sixth. If they are more than that, they shall equally share the third, after any bequest that he had bequeathed or any debt without harm. This is an obligation from Allah. He is the Knower, the Clement.\n",
        "TRANSLATION_15": "You get one-half of what your wives leave behind, if they had no children. If they had children, you get one-fourth of what they leave. After fulfilling any bequest and paying off debts. They get one-fourth of what you leave behind, if you have no children. If you have children, they get one-eighth of what you leave. After fulfilling any bequest and paying off debts. If a man or woman leaves neither parents nor children, but has a brother or sister, each of them gets one-sixth. If there are more siblings, they share one-third. After fulfilling any bequest and paying off debts, without any prejudice. This is a will from God. God is Knowing and Clement.\n",
        "TRANSLATION_16": "And for you is half of what your wives leave if they have no child. But if they have a child, for you is one fourth of what they leave, after any bequest they [may have] made or debt. And for the wives is one fourth if you leave no child. But if you leave a child, then for them is an eighth of what you leave, after any bequest you [may have] made or debt. And if a man or woman leaves neither ascendants nor descendants but has a brother or a sister, then for each one of them is a sixth. But if they are more than two, they share a third, after any bequest which was made or debt, as long as there is no detriment [caused]. [This is] an ordinance from Allah, and Allah is Knowing and Forbearing.\n",
        "TRANSLATION_17": "[4:12] And for you a half of what your wives leave, if they have no children, from you or from another; but if they have children, then for you a fourth of what they leave, after any bequest they may bequeath, or any debt: the consensus is that the grandchild in this case is like the child. And for them, the wives, whether one or more, a fourth of what you leave, if you have no children; but if you have children, from them or from others, then for them an eighth of what you leave, after any bequest you may bequeath, or any debt; again the consensus is that the grandchild is as the child. If it be a man leaving an inheritance (yūrathu, ‘being inherited from’, is an adjectival qualification, the predicate of which is [the following kalālatan, ‘without direct heir’]) and not having a direct heir, that is, [having] neither a parent nor child, or it be a woman, leaving an inheritance and having no direct heir, but it be that such, a man leaving an inheritance with no direct heir, has a brother or a sister, from the same mother, as read by Ibn Mas‘ūd and others, then to each of the two a sixth, of what he leaves; but if they, the siblings from the same mother, be more than that, that is, [more] than one, then they share a third, the male and female equally, after any bequest to be bequeathed or any debt without prejudice (ghayra mudārrin, is a circumstantial qualifier referring to the person governing [the verb] yūsā, ‘to be bequeathed’) in other words, without causing any prejudice to the inheritors by bequeathing more than the third); a charge (wasiyyatan, a verbal noun reaffirming [the import of] yūsīkum, ‘He charges you’ [of the beginning of the previous verse]) from God. God is Knowing, of the obligations which He has ordained for His creatures, Forbearing, in deferring the punishment of those that disobey Him. The Sunna specifies that the individuals mentioned may receive the relevant inheritance provided that they are not barred from it on account of their having committed murder, or [their belonging to] a different religion or being slaves.\n",
        "TRANSLATION_18": "83 (And unto you belongeth a half of that which your wives leave) of property, (if they have no child) male or female, from you or from other than you; (but if they have a child then unto you the fourth of that which they leave) of property, (after any legacy they may have bequeathed, or debt) after paying back any debt that they may have contracted and extracting any bequest she may have bequeathed. (And unto them belongeth the fourth of that which ye leave) of property (if ye have no child) male or female from them or from other than them, (but if ye have a child) male or female, from them or from other than them (then the eighth of that which ye leave) of property, (after any legacy ye may have bequeathed, or debt (ye may have contracted, hath been paid)) after paying back any debt you may have contracted and extracting any bequest you may have bequeathed to someone. (And if a man) who does not have parents, children or kinsfolk related to his parents or children (or a woman) who is in the same situation (have a distant heir (having left neither parent nor child)) brothers or sisters from the mother side. It is also said that this refers to any kin other than parents and children, (and he (or she)) the deceased (have a brother or a sister) only on the mother's side (then to each of them twain (the brother and the sister) the sixth, and if they be more than two, then they shall be sharers in the third) the male and the female having equal share, (after any legacy that may have been bequeathed or debt (contracted)) after paying back any debt that the deceased may have contracted and after extracting any bequest that he may have bequeathed provided it does not exceed a third of the inheritance (not injuring) the heirs by willing away more than a third of the inheritance (hath been paid. A commandment from Allah) it is an obligation upon you from Allah that you must divide inheritance. (Allah is Knower) regarding the division of inheritance, (Indulgent) in relation to that which happens between you of ignorance and deception regarding the division of inheritance, despite of which He does not hasten His punishment upon you.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "4:12",
            "4:11",
            "4:176",
            "6:137",
            "2:240",
            "2:230",
            "4:32",
            "4:24",
            "2:282",
            "24:2"
        ],
        "BIBLE": [
            "writings:ii%20chronicles:8:14",
            "writings:ii%20chronicles:25:4",
            "prophets:i%20kings:2:3",
            "torah:deuteronomy:8:3",
            "torah:leviticus:20:17",
            "prophets:ii%20kings:14:6",
            "prophets:malachi:2:10",
            "torah:numbers:27:11",
            "prophets:ezekiel:18:17",
            "torah:genesis:2:24"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:3:6",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:3:5",
            "Sefer%20Yetzirah:4:10"
        ]
    }
}