{
    "VERSE": "4:121",
    "ARABIC": "أُو۟لَٰٓئِكَ مَأْوَىٰهُمْ جَهَنَّمُ وَلَا يَجِدُونَ عَنْهَا مَحِيصًا",
    "ENGLISH": {
        "TRANSLATION_0": "The shelter of such people will be Hell. They will find no way to escape from it.",
        "TRANSLATION_1": "For such the abode is only Hell from which they will find no escape.\n",
        "TRANSLATION_2": "For these people, their abode shall be Hell and from there they shall find no way of escape.\n",
        "TRANSLATION_3": "Such people will dwell in hell fire from which they will not be able to escape.\n",
        "TRANSLATION_4": "The destination for such is hell; they will not find any refuge from it.\n",
        "TRANSLATION_5": "The dwelling of such (people) is Hell, and they will find no way of escape from it.\n",
        "TRANSLATION_6": "These are they whose abode is hell, and they shall not find any refuge from it.\n",
        "TRANSLATION_7": "Such men -- their refuge shall be Gehenna, and they shall find no asylum from it.\n",
        "TRANSLATION_8": "For such, their habitation will be hell, and they will find no refuge therefrom.\n",
        "TRANSLATION_9": "Hell shall be their home: they shall find no refuge from it.\n",
        "TRANSLATION_10": "These: their resort shall be Hell, and they shall not find therefrom an escape.\n",
        "TRANSLATION_11": "The refuge of such shall be hell, and they will not find any escape from it.\n",
        "TRANSLATION_12": "They (his dupes) will have their dwelling in Hell, and from it they will find no way of escape.\n",
        "TRANSLATION_13": "The dwelling of such (people) is Hell, and they will find no way of escape from it.\n",
        "TRANSLATION_14": "Those, their shelter will be Gehenna (Hell), and from it they shall find no refuge.\n",
        "TRANSLATION_15": "These—their place is Hell, and they will find no escape from it.\n",
        "TRANSLATION_16": "The refuge of those will be Hell, and they will not find from it an escape.\n",
        "TRANSLATION_17": "[4:121] For such — their abode shall be Hell, and they shall find no refuge from it, no alternative [to it].\n",
        "TRANSLATION_18": "(For such) for the unbelievers, (their habitation) their dwelling (will be hell, and they will find no refuge therefrom) they will find no escape or sanctuary.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "4:121",
            "10:8",
            "56:19",
            "7:202",
            "88:11",
            "66:9",
            "18:108",
            "51:54",
            "3:197",
            "6:163"
        ],
        "BIBLE": [
            "prophets:i%20kings:8:13",
            "writings:ii%20chronicles:6:2",
            "writings:proverbs:14:26",
            "writings:job:38:19",
            "prophets:ii%20samuel:17:12",
            "torah:genesis:34:22",
            "torah:exodus:18:21",
            "torah:genesis:38:21",
            "prophets:i%20kings:8:30",
            "prophets:jeremiah:49:33"
        ]
    }
}