{
    "VERSE": "4:132",
    "ARABIC": "وَلِلَّهِ مَا فِى ٱلسَّمَٰوَٰتِ وَمَا فِى ٱلْأَرْضِ وَكَفَىٰ بِٱللَّهِ وَكِيلًا",
    "ENGLISH": {
        "TRANSLATION_0": "What is in the heavens and in the earth belongs to Allah. Allah suffices as a Guardian.",
        "TRANSLATION_1": "For all that is in the heavens and the earth belongs to God; and God is sufficient as guardian.\n",
        "TRANSLATION_2": "And to Allah belongs all that is in the heavens and all that is in the earth; and Allah suffices for help and protection.\n",
        "TRANSLATION_3": "To God belongs all that is in the heavens and the earth. God is a totally Sufficient Guardian.\n",
        "TRANSLATION_4": "And to Allah only belongs all whatever is in the heavens and all whatever is in the earth; and Allah is Sufficient as a Trustee (of affairs).\n",
        "TRANSLATION_5": "And to Allah belongs all that is in the heavens and all that is in the earth. And Allah is Ever All-Sufficient as Disposer of affairs.\n",
        "TRANSLATION_6": "And whatever is in the heavens and whatever is in the earth is Allah's, and Allah is sufficient as a Protector.\n",
        "TRANSLATION_7": "To God belongs all that is in the heavens and in the earth; God suffices for a guardian.\n",
        "TRANSLATION_8": "Unto Allah belongeth whatsoever is in the heavens and whatsoever is in the earth. And Allah is sufficient as Defender.\n",
        "TRANSLATION_9": "All that the heavens and the earth contain belongs to God; and none is as worthy of trust as God.\n",
        "TRANSLATION_10": "And Allah's is whatsoever is in the heavens and whatsoever is in the earth, and sufficeth Allah as a Champion.\n",
        "TRANSLATION_11": "To Allah belongs whatever is in the heavens and whatever is on the earth, and Allah suffices as trustee.\n",
        "TRANSLATION_12": "Yea, unto Allah belong all things in the heavens and on earth, and enough is Allah to carry through all affairs.\n",
        "TRANSLATION_13": "And to Allah belongs all that is in the heavens and all that is in the earth. And Allah is Ever All-Sufficient as a Disposer of affairs.\n",
        "TRANSLATION_14": "To Allah belongs all that is in heaven and earth. It is sufficient that Allah is a Guardian.\n",
        "TRANSLATION_15": "To God belongs everything in the heavens and everything on earth. God suffices as Manager.\n",
        "TRANSLATION_16": "And to Allah belongs whatever is in the heavens and whatever is on the earth. And sufficient is Allah as Disposer of affairs.\n",
        "TRANSLATION_17": "[4:132] To God belongs all that is in the heavens and in the earth (He has repeated this in order to reaffirm [the reason] why fear of God is necessary); God suffices as a Guardian, witnessing the fact that what is contained in them belongs to Him.\n",
        "TRANSLATION_18": "(Unto Allah belongeth whatsoever is in the heavens and whatsoever is in the earth) of created beings. (And Allah is sufficient as Defender) as Lord.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "4:132",
            "4:126",
            "3:109",
            "61:1",
            "59:1",
            "53:31",
            "3:129",
            "64:4",
            "57:1",
            "2:116"
        ],
        "BIBLE": [
            "torah:deuteronomy:10:14",
            "writings:nehemiah:9:6",
            "prophets:i%20kings:8:27",
            "prophets:joshua:1:17",
            "torah:leviticus:11:42",
            "writings:psalms:96:5",
            "writings:i%20chronicles:16:26",
            "writings:psalms:71:19",
            "writings:psalms:124:8",
            "writings:psalms:121:2"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:4:2",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:6"
        ]
    }
}