{
    "VERSE": "4:138",
    "ARABIC": "بَشِّرِ ٱلْمُنَٰفِقِينَ بِأَنَّ لَهُمْ عَذَابًا أَلِيمًا",
    "ENGLISH": {
        "TRANSLATION_0": "Give news to the hypocrites that they will have a painful punishment.",
        "TRANSLATION_1": "Give tidings to the hypocrites that painful is their doom.\n",
        "TRANSLATION_2": "Give tidings of painful chastisement to the hypocrites.\n",
        "TRANSLATION_3": "Tell the hypocrites that for them there will be a painful torment.\n",
        "TRANSLATION_4": "Give glad tidings to the hypocrites, that for them is a painful punishment.\n",
        "TRANSLATION_5": "Give to the hypocrites the tidings that there is for them a painful torment.\n",
        "TRANSLATION_6": "Announce to the hypocrites that they shall have a painful chastisement:\n",
        "TRANSLATION_7": "Give thou good tidings to the hypocrites that for them awaits a painful chastisement.\n",
        "TRANSLATION_8": "Bear unto the hypocrites the tidings that for them there is a painful doom;\n",
        "TRANSLATION_9": "Warn the hypocrites that for them there is a painful punishment.\n",
        "TRANSLATION_10": "Announce thou to the hypocrites that theirs shall be a torment afflictive.\n",
        "TRANSLATION_11": "Inform the hypocrites that there is a painful punishment for them\n",
        "TRANSLATION_12": "To the Hypocrites give the glad tidings that there is for them (but) a grievous penalty;-\n",
        "TRANSLATION_13": "Give to the hypocrites the tidings that there is for them a painful torment.\n",
        "TRANSLATION_14": "Give glad tidings to the hypocrites that for them there is a painful punishment.\n",
        "TRANSLATION_15": "Inform the hypocrites that they will have a painful punishment.\n",
        "TRANSLATION_16": "Give tidings to the hypocrites that there is for them a painful punishment -\n",
        "TRANSLATION_17": "[4:138] Give tidings to, inform, O Muhammad (s), the hypocrites that for them there is a painful chastisement, namely, the chastisement of the Fire.\n",
        "TRANSLATION_18": "Allah then said about the hypocrites: (Bear unto the hypocrites) 'Abdullah Ibn Ubayy and his followers as well as all hypocrites till the Day of Judgement (the tidings that for them there is a painful doom) which will extend to their hearts;\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "4:138",
            "26:201",
            "15:50",
            "84:24",
            "37:38",
            "17:10",
            "76:31",
            "51:37",
            "33:8",
            "2:104"
        ],
        "BIBLE": [
            "prophets:ii%20samuel:17:7",
            "torah:deuteronomy:8:10",
            "torah:deuteronomy:26:11",
            "torah:numbers:18:29",
            "writings:proverbs:22:24",
            "writings:psalms:60:6",
            "writings:psalms:111:5",
            "prophets:ezekiel:20:25",
            "torah:numbers:3:9",
            "torah:numbers:18:12"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:4:12"
        ]
    }
}