{
    "VERSE": "4:139",
    "ARABIC": "ٱلَّذِينَ يَتَّخِذُونَ ٱلْكَٰفِرِينَ أَوْلِيَآءَ مِن دُونِ ٱلْمُؤْمِنِينَ أَيَبْتَغُونَ عِندَهُمُ ٱلْعِزَّةَ فَإِنَّ ٱلْعِزَّةَ لِلَّهِ جَمِيعًا",
    "ENGLISH": {
        "TRANSLATION_0": "Do those who take the kafirun as protectors, rather than the muminun, hope to find power and strength with them? Power and strength belong entirely to Allah.",
        "TRANSLATION_1": "Do those who take unbelievers as their friends in preference to the faithful seek power from them? But all power belongs to God.\n",
        "TRANSLATION_2": "who take the unbelievers for their allies in preference to the believers. Do they seek honour from them whereas honour altogether belongs to Allah alone?\n",
        "TRANSLATION_3": "Do those who establish friendship with the disbelievers instead of the believers seek honor? Let them know that all honor belongs to God.\n",
        "TRANSLATION_4": "Those who leave the Muslims to befriend the disbelievers; do they seek honour from them? Then (know that) undoubtedly all honour is for Allah.\n",
        "TRANSLATION_5": "Those who take disbelievers for friends instead of believers, do they seek honor with them Verily, then to Allah belongs all honor.\n",
        "TRANSLATION_6": "Those who take the unbelievers for guardians rather than believers. Do they seek honor from them? Then surely all honor is for Allah.\n",
        "TRANSLATION_7": "Those who take unbelievers for their friends instead of believers -- do they seek glory in them? But glory altogether belongs to God.\n",
        "TRANSLATION_8": "Those who chose disbelievers for their friends instead of believers! Do they look for power at their hands? Lo! all power appertaineth to Allah.\n",
        "TRANSLATION_9": "As for those who take the deniers of the truth for their allies rather than the believers -- do they seek honour in their company?  Surely all honour belongs to God.\n",
        "TRANSLATION_10": "Those who take infidels for, friends, instead of the believers. Seek thy honour with them verily then honour is Allah's altogether.\n",
        "TRANSLATION_11": "—those who take the faithless for allies instead of the faithful. Do they seek honour with them? [If so,] indeed all honour belongs to Allah.\n",
        "TRANSLATION_12": "Yea, to those who take for friends unbelievers rather than believers: is it honour they seek among them? Nay,- all honour is with Allah.\n",
        "TRANSLATION_13": "Those who take disbelievers for Auliya' (protectors or helpers or friends) instead of believers, do they seek honour, power and glory with them? Verily, then to Allah belongs all honour, power and glory.\n",
        "TRANSLATION_14": "Those who take unbelievers for guides instead of believers, are they seeking might with them? Surely, the Might altogether belongs to Allah.\n",
        "TRANSLATION_15": "Those who ally themselves with the disbelievers instead of the believers. Do they seek glory in them? All glory belongs to God.\n",
        "TRANSLATION_16": "Those who take disbelievers as allies instead of the believers. Do they seek with them honor [through power]? But indeed, honor belongs to Allah entirely.\n",
        "TRANSLATION_17": "[4:139] Those who (alladhīna, is either a substitution for, or an adjectival qualification of, al-munāfiqīna, ‘the hypocrites’) take disbelievers for friends instead of believers, because they mistakenly believe them to be strong — do they desire, [do] they seek, power with them? (an interrogative of disavowal), that is to say, they shall not find such [power] with them. Truly, power belongs altogether to God, in this world and the Hereafter, and none but His friends shall attain it.\n",
        "TRANSLATION_18": "Allah then showed their traits, saying: (Those who choose disbelievers) the Jews (for their friends) when it comes to assistance and help (instead of believers!) instead of sincere believers. (Do they look for power) might and invincibility (at their hands) the hands of the Jews? (Lo! all power appertaineth to Allah).\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "4:139",
            "4:144",
            "19:81",
            "42:46",
            "29:42",
            "29:17",
            "53:58",
            "62:6",
            "10:65",
            "18:102"
        ],
        "BIBLE": [
            "writings:psalms:90:17",
            "torah:exodus:3:19",
            "writings:ii%20chronicles:20:6",
            "writings:i%20chronicles:29:12",
            "prophets:isaiah:41:20",
            "prophets:jeremiah:16:21",
            "prophets:i%20samuel:24:21",
            "prophets:joshua:4:24",
            "torah:deuteronomy:16:15",
            "writings:psalms:109:27"
        ]
    }
}