{
    "VERSE": "4:140",
    "ARABIC": "وَقَدْ نَزَّلَ عَلَيْكُمْ فِى ٱلْكِتَٰبِ أَنْ إِذَا سَمِعْتُمْ ءَايَٰتِ ٱللَّهِ يُكْفَرُ بِهَا وَيُسْتَهْزَأُ بِهَا فَلَا تَقْعُدُوا۟ مَعَهُمْ حَتَّىٰ يَخُوضُوا۟ فِى حَدِيثٍ غَيْرِهِۦٓ إِنَّكُمْ إِذًا مِّثْلُهُمْ إِنَّ ٱللَّهَ جَامِعُ ٱلْمُنَٰفِقِينَ وَٱلْكَٰفِرِينَ فِى جَهَنَّمَ جَمِيعًا",
    "ENGLISH": {
        "TRANSLATION_0": "It has been sent down to you in the Book that when you hear Allah's Signs being rejected and mocked at by people, you must not sit with them till they start talking of other things. If you do you are just the same as them. Allah will gather all the hypocrites and kafirun into Hell.",
        "TRANSLATION_1": "You have been commanded in the Book that whensoever you hear God's messages denied or derided, do not sit in that company until they begin talking of other things, or you will be no different from them. Indeed God will put the hypocrites and infidels together in Hell.\n",
        "TRANSLATION_2": "Allah has enjoined upon you in the-Book that when you hear the signs of Allah being rejected and scoffed at, you will not sit with them until they engage in some other talk, or else you will become like them. Know well, Allah will gather the hypocrites and the unbe-lievers in Hell - all together.\n",
        "TRANSLATION_3": "God has told you (believers) in the Book that when you hear people disbelieving and mocking God's revelations, do not sit with them unless they change the subject. You will become like them. God will gather all the hypocrites and the disbelievers together in hell fire.\n",
        "TRANSLATION_4": "And indeed Allah has sent down to you in the Book that whenever you hear the signs of Allah being rejected or being made fun of, do not sit with those people, until they engage in some other conversation; or else you too are like them; undoubtedly Allah will gather the hypocrites and the disbelievers, all together, into hell.\n",
        "TRANSLATION_5": "And it has already been revealed to you in the Book that when you hear the verses of Allah being denied and mocked at, then sit not with them, until they engage in talk other than that; certainly in that case you would be like them. Surely, Allah will collect the hypocrites and disbelievers all together in Hell.\n",
        "TRANSLATION_6": "And indeed He has revealed to you in the Book that when you hear Allah's communications disbelieved in and mocked at do not sit with them until they enter into some other discourse; surely then you would be like them; surely Allah will gather together the hypocrites and the unbelievers all in hell.\n",
        "TRANSLATION_7": "He has sent down upon you in the Book: 'When you hear God's signs being disbelieved and made mock of, do not sit with them until they plunge into some other talk, or else you will surely be like to them.' God will gather the hypocrites and the unbelievers all in Gehenna.\n",
        "TRANSLATION_8": "He hath already revealed unto you in the Scripture that, when ye hear the revelations of Allah rejected and derided, (ye) sit not with them (who disbelieve and mock) until they engage in some other conversation. Lo! in that case (if ye stayed) ye would be like unto them. Lo! Allah will gather hypocrites and disbelievers, all together, into hell;\n",
        "TRANSLATION_9": "He has instructed you in the Book that, when you hear people deny or ridicule God's revelations, you must not sit with them unless they engage in other talk, or else you yourselves shall become like them. God will gather all the hypocrites and those who deny the truth together in Hell.\n",
        "TRANSLATION_10": "And it hath been revealed to you in the Book that when ye hear Allah's revelations being disbelieved in and mocked at, sit not down with them until they plunge in a discourse other than that; for, then, ye would surely become like unto them. Verily Allah is about to gather hypocrites and infidels in Hell together.\n",
        "TRANSLATION_11": "Certainly He has sent down to you in the Book that when you hear Allah’s signs being disbelieved and derided, do not sit with them until they engage in some other discourse, or else you [too] will be like them. Indeed Allah will gather the hypocrites and the faithless in hell all together\n",
        "TRANSLATION_12": "Already has He sent you Word in the Book, that when ye hear the signs of Allah held in defiance and ridicule, ye are not to sit with them unless they turn to a different theme: if ye did, ye would be like them. For Allah will collect the hypocrites and those who defy faith - all in Hell:-\n",
        "TRANSLATION_13": "And it has already been revealed to you in the Book (this Quran) that when you hear the Verses of Allah being denied and mocked at, then sit not with them, until they engage in a talk other than that; (but if you stayed with them) certainly in that case you would be like them. Surely, Allah will collect the hypocrites and disbelievers all together in Hell,\n",
        "TRANSLATION_14": "He has sent down upon you in the Book: \"When you hear His verses being disbelieved or mocked, do not sit with them until they engage in other talk, or elseyou will surely be like them. Allah will surely gather the hypocrites and unbelievers altogether in Gehenna (Hell).\n",
        "TRANSLATION_15": "He has revealed to you in the Book that when you hear God’s revelations being rejected, or ridiculed, do not sit with them until they engage in some other subject. Otherwise, you would be like them. God will gather the hypocrites and the disbelievers, into Hell, altogether.\n",
        "TRANSLATION_16": "And it has already come down to you in the Book that when you hear the verses of Allah [recited], they are denied [by them] and ridiculed; so do not sit with them until they enter into another conversation. Indeed, you would then be like them. Indeed Allah will gather the hypocrites and disbelievers in Hell all together -\n",
        "TRANSLATION_17": "[4:140] It has been revealed (read active nazzala, ‘He has revealed’, or passive nuzzila, ‘It has been revealed’) to you in the Book, in the Qur’ān, in sūrat al-An‘ām [Q. 6:68], that: (an has been softened and its subject omitted, in other words, [read it as] annahu) ‘When you hear God’s signs, the Qur’ān, being disbelieved in and mocked, do not sit with them, that is, the disbelievers and the mockers, until they engage in some other talk, for otherwise you, if you were to sit with them, would surely be like them’, in sinfulness. God will gather the hypocrites and disbelievers, all together, into Hell, just as they were gathered together in this world in unbelief and mockery.\n",
        "TRANSLATION_18": "(He hath already revealed unto you in the Scripture) He has already commanded you in the Qur'an when you were in Mecca (that, when ye hear the revelations of Allah) when you hear the mention of Muhammad and the Qur'an (rejected and derided) when Muhammad and the Qur'an are rejected and derided, ((ye) sit not with them (who disbelieve and mock)) and engage in the same conversation (until they engage in some other conversation) other than about Muhammad and the Qur'an. (Lo! in that case (if ye stayed)) i.e. if you sit with them without being coerced to do so (ye would be like unto them) in engaging in the same conversation and in showing derision. (Lo! Allah will gather hypocrites) the hypocrites of Medina: 'Abdullah Ibn Ubayy and his followers (and disbelievers) the disbelievers of Mecca: Abu Jahl and his followers, and the disbelievers of Medina: Ka'b and his followers, (all together, into hell);\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "4:140",
            "6:68",
            "3:119",
            "45:6",
            "4:103",
            "2:137",
            "6:33",
            "2:194",
            "10:20",
            "16:74"
        ],
        "BIBLE": [
            "prophets:isaiah:43:9",
            "writings:nehemiah:5:8",
            "prophets:jeremiah:42:4",
            "prophets:joshua:24:27",
            "prophets:ii%20kings:18:36",
            "torah:deuteronomy:29:28",
            "prophets:ii%20kings:6:32",
            "prophets:jeremiah:16:10",
            "torah:leviticus:10:3",
            "writings:psalms:40:6"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:1",
            
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:7"
        ]
    }
}