{
    "VERSE": "4:141",
    "ARABIC": "ٱلَّذِينَ يَتَرَبَّصُونَ بِكُمْ فَإِن كَانَ لَكُمْ فَتْحٌ مِّنَ ٱللَّهِ قَالُوٓا۟ أَلَمْ نَكُن مَّعَكُمْ وَإِن كَانَ لِلْكَٰفِرِينَ نَصِيبٌ قَالُوٓا۟ أَلَمْ نَسْتَحْوِذْ عَلَيْكُمْ وَنَمْنَعْكُم مِّنَ ٱلْمُؤْمِنِينَ فَٱللَّهُ يَحْكُمُ بَيْنَكُمْ يَوْمَ ٱلْقِيَٰمَةِ وَلَن يَجْعَلَ ٱللَّهُ لِلْكَٰفِرِينَ عَلَى ٱلْمُؤْمِنِينَ سَبِيلًا",
    "ENGLISH": {
        "TRANSLATION_0": "Those who anticipate the worst for you say, 'Were we not with you?' whenever you gain a victory from Allah, but if the kuffar have a success they say, 'Did we not have the upper hand over you and yet in spite of that keep the muminun away from you?' Allah will judge between you on the Day of Rising. Allah will not give the kuffar any way against the muminun.",
        "TRANSLATION_1": "Those who wait to see what befalls you, say in ease success comes to you from God: \"Were we not with you?\" But if fortune favours the infidels, they say: \"Did we not overpower you, and yet protected you against the believers?\" But God will judge between you on the Day of Resurrection; and God will never give the unbelievers a way over the faithful.\n",
        "TRANSLATION_2": "These hypocrites watch you closely: if victory is granted to you by Allah, they will say: 'Were we not with you?' And were the unbelievers to gain the upper hand, they will say: 'Did we not have mastery over you, and yet we protected you from the believers?' It is Allah Who will judge between you on the Day of Resurrection, and He will not allow the unbelievers, in any way, to gain advantage over the believers.\n",
        "TRANSLATION_3": "(The hypocrites) wait and watch. If God grants you victory, they say, \"Did we not help you?\" If the unbelievers are victorious, they say, \"Did we not encourage you not to surrender to the believers and did we not protect you from them?\" God will judge among you on the Day of Judgment. He will never help the disbelievers against the believers.\n",
        "TRANSLATION_4": "Those who keep watching your circumstances; so if a victory comes to you from Allah, they say, “Were we not with you?”; and if victory is for disbelievers, they say, “Did we not have control over you, and protect you from the Muslims?” Allah will judge between you all on the Day of Resurrection; and Allah will not provide the disbelievers any way over the Muslims.\n",
        "TRANSLATION_5": "Those who wait and watch about you; if you gain a victory from Allah, they say: \"Were we not with you\" But if the disbelievers gain a success, they say (to them): \"Did we not gain mastery over you and did we not protect you from the believers\" Allah will judge between you (all) on the Day of Resurrection. And never will Allah grant to the disbelievers a way (to triumph) over the believers.\n",
        "TRANSLATION_6": "Those who wait for (some misfortune to befall) you then If you have a victory from Allah they say: Were we not with you? And if there is a chance for the unbelievers, they say: Did we not acquire the mastery over you and defend you from the believers? So Allah shall Judge between you on the day of resurrection, and Allah will by no means give the unbelievers a way against the believers.\n",
        "TRANSLATION_7": "Those who wait upon you and, if a victory comes to you from God, say, 'Were we not with you?' but if the unbelievers get a share, they say, 'Did we not gain the mastery over you, and did we not defend you from the believers?' God will judge between you on the Resurrection Day, and God will not grant the unbelievers any way over the believers.\n",
        "TRANSLATION_8": "Those who wait upon occasion in regard to you and, if a victory cometh unto you from Allah, say: Are we not with you? and if the disbelievers meet with a success say: Had we not the mastery of you, and did we not protect you from the believers? - Allah will judge between you at the Day of Resurrection, and Allah will not give the disbelievers any way (of success) against the believers.\n",
        "TRANSLATION_9": "The hypocrites wait to see what happens to you and, if God grants you a victory, they say, \"Were we not on your side?\" And if those who deny the truth have a share of it [victory] they say to them, \"Did we not help you win, and protect you from the believers?\" God will judge between you [all] on Resurrection Day. And never will God allow those who deny the truth to harm the believers.\n",
        "TRANSLATION_10": "Those who wait about you. If then there be victory for you from Allah, they say: were we not with you? And if there is a portion for the infidels, they say: gained we not mastery over you, and kept we not you back from the believers! Allah shall Judge betwixt you On the Day of Judgement, and Allah shall not make for the infidels against the believers a way.\n",
        "TRANSLATION_11": "—those who lie in wait for you: if there is a victory for you from Allah, they say, ‘Were we not with you?’ But if the faithless get a share [of victory], they say, ‘Did we not prevail upon you and defend you against the faithful?’ Allah will judge between you on the Day of Resurrection, and Allah will never provide the faithless any way [to prevail] over the faithful.\n",
        "TRANSLATION_12": "(These are) the ones who wait and watch about you: if ye do gain a victory from Allah, they say: \"Were we not with you?\"- but if the unbelievers gain a success, they say (to them): \"Did we not gain an advantage over you, and did we not guard you from the believers?\" but Allah will judge betwixt you on the Day of Judgment. And never will Allah grant to the unbelievers a way (to triumphs) over the believers.\n",
        "TRANSLATION_13": "Those (hyprocrites) who wait and watch about you; if you gain a victory from Allah, they say: \"Were we not with you,\" but if the disbelievers gain a success, they say (to them): \"Did we not gain mastery over you and did we not protect you from the believers?\" Allah will judge between you (all) on the Day of Resurrection. And never will Allah grant to the disbelievers a way (to triumph) over the believers.\n",
        "TRANSLATION_14": "(As for) those who lay in wait for you. If a victory comes to you from Allah they say: 'Were we not with you' But if the unbelievers get a portion, they say, 'Were we not mightier than you, and did we not defend you from the believers' Allah will judge between you on the Day of Resurrection. Allah will not grant the unbelievers any way over the believers.\n",
        "TRANSLATION_15": "Those who lie in wait for you: if you attain victory from God, they say, “Were we not with you?” But if the disbelievers get a turn, they say, “Did we not side with you, and defend you from the believers?” God will judge between you on the Day of Resurrection; and God will give the disbelievers no means of overcoming the believers.\n",
        "TRANSLATION_16": "Those who wait [and watch] you. Then if you gain a victory from Allah, they say, \"Were we not with you?\" But if the disbelievers have a success, they say [to them], \"Did we not gain the advantage over you, but we protected you from the believers?\" Allah will judge between [all of] you on the Day of Resurrection, and never will Allah give the disbelievers over the believers a way [to overcome them].\n",
        "TRANSLATION_17": "[4:141] Those who (alladhīna, substitutes for the previous alladhīna [of verse 139]) wait in watch for you, [hoping] for misfortunes [to befall you], and, if a victory, such as a conquest or booty, comes to you from God, say, to you: ‘Were we not with you?’, in religion and in the struggle? So give us from the booty; but if the   disbelievers have some luck, by gaining a victory over you, they say, to them: ‘Did we not gain mastery, authority, over you, capable of capturing you and slaying you, but we spared you, and did we not defend you against the believers?’, lest they be victorious over you, by forsaking them and apprising you of their plans, and thus have we not done you a favour? God, exalted be He, says: God will judge between you, and them, on the Day of Resurrection, admitting you into Paradise and them into the Fire; and God will never grant the disbelievers a way, a means [to success], over the believers, by annihilating them.\n",
        "TRANSLATION_18": "Allah then explained who these people are, saying: (Those who wait upon occasion in regard to you) those who lay in wait for hardship and the turn of events to befall you (and, if a victory) triumph and booty (cometh unto you from Allah, say) i.e. the hypocrites say to the sincere believers: (Are we not with you?) are we not following the same religion? Give us then of the booty, (and if the disbelievers) the Jews (meet with a success) fortune turn in their favour (say: Had we not the mastery of you) did we not divulge, and inform you about, the secrets of Muhammad, (and did we not protect you from the believers?) and did we not protect you from fighting the believers and informed you about them (Allah will judge between you) congregation of Jews and hypocrites (at the Day of Resurrection, and Allah will not give the disbelievers) the Jews (any way (of success) against the believers) He will not always let fortune turn in favour of the Jews to the detriment of the believers.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "4:141",
            "60:3",
            "22:69",
            "4:90",
            "7:87",
            "3:23",
            "2:113",
            "8:72",
            "26:118",
            "4:143"
        ],
        "BIBLE": [
            "prophets:ii%20kings:9:18",
            "writings:i%20chronicles:12:18",
            "writings:ii%20chronicles:14:10",
            "prophets:ii%20kings:9:19",
            "torah:genesis:24:42",
            "writings:daniel:6:13",
            "prophets:ii%20kings:5:7",
            "writings:nehemiah:8:10",
            "torah:deuteronomy:31:29",
            "writings:ii%20chronicles:35:21"
        ]
    }
}