{
    "VERSE": "4:147",
    "ARABIC": "مَّا يَفْعَلُ ٱللَّهُ بِعَذَابِكُمْ إِن شَكَرْتُمْ وَءَامَنتُمْ وَكَانَ ٱللَّهُ شَاكِرًا عَلِيمًا",
    "ENGLISH": {
        "TRANSLATION_0": "Why should Allah punish you if you are thankful and have iman? Allah is All-Thankful, All-Knowing.",
        "TRANSLATION_1": "Why should God punish you if you acknowledge the truth and believe? God is responsive to gratitude and is cognisant.\n",
        "TRANSLATION_2": "Why should Allah deal chastisement to you if you are grateful to Him and believe? Allah is All-Appreciative, All-Knowing.\n",
        "TRANSLATION_3": "Why should God punish you if you give thanks and believe in Him? God is All-rewarding and All-forgiving.\n",
        "TRANSLATION_4": "And what will Allah gain by punishing you, if you acknowledge the truth and accept faith? And Allah is Most Appreciative, All Knowing.\n",
        "TRANSLATION_5": "Why should Allah punish you if you have thanked (Him) and have believed in Him. And Allah is Ever All-Appreciative (of good), All-Knowing.\n",
        "TRANSLATION_6": "Why should Allah chastise you if you are grateful and believe? And Allah is the Multiplier of rewards, Knowing\n",
        "TRANSLATION_7": "What would God do with chastising you if you are thankful, and believe? God is All-thankful, All-knowing.\n",
        "TRANSLATION_8": "What concern hath Allah for your punishment if ye are thankful (for His mercies) and believe (in Him)? Allah was ever Responsive, Aware.\n",
        "TRANSLATION_9": "Why should God punish you, if you render thanks to Him and believe in Him? God is appreciative and aware.\n",
        "TRANSLATION_10": "What will Allah do with your torment, if ye return thanks and believe? And Allah is ever Appreciative, Knowing.\n",
        "TRANSLATION_11": "Why should Allah punish you if you give thanks and be faithful? And Allah is appreciative, all-knowing.\n",
        "TRANSLATION_12": "What can Allah gain by your punishment, if ye are grateful and ye believe? Nay, it is Allah that recogniseth (all good), and knoweth all things.\n",
        "TRANSLATION_13": "Why should Allah punish you if you have thanked (Him) and have believed in Him. And Allah is Ever All-Appreciative (of good), All-Knowing.\n",
        "TRANSLATION_14": "What, would Allah do with punishing you if you thank and believe! Allah is the Thanker, the Knower.\n",
        "TRANSLATION_15": "What would God accomplish by your punishment, if you have given thanks, and have believed? God is Appreciative and Cognizant.\n",
        "TRANSLATION_16": "What would Allah do with your punishment if you are grateful and believe? And ever is Allah Appreciative and Knowing.\n",
        "TRANSLATION_17": "[4:147] Why would God chastise you if you are thankful, of His favours, and believe, in Him? (the interrogative is meant as a denial, in other words: He would not punish you). God is ever Thankful, of the deeds of believers, rewarding them, Knowing, of His creation.\n",
        "TRANSLATION_18": "(What concern hath Allah for your punishment) why should Allah punish you (if ye are thankful (for His mercies)) if you believe inwardly in His divine Oneness (and believe (in Him)) and you have faith inwardly? (Allah is ever Responsive) He is responsive for the little that is done in His sake and rewards abundantly for it, (Aware) of those who are thankful and of those who are not.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "4:147",
            "22:68",
            "84:23",
            "67:28",
            "3:66",
            "3:63",
            "52:27",
            "11:33",
            "16:104",
            "4:39"
        ],
        "BIBLE": [
            "prophets:joshua:23:15",
            "prophets:jeremiah:25:5",
            "writings:ecclesiastes:1:13",
            "torah:deuteronomy:3:20",
            "writings:ezra:3:11",
            "torah:genesis:9:3",
            "torah:deuteronomy:26:13",
            "writings:psalms:111:5",
            "prophets:jeremiah:11:18",
            "writings:i%20chronicles:29:14"
        ]
    }
}