{
    "VERSE": "4:151",
    "ARABIC": "أُو۟لَٰٓئِكَ هُمُ ٱلْكَٰفِرُونَ حَقًّا وَأَعْتَدْنَا لِلْكَٰفِرِينَ عَذَابًا مُّهِينًا",
    "ENGLISH": {
        "TRANSLATION_0": "such people are the true kuffar. We have prepared a humiliating punishment for the kuffar.",
        "TRANSLATION_1": "Are verily the real unbelievers. And We have reserved for unbelievers an ignominious punishment.\n",
        "TRANSLATION_2": "It is they, indeed they, who are, beyond all doubt, unbelievers; and for the unbelievers We have prepared a humiliating chastisement.\n",
        "TRANSLATION_3": "but, in fact, they are unbelievers, and for them We have prepared a humiliating torment.\n",
        "TRANSLATION_4": "These are the real disbelievers; and for the disbelievers We have kept prepared a disgraceful punishment.\n",
        "TRANSLATION_5": "They are in truth disbelievers. And We have prepared for the disbelievers a humiliating torment.\n",
        "TRANSLATION_6": "These it is that are truly unbelievers, and We have prepared for the unbelievers a disgraceful chastisement.\n",
        "TRANSLATION_7": "those in truth are the unbelievers; and We have prepared for the unbelievers a humbling chastisement.\n",
        "TRANSLATION_8": "Such are disbelievers in truth; and for disbelievers We prepare a shameful doom.\n",
        "TRANSLATION_9": "Those indeed are they who are denying the truth beyond doubt, and We have prepared a humiliating punishment for the deniers.\n",
        "TRANSLATION_10": "These: they are the infidels in very truth, and We have gotten ready for the infidels a torment ignominious.\n",
        "TRANSLATION_11": "—it is they who are truly faithless, and We have prepared for the faithless a humiliating punishment.\n",
        "TRANSLATION_12": "They are in truth (equally) unbelievers; and we have prepared for unbelievers a humiliating punishment.\n",
        "TRANSLATION_13": "They are in truth disbelievers. And We have prepared for the disbelievers a humiliating torment.\n",
        "TRANSLATION_14": "those in truth are the unbelievers, and We have prepared for the unbelievers a humiliating punishment.\n",
        "TRANSLATION_15": "These are the unbelievers, truly. We have prepared for the unbelievers a shameful punishment.\n",
        "TRANSLATION_16": "Those are the disbelievers, truly. And We have prepared for the disbelievers a humiliating punishment.\n",
        "TRANSLATION_17": "[4:151] Those are the disbelievers truly (haqqan is the verbal noun, emphasising the content of what precedes it in the sentence); and We have prepared for the disbelievers a humiliating chastisement, namely, the chastisement of the Fire.\n",
        "TRANSLATION_18": "(Such are disbelievers in truth; and for disbelievers) the Jews and other disbelievers (We prepare a shameful doom) by means of which they shall be abased; it is also said that this means: a severe torment.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "4:151",
            "70:1",
            "2:42",
            "23:64",
            "6:30",
            "43:50",
            "37:9",
            "34:38",
            "4:138",
            "44:15"
        ],
        "BIBLE": [
            "writings:proverbs:20:21",
            "torah:exodus:14:18",
            "prophets:i%20samuel:21:6",
            "torah:leviticus:5:23",
            "prophets:ezekiel:28:4",
            "writings:job:31:25",
            "writings:proverbs:13:11",
            "prophets:isaiah:15:7",
            "writings:job:20:18",
            "torah:exodus:15:16"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:3"
        ]
    }
}