{
    "VERSE": "4:158",
    "ARABIC": "بَل رَّفَعَهُ ٱللَّهُ إِلَيْهِ وَكَانَ ٱللَّهُ عَزِيزًا حَكِيمًا",
    "ENGLISH": {
        "TRANSLATION_0": "Allah raised him up to Himself. Allah is Almighty, All-Wise.",
        "TRANSLATION_1": "But God raised him up (in position) and closer to Himself; and God is all-mighty and all-wise.\n",
        "TRANSLATION_2": "but Allah raised him to Himself. Allah is All-Mighty, All-Wise.\n",
        "TRANSLATION_3": "God raised him up to Himself. God is Majestic and All-wise.\n",
        "TRANSLATION_4": "In fact Allah raised him towards Himself; and Allah is Almighty, Wise.\n",
        "TRANSLATION_5": "But Allah raised him up unto Himself. And Allah is Ever All-Powerful, All-Wise.\n",
        "TRANSLATION_6": "Nay! Allah took him up to Himself; and Allah is Mighty, Wise.\n",
        "TRANSLATION_7": "God raised him up to Him; God is All-mighty, All-wise.\n",
        "TRANSLATION_8": "But Allah took him up unto Himself. Allah was ever Mighty, Wise.\n",
        "TRANSLATION_9": "God raised him towards Himself. God is almighty and wise.\n",
        "TRANSLATION_10": "But Allah raised him unto Himself; and Allah is ever Mighty, Wise.\n",
        "TRANSLATION_11": "Indeed, Allah raised him up toward Himself, and Allah is all-mighty, all-wise.\n",
        "TRANSLATION_12": "Nay, Allah raised him up unto Himself; and Allah is Exalted in Power, Wise;-\n",
        "TRANSLATION_13": "But Allah raised him ['Iesa (Jesus)] up (with his body and soul) unto Himself (and he is in the heavens). And Allah is Ever All-Powerful, All-Wise.\n",
        "TRANSLATION_14": "Rather, Allah raised him up to Him. Allah is Almighty, the Wise.\n",
        "TRANSLATION_15": "Rather, God raised him up to Himself. God is Mighty and Wise.\n",
        "TRANSLATION_16": "Rather, Allah raised him to Himself. And ever is Allah Exalted in Might and Wise.\n",
        "TRANSLATION_17": "[4:158] Nay, God raised him up to Him. God is ever Mighty, in His kingdom, Wise, in His actions.\n",
        "TRANSLATION_18": "(But Allah took him up unto Himself) in heaven. (Allah was ever Mighty) in His vengeance against His enemies, (Wise) by granting triumph to his friends: He saved His Prophet and destroyed their man.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "4:158",
            "27:9",
            "34:27",
            "39:1",
            "46:2",
            "45:2",
            "42:3",
            "59:1",
            "61:1",
            "48:19"
        ],
        "BIBLE": [
            "prophets:ii%20kings:13:15",
            "writings:ii%20chronicles:32:5",
            "prophets:joshua:5:7",
            "torah:genesis:15:10",
            "torah:genesis:3:23",
            "torah:genesis:5:24",
            "torah:deuteronomy:31:26",
            "torah:numbers:24:23",
            "torah:genesis:2:15",
            "writings:ezra:5:15"
        ]
    }
}