{
    "VERSE": "4:163",
    "ARABIC": "إِنَّآ أَوْحَيْنَآ إِلَيْكَ كَمَآ أَوْحَيْنَآ إِلَىٰ نُوحٍ وَٱلنَّبِيِّۦنَ مِنۢ بَعْدِهِۦ وَأَوْحَيْنَآ إِلَىٰٓ إِبْرَٰهِيمَ وَإِسْمَٰعِيلَ وَإِسْحَٰقَ وَيَعْقُوبَ وَٱلْأَسْبَاطِ وَعِيسَىٰ وَأَيُّوبَ وَيُونُسَ وَهَٰرُونَ وَسُلَيْمَٰنَ وَءَاتَيْنَا دَاوُۥدَ زَبُورًا",
    "ENGLISH": {
        "TRANSLATION_0": "We have revealed to you as We revealed to Nuh and the Prophets who came after him. And We revealed to Ibrahim and Isma'il and Ishaq and Ya'qub and the Tribes, and 'Isa and Ayyub and Yunus and Harun and Sulayman. And We gave Dawud the Zabur.",
        "TRANSLATION_1": "We have sent revelations to you as We sent revelations to Noah and the prophets (who came) after him; and We sent revelations to Abraham and Ishmael and Isaac and Jacob, and their offspring, and to Jesus and Job, and to Jonah and Aaron and Solomon, and to David We gave the Book of Psalms,\n",
        "TRANSLATION_2": "(O Muhammad!) We have revealed to you as We revealed to Noah and the Prophets after him, and We revealed to Abraham, Ishmael, Isaac, Jacob and the offspring of Jacob, and Jesus and Job, and Jonah, and Aaron and Solomon, and We gave to David Psalms.\n",
        "TRANSLATION_3": "(Muhammad), We have sent revelations to you just as were sent to Noah and the Prophets who lived after him and to Abraham, Ishmael, Isaac, Jacob, his descendants, Jesus, Job, Jonah, Aaron, and Solomon. We gave the Psalms to David.\n",
        "TRANSLATION_4": "Indeed We sent a divine revelation to you (Prophet Mohammed – peace and blessing be upon him) as We did send divine revelations to Nooh (Noah) and the Prophets after him; and We sent divine revelations to Ibrahim (Abraham) and Ismael (Ishmael) and Ishaq (Isaac) and Yaqub (Jacob) and their offspring, and Eisa (Jesus) and Ayyub (Job) and Yunus (Jonah) and Haroon (Aaron) and Sulaiman (Solomon), and We bestowed the Zaboor (the Holy Book) upon Dawud (David).\n",
        "TRANSLATION_5": "Verily, We have sent the revelation to you as We sent the revelation to Nuh and the Prophets after him; We (also) sent the revelation to Ibrahim, Isma`il, Ishaq, Ya`qub, and Al-Asbat, (the offspring of the twelve sons of Ya`qub) `Isa, Ayyub, Yunus, Harun, and Sulayman; and to Dawud We gave the Zabur.\n",
        "TRANSLATION_6": "Surely We have revealed to you as We revealed to Nuh, and the prophets after him, and We revealed to Ibrahim and Ismail and Ishaq and Yaqoub and the tribes, and Isa and Ayub and Yunus and Haroun and Sulaiman and We gave to Dawood\n",
        "TRANSLATION_7": "We have revealed to thee as We revealed to Noah, and the Prophets after him, and We revealed to Abraham, Ishmael, Isaac, Jacob, and the Tribes, Jesus and Job, Jonah and Aaron and Solomon, and We gave to David Psalms,\n",
        "TRANSLATION_8": "Lo! We inspire thee as We inspired Noah and the prophets after him, as We inspired Abraham and Ishmael and Isaac and Jacob and the tribes, and Jesus and Job and Jonah and Aaron and Solomon, and as We imparted unto David the Psalms;\n",
        "TRANSLATION_9": "We have sent revelation to you [Prophet] as We did to Noah and the prophets who came after him, to Abraham, Ishmael, Isaac, Jacob, and the Tribes, to Jesus, Job, Jonah, Aaron, and Solomon and David, to whom We gave the Psalms.\n",
        "TRANSLATION_10": "Verily We have revealed unto thee even as We revealed unto Nuh and the prophets after him, and as We revealed unto Ibrahim and Isma'il and Is-haq and Ya'qub and the tribes, and 'Isa and Ayyub and Yunus and Harun and Sulaiman, and unto Daud We vouchsafed a Scripture.\n",
        "TRANSLATION_11": "We have indeed revealed to you as We revealed to Noah and the prophets after him, and [as] We revealed to Abraham and Ishmael, Isaac, Jacob, and the Tribes, Jesus and Job, Jonah, Aaron, and Solomon—and We gave David the Psalms—\n",
        "TRANSLATION_12": "We have sent thee inspiration, as We sent it to Noah and the Messengers after him: we sent inspiration to Abraham, Isma'il, Isaac, Jacob and the Tribes, to Jesus, Job, Jonah, Aaron, and solomon, and to David We gave the Psalms.\n",
        "TRANSLATION_13": "Verily, We have inspired you (O Muhammad SAW) as We inspired Nuh (Noah) and the Prophets after him; We (also) inspired Ibrahim (Abraham), Isma'il (Ishmael), Ishaque (Isaac), Ya'qub (Jacob), and Al-Asbat [the twelve sons of Ya'qub (Jacob)], 'Iesa (Jesus), Ayub (Job), Yunus (Jonah), Harun (Aaron), and Sulaiman (Solomon), and to Dawud (David) We gave the Zabur (Psalms).\n",
        "TRANSLATION_14": "We have revealed to you as We revealed to Noah and to the Prophets after him, and We revealed to (Prophets) Abraham, Ishmael, Isaac, Jacob and the tribes, Jesus, Job, Jonah, Aaron, and Solomon, and We gave to David the Psalms.\n",
        "TRANSLATION_15": "We have inspired you, as We had inspired Noah and the prophets after him. And We inspired Abraham, and Ishmael, and Isaac, and Jacob, and the Patriarchs, and Jesus, and Job, and Jonah, and Aaron, and Solomon. And We gave David the Psalms.\n",
        "TRANSLATION_16": "Indeed, We have revealed to you, [O Muhammad], as We revealed to Noah and the prophets after him. And we revealed to Abraham, Ishmael, Isaac, Jacob, the Descendants, Jesus, Job, Jonah, Aaron, and Solomon, and to David We gave the book [of Psalms].\n",
        "TRANSLATION_17": "[4:163] We have revealed to you as We revealed to Noah, and the prophets after him, and, as, We revealed to Abraham and, his two sons, Ishmael and Isaac, and Jacob, the son of Isaac, and the Tribes, his [Jacob’s] children, and Jesus and Job and Jonah and Aaron, and Solomon, and We gave to, his father, David the Inscribed Book (read zabūran, it would denote the name of the revealed Book [cf. the Psalms]; read zubūran would make it a verbal noun, meaning mazbūran, that is to say, maktūban, ‘inscribed’).\n",
        "TRANSLATION_18": "(Lo! We inspire you) We have sent Gabriel with the Qur'an (as We inspired Noah and the prophets after him) after Noah, (as We inspired Abraham) We also sent Gabriel to Abraham (and Ishmael and Isaac and Jacob and the tribes) the sons of Jacob, (and Jesus and Job and Jonah and Aaron and Solomon, and as We imparted) We gave (unto David the Psalms);\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "4:163",
            "37:112",
            "2:136",
            "3:84",
            "21:105",
            "19:54",
            "17:55",
            "20:85",
            "47:25",
            "33:45"
        ],
        "BIBLE": [
            "torah:genesis:25:6",
            "torah:genesis:28:4",
            "torah:genesis:35:12",
            "torah:genesis:25:5",
            "prophets:i%20kings:9:12",
            "torah:numbers:18:19",
            "torah:deuteronomy:1:3",
            "writings:ezra:5:3",
            "writings:psalms:72:1",
            "prophets:ezekiel:16:33"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:5:4",
            
            "Sefer%20Yetzirah:2:1"
        ]
    }
}