{
    "VERSE": "4:165",
    "ARABIC": "رُّسُلًا مُّبَشِّرِينَ وَمُنذِرِينَ لِئَلَّا يَكُونَ لِلنَّاسِ عَلَى ٱللَّهِ حُجَّةٌۢ بَعْدَ ٱلرُّسُلِ وَكَانَ ٱللَّهُ عَزِيزًا حَكِيمًا",
    "ENGLISH": {
        "TRANSLATION_0": "Messengers bringing good news and giving warning, so that people will have no argument against Allah after the coming of the Messengers. Allah is Almighty, All-Wise.",
        "TRANSLATION_1": "All these apostles of good news and admonition were sent so that after the apostles men may have no argument against God. God is all-powerful and all-wise.\n",
        "TRANSLATION_2": "These Messengers were sent as bearers of glad tidings and as warners so that after sending the Messengers people may have no plea against Allah. Allah is All-Mighty, All-Wise.\n",
        "TRANSLATION_3": "The Messengers were sent to give people the glad news (of God's mercy) and warn them (of His punishment) so that the human being would not have any objections against God, after the coming of the Messengers, (that they did not have any knowledge of His mercy and punishment). God is Majestic and All-wise.\n",
        "TRANSLATION_4": "Noble Messengers giving glad tidings and declaring warnings, in order that people may not have any argument against Allah, after the (advent of) Noble Messengers; and Allah is Almighty, Wise.\n",
        "TRANSLATION_5": "Messengers as bearers of good news and warning, in order that mankind should have no plea against Allah after the (coming of) Messengers. And Allah is Ever All-Powerful, All-Wise.\n",
        "TRANSLATION_6": "(We sent) apostles as the givers of good news and as warners, so that people should not have a plea against Allah after the (coming of) apostles; and Allah is Mighty, Wise.\n",
        "TRANSLATION_7": "Messengers bearing good tidings, and warning, so that mankind might have no argument against God, after the Messengers; God is All-mighty, All-wise.\n",
        "TRANSLATION_8": "Messengers of good cheer and of warning, in order that mankind might have no argument against Allah after the messengers. Allah was ever Mighty, Wise.\n",
        "TRANSLATION_9": "They were messengers, bearing good news and giving warning, so that mankind would have no excuse before God, after the coming of the messengers. God is mighty, wise.\n",
        "TRANSLATION_10": "We sent all these apostles as bearers of glad tidings and warners in order that there be no plea for mankind against Allah, after the apostle; and Allah is ever Mighty Wise.\n",
        "TRANSLATION_11": "apostles, as bearers of good news and warners, so that mankind may not have any argument against Allah, after the [sending of the] apostles; and Allah is all-mighty, all-wise.\n",
        "TRANSLATION_12": "Messengers who gave good news as well as warning, that mankind, after (the coming) of the messengers, should have no plea against Allah: For Allah is Exalted in Power, Wise.\n",
        "TRANSLATION_13": "Messengers as bearers of good news as well as of warning in order that mankind should have no plea against Allah after the Messengers. And Allah is Ever All-Powerful, All-Wise.\n",
        "TRANSLATION_14": "Messengers bearing glad tidings and warning, so that the people will have no argument against Allah, after the Messengers. Allah is the Almighty, the Wise.\n",
        "TRANSLATION_15": "Messengers delivering good news, and bringing warnings; so that people may have no excuse before God after the coming of the messengers. God is Powerful and Wise.\n",
        "TRANSLATION_16": "[We sent] messengers as bringers of good tidings and warners so that mankind will have no argument against Allah after the messengers. And ever is Allah Exalted in Might and Wise.\n",
        "TRANSLATION_17": "[4:165] messengers (rusulan, substitutes for the previous rusulan, ‘messengers’) bearing good tidings, of reward for those that believe, and warning, of punishment for those that disbelieve; We sent them, so that people might have no argument, to make, against God after, the sending of, the messengers, to them, and say: Our Lord, why did you not send a messenger to us so that we might follow Your signs and be among the believers [Q. 28:47]; thus We sent them to pre-empt such excuses. God is ever Mighty, in His kingdom, Wise, in His actions.\n",
        "TRANSLATION_18": "(Messengers) We have sent all these messengers (of good cheer) giving the good news of Paradise for 108 those who believe (and of warning) of hell for those who disbelieve in Allah, (in order that mankind might have no argument) on the Day of Judgement (against Allah after the messengers) after sending the messengers, such that they cannot say: You have not sent us any messenger. (Allah was ever Mighty) in His vengeance against those who do not believe in His messenger, (Wise) He decreed that they should believe in the messengers.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "4:165",
            "35:2",
            "14:4",
            "48:7",
            "59:1",
            "61:1",
            "59:24",
            "57:1",
            "2:209",
            "3:86"
        ],
        "BIBLE": [
            "writings:psalms:111:6",
            "writings:i%20chronicles:29:14",
            "writings:ezra:3:11",
            "writings:ecclesiastes:8:8",
            "torah:deuteronomy:16:17",
            "prophets:jeremiah:44:20",
            "writings:ii%20chronicles:19:6",
            "writings:ii%20chronicles:35:21",
            "prophets:joshua:23:15",
            "writings:ecclesiastes:5:18"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:5:2",
            
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:1:6"
        ]
    }
}