{
    "VERSE": "4:167",
    "ARABIC": "إِنَّ ٱلَّذِينَ كَفَرُوا۟ وَصَدُّوا۟ عَن سَبِيلِ ٱللَّهِ قَدْ ضَلُّوا۟ ضَلَٰلًۢا بَعِيدًا",
    "ENGLISH": {
        "TRANSLATION_0": "Those who are kafir and bar access to the Way of Allah have gone very far astray.",
        "TRANSLATION_1": "Those who denied and turned away from the path of God, have wandered far astray.\n",
        "TRANSLATION_2": "Those who denied this truth and barred others from the way of Allah have indeed strayed far.\n",
        "TRANSLATION_3": "Those who have rejected the faith and have obstructed people from the way of God, have certainly gone far away from the right path.\n",
        "TRANSLATION_4": "Indeed those who disbelieved and prevented (others) from the way of Allah, have undoubtedly wandered far astray.\n",
        "TRANSLATION_5": "Verily, those who disbelieve and prevent (others) from the path of Allah; they have certainly strayed far away.\n",
        "TRANSLATION_6": "Surely (as for) those who disbelieve and hinder (men) from Allah's way, they indeed have strayed off into a remote\n",
        "TRANSLATION_7": "Surely those who disbelieve, and bar from the way of God, have gone astray into far error.\n",
        "TRANSLATION_8": "Lo! those who disbelieve and hinder (others) from the way of Allah, they verily have wandered far astray.\n",
        "TRANSLATION_9": "Those who are bent on denying the truth and on turning others away from the path of God have strayed far from the right path.\n",
        "TRANSLATION_10": "Verily those who disbelieve and keep others from the way of Allah, have surely strayed far away.\n",
        "TRANSLATION_11": "Indeed those who are faithless and bar [others] from the way of Allah, have certainly strayed into far error.\n",
        "TRANSLATION_12": "Those who reject Faith and keep off (men) from the way of Allah, have verily strayed far, far away from the Path.\n",
        "TRANSLATION_13": "Verily, those who disbelieve [by concealing the truth about Prophet Muhammad SAW and his message of true Islamic Monotheism written with them in the Taurat (Torah) and the Injeel (Gospel)] and prevent (mankind) from the Path of Allah (Islamic Monotheism), they have certainly strayed far away. (Tafsir Al-Qurtubi). (See V. 7:157)\n",
        "TRANSLATION_14": "Those who disbelieve and bar from the way of Allah have strayed into far error.\n",
        "TRANSLATION_15": "Those who disbelieve and repel from God’s path have gone far astray.\n",
        "TRANSLATION_16": "Indeed, those who disbelieve and avert [people] from the way of Allah have certainly gone far astray.\n",
        "TRANSLATION_17": "[4:167] Surely those who disbelieve, in God, and bar, people, from the way of God, [from] the religion of Islam, by concealing the descriptions of Muhammad (s), and these are the Jews, they have indeed gone far astray, from the truth.\n",
        "TRANSLATION_18": "(Lo! those who disbelieve) in Muhammad and the Qur'an (and hinder) people (from the way of Allah) from Allah's religion and His obedience, (they verily have wandered far astray) from guidance.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "4:167",
            "47:1",
            "2:190",
            "14:3",
            "29:69",
            "22:12",
            "61:4",
            "4:150",
            "47:34",
            "16:128"
        ],
        "BIBLE": [
            "prophets:judges:18:26",
            "prophets:jeremiah:50:6",
            "prophets:jonah:3:10",
            "prophets:i%20kings:13:12",
            "prophets:joshua:8:20",
            "torah:numbers:22:23",
            "torah:deuteronomy:3:1",
            "prophets:judges:20:41",
            "writings:lamentations:1:8",
            "torah:exodus:32:15"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:4:7"
        ]
    }
}