{
    "VERSE": "4:169",
    "ARABIC": "إِلَّا طَرِيقَ جَهَنَّمَ خَٰلِدِينَ فِيهَآ أَبَدًا وَكَانَ ذَٰلِكَ عَلَى ٱللَّهِ يَسِيرًا",
    "ENGLISH": {
        "TRANSLATION_0": "except the path of Hell, remaining in it timelessly, for ever and ever. That is easy for Allah.",
        "TRANSLATION_1": "Except to Hell, where they will abide for ever; and this is how (the law of God) works inevitably.\n",
        "TRANSLATION_2": "save that of Hell wherein they will abide. And that is easy for Allah.\n",
        "TRANSLATION_3": "other than that of hell wherein they will live forever. For God this is not in the least bit difficult.\n",
        "TRANSLATION_4": "Except the path of hell, in which they will remain for ever and ever; and that is easy for Allah.\n",
        "TRANSLATION_5": "Except the way of Hell, to dwell therein forever; and this is ever easy for Allah.\n",
        "TRANSLATION_6": "Except the path of hell, to abide in it for ever, and this is easy to Allah.\n",
        "TRANSLATION_7": "but the road to Gehenna, therein dwelling forever and ever; and that for God is an easy matter.\n",
        "TRANSLATION_8": "Except the road of hell, wherein they will abide for ever. And that is ever easy for Allah.\n",
        "TRANSLATION_9": "to any path other than the path of Hell, wherein they shall abide forever. That is easy enough for God.\n",
        "TRANSLATION_10": "Except the way to Hell, as abiders therein for ever, and this unto Allah is ever easy.\n",
        "TRANSLATION_11": "except the way to hell, to remain in it forever, and that is easy for Allah.\n",
        "TRANSLATION_12": "Except the way of Hell, to dwell therein for ever. And this to Allah is easy.\n",
        "TRANSLATION_13": "Except the way of Hell, to dwell therein forever, and this is ever easy for Allah.\n",
        "TRANSLATION_14": "except the road to Gehenna, there they are eternal, and for Allah that is an easy matter.\n",
        "TRANSLATION_15": "Except to the path of Hell, where they will dwell forever. And that is easy for God.\n",
        "TRANSLATION_16": "Except the path of Hell; they will abide therein forever. And that, for Allah, is [always] easy.\n",
        "TRANSLATION_17": "[4:169] except for the path of Hell, that is, [to] the path that leads to it, abiding, it is decreed for them to abide, therein, once they enter it, forever; and for God that is an easy matter.\n",
        "TRANSLATION_18": "(Except the road of hell, wherein they will abide for ever) they will remain in hell, never to die or be taken out of it. (And that) abiding in hell for eternity and punishment of these people (is ever easy for Allah).\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "4:169",
            "72:23",
            "64:7",
            "4:30",
            "2:95",
            "62:7",
            "9:84",
            "57:22",
            "64:13",
            "24:17"
        ],
        "BIBLE": [
            "prophets:ezekiel:20:44",
            "torah:exodus:35:2",
            "prophets:ezekiel:7:4",
            "writings:psalms:139:24",
            "writings:psalms:119:126",
            "prophets:ezekiel:7:9",
            "prophets:jeremiah:12:16",
            "writings:job:3:23",
            "prophets:jeremiah:8:8",
            "torah:deuteronomy:31:18"
        ]
    }
}