{
    "VERSE": "4:172",
    "ARABIC": "لَّن يَسْتَنكِفَ ٱلْمَسِيحُ أَن يَكُونَ عَبْدًا لِّلَّهِ وَلَا ٱلْمَلَٰٓئِكَةُ ٱلْمُقَرَّبُونَ وَمَن يَسْتَنكِفْ عَنْ عِبَادَتِهِۦ وَيَسْتَكْبِرْ فَسَيَحْشُرُهُمْ إِلَيْهِ جَمِيعًا",
    "ENGLISH": {
        "TRANSLATION_0": "The Messiah would never disdain to be a slave to Allah nor would the angels near to Him. If any do disdain to worship Him, and grow arrogant, He will in any case gather them all to Him.",
        "TRANSLATION_1": "The Christ will never disdain to be a votary of God, nor will the angels close to Him. And those who disdain to serve Him and are proud (should remember) that they will all go back to Him in the end.\n",
        "TRANSLATION_2": "The Messiah neither did disdain to be a servant of Allah nor do the angels who are stationed near to Him; and whoever disdains to serve Him, and waxes arrogant, Allah will certainly muster them all to Him.\n",
        "TRANSLATION_3": "Jesus never disdained the worship of God nor did the nearest angels to God. Whoever, out of pride, disdains the worship of God should know that everyone will be brought before Him.\n",
        "TRANSLATION_4": "The Messiah does not at all hate being a bondman of Allah, and nor do the close angels; and whoever hates worshipping Him and is conceited – so very soon He will gather them all towards Him.\n",
        "TRANSLATION_5": "Al-Masih will never be too proud to be a servant of Allah, nor the angels who are the near (to Allah). And whosoever rejects His worship and is proud, then He will gather them all together unto Himself.\n",
        "TRANSLATION_6": "The Messiah does by no means disdain that he should be a servant of Allah, nor do the angels who are near to Him, and whoever disdains His service and is proud, He will gather them all together to Himself.\n",
        "TRANSLATION_7": "The Messiah will not disdain to be a servant of God, neither the angels who are near stationed to Him. Whosoever disdains to serve Him, and waxes proud, He will assuredly muster them to Him, all of them.\n",
        "TRANSLATION_8": "The Messiah will never scorn to be a slave unto Allah, nor will the favoured angels. Whoso scorneth His service and is proud, all such will He assemble unto Him;\n",
        "TRANSLATION_9": "Surely, the Messiah would never disdain to be accounted a servant of God. Nor would the angels who are nearest to Him. If any do disdain to worship Him, and grow arrogant, He will in any case gather them all before Him.\n",
        "TRANSLATION_10": "The Messiah disdaineth not that he should be a bondman of Allah, nor do the angels brought near. And whosoever disdaineth serving Him and stiff-necked, anon He shall gather them all unto Him.\n",
        "TRANSLATION_11": "The Messiah would never disdain being a servant of Allah, nor would the angels brought near [to Him]. And whoever disdains His worship and is arrogant, He will gather them all toward Him.\n",
        "TRANSLATION_12": "Christ disdaineth nor to serve and worship Allah, nor do the angels, those nearest (to Allah): those who disdain His worship and are arrogant,-He will gather them all together unto Himself to (answer).\n",
        "TRANSLATION_13": "The Messiah will never be proud to reject to be a slave to Allah, nor the angels who are near (to Allah). And whosoever rejects His worship and is proud, then He will gather them all together unto Himself.\n",
        "TRANSLATION_14": "The Messiah would not despise being a worshiper of Allah, nor would the angels who are near. Whosoever despises worshipping Him, and becomes proud, He will surely assemble them all to Him.\n",
        "TRANSLATION_15": "The Messiah does not disdain to be a servant of God, nor do the favored angels. Whoever disdains His worship, and is too arrogant—He will round them up to Himself altogether.\n",
        "TRANSLATION_16": "Never would the Messiah disdain to be a servant of Allah, nor would the angels near [to Him]. And whoever disdains His worship and is arrogant - He will gather them to Himself all together.\n",
        "TRANSLATION_17": "[4:172] The Messiah, whom you claim is a god, would never disdain, [would never] scorn or reject haughtily, to be a servant of God, neither would the angels who are nigh, to God, disdain to be servants: this is a splendid digression [to the matter of the angels], and it is mentioned as a refutation of those who claim that they [the angels] are gods or the daughters of God, just as He refuted, with what was stated before, the Christians who claim that which is the subject of the address to them [above]. Whoever disdains to worship Him, and waxes proud, He will assuredly muster them to Him, all of them, in the Hereafter.\n",
        "TRANSLATION_18": "(The Messiah will never scorn to be a slave unto Allah) he will never not acknowledge his servitude to Allah. 109 This was revealed in respect of the Christians saying to the Prophet: \"0 Muhammad, what you say of Jesus is shameful\". Allah said to them: it is not shameful that Jesus be the servant of Allah, (nor will the favoured angels) nor would the favoured angels, the carriers of the Throne, ever not acknowledge that they are servants of Allah. (Whoso scorneth His service) whoever scorns to acknowledge that being his servant (and is proud) is too proud to believe in Allah, (all such) believers and unbelievers (will He assemble unto Him) on the Day of Judgement.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "4:172",
            "7:186",
            "2:98",
            "39:17",
            "28:82",
            "3:160",
            "16:2",
            "37:169",
            "8:61",
            "3:57"
        ],
        "BIBLE": [
            "torah:numbers:18:7",
            "prophets:ezekiel:38:8",
            "torah:exodus:3:12",
            "prophets:jeremiah:5:31",
            "prophets:i%20kings:9:9",
            "writings:i%20chronicles:28:21",
            "writings:ii%20chronicles:7:22",
            "prophets:i%20samuel:8:8",
            "prophets:ii%20samuel:15:8",
            "prophets:jeremiah:16:13"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:6:3",
            
            "Sefer%20Yetzirah:3:2"
        ]
    }
}