{
    "VERSE": "4:173",
    "ARABIC": "فَأَمَّا ٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّٰلِحَٰتِ فَيُوَفِّيهِمْ أُجُورَهُمْ وَيَزِيدُهُم مِّن فَضْلِهِۦ وَأَمَّا ٱلَّذِينَ ٱسْتَنكَفُوا۟ وَٱسْتَكْبَرُوا۟ فَيُعَذِّبُهُمْ عَذَابًا أَلِيمًا وَلَا يَجِدُونَ لَهُم مِّن دُونِ ٱللَّهِ وَلِيًّا وَلَا نَصِيرًا",
    "ENGLISH": {
        "TRANSLATION_0": "As for those who have iman and do right actions, He will pay them their wages in full and will give them increase from His favour. As for those who show disdain and grow arrogant, He will punish them with a painful punishment. They will not find any protector or helper for themselves besides Allah.",
        "TRANSLATION_1": "Then those who believed and earned good deeds will be given their recompense in full, and even more out of grace. But those who disdain and who boast will receive a painful punishment. They will find none except God to help them or save them.\n",
        "TRANSLATION_2": "He will grant those who have believed and done good deeds their rewards in full, and will give them more out of His bounty. He will bestow upon those who have been disdainful and arrogant a painful chastisement; and they will find for themselves neither a guardian nor a helper besides Allah.\n",
        "TRANSLATION_3": "The righteously striving believers will receive the reward for their deeds and extra favors from God. But those who disdain the worship of God out of pride will suffer the most painful torment. They will find no guardian or helper besides God.\n",
        "TRANSLATION_4": "Then to those who believed and did good deeds, He will pay their wages in full and by His munificence, give them more; and to those who hated (worshipping Him) and were proud, He will inflict a painful punishment; and they will not find for themselves, other than Allah, any supporter nor any aide.\n",
        "TRANSLATION_5": "So, as for those who believed and did deeds of righteousness, He will give them their (due) rewards and more out of His bounty. But as for those who refused His worship and were proud, He will punish them with a painful torment. And they will not find for themselves besides Allah any protector or helper.\n",
        "TRANSLATION_6": "Then as for those who believe and do good, He will pay them fully their rewards and give them more out of His grace; and as for those who disdain and are proud, He will chastise them with a painful chastisement. And they shall not find for themselves besides Allah a guardian or a helper\n",
        "TRANSLATION_7": "As for the believers, who do deeds of righteousness, He will pay them in full their wages, and He will give them more, of His bounty; and as for them who disdain, and wax proud, them He will chastise with a painful chastisement, and they shall not find for them, apart from God, a friend or helper.\n",
        "TRANSLATION_8": "Then, as for those who believed and did good works, unto them will He pay their wages in full, adding unto them of His bounty; and as for those who were scornful and proud, them will He punish with a painful doom. And they will not find for them, against Allah, any protecting friend or helper.\n",
        "TRANSLATION_9": "Those who believe and do good works will be fully recompensed by Him. And He will give them yet more out of His bounty; and as for those who were disdainful and proud, He will punish them with a painful punishment. And they will not find anyone to help or protect them against God.\n",
        "TRANSLATION_10": "Then as to those who have believed and worked righteous works, He shall give unto them their hire in full and shall give unto them an increase out of His grace. And as to those who disdained and were stiff-necked, He shall torment them with a torment afflictive. And they shall not find for themselves, against Allah, a protecting friend or a helper.\n",
        "TRANSLATION_11": "As for those who have faith and do righteous deeds, He will pay them in full their rewards, and He will enhance them out of His grace. But those who are disdainful and arrogant, He will punish them with a painful punishment, and they will not find besides Allah any guardian or helper.\n",
        "TRANSLATION_12": "But to those who believe and do deeds of righteousness, He will give their (due) rewards,- and more, out of His bounty: But those who are disdainful and arrogant, He will punish with a grievous penalty; Nor will they find, besides Allah, any to protect or help them.\n",
        "TRANSLATION_13": "So, as for those who believed (in the Oneness of Allah - Islamic Monotheism) and did deeds of righteousness, He will give their (due) rewards, and more out of His Bounty. But as for those who refuse His worship and were proud, He will punish them with a painful torment. And they will not find for themselves besides Allah any protector or helper.\n",
        "TRANSLATION_14": "As for those who believe and did good deeds, He will pay them in full their wages, and He will increase them from His Bounty. As for those who despise and became proud, He will punish them with a painful punishment, and they will find neither a guide nor a helper for themselves, other than Allah.\n",
        "TRANSLATION_15": "But as for those who believe and do good works, He will pay them their wages in full, and will increase His grace for them. But as for those who disdain and are too proud, He will punish them with an agonizing punishment. And they will find for themselves, apart from God, no lord and no savior.\n",
        "TRANSLATION_16": "And as for those who believed and did righteous deeds, He will give them in full their rewards and grant them extra from His bounty. But as for those who disdained and were arrogant, He will punish them with a painful punishment, and they will not find for themselves besides Allah any protector or helper.\n",
        "TRANSLATION_17": "[4:173] As for those who believed, who did righteous deeds, He will pay them in full their wages, the reward for their deeds, and He will give them more of His bounty, what no eye has seen, no ear has heard and no man’s heart has ever wished for; and as for them who disdain and are too proud, to worship Him, He will chastise them with a painful chastisement, which is the chastisement of the Fire, and they shall not find for themselves, besides God, that is, other than Him, any friend, to ward it off them, or helper, to protect them from it.\n",
        "TRANSLATION_18": "(Then, as for those who believed) in Muhammad and the Qur'an (and did good works) acts of obedience in that which is between them and their Lord, (unto them will He pay their wages) their reward in Paradise (in full, adding unto them of His bounty) of His favour; (and as for those who were scornful and proud) too proud to believe in Muhammad and the Qur'an, (them will He punish with a painful doom). (And they will not find for them, against Allah, any protecting friend) any relative to benefit them (or helper) to save them from Allah's punishment.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "4:173",
            "9:74",
            "42:31",
            "11:20",
            "5:51",
            "3:57",
            "29:22",
            "9:79",
            "3:171",
            "45:10"
        ],
        "BIBLE": [
            "writings:ecclesiastes:2:17",
            "prophets:joshua:23:16",
            "writings:psalms:73:28",
            "torah:numbers:14:11",
            "torah:exodus:34:10",
            "writings:psalms:24:5",
            "prophets:jeremiah:7:28",
            "torah:deuteronomy:15:10",
            "writings:psalms:40:6",
            "prophets:isaiah:26:12"
        ]
    }
}