{
    "VERSE": "4:174",
    "ARABIC": "يَٰٓأَيُّهَا ٱلنَّاسُ قَدْ جَآءَكُم بُرْهَٰنٌ مِّن رَّبِّكُمْ وَأَنزَلْنَآ إِلَيْكُمْ نُورًا مُّبِينًا",
    "ENGLISH": {
        "TRANSLATION_0": "Mankind! a clear proof has come to you from your Lord. We have sent down a Clear Light to you.",
        "TRANSLATION_1": "O men, you have received infallible proof from your Lord, and We have sent down a beacon light to you.\n",
        "TRANSLATION_2": "O men! A proof has come to you from your Lord, and We have sent down unto you a clear light.\n",
        "TRANSLATION_3": "Mankind, an undeniable proof has certainly come to you and We have sent you a shining light\n",
        "TRANSLATION_4": "O mankind! Indeed the clear proof from your Lord has come to you, and We have sent down to you a bright light. (The Holy Prophet is a Clear Proof from Allah.)\n",
        "TRANSLATION_5": "O mankind! Verily, there has come to you a convincing proof from your Lord; and We sent down to you a manifest light.\n",
        "TRANSLATION_6": "O people! surely there has come to you manifest proof from your Lord and We have sent to you clear light.\n",
        "TRANSLATION_7": "O men, a proof has now come to you from your Lord; We have sent down to you a manifest light.\n",
        "TRANSLATION_8": "O mankind! Now hath a proof from your Lord come unto you, and We have sent down unto you a clear light;\n",
        "TRANSLATION_9": "Men, you have received clear evidence from your Lord. We have sent down a clear light to you.\n",
        "TRANSLATION_10": "O ye mankind! there surely hath come unto you a proof from your Lord, and We have sent down unto you a manifest light.\n",
        "TRANSLATION_11": "O mankind! Certainly, a proof has come to you from your Lord, and We have sent down to you a manifest light.\n",
        "TRANSLATION_12": "O mankind! verily there hath come to you a convincing proof from your Lord: For We have sent unto you a light (that is) manifest.\n",
        "TRANSLATION_13": "O mankind! Verily, there has come to you a convincing proof (Prophet Muhammad SAW) from your Lord, and We sent down to you a manifest light (this Quran).\n",
        "TRANSLATION_14": "O people, a proof has come to you from your Lord, and We have sent down to you a clear light.\n",
        "TRANSLATION_15": "O people! A proof has come to you from your Lord, and We sent down to you a clear light.\n",
        "TRANSLATION_16": "O mankind, there has come to you a conclusive proof from your Lord, and We have sent down to you a clear light.\n",
        "TRANSLATION_17": "[4:174] O people, a proof, a definitive argument, has now come to you from your Lord, against you, namely, the Prophet (s), and We have revealed to you a manifest, a clear, light, namely, the Qur’ān.\n",
        "TRANSLATION_18": "(0 mankind!) people of Mecca! (Now hath a proof from your Lord) a messenger from your Lord: Muhammad (pbuh) (come unto you, and We have sent down unto you) unto your Prophet (a clear light) a Scripture that exposits that which is lawful and that which is unlawful;\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "4:174",
            "114:1",
            "2:21",
            "5:67",
            "3:192",
            "10:108",
            "10:57",
            "12:24",
            "37:100",
            "68:50"
        ],
        "BIBLE": [
            "writings:job:37:21",
            "prophets:isaiah:2:5",
            "prophets:isaiah:60:1",
            "prophets:i%20samuel:25:34",
            "writings:psalms:89:16",
            "prophets:i%20samuel:25:22",
            "prophets:judges:13:8",
            "prophets:ezekiel:37:9",
            "prophets:ii%20kings:5:8",
            "torah:leviticus:21:21"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:8",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:3:6",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:5"
        ]
    }
}