{
    "VERSE": "4:175",
    "ARABIC": "فَأَمَّا ٱلَّذِينَ ءَامَنُوا۟ بِٱللَّهِ وَٱعْتَصَمُوا۟ بِهِۦ فَسَيُدْخِلُهُمْ فِى رَحْمَةٍ مِّنْهُ وَفَضْلٍ وَيَهْدِيهِمْ إِلَيْهِ صِرَٰطًا مُّسْتَقِيمًا",
    "ENGLISH": {
        "TRANSLATION_0": "As for those who have iman in Allah and hold fast to Him, He will admit them into mercy and favour from Him and will guide them to Him on a straight path.",
        "TRANSLATION_1": "So those who believe in God and hold fast to Him shall indeed be received into His mercy and His grace, and be guided to Him the straight path.\n",
        "TRANSLATION_2": "Allah will surely admit those who believe in Him and hold fast to Him to His mercy and bounty, and will guide them on to a straight way to Himself.\n",
        "TRANSLATION_3": "Those who believe in God and seek His protection will receive His mercy, favors, and His guidance to the right path.\n",
        "TRANSLATION_4": "So those who believed in Allah and held fast to His rope – He will admit them into His mercy and munificence, and will guide them on the Straight Path towards Himself.\n",
        "TRANSLATION_5": "So, as for those who believed in Allah and held fast to [depend on] Him, He will admit them to His mercy and grace (i.e. Paradise), and guide them to Himself by a straight path.\n",
        "TRANSLATION_6": "Then as for those who believe in Allah and hold fast by Him, He will cause them to enter into His mercy and grace and guide them to Himself on a right path.\n",
        "TRANSLATION_7": "As for those who believe in God, and hold fast to Him, He will surely admit them to mercy from Him, and bounty, and will guide them to Him on a straight path.\n",
        "TRANSLATION_8": "As for those who believe in Allah, and hold fast unto Him, them He will cause to enter into His mercy and grace, and will guide them unto Him by a straight road.\n",
        "TRANSLATION_9": "As for those who believe in God and hold fast to Him, He will admit them to His mercy and His grace; He will guide them towards Him on a straight path.\n",
        "TRANSLATION_10": "Then as to those who believe in Allah and hold fast by Him, anon He shall make them enter into a mercy from Himself and grace and shall lead them unto Himself by a path straight.\n",
        "TRANSLATION_11": "As for those who have faith in Allah, and hold fast to Him, He will admit them to His mercy and grace, and He will guide them on a straight path to Him.\n",
        "TRANSLATION_12": "Then those who believe in Allah, and hold fast to Him,- soon will He admit them to mercy and grace from Himself, and guide them to Himself by a straight way.\n",
        "TRANSLATION_13": "So, as for those who believed in Allah and held fast to Him, He will admit them to His Mercy and Grace (i.e. Paradise), and guide them to Himself by a Straight Path.\n",
        "TRANSLATION_14": "Those who believe in Allah and hold fast to Him, He will surely admit them to a Mercy and Bounty from Him, and He will guide them to Him on a Straight Path.\n",
        "TRANSLATION_15": "As for those who believe in God, and hold fast to Him, He will admit them into mercy and grace from Him, and will guide them to Himself in a straight path.\n",
        "TRANSLATION_16": "So those who believe in Allah and hold fast to Him - He will admit them to mercy from Himself and bounty and guide them to Himself on a straight path.\n",
        "TRANSLATION_17": "[4:175] As for those who believe in God, and hold fast to Him, He will surely admit them to mercy from Him, and bounty, and He will guide them to Him by a straight path, namely, the religion of Islam.\n",
        "TRANSLATION_18": "(As for those who believe in Allah) as well as in Muhammad and the Qur'an, (and hold fast unto Him) and hold fast to believing in Allah's divine Oneness, (them He will cause to enter into His mercy) in Paradise (and grace) and they shall also receive His honour, (and will guide them unto Him by a straight road) He will confirm them on a straight path in this world. He says: He will confirm them in this world in faith and will enter them into Paradise in the Hereafter.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "4:175",
            "3:107",
            "24:20",
            "24:10",
            "10:58",
            "3:74",
            "2:64",
            "9:59",
            "4:16",
            "9:75"
        ],
        "BIBLE": [
            "torah:genesis:21:18",
            "writings:proverbs:11:5",
            "torah:leviticus:25:46",
            "writings:psalms:85:14",
            "writings:job:11:3",
            "writings:job:40:19",
            "prophets:ii%20samuel:22:33",
            "torah:leviticus:20:25",
            "prophets:hosea:2:8",
            "prophets:jeremiah:20:9"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:13",
            "Sefer%20Yetzirah:4:5",
            
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:12"
        ]
    }
}