{
    "VERSE": "4:22",
    "ARABIC": "وَلَا تَنكِحُوا۟ مَا نَكَحَ ءَابَآؤُكُم مِّنَ ٱلنِّسَآءِ إِلَّا مَا قَدْ سَلَفَ إِنَّهُۥ كَانَ فَٰحِشَةً وَمَقْتًا وَسَآءَ سَبِيلًا",
    "ENGLISH": {
        "TRANSLATION_0": "Do not marry any women your fathers married - except for what may have already taken place. That is an indecent act, a loathsome thing and an evil path.",
        "TRANSLATION_1": "And do not wed the women your fathers had wed. What happened in the past is now past: It was lewd and abhorrent, and only the way of evil.\n",
        "TRANSLATION_2": "Do not marry the women whom your fathers married, although what is past is past. This indeed was a shameful deed, a hateful thing, and an evil way.\n",
        "TRANSLATION_3": "Do not marry, from now on, the ex-wives of your fathers for that custom was sinful, loathsome, and abominable.\n",
        "TRANSLATION_4": "And do not marry the women who were wedded to your fathers (and grand fathers), except what has already passed; that is indeed an act of shame and great wrong; and an evil way.\n",
        "TRANSLATION_5": "And marry not women whom your fathers married, except what has already passed; indeed it was shameful and Maqtan, and an evil way.\n",
        "TRANSLATION_6": "And marry not woman whom your fathers married, except what has already passed; this surely is indecent and hateful, and it is an evil way.\n",
        "TRANSLATION_7": "And do not marry women that your fathers married, unless it be a thing of the past; surely that is indecent and hateful; an evil way.\n",
        "TRANSLATION_8": "And marry not those women whom your fathers married, except what hath already happened (of that nature) in the past. Lo! it was ever lewdness and abomination, and an evil way.\n",
        "TRANSLATION_9": "Do not marry women whom your fathers married, except for what has already taken place in the past. This is indeed a shameful deed, a loathsome thing and an evil practice.\n",
        "TRANSLATION_10": "And wed not of women those whom your fathers had wedded, except that which hath already passed. Verily it hath been an indecency and an abomination and an evil way:\n",
        "TRANSLATION_11": "Do not marry any of the women whom your fathers had married, excluding what is already past. That is indeed an indecency, an outrage and an evil course.\n",
        "TRANSLATION_12": "And marry not women whom your fathers married,- except what is past: It was shameful and odious,- an abominable custom indeed.\n",
        "TRANSLATION_13": "And marry not women whom your fathers married, except what has already passed; indeed it was shameful and most hateful, and an evil way.\n",
        "TRANSLATION_14": "And do not marry women your fathers married unless it is a thing of the past surely that was an indecency, hated, and a way of evil.\n",
        "TRANSLATION_15": "Do not marry women whom your fathers married, except what is already past. That is improper, indecent, and a bad custom.\n",
        "TRANSLATION_16": "And do not marry those [women] whom your fathers married, except what has already occurred. Indeed, it was an immorality and hateful [to Allah] and was evil as a way.\n",
        "TRANSLATION_17": "[4:22] And do not marry women whom (mā means man) your fathers married, unless it be a thing of the past, which is forgiven you; surely that, marrying them, is obscene, vile, and abominable (maqtan, means it results in maqt, ‘severe hate’, from God), an evil way, [an evil] path is this.\n",
        "TRANSLATION_18": "He said: (And marry not those women whom your fathers married, except what hath already happened (of 85 that nature) in the past) in the pre-Islamic era. (Lo! It) i.e. marrying the wives of one's father (was ever lewdness) a transgression (and abomination) antagonism, (and an evil way) the worst way to follow. This was revealed about Muhsin Ibn Abi Qays al-Ansari. Allah then showed them the women who are unlawful for them to marry.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "4:22",
            "17:32",
            "4:15",
            "26:86",
            "4:98",
            "7:28",
            "2:169",
            "29:28",
            "65:1",
            "2:190"
        ],
        "BIBLE": [
            "torah:genesis:48:1",
            "prophets:i%20samuel:30:2",
            "writings:ii%20chronicles:20:33",
            "prophets:i%20kings:13:33",
            "prophets:jeremiah:13:7",
            "torah:numbers:36:3",
            "prophets:ezekiel:16:25",
            "prophets:i%20samuel:30:19",
            "prophets:i%20samuel:26:25",
            "writings:ii%20chronicles:17:6"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:5"
        ]
    }
}