{
    "VERSE": "4:28",
    "ARABIC": "يُرِيدُ ٱللَّهُ أَن يُخَفِّفَ عَنكُمْ وَخُلِقَ ٱلْإِنسَٰنُ ضَعِيفًا",
    "ENGLISH": {
        "TRANSLATION_0": "Allah desires to make things lighter for you. Man was created weak.",
        "TRANSLATION_1": "God would like to lighten your burden, for man was created weak.\n",
        "TRANSLATION_2": "Allah wants to lighten your burdens, for man was created weak.\n",
        "TRANSLATION_3": "God wants to relieve you of your burden; all human beings were created weak.\n",
        "TRANSLATION_4": "Allah wills to lessen your burden; and man was created weak.\n",
        "TRANSLATION_5": "Allah wishes to lighten (the burden) for you; and man was created weak.\n",
        "TRANSLATION_6": "Allah desires that He should make light your burdens, and man is created weak.\n",
        "TRANSLATION_7": "God desires to lighten things for you, for man was created a weakling.\n",
        "TRANSLATION_8": "Allah would make the burden light for you, for man was created weak.\n",
        "TRANSLATION_9": "God wishes to lighten your burdens, for, man has been created weak.\n",
        "TRANSLATION_10": "Allah intendeth that he shall lighten unto you, and man hath been created weak.\n",
        "TRANSLATION_11": "Allah desires to lighten your burden, for man was created weak.\n",
        "TRANSLATION_12": "Allah doth wish to lighten your (difficulties): For man was created Weak (in flesh).\n",
        "TRANSLATION_13": "Allah wishes to lighten (the burden) for you; and man was created weak (cannot be patient to leave sexual intercourse with woman).\n",
        "TRANSLATION_14": "Allah wishes to lighten for you (the jurisprudence), and humans are created weak.\n",
        "TRANSLATION_15": "God intends to lighten your burden, for the human being was created weak.\n",
        "TRANSLATION_16": "And Allah wants to lighten for you [your difficulties]; and mankind was created weak.\n",
        "TRANSLATION_17": "[4:28] God desires to lighten things for you, and make the rulings of the Law easier for you; for man was created weak, unable to abstain from women and passions.\n",
        "TRANSLATION_18": "(Allah would make the burden light for you) He wishes to make things easy for you by marrying captives in case of necessity, (for man was created weak) in that he cannot do without women.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "4:28",
            "71:17",
            "8:66",
            "55:3",
            "3:122",
            "39:11",
            "81:29",
            "3:95",
            "4:61",
            "72:5"
        ],
        "BIBLE": [
            "prophets:isaiah:42:16",
            "prophets:jeremiah:16:20",
            "torah:exodus:30:32",
            "torah:exodus:25:37",
            "prophets:ii%20kings:7:19",
            "torah:genesis:2:18",
            "prophets:ii%20samuel:23:5",
            "writings:psalms:37:6",
            "torah:leviticus:11:43",
            "torah:genesis:1:26"
        ]
    }
}