{
    "VERSE": "4:31",
    "ARABIC": "إِن تَجْتَنِبُوا۟ كَبَآئِرَ مَا تُنْهَوْنَ عَنْهُ نُكَفِّرْ عَنكُمْ سَيِّـَٔاتِكُمْ وَنُدْخِلْكُم مُّدْخَلًا كَرِيمًا",
    "ENGLISH": {
        "TRANSLATION_0": "If you avoid the serious wrong actions you have been forbidden, We will erase your bad actions from you and admit you by a Gate of Honour.",
        "TRANSLATION_1": "If you keep away from the deadly sins that have been forbidden, We shall efface your faults, and lead you to a place of honour.\n",
        "TRANSLATION_2": "But if you avoid the major sins which you have been forbidden, We shall remit your (trivial) offences, and cause you to enter an honourable abode.\n",
        "TRANSLATION_3": "If you avoid violating that which has been prohibited, your (lesser) sins will be forgiven and you will be admitted into an exalted dwelling.\n",
        "TRANSLATION_4": "If you keep avoiding the cardinal sins that are forbidden to you, We will forgive you your other (lesser) sins and admit you into a noble place.\n",
        "TRANSLATION_5": "If you avoid the great sins which you are forbidden to do, We shall remit from you your (small) sins, and admit you to a Noble Entrance (i.e. Paradise).\n",
        "TRANSLATION_6": "If you shun the great sins which you are forbidden, We will do away with your small sins and cause you to enter an honorable place of entering.\n",
        "TRANSLATION_7": "If you avoid the heinous sins that are forbidden you, We will acquit you of your evil deeds, and admit you by the gate of honour.\n",
        "TRANSLATION_8": "If ye avoid the great (things) which ye are forbidden, We will remit from you your evil deeds and make you enter at a noble gate.\n",
        "TRANSLATION_9": "If you shun the great sins you have been forbidden, We shall cancel out your minor misdeeds and admit you to a place of honour.\n",
        "TRANSLATION_10": "If ye shun the grievous sins from which ye are prohibited, We shall expiate from you your misdeeds, and make you enter a noble Entrance.\n",
        "TRANSLATION_11": "If you avoid the major sins that you are forbidden, We will absolve you of your misdeeds and admit you to a noble abode.\n",
        "TRANSLATION_12": "If ye (but) eschew the most heinous of the things which ye are forbidden to do, We shall expel out of you all the evil in you, and admit you to a gate of great honour.\n",
        "TRANSLATION_13": "If you avoid the great sins which you are forbidden to do, We shall remit from you your (small) sins, and admit you to a Noble Entrance (i.e. Paradise).\n",
        "TRANSLATION_14": "If you avoid the major sins that are forbidden to you, We shall pardon your evil deeds and admit you by an entrance of honor.\n",
        "TRANSLATION_15": "If you avoid the worst of what you are forbidden, We will remit your sins, and admit you by a Gate of Honor.\n",
        "TRANSLATION_16": "If you avoid the major sins which you are forbidden, We will remove from you your lesser sins and admit you to a noble entrance [into Paradise].\n",
        "TRANSLATION_17": "[4:31] If you avoid the grave sins that are forbidden you, those for which the threat of punishment has been prescribed, like murder, fornication or theft — according to Ibn ‘Abbās, these number as much as seven hundred — We will absolve you of your, minor, evil deeds, on account of your acts of obedience, and admit you by an honourable gate (read mudkhalan or madkhalan), that is, [by an honourable] admittance or location, namely, Paradise.\n",
        "TRANSLATION_18": "(If you avoid the great (things) which ye are forbidden) in this surah, (We will remit from you your evil deeds) We will forgive you your sins which are not included among the enormities: the minor sins committed between the period separating a congregational prayer from another, those sins committed in the period separating one Friday Prayer from another, as well as those sins committed in the period separating one month of Ramadan from another, (and make you enter) in the Hereafter (at a noble gate) Paradise.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "4:31",
            "39:48",
            "45:33",
            "16:34",
            "17:43",
            "42:25",
            "71:22",
            "11:35",
            "33:44",
            "82:6"
        ],
        "BIBLE": [
            "torah:leviticus:5:13",
            "torah:leviticus:16:16",
            "prophets:jeremiah:24:9",
            "prophets:isaiah:13:13",
            "torah:exodus:23:13",
            "torah:exodus:20:21",
            "writings:i%20chronicles:21:3",
            "prophets:ezekiel:34:26",
            "prophets:ezekiel:26:14",
            "writings:esther:1:20"
        ]
    }
}