{
    "VERSE": "4:35",
    "ARABIC": "وَإِنْ خِفْتُمْ شِقَاقَ بَيْنِهِمَا فَٱبْعَثُوا۟ حَكَمًا مِّنْ أَهْلِهِۦ وَحَكَمًا مِّنْ أَهْلِهَآ إِن يُرِيدَآ إِصْلَٰحًا يُوَفِّقِ ٱللَّهُ بَيْنَهُمَآ إِنَّ ٱللَّهَ كَانَ عَلِيمًا خَبِيرًا",
    "ENGLISH": {
        "TRANSLATION_0": "If you fear a breach between a couple, send an arbiter from his people and an arbiter from her people. If the couple desire to put things right, Allah will bring about a reconciliation between them. Allah is All-Knowing, All-Aware.",
        "TRANSLATION_1": "If you fear a breach between them, appoint one arbiter from the people of the man and one from the people of the woman. If they wish to have a settlement then God will reconcile them, for God is all-knowing and cognisant.\n",
        "TRANSLATION_2": "If you fear a breach between the two, appoint an arbitrator from his people and an arbitrator from her people. If they both want to set things right, Allah will bring about reconciliation between them. Allah knows all, is well aware of everything.\n",
        "TRANSLATION_3": "If there appears to be discord between a wife and her husband and if they desire reconciliation choose arbiters from the families of both sides. God will bring them together; God is All-knowing and All-aware.\n",
        "TRANSLATION_4": "And if you fear a dispute between husband and wife, send an arbitrator from the man’s family and an arbitrator from the woman’s family; if these two wish conciliation, Allah will unite them; indeed Allah is All Knowing, Well Aware.\n",
        "TRANSLATION_5": "If you fear a breach between the two, appoint (two) arbitrators, one from his family and the other from her's; if they both wish for peace, Allah will cause their reconciliation. Indeed Allah is Ever All-Knower, Well-Acquainted with all things.\n",
        "TRANSLATION_6": "And if you fear a breach between the two, then appoint judge from his people and a judge from her people; if they both desire agreement, Allah will effect harmony between them, surely Allah is Knowing, Aware.\n",
        "TRANSLATION_7": "And if you fear a breach between the two, bring forth an arbiter from his people and from her people an arbiter, if they desire to set things right; God will compose their differences; surely God is All-knowing, All-aware.\n",
        "TRANSLATION_8": "And if ye fear a breach between them twain (the man and wife), appoint an arbiter from his folk and an arbiter from her folk. If they desire amendment Allah will make them of one mind. Lo! Allah is ever Knower, Aware.\n",
        "TRANSLATION_9": "If you fear any breach between a man and his wife, appoint one arbiter from his family and one arbiter from her family. If they both want to set things right, God will bring about a reconciliation between them: He is all knowing and all aware.\n",
        "TRANSLATION_10": "And if ye fear a divergence between the twain, set up an arbiter from his household and an arbiter from her household; then if the twain desire rectification Allah shall bring harmony between the twain; verily Allah is ever Knowing, Aware.\n",
        "TRANSLATION_11": "If you fear a split between the two of them, then appoint an arbiter from his relatives and an arbiter from her relatives. If they desire reconcilement, Allah shall reconcile them. Indeed Allah is all-knowing, all-aware.\n",
        "TRANSLATION_12": "If ye fear a breach between them twain, appoint (two) arbiters, one from his family, and the other from hers; if they wish for peace, Allah will cause their reconciliation: For Allah hath full knowledge, and is acquainted with all things.\n",
        "TRANSLATION_13": "If you fear a breach between them twain (the man and his wife), appoint (two) arbitrators, one from his family and the other from her's; if they both wish for peace, Allah will cause their reconciliation. Indeed Allah is Ever All-Knower, Well-Acquainted with all things.\n",
        "TRANSLATION_14": "If you fear a breach between them send for an arbiter from his people and an arbiter from her people. If both wish reconciliation, Allah will bring success between them. Allah is the Knower, the Aware.\n",
        "TRANSLATION_15": "If you fear a breach between the two, appoint an arbiter from his family and an arbiter from her family. If they wish to reconcile, God will bring them together. God is Knowledgeable, Expert.\n",
        "TRANSLATION_16": "And if you fear dissension between the two, send an arbitrator from his people and an arbitrator from her people. If they both desire reconciliation, Allah will cause it between them. Indeed, Allah is ever Knowing and Acquainted [with all things].\n",
        "TRANSLATION_17": "[4:35]   And if you fear, become aware of, a breach, a dispute, between the two, the married couple (the genitive construction shiqāqa baynihimā, ‘[any] breach between the two’, is for a range [of alternatives], in other words: shiqāqan baynihimā [is the normal construction]) send forth, for them with their consent, an arbiter, a just man, from his folk, his kinsmen, and an arbiter from her folk: the husband delegates to his arbiter the [matter of] divorce or the acceptance of compensation in its place, while she delegates to her arbiter the [matter of] separation. The two arbiters do their best and bid the one guilty of the injustice to desist, or they suggest separation if they see fit. God, exalted be He, says, if they, the two arbiters, desire to set things right, God will grant them, the married couple, success, determining for them what constitutes [an act of] obedience, be it reconciliation or separation. Surely God is ever Knower, of everything, Aware, of what is hidden and what is manifested.\n",
        "TRANSLATION_18": "(And if ye fear) if you know (a breech between them twain (the man and wife)) a dispute between the man and woman and you cannot establish who is at fault, (appoint an arbiter from his folk) from the man's folk to the man so that he can hear what he has to say and therefore establish whether he is in the right or wrong (and an arbiter from her folk) from the woman's folk to the woman in order to hear what she has to say and therefore establish whether she is in the right or wrong. (If they) the arbiters (desire amendment) between the man and the woman, (Allah will make them of one mind) i.e. the arbiters, the man and the woman. (Lo! Allah is ever Knower) of the agreement and disagreement of the arbiters, (Aware) of the doing of the woman and the man. The verses from Allah's saying: (Men are in charge of women, because Allah hath made the one of them to excel the other...) to His saying: (If they desire amendment Allah will make them of one mind. Lo! Allah is ever Knower, Aware) were revealed about the daughter of Muhammad Ibn Salamah. Her husband, As'ad Ibn al-Rabi' had slapped her because she refused to sleep with him. Consequently, she went to the Prophet (pbuh) to seek retaliation against her husband, but Allah prohibited her from doing so.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "4:35",
            "17:96",
            "8:71",
            "4:16",
            "4:92",
            "4:104",
            "2:209",
            "27:78",
            "24:18",
            "4:128"
        ],
        "BIBLE": [
            "prophets:ii%20samuel:23:5",
            "prophets:ezekiel:37:26",
            "prophets:amos:6:10",
            "writings:daniel:3:29",
            "prophets:ezekiel:14:8",
            "prophets:ezekiel:26:20",
            "torah:exodus:32:1",
            "writings:daniel:11:17",
            "torah:exodus:32:23",
            "torah:exodus:18:16"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:3:6"
        ]
    }
}