{
    "VERSE": "4:39",
    "ARABIC": "وَمَاذَا عَلَيْهِمْ لَوْ ءَامَنُوا۟ بِٱللَّهِ وَٱلْيَوْمِ ٱلْءَاخِرِ وَأَنفَقُوا۟ مِمَّا رَزَقَهُمُ ٱللَّهُ وَكَانَ ٱللَّهُ بِهِمْ عَلِيمًا",
    "ENGLISH": {
        "TRANSLATION_0": "What harm would it have done them to have had iman in Allah and the Last Day and to have given of what Allah has provided for them? Allah knows everything about them.",
        "TRANSLATION_1": "Would something have befallen them if they had believed in God and the Last Day, and spent of what has been given them by God? God is fully aware of all they do.\n",
        "TRANSLATION_2": "What harm would have befallen them if they had believed in Allah and the Last Day, and spent on charity what Allah had bestowed upon them as sustenance? For Allah indeed has full knowledge of them.\n",
        "TRANSLATION_3": "How could it have harmed them if they had believed in God and the Last Day and spent their property for the cause of God? God knows them very well\n",
        "TRANSLATION_4": "And what would they lose, if they had believed in Allah and the Last Day and spent from what Allah has bestowed upon them? And Allah knows them very well.\n",
        "TRANSLATION_5": "And what loss have they if they had believed in Allah and in the Last Day, and they spend out of what Allah has given them for sustenamce And Allah is Ever All-Knower of them.\n",
        "TRANSLATION_6": "And what (harm) would it have done them if they had believed in Allah and the last day and spent (benevolently) of what Allah had given them? And Allah knows them.\n",
        "TRANSLATION_7": "Why, what would it harm them, if they believed in God and the Last Day, and expended of that God has provided them? God knows them.\n",
        "TRANSLATION_8": "What have they (to fear) if they believe in Allah and the Last Day and spend (aright) of that which Allah hath bestowed upon them, when Allah is ever Aware of them (and all they do)?\n",
        "TRANSLATION_9": "What harm could befall them if they believed in God and the Last Day, and spent out of what God bestowed on them? God knows them well.\n",
        "TRANSLATION_10": "And what would befall them were they to believe in Allah and the Last Day and expend out of that wherewith Allah hath provided them? And of them Allah is ever the Knower.\n",
        "TRANSLATION_11": "What harm would it have done them had they believed in Allah and the Last Day, and spent out of what Allah has provided them? Allah knows them well.\n",
        "TRANSLATION_12": "And what burden Were it on them if they had faith in Allah and in the Last Day, and they spent out of what Allah hath given them for sustenance? For Allah hath full knowledge of them.\n",
        "TRANSLATION_13": "And what loss have they if they had believed in Allah and in the Last Day, and they spend out of what Allah has given them for sustenance? And Allah is Ever All-Knower of them.\n",
        "TRANSLATION_14": "What (harm) could befall them if they believed in Allah and the Last Day and spent of what Allah provided them with? Allah is Knowledgeable of them all.\n",
        "TRANSLATION_15": "What would they have lost, had they believed in God and the Last Day, and gave out of what God has provided for them? God knows them very well.\n",
        "TRANSLATION_16": "And what [harm would come] upon them if they believed in Allah and the Last Day and spent out of what Allah provided for them? And Allah is ever, about them, Knowing.\n",
        "TRANSLATION_17": "[4:39] And what burden is on them if they were to believe in God and the Last Day, and expend of what God has provided them?, that is to say, what harm would this cause them? In other words, there is no harm therein. Rather, harm lies in what they follow (the interrogative is meant as a disavowal; the law [of law āmanū, ‘if they were to believe’] conveys the sense of the verbal noun [sc. mādhā ‘alayhim īmānuhum, ‘what burden would their belief be upon them?’]). God is ever Aware of them, and will requite them for what they have done.\n",
        "TRANSLATION_18": "(What have they (to fear)) i.e. the Jews (if they believe in Allah) Muhammad and the Qur'an (and the Last Day) in resurrection after death and the bliss of Paradise (and spend (aright) of that which Allah hath bestowed upon them?) and spend in the way of Allah from that which Allah has given to them, (when Allah is ever Aware of them) i.e. of the Jews: those among them who believe and those among them who do not.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "4:39",
            "3:114",
            "2:8",
            "9:44",
            "3:115",
            "5:69",
            "84:23",
            "9:45",
            "40:33",
            "22:68"
        ],
        "BIBLE": [
            "writings:i%20chronicles:29:14",
            "writings:ii%20chronicles:35:21",
            "prophets:jeremiah:11:18",
            "writings:ii%20chronicles:32:29",
            "writings:psalms:111:5",
            "prophets:ezekiel:16:33",
            "writings:ii%20chronicles:13:5",
            "prophets:isaiah:50:4",
            "prophets:amos:9:15",
            "prophets:isaiah:47:8"
        ]
    }
}