{
    "VERSE": "4:41",
    "ARABIC": "فَكَيْفَ إِذَا جِئْنَا مِن كُلِّ أُمَّةٍۭ بِشَهِيدٍ وَجِئْنَا بِكَ عَلَىٰ هَٰٓؤُلَآءِ شَهِيدًا",
    "ENGLISH": {
        "TRANSLATION_0": "How will it be when We bring a witness from every nation and bring you as a witness against them?",
        "TRANSLATION_1": "How shall it be when We call witnesses from each and every people and call you as witness over them?\n",
        "TRANSLATION_2": "Consider, then, when We shall bring forward witnesses from every community, and will bring you (O Muhammad!) as a witness against them all.\n",
        "TRANSLATION_3": "How will it be when We call for a witness from every nation and have you, (Muhammad), testify against them all?\n",
        "TRANSLATION_4": "So how will it be when We bring a witness from each nation (religion), and We bring you (O dear Prophet Mohammed – peace and blessings be upon him) as a witness and a watcher over them? (The Holy Prophet is a witness from Allah.)\n",
        "TRANSLATION_5": "How (will it be) then, when We bring from each nation a witness and We bring you (O Muhammad) as a witness against these people\n",
        "TRANSLATION_6": "How will it be, then, when We bring from every people a witness and bring you as a witness against these?\n",
        "TRANSLATION_7": "How then shall it be, when We bring forward from every nation a witness, and bring thee to witness against those?\n",
        "TRANSLATION_8": "But how (will it be with them) when We bring of every people a witness, and We bring thee (O Muhammad) a witness against these?\n",
        "TRANSLATION_9": "What will they do when We bring a witness from each community and bring you as a witness against these people?\n",
        "TRANSLATION_10": "How will it be then, when We shall bring, out of each community, a witness, and We shall bring thee against these as a witness?\n",
        "TRANSLATION_11": "So how shall it be, when We bring a witness from every nation and We bring you as a witness to them?\n",
        "TRANSLATION_12": "How then if We brought from each people a witness, and We brought thee as a witness against these people!\n",
        "TRANSLATION_13": "How (will it be) then, when We bring from each nation a witness and We bring you (O Muhammad SAW) as a witness against these people?\n",
        "TRANSLATION_14": "How then shall it be when We bring forward from every nation a witness, and bring you (Prophet Muhammad) to witness against those!\n",
        "TRANSLATION_15": "Then how will it be, when We bring a witness from every community, and We bring you as a witness against these?\n",
        "TRANSLATION_16": "So how [will it be] when We bring from every nation a witness and we bring you, [O Muhammad] against these [people] as a witness?\n",
        "TRANSLATION_17": "[4:41]   So how shall it be, the predicament of the disbelievers, when We bring forward from every community a witness, to testify against it regarding its deeds, and this shall be its prophet; and We bring you, O Muhammad (s), as witness against these?\n",
        "TRANSLATION_18": "(But how (will it be with them)) how shall the unbelievers react (when we bring of every people a witness) a prophet who will testify that he has delivered the message to them, (and We bring thee) Muhammad (a witness against these?) it is also said that this means: We bring you, Muhammad, a witness in favour of your Community, testifying that it is reliable and upright. This is because his Community will be a witness for the other prophets against their nations when the latter will deny having received any message from them.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "4:41",
            "16:84",
            "28:75",
            "16:89",
            "4:62",
            "27:83",
            "50:21",
            "40:5",
            "16:36",
            "34:47"
        ],
        "BIBLE": [
            "torah:deuteronomy:31:21",
            "prophets:isaiah:43:9",
            "torah:exodus:33:13",
            "prophets:micah:6:3",
            "writings:psalms:57:10",
            "writings:psalms:108:4",
            "prophets:ezekiel:32:9",
            "writings:psalms:50:7",
            "prophets:ii%20samuel:17:3",
            "torah:genesis:17:16"
        ]
    }
}