{
    "VERSE": "4:43",
    "ARABIC": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ لَا تَقْرَبُوا۟ ٱلصَّلَوٰةَ وَأَنتُمْ سُكَٰرَىٰ حَتَّىٰ تَعْلَمُوا۟ مَا تَقُولُونَ وَلَا جُنُبًا إِلَّا عَابِرِى سَبِيلٍ حَتَّىٰ تَغْتَسِلُوا۟ وَإِن كُنتُم مَّرْضَىٰٓ أَوْ عَلَىٰ سَفَرٍ أَوْ جَآءَ أَحَدٌ مِّنكُم مِّنَ ٱلْغَآئِطِ أَوْ لَٰمَسْتُمُ ٱلنِّسَآءَ فَلَمْ تَجِدُوا۟ مَآءً فَتَيَمَّمُوا۟ صَعِيدًا طَيِّبًا فَٱمْسَحُوا۟ بِوُجُوهِكُمْ وَأَيْدِيكُمْ إِنَّ ٱللَّهَ كَانَ عَفُوًّا غَفُورًا",
    "ENGLISH": {
        "TRANSLATION_0": "You who have iman! do not approach the prayer when you are drunk, so that you will know what you are saying, nor in a state of major impurity - unless you are travelling - until you have washed yourselves completely. If you are ill or on a journey, or any of you have come from the lavatory or touched women, and you cannot find any water, then do tayammum with pure earth, wiping your faces and your hands. Allah is Ever-Pardoning, Ever-Forgiving.",
        "TRANSLATION_1": "O you who believe, do not perform your service of prayer when you are intoxicated until you are sure of what you are saying, nor when in a state of seminal pollution, until you have taken a bath, except when you are travelling. But in case you are ill or are travelling, or you have relieved yourself of nature's call, or cohabited with a woman, and cannot find water, then take wholesome dust and pass it over your face and hands: God is benign and forgiving.\n",
        "TRANSLATION_2": "Believers! Do not draw near to the Prayer while you are intoxicated until you know what you are saying nor while you are defiled - save when you are travelling - until you have washed yourselves. If you are either ill or travelling or have satisfied a want of nature or have had contact with women and can find no water, then betake yourselves to pure earth, passing with it lightly over your face and your hands. Surely Allah is All-Relenting, All-Forgiving.\n",
        "TRANSLATION_3": "Believers, do not pray when you are drunk, but, instead, wait until you can understand what you say. Also, do not pray when you have experienced a seminal discharge until after you have taken a bath, unless you are on a journey. If, while sick or on a journey, you can find no water after having defecated or after having had carnal relations, perform tayammum by touching your palms on the pure earth and wipe the (upper part of) your face and the backs of your hands. God is Gracious and All-forgiving.\n",
        "TRANSLATION_4": "O People who Believe! Do not approach the prayer when you are intoxicated until you have the sense to understand what you say, nor in the state of impurity until you have bathed except while travelling; and if you are ill or on a journey or one of you returns from answering the call of nature or you have cohabited with women, and you do not find water, then cleanse (yourself) with clean soil – therefore stroke your faces and your hands with it; indeed Allah is Most Pardoning, Oft Forgiving.\n",
        "TRANSLATION_5": "O you who believe! Do not approach Salah while you are in a druken state until you know what you are saying, nor while Junub (sexually impure), except while passing through, until you bathe (your entire body), and if you are ill, or on a journey, or one of you comes from the Gha'it (toilet), or from Lamastum (touching) women, but you do not find water, then perform Tayammum with clean earth, rubbing your faces and hands. Truly, Allah is Ever Oft-Pardoning, Oft-Forgiving.\n",
        "TRANSLATION_6": "O you who believe! do not go near prayer when you are Intoxicated until you know (well) what you say, nor when you are under an obligation to perform a bath-- unless (you are) travelling on the road-- until you have washed yourselves; and if you are sick, or on a journey, or one of you come from the privy or you have touched the women, and you cannot find water, betake yourselves to pure earth, then wipe your faces and your hands; surely Allah is Pardoning, Forgiving.\n",
        "TRANSLATION_7": "O believers, draw not near to prayer when you are drunken until you know what you are saying, or defiled -- unless you are traversing a way -- until you have washed yourselves; but if you are sick, or on a journey, or if any of you comes from the privy, or you have touched women, and you can find no water, then have recourse to wholesome dust and wipe your faces and your hands; God is All-pardoning, All-forgiving.\n",
        "TRANSLATION_8": "O ye who believe! Draw not near unto prayer when ye are drunken, till ye know that which ye utter, nor when ye are polluted, save when journeying upon the road, till ye have bathed. And if ye be ill, or on a journey, or one of you cometh from the closet, or ye have touched women, and ye find not water, then go to high clean soil and rub your faces and your hands (therewith). Lo! Allah is Benign, Forgiving.\n",
        "TRANSLATION_9": "Believers, do not approach your prayers when you are drunk, until you understand what you say, nor when you are in a state of impurity, -- except when you are on a journey -- till you have bathed. And if you are ill, or on a journey or have relieved yourselves or when you have consorted with women and you cannot find any water, then find some clean sand and wipe your face and your hands with it. God is gracious and forgiving.\n",
        "TRANSLATION_10": "O Ye who believe! approach not prayer while ye are intoxicated until ye know that which ye say, nor yet while ye are polluted, save when ye be way faring, until ye have washed your selves. And if ye be ailing or on a journey, or one of you cometh from the privy have touched women, or ye and ye find not water, then betake your selves to clean earth and wipe your faces and your hands therewith; verily Allah is ever Pardoning, Forgiving.\n",
        "TRANSLATION_11": "O you who have faith! Do not approach prayer when you are intoxicated, [not] until you know what you are saying, nor [enter mosques] in the state of ritual impurity until you have washed yourselves, except while passing through. But if you are sick or on a journey, or any of you has come from the toilet, or you have touched women, and you cannot find water, then make your ablution on clean ground and wipe a part of your faces and your hands. Indeed Allah is all-excusing, all-forgiving.\n",
        "TRANSLATION_12": "O ye who believe! Approach not prayers with a mind befogged, until ye can understand all that ye say,- nor in a state of ceremonial impurity (Except when travelling on the road), until after washing your whole body. If ye are ill, or on a journey, or one of you cometh from offices of nature, or ye have been in contact with women, and ye find no water, then take for yourselves clean sand or earth, and rub therewith your faces and hands. For Allah doth blot out sins and forgive again and again.\n",
        "TRANSLATION_13": "O you who believe! Approach not As-Salat (the prayer) when you are in a drunken state until you know (the meaning) of what you utter, nor when you are in a state of Janaba, (i.e. in a state of sexual impurity and have not yet taken a bath) except when travelling on the road (without enough water, or just passing through a mosque), till you wash your whole body. And if you are ill, or on a journey, or one of you comes after answering the call of nature, or you have been in contact with women (by sexual relations) and you find no water, perform Tayammum with clean earth and rub therewith your faces and hands (Tayammum). Truly, Allah is Ever Oft-Pardoning, Oft-Forgiving.\n",
        "TRANSLATION_14": "Believers, do not come close to prayer when you are drunk, until you know what you are saying, nor when you are in a state of impurity, unless you are crossing through the way (prayer area) until you have bathed yourselves. If you are ill or on a journey, or if any of you comes from the toilet or you have touchedwomen, and you cannot find water, so touch pure dust and wipe your faces and your hands. Allah is the Pardoner, the Forgiver.\n",
        "TRANSLATION_15": "O you who believe! Do not approach the prayer while you are drunk, so that you know what you say; nor after sexual orgasm—unless you are travelling—until you have bathed. If you are sick, or traveling, or one of you comes from the toilet, or you have had intercourse with women, and cannot find water, find clean sand and wipe your faces and your hands with it. God is Pardoning and Forgiving.\n",
        "TRANSLATION_16": "O you who have believed, do not approach prayer while you are intoxicated until you know what you are saying or in a state of janabah, except those passing through [a place of prayer], until you have washed [your whole body]. And if you are ill or on a journey or one of you comes from the place of relieving himself or you have contacted women and find no water, then seek clean earth and wipe over your faces and your hands [with it]. Indeed, Allah is ever Pardoning and Forgiving.\n",
        "TRANSLATION_17": "[4:43] O you who believe, draw not near to prayer, that is, do not perform prayer, whilst you are inebriated, by a drink: this was revealed concerning being drunk during the congregational prayer; until you know what you are saying, when you have sobered up; nor whilst you are defiled, as a result of [sexual] penetration or ejaculation (junuban, ‘defiled’, is in the accusative because it is a circumstantial qualifier, and may be used to refer to the singular or plural) — unless you are traversing, crossing, a way, a route, that is, [unless] you are travelling — until you have washed yourselves, in which case you may perform prayer: a proviso is made for the traveller because a different stipulation applies to him, as will follow. It is said that the purpose [of this verse] is to prohibit the approach to places of prayer, that is, mosques, the exception being if one were merely passing through and not staying. But if you are sick, with an illness made worse by [contact with] water, or on a journey, that is, [or] travelling whilst you are [ritually] defiled or impure, or if any of you comes from the privy (al-ghā’it), a place designated for relieving nature, that is to say, [or if any of you] have defecated, or you have touched women (lāmastum, a variant reading has lamastum: both mean lams, that is, ‘touching with the hand’, as stated by Ibn ‘Umar; this is also the opinion of al-Shāfi‘ī, and it extends to touching with other parts of the skin; according to Ibn ‘Abbās, however, it is [referring to] sexual intercourse); and you can find no water, with which to purify yourselves for prayer, having made the effort to seek it out and search for it — the sick being exempt in this case — then resort to, seek, when the time [for the prayer] has commenced, wholesome soil, clean earth, strike it twice, and wipe your faces and your hands, with it, up to the elbows (the verb masaha, ‘to wipe’, may stand on its own with a direct object or take a particle [before the direct object, sc. masaha bi-]). God is ever Pardoning, Forgiving.\n",
        "TRANSLATION_18": "Allah revealed the following about the Companions of Muhammad prior to the prohibition of intoxicants: (0 ye who believe!) in Muhammad and the Qur'an (Draw not near unto prayer) in the Mosque of the Prophet (pbuh) with the Prophet (pbuh) (when ye are drunken, till ye know that which ye utter) so that you know what the prayer leader recites during the prayer, (nor when ye are polluted) nor when you are in a state of major ritual impurity, (save when journeying upon the road) except when passing through when you have to, (till ye have bathed) to purify yourselves from major ritual impurity. (And if ye be ill) wounded, (or on a journey, or one of you cometh from the closet, or ye have touched women) made love to them, (and ye find not water, then go to high clean soil and rub your faces) with the first clap (and your hands (therewith)) with the second clap. (Lo! Allah is Benign) Allah is Generous for the abundance He has given you, (Forgiving) of any shortcoming that may ensue from you.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "4:43",
            "5:6",
            "58:2",
            "4:34",
            "9:91",
            "4:15",
            "4:23",
            "4:103",
            "4:19",
            "2:226"
        ],
        "BIBLE": [
            "prophets:joshua:9:11",
            "prophets:joshua:4:18",
            "prophets:i%20samuel:9:12",
            "prophets:i%20kings:13:4",
            "prophets:isaiah:50:2",
            "torah:genesis:8:9",
            "torah:genesis:24:43",
            "prophets:jeremiah:36:14",
            "writings:job:9:30",
            "prophets:ezekiel:13:18"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:4",
            
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:11"
        ]
    }
}