{
    "VERSE": "4:45",
    "ARABIC": "وَٱللَّهُ أَعْلَمُ بِأَعْدَآئِكُمْ وَكَفَىٰ بِٱللَّهِ وَلِيًّا وَكَفَىٰ بِٱللَّهِ نَصِيرًا",
    "ENGLISH": {
        "TRANSLATION_0": "Allah knows best who your enemies are. Allah suffices as a Protector; Allah suffices as a Helper.",
        "TRANSLATION_1": "But God knows your enemies well: and sufficient is God to protect you, and sufficient is God for all help.\n",
        "TRANSLATION_2": "Allah knows your enemies better and Allah suffices as a protector and Allah suffices as a helper.\n",
        "TRANSLATION_3": "God knows who are your enemies. You need to have no guardian or helper other than God.\n",
        "TRANSLATION_4": "Allah well knows your enemies; Allah is Sufficient as a Guardian, and Allah is Sufficient as a Supporter.\n",
        "TRANSLATION_5": "Allah has full knowledge of your enemies, and Allah is sufficient as a Wali (Protector), and Allah is sufficient as a Helper.\n",
        "TRANSLATION_6": "And Allah best knows your enemies; and Allah suffices as a Guardian, and Allah suffices as a Helper.\n",
        "TRANSLATION_7": "God knows well your enemies; God suffices as a protector, God suffices as a helper.\n",
        "TRANSLATION_8": "Allah knoweth best (who are) your enemies. Allah is sufficient as a Guardian, and Allah is sufficient as a Supporter.\n",
        "TRANSLATION_9": "God is quite aware as to who your enemies are; God suffices as a patron, and God suffices as a supporter.\n",
        "TRANSLATION_10": "And Allah is Knower of your enemies. Sufficieth Allah as a Friend and sufficieth Allah as a Helper.\n",
        "TRANSLATION_11": "But Allah knows your enemies better, and Allah suffices as guardian, and Allah suffices as helper.\n",
        "TRANSLATION_12": "But Allah hath full knowledge of your enemies: Allah is enough for a protector, and Allah is enough for a Helper.\n",
        "TRANSLATION_13": "Allah has full knowledge of your enemies, and Allah is Sufficient as a Wali (Protector), and Allah is Sufficient as a Helper.\n",
        "TRANSLATION_14": "But Allah knows best your enemies. It is sufficient that Allah is the Guardian, and it is sufficient that Allah is the Helper.\n",
        "TRANSLATION_15": "But God knows your enemies best. God is sufficient as a Protector, and God is sufficient as a Supporter.\n",
        "TRANSLATION_16": "And Allah is most knowing of your enemies; and sufficient is Allah as an ally, and sufficient is Allah as a helper.\n",
        "TRANSLATION_17": "[4:45] God has better knowledge of your enemies, than you do, and He informs you of them in order that you avoid them. God suffices as a Protector, a Preserver of you from them, God suffices as a Helper, defending you against their plotting.\n",
        "TRANSLATION_18": "(Allah knoweth best (who are) your enemies) from among the hypocrites and the Jews. (Allah is sufficient as a Friend) as a Protector, (and Allah is sufficient as a Helper) as a Defender against them.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "4:45",
            "8:40",
            "42:31",
            "84:23",
            "22:71",
            "33:17",
            "29:22",
            "2:120",
            "66:2",
            "41:19"
        ],
        "BIBLE": [
            "writings:psalms:56:10",
            "writings:psalms:73:11",
            "writings:psalms:48:4",
            "prophets:isaiah:45:5",
            "writings:nehemiah:5:9",
            "prophets:i%20samuel:29:9",
            "writings:ecclesiastes:3:12",
            "prophets:nahum:1:2",
            "torah:deuteronomy:13:7",
            "prophets:joshua:22:22"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:14",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:6"
        ]
    }
}