{
    "VERSE": "4:53",
    "ARABIC": "أَمْ لَهُمْ نَصِيبٌ مِّنَ ٱلْمُلْكِ فَإِذًا لَّا يُؤْتُونَ ٱلنَّاسَ نَقِيرًا",
    "ENGLISH": {
        "TRANSLATION_0": "Or do they indeed really own a portion of Allah's kingdom? In that case they do not give so much as a scrap to other people!",
        "TRANSLATION_1": "Have they a share in the kingdom? (If they had,) they would never have given an iota to the people.\n",
        "TRANSLATION_2": "Have they any share in the dominion (of Allah)? Had that been so, they would never have granted people even as much as the speck on a date-stone.\n",
        "TRANSLATION_3": "Even if they had a share in the Kingdom (Divine authority), they would not have given the smallest thing to anyone.\n",
        "TRANSLATION_4": "Do they have some share in the kingship?- if it were, they would not give to mankind even a single sesame.\n",
        "TRANSLATION_5": "Or have they a share in the dominion Then in that case they would not give mankind even a Naqir.\n",
        "TRANSLATION_6": "Or have they a share in the kingdom? But then they would not give to people even the speck in the date stone.\n",
        "TRANSLATION_7": "Or have they a share in the Kingdom? If that is so, they do not give the people a single date-spot.\n",
        "TRANSLATION_8": "Or have they even a share in the Sovereignty? Then in that case, they would not give mankind even the speck on a date-stone.\n",
        "TRANSLATION_9": "Have they a share in God's kingdom? If they did, they would not give others so much as the groove of a date stone.\n",
        "TRANSLATION_10": "Is theirs a portion of the dominion? In that case, they would not give the people a speck.\n",
        "TRANSLATION_11": "Do they have a share in sovereignty? If so, they will not give those people [so much as] a speck on a date-stone!\n",
        "TRANSLATION_12": "Have they a share in dominion or power? Behold, they give not a farthing to their fellow-men?\n",
        "TRANSLATION_13": "Or have they a share in the dominion? Then in that case they would not give mankind even a Naqira (speck on the back of a date-stone).\n",
        "TRANSLATION_14": "Or, will they have a share in the Kingdom? If so, they will not give the people the pit mark of a date stone.\n",
        "TRANSLATION_15": "Or do they own a share of the kingdom? Then they would not give people a speck.\n",
        "TRANSLATION_16": "Or have they a share of dominion? Then [if that were so], they would not give the people [even as much as] the speck on a date seed.\n",
        "TRANSLATION_17": "[4:53] Or have they a share in the Kingdom?, that is to say, they have no share in it whatever, and even if they did, then they would not give the people a single date-spot, that is, [not even] something as worthless as   the tiny spot on the back of a date-pit, because of the extent of their niggardliness.\n",
        "TRANSLATION_18": "(Or have they even a share) if the Jews had a share (in the Sovereignty? Then in that case, they would not give mankind) they would not give Muhammad and his Companions (even the speck on a date stone).\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "4:53",
            "114:2",
            "26:39",
            "29:2",
            "34:36",
            "39:27",
            "22:75",
            "29:43",
            "4:7",
            "15:48"
        ],
        "BIBLE": [
            "writings:daniel:2:37",
            "writings:i%20chronicles:29:14",
            "writings:daniel:7:14",
            "writings:ecclesiastes:5:18",
            "prophets:judges:18:10",
            "writings:nehemiah:13:10",
            "writings:psalms:45:7",
            "torah:numbers:18:8",
            "writings:psalms:111:6",
            "torah:genesis:1:29"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:2:1"
        ]
    }
}