{
    "VERSE": "4:59",
    "ARABIC": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓا۟ أَطِيعُوا۟ ٱللَّهَ وَأَطِيعُوا۟ ٱلرَّسُولَ وَأُو۟لِى ٱلْأَمْرِ مِنكُمْ فَإِن تَنَٰزَعْتُمْ فِى شَىْءٍ فَرُدُّوهُ إِلَى ٱللَّهِ وَٱلرَّسُولِ إِن كُنتُمْ تُؤْمِنُونَ بِٱللَّهِ وَٱلْيَوْمِ ٱلْءَاخِرِ ذَٰلِكَ خَيْرٌ وَأَحْسَنُ تَأْوِيلًا",
    "ENGLISH": {
        "TRANSLATION_0": "You who have iman! obey Allah and obey the Messenger and those in command among you. If you have a dispute about something, refer it back to Allah and the Messenger, if you have iman in Allah and the Last Day. That is the best thing to do and gives the best result.",
        "TRANSLATION_1": "O you who believe, obey God and the Prophet and those in authority among you; and if you are at variance over something, refer it to God and the Messenger, if you believe in God and the Last Day. This is good for you and the best of settlement.\n",
        "TRANSLATION_2": "Believers! Obey Allah and obey the Messenger, and those from among you who are invested with authority; and then if you were to dispute among yourselves about anything refer it to Allah and the Messenger if you indeed believe in Allah and the Last Day; that is better and more commendable in the end.\n",
        "TRANSLATION_3": "Believers, obey God, His Messenger, and your (qualified) leaders. If you have faith in God and the Day of Judgment, refer to God and His Messenger concerning matters in which you differ. This would be a more virtuous and a better way of settling differences.\n",
        "TRANSLATION_4": "O People who Believe! Obey Allah and the Noble Messenger and those amongst you who are in authority; so if there is a dispute amongst you concerning any matter, refer it to Allah and the Noble Messenger (for judgement) if you believe in Allah and the Last Day; this is better and has the best outcome.\n",
        "TRANSLATION_5": "O you who believe! Obey Allah and obey the Messenger, and those of you who are in authority. If you differ in anything among yourselves, refer it to Allah and His Messenger, if you believe in Allah and in the Last Day. That is better and more suitable for final determination.\n",
        "TRANSLATION_6": "O you who believe! obey Allah and obey the Apostle and those in authority from among you; then if you quarrel about anything, refer it to Allah and the Apostle, if you believe in Allah and the last day; this is better and very good in the end.\n",
        "TRANSLATION_7": "O believers, obey God, and obey the Messenger and those in authority among you. If you should quarrel on anything, refer it to God and the Messenger, if you believe in God and the Last Day; that is better, and fairer in the issue.\n",
        "TRANSLATION_8": "O ye who believe! Obey Allah, and obey the messenger and those of you who are in authority; and if ye have a dispute concerning any matter, refer it to Allah and the messenger if ye are (in truth) believers in Allah and the Last Day. That is better and more seemly in the end.\n",
        "TRANSLATION_9": "Believers, obey God and obey the Messenger and those who have been entrusted with authority among you. If you are in dispute over any matter, refer it to God and the Messenger, if you truly believe in God and the Last Day: this is best, and best in the end.\n",
        "TRANSLATION_10": "O Ye who believe! obey Allah and obey the apostle and owners of authority from amongst you. then if dispute in aught refer it Unto ye Allah and the apostle if ye indeed believe in Allah and the Last Day. That is the best and fairest interpretation.\n",
        "TRANSLATION_11": "O you who have faith! Obey Allah and obey the Apostle and those vested with authority among you. And if you dispute concerning anything, refer it to Allah and the Apostle, if you have faith in Allah and the Last Day. That is better and more favourable in outcome.\n",
        "TRANSLATION_12": "O ye who believe! Obey Allah, and obey the Messenger, and those charged with authority among you. If ye differ in anything among yourselves, refer it to Allah and His Messenger, if ye do believe in Allah and the Last Day: That is best, and most suitable for final determination.\n",
        "TRANSLATION_13": "O you who believe! Obey Allah and obey the Messenger (Muhammad SAW), and those of you (Muslims) who are in authority. (And) if you differ in anything amongst yourselves, refer it to Allah and His Messenger (SAW), if you believe in Allah and in the Last Day. That is better and more suitable for final determination.\n",
        "TRANSLATION_14": "Believers, obey Allah and obey the Messenger and those in authority among you. Should you dispute about anything refer it to Allah and the Messenger, if you believe in Allah and the Last Day. That is better and the best interpretation.\n",
        "TRANSLATION_15": "O you who believe! Obey God and obey the Messenger and those in authority among you. And if you dispute over anything, refer it to God and the Messenger, if you believe in God and the Last Day. That is best, and a most excellent determination.\n",
        "TRANSLATION_16": "O you who have believed, obey Allah and obey the Messenger and those in authority among you. And if you disagree over anything, refer it to Allah and the Messenger, if you should believe in Allah and the Last Day. That is the best [way] and best in result.\n",
        "TRANSLATION_17": "[4:59] O you who believe, obey God, and obey the Messenger and those in authority among you, that is, rulers, when they command you to obey God and His Messenger. If you should quarrel, disagree, about anything, refer it to God, that is, to His Book, and the Messenger, while he lives, and thereafter [refer] to his Sunna: in other words examine these [disputes] with reference to these two [sources], if you believe in God and the Last Day; that, reference to the two [sources], is better, for you than quarrelling or [adhering to] personal opinions, and more excellent in interpretation, in the end.\n",
        "TRANSLATION_18": "(0 ye who believe!) 'Uthman Ibn Talhah and his fellow believers. (Obey Allah) in that which He has commanded you, (and obey the messenger) in that which he commands you (and those of you who are in authority) the leaders of military expeditions; it also said that this means: the men of sacred knowledge; (and if ye have a dispute concerning any matter, refer it to Allah) to the Book of Allah (and the messenger) and to the practice of the Messenger (if you are (in truth) believers in Allah and the Last Day) resurrection after death. (That) referring the matter to the Book of Allah and the practice of His Messenger (is better and more seemly in the end).\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "4:59",
            "3:114",
            "62:9",
            "33:21",
            "4:136",
            "39:18",
            "4:19",
            "61:11",
            "9:3",
            "60:6"
        ],
        "BIBLE": [
            "writings:i%20chronicles:22:13",
            "prophets:ii%20kings:17:15",
            "prophets:ii%20samuel:11:19",
            "writings:ezra:5:17",
            "prophets:ezekiel:18:30",
            "prophets:joshua:7:13",
            "torah:deuteronomy:4:5",
            "prophets:ezekiel:28:22",
            "prophets:jeremiah:12:1",
            "prophets:jeremiah:21:8"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:4:4"
        ]
    }
}