{
    "VERSE": "4:6",
    "ARABIC": "وَٱبْتَلُوا۟ ٱلْيَتَٰمَىٰ حَتَّىٰٓ إِذَا بَلَغُوا۟ ٱلنِّكَاحَ فَإِنْ ءَانَسْتُم مِّنْهُمْ رُشْدًا فَٱدْفَعُوٓا۟ إِلَيْهِمْ أَمْوَٰلَهُمْ وَلَا تَأْكُلُوهَآ إِسْرَافًا وَبِدَارًا أَن يَكْبَرُوا۟ وَمَن كَانَ غَنِيًّا فَلْيَسْتَعْفِفْ وَمَن كَانَ فَقِيرًا فَلْيَأْكُلْ بِٱلْمَعْرُوفِ فَإِذَا دَفَعْتُمْ إِلَيْهِمْ أَمْوَٰلَهُمْ فَأَشْهِدُوا۟ عَلَيْهِمْ وَكَفَىٰ بِٱللَّهِ حَسِيبًا",
    "ENGLISH": {
        "TRANSLATION_0": "Keep a close check on orphans until they reach a marriageable age, then if you perceive that they have sound judgement hand over their property to them. Do not consume it extravagantly and precipitately before they come of age. Those who are wealthy should abstain from it altogether. Those who are poor should use it sensibly and correctly. When you hand over their property to them ensure that there are witnesses on their behalf. Allah suffices as a Reckoner.",
        "TRANSLATION_1": "And test (and try) the orphans until they are of marriageable age. If you find they have acquired sound judgement, then hand over their property to them; but devour not their wealth, nor use it up hastily out of fear that soon they will grow up (and demand it). And (the guardian) who is rich should abstain from spending much (of their wealth); and he who is poor should use only as much as is fair. And when you give back their possessions have this witnessed, (and remember) that God is sufficient to take all account.\n",
        "TRANSLATION_2": "Test the orphans until they reach the age of marriage, and then if you find them mature of mind hand over to them their property, and do not eat it up by either spending extravagantly or in haste, fearing that they would grow up (and claim it). If the guardian of the orphan is rich let him abstain entirely (from his ward's property); and if he is poor, let him partake of it in a fair measure. When you hand over their property to them let there be witnesses on their behalf. Allah is sufficient to take account (of your deeds).\n",
        "TRANSLATION_3": "Before returning orphan's property to them, make sure that they have reached maturity. Do not consume their property wastefully until such a time. The rich (guardian) should not take any of his ward's property. However, a poor (guardian) may use a reasonable portion. When you return their property, make sure you have witness. God is a perfect in taking accounts.\n",
        "TRANSLATION_4": "And test the orphans till they are fit to get married (reach full age); then if you find them of proper judgement, hand over their wealth to them; and do not devour it by spending excessively and hastily, fearing that they will grow up; and whoever is not in need must abstain; and whoever is needy may use from it in a reasonable measure; and when you hand over their wealth to them, get witnesses over them; and Allah is Sufficient to take account.\n",
        "TRANSLATION_5": "And test orphans until they reach the age of marriage; if then you find sound judgment in them, release their property to them, but consume it not wastefully and hastily, fearing that they should grow up. And whoever among guardians is rich, he should take no wages, but if he is poor, let him have for himself what is just and reasonable (according to his work). And when you release their property to them, take a witness in their presence; and Allah is All-Sufficient in taking account.\n",
        "TRANSLATION_6": "And test the orphans until they attain puberty; then if you find in them maturity of intellect, make over to them their property, and do not consume it extravagantly and hastily, lest they attain to full age; and whoever is rich, let him abstain altogether, and whoever is poor, let him eat reasonably; then when you make over to them their property, call witnesses in their presence; and Allah is enough as a Reckoner.\n",
        "TRANSLATION_7": "Test well the orphans, until they reach the age of marrying; then, if you perceive in them right judgment, deliver to them their property; consume it not wastefully and hastily ere they are grown. If any man is rich, let him be abstinent; if poor, let him consume in reason. And when you deliver to them their property, take witnesses over them; God suffices for a reckoner.\n",
        "TRANSLATION_8": "Prove orphans till they reach the marriageable age; then, if ye find them of sound judgment, deliver over unto them their fortune; and devour it not by squandering and in haste lest they should grow up Whoso (of the guardians) is rich, let him abstain generously (from taking of the property of orphans); and whoso is poor let him take thereof in reason (for his guardianship). And when ye deliver up their fortune unto orphans, have (the transaction) witnessed in their presence. Allah sufficeth as a Reckoner.\n",
        "TRANSLATION_9": "Keep a close check on orphans till they attain the age of marriage; then, if you find them to be mature of mind, hand over their property to them. Do not consume it by wasteful spending, before they come of age. If the guardian is affluent, let him abstain altogether, and if he is poor, let him have for himself what is just and reasonable. When you hand over their property to them, call witnesses in their presence; God is sufficient as a Reckoner.\n",
        "TRANSLATION_10": "And examine the orphans until they attain the age of wedlock, then if ye perceive in them and discretion, hand over unto them their substance, and consume it not extravagantly or hastily for fear that they may grow. And whosoever is rich, let him abstain, and whosoever is needy let him take thereof reputably. And when ye hand over their substance unto them, call in witnesses in their presence, and sufficeth Allah as a Reckoner.\n",
        "TRANSLATION_11": "Test the orphans when they reach the age of marriage. Then if you discern in them maturity, deliver to them their property. And do not consume it lavishly and hastily lest they should grow up. As for him who is well-off, let him be abstemious, and as for him who is poor, let him eat in an honourable manner. And when you deliver to them their property, take witnesses over them, and Allah suffices as reckoner.\n",
        "TRANSLATION_12": "Make trial of orphans until they reach the age of marriage; if then ye find sound judgment in them, release their property to them; but consume it not wastefully, nor in haste against their growing up. If the guardian is well-off, Let him claim no remuneration, but if he is poor, let him have for himself what is just and reasonable. When ye release their property to them, take witnesses in their presence: But all-sufficient is Allah in taking account.\n",
        "TRANSLATION_13": "And try orphans (as regards their intelligence) until they reach the age of marriage; if then you find sound judgement in them, release their property to them, but consume it not wastefully, and hastily fearing that they should grow up, and whoever amongst guardians is rich, he should take no wages, but if he is poor, let him have for himself what is just and reasonable (according to his work). And when you release their property to them, take witness in their presence; and Allah is All-Sufficient in taking account.\n",
        "TRANSLATION_14": "And test the orphans until they reach (the age of) marriage. If you perceive in them right judgment, hand over to them their wealth, and do not consume it wastefully, nor hastily before they are grown. And whosoever is rich let him abstain, if poor, let him consume with kindness. When you hand over to them their wealth, take witness over them; it is sufficient that Allah is the Reckoner.\n",
        "TRANSLATION_15": "Test the orphans until they reach the age of marriage. If you find them to be mature enough, hand over their properties to them. And do not consume it extravagantly or hastily before they grow up. The rich shall not charge any wage, but the poor may charge fairly. When you hand over their properties to them, have it witnessed for them. God suffices as a Reckoner.\n",
        "TRANSLATION_16": "And test the orphans [in their abilities] until they reach marriageable age. Then if you perceive in them sound judgement, release their property to them. And do not consume it excessively and quickly, [anticipating] that they will grow up. And whoever, [when acting as guardian], is self-sufficient should refrain [from taking a fee]; and whoever is poor - let him take according to what is acceptable. Then when you release their property to them, bring witnesses upon them. And sufficient is Allah as Accountant.\n",
        "TRANSLATION_17": "[4:6] Try, test, well the orphans, before reaching maturity with regard [the duties of] religion and [before] they can [legally] manage their own affairs, until they reach the age of marrying, that is, until they have become eligible for it through puberty or [legal] age, which, according to al-Shāfi‘ī, is the completion of fifteen years; then, if you perceive in them maturity, that is, right [judgement] in matters of religion and their property, deliver their property to them; consume it not, O guardians, wastefully, without due merit, and in haste, that is, hastening to expend it, fearing, lest they should grow up, and become mature, at which time you will be obliged to hand it over to them. If any man, who is a guardian, is rich, let him be abstinent, that is, let him   abstain from the orphan’s property and refrain from consuming it; if he is poor, let him consume, of it, honourably, that is, in line with the wage for his work. And when you deliver to them, the orphans, their property, take witnesses over them, that they have received it and that you are absolved [of the obligation], so that if any dispute occurs, you are able to refer to a clear proof: this is a command [intended] for guidance. God suffices as a reckoner, as a guardian of His creatures’ deeds and as a reckoner of these [deeds] (the bā’ [in bi’Llāhi] is extra).\n",
        "TRANSLATION_18": "(Prove orphans) test the intelligence of orphans (till they reach the marriageable age) the age of puberty; (then, if ye find them of) if you see that they possess (sound judgement) righteousness in Religion and a tendency to protect their wealth, (deliver over unto them their fortune) then give their wealth which is with you; (and devour it not squandering) it in transgression and unlawfully (and in haste) in haste lest the orphan grows older and consumes it little by little (lest they should grow up) for fear that they grow older and stop you from devouring their wealth. (Whoso (of the guardians) is rich) and needs not the orphan's wealth, (let him abstain generously) because of his richness from taking of the property of orphans, nor should he diminish anything from their wealth; (and whoso is poor) and needy (let him take thereof in reason (for his guardianship)) in measure, such that he is not in need for the wealth of orphans; it is also said that this means: he should take from the wealth of orphans in proportion with the measure of his work regarding this wealth; and it is also said that this means: he can take from the wealth of orphans as a loan to be paid back. (And when ye deliver up their fortune unto orphans) when they reach the legal age, (have (the transaction) witnessed in their presence) when you deliver it to them. (Allah sufficeth as a Reckoner) Allah suffices as a witness. This verse was revealed about Thabit Ibn Rifa'ah al-Ansari.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "4:6",
            "6:152",
            "4:135",
            "59:7",
            "4:86",
            "4:127",
            "4:131",
            "2:271",
            "4:5",
            "2:279"
        ],
        "BIBLE": [
            "prophets:jeremiah:50:9",
            "prophets:ezekiel:3:21",
            "prophets:judges:21:22",
            "writings:ii%20chronicles:24:11",
            "writings:ecclesiastes:3:14",
            "prophets:i%20samuel:25:34",
            "prophets:ezekiel:33:5",
            "prophets:i%20kings:13:26",
            "prophets:ezekiel:3:20",
            "prophets:zephaniah:3:15"
        ]
    }
}