{
    "VERSE": "4:60",
    "ARABIC": "أَلَمْ تَرَ إِلَى ٱلَّذِينَ يَزْعُمُونَ أَنَّهُمْ ءَامَنُوا۟ بِمَآ أُنزِلَ إِلَيْكَ وَمَآ أُنزِلَ مِن قَبْلِكَ يُرِيدُونَ أَن يَتَحَاكَمُوٓا۟ إِلَى ٱلطَّٰغُوتِ وَقَدْ أُمِرُوٓا۟ أَن يَكْفُرُوا۟ بِهِۦ وَيُرِيدُ ٱلشَّيْطَٰنُ أَن يُضِلَّهُمْ ضَلَٰلًۢا بَعِيدًا",
    "ENGLISH": {
        "TRANSLATION_0": "Do you not see those who claim that they have iman in what has been sent down to you and what was sent down before you, still desiring to turn to a satanic source for judgement in spite of being ordered to reject it? Shaytan wants to misguide them far away.",
        "TRANSLATION_1": "Have you never seen those who aver they believe in what has been revealed to you and had been to others before you, yet desire to turn for judgement to evil powers, even though they have been commanded to disbelieve in them? Satan only wishes to lead them astray, far away.\n",
        "TRANSLATION_2": "(O Messenger!) Have you not seen those who claim to believe in the Book which has been revealed to you and in the Books revealed before you, and yet desire to submit their disputes to the judgement of taghut (the Satanic authorities who decide independently of the Law of Allah), whereas they had been asked to reject it. And Satan seeks to make them drift far away from the right way.\n",
        "TRANSLATION_3": "(Muhammad), have you seen those who think that they have faith in what is revealed to you and to others before you, yet choose to take their affairs to Satan for judgment even though they are commanded to deny him. Satan wants to lead them far away from the right path.\n",
        "TRANSLATION_4": "Did you not see those whose claim is that they believe in what has been sent down on you and what was sent down before you, and they then wish to make the devil their judge, whereas they were ordered to completely reject him? And the devil wishes to mislead them far astray.\n",
        "TRANSLATION_5": "Have you not seen those (hyprocrites) who claim that they believe in that which has been sent down to you, and that which was sent down before you, and they wish to go for judgment (in their disputes) to the Taghut while they have been ordered to reject them. But Shaytan wishes to lead them far astray.\n",
        "TRANSLATION_6": "Have you not seen those who assert that they believe in what has been revealed to you and what was revealed before you? They desire to summon one another to the judgment of the Shaitan, though they were commanded to deny him, and the Shaitan desires to lead them astray into a remote error.\n",
        "TRANSLATION_7": "Hast thou not regarded those who assert that they believe in what has been sent down to thee, and what was sent down before thee, desiring to take their disputes to idols, yet they have been commanded to disbelieve in them? But Satan desires to lead them astray into far error.\n",
        "TRANSLATION_8": "Hast thou not seen those who pretend that they believe in that which is revealed unto thee and that which was revealed before thee, how they would go for judgment (in their disputes) to false deities when they have been ordered to abjure them? Satan would mislead them far astray.\n",
        "TRANSLATION_9": "Have you not seen those who profess to believe in what has been revealed to you and [to other prophets] before you? They seek the judgement of evil people, although they were commanded not to obey them. And Satan wants to lead them far astray.\n",
        "TRANSLATION_10": "Hast thou not observed those who assert that they believe in that which hath been sent down unto thee and that which hath been sent down before thee desiring to go to the devil for judgement, whereas they have been commanded to disbelieve in him; and Satan desireth to lead them far astray.\n",
        "TRANSLATION_11": "Have you not regarded those who claim that they believe in what has been sent down to you and what was sent down before you? They desire to seek the judgment of fake deities, though they were commanded to reject them, and Satan desires to lead them astray into far error.\n",
        "TRANSLATION_12": "Hast thou not turned Thy vision to those who declare that they believe in the revelations that have come to thee and to those before thee? Their (real) wish is to resort together for judgment (in their disputes) to the Evil One, though they were ordered to reject him. But Satan's wish is to lead them astray far away (from the right).\n",
        "TRANSLATION_13": "Have you seen those (hyprocrites) who claim that they believe in that which has been sent down to you, and that which was sent down before you, and they wish to go for judgement (in their disputes) to the Taghut (false judges, etc.) while they have been ordered to reject them. But Shaitan (Satan) wishes to lead them far astray.\n",
        "TRANSLATION_14": "Have you not seen those who claim that they believe in what has been sent down to you and what was sent down before you? They desire to be judged by the idol, although they have been commanded to disbelieve it. But satan desires to lead them astray into far error.\n",
        "TRANSLATION_15": "Have you not observed those who claim that they believe in what was revealed to you, and in what was revealed before you, yet they seek Satanic sources for legislation, in spite of being commanded to reject them? Satan means to mislead them far away.\n",
        "TRANSLATION_16": "Have you not seen those who claim to have believed in what was revealed to you, [O Muhammad], and what was revealed before you? They wish to refer legislation to Taghut, while they were commanded to reject it; and Satan wishes to lead them far astray.\n",
        "TRANSLATION_17": "[4:60] The following verse was revealed when a Jew and a hypocrite fell into a dispute. The hypocrite called on Ka‘b b. al-Ashraf, to arbitrate between them, while the Jew called on the Prophet (s). When they came to him, the Prophet ruled in favour of the Jew. But the hypocrite was not satisfied, and so they went before ‘Umar. The Jew told him what had happened, whereupon he [‘Umar] turned to the hypocrite and asked him, ‘Is this true?’, and when he replied, ‘Yes’, he [‘Umar] killed him. Have you not seen those who claim that they believe in what has been revealed to you, and what was revealed before you, desiring to take their disputes to a false deity (tāghūt), one excessive in tempting [others] to falsehood (tughyān), namely, Ka‘b b. al-Ashraf, when they have been commanded to renounce him?, and not to associate with him. But Satan desires to mislead them, far astray, from the truth.\n",
        "TRANSLATION_18": "(Hast thou not seen) have you not been informed, Muhammad, about (those who pretend that they believe in that which is revealed unto thee) i.e. the Qur'an (and that which was revealed before thee) i.e. the Torah, (how they would go for judgement (in their disputes) to false deities) Ka'b Ibn al-Ashraf (when they have been ordered) in the Qur'an (to abjure them?) to disavow them. (Satan would mislead them far astray) from the Truth and guidance. This verse was revealed about a hypocrite by the name of Bishr whom 'Umar Ibn al-Khattab had killed. This hypocrite had a dispute with a Jewish man.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "4:60",
            "34:53",
            "4:116",
            "4:167",
            "47:25",
            "2:4",
            "42:18",
            "10:91",
            "22:53",
            "22:12"
        ],
        "BIBLE": [
            "prophets:isaiah:10:2",
            "writings:daniel:4:15",
            "torah:deuteronomy:17:11",
            "writings:daniel:10:14",
            "torah:exodus:23:27",
            "prophets:judges:2:17",
            "prophets:joshua:1:8",
            "torah:exodus:32:1",
            "prophets:ii%20samuel:15:20",
            "writings:daniel:2:9"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:13",
            "Sefer%20Yetzirah:4:12"
        ]
    }
}