{
    "VERSE": "4:66",
    "ARABIC": "وَلَوْ أَنَّا كَتَبْنَا عَلَيْهِمْ أَنِ ٱقْتُلُوٓا۟ أَنفُسَكُمْ أَوِ ٱخْرُجُوا۟ مِن دِيَٰرِكُم مَّا فَعَلُوهُ إِلَّا قَلِيلٌ مِّنْهُمْ وَلَوْ أَنَّهُمْ فَعَلُوا۟ مَا يُوعَظُونَ بِهِۦ لَكَانَ خَيْرًا لَّهُمْ وَأَشَدَّ تَثْبِيتًا",
    "ENGLISH": {
        "TRANSLATION_0": "If We had directed them to kill themselves or leave their homes, they would not have done so, except for a very few. But if they had done what they were urged to do, it would have been better for them and far more strengthening.",
        "TRANSLATION_1": "If We had commanded them to lay down their lives and to go forth from their homes, only a few would have obeyed; though had they followed what they had been commanded it would surely have been good for them and the strengthening of their faith.\n",
        "TRANSLATION_2": "Had We enjoined upon them: 'Slay yourselves', or 'Leave your habitations', very few of them would have done it; yet if they had done as they were admonished, it would have been better for them and would have strengthened them;\n",
        "TRANSLATION_3": "Had We commanded them to kill themselves or abandon their homes, only a few of them would have done it. If they had done what they had been advised to do, it would have strengthened their faith,\n",
        "TRANSLATION_4": "And had We decreed for them to slay themselves or to leave their homes and families, only a few of them would have done it; and if they did what they are advised to, it would be good for them, and would have strengthened faith.\n",
        "TRANSLATION_5": "And if We had ordered them (saying), \"Kill yourselves (i.e. the innnocent ones kill the guilty ones) or leave your homes,\" very few of them would have done it; but if they had done what they were told, it would have been better for them, and would have strengthened their conviction;\n",
        "TRANSLATION_6": "And if We had prescribed for them: Lay down your lives or go forth from your homes, they would not have done it except a few of them; and if they had done what they were admonished, it would have certainly been better for them and best in strengthening (them);\n",
        "TRANSLATION_7": "But had We prescribed for them, saying, 'Slay yourselves' or 'Leave your habitations,' they would not have done it, save a few of them; yet if they had done as they were admonished it would have been better for them, and stronger confirming them,\n",
        "TRANSLATION_8": "And if We had decreed for them: Lay down your lives or go forth from your dwellings, but few of them would have done it; though if they did what they are exhorted to do it would be better for them, and more strengthening;\n",
        "TRANSLATION_9": "If We had commanded them, \"Lay down your lives or leave your dwellings,\" they would have not done it, save a few of them. If they had done what they were instructed to do, it would have been better for them, as well as more strengthening [for their faith],\n",
        "TRANSLATION_10": "And had We prescribed unto them: slay yourselves or go forth from your dwellings, they had not done it, save a few of them. And did they do that which they are exhorted to do, it would be for them better and more strengthening.\n",
        "TRANSLATION_11": "Had We prescribed for them, [commanding]: ‘Slay [the guilty among] your folks or leave your habitations,’ they would not have done it except a few of them. And if they had done as they were advised, it would have been better for them and stronger in confirming [their faith].\n",
        "TRANSLATION_12": "If We had ordered them to sacrifice their lives or to leave their homes, very few of them would have done it: But if they had done what they were (actually) told, it would have been best for them, and would have gone farthest to strengthen their (faith);\n",
        "TRANSLATION_13": "And if We had ordered them (saying), \"Kill yourselves (i.e. the innnocent ones kill the guilty ones) or leave your homes,\" very few of them would have done it; but if they had done what they were told, it would have been better for them, and would have strengthened their (Faith);\n",
        "TRANSLATION_14": "Had We written for them, saying, 'Slay yourselves' or 'Emerge from your houses' they would not have done so, except a few of them. Yet, if they had done as they were exhorted, it would have been better for them, and stronger in firmness,\n",
        "TRANSLATION_15": "Had We decreed for them: “Kill yourselves,” or “Leave your homes,” they would not have done it, except for a few of them. But had they done what they were instructed to do, it would have been better for them, and a firmer confirmation.\n",
        "TRANSLATION_16": "And if We had decreed upon them, \"Kill yourselves\" or \"Leave your homes,\" they would not have done it, except for a few of them. But if they had done what they were instructed, it would have been better for them and a firmer position [for them in faith].\n",
        "TRANSLATION_17": "[4:66] And had We prescribed for them: (the particle an, ‘that’, is explicative) ‘Slay yourselves’ or ‘Leave your habitations’, as We did for the Children of Israel, they would not have done it, that is, what has been prescribed for them, save a few (read nominative qalīlun, as a substitution; or read accusative qalīlan, as an   exceptive clause) of them; yet if they had done what they were admonished to do, of obedience to the Messenger (s), it would have been better for them, and stronger in establishing, [a stronger] confirmation of their faith.\n",
        "TRANSLATION_18": "(And if We had decreed for them) as We decreed for the Children of Israel: (Lay down your lives or go forth from your dwellings) empty handed, (but few of them) among the sincere ones, i.e. their leader Thabit Ibn Qays Ibn Shammas al-Ansari (would have done it) with a good disposition of the soul; (though if they) the hypocrites (did what they are exhorted) commanded (to do) of repentance and sincerity (it would be better for them) in the Hereafter than the condition they are in secret, (and more strengthening) and more real in this world;\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "4:66",
            "2:272",
            "59:9",
            "70:41",
            "4:46",
            "7:197",
            "2:103",
            "6:26",
            "2:110",
            "7:188"
        ],
        "BIBLE": [
            "prophets:ii%20samuel:2:27",
            "prophets:joshua:9:24",
            "prophets:ii%20samuel:11:10",
            "prophets:i%20samuel:19:11",
            "writings:i%20chronicles:28:20",
            "prophets:ii%20kings:11:15",
            "writings:psalms:23:6",
            "prophets:ii%20samuel:14:7",
            "torah:genesis:44:4",
            "prophets:ii%20samuel:14:32"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:2:4"
        ]
    }
}