{
    "VERSE": "4:68",
    "ARABIC": "وَلَهَدَيْنَٰهُمْ صِرَٰطًا مُّسْتَقِيمًا",
    "ENGLISH": {
        "TRANSLATION_0": "and We would have guided them on a straight path.",
        "TRANSLATION_1": "And led them to the path that is straight.\n",
        "TRANSLATION_2": "and guide them to a straight way.\n",
        "TRANSLATION_3": "and guided them to the right path.\n",
        "TRANSLATION_4": "And would certainly guide them to the Straight Path.\n",
        "TRANSLATION_5": "And indeed We would have guided them to the straight way.\n",
        "TRANSLATION_6": "And We would certainly have guided them in the right path.\n",
        "TRANSLATION_7": "and guided them on a straight path.\n",
        "TRANSLATION_8": "And should guide them unto a straight path.\n",
        "TRANSLATION_9": "and guided them to a straight path.\n",
        "TRANSLATION_10": "And We would surely have guided them on the right path.\n",
        "TRANSLATION_11": "and We would have guided them to a straight path.\n",
        "TRANSLATION_12": "And We should have shown them the Straight Way.\n",
        "TRANSLATION_13": "And indeed We should have guided them to a Straight Way.\n",
        "TRANSLATION_14": "and guided them to a Straight Path.\n",
        "TRANSLATION_15": "And We would have guided them on a straight path.\n",
        "TRANSLATION_16": "And We would have guided them to a straight path.\n",
        "TRANSLATION_17": "[4:68] And We would have guided them to a straight path. Some Companions said to the Prophet (s): ‘How will we be able to see you in Paradise, when you will be in the highest stations and we will be lower than you?’, and so the following was revealed:\n",
        "TRANSLATION_18": "(And should guide them unto a straight path) and We would have made them in this world firm upon an established Religion that We are pleased with, i.e. Islam.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "4:68",
            "37:118",
            "23:73",
            "1:6",
            "36:61",
            "23:74",
            "36:66",
            "7:16",
            "15:41",
            "22:24"
        ],
        "BIBLE": [
            "writings:psalms:107:7",
            "prophets:isaiah:26:7",
            "writings:psalms:5:9",
            "writings:proverbs:12:26",
            "writings:psalms:18:33",
            "writings:proverbs:12:15",
            "writings:psalms:25:4",
            "writings:proverbs:21:8",
            "writings:proverbs:11:5",
            "writings:psalms:27:11"
        ]
    }
}