{
    "VERSE": "4:70",
    "ARABIC": "ذَٰلِكَ ٱلْفَضْلُ مِنَ ٱللَّهِ وَكَفَىٰ بِٱللَّهِ عَلِيمًا",
    "ENGLISH": {
        "TRANSLATION_0": "That is favour from Allah. Allah suffices as a Knower.",
        "TRANSLATION_1": "This is a favour from God; and sufficient is God, the all-knowing.\n",
        "TRANSLATION_2": "That is a bounty from Allah, and Allah suffices to know the truth.\n",
        "TRANSLATION_3": "The favors of God are such, and He knows very well (how to reward you).\n",
        "TRANSLATION_4": "This is Allah’s munificence; and Allah is Sufficient, the All Knowing.\n",
        "TRANSLATION_5": "Such is the bounty from Allah, and Allah is sufficient as All-Knower.\n",
        "TRANSLATION_6": "This is grace from Allah, and sufficient is Allah as the Knower.\n",
        "TRANSLATION_7": "That is the bounty from God; God suffices as One who knows.\n",
        "TRANSLATION_8": "That is bounty from Allah, and Allah sufficeth as Knower.\n",
        "TRANSLATION_9": "That is God's favour. Sufficient is God's infinite knowledge.\n",
        "TRANSLATION_10": "That is the grace from Allah, and sufficeth Allah as Knower!\n",
        "TRANSLATION_11": "That is the grace of Allah, and Allah suffices as knower [of His creatures].\n",
        "TRANSLATION_12": "Such is the bounty from Allah: And sufficient is it that Allah knoweth all.\n",
        "TRANSLATION_13": "Such is the Bounty from Allah, and Allah is Sufficient as All-Knower.\n",
        "TRANSLATION_14": "This is the Bounty of Allah. It is sufficient that Allah is the Knowledgeable.\n",
        "TRANSLATION_15": "That is the grace from God. God suffices as Knower.\n",
        "TRANSLATION_16": "That is the bounty from Allah, and sufficient is Allah as Knower.\n",
        "TRANSLATION_17": "[4:70] That, namely, their being with those mentioned (dhālika, ‘that’, is the subject, the predicate of which is [the following]) is bounty from God, with which He has favoured them, and not because they have earned it through their obedience. God suffices as Knower, of the reward of the Hereafter, in other words, trust in what He has told you: None can tell you like One Who is aware [Q. 35:14].\n",
        "TRANSLATION_18": "(Such) keeping the company of the prophets, saints, martyrs and righteous (is the bounty of Allah) a favour from Allah, (and Allah sufficeth as knower) of the love of Thawban and the honour and reward bestowed upon him in Paradise.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "4:70",
            "62:4",
            "84:23",
            "3:63",
            "2:268",
            "6:53",
            "49:8",
            "3:74",
            "3:115",
            "2:64"
        ],
        "BIBLE": [
            "writings:job:9:2",
            "writings:psalms:135:5",
            "prophets:joshua:22:22",
            "torah:exodus:33:16",
            "writings:psalms:73:11",
            "prophets:hosea:8:2",
            "writings:job:21:22",
            "prophets:ezekiel:10:20",
            "writings:proverbs:3:4",
            "torah:exodus:33:17"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:14",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:4:1"
        ]
    }
}