{
    "VERSE": "4:71",
    "ARABIC": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ خُذُوا۟ حِذْرَكُمْ فَٱنفِرُوا۟ ثُبَاتٍ أَوِ ٱنفِرُوا۟ جَمِيعًا",
    "ENGLISH": {
        "TRANSLATION_0": "You who have iman! take all necessary precautions, then go out to fight in separate groups or go out as one body.",
        "TRANSLATION_1": "O believers, take precautions, and advance in detachments, or go all together in a body.\n",
        "TRANSLATION_2": "Believers! Always be on your guard against encounters. Then (as circumstance demands) either advance in detachments or advance in a body.\n",
        "TRANSLATION_3": "Believers, always be well prepared and on your guard. March in small groups or all together.\n",
        "TRANSLATION_4": "O People who Believe! Be cautious, then advance towards the enemy in small numbers or all together.\n",
        "TRANSLATION_5": "O you who believe! Take your precautions, and either go forth (on an expedition) in parties, or go forth all together.\n",
        "TRANSLATION_6": "O you who believe! take your precaution, then go forth in detachments or go forth in a body.\n",
        "TRANSLATION_7": "O believers, take your precautions; then move forward in companies, or move forward all together.\n",
        "TRANSLATION_8": "O ye who believe! Take your precautions, then advance the proven ones, or advance all together.\n",
        "TRANSLATION_9": "You who believe, take your precautions and then go forth in small groups or go forth all together.\n",
        "TRANSLATION_10": "O Ye who believe! take your precaution then sally forth in detachment or sally forth all together.\n",
        "TRANSLATION_11": "O you who have faith! Take your precautions, then go forth in companies, or go forth en masse.\n",
        "TRANSLATION_12": "O ye who believe! Take your precautions, and either go forth in parties or go forth all together.\n",
        "TRANSLATION_13": "O you who believe! Take your precautions, and either go forth (on an expedition) in parties, or go forth all together.\n",
        "TRANSLATION_14": "Believers, take your precautions. March in detachments or march all together.\n",
        "TRANSLATION_15": "O you who believe! Take your precautions, and mobilize in groups, or mobilize altogether.\n",
        "TRANSLATION_16": "O you who have believed, take your precaution and [either] go forth in companies or go forth all together.\n",
        "TRANSLATION_17": "[4:71] O you who believe, take your precautions, against your enemy, that is, be wary of him and be vigilant against him; then move forward, prepare to fight him, in companies, in separate groups, one raiding party followed by the next; or move forward all together, in one assembly.\n",
        "TRANSLATION_18": "Knowing that they went out to fight in the way of Allah, Allah said: (0 ye who believe) in Muhammad and the Qur'an! (Take your precautions) against your enemy and do not advance dispersed, (then advance the proven ones) then put forward the ones that are the best, (or advance all together) with your Prophet.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "4:71",
            "54:44",
            "3:149",
            "100:5",
            "43:55",
            "6:22",
            "10:28",
            "62:9",
            "38:85",
            "61:2"
        ],
        "BIBLE": [
            "prophets:jeremiah:16:5",
            "prophets:ezekiel:18:13",
            "torah:genesis:3:23",
            "prophets:jeremiah:48:7",
            "writings:psalms:71:1",
            "prophets:zephaniah:3:15",
            "torah:numbers:1:2",
            "torah:numbers:26:4",
            "torah:deuteronomy:2:1",
            "torah:deuteronomy:31:26"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:2",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:6"
        ]
    }
}