{
    "VERSE": "4:75",
    "ARABIC": "وَمَا لَكُمْ لَا تُقَٰتِلُونَ فِى سَبِيلِ ٱللَّهِ وَٱلْمُسْتَضْعَفِينَ مِنَ ٱلرِّجَالِ وَٱلنِّسَآءِ وَٱلْوِلْدَٰنِ ٱلَّذِينَ يَقُولُونَ رَبَّنَآ أَخْرِجْنَا مِنْ هَٰذِهِ ٱلْقَرْيَةِ ٱلظَّالِمِ أَهْلُهَا وَٱجْعَل لَّنَا مِن لَّدُنكَ وَلِيًّا وَٱجْعَل لَّنَا مِن لَّدُنكَ نَصِيرًا",
    "ENGLISH": {
        "TRANSLATION_0": "What reason could you have for not fighting in the Way of Allah - for those men, women and children who are oppressed and say, 'Our Lord, take us out of this city whose inhabitants are wrongdoers! Give us a protector from You! Give us a helper from You!'?",
        "TRANSLATION_1": "What has come upon you that you fight not in the cause of God and for the oppressed, men, women and children, who pray: \"Get us out of this city, O Lord, whose people are oppressors; so send us a friend by Your will, and send us a helper.\"\n",
        "TRANSLATION_2": "How is it that you do not fight in the way of Allah and in support of the helpless - men, women and children -who pray: 'Our Lord, bring us out of this land whose people are oppressors and appoint for us from Yourself, a protector, and appoint for us from Yourself a helper'?.\n",
        "TRANSLATION_3": "Why do you not fight for the cause of God or save the helpless men, women, and children who cry out, \"Lord, set us free from this town of wrong doers and send us a guardian and a helper?\"\n",
        "TRANSLATION_4": "And what is the matter with you, that you should not fight in Allah’s cause and for the feeble men, and women, and children, who invoke, “Our Lord! Liberate us from this town, the people of which are unjust; and give us a protector from Yourself; and give us a supporter from Yourself.” (Allah has created many supporters for the believers.)\n",
        "TRANSLATION_5": "And what is wrong with you that you fight not in the cause of Allah, and for those weak, ill-treated and oppressed among men, women, and children, whose cry is: \"Our Lord! Rescue us from this town whose people are oppressors; and raise for us from You one who will protect, and raise for us from You one who will help.\"\n",
        "TRANSLATION_6": "And what reason have you that you should not fight in the way of Allah and of the weak among the men and the women and the children, (of) those who say: Our Lord! cause us to go forth from this town, whose people are oppressors, and give us from Thee a guardian and give us from Thee a helper.\n",
        "TRANSLATION_7": "How is it with you, that you do not fight in the way of God, and for the men, women, and children who, being abased, say, 'Our Lord, bring us forth from this city whose people are evildoers, and appoint t us a protector from Thee, and appoint to us from Thee a helper'?\n",
        "TRANSLATION_8": "How should ye not fight for the cause of Allah and of the feeble among men and of the women and the children who are crying: Our Lord! Bring us forth from out this town of which the people are oppressors! Oh, give us from thy presence some protecting friend! Oh, give us from Thy presence some defender!\n",
        "TRANSLATION_9": "And how should you not fight for the cause of God, and for the helpless old men, women, and children who say, \"Deliver us, Lord, from this city of wrongdoers, grant us a protector out of Your grace and grant us a supporter out of Your grace?\"\n",
        "TRANSLATION_10": "And what aileth you that ye fight not in the way of Allah and for the oppressed among men and women and Children who say: our Lord! take US forth from this town whereof the people are Wrong-doing, and appoint us from before Thee a patron, and appoint us from before Thee a helper!\n",
        "TRANSLATION_11": "Why should you not fight in the way of Allah and the oppressed men, women, and children, who say, ‘Our Lord, bring us out of this town whose people are oppressors, and appoint for us a guardian from Yourself, and appoint for us a helper from Yourself’?\n",
        "TRANSLATION_12": "And why should ye not fight in the cause of Allah and of those who, being weak, are ill-treated (and oppressed)?- Men, women, and children, whose cry is: \"Our Lord! Rescue us from this town, whose people are oppressors; and raise for us from Thee one who will protect; and raise for us from Thee one who will help!\"\n",
        "TRANSLATION_13": "And what is wrong with you that you fight not in the Cause of Allah, and for those weak, ill-treated and oppressed among men, women, and children, whose cry is: \"Our Lord! Rescue us from this town whose people are oppressors; and raise for us from You one who will protect, and raise for us from You one who will help.\"\n",
        "TRANSLATION_14": "So why is it, that you do not fight in the way of Allah, and for the abased among men, women, and children who say: 'Our Lord, bring us out from this village whose people are harmdoers, and give to us a guardian from You, and give to us a helper from You.'\n",
        "TRANSLATION_15": "And why would you not fight in the cause of God, and the helpless men, and women, and children, cry out, “Our Lord, deliver us from this town whose people are oppressive, and appoint for us from Your Presence a Protector, and appoint for us from Your Presence a Victor.”\n",
        "TRANSLATION_16": "And what is [the matter] with you that you fight not in the cause of Allah and [for] the oppressed among men, women, and children who say, \"Our Lord, take us out of this city of oppressive people and appoint for us from Yourself a protector and appoint for us from Yourself a helper?\"\n",
        "TRANSLATION_17": "[4:75] What is wrong with you, that you do not fight: this is an interrogative of rebuke, in other words, there is nothing to prevent you from fighting, in the way of God, and for, the deliverance of, the oppressed men, women, and children, whom the disbelievers persecuted and prevented from emigrating. Ibn ‘Abbās, may God be pleased with him and his father, said, ‘My mother and I were among them’; who say, supplicating, ‘O, our Lord, bring us forth from this town, Mecca, whose people are evildoers, through unbelief, and appoint for us a protector from You, to take charge of our affair, and appoint for us from You a helper’, to defend us against them. God responded to their supplication and facilitated escape for some of them, while others remained behind until Mecca was conquered — in charge of them the Prophet (s) placed ‘Attāb b. Asīd, who proceeded to seek justice for the wronged from those that had wronged them.\n",
        "TRANSLATION_18": "Allah then mentioned their dislike of fighting in the way of Allah, saying: (How should ye) group of believers (not fight for the cause of Allah) in obedience of Allah against the people of Mecca (and of the feeble among men and of the women and the children who are crying) in Mecca: (Our Lord!) our Lord! (Bring us forth from out this town) i.e. Mecca (of which the people are oppressors!) whose people are idolaters (Oh, give us from Thy presence) from You (some protecting friend!) a protector, meaning: 'Itab Ibn Usayd. (Oh, give us from Thy presence) from You (some defender!) who would prevent us from suffering. Allah answered their prayers and made the Prophet (pbuh) their defender and 'Itab their protecting friend. 94\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "4:75",
            "4:98",
            "4:7",
            "42:46",
            "4:123",
            "4:89",
            "42:31",
            "5:51",
            "33:17",
            "4:127"
        ],
        "BIBLE": [
            "prophets:ezekiel:33:2",
            "prophets:ezekiel:37:12",
            "prophets:joshua:22:24",
            "writings:daniel:9:15",
            "writings:ii%20chronicles:32:17",
            "prophets:jeremiah:52:25",
            "prophets:ii%20samuel:18:28",
            "prophets:ezekiel:11:15",
            "torah:exodus:34:9",
            "torah:leviticus:20:24"
        ]
    }
}