{
    "VERSE": "4:79",
    "ARABIC": "مَّآ أَصَابَكَ مِنْ حَسَنَةٍ فَمِنَ ٱللَّهِ وَمَآ أَصَابَكَ مِن سَيِّئَةٍ فَمِن نَّفْسِكَ وَأَرْسَلْنَٰكَ لِلنَّاسِ رَسُولًا وَكَفَىٰ بِٱللَّهِ شَهِيدًا",
    "ENGLISH": {
        "TRANSLATION_0": "Any good thing that happens to you comes from Allah. Any bad thing that happens to you comes from yourself. We have sent you to mankind as a Messenger. Allah suffices as a Witness.",
        "TRANSLATION_1": "What comes to you of good is verily from God; and what comes to you of ill is from your own self (your actions). We have sent you as apostle to all mankind; and God is sufficient as witness.\n",
        "TRANSLATION_2": "Whatever good happens to you is from Allah; and whatever misfortune smites you is because of your own action. We have sent you to mankind (O Muhammad!) as a Messenger, and Allah is sufficient as a witness.\n",
        "TRANSLATION_3": "Whatever good you may receive is certainly from God and whatever you suffer is from yourselves. We have sent you, (Muhammad), as a Messenger to people. God is a Sufficient witness to your truthfulness.\n",
        "TRANSLATION_4": "Whatever good reaches you, O listeners, is from Allah, and whatever ill reaches you is from yourselves; and We have sent you (O dear Prophet Mohammed – peace and blessings be upon him) as a Noble Messenger towards all mankind; and Allah is Sufficient, as a Witness.\n",
        "TRANSLATION_5": "Whatever of good reaches you, is from Allah, but whatever of evil befalls you, is from yourself. And We have sent you as a Messenger to mankind, and Allah is sufficient as a Witness.\n",
        "TRANSLATION_6": "Whatever benefit comes to you (O man!), it is from Allah, and whatever misfortune befalls you, it is from yourself, and We have sent you (O Prophet!), to mankind as an apostle; and Allah is sufficient as a witness.\n",
        "TRANSLATION_7": "Whatever good visits thee, it is of God; whatever evil visits thee is of thyself. And We have sent thee to men a Messenger; God suffices for a witness.\n",
        "TRANSLATION_8": "Whatever of good befalleth thee (O man) it is from Allah, and whatever of ill befalleth thee it is from thyself. We have sent thee (Muhammad) as a messenger unto mankind and Allah is sufficient as Witness.\n",
        "TRANSLATION_9": "Whatever good befalls you, it is from God: and whatever ill befalls you is from yourself. We have sent you forth as a messenger to mankind; and God suffices as a witness.\n",
        "TRANSLATION_10": "Whatsoever of good betideth thee is from Allah, and whatsoever of ill betideth thee is because of thy self. And We have sent thee unto the mankind as an apostle; and sufficieth Allah as a Witness.\n",
        "TRANSLATION_11": "Whatever good befalls you is from Allah; and whatever ill befalls you is from yourself. We sent you as an apostle to mankind, and Allah suffices as witness.\n",
        "TRANSLATION_12": "Whatever good, (O man!) happens to thee, is from Allah; but whatever evil happens to thee, is from thy (own) soul. and We have sent thee as a messenger to (instruct) mankind. And enough is Allah for a witness.\n",
        "TRANSLATION_13": "Whatever of good reaches you, is from Allah, but whatever of evil befalls you, is from yourself. And We have sent you (O Muhammad SAW) as a Messenger to mankind, and Allah is Sufficient as a Witness.\n",
        "TRANSLATION_14": "Whatever good reaches you, it is from Allah, and whatever evil reaches you, it is from yourself. We have sent you (Prophet Muhammad) as a Messenger to humanity. Allah is sufficient for a Witness.\n",
        "TRANSLATION_15": "Whatever good happens to you is from God, and whatever bad happens to you is from your own self. We sent you to humanity as a messenger, and God is Witness enough.\n",
        "TRANSLATION_16": "What comes to you of good is from Allah, but what comes to you of evil, [O man], is from yourself. And We have sent you, [O Muhammad], to the people as a messenger, and sufficient is Allah as Witness.\n",
        "TRANSLATION_17": "[4:79] Whatever good (hasana means khayr) befalls you, O man, it is from God, it has come to you from His   bounty; whatever evil, misfortune, befalls you is from yourself, it has come to you as a necessary consequence of sins you have committed. We have sent you, O Muhammad (s), to people as a messenger (rasūlan, is a circumstantial qualifier for emphasis), and God suffices as Witness, of your Mission.\n",
        "TRANSLATION_18": "Allah then mentioned that which brings bounty and hardship, saying: (Whatever of good) of land fertility, low prices and continuous rain throughout the year (befalleth thee) Muhammad (it is from Allah) it is of Allah's bounty for you. Although Allah addressed Muhammad (pbuh) here it was his people who were meant by it, (and whatever of ill) drought, dearth and high prices (befalleth thee it is from yourself) it is because of the purity of yourself, in that He purifies you because of it; it is also said that the above means: whatever good befalls you, such as conquest and booty, it is from Allah, as an honour from Allah; and whatever bad happens, such as killing and defeat as was the case at Uhud, is due to the transgression of your Companions when they left their positions. It is also said that this means: whatever good you do is because of Allah's given success and help; and whatever evil you commit is due to the transgression of your soul and His having forsaken you. (We have sent thee (Muhammad) as a messenger) to convey the message (unto mankind) to the jinn and human beings (and Allah is sufficient as witness) of that which they say: whatever good befalls them is from Allah and whatever evil befalls them is due to the ill-omen of Muhammad (pbuh) and his companions. It is also said that this means: Allah is sufficient as witness for their saying: bring a witness to testify that you are a messenger from Allah. 95\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "4:79",
            "2:207",
            "4:80",
            "4:64",
            "64:16",
            "4:69",
            "4:61",
            "2:72",
            "4:108",
            "64:8"
        ],
        "BIBLE": [
            "prophets:i%20kings:17:18",
            "prophets:ii%20kings:5:8",
            "prophets:ezekiel:23:40",
            "prophets:ezekiel:37:9",
            "writings:ii%20chronicles:14:10",
            "prophets:judges:13:8",
            "prophets:hosea:9:7",
            "prophets:jeremiah:14:19",
            "prophets:isaiah:52:7",
            "prophets:jeremiah:4:10"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:5:1"
        ]
    }
}