{
    "VERSE": "4:83",
    "ARABIC": "وَإِذَا جَآءَهُمْ أَمْرٌ مِّنَ ٱلْأَمْنِ أَوِ ٱلْخَوْفِ أَذَاعُوا۟ بِهِۦ وَلَوْ رَدُّوهُ إِلَى ٱلرَّسُولِ وَإِلَىٰٓ أُو۟لِى ٱلْأَمْرِ مِنْهُمْ لَعَلِمَهُ ٱلَّذِينَ يَسْتَنۢبِطُونَهُۥ مِنْهُمْ وَلَوْلَا فَضْلُ ٱللَّهِ عَلَيْكُمْ وَرَحْمَتُهُۥ لَٱتَّبَعْتُمُ ٱلشَّيْطَٰنَ إِلَّا قَلِيلًا",
    "ENGLISH": {
        "TRANSLATION_0": "When news of any matter reaches them they spread it about, whether it is of a reassuring or disquieting nature. If they had only referred it to the Messenger and those in command among them, those among them able to discern the truth about it would have had proper knowledge of it. If it were not for Allah's favour to you and His mercy, all but a very few of you would have followed Shaytan.",
        "TRANSLATION_1": "And when any tidings of peace or war come to them they spread the news around. Had they gone to the Prophet or those in authority among them, then those who check and scrutinize would have known it, And but for the favour of God and His mercy you would certainly have followed Satan, except a few.\n",
        "TRANSLATION_2": "Whenever they come upon any news bearing upon either security or causing consternation they go about spreading it, whereas if they were to convey it to either the Messenger or to those from among them who are entrusted with authority, it would come to the knowledge of those who are competent to investigate it. But for Allah's bounty and mercy upon you, (weak as you were) all but a few of you would surely have followed Satan.\n",
        "TRANSLATION_3": "When they receive any news of peace or war, they announce it in public. Had they told it to the Messenger or to their (qualified) leaders, they could have used that information more properly. Were it not for the favor and mercy of God, all but a few of them would have followed Satan.\n",
        "TRANSLATION_4": "And when any news of safety or fear comes to them, they speak of it publicly; and had they referred it to the Noble Messenger and to those among them having authority, those among them who are able to infer would certainly learn the truth of the matter from them; and were it not for Allah’s munificence upon you, and His mercy, all of you would have certainly followed Satan – except a few.\n",
        "TRANSLATION_5": "When there comes to them some matter touching (public) safety or fear, they make it known (among the people); if only they had referred it to the Messenger or to those charged with authority among them, the proper investigators would have understood it from them (directly). Had it not been for the grace and mercy of Allah upon you, you would have followed Shaytan, except a few of you.\n",
        "TRANSLATION_6": "And when there comes to them news of security or fear they spread it abroad; and if they had referred it to the Apostle and to those in authority among them, those among them who can search out the knowledge of it would have known it, and were it not for the grace of Allah upon you and His mercy, you would have certainly followed the Shaitan save a few\n",
        "TRANSLATION_7": "When there comes to them a matter, be it of security or fear, they broadcast it; if they had referred it to the Messenger and to those in authority among them, those of them whose task it is to investigate would have known the matter. And but for the bounty of God to you, and His mercy, you would surely have followed Satan, except a few.\n",
        "TRANSLATION_8": "And if any tidings, whether of safety or fear, come unto them, they noise it abroad, whereas if they had referred it to the messenger and to such of them as are in authority, those among them who are able to think out the matter would have known it. If it had not been for the grace of Allah upon you and His mercy ye would have followed Satan, save a few (of you).\n",
        "TRANSLATION_9": "When they hear any news, whether of peace or of something fearful, they spread it about; whereas if they referred it to the Messenger and to the men in charge, those of them who would have investigated it and could have arrived at the truth of the matter. But for God's grace and mercy, all but a few of you would have followed Satan.\n",
        "TRANSLATION_10": "And when there cometh unto them aught of security aught of alarm, they bruit it; abroad: whereas had they referred it to the apostle and those in authority among them, then those of them who can think it out would have known it. And had there not been Allah's grace upon you and His mercy, ye would surely have followed Satan, save a few.\n",
        "TRANSLATION_11": "When a report of safety or alarm comes to them, they immediately broadcast it; but had they referred it to the Apostle or to those vested with authority among them, those of them who investigate would have ascertained it. And were it not for Allah’s grace upon you and His mercy, you would have surely followed Satan, [all] except a few.\n",
        "TRANSLATION_12": "When there comes to them some matter touching (Public) safety or fear, they divulge it. If they had only referred it to the Messenger, or to those charged with authority among them, the proper investigators would have Tested it from them (direct). Were it not for the Grace and Mercy of Allah unto you, all but a few of you would have fallen into the clutches of Satan.\n",
        "TRANSLATION_13": "When there comes to them some matter touching (public) safety or fear, they make it known (among the people), if only they had referred it to the Messenger or to those charged with authority among them, the proper investigators would have understood it from them (directly). Had it not been for the Grace and Mercy of Allah upon you, you would have followed Shaitan (Satan), save a few of you.\n",
        "TRANSLATION_14": "When a matter comes to them, be it of security or fear, they broadcast it, whereas if they returned it to the Messenger and to those in authority among them, those of them whose task is to research it would have known it. If it was not for the Bounty of Allah and His Mercy, all but a few of you would have followed satan.\n",
        "TRANSLATION_15": "When some news of security or alarm comes their way, they broadcast it. But had they referred it to the Messenger, and to those in authority among them, those who can draw conclusions from it would have comprehended it. Were it not for God’s blessing and mercy upon you, you would have followed the Devil, except for a few.\n",
        "TRANSLATION_16": "And when there comes to them information about [public] security or fear, they spread it around. But if they had referred it back to the Messenger or to those of authority among them, then the ones who [can] draw correct conclusions from it would have known about it. And if not for the favor of Allah upon you and His mercy, you would have followed Satan, except for a few.\n",
        "TRANSLATION_17": "[4:83] And when there comes to them an issue, [news] concerning the raiding parties sent by the Prophet (s) and what has happened to them, be it of security, through victory, or of fear, through defeat, they broadcast it, they make it widely-known: this was revealed regarding a group from among the hypocrites, or from among the feeble believers, who used to do this, and so the hearts of the believers would lose courage and the Prophet (s) would become distressed. If they had referred it, the news, to the Messenger and to those in authority among them, that is, the judicious elders among the Companions, in other words, if they had kept quiet about it until they were fully informed; those among them who are able to think it out, [those who] follow it up and seek knowledge of it, the ones who broadcast it, would have known it, and whether it is a matter that ought be broadcast or not, from them, from the Prophet (s) and those of authority. And but for the bounty of God to you, through Islam, and His mercy, to you through the Qur’ān, you would surely have followed Satan, in the abominations to which he commands you, except a few [of you].\n",
        "TRANSLATION_18": "Allah then mentioned the betrayal of the hypocrites, saying: (And if any tidings whether of safety) any news about the army, conquest or booty, they insist on it out of resentful envy (or fear) and when they receive any news about the army, killings or defeat, (come unto them, they noise it abroad) they divulge it, (whereas if they had referred it) the news of the army (to the messenger) until the messenger informs them (and such of them as are in authority) those possessed of reason and understanding, i.e. Abu Bakr and his companions, (those among them who are able to think out the matter would have known it) i.e. the precise news. (If it had not been for the grace of Allah and His mercy) by means of His given success and protection (you would have followed Satan) all of you, (save a few (of you)) who would not divulge the news.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "4:83",
            "24:21",
            "2:64",
            "7:49",
            "24:62",
            "4:59",
            "3:159",
            "6:121",
            "4:64",
            "4:61"
        ],
        "BIBLE": [
            "prophets:ii%20kings:1:6",
            "prophets:joshua:8:11",
            "writings:ruth:2:9",
            "prophets:i%20samuel:30:21",
            "prophets:judges:19:9",
            "torah:deuteronomy:13:14",
            "torah:numbers:31:47",
            "prophets:ii%20kings:17:15",
            "prophets:joshua:6:20",
            "prophets:i%20kings:13:4"
        ]
    }
}