{
    "VERSE": "4:84",
    "ARABIC": "فَقَٰتِلْ فِى سَبِيلِ ٱللَّهِ لَا تُكَلَّفُ إِلَّا نَفْسَكَ وَحَرِّضِ ٱلْمُؤْمِنِينَ عَسَى ٱللَّهُ أَن يَكُفَّ بَأْسَ ٱلَّذِينَ كَفَرُوا۟ وَٱللَّهُ أَشَدُّ بَأْسًا وَأَشَدُّ تَنكِيلًا",
    "ENGLISH": {
        "TRANSLATION_0": "So fight in the way of Allah - you are only answerable for yourself - and spur on the muminun. It may well be that Allah will curb the force of the kuffar. Allah has greater force and greater power to punish.",
        "TRANSLATION_1": "So fight on in the way of God (irrespective of the others). You cannot compel any one except your own self; but urge the believers to fight. It may well be that God will keep back the might of the infidels, for God's might is greater, and severe His punishment.\n",
        "TRANSLATION_2": "(So, O Messenger!) Fight in the way of Allah -since you are responsible for none except yourself - and rouse the believers to fight, for Allah may well curb the might of the unbelievers. Indeed Allah is strongest in power and most terrible in chastisement.\n",
        "TRANSLATION_3": "Thus, (Muhammad), fight for the cause of God. You are only responsible for yourself. Rouse the believers and perhaps God will stop the evil designs of the unbelievers. God's punishment and retribution is the most severe.\n",
        "TRANSLATION_4": "Therefore O dear Prophet, fight in Allah's cause; you will not be burdened except for yourself, and urge the believers (to fight); it is likely that Allah will curb the strength of the disbelievers; and Allah's strike is most stinging and His punishment the most severe.\n",
        "TRANSLATION_5": "Then fight in the cause of Allah, you are not tasked (held responsible) except for yourself, and incite the believers (to fight along with you), it may be that Allah will restrain the evil might of the disbelievers. And Allah is Stronger in might and Stronger in punishing.\n",
        "TRANSLATION_6": "Fight then in Allah's way; this is not imposed on you except In relation to yourself, and rouse the believers to ardor maybe Allah will restrain the fighting of those who disbelieve and Allah is strongest in prowess and strongest to give an exemplary punishment.\n",
        "TRANSLATION_7": "So do thou fight in the way of God; thou art charged only with thyself. And urge on the believers; haply God will restrain the unbelievers' might; God is stronger in might, more terrible in punishing.\n",
        "TRANSLATION_8": "So fight (O Muhammad) in the way of Allah Thou art not taxed (with the responsibility for anyone) except thyself - and urge on the believers. Peradventure Allah will restrain the might of those who disbelieve. Allah is stronger in might and stronger in inflicting punishment.\n",
        "TRANSLATION_9": "So fight for the cause of God. You are responsible only for yourself. Urge on the believers. God may fend off the power [violence] of those who deny the truth, for He is stronger in might and stronger in inflicting punishment.\n",
        "TRANSLATION_10": "Fight thou therefore in the way of Allah thou are not tasked except for thy own soul, and persuade the believers; belike Allah will withhold the violence of those who disbelieve. And Allah is stronger in violence and Stronger in chastising.\n",
        "TRANSLATION_11": "So fight in the way of Allah: you are responsible only for yourself, but urge on the faithful [to fight]. Maybe Allah will curb the might of the faithless, for Allah is greatest in might and severest in punishment.\n",
        "TRANSLATION_12": "Then fight in Allah's cause - Thou art held responsible only for thyself - and rouse the believers. It may be that Allah will restrain the fury of the Unbelievers; for Allah is the strongest in might and in punishment.\n",
        "TRANSLATION_13": "Then fight (O Muhammad SAW) in the Cause of Allah, you are not tasked (held responsible) except for yourself, and incite the believers (to fight along with you), it may be that Allah will restrain the evil might of the disbelievers. And Allah is Stronger in Might and Stronger in punishing.\n",
        "TRANSLATION_14": "Therefore, fight in the way of Allah. You are only responsible for yourself. Urge the believers on, in order that Allah may restrain the might of those who disbelieve. Allah is stronger in might, and stronger in punishment.\n",
        "TRANSLATION_15": "So fight in the cause of God; you are responsible only for yourself. And rouse the believers. Perhaps God will restrain the might of those who disbelieve. God is Stronger in Might, and More Punishing.\n",
        "TRANSLATION_16": "So fight, [O Muhammad], in the cause of Allah; you are not held responsible except for yourself. And encourage the believers [to join you] that perhaps Allah will restrain the [military] might of those who disbelieve. And Allah is greater in might and stronger in [exemplary] punishment.\n",
        "TRANSLATION_17": "[4:84] So fight, O Muhammad (s), in the way of God; you are charged only with yourself, so do not be concerned with their failing to join you, the meaning being: fight, even if you are on your own, for you have been promised victory. And urge on the believers, incite them to fight and make them desire it; maybe God will restrain the might, the war, of the disbelievers; God is mightier, than them, and more severe in castigation, in punishment, than them. And so the Messenger of God (s) said: ‘By Him in Whose Hand is my soul, I shall sally forth [to fight], even if [I go] alone’. Thereupon, he sallied forth with seventy cavalrymen to the first [battle at] Badr, where God restrained the might of the disbelievers by casting terror into their hearts and preventing Abū Sufyān from sallying forth, as has already been mentioned in [sūrat] Āl ‘Imrān [Q. 3:151].\n",
        "TRANSLATION_18": "Then Allah commanded His Prophet to engage in jihad in the way of Allah and proceed to the Lesser Badr, saying: (So fight (0 Muhammad) in the way of Allah) in obedience of Allah. (Thou are not taxed) you are not commanded this (except for thyself and urge on the believers) to advance with you. (Peradventure Allah) peradventure when it is used in relation to Allah means that Allah will take it upon Himself (will restrain) will stop (the might) the fighting (of those who disbelieve) the unbelievers of Mecca. (Allah is stronger in might) in His torment (and stronger in inflicting punishment).\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "4:84",
            "59:19",
            "2:9",
            "2:190",
            "10:100",
            "49:15",
            "29:69",
            "9:81",
            "2:72",
            "40:85"
        ],
        "BIBLE": [
            "prophets:jeremiah:4:19",
            "prophets:i%20kings:2:3",
            "prophets:isaiah:64:11",
            "prophets:isaiah:25:1",
            "writings:psalms:21:14",
            "prophets:ii%20kings:7:9",
            "writings:i%20chronicles:22:13",
            "prophets:jeremiah:12:1",
            "prophets:jeremiah:14:22",
            "prophets:jeremiah:20:9"
        ]
    }
}