{
    "VERSE": "4:85",
    "ARABIC": "مَّن يَشْفَعْ شَفَٰعَةً حَسَنَةً يَكُن لَّهُۥ نَصِيبٌ مِّنْهَا وَمَن يَشْفَعْ شَفَٰعَةً سَيِّئَةً يَكُن لَّهُۥ كِفْلٌ مِّنْهَا وَكَانَ ٱللَّهُ عَلَىٰ كُلِّ شَىْءٍ مُّقِيتًا",
    "ENGLISH": {
        "TRANSLATION_0": "Those who join forces for good will receive a reward for it. Those who join forces for evil will be answerable for it. Allah gives all things what they deserve.",
        "TRANSLATION_1": "He who intercedes in a good cause will surely have a share in the recompense; and he who abets an evil act will share the burden thereof; for God (equates and) is watchful of all things.\n",
        "TRANSLATION_2": "He who intercedes in a good cause shall share in its good result, and he who intercedes in an evil cause shall share in its burden. Allah watches over everything.\n",
        "TRANSLATION_3": "Whoever intercedes for a good purpose will receive his share of the reward but the intercession for an evil purpose only adds more to one's burden. God has control over all things.\n",
        "TRANSLATION_4": "Whoever makes a noble intercession will have a share of it, and whoever makes an evil intercession will have a share of it; and Allah is Able to do all things.\n",
        "TRANSLATION_5": "Whosoever intercedes for a good cause, will have the reward thereof; and whosoever intercedes for an evil cause, will have a share in its burden. And Allah is Ever All-Able to do everything.\n",
        "TRANSLATION_6": "Whoever joins himself (to another) in a good cause shall have a share of it, and whoever joins himself (to another) in an evil cause shall have the responsibility of it, and Allah controls all things.\n",
        "TRANSLATION_7": "Whoso intercedes with a good intercession shall receive a share of it; whosoever intercedes with a bad intercession, he shall receive the like of it; God has power over everything.\n",
        "TRANSLATION_8": "Whoso interveneth in a good cause will have the reward thereof, and whoso interveneth in an evil cause will bear the consequence thereof. Allah overseeth all things.\n",
        "TRANSLATION_9": "Whoever rallies to a good cause shall have a share in its blessing; and whoever rallies to an evil cause shall be answerable for his part in it: for, indeed, God watches over everything.\n",
        "TRANSLATION_10": "Whosoever intercedeth with a goodly intercession, his shall be a portion therefrom, and whosoever intercedeth with an ill intercession his shall be a responsibility thereof; and Allah is of everything the Controller.\n",
        "TRANSLATION_11": "Whoever intercedes for a good cause shall receive a share of it, and whoever intercedes for an evil cause shall share its burden, and Allah is prepotent over all things.\n",
        "TRANSLATION_12": "Whoever recommends and helps a good cause becomes a partner therein: And whoever recommends and helps an evil cause, shares in its burden: And Allah hath power over all things.\n",
        "TRANSLATION_13": "Whosoever intercedes for a good cause will have the reward thereof, and whosoever intercedes for an evil cause will have a share in its burden. And Allah is Ever All-Able to do (and also an All-Witness to) everything.\n",
        "TRANSLATION_14": "Whosoever intercedes with a good intercession shall receive a share of it, and whosoever intercedes with a bad intercession shall receive a portion of it. Allah has power over all things.\n",
        "TRANSLATION_15": "Whoever intercedes for a good cause has a share in it, and whoever intercedes for an evil cause shares in its burdens. God keeps watch over everything.\n",
        "TRANSLATION_16": "Whoever intercedes for a good cause will have a reward therefrom; and whoever intercedes for an evil cause will have a burden therefrom. And ever is Allah, over all things, a Keeper.\n",
        "TRANSLATION_17": "[4:85] Whoever intercedes, between people, with a good intercession, one in accordance with the Law, shall   receive a share of, the reward for, it, because of it; and whoever intercedes with an evil intercession, one in contravention of it [the Law], shall receive the like, the share of the sin, from it, because of it. God conserves, He has power over, all things, and so requites every person according to his deeds.\n",
        "TRANSLATION_18": "Allah then mentioned the reward of him who believes and the punishment of him who disbelieves, referring respectively to Abu Bakr and Abu Jahl, saying: (Whoso interveneth in a good cause) whoever helps to unite or reconcile two parties (will have the reward thereof) a reward of that good deed, (and whoso interveneth in an evil cause) who ascribes partners to Allah or acts as a tale-bearer (will bear the consequence thereof) will bear the onus of such an evil deed. (Allah overseeth all things) He rewards good and bad deeds; it is also said that this means: He oversees the sustenance of everyone: those who do good works as well as those who do evil. 96\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "4:85",
            "4:86",
            "4:32",
            "3:120",
            "39:62",
            "2:138",
            "39:43",
            "65:3",
            "4:130",
            "33:52"
        ],
        "BIBLE": [
            "prophets:ii%20samuel:23:5",
            "prophets:i%20kings:14:13",
            "prophets:micah:6:16",
            "torah:leviticus:5:16",
            "torah:exodus:23:13",
            "writings:daniel:3:29",
            "torah:numbers:5:7",
            "writings:psalms:71:16",
            "torah:deuteronomy:4:25",
            "writings:daniel:9:27"
        ]
    }
}