{
    "VERSE": "4:91",
    "ARABIC": "سَتَجِدُونَ ءَاخَرِينَ يُرِيدُونَ أَن يَأْمَنُوكُمْ وَيَأْمَنُوا۟ قَوْمَهُمْ كُلَّ مَا رُدُّوٓا۟ إِلَى ٱلْفِتْنَةِ أُرْكِسُوا۟ فِيهَا فَإِن لَّمْ يَعْتَزِلُوكُمْ وَيُلْقُوٓا۟ إِلَيْكُمُ ٱلسَّلَمَ وَيَكُفُّوٓا۟ أَيْدِيَهُمْ فَخُذُوهُمْ وَٱقْتُلُوهُمْ حَيْثُ ثَقِفْتُمُوهُمْ وَأُو۟لَٰٓئِكُمْ جَعَلْنَا لَكُمْ عَلَيْهِمْ سُلْطَٰنًا مُّبِينًا",
    "ENGLISH": {
        "TRANSLATION_0": "You will find others who desire to be safe from you and safe from their own people. Each time they are returned to fitna they are overwhelmed by it. If they do not keep away from you or submit to you or refrain from fighting, seize them and kill them wherever you find them. Over such people We have given you clear authority.",
        "TRANSLATION_1": "You will also find persons who, while wishing to live in peace with you as well as with their own people, turn to civil war the moment they are called to it. If they do not keep away from you, nor offer you peace nor restrain their hands, seize them and kill them wherever they are. We have given you a clear sanction against them.\n",
        "TRANSLATION_2": "You will also find others who wish to be secure from you, and secure from their people, but who, whenever they have any opportunity to cause mischief, plunge into it headlong. If such people neither leave you alone nor offer you peace nor restrain their hands from hurting you, then seize them and slay them wherever you come upon them. It is against these that We have granted you a clear sanction.\n",
        "TRANSLATION_3": "You will soon find others who seek security from you as well as from their own people, but when they are invited to return to idol worship, they do so enthusiastically. Thus, if they do not keep away from you nor come forward with a peace proposal nor desist from harming you, apprehend and slay them wherever you find them, for We have given you full control over them.\n",
        "TRANSLATION_4": "You will now find others who desire that they should be safe from you and also safe from their own people; whenever their people turn them towards war, they fall headlong into it; so if they do not avoid (confronting) you nor submit an offer of peace nor restrain their hands, seize them and kill them wherever you find them; and they are the ones against whom We have given you clear authority.\n",
        "TRANSLATION_5": "You will find others that wish to have security from you and security from their people. Every time they are sent back to Fitnah, they yield thereto. If they withdraw not from you, nor offer you peace, nor restrain their hands, take (hold of) them and kill them wherever you Thaqiftumuhum. In their case, We have provided you with a clear warrant against them.\n",
        "TRANSLATION_6": "You will find others who desire that they should be safe from you and secure from their own people; as often as they are sent back to the mischief they get thrown into it headlong; therefore if they do not withdraw from you, and (do not) offer you peace and restrain their hands, then seize them and kill them wherever you find them; and against these We have given you a clear authority.\n",
        "TRANSLATION_7": "You will find others desiring to be secure from you, and secure from their people, yet whenever they are returned to temptation, they are overthrown in it. If they withdraw not from you, and offer you peace, and restrain their hands, take them, and slay them wherever you come on them; against them We have given you a clear authority.\n",
        "TRANSLATION_8": "Ye will find others who desire that they should have security from you, and security from their own folk. So often as they are returned to hostility they are plunged therein. If they keep not aloof from you nor offer you peace nor hold their hands, then take them and kill them wherever ye find them. Against such We have given you clear warrant.\n",
        "TRANSLATION_9": "You will find others who wish to be safe from you, and from their own people, yet whenever they find an opportunity of inflicting harm, they plunge into it. So if they neither withdraw, nor offer you peace, nor restrain themselves from fighting you, seize and kill them wherever you encounter them. Over such people We have given you clear authority.\n",
        "TRANSLATION_10": "Surely ye will find others desiring, that they may be secure from you and may be secure from their people; and yet so oft as they are brought back into the temptation, they revert thereto. Wherefore if they withdraw not from you, nor offer you peace, nor restrain their hands, lay hold of them and slay them wheresoever ye find them. These: against them We have given you a clear warranty.\n",
        "TRANSLATION_11": "You will find others desiring to be secure from you, and secure from their own people; yet whenever they are called back to polytheism, they relapse into it. So if they do not keep out of your way, nor offer you peace, nor keep their hands off [from fighting], then seize them and kill them wherever you confront them, and it is such against whom We have given you a clear sanction.\n",
        "TRANSLATION_12": "Others you will find that wish to gain your confidence as well as that of their people: Every time they are sent back to temptation, they succumb thereto: if they withdraw not from you nor give you (guarantees) of peace besides restraining their hands, seize them and slay them wherever ye get them: In their case We have provided you with a clear argument against them.\n",
        "TRANSLATION_13": "You will find others that wish to have security from you and security from their people. Every time they are sent back to temptation, they yield thereto. If they withdraw not from you, nor offer you peace, nor restrain their hands, take (hold) of them and kill them wherever you find them. In their case, We have provided you with a clear warrant against them.\n",
        "TRANSLATION_14": "You will find others desiring to be secure from you, and secure from their own nation. Whenever they are called back to sedition, they plunge into it. If they do not keep away from you and offer you peace, and restrain their hands, take them and kill them wherever you find them. Those, over them, We give you clear authority.\n",
        "TRANSLATION_15": "You will find others who want security from you, and security from their own people. But whenever they are tempted into civil discord, they plunge into it. So if they do not withdraw from you, nor offer you peace, nor restrain their hands, seize them and execute them wherever you find them. Against these, We have given you clear authorization.\n",
        "TRANSLATION_16": "You will find others who wish to obtain security from you and [to] obtain security from their people. Every time they are returned to [the influence of] disbelief, they fall back into it. So if they do not withdraw from you or offer you peace or restrain their hands, then seize them and kill them wherever you overtake them. And those - We have made for you against them a clear authorization.\n",
        "TRANSLATION_17": "[4:91]   You will find others desiring to have security from you, by manifesting belief before you, and security from their own people, through unbelief, when they return to them, and these were [the tribes of] Asad and Ghatafān; yet whenever they are returned to sedition, [whenever] they are summoned to idolatry, they are overwhelmed by it, falling into it in the worst of ways. So, if they do not stay away from you, by refraining from fighting you, and, do not, offer you peace, and, do not, restrain their hands, from you, then take them, as captives, and slay them wherever you come upon them, [wherever] you find them; against them We have given you clear warrant, a clear and manifest proof for you to slay them and capture them, on account of their treachery.\n",
        "TRANSLATION_18": "(You will find others) other than the people of Hilal, Asad and Ghatafan for example (who desire that they should have security from you) they desire that their persons and wealth and families be safe from you by the declaration of \"there is no god but Allah\", (and security from their own folk) and desire to be safe from their clan by adhering to disbelief. (So often as they are returned to hostility) to idolatry (they are plunged therein) they revert to it. (If they keep not aloof from you) upon the conquest of Mecca (nor offer you peace) nor submit to you by means of a treaty (nor hold their hands) from fighting you upon the conquest of Mecca, (then take them) as prisoners (and kill them wherever you find them) in the Sacred Precinct or anywhere else. (Against such) i.e. Asad and Ghatafan (We have given you clear warrant) to kill them. 97\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "4:91",
            "4:90",
            "8:39",
            "37:30",
            "11:38",
            "9:122",
            "5:41",
            "44:28",
            "39:42",
            "2:191"
        ],
        "BIBLE": [
            "prophets:ezekiel:3:20",
            "writings:ii%20chronicles:7:14",
            "writings:song%20of%20songs:5:6",
            "prophets:ezekiel:18:8",
            "prophets:judges:15:18",
            "prophets:joshua:8:1",
            "writings:nehemiah:9:28",
            "prophets:isaiah:42:6",
            "prophets:jeremiah:7:14",
            "writings:lamentations:4:6"
        ]
    }
}