{
    "VERSE": "4:97",
    "ARABIC": "إِنَّ ٱلَّذِينَ تَوَفَّىٰهُمُ ٱلْمَلَٰٓئِكَةُ ظَالِمِىٓ أَنفُسِهِمْ قَالُوا۟ فِيمَ كُنتُمْ قَالُوا۟ كُنَّا مُسْتَضْعَفِينَ فِى ٱلْأَرْضِ قَالُوٓا۟ أَلَمْ تَكُنْ أَرْضُ ٱللَّهِ وَٰسِعَةً فَتُهَاجِرُوا۟ فِيهَا فَأُو۟لَٰٓئِكَ مَأْوَىٰهُمْ جَهَنَّمُ وَسَآءَتْ مَصِيرًا",
    "ENGLISH": {
        "TRANSLATION_0": "The angels ask those they take while they are wronging themselves, 'What were your circumstances?' They reply, 'We were oppressed on earth.' They say, 'Was Allah's earth not wide enough for you to have",
        "TRANSLATION_1": "As for those whose souls are taken by the angels (at death) while in a state of unbelief, they will be asked by the angels: \"What (state) were you in?\" They will answer: \"We were oppressed in the land.\" And the angels will say: \"Was not God's earth large enough for you to migrate?\" Their abode will be Hell, and what an evil destination!\n",
        "TRANSLATION_2": "While taking the souls of those who were engaged in wronging themselves, the angels asked: 'In what circumstances were you?' They replied: 'We were too weak and helpless in the land.' The angels said: 'Was not the earth of Allah wide enough for you to emigrate in it?' For such men their refuge is Hell - an evil destination indeed;\n",
        "TRANSLATION_3": "When the angels take away from their bodies the souls of those who have wronged themselves, they will ask them, \"How did you live?\" They will reply, \"We lived on earth in weakness and oppression.\" The angels will say, \"Was not God's land vast enough for you to go wherever you could live in peace?\" The dwelling of these people will be hell fire, a terrible destination.\n",
        "TRANSLATION_4": "The angels ask the people whose souls they remove while they were wronging themselves, “What were you engaged in?” They reply, “We were powerless in the land”; the angels say, “Was Allah’s earth not spacious enough for you to have migrated in it?” The destination for such is hell; and a very wretched place to return.\n",
        "TRANSLATION_5": "Verily, as for those whom the angels take (in death) while they are wronging themselves, they (angels) say (to them): \"In what (condition) were you\" They reply: \"We were weak and oppressed on the earth.\" They (angels) say: \"Was not the earth of Allah spacious enough for you to emigrate therein\" Such men will find their abode in Hell - what an evil destination!\n",
        "TRANSLATION_6": "Surely (as for) those whom the angels cause to die while they are unjust to their souls, they shall say: In what state were you? They shall say: We were weak in the earth. They shall say: Was not Allah's earth spacious, so that you should have migrated therein? So these it is whose abode is hell, and it is an evil resort\n",
        "TRANSLATION_7": "And those the angels take, while still they are wronging themselves -- the angels will say, 'In what circumstances were you?' They will say, 'We were abased in the earth.' The angels will say, 'But was not God's earth wide, so that you might have emigrated in it?' Such men, their refuge shall be Gehenna -- an evil homecoming! --\n",
        "TRANSLATION_8": "Lo! as for those whom the angels take (in death) while they wrong themselves, (the angels) will ask: In what were ye engaged? They will say: We were oppressed in the land. (The angels) will say: Was not Allah's earth spacious that ye could have migrated therein? As for such, their habitation will be hell, an evil journey's end;\n",
        "TRANSLATION_9": "When the angels take the souls of those who have wronged themselves, they will ask, \"What was wrong with you?\" They will answer, \"We were too weak on earth.\" The angels will say, \"Was God's earth not spacious enough for you to have migrated to some other place?\" These are the ones whose abode shall be Hell, an evil destination --\n",
        "TRANSLATION_10": "Verily unto those whom the angels carry off in death, while they are yet oppressors of their souls, they will say: what were ye in? They will say: Weakened were we in the land. They Will say: was not Allah's land wide so that ye could migrate thereto. These: their resort is hell an evil retreat! -\n",
        "TRANSLATION_11": "Indeed, those whom the angels take away while they are wronging themselves, they ask, ‘What state were you in?’ They reply, ‘We were oppressed in the land.’ They say, ‘Was not Allah’s earth vast enough so that you might migrate in it?’ The refuge of such shall be hell, and it is an evil destination.\n",
        "TRANSLATION_12": "When angels take the souls of those who die in sin against their souls, they say: \"In what (plight) Were ye?\" They reply: \"Weak and oppressed Were we in the earth.\" They say: \"Was not the earth of Allah spacious enough for you to move yourselves away (From evil)?\" Such men will find their abode in Hell,- What an evil refuge! -\n",
        "TRANSLATION_13": "Verily! As for those whom the angels take (in death) while they are wronging themselves (as they stayed among the disbelievers even though emigration was obligatory for them), they (angels) say (to them): \"In what (condition) were you?\" They reply: \"We were weak and oppressed on earth.\" They (angels) say: \"Was not the earth of Allah spacious enough for you to emigrate therein?\" Such men will find their abode in Hell - What an evil destination!\n",
        "TRANSLATION_14": "And the angels who take those who wronged themselves will say: 'In what condition were you' They will reply 'We were oppressed in the land' They (the angels) will say: 'Was not the earth of Allah wide enough for you in order that you migrate in it' Those, their shelter will be Gehenna (Hell), an evil arrival.\n",
        "TRANSLATION_15": "While the angels are removing the souls of those who have wronged themselves, they will say, “What was the matter with you?” They will say, “We were oppressed in the land.” They will say, “Was God’s earth not vast enough for you to emigrate in it?” These—their refuge is Hell. What a wretched retreat!\n",
        "TRANSLATION_16": "Indeed, those whom the angels take [in death] while wronging themselves - [the angels] will say, \"In what [condition] were you?\" They will say, \"We were oppressed in the land.\" The angels will say, \"Was not the earth of Allah spacious [enough] for you to emigrate therein?\" For those, their refuge is Hell - and evil it is as a destination.\n",
        "TRANSLATION_17": "[4:97] The following was revealed regarding a group of people who submitted to Islam but did not emigrate and were then slain in the battle of Badr alongside the disbelievers: And those whom the angels take [in death], while they are wronging their souls, having remained among the disbelievers and neglected to emigrate, the angels will say, to them in rebuke: ‘What was your predicament?’, in other words, ‘in what circumstances were you with regard to your religion’. They will say, giving excuses, ‘We were oppressed, unable to establish religion, in the land’, the land of Mecca. The angels will say, to them in rebuke: ‘But was not God’s earth spacious that you might have emigrated therein?’, from the land of unbelief to another land, as others did? God, exalted be He, says: as for such, their abode shall be Hell — an evil journey’s end, it is!\n",
        "TRANSLATION_18": "Then, Allah revealed the following about the 50 people who had left Islam and were all killed during the Battle of Badr, saying: (Lo! as for those whom the angels take (in death)) at the Battle of Badr (while they wrong themselves) by being idolaters, ((the angels) will ask) upon taking their souls: (In what were you engaged) what were you doing in Mecca? (They will say: We were oppressed) and humiliated (in the land) in Mecca at the hands of the unbelievers. ((The angels) will say: Was not Allah's earth) Medina (spacious) safe (that ye could have migrated therein? As for such) group of people, (their habitation) their dwelling (will be hell, an evil journey's end) they will come to;\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "4:97",
            "16:28",
            "24:42",
            "16:52",
            "3:162",
            "16:49",
            "49:15",
            "58:8",
            "40:17",
            "59:19"
        ],
        "BIBLE": [
            "torah:deuteronomy:20:7",
            "prophets:ezekiel:3:21",
            "prophets:ii%20kings:18:22",
            "torah:genesis:38:22",
            "prophets:isaiah:36:7",
            "torah:genesis:30:15",
            "torah:deuteronomy:17:16",
            "prophets:i%20samuel:17:26",
            "prophets:isaiah:41:9",
            "prophets:i%20kings:21:19"
        ]
    }
}