{
    "VERSE": "4:99",
    "ARABIC": "فَأُو۟لَٰٓئِكَ عَسَى ٱللَّهُ أَن يَعْفُوَ عَنْهُمْ وَكَانَ ٱللَّهُ عَفُوًّا غَفُورًا",
    "ENGLISH": {
        "TRANSLATION_0": "It may well be that Allah will pardon them. Allah is Ever-Pardoning, Ever-Forgiving.",
        "TRANSLATION_1": "May well hope for the mercy of God; and God is full of mercy and grace.\n",
        "TRANSLATION_2": "maybe Allah shall pardon these, for Allah is All-Pardoning, All-Forgiving.\n",
        "TRANSLATION_3": "perhaps God will forgive them; He is All-merciful and All-forgiving.\n",
        "TRANSLATION_4": "So for such, it is likely that Allah will pardon them; and Allah is Most Pardoning, Oft Forgiving.\n",
        "TRANSLATION_5": "These are they whom Allah is likely to forgive them, and Allah is Ever Oft-Pardoning, Oft-Forgiving.\n",
        "TRANSLATION_6": "So these, it may be, Allah will pardon them, and Allah is Pardoning, Forgiving.\n",
        "TRANSLATION_7": "haply them God will yet pardon, for God is All-pardoning, All-forgiving.\n",
        "TRANSLATION_8": "As for such, it may be that Allah will pardon them. Allah is ever Clement, Forgiving.\n",
        "TRANSLATION_9": "God may well pardon them. God is ever-pardoning and ever forgiving.\n",
        "TRANSLATION_10": "These: belike Allah will pardon them, and Allah is ever Pardoning, Forgiving.\n",
        "TRANSLATION_11": "Maybe Allah will excuse them, for Allah is all-excusing, all-forgiving.\n",
        "TRANSLATION_12": "For these, there is hope that Allah will forgive: For Allah doth blot out (sins) and forgive again and again.\n",
        "TRANSLATION_13": "For these there is hope that Allah will forgive them, and Allah is Ever Oft Pardoning, Oft-Forgiving.\n",
        "TRANSLATION_14": "Those, Allah may pardon them, He is the Pardoner, the Forgiver.\n",
        "TRANSLATION_15": "These—God may well pardon them. God is Pardoning and Forgiving.\n",
        "TRANSLATION_16": "For those it is expected that Allah will pardon them, and Allah is ever Pardoning and Forgiving.\n",
        "TRANSLATION_17": "[4:99] As for such, perhaps God will pardon them, for God is ever Pardoning, Forgiving.\n",
        "TRANSLATION_18": "(As for such, it may be) it is a requisite (that Allah will pardon them) that which ensues from them. (Allah is ever Clement) towards the likes of these, (Forgiving) of those who repent amongst them.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "4:99",
            "22:60",
            "3:89",
            "24:5",
            "25:70",
            "2:218",
            "5:74",
            "2:192",
            "33:73",
            "74:56"
        ],
        "BIBLE": [
            "writings:psalms:52:10",
            "torah:exodus:34:9",
            "writings:psalms:61:8",
            "torah:exodus:34:7",
            "writings:psalms:71:14",
            "writings:job:8:13",
            "writings:psalms:30:13",
            "writings:psalms:136:2",
            "writings:psalms:59:18",
            "torah:leviticus:16:16"
        ]
    }
}