{
    "VERSE": "59:23",
    "ARABIC": "هُوَ ٱللَّهُ ٱلَّذِى لَآ إِلَٰهَ إِلَّا هُوَ ٱلْمَلِكُ ٱلْقُدُّوسُ ٱلسَّلَٰمُ ٱلْمُؤْمِنُ ٱلْمُهَيْمِنُ ٱلْعَزِيزُ ٱلْجَبَّارُ ٱلْمُتَكَبِّرُ سُبْحَٰنَ ٱللَّهِ عَمَّا يُشْرِكُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "He is Allah - there is no god but Him. He is the King, the Most Pure, the Perfect Peace, the Trustworthy, the Safeguarder, the Almighty, the Compeller, the Supremely Great. Glory be to Allah above all they associate with Him.",
        "TRANSLATION_1": "He is God; there is no god but He, the King, the Holy, the Preserver, Protector, Guardian, the Strong, the Powerful, Omnipotent. Far too exalted is God for what they associate with Him.\n",
        "TRANSLATION_2": "He is Allah: there is no god but He: the King, the Holy, the All-Peace, the Giver of security, the Overseer, the Most Mighty, the Overpowering, the All-Great. Exalted be He from whatever they associate with Him.\n",
        "TRANSLATION_3": "He is the only Lord, the King, the Holy, the Peace, the Forgiver, the Watchful Guardian, the Majestic, the Dominant, and the Exalted. God is too exalted to have any partner.\n",
        "TRANSLATION_4": "It is Allah, except Whom there is no God; the King, the Pure, the Giver of Peace, the Bestower of Safety, the Protector, the Most Honourable, the Compeller, the Proud; Purity is to Allah from all what they ascribe as partners (to Him)!\n",
        "TRANSLATION_5": "He is Allah, beside Whom La ilaha illa Huwa, Al-Malik, Al-Quddus, As-Salam, Al-Mu`min, Al-Muhaymin, Al-`Aziz, Al-Jabbar, Al-Mutakabbir. Glory be to Allah! Above all that they associate as partners with Him.\n",
        "TRANSLATION_6": "He is Allah, besides Whom there is no god; the King, the Holy, the Giver of peace, the Granter of security, Guardian over all, the Mighty, the Supreme, the Possessor of every greatness Glory be to Allah from what they set up (with Him).\n",
        "TRANSLATION_7": "He is God; there is no god but He. He is the King, the All-holy, the All-peaceable, the All-faithful, the All-preserver, the All-mighty, the All-compeller, the All-sublime. Glory be to God, above that they associate!\n",
        "TRANSLATION_8": "He is Allah, than Whom there is no other Allah, the Sovereign Lord, the Holy One, Peace, the Keeper of Faith, the Guardian, the Majestic, the Compeller, the Superb. Glorified be Allah from all that they ascribe as partner (unto Him).\n",
        "TRANSLATION_9": "He is God, there is no deity save Him, the Sovereign, the Most Pure, the Source of Peace, the Granter of Security, the Protector, the Mighty, the Subduer, the Supreme, Glory be to God, who is far above what they associate with Him.\n",
        "TRANSLATION_10": "He is Allah, there is no God but He, the Sovereign, the Holy, the Author of Safety, the Giver of Peace, the Protector, the Mighty, the Mender, the Majestic. Hallowed be Allah from all that they associate!\n",
        "TRANSLATION_11": "He is Allah—there is no god except Him—the Sovereign, the All-holy, the All-benign, the Securer, the All-conserver, the All-mighty, the All-compeller, and the All-magnanimous. Clear is Allah of any partners that they may ascribe [to Him]!\n",
        "TRANSLATION_12": "Allah is He, than Whom there is no other god;- the Sovereign, the Holy One, the Source of Peace (and Perfection), the Guardian of Faith, the Preserver of Safety, the Exalted in Might, the Irresistible, the Supreme: Glory to Allah! (High is He) above the partners they attribute to Him.\n",
        "TRANSLATION_13": "He is Allah than Whom there is La ilaha illa Huwa (none has the right to be worshipped but He) the King, the Holy, the One Free from all defects, the Giver of security, the Watcher over His creatures, the All-Mighty, the Compeller, the Supreme. Glory be to Allah! (High is He) above all that they associate as partners with Him.\n",
        "TRANSLATION_14": "He is Allah, there is no god except He. He is the King, the Pure, the Peace, the Confirmer, the Watchful, the Almighty, the Compeller, the Sublime. Exalted is Allah, above all that they associate!\n",
        "TRANSLATION_15": "He is God; besides Whom there is no god; the Sovereign, the Holy, the Peace-Giver, the Faith-Giver, the Overseer, the Almighty, the Omnipotent, the Overwhelming. Glory be to God, beyond what they associate.\n",
        "TRANSLATION_16": "He is Allah, other than whom there is no deity, the Sovereign, the Pure, the Perfection, the Bestower of Faith, the Overseer, the Exalted in Might, the Compeller, the Superior. Exalted is Allah above whatever they associate with Him.\n",
        "TRANSLATION_17": "[59:23] He is God, than Whom there is no other god, the King, the Holy, the One sanctified from what does not befit Him, the Peace, unblemished by any defects, the Securer, the One Who confirms the sincerity of His messengers by creating miracles for them, the Guardian (al-muhaymin: [derives] from haymana, yuhayminu, meaning that one is watcher over something), in other words, the One Who is Witness to the deeds of His servants, the Mighty, the Strong, the Compeller, compelling His creatures to what He will, the Exalted, above what does not befit Him. Glorified be God — He is declaring His transcendence — above what partners they ascribe!, to Him.\n",
        "TRANSLATION_18": "(He is Allah, than whom there is no other God, the Sovereign Lord) whose sovereignty is perpetual and never ending (the Holy One) the Pure Who has no son or partner, (Peace) His created being are safe from increase of His punishment for that which is decreed upon them due to their own deeds, (the Keeper of Faith) He says: His created brings are safe from His transgression; it is also said that this means: His friends are safe from His torment; it is also said that this means: He is Trustworthy regarding the deeds of slaves and Trustworthy regarding what He can do to His created beings, (the Guardian) the Witness, (the Majestic) in retribution against those who disbelieve in Him, (the Compeller) the Conqueror over His slaves, (the 660 Superb) towards His enemies; it is also said this means: He Who exonerates Himself from what they had imagined about Him. (Glorified be Allah) Allah exonerates Himself (from all that they ascribe as partner (unto Him)) of idols.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "59:23",
            "62:1",
            "37:159",
            "3:18",
            "85:8",
            "3:6",
            "52:43",
            "44:42",
            "16:1",
            "16:87"
        ],
        "BIBLE": [
            "writings:daniel:5:18",
            "writings:i%20chronicles:29:11",
            "writings:daniel:4:21",
            "writings:daniel:4:14",
            "prophets:i%20samuel:10:19",
            "writings:daniel:6:8",
            "writings:psalms:24:8",
            "torah:deuteronomy:3:24",
            "writings:daniel:3:12",
            "prophets:isaiah:30:18"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:13"
        ]
    }
}