{
    "VERSE": "59:24",
    "ARABIC": "هُوَ ٱللَّهُ ٱلْخَٰلِقُ ٱلْبَارِئُ ٱلْمُصَوِّرُ لَهُ ٱلْأَسْمَآءُ ٱلْحُسْنَىٰ يُسَبِّحُ لَهُۥ مَا فِى ٱلسَّمَٰوَٰتِ وَٱلْأَرْضِ وَهُوَ ٱلْعَزِيزُ ٱلْحَكِيمُ",
    "ENGLISH": {
        "TRANSLATION_0": "He is Allah - the Creator, the Maker, the Giver of Form. To Him belong the Most Beautiful Names. Everything in the heavens and earth glorifies Him. He is the Almighty, the All-Wise.",
        "TRANSLATION_1": "He is God, the Creator, the Maker, the Fashioner. His are all the names beautiful. Whatever is in the heavens and the earth sings His praises. He is all-mighty and all-wise.\n",
        "TRANSLATION_2": "He is Allah, the Planner, Executer and Fashioner of creation. His are the names most beautiful. Whatever is in the heavens and the earth extols His Glory. He is the Most Mighty, the Most Wise.\n",
        "TRANSLATION_3": "He is the Creator, the Designer, the Modeler, and to Him belong all virtuous names. All that is in the heavens and the earth glorify Him. He is All-majestic and All-wise.\n",
        "TRANSLATION_4": "It is Allah only, Who is the Creator, the Initiator, the Designer of all – His only are all the good names; all whatever is in the heavens and in the earth proclaims His Purity; and He only is the Most Honourable, the Wise.\n",
        "TRANSLATION_5": "He is Allah, Al-Khaliq, Al-Bari, Al-Musawwir. To Him belong the Best Names. All that is in the heavens and the earth glorify Him. And He is the Almighty, the All-Wise.\n",
        "TRANSLATION_6": "He is Allah the Creator, the Maker, the Fashioner; His are the most excellent names; whatever is in the heavens and the earth declares His glory; and He is the Mighty, the Wise.\n",
        "TRANSLATION_7": "He is God, the Creator, the Maker, the Shaper. To Him belong the Names Most Beautiful. All that is in the heavens and the earth magnifies Him; He is the All-mighty, the All-wise.\n",
        "TRANSLATION_8": "He is Allah, the Creator, the Shaper out of naught, the Fashioner. His are the most beautiful names. All that is in the heavens and the earth glorifieth Him, and He is the Mighty, the Wise.\n",
        "TRANSLATION_9": "He is God -- the Creator, the Originator, the Giver of Form. His are the most excellent names. Everything in the heavens and earth declares His glory. He is the Mighty, the Wise One.\n",
        "TRANSLATION_10": "He is Allah, the Creator, the Maker, the Fashioner; His are the excellent names. Him halloweth whatsoever is in the heavens and the earth, and He is the Mighty, the Wise.\n",
        "TRANSLATION_11": "He is Allah, the Creator, the Maker, and the Former. To Him belong the Best Names. Whatever there is in the heavens and the earth glorifies Him and He is the All-mighty, the All-wise.\n",
        "TRANSLATION_12": "He is Allah, the Creator, the Evolver, the Bestower of Forms (or Colours). To Him belong the Most Beautiful Names: whatever is in the heavens and on earth, doth declare His Praises and Glory: and He is the Exalted in Might, the Wise.\n",
        "TRANSLATION_13": "He is Allah, the Creator, the Inventor of all things, the Bestower of forms. To Him belong the Best Names. All that is in the heavens and the earth glorify Him. And He is the All-Mighty, the All-Wise.\n",
        "TRANSLATION_14": "He is Allah, the Creator, the Originator, the Shaper. To Him belong the Most Beautiful Names. All that is in the heavens and earth exalt Him. He is theAlmighty, the Wise.\n",
        "TRANSLATION_15": "He is God; the Creator, the Maker, the Designer. His are the Most Beautiful Names. Whatever is in the heavens and the earth glorifies Him. He is the Majestic, the Wise.\n",
        "TRANSLATION_16": "He is Allah, the Creator, the Inventor, the Fashioner; to Him belong the best names. Whatever is in the heavens and earth is exalting Him. And He is the Exalted in Might, the Wise.\n",
        "TRANSLATION_17": "[59:24] He is God, the Creator, the Maker, the Originator from nothing, the Shaper. To Him belong the, ninety nine, Most Beautiful Names, cited in hadīth (al-husnā is the feminine of al-ahsan). All that is in the heavens and   the earth glorify Him, and He is the Mighty, the Wise — already explained at the beginning of this [sūra].\n",
        "TRANSLATION_18": "(He is Allah, the Creator) of sperms in the loins of fathers, (the Shaper out of naught) Who transforms them from one state to another, (the Fashioner) of what is in the wombs: i.e. whether it is a male or female, felicitous or damned; it is also said that this means: He Who places the spirit in the living being. (His are the most beautiful names) the most exalted attributes: knowledge, power, sight, hearing, etc., so call upon Him through these attributes. (All that is in the heavens) of creation (and the earth) all that is possessed of life (glorifieth Him) prays to Him; and it is also said this means: remembers Him, (and He is the Mighty) in retribution against those who disbelieve in Him, (the Wise) in His command and decree; He commanded that none should be worshipped except Him'. And of the surah is which \"She That Is To Be Examined\" is mentioned which is all Medinan and consists of 13 verses, 348 words and 1,510 letters: Surah 60: She That Is To Be Examined (al-Mumtahanah) And of the surah is which \"She That Is To Be Examined\" is mentioned which is all Medinan and consists of 13 verses, 348 words and 1,510 letters:\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "59:24",
            "61:1",
            "59:1",
            "57:1",
            "48:7",
            "62:1",
            "53:31",
            "45:37",
            "43:84",
            "4:132"
        ],
        "BIBLE": [
            "writings:psalms:148:13",
            "writings:psalms:57:6",
            "writings:psalms:108:6",
            "writings:psalms:57:12",
            "writings:psalms:92:2",
            "prophets:habakkuk:3:3",
            "torah:leviticus:11:42",
            "writings:psalms:19:2",
            "prophets:isaiah:12:4",
            "writings:psalms:75:10"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:3:2"
        ]
    }
}