{
    "VERSE": "59:4",
    "ARABIC": "ذَٰلِكَ بِأَنَّهُمْ شَآقُّوا۟ ٱللَّهَ وَرَسُولَهُۥ وَمَن يُشَآقِّ ٱللَّهَ فَإِنَّ ٱللَّهَ شَدِيدُ ٱلْعِقَابِ",
    "ENGLISH": {
        "TRANSLATION_0": "That is because they were entrenched in hostility towards Allah and His Messenger. If anyone is hostile towards Allah, Allah is Severe in Retribution.",
        "TRANSLATION_1": "For they had opposed God and His Apostle; and whosoever opposes God, then God is severe in retribution.\n",
        "TRANSLATION_2": "That is because they set themselves against Allah and His Messenger; and whoever sets himself against Allah should know that Allah is surely Most Stern in retribution.\n",
        "TRANSLATION_3": "This is because they opposed God and His Messenger and whoever opposes God should know that God's retribution is severe.\n",
        "TRANSLATION_4": "This is because they remained opposed to Allah and His Noble Messenger; and whoever remains opposed to Allah, (and His Noble Messenger) – then indeed Allah’s punishment is severe.\n",
        "TRANSLATION_5": "That is because they opposed Allah and His Messenger. And whosoever opposes Allah, then verily, Allah is Severe in punishment.\n",
        "TRANSLATION_6": "That is because they acted in opposition to Allah and His Apostle, and whoever acts in opposition to Allah, then surely Allah is severe in retributing (evil).\n",
        "TRANSLATION_7": "That is because they made a breach with God and His Messenger; and whosoever makes a breach with God, God is terrible in retribution.\n",
        "TRANSLATION_8": "That is because they were opposed to Allah and His messenger; and whoso is opposed to Allah, (for him) verily Allah is stern in reprisal.\n",
        "TRANSLATION_9": "because they set themselves against God and His Messenger: God is stern in His punishment of anyone who sets himself against Him.\n",
        "TRANSLATION_10": "That is because they opposed Allah and His apostle, and whosoever opposeth Allah, then verily Allah is Stern in chastisement.\n",
        "TRANSLATION_11": "That is because they defied Allah and His Apostle; and whoever defies Allah, Allah is indeed severe in retribution.\n",
        "TRANSLATION_12": "That is because they resisted Allah and His Messenger: and if any one resists Allah, verily Allah is severe in Punishment.\n",
        "TRANSLATION_13": "That is because they opposed Allah and His Messenger (Muhammad SAW). And whosoever opposes Allah, then verily, Allah is Severe in punishment.\n",
        "TRANSLATION_14": "because they broke their promise with Allah and His Messenger; and whosoever breaks their promise with Allah Allah is Stern in retribution.\n",
        "TRANSLATION_15": "That is because they opposed God and His Messenger. Whoever opposes God—God is stern in retribution.\n",
        "TRANSLATION_16": "That is because they opposed Allah and His Messenger. And whoever opposes Allah - then indeed, Allah is severe in penalty.\n",
        "TRANSLATION_17": "[59:4] That is because they defied, they opposed, God and His Messenger; and whoever defies God, indeed God is severe in retribution, against him.\n",
        "TRANSLATION_18": "(That) exile and punishment (is because they were opposed to Allah and His messenger) concerning Religion; (and whoso is opposed to Allah) in the matter of religion and shows enmity towards Him, ((for him) verily Allah is stern in reprisal) in the life of the world as well as in the Hereafter.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "8:13",
            "59:4",
            "40:22",
            "5:56",
            "3:32",
            "63:1",
            "24:52",
            "8:25",
            "48:13",
            "4:80"
        ],
        "BIBLE": [
            "writings:ezra:9:14",
            "torah:leviticus:22:22",
            "torah:leviticus:26:19",
            "prophets:jeremiah:28:13",
            "prophets:isaiah:42:3",
            "prophets:hosea:10:11",
            "prophets:jeremiah:30:8",
            "prophets:isaiah:27:11",
            "prophets:ezekiel:16:59",
            "prophets:i%20kings:5:23"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:2:1"
        ]
    }
}