{
    "VERSE": "59:9",
    "ARABIC": "وَٱلَّذِينَ تَبَوَّءُو ٱلدَّارَ وَٱلْإِيمَٰنَ مِن قَبْلِهِمْ يُحِبُّونَ مَنْ هَاجَرَ إِلَيْهِمْ وَلَا يَجِدُونَ فِى صُدُورِهِمْ حَاجَةً مِّمَّآ أُوتُوا۟ وَيُؤْثِرُونَ عَلَىٰٓ أَنفُسِهِمْ وَلَوْ كَانَ بِهِمْ خَصَاصَةٌ وَمَن يُوقَ شُحَّ نَفْسِهِۦ فَأُو۟لَٰٓئِكَ هُمُ ٱلْمُفْلِحُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Those who were already settled in the abode, and in iman, before they came, love those who have made hijra to them and do not find in their hearts any need for what they have been given and prefer them to themselves even if they themselves are needy. It is the people who are safe-guarded from the avarice of their own selves who are successful.",
        "TRANSLATION_1": "Those who came to the city and to faith before them, love those who take refuge with them, and do not feel for themselves any need for what is given them, and give them preference over themselves even if they are indigent. Whoever preserves himself from his own greed will be prosperous.\n",
        "TRANSLATION_2": "It also belongs to those who were already settled in this abode (of Hijrah) having come to faith before the (arrival of the) Muhajirun (Emigrants). They love those who have migrated to them and do not covet what has been given them; they even prefer them above themselves though poverty be their own lot. And whosoever are preserved from their own greed, such are the ones that will prosper.\n",
        "TRANSLATION_3": "Those who established a community center and embraced the faith before the arrival of the immigrants love those who have come to their town. They are not jealous of what is given to the immigrants. They give preference to them over themselves - even concerning the things that they themselves urgently need. Whoever controls his greed will have everlasting happiness.\n",
        "TRANSLATION_4": "And those who accepted this city as their home and accepted faith before them, befriend those who migrated towards them, and in their breasts do not find any need for what they have been given, and prefer the migrants above themselves even if they themselves are in dire need; and whoever is saved from the greed of his soul – it is they who are the successful.\n",
        "TRANSLATION_5": "And (it is also for) those who, before them, had homes and had adopted the faith, love those who emigrate to them, and have no jealousy in their breasts for that which they have been given, and give them preference over themselves even though they were in need of that. And whosoever is saved from his own greed, such are they who will be the successful.\n",
        "TRANSLATION_6": "And those who made their abode in the city and in the faith before them love those who have fled to them, and do not find in their hearts a need of what they are given, and prefer (them) before themselves though poverty may afflict them, and whoever is preserved from the niggardliness of his soul, these it is that are the successful ones.\n",
        "TRANSLATION_7": "And those who made their dwelling in the abode, and in belief, before them; love whosoever has emigrated to them, not finding in their breasts any need for what they have been given, and preferring others above themselves, even though poverty be their portion. And whoso is guarded against the avarice of his own soul, those -- they are the prosperers.\n",
        "TRANSLATION_8": "Those who entered the city and the faith before them love those who flee unto them for refuge, and find in their breasts no need for that which hath been given them, but prefer (the fugitives) above themselves though poverty become their lot. And whoso is saved from his own avarice - such are they who are successful.\n",
        "TRANSLATION_9": "Those who were already settled in the city [Madinah] and firmly rooted in faith, love those who migrated to them for refuge, and harbour no desire in their hearts for what has been given to the [latter]. They give them preference over themselves, even if they too are needy: those who are saved from their own souls' greed are truly successful.\n",
        "TRANSLATION_10": "And it is also due Unto those who are settled in the dwelling and the faith before them, loving those who have migrated Unto them, and finding in their breasts no desire for that which hath been given them, and preferring them above themselves even though there was want amongst them. And whosoever is Preserved from covetousness of his soul, then those! - they are the blissful.\n",
        "TRANSLATION_11": "[They are as well] for those who were settled in the land and [abided] in faith before them, who love those who migrate toward them, and do not find in their breasts any privation for that which is given to them, but prefer [the Immigrants] to themselves, though poverty be their own lot. And those who are saved from their own greed—it is they who are the felicitous.\n",
        "TRANSLATION_12": "But those who before them, had homes (in Medina) and had adopted the Faith,- show their affection to such as came to them for refuge, and entertain no desire in their hearts for things given to the (latter), but give them preference over themselves, even though poverty was their (own lot). And those saved from the covetousness of their own souls,- they are the ones that achieve prosperity.\n",
        "TRANSLATION_13": "And those who, before them, had homes (in Al-Madinah) and had adopted the Faith, love those who emigrate to them, and have no jealousy in their breasts for that which they have been given (from the booty of Bani An-Nadir), and give them (emigrants) preference over themselves, even though they were in need of that. And whosoever is saved from his own covetousness, such are they who will be the successful.\n",
        "TRANSLATION_14": "And those before them who had made their dwelling in the abode (the City of Madinah), and because of their belief love those who have emigrated to them; they do not find any (envy) in their chests for what they have been given and prefer them above themselves, even though they themselves have a need. Whosoever is saved from the greed of his own soul, they are the ones who win.\n",
        "TRANSLATION_15": "And those who, before them, had settled in the homeland, and had accepted faith. They love those who emigrated to them, and find no hesitation in their hearts in helping them. They give them priority over themselves, even if they themselves are needy. Whoever is protected from his natural greed—it is they who are the successful.\n",
        "TRANSLATION_16": "And [also for] those who were settled in al-Madinah and [adopted] the faith before them. They love those who emigrated to them and find not any want in their breasts of what the emigrants were given but give [them] preference over themselves, even though they are in privation. And whoever is protected from the stinginess of his soul - it is those who will be the successful.\n",
        "TRANSLATION_17": "[59:9] And those who had settled in the hometown, that is, Medina, and [had abided] in faith, that is to say, [those who] had embraced it with enthusiasm — these being the Helpers, before them, love those who have emigrated to them, and do not find in their breasts any need, any envy, of that which those [others] have been given, that is to say, of what the Prophet (s) had given the Emigrants from the [seized] possessions of the Banū al-Nadīr, [a share which was] exclusively theirs; but prefer [others] to themselves, though they be in poverty, in need of that which they prefer for [those] others [to have]. And whoever is saved from the avarice of his own soul, its covetousness for [acquiring] possessions, those — they are the successful.\n",
        "TRANSLATION_18": "Then the Prophet (pbuh) to the Helpers (al-Ansar): \"These spoils and gardens are solely for the poor among the Emigrants. If you wish, I will divide your wealth and properties on the Emigrants and give you a share of the spoils, or you keep your wealth and properties and I divide the spoils on the poor among the Emigrants\". They said: \"0 Messenger of Allah, we would like to share our wealth and properties with them and we will also prefer them over ourselves and let them have the spoils\". Allah praised them for this by saying: (Those who entered the city) those who made it possible for the Prophet (pbuh) and his Companions to live in the abode of migration (and the faith before them) and were believers before the Immigrants came to them (love these who flee unto them for refuge) in Medina from among the Companions of the Prophet (pbuh) (and find in their breasts) in their hearts (no need) no resentful envy; and it is said this means: no vexation (for that which hath been given them) of spoils, while they did not get any, (but prefer (the fugitives) above themselves) with their wealth and homes (though poverty become their lot. And whoso is saved from his 658 own avarice) and whoever drives away avarice from his own self (such are they who are successful) such are they who are saved from Allah's wrath and chastisement.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "59:9",
            "64:16",
            "16:118",
            "60:9",
            "4:66",
            "7:197",
            "2:4",
            "6:104",
            "40:80",
            "2:84"
        ],
        "BIBLE": [
            "writings:i%20chronicles:29:14",
            "prophets:judges:18:10",
            "torah:numbers:18:19",
            "prophets:i%20samuel:30:23",
            "writings:ecclesiastes:1:13",
            "prophets:joshua:23:15",
            "torah:genesis:1:30",
            "prophets:jeremiah:25:31",
            "torah:deuteronomy:2:19",
            "prophets:i%20kings:14:8"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:6"
        ]
    }
}