{
    "VERSE": "57:11",
    "ARABIC": "مَّن ذَا ٱلَّذِى يُقْرِضُ ٱللَّهَ قَرْضًا حَسَنًا فَيُضَٰعِفَهُۥ لَهُۥ وَلَهُۥٓ أَجْرٌ كَرِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "Who will make a good loan to Allah so that He may multiply it for him? He will have a generous reward.",
        "TRANSLATION_1": "Who will give a goodly loan to God which He will double for him, and be for him a splendid reward?\n",
        "TRANSLATION_2": "Who is it that will give Allah a beautiful loan? A loan that Allah will repay after increasing it many times and grant him a generous reward.\n",
        "TRANSLATION_3": "Whoever gives a virtuous loan to God will receive double from Him in addition to an honorable reward.\n",
        "TRANSLATION_4": "Who will lend a handsome loan to Allah so that He may double it for him? And for such is an honourable reward.\n",
        "TRANSLATION_5": "Who is he that will lend Allah a handsome loan: then He will increase it manifold to his credit, and he will have a honorable reward.\n",
        "TRANSLATION_6": "Who is there that will offer to Allah a good gift so He will double it for him, and he shall have an excellent reward.\n",
        "TRANSLATION_7": "Who is he that will lend to God a good loan, and He will multiply it for him, and his shall be a generous wage?\n",
        "TRANSLATION_8": "Who is he that will lend unto Allah a goodly loan, that He may double it for him and his may be a rich reward?\n",
        "TRANSLATION_9": "Who will offer God a generous loan? He will double it for him and give him a rich reward.\n",
        "TRANSLATION_10": "Who is he that will lend Allah a goodly loan, so that He may multiply it for him, and his shall be a hire honourable?\n",
        "TRANSLATION_11": "Who is it that will lend Allah a good loan, that He may multiply it for him and [that] there may be a noble reward for him?\n",
        "TRANSLATION_12": "Who is he that will Loan to Allah a beautiful loan? for (Allah) will increase it manifold to his credit, and he will have (besides) a liberal Reward.\n",
        "TRANSLATION_13": "Who is he that will lend to Allah a goodly loan, then (Allah) will increase it manifold to his credit (in repaying), and he will have (besides) a good reward (i.e. Paradise).\n",
        "TRANSLATION_14": "Who will lend a generous loan to Allah? He will multiply it for him and he shall receive a generous wage.\n",
        "TRANSLATION_15": "Who is he who will lend God a loan of goodness, that He may double it for him, and will have a generous reward?\n",
        "TRANSLATION_16": "Who is it that would loan Allah a goodly loan so He will multiply it for him and he will have a noble reward?\n",
        "TRANSLATION_17": "[57:11] Who is it that will lend God, by expending his wealth in the way of God, a goodly loan, [goodly] by virtue of his expending it for God’s sake, so that He may multiply it (fa-yudā‘ifahu, may also be read fa-yuda‘‘ifahu) for him, from tenfold up to more than seven hundredfold —as stated in sūrat al-Baqara [Q. 2:261], and [so that] there may be for him, in addition to the multiplied [reward], a generous reward, coupled with satisfaction and prosperity.\n",
        "TRANSLATION_18": "(Who is he that will lend unto Allah) by giving alms (a goodly loan) sincerely from his heart, intending no one but Allah, (that He may double it for him) that Allah may accept it from Him and increase his reward from seven to 70 up to 700 and one million folds, and up to whatever folds Allah wills, (and his may be a rich reward) an abundant reward in the Garden? This verse was revealed about Abu'l-Dahdah.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "57:11",
            "57:18",
            "2:245",
            "64:17",
            "33:31",
            "39:35",
            "16:96",
            "42:23",
            "57:7",
            "53:31"
        ],
        "BIBLE": [
            "writings:i%20chronicles:29:14",
            "prophets:ii%20samuel:17:7",
            "prophets:i%20samuel:1:4",
            "prophets:joshua:23:15",
            "torah:deuteronomy:8:10",
            "torah:deuteronomy:16:17",
            "torah:leviticus:6:10",
            "writings:job:41:3",
            "torah:deuteronomy:26:11",
            "prophets:joshua:23:16"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:9"
        ]
    }
}