{
    "VERSE": "57:14",
    "ARABIC": "يُنَادُونَهُمْ أَلَمْ نَكُن مَّعَكُمْ قَالُوا۟ بَلَىٰ وَلَٰكِنَّكُمْ فَتَنتُمْ أَنفُسَكُمْ وَتَرَبَّصْتُمْ وَٱرْتَبْتُمْ وَغَرَّتْكُمُ ٱلْأَمَانِىُّ حَتَّىٰ جَآءَ أَمْرُ ٱللَّهِ وَغَرَّكُم بِٱللَّهِ ٱلْغَرُورُ",
    "ENGLISH": {
        "TRANSLATION_0": "They will call out to them, 'Were we not with you?' They will reply, 'Indeed you were. But you made trouble for yourselves and hung back and and doubted and false hopes deluded you until Allah's command arrived. The Deluder deluded you about Allah.",
        "TRANSLATION_1": "They will call to them: \"Were we not with you?\" They will answer: \"Certainly; but then you let yourselves be tempted, and waited in expectation but were suspicious and were deceived by vain desires, till the decree of God came to pass, and the deceiver duped you in respect of God.\n",
        "TRANSLATION_2": "The hypocrites will call out to the believers: “Were we not with you?” The believers will reply: “Yes; but you allowed yourselves to succumb to temptations, and you wavered and you remained in doubt and false expectations deluded you until Allah's command came to pass, and the Deluder deluded you concerning Allah.\n",
        "TRANSLATION_3": "(Those outside) will call out, \"Were we not with you?\" (Those inside) will reply, \"Yes, you were with us but you spent your life in disbelief and hypocrisy, wished death to (Muhammad), had doubts about his message and let your longings deceive you until the decree of God came to pass. The devil deceived you about the mercy of God.\n",
        "TRANSLATION_4": "The hypocrites will call out to the Muslims, “Were we not with you?”; they will answer, “Yes you were, why not? But you had put your souls into trial, and you used to await misfortune for the Muslims, and you doubted, and false hopes deceived you until Allah’s command came – and the big cheat had made you conceited towards the command of Allah.”\n",
        "TRANSLATION_5": "(The hypocrites) will call the believers: \"Were we not with you\" The believers will reply: \"Yes! But you led yourselves into temptations, you looked forward to our destruction; and you doubted, and you were deceived by false hopes, till the command of Allah came to pass. And the deceiver deceived you in regard to Allah.\"\n",
        "TRANSLATION_6": "They will cry out to them: Were we not with you? They shall say: Yea! but you caused yourselves to fall into temptation, and you waited and doubted, and vain desires deceived you till the threatened punishment of Allah came, while the archdeceiver deceived you about Allah.\n",
        "TRANSLATION_7": "They shall be calling unto them, 'Were we not with you?' They shall say, 'Yes indeed; but you tempted yourselves, and you awaited, and you were in doubt, and fancies deluded you, until God's commandment came, and the Deluder deluded you concerning God.\n",
        "TRANSLATION_8": "They will cry unto them (saying): Were we not with you? They will say: Yea, verily; but ye tempted one another, and hesitated, and doubted, and vain desires beguiled you till the ordinance of Allah came to pass; and the deceiver deceived you concerning Allah;\n",
        "TRANSLATION_9": "The hypocrites will call out to the faithful: \"Were we not on your side?\" They will reply, \"Yes, but you gave in to temptation, you wavered and doubted and were deceived by your wishful thinking until God's will was done; then the Deceiver [Satan] misled you about God.\"\n",
        "TRANSLATION_10": "They will cry unto them: have we not been with you? They will say: 'yea! but ye tempted your souls, and ye Waited, and ye dubitated, and your vain desires beguiled you until the affair of Allah came, and in respect to Allah the beguiler beguiled you.\n",
        "TRANSLATION_11": "They will call out to them, ‘Did we not use to be with you?’ They will say, ‘Yes! But you cast yourselves into perdition. You awaited and were skeptical, and [false] hopes deceived you until the edict of Allah came, and the Deceiver deceived you concerning Allah.\n",
        "TRANSLATION_12": "(Those without) will call out, \"Were we not with you?\" (The others) will reply, \"True! but ye led yourselves into temptation; ye looked forward (to our ruin); ye doubted (Allah's Promise); and (your false) desires deceived you; until there issued the Command of Allah. And the Deceiver deceived you in respect of Allah.\n",
        "TRANSLATION_13": "(The hypocrites) will call the believers: \"Were we not with you?\" The believers will reply: \"Yes! But you led yourselves into temptations, you looked forward for our destruction; you doubted (in Faith); and you were deceived by false desires, till the Command of Allah came to pass. And the chief deceiver (Satan) deceived you in respect of Allah.\"\n",
        "TRANSLATION_14": "They will call out to them, saying: 'Were we not with you' 'Yes' they will reply, 'but you tempted yourselves, you waited (for problems to befall thebelievers), and you doubted, and were deluded by your own fancies until the Command of Allah came, and the deluder (satan) deluded you concerning Allah.\n",
        "TRANSLATION_15": "They will call to them, “Were we not with you?” They will say, “Yes, but you cheated your souls, and waited, and doubted, and became deluded by wishful thinking, until the command of God arrived; and arrogance deceived you regarding God.”\n",
        "TRANSLATION_16": "The hypocrites will call to the believers, \"Were we not with you?\" They will say, \"Yes, but you afflicted yourselves and awaited [misfortune for us] and doubted, and wishful thinking deluded you until there came the command of Allah. And the Deceiver deceived you concerning Allah.\n",
        "TRANSLATION_17": "[57:14] They will call out to them, ‘Did we not use to be with you?’, upon [the path of] obedience. They will say, ‘Yes, indeed! But you caused your souls to fall into temptation, by [engaging in] hypocrisy, and you awaited, reversals of fortune for the believers, and you doubted, you were uncertain about the religion of Islam, and [false] hopes, greedy desires, deceived you until God’s ordinance, death, came; and the Deceiver, Satan, deceived you concerning God.\n",
        "TRANSLATION_18": "649 (They will cry unto them) behind the gate ((saying): Were we not with you) following your religion, group of believers? (They will say: Yea, verily; but ye tempted one another) you ruined yourselves through your secret disbelief and hypocrisy, (and hesitated) and you shunned repenting from disbelief and hypocrisy; and it is said that this means: you waited for the death of Muhammad (pbuh) so that you would then reveal your disbelief, (and doubted) in Allah, His Scripture and His Messenger, (and vain desires) falsehoods and false hope (beguiled you till the ordinance of Allah came to pass) until the promise of Allah was fulfilled that you die without repentance from disbelief and hypocrisy; (and the deceiver) i.e. Satan; and it is said that this means: the falsehoods of the life of the world (deceived you concerning Allah) concerning the obedience of Allah;\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "57:14",
            "10:44",
            "59:19",
            "82:19",
            "2:223",
            "47:26",
            "25:68",
            "49:15",
            "29:6",
            "16:72"
        ],
        "BIBLE": [
            "prophets:judges:15:18",
            "writings:ii%20chronicles:35:21",
            "torah:deuteronomy:26:13",
            "torah:genesis:30:18",
            "prophets:i%20kings:18:26",
            "writings:song%20of%20songs:5:6",
            "writings:daniel:6:13",
            "prophets:joshua:17:4",
            "torah:deuteronomy:1:3",
            "writings:psalms:78:50"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:13",
            "Sefer%20Yetzirah:1:5"
        ]
    }
}