{
    "VERSE": "57:17",
    "ARABIC": "ٱعْلَمُوٓا۟ أَنَّ ٱللَّهَ يُحْىِ ٱلْأَرْضَ بَعْدَ مَوْتِهَا قَدْ بَيَّنَّا لَكُمُ ٱلْءَايَٰتِ لَعَلَّكُمْ تَعْقِلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Know that Allah brings the earth to life after it was dead. We have made the Signs clear to you so that hopefully you will use your intellect.",
        "TRANSLATION_1": "Know that God enlivens the earth even after it has died. We have explained to you clearly Our signs that you may understand.\n",
        "TRANSLATION_2": "Know well that Allah revives the earth after it becomes lifeless. We have clearly shown Our Signs to you, perchance you will use your reason.\n",
        "TRANSLATION_3": "Know that God brings the dead earth back to life. We have explained Our revelations to you so that you may perhaps have understanding.\n",
        "TRANSLATION_4": "Know that it is Allah Who revives the earth after its death; We have indeed illustrated the signs for you, for you to understand.\n",
        "TRANSLATION_5": "Know that Allah gives life to the earth after its death! Indeed We have made clear the Ayat to you, if you but understand.\n",
        "TRANSLATION_6": "Know that Allah gives life to the earth after its death; indeed, We have made the communications clear to you that you may understand.\n",
        "TRANSLATION_7": "Know that God revives the earth after it was dead. We have indeed made clear for you the signs, that haply you will understand.\n",
        "TRANSLATION_8": "Know that Allah quickeneth the earth after its death. We have made clear Our revelations for you, that haply ye may understand.\n",
        "TRANSLATION_9": "Remember that God brings the earth back to life after its death. We have made Our signs clear to you, so that you may fully understand.\n",
        "TRANSLATION_10": "Know that Allah quickeneth earth after the death thereof. Surely We have propounded unto you the signs, that haply ye may reflect.\n",
        "TRANSLATION_11": "Know that Allah revives the earth after its death. We have certainly made the signs clear for you, so that you may exercise your reason.\n",
        "TRANSLATION_12": "Know ye (all) that Allah giveth life to the earth after its death! already have We shown the Signs plainly to you, that ye may learn wisdom.\n",
        "TRANSLATION_13": "Know that Allah gives life to the earth after its death! Indeed We have made clear the Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) to you, if you but understand.\n",
        "TRANSLATION_14": "Know that Allah revives the earth after it was dead. We have made plain to you the signs in order that you understand.\n",
        "TRANSLATION_15": "Know that God revives the earth after its death. We thus explain the revelations for you, so that you may understand.\n",
        "TRANSLATION_16": "Know that Allah gives life to the earth after its lifelessness. We have made clear to you the signs; perhaps you will understand.\n",
        "TRANSLATION_17": "[57:17] Know — an address to the believers [just] mentioned — that God revives the earth after its death, by [bringing forth] vegetation, and likewise He is able to do with your hearts, restoring them to humbleness. We have certainly made clear for you the signs, that testify to Our power with this [mentioned example] and others, that perhaps you may understand.\n",
        "TRANSLATION_18": "(Know that Allah quickeneth the earth) through rain (after its death) after being exposed to dryness and drought; and similarly Allah will bring the dead back to life through rain. (We have made clear Our revelations) bringing the dead back to life (for you, that haply ye may understand) that haply you may believe in resurrection after death.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "57:17",
            "16:65",
            "2:73",
            "30:19",
            "45:5",
            "2:56",
            "30:24",
            "39:63",
            "36:33",
            "35:9"
        ],
        "BIBLE": [
            "prophets:i%20samuel:2:6",
            "writings:daniel:1:17",
            "writings:ii%20chronicles:2:11",
            "writings:job:38:36",
            "prophets:i%20kings:5:9",
            "writings:ecclesiastes:1:13",
            "writings:job:33:4",
            "writings:psalms:119:73",
            "torah:deuteronomy:26:14",
            "writings:daniel:2:23"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:1:6"
        ]
    }
}