{
    "VERSE": "57:20",
    "ARABIC": "ٱعْلَمُوٓا۟ أَنَّمَا ٱلْحَيَوٰةُ ٱلدُّنْيَا لَعِبٌ وَلَهْوٌ وَزِينَةٌ وَتَفَاخُرٌۢ بَيْنَكُمْ وَتَكَاثُرٌ فِى ٱلْأَمْوَٰلِ وَٱلْأَوْلَٰدِ كَمَثَلِ غَيْثٍ أَعْجَبَ ٱلْكُفَّارَ نَبَاتُهُۥ ثُمَّ يَهِيجُ فَتَرَىٰهُ مُصْفَرًّا ثُمَّ يَكُونُ حُطَٰمًا وَفِى ٱلْءَاخِرَةِ عَذَابٌ شَدِيدٌ وَمَغْفِرَةٌ مِّنَ ٱللَّهِ وَرِضْوَٰنٌ وَمَا ٱلْحَيَوٰةُ ٱلدُّنْيَآ إِلَّا مَتَٰعُ ٱلْغُرُورِ",
    "ENGLISH": {
        "TRANSLATION_0": "Know that the life of this world is merely a game and a diversion and ostentation and a cause of boasting among yourselves and trying to outdo one another in wealth and children: like the plant-growth after rain which delights the cultivators, but then it withers and you see it turning yellow, and then it becomes broken stubble. In the Next World there is terrible punishment but also forgiveness from Allah and His good pleasure. The life of this world is nothing but the enjoyment of delusion.",
        "TRANSLATION_1": "Know that the life of this world is only a frolic and mummery, an ornamentation, boasting and bragging among yourselves, and lust for multiplying wealth and children. It is like rain so pleasing to the cultivator for his vegetation which sprouts and swells, and then begins to wither, and you see it turn to yellow and reduced to chaff. There is severe punishment in the Hereafter, but also forgiveness from God, and acceptance. As for the life of this world, it is no more than merchandise of vanity.\n",
        "TRANSLATION_2": "Know well that the life of this world is merely sport and diversion and adornment and an object of your boasting with one another, and a rivalry in the multiplication of riches and children. Its likeness is that of rain: when it produces vegetation it delights the tillers. But then it withers and you see it turn yellow, and then it crumbles away. In the Hereafter there is (either) grievous chastisement (or) forgiveness from Allah and (His) good pleasure. The life of this world is nothing but delusion.\n",
        "TRANSLATION_3": "Know that the worldly life is only a game, a temporary attraction, a means of boastfulness among yourselves and a place for multiplying your wealth and children. It is like the rain which produces plants that are attractive to the unbelievers. These plants flourish, turn yellow, and then become crushed bits of straw. In the life hereafter there will be severe torment or forgiveness and mercy from God. The worldly life is only an illusion.\n",
        "TRANSLATION_4": "Know that the life of this world is nothing but play and pastime, and adornment, and boasting amongst yourselves, and the desire to surpass each other in wealth and children; like the rain the produce of which pleased the farmer, then dried so you see it yellow, and then turned into dry trampled hay; and in the Hereafter is a severe punishment, and the forgiveness from Allah and His pleasure; and the life of this world is nothing but counterfeit wealth.\n",
        "TRANSLATION_5": "Know that the life of this world is only play and amusement, pomp and mutual boasting among you, and rivalry in respect of wealth and children. (It is) like a rain (Ghayth), thereof the growth is pleasing to the tiller; afterwards it dries up and you see it turning yellow; then it becomes straw. But in the Hereafter (there is) a severe torment, and (there is) forgiveness from Allah and (His) pleasure. And the life of this world is only a deceiving enjoyment.\n",
        "TRANSLATION_6": "Know that this world's life is only sport and play and gaiety and boasting among yourselves, and a vying in the multiplication of wealth and children, like the rain, whose causing the vegetation to grow, pleases the husbandmen, then it withers away so that you will see it become yellow, then it becomes dried up and broken down; and in the hereafter is a severe chastisement and (also) forgiveness from Allah and (His) pleasure; and this world's life is naught but means of deception.\n",
        "TRANSLATION_7": "Know that the present life is but a sport and a diversion, an adornment and a cause for boasting among you, and a rivalry in wealth and children. It is as a rain whose vegetation pleases the unbelievers; then it withers, and thou seest it turning yellow, then it becomes broken orts. And in the world to come there is a terrible chastisement, and forgiveness from God and good pleasure; and the present life is but the joy of delusion.\n",
        "TRANSLATION_8": "Know that the life of the world is only play, and idle talk, and pageantry, and boasting among you, and rivalry in respect of wealth and children; as the likeness of vegetation after rain, whereof the growth is pleasing to the husbandman, but afterward it drieth up and thou seest it turning yellow, then it becometh straw. And in the Hereafter there is grievous punishment, and (also) forgiveness from Allah and His good pleasure, whereas the life of the world is but matter of illusion.\n",
        "TRANSLATION_9": "Never forget that the life of this world is only a game and a passing delight, a show, and mutual boasting and trying to outrival each other in riches and children. It is like the growth of vegetation after the rain, which delights the planter, but which then withers away, turns yellow and becomes worthless stubble. In the life to come there will be a terrible punishment, or God's forgiveness and approval: the life of this world is nothing but means of deception.\n",
        "TRANSLATION_10": "Know that the life of the world is but a play and a pastime, and an adornment and a self-glorification among you and vying in respect of riches and children; as the likeness of vegetation after rains whereof the growth pleaseth the husbandmen, then it withereth and thou seest it becoming yellow, then it becometh chaff. And in the Hereafter there is both a grievous torment and forgiveness from Allah and His pleasure, and the life of the world is but a vain bauble.\n",
        "TRANSLATION_11": "Know that the life of this world is mere diversion and play, glamour and mutual vainglory among you and rivalry for wealth and children—like rain, whose growth impresses the farmer. Then it withers and you see it turn yellow, then it becomes chaff. Whereas in the Hereafter there is forgiveness from Allah and His approval and a severe punishment. The life of this world is nothing but the wares of delusion.\n",
        "TRANSLATION_12": "Know ye (all), that the life of this world is but play and amusement, pomp and mutual boasting and multiplying, (in rivalry) among yourselves, riches and children. Here is a similitude: How rain and the growth which it brings forth, delight (the hearts of) the tillers; soon it withers; thou wilt see it grow yellow; then it becomes dry and crumbles away. But in the Hereafter is a Penalty severe (for the devotees of wrong). And Forgiveness from Allah and (His) Good Pleasure (for the devotees of Allah). And what is the life of this world, but goods and chattels of deception?\n",
        "TRANSLATION_13": "Know that the life of this world is only play and amusement, pomp and mutual boasting among you, and rivalry in respect of wealth and children, as the likeness of vegetation after rain, thereof the growth is pleasing to the tiller; afterwards it dries up and you see it turning yellow; then it becomes straw. But in the Hereafter (there is) a severe torment (for the disbelievers, evil-doers), and (there is) Forgiveness from Allah and (His) Good Pleasure (for the believers, good-doers), whereas the life of this world is only a deceiving enjoyment.\n",
        "TRANSLATION_14": "Know that the life of this world is but play and an amusement, and adornment, and a cause for boasting among you, a rivalry for greater riches and children. It is like rain whose vegetation pleases the unbelievers, but then it withers and turns yellow, becoming broken stubble. In the Everlasting Life is a terrible punishment, forgiveness, and great pleasure from Allah. The life of this world is nothing except the joy of delusion.\n",
        "TRANSLATION_15": "Know that the worldly life is only play, and distraction, and glitter, and boasting among you, and rivalry in wealth and children. It is like a rainfall that produces plants, and delights the disbelievers. But then it withers, and you see it yellowing, and then it becomes debris. While in the Hereafter there is severe agony, and forgiveness from God, and acceptance. The life of this world is nothing but enjoyment of vanity.\n",
        "TRANSLATION_16": "Know that the life of this world is but amusement and diversion and adornment and boasting to one another and competition in increase of wealth and children - like the example of a rain whose [resulting] plant growth pleases the tillers; then it dries and you see it turned yellow; then it becomes [scattered] debris. And in the Hereafter is severe punishment and forgiveness from Allah and approval. And what is the worldly life except the enjoyment of delusion.\n",
        "TRANSLATION_17": "[57:20] Know that the life of this world is merely play and diversion and glitter, the frequent adornment [of oneself], and mutual vainglory in respect of wealth and children, that is, preoccupation with such things — but as for acts of obedience and incentives thereto, these are the concerns of the Hereafter; as the likeness of, that is to say, it, in the manner in which you admire it and in the manner in which it will disappear, is as the likeness of, rain whose vegetation, which results from this [rain], the disbelievers, the sowers, admire; [but] then it withers, it becomes dried-up, and you see it turn yellow, then it becomes chaff, scatters vanishing with the winds. And in the Hereafter there is a severe chastisement, for those who prefer this world to it, and forgiveness from God and beatitude, for those who have not preferred this world to it; and the life of this world, that is to say, the comfort [enjoyed] in it, is but the comfort of delusion.\n",
        "TRANSLATION_18": "650 (Know that the life of this world) that which is in the life of this world (is only play) exultation, (and idle talk) falsehood, (and pageantry) an appearance, (and boasting among you) regarding status and lineage, (and rivalry about wealth and children) which will vanish and not last; (as the likeness of vegetation after rain, whereof the growth is pleasing to the husbandman, but afterward it drieth up and thou seest it turning yellow) after having been green (then it becometh straw) in the same vein, the life of the world will not last just as this vegetation did not. (And in the Hereafter there is grievous punishment) for he who abstains from obeying Allah and withholds the right of Allah, (and (also) forgiveness from Allah and His good pleasure) in the Hereafter, for he who obeys Allah and fulfils Allah's right over his wealth, (whereas the life of the world) i.e. concerning its lastingness and evanescence (is but matter of illusion) like the illusion surrounding the utilities of the house such as plates and bowls.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "57:20",
            "13:26",
            "13:34",
            "47:36",
            "39:26",
            "29:64",
            "14:27",
            "28:60",
            "9:38",
            "9:55"
        ],
        "BIBLE": [
            "writings:ii%20chronicles:31:1",
            "writings:daniel:2:45",
            "prophets:jeremiah:48:38",
            "torah:leviticus:13:25",
            "torah:deuteronomy:31:20",
            "prophets:i%20kings:5:23",
            "prophets:hosea:13:13",
            "writings:psalms:51:19",
            "prophets:isaiah:27:11",
            "prophets:ezekiel:17:16"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:6:4"
        ]
    }
}