{
    "VERSE": "57:24",
    "ARABIC": "ٱلَّذِينَ يَبْخَلُونَ وَيَأْمُرُونَ ٱلنَّاسَ بِٱلْبُخْلِ وَمَن يَتَوَلَّ فَإِنَّ ٱللَّهَ هُوَ ٱلْغَنِىُّ ٱلْحَمِيدُ",
    "ENGLISH": {
        "TRANSLATION_0": "those who are tight-fisted and tell others to be tight-fisted. If anyone turns away, Allah is the Rich Beyond Need, the Praiseworthy.",
        "TRANSLATION_1": "Who hold back what they possess and enjoin stinginess on others. Whoever turns away (from God, should remember) that God is self-sufficient, worthy of praise.\n",
        "TRANSLATION_2": "those who are niggardly and bid others to be niggardly. And he who turns away, (should know that) Allah is Self-Sufficient, Immensely Praiseworthy.\n",
        "TRANSLATION_3": "Those who turn away (from guidance) should know that God is Self-sufficient and Praiseworthy.\n",
        "TRANSLATION_4": "Those who practice miserliness, and exhort others to miserliness; and whoever turns away, then (know that) Allah is the Independent, the Most Praiseworthy.\n",
        "TRANSLATION_5": "Those who are misers and enjoin miserliness upon people. And whosoever turns away, then Allah is Rich, Worthy of all praise.\n",
        "TRANSLATION_6": "Those who are niggardly and enjoin niggardliness on men; and whoever turns back, then surely Allah is He Who is the Selfsufficient, the Praised.\n",
        "TRANSLATION_7": "such as are niggardly, and bid men to be niggardly. And whosoever turns away, God is the All-sufficient, the All-laudable.\n",
        "TRANSLATION_8": "Who hoard and who enjoin upon the people avarice. And whosoever turneth away, still Allah is the Absolute, the Owner of Praise.\n",
        "TRANSLATION_9": "nor those who, being miserly themselves, urge others to be miserly. He who turns his back should remember that God alone is self-sufficient and worthy of all praise.\n",
        "TRANSLATION_10": "Ihey who are niggardly and command mankind to niggardliness. And whosoever turneth away, then verily Allah! He is the Self-sufficient, the praise-worthy.\n",
        "TRANSLATION_11": "Such as are [themselves] stingy and bid [other] people to be stingy. And whoever refuses to comply [should know that] indeed Allah is the All-sufficient, the All-laudable.\n",
        "TRANSLATION_12": "Such persons as are covetous and commend covetousness to men. And if any turn back (from Allah's Way), verily Allah is Free of all Needs, Worthy of all Praise.\n",
        "TRANSLATION_13": "Those who are misers and enjoin upon people miserliness (Allah is not in need of their charity). And whosoever turns away (from Faith Allah's Monotheism), then Allah is Rich (Free of all wants), Worthy of all praise.\n",
        "TRANSLATION_14": "nor those who are mean, and encourage others to be mean. And he that turns away, (know) that Allah is Rich and Praised.\n",
        "TRANSLATION_15": "Those who are stingy, and induce people to be stingy. Whoever turns away—God is the Independent, the Praiseworthy.\n",
        "TRANSLATION_16": "[Those] who are stingy and enjoin upon people stinginess. And whoever turns away - then indeed, Allah is the Free of need, the Praiseworthy.\n",
        "TRANSLATION_17": "[57:24] such as are niggardly, in their duties, and bid people to be niggardly, in these [too]: against such there is a severe threat of chastisement. And whoever turns away, from what is his duty, still God, He is indeed (huwa, ‘He’, is a separating pronoun; a variant reading drops it) the Independent, [without need] of anyone other than Him, the Praiser, of His friends.\n",
        "TRANSLATION_18": "(Who hoard) who conceal the traits and description of the Prophet (pbuh) in the Torah (and who enjoin upon the people avarice) in the Torah by concealing the traits and description of the Prophet (pbuh). (And whosoever turneth away) from faith, (still Allah is the Absolute) He is free of the need for his faith, (the Owner of Praise) for he who declares His divine Oneness; and it is said the Owner of Praise with regard to His acts, for He gives thanks for very little and rewards it abundantly.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "57:24",
            "31:26",
            "35:15",
            "22:64",
            "14:8",
            "31:12",
            "60:6",
            "4:37",
            "64:6",
            "3:173"
        ],
        "BIBLE": [
            "prophets:ii%20samuel:14:20",
            "prophets:ezekiel:3:20",
            "prophets:jonah:3:8",
            "prophets:jeremiah:26:3",
            "prophets:jonah:3:9",
            "writings:job:37:12",
            "prophets:ezekiel:29:16",
            "prophets:joshua:8:20",
            "prophets:i%20samuel:9:6",
            "writings:ii%20chronicles:6:42"
        ]
    }
}