{
    "VERSE": "57:25",
    "ARABIC": "لَقَدْ أَرْسَلْنَا رُسُلَنَا بِٱلْبَيِّنَٰتِ وَأَنزَلْنَا مَعَهُمُ ٱلْكِتَٰبَ وَٱلْمِيزَانَ لِيَقُومَ ٱلنَّاسُ بِٱلْقِسْطِ وَأَنزَلْنَا ٱلْحَدِيدَ فِيهِ بَأْسٌ شَدِيدٌ وَمَنَٰفِعُ لِلنَّاسِ وَلِيَعْلَمَ ٱللَّهُ مَن يَنصُرُهُۥ وَرُسُلَهُۥ بِٱلْغَيْبِ إِنَّ ٱللَّهَ قَوِىٌّ عَزِيزٌ",
    "ENGLISH": {
        "TRANSLATION_0": "We sent Our Messengers with the Clear Signs and sent down the Book and the Balance with them so that mankind might establish justice. And We sent down iron in which there lies great force and which has Allah is All-Strong, Almighty.",
        "TRANSLATION_1": "We have surely sent apostles with clear signs, and sent with them the Book and the Balance, so that men may stand by justice; and We sent down iron which causes much distress but also has advantages for men, so that God may know who helps Him and His apostles in secret. Verily God is all-powerful and all-mighty.\n",
        "TRANSLATION_2": "Indeed We sent Our Messengers with Clear Signs, and sent down with them the Book and the Balance that people may uphold justice. And We sent down iron, wherein there is awesome power and many benefits for people, so that Allah may know who, without even having seen Him, helps Him and His Messengers. Surely Allah is Most Strong, Most Mighty.\n",
        "TRANSLATION_3": "We sent Our Messengers with clear evidence (to support their truthfulness), and sent with them the Book and the Balance so that people would maintain justice. We sent down iron - in which there is strong power and benefit for the people - so that God would know who would help Him and His Messenger without seeing the unseen. God is All-powerful and Majestic.\n",
        "TRANSLATION_4": "Indeed We sent Our Noble Messengers with proofs, and sent down the Book and the Balance of Justice along with them, so that people may stay upon justice; and We sent down iron having severe heat and benefits for mankind, and so that Allah may see him, who without seeing aides Him and His Noble Messengers; indeed Allah is Almighty, Dominant.\n",
        "TRANSLATION_5": "Indeed We have sent Our Messengers with clear proofs, and revealed with them the Scripture and the Mizan that mankind may keep up justice. And We brought forth iron wherein is mighty power, as well as many benefits for mankind, that Allah may test who it is that will help Him (His religion) and His Messengers in the unseen. Verily, Allah is Powerful, Almighty.\n",
        "TRANSLATION_6": "Certainly We sent Our apostles with clear arguments, and sent down with them the Book and the balance that men may conduct themselves with equity; and We have made the iron, wherein is great violence and advantages to men, and that Allah may know who helps Him and His apostles in the secret; surely Allah is Strong, Mighty.\n",
        "TRANSLATION_7": "Indeed, We sent Our Messengers with the clear signs, and We sent down with them the Book and the Balance so that men might uphold justice. And We sent down iron, wherein is great might, and many uses for men, and so that God might know who helps Him, and His Messengers, in the Unseen. Surely God is All-strong, All-mighty.\n",
        "TRANSLATION_8": "We verily sent Our messengers with clear proofs, and revealed with them the Scripture and the Balance, that mankind may observe right measure; and He revealed iron, wherein is mighty power and (many) uses for mankind, and that Allah may know him who helpeth Him and His messengers, though unseen. Lo! Allah is Strong, Almighty.\n",
        "TRANSLATION_9": "We sent Our messengers with evidence and, with them, We sent down the Book and the Scales of Justice, so that men might act in all fairness. We sent down iron with its great inherent strength and its many benefits for mankind, so that God might know who would stand up for God, though unseen, and His messengers. God is powerful, and almighty.\n",
        "TRANSLATION_10": "Assuredly We sent Our apostles with evidences, and We sent down With them the book and the balance, that people might observe equity. And We sent down iron wherein is great violence and also advantages Unto mankind, and that Allah may know him who succoureth Him, unseen, and His apostles. Verily Allah is Strong, Mighty.\n",
        "TRANSLATION_11": "Certainly We sent Our apostles with manifest proofs, and We sent down with them the Book and the Balance, so that mankind may maintain justice; and We sent down iron, in which there is great might and uses for mankind, and so that Allah may know those who help Him and His apostles [with faith] in the Unseen. Indeed Allah is all-strong, all-mighty.\n",
        "TRANSLATION_12": "We sent aforetime our messengers with Clear Signs and sent down with them the Book and the Balance (of Right and Wrong), that men may stand forth in justice; and We sent down Iron, in which is (material for) mighty war, as well as many benefits for mankind, that Allah may test who it is that will help, Unseen, Him and His messengers: For Allah is Full of Strength, Exalted in Might (and able to enforce His Will).\n",
        "TRANSLATION_13": "Indeed We have sent Our Messengers with clear proofs, and revealed with them the Scripture and the Balance (justice) that mankind may keep up justice. And We brought forth iron wherein is mighty power (in matters of war), as well as many benefits for mankind, that Allah may test who it is that will help Him (His religion), and His Messengers in the unseen. Verily, Allah is All-Strong, All-Mighty.\n",
        "TRANSLATION_14": "We have sent Our Messengers with proofs, and sent them with the Book and the Scales, so that people might establish the Scale (of justice). We have sent down iron in which there is great might and diverse benefit for people, so that Allah knows those who help Him and His Messengers in the Unseen. Indeed, Allah is the Strong, the Almighty.\n",
        "TRANSLATION_15": "We sent Our messengers with the clear proofs, and We sent down with them the Book and the Balance, that humanity may uphold justice. And We sent down iron, in which is violent force, and benefits for humanity. That God may know who supports Him and His messengers invisibly. God is Strong and Powerful.\n",
        "TRANSLATION_16": "We have already sent Our messengers with clear evidences and sent down with them the Scripture and the balance that the people may maintain [their affairs] in justice. And We sent down iron, wherein is great military might and benefits for the people, and so that Allah may make evident those who support Him and His messengers unseen. Indeed, Allah is Powerful and Exalted in Might.\n",
        "TRANSLATION_17": "[57:25] We have verily sent Our messengers, the angels, to prophets, with clear signs, with the definitive proofs, and We revealed with them the Scripture and the Balance, justice, so that mankind may uphold justice. And We sent down iron, We caused it to be extracted from mineral ores, wherein is great might, with which one may wage battle, and [many] uses for mankind, and so that God may know, a knowledge of direct vision (liya‘lama’Llāhu is a supplement to li-yaqūma’l-nāsu, ‘so that mankind may uphold’) those who help Him, by helping [to uphold] His religion through [the use of] instruments of war made of metal and otherwise, and   His messengers through the Unseen (bi’l-ghaybi: a circumstantial qualifier referring to the [suffixed pronoun] hā’, ‘Him’, of yansuruhu, ‘[who] aid Him’), that is to say, while He [God] is not seen by them in this world. Ibn ‘Abbās said: ‘They help Him even though they do not see Him’ (yansurūnahu wa-lā yubsirūnahu). Assuredly God is Strong, Mighty, without any need of being helped, but such [help] benefits those who proffer it.\n",
        "TRANSLATION_18": "(We verily sent Our messengers with clear proofs) with commands, prohibitions and signs, (and revealed with them the Scripture) and sent to them Gabriel with the Scripture (and the Balance) expositing there in justice, (that mankind may observe right measure) justice; (and He revealed iron) We created iron, (wherein is mighty power) such that only fire makes it pliable; it is also said that this means: there is in it mighty strength for fighting and war (and (many) uses for mankind) they use it to make things like knives, axes, files and other things, (and that Allah may know) in order that Allah may see (him who helpeth Him and His messengers, though unseen) by means of these weapons. (Lo! Allah is Strong) by helping His friends, (Almighty) in retribution against His enemies. 651\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "57:25",
            "40:22",
            "58:21",
            "2:159",
            "2:213",
            "42:19",
            "3:4",
            "4:105",
            "14:4",
            "58:5"
        ],
        "BIBLE": [
            "torah:exodus:32:1",
            "torah:exodus:18:16",
            "writings:i%20chronicles:29:12",
            "torah:exodus:32:23",
            "writings:ecclesiastes:2:24",
            "writings:daniel:6:8",
            "torah:deuteronomy:7:19",
            "writings:daniel:2:25",
            "writings:daniel:11:6",
            "writings:ecclesiastes:9:1"
        ]
    }
}