{
    "VERSE": "57:28",
    "ARABIC": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ ٱتَّقُوا۟ ٱللَّهَ وَءَامِنُوا۟ بِرَسُولِهِۦ يُؤْتِكُمْ كِفْلَيْنِ مِن رَّحْمَتِهِۦ وَيَجْعَل لَّكُمْ نُورًا تَمْشُونَ بِهِۦ وَيَغْفِرْ لَكُمْ وَٱللَّهُ غَفُورٌ رَّحِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "You who have iman! have taqwa of Allah and iman in His Messenger. He will give you a double portion of His mercy and grant you a Light by which to walk and forgive you. Allah is Ever-Forgiving, Most Merciful.",
        "TRANSLATION_1": "O you who believe, have fear of displeasing God, and believe in His Prophet. He will give you twice as much of His bounty and place a light for you to walk in, and forgive you, for God is forgiving and kind;\n",
        "TRANSLATION_2": "Believers, have fear of Allah and believe in His Messenger, and He will grant you a two-fold portion of His Mercy, and will appoint for you a light whereby you shall walk; and He will forgive you. Allah is Most Forgiving, Most Compassionate.\n",
        "TRANSLATION_3": "Believers, have fear of God and believe in His Messenger. God will grant you a double share of mercy, a light by which you can walk, and forgive your sins. God is All-forgiving and All-merciful.\n",
        "TRANSLATION_4": "O People who Believe (in the earlier Noble Messengers)! Fear Allah and accept faith in this Noble Messenger of His – He will bestow two portions of His mercy to you and will create a light for you to walk in it, and will forgive you; and Allah is Oft Forgiving, Most Merciful.\n",
        "TRANSLATION_5": "O you who believe! Have Taqwa of Allah, and believe in His Messenger, He will give you a double portion of His mercy, and He will give you a light by which you shall walk (straight). And He will forgive you. And Allah is Oft-Forgiving, Most Merciful.\n",
        "TRANSLATION_6": "O you who believe! be careful of (your duty to) Allah and believe in His Apostle: He will give you two portions of His mercy, and make for you a light with which you will walk, and forgive you, and Allah is Forgiving, Merciful;\n",
        "TRANSLATION_7": "O believers, fear God, and believe in His Messenger, and He will give you a twofold portion of His mercy; and He will appoint for you a light whereby you shall walk, and forgive you; God is All-forgiving, All-compassionate;\n",
        "TRANSLATION_8": "O ye who believe! Be mindful of your duty to Allah and put faith in His messenger. He will give you twofold of His mercy and will appoint for you a light wherein ye shall walk, and will forgive you. Allah is Forgiving, Merciful;\n",
        "TRANSLATION_9": "Believers, fear God and believe in His messenger. He will show you mercy in double measure and will provide a light for you to walk in. God will grant you forgiveness. He is forgiving and merciful.\n",
        "TRANSLATION_10": "O ye who believe! fear Aliah and believe in His apostle; He will vouch safe Unto you two portions of His mercy and will appoint for you a light wherewith ye will walk, and He will forgive you. And Allah is Forgiving, Merciful.\n",
        "TRANSLATION_11": "O you who have faith! Be wary of Allah and have faith in His Apostle. He will grant you a double share of His mercy and a light to walk by, and He will forgive you, and Allah is all-forgiving, all-merciful;\n",
        "TRANSLATION_12": "O ye that believe! Fear Allah, and believe in His Messenger, and He will bestow on you a double portion of His Mercy: He will provide for you a Light by which ye shall walk (straight in your path), and He will forgive you (your past): for Allah is Oft-Forgiving, Most Merciful.\n",
        "TRANSLATION_13": "O you who believe [in Musa (Moses) (i.e. Jews) and 'Iesa (Jesus) (i.e. Christians)]! Fear Allah, and believe too in His Messenger (Muhammad SAW), He will give you a double portion of His Mercy, and He will give you a light by which you shall walk (straight), and He will forgive you. And Allah is Oft-Forgiving, Most Merciful.\n",
        "TRANSLATION_14": "Believers, fear Allah and believe in His Messenger (Prophet Muhammad), He will give you a double portion of His Mercy and He will make for you a light inwhich to walk, and forgive you; Allah is the Forgiver and the Most Merciful.\n",
        "TRANSLATION_15": "O you who believe! Fear God, and believe in His Messenger: He will give you a double portion of His mercy, and will give you a light by which you walk, and will forgive you. God is Forgiving and Merciful.\n",
        "TRANSLATION_16": "O you who have believed, fear Allah and believe in His Messenger; He will [then] give you a double portion of His mercy and make for you a light by which you will walk and forgive you; and Allah is Forgiving and Merciful.\n",
        "TRANSLATION_17": "[57:28] O you who believe, in Jesus, fear God and believe in His Messenger, Muhammad (s), and Jesus, and He will give you a twofold portion, share, of His mercy, for your belief in both prophets; and He will assign for you a light by which you will walk, across the Path [over Hell and into Paradise], and forgive you; for God is Forgiving, Merciful;\n",
        "TRANSLATION_18": "(0 ye who believe! Be mindful of your duty to Allah) fear Allah (and put faith in His messenger) be firm in your belief in Allah and His Messenger. (He will give you twofold of His mercy) of His reward and beneficence (and will appoint for you a light wherein ye shall walk) among people on the Bridge over hell, (and will forgive you) the sins you committed in the pre-Islamic era. (Allah is Forgiving) He forgives he who repents, (Merciful) towards he who dies in a state of repentance;\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "57:28",
            "4:152",
            "2:218",
            "2:199",
            "4:96",
            "9:91",
            "8:20",
            "5:74",
            "24:62",
            "33:73"
        ],
        "BIBLE": [
            "prophets:jeremiah:14:13",
            "writings:psalms:89:16",
            "torah:exodus:32:34",
            "torah:exodus:18:21",
            "prophets:jonah:4:2",
            "writings:job:38:19",
            "prophets:isaiah:51:4",
            "torah:exodus:16:4",
            "writings:ii%20chronicles:33:19",
            "prophets:isaiah:49:6"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:5:2",
            
            "Sefer%20Yetzirah:4:3"
        ]
    }
}