{
    "VERSE": "57:29",
    "ARABIC": "لِّئَلَّا يَعْلَمَ أَهْلُ ٱلْكِتَٰبِ أَلَّا يَقْدِرُونَ عَلَىٰ شَىْءٍ مِّن فَضْلِ ٱللَّهِ وَأَنَّ ٱلْفَضْلَ بِيَدِ ٱللَّهِ يُؤْتِيهِ مَن يَشَآءُ وَٱللَّهُ ذُو ٱلْفَضْلِ ٱلْعَظِيمِ",
    "ENGLISH": {
        "TRANSLATION_0": "So that the People of the Book may know that they have no power at all over any of Allah's favour and that all favour is in the Hand of Allah. He gives it to anyone He wills. Allah's favour is indeed immense.",
        "TRANSLATION_1": "So that the people of the Book may know that they have not the least power over the bounty of God, and that the bounty is wholly in the hands of God to give whosoever He please, for God is the master of infinite bounty.\n",
        "TRANSLATION_2": "(You should do this) so that the People of the Book know that they have no control over Allah's Bounty, and that all bounty is in Allah's Hand; He bestows it on whomsoever He pleases. Allah is the Lord of abounding bounty.\n",
        "TRANSLATION_3": "(Have fear of God and believe in His Messenger) so that the followers of the Bible will know that they can receive no reward from God. They should know that all favors are in the hands of God. He grants them to whomever He wants. The favors of God are great.\n",
        "TRANSLATION_4": "This is so that the disbelievers among People given the Book(s) may know that they do not have any control over Allah’s munificence, and that the munificence is in Allah’s Hand (control) – He bestows to whomever He wills; and Allah is Extremely Munificent.\n",
        "TRANSLATION_5": "So that the People of the Scriptures may know that they have no power whatsoever over the grace of Allah, and that (His) grace is in His Hand to bestow it on whomsoever He wills. And Allah is the Owner of great bounty.\n",
        "TRANSLATION_6": "So that the followers of the Book may know that they do not control aught of the grace of Allah, and that grace is in Allah's hand, He gives it to whom He pleases; and Allah is the Lord of mighty grace.\n",
        "TRANSLATION_7": "that the People of the Book may know that they have no power over anything of God's bounty, and that bounty is in the hand of God; He gives it unto whomsoever He will; and God is of bounty abounding.\n",
        "TRANSLATION_8": "That the People of the Scripture may know that they control naught of the bounty of Allah, but that the bounty is in Allah's hand to give to whom He will. And Allah is of Infinite Bounty.\n",
        "TRANSLATION_9": "The People of the Book should know that they have no power whatsoever over God's grace. His grace is entirely in His hand and He bestows it upon whoever He wills. God is truly infinite in His bounty.\n",
        "TRANSLATION_10": "This He will award that the people of the Book may know that they control naught of the grace of Allah, and that the grace is in Allah's hand; He vouchsafeth it Unto whomsoever He wilt, And Allah is Owner of mighty grace.\n",
        "TRANSLATION_11": "so that the People of the Book may know that they do not control Allah grace in any wise and that in Allah’s hand is all grace, which He grants to whomever He wishes and Allah is dispenser of a mighty grace.\n",
        "TRANSLATION_12": "That the People of the Book may know that they have no power whatever over the Grace of Allah, that (His) Grace is (entirely) in His Hand, to bestow it on whomsoever He wills. For Allah is the Lord of Grace abounding.\n",
        "TRANSLATION_13": "So that the people of the Scripture (Jews and Christians) may know that they have no power whatsoever over the Grace of Allah, and that (His) Grace is (entirely) in His Hand to bestow it on whomsoever He wills. And Allah is the Owner of Great Bounty.\n",
        "TRANSLATION_14": "So that the People of the Book may know that they have no power over any of the favors of Allah; that the favors are in the Hand of Allah; He gives it towhom He will. The Favor of Allah is the Great.\n",
        "TRANSLATION_15": "That the People of the Book may know that they have no power whatsoever over God’s grace, and that all grace is in God’s hand; He gives it to whomever He wills. God is Possessor of Great Grace.\n",
        "TRANSLATION_16": "[This is] so that the People of the Scripture may know that they are not able [to obtain] anything from the bounty of Allah and that [all] bounty is in the hand of Allah; He gives it to whom He wills. And Allah is the possessor of great bounty.\n",
        "TRANSLATION_17": "[57:29] So that the People of the Scripture, the Torah — those who did not believe in Muhammad (s) — may know, in other words, I inform you of this so that they [the People of the Scripture] may know, that (a [of a-llā] is softened in place of the hardened form [an-lā], its subject being the pronoun of the matter, that is to say, [understand it as being] annahum) they have no power over anything of God’s bounty, contrary to their claims that they are God’s beloved and those who deserve His beatitude, and that [all] bounty is in God’s hand; He gives it to whomever He will, and hence He has given the believers [in the Prophet] among them their reward twofold, as stated above; and God is [dispenser] of tremendous bounty.\n",
        "TRANSLATION_18": "(That the People of the Scripture) 'Abdullah Ibn Salam and his followers (may know that they control naught of the bounty of Allah) of the reward of Allah, (but that the bounty) reward and honour (is in Allah's hand to give to whom He will) whoever deserves it. (And Allah is of Infinite Bounty) in relation to the believers in that He bestows upon them reward and honours them. The last two verses were revealed about 'Abdullah Ibn Salam when he boasted to Ubayy Ibn Ka'b and his friends that they had two rewards while others had only one'. And of the surah in which Dispute is mentioned, which is all Medinan-to the exception of Allah's saying (There is no secret conference of three but He is their fourth) which is Meccan-and it consists of 22 verses, 473 words and 1,992 letters: Surah 58: Dispute (al-Mujadilah) And of the surah in which Dispute is mentioned, which is all Medinan — to the exception of Allah's saying (There is no secret conference of three but He is their fourth) which is Meccan — and it consists of 22 verses, 473 words and 1,992 letters:\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "57:29",
            "2:105",
            "4:113",
            "62:4",
            "3:74",
            "4:54",
            "69:33",
            "3:64",
            "33:47",
            "2:79"
        ],
        "BIBLE": [
            "writings:i%20chronicles:22:18",
            "prophets:judges:18:10",
            "prophets:i%20kings:8:56",
            "prophets:joshua:8:1",
            "writings:psalms:119:73",
            "prophets:joshua:4:24",
            "torah:genesis:31:42",
            "prophets:joshua:6:2",
            "prophets:jeremiah:32:25",
            "writings:i%20chronicles:29:8"
        ]
    }
}