{
    "VERSE": "57:5",
    "ARABIC": "لَّهُۥ مُلْكُ ٱلسَّمَٰوَٰتِ وَٱلْأَرْضِ وَإِلَى ٱللَّهِ تُرْجَعُ ٱلْأُمُورُ",
    "ENGLISH": {
        "TRANSLATION_0": "The kingdom of the heavens and the earth belongs to Him. All things return to Allah.",
        "TRANSLATION_1": "His is the kingdom of the heavens and the earth, and all things will go back to Him.\n",
        "TRANSLATION_2": "His is the dominion of the heavens and the earth, and to Him are all matters referred (for judgement).\n",
        "TRANSLATION_3": "To Him belong the heavens and the earth and to Him all things return.\n",
        "TRANSLATION_4": "For Him only is the kingship of the heavens and the earth; and towards Allah only is the return of all matters.\n",
        "TRANSLATION_5": "His is the kingdom of the heavens and the earth. And to Allah return all the matters.\n",
        "TRANSLATION_6": "His is the kingdom of the heavens and the earth; and to Allah are (all) affairs returned.\n",
        "TRANSLATION_7": "To Him belongs the Kingdom of the heavens and the earth; and unto Him all matters are returned.\n",
        "TRANSLATION_8": "His is the Sovereignty of the heavens and the earth, and unto Allah (all) things are brought back.\n",
        "TRANSLATION_9": "He has sovereignty over the heavens and the earth. All affairs will return to God.\n",
        "TRANSLATION_10": "His is the dominion of the heavens and the earth, and Unto Allah will all affairs be brought back.\n",
        "TRANSLATION_11": "To Him belongs the kingdom of the heavens and the earth, and to Allah all matters are returned.\n",
        "TRANSLATION_12": "To Him belongs the dominion of the heavens and the earth: and all affairs are referred back to Allah.\n",
        "TRANSLATION_13": "His is the kingdom of the heavens and the earth. And to Allah return all the matters (for decision).\n",
        "TRANSLATION_14": "To Him belongs the Kingdom of the heavens and the earth. To Him all matters shall return.\n",
        "TRANSLATION_15": "To Him belongs the kingship of the heavens and the earth, and to God all matters are referred.\n",
        "TRANSLATION_16": "His is the dominion of the heavens and earth. And to Allah are returned [all] matters.\n",
        "TRANSLATION_17": "[57:5] To Him belongs the kingdom of the heavens and the earth, and to Him [all] matters, all existents, are   returned.\n",
        "TRANSLATION_18": "(His is the Sovereignty) the stores (of the heavens) rain (and the earth) vegetation (and, unto Allah (all) things are brought back) and the consequences of all things are brought back to Allah in the Hereafter.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "57:5",
            "3:109",
            "24:42",
            "42:53",
            "39:44",
            "45:27",
            "16:49",
            "42:49",
            "48:14",
            "4:132"
        ],
        "BIBLE": [
            "writings:daniel:5:26",
            "writings:daniel:11:28",
            "prophets:isaiah:23:17",
            "prophets:ii%20samuel:14:20",
            "writings:daniel:11:9",
            "prophets:i%20kings:12:24",
            "prophets:isaiah:65:17",
            "prophets:jeremiah:15:19",
            "writings:psalms:105:7",
            "writings:i%20chronicles:16:14"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:2",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:2"
        ]
    }
}