{
    "VERSE": "106:2",
    "ARABIC": "إِۦلَٰفِهِمْ رِحْلَةَ ٱلشِّتَآءِ وَٱلصَّيْفِ",
    "ENGLISH": {
        "TRANSLATION_0": "their tradition of the winter and summer caravans:",
        "TRANSLATION_1": "United to fit out caravans winter and summer,\n",
        "TRANSLATION_2": "accustomed to the journey of winter and summer,\n",
        "TRANSLATION_3": "Quraish should worship the Lord of this House.\n",
        "TRANSLATION_4": "(We) gave them alliances during both their travels of winter and summer.\n",
        "TRANSLATION_5": "Their Ilaf caravans, in winter and in summer.\n",
        "TRANSLATION_6": "Their protection during their trading caravans in the winter and the summer--\n",
        "TRANSLATION_7": "their composing for the winter and summer caravan!\n",
        "TRANSLATION_8": "For their taming (We cause) the caravans to set forth in winter and summer.\n",
        "TRANSLATION_9": "their security in their winter and summer journeys.\n",
        "TRANSLATION_10": "For their keeping to the journey in the winter and the summer-\n",
        "TRANSLATION_11": "their solidarity during winter and summer journeys,\n",
        "TRANSLATION_12": "Their covenants (covering) journeys by winter and summer,-\n",
        "TRANSLATION_13": "(And with all those Allah's Grace and Protections for their taming, We cause) the (Quraish) caravans to set forth safe in winter (to the south), and in summer (to the north without any fear),\n",
        "TRANSLATION_14": "their custom of the winter and summer journey.\n",
        "TRANSLATION_15": "Their security during winter and summer journeys.\n",
        "TRANSLATION_16": "Their accustomed security [in] the caravan of winter and summer -\n",
        "TRANSLATION_17": "[106:2] their security (īlāfihim: repeated for emphasis; it is a verbal noun from [the verb] ālafa) for the journey of winter, to Yemen, and, the journey, of summer, to Syria, every year: they made use of these two journeys   to provide for their trade at the station [of Abraham] in Mecca, in order to attend to the House [of God], which was their source of pride; they [Quraysh] were the descendants of al-Nadr b. Kināna;\n",
        "TRANSLATION_18": "(For their taming (We cause)) as We have tamed (the caravans to set forth in winter and summer) the caravans to set forth in winter to Yemen and in summer to Historic Syria; it is also said that this means: belief in Allah's divine Oneness is not hard for Quraysh just as their winter and summer trips are not hard for them.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "106:2",
            "19:88",
            "11:67",
            "32:29",
            "2:157",
            "52:1",
            "15:83",
            "81:10",
            "15:73",
            "26:224"
        ],
        "BIBLE": [
            "writings:ezra:5:3",
            "prophets:ii%20kings:12:15",
            "torah:deuteronomy:26:11",
            "torah:genesis:38:14",
            "prophets:ii%20kings:18:15",
            "writings:i%20chronicles:29:8",
            "writings:ii%20chronicles:28:21",
            "writings:job:29:21",
            "writings:daniel:1:2",
            "prophets:i%20kings:14:8"
        ]
    }
}