{
    "VERSE": "106:4",
    "ARABIC": "ٱلَّذِىٓ أَطْعَمَهُم مِّن جُوعٍ وَءَامَنَهُم مِّنْ خَوْفٍۭ",
    "ENGLISH": {
        "TRANSLATION_0": "who has preserved them from hunger and secured them from fear.",
        "TRANSLATION_1": "Who provided them against destitution and gave them security against fear.\n",
        "TRANSLATION_2": "Who fed them against hunger, and secured them against fear.\n",
        "TRANSLATION_3": "and has made them secure from fear.\n",
        "TRANSLATION_4": "The One Who gave them food in hunger, and bestowed them safety from a great fear.\n",
        "TRANSLATION_5": "Who has fed them against hunger, and has made them safe from fear.\n",
        "TRANSLATION_6": "Who feeds them against hunger and gives them security against fear.\n",
        "TRANSLATION_7": "who has fed them against hunger and secured them from fear.\n",
        "TRANSLATION_8": "Who hath fed them against hunger and hath made them safe from fear.\n",
        "TRANSLATION_9": "who provided them with food lest they go hungry and saved them from fear.\n",
        "TRANSLATION_10": "Who hath fed them against hunger; and hath rendered them secure from fear.\n",
        "TRANSLATION_11": "who has fed them [and saved them] from hunger, and secured them from fear.\n",
        "TRANSLATION_12": "Who provides them with food against hunger, and with security against fear (of danger).\n",
        "TRANSLATION_13": "(He) Who has fed them against hunger, and has made them safe from fear.\n",
        "TRANSLATION_14": "who fed them from hunger and secured them from fear.\n",
        "TRANSLATION_15": "Who has fed them against hunger, and has secured them against fear.\n",
        "TRANSLATION_16": "Who has fed them, [saving them] from hunger and made them safe, [saving them] from fear.\n",
        "TRANSLATION_17": "[106:4] Who has fed them against, that is, on account of, hunger and made them secure from, that is, on account of, fear: they used to suffer hunger in Mecca due to the lack of crops and they feared the army of the Elephant. Meccan or Medinese, or half and half; it consists of 6 or 7 verses.\n",
        "TRANSLATION_18": "(Who hath fed them against hunger) which lasted seven years; and it is also said this means: Who sufficed them the burden of hunger and travelling in winter and summer, because they used to make two trips a year, one in winter to Yemen and one in summer to Historic Syria, and so Allah sufficed them the burden of doing so (and hath made them safe from fear) of the enemy lest he attacks them; and it is also said: from the fear of the Negus and his host who wanted to destroy the Ka'bah; this surah is also in conjunction with the previous surah'. And of the surah in which Small Kindnesses is mentioned, which is all Meccan and consists of 7 verses, 25 words and 111 letters: Surah 107: Small Kindnesses (al-Ma'un) And of the surah in which Small Kindnesses is mentioned, which is all Meccan and consists of 7 verses, 25 words and 111 letters:\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "106:4",
            "88:7",
            "32:16",
            "6:48",
            "10:63",
            "51:28",
            "26:19",
            "2:155",
            "46:13",
            "2:38"
        ],
        "BIBLE": [
            "writings:psalms:111:5",
            "writings:psalms:80:6",
            "torah:genesis:9:3",
            "writings:proverbs:30:8",
            "writings:ii%20chronicles:20:11",
            "writings:psalms:69:22",
            "writings:esther:2:18",
            "torah:deuteronomy:10:18",
            "writings:psalms:18:36",
            "writings:psalms:60:6"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:4:3",
            
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:1:4"
        ]
    }
}