{
    "VERSE": "43:10",
    "ARABIC": "ٱلَّذِى جَعَلَ لَكُمُ ٱلْأَرْضَ مَهْدًا وَجَعَلَ لَكُمْ فِيهَا سُبُلًا لَّعَلَّكُمْ تَهْتَدُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "It is He who made the earth a cradle for you and made pathways for you in it so that hopefully you would be guided.",
        "TRANSLATION_1": "He who made the earth a bed for you, and laid out tracks upon it so that you may find the way;\n",
        "TRANSLATION_2": "He it is Who made this earth for you a cradle and made in it pathways for you that you may find the way to your destination;\n",
        "TRANSLATION_3": "It is He who has made the earth for you as a cradle and has made roads therein so that you will perhaps seek guidance.\n",
        "TRANSLATION_4": "The One Who made the earth a bed you, and made roads for you in it, so that you may be guided.\n",
        "TRANSLATION_5": "Who has made for you the earth like a bed, and has made for you roads therein, in order that you may find your way.\n",
        "TRANSLATION_6": "He Who made the earth a resting-place for you, and made in it ways for you that you may go aright;\n",
        "TRANSLATION_7": "He who appointed the earth to be a cradle for you, and appointed ways for you therein, that haply you may be guided;\n",
        "TRANSLATION_8": "Who made the earth a resting-place for you, and placed roads for you therein, that haply ye may find your way;\n",
        "TRANSLATION_9": "Who has made the earth a cradle for you and made thereon paths for you so that, hopefully, you may find your way\n",
        "TRANSLATION_10": "Who hath made for you the earth a bed, and hath made for you paths therein that haply ye may be directed.\n",
        "TRANSLATION_11": "He, who made the earth a cradle for you, and made for you in it ways so that you may be guided [to your destinations],\n",
        "TRANSLATION_12": "(Yea, the same that) has made for you the earth (like a carpet) spread out, and has made for you roads (and channels) therein, in order that ye may find guidance (on the way);\n",
        "TRANSLATION_13": "Who has made for you the earth like a bed, and has made for you roads therein, in order that you may find your way,\n",
        "TRANSLATION_14": "(It is) He who made the earth to be a cradle for you and made in it ways for you, in order that you are guided.\n",
        "TRANSLATION_15": "He who made the earth a habitat for you, and traced pathways for you on it, that you may be guided.\n",
        "TRANSLATION_16": "[The one] who has made for you the earth a bed and made for you upon it roads that you might be guided\n",
        "TRANSLATION_17": "[43:10] He Who made the earth a cradle for you, a flat resting-place, like a child’s cradle, and placed for you therein ways, routes, that perhaps you may be guided, to your destinations during your travels;\n",
        "TRANSLATION_18": "Allah says: yes, He created them Him (Who made the earth a resting place for you, and placed roads for you therein, that haply ye may find your way) by means of the roads;\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "43:10",
            "16:15",
            "21:31",
            "20:53",
            "23:84",
            "23:79",
            "26:152",
            "38:28",
            "21:71",
            "91:6"
        ],
        "BIBLE": [
            "writings:psalms:139:24",
            "writings:proverbs:3:6",
            "writings:psalms:119:5",
            "prophets:ezekiel:21:21",
            "torah:deuteronomy:1:33",
            "prophets:ezekiel:7:4",
            "prophets:jeremiah:18:15",
            "prophets:ezekiel:7:9",
            "prophets:isaiah:59:8",
            "torah:genesis:48:7"
        ]
    }
}