{
    "VERSE": "43:13",
    "ARABIC": "لِتَسْتَوُۥا۟ عَلَىٰ ظُهُورِهِۦ ثُمَّ تَذْكُرُوا۟ نِعْمَةَ رَبِّكُمْ إِذَا ٱسْتَوَيْتُمْ عَلَيْهِ وَتَقُولُوا۟ سُبْحَٰنَ ٱلَّذِى سَخَّرَ لَنَا هَٰذَا وَمَا كُنَّا لَهُۥ مُقْرِنِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "so that you miqht sit firmly on their backs and remember your Lord's blessing while you are seated on them, saying, 'Glory be to Him who has subjected this to us. We could never have done it by ourselves.",
        "TRANSLATION_1": "So that when you sit astride of them and think of the bounties of your Lord, you may say: \"All glory to Him who subjugated these for us. We were incapable of doing so.\n",
        "TRANSLATION_2": "so that when you are mounted upon them you may remember the bounty of your Lord, and say: “Glory be to Him Who has subjected this to Us whereas we did not have the strength to subdue it.\n",
        "TRANSLATION_3": "so that perhaps when you ride them, you will recall the bounties of your Lord and when you establish your control over it you would say, \"Glory belongs to Him who has made it subservient to us when we would not have been able to do so ourselves.\n",
        "TRANSLATION_4": "So that you may properly mount their backs, and may remember your Lord’s favour when you have mounted them, and say, “Purity is to Him, Who has given this ride in our control, and we did not have the strength for it.”\n",
        "TRANSLATION_5": "In order that you may mount on their backs, and then may remember the favor of your Lord when you mount thereon, and say: \"Glory to Him Who has subjected this to us, and we could have never had it.\"\n",
        "TRANSLATION_6": "That you may firmly sit on their backs, then remember the favor of your Lord when you are firmly seated thereon, and say: Glory be to Him Who made this subservient to us and we were not able to do it\n",
        "TRANSLATION_7": "that you may be seated on their backs and then remember your Lord's blessing when you are seated on them, and say, 'Glory be to Him, who has subjected this to us, and we ourselves were not equal to it;\n",
        "TRANSLATION_8": "That ye may mount upon their backs, and may remember your Lord's favour when ye mount thereon, and may say: Glorified be He Who hath subdued these unto us, and we were not capable (of subduing them);\n",
        "TRANSLATION_9": "so that you may sit firmly on their backs. Then once you have mounted them, remember your Lord's favour and say, \"Glory be to Him who has subjected these creatures to us; we would never on our own have subdued them.\n",
        "TRANSLATION_10": "That ye mount firmly on the backs thereof, and then may remember the favour of your Lord When ye mount thereon, and may say: hallowed be He Who hath subjected this Unto us, and we for it were not fit.\n",
        "TRANSLATION_11": "that you may sit on their backs, then remember the blessing of your Lord when you are settled on them, and say, ‘Immaculate is He who has disposed this for us, and we [by ourselves] were no match for it.\n",
        "TRANSLATION_12": "In order that ye may sit firm and square on their backs, and when so seated, ye may celebrate the (kind) favour of your Lord, and say, \"Glory to Him Who has subjected these to our (use), for we could never have accomplished this (by ourselves),\n",
        "TRANSLATION_13": "In order that you may mount firmly on their backs, and then may remember the Favour of your Lord when you mount thereon, and say: \"Glory to Him who has subjected this to us, and we could never have it (by our efforts).\"\n",
        "TRANSLATION_14": "so that you can sit upon their backs and then remember the Favors of your Lord and say: 'Exaltations to Him who has subjected these to us otherwise, we ourselves were not capable of it,\n",
        "TRANSLATION_15": "That you may mount their backs, and remember the favor of your Lord as you sit firmly upon them, and say, “Glory be to Him Who placed these at our service; surely we could not have done it by ourselves.\n",
        "TRANSLATION_16": "That you may settle yourselves upon their backs and then remember the favor of your Lord when you have settled upon them and say. \"Exalted is He who has subjected this to us, and we could not have [otherwise] subdued it.\n",
        "TRANSLATION_17": "[43:13] that you may sit, that you may find a firm position, upon their backs (He has made the [suffixed] pronoun a masculine plural and rendered zahr, ‘back’, plural because of the particle mā and its [plural] import); and then remember your Lord’s grace when you are settled on them, and say, ‘Glory be to Him Who has disposed this for us, and we [by] ourselves were no match for it, [not] capable [of it].\n",
        "TRANSLATION_18": "That ye may mount upon their backs) i.e. the backs of camels, (and may remember your Lord's favour) for making them subdued for you (when ye mount thereon, and may say: Glorified be He Who hath subdued these) camels (unto us, and we were not capable (of subduing them)) and we were not capable of owning them or making them subdued;\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "43:13",
            "68:2",
            "52:29",
            "24:16",
            "93:11",
            "16:42",
            "29:59",
            "20:122",
            "28:17",
            "68:29"
        ],
        "BIBLE": [
            "writings:esther:8:14",
            "writings:i%20chronicles:24:19",
            "torah:deuteronomy:26:13",
            "torah:deuteronomy:16:17",
            "torah:numbers:7:9",
            "torah:numbers:11:18",
            "writings:ezra:8:20",
            "torah:deuteronomy:12:15",
            "torah:numbers:20:12",
            "torah:deuteronomy:2:9"
        ]
    }
}