{
    "VERSE": "43:15",
    "ARABIC": "وَجَعَلُوا۟ لَهُۥ مِنْ عِبَادِهِۦ جُزْءًا إِنَّ ٱلْإِنسَٰنَ لَكَفُورٌ مُّبِينٌ",
    "ENGLISH": {
        "TRANSLATION_0": "They have assigned to Him a portion of His creatures! Truly man is openly ungrateful.",
        "TRANSLATION_1": "Yet they make some of His creatures His offspring! Man is surely most ungrateful.\n",
        "TRANSLATION_2": "Yet they have made some of His servants a part of Him. Indeed man is most evidently thankless.\n",
        "TRANSLATION_3": "The pagans have considered some of His servants as His children. There is no doubt that the human being is simply ungrateful.\n",
        "TRANSLATION_4": "And from* His bondmen, they appointed a portion for Him; man is indeed an open ingrate. (* Appointed some of His creation as His sons and daughters).\n",
        "TRANSLATION_5": "Yet, they assign to some of His servants a share with Him. Verily, man is indeed a manifest ingrate!\n",
        "TRANSLATION_6": "And they assign to Him a part of His servants; man, to be sure, is clearly ungrateful.\n",
        "TRANSLATION_7": "Yet they have assigned to Him a part of His own servants! Man is dearly unthankful.\n",
        "TRANSLATION_8": "And they allot to Him a portion of His bondmen! Lo! man is verily a mere ingrate.\n",
        "TRANSLATION_9": "Yet they make some of His servants partners in His divinity. Man is clearly ungrateful!\n",
        "TRANSLATION_10": "And they appoint for Him from His bondmen a part! Verily man is an ingrate manifest.\n",
        "TRANSLATION_11": "They ascribe to Him offspring from among His servants! Man is indeed a manifest ingrate.\n",
        "TRANSLATION_12": "Yet they attribute to some of His servants a share with Him (in his godhead)! truly is man a blasphemous ingrate avowed!\n",
        "TRANSLATION_13": "Yet they assign to some of His slaves a share with Him (by pretending that He has children, and considering them as equals or co-partners in worship with Him). Verily, man is indeed a manifest ingrate!\n",
        "TRANSLATION_14": "Yet they assign to Him some of His own (created) worshipers! Clearly, the human is unthankful.\n",
        "TRANSLATION_15": "Yet they turn one of His servants into a part of Him. Man is clearly ungrateful.\n",
        "TRANSLATION_16": "But they have attributed to Him from His servants a portion. Indeed, man is clearly ungrateful.\n",
        "TRANSLATION_17": "[43:15] And they assign to Him from among His own servants a part, when they say that the angels are God’s daughters — for a child is a part of its parent — even though the angels are [like them] servants of His, exalted be He. Man, [such as the one] who says the above-mentioned [words], is verily a manifest ingrate, one whose ungratefulness is manifest and clear.\n",
        "TRANSLATION_18": "(And they allot to Him) they ascribe to Him (a portion of His bondmen) i.e. the angels! They claimed, i.e. Banu Malih, that the angels were Allah's daughters. (Lo! Man) i.e. the Banu Malih (is verily a mere ingrate) a disbeliever in Allah whose disbelief is quite apparent.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "43:15",
            "22:66",
            "11:9",
            "100:6",
            "37:111",
            "71:27",
            "37:81",
            "99:3",
            "37:132",
            "90:4"
        ],
        "BIBLE": [
            "prophets:isaiah:29:21",
            "prophets:joshua:22:25",
            "torah:exodus:22:13",
            "prophets:i%20kings:9:22",
            "writings:esther:9:22",
            "torah:exodus:30:32",
            "prophets:jeremiah:16:20",
            "writings:ezra:6:8",
            "prophets:ii%20kings:10:5",
            "writings:daniel:2:25"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:3:5"
        ]
    }
}