{
    "VERSE": "43:19",
    "ARABIC": "وَجَعَلُوا۟ ٱلْمَلَٰٓئِكَةَ ٱلَّذِينَ هُمْ عِبَٰدُ ٱلرَّحْمَٰنِ إِنَٰثًا أَشَهِدُوا۟ خَلْقَهُمْ سَتُكْتَبُ شَهَٰدَتُهُمْ وَيُسْـَٔلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "They have designated the angels as female, those who are in the presence of the All-Merciful! Were they present to witness their creation? Their testimony will be recorded and they will be asked about it!",
        "TRANSLATION_1": "Yet they have made the angels, who are creatures of Ar-Rahman, females. Did they witness their creation? We shall record their testimony, and they will be interrogated.\n",
        "TRANSLATION_2": "They claim that angels, who are Allah's chosen servants, are females. Did they witness how their body is constituted? Their testimony shall be written and they shall be called to account.\n",
        "TRANSLATION_3": "Do they say that the angels, who are the servants of the Beneficent God, are females? Have they witnessed their creation? Their words as such will be recorded and they will be questioned for it.\n",
        "TRANSLATION_4": "And they appoint the angels, who are the bondmen of the Most Gracious, as females; were they present at the time of the angels’ creation? Their declaration will be now recorded and they will be questioned.\n",
        "TRANSLATION_5": "And they make females the angels who themselves are servants of the Most Gracious. Did they witness their creation Their testimony will be recorded, and they will be questioned!\n",
        "TRANSLATION_6": "And they make the angels-- them who are the servants of the Beneficent Allah-- female (divinities). What! did they witness their creation? Their evidence shall be written down and they shall be questioned.\n",
        "TRANSLATION_7": "And they have made the angels, who are themselves servants of the All-merciful, females. What, did they witness their creation? Their witness shall be written down, and they shall be questioned.\n",
        "TRANSLATION_8": "And they make the angels, who are the slaves of the Beneficent, females. Did they witness their creation? Their testimony will be recorded and they will be questioned.\n",
        "TRANSLATION_9": "They consider the angels, God's servants, to be female. Did they witness their creation? Their claim will be put on record and they will be questioned about it.\n",
        "TRANSLATION_10": "And they make the angels who are the bondmen of the Compassionate females. Have they witnessed their creation? Their testimony will be written down, and they will be questioned.\n",
        "TRANSLATION_11": "They have made the angels—who are servants of the All-beneficent—females. Were they witness to their creation? Their testimony will be written down and they shall be questioned.\n",
        "TRANSLATION_12": "And they make into females angels who themselves serve Allah. Did they witness their creation? Their evidence will be recorded, and they will be called to account!\n",
        "TRANSLATION_13": "And they make the angels who themselves are slaves to the Most Beneficent (Allah) females. Did they witness their creation? Their evidence will be recorded, and they will be questioned!\n",
        "TRANSLATION_14": "They claim that the angels, who are themselves the worshipers of the Merciful, are females. Did they witness their creation! Their witness shall be written down and they shall be questioned.\n",
        "TRANSLATION_15": "And they appoint the angels, who are servants to the Most Gracious, as females. Have they witnessed their creation? Their claim will be recorded, and they will be questioned.\n",
        "TRANSLATION_16": "And they have made the angels, who are servants of the Most Merciful, females. Did they witness their creation? Their testimony will be recorded, and they will be questioned.\n",
        "TRANSLATION_17": "[43:19] And they have made the angels, who are themselves servants of the Compassionate One, females. Did they witness, were they present at, their creation? Their testimony, to the effect that they are females, will be written down and they will be questioned, about it in the Hereafter, wherefore punishment will ensue for them.\n",
        "TRANSLATION_18": "(And they make the angels, who are the slaves of the Beneficent, females) the daughters of Allah. (Did they witness their creation) when they were created for them to know that they are females? They said: \"no, Muhammad, we did not witness their creation but we heard our fathers saying so\". Allah will say: \"0 Muhammad!\" (Their testimony will be recorded) that they lie against Allah when they claim that the angels are Allah's daughters (and they will be questioned) about this claim on the Day of Judgement. In other words, when they claimed that the angels are Allah's daughters, they were asked: \"did you witness their creation?\" They said: \"No!\" \"How did you then come to the conclusion that the angels are females and Allah's daughters?\" They said: \"We heard this from our fathers\". Allah said that their claim about the angels will be recorded and they will be questioned about it on the Day of Judgement.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "43:19",
            "25:63",
            "37:150",
            "53:27",
            "59:22",
            "27:59",
            "9:104",
            "21:26",
            "17:40",
            "13:8"
        ],
        "BIBLE": [
            "writings:daniel:2:9",
            "prophets:i%20samuel:28:15",
            "prophets:jeremiah:27:7",
            "writings:daniel:8:19",
            "writings:daniel:3:28",
            "prophets:i%20kings:2:42",
            "prophets:judges:16:25",
            "writings:job:10:2",
            "prophets:isaiah:48:15",
            "prophets:ezekiel:12:23"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:1:12",
            "Sefer%20Yetzirah:3:4"
        ]
    }
}