{
    "VERSE": "43:22",
    "ARABIC": "بَلْ قَالُوٓا۟ إِنَّا وَجَدْنَآ ءَابَآءَنَا عَلَىٰٓ أُمَّةٍ وَإِنَّا عَلَىٰٓ ءَاثَٰرِهِم مُّهْتَدُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "No, in fact they say, 'We found our fathers following a religion and we are simply guided in their footsteps.'",
        "TRANSLATION_1": "In fact they say: \"We found our fathers following a certain way, and are guided by their footprints.\"\n",
        "TRANSLATION_2": "Nay; they simply claim: “We found our forefathers on a way, and we continue to find guidance in their footsteps.”\n",
        "TRANSLATION_3": "In fact, they say, \"We found our fathers following a certain belief and we now follow in their footsteps for our guidance\".\n",
        "TRANSLATION_4": "Rather they said, “We found our forefathers upon a religion, and we are following their footsteps.”\n",
        "TRANSLATION_5": "Nay! They say: \"We found our fathers following a certain way and religion, and we guide ourselves by their footsteps.\"\n",
        "TRANSLATION_6": "Nay! they say: We found our fathers on a course, and surely we are guided by their footsteps.\n",
        "TRANSLATION_7": "Nay, but they say, 'We found our fathers upon a community, and we are guided upon their traces.'\n",
        "TRANSLATION_8": "Nay, for they say only: Lo! we found our fathers following a religion, and we are guided by their footprints.\n",
        "TRANSLATION_9": "No indeed! They say, \"We have found our fathers following a certain course, and we are guided by their footsteps.\"\n",
        "TRANSLATION_10": "Nay! they say: verily we have found our fathers on a certain way, and verily by their footsteps we are guided.\n",
        "TRANSLATION_11": "No, they said, ‘We found our fathers following a creed, and we are indeed guided in their footsteps.’\n",
        "TRANSLATION_12": "Nay! they say: \"We found our fathers following a certain religion, and we do guide ourselves by their footsteps.\"\n",
        "TRANSLATION_13": "Nay! They say: \"We found our fathers following a certain way and religion, and we guide ourselves by their footsteps.\"\n",
        "TRANSLATION_14": "No, but they say: 'We found our fathers following a creed, and by following in their footsteps we are guided.\n",
        "TRANSLATION_15": "But they say, “We found our parents on a course, and we are guided in their footsteps.”\n",
        "TRANSLATION_16": "Rather, they say, \"Indeed, we found our fathers upon a religion, and we are in their footsteps [rightly] guided.\"\n",
        "TRANSLATION_17": "[43:22] Nay, but they say, ‘Lo! we found our fathers following a [certain] creed and we are indeed, proceeding, in their footsteps to be guided’, by them, for they used to worship other than God.\n",
        "TRANSLATION_18": "They said: \"We do not have, Muhammad, any other Scripture; but we found our fathers on this belief\". Allah said: (Nay, for they say only: Lo! we found our fathers following a religion, and we are guided by their footprints) and we are following their religion and actions.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "43:22",
            "43:23",
            "37:69",
            "26:74",
            "21:53",
            "80:35",
            "37:70",
            "12:61",
            "36:12",
            "26:86"
        ],
        "BIBLE": [
            "prophets:ii%20kings:6:19",
            "prophets:jeremiah:3:19",
            "torah:genesis:31:5",
            "prophets:jeremiah:50:7",
            "prophets:jeremiah:5:4",
            "prophets:judges:2:19",
            "torah:genesis:37:32",
            "prophets:i%20kings:18:18",
            "prophets:i%20kings:19:20",
            "prophets:zechariah:1:4"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:13",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:2:1"
        ]
    }
}