{
    "VERSE": "43:26",
    "ARABIC": "وَإِذْ قَالَ إِبْرَٰهِيمُ لِأَبِيهِ وَقَوْمِهِۦٓ إِنَّنِى بَرَآءٌ مِّمَّا تَعْبُدُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "When Ibrahim said to his father and his people, 'I am free of everything you worship,",
        "TRANSLATION_1": "When Abraham said to his father and his people: \"I am rid of what you worship\n",
        "TRANSLATION_2": "Call to mind when Abraham said to his father and his people: “I totally disown all whom you serve\n",
        "TRANSLATION_3": "When Abraham said to his father and his people, \"I boldly renounce what you worship\n",
        "TRANSLATION_4": "And when Ibrahim said to his father and his people, “I have no relation whatsoever with your deities.”\n",
        "TRANSLATION_5": "And (remember) when Ibrahim said to his father and his people: \"Verily, I am innocent of what you worship,\"\n",
        "TRANSLATION_6": "And when Ibrahim said to his father and his people: Surely I am clear of what you worship,\n",
        "TRANSLATION_7": "And when Abraham said to his father and his people, 'Surely I am quit of that you serve,\n",
        "TRANSLATION_8": "And when Abraham said unto his father and his folk: Lo! I am innocent of what ye worship\n",
        "TRANSLATION_9": "Call to mind when Abraham said to his father and his people, \"I disown utterly that which you worship.\n",
        "TRANSLATION_10": "And recall what time Ibrahim said Unto his father and his people: verily I am quit of that which ye worship.\n",
        "TRANSLATION_11": "When Abraham said to his father and his people, ‘I repudiate what you worship,\n",
        "TRANSLATION_12": "Behold! Abraham said to his father and his people: \"I do indeed clear myself of what ye worship:\n",
        "TRANSLATION_13": "And (remember) when Ibrahim (Abraham) said to his father and his people: \"Verily, I am innocent of what you worship,\n",
        "TRANSLATION_14": "(Remember) when Abraham, said to his father and his nation: 'I am quit from what you worship,\n",
        "TRANSLATION_15": "When Abraham said to his father and his people, “I am innocent of what you worship.\n",
        "TRANSLATION_16": "And [mention, O Muhammad], when Abraham said to his father and his people, \"Indeed, I am disassociated from that which you worship\n",
        "TRANSLATION_17": "[43:26] And, mention, when Abraham said to his father and his people, ‘Surely I am innocent of that which you   worship,\n",
        "TRANSLATION_18": "(And when Abraham said unto his father) Azar (and his folk) when He was sent to them: (Lo! I am innocent of what ye worship\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "43:26",
            "26:70",
            "37:85",
            "21:52",
            "28:25",
            "26:86",
            "6:74",
            "43:44",
            "12:9",
            "6:78"
        ],
        "BIBLE": [
            "prophets:joshua:24:2",
            "torah:exodus:12:31",
            "torah:genesis:17:5",
            "prophets:isaiah:51:2",
            "torah:exodus:9:27",
            "prophets:isaiah:49:1",
            "prophets:hosea:1:9",
            "prophets:judges:16:28",
            "torah:genesis:22:11",
            "prophets:joshua:24:21"
        ]
    }
}