{
    "VERSE": "43:27",
    "ARABIC": "إِلَّا ٱلَّذِى فَطَرَنِى فَإِنَّهُۥ سَيَهْدِينِ",
    "ENGLISH": {
        "TRANSLATION_0": "except for Him who brought me into being, Who will certainly guide me,'",
        "TRANSLATION_1": "Other than Him who created me. He will show me the right way.\"\n",
        "TRANSLATION_2": "except the One Who created me; and, behold, it is He Who will direct me to the Right Way.”\n",
        "TRANSLATION_3": "except for the One who has created me and will guide me\".\n",
        "TRANSLATION_4": "“Except Him Who has created me, for He will soon direct me.” (To my place of migration.)\n",
        "TRANSLATION_5": "Except Him Who created me; and verily, He will guide me.\"\n",
        "TRANSLATION_6": "Save Him Who created me, for surely He will guide me.\n",
        "TRANSLATION_7": "except Him who originated me; and He will guide me.\n",
        "TRANSLATION_8": "Save Him Who did create me, for He will surely guide me.\n",
        "TRANSLATION_9": "[I worship] only Him who created me, and He will certainly guide me,\"\n",
        "TRANSLATION_10": "Save Him Who hath created me, and then He would guide me.\n",
        "TRANSLATION_11": "excepting Him who originated me; indeed He will guide me.’\n",
        "TRANSLATION_12": "(I worship) only Him Who made me, and He will certainly guide me.\"\n",
        "TRANSLATION_13": "Except Him (i.e. I worship none but Allah Alone) Who did create me, and verily, He will guide me.\"\n",
        "TRANSLATION_14": "except Him who originated me, for He will guide me'\n",
        "TRANSLATION_15": "Except for He who created me, for He will guide me.”\n",
        "TRANSLATION_16": "Except for He who created me; and indeed, He will guide me.\"\n",
        "TRANSLATION_17": "[43:27] except Him Who originated, created, me; for He will indeed guide me’, He will show me the way to His religion.\n",
        "TRANSLATION_18": "567 Save Him Who did create me) except He Whom I worship, He Who created me, (for He will surely guide me) He will preserve me on His religion and obedience.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "43:27",
            "26:78",
            "85:13",
            "74:18",
            "82:7",
            "26:79",
            "87:2",
            "26:81",
            "80:21",
            "69:30"
        ],
        "BIBLE": [
            "torah:exodus:23:20",
            "prophets:zephaniah:2:11",
            "writings:proverbs:8:2",
            "torah:genesis:28:17",
            "prophets:jeremiah:14:13",
            "prophets:ezekiel:26:5",
            "prophets:ezekiel:21:35",
            "torah:genesis:38:21",
            "torah:deuteronomy:23:17",
            "torah:genesis:19:13"
        ]
    }
}