{
    "VERSE": "43:3",
    "ARABIC": "إِنَّا جَعَلْنَٰهُ قُرْءَٰنًا عَرَبِيًّا لَّعَلَّكُمْ تَعْقِلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "We have made it an Arabic Qur'an so that hopefully you will use your intellect.",
        "TRANSLATION_1": "That We made it a distinctly lucid Qur'an that you may understand.\n",
        "TRANSLATION_2": "verily We have made it an Arabic Qur'an that you may understand.\n",
        "TRANSLATION_3": "We have made it an Arabic reading text so that perhaps you may understand.\n",
        "TRANSLATION_4": "We have indeed sent it as a Qur’an in the Arabic language, so that you may understand.\n",
        "TRANSLATION_5": "Verily, We have made it a Qur'an in Arabic that you may be able to understand.\n",
        "TRANSLATION_6": "Surely We have made it an Arabic Quran that you may understand.\n",
        "TRANSLATION_7": "behold, We have made it an Arabic Koran; haply you will understand;\n",
        "TRANSLATION_8": "Lo! We have appointed it a Lecture, in Arabic that haply ye may understand.\n",
        "TRANSLATION_9": "We have made it an Arabic Quran so that you may understand.\n",
        "TRANSLATION_10": "Verily We! We have made it an Arabic Qur'an that haply ye may reflect.\n",
        "TRANSLATION_11": "We have made it an Arabic Quran so that you may exercise your reason,\n",
        "TRANSLATION_12": "We have made it a Qur'an in Arabic, that ye may be able to understand (and learn wisdom).\n",
        "TRANSLATION_13": "We verily, have made it a Quran in Arabic, that you may be able to understand (its meanings and its admonitions).\n",
        "TRANSLATION_14": "We have made it an Arabic Koran in order that you understand.\n",
        "TRANSLATION_15": "We made it an Arabic Quran, so that you may understand.\n",
        "TRANSLATION_16": "Indeed, We have made it an Arabic Qur'an that you might understand.\n",
        "TRANSLATION_17": "[43:3] Lo! We have made it, We have brought the Book into existence [as], an Arabic Qur’ān, in the language of the Arabs, that perhaps you, O people of Mecca, may understand, [that you may] comprehend its meanings.\n",
        "TRANSLATION_18": "(Lo! We have appointed it) We have spoken it, i.e. the Qur'an (a Lecture in Arabic) in the Arabic usage, hence the oath, (that haply ye may understand) so that you may know what is in the Qur'an of the lawful and unlawful, commands and prohibitions.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "43:3",
            "12:2",
            "20:113",
            "39:28",
            "76:23",
            "41:3",
            "56:77",
            "55:2",
            "75:17",
            "41:26"
        ],
        "BIBLE": [
            "writings:nehemiah:8:8",
            "torah:deuteronomy:4:6",
            "writings:job:28:28",
            "writings:job:12:13",
            "writings:proverbs:23:23",
            "writings:proverbs:9:10",
            "prophets:ezekiel:3:6",
            "writings:psalms:119:71",
            "writings:psalms:111:10",
            "prophets:isaiah:11:2"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:2"
        ]
    }
}