{
    "VERSE": "43:30",
    "ARABIC": "وَلَمَّا جَآءَهُمُ ٱلْحَقُّ قَالُوا۟ هَٰذَا سِحْرٌ وَإِنَّا بِهِۦ كَٰفِرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "But when the truth came to them they said, 'This is magic and we reject it.'",
        "TRANSLATION_1": "Yet when the truth had come to them, they said: \"This is sorcery. We shall never believe in it.\"\n",
        "TRANSLATION_2": "And when the Truth came to them they said: “This is just sorcery and we reject it.”\n",
        "TRANSLATION_3": "When the truth came to them, they said, \"This is magic and we have no faith in it\".\n",
        "TRANSLATION_4": "And when the truth came to them they said, “This is magic, and we disbelieve in it.”\n",
        "TRANSLATION_5": "And when the truth came to them, they said: \"This is magic, and we disbelieve therein.\"\n",
        "TRANSLATION_6": "And when there came to them the truth they said: This is magic, and surely we are disbelievers in it.\n",
        "TRANSLATION_7": "And when the truth came to them, they said, 'This is a sorcery, and in it we are unbelievers.'\n",
        "TRANSLATION_8": "And now that the Truth hath come unto them they say: This is mere magic, and lo! we are disbelievers therein.\n",
        "TRANSLATION_9": "but when the truth came to them, they said, \"This is sorcery, and we reject it.\"\n",
        "TRANSLATION_10": "And when the truth cometh Unto them, they say this is magic, and verily we are therein disbelievers.\n",
        "TRANSLATION_11": "But when the truth came to them, they said, ‘This is magic, and we indeed disbelieve in it.’\n",
        "TRANSLATION_12": "But when the Truth came to them, they said: \"This is sorcery, and we do reject it.\"\n",
        "TRANSLATION_13": "And when the truth (this Quran) came to them, they (the disbelievers in this Quran) said: \"This is magic, and we disbelieve therein.\"\n",
        "TRANSLATION_14": "But when the truth came to them, they said: 'This is sorcery, we disbelieve in it'\n",
        "TRANSLATION_15": "But when the truth came to them, they said, “This is sorcery, and we refuse to believe in it.”\n",
        "TRANSLATION_16": "But when the truth came to them, they said, \"This is magic, and indeed we are, concerning it, disbelievers.\"\n",
        "TRANSLATION_17": "[43:30] But when the truth, the Qur’ān, came to them, they said, ‘This is sorcery, and we are indeed disbelievers in it’.\n",
        "TRANSLATION_18": "(And now that the Truth) the Scripture and Messenger (hath come unto them they say: This) i.e. this Scripture (is mere magic) is a mere lie, (and lo! we are disbelievers therein) in Muhammad (pbuh) and the Qur'an.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "43:30",
            "10:77",
            "10:76",
            "23:90",
            "15:64",
            "46:7",
            "51:18",
            "28:53",
            "37:37",
            "21:55"
        ],
        "BIBLE": [
            "torah:exodus:2:18",
            "prophets:judges:21:5",
            "torah:exodus:3:13",
            "prophets:i%20kings:11:2",
            "prophets:ezekiel:24:20",
            "torah:numbers:22:20",
            "prophets:joshua:9:8",
            "torah:genesis:26:32",
            "prophets:isaiah:28:15",
            "writings:psalms:52:2"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:2:2",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:2:1"
        ]
    }
}