{
    "VERSE": "43:31",
    "ARABIC": "وَقَالُوا۟ لَوْلَا نُزِّلَ هَٰذَا ٱلْقُرْءَانُ عَلَىٰ رَجُلٍ مِّنَ ٱلْقَرْيَتَيْنِ عَظِيمٍ",
    "ENGLISH": {
        "TRANSLATION_0": "They say, 'Why was this Qur'an not sent down to one of the great men of the two cities?'",
        "TRANSLATION_1": "They also said: \"Why was this Qur'an not sent down to some great man of the two cities?\"\n",
        "TRANSLATION_2": "They say: “Why was this Qur'an not sent down upon some great man from the two (main) cities?”\n",
        "TRANSLATION_3": "Then they said, \"Why this Quran had not been revealed to a man from either of the two great towns\".\n",
        "TRANSLATION_4": "And they said, “Why was the Qur’an not sent down upon some chieftain of these two great towns?” (The chiefs of Mecca and Taif).\n",
        "TRANSLATION_5": "And they say: \"Why is not this Qur'an sent down to some great man of the two towns\"\n",
        "TRANSLATION_6": "And they say: Why was not this Quran revealed to a man of importance in the two towns?\n",
        "TRANSLATION_7": "They say, 'Why was this Koran not sent down upon some man of moment in the two cities?'\n",
        "TRANSLATION_8": "And they say: If only this Qur'an had been revealed to some great man of the two towns?\n",
        "TRANSLATION_9": "They said, \"Why was this Quran not sent down to one of the great men of the two cities?\"\n",
        "TRANSLATION_10": "And they say: wherefore hath not this Qur'an been revealed to a man of the two cities who was great.\n",
        "TRANSLATION_11": "And they said, ‘Why was not this Quran sent down to some great man from the two cities?’\n",
        "TRANSLATION_12": "Also, they say: \"Why is not this Qur'an sent down to some leading man in either of the two (chief) cities?\"\n",
        "TRANSLATION_13": "And they say: \"Why is not this Quran sent down to some great man of the two towns (Makkah and Ta'if)?\"\n",
        "TRANSLATION_14": "They also said: 'Why was this Koran not sent down to a great man from the two Villages'\n",
        "TRANSLATION_15": "They also said, “If only this Quran was sent down to a man of importance from the two cities.”\n",
        "TRANSLATION_16": "And they said, \"Why was this Qur'an not sent down upon a great man from [one of] the two cities?\"\n",
        "TRANSLATION_17": "[43:31] And they said, ‘If only this Qur’ān had been revealed to some great man from, the inhabitants of, the two towns!’, in other words, from either of the two; such as al-Walīd b. al-Mughīra at Mecca or ‘Urwa b. Mas‘ūd al-Thaqafī at Tā’if.\n",
        "TRANSLATION_18": "(And they) i.e. the people of Mecca: al-Walid and his host (say: If only this Qur'an had been revealed to some great man of the two towns) i.e. to al-Walid Ibn al-Mughirah and Abu Mas'ud al-Thaqafi from Mecca and Ta'if respectively?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "43:31",
            "15:87",
            "73:4",
            "84:21",
            "56:46",
            "37:76",
            "5:9",
            "29:34",
            "76:23",
            "3:172"
        ],
        "BIBLE": [
            "writings:job:31:31",
            "writings:ecclesiastes:2:21",
            "prophets:ii%20kings:2:17",
            "torah:genesis:38:21",
            "prophets:jeremiah:22:8",
            "prophets:zechariah:1:10",
            "torah:genesis:6:3",
            "prophets:ii%20samuel:19:23",
            "prophets:i%20kings:1:6",
            "prophets:jeremiah:38:4"
        ]
    }
}