{
    "VERSE": "43:37",
    "ARABIC": "وَإِنَّهُمْ لَيَصُدُّونَهُمْ عَنِ ٱلسَّبِيلِ وَيَحْسَبُونَ أَنَّهُم مُّهْتَدُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "they debar them from the path, yet they still think they are guided -",
        "TRANSLATION_1": "Surely the (devils) obstruct them from the path, though they think they are rightly guided, --\n",
        "TRANSLATION_2": "and these satans hinder them from the Right Path, while he still reckons himself to be rightly-guided.\n",
        "TRANSLATION_3": "Satan will prevent them from the right path while they think that they have the right guidance.\n",
        "TRANSLATION_4": "And indeed those devils prevent them from the Straight Path, and they think they are on guidance!\n",
        "TRANSLATION_5": "And verily, they hinder them from the path, but they think that they are guided aright!\n",
        "TRANSLATION_6": "And most surely they turn them away from the path, and they think that they are guided aright:\n",
        "TRANSLATION_7": "and they bar them from the way, and they think they are guided,\n",
        "TRANSLATION_8": "And lo! they surely turn them from the way of Allah, and yet they deem that they are rightly guided;\n",
        "TRANSLATION_9": "Devils divert men from the [right] way, while they think that they are rightly guided.\n",
        "TRANSLATION_10": "And verily they hinder them from the way, whilst they deem that they are rightly guided.\n",
        "TRANSLATION_11": "Indeed they bar them from the way [of Allah], while they suppose that they are [rightly] guided.\n",
        "TRANSLATION_12": "Such (evil ones) really hinder them from the Path, but they think that they are being guided aright!\n",
        "TRANSLATION_13": "And verily, they (Satans / devils) hinder them from the Path (of Allah), but they think that they are guided aright!\n",
        "TRANSLATION_14": "and they bar them from the Way, though they themselves think that they are guided.\n",
        "TRANSLATION_15": "They hinder them from the path, though they think they are guided.\n",
        "TRANSLATION_16": "And indeed, the devils avert them from the way [of guidance] while they think that they are [rightly] guided\n",
        "TRANSLATION_17": "[43:37] And indeed they, that is, the devils, bar them, the blind, from the way, [from] the path of guidance, while they suppose that they are [rightly] guided (the plural [muhtadūna] takes into account the [potentially plural] sense of man, ‘whoever’, [of the previous verse]),\n",
        "TRANSLATION_18": "(And lo! They) i.e. the devils (surely turn them from the way of Allah) from the Truth and guidance, (and yet they deem that they are rightly guided) to the Truth and guidance;\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "43:37",
            "15:76",
            "29:69",
            "80:20",
            "15:9",
            "15:23",
            "6:117",
            "76:3",
            "17:32",
            "37:137"
        ],
        "BIBLE": [
            "prophets:jeremiah:26:3",
            "writings:lamentations:3:35",
            "prophets:jonah:3:8",
            "torah:deuteronomy:31:29",
            "prophets:isaiah:53:6",
            "writings:ii%20chronicles:34:2",
            "prophets:i%20samuel:10:6",
            "prophets:i%20samuel:6:12",
            "writings:psalms:119:59",
            "prophets:joshua:8:20"
        ]
    }
}