{
    "VERSE": "43:4",
    "ARABIC": "وَإِنَّهُۥ فِىٓ أُمِّ ٱلْكِتَٰبِ لَدَيْنَا لَعَلِىٌّ حَكِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "It is in the Source Book with Us, high-exalted, full of wisdom.",
        "TRANSLATION_1": "It is inscribed in the original Book (of Books) with Us, sublime, dispenser of (all) laws.\n",
        "TRANSLATION_2": "Indeed it is transcribed in the Original Book with Us; sublime and full of wisdom.\n",
        "TRANSLATION_3": "It (the Quran) exists in the original Book with Us which is certainly Most Exalted, full of wisdom and (beyond linguistic structures).\n",
        "TRANSLATION_4": "And the Qur’an is undoubtedly, in the Original Book with Us, surely the exalted, full of wisdom.\n",
        "TRANSLATION_5": "And verily, it is in the Mother of the Book with Us, indeed exalted, full of wisdom.\n",
        "TRANSLATION_6": "And surely it is in the original of the Book with Us, truly elevated, full of wisdom.\n",
        "TRANSLATION_7": "and behold, it is in the Essence of the Book, with Us; sublime indeed, wise.\n",
        "TRANSLATION_8": "And Lo! in the Source of Decrees, which We possess, it is indeed sublime, decisive.\n",
        "TRANSLATION_9": "Truly, it is inscribed in the Original Book, in Our keeping; it is sublime and full of wisdom.\n",
        "TRANSLATION_10": "And verily it is, in the Original Book before Us, indeed exalted.\n",
        "TRANSLATION_11": "and it is sublime and wise with Us in the Mother Book.\n",
        "TRANSLATION_12": "And verily, it is in the Mother of the Book, in Our Presence, high (in dignity), full of wisdom.\n",
        "TRANSLATION_13": "And Verily, it (this Quran) is in the Mother of the Book (i.e. Al-Lauh Al-Mahfuz), before Us, indeed Exalted, full of Wisdom.\n",
        "TRANSLATION_14": "It is in the Origin of the Book with Us, sublime and wise.\n",
        "TRANSLATION_15": "And it is with Us, in the Source Book, sublime and wise.\n",
        "TRANSLATION_16": "And indeed it is, in the Mother of the Book with Us, exalted and full of wisdom.\n",
        "TRANSLATION_17": "[43:4] And it is indeed, fixed, in the Mother Book, the source of all the scriptures, namely, the Preserved Tablet, [which is] with Us (ladaynā substitutes [for fī ummi’l-kitābi, ‘in the Mother Book’]) [and it is] indeed exalted, above [all] the scriptures [that came] before it, wise, containing excellent wisdoms.\n",
        "TRANSLATION_18": "(And lo! in the Source of Decrees) in the Guarded Tablet, (which We possess) where it is written, (it) i.e. the Qur'an (is indeed sublime) exalted, noble and glorious, (decisive) in explaining the lawful and the unlawful,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "43:4",
            "83:18",
            "2:129",
            "13:39",
            "3:48",
            "17:4",
            "62:2",
            "45:16",
            "46:2",
            "41:41"
        ],
        "BIBLE": [
            "writings:song%20of%20songs:1:6",
            "prophets:amos:2:4",
            "writings:nehemiah:8:18",
            "prophets:ii%20kings:23:21",
            "writings:nehemiah:9:34",
            "prophets:ezekiel:18:9",
            "writings:nehemiah:8:3",
            "prophets:ezekiel:18:19",
            "torah:genesis:26:5",
            "writings:ii%20chronicles:25:4"
        ]
    }
}