{
    "VERSE": "43:41",
    "ARABIC": "فَإِمَّا نَذْهَبَنَّ بِكَ فَإِنَّا مِنْهُم مُّنتَقِمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Either We will extricate you and take revenge on them",
        "TRANSLATION_1": "We shall punish them whether We take you away,\n",
        "TRANSLATION_2": "We shall inflict retribution on them, whether We take you away from the world (before We do that),\n",
        "TRANSLATION_3": "We shall revenge them either after your death\n",
        "TRANSLATION_4": "So if We take you away, We shall then indeed take revenge from them.\n",
        "TRANSLATION_5": "And even if We take you away, We shall indeed take vengeance on them.\n",
        "TRANSLATION_6": "But if We should take you away, still We shall inflict retribution on them;\n",
        "TRANSLATION_7": "Whether We take thee away, We shall take vengeance upon them,\n",
        "TRANSLATION_8": "And if We take thee away, We surely shall take vengeance on them,\n",
        "TRANSLATION_9": "Even if We take you away from the world, We shall surely take vengeance on them\n",
        "TRANSLATION_10": "And if We take thee away. We shall surely take vengeance on them.\n",
        "TRANSLATION_11": "We will indeed take vengeance on them, whether We take you away\n",
        "TRANSLATION_12": "Even if We take thee away, We shall be sure to exact retribution from them,\n",
        "TRANSLATION_13": "And even if We take you (O Muhammad SAW) away, We shall indeed take vengeance on them.\n",
        "TRANSLATION_14": "Even if We take you away, We shall take vengeance upon them,\n",
        "TRANSLATION_15": "Even if We take you away, We will wreak vengeance upon them.\n",
        "TRANSLATION_16": "And whether [or not] We take you away [in death], indeed, We will take retribution upon them.\n",
        "TRANSLATION_17": "[43:41] So if (fa-immā: the conditional particle in has been assimilated herein with an extra mā) We take you away, by making you die before chastising them, then We will take vengeance on them, in the Hereafter;\n",
        "TRANSLATION_18": "(And if We take thee away) if We make you die, (We surely shall take vengeance on them) by punishing them,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "43:41",
            "43:42",
            "15:79",
            "32:30",
            "44:59",
            "23:48",
            "37:127",
            "69:49",
            "68:26",
            "37:32"
        ],
        "BIBLE": [
            "prophets:isaiah:45:17",
            "torah:numbers:35:31",
            "prophets:hosea:13:14",
            "prophets:jeremiah:5:9",
            "prophets:jeremiah:9:8",
            "prophets:jeremiah:5:29",
            "torah:numbers:35:19",
            "prophets:ii%20samuel:17:3",
            "torah:deuteronomy:22:26",
            "writings:psalms:6:6"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:3:7",
            "Sefer%20Yetzirah:3:6",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:3:5",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:7"
        ]
    }
}