{
    "VERSE": "43:42",
    "ARABIC": "أَوْ نُرِيَنَّكَ ٱلَّذِى وَعَدْنَٰهُمْ فَإِنَّا عَلَيْهِم مُّقْتَدِرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "or let you see what We have promised them. They are completely in Our power.",
        "TRANSLATION_1": "Or show you some of what We have promised them. They are certainly well within Our power.\n",
        "TRANSLATION_2": "or make you see the end that We had promised them, for We have full power over them.\n",
        "TRANSLATION_3": "or show them to you suffering the torment with which We had threatened them. We are certainly dominant over them all.\n",
        "TRANSLATION_4": "Or show you what We have promised them – We therefore have complete control over them.\n",
        "TRANSLATION_5": "Or (if) We show you that wherewith We threaten them, then verily, We have perfect command over them.\n",
        "TRANSLATION_6": "Rather We will certainly show you that which We have promised them; for surely We are the possessors of full power over them.\n",
        "TRANSLATION_7": "or We show thee a part of that We promised them, surely We have power over them.\n",
        "TRANSLATION_8": "Or (if) We show thee that wherewith We threaten them; for lo! We have complete command of them.\n",
        "TRANSLATION_9": "or We shall show you what We have promised them; for surely We have complete power over them.\n",
        "TRANSLATION_10": "Or if We shew thee that wherewith We threaten them, verily We are going to prevail over them.\n",
        "TRANSLATION_11": "or show you what We have promised them, for indeed We hold them in Our power.\n",
        "TRANSLATION_12": "Or We shall show thee that (accomplished) which We have promised them: for verily We shall prevail over them.\n",
        "TRANSLATION_13": "Or (if) We show you that wherewith We threaten them, then verily, We have perfect command over them.\n",
        "TRANSLATION_14": "or We show you a part of that which We have promised them, for indeed We have power over them.\n",
        "TRANSLATION_15": "Or show you what We have promised them; for We have absolute power over them.\n",
        "TRANSLATION_16": "Or whether [or not] We show you that which We have promised them, indeed, We are Perfect in Ability.\n",
        "TRANSLATION_17": "[43:42] or We show you, during your lifetime, that which We have promised them, in the way of chastisement, for surely We have power over, [surely] We are able to chastise, them.\n",
        "TRANSLATION_18": "(Or (if) We show thee that wherewith We threaten them) on the Day of Badr; (for lo! We have complete command of them) We are able to punish them before your death and after it.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "43:42",
            "23:95",
            "43:41",
            "13:40",
            "36:76",
            "7:6",
            "32:30",
            "7:76",
            "88:26",
            "15:6"
        ],
        "BIBLE": [
            "torah:leviticus:20:25",
            "prophets:jeremiah:4:27",
            "prophets:jeremiah:30:11",
            "torah:leviticus:25:46",
            "prophets:jeremiah:5:18",
            "prophets:i%20samuel:9:27",
            "torah:genesis:21:18",
            "writings:job:11:3",
            "writings:daniel:8:19",
            "prophets:nahum:1:9"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:1:3"
        ]
    }
}