{
    "VERSE": "43:43",
    "ARABIC": "فَٱسْتَمْسِكْ بِٱلَّذِىٓ أُوحِىَ إِلَيْكَ إِنَّكَ عَلَىٰ صِرَٰطٍ مُّسْتَقِيمٍ",
    "ENGLISH": {
        "TRANSLATION_0": "So hold fast to what has been revealed to you. You are on a straight path.",
        "TRANSLATION_1": "So hold fast to what has been revealed to you. You are truly on the right path.\n",
        "TRANSLATION_2": "So hold fast to what has been revealed to you. Surely you are on the Straight Way.\n",
        "TRANSLATION_3": "Follow devotedly that which is revealed to you. You are certainly on the right path.\n",
        "TRANSLATION_4": "Therefore hold fast to what We have divinely revealed to you; indeed you are upon the Straight Path. (The Holy Prophets can never go astray).\n",
        "TRANSLATION_5": "So hold you fast to that which is revealed to you. Verily, you are on the straight path.\n",
        "TRANSLATION_6": "Therefore hold fast to that which has been revealed to you; surely you are on the right path.\n",
        "TRANSLATION_7": "So hold thou fast unto that which has been revealed unto thee; surely thou art upon a straight path.\n",
        "TRANSLATION_8": "So hold thou fast to that which is inspired in thee. Lo! thou art on a right path.\n",
        "TRANSLATION_9": "So, hold fast to the Book that has been revealed to you, you are surely on the right path,\n",
        "TRANSLATION_10": "Hold thou fast wherefore to that which is revealed Unto thee: verily thou art on the straight path. s\n",
        "TRANSLATION_11": "So hold fast to what has been revealed to you. Indeed, you are on a straight path.\n",
        "TRANSLATION_12": "So hold thou fast to the Revelation sent down to thee; verily thou art on a Straight Way.\n",
        "TRANSLATION_13": "So hold you (O Muhammad SAW) fast to that which is inspired in you. Verily, you are on a Straight Path.\n",
        "TRANSLATION_14": "Therefore, hold fast to that which is revealed to you, indeed, you are on the Straight Path.\n",
        "TRANSLATION_15": "So adhere to what is revealed to you. You are upon a straight path.\n",
        "TRANSLATION_16": "So adhere to that which is revealed to you. Indeed, you are on a straight path.\n",
        "TRANSLATION_17": "[43:43] So hold fast to that which has been revealed to you, namely, the Qur’ān; surely you are on a straight path, [a straight] way.\n",
        "TRANSLATION_18": "(So hold thou fast to) act upon (that which is inspired in you) i.e. the Qur'an. (Lo! thou) Muhammad (art on a right path) are on an established religion with which Allah is pleased.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "43:43",
            "23:73",
            "7:16",
            "36:4",
            "15:41",
            "20:35",
            "1:7",
            "43:42",
            "23:74",
            "1:6"
        ],
        "BIBLE": [
            "prophets:i%20kings:2:9",
            "prophets:isaiah:64:11",
            "prophets:jeremiah:12:1",
            "prophets:ii%20samuel:20:2",
            "writings:job:23:11",
            "prophets:jeremiah:4:19",
            "torah:exodus:9:2",
            "writings:psalms:5:11",
            "prophets:isaiah:26:7",
            "prophets:isaiah:57:11"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:2:1"
        ]
    }
}