{
    "VERSE": "43:44",
    "ARABIC": "وَإِنَّهُۥ لَذِكْرٌ لَّكَ وَلِقَوْمِكَ وَسَوْفَ تُسْـَٔلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "It is certainly a reminder to you and to your people and you will be questioned.",
        "TRANSLATION_1": "It is a (source) of greatness for you and your people. You will surely be questioned about it.\n",
        "TRANSLATION_2": "Verily it is a great source of eminence for you and your people, and soon you will be called to account concerning that.\n",
        "TRANSLATION_3": "The Quran is a reminder to you and to your people and you will soon be questioned about it.\n",
        "TRANSLATION_4": "And it is undoubtedly an honour for you and your people; and you will soon be questioned.\n",
        "TRANSLATION_5": "And verily, this is indeed a Dhikr for you and your people, and you will be questioned.\n",
        "TRANSLATION_6": "And most surely it is a reminder for you and your people, and you shall soon be questioned.\n",
        "TRANSLATION_7": "Surely it is a Reminder to thee and to thy people; and assuredly you will be questioned.\n",
        "TRANSLATION_8": "And lo! it is in truth a Reminder for thee and for thy folk; and ye will be questioned.\n",
        "TRANSLATION_9": "it is certainly a reminder to you and to your people and you will soon be  called to account.\n",
        "TRANSLATION_10": "And verily it is an admonition Unto thee and thy people; and presently ye will be questioned.\n",
        "TRANSLATION_11": "Indeed it is a reminder for you and your people, and soon you will be questioned.\n",
        "TRANSLATION_12": "The (Qur'an) is indeed the message, for thee and for thy people; and soon shall ye (all) be brought to account.\n",
        "TRANSLATION_13": "And verily, this (the Quran) is indeed a Reminder for you (O Muhammad SAW) and your people (Quraish people, or your followers), and you will be questioned (about it).\n",
        "TRANSLATION_14": "It is indeed a Reminder to you and to your nation, and without doubt you shall be questioned.\n",
        "TRANSLATION_15": "It is a message for you, and for your people; and you will be questioned.\n",
        "TRANSLATION_16": "And indeed, it is a remembrance for you and your people, and you [all] are going to be questioned.\n",
        "TRANSLATION_17": "[43:44]   And it is indeed a Reminder, an honour, for you and for your people, as it has been revealed in their language. And you will [eventually] be questioned, about [the extent of] your fulfilling your duty towards it.\n",
        "TRANSLATION_18": "(And lo!) i.e. the Qur'an (is in truth a Reminder for thee) an honour for you (and for thy folk) the Quraysh because it is revealed in their own language; (and ye will be questioned) about the gratitude which is owed to such an honour.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "43:44",
            "15:62",
            "11:25",
            "51:32",
            "43:54",
            "20:79",
            "15:58",
            "26:70",
            "37:85",
            "40:32"
        ],
        "BIBLE": [
            "prophets:i%20kings:17:11",
            "torah:deuteronomy:28:10",
            "torah:genesis:20:9",
            "prophets:i%20samuel:19:7",
            "torah:exodus:19:3",
            "prophets:isaiah:62:12",
            "prophets:i%20samuel:29:6",
            "prophets:isaiah:49:1",
            "writings:i%20chronicles:7:23",
            "torah:genesis:17:5"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:1:13",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:7"
        ]
    }
}