{
    "VERSE": "43:47",
    "ARABIC": "فَلَمَّا جَآءَهُم بِـَٔايَٰتِنَآ إِذَا هُم مِّنْهَا يَضْحَكُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "But when he came to them with Our Signs, they merely laughed at them.",
        "TRANSLATION_1": "But when he brought to them Our signs they laughed at them,\n",
        "TRANSLATION_2": "Yet when he brought forth Clear Signs from Us, then lo, they burst into laughter.\n",
        "TRANSLATION_3": "When he showed them Our miracles, they started to laugh at them.\n",
        "TRANSLATION_4": "So when he brought Our signs to them, they started mocking at them!\n",
        "TRANSLATION_5": "But when he came to them with Our Ayat, behold, they laughed at them.\n",
        "TRANSLATION_6": "But when he came to them with Our signs, lo! they laughed at them.\n",
        "TRANSLATION_7": "But when he brought them Our signs, lo, they laughed at them.\n",
        "TRANSLATION_8": "But when he brought them Our tokens, behold! they laughed at them.\n",
        "TRANSLATION_9": "but when he came to them with Our signs, they ridiculed them,\n",
        "TRANSLATION_10": "Then when he came Unto them with Our signs, behold! at them they were laughing.\n",
        "TRANSLATION_11": "But when he brought them Our signs, they indeed laughed at them.\n",
        "TRANSLATION_12": "But when he came to them with Our Signs, behold they ridiculed them.\n",
        "TRANSLATION_13": "But when he came to them with Our Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) behold! They laughed at them.\n",
        "TRANSLATION_14": "But when he showed them Our signs they laughed at them,\n",
        "TRANSLATION_15": "But when he showed them Our signs, they started laughing at them.\n",
        "TRANSLATION_16": "But when he brought them Our signs, at once they laughed at them.\n",
        "TRANSLATION_17": "[43:47] But when he brought them Our signs, those proving his mission [from God], behold! they laughed at them.\n",
        "TRANSLATION_18": "(But when he) Moses (brought them Our tokens) the hand and the staff, (behold! they laughed at them) they were first amazed but then mocked these signs, refusing thus to believe in them.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "43:47",
            "15:81",
            "78:28",
            "37:14",
            "43:69",
            "21:12",
            "54:15",
            "32:24",
            "27:13",
            "26:15"
        ],
        "BIBLE": [
            "prophets:i%20kings:1:53",
            "prophets:ii%20kings:5:6",
            "torah:numbers:13:26",
            "torah:genesis:39:17",
            "prophets:ezekiel:47:1",
            "prophets:judges:16:18",
            "prophets:ezekiel:14:22",
            "torah:numbers:25:6",
            "prophets:isaiah:66:7",
            "prophets:i%20kings:9:28"
        ]
    }
}