{
    "VERSE": "43:5",
    "ARABIC": "أَفَنَضْرِبُ عَنكُمُ ٱلذِّكْرَ صَفْحًا أَن كُنتُمْ قَوْمًا مُّسْرِفِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Shall We then deprive you of the Reminder for being a profligate people?",
        "TRANSLATION_1": "Should We have withdrawn the Reminder from you as you are a people who exceed the bounds?\n",
        "TRANSLATION_2": "Should We divert this Good Counsel from you because you are a people immersed in extravagance?\n",
        "TRANSLATION_3": "Can We ignore sending you the Quran just because you are a transgressing people?\n",
        "TRANSLATION_4": "So shall We divert the advice away from you, because you are a nation that exceeds the limits?\n",
        "TRANSLATION_5": "Shall We then take away the Reminder from you, because you are a people excessive.\n",
        "TRANSLATION_6": "What! shall We then turn away the reminder from you altogether because you are an extravagant people?\n",
        "TRANSLATION_7": "Shall We turn away the Remembrance from you, for that you are a prodigal people?\n",
        "TRANSLATION_8": "Shall We utterly ignore you because ye are a wanton folk?\n",
        "TRANSLATION_9": "Should We withdraw the admonition from you because you are a people far gone in transgression?\n",
        "TRANSLATION_10": "Shall We then take away from you the Admonition because ye are a people extravagant?\n",
        "TRANSLATION_11": "Shall We keep back the Reminder from you and disregard you because you are an unrestrained lot?\n",
        "TRANSLATION_12": "Shall We then take away the Message from you and repel (you), for that ye are a people transgressing beyond bounds?\n",
        "TRANSLATION_13": "Shall We then (warn you not and) take away the Reminder (this Quran) from you, because you are a people Musrifun\n",
        "TRANSLATION_14": "Shall We turn away the Remembrance from you because you are a sinful nation?\n",
        "TRANSLATION_15": "Shall We hold back the Reminder from you, since you are a transgressing people?\n",
        "TRANSLATION_16": "Then should We turn the message away, disregarding you, because you are a transgressing people?\n",
        "TRANSLATION_17": "[43:5] Shall We turn away, [shall We] withhold, from you the Remembrance, the Qur’ān, utterly, an utter withholding, so that you are then neither commanded nor forbidden, because you are a profligate, an idolatrous, folk? No!\n",
        "TRANSLATION_18": "(Shall We utterly ignore you) shall We remove from you, people of Mecca, the revelation and the Messenger? Or shall We leave you uncared for, without commands or prohibitions (because ye are a wanton folk) because you are idolatrous folk who do not believe in Allah, as is in His foreknowledge?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "43:5",
            "27:54",
            "51:53",
            "37:124",
            "36:19",
            "15:62",
            "26:105",
            "26:160",
            "10:86",
            "26:11"
        ],
        "BIBLE": [
            "prophets:jeremiah:50:6",
            "prophets:isaiah:1:4",
            "writings:ii%20chronicles:12:12",
            "prophets:judges:2:17",
            "torah:deuteronomy:3:1",
            "prophets:i%20samuel:25:12",
            "prophets:ii%20kings:5:12",
            "writings:ii%20chronicles:6:42",
            "writings:lamentations:5:22",
            "prophets:ezekiel:18:30"
        ]
    }
}