{
    "VERSE": "43:50",
    "ARABIC": "فَلَمَّا كَشَفْنَا عَنْهُمُ ٱلْعَذَابَ إِذَا هُمْ يَنكُثُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "But when We removed the punishment from them, they immediately broke their word.",
        "TRANSLATION_1": "Yet no sooner did We take away the affliction from them than they broke their pledge.\n",
        "TRANSLATION_2": "But lo, each time We removed Our affliction from them, they would go back on their word.\n",
        "TRANSLATION_3": "When We relieved them from the torment they suddenly turned back on their heels.\n",
        "TRANSLATION_4": "So when We averted the calamity from them, they immediately broke the promise!\n",
        "TRANSLATION_5": "But when We removed the torment from them, behold, they broke their covenant.\n",
        "TRANSLATION_6": "But when We removed from them the chastisement, lo! they broke the pledge.\n",
        "TRANSLATION_7": "But when We removed from them the chastisement, behold, they broke their troth.\n",
        "TRANSLATION_8": "But when We eased them of the torment, behold! they broke their word.\n",
        "TRANSLATION_9": "but when We relieved them of the torment, they broke their word.\n",
        "TRANSLATION_10": "Then When We had removed from them the torment, behold they were breaking their promise.\n",
        "TRANSLATION_11": "But when We lifted the punishment from them, behold, they would break their pledge.\n",
        "TRANSLATION_12": "But when We removed the Penalty from them, behold, they broke their word.\n",
        "TRANSLATION_13": "But when We removed the torment from them, behold! They broke their covenant (that they will believe if We remove the torment for them).\n",
        "TRANSLATION_14": "But when We had relieved them of their punishment they broke their promise.\n",
        "TRANSLATION_15": "But when We lifted the torment from them, they immediately broke their promise.\n",
        "TRANSLATION_16": "But when We removed from them the affliction, at once they broke their word.\n",
        "TRANSLATION_17": "[43:50] But as soon as We relieved them, by the supplication of Moses, from the chastisement, behold! they had broken their pledge, reneging on their covenant and persisting in their disbelief.\n",
        "TRANSLATION_18": "(But when We eased them of the torment) when We removed the torment from them, (behold! they broke their word) they broke their undertaking and refused to believe.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "43:50",
            "23:64",
            "16:85",
            "37:33",
            "3:88",
            "2:162",
            "7:165",
            "44:12",
            "37:176",
            "26:204"
        ],
        "BIBLE": [
            "prophets:jeremiah:11:10",
            "torah:leviticus:13:20",
            "writings:lamentations:1:13",
            "writings:daniel:12:7",
            "torah:deuteronomy:31:20",
            "prophets:ezekiel:16:59",
            "torah:leviticus:13:25",
            "prophets:ezekiel:17:16",
            "writings:proverbs:6:15",
            "torah:numbers:15:31"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:4:7"
        ]
    }
}