{
    "VERSE": "43:53",
    "ARABIC": "فَلَوْلَآ أُلْقِىَ عَلَيْهِ أَسْوِرَةٌ مِّن ذَهَبٍ أَوْ جَآءَ مَعَهُ ٱلْمَلَٰٓئِكَةُ مُقْتَرِنِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Why have gold bracelets not been put upon his arms and why is there not a train of angels accompanying him?'",
        "TRANSLATION_1": "Why were then no bracelets of gold shed upon him from above, or angels sent down as a retinue with him?\"\n",
        "TRANSLATION_2": "Why were bracelets of gold not bestowed upon him? Why did a retinue of angels not accompany him as attendants?”\n",
        "TRANSLATION_3": "Why have bracelets of gold not been given to him and why have some angels not accompanied him?\"\n",
        "TRANSLATION_4": "“So why was he not bestowed with armlets of gold? Or angels should have come with him staying at his side!”\n",
        "TRANSLATION_5": "Why then are not golden bracelets bestowed on him, or angels sent along with him\"\n",
        "TRANSLATION_6": "But why have not bracelets of gold been put upon him, or why have there not come with him angels as companions?\n",
        "TRANSLATION_7": "Why then have bracelets of gold not been cast on him, or angels not come with him conjoined?'\n",
        "TRANSLATION_8": "Why, then, have armlets of gold not been set upon him, or angels sent along with him?\n",
        "TRANSLATION_9": "and why have not armlets of gold been bestowed on him and why is there not a train of angels accompanying him?\"\n",
        "TRANSLATION_10": "Wherefore, then, have bracelets of gold not been set upon him, and wherefore have not angels come with him accompanying\n",
        "TRANSLATION_11": "Why no bracelets of gold have been thrown to him, nor any angels accompany him as escorts?’\n",
        "TRANSLATION_12": "Then why are not gold bracelets bestowed on him, or (why) come (not) with him angels accompanying him in procession?\"\n",
        "TRANSLATION_13": "Why then are not golden bracelets bestowed on him, or angels sent along with him?\"\n",
        "TRANSLATION_14": "Why have no armlets of gold been given him, or angels sent down successively with him'\n",
        "TRANSLATION_15": "Why are bracelets of gold not dropped on him, or they angels came with him in procession?”\n",
        "TRANSLATION_16": "Then why have there not been placed upon him bracelets of gold or come with him the angels in conjunction?\"\n",
        "TRANSLATION_17": "[43:53] Why then, if he were being truthful, have bracelets of gold (asāwira, is the plural of aswira, which is the   plural of siwār, similar [in pattern] to [ghurāb] aghriba) not been cast on him — as according to their custom with those whom they made their leaders, dressing them with gold bracelets and gold necklaces — or the angels not come with him one after the other?’, in succession, to testify to his truthfulness.\n",
        "TRANSLATION_18": "(Why, then, have armlets of gold not been set upon him) as you yourselves are wearing, (or angels sent along with him) to help him and affirm the message with which he is sent?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "43:53",
            "25:7",
            "89:22",
            "6:8",
            "68:50",
            "26:119",
            "33:43",
            "3:39",
            "35:33",
            "20:116"
        ],
        "BIBLE": [
            "writings:esther:2:13",
            "writings:i%20chronicles:29:14",
            "prophets:ezekiel:16:33",
            "prophets:i%20kings:9:12",
            "prophets:jeremiah:13:20",
            "writings:job:42:11",
            "writings:ii%20chronicles:35:21",
            "prophets:joshua:17:4",
            "prophets:i%20samuel:18:19",
            "torah:genesis:47:15"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:2:1"
        ]
    }
}