{
    "VERSE": "43:55",
    "ARABIC": "فَلَمَّآ ءَاسَفُونَا ٱنتَقَمْنَا مِنْهُمْ فَأَغْرَقْنَٰهُمْ أَجْمَعِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Then when they had provoked Our wrath, We took revenge on them and drowned every one of them.",
        "TRANSLATION_1": "But when they roused Our anger We inflicted retributive punishment and drowned them all,\n",
        "TRANSLATION_2": "So when they incurred Our wrath, We exacted retribution from them, and drowned them all,\n",
        "TRANSLATION_3": "We took revenge on them by drowning them all together.\n",
        "TRANSLATION_4": "So when they made Us wrathful, We took revenge from them – We therefore drowned all of them.\n",
        "TRANSLATION_5": "So when they angered Us, We punished them, and drowned them all.\n",
        "TRANSLATION_6": "Then when they displeased Us, We inflicted a retribution on them, so We drowned them all together,\n",
        "TRANSLATION_7": "So, when they had angered Us, We took vengeance on them, and We drowned them all together;\n",
        "TRANSLATION_8": "So, when they angered Us, We punished them and drowned them every one.\n",
        "TRANSLATION_9": "Then when they provoked Our wrath, We took revenge on them and drowned every one of them.\n",
        "TRANSLATION_10": "So when they vexed Us, We took vengeance on them, and We drowned them all.\n",
        "TRANSLATION_11": "So when they roused Our wrath, We took vengeance on them and drowned them all.\n",
        "TRANSLATION_12": "When at length they provoked Us, We exacted retribution from them, and We drowned them all.\n",
        "TRANSLATION_13": "So when they angered Us, We punished them, and drowned them all.\n",
        "TRANSLATION_14": "And when they angered Us, We took vengeance on them and drowned all of them,\n",
        "TRANSLATION_15": "And when they provoked Our wrath, We took retribution from them, and We drowned them all.\n",
        "TRANSLATION_16": "And when they angered Us, We took retribution from them and drowned them all.\n",
        "TRANSLATION_17": "[43:55] So when they had angered Us, We took vengeance on them and drowned them all.\n",
        "TRANSLATION_18": "(So, when they angered Us) when they angered Our Prophet Moses, and tended to anger Us, (We punished them and drowned them every one) in the sea.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "43:55",
            "100:5",
            "54:44",
            "26:170",
            "38:85",
            "18:99",
            "38:82",
            "15:92",
            "11:55",
            "23:48"
        ],
        "BIBLE": [
            "torah:genesis:32:24",
            "writings:ii%20chronicles:28:11",
            "prophets:ezekiel:25:15",
            "torah:deuteronomy:1:23",
            "prophets:jeremiah:13:7",
            "prophets:ii%20kings:3:27",
            "writings:psalms:102:11",
            "prophets:judges:13:19",
            "torah:leviticus:8:10",
            "prophets:ezekiel:3:21"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:6:3"
        ]
    }
}