{
    "VERSE": "43:56",
    "ARABIC": "فَجَعَلْنَٰهُمْ سَلَفًا وَمَثَلًا لِّلْءَاخِرِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "We made them a thing of the past, an example for later peoples.",
        "TRANSLATION_1": "And made them a precedent and example for posterity.\n",
        "TRANSLATION_2": "and made them a thing of the past and an example for those who would come after them.\n",
        "TRANSLATION_3": "We made them become of the people of the past and an example for the coming generations.\n",
        "TRANSLATION_4": "So We made them a bygone fable and a lesson for the latter generations.\n",
        "TRANSLATION_5": "And We made them a precedent, and an example to later generations.\n",
        "TRANSLATION_6": "And We made them a precedent and example to the later generations.\n",
        "TRANSLATION_7": "and We made them a thing past, and We appointed them for an example to later folk.\n",
        "TRANSLATION_8": "And We made them a thing past, and an example for those after (them).\n",
        "TRANSLATION_9": "We made them a precedent, an example for later peoples.\n",
        "TRANSLATION_10": "And We made them a precedent and an ensample Unto those after.\n",
        "TRANSLATION_11": "Thus We made them the vanguard and an example for posterity.\n",
        "TRANSLATION_12": "And We made them (a people) of the Past and an Example to later ages.\n",
        "TRANSLATION_13": "And We made them a precedent (as a lesson for those coming after them), and an example to later generations.\n",
        "TRANSLATION_14": "and We made them a thing of the past, and We made them an example to later people.\n",
        "TRANSLATION_15": "Thus We made them a precedent and an example for the others.\n",
        "TRANSLATION_16": "And We made them a precedent and an example for the later peoples.\n",
        "TRANSLATION_17": "[43:56] And We made them a thing past (salaf, is the plural of sālif, similar [in pattern] to khādim, khadam) that is to say, a precedent, as a lesson, and an example for others, after them, that they [posterity] might take their predicament as a lesson and so not engage in actions similar to theirs.\n",
        "TRANSLATION_18": "(And We made them a thing past) by means of the punishment, (and an example) and a lesson (for those after (them)) for those who remained after them.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "43:56",
            "37:78",
            "37:108",
            "37:119",
            "37:129",
            "25:39",
            "77:17",
            "75:21",
            "56:40",
            "76:28"
        ],
        "BIBLE": [
            "writings:psalms:102:19",
            "prophets:isaiah:44:7",
            "prophets:ezekiel:11:18",
            "prophets:micah:7:15",
            "prophets:jeremiah:2:31",
            "prophets:i%20samuel:13:8",
            "writings:i%20chronicles:29:14",
            "prophets:i%20kings:12:30",
            "writings:psalms:71:18",
            "torah:numbers:35:29"
        ]
    }
}