{
    "VERSE": "43:6",
    "ARABIC": "وَكَمْ أَرْسَلْنَا مِن نَّبِىٍّ فِى ٱلْأَوَّلِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "How many Prophets We sent to the previous peoples!",
        "TRANSLATION_1": "Many a prophet had We sent to the earlier communities,\n",
        "TRANSLATION_2": "How many a Prophet did We send to the earlier peoples!\n",
        "TRANSLATION_3": "How many Messengers did We send to the ancient people?\n",
        "TRANSLATION_4": "And how many Prophets We did send among the earlier people!\n",
        "TRANSLATION_5": "And how many a Prophet have We sent amongst the men of old.\n",
        "TRANSLATION_6": "And how many a prophet have We sent among the ancients.\n",
        "TRANSLATION_7": "How many a Prophet We sent among the ancients,\n",
        "TRANSLATION_8": "How many a prophet did We send among the men of old!\n",
        "TRANSLATION_9": "We have sent many a prophet to earlier peoples\n",
        "TRANSLATION_10": "And how many a prophet We sent among the ancients.\n",
        "TRANSLATION_11": "How many a prophet We have sent to the former peoples!\n",
        "TRANSLATION_12": "But how many were the prophets We sent amongst the peoples of old?\n",
        "TRANSLATION_13": "And how many a Prophet have We sent amongst the men of old.\n",
        "TRANSLATION_14": "How many a Prophet did We send to the ancients,\n",
        "TRANSLATION_15": "How many a prophet did We send to the ancients?\n",
        "TRANSLATION_16": "And how many a prophet We sent among the former peoples,\n",
        "TRANSLATION_17": "[43:6] And how many a prophet did We send among the ancients!\n",
        "TRANSLATION_18": "(How many a Prophet did We send) did We send before you, Muhammad, (among the men of old) among bygone nations; We knew that they would not believe, but We nonetheless did not leave them without messengers and Scriptures!\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "43:6",
            "37:112",
            "39:12",
            "54:4",
            "15:10",
            "43:7",
            "77:16",
            "26:196",
            "15:13",
            "26:184"
        ],
        "BIBLE": [
            "torah:exodus:12:33",
            "prophets:joshua:24:28",
            "writings:proverbs:17:11",
            "prophets:i%20kings:18:22",
            "prophets:jeremiah:26:11",
            "prophets:jeremiah:23:34",
            "writings:ii%20chronicles:36:15",
            "writings:psalms:22:7",
            "prophets:jeremiah:26:16",
            "prophets:i%20samuel:13:2"
        ]
    }
}