{
    "VERSE": "43:60",
    "ARABIC": "وَلَوْ نَشَآءُ لَجَعَلْنَا مِنكُم مَّلَٰٓئِكَةً فِى ٱلْأَرْضِ يَخْلُفُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "If We wished We could appoint angels in exchange for you to succeed you on the earth.",
        "TRANSLATION_1": "If We pleased We could have put angels in place of you as trustees on the earth.\n",
        "TRANSLATION_2": "If We had so willed We could have made some of you into angels to become your successors on earth.\n",
        "TRANSLATION_3": "Had We wanted, We could have made the angels as your successors on the earth.\n",
        "TRANSLATION_4": "And if We willed, We could have established angels on the earth instead of you.\n",
        "TRANSLATION_5": "And if it were Our will, We would have made angels to replace you on the earth.\n",
        "TRANSLATION_6": "And if We please, We could make among you angels to be successors in the land.\n",
        "TRANSLATION_7": "Had We willed, We would have appointed angels among you to be successors in the earth.\n",
        "TRANSLATION_8": "And had We willed We could have set among you angels to be viceroys in the earth.\n",
        "TRANSLATION_9": "if We had so wished, We could have appointed angels in exchange for you to succeed you on the earth.\n",
        "TRANSLATION_10": "And had We willed We could have appointed angels born of you in the earth to succeed each other.\n",
        "TRANSLATION_11": "Had We wished We would have set angels in your stead to be [your] successors on the earth.\n",
        "TRANSLATION_12": "And if it were Our Will, We could make angels from amongst you, succeeding each other on the earth.\n",
        "TRANSLATION_13": "And if it were Our Will, We would have [destroyed you (mankind) all, and] made angels to replace you on the earth. [Tafsir At-Tabari, Vol: 25, Page 89].\n",
        "TRANSLATION_14": "Had it been Our Will We would have made angels among you as successors in the earth.\n",
        "TRANSLATION_15": "Had We willed, We would have made of you angels to be successors on earth.\n",
        "TRANSLATION_16": "And if We willed, We could have made [instead] of you angels succeeding [one another] on the earth.\n",
        "TRANSLATION_17": "[43:60] And had We willed, We would have appointed among you, instead of you, angels to be [your] successors in the earth, by Our destroying you.\n",
        "TRANSLATION_18": "(And had We willed We could have set among you) in your own places; and it is said this means: had We willed We would have created instead of you (angels to be vicegerents in the earth) angels instead of you; it is also said this means: angels to walk in the earth instead of you.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "43:60",
            "17:95",
            "6:8",
            "23:84",
            "12:73",
            "6:9",
            "23:79",
            "38:28",
            "26:152",
            "14:13"
        ],
        "BIBLE": [
            "prophets:ezekiel:26:20",
            "prophets:i%20samuel:8:12",
            "torah:deuteronomy:28:24",
            "prophets:ezekiel:32:8",
            "prophets:ezekiel:37:26",
            "prophets:hosea:2:5",
            "prophets:ii%20kings:18:23",
            "prophets:isaiah:36:8",
            "writings:daniel:11:17",
            "prophets:ezekiel:15:8"
        ]
    }
}