{
    "VERSE": "43:62",
    "ARABIC": "وَلَا يَصُدَّنَّكُمُ ٱلشَّيْطَٰنُ إِنَّهُۥ لَكُمْ عَدُوٌّ مُّبِينٌ",
    "ENGLISH": {
        "TRANSLATION_0": "Do not let Shaytan bar your way. He truly is an outright enemy to you.",
        "TRANSLATION_1": "Let not Satan misdirect you. He is your open enemy.\n",
        "TRANSLATION_2": "Let not Satan hinder you (from believing in the Hour), for surely he is your open enemy.\n",
        "TRANSLATION_3": "Let satan not prevent you from the right path. He is your sworn enemy\".\n",
        "TRANSLATION_4": "And do not ever let the devil stop you; he is indeed your open enemy.\n",
        "TRANSLATION_5": "And let not Shaytan hinder you. Verily, he (Shaytan) to you is a plain enemy.\n",
        "TRANSLATION_6": "And let not the Shaitan prevent you; surely he is your j open enemy.\n",
        "TRANSLATION_7": "Let not Satan bar you; he is for you a manifest foe.\n",
        "TRANSLATION_8": "And let not Satan turn you aside. Lo! he is an open enemy for you.\n",
        "TRANSLATION_9": "do not let Satan bar your way. He is truly your sworn enemy.\n",
        "TRANSLATION_10": "And let not the Satan hinder you; verily he is Unto you an enemy manifest.\n",
        "TRANSLATION_11": "Do not let Satan bar you [from the way of Allah]. Indeed he is your manifest enemy.’\n",
        "TRANSLATION_12": "Let not the Evil One hinder you: for he is to you an enemy avowed.\n",
        "TRANSLATION_13": "And let not Shaitan (Satan) hinder you (from the right religion, i.e. Islamic Monotheism), Verily, he (Satan) to you is a plain enemy.\n",
        "TRANSLATION_14": "and do let satan prevent you, for he is your clear enemy.\n",
        "TRANSLATION_15": "And let not Satan divert you. He is an open enemy to you.\n",
        "TRANSLATION_16": "And never let Satan avert you. Indeed, he is to you a clear enemy.\n",
        "TRANSLATION_17": "[43:62]   And do not let Satan bar you, [do not let him] turn you away from God’s religion. Indeed he is a manifest enemy of yours, one whose enmity is manifest.\n",
        "TRANSLATION_18": "(And let not Satan turn you aside) let not Satan turn you away from the religion of Islam or from belief in the coming of the Hour. (Lo! he is an open enemy for you) whose enmity is quite manifest.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "43:62",
            "36:60",
            "26:210",
            "35:6",
            "6:142",
            "2:208",
            "17:53",
            "20:117",
            "21:82",
            "3:175"
        ],
        "BIBLE": [
            "prophets:ezekiel:18:21",
            "prophets:nahum:3:13",
            "prophets:ezekiel:33:11",
            "writings:proverbs:4:26",
            "writings:nehemiah:7:3",
            "writings:psalms:125:5",
            "writings:proverbs:4:27",
            "prophets:ii%20kings:17:13",
            "prophets:jeremiah:23:22",
            "prophets:hosea:14:10"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:13",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:5:2"
        ]
    }
}