{
    "VERSE": "43:64",
    "ARABIC": "إِنَّ ٱللَّهَ هُوَ رَبِّى وَرَبُّكُمْ فَٱعْبُدُوهُ هَٰذَا صِرَٰطٌ مُّسْتَقِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "Allah is my Lord and your Lord so worship Him. This is a straight path.'",
        "TRANSLATION_1": "Verily God is my Lord and your Lord; so worship Him. This is the straight path.\"\n",
        "TRANSLATION_2": "Allah is my Lord and your Lord; therefore, serve Him. That is the Straight Way.”\n",
        "TRANSLATION_3": "God is your Lord and my Lord, so worship Him. This is the right path\".\n",
        "TRANSLATION_4": "“Allah is indeed my Lord, and yours – therefore worship Him; this is the Straight Path.”\n",
        "TRANSLATION_5": "Verily, Allah! He is my Lord and your Lord. So worship Him. This is the straight path.\"\n",
        "TRANSLATION_6": "Surely Allah is my Lord and your Lord, therefore serve Him; this is the right path:\n",
        "TRANSLATION_7": "Assuredly God is my Lord and your Lord; therefore serve Him; this is a straight path.'\n",
        "TRANSLATION_8": "Lo! Allah, He is my Lord and your Lord. So worship Him. This is a right path.\n",
        "TRANSLATION_9": "For God, He is my Lord and your Lord: so worship Him: that is a straight path.\"\n",
        "TRANSLATION_10": "Verily Allah! He is my lord and your Lord, so worship Him: this is the straight path.\n",
        "TRANSLATION_11": "Indeed Allah is my Lord and your Lord; so worship Him. This is a straight path.’\n",
        "TRANSLATION_12": "For Allah, He is my Lord and your Lord: so worship ye Him: this is a Straight Way.\"\n",
        "TRANSLATION_13": "Verily, Allah! He is my Lord (God) and your Lord (God). So worship Him (Alone). This is the (only) Straight Path (i.e. Allah's religion of true Islamic Monotheism).\"\n",
        "TRANSLATION_14": "Indeed, Allah is my Lord and your Lord, therefore worship Him. That is the Straight Path'\n",
        "TRANSLATION_15": "God is my Lord and your Lord, so worship Him—this is a straight path.”\n",
        "TRANSLATION_16": "Indeed, Allah is my Lord and your Lord, so worship Him. This is a straight path.\"\n",
        "TRANSLATION_17": "[43:64] Assuredly God is my Lord and your Lord; so worship Him — that is a straight path’.\n",
        "TRANSLATION_18": "(Lo! Allah, He is my Lord) my Creator (and your Lord) and your Creator. (So worship Him) believe in His divine Oneness. (This is a right path) this is an established religion with which He is pleased.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "43:64",
            "19:36",
            "3:51",
            "11:56",
            "26:110",
            "26:144",
            "26:126",
            "26:179",
            "26:163",
            "26:131"
        ],
        "BIBLE": [
            "torah:deuteronomy:8:19",
            "torah:deuteronomy:10:12",
            "writings:psalms:18:33",
            "writings:ii%20chronicles:7:22",
            "prophets:jeremiah:22:9",
            "prophets:joshua:24:14",
            "prophets:joshua:22:5",
            "writings:ii%20chronicles:27:6",
            "prophets:i%20kings:9:9",
            "prophets:i%20kings:22:54"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:14",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:13",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:2:5"
        ]
    }
}