{
    "VERSE": "43:65",
    "ARABIC": "فَٱخْتَلَفَ ٱلْأَحْزَابُ مِنۢ بَيْنِهِمْ فَوَيْلٌ لِّلَّذِينَ ظَلَمُوا۟ مِنْ عَذَابِ يَوْمٍ أَلِيمٍ",
    "ENGLISH": {
        "TRANSLATION_0": "The various factions among them differed. Woe then to those who did wrong on account of the punishment of a painful Day!",
        "TRANSLATION_1": "But the factions differed among themselves. Woe alas to the sinners for the torment of the grievous Day!\n",
        "TRANSLATION_2": "Then the factions fell apart among themselves. So woe to the wrong-doers from the chastisement of a grievous Day.\n",
        "TRANSLATION_3": "But certain groups created differences among themselves. Woe to the unjust. They will face a painful torment.\n",
        "TRANSLATION_4": "Then the groups differed amongst themselves; therefore ruin is for the unjust by the punishment of an agonising day.\n",
        "TRANSLATION_5": "But the sects from among themselves differed. So woe to those who do wrong from the torment of a painful Day!\n",
        "TRANSLATION_6": "But parties from among them differed, so woe to those who were unjust because of the chastisement of a painful day.\n",
        "TRANSLATION_7": "But the parties among them fell into variance; so woe unto those who did evil, because of the chastisement of a painful day.\n",
        "TRANSLATION_8": "But the factions among them differed. Then woe unto those who do wrong from the doom of a painful day.\n",
        "TRANSLATION_9": "The various factions among them differed -- woe then to those who did wrong: they will suffer the punishment of a painful Day.\n",
        "TRANSLATION_10": "Then the sects differed among themselves. Woe then Unto those who do Wrong because of the torment of an afflictive Day.\n",
        "TRANSLATION_11": "But the factions differed among themselves. So woe to the wrongdoers for the punishment of a painful day.\n",
        "TRANSLATION_12": "But sects from among themselves fell into disagreement: then woe to the wrong-doers, from the Penalty of a Grievous Day!\n",
        "TRANSLATION_13": "But the sects from among themselves differed. So woe to those who do wrong (by ascribing things to 'Iesa (Jesus) that are not true) from the torment of a painful Day (i.e. the Day of Resurrection)!\n",
        "TRANSLATION_14": "Yet the parties differed among themselves. So woe to those who did evil among the punishment of a Painful Day.\n",
        "TRANSLATION_15": "But the factions differed among themselves. So woe to the wrongdoers from the suffering of a painful Day.\n",
        "TRANSLATION_16": "But the denominations from among them differed [and separated], so woe to those who have wronged from the punishment of a painful Day.\n",
        "TRANSLATION_17": "[43:65] But the factions differed among themselves, regarding [the status of] Jesus: was he God, or the son of God, or the third of Three [deities]? So woe (waylun is a term implying chastisement) to those who do wrong, [those] who blaspheme in what they say about Jesus, from the chastisement of a painful day.\n",
        "TRANSLATION_18": "(But the factions) the Christians (among them differed) for some said he was the son of Allah, the Nestorians, some said he is Allah, the Jacobites, others said he is Allah's partner, the Melkites, and others said he is one of three hypostases, al-Marqusiyyah. (Then woe) severe punishment is (unto those who do wrong) to those who became different factions concerning Jesus (from the doom of a painful day.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "43:65",
            "19:37",
            "4:138",
            "51:37",
            "3:188",
            "51:60",
            "2:104",
            "26:201",
            "84:24",
            "57:13"
        ],
        "BIBLE": [
            "writings:lamentations:1:7",
            "writings:ruth:3:18",
            "torah:genesis:4:5",
            "prophets:joshua:22:20",
            "prophets:jeremiah:44:12",
            "torah:numbers:14:5",
            "prophets:jeremiah:16:19",
            "prophets:jeremiah:44:22",
            "prophets:ii%20samuel:13:2",
            "torah:numbers:17:10"
        ]
    }
}