{
    "VERSE": "43:67",
    "ARABIC": "ٱلْأَخِلَّآءُ يَوْمَئِذٍۭ بَعْضُهُمْ لِبَعْضٍ عَدُوٌّ إِلَّا ٱلْمُتَّقِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "On that Day the closest friends will be enemies to one another - except for those who have taqwa.",
        "TRANSLATION_1": "Friends will turn into enemies on that day, except those who fear and follow the straight path.\n",
        "TRANSLATION_2": "On that Day even bosom friends shall become enemies to one another, all except the God-fearing.\n",
        "TRANSLATION_3": "All intimate friends on that day will become each others enemies except for the pious,\n",
        "TRANSLATION_4": "Close friends will turn into enemies of one another on that Day, except the pious.\n",
        "TRANSLATION_5": "Friends on that Day will be foes one to another except those who have Taqwa.\n",
        "TRANSLATION_6": "The friends shall on that day be enemies one to another, except those who guard (against evil).\n",
        "TRANSLATION_7": "Friends on that day shall be foes to one another, but the god-fearing.\n",
        "TRANSLATION_8": "Friends on that day will be foes one to another, save those who kept their duty (to Allah).\n",
        "TRANSLATION_9": "On that Day, friends will become each other's enemies, except the righteous --\n",
        "TRANSLATION_10": "The intimate friends on that Day Will be hostile Unto one another save the God-fearing.\n",
        "TRANSLATION_11": "On that day, friends will be one another’s enemies, except for the Godwary.\n",
        "TRANSLATION_12": "Friends on that day will be foes, one to another,- except the Righteous.\n",
        "TRANSLATION_13": "Friends on that Day will be foes one to another except Al-Muttaqun (pious - see V. 2:2).\n",
        "TRANSLATION_14": "On that Day close friends shall become enemies of each other, except those who fear (Allah).\n",
        "TRANSLATION_15": "On that Day, friends will be enemies of one another, except for the righteous.\n",
        "TRANSLATION_16": "Close friends, that Day, will be enemies to each other, except for the righteous\n",
        "TRANSLATION_17": "[43:67] Friends, [who shared] in acts of disobedience in this world, will, on that day, the Day of Resurrection (yawma’idhin is semantically connected to His [following] words) be foes of one another, except for the Godfearing, those who have love for one another through their [commitment to] obedience of God — such will be friends [on that day] and it will be said to them:\n",
        "TRANSLATION_18": "(Friends) in sin, such as 'Uqbah Ibn Abi Ma'it and Ubayy Ibn Khalaf (on that day) on the Day of Judgement (will be foes one to another, save those who kept their duty (to Allah)) except those who ward off disbelief, idolatry and indecencies, such as Abu Bakr, 'Umar, 'Uthman, 'AN and their fellow believers, for these are not like that.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "43:67",
            "26:77",
            "46:6",
            "18:99",
            "7:24",
            "37:27",
            "52:25",
            "37:50",
            "68:30",
            "6:129"
        ],
        "BIBLE": [
            "prophets:malachi:3:7",
            "prophets:zephaniah:1:6",
            "torah:exodus:23:2",
            "torah:deuteronomy:31:18",
            "writings:job:19:19",
            "writings:job:34:27",
            "prophets:i%20samuel:12:20",
            "torah:numbers:14:43",
            "prophets:ii%20samuel:2:21",
            "prophets:i%20samuel:15:11"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:11",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:1:4"
        ]
    }
}