{
    "VERSE": "43:68",
    "ARABIC": "يَٰعِبَادِ لَا خَوْفٌ عَلَيْكُمُ ٱلْيَوْمَ وَلَآ أَنتُمْ تَحْزَنُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "'My slaves, you will feel no fear today; you will know no sorrow.'",
        "TRANSLATION_1": "O My creatures, there will be no fear or regret\n",
        "TRANSLATION_2": "(It will be said to them): “My servants, today you have nothing to fear or regret,\n",
        "TRANSLATION_3": "whom God will tell, \"My servants, you need have no fear on this day, nor will you be grieved\".\n",
        "TRANSLATION_4": "To such will be said, “O My bondmen! This day there shall be no fear upon you, nor any grief.”\n",
        "TRANSLATION_5": "My servants! No fear shall be on you this Day, nor shall you grieve,\n",
        "TRANSLATION_6": "O My servants! there is no fear for you this day, nor shall you grieve.\n",
        "TRANSLATION_7": "O My servants, today no fear is on you, neither do you sorrow' --\n",
        "TRANSLATION_8": "O My slaves! For you there is no fear this day, nor is it ye who grieve;\n",
        "TRANSLATION_9": "O My servants, you need not fear this Day, nor shall you grieve\" --\n",
        "TRANSLATION_10": "O My bondmen! no fear shall be on you Today, nor shall ye grieve\n",
        "TRANSLATION_11": "[They will be told,] ‘O My servants! Today you will have no fear, nor will you grieve\n",
        "TRANSLATION_12": "My devotees! no fear shall be on you that Day, nor shall ye grieve,-\n",
        "TRANSLATION_13": "(It will be said to the true believers of Islamic Monotheism): My worshippers! No fear shall be on you this Day, nor shall you grieve,\n",
        "TRANSLATION_14": "O My worshipers, there is no fear for you on this Day, nor will you grieve\n",
        "TRANSLATION_15": "O My servants, you have nothing to fear on that Day, nor will you grieve.\n",
        "TRANSLATION_16": "[To whom Allah will say], \"O My servants, no fear will there be concerning you this Day, nor will you grieve,\n",
        "TRANSLATION_17": "[43:68] ‘O My servants, there is no fear for you this day, nor will you grieve,\n",
        "TRANSLATION_18": "Allah will then say: (0 My slaves! For you there is no fear this day) when others are in fear, (nor is it ye who grieve) when others are in grief;\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "43:68",
            "40:32",
            "36:59",
            "26:87",
            "23:65",
            "43:39",
            "28:65",
            "6:48",
            "50:29",
            "34:30"
        ],
        "BIBLE": [
            "prophets:ii%20samuel:12:18",
            "writings:psalms:2:7",
            "writings:ezra:9:10",
            "torah:genesis:26:32",
            "prophets:i%20samuel:20:12",
            "torah:deuteronomy:31:17",
            "writings:psalms:42:11",
            "prophets:ii%20samuel:7:25",
            "prophets:i%20samuel:16:15",
            "prophets:jeremiah:45:2"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:4:4"
        ]
    }
}