{
    "VERSE": "43:70",
    "ARABIC": "ٱدْخُلُوا۟ ٱلْجَنَّةَ أَنتُمْ وَأَزْوَٰجُكُمْ تُحْبَرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "'Enter the Garden, you and your wives, delighting in your joy.'",
        "TRANSLATION_1": "(You will) enter the garden, you and your spouses, and be glad.\"\n",
        "TRANSLATION_2": "Enter Paradise joyfully, both you and your spouses.”\n",
        "TRANSLATION_3": "will be told, \"Enter Paradise with your spouses in delight.\n",
        "TRANSLATION_4": "“Enter Paradise – you and your wives – and you will be honoured guests.”\n",
        "TRANSLATION_5": "Enter Paradise, you and your wives, in happiness.\n",
        "TRANSLATION_6": "Enter the garden, you and your wives; you shall be made happy.\n",
        "TRANSLATION_7": "Enter Paradise, you and your wives, walking with joy!'\n",
        "TRANSLATION_8": "Enter the Garden, ye and your wives, to be made glad.\n",
        "TRANSLATION_9": "Enter the Garden rejoicing, both you and your spouses!\"\n",
        "TRANSLATION_10": "Enter the Garden, ye and your spouses, joyfully.\n",
        "TRANSLATION_11": "Enter paradise, you and your spouses, rejoicing.’\n",
        "TRANSLATION_12": "Enter ye the Garden, ye and your wives, in (beauty and) rejoicing.\n",
        "TRANSLATION_13": "Enter Paradise, you and your wives, in happiness.\n",
        "TRANSLATION_14": "(it will be said) 'You and your spouses, enter, walking with joy into Paradise'\n",
        "TRANSLATION_15": "Enter the Garden, you and your spouses, Joyfully.\n",
        "TRANSLATION_16": "Enter Paradise, you and your kinds, delighted.\"\n",
        "TRANSLATION_17": "[43:70] Enter Paradise, you (antum, the subject) and your spouses, your wives, to be made joyful, to be made happy and to be honoured (tuhbarūna, ‘to be made joyful’, is the predicate of the [above] subject).\n",
        "TRANSLATION_18": "(Enter the Garden, ye and your wives, to be made glad) to be honoured with gifts and delights in Paradise.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "43:70",
            "78:8",
            "26:90",
            "81:13",
            "47:6",
            "37:22",
            "89:30",
            "43:72",
            "56:7",
            "59:20"
        ],
        "BIBLE": [
            "prophets:i%20samuel:2:30",
            "prophets:isaiah:25:9",
            "writings:psalms:45:16",
            "writings:esther:6:6",
            "writings:esther:6:7",
            "writings:psalms:35:27",
            "torah:genesis:24:40",
            "torah:numbers:14:31",
            "prophets:ezekiel:20:13",
            "prophets:jeremiah:7:23"
        ]
    }
}