{
    "VERSE": "43:74",
    "ARABIC": "إِنَّ ٱلْمُجْرِمِينَ فِى عَذَابِ جَهَنَّمَ خَٰلِدُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "The evildoers will remain timelessly, for ever, in the punishment of Hell.",
        "TRANSLATION_1": "The sinners will certainly dwell for ever in the torment of Hell.\n",
        "TRANSLATION_2": "But the evil-doers shall abide in the torment of Hell.\n",
        "TRANSLATION_3": "The criminals will live forever in the torment of hell. Their torment will not be relieved and they will despair of escaping.\n",
        "TRANSLATION_4": "Indeed the criminals will stay in the punishment of hell forever.\n",
        "TRANSLATION_5": "Verily, the criminals will be in the torment of Hell to abide therein forever.\n",
        "TRANSLATION_6": "Surely the guilty shall abide in the chastisement of hell.\n",
        "TRANSLATION_7": "But the evildoers dwell forever in the chastisement of Gehenna\n",
        "TRANSLATION_8": "Lo! the guilty are immortal in hell's torment.\n",
        "TRANSLATION_9": "As for the evil-doers, they shall endure forever the torment of Hell,\n",
        "TRANSLATION_10": "Verily the culprits in Hell's torment will be abiders.\n",
        "TRANSLATION_11": "Indeed the guilty will remain [forever] in the punishment of hell.\n",
        "TRANSLATION_12": "The sinners will be in the Punishment of Hell, to dwell therein (for aye):\n",
        "TRANSLATION_13": "Verily, the Mujrimun (criminals, sinners, disbelievers, etc.) will be in the torment of Hell to abide therein forever.\n",
        "TRANSLATION_14": "But the evildoers shall live for ever in the punishment of Gehenna (Hell),\n",
        "TRANSLATION_15": "As for the sinners, they will be in the torment of Hell forever.\n",
        "TRANSLATION_16": "Indeed, the criminals will be in the punishment of Hell, abiding eternally.\n",
        "TRANSLATION_17": "[43:74] Indeed the guilty will abide [forever] in the chastisement of Hell —\n",
        "TRANSLATION_18": "572 Lo! the guilty) the idolaters: Abu Jahl and his host (are immortal in hell's torment) neither to die or leave it.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "43:74",
            "37:33",
            "29:54",
            "44:12",
            "3:88",
            "2:162",
            "20:48",
            "70:1",
            "44:15",
            "85:10"
        ],
        "BIBLE": [
            "writings:psalms:81:16",
            "prophets:jeremiah:50:39",
            "prophets:jeremiah:49:33",
            "torah:numbers:33:55",
            "prophets:isaiah:33:14",
            "prophets:jeremiah:11:11",
            "prophets:isaiah:33:24",
            "prophets:isaiah:24:6",
            "writings:psalms:69:37",
            "torah:genesis:34:23"
        ]
    }
}