{
    "VERSE": "43:77",
    "ARABIC": "وَنَادَوْا۟ يَٰمَٰلِكُ لِيَقْضِ عَلَيْنَا رَبُّكَ قَالَ إِنَّكُم مَّٰكِثُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "They will call out, 'Malik, let your Lord put an end to us!' He will say, 'You will stay the way you are.'",
        "TRANSLATION_1": "They will call (to the keeper of Hell-gate): \"O Malik, let your Lord decide our fate.\" He will answer: \"You are to stay.\"\n",
        "TRANSLATION_2": "They shall call out: “O Malik, let your Lord put an end to us.” He will reply: “You must stay on in it.\n",
        "TRANSLATION_3": "The angelic guard will say, \"You will have to stay.\n",
        "TRANSLATION_4": "And they will cry out, “O Malik*, ask your Lord to finish us!” He will answer, “Rather you are to stay (forever).” (*The guard of hell)\n",
        "TRANSLATION_5": "And they will cry: \"O Malik (keeper of Hell)! Let your Lord make an end of us.\" He will say: \"Verily, you shall abide forever.\"\n",
        "TRANSLATION_6": "And they shall call out: O Malik! let your Lord make an end of us. He shall say: Surely you shall tarry.\n",
        "TRANSLATION_7": "And they shall call, 'O\n",
        "TRANSLATION_8": "And they cry: O master! Let thy Lord make an end of us. He saith: Lo! here ye must remain.\n",
        "TRANSLATION_9": "They will cry, \"Master, if only your Lord would put an end to us!\" But he [the angel] will answer, \"No! You are here to stay.\"\n",
        "TRANSLATION_10": "And -they will cry: O keeper let thy Lord make an end of us. He will say: verily ye shall bide\n",
        "TRANSLATION_11": "They will call out, ‘O Malik! Let your Lord finish us off!’ He will say, ‘Indeed you will stay on.’\n",
        "TRANSLATION_12": "They will cry: \"O Malik! would that thy Lord put an end to us!\" He will say, \"Nay, but ye shall abide!\"\n",
        "TRANSLATION_13": "And they will cry: \"O Malik (Keeper of Hell)! Let your Lord make an end of us.\" He will say: \"Verily you shall abide forever.\"\n",
        "TRANSLATION_14": "O Malik' (the angel of Hell) they will call out, 'let your Lord put an end to us' But he will answer: 'Here you shall stay'\n",
        "TRANSLATION_15": "And they will cry, “O Malek, let your Lord finish us off.” He will say, “You are staying.”\n",
        "TRANSLATION_16": "And they will call, \"O Malik, let your Lord put an end to us!\" He will say, \"Indeed, you will remain.\"\n",
        "TRANSLATION_17": "[43:77] And they will call out, ‘O Mālik — the [name of the] Keeper of the Fire — let your Lord finish us off!’, let Him make us die. He will say, after [the passing of] a thousand years, ‘You will surely remain!’, you will remain in the chastisement forever.\n",
        "TRANSLATION_18": "(And they cry: master) when their patience run out, they cry: master of the Fire! (Let thy Lord make an end of us). The custodian of the Fire answers them after 40 years, (He saith: Lo! here ye must remain) you will dwell eternally in the torment and you will never come out.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "43:77",
            "89:22",
            "7:125",
            "41:30",
            "36:16",
            "10:96",
            "16:42",
            "29:59",
            "44:20",
            "20:45"
        ],
        "BIBLE": [
            "prophets:jeremiah:4:27",
            "prophets:jeremiah:5:18",
            "prophets:joel:2:17",
            "writings:daniel:8:19",
            "prophets:jeremiah:30:11",
            "prophets:i%20kings:12:9",
            "writings:ii%20chronicles:10:9",
            "prophets:jeremiah:46:28",
            "prophets:ii%20kings:18:30",
            "prophets:isaiah:36:15"
        ]
    }
}