{
    "VERSE": "43:78",
    "ARABIC": "لَقَدْ جِئْنَٰكُم بِٱلْحَقِّ وَلَٰكِنَّ أَكْثَرَكُمْ لِلْحَقِّ كَٰرِهُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "We brought you the truth but most of you hated the truth.",
        "TRANSLATION_1": "We have brought to you the truth, but most of you despise the truth.\n",
        "TRANSLATION_2": "We brought you the Truth; but to the truth most of you were averse.”\n",
        "TRANSLATION_3": "We brought you the truth but most of you disliked it\".\n",
        "TRANSLATION_4": "Indeed We have brought the Truth to you, but most of you detest the Truth.\n",
        "TRANSLATION_5": "Indeed We have brought the truth to you, but most of you have a hatred for the truth.\n",
        "TRANSLATION_6": "Certainly We have brought you the truth, but most of you are averse to the truth.\n",
        "TRANSLATION_7": "We brought you the truth, but most of you were averse to the truth.'\n",
        "TRANSLATION_8": "We verily brought the Truth unto you, but ye were, most of you, averse to the Truth.\n",
        "TRANSLATION_9": "We have certainly brought the truth to you: but most of you have an aversion for the truth.\n",
        "TRANSLATION_10": "Assuredly We brought the truth Unto you, but most Of you are to the truth averse.\n",
        "TRANSLATION_11": "‘We certainly brought you the truth, but most of you were averse to the truth.’\n",
        "TRANSLATION_12": "Verily We have brought the Truth to you: but most of you have a hatred for Truth.\n",
        "TRANSLATION_13": "Indeed We have brought the truth (Muhammad SAW with the Quran), to you, but most of you have a hatred for the truth.\n",
        "TRANSLATION_14": "We brought you the truth, but most of you were averse to the truth.\n",
        "TRANSLATION_15": "We have given you the truth, but most of you hate the truth.\n",
        "TRANSLATION_16": "We had certainly brought you the truth, but most of you, to the truth, were averse.\n",
        "TRANSLATION_17": "[43:78] God, exalted be He, says: ‘Verily We brought you, O people of Mecca, the truth, by the tongue of the Messenger, but most of you were averse to the truth’.\n",
        "TRANSLATION_18": "(We verily brought the Truth unto you) He says: Gabriel came to your Prophet Muhammad (pbuh) with the Qur'an, (but ye were, most of you) all of you, (averse to the Truth) deniers of Muhammad (pbuh) and the Qur'an.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "43:78",
            "44:39",
            "15:64",
            "23:70",
            "23:90",
            "28:51",
            "15:24",
            "2:42",
            "36:7",
            "37:37"
        ],
        "BIBLE": [
            "writings:psalms:60:6",
            "torah:genesis:25:5",
            "writings:psalms:105:40",
            "prophets:judges:5:25",
            "torah:deuteronomy:3:15",
            "writings:psalms:118:18",
            "torah:genesis:43:23",
            "torah:numbers:20:12",
            "writings:lamentations:5:6",
            "torah:deuteronomy:26:9"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:11"
        ]
    }
}