{
    "VERSE": "43:79",
    "ARABIC": "أَمْ أَبْرَمُوٓا۟ أَمْرًا فَإِنَّا مُبْرِمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Or have they hatched a plot? It is We who are the Hatcher!",
        "TRANSLATION_1": "Have they settled upon a plan? We shall also settle on one.\n",
        "TRANSLATION_2": "Have they contrived some scheme? If so, We too will contrive a scheme.\n",
        "TRANSLATION_3": "If the disbelievers persist in their disbelief, We shall also persist in punishing them.\n",
        "TRANSLATION_4": "Do they assume that they have made their work thorough? So We shall make Our work thorough.\n",
        "TRANSLATION_5": "Or have they plotted some plan Then We too are planning.\n",
        "TRANSLATION_6": "Or have they settled an affair? Then surely We are the settlers.\n",
        "TRANSLATION_7": "Or have they contrived some matter? We too are contriving.\n",
        "TRANSLATION_8": "Or do they determine any thing (against the Prophet)? Lo! We (also) are determining.\n",
        "TRANSLATION_9": "Have they determined upon a course? Then We too are determined.\n",
        "TRANSLATION_10": "Have they determined an affair? then verily We are also determining.\n",
        "TRANSLATION_11": "Have they settled on some [devious] plan? Indeed, We too are settling [on Our plans].\n",
        "TRANSLATION_12": "What! have they settled some plan (among themselves)? But it is We Who settle things.\n",
        "TRANSLATION_13": "Or have they plotted some plan? Then We too are planning.\n",
        "TRANSLATION_14": "Or have they devised a matter! We are devising.\n",
        "TRANSLATION_15": "Have they contrived some scheme? We too are contriving.\n",
        "TRANSLATION_16": "Or have they devised [some] affair? But indeed, We are devising [a plan].\n",
        "TRANSLATION_17": "[43:79] Or have they, that is, the disbelievers of Mecca, contrived, consolidated, some matter?, in plotting against the Prophet Muhammad (s). For We [too] are indeed contriving, [We too] are consolidating Our plan to destroy them.\n",
        "TRANSLATION_18": "(Or do they determine any thing) in relation to the Prophet Muhammad? (Lo! We (also) are determining) something in relation to their destruction.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "43:79",
            "40:68",
            "3:128",
            "20:26",
            "44:59",
            "44:5",
            "20:32",
            "15:79",
            "21:27",
            "26:151"
        ],
        "BIBLE": [
            "prophets:nahum:3:6",
            "prophets:ii%20samuel:23:5",
            "torah:leviticus:11:43",
            "torah:numbers:31:23",
            "torah:exodus:34:10",
            "writings:daniel:9:27",
            "writings:daniel:5:15",
            "writings:nehemiah:10:34",
            "torah:leviticus:23:21",
            "prophets:isaiah:43:19"
        ]
    }
}