{
    "VERSE": "43:81",
    "ARABIC": "قُلْ إِن كَانَ لِلرَّحْمَٰنِ وَلَدٌ فَأَنَا۠ أَوَّلُ ٱلْعَٰبِدِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Say: 'If the All-Merciful had a son, I would be the first to worship him.'",
        "TRANSLATION_1": "Say: \"If Ar-Rahman had a son I would have been the first of worshippers.\"\n",
        "TRANSLATION_2": "Say: “If the Merciful One had a son, I would have been the first one to worship him.”\n",
        "TRANSLATION_3": "(Muhammad), say, \"Had the Beneficent God really had a son, I would certainly have been the first one to worship him.\n",
        "TRANSLATION_4": "Proclaim (O dear Prophet Mohammed – peace and blessings be upon him), “If supposedly, the Most Gracious had an offspring* – I would be the first to worship!” (*Which is impossible)\n",
        "TRANSLATION_5": "Say: \"If the Most Gracious had a son, then I am the first of the worshippers.\"\n",
        "TRANSLATION_6": "Say: If the Beneficent Allah has a son, I am the foremost of those who serve.\n",
        "TRANSLATION_7": "Say: 'If the All-merciful has a son, then I am the first to serve him.\n",
        "TRANSLATION_8": "Say (O Muhammad): If the Beneficent One hath a son, then, I shall be first among the worshippers. (But there is no son).\n",
        "TRANSLATION_9": "Say, \"If the All Merciful had a son, I would be the first to worship him.\"\n",
        "TRANSLATION_10": "Say thou: had the Compassionate a son, shall be the first of his worshippers.\n",
        "TRANSLATION_11": "Say, ‘If the All-beneficent had offspring, I would have been the first to worship [him].’\n",
        "TRANSLATION_12": "Say: \"If (Allah) Most Gracious had a son, I would be the first to worship.\"\n",
        "TRANSLATION_13": "Say (O Muhammad SAW): \"If the Most Beneficent (Allah) had a son (or children as you pretend), then I am the first of Allah's worshippers [who deny and refute this claim of yours (and the first to believe in Allah Alone and testify that He has no children)].\" [Tafsir At-Tabari].\n",
        "TRANSLATION_14": "Say (Prophet Muhammad): 'If the Merciful had a son, I would be the first of the worshipers.\n",
        "TRANSLATION_15": "Say, “If the Most Gracious had a son, I would be the first to worship.”\n",
        "TRANSLATION_16": "Say, [O Muhammad], \"If the Most Merciful had a son, then I would be the first of [his] worshippers.\"\n",
        "TRANSLATION_17": "[43:81] Say: ‘If the Compassionate One had a son, hypothetically [speaking], I would have been first among the worshippers, of that son; but it is established that He, exalted be He, does not have a child and thus there can be no worshipping of such [a child].\n",
        "TRANSLATION_18": "(Say) Muhammad to al-Nadr Ibn al-Harith and 'Alqamah: (The Beneficent One hath no son. I am first among the worshippers) I am the first to acknowledge that Allah has no son or partner.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "43:81",
            "19:91",
            "19:88",
            "19:92",
            "21:26",
            "39:12",
            "47:22",
            "19:18",
            "43:8",
            "19:85"
        ],
        "BIBLE": [
            "prophets:jeremiah:5:19",
            "prophets:jonah:4:2",
            "torah:exodus:3:12",
            "torah:exodus:4:23",
            "prophets:jeremiah:16:11",
            "prophets:judges:10:10",
            "prophets:jeremiah:4:10",
            "torah:exodus:3:14",
            "writings:ii%20chronicles:25:16",
            "prophets:ezekiel:21:33"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:6:5"
        ]
    }
}