{
    "VERSE": "43:82",
    "ARABIC": "سُبْحَٰنَ رَبِّ ٱلسَّمَٰوَٰتِ وَٱلْأَرْضِ رَبِّ ٱلْعَرْشِ عَمَّا يَصِفُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Glory be to the Lord of the heavens and the earth, the Lord of the Throne, beyond what they describe.",
        "TRANSLATION_1": "All too glorious is He, Lord of the heavens and the earth, the Lord of all power, for what they ascribe to Him\n",
        "TRANSLATION_2": "Exalted be the Lord of the heavens and the earth, the Lord of the Throne, above what they attribute to Him.\n",
        "TRANSLATION_3": "The Lord of the heavens and the earth and the Throne is too glorious to be described in the way they describe Him.\n",
        "TRANSLATION_4": "Purity is to the Lord of the heavens and the earth, the Lord of the Throne, from all what they fabricate.\n",
        "TRANSLATION_5": "Glorified is the Lord of the heavens and the earth, the Lord of the Throne! Exalted be He from all that they ascribe (to Him).\n",
        "TRANSLATION_6": "Glory to the Lord of the heavens and the earth, the Lord of power, from what they describe.\n",
        "TRANSLATION_7": "Glory be to the Lord of the heavens and the earth, the Lord of the Throne, above that they describe.'\n",
        "TRANSLATION_8": "Glorified be the Lord of the heavens and the earth, the Lord of the Throne, from that which they ascribe (unto Him)!\n",
        "TRANSLATION_9": "But -- exalted be the Lord of the heavens and earth, the Lord of the Throne -- He is far above their [false] descriptions.\n",
        "TRANSLATION_10": "Hallowed be the Lord of the heavens and the earth, the Lord of the Throne, from that which they ascribe!\n",
        "TRANSLATION_11": "Clear is the Lord of the heavens and the earth, the Lord of the Throne, of whatever they allege [concerning Him]!\n",
        "TRANSLATION_12": "Glory to the Lord of the heavens and the earth, the Lord of the Throne (of Authority)! (He is free) from the things they attribute (to him)!\n",
        "TRANSLATION_13": "Glorified be the Lord of the heavens and the earth, the Lord of the Throne! Exalted be He from all that they ascribe (to Him).\n",
        "TRANSLATION_14": "Exaltations be to the Lord of the heavens and the earth, the Lord of the Throne, above that which they describe'\n",
        "TRANSLATION_15": "Glorified be the Lord of the heavens and the earth, the Lord of the Throne, beyond what they describe.\n",
        "TRANSLATION_16": "Exalted is the Lord of the heavens and the earth, Lord of the Throne, above what they describe.\n",
        "TRANSLATION_17": "[43:82] Glory be to the Lord of the heavens and the earth, the Lord of the Throne (the ‘arsh is the [same as the] kursī) above what they allege!’, [above] the lies which they speak in ascribing a child to Him.\n",
        "TRANSLATION_18": "(Glorified be the Lord of the heavens and the earth, the Lord of the Throne, from that which they ascribe (unto Him)) of sons and partners!\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "43:82",
            "11:107",
            "16:3",
            "44:29",
            "21:56",
            "21:4",
            "44:7",
            "26:24",
            "23:86",
            "37:5"
        ],
        "BIBLE": [
            "writings:psalms:148:13",
            "writings:psalms:57:6",
            "writings:psalms:57:12",
            "writings:psalms:108:6",
            "writings:i%20chronicles:29:11",
            "torah:genesis:1:1",
            "prophets:isaiah:66:17",
            "writings:nehemiah:9:6",
            "torah:deuteronomy:6:15",
            "prophets:isaiah:61:11"
        ]
    }
}