{
    "VERSE": "43:83",
    "ARABIC": "فَذَرْهُمْ يَخُوضُوا۟ وَيَلْعَبُوا۟ حَتَّىٰ يُلَٰقُوا۟ يَوْمَهُمُ ٱلَّذِى يُوعَدُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "So leave them to plunge and play around until they meet their Day which they are promised.",
        "TRANSLATION_1": "Leave them to their vain discoursing and horse-play till they come to meet their promised day (of reckoning).\n",
        "TRANSLATION_2": "So leave them alone to indulge in their vanities and to frolic about until they encounter that Day of theirs against which they have been warned.\n",
        "TRANSLATION_3": "Leave them (to indulge) in their desires and play around until they face that day which has been promised to them.\n",
        "TRANSLATION_4": "Therefore leave them to utter vile speech and to play, until they confront the day which they are promised.\n",
        "TRANSLATION_5": "So leave them (alone) to speak nonsense and play until they meet the Day of theirs which they have been promised.\n",
        "TRANSLATION_6": "So leave them plunging into false discourses and sporting until they meet their day which they are threatened with.\n",
        "TRANSLATION_7": "Then leave them alone to plunge and play, until they encounter that day of theirs which they are promised.\n",
        "TRANSLATION_8": "So let them flounder (in their talk) and play until they meet the Day which they are promised.\n",
        "TRANSLATION_9": "So leave them alone to indulge in vain discourse and amuse themselves until they come face to face with that Day which they have been promised.\n",
        "TRANSLATION_10": "So let them thou alone wading and sporting until hey meet the Day which they are promised.\n",
        "TRANSLATION_11": "So leave them to gossip and play until they encounter the day they are promised.\n",
        "TRANSLATION_12": "So leave them to babble and play (with vanities) until they meet that Day of theirs, which they have been promised.\n",
        "TRANSLATION_13": "So leave them (alone) to speak nonsense and play until they meet the Day of theirs, which they have been promised.\n",
        "TRANSLATION_14": "Let them alone to plunge and play, until they encounter that Day of theirs which they are promised.\n",
        "TRANSLATION_15": "So leave them to blunder and play, until they encounter their Day which they are promised.\n",
        "TRANSLATION_16": "So leave them to converse vainly and amuse themselves until they meet their Day which they are promised.\n",
        "TRANSLATION_17": "[43:83]   So leave them to indulge, their falsehoods, and play, in this world of theirs, until they encounter that day of theirs which they are promised, chastisement in, and that is the Day of Resurrection.\n",
        "TRANSLATION_18": "(So let them) Muhammad (flounder (in their talk)) of falsehood (and play) and mock the Qur'an (until they meet) until they see (the Day which they are promised) death and punishment.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "43:83",
            "70:42",
            "52:45",
            "51:60",
            "26:87",
            "7:14",
            "70:26",
            "83:34",
            "23:113",
            "36:59"
        ],
        "BIBLE": [
            "prophets:i%20samuel:18:10",
            "prophets:hosea:4:15",
            "prophets:ezekiel:16:16",
            "prophets:i%20samuel:26:21",
            "prophets:isaiah:49:21",
            "prophets:ii%20samuel:19:21",
            "prophets:jeremiah:51:47",
            "prophets:i%20samuel:16:18",
            "prophets:ii%20samuel:24:13",
            "torah:numbers:24:14"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:6:4"
        ]
    }
}