{
    "VERSE": "43:87",
    "ARABIC": "وَلَئِن سَأَلْتَهُم مَّنْ خَلَقَهُمْ لَيَقُولُنَّ ٱللَّهُ فَأَنَّىٰ يُؤْفَكُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "If you asked them who created them, they would say, 'Allah!' So how have they been perverted?",
        "TRANSLATION_1": "If you ask them who created them, they will answer: \"God.\" How then can they turn away?\n",
        "TRANSLATION_2": "If you were to ask them: “Who created them?” they will surely say: “Allah.” Whence are they, then, being led astray?\n",
        "TRANSLATION_3": "(Muhammad), if you ask them, \"Who had created the idols?\" They will certainly say, \"God has created them.\" Why do you then turn away from God?\n",
        "TRANSLATION_4": "And if you ask them as to Who created them, they will surely answer “Allah” – so where are they reverting?\n",
        "TRANSLATION_5": "And if you ask them who created them, they will surely say: \"Allah.\" How then are they turned away\n",
        "TRANSLATION_6": "And if you should ask them who created them, they would certainly say: Allah. Whence are they then turned back?\n",
        "TRANSLATION_7": "If thou askest them, 'Who created you?' they will say, 'God.' How then are they perverted?\n",
        "TRANSLATION_8": "And if thou ask them who created them, they will surely say: Allah. How then are they turned away?\n",
        "TRANSLATION_9": "And if you ask them who created them, they will surely say, God. How then are they turned away?\n",
        "TRANSLATION_10": "And wert thou to ask them who created them, they will surely say: God. Witherward then are they deviating!\n",
        "TRANSLATION_11": "If you ask them, ‘Who created them?’ they will surely say, ‘Allah.’ Then where do they stray?\n",
        "TRANSLATION_12": "If thou ask them, who created them, they will certainly say, Allah: How then are they deluded away (from the Truth)?\n",
        "TRANSLATION_13": "And if you ask them who created them, they will surely say: \"Allah\". How then are they turned away (from the worship of Allah, Who created them)?\n",
        "TRANSLATION_14": "Yet if you ask them: 'Who created you' they will say: 'Allah' How then can they turn away from Him?\n",
        "TRANSLATION_15": "And if you asked them, “Who created them?”, they would say, “God.” Why then do they deviate?\n",
        "TRANSLATION_16": "And if you asked them who created them, they would surely say, \"Allah.\" So how are they deluded?\n",
        "TRANSLATION_17": "[43:87] And if (wa-la-in: the lām is for oaths) you ask them who created them, they will surely say, ‘God’ (layaqūlunna: the indicative nūn and the [plural] person indicator wāw have been omitted). How can they then deviate?, [how] can they be turned away from worshipping God?\n",
        "TRANSLATION_18": "(And if thou ask them) i.e. the Banu Malih (who created them, they will surely say: Allah) created us. (How then are they turned away) from whence do they lie against Allah after such a confession?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "43:87",
            "29:61",
            "23:89",
            "29:11",
            "12:91",
            "3:158",
            "37:56",
            "37:152",
            "26:126",
            "26:131"
        ],
        "BIBLE": [
            "prophets:i%20samuel:15:30",
            "prophets:isaiah:42:17",
            "prophets:isaiah:12:1",
            "prophets:ezekiel:14:6",
            "writings:psalms:70:4",
            "prophets:i%20samuel:1:17",
            "prophets:joshua:1:16",
            "prophets:jonah:3:9",
            "prophets:jeremiah:2:35",
            "prophets:i%20samuel:19:17"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:2",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:2:4"
        ]
    }
}