{
    "VERSE": "43:88",
    "ARABIC": "وَقِيلِهِۦ يَٰرَبِّ إِنَّ هَٰٓؤُلَآءِ قَوْمٌ لَّا يُؤْمِنُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "And as for his words, 'My Lord, these are people who have no iman!'",
        "TRANSLATION_1": "And (the Prophet) will say: \"O Lord, these are certainly a people who do not believe.\"\n",
        "TRANSLATION_2": "We call to witness the cry of the Messenger: “O Lord, these are a people not wont to believe!”\n",
        "TRANSLATION_3": "(God has knowledge of Muhammad's words when he complains to Him), \"My Lord, these, my people, do not believe\".\n",
        "TRANSLATION_4": "And by oath of the saying of My Prophet “O my Lord! These people do not accept faith!”\n",
        "TRANSLATION_5": "And his saying: \"O my Lord! Verily, these are a people who believe not!\"\n",
        "TRANSLATION_6": "Consider his cry: O my Lord! surely they are a people who do not believe.\n",
        "TRANSLATION_7": "And for his saying, 'My Lord, surely these are a people who believe not' --\n",
        "TRANSLATION_8": "And he saith: O my Lord! Lo! these are a folk who believe not.\n",
        "TRANSLATION_9": "The Prophet has said, \"Lord! Truly they are a people who do not believe.\"\n",
        "TRANSLATION_10": "And We hear his saying: my Lord! verily these are a people who believe not.\n",
        "TRANSLATION_11": "And his plaint: ‘My Lord! Indeed these are a people who will not have faith!’\n",
        "TRANSLATION_12": "(Allah has knowledge) of the (Prophet's) cry, \"O my Lord! Truly these are people who will not believe!\"\n",
        "TRANSLATION_13": "(Allah has knowledge) of (Prophet Muhammad's) saying: \"O my Lord! Verily, these are a people who believe not!\"\n",
        "TRANSLATION_14": "And for his saying: 'My Lord, these are an unbelieving nation'\n",
        "TRANSLATION_15": "As for his statement: “My Lord, these are a people who do not believe.”\n",
        "TRANSLATION_16": "And [Allah acknowledges] his saying, \"O my Lord, indeed these are a people who do not believe.\"\n",
        "TRANSLATION_17": "[43:88] And [as] for his saying: that is, the saying of the Prophet Muhammad (s) (wa-qīlihi is [accusative] dependent because it is a verbal noun followed by an implicit verb, in other words wa-qāla [qīlihi], ‘and he said [his saying]’) ‘O my Lord! These are indeed a people who have no faith’.\n",
        "TRANSLATION_18": "(And he saith) Muhammad (pbuh) says: (0 my Lord! Lo! those are a folk who believe not) in You or in the Qur'an. So do with them as You will.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "43:88",
            "26:117",
            "25:30",
            "44:22",
            "11:29",
            "71:5",
            "7:79",
            "29:30",
            "23:106",
            "23:94"
        ],
        "BIBLE": [
            "torah:exodus:19:9",
            "prophets:jeremiah:42:4",
            "prophets:joshua:24:27",
            "torah:deuteronomy:5:25",
            "prophets:joshua:3:9",
            "prophets:jeremiah:26:12",
            "writings:psalms:5:2",
            "prophets:ezekiel:37:4",
            "writings:nehemiah:8:9",
            "prophets:jeremiah:42:5"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:6:5"
        ]
    }
}