{
    "VERSE": "43:89",
    "ARABIC": "فَٱصْفَحْ عَنْهُمْ وَقُلْ سَلَٰمٌ فَسَوْفَ يَعْلَمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "turn from them and say, 'Peace! You will soon come to know.'",
        "TRANSLATION_1": "Turn away from them and say: \"Peace.\" They will come to know soon.\n",
        "TRANSLATION_2": "Indulge them, (O Prophet), and say to them: “Peace to you.” For soon they shall come to know.\n",
        "TRANSLATION_3": "We have told him, \"Ignore them and say to them 'farewell'. They will soon know the consequences of their deeds\n",
        "TRANSLATION_4": "Therefore excuse them and proclaim, “Peace”; for they will soon come to know.\n",
        "TRANSLATION_5": "So turn away from them, and say: Salam (peace!) But they will come to know.\n",
        "TRANSLATION_6": "So turn away from them and say, Peace, for they shall soon come to know.\n",
        "TRANSLATION_7": "yet pardon them, and say, 'Peace!' Soon they will know.\n",
        "TRANSLATION_8": "Then bear with them (O Muhammad) and say: Peace. But they will come to know.\n",
        "TRANSLATION_9": "Then bear with them [O Muhammad] and say, \"Peace.\" They will soon come to know.\n",
        "TRANSLATION_10": "Wherefore turn thou aside from them, and say: peace. presently they shall come to know.\n",
        "TRANSLATION_11": "So disregard them, and say, ‘Peace!’ Soon they will know.\n",
        "TRANSLATION_12": "But turn away from them, and say \"Peace!\" But soon shall they know!\n",
        "TRANSLATION_13": "So turn away from them (O Muhammad SAW), and say: Salam (peace)! But they will come to know.\n",
        "TRANSLATION_14": "pardon them, and say: 'Peace', soon they will know.\n",
        "TRANSLATION_15": "Pardon them, and say, “Peace.” They will come to know.\n",
        "TRANSLATION_16": "So turn aside from them and say, \"Peace.\" But they are going to know.\n",
        "TRANSLATION_17": "[43:89] God, exalted be He, says: Then disregard them, leave [them] be, and say, ‘Peace!’, [I will stay away] from you — this was [revealed] before he was commanded to fight them. For they will [soon] come to know (ya‘lamūna, may also be read as [second person plural] ta‘lamūna, ‘you will [come to] know’), [meant] to threaten them. Meccan, except for verse 15; it consists of 56, 57 or 59 verses.\n",
        "TRANSLATION_18": "(Then bear with them (0 Muhammad)) it was said to him: turn away from them (and say: Peace) words of truth. (But) this is a threat (they will come to know) what will be done with them on the Day of Badr, Uhud, the Troops. Then, after this, he was commanded to fight them; it is also said that this means: but they will come to know the hunger and smoke that will befall them'. And of the surah in which Smoke is mentioned which is all Mecca and consists of 59 verses, 346 words and 1,431 letters: Surah 44: Smoke (al-Dukhan) And of the surah in which Smoke is mentioned which is all Mecca and consists of 59 verses, 346 words and 1,431 letters:\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "43:89",
            "37:175",
            "37:179",
            "15:46",
            "37:181",
            "32:30",
            "37:120",
            "15:3",
            "52:38",
            "37:90"
        ],
        "BIBLE": [
            "prophets:ii%20kings:9:18",
            "writings:ruth:4:1",
            "prophets:i%20samuel:25:12",
            "writings:lamentations:5:21",
            "writings:lamentations:5:22",
            "prophets:isaiah:12:1",
            "torah:exodus:9:29",
            "writings:song%20of%20songs:6:1",
            "prophets:ii%20kings:9:19",
            "prophets:judges:3:19"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:3"
        ]
    }
}