{
    "VERSE": "43:9",
    "ARABIC": "وَلَئِن سَأَلْتَهُم مَّنْ خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلْأَرْضَ لَيَقُولُنَّ خَلَقَهُنَّ ٱلْعَزِيزُ ٱلْعَلِيمُ",
    "ENGLISH": {
        "TRANSLATION_0": "If you were to ask them, 'Who created the heavens and the earth?' they would reply, 'The Almighty, the All- Knowing created them.'",
        "TRANSLATION_1": "If you ask them: \"Who created the heavens and the earth?\" they will answer: \"The Mighty and All-knowing created them,\"\n",
        "TRANSLATION_2": "Yet if you were to ask them: “Who created the heavens and the earth?” they will certainly say: “The All-Mighty, the All-Knowing has created them.”\n",
        "TRANSLATION_3": "(Muhammad), if you ask them, \"Who has created the heavens and the earth?\" They will certainly say, \"The Majestic and All-knowing God has created them\".\n",
        "TRANSLATION_4": "And if you ask them, “Who has created the heavens and the earth?”, they will surely say, “They are created by the Most Honourable, the All Knowing.”\n",
        "TRANSLATION_5": "And indeed if you ask them: \"Who has created the heavens and the earth\" They will surely say: \"The All-Mighty, the All-Knower created them.\"\n",
        "TRANSLATION_6": "And if you should ask them, Who created the heavens and the earth? they would most certainly say: The Mighty, the Knowing One, has created them;\n",
        "TRANSLATION_7": "If thou askest them, 'Who created the heavens and earth?' they will say, 'The All-mighty, the All-knowing created them.'\n",
        "TRANSLATION_8": "And if thou (Muhammad) ask them: Who created the heavens and the earth, they will surely answer: The Mighty, the Knower created them;\n",
        "TRANSLATION_9": "If you ask them, \"Who has created the heavens and the earth?\", they will surely answer, \"The Almighty, the All Knowing One has created them.\"\n",
        "TRANSLATION_10": "And if thou askest them: who hath created the heavens and the earth? they will surely say: created them the Mighty, the Knower.\n",
        "TRANSLATION_11": "If you ask them, ‘Who created the heavens and the earth?’ they will surely say, ‘The All-mighty, the All-knowing created them.’\n",
        "TRANSLATION_12": "If thou wert to question them, 'Who created the heavens and the earth?' They would be sure to reply, 'they were created by (Him), the Exalted in Power, Full of Knowledge';-\n",
        "TRANSLATION_13": "And indeed if you ask them, \"Who has created the heavens and the earth?\" They will surely say: \"The All-Mighty, the All-Knower created them.\"\n",
        "TRANSLATION_14": "Yet, if you ask them who created the heavens and the earth, they will answer: 'The Almighty, the Knower created them'\n",
        "TRANSLATION_15": "And if you asked them, “Who created the heavens and the earth?” They would say, “The Mighty, the Knower created them.”\n",
        "TRANSLATION_16": "And if you should ask them, \"Who has created the heavens and the earth?\" they would surely say, \"They were created by the Exalted in Might, the Knowing.\"\n",
        "TRANSLATION_17": "[43:9] And if (wa-la-in: the lām is for oaths) you ask them, ‘Who created the heavens and the earth?’ they will surely say (the indicative nūn has been omitted because of the other nūn coming after it, and likewise the wāw [replaced by the damma in -lunna], because of two unvowelled consonants coming together), ‘The Mighty, the Knower created them’ — [this would have to be] their eventual response, that is to say, God [created them], Lord of Might and Knowledge. God, exalted be He, adds:\n",
        "TRANSLATION_18": "565 (And if thou (Muhammad) ask them) i.e. the disbelievers of Mecca: (Who created the heavens and the earth, they) i.e. the disbelievers of Mecca (will surely answer: The Mighty) in His dominion and sovereignty, (the Knower) of His providence and created beings (created them);\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "43:9",
            "20:4",
            "21:4",
            "57:1",
            "17:55",
            "61:1",
            "59:1",
            "43:84",
            "44:29",
            "52:36"
        ],
        "BIBLE": [
            "torah:genesis:14:19",
            "prophets:jeremiah:10:11",
            "writings:psalms:57:6",
            "writings:psalms:108:6",
            "writings:psalms:57:12",
            "prophets:zechariah:4:13",
            "writings:psalms:46:11",
            "writings:daniel:4:32",
            "writings:ii%20chronicles:1:11",
            "writings:ii%20chronicles:20:6"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:1"
        ]
    }
}