{
    "VERSE": "110:2",
    "ARABIC": "وَرَأَيْتَ ٱلنَّاسَ يَدْخُلُونَ فِى دِينِ ٱللَّهِ أَفْوَاجًا",
    "ENGLISH": {
        "TRANSLATION_0": "and you have seen people entering Allah's deen in droves,",
        "TRANSLATION_1": "And you see men enter God's discipline horde on horde,\n",
        "TRANSLATION_2": "and you see people entering Allah's religion in multitudes,\n",
        "TRANSLATION_3": "you will see large groups of people embracing the religion of God.\n",
        "TRANSLATION_4": "And you see people entering the religion of Allah in multitudes,\n",
        "TRANSLATION_5": "And you see that the people enter Allah's religion in crowds.\n",
        "TRANSLATION_6": "And you see men entering the religion of Allah in companies,\n",
        "TRANSLATION_7": "and thou seest men entering God's religion in throngs,\n",
        "TRANSLATION_8": "And thou seest mankind entering the religion of Allah in troops,\n",
        "TRANSLATION_9": "and you see people entering God's religion in multitudes,\n",
        "TRANSLATION_10": "And thou beholdest mankind entering the religion of Allah in crowds,\n",
        "TRANSLATION_11": "and you see the people entering Allah’s religion in throngs,\n",
        "TRANSLATION_12": "And thou dost see the people enter Allah's Religion in crowds,\n",
        "TRANSLATION_13": "And you see that the people enter Allah's religion (Islam) in crowds,\n",
        "TRANSLATION_14": "and you see people embracing the Religion of Allah in throngs,\n",
        "TRANSLATION_15": "And you see the people entering God’s religion in multitudes.\n",
        "TRANSLATION_16": "And you see the people entering into the religion of Allah in multitudes,\n",
        "TRANSLATION_17": "[110:2] and you see people entering God’s religion, that is to say, Islam, in throngs, in large droves, after they had been entering one by one — this was after the conquest of Mecca, when the Arabs from all corners of the   land came to him willingly [in obedience to his command] —\n",
        "TRANSLATION_18": "And thou seest mankind) the people of Yemen and others (entering the religion of Allah) Islam (in troops) entire groups at a time, when this happens, know that you will die.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "110:2",
            "40:14",
            "39:14",
            "39:11",
            "10:44",
            "24:25",
            "10:104",
            "60:8",
            "4:108",
            "114:3"
        ],
        "BIBLE": [
            "prophets:ezekiel:26:7",
            "prophets:isaiah:29:14",
            "writings:ruth:3:11",
            "prophets:ezekiel:32:3",
            "prophets:jeremiah:32:38",
            "writings:psalms:90:1",
            "torah:genesis:31:50",
            "writings:job:5:17",
            "prophets:ii%20samuel:17:3",
            "writings:proverbs:26:12"
        ]
    }
}