{
    "VERSE": "91:13",
    "ARABIC": "فَقَالَ لَهُمْ رَسُولُ ٱللَّهِ نَاقَةَ ٱللَّهِ وَسُقْيَٰهَا",
    "ENGLISH": {
        "TRANSLATION_0": "and the Messenger of Allah had said to them, 'This is the she-camel of Allah, so let her drink!'",
        "TRANSLATION_1": "And the apostle of God had to tell them: \"This is God's she-camel, let her drink.\"\n",
        "TRANSLATION_2": "Then Allah's Messenger warned them: “Hands off the she-camel and her drink!”\n",
        "TRANSLATION_3": "The Messenger of God told them, \"This is a she-camel, belonging to God. Do not deprive her of her share of water\".\n",
        "TRANSLATION_4": "So the Noble Messenger of Allah said to them, “Stay away from the she camel of Allah, and from its turn to drink.”\n",
        "TRANSLATION_5": "But the Messenger of Allah said to them: \"Be cautious! That is the she-camel of Allah! (Do not harm it) and (bar it not from having) its drink!\"\n",
        "TRANSLATION_6": "So Allah's apostle said to them (Leave alone) Allah's she-camel, and (give) her (to) drink.\n",
        "TRANSLATION_7": "then the Messenger of God said to them, 'The She-camel of God; let her drink!'\n",
        "TRANSLATION_8": "And the messenger of Allah said: It is the she-camel of Allah, so let her drink!\n",
        "TRANSLATION_9": "Then the messenger of God said to them, \"This is God's she-camel. Let her drink.\"\n",
        "TRANSLATION_10": "Then the apostle of Allah said Unto them: beware of the she-camel of Allah and her drink.\n",
        "TRANSLATION_11": "The apostle of Allah had told them, ‘This is Allah’s she-camel, let her drink!’\n",
        "TRANSLATION_12": "But the Messenger of Allah said to them: \"It is a She-camel of Allah! And (bar her not from) having her drink!\"\n",
        "TRANSLATION_13": "But the Messenger of Allah [Salih (Saleh)] said to them: \"Be cautious! Fear the evil end. That is the she-camel of Allah! (Do not harm it) and bar it not from having its drink!\"\n",
        "TRANSLATION_14": "the Messenger of Allah said to them: '(This is) the shecamel of Allah, let her drink'\n",
        "TRANSLATION_15": "The messenger of God said to them, “This is the she-camel of God, so let her drink.”\n",
        "TRANSLATION_16": "And the messenger of Allah [Salih] said to them, \"[Do not harm] the she-camel of Allah or [prevent her from] her drink.\"\n",
        "TRANSLATION_17": "[91:13] But then the messenger of God, Sālih, said to them, ‘[This is] the she-camel of God, so let her have her drink!’, her drink on her day — one day was hers, the next theirs.\n",
        "TRANSLATION_18": "(And the messenger of Allah) Salih (said) that is before they hamstrung the she-camel: (It is the she-camel of Allah) leave the she-camel of Allah alone, (so let her drink!) i.e. and let her drink in peace!\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "91:13",
            "24:52",
            "53:62",
            "3:132",
            "4:61",
            "64:8",
            "4:14",
            "8:1",
            "98:2",
            "63:5"
        ],
        "BIBLE": [
            "prophets:i%20samuel:23:7",
            "prophets:i%20samuel:14:43",
            "writings:nehemiah:2:18",
            "torah:numbers:20:19",
            "prophets:ezekiel:21:12",
            "writings:i%20chronicles:21:17",
            "writings:daniel:12:6",
            "torah:genesis:40:8",
            "prophets:ii%20kings:3:11",
            "torah:exodus:4:2"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:6:3"
        ]
    }
}