{
    "VERSE": "91:8",
    "ARABIC": "فَأَلْهَمَهَا فُجُورَهَا وَتَقْوَىٰهَا",
    "ENGLISH": {
        "TRANSLATION_0": "and inspired it with depravity or taqwa,",
        "TRANSLATION_1": "And given the faculty of knowing what is disruptive and what is intrinsic to it.\n",
        "TRANSLATION_2": "and imbued it with (the consciousness of) its evil and its piety:\n",
        "TRANSLATION_3": "and inspired it with knowledge of evil and piety,\n",
        "TRANSLATION_4": "And inspired in it the knowledge of its sins and its piety.\n",
        "TRANSLATION_5": "Then He showed it its Fujur and its Taqwa.\n",
        "TRANSLATION_6": "Then He inspired it to understand what is right and wrong for it;\n",
        "TRANSLATION_7": "and inspired it to lewdness and godfearing!\n",
        "TRANSLATION_8": "And inspired it (with conscience of) what is wrong for it and (what is) right for it.\n",
        "TRANSLATION_9": "then inspired it to understand what was right and wrong for it.\n",
        "TRANSLATION_10": "And inspired it with the wickedness thereof and the piety thereof,\n",
        "TRANSLATION_11": "and inspired it with [discernment between] its virtues and vices:\n",
        "TRANSLATION_12": "And its enlightenment as to its wrong and its right;-\n",
        "TRANSLATION_13": "Then He showed him what is wrong for him and what is right for him;\n",
        "TRANSLATION_14": "and inspired it with its sin and its piety,\n",
        "TRANSLATION_15": "And inspired it with its wickedness and its righteousness.\n",
        "TRANSLATION_16": "And inspired it [with discernment of] its wickedness and its righteousness,\n",
        "TRANSLATION_17": "[91:8] and inspired to discern its vices and piety, He pointed out to it the path of good and that of evil (the placing of taqwā, ‘piety’, second takes into account the [rhyme] endings of the verses; the response to the oath is [the following:])\n",
        "TRANSLATION_18": "(And inspired it (with conscience of) what is wrong for it and (what is) right for it) He made known to it and explained what it should go for and what it should avoid; Allah swore by all these things as well as by Himself.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "91:8",
            "92:17",
            "47:17",
            "96:12",
            "93:7",
            "93:8",
            "74:56",
            "25:76",
            "25:66",
            "22:32"
        ],
        "BIBLE": [
            "prophets:jeremiah:11:18",
            "prophets:i%20kings:3:9",
            "torah:deuteronomy:21:17",
            "writings:job:9:24",
            "writings:job:38:36",
            "writings:psalms:72:1",
            "torah:genesis:39:21",
            "writings:daniel:1:17",
            "writings:psalms:112:9",
            "prophets:ezekiel:16:52"
        ]
    }
}