{
    "VERSE": "69:14",
    "ARABIC": "وَحُمِلَتِ ٱلْأَرْضُ وَٱلْجِبَالُ فَدُكَّتَا دَكَّةً وَٰحِدَةً",
    "ENGLISH": {
        "TRANSLATION_0": "and the earth and the mountains are lifted and crushed with a single blow,",
        "TRANSLATION_1": "And the earth and mountains heaved and crushed to powder with one levelling blow,\n",
        "TRANSLATION_2": "and the earth and the mountains are carried aloft and are crushed to bits at one stroke,\n",
        "TRANSLATION_3": "the earth and mountains will be raised up high and crushed all together.\n",
        "TRANSLATION_4": "And the earth and the mountains will be lifted up and crushed with a single crush.\n",
        "TRANSLATION_5": "And the earth and the mountains shall be removed from their places, and crushed with a single crushing.\n",
        "TRANSLATION_6": "And the earth and the mountains are borne away and crushed with a single crushing.\n",
        "TRANSLATION_7": "and the earth and the mountains are lifted up and crushed with a single blow,\n",
        "TRANSLATION_8": "And the earth with the mountains shall be lifted up and crushed with one crash,\n",
        "TRANSLATION_9": "and the earth and the mountains are lifted up and then crushed with a single blow,\n",
        "TRANSLATION_10": "And the earth and the mountains shall be borne and the twain shall be crushed with a single crash.\n",
        "TRANSLATION_11": "and the earth and the mountains are lifted and levelled with a single levelling,\n",
        "TRANSLATION_12": "And the earth is moved, and its mountains, and they are crushed to powder at one stroke,-\n",
        "TRANSLATION_13": "And the earth and the mountains shall be removed from their places, and crushed with a single crushing,\n",
        "TRANSLATION_14": "when the earth with all its mountains is lifted up and crushed with a single blow,\n",
        "TRANSLATION_15": "And the earth and the mountains are lifted up, and crushed, with a single crush.\n",
        "TRANSLATION_16": "And the earth and the mountains are lifted and leveled with one blow -\n",
        "TRANSLATION_17": "[69:14] and the earth and the mountains are lifted and levelled with a single levelling,\n",
        "TRANSLATION_18": "(And the earth with the mountains) it is said: what is on the earth of buildings and the mountains (shall be lifted up and crushed with one crash,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "69:14",
            "18:47",
            "73:14",
            "17:37",
            "19:90",
            "79:32",
            "91:6",
            "77:10",
            "84:3",
            "81:3"
        ],
        "BIBLE": [
            "writings:daniel:11:12",
            "writings:daniel:2:35",
            "prophets:isaiah:46:7",
            "prophets:isaiah:40:4",
            "prophets:jeremiah:27:22",
            "prophets:jeremiah:29:14",
            "prophets:ii%20kings:17:11",
            "prophets:isaiah:57:13",
            "writings:psalms:107:25",
            "torah:deuteronomy:14:24"
        ]
    }
}