{
    "VERSE": "69:17",
    "ARABIC": "وَٱلْمَلَكُ عَلَىٰٓ أَرْجَآئِهَا وَيَحْمِلُ عَرْشَ رَبِّكَ فَوْقَهُمْ يَوْمَئِذٍ ثَمَٰنِيَةٌ",
    "ENGLISH": {
        "TRANSLATION_0": "The angels will be gathered round its edge. On that Day, eight will bear the Throne of their Lord above their heads.",
        "TRANSLATION_1": "On its fringes will be angels, eight of them, bearing their Lord's throne aloft.\n",
        "TRANSLATION_2": "and the angels will stand on the sides, with eight of them bearing aloft the Throne of your Lord on that Day.\n",
        "TRANSLATION_3": "and will turn frail, losing all force. The angels will be around the heavens and on that day eight of them will carry the Throne of your Lord above all the creatures.\n",
        "TRANSLATION_4": "And the angels will be on its sides; and on that day, eight angels will carry the Throne of your Lord above them.\n",
        "TRANSLATION_5": "And the angels will be on its sides, and eight angels will, that Day, bear the Throne of your Lord above them.\n",
        "TRANSLATION_6": "And the angels shall be on the sides thereof; and above them eight shall bear on that day your Lord's power.\n",
        "TRANSLATION_7": "and the angels shall stand upon its borders, and upon that day eight shall carry above them the Throne of thy Lord.\n",
        "TRANSLATION_8": "And the angels will be on the sides thereof, and eight will uphold the Throne of thy Lord that day, above them.\n",
        "TRANSLATION_9": "The angels will appear by its sides and, on that Day, eight [angels] will bear your Lord's throne above them.\n",
        "TRANSLATION_10": "And the angels shall be on the borders thereof; and on that Day eight shall bear over them the Throne of thy Lord.\n",
        "TRANSLATION_11": "with the angels all over it, and the Throne of your Lord will be borne that day by eight [angels].\n",
        "TRANSLATION_12": "And the angels will be on its sides, and eight will, that Day, bear the Throne of thy Lord above them.\n",
        "TRANSLATION_13": "And the angels will be on its sides, and eight angels will, that Day, bear the Throne of your Lord above them.\n",
        "TRANSLATION_14": "The angels will stand on all its sides. And on that Day, eight (of them) will carry the Throne of your Lord above them.\n",
        "TRANSLATION_15": "And the angels will be ranged around its borders, while eight will be carrying the Throne of your Lord above them that Day.\n",
        "TRANSLATION_16": "And the angels are at its edges. And there will bear the Throne of your Lord above them, that Day, eight [of them].\n",
        "TRANSLATION_17": "[69:17] and the angels will be [all] over its borders, the edges of the heavens, and above them — the angels that have been mentioned — on that day eight, angels or [eight] files of them, will carry the Throne of your Lord.\n",
        "TRANSLATION_18": "(And the angels will be on the sides thereof) on its extremities, sides, different directions and parts (and eight) He says: eight different angels, each one of them has four different faces: a human face, a face of an eagle, a face of a lion, and a face of a bull; and it is also said: eight rows; and it is also said: eight parts of the Cherubim, who dwell on the seventh heaven (will uphold the Throne of their Lord that day) the Day of Judgement, (above them) on their necks.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "69:17",
            "89:22",
            "16:50",
            "8:12",
            "39:75",
            "38:71",
            "43:77",
            "32:11",
            "97:4",
            "18:42"
        ],
        "BIBLE": [
            "prophets:jeremiah:29:14",
            "prophets:jeremiah:27:22",
            "torah:exodus:27:7",
            "prophets:isaiah:39:6",
            "prophets:ii%20kings:20:17",
            "prophets:isaiah:49:22",
            "writings:lamentations:5:21",
            "prophets:isaiah:63:9",
            "torah:deuteronomy:31:18",
            "prophets:jeremiah:29:7"
        ],
        "KABBALAH": [
            
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:4:3"
        ]
    }
}