{
    "VERSE": "69:18",
    "ARABIC": "يَوْمَئِذٍ تُعْرَضُونَ لَا تَخْفَىٰ مِنكُمْ خَافِيَةٌ",
    "ENGLISH": {
        "TRANSLATION_0": "On that Day you will be exposed - no concealed act you did will stay concealed.",
        "TRANSLATION_1": "You will then be set before Him, and not one of you will remain unexposed.\n",
        "TRANSLATION_2": "That will be the Day when you shall be brought forth (before Allah) and no secret of yours shall remain hidden.\n",
        "TRANSLATION_3": "On that day all your secrets will be exposed.\n",
        "TRANSLATION_4": "On that day all of you will be brought forth, so none among you wishing to hide will be able to hide.\n",
        "TRANSLATION_5": "That Day shall you be brought to Judgement, not a secret of you will be hidden.\n",
        "TRANSLATION_6": "On that day you shall be exposed to view-- no secret of yours shall remain hidden.\n",
        "TRANSLATION_7": "On that day you shall be exposed, not one secret of yours concealed.\n",
        "TRANSLATION_8": "On that day ye will be exposed; not a secret of you will be hidden.\n",
        "TRANSLATION_9": "On that Day you will be brought to judgement and none of your secrets will remain hidden.\n",
        "TRANSLATION_10": "The Day whereon ye shall be mustered nothing hidden by you shall be hidden.\n",
        "TRANSLATION_11": "That day you will be presented [before your Lord]: none of your secrets will remain hidden.\n",
        "TRANSLATION_12": "That Day shall ye be brought to Judgment: not an act of yours that ye hide will be hidden.\n",
        "TRANSLATION_13": "That Day shall you be brought to Judgement, not a secret of you will be hidden.\n",
        "TRANSLATION_14": "On that Day you shall be exposed, and no secret of yours will remain hidden.\n",
        "TRANSLATION_15": "On that Day you will be exposed, and no secret of yours will remain hidden.\n",
        "TRANSLATION_16": "That Day, you will be exhibited [for judgement]; not hidden among you is anything concealed.\n",
        "TRANSLATION_17": "[69:18] On that day you will be exposed, before the Reckoning. No hidden thing of yours, in the way of secrets, will remain hidden (read [feminine person] takhfā or [masculine person] yakhfā).\n",
        "TRANSLATION_18": "(On that day) which is the Day of Judgement (ye will be exposed) you will stand before your Lord three times: once for reckoning and presenting excuses, once for settling disputes and retaliation and once for the handing over of the scroll of one's deeds and reading them; (not a secret of you will be hidden) none of you will be left out; it is also said this means: no one's secret will be hidden from Allah; it is also said that this means: none of your works will be hidden from Allah.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "69:18",
            "88:11",
            "77:48",
            "37:25",
            "37:92",
            "26:177",
            "109:4",
            "74:43",
            "52:8",
            "109:2"
        ],
        "BIBLE": [
            "torah:leviticus:27:11",
            "torah:numbers:5:16",
            "prophets:judges:6:18",
            "torah:leviticus:24:8",
            "prophets:jeremiah:26:4",
            "torah:deuteronomy:11:32",
            "writings:ii%20chronicles:26:5",
            "torah:numbers:10:34",
            "torah:leviticus:2:8",
            "torah:genesis:19:16"
        ]
    }
}