{
    "VERSE": "69:24",
    "ARABIC": "كُلُوا۟ وَٱشْرَبُوا۟ هَنِيٓـًٔۢا بِمَآ أَسْلَفْتُمْ فِى ٱلْأَيَّامِ ٱلْخَالِيَةِ",
    "ENGLISH": {
        "TRANSLATION_0": "'Eat and drink with relish for what you did before in days gone by!'",
        "TRANSLATION_1": "(And told:) \"Eat and drink to your fill as reward for (good) deeds you had done in days of yore.\"\n",
        "TRANSLATION_2": "(They will be told): “Eat and drink with good cheer as a reward for the good deeds you did in the days that have passed by.”\n",
        "TRANSLATION_3": "Such people will be told, \"Eat and drink with pleasure as the reward for what you did in the past\".\n",
        "TRANSLATION_4": "“Eat and drink with pleasure – the reward of what you sent ahead, in the past days.”\n",
        "TRANSLATION_5": "Eat and drink at ease for that which you have sent on before you in days past!\n",
        "TRANSLATION_6": "Eat and drink pleasantly for what you did beforehand in the days gone by.\n",
        "TRANSLATION_7": "Eat and drink with wholesome appetite for that you did long ago, in the days gone by.'\n",
        "TRANSLATION_8": "(And it will be said unto those therein): Eat and drink at ease for that which ye sent on before you in past days.\n",
        "TRANSLATION_9": "We shall say to him, \"Eat and drink joyfully as a reward for the good deeds you did in days gone by.\"\n",
        "TRANSLATION_10": "Eat and drink with benefit for that which ye sent on beforehand in dayspast.\n",
        "TRANSLATION_11": "[He will be told]: ‘Enjoy your food and drink, for what you had sent in advance in past days [for your future life].’\n",
        "TRANSLATION_12": "Eat ye and drink ye, with full satisfaction; because of the (good) that ye sent before you, in the days that are gone!\"\n",
        "TRANSLATION_13": "Eat and drink at ease for that which you have sent on before you in days past!\n",
        "TRANSLATION_14": "(It will be said): 'Eat and drink with a good appetite because of what you did in days long passed'\n",
        "TRANSLATION_15": "“Eat and drink merrily for what you did in the days gone by.”\n",
        "TRANSLATION_16": "[They will be told], \"Eat and drink in satisfaction for what you put forth in the days past.\"\n",
        "TRANSLATION_17": "[69:24] And so it will be said to them: ‘Eat and drink in enjoyment (hanī’an is a circumstantial qualifier, that is to say, mutahanni’īna, ‘while you are enjoying [them]’) for what you did in advance in former days’, [in days] that have passed during the [life of the] world.\n",
        "TRANSLATION_18": "Allah will say to them: (Eat) of the fruits (and drink) from the rivers (at ease) fearing no sickness or death (for that which ye sent on before you) for that which you did of righteous works; and it is also said this means: for the fasting and prayers you offered, (in past days) i.e. in the days of the life of the world.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "69:24",
            "52:19",
            "77:43",
            "36:64",
            "36:59",
            "38:53",
            "85:2",
            "70:26",
            "74:46",
            "23:111"
        ],
        "BIBLE": [
            "writings:ecclesiastes:5:17",
            "writings:nehemiah:8:10",
            "prophets:i%20samuel:14:33",
            "torah:genesis:26:32",
            "prophets:ii%20kings:2:21",
            "torah:deuteronomy:9:9",
            "prophets:i%20kings:20:42",
            "prophets:i%20kings:18:1",
            "prophets:ii%20kings:2:9",
            "prophets:ii%20kings:10:9"
        ]
    }
}