{
    "VERSE": "69:3",
    "ARABIC": "وَمَآ أَدْرَىٰكَ مَا ٱلْحَآقَّةُ",
    "ENGLISH": {
        "TRANSLATION_0": "What will convey to you what the Undeniable is?",
        "TRANSLATION_1": "What do you comprehend by the concrete reality?\n",
        "TRANSLATION_2": "And what do you know what that indubitable event is?\n",
        "TRANSLATION_3": "Would that you knew (in detail) what the Inevitable is!\n",
        "TRANSLATION_4": "And what have you understood, how tremendous the true event is!\n",
        "TRANSLATION_5": "And what will make you know what Al-Haqqah is\n",
        "TRANSLATION_6": "And what would make you realize what the sure calamity is!\n",
        "TRANSLATION_7": "And what will teach thee what is the Indubitable?\n",
        "TRANSLATION_8": "Ah, what will convey unto thee what the reality is!\n",
        "TRANSLATION_9": "And what will make you realize what the Inevitable Hour is?\n",
        "TRANSLATION_10": "And what shall make thee know that which the Inevitable Calamity is.\n",
        "TRANSLATION_11": "What will show you what is the Besieger?!\n",
        "TRANSLATION_12": "And what will make thee realise what the Sure Reality is?\n",
        "TRANSLATION_13": "And what will make you know what the Reality is?\n",
        "TRANSLATION_14": "What makes you to know what the Resurrection Verifier is?\n",
        "TRANSLATION_15": "What will make you understand what the Reality is?\n",
        "TRANSLATION_16": "And what can make you know what is the Inevitable Reality?\n",
        "TRANSLATION_17": "[69:3] And how would you know what the Reality is? ([repeated as] an extra emphasis of its enormity; the first mā [of the previous verse] is the subject, the second one, its predicate; the second mā and its predicate also function as the second direct object of [the verb] ‘knowing’).\n",
        "TRANSLATION_18": "(Ah, what will convey unto thee) O Muhammad (what the reality is!) it is called the Reality because of the reality of things which will entitle the believer to enter the Garden due to his faith and the disbeliever to enter the Fire because of his disbelief.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "69:3",
            "86:2",
            "101:10",
            "53:53",
            "7:120",
            "104:5",
            "101:3",
            "90:12",
            "74:27",
            "26:219"
        ],
        "BIBLE": [
            "prophets:i%20samuel:16:3",
            "prophets:i%20samuel:28:2",
            "writings:daniel:10:14",
            "writings:daniel:8:19",
            "writings:job:10:2",
            "prophets:isaiah:38:19",
            "writings:daniel:5:15",
            "prophets:ezekiel:35:9",
            "writings:psalms:115:8",
            "writings:psalms:135:18"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:5:1"
        ]
    }
}