{
    "VERSE": "69:47",
    "ARABIC": "فَمَا مِنكُم مِّنْ أَحَدٍ عَنْهُ حَٰجِزِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "and not one of you could have protected him.",
        "TRANSLATION_1": "And not one of you would have been able to stop (Us).\n",
        "TRANSLATION_2": "and not one of you would have been able to withhold Us from doing so.\n",
        "TRANSLATION_3": "None of you would be able to prevent Us from doing this to him.\n",
        "TRANSLATION_4": "Then none among you would be his saviour.\n",
        "TRANSLATION_5": "And none of you could have prevented it from him.\n",
        "TRANSLATION_6": "And not one of you could have withheld Us from him.\n",
        "TRANSLATION_7": "and not one of you could have defended him.\n",
        "TRANSLATION_8": "And not one of you could have held Us off from him.\n",
        "TRANSLATION_9": "and none of you could have held Us off from him.\n",
        "TRANSLATION_10": "And not one of you would have withheld us from punishing him.\n",
        "TRANSLATION_11": "and none of you could have held Us off from him.\n",
        "TRANSLATION_12": "Nor could any of you withhold him (from Our wrath).\n",
        "TRANSLATION_13": "And none of you could withhold Us from (punishing) him.\n",
        "TRANSLATION_14": "not one of you could have prevented it from him.\n",
        "TRANSLATION_15": "And none of you could have restrained Us from him.\n",
        "TRANSLATION_16": "And there is no one of you who could prevent [Us] from him.\n",
        "TRANSLATION_17": "[69:47] and not one of you (ahadin is the subject of mā, min being extra, used to emphasise the negation; minkum is a circumstantial qualifier referring to ahadin) could have defended him (hājizīna is the predicate of [the preceding] mā, and it is used in the plural because ahad, when employed in a negatory context, denotes a plural sense; the [suffixed] pronoun in ‘anhu refers to the Prophet), in other words, there is none to prevent Us from punishing him.\n",
        "TRANSLATION_18": "(And not one of you could have held Us off from him) He says: no one of you could have held Us back from Muhammad (pbuh).\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "69:47",
            "90:5",
            "72:26",
            "90:7",
            "26:100",
            "89:25",
            "92:19",
            "51:54",
            "72:7",
            "89:26"
        ],
        "BIBLE": [
            "writings:job:13:19",
            "prophets:joel:4:21",
            "writings:job:13:5",
            "prophets:isaiah:42:14",
            "writings:esther:7:4",
            "torah:exodus:9:2",
            "writings:proverbs:3:18",
            "writings:esther:8:4",
            "writings:nehemiah:5:8",
            "prophets:isaiah:57:11"
        ]
    }
}