{
    "VERSE": "69:49",
    "ARABIC": "وَإِنَّا لَنَعْلَمُ أَنَّ مِنكُم مُّكَذِّبِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "We know that some of you will deny it.",
        "TRANSLATION_1": "We certainly know that some among you do deny it.\n",
        "TRANSLATION_2": "We certainly know that some among you will give the lie to it,\n",
        "TRANSLATION_3": "We certainly know that some of you have rejected it\n",
        "TRANSLATION_4": "And indeed We know that some among you are deniers.\n",
        "TRANSLATION_5": "And verily, We know that there are some among you that deny.\n",
        "TRANSLATION_6": "And most surely We know that some of you are rejecters.\n",
        "TRANSLATION_7": "but We know that some of you will cry lies.\n",
        "TRANSLATION_8": "And lo! We know that some among you will deny (it).\n",
        "TRANSLATION_9": "We know very well that there are some among you who reject Our signs --\n",
        "TRANSLATION_10": "And verily We! We know that some among you are beliers thereof.\n",
        "TRANSLATION_11": "Indeed We know that there are some among you who deny [it].\n",
        "TRANSLATION_12": "And We certainly know that there are amongst you those that reject (it).\n",
        "TRANSLATION_13": "And verily, We know that there are some among you that belie (this Quran). [Tafsir At-Tabari, Vol. 29, Page 68]\n",
        "TRANSLATION_14": "We know that there are some among you who will belie.\n",
        "TRANSLATION_15": "And We know that some of you will reject it.\n",
        "TRANSLATION_16": "And indeed, We know that among you are deniers.\n",
        "TRANSLATION_17": "[69:49] And assuredly We know that some of you, O people, are deniers, of the Qur’ān, and [some of you are] believers [in it].\n",
        "TRANSLATION_18": "(And lo! We know that some among you will deny (it)) We know that some among you disbelieve in the 691 Qur'an while others believe in it.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "69:49",
            "37:137",
            "7:114",
            "11:122",
            "15:9",
            "15:23",
            "15:24",
            "26:42",
            "7:21",
            "37:165"
        ],
        "BIBLE": [
            "prophets:ezekiel:20:20",
            "prophets:jeremiah:44:29",
            "prophets:ezekiel:24:24",
            "torah:exodus:10:2",
            "torah:numbers:14:31",
            "prophets:amos:3:2",
            "torah:numbers:32:23",
            "torah:exodus:31:13",
            "prophets:hosea:8:2",
            "prophets:ezekiel:20:12"
        ]
    }
}