{
    "VERSE": "69:50",
    "ARABIC": "وَإِنَّهُۥ لَحَسْرَةٌ عَلَى ٱلْكَٰفِرِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "It is a cause of great distress to those who are kafir.",
        "TRANSLATION_1": "It is surely the nemesis of unbelievers.\n",
        "TRANSLATION_2": "and surely it will be a cause of regret for the unbelievers.\n",
        "TRANSLATION_3": "and (on the Day of Judgment) this will be a great source of regret for the unbelievers.\n",
        "TRANSLATION_4": "And indeed it is a despair for the disbelievers.\n",
        "TRANSLATION_5": "And indeed it will be an anguish for the disbelievers.\n",
        "TRANSLATION_6": "And most surely it is a great grief to the unbelievers.\n",
        "TRANSLATION_7": "Surely it is a sorrow to the unbelievers;\n",
        "TRANSLATION_8": "And lo! it is indeed an anguish for the disbelievers.\n",
        "TRANSLATION_9": "it will be a source of bitter regret for those who deny the truth --\n",
        "TRANSLATION_10": "And verily it shall be an occasion of anguish Unto the infidels.\n",
        "TRANSLATION_11": "And indeed it will be a [matter of] regret for the faithless.\n",
        "TRANSLATION_12": "But truly (Revelation) is a cause of sorrow for the Unbelievers.\n",
        "TRANSLATION_13": "And indeed it (this Quran) will be an anguish for the disbelievers (on the Day of Resurrection).\n",
        "TRANSLATION_14": "Indeed, it is a sorrow to the unbelievers\n",
        "TRANSLATION_15": "And it is surely a source of grief for the unbelievers.\n",
        "TRANSLATION_16": "And indeed, it will be [a cause of] regret upon the disbelievers.\n",
        "TRANSLATION_17": "[69:50] And assuredly it, that is, the Qur’ān, is a [cause of] anguish for the disbelievers, when they see the reward of those who affirmed its truth and the punishment of those who denied it.\n",
        "TRANSLATION_18": "(And lo! It) i.e. the Qur'an (is indeed an anguish) a remorse (for the disbelievers) on the Day of Judgement.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "69:50",
            "37:165",
            "37:166",
            "15:9",
            "15:23",
            "15:6",
            "37:123",
            "37:133",
            "37:137",
            "37:139"
        ],
        "BIBLE": [
            "torah:leviticus:23:27",
            "torah:exodus:22:8",
            "torah:deuteronomy:29:27",
            "torah:numbers:29:1",
            "torah:exodus:31:15",
            "writings:ecclesiastes:8:6",
            "writings:ezra:10:9",
            "writings:ii%20chronicles:21:15",
            "torah:exodus:22:18",
            "torah:leviticus:16:29"
        ]
    }
}