{
    "VERSE": "69:9",
    "ARABIC": "وَجَآءَ فِرْعَوْنُ وَمَن قَبْلَهُۥ وَٱلْمُؤْتَفِكَٰتُ بِٱلْخَاطِئَةِ",
    "ENGLISH": {
        "TRANSLATION_0": "Pharaoh and those before him and the Overturned Cities made a great mistake.",
        "TRANSLATION_1": "Then came the Pharaoh, and those before him whose habitations were overthrown while they were committing crimes.\n",
        "TRANSLATION_2": "Pharaoh and those before him and the people of the overturned habitations all engaged in the same great sin.\n",
        "TRANSLATION_3": "The Pharaoh, those who lived before him and the people of the Subverted Cities all persisted in doing evil.\n",
        "TRANSLATION_4": "And Firaun, and those before him, and the dwellings that were inverted and thrown, had brought error.\n",
        "TRANSLATION_5": "And Fir`awn, and those before him, and the cities overthrown committed Al-Khati'ah.\n",
        "TRANSLATION_6": "And Firon and those before him and the overthrown cities continuously committed sins.\n",
        "TRANSLATION_7": "Pharaoh likewise, and those before him, and the Subverted Cities -- they committed error,\n",
        "TRANSLATION_8": "And Pharaoh and those before him, and the communities that were destroyed, brought error,\n",
        "TRANSLATION_9": "Pharoah and those before him and the inhabitants of the overthrown cities persistently committed grave sins.\n",
        "TRANSLATION_10": "And Fir'awn and those before him and the overturned cities committed sin.\n",
        "TRANSLATION_11": "Then Pharaoh and those who were before him, and the towns that were overturned, brought about iniquity.\n",
        "TRANSLATION_12": "And Pharaoh, and those before him, and the Cities Overthrown, committed habitual Sin.\n",
        "TRANSLATION_13": "And Fir'aun (Pharaoh), and those before him, and the cities overthrown [the towns of the people of [Lout (Lot)] committed sin,\n",
        "TRANSLATION_14": "Similarly, Pharaoh, and those before him, and the ruined villages, sinned\n",
        "TRANSLATION_15": "Then Pharaoh came, and those before him, and the Overturned Cities steeped in sin.\n",
        "TRANSLATION_16": "And there came Pharaoh and those before him and the overturned cities with sin.\n",
        "TRANSLATION_17": "[69:9] And Pharaoh and those of his followers (man qibalahu: a variant reading has man qablahu, that is to say, those disbelieving communities who came before him) and the Deviant [cities], that is, their inhabitants — these being the cities of the people of Lot — brought iniquity, [they committed] deeds that were iniquitous.\n",
        "TRANSLATION_18": "(And Pharaoh and those before him) and Pharaoh and his army came to the sea and were drowned in it; it is also said this means: Pharaoh also uttered the words of idolatry as did the nations before him, (and the communities that were destroyed) and also the townships of Lot swallowed by the earth, (brought error) they uttered the words of idolatry,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "69:9",
            "2:4",
            "10:91",
            "28:52",
            "41:48",
            "28:53",
            "29:3",
            "43:21",
            "21:51",
            "30:49"
        ],
        "BIBLE": [
            "torah:genesis:19:29",
            "prophets:ii%20samuel:20:15",
            "writings:i%20chronicles:4:33",
            "prophets:i%20kings:18:30",
            "prophets:jeremiah:16:10",
            "prophets:ezekiel:26:17",
            "writings:ii%20chronicles:30:27",
            "torah:genesis:19:25",
            "writings:job:42:11",
            "writings:lamentations:4:6"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:1:13",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:5:1"
        ]
    }
}