{
    "VERSE": "49:11",
    "ARABIC": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ لَا يَسْخَرْ قَوْمٌ مِّن قَوْمٍ عَسَىٰٓ أَن يَكُونُوا۟ خَيْرًا مِّنْهُمْ وَلَا نِسَآءٌ مِّن نِّسَآءٍ عَسَىٰٓ أَن يَكُنَّ خَيْرًا مِّنْهُنَّ وَلَا تَلْمِزُوٓا۟ أَنفُسَكُمْ وَلَا تَنَابَزُوا۟ بِٱلْأَلْقَٰبِ بِئْسَ ٱلِٱسْمُ ٱلْفُسُوقُ بَعْدَ ٱلْإِيمَٰنِ وَمَن لَّمْ يَتُبْ فَأُو۟لَٰٓئِكَ هُمُ ٱلظَّٰلِمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "You who have iman! people should not ridicule others who may be better than themselves; nor should any women ridicule other women who may be better than themselves. And do not find fault with one another or insult each other with derogatory nicknames. How evil it is to have a name for evil conduct after coming to iman! Those people who do not turn from it are wrongdoers.",
        "TRANSLATION_1": "O you who believe, men should not laugh at other men, for it may be they are better than them; and women should not laugh at other women, for they may perhaps be better than them. Do not slander one another, nor give one another nick-names. After believing, it is bad to give (another) a bad name. Those who do not repent behave wickedly.\n",
        "TRANSLATION_2": "Believers, let not a group (of men) scoff at another group, it may well be that the latter (at whom they scoff) are better than they; nor let a group of women scoff at another group, it may well be that the latter are better than they. And do not taunt one another, nor revile one another by nicknames. It is an evil thing to gain notoriety for ungodliness after belief. Those who do not repent are indeed the wrong-doers.\n",
        "TRANSLATION_3": "Believers, let not a group of you mock another. Perhaps they are better than you. Let not women mock each other; perhaps one is better than the other. Let not one of you find faults in another nor let anyone of you defame another. How terrible is the defamation after having true faith. Those who do not repent are certainly unjust.\n",
        "TRANSLATION_4": "O People who Believe! Men must not ridicule other men for it could be that the ridiculed are better than the mockers, nor must the women ridicule other women for the ridiculed women may be better than the mockers; and do not insult one another, nor assign evil nicknames; how base it is to be called a sinner after being a Muslim! And whoever does not repent – then it is they who are unjust.\n",
        "TRANSLATION_5": "O you who believe! Let not a group scoff at another group, it may be that the latter are better than the former. Nor let (some) women scoff at other women, it may be that the latter are better than the former. Nor defame yourselves, nor insult one another by nicknames. Evil is the name of wickedness after faith. And whosoever does not repent, then such are indeed wrongdoers.\n",
        "TRANSLATION_6": "O you who believe! let not (one) people laugh at (another) people perchance they may be better than they, nor let women (laugh) at (other) women, perchance they may be better than they; and do not find fault with your own people nor call one another by nicknames; evil is a bad name after faith, and whoever does not turn, these it is that are the unjust.\n",
        "TRANSLATION_7": "O believers, let not any people scoff at another people who may be better than they; neither let women scoff at women who may be better than themselves. And find not fault with one another, neither revile one another by nicknames. An evil name is ungodliness after belief. And whoso repents not, those -- they are the evildoers.\n",
        "TRANSLATION_8": "O ye who believe! Let not a folk deride a folk who may be better than they (are), not let women (deride) women who may be better than they are; neither defame one another, nor insult one another by nicknames. Bad is the name of lewdness after faith. And whoso turneth not in repentance, such are evil-doers.\n",
        "TRANSLATION_9": "Believers, let not some men among you ridicule others: it may be that the latter are better than the former: nor should some women laugh at others: it may be that the latter are better than the former: do not defame or be sarcastic to each other, or call each other by [offensive] nicknames. How bad it is to earn an evil reputation after accepting the faith! Those who do not repent are evil-doers.\n",
        "TRANSLATION_10": "O ye who believe! let not one group scoff at another group, belike they may be better than they are, nor let some women scoff at other women, belike they may be better than they are. And traduce not one another, nor revile one another by odious appellations! ill is the name of sin after belief. And whosoever will not repent, then those, they are the wrong-doers.\n",
        "TRANSLATION_11": "O you who have faith! Let not any people ridicule another people: it may be that they are better than they are; nor let women [ridicule] women: it may be that they are better than they are. And do not defame one another, nor insult one another by [calling] nicknames. How evil are profane names subsequent to faith! As for those who are not penitent [of their past conduct]—such are the wrongdoers.\n",
        "TRANSLATION_12": "O ye who believe! Let not some men among you laugh at others: It may be that the (latter) are better than the (former): Nor let some women laugh at others: It may be that the (latter are better than the (former): Nor defame nor be sarcastic to each other, nor call each other by (offensive) nicknames: Ill-seeming is a name connoting wickedness, (to be used of one) after he has believed: And those who do not desist are (indeed) doing wrong.\n",
        "TRANSLATION_13": "O you who believe! Let not a group scoff at another group, it may be that the latter are better than the former; nor let (some) women scoff at other women, it may be that the latter are better than the former, nor defame one another, nor insult one another by nicknames. How bad is it, to insult one's brother after having Faith [i.e. to call your Muslim brother (a faithful believer) as: \"O sinner\", or \"O wicked\", etc.]. And whosoever does not repent, then such are indeed Zalimun (wrong-doers, etc.).\n",
        "TRANSLATION_14": "Believers, do not let people mock other people who may be better than themselves. Do not let women mock women, who may be better than themselves. Do not find fault with one another, nor abuse one another with nicknames. An evil name is disobedience after belief. Those who do not repent are the harmdoers.\n",
        "TRANSLATION_15": "O you who believe! No people shall ridicule other people, for they may be better than they. Nor shall any women ridicule other women, for they may be better than they. Nor shall you slander one another, nor shall you insult one another with names. Evil is the return to wickedness after having attained faith. Whoever does not repent—these are the wrongdoers.\n",
        "TRANSLATION_16": "O you who have believed, let not a people ridicule [another] people; perhaps they may be better than them; nor let women ridicule [other] women; perhaps they may be better than them. And do not insult one another and do not call each other by [offensive] nicknames. Wretched is the name of disobedience after [one's] faith. And whoever does not repent - then it is those who are the wrongdoers.\n",
        "TRANSLATION_17": "[49:11] O you who believe, do not let any people, that is, any men among you, deride (yā ayyuhā’lladhīna āmanū lā yaskhar … [to the end of] the verse, was revealed regarding the [Banū] Tamīm delegation when they derided the poor among the Muslims, like ‘Ammār [b. Yāsir] and Suhayb [al-Rūmī]; al-sukhriya means ‘scorn’ and ‘disdain’) another people: who may be better than they are, in God’s sight; nor let any women, from among you, deride [other] women who may be better than they are. And do not defame one another, do not cast aspersions [on others] and hence have aspersions cast on you, that is, let none among you denigrate another; nor insult one another by nicknames, do not call another by a nickname which he detests, such as ‘O degenerate one!’ or ‘O disbeliever!’. Evil is the name, mentioned out of mockery, derision and mutual reviling, of immorality after faith! (al-fusūqu ba‘da’l-īmāni substitutes for al-ismu, ‘the name’, to indicate that it [such naming of others] is ‘immorality’ as it is [an action which is] usually repeated). And whoever does not repent, of such [immorality], those — they are the evildoers.\n",
        "TRANSLATION_18": "602 (0 ye who believe! Let not a folk deride a folk) this was revealed about Thabit Ibn Qays Ibn Shammas who mentioned a man of the Helpers with something bad; he mentioned the man's mother about whom he used to taunted in the pre-Islamic period, but Allah forbade him from saying ill things about fellow believers, saying: (0 ye who believe) in Muhammad (pbuh) and the Qur'an; referring here specifically to Thabit! (Let not a folk deride a folk who may be better than they (are)) in the sight of Allah and also better in the share they have with Him, (nor let women (deride) women) this was revealed about two of the wives of the Prophet (pbuh) who derided Umm Salamah, the wife of the Prophet, and Allah forbade them from doing so (who may be better than they are) in the sight of Allah and also better in the share they have with Him; (neither defame one another) do not defame your believing brothers nor backbite against each other, (nor insult one another by nicknames) which were used in the pre-Islamic period. (Bad is the name of lewdness) it is bad to call your brother: \"0 Jew\", \"0 Christian\", \"0 Magian\" (after faith) after having accepted faith and turned his back on all that. (And whoso turneth not in repentance) from calling his brothers with such names and nicknames after having accepted faith, (such are evil-doers) such are those who harm themselves with punishment. This was revealed about Abu Burdah Ibn Malik al-Ansari and 'Abdullah Ibn Hadrad al-Aslami who had a dispute and Allah forbade them from doing so.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "49:11",
            "2:54",
            "65:1",
            "4:19",
            "6:158",
            "20:85",
            "36:28",
            "9:88",
            "6:98",
            "24:60"
        ],
        "BIBLE": [
            "writings:ii%20chronicles:7:14",
            "prophets:ezekiel:18:30",
            "prophets:jeremiah:34:15",
            "writings:esther:4:11",
            "prophets:ii%20samuel:2:26",
            "prophets:ezekiel:3:20",
            "writings:daniel:9:16",
            "prophets:jeremiah:23:14",
            "prophets:judges:9:54",
            "prophets:isaiah:4:1"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:4:1"
        ]
    }
}