{
    "VERSE": "49:13",
    "ARABIC": "يَٰٓأَيُّهَا ٱلنَّاسُ إِنَّا خَلَقْنَٰكُم مِّن ذَكَرٍ وَأُنثَىٰ وَجَعَلْنَٰكُمْ شُعُوبًا وَقَبَآئِلَ لِتَعَارَفُوٓا۟ إِنَّ أَكْرَمَكُمْ عِندَ ٱللَّهِ أَتْقَىٰكُمْ إِنَّ ٱللَّهَ عَلِيمٌ خَبِيرٌ",
    "ENGLISH": {
        "TRANSLATION_0": "Mankind! We created you from a male and female, and made you into peoples and tribes so that you is All-Knowing, All-Aware.",
        "TRANSLATION_1": "O men, We created you from a male and female, and formed you into nations and tribes that you may recognise each other. He who has more integrity has indeed greater honour with God. Surely God is all-knowing and well-informed.\n",
        "TRANSLATION_2": "Human beings, We created you all from a male and a female, and made you into nations and tribes so that you may know one another. Verily the noblest of you in the sight of Allah is the most God-fearing of you. Surely Allah is All-Knowing, All-Aware.\n",
        "TRANSLATION_3": "People, We have created you all male and female and have made you nations and tribes so that you would recognize each other. The most honorable among you in the sight of God is the most pious of you. God is All-knowing and All-aware.\n",
        "TRANSLATION_4": "O mankind! We have indeed created you from one man and one woman, and have made you into various nations and tribes so that you may know one another; indeed the more honourable among you, in the sight of Allah, is one who is more pious among you; indeed Allah is All Knowing, All Aware. (Piety is the basis of honour in Allah’s sight.)\n",
        "TRANSLATION_5": "O mankind! We have created you from a male and a female, and made you into nations and tribes that you may know one another. Verily, the most honorable of you with Allah is that (believer) who has At-Taqwa. Verily, Allah is All-Knowing, All-Aware.\n",
        "TRANSLATION_6": "O you men! surely We have created you of a male and a female, and made you tribes and families that you may know each other; surely the most honorable of you with Allah is the one among you most careful (of his duty); surely Allah is Knowing, Aware.\n",
        "TRANSLATION_7": "O mankind, We have created you male and female, and appointed you races and tribes, that you may know one another. Surely the noblest among you in the sight of God is the most godfearing of you. God is All-knowing, All-aware.\n",
        "TRANSLATION_8": "O mankind! Lo! We have created you male and female, and have made you nations and tribes that ye may know one another. Lo! the noblest of you, in the sight of Allah, is the best in conduct. Lo! Allah is Knower, Aware.\n",
        "TRANSLATION_9": "Mankind! We have created you from a male and female, and made you into peoples and tribes, so that you might come to know each other. The noblest of you in God's sight is the one who fears God most. God is all knowing and all-aware.\n",
        "TRANSLATION_10": "O Humankind verily We! We have created you Of a male and female, and We have made you nations and tribes that ye might know one another. Verily the noblest of you with Allah is the most God-fearing of you; verily Allah is Knowing, Aware,\n",
        "TRANSLATION_11": "O mankind! Indeed, We created you from a male and a female, and made you nations and tribes that you may identify yourselves with one another. Indeed the noblest of you in the sight of Allah is the most Godwary among you. Indeed Allah is all-knowing, all-aware.\n",
        "TRANSLATION_12": "O mankind! We created you from a single (pair) of a male and a female, and made you into nations and tribes, that ye may know each other (not that ye may despise (each other). Verily the most honoured of you in the sight of Allah is (he who is) the most righteous of you. And Allah has full knowledge and is well acquainted (with all things).\n",
        "TRANSLATION_13": "O mankind! We have created you from a male and a female, and made you into nations and tribes, that you may know one another. Verily, the most honourable of you with Allah is that (believer) who has At-Taqwa [i.e. one of the Muttaqun (pious - see V. 2:2). Verily, Allah is All-Knowing, All-Aware.\n",
        "TRANSLATION_14": "People, We have created you from a male and a female, and made you into nations and tribes that you might know one another. The noblest of you before Allah is the most righteous of you. Allah is the Knower, the Aware.\n",
        "TRANSLATION_15": "O people! We created you from a male and a female, and made you races and tribes, that you may know one another. The best among you in the sight of God is the most righteous. God is All-Knowing, Well-Experienced.\n",
        "TRANSLATION_16": "O mankind, indeed We have created you from male and female and made you peoples and tribes that you may know one another. Indeed, the most noble of you in the sight of Allah is the most righteous of you. Indeed, Allah is Knowing and Acquainted.\n",
        "TRANSLATION_17": "[49:13] O mankind! We have indeed created you from a male and a female, [from] Adam and Eve, and made you nations (shu‘ūb is the plural of sha‘b, which is the broadest category of lineage) and tribes (qabā’il, which are smaller than nations, and are followed by ‘amā’ir, ‘tribal districts’, then butūn, ‘tribal sub-districts’, then afkhādh, ‘sub-tribes’, and finally fasā’il, ‘clans’; for example Khuzayma is the sha‘b, while Kināna is the qabīla, Quraysh is the ‘imāra, Qusayy is the batn, Hāshim is the fakhdh, and ‘Abbās is the fasīla) that you may come to know one another (ta‘ārafū: one of the two tā’ letters [of tata‘ārafū] has been omitted), that you may acquire knowledge of [the customs of] one another and not to boast to one another of [whose is the more] noble lineage, for pride lies only in [the extent to which you have] fear of God. Truly the noblest of you in the sight of God is the most God-fearing among you. Truly God is Knower, of you, Aware, of your inner thoughts.\n",
        "TRANSLATION_18": "(0 mankind!) This was revealed about Thabit Ibn Qays Ibn Shammas who said to a man: \"You are the son of so-and-so\" in reference to his mother; and it is also said that it was revealed about Bilal the muezzin of the Prophet (pbuh). When Bilal gave the call to prayer in Mecca after its conquest, a group of men from Quraysh, among whom were Sahl Ibn 'Amr, al-Harth Ibn Hisham and Abu Sufyan Ibn Harb, said: \"Did Allah and His Messenger not find anyone to call to prayer except this raven\". In response, Allah said: (Lo! We have created you male and female) from Adam and Eve, (and have made you nations and tribes that ye may know one another. Lo! the noblest of you) in the Hereafter, (in the sight of Allah) on the Day of Judgement, (is the best in conduct) in the life of the world; which in this case is Bilal. (Lo! Allah is Knower) of your status and lineage, (Aware) of your works and standing in His sight.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "49:13",
            "33:63",
            "67:26",
            "4:94",
            "6:144",
            "46:23",
            "14:46",
            "31:34",
            "4:35",
            "3:36"
        ],
        "BIBLE": [
            "prophets:ii%20samuel:7:19",
            "writings:ecclesiastes:3:14",
            "prophets:isaiah:43:4",
            "torah:leviticus:20:17",
            "writings:psalms:79:10",
            "torah:exodus:33:16",
            "writings:ruth:3:11",
            "prophets:joshua:4:24",
            "writings:psalms:9:21",
            "torah:exodus:33:13"
        ]
    }
}