{
    "VERSE": "49:16",
    "ARABIC": "قُلْ أَتُعَلِّمُونَ ٱللَّهَ بِدِينِكُمْ وَٱللَّهُ يَعْلَمُ مَا فِى ٱلسَّمَٰوَٰتِ وَمَا فِى ٱلْأَرْضِ وَٱللَّهُ بِكُلِّ شَىْءٍ عَلِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "Say: 'Do you presume to teach Allah your deen when Allah knows everything in the heavens and everything in the earth? Allah has knowledge of all things.'",
        "TRANSLATION_1": "Say: \"Are you trying to convince God of your faithfulness? But God knows all there is in the heavens and the earth, for God has knowledge of everything.\"\n",
        "TRANSLATION_2": "Say, (O Prophet), (to these pretenders to faith): “Are you apprising Allah of your faith? Allah knows all that is in the heavens and the earth. Allah has full knowledge of everything.”\n",
        "TRANSLATION_3": "(Muhammad), say, \"Do you teach God about your religion? God knows whatever is in the heavens and the earth. He has the knowledge of all things\".\n",
        "TRANSLATION_4": "Proclaim (O dear Prophet Mohammed – peace and blessings be upon him), “Are you teaching Allah your own religion? Whereas Allah knows all whatever is in the heavens and all whatever is in the earth; and Allah knows all things.”\n",
        "TRANSLATION_5": "Say: \"Will you inform Allah of your religion while Allah knows all that is in the heavens and all that is on the earth, and Allah is All-Aware of everything.\"\n",
        "TRANSLATION_6": "Say: Do you apprise Allah of your religion, and Allah knows what is in the heavens and what is in the earth; and Allah is Cognizant of all things.\n",
        "TRANSLATION_7": "Say: 'What, would you teach God what your religion is, and God knows what is in the heavens and what is in the earth? And God has knowledge of everything.'\n",
        "TRANSLATION_8": "Say (unto them, O Muhammad): Would ye teach Allah your religion, when Allah knoweth all that is in the heavens and all that is in the earth, and Allah is Aware of all things?\n",
        "TRANSLATION_9": "Say, \"Do you presume to teach God your religion when God knows everything in the heavens and earth? God has knowledge of all things.\"\n",
        "TRANSLATION_10": "Say thou: Would ye appraise Allah of your religion, whereas Allah knoweth whatsoever is in the heavens and whatsoever is in the earth, and Allah is of everything Aware!\n",
        "TRANSLATION_11": "Say, ‘Will you inform Allah about your faith while Allah knows whatever there is in the heavens and whatever there is in the earth, and Allah has knowledge of all things?’\n",
        "TRANSLATION_12": "Say: \"What! Will ye instruct Allah about your religion? But Allah knows all that is in the heavens and on earth: He has full knowledge of all things.\n",
        "TRANSLATION_13": "Say: \"Will you inform Allah about your religion? While Allah knows all that is in the heavens and all that is in the earth, and Allah is All-Aware of everything.\n",
        "TRANSLATION_14": "Say: 'Would you teach Allah what your religion is, when Allah knows all that is in the heavens and the earth' Allah has knowledge of all things.\n",
        "TRANSLATION_15": "Say, “Are you going to teach God about your religion, when God knows everything in the heavens and the earth, and God is aware of all things?”\n",
        "TRANSLATION_16": "Say, \"Would you acquaint Allah with your religion while Allah knows whatever is in the heavens and whatever is on the earth, and Allah is Knowing of all things?\"\n",
        "TRANSLATION_17": "[49:16] Say, to them: ‘Do you [pretend to] inform God about your religion (read the doubled [2nd verbal] form atu‘allimūna, ‘do you inform’), in other words, are you intimating to Him your [religious] status when you say, ‘We believe’, when God knows all that is in the heavens and all that is in the earth, and [even though] God is Knower of all things?’\n",
        "TRANSLATION_18": "(Say) to Banu Asad, Muhammad: (Would ye teach) would you inform Allah (Allah your religion) about whether you are sincere or insincere in your religion, (when Allah knoweth all that is in the heavens and all that is in the earth) when He knows what is in the hearts of all those who are in the heavens and the earth, (and Allah is Aware of all things) of the secrets of the dwellers of the heavens and the earth?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "49:16",
            "4:126",
            "24:64",
            "16:52",
            "24:41",
            "5:120",
            "64:4",
            "3:29",
            "2:284",
            "85:9"
        ],
        "BIBLE": [
            "prophets:i%20kings:18:36",
            "prophets:isaiah:25:1",
            "torah:exodus:9:29",
            "prophets:isaiah:7:13",
            "prophets:ii%20kings:23:17",
            "prophets:jeremiah:10:11",
            "prophets:ii%20kings:19:15",
            "prophets:jeremiah:13:12",
            "writings:ii%20chronicles:20:20",
            "prophets:ii%20kings:9:18"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:6"
        ]
    }
}