{
    "VERSE": "49:18",
    "ARABIC": "إِنَّ ٱللَّهَ يَعْلَمُ غَيْبَ ٱلسَّمَٰوَٰتِ وَٱلْأَرْضِ وَٱللَّهُ بَصِيرٌۢ بِمَا تَعْمَلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Allah knows the unseen things of the heavens and the earth. Allah sees what you do.",
        "TRANSLATION_1": "Verily God knows the unknown of the heavens and the earth; and God perceives all you do.\n",
        "TRANSLATION_2": "Surely Allah knows every hidden thing of the heavens and the earth. Allah sees all that you do.\n",
        "TRANSLATION_3": "God knows whatever is unseen in the heavens and in the earth. He is Well Aware of what you do\".\n",
        "TRANSLATION_4": "Indeed Allah knows all the hidden of the heavens and the earth; and Allah is seeing your deeds.\n",
        "TRANSLATION_5": "Verily, Allah knows the Unseen of the heavens and the earth. And Allah is the All-Seer of what you do.\"\n",
        "TRANSLATION_6": "Surely Allah knows the unseen things of the heavens and the earth; and Allah sees what you do.\n",
        "TRANSLATION_7": "God knows the Unseen of the heavens and of the earth; and God sees the things you do.'\n",
        "TRANSLATION_8": "Lo! Allah knoweth the Unseen of the heavens and the earth. And Allah is Seer of what ye do.\n",
        "TRANSLATION_9": "God knows the unseen things of the heavens and the earth. God sees all that you do.\n",
        "TRANSLATION_10": "Verily Allah knoweth the Unseen of the heavens and the earth; and Allah is the Beholder of that which ye work.\n",
        "TRANSLATION_11": "Indeed Allah knows the Unseen of the heavens and the earth, and Allah watches what you do.’\n",
        "TRANSLATION_12": "Verily Allah knows the secrets of the heavens and the earth: and Allah Sees well all that ye do.\"\n",
        "TRANSLATION_13": "Verily, Allah knows the unseen of the heavens and the earth. And Allah is the All-Seer of what you do.\n",
        "TRANSLATION_14": "Indeed, Allah knows the Unseen of the heavens and the earth, and Allah is the Seer of what you do'\n",
        "TRANSLATION_15": "God knows the secrets of the heavens and the earth, and God is seeing of everything you do.\n",
        "TRANSLATION_16": "Indeed, Allah knows the unseen [aspects] of the heavens and the earth. And Allah is Seeing of what you do.\n",
        "TRANSLATION_17": "[49:18] Truly God knows the Unseen of the heavens and the earth, that is, [He knows] all that is hidden in both, and God is Seer of what you do’ (may be read either as ya‘malūna, ‘they do’, or ta‘malūna, ‘you do’), nothing of which can be concealed from Him. Meccan, except for verse 38, which is Medinese; it consists of 45 verses.\n",
        "TRANSLATION_18": "(Lo! Allah knoweth the Unseen of the heavens and the earth) He knows the future events that will take place in the heavens and the earth. (And Allah is Seer of what ye do) hypocrites, in your state of hypocrisy and He also knows your punishment if you do not repent'. And of the surah in which Qaf is mentioned which is all Meccan, and consists of 45 verses, 395 words and 1,490 letters: Surah 50: Qaf And of the surah in which Qaf is mentioned which is all Meccan, and consists of 45 verses, 395 words and 1,490 letters:\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "49:18",
            "27:65",
            "35:38",
            "11:123",
            "31:26",
            "2:33",
            "57:4",
            "22:64",
            "16:52",
            "3:5"
        ],
        "BIBLE": [
            "prophets:ezekiel:16:30",
            "torah:deuteronomy:10:21",
            "torah:genesis:1:25",
            "writings:i%20chronicles:29:17",
            "torah:genesis:1:31",
            "torah:deuteronomy:10:14",
            "writings:job:21:22",
            "prophets:ezekiel:13:3",
            "torah:deuteronomy:11:7",
            "writings:ecclesiastes:1:14"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:4:2",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:1"
        ]
    }
}