{
    "VERSE": "49:5",
    "ARABIC": "وَلَوْ أَنَّهُمْ صَبَرُوا۟ حَتَّىٰ تَخْرُجَ إِلَيْهِمْ لَكَانَ خَيْرًا لَّهُمْ وَٱللَّهُ غَفُورٌ رَّحِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "If they had only been patient until you came out to them, it would have been better for them. But Allah is Ever-Forgiving, Most Merciful.",
        "TRANSLATION_1": "If they had waited for you to come out it would have been better for them. But God is forgiving and kind.\n",
        "TRANSLATION_2": "If they were patient until you went out to them, that would have been better for them. Allah is Most Forgiving, Most Merciful.\n",
        "TRANSLATION_3": "Had they exercised patience until you had come out, it would have been better for them. God is All-forgiving and All-merciful.\n",
        "TRANSLATION_4": "And had they been patient until you yourself came out to them, it would be better for them; and Allah is Oft Forgiving, Most Merciful.\n",
        "TRANSLATION_5": "And if they had patience till you could come out to them, it would have been better for them. And Allah is Forgiving, Most Merciful.\n",
        "TRANSLATION_6": "And if they wait patiently until you come out to them, it would certainly be better for them, and Allah is Forgiving, Merciful.\n",
        "TRANSLATION_7": "And if they had patience, until thou comest out to them, that would be better for them; and God is All-forgiving, All-compassionate.\n",
        "TRANSLATION_8": "And if they had had patience till thou camest forth unto them, it had been better for them. And Allah is Forgiving, Merciful.\n",
        "TRANSLATION_9": "If they waited patiently until you came out to see them, it would be better for them. But God is forgiving and merciful.\n",
        "TRANSLATION_10": "And had they had patience till thou camest forth Unto them, it had surely been best for them; and Allah is Forgiving, Merciful.\n",
        "TRANSLATION_11": "Had they been patient until you came out for them, it would have been better for them, and Allah is all-forgiving, all-merciful.\n",
        "TRANSLATION_12": "If only they had patience until thou couldst come out to them, it would be best for them: but Allah is Oft-Forgiving, Most Merciful.\n",
        "TRANSLATION_13": "And if they had patience till you could come out to them, it would have been better for them. And Allah is Oft-Forgiving, Most Merciful.\n",
        "TRANSLATION_14": "If they had patience until you went out to them, it would have been better for them. But Allah is the Forgiving and the Most Merciful.\n",
        "TRANSLATION_15": "Had they remained patient until you came out to them, it would have been better for them. But God is Forgiving and Merciful.\n",
        "TRANSLATION_16": "And if they had been patient until you [could] come out to them, it would have been better for them. But Allah is Forgiving and Merciful.\n",
        "TRANSLATION_17": "[49:5] And had they been patient (annahum, ‘they’, has independent status, on account of inceptiveness; alternatively, it is said to govern an implied verb such as thabata, ‘had [their patience] been maintained’) until you came out to them, it would have been better for them; and God is Forgiving, Merciful, to those of them who repent.\n",
        "TRANSLATION_18": "(And if they) the Banu 'Anbar (had patience till thou earnest forth unto them) for the prayer, (it had been better for them) he would have freed all their wives and children; instead he freed half of them and agreed the ransom of the remaining half. (And Allah is Forgiving) He forgives whoever repents of them, (Merciful) in that He did not hasten His punishment on them.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "49:5",
            "3:157",
            "5:74",
            "2:192",
            "33:73",
            "16:18",
            "4:106",
            "8:23",
            "2:103",
            "3:31"
        ],
        "BIBLE": [
            "writings:ii%20chronicles:25:16",
            "prophets:ii%20kings:2:23",
            "prophets:hosea:6:3",
            "torah:genesis:30:16",
            "prophets:i%20samuel:19:23",
            "prophets:i%20samuel:24:4",
            "prophets:i%20samuel:22:3",
            "prophets:ii%20kings:1:6",
            "prophets:ii%20samuel:3:25",
            "prophets:ii%20samuel:3:24"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:2:2",
            "Sefer%20Yetzirah:6:2"
        ]
    }
}