{
    "VERSE": "49:8",
    "ARABIC": "فَضْلًا مِّنَ ٱللَّهِ وَنِعْمَةً وَٱللَّهُ عَلِيمٌ حَكِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "It is a great favour from Allah and a blessing. Allah is All-Knowing, All-Wise.",
        "TRANSLATION_1": "By God's benevolence and His grace. God is all-knowing and all-wise.\n",
        "TRANSLATION_2": "by Allah's favour and bounty. Allah is All-Knowing, All-Wise.\n",
        "TRANSLATION_3": "as a favor and a blessing from God. God is All-knowing and All-wise.\n",
        "TRANSLATION_4": "The munificence and favour of Allah; and Allah is All Knowing, Wise.\n",
        "TRANSLATION_5": "This is a grace from Allah and His favor. And Allah is All-Knowing, All-Wise.\n",
        "TRANSLATION_6": "By grace from Allah and as a favor; and Allah is Knowing, Wise.\n",
        "TRANSLATION_7": "by God's favour and blessing; God is All-knowing, All-wise.\n",
        "TRANSLATION_8": "(It is) a bounty and a grace from Allah; and Allah is Knower, Wise.\n",
        "TRANSLATION_9": "through God's bounty and favour; God is all knowing, and wise.\n",
        "TRANSLATION_10": "Through grace from Allah and His favour; and Allah is Knowing, Wise.\n",
        "TRANSLATION_11": "a grace and blessing from Allah, and Allah is all-knowing, all-wise.\n",
        "TRANSLATION_12": "A Grace and Favour from Allah; and Allah is full of Knowledge and Wisdom.\n",
        "TRANSLATION_13": "(This is) a Grace from Allah and His Favour. And Allah is All-Knowing, All-Wise.\n",
        "TRANSLATION_14": "by the Favor and Blessing of Allah. Allah is the Knower and the Wise.\n",
        "TRANSLATION_15": "A Grace and Favor from God. God is Knowing and Wise.\n",
        "TRANSLATION_16": "[It is] as bounty from Allah and favor. And Allah is Knowing and Wise.\n",
        "TRANSLATION_17": "[49:8] [that is] a favour from God (fadlan is a verbal noun, in the accusative because of the implied verbal action, that is, afdala, ‘He gives a favour’) and a grace, from Him, and God is Knower, of them, Wise, in His bestowal of graces on them.\n",
        "TRANSLATION_18": "(It is) a bounty and a grace from Allah) that He honoured the believers; (and Allah is Knower) of honouring the believers, (Wise) in placing in their hearts love of faith and hatred of disbelief, lewdness and rebellion.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "49:8",
            "24:18",
            "24:10",
            "4:70",
            "3:171",
            "33:1",
            "9:106",
            "4:26",
            "66:2",
            "4:111"
        ],
        "BIBLE": [
            "writings:proverbs:9:10",
            "torah:exodus:35:31",
            "writings:proverbs:3:4",
            "torah:exodus:31:3",
            "writings:proverbs:1:7",
            "writings:proverbs:8:12",
            "torah:genesis:6:8",
            "prophets:hosea:6:6",
            "writings:proverbs:14:6",
            "writings:ii%20chronicles:1:12"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:14",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:6:2"
        ]
    }
}