{
    "VERSE": "49:9",
    "ARABIC": "وَإِن طَآئِفَتَانِ مِنَ ٱلْمُؤْمِنِينَ ٱقْتَتَلُوا۟ فَأَصْلِحُوا۟ بَيْنَهُمَا فَإِنۢ بَغَتْ إِحْدَىٰهُمَا عَلَى ٱلْأُخْرَىٰ فَقَٰتِلُوا۟ ٱلَّتِى تَبْغِى حَتَّىٰ تَفِىٓءَ إِلَىٰٓ أَمْرِ ٱللَّهِ فَإِن فَآءَتْ فَأَصْلِحُوا۟ بَيْنَهُمَا بِٱلْعَدْلِ وَأَقْسِطُوٓا۟ إِنَّ ٱللَّهَ يُحِبُّ ٱلْمُقْسِطِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "If two parties of the muminun fight, make peace between them. But if one of them attacks the other unjustly, fight the attackers until they revert to Allah's command. If they revert, make peace between them with justice, and be even-handed. Allah loves those who are even-handed.",
        "TRANSLATION_1": "If two groups of believers come to fight one another, promote peace between them. Then if one of them turns aggressive against the other, fight against the aggressive party till it returns to God's authority. If it does so, make peace among them equitably and be impartial. Verily God loves those who are just.\n",
        "TRANSLATION_2": "If two parties of the believers happen to fight, make peace between them. But then, if one of them transgresses against the other, fight the one that transgresses until it reverts to Allah's command. And if it does revert, make peace between them with justice, and be equitable for Allah loves the equitable.\n",
        "TRANSLATION_3": "If two parties among the believers start to fight against each other, restore peace among them. If one party rebels against the other, fight against the rebellious one until he surrenders to the command of God. When he does so, restore peace among them with justice and equality; God loves those who maintain justice.\n",
        "TRANSLATION_4": "And if two groups of Muslims fight against each other, reconcile them; and if one of them oppresses the other, fight against the oppressor till it returns to the command of Allah; then if it returns, reconcile between them with justice, and be fair; indeed Allah loves the equitable.\n",
        "TRANSLATION_5": "And if two parties among the believers fall to fighting, then make peace between them both. But if one of them outrages against the other, then fight you (all) against the one that which outrages till it complies with the command of Allah. Then if it complies, then make reconciliation between them justly, and be equitable. Verily, Allah loves those who are the equitable.\n",
        "TRANSLATION_6": "And if two parties of the believers quarrel, make peace between them; but if one of them acts wrongfully towards the other, fight that which acts wrongfully until it returns to Allah's command; then if it returns, make peace between them with justice and act equitably; surely Allah loves those who act equitably.\n",
        "TRANSLATION_7": "If two parties of the believers fight, put things right between them; then, if one of them is insolent against the other, fight the insolent one till it reverts to God's commandment. If it reverts, set things right between them equitably, and be just. Surely God loves the just.\n",
        "TRANSLATION_8": "And if two parties of believers fall to fighting, then make peace between them. And if one party of them doeth wrong to the other, fight ye that which doeth wrong till it return unto the ordinance of Allah; then, if it return, make peace between them justly, and act equitably. Lo! Allah loveth the equitable.\n",
        "TRANSLATION_9": "If two parties of believers fight against each other, make peace between them; then if after that one of them transgresses against the other, fight the party that transgresses until it submits to the command of God. Then if it complies, make peace between them with equity, and act justly. Truly, God loves the just.\n",
        "TRANSLATION_10": "And if two parties of the believers fall to mutual fighting, then make reconciliation between the twain. Then if one of them rebelleth against the other, fight that Party which rebelleth till it returneth Unto the affair of Allah; then if it returneth, make reconciliation between the twain with justice and be equitable; verily Allah loveth the equitable.\n",
        "TRANSLATION_11": "If two groups of the faithful fight one another, make peace between them. But if one party of them aggresses against the other, fight the one which aggresses until it returns to Allah’s ordinance. Then, if it returns, make peace between them fairly, and do justice. Indeed Allah loves the just.\n",
        "TRANSLATION_12": "If two parties among the Believers fall into a quarrel, make ye peace between them: but if one of them transgresses beyond bounds against the other, then fight ye (all) against the one that transgresses until it complies with the command of Allah; but if it complies, then make peace between them with justice, and be fair: for Allah loves those who are fair (and just).\n",
        "TRANSLATION_13": "And if two parties or groups among the believers fall to fighting, then make peace between them both, but if one of them rebels against the other, then fight you (all) against the one that which rebels till it complies with the Command of Allah; then if it complies, then make reconciliation between them justly, and be equitable. Verily! Allah loves those who are equitable.\n",
        "TRANSLATION_14": "If two parties of believers fight, reform between them. If either of them is insolent against the other, fight the insolent one till they revert to the order of Allah. If they revert, reform between them with justice, and weigh with justice. Allah loves those who weigh with justice.\n",
        "TRANSLATION_15": "If two groups of believers fight each other, reconcile between them. But if one group aggresses against the other, fight the aggressing group until it complies with God’s command. Once it has complied, reconcile between them with justice, and be equitable. God loves the equitable.\n",
        "TRANSLATION_16": "And if two factions among the believers should fight, then make settlement between the two. But if one of them oppresses the other, then fight against the one that oppresses until it returns to the ordinance of Allah. And if it returns, then make settlement between them in justice and act justly. Indeed, Allah loves those who act justly.\n",
        "TRANSLATION_17": "[49:9] And if two parties of believers (in tā’ifatāni mina’l-mu’minīna ... [to the end of] the verse, was revealed regarding a particular incident where the Prophet (s) was riding a donkey and happened to pass by Ibn Ubayy; the donkey urinated and so Ibn Ubayy held his nose, whereupon [‘Abd Allāh] Ibn Rawāhā said, ‘By God, the smell of the donkey’s urine is sweeter-smelling than your musk. Fighting then ensued between the two clans with fists, sandals and palm branches [being thrown about]) fall to fighting (iqtatalū: the plural is used on account of the [plural] import, for each party is made up of several individuals; a variant reading has [the dual form] iqtatalatā), make peace between them (baynahumā: the dual here takes into account the actual [dual] form [of tā’ifatān, ‘two parties’]). And if one of them aggresses against the other, fight the one which aggresses until it returns to God’s ordinance, [to] the truth. Then, if it returns, reconcile them,   fairly, and act justly. Surely God loves the just.\n",
        "TRANSLATION_18": "(And if two parties of believers fall to fighting) this was revealed about the hypocrite 'Abdullah Ibn Ubayy Ibn Salul and his host and 'Abdullah Ibn Rawahah, a true believer, and his companions; these two parties fell to fighting after an exchange of words, and so Allah forbade them from fighting each other and commanded them to make up, saying, (And if two parties of believers fall to fighting then make peace between them) by referring to the Book of Allah. (And if one party of them) the party of 'Abdullah Ibn Ubayy Ibn Salul (doeth wrong to) persists and transgresses against (the other) the party of 'Abdullah Ibn Rawahah al-Ansari, and refuses to make peace by referring the matter to the Qur'an, (fight ye that which doeth wrong till it return unto the ordinance of Allah) until it accepts to make peace by referring to the ordinances of the Qur'an; (then, if it return) if it accepts to make peace by referring the matter to the Book of Allah, (make peace between them justly, and act equitably) towards both parties. (Lo! Allah loveth the equitable) Allah loves those who judge justly by the Book of Allah, and act upon it.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "49:9",
            "7:87",
            "22:76",
            "6:58",
            "5:106",
            "49:10",
            "9:83",
            "5:69",
            "4:58",
            "9:4"
        ],
        "BIBLE": [
            "prophets:hosea:11:8",
            "writings:ezra:5:5",
            "prophets:isaiah:55:11",
            "prophets:isaiah:29:21",
            "prophets:ii%20samuel:23:5",
            "prophets:isaiah:10:2",
            "prophets:isaiah:61:8",
            "torah:numbers:21:8",
            "torah:leviticus:16:10",
            "prophets:jeremiah:34:22"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:1:7"
        ]
    }
}