{
    "VERSE": "26:111",
    "ARABIC": "قَالُوٓا۟ أَنُؤْمِنُ لَكَ وَٱتَّبَعَكَ ٱلْأَرْذَلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "they said, 'Why should we believe you when the vilest people follow you?'",
        "TRANSLATION_1": "They said: \"Should we place our trust in you when only the condemned follow you?\"\n",
        "TRANSLATION_2": "They answered: \"Shall we accept you even though it is the meanest of people who follow you?\"\n",
        "TRANSLATION_3": "They said, \"Should we believe in you when no one has followed you except the lowest ones\".\n",
        "TRANSLATION_4": "They said, “Shall we believe in you, whereas the abject people are with you?”\n",
        "TRANSLATION_5": "They said: \"Shall we believe in you, when the inferior follow you\"\n",
        "TRANSLATION_6": "They said: Shall we believe in you while the meanest follow you?\n",
        "TRANSLATION_7": "They said, 'Shall we believe thee, whom the vilest follow?'\n",
        "TRANSLATION_8": "They said: Shall we put faith in thee, when the lowest (of the people) follow thee?\n",
        "TRANSLATION_9": "They replied, \"Are we to believe in you when your followers are but the lowest of the low?\"\n",
        "TRANSLATION_10": "They said: shall We believe in thee when the meanest follow thee?\n",
        "TRANSLATION_11": "They said, ‘Shall we believe in you, when it is the riffraff who follow you?’\n",
        "TRANSLATION_12": "They said: \"Shall we believe in thee when it is the meanest that follow thee?\"\n",
        "TRANSLATION_13": "They said: \"Shall we believe in you, when the meanest (of the people) follow you?\"\n",
        "TRANSLATION_14": "They replied: 'Are we to believe you whom the lowliest follow'\n",
        "TRANSLATION_15": "They said, “Shall we believe in you, when it is the lowliest who follow you?”\n",
        "TRANSLATION_16": "They said, \"Should we believe you while you are followed by the lowest [class of people]?\"\n",
        "TRANSLATION_17": "[26:111] They said, ‘Shall we believe in you, in your words, when it is the lowliest people who follow you?’ (wa’ttaba‘aka: a variant reading has wa-atbā‘uka, ‘[when] your followers’, plural of tābi‘, ‘follower’, as a subject) the riffraff, such as the weavers and the shoemakers.\n",
        "TRANSLATION_18": "(They said: Shall we put faith in thee) shall we believe in you, O Noah, (when the lowest (of the people) follow thee) when our most lowly and weak have followed you? We will not believe in you until you repulse them.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "26:111",
            "70:2",
            "37:149",
            "27:27",
            "37:52",
            "15:70",
            "37:172",
            "68:43",
            "26:165",
            "74:43"
        ],
        "BIBLE": [
            "prophets:i%20kings:18:21",
            "prophets:i%20kings:20:10",
            "writings:ruth:1:16",
            "prophets:zechariah:4:13",
            "prophets:joshua:24:16",
            "prophets:jeremiah:3:19",
            "prophets:zechariah:4:5",
            "prophets:i%20kings:18:24",
            "torah:exodus:4:1",
            "prophets:zechariah:6:4"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:4:3"
        ]
    }
}