{
    "VERSE": "26:127",
    "ARABIC": "وَمَآ أَسْـَٔلُكُمْ عَلَيْهِ مِنْ أَجْرٍ إِنْ أَجْرِىَ إِلَّا عَلَىٰ رَبِّ ٱلْعَٰلَمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "I do not ask you for any wage for it. My wage is the responsibility of no one but the Lord of all the worlds.",
        "TRANSLATION_1": "I ask no recompense of you for it. My reward is due from none but the Lord of all the worlds.\n",
        "TRANSLATION_2": "I seek of you no reward for this; my reward is with none but the Lord of the Universe.\n",
        "TRANSLATION_3": "I do not ask for any payment for my preaching. I shall receive my reward from the Lord of the Universe.\n",
        "TRANSLATION_4": "“And I do not ask from you any fee for it; my reward is only upon the Lord Of The Creation.”\n",
        "TRANSLATION_5": "No reward do I ask of you for it; my reward is only from the Lord of all that exists.\"\n",
        "TRANSLATION_6": "And I do not ask you any reward for it; surely my reward is only with the Lord of the worlds\n",
        "TRANSLATION_7": "I ask of you no wage for this; my wage falls only upon the Lord of all Being.\n",
        "TRANSLATION_8": "And I ask of you no wage therefor; my wage is the concern only of the Lord of the Worlds.\n",
        "TRANSLATION_9": "I ask no recompense of you; my reward is only with the Lord of the Universe.\n",
        "TRANSLATION_10": "And I ask of you no hire therefor: my hire is but with the Lord of the worlds.\n",
        "TRANSLATION_11": "I do not ask you any reward for it; my reward lies only with the Lord of all the worlds.\n",
        "TRANSLATION_12": "No reward do I ask of you for it: my reward is only from the Lord of the Worlds.\n",
        "TRANSLATION_13": "No reward do I ask of you for it (my Message of Islamic Monotheism), my reward is only from the Lord of the 'Alamin (mankind, jinns, and all that exists).\n",
        "TRANSLATION_14": "For this I ask of you no wage, for my wage falls only on the Lord of the Worlds.\n",
        "TRANSLATION_15": "I ask of you no payment for this. My payment is only from the Lord of the Worlds.\n",
        "TRANSLATION_16": "And I do not ask you for it any payment. My payment is only from the Lord of the worlds.\n",
        "TRANSLATION_17": "[26:127] I do not ask of you any reward for this; for my reward lies only with the Lord of the Worlds.\n",
        "TRANSLATION_18": "(And I ask of you no wage) no payment (therefore) for professing Allah's divine Oneness; (my wage) my reward (is the concern only of the Lord of the Worlds.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "26:180",
            "26:164",
            "26:145",
            "26:127",
            "26:109",
            "12:104",
            "38:86",
            "11:47",
            "2:131",
            "69:43"
        ],
        "BIBLE": [
            "writings:proverbs:10:8",
            "prophets:jeremiah:39:18",
            "prophets:ii%20kings:10:10",
            "writings:esther:6:13",
            "writings:lamentations:1:9",
            "writings:daniel:2:6",
            "prophets:isaiah:3:25",
            "prophets:i%20kings:1:52",
            "writings:psalms:37:24",
            "writings:proverbs:22:14"
        ]
    }
}