{
    "VERSE": "26:128",
    "ARABIC": "أَتَبْنُونَ بِكُلِّ رِيعٍ ءَايَةً تَعْبَثُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Do you build a tower on every hilltop, just to amuse yourselves,",
        "TRANSLATION_1": "You construct monuments on every hill in vain,\n",
        "TRANSLATION_2": "What, you build a monument on every hill merely for fun\n",
        "TRANSLATION_3": "Do you build useless monuments on every mountain\n",
        "TRANSLATION_4": "“What! You build a structure on every height, to laugh at the passers-by?”\n",
        "TRANSLATION_5": "Do you build on every Ri` an Ayah for your amusement\"\n",
        "TRANSLATION_6": "Do you build on every height a monument? Vain is it that you do:\n",
        "TRANSLATION_7": "What, do you build on every prominence a sign, sporting,\n",
        "TRANSLATION_8": "Build ye on every high place a monument for vain delight?\n",
        "TRANSLATION_9": "Do you build monuments on every high place in vanity,\n",
        "TRANSLATION_10": "Build ye on every eminence a landmark in vanity?\n",
        "TRANSLATION_11": "Do you build futile a sign on every prominence?\n",
        "TRANSLATION_12": "Do ye build a landmark on every high place to amuse yourselves?\n",
        "TRANSLATION_13": "Do you build high palaces on every high place, while you do not live in them?\n",
        "TRANSLATION_14": "Do you build over each high place a sign to amuse yourselves!\n",
        "TRANSLATION_15": "Do you build a monument on every height for vanity's sake?\n",
        "TRANSLATION_16": "Do you construct on every elevation a sign, amusing yourselves,\n",
        "TRANSLATION_17": "[26:128] Do you build on every prominence, every high place, a monument, an edifice as a signpost for passers-by, so that you may hurl abuse?, at those who pass by you and deride them (ta‘bathūna, is a circumstantial qualifier referring to the subject of [the verb] tabnūna, ‘you build’).\n",
        "TRANSLATION_18": "416 Build ye on every high place a monument for vain delight?) you beat up any stranger who passes by you and steal his clothes; this can also be understood in this manner: do you build in every marketplace a sign by means of which you scoff at whoever passes by you?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "26:128",
            "54:42",
            "23:105",
            "20:56",
            "78:28",
            "10:97",
            "27:84",
            "7:112",
            "43:69",
            "27:83"
        ],
        "BIBLE": [
            "prophets:i%20kings:14:23",
            "prophets:i%20kings:11:7",
            "torah:deuteronomy:12:2",
            "prophets:jeremiah:32:35",
            "prophets:jeremiah:30:18",
            "prophets:micah:3:12",
            "prophets:i%20kings:8:13",
            "prophets:isaiah:66:1",
            "prophets:ezekiel:16:24",
            "prophets:ii%20kings:17:9"
        ]
    }
}