{
    "VERSE": "26:129",
    "ARABIC": "وَتَتَّخِذُونَ مَصَانِعَ لَعَلَّكُمْ تَخْلُدُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "and construct great fortresses, hoping to live for ever,",
        "TRANSLATION_1": "Erect palaces (thinking) that you will live for ever,\n",
        "TRANSLATION_2": "and erect huge palaces as though you will live for ever,\n",
        "TRANSLATION_3": "and raise strong mansions as if you were to live forever?\n",
        "TRANSLATION_4": "“And prefer strong palaces, that perhaps you may live for ever?”\n",
        "TRANSLATION_5": "And do you get for yourselves Masani` as if you will live therein forever\"\n",
        "TRANSLATION_6": "And you make strong fortresses that perhaps you may\n",
        "TRANSLATION_7": "and do you take to you castles, haply to dwell forever?\n",
        "TRANSLATION_8": "And seek ye out strongholds, that haply ye may last for ever?\n",
        "TRANSLATION_9": "and erect castles hoping that you will live forever.\n",
        "TRANSLATION_10": "And take ye for yourselves castles that haply ye may abide.\n",
        "TRANSLATION_11": "You set up structures as if you will be immortal,\n",
        "TRANSLATION_12": "And do ye get for yourselves fine buildings in the hope of living therein (for ever)?\n",
        "TRANSLATION_13": "And do you get for yourselves palaces (fine buildings) as if you will live therein for ever.\n",
        "TRANSLATION_14": "And do you take to yourselves underground reservoirs, in order to live for ever!\n",
        "TRANSLATION_15": "And you set up fortresses, hoping to live forever?\n",
        "TRANSLATION_16": "And take for yourselves palaces and fortresses that you might abide eternally?\n",
        "TRANSLATION_17": "[26:129] And you set up structures, for [extracting] water underground, that perhaps you might, as though you will, last forever, therein and not die.\n",
        "TRANSLATION_18": "(And seek ye out strongholds) houses, palaces and pools, (that haply ye may last for ever) in this worldly life? Nay, you will not last for ever!\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "26:129",
            "11:122",
            "37:24",
            "25:66",
            "44:27",
            "21:80",
            "26:133",
            "37:137",
            "75:28",
            "71:18"
        ],
        "BIBLE": [
            "prophets:isaiah:49:11",
            "prophets:ezekiel:26:8",
            "prophets:i%20samuel:2:7",
            "torah:exodus:30:37",
            "prophets:i%20samuel:2:8",
            "prophets:isaiah:7:6",
            "writings:psalms:45:18",
            "torah:exodus:25:8",
            "torah:deuteronomy:4:23",
            "prophets:ezekiel:26:21"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:9"
        ]
    }
}