{
    "VERSE": "26:13",
    "ARABIC": "وَيَضِيقُ صَدْرِى وَلَا يَنطَلِقُ لِسَانِى فَأَرْسِلْ إِلَىٰ هَٰرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "and that my breast will be constricted and that my tongue will not be free, so send Harun as a Messenger as well.",
        "TRANSLATION_1": "My heart is constrained, my tongue falters, so delegate Aaron;\n",
        "TRANSLATION_2": "My breast is constricted and my tongue is not fluent, so endow Messengership on Aaron.\n",
        "TRANSLATION_3": "I feel nervous and my tongue is not fluent, so send Aaron with me.\n",
        "TRANSLATION_4": "“I feel hesitant, and my tongue does not speak fast, therefore make Haroon also a Noble Messenger.”\n",
        "TRANSLATION_5": "And my breast straitens, and my tongue expresses not well. So send for Harun.\"\n",
        "TRANSLATION_6": "And by breast straitens, and my tongue is not eloquent, therefore send Thou to Haroun (to help me);\n",
        "TRANSLATION_7": "and my breast will be straitened, and my tongue will not be loosed; so send to Aaron.\n",
        "TRANSLATION_8": "And I shall be embarrassed, and my tongue will not speak plainly, therefor send for Aaron (to help me).\n",
        "TRANSLATION_9": "and \"my breast is straitened and my tongue is not fluent; so send Aaron as well;\n",
        "TRANSLATION_10": "And my breast straiteneth, and my tongue moveth not quickly: so send for Harun.\n",
        "TRANSLATION_11": "and I will become upset and my tongue will fail me. So send for Aaron [to join me].\n",
        "TRANSLATION_12": "My breast will be straitened. And my speech may not go (smoothly): so send unto Aaron.\n",
        "TRANSLATION_13": "And my breast straitens, and my tongue expresses not well. So send for Harun (Aaron) (to come along with me).\n",
        "TRANSLATION_14": "and my chest will become constricted and my tongue will not be loosed (in my speech), therefore, send to Aaron.\n",
        "TRANSLATION_15": "And I become stressed, and my tongue is not fluent, so send Aaron too.\n",
        "TRANSLATION_16": "And that my breast will tighten and my tongue will not be fluent, so send for Aaron.\n",
        "TRANSLATION_17": "[26:13] and that anguish will constrain my breast, because of their denial of me, and that my tongue will not utter clearly, to deliver the Message, because of the knot in it. So give the Mission to, my brother, Aaron, alongside me.\n",
        "TRANSLATION_18": "(And I shall be embarrassed) because of their denial; it is also said that this means: and my heart will shrink from delivering the message, (and my tongue will not speak plainly) out of awe of him, (therefore send for Aaron (to help me)) send Aaron with me to support me; it is also said that this means: send Gabriel to Aaron so that he helps me.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "26:13",
            "28:34",
            "20:27",
            "26:84",
            "75:16",
            "94:1",
            "100:10",
            "20:25",
            "19:50",
            "36:50"
        ],
        "BIBLE": [
            "prophets:zephaniah:3:13",
            "writings:job:24:25",
            "writings:proverbs:2:2",
            "writings:proverbs:27:11",
            "writings:psalms:12:5",
            "torah:deuteronomy:9:3",
            "prophets:i%20kings:19:2",
            "prophets:ii%20samuel:3:21",
            "prophets:jeremiah:32:40",
            "prophets:isaiah:32:4"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:8",
            
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:10",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:2:3",
            "Sefer%20Yetzirah:3:1",
            "Sefer%20Yetzirah:5:2"
        ]
    }
}