{
    "VERSE": "26:132",
    "ARABIC": "وَٱتَّقُوا۟ ٱلَّذِىٓ أَمَدَّكُم بِمَا تَعْلَمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Have taqwa of Him who has supplied you with what you know,",
        "TRANSLATION_1": "Fear Him who has bestowed on you what you know,\n",
        "TRANSLATION_2": "Have fear of Him Who has provided you with all the (good) things you know;\n",
        "TRANSLATION_3": "Have fear of the One who has bestowed upon you all that you know.\n",
        "TRANSLATION_4": "“Fear Him Who has aided you with the things you know.”\n",
        "TRANSLATION_5": "And have Taqwa of Him, fear Him Who has aided you with all (good things) that you know.\"\n",
        "TRANSLATION_6": "And be careful of (your duty to) Him Who has given you abundance of what you know.\n",
        "TRANSLATION_7": "and fear Him who has succoured you with what you know,\n",
        "TRANSLATION_8": "Keep your duty toward Him Who hath aided you with (the good things) that ye know,\n",
        "TRANSLATION_9": "fear Him who has aided you with all that you know --\n",
        "TRANSLATION_10": "And fear Him Who hath aided you with that which ye know.\n",
        "TRANSLATION_11": "Be wary of Him who has provided you with whatever you know,\n",
        "TRANSLATION_12": "Yea, fear Him Who has bestowed on you freely all that ye know.\n",
        "TRANSLATION_13": "And keep your duty to Him, fear Him Who has aided you with all (good things) that you know.\n",
        "TRANSLATION_14": "Fear Him who has given you all the things you know.\n",
        "TRANSLATION_15": "And reverence Him, who supplied you with everything you know.\n",
        "TRANSLATION_16": "And fear He who provided you with that which you know,\n",
        "TRANSLATION_17": "[26:132] And fear Him Who has provided you, Who has been gracious to you, in a way that you know,\n",
        "TRANSLATION_18": "(Keep your duty towards Him) fear Him (who hath aided) provided (you with (the good things) that ye know),\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "26:132",
            "77:29",
            "26:92",
            "83:17",
            "84:4",
            "69:39",
            "34:25",
            "10:63",
            "26:79",
            "36:22"
        ],
        "BIBLE": [
            "writings:psalms:111:5",
            "torah:genesis:9:3",
            "prophets:joshua:23:15",
            "torah:deuteronomy:3:19",
            "writings:ii%20chronicles:32:29",
            "writings:i%20chronicles:29:14",
            "torah:deuteronomy:8:10",
            "writings:job:29:21",
            "torah:numbers:18:29",
            "writings:ecclesiastes:1:13"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:2",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:6:3"
        ]
    }
}