{
    "VERSE": "26:135",
    "ARABIC": "إِنِّىٓ أَخَافُ عَلَيْكُمْ عَذَابَ يَوْمٍ عَظِيمٍ",
    "ENGLISH": {
        "TRANSLATION_0": "I fear for you the punishment of a terrible Day.'",
        "TRANSLATION_1": "I fear the punishment of a terrible day for you.\n",
        "TRANSLATION_2": "I fear for you the chastisement of an Awesome Day.\"\n",
        "TRANSLATION_3": "I am afraid that you will suffer the torment of the Day of Judgment.\"\n",
        "TRANSLATION_4": "“Indeed I fear upon you the punishment of a Great Day.”\n",
        "TRANSLATION_5": "Verily, I fear for you the torment of a Great Day.\"\n",
        "TRANSLATION_6": "Surely I fear for you the chastisement of a grievous day\n",
        "TRANSLATION_7": "Indeed, I fear for you the chastisement of a dreadful day.'\n",
        "TRANSLATION_8": "Lo! I fear for you the retribution of an awful day.\n",
        "TRANSLATION_9": "indeed, I fear for you the torment of an awful day.\"\n",
        "TRANSLATION_10": "Verily I fear for you the torment of a Mighty Day.\n",
        "TRANSLATION_11": "Indeed I fear for you the punishment of a tremendous day.’\n",
        "TRANSLATION_12": "Truly I fear for you the Penalty of a Great Day.\"\n",
        "TRANSLATION_13": "Verily, I fear for you the torment of a Great Day.\"\n",
        "TRANSLATION_14": "Indeed, I fear for you the punishment of a dreadful Day'\n",
        "TRANSLATION_15": "I fear for you the punishment of an awesome Day.”\n",
        "TRANSLATION_16": "Indeed, I fear for you the punishment of a terrible day.\"\n",
        "TRANSLATION_17": "[26:135] Indeed I fear for you the chastisement of a tremendous day’, in this world and in the Hereafter should you disobey me.\n",
        "TRANSLATION_18": "(Lo! I fear for you) I know you will be visited by (the retribution of an awful day) in the Fire, if you do not repent of disbelief, idolatry and idol worship.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "26:135",
            "39:13",
            "6:15",
            "26:189",
            "26:156",
            "83:5",
            "11:26",
            "43:39",
            "7:59",
            "25:69"
        ],
        "BIBLE": [
            "writings:proverbs:19:19",
            "writings:psalms:56:4",
            "torah:deuteronomy:29:27",
            "prophets:joel:2:11",
            "torah:leviticus:23:27",
            "torah:deuteronomy:4:38",
            "torah:deuteronomy:6:24",
            "torah:deuteronomy:7:21",
            "writings:esther:9:17",
            "prophets:malachi:3:23"
        ]
    }
}