{
    "VERSE": "26:15",
    "ARABIC": "قَالَ كَلَّا فَٱذْهَبَا بِـَٔايَٰتِنَآ إِنَّا مَعَكُم مُّسْتَمِعُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "He said, 'By no means! Go, both of you, with Our Signs. We will certainly be together with you, listening.",
        "TRANSLATION_1": "(It was) said: \"By no means. Go with My signs, both of you. I am verily with you and I hear.\n",
        "TRANSLATION_2": "He said: \"Certainly not! So go both of you with Our Signs. We shall be with you listening to everything.\n",
        "TRANSLATION_3": "The Lord said, \"Have no fear, both of you go with Our miracles. We shall closely listen to you.\"\n",
        "TRANSLATION_4": "He said, “Not like this (any more); both of you go with Our signs, We are with you, All Hearing.”\n",
        "TRANSLATION_5": "(Allah) said: \"Nay! Go you both with Our signs. Verily, We shall be with you, listening.\"\n",
        "TRANSLATION_6": "He said: By no means, so go you both with Our signs; surely We are with you, hearing;\n",
        "TRANSLATION_7": "Said He, 'No indeed; but go, both of you, with Our signs, and We assuredly shall be with you, listening.\n",
        "TRANSLATION_8": "He said: Nay, verily. So go ye twain with Our tokens. Lo! We shall be with you, Hearing.\n",
        "TRANSLATION_9": "God said, \"Indeed not; go both of you with Our signs, We shall be with you, listening [to your call].\n",
        "TRANSLATION_10": "He said: by no means. so go ye twain with Our signs; verily We shall be with you listening.\n",
        "TRANSLATION_11": "He said, ‘Certainly not! Let both of you go with Our signs: We will indeed be with you, hearing [everything].\n",
        "TRANSLATION_12": "Allah said: \"By no means! proceed then, both of you, with Our Signs; We are with you, and will listen (to your call).\n",
        "TRANSLATION_13": "Allah said: \"Nay! Go you both with Our Signs. Verily! We shall be with you, listening.\n",
        "TRANSLATION_14": "He said: 'Never so, go both of you with Our signs; We shall be with you, listening\n",
        "TRANSLATION_15": "He said, “No. Go, both of you, with Our proofs. We will be with you, listening.\n",
        "TRANSLATION_16": "[Allah] said, \"No. Go both of you with Our signs; indeed, We are with you, listening.\n",
        "TRANSLATION_17": "[26:15] Said He, exalted be He: ‘Certainly not!, they shall not slay you. Go both of you, you and your brother — this address [although in the dual form] is predominantly for the person present as opposed to the absent one — with Our signs. We will indeed be with you, hearing, what you say and what is said to you (ma‘akum: the two [Moses and Aaron] are referred to here with the plural pronoun).\n",
        "TRANSLATION_18": "(He said) Allah said: (Nay, verily) I will not set them against you to kill you. (So go ye twain with Our tokens) with Our nine signs: the hand, the staff, the flood, the locusts, the lice, the frogs, blood, the lack of foodstuff and drought. (Lo! We shall be with you) We shall help you, (Hearing) what he says to you.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "26:15",
            "43:47",
            "78:28",
            "15:81",
            "74:16",
            "37:32",
            "43:69",
            "52:31",
            "25:36",
            "23:30"
        ],
        "BIBLE": [
            "prophets:ezekiel:9:5",
            "prophets:i%20samuel:14:10",
            "torah:exodus:16:8",
            "prophets:i%20samuel:3:9",
            "torah:exodus:10:1",
            "torah:genesis:23:10",
            "prophets:ii%20kings:2:21",
            "torah:numbers:22:35",
            "writings:job:21:29",
            "torah:deuteronomy:5:24"
        ]
    }
}