{
    "VERSE": "26:154",
    "ARABIC": "مَآ أَنتَ إِلَّا بَشَرٌ مِّثْلُنَا فَأْتِ بِـَٔايَةٍ إِن كُنتَ مِنَ ٱلصَّٰدِقِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "You are nothing but a human being like ourselves, so produce a Sign if you are telling the truth.'",
        "TRANSLATION_1": "You are nothing but a man like us. Bring us a token if you speak the truth.\"\n",
        "TRANSLATION_2": "you are no different from a mortal like us. So produce a sign if you are truthful.\"\n",
        "TRANSLATION_3": "You are a mere mortal like us. Show us a miracle if you are telling the Truth\".\n",
        "TRANSLATION_4": "“You are just a human like us; therefore bring some sign if you are truthful.”\n",
        "TRANSLATION_5": "You are but a human being like us. Then bring us a sign if you are of the truthful.\"\n",
        "TRANSLATION_6": "You are naught but a mortal like ourselves; so bring a sign if you are one of the truthful.\n",
        "TRANSLATION_7": "thou art naught but a mortal, like us; then produce a sign, if thou art one of the truthful.'\n",
        "TRANSLATION_8": "Thou art but a mortal like us. So bring some token if thou art of the truthful.\n",
        "TRANSLATION_9": "You are only a human being like ourselves. Show us a sign, if you are telling the truth.\"\n",
        "TRANSLATION_10": "Thou art but a human being like unto us. So bring thou a sign if thou art of the truth-tellers.\n",
        "TRANSLATION_11": "You are just a human being like us. So bring us a sign, should you be truthful.’\n",
        "TRANSLATION_12": "Thou art no more than a mortal like us: then bring us a Sign, if thou tellest the truth!\"\n",
        "TRANSLATION_13": "You are but a human being like us. Then bring us a sign if you are of the truthful.\"\n",
        "TRANSLATION_14": "You are but a human like ourselves. Produce for us a sign, if you are of the truthful'\n",
        "TRANSLATION_15": "You are nothing but a man like us. So bring us a sign, if you are truthful.\n",
        "TRANSLATION_16": "You are but a man like ourselves, so bring a sign, if you should be of the truthful.\"\n",
        "TRANSLATION_17": "[26:154] And, moreover, you are just a human being like us. So bring [us] a sign, if you are sincere’, in your Mission.\n",
        "TRANSLATION_18": "(Thou art but a mortal) a human being (like us) you eat and drink just like we do. (So bring some token) a sign to prove what you claim (if thou art of the truthful) that the punishment is coming and that you are a Messenger to us.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "26:154",
            "26:186",
            "36:15",
            "11:27",
            "7:106",
            "8:31",
            "16:126",
            "2:99",
            "23:33",
            "30:53"
        ],
        "BIBLE": [
            "prophets:i%20kings:22:16",
            "prophets:i%20kings:17:18",
            "torah:genesis:29:15",
            "prophets:ezekiel:33:10",
            "prophets:zechariah:3:8",
            "prophets:ezekiel:40:4",
            "writings:psalms:8:5",
            "writings:job:15:7",
            "torah:deuteronomy:28:68",
            "writings:job:37:20"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:3:5",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:4:11"
        ]
    }
}