{
    "VERSE": "26:155",
    "ARABIC": "قَالَ هَٰذِهِۦ نَاقَةٌ لَّهَا شِرْبٌ وَلَكُمْ شِرْبُ يَوْمٍ مَّعْلُومٍ",
    "ENGLISH": {
        "TRANSLATION_0": "He said, 'Here is a she-camel. She has a time for drinking and you have a time for drinking - on specified days.",
        "TRANSLATION_1": "(Saleh) said: \"Here is a she-camel. She has a right of drinking water, and you have a right of drinking it on appointed turns.\n",
        "TRANSLATION_2": "Salih said: \"This is a she-camel. There is a day set for her to drink and there is a day set for you to drink.\n",
        "TRANSLATION_3": "He said, \"This is a she-camel. She will have her share of water as you have your share, each on a certain day.\n",
        "TRANSLATION_4": "He said, “This is the she-camel – one day shall be her turn to drink, and on the other appointed day, shall be your turn.”\n",
        "TRANSLATION_5": "He said: \"Here is a she-camel: it has a right to drink (water), and you have a right to drink (water) (each) on a day, known.\"\n",
        "TRANSLATION_6": "He said: This is a she-camel; she shall have her portion of water, and you have your portion of water on an appointed time;\n",
        "TRANSLATION_7": "He said, 'This is a she-camel; to her a draught and to you a draught, on a day appointed,\n",
        "TRANSLATION_8": "He said: (Behold) this she-camel. She hath the right to drink (at the well), and ye have the right to drink, (each) on an appointed day.\n",
        "TRANSLATION_9": "He said, \"Here is a she-camel. She shall have her turn of drinking, as you have yours, each on an appointed day,\n",
        "TRANSLATION_10": "He said: yonder is a she-camel; to her a drink, and to you a drink, each on a day known.\n",
        "TRANSLATION_11": "He said, ‘This is a she-camel; she shall drink and you shall drink on known days.\n",
        "TRANSLATION_12": "He said: \"Here is a she-camel: she has a right of watering, and ye have a right of watering, (severally) on a day appointed.\n",
        "TRANSLATION_13": "He said: \"Here is a she-camel; it has a right to drink (water), and you have a right to drink (water) (each) on a day, known.\n",
        "TRANSLATION_14": "He said: 'Here is a shecamel. She shall have her share of water as you have yours on an appointed day.\n",
        "TRANSLATION_15": "He said, “This is a she-camel; she has her turn of drinking, and you have your turn of drinking—on a specified day.\n",
        "TRANSLATION_16": "He said, \"This is a she-camel. For her is a [time of] drink, and for you is a [time of] drink, [each] on a known day.\n",
        "TRANSLATION_17": "[26:155] He said, ‘This is a she-camel; she shall drink, a share of the water, and you shall drink [each] on a known day.\n",
        "TRANSLATION_18": "(He said) Salih said to them: ((Behold) this she-camel) she is a sign that I am sent as a prophet to you. (She hath the right to drink (at the well)) one day, (and ye have the right to drink) another day, ((each) on an appointed day) i.e. in alternate days: one day for you and one day for her.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "26:155",
            "38:53",
            "77:12",
            "45:34",
            "50:41",
            "50:30",
            "14:41",
            "76:7",
            "77:35",
            "51:13"
        ],
        "BIBLE": [
            "writings:daniel:8:19",
            "prophets:i%20samuel:9:24",
            "torah:exodus:9:5",
            "torah:genesis:29:7",
            "prophets:isaiah:42:4",
            "prophets:i%20kings:20:12",
            "torah:genesis:27:2",
            "torah:genesis:24:14",
            "prophets:i%20samuel:13:8",
            "writings:psalms:91:14"
        ]
    }
}