{
    "VERSE": "26:156",
    "ARABIC": "وَلَا تَمَسُّوهَا بِسُوٓءٍ فَيَأْخُذَكُمْ عَذَابُ يَوْمٍ عَظِيمٍ",
    "ENGLISH": {
        "TRANSLATION_0": "Do not do anything to harm her or the punishment of a terrible day will come down on you.'",
        "TRANSLATION_1": "Do not treat her unkindly or the punishment of a grievous day will fall on you.\"\n",
        "TRANSLATION_2": "Do not molest her lest the chastisement of an Awesome Day should seize you.\"\n",
        "TRANSLATION_3": "Do not cause her to suffer lest you become subject to the torment of the great day (of Judgment).\"\n",
        "TRANSLATION_4": "“And do not touch her with evil intentions for the punishment of the Great Day will seize you.”\n",
        "TRANSLATION_5": "And touch her not with harm, lest the torment of a Great Day should seize you.\"\n",
        "TRANSLATION_6": "And do not touch her with evil, lest the punishment of a grievous day should overtake you.\n",
        "TRANSLATION_7": "and do not touch her with malice so that there seize you the chastisement of a dreadful day.'\n",
        "TRANSLATION_8": "And touch her not with ill lest there come on you the retribution of an awful day.\n",
        "TRANSLATION_9": "so do her no harm, or the punishment of an awful day will befall you.\"\n",
        "TRANSLATION_10": "And touch her not with ill, lest there take hold of you the torment of a Mighty Day.\n",
        "TRANSLATION_11": "Do not cause her any harm, for then you shall be seized by the punishment of a terrible day.’\n",
        "TRANSLATION_12": "Touch her not with harm, lest the Penalty of a Great Day seize you.\"\n",
        "TRANSLATION_13": "And touch her not with harm, lest the torment of a Great Day seize you.\"\n",
        "TRANSLATION_14": "Do not touch her with malice so that punishment of a dreadful day seizes you'\n",
        "TRANSLATION_15": "And do not touch her with harm, lest the punishment of a great day seizes you.”\n",
        "TRANSLATION_16": "And do not touch her with harm, lest you be seized by the punishment of a terrible day.\"\n",
        "TRANSLATION_17": "[26:156] And do not cause her any harm, for then you shall be seized by the chastisement of an awful day’, [awful] because of the awfulness of the chastisement.\n",
        "TRANSLATION_18": "(And touch her not with ill) do not hamstrung her (lest there come on you the retribution of an awful day.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "26:156",
            "26:135",
            "39:13",
            "6:15",
            "39:24",
            "83:5",
            "43:39",
            "26:189",
            "16:94",
            "25:69"
        ],
        "BIBLE": [
            "prophets:jeremiah:51:47",
            "prophets:ezekiel:32:12",
            "prophets:isaiah:30:25",
            "writings:proverbs:19:19",
            "prophets:jeremiah:44:12",
            "prophets:ii%20kings:7:9",
            "torah:numbers:24:14",
            "prophets:joshua:20:6",
            "writings:esther:6:13",
            "prophets:isaiah:4:1"
        ]
    }
}