{
    "VERSE": "26:186",
    "ARABIC": "وَمَآ أَنتَ إِلَّا بَشَرٌ مِّثْلُنَا وَإِن نَّظُنُّكَ لَمِنَ ٱلْكَٰذِبِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "You are nothing but a human being like ourselves. We think you are a liar.",
        "TRANSLATION_1": "You are nothing but a man like us, and we think you are a liar.\n",
        "TRANSLATION_2": "you are only a mortal like us. Indeed we believe that you are an utter liar.\n",
        "TRANSLATION_3": "and a mere mortal like us. We think you are a liar.\n",
        "TRANSLATION_4": "“You are just a human like us, and indeed we consider you a liar.”\n",
        "TRANSLATION_5": "You are but a human being like us and verily, we think that you are one of the liars!\"\n",
        "TRANSLATION_6": "And you are naught but a mortal like ourselves, and we know you to be certainly of the liars.\n",
        "TRANSLATION_7": "thou art naught but a mortal, like us; indeed, we think that thou art one of the liars.\n",
        "TRANSLATION_8": "Thou art but a mortal like us, and lo! we deem thee of the liars.\n",
        "TRANSLATION_9": "You are only a human being like ourselves. Indeed we think you are a liar.\n",
        "TRANSLATION_10": "And thou art but a human being like unto us, and we deem thee to be of the liars.\n",
        "TRANSLATION_11": "You are just a human being like us, and we indeed consider you to be a liar.\n",
        "TRANSLATION_12": "Thou art no more than a mortal like us, and indeed we think thou art a liar!\n",
        "TRANSLATION_13": "You are but a human being like us and verily, we think that you are one of the liars!\n",
        "TRANSLATION_14": "You are but a human like ourselves, we think that you are one of the liars.\n",
        "TRANSLATION_15": "And you are nothing but a man like us; and we think that you are a liar.\n",
        "TRANSLATION_16": "You are but a man like ourselves, and indeed, we think you are among the liars.\n",
        "TRANSLATION_17": "[26:186] You are just a human being like us. And we indeed (in, softened in place of the hardened form, its subject omitted, in other words [it would be] innahu) think that you are one of the liars.\n",
        "TRANSLATION_18": "(Thou art but a mortal) a human being (like us) you eat and drink just as we do, (and lo! we deem thee of the liars) in what you claim.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "26:186",
            "26:154",
            "36:15",
            "23:34",
            "16:126",
            "21:34",
            "36:42",
            "23:24",
            "11:27",
            "74:25"
        ],
        "BIBLE": [
            "writings:ruth:3:11",
            "writings:psalms:8:5",
            "torah:genesis:44:15",
            "writings:proverbs:24:12",
            "torah:genesis:22:12",
            "writings:job:9:2",
            "prophets:jeremiah:36:19",
            "torah:numbers:31:18",
            "writings:job:11:11",
            "torah:genesis:20:7"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:3:5",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:4:11",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:4:6"
        ]
    }
}