{
    "VERSE": "26:187",
    "ARABIC": "فَأَسْقِطْ عَلَيْنَا كِسَفًا مِّنَ ٱلسَّمَآءِ إِن كُنتَ مِنَ ٱلصَّٰدِقِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "So make lumps from heaven fall down on us if you are telling the truth.'",
        "TRANSLATION_1": "But in case you are speaking the truth, then make a segment of the sky to fall upon us.\"\n",
        "TRANSLATION_2": "So cause a piece of the sky to fall upon us if you are truthful.\"\n",
        "TRANSLATION_3": "Let a part of the sky fall on us if what you say is true\".\n",
        "TRANSLATION_4": "“Therefore cause a part of the sky to fall upon us, if you are of the truthful.”\n",
        "TRANSLATION_5": "So, cause a piece of the heaven to fall on us, if you are of the truthful!\"\n",
        "TRANSLATION_6": "Therefore cause a portion of the heaven to come down upon us, if you are one of the truthful.\n",
        "TRANSLATION_7": "Then drop down on us lumps from heaven, if thou art one of the truthful.'\n",
        "TRANSLATION_8": "Then make fragments of the heaven fall upon us, if thou art of the truthful.\n",
        "TRANSLATION_9": "So cause a fragment of the sky to fall on us, if you are truthful.\"\n",
        "TRANSLATION_10": "So cause thou a fragment of the heaven to fall upon us, if thou art of the truth-tellers.\n",
        "TRANSLATION_11": "Make a fragment of the sky falls upon us, should you be truthful.’\n",
        "TRANSLATION_12": "Now cause a piece of the sky to fall on us, if thou art truthful!\"\n",
        "TRANSLATION_13": "So cause a piece of the heaven to fall on us, if you are of the truthful!\"\n",
        "TRANSLATION_14": "Drop down on us lumps from heaven, if you are one of the truthful'\n",
        "TRANSLATION_15": "So bring down on us pieces from the sky, if you are truthful.”\n",
        "TRANSLATION_16": "So cause to fall upon us fragments of the sky, if you should be of the truthful.\"\n",
        "TRANSLATION_17": "[26:187] Then make fragments (read kisfan or kisafan) of the heaven fall upon us, if you are of the truthful’, in your Mission.\n",
        "TRANSLATION_18": "(Then make fragments of the heaven fall upon us) as punishment, (if thou art of the Truthful) that the punishment is coming.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "26:187",
            "52:44",
            "26:31",
            "69:16",
            "26:4",
            "17:92",
            "15:14",
            "54:11",
            "71:11",
            "82:1"
        ],
        "BIBLE": [
            "torah:deuteronomy:30:12",
            "writings:nehemiah:2:4",
            "writings:i%20chronicles:10:4",
            "torah:exodus:27:2",
            "prophets:i%20samuel:18:25",
            "torah:deuteronomy:30:13",
            "writings:esther:5:5",
            "prophets:joel:2:17",
            "writings:psalms:139:8",
            "torah:genesis:41:9"
        ]
    }
}