{
    "VERSE": "26:189",
    "ARABIC": "فَكَذَّبُوهُ فَأَخَذَهُمْ عَذَابُ يَوْمِ ٱلظُّلَّةِ إِنَّهُۥ كَانَ عَذَابَ يَوْمٍ عَظِيمٍ",
    "ENGLISH": {
        "TRANSLATION_0": "They denied him and the punishment of the Day of Shadow came down on them. It was indeed the punishment of a terrible Day.",
        "TRANSLATION_1": "But they denied him, and We seized them with the torment of the Day of Shadowing (when the cloud had rained down fire). It was indeed the torment of a terrible day!\n",
        "TRANSLATION_2": "Then they branded him a liar, whereupon the chastisement of the Day of Canopy overtook them. It was the chastisement of a very awesome day.\n",
        "TRANSLATION_3": "They rejected him and then the torment of the gloomy day struck them. It was certainly a great torment.\n",
        "TRANSLATION_4": "In response they denied him – therefore the punishment of the day of the tent* seized them; that was indeed a punishment of a Great Day. (The clouds formed a tent and rained fire upon them).\n",
        "TRANSLATION_5": "But they denied him, so the torment of the Day of Shadow (a gloomy cloud) seized them. Indeed that was the torment of a Great Day.\n",
        "TRANSLATION_6": "But they called him a liar, so the punishment of the day of covering overtook them; surely it was the punishment of a grievous day.\n",
        "TRANSLATION_7": "But they cried him lies; then there seized them the chastisement of the Day of Shadow; assuredly it was the chastisement of a dreadful day.\n",
        "TRANSLATION_8": "But they denied him, so there came on them the retribution of the day of gloom. Lo! it was the retribution of an awful day.\n",
        "TRANSLATION_9": "They rejected him, and then had to suffer the punishment of a day of overshadowing gloom. That was indeed the punishment of an awful day.\n",
        "TRANSLATION_10": "Thenn they belied him; wherefore there laid hold of -them the torment of day of shadow. Verily it was the torment of a Mighty Day.\n",
        "TRANSLATION_11": "So they impugned him, and then they were overtaken by the punishment of the day of the overshadowing cloud. It was indeed the punishment of a terrible day.\n",
        "TRANSLATION_12": "But they rejected him. Then the punishment of a day of overshadowing gloom seized them, and that was the Penalty of a Great Day.\n",
        "TRANSLATION_13": "But they belied him, so the torment of the day of shadow (a gloomy cloud) seized them, indeed that was the torment of a Great Day.\n",
        "TRANSLATION_14": "But they belied him, then the punishment of the Day of Shadow (raining fire) seized them. Truly, it was the punishment of a dreadful day.\n",
        "TRANSLATION_15": "But they denied him. So the punishment of the day of gloom gripped them. It was the punishment of a great day.\n",
        "TRANSLATION_16": "And they denied him, so the punishment of the day of the black cloud seized them. Indeed, it was the punishment of a terrible day.\n",
        "TRANSLATION_17": "[26:189] But they denied him, so they were seized by the chastisement of the day of the shade (al-zulla) — a cloud which gave them shade when they suffered a bout of extreme heat but which then rained down fire on them and they were incinerated. Assuredly it was the chastisement of a tremendous day.\n",
        "TRANSLATION_18": "(But they denied him) they denied his message, (so there came on them the retribution of the day of gloom) the punishment came in the form of a cloud that stopped above them and burned them with its heat. (Lo! it was the retribution of an awful day) it was a severe day of chastisement for them.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "26:189",
            "26:135",
            "6:15",
            "39:13",
            "32:14",
            "25:69",
            "26:156",
            "43:39",
            "83:5",
            "23:113"
        ],
        "BIBLE": [
            "torah:exodus:24:16",
            "prophets:jeremiah:7:32",
            "torah:numbers:17:7",
            "torah:numbers:12:5",
            "torah:numbers:9:15",
            "writings:esther:9:26",
            "writings:psalms:80:11",
            "prophets:judges:15:19",
            "prophets:jeremiah:19:6",
            "prophets:i%20samuel:3:10"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:1:13",
            "Sefer%20Yetzirah:4:11",
            "Sefer%20Yetzirah:2:5"
        ]
    }
}