{
    "VERSE": "26:19",
    "ARABIC": "وَفَعَلْتَ فَعْلَتَكَ ٱلَّتِى فَعَلْتَ وَأَنتَ مِنَ ٱلْكَٰفِرِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Yet you did the deed you did and were ungrateful.'",
        "TRANSLATION_1": "And you commited what you did, and you are ungrateful!\"\n",
        "TRANSLATION_2": "You spent many years of your life among us and then you committed that deed of yours. You are very ungrateful indeed.\"\n",
        "TRANSLATION_3": "and you did the deed which you did. You are certainly ungrateful.\"\n",
        "TRANSLATION_4": "“And you committed the deed of yours that you committed, and you were ungrateful.”\n",
        "TRANSLATION_5": "And you did your deed, which you did. While you were one of the ingrates.\"\n",
        "TRANSLATION_6": "And you did (that) deed of yours which you did, and you are one of the ungrateful.\n",
        "TRANSLATION_7": "And thou didst the deed thou didst, being one of the ungrateful!'\n",
        "TRANSLATION_8": "And thou didst that thy deed which thou didst, and thou wast one of the ingrates.\n",
        "TRANSLATION_9": "Yet you committed the deed you did, surely you are one of the ingrates.\"\n",
        "TRANSLATION_10": "And thou didst that thy deed which thou didst; and thou art of the ingrates.\n",
        "TRANSLATION_11": "Then you committed that deed of yours, and you are an ingrate.’\n",
        "TRANSLATION_12": "And thou didst a deed of thine which (thou knowest) thou didst, and thou art an ungrateful (wretch)!\"\n",
        "TRANSLATION_13": "And you did your deed, which you did (i.e. the crime of killing a man). And you are one of the ingrates.\"\n",
        "TRANSLATION_14": "Yet you were ungrateful and have done the deed you did'\n",
        "TRANSLATION_15": "And you committed that deed you committed, and you were ungrateful.”\n",
        "TRANSLATION_16": "And [then] you did your deed which you did, and you were of the ungrateful.\"\n",
        "TRANSLATION_17": "[26:19] And you committed that deed of yours — namely, his slaying of the Egyptian — being an ingrate’, a denier of my favours to you in having reared you [among us] and not enslaved you.\n",
        "TRANSLATION_18": "(And thou didst that thy deed which thou didst) and you killed the person that you killed, (and thou wast one of the ingrates) and you are now ungrateful for my kindness,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "26:19",
            "19:72",
            "26:219",
            "29:9",
            "86:2",
            "7:15",
            "69:3",
            "85:7",
            "26:20",
            "26:215"
        ],
        "BIBLE": [
            "prophets:isaiah:43:4",
            "writings:psalms:8:5",
            "prophets:i%20kings:1:6",
            "torah:numbers:14:15",
            "torah:genesis:23:1",
            "torah:numbers:31:17",
            "torah:deuteronomy:21:22",
            "prophets:jonah:1:14",
            "writings:proverbs:13:8",
            "torah:genesis:9:5"
        ]
    }
}