{
    "VERSE": "26:197",
    "ARABIC": "أَوَلَمْ يَكُن لَّهُمْ ءَايَةً أَن يَعْلَمَهُۥ عُلَمَٰٓؤُا۟ بَنِىٓ إِسْرَٰٓءِيلَ",
    "ENGLISH": {
        "TRANSLATION_0": "Is it not indeed a Sign for them that the scholars of the tribe of Israel have knowledge of it?",
        "TRANSLATION_1": "Was it not a proof for them that the learned men of Israel knew about this?\n",
        "TRANSLATION_2": "Is it not a Sign to them - (to wit, the Makkans) - that the learned men of the Children of Israel know that?\n",
        "TRANSLATION_3": "Is not the fact (that the Israelite scholars already knew about the Quran through their Book) sufficient evidence for the pagans of the truthfulness (of the Quran)?\n",
        "TRANSLATION_4": "And was this not a sign for them, that the scholars of the Descendants of Israel may recognise this Prophet?\n",
        "TRANSLATION_5": "Is it not a sign to them that the learned scholars of the Children of Israel knew it\n",
        "TRANSLATION_6": "Is it not a sign to them that the learned men of the Israelites know it?\n",
        "TRANSLATION_7": "Was it not a sign for them, that it is known to the learned of the Children of Israel?\n",
        "TRANSLATION_8": "Is it not a token for them that the doctors of the Children of Israel know it?\n",
        "TRANSLATION_9": "Is it not evidence enough for them that the learned among the Children of Israel have recognized this [as true]?\n",
        "TRANSLATION_10": "Is it not a sign unto them that the learned among the Children of Isra'il know it?\n",
        "TRANSLATION_11": "Is it not a sign for them that the learned of the Children of Israel recognize it?\n",
        "TRANSLATION_12": "Is it not a Sign to them that the Learned of the Children of Israel knew it (as true)?\n",
        "TRANSLATION_13": "Is it not a sign to them that the learned scholars (like 'Abdullah bin Salam who embraced Islam) of the Children of Israel knew it (as true)?\n",
        "TRANSLATION_14": "Was it not a sign for them known to the learned of the Children of Israel?\n",
        "TRANSLATION_15": "Is it not a sign for them that the scholars of the Children of Israel recognized it?\n",
        "TRANSLATION_16": "And has it not been a sign to them that it is recognized by the scholars of the Children of Israel?\n",
        "TRANSLATION_17": "[26:197] Is it not a sign, of this fact, for them, for the disbelievers of Mecca, that the learned of the Children of Israel recognise it?, [those] such as ‘Abd Allāh b. Salām and his companions, from among those who became   [Muslim] believers: they are able inform [you] of this (read yakun with āyatan in the accusative, or takun with āyatun in the nominative).\n",
        "TRANSLATION_18": "(Is it not a token) a sign for the prophethood of Muhammad, Allah bless him and give peace, (for them) for the people of Mecca (that the doctors of the Children of Israel know it?) That is, when they asked them about Muhammad (pbuh) and the Qur'an and they informed them about both.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "26:197",
            "27:84",
            "15:70",
            "45:8",
            "40:69",
            "24:18",
            "43:59",
            "26:22",
            "26:17",
            "21:91"
        ],
        "BIBLE": [
            "torah:numbers:31:18",
            "torah:exodus:11:7",
            "torah:numbers:17:3",
            "prophets:jeremiah:32:32",
            "torah:exodus:31:13",
            "prophets:ii%20kings:5:8",
            "writings:ii%20chronicles:25:4",
            "torah:numbers:31:42",
            "writings:i%20chronicles:12:33",
            "torah:numbers:32:18"
        ]
    }
}