{
    "VERSE": "26:2",
    "ARABIC": "تِلْكَ ءَايَٰتُ ٱلْكِتَٰبِ ٱلْمُبِينِ",
    "ENGLISH": {
        "TRANSLATION_0": "Those are the Signs of the Clear Book.",
        "TRANSLATION_1": "These are the verses of the perspicuous Book.\n",
        "TRANSLATION_2": "These are the verses of the Clear Book.\n",
        "TRANSLATION_3": "These are the verses of the illustrious Book.\n",
        "TRANSLATION_4": "These are verses of the clear Book.\n",
        "TRANSLATION_5": "These are Ayat of the Book Mubin.\n",
        "TRANSLATION_6": "These are the verses of the Book that makes (things) clear.\n",
        "TRANSLATION_7": "Those are the signs of the Manifest Book.\n",
        "TRANSLATION_8": "These are revelations of the Scripture that maketh plain.\n",
        "TRANSLATION_9": "These are the verses of the Book that makes things clear.\n",
        "TRANSLATION_10": "These are the verses of a Book luminous.\n",
        "TRANSLATION_11": "These are the signs of the Manifest Book.\n",
        "TRANSLATION_12": "These are verses of the Book that makes (things) clear.\n",
        "TRANSLATION_13": "These are the Verses of the manifest Book [this Quran, which was promised by Allah in the Taurat (Torah) and the Injeel (Gospel), makes things clear].\n",
        "TRANSLATION_14": "Those are the verses of the clear Book.\n",
        "TRANSLATION_15": "These are the Verses of the Clarifying Book.\n",
        "TRANSLATION_16": "These are the verses of the clear Book.\n",
        "TRANSLATION_17": "[26:2] Those, namely, these signs, are the signs of the Manifest Book, the Qur’ān (the genitive annexation [āyātu’lkitābi] conveys the [partitive] meaning of min), [the Manifest meaning] the one that manifests what is truth from what is falsehood.\n",
        "TRANSLATION_18": "(These are revelations of the Scripture that maketh plain) He says: I swear by this surah, the verses of the Qur'an, which make plain the lawful and the unlawful, the commands and prohibitions.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "26:2",
            "28:2",
            "12:1",
            "31:2",
            "10:1",
            "27:1",
            "15:1",
            "29:47",
            "43:2",
            "44:2"
        ],
        "BIBLE": [
            "prophets:nahum:3:6",
            "prophets:ii%20samuel:23:5",
            "prophets:isaiah:40:3",
            "torah:leviticus:11:43",
            "torah:exodus:23:13",
            "torah:numbers:31:23",
            "writings:job:13:26",
            "torah:leviticus:5:13",
            "prophets:isaiah:55:11",
            "torah:deuteronomy:1:11"
        ]
    }
}