{
    "VERSE": "26:20",
    "ARABIC": "قَالَ فَعَلْتُهَآ إِذًا وَأَنَا۠ مِنَ ٱلضَّآلِّينَ",
    "ENGLISH": {
        "TRANSLATION_0": "He said, 'At the time I did it I was one of the misguided",
        "TRANSLATION_1": "(Moses) replied: \"I did do that and I was in the wrong,\n",
        "TRANSLATION_2": "Moses replied: \"I committed that act erringly.\n",
        "TRANSLATION_3": "Moses said, \"I did do it and I made a mistake.\n",
        "TRANSLATION_4": "Said Moosa, “I did that at a time when I was unaware of the consequences.” (In anger – See verse 28:15)\n",
        "TRANSLATION_5": "Musa said: \"I did it then, when I was in error.\"\n",
        "TRANSLATION_6": "He said: I did it then while I was of those unable to see the right course;\n",
        "TRANSLATION_7": "Said he, 'Indeed I did it then, being one of those that stray;\n",
        "TRANSLATION_8": "He said: I did it then, when I was of those who are astray.\n",
        "TRANSLATION_9": "Moses replied, \"I did that when I was one of the misguided,\n",
        "TRANSLATION_10": "He said: I did it then when I was mistaken.\n",
        "TRANSLATION_11": "He said, ‘I did that when I was astray.\n",
        "TRANSLATION_12": "Moses said: \"I did it then, when I was in error.\n",
        "TRANSLATION_13": "Musa (Moses) said: \"I did it then, when I was an ignorant (as regards my Lord and His Message).\n",
        "TRANSLATION_14": "He (Moses) replied: 'Indeed, I did that when I was among those who stray.\n",
        "TRANSLATION_15": "He said, “I did it then, when I was of those astray.\n",
        "TRANSLATION_16": "[Moses] said, \"I did it, then, while I was of those astray.\n",
        "TRANSLATION_17": "[26:20] He, Moses, said, ‘I did that then, when I was astray, from the knowledge and the Message which God would later give me.\n",
        "TRANSLATION_18": "(He said) Moses said: (I did it then, when I was of those who are astray) when I was ungrateful for your kindness.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "26:20",
            "26:19",
            "26:42",
            "7:21",
            "26:94",
            "25:76",
            "74:14",
            "53:53",
            "7:120",
            "79:7"
        ],
        "BIBLE": [
            "torah:leviticus:8:5",
            "torah:deuteronomy:6:20",
            "torah:deuteronomy:31:25",
            "torah:exodus:24:12",
            "torah:exodus:10:1",
            "torah:numbers:32:20",
            "torah:exodus:16:8",
            "prophets:ezekiel:20:8",
            "torah:leviticus:9:6",
            "prophets:judges:15:3"
        ]
    }
}