{
    "VERSE": "26:205",
    "ARABIC": "أَفَرَءَيْتَ إِن مَّتَّعْنَٰهُمْ سِنِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Do you think, if We let them enjoy themselves for years",
        "TRANSLATION_1": "Just think: If We let them enjoy (the good things of life) for a few years more,\n",
        "TRANSLATION_2": "Did you consider that if We were to let them enjoy life for many years\n",
        "TRANSLATION_3": "Do you not see that even if We give them respite for years\n",
        "TRANSLATION_4": "Therefore observe, that if We give them some comforts for some years, –\n",
        "TRANSLATION_5": "Think, if We do let them enjoy for years,\n",
        "TRANSLATION_6": "Have you then considered if We let them enjoy themselves for years,\n",
        "TRANSLATION_7": "What thinkest thou? If We give them enjoyment of days for many years,\n",
        "TRANSLATION_8": "Hast thou then seen, if We content them for (long) years,\n",
        "TRANSLATION_9": "Think! If We let them enjoy life for some years,\n",
        "TRANSLATION_10": "Beholdest thou? - if We let them enjoy for years.\n",
        "TRANSLATION_11": "Tell me, should We let them enjoy for some years,\n",
        "TRANSLATION_12": "Seest thou? If We do let them enjoy (this life) for a few years,\n",
        "TRANSLATION_13": "Tell Me, if We do let them enjoy for years,\n",
        "TRANSLATION_14": "What do you see? If We gave them enjoyment for years,\n",
        "TRANSLATION_15": "Have you considered: if We let them enjoy themselves for some years.\n",
        "TRANSLATION_16": "Then have you considered if We gave them enjoyment for years\n",
        "TRANSLATION_17": "[26:205] Consider [this] then — inform Me: If We were to let them enjoy [life] for [many] years,\n",
        "TRANSLATION_18": "(Hast thou then seen) O Muhammad, (We content them for (long) years) in their state of disbelief,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "26:205",
            "26:18",
            "29:2",
            "53:33",
            "96:13",
            "56:71",
            "32:18",
            "26:204",
            "37:176",
            "26:40"
        ],
        "BIBLE": [
            "writings:ecclesiastes:5:17",
            "writings:ecclesiastes:8:15",
            "writings:ecclesiastes:9:9",
            "torah:deuteronomy:30:15",
            "torah:exodus:16:29",
            "writings:ezra:9:13",
            "writings:ecclesiastes:3:10",
            "writings:i%20chronicles:29:14",
            "torah:genesis:1:31",
            "prophets:i%20kings:3:13"
        ]
    }
}