{
    "VERSE": "26:208",
    "ARABIC": "وَمَآ أَهْلَكْنَا مِن قَرْيَةٍ إِلَّا لَهَا مُنذِرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "We have never destroyed a city without giving it prior warning",
        "TRANSLATION_1": "Never have We destroyed a habitation till We had sent admonishers to them\n",
        "TRANSLATION_2": "We never destroyed any habitation but that it had warners\n",
        "TRANSLATION_3": "We never destroyed any town without first sending to them warning and guidance.\n",
        "TRANSLATION_4": "And never did We destroy a township which did not have Heralds of warning, –\n",
        "TRANSLATION_5": "And never did We destroy a township but it had its warners\n",
        "TRANSLATION_6": "And We did not destroy any town but it had (its) warners,\n",
        "TRANSLATION_7": "Never a city We destroyed, but it had warners\n",
        "TRANSLATION_8": "And We destroyed no township but it had its warners\n",
        "TRANSLATION_9": "Never have We destroyed a town without sending down messengers to warn it,\n",
        "TRANSLATION_10": "And We destroyed not a city but it had its warners.\n",
        "TRANSLATION_11": "We have not destroyed any town without its having warners,\n",
        "TRANSLATION_12": "Never did We destroy a population, but had its warners -\n",
        "TRANSLATION_13": "And never did We destroy a township, but it had its warners\n",
        "TRANSLATION_14": "We never destroyed a village that did not have warners\n",
        "TRANSLATION_15": "Never did We destroy a town, but it had warners.\n",
        "TRANSLATION_16": "And We did not destroy any city except that it had warners\n",
        "TRANSLATION_17": "[26:208] And We have not destroyed any town but it had warners, messengers to warn its inhabitants;\n",
        "TRANSLATION_18": "(And We destroyed no township) no inhabitants of any township (but it had its warners) warning messengers,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "26:208",
            "15:4",
            "34:34",
            "37:164",
            "26:99",
            "21:95",
            "21:6",
            "47:13",
            "22:48",
            "36:69"
        ],
        "BIBLE": [
            "writings:i%20chronicles:4:33",
            "prophets:ezekiel:26:17",
            "prophets:i%20kings:20:2",
            "writings:psalms:78:49",
            "prophets:ii%20samuel:12:27",
            "prophets:zephaniah:3:6",
            "prophets:joshua:15:45",
            "writings:psalms:107:4",
            "torah:numbers:24:12",
            "writings:ii%20chronicles:36:15"
        ]
    }
}