{
    "VERSE": "26:211",
    "ARABIC": "وَمَا يَنۢبَغِى لَهُمْ وَمَا يَسْتَطِيعُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "It does not befit them and they are not capable of it.",
        "TRANSLATION_1": "They are not worthy of it, nor have they power.\n",
        "TRANSLATION_2": "nor does it behove them, nor does it lie in their power.\n",
        "TRANSLATION_3": "they are not supposed to do so. Nor do have they the ability for such a task.\n",
        "TRANSLATION_4": "They are unworthy of it, nor can they do it.\n",
        "TRANSLATION_5": "Neither would it suit them nor are they able.\n",
        "TRANSLATION_6": "And it behoves them not, and they have not the power to do (it).\n",
        "TRANSLATION_7": "it behoves them not, neither are they able.\n",
        "TRANSLATION_8": "It is not meet for them, nor is it in their power,\n",
        "TRANSLATION_9": "neither are they worthy of it, nor are they capable of it,\n",
        "TRANSLATION_10": "It behoveth them not, nor they can.\n",
        "TRANSLATION_11": "Neither does it behoove them, nor are they capable [of doing that].\n",
        "TRANSLATION_12": "It would neither suit them nor would they be able (to produce it).\n",
        "TRANSLATION_13": "Neither would it suit them, nor they can (produce it).\n",
        "TRANSLATION_14": "it is not for them, nor are they able.\n",
        "TRANSLATION_15": "It is not in their interests, nor in their power.\n",
        "TRANSLATION_16": "It is not allowable for them, nor would they be able.\n",
        "TRANSLATION_17": "[26:211] Neither would it behove, befit, them, to bring it down, nor are they capable, [of doing] that.\n",
        "TRANSLATION_18": "(It is not meet for them) the devils are not fit to do so, (nor is it in their power) nor could they do this,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "26:211",
            "77:36",
            "83:33",
            "21:23",
            "51:45",
            "68:18",
            "15:84",
            "56:19",
            "74:14",
            "26:138"
        ],
        "BIBLE": [
            "writings:job:27:22",
            "writings:job:1:12",
            "writings:proverbs:3:27",
            "writings:daniel:8:24",
            "writings:psalms:63:3",
            "writings:job:36:22",
            "torah:exodus:4:14",
            "writings:psalms:90:11",
            "writings:psalms:79:11",
            "prophets:zechariah:4:6"
        ]
    }
}