{
    "VERSE": "26:223",
    "ARABIC": "يُلْقُونَ ٱلسَّمْعَ وَأَكْثَرُهُمْ كَٰذِبُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "They give them a hearing and most of them are liars.",
        "TRANSLATION_1": "Who listens to you (for spreading rumours); but most of them are liars.\n",
        "TRANSLATION_2": "on those who whisper hearsay in the ears of people; and most of them are liars.\n",
        "TRANSLATION_3": "The satans try to listen to the heavens but many of them are liars.\n",
        "TRANSLATION_4": "The devils convey upon them what they heard, but most of them are liars.\n",
        "TRANSLATION_5": "Who gives ear, and most of them are liars.\n",
        "TRANSLATION_6": "They incline their ears, and most of them are liars.\n",
        "TRANSLATION_7": "They give ear, but most of them are liars.\n",
        "TRANSLATION_8": "They listen eagerly, but most of them are liars.\n",
        "TRANSLATION_9": "who lends an ear to them, and most of them are liars.\n",
        "TRANSLATION_10": "Who give ear, and most of them are liars.\n",
        "TRANSLATION_11": "They eavesdrop, and most of them are liars.\n",
        "TRANSLATION_12": "(Into whose ears) they pour hearsay vanities, and most of them are liars.\n",
        "TRANSLATION_13": "Who gives ear (to the devils and they pour what they may have heard of the unseen from the angels), and most of them are liars.\n",
        "TRANSLATION_14": "They listen, but most of them are liars.\n",
        "TRANSLATION_15": "They give ear, and most of them are liars.\n",
        "TRANSLATION_16": "They pass on what is heard, and most of them are liars.\n",
        "TRANSLATION_17": "[26:223] They, the devils, report the heard [sayings], what they hear from the angels [they report] to the soothsayers, but most of them are liars, adding much that is false to what they hear — this was [revealed] before the devils were barred from the heaven.\n",
        "TRANSLATION_18": "(They listen eagerly) the devils listen eagerly to the speech of the angels, (but most of them are liars) the devils are liars because they hear one thing and convey instead 100 things to fortune tellers.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "26:223",
            "16:83",
            "107:7",
            "12:103",
            "26:212",
            "20:34",
            "108:1",
            "36:7",
            "42:34",
            "30:6"
        ],
        "BIBLE": [
            "torah:exodus:17:2",
            "writings:ii%20chronicles:33:10",
            "prophets:isaiah:28:23",
            "torah:numbers:11:13",
            "torah:numbers:11:18",
            "prophets:i%20kings:3:9",
            "writings:job:29:11",
            "torah:deuteronomy:29:3",
            "writings:job:41:3",
            "prophets:isaiah:55:4"
        ]
    }
}