{
    "VERSE": "26:225",
    "ARABIC": "أَلَمْ تَرَ أَنَّهُمْ فِى كُلِّ وَادٍ يَهِيمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Do you not see how they ramble on in every style",
        "TRANSLATION_1": "Have you not seen that they wander distract in every valley,\n",
        "TRANSLATION_2": "Do you not see that they wander about in every valley\n",
        "TRANSLATION_3": "Have you not seen them wandering and bewildered in every valley\n",
        "TRANSLATION_4": "Did you not see that they keep wandering in every valley?\n",
        "TRANSLATION_5": "See you not that they speak about every subject in their poetry\n",
        "TRANSLATION_6": "Do you not see that they wander about bewildered in every valley?\n",
        "TRANSLATION_7": "hast thou not seen how they wander in every valley\n",
        "TRANSLATION_8": "Hast thou not seen how they stray in every valley,\n",
        "TRANSLATION_9": "Do you not see how they wander aimlessly in every valley,\n",
        "TRANSLATION_10": "Observest thou not, that they Wander about every vale.\n",
        "TRANSLATION_11": "Have you not regarded that they rove in every valley,\n",
        "TRANSLATION_12": "Seest thou not that they wander distracted in every valley?-\n",
        "TRANSLATION_13": "See you not that they speak about every subject (praising others right or wrong) in their poetry?\n",
        "TRANSLATION_14": "Have you not seen how they wander in every valley,\n",
        "TRANSLATION_15": "Do you not see how they ramble in every style?\n",
        "TRANSLATION_16": "Do you not see that in every valley they roam\n",
        "TRANSLATION_17": "[26:225] Have you not noticed that — are you not aware that — in every valley, of the valleys of rhetoric and the art thereof, they rove, overstepping the bounds [of decency] in [their] eulogies and diatribes,\n",
        "TRANSLATION_18": "(Hast thou not seen how they) the poets (stray) they come and go, sometimes eulogizing and sometimes satirizing (in every valley) in every genre and theme,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "26:225",
            "105:2",
            "9:126",
            "44:55",
            "83:4",
            "26:128",
            "26:7",
            "21:99",
            "24:41",
            "55:26"
        ],
        "BIBLE": [
            "writings:job:38:17",
            "writings:psalms:35:22",
            "torah:genesis:16:13",
            "prophets:isaiah:42:20",
            "writings:lamentations:3:59",
            "writings:job:31:19",
            "writings:psalms:90:15",
            "writings:lamentations:3:60",
            "torah:numbers:27:13",
            "writings:proverbs:6:3"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:13",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:2",
            "Sefer%20Yetzirah:1:4"
        ]
    }
}