{
    "VERSE": "26:27",
    "ARABIC": "قَالَ إِنَّ رَسُولَكُمُ ٱلَّذِىٓ أُرْسِلَ إِلَيْكُمْ لَمَجْنُونٌ",
    "ENGLISH": {
        "TRANSLATION_0": "He said, 'This Messenger, who has been sent to you, is mad.'",
        "TRANSLATION_1": "(The Pharaoh) said (to his nobles): \"Your apostle who has been sent to you, is certainly mad.\"\n",
        "TRANSLATION_2": "Pharaoh said to the audience: \"This Messenger of yours who has been sent to you is simply mad.\"\n",
        "TRANSLATION_3": "The Pharaoh said, \"The Messengers who has been sent to you is certainly insane\".\n",
        "TRANSLATION_4": "Said Firaun, “This (Noble) Messenger of yours, who has been sent towards you, has no intelligence!”\n",
        "TRANSLATION_5": "(Fir`awn) said: \"Verily, your Messenger who has been sent to you is a madman!\"\n",
        "TRANSLATION_6": "Said he: Most surely your Apostle who is sent to you is mad.\n",
        "TRANSLATION_7": "Said he, 'Surely your Messenger who was sent to you is possessed!'\n",
        "TRANSLATION_8": "(Pharaoh) said: Lo! your messenger who hath been sent unto you is indeed a madman!\n",
        "TRANSLATION_9": "Pharaoh said, \"This messenger who has been sent to you is surely possessed!\"\n",
        "TRANSLATION_10": "Fir'awn said: verily your apostle who hath been sent unto you is mad.\n",
        "TRANSLATION_11": "He said, ‘Indeed your messenger, who has been sent to you, is surely crazy!’\n",
        "TRANSLATION_12": "(Pharaoh) said: \"Truly your messenger who has been sent to you is a veritable madman!\"\n",
        "TRANSLATION_13": "Fir'aun (Pharaoh) said: \"Verily, your Messenger who has been sent to you is a madman!\"\n",
        "TRANSLATION_14": "(Pharaoh) said: 'Surely, the Messenger who has been sent to you is mad!'\n",
        "TRANSLATION_15": "He said, “This messenger of yours, who is sent to you, is crazy.”\n",
        "TRANSLATION_16": "[Pharaoh] said, \"Indeed, your 'messenger' who has been sent to you is mad.\"\n",
        "TRANSLATION_17": "[26:27] He said, ‘Verily this messenger of yours sent to you is a madman!’\n",
        "TRANSLATION_18": "(Pharaoh) said: Lo! your messenger who hath been sent unto you is indeed a madman!) They said: who is this that you are calling us to? And who is this Lord of ours who is also the Lord of our fathers, Moses?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "26:27",
            "73:15",
            "77:7",
            "69:40",
            "81:19",
            "51:8",
            "6:10",
            "21:41",
            "9:1",
            "7:76"
        ],
        "BIBLE": [
            "prophets:i%20samuel:19:14",
            "torah:numbers:12:2",
            "torah:exodus:11:9",
            "torah:exodus:8:15",
            "torah:exodus:11:1",
            "prophets:joshua:13:1",
            "prophets:ii%20kings:1:5",
            "torah:exodus:32:29",
            "prophets:ii%20kings:1:16",
            "torah:genesis:31:5"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:1:10",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:3:3"
        ]
    }
}