{
    "VERSE": "26:28",
    "ARABIC": "قَالَ رَبُّ ٱلْمَشْرِقِ وَٱلْمَغْرِبِ وَمَا بَيْنَهُمَآ إِن كُنتُمْ تَعْقِلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "He said, 'The Lord of the East and the West and everything between them if you used your intellect.'",
        "TRANSLATION_1": "(Moses) said: \"The Lord of the East and the Lord of the West and all that lies between them, if you have sense.\"\n",
        "TRANSLATION_2": "Moses continued: \"(He is) the Lord of the east and the west, and all between them. If you only had any understanding!\"\n",
        "TRANSLATION_3": "Moses continued, \"He is the Lord of the East and West and all that is between them, if only you would think\".\n",
        "TRANSLATION_4": "He said, “The Lord of the East and the West and all that is between them; if you have sense.”\n",
        "TRANSLATION_5": "(Musa) said: \"Lord of the east and the west, and all that is between them, if you did but understand!\"\n",
        "TRANSLATION_6": "He said: The Lord of the east and the west and what is between them, if you understand.\n",
        "TRANSLATION_7": "He said, 'The Lord of the East and West, and what between them is, if you have understanding,'\n",
        "TRANSLATION_8": "He said: Lord of the East and the West and all that is between them, if ye did but understand.\n",
        "TRANSLATION_9": "Moses said, \"He is the Lord of the East and the West, and all that lies between them, if only you could understand.\"\n",
        "TRANSLATION_10": "He said: Lord of the east and the west and whatsoever is in-between, if ye understand.\n",
        "TRANSLATION_11": "He said, ‘The Lord of the east and the west and whatever is between them—should you exercise your reason.’\n",
        "TRANSLATION_12": "(Moses) said: \"Lord of the East and the West, and all between! if ye only had sense!\"\n",
        "TRANSLATION_13": "Musa (Moses) said: \"Lord of the east and the west, and all that is between them, if you did but understand!\"\n",
        "TRANSLATION_14": "He is the Lord of the East and the West' said he (Moses), 'and all that is between them, if you could understand'\n",
        "TRANSLATION_15": "He said, “Lord of the East and the West, and everything between them, if you understand.”\n",
        "TRANSLATION_16": "[Moses] said, \"Lord of the east and the west and that between them, if you were to reason.\"\n",
        "TRANSLATION_17": "[26:28] He, Moses, said, ‘The Lord of the east and the west and all that is between them — should you comprehend,’, that He is such [a Lord] then believe in Him alone.\n",
        "TRANSLATION_18": "(He said) Moses said: (Lord of the East) He is the Lord of the East (and the West) and the Lord of the West (and all that is between them, if ye did but understand) if you did but believe.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "26:28",
            "55:17",
            "37:5",
            "44:7",
            "26:24",
            "70:40",
            "73:9",
            "32:25",
            "42:38",
            "36:27"
        ],
        "BIBLE": [
            "torah:leviticus:9:6",
            "torah:leviticus:8:5",
            "torah:numbers:12:2",
            "writings:job:28:28",
            "torah:numbers:9:8",
            "torah:exodus:32:9",
            "torah:genesis:22:16",
            "torah:numbers:12:11",
            "torah:exodus:32:33",
            "prophets:ii%20kings:5:3"
        ]
    }
}