{
    "VERSE": "26:29",
    "ARABIC": "قَالَ لَئِنِ ٱتَّخَذْتَ إِلَٰهًا غَيْرِى لَأَجْعَلَنَّكَ مِنَ ٱلْمَسْجُونِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "He said, 'If you take any god other than me, I will certainly throw you into prison.'",
        "TRANSLATION_1": "(The Pharaoh) said: \"If you took another god apart from me I will have you incarcerated.\"\n",
        "TRANSLATION_2": "Pharaoh said: \"If you take any god other than me, I will certainly make you one of those (who are rotting) in prison.\"\n",
        "TRANSLATION_3": "Pharaoh said, \"If you put forward any god other than me, I will surely put you in prison\".\n",
        "TRANSLATION_4": "Said Firaun, “If you ascribe any one else as a God other than me, I will surely imprison you.”\n",
        "TRANSLATION_5": "He said: \"If you choose a god other than me, I will certainly put you among the prisoners.\"\n",
        "TRANSLATION_6": "Said he: If you will take a god besides me, I will most certainly make you one of the imprisoned.\n",
        "TRANSLATION_7": "Said he, 'If thou takest a god other than me, I shall surely make thee one of the imprisoned.'\n",
        "TRANSLATION_8": "(Pharaoh) said: If thou choosest a god other than me, I assuredly shall place thee among the prisoners.\n",
        "TRANSLATION_9": "Pharaoh said, \"If you take any deity other than myself, I will throw you into prison,\"\n",
        "TRANSLATION_10": "Fir'awn said: if thou wilt take a god other than me, I shall surely place thee among the prisoners.\n",
        "TRANSLATION_11": "He said, ‘If you take up any god other than me, I will surely make you a prisoner!’\n",
        "TRANSLATION_12": "(Pharaoh) said: \"If thou dost put forward any god other than me, I will certainly put thee in prison!\"\n",
        "TRANSLATION_13": "Fir'aun (Pharaoh) said: \"If you choose an ilah (god) other than me, I will certainly put you among the prisoners.\"\n",
        "TRANSLATION_14": "If you take any other god except myself' he (Pharaoh) replied, 'you shall be thrown into prison'\n",
        "TRANSLATION_15": "He said, “If you accept any god other than me, I will make you a prisoner.”\n",
        "TRANSLATION_16": "[Pharaoh] said, \"If you take a god other than me, I will surely place you among those imprisoned.\"\n",
        "TRANSLATION_17": "[26:29] He, Pharaoh, said, to Moses: ‘If you choose any god other than me, I will surely make you a prisoner!’. His [Pharaoh’s] prison was very harsh, for a person would be shut up [in a dungeon] underground alone, where he could neither see nor hear anyone else.\n",
        "TRANSLATION_18": "((Pharaoh) said: If thou choosest) if you worship (a god other than me) Moses, (I assuredly shall place thee among the prisoners) his prisons were worse than death, for he used to put people in complete isolation, unable to see or hear anyone.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "26:29",
            "39:64",
            "37:56",
            "39:57",
            "7:140",
            "6:40",
            "46:22",
            "21:59",
            "9:75",
            "21:21"
        ],
        "BIBLE": [
            "prophets:i%20kings:20:34",
            "prophets:i%20samuel:28:2",
            "writings:i%20chronicles:28:4",
            "writings:nehemiah:2:4",
            "prophets:ezekiel:43:27",
            "prophets:i%20kings:17:13",
            "torah:numbers:17:11",
            "writings:i%20chronicles:10:4",
            "prophets:joshua:7:19",
            "torah:exodus:34:17"
        ]
    }
}