{
    "VERSE": "26:3",
    "ARABIC": "لَعَلَّكَ بَٰخِعٌ نَّفْسَكَ أَلَّا يَكُونُوا۟ مُؤْمِنِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Perhaps you will destroy yourself with grief because they will not become muminun.",
        "TRANSLATION_1": "You may perhaps wear out your heart because they do not come to belief.\n",
        "TRANSLATION_2": "(O Muhammad), you will perhaps grieve yourself to death because these people do not believe.\n",
        "TRANSLATION_3": "You will perhaps kill yourself with anguish because they are not accepting the faith.\n",
        "TRANSLATION_4": "Possibly you may risk your life (O dear Prophet Mohammed – peace and blessings be upon him) by grieving, because they did not believe.\n",
        "TRANSLATION_5": "It may be that you are going Bakhi` yourself, that they do not become believers.\n",
        "TRANSLATION_6": "Perhaps you will kill yourself with grief because they do not believe.\n",
        "TRANSLATION_7": "Perchance thou consumest thyself that they are not believers.\n",
        "TRANSLATION_8": "It may be that thou tormentest thyself (O Muhammad) because they believe not.\n",
        "TRANSLATION_9": "It may be that you will destroy yourself with grief because they will not believe.\n",
        "TRANSLATION_10": "Belike thou shalt kill thyself with grief because they become not believers.\n",
        "TRANSLATION_11": "You are liable to imperil your life [out of distress] that they will not have faith.\n",
        "TRANSLATION_12": "It may be thou frettest thy soul with grief, that they do not become Believers.\n",
        "TRANSLATION_13": "It may be that you (O Muhammad SAW) are going to kill yourself with grief, that they do not become believers [in your Risalah (Messengership) and in your Message of Islamic Monotheism].\n",
        "TRANSLATION_14": "Perhaps you consume yourself that they are not believers.\n",
        "TRANSLATION_15": "Perhaps you will destroy yourself with grief, because they do not become believers.\n",
        "TRANSLATION_16": "Perhaps, [O Muhammad], you would kill yourself with grief that they will not be believers.\n",
        "TRANSLATION_17": "[26:3] Perhaps, O Muhammad (s), you might kill yourself, out of distress for the reason, that they, namely, the people of Mecca, will not become believers (la‘alla here expresses sympathy, in other words [what is meant is] ‘have pity on it [your self] by alleviating [the burden of] this distress’).\n",
        "TRANSLATION_18": "(It may be that thou tormentest thyself) it may be that you kill yourself with grief over them (because they believe not) because the Quraysh do not want to become believers. This is because he was very keen for them to become believers.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "26:3",
            "20:41",
            "28:33",
            "81:14",
            "7:192",
            "51:21",
            "21:102",
            "91:7",
            "21:64",
            "82:5"
        ],
        "BIBLE": [
            "torah:deuteronomy:13:10",
            "prophets:jeremiah:5:23",
            "prophets:joshua:23:14",
            "writings:ii%20chronicles:1:11",
            "prophets:jeremiah:13:10",
            "writings:lamentations:1:20",
            "prophets:ii%20samuel:19:20",
            "prophets:i%20samuel:2:33",
            "prophets:jeremiah:4:19",
            "torah:deuteronomy:15:10"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:2:2",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:2:6",
            "Sefer%20Yetzirah:1:10"
        ]
    }
}