{
    "VERSE": "26:32",
    "ARABIC": "فَأَلْقَىٰ عَصَاهُ فَإِذَا هِىَ ثُعْبَانٌ مُّبِينٌ",
    "ENGLISH": {
        "TRANSLATION_0": "So He threw down his staff and there it was, unmistakably a snake.",
        "TRANSLATION_1": "So (Moses) cast his staff, and lo, it turned into a living serpent.\n",
        "TRANSLATION_2": "(No sooner had he said this than) Moses threw down his rod and behold, it was a veritable serpent,\n",
        "TRANSLATION_3": "Moses threw his staff and suddenly it became a serpent.\n",
        "TRANSLATION_4": "So Moosa put down his staff and it became a visible serpent.\n",
        "TRANSLATION_5": "So he threw his stick, and behold, it was a serpent, manifest.\n",
        "TRANSLATION_6": "So he cast down his rod, and lo! it was an obvious serpent,\n",
        "TRANSLATION_7": "So he cast his staff, and behold, it was a serpent manifest.\n",
        "TRANSLATION_8": "Then he flung down his staff and it became a serpent manifest,\n",
        "TRANSLATION_9": "So Moses threw down his staff and suddenly it appeared as a serpent, plainly visible.\n",
        "TRANSLATION_10": "Then he cast down his staff, and lo! it was a serpent manifest.\n",
        "TRANSLATION_11": "Thereat he threw down his staff, and behold, it was a manifest python.\n",
        "TRANSLATION_12": "So (Moses) threw his rod, and behold, it was a serpent, plain (for all to see)!\n",
        "TRANSLATION_13": "So [Musa (Moses)] threw his stick, and behold, it was a serpent, manifest.\n",
        "TRANSLATION_14": "He cast down his staff and thereupon it was a clear serpent.\n",
        "TRANSLATION_15": "So he cast his staff; and it was a serpent, plain to see.\n",
        "TRANSLATION_16": "So [Moses] threw his staff, and suddenly it was a serpent manifest.\n",
        "TRANSLATION_17": "[26:32] So he threw down his staff, and lo! it was a manifest serpent, a great snake.\n",
        "TRANSLATION_18": "(Then he) Moses (flung down his staff and it became a serpent) a yellow, male serpent (manifest) as huge as any serpent can be,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "26:32",
            "7:107",
            "26:45",
            "7:117",
            "27:10",
            "28:31",
            "26:80",
            "54:29",
            "80:22",
            "7:119"
        ],
        "BIBLE": [
            "torah:exodus:4:3",
            "prophets:isaiah:28:27",
            "torah:exodus:4:7",
            "prophets:ii%20kings:6:6",
            "torah:exodus:7:15",
            "torah:exodus:7:10",
            "writings:ruth:4:1",
            "torah:exodus:7:9",
            "prophets:ii%20kings:9:23",
            "torah:genesis:42:28"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:4:3"
        ]
    }
}