{
    "VERSE": "26:36",
    "ARABIC": "قَالُوٓا۟ أَرْجِهْ وَأَخَاهُ وَٱبْعَثْ فِى ٱلْمَدَآئِنِ حَٰشِرِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "They said, 'Detain him and his brother and send out marshals to the cities,",
        "TRANSLATION_1": "They said: \"Put him and his brother off awhile, and send summoners to the cities to gather\n",
        "TRANSLATION_2": "They said: \"Detain him and his brother for a while and send forth heralds to the cities\n",
        "TRANSLATION_3": "They said, \"Hold him and his brother off for a while\n",
        "TRANSLATION_4": "They said, “Stop him and his brother, and send gatherers to the cities.”\n",
        "TRANSLATION_5": "They said: \"Put him off and his brother (for a while), and send callers to the cities;\"\n",
        "TRANSLATION_6": "They said: Give him and his brother respite and send heralds into the cities\n",
        "TRANSLATION_7": "They said, 'Put him and his brother off a while, and send among the cities musterers,\n",
        "TRANSLATION_8": "They said: Put him off, (him) and his brother, and send into the cities summoners\n",
        "TRANSLATION_9": "They said, \"Let him and his brother wait a while, and send heralds into the cities,\n",
        "TRANSLATION_10": "They said: put off him and his brother, and send unto the cities callers.\n",
        "TRANSLATION_11": "They said, ‘Put him and his brother off for a while, and send heralds to the cities\n",
        "TRANSLATION_12": "They said: \"Keep him and his brother in suspense (for a while), and dispatch to the Cities heralds to collect-\n",
        "TRANSLATION_13": "They said: \"Put him off and his brother (for a while), and send callers to the cities\n",
        "TRANSLATION_14": "They replied: 'Put him and his brother off for a while, and send heralds to your cities\n",
        "TRANSLATION_15": "They said, “Delay him and his brother, and send recruiters to the cities.\n",
        "TRANSLATION_16": "They said, \"Postpone [the matter of] him and his brother and send among the cities gatherers\n",
        "TRANSLATION_17": "[26:36] They said, ‘Put him and his brother off for a while, postpone [judgement of] their affair, and send musterers into the cities\n",
        "TRANSLATION_18": "(They said: Put him off) retain him, ((him) and his brother) and do not kill them, (and send them) i.e. the police (into the cities) the cities where the wizards are found (summoners) to summon these wizards,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:111",
            "26:36",
            "15:67",
            "26:53",
            "12:58",
            "7:202",
            "37:129",
            "37:108",
            "37:78",
            "5:30"
        ],
        "BIBLE": [
            "prophets:i%20kings:9:13",
            "prophets:i%20samuel:11:3",
            "writings:job:29:21",
            "prophets:i%20kings:3:6",
            "torah:numbers:27:12",
            "torah:genesis:20:16",
            "torah:genesis:27:37",
            "prophets:i%20samuel:30:23",
            "torah:genesis:24:43",
            "torah:exodus:21:29"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:6",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:3:6",
            "Sefer%20Yetzirah:3:1",
            "Sefer%20Yetzirah:4:9"
        ]
    }
}