{
    "VERSE": "26:38",
    "ARABIC": "فَجُمِعَ ٱلسَّحَرَةُ لِمِيقَٰتِ يَوْمٍ مَّعْلُومٍ",
    "ENGLISH": {
        "TRANSLATION_0": "So the magicians were assembled for a meeting on a specified day.",
        "TRANSLATION_1": "So the magicians were assembled at a stated time and place on an appointed day.\n",
        "TRANSLATION_2": "So the magicians were brought together on a particular day at a set time\n",
        "TRANSLATION_3": "So all the magicians gathered together\n",
        "TRANSLATION_4": "So the magicians were gathered at a set time on a day appointed.\n",
        "TRANSLATION_5": "So, the sorcerers were assembled at a fixed time on a day appointed.\n",
        "TRANSLATION_6": "So the magicians were gathered together at the appointed time on the fixed day,\n",
        "TRANSLATION_7": "So the sorcerers were assembled for the appointed time of a fixed day.\n",
        "TRANSLATION_8": "So the wizards were gathered together at a set time on a day appointed.\n",
        "TRANSLATION_9": "So the sorcerers were gathered on the appointed day\n",
        "TRANSLATION_10": "So the magicians were assembled at a set time on a day made known.\n",
        "TRANSLATION_11": "So the magicians were gathered for the tryst of a known day,\n",
        "TRANSLATION_12": "So the sorcerers were got together for the appointment of a day well-known,\n",
        "TRANSLATION_13": "So the sorcerers were assembled at a fixed time on a day appointed.\n",
        "TRANSLATION_14": "The sorcerers were gathered at the appointed time on a wellknown day,\n",
        "TRANSLATION_15": "So the magicians were gathered for the appointment on a specified day.\n",
        "TRANSLATION_16": "So the magicians were assembled for the appointment of a well-known day.\n",
        "TRANSLATION_17": "[26:38] So the sorcerers were assembled at a fixed time of a known day, which was the morning of the Festival Day.\n",
        "TRANSLATION_18": "(So the wizards were gathered together) there were 72 of them (at a set time on a day appointed) which was the day of the market, and it also said that it was the day of their festival, and it is also said that it was the day of their new year.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "26:38",
            "38:81",
            "15:38",
            "56:50",
            "78:17",
            "79:6",
            "77:12",
            "51:60",
            "38:53",
            "75:1"
        ],
        "BIBLE": [
            "writings:ii%20chronicles:29:4",
            "torah:genesis:19:27",
            "torah:genesis:29:22",
            "torah:genesis:1:9",
            "prophets:ezekiel:38:12",
            "torah:numbers:14:40",
            "prophets:i%20samuel:13:8",
            "writings:daniel:9:15",
            "writings:job:38:12",
            "prophets:jeremiah:50:30"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:3:4",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:6:3"
        ]
    }
}