{
    "VERSE": "26:4",
    "ARABIC": "إِن نَّشَأْ نُنَزِّلْ عَلَيْهِم مِّنَ ٱلسَّمَآءِ ءَايَةً فَظَلَّتْ أَعْنَٰقُهُمْ لَهَا خَٰضِعِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "If We wished We could send down a Sign to them from heaven, before which their heads would be bowed low in subjection.",
        "TRANSLATION_1": "We could send down from the heavens a sign to them if We pleased, before which their heads would remain bowed.\n",
        "TRANSLATION_2": "If We will, We can send down a Sign to them from heaven, so their necks will be humbled to it.\n",
        "TRANSLATION_3": "Had We wanted, We would have sent them a miracle from the sky to make their heads hang down in submission.\n",
        "TRANSLATION_4": "If We will, We can send down on them a sign from the sky so that their leaders would remain bowed before it.\n",
        "TRANSLATION_5": "If We will, We could send down to them from the heaven a sign, to which they would bend their necks in humility.\n",
        "TRANSLATION_6": "If We please, We should send down upon them a sign from the heaven so that their necks should stoop to it.\n",
        "TRANSLATION_7": "If We will, We shall send down on them out of heaven a sign, so their necks will stay humbled to it.\n",
        "TRANSLATION_8": "If We will, We can send down on them from the sky a portent so that their necks would remain bowed before it.\n",
        "TRANSLATION_9": "But if We had so willed, We could have sent down to them a sign from the heavens so that their heads would be bowed down before it in utter humility.\n",
        "TRANSLATION_10": "If We list, We can send down unto them a sign from the heaven so that their necks would became to it submissive.\n",
        "TRANSLATION_11": "If We wish We will send down to them a sign from the sky before which their heads will remain bowed in humility.\n",
        "TRANSLATION_12": "If (such) were Our Will, We could send down to them from the sky a Sign, to which they would bend their necks in humility.\n",
        "TRANSLATION_13": "If We will, We could send down to them from the heaven a sign, to which they would bend their necks in humility.\n",
        "TRANSLATION_14": "If We will, We can send down on them a sign from heaven before which their necks will remain humbled.\n",
        "TRANSLATION_15": "If We will, We can send down upon them a sign from heaven, at which their necks will stay bent in humility.\n",
        "TRANSLATION_16": "If We willed, We could send down to them from the sky a sign for which their necks would remain humbled.\n",
        "TRANSLATION_17": "[26:4] If We will We will send down to them a sign from the heaven before which their necks will remain (fa-zallat, [although grammatically in the past tense] is being used in the sense of the imperfect tense) bowed in humility, and they will believe (since ‘necks’ are described as ‘bowed in humility’, [a status] which in fact refers to those who possess them, the adjectival form [khādi‘ūn, ‘bowed in humility’] used therein is the one [normally] used for rational beings).\n",
        "TRANSLATION_18": "(If We will, We can send down on them from the sky a portent) a sign (so that their necks would remain bowed before it) in humiliation.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "26:4",
            "6:118",
            "12:105",
            "26:187",
            "21:32",
            "40:13",
            "7:106",
            "25:36",
            "45:13",
            "6:35"
        ],
        "BIBLE": [
            "writings:psalms:64:9",
            "prophets:jeremiah:18:16",
            "torah:deuteronomy:1:13",
            "torah:leviticus:1:4",
            "torah:leviticus:14:18",
            "torah:leviticus:14:29",
            "torah:leviticus:21:5",
            "prophets:ezekiel:24:23",
            "torah:deuteronomy:32:42",
            "torah:numbers:6:11"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:3:8",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:3:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:3:3"
        ]
    }
}