{
    "VERSE": "26:40",
    "ARABIC": "لَعَلَّنَا نَتَّبِعُ ٱلسَّحَرَةَ إِن كَانُوا۟ هُمُ ٱلْغَٰلِبِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "so we can follow the magicians if they are the winners?'",
        "TRANSLATION_1": "(They said): \"We may haply follow the magicians if they are victorious.\"\n",
        "TRANSLATION_2": "We may perhaps follow the religion of the magicians if they triumph.\"\n",
        "TRANSLATION_3": "and the people were asked, \"Will you all be there so that we may follow the magicians if they become victorious?\"\n",
        "TRANSLATION_4": "The people said, “Perhaps we may follow the magicians if they are victorious.”\n",
        "TRANSLATION_5": "That we may follow the sorcerers if they are the winners.\"\n",
        "TRANSLATION_6": "Haply we may follow the magicians, if they are the vanquishers.\n",
        "TRANSLATION_7": "Haply we shall follow the sorcerers if it should be they are the victors.'\n",
        "TRANSLATION_8": "(They said): Aye, so that we may follow the wizards if they are the winners.\n",
        "TRANSLATION_9": "so that we may follow the magicians, if they be the winners.\"\n",
        "TRANSLATION_10": "Belike we may follow the magicians if they are the winners?\n",
        "TRANSLATION_11": "‘Maybe we will follow the magicians, if they are victors!’\n",
        "TRANSLATION_12": "That we may follow the sorcerers (in religion) if they win?\"\n",
        "TRANSLATION_13": "That we may follow the sorcerers [who were on Fir'aun's (Pharaoh) religion of disbelief] if they are the winners.\"\n",
        "TRANSLATION_14": "in order that we shall follow the sorcerers if they are the victors'\n",
        "TRANSLATION_15": "That we may follow the magicians, if they are the winners.”\n",
        "TRANSLATION_16": "That we might follow the magicians if they are the predominant?\"\n",
        "TRANSLATION_17": "[26:40] Maybe we will follow the sorcerers, should they be the victors’ (the interrogative [of the previous verse] is an incitement to assemble and the optative sense [implicit in la‘alla] is due to their anticipation of victory, and hence their continued adherence to their religion and rejection of Moses).\n",
        "TRANSLATION_18": "(They said): Aye, so that we may follow the wizards) that we may follow the religion of the wizards (if they are the winners) against Moses.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "26:40",
            "15:95",
            "28:51",
            "77:23",
            "37:116",
            "102:1",
            "83:21",
            "79:7",
            "15:23",
            "37:131"
        ],
        "BIBLE": [
            "prophets:i%20kings:20:10",
            "torah:exodus:11:8",
            "torah:genesis:24:39",
            "writings:ruth:1:16",
            "prophets:i%20kings:18:21",
            "torah:genesis:24:5",
            "writings:i%20chronicles:17:7",
            "torah:genesis:32:20",
            "torah:genesis:47:23",
            "prophets:ii%20samuel:3:31"
        ]
    }
}