{
    "VERSE": "26:43",
    "ARABIC": "قَالَ لَهُم مُّوسَىٰٓ أَلْقُوا۟ مَآ أَنتُم مُّلْقُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Musa said to them, 'Throw whatever it is you are going to throw!'",
        "TRANSLATION_1": "Moses said to them: \"Cast what you have to cast.\"\n",
        "TRANSLATION_2": "Moses said to them: \"Throw down whatever you wish to throw.\"\n",
        "TRANSLATION_3": "(Moses) asked the magicians, \"Cast down what you want to\".\n",
        "TRANSLATION_4": "Moosa said to them, “Cast whatever you intend to cast.”\n",
        "TRANSLATION_5": "Musa said to them: \"Throw what you are going to throw!\"\n",
        "TRANSLATION_6": "Musa said to them: Cast what you are going to cast.\n",
        "TRANSLATION_7": "Moses said to them, 'Cast you down what you will cast.'\n",
        "TRANSLATION_8": "Moses said unto them: Throw what ye are going to throw!\n",
        "TRANSLATION_9": "Moses said to the magicians, \"Throw down whatever you are going to throw.\"\n",
        "TRANSLATION_10": "Musa said unto them: cast whatsoever ye have to cast.\n",
        "TRANSLATION_11": "Moses said to them, ‘Throw down whatever you have to throw!’\n",
        "TRANSLATION_12": "Moses said to them: \"Throw ye - that which ye are about to throw!\"\n",
        "TRANSLATION_13": "Musa (Moses) said to them: \"Throw what you are going to throw!\"\n",
        "TRANSLATION_14": "Moses said to them: 'Cast down what you cast'\n",
        "TRANSLATION_15": "Moses said to them, “Present what you intend to present.”\n",
        "TRANSLATION_16": "Moses said to them, \"Throw whatever you will throw.\"\n",
        "TRANSLATION_17": "[26:43] Moses said to them, after they had said to him, Either you cast, or we shall be the casters [Q. 7:115]: ‘Cast what you have to cast’ — the command to do this signifies an authorisation for them to cast and a means whereby the truth will be made to prevail.\n",
        "TRANSLATION_18": "(Moses said unto them) he said to the wizards: (Throw what ye are going to throw!\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "26:43",
            "23:36",
            "10:80",
            "85:16",
            "77:29",
            "26:92",
            "40:73",
            "82:12",
            "61:2",
            "37:25"
        ],
        "BIBLE": [
            "torah:deuteronomy:31:14",
            "torah:numbers:7:11",
            "prophets:ii%20kings:2:21",
            "prophets:ii%20kings:2:2",
            "torah:genesis:26:16",
            "writings:ii%20chronicles:15:2",
            "torah:deuteronomy:33:18",
            "prophets:i%20kings:13:14",
            "prophets:jeremiah:42:9",
            "prophets:i%20kings:22:30"
        ]
    }
}