{
    "VERSE": "26:45",
    "ARABIC": "فَأَلْقَىٰ مُوسَىٰ عَصَاهُ فَإِذَا هِىَ تَلْقَفُ مَا يَأْفِكُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "But Musa threw down his staff and at once it swallowed up what they had fabricated.",
        "TRANSLATION_1": "Then Moses threw down his staff, and lo, it swallowed up their conjurations.\n",
        "TRANSLATION_2": "Thereafter, Moses threw down his rod and behold, it went about swallowing up all the false devices they had contrived.\n",
        "TRANSLATION_3": "Then Moses cast down his staff and suddenly it swallowed up what they had falsely invented.\n",
        "TRANSLATION_4": "Therefore Moosa put forth his staff – so it immediately began swallowing all their fabrications.\n",
        "TRANSLATION_5": "Then Musa threw his stick, and behold, it swallowed up all that they falsely showed!\n",
        "TRANSLATION_6": "Then Musa cast down his staff and lo! it swallowed up the lies they told.\n",
        "TRANSLATION_7": "Then Moses cast his staff and lo, it forthwith swallowed up their lying invention;\n",
        "TRANSLATION_8": "Then Moses threw his staff and lo! it swallowed that which they did falsely show.\n",
        "TRANSLATION_9": "Then Moses threw down his staff, and it swallowed up all that they had conjured into being.\n",
        "TRANSLATION_10": "Then Musa cast down his staff, and lo! it swallowed up that which they had devised.\n",
        "TRANSLATION_11": "Thereat Moses threw down his staff, and behold, it was swallowing what they had faked.\n",
        "TRANSLATION_12": "Then Moses threw his rod, when, behold, it straightway swallows up all the falsehoods which they fake!\n",
        "TRANSLATION_13": "Then Musa (Moses) threw his stick, and behold, it swallowed up all the falsehoods which they showed!\n",
        "TRANSLATION_14": "Then Moses cast down his staff and it swallowed up their lying invention,\n",
        "TRANSLATION_15": "Then Moses threw his staff, and behold, it began swallowing their trickery.\n",
        "TRANSLATION_16": "Then Moses threw his staff, and at once it devoured what they falsified.\n",
        "TRANSLATION_17": "[26:45] Thereat Moses cast his staff and lo! it was swallowing (talqafu: one of the original two tā’ letters [of taltaqifu] has been assimilated) what they had faked, [what they had] transformed through illusion, making their ropes and staffs appear to be moving serpents.\n",
        "TRANSLATION_18": "(Then Moses threw his staff and lo! it swallowed that which they did falsely show) of wizardry.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "26:45",
            "26:32",
            "7:117",
            "7:107",
            "27:10",
            "28:31",
            "54:29",
            "7:119",
            "10:80",
            "26:60"
        ],
        "BIBLE": [
            "prophets:ii%20kings:6:6",
            "torah:exodus:7:10",
            "prophets:i%20kings:17:10",
            "prophets:ii%20kings:2:21",
            "prophets:ii%20samuel:16:13",
            "torah:numbers:17:23",
            "prophets:jeremiah:15:6",
            "prophets:ezekiel:19:14",
            "torah:exodus:19:25",
            "writings:daniel:9:23"
        ]
    }
}