{
    "VERSE": "26:5",
    "ARABIC": "وَمَا يَأْتِيهِم مِّن ذِكْرٍ مِّنَ ٱلرَّحْمَٰنِ مُحْدَثٍ إِلَّا كَانُوا۟ عَنْهُ مُعْرِضِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "But no fresh reminder from the All-Merciful reaches them without their turning away from it.",
        "TRANSLATION_1": "Never does a new reminder come to them from Ar-Rahman but they turn away from it.\n",
        "TRANSLATION_2": "Never does there come to them an admonition from the Merciful Lord but they turn away from it.\n",
        "TRANSLATION_3": "Whenever a new message comes to them from the Beneficent God, they turn away from it.\n",
        "TRANSLATION_4": "And never does a new advice come to them from the Most Gracious, but they turn away from it.\n",
        "TRANSLATION_5": "And never comes there unto them a Reminder as a recent revelation from the Most Gracious, but they turn away therefrom.\n",
        "TRANSLATION_6": "And there does not come to them a new reminder from the Beneficent Allah but they turn aside from it.\n",
        "TRANSLATION_7": "But never fresh remembrance comes to them from the All-merciful, except they turn away from it.\n",
        "TRANSLATION_8": "Never cometh there unto them a fresh reminder from the Beneficent One, but they turn away from it.\n",
        "TRANSLATION_9": "Whenever there comes to them any fresh warning from the Merciful, they always turn their backs on it:\n",
        "TRANSLATION_10": "And there cometh not unto them any fresh admonition from the Compassionate but they are wont to be there from backsliders.\n",
        "TRANSLATION_11": "There does not come to them any new reminder from the All-beneficent but that they disregard it.\n",
        "TRANSLATION_12": "But there comes not to them a newly-revealed Message from (Allah) Most Gracious, but they turn away therefrom.\n",
        "TRANSLATION_13": "And never comes there unto them a Reminder as a recent revelation from the Most Beneficent (Allah), but they turn away therefrom.\n",
        "TRANSLATION_14": "A fresh remembrance has never come to them from the Merciful, except they turn away from it.\n",
        "TRANSLATION_15": "No fresh reminder comes to them from the Most Merciful, but they turn their backs at it.\n",
        "TRANSLATION_16": "And no revelation comes to them anew from the Most Merciful except that they turn away from it.\n",
        "TRANSLATION_17": "[26:5] And there would never come to them from the Compassionate One any remembrance, any [revelation from the] Qur’ān, that is new (muhdathin, is an explicative adjective) but that they used to disregard it.\n",
        "TRANSLATION_18": "(Never cometh there unto them a fresh) i.e. fresh in its coming, in succession (reminder) never did Gabriel bring revelation of the Qur'an to their Prophet (from the Beneficent One, but they turn away from it) except that they disbelieved in the Qur'an.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "26:5",
            "43:20",
            "15:56",
            "21:86",
            "21:75",
            "21:107",
            "36:15",
            "20:109",
            "41:2",
            "19:88"
        ],
        "BIBLE": [
            "prophets:joel:2:13",
            "prophets:isaiah:50:5",
            "torah:deuteronomy:5:29",
            "prophets:joshua:7:8",
            "prophets:isaiah:59:20",
            "writings:ii%20chronicles:29:6",
            "writings:psalms:18:41",
            "prophets:jonah:3:9",
            "prophets:ii%20samuel:22:41",
            "torah:deuteronomy:23:6"
        ]
    }
}