{
    "VERSE": "26:50",
    "ARABIC": "قَالُوا۟ لَا ضَيْرَ إِنَّآ إِلَىٰ رَبِّنَا مُنقَلِبُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "They said, 'We do not care! We are returning to our Lord.",
        "TRANSLATION_1": "They said: \"There will be no harm. We shall return to our Lord.\n",
        "TRANSLATION_2": "They said: \"We do not care, for we are bound to return to our Lord,\n",
        "TRANSLATION_3": "I shall certainly cut off your hands and feet on opposite sides and crucify you all together.\"\n",
        "TRANSLATION_4": "They said, “No harm (in it), we will return to our Lord.”\n",
        "TRANSLATION_5": "They said: \"No harm! Surely, to our Lord we are to return.\"\n",
        "TRANSLATION_6": "They said: No harm; surely to our Lord we go back;\n",
        "TRANSLATION_7": "They said, 'There is no harm; surely unto our Lord we are turning.\n",
        "TRANSLATION_8": "They said: It is no hurt, for lo! unto our Lord we shall return.\n",
        "TRANSLATION_9": "They said, \"There is no harm. To our Lord we shall return.\n",
        "TRANSLATION_10": "They said: no harm! verily unto our Lord we are to return.\n",
        "TRANSLATION_11": "They said, ‘[There is] no harm [in that]! Indeed, we shall return to our Lord.\n",
        "TRANSLATION_12": "They said: \"No matter! for us, we shall but return to our Lord!\n",
        "TRANSLATION_13": "They said: \"No harm! Surely, to our Lord (Allah) we are to return;\n",
        "TRANSLATION_14": "There is no harm' they replied, 'for surely to our Lord we are turning.\n",
        "TRANSLATION_15": "They said, “No problem. To our Lord we will return.\n",
        "TRANSLATION_16": "They said, \"No harm. Indeed, to our Lord we will return.\n",
        "TRANSLATION_17": "[26:50] They said, ‘There is no harm [in that], no damage will be done to us thereby. Surely to our Lord, after we die, whichever way that may be, we shall return, in the Hereafter.\n",
        "TRANSLATION_18": "(They said: It is no hurt) what you do with us in this worldly life will not harm us in the Hereafter, (for lo! unto our Lord we shall return) we shall return to Allah and His reward.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "26:50",
            "7:125",
            "36:16",
            "68:32",
            "89:28",
            "43:14",
            "26:12",
            "37:31",
            "23:59",
            "37:99"
        ],
        "BIBLE": [
            "prophets:ii%20kings:9:23",
            "prophets:amos:1:8",
            "prophets:judges:6:14",
            "prophets:i%20samuel:6:3",
            "torah:deuteronomy:14:25",
            "prophets:jeremiah:6:12",
            "torah:exodus:4:7",
            "torah:exodus:7:17",
            "prophets:ii%20samuel:5:19",
            "prophets:judges:15:13"
        ]
    }
}