{
    "VERSE": "26:51",
    "ARABIC": "إِنَّا نَطْمَعُ أَن يَغْفِرَ لَنَا رَبُّنَا خَطَٰيَٰنَآ أَن كُنَّآ أَوَّلَ ٱلْمُؤْمِنِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "We remain hopeful that our Lord will forgive us our mistakes for being the first of the muminun.'",
        "TRANSLATION_1": "We certainly hope our Lord will forgive our sins as we are the first to believe.\"\n",
        "TRANSLATION_2": "and we surely expect that Our Lord will forgive us our sins for we are the first ones to believe.\"\n",
        "TRANSLATION_3": "They said, \"It does not matter. We shall be returning to our Lord.\n",
        "TRANSLATION_4": "“We hope that our Lord will forgive us our mistakes, as we are the first to believe.”\n",
        "TRANSLATION_5": "Verily, we really hope that our Lord will forgive us our sins, as we are the first of the believers.\"\n",
        "TRANSLATION_6": "Surely we hope that our Lord will forgive us our wrongs because we are the first of the believers.\n",
        "TRANSLATION_7": "We are eager that our Lord should forgive us our offences, for that we are the first of the believers.'\n",
        "TRANSLATION_8": "Lo! we ardently hope that our Lord will forgive us our sins because we are the first of the believers.\n",
        "TRANSLATION_9": "We hope our Lord will forgive us, as we are the first of the believers.\"\n",
        "TRANSLATION_10": "Verily we long that our Lord shall forgive us our faults because we have been the first of the believers\n",
        "TRANSLATION_11": "Indeed we hope our Lord will forgive us our offences for being the first to believe.’\n",
        "TRANSLATION_12": "Only, our desire is that our Lord will forgive us our faults, that we may become foremost among the believers!\"\n",
        "TRANSLATION_13": "Verily! We really hope that our Lord will forgive us our sins, as we are the first of the believers [in Musa (Moses) and in the Monotheism which he has brought from Allah].\"\n",
        "TRANSLATION_14": "We are eager that Our Lord should forgive us our offenses, for we are the first of the believers'\n",
        "TRANSLATION_15": "We are eager for our Lord to forgive us our sins, since we are the first of the believers.”\n",
        "TRANSLATION_16": "Indeed, we aspire that our Lord will forgive us our sins because we were the first of the believers.\"\n",
        "TRANSLATION_17": "[26:51] Indeed We hope our Lord will forgive us our iniquities, for being the first to believe’, in our time.\n",
        "TRANSLATION_18": "(Lo! we ardently hope that our Lord will forgive us our sins) our idolatry (because we are the first of the believers) in Moses.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "26:51",
            "39:12",
            "16:24",
            "26:26",
            "20:45",
            "92:13",
            "26:12",
            "7:125",
            "37:100",
            "56:49"
        ],
        "BIBLE": [
            "torah:deuteronomy:17:16",
            "torah:exodus:32:31",
            "torah:exodus:5:22",
            "writings:ii%20chronicles:28:13",
            "prophets:i%20samuel:15:26",
            "torah:numbers:20:12",
            "torah:exodus:32:21",
            "torah:numbers:14:11",
            "torah:genesis:37:30",
            "torah:numbers:14:3"
        ]
    }
}