{
    "VERSE": "26:52",
    "ARABIC": "وَأَوْحَيْنَآ إِلَىٰ مُوسَىٰٓ أَنْ أَسْرِ بِعِبَادِىٓ إِنَّكُم مُّتَّبَعُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "We revealed to Musa: 'Travel with Our slaves by night. You will certainly be pursued.'",
        "TRANSLATION_1": "We said to Moses: \"Travel by night with My creatures. You will surely be pursued.\"\n",
        "TRANSLATION_2": "We revealed to Moses: \"Set forth with My servants by night for you will be pursued.\"\n",
        "TRANSLATION_3": "We hope that our Lord will forgive us for our sins; we were not believers at first.\"\n",
        "TRANSLATION_4": "And We sent the divine revelation to Moosa that, “Journey along with My bondmen within the night, for you will be pursued.”\n",
        "TRANSLATION_5": "And We revealed to Musa, saying: \"Depart by night with My servants, verily, you will be pursued.\"\n",
        "TRANSLATION_6": "And We revealed to Musa, saying: Go away with My servants travelling by night, surely you will be pursued.\n",
        "TRANSLATION_7": "Also We revealed unto Moses, 'Go with My servants by night; surely you will be followed.'\n",
        "TRANSLATION_8": "And We inspired Moses, saying: Take away My slaves by night, for ye will be pursued.\n",
        "TRANSLATION_9": "Then We revealed Our will to Moses, saying, \"Set forth with My servants, in the night, for you will surely be pursued.\"\n",
        "TRANSLATION_10": "And We revealed unto Musa saying: go by night with My bondmen verily ye shall be pursued.\n",
        "TRANSLATION_11": "Then We revealed to Moses, [saying],‘Set out with My servants at night, for you will be pursued.’\n",
        "TRANSLATION_12": "By inspiration we told Moses: \"Travel by night with my servants; for surely ye shall be pursued.\"\n",
        "TRANSLATION_13": "And We inspired Musa (Moses), saying: \"Take away My slaves by night, verily, you will be pursued.\"\n",
        "TRANSLATION_14": "Also, We revealed to Moses, saying: 'Go with My worshipers by night, for you will be followed'\n",
        "TRANSLATION_15": "And We inspired Moses: “Travel with My servants by night. You will be followed.”\n",
        "TRANSLATION_16": "And We inspired to Moses, \"Travel by night with My servants; indeed, you will be pursued.\"\n",
        "TRANSLATION_17": "[26:52] And We revealed to Moses, after many years which he spent among them calling them to the truth with God’s signs but all of which only increased them in insolence, [saying], ‘Journey with My servants, the Children of Israel, by night (a variant reading [for an asri] is an isr, from the verb sarā, one form of asrā) go with them by night in the direction of the sea, for indeed you will be pursued’. Pharaoh and his armies will pursue you, but when they enter the sea in pursuit of you, I will deliver you and drown them.\n",
        "TRANSLATION_18": "(And We inspired Moses, saying: Take away My slaves by night) take by night whoever believes in you from among the Children of Israel, (for ye will be pursued) Pharaoh and his people will catch up with you.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "26:52",
            "44:23",
            "89:29",
            "38:30",
            "37:111",
            "37:81",
            "37:132",
            "37:122",
            "40:60",
            "44:18"
        ],
        "BIBLE": [
            "torah:genesis:24:5",
            "prophets:joshua:14:9",
            "prophets:joshua:24:19",
            "prophets:jeremiah:3:19",
            "torah:genesis:50:17",
            "prophets:ii%20kings:4:30",
            "prophets:jeremiah:37:9",
            "prophets:i%20kings:20:10",
            "torah:deuteronomy:12:30",
            "torah:exodus:8:25"
        ]
    }
}