{
    "VERSE": "26:6",
    "ARABIC": "فَقَدْ كَذَّبُوا۟ فَسَيَأْتِيهِمْ أَنۢبَٰٓؤُا۟ مَا كَانُوا۟ بِهِۦ يَسْتَهْزِءُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "They have denied the truth, but the news of what they mocked will certainly come to them.",
        "TRANSLATION_1": "Surely they have done with denying; soon will come to them the news of what they were laughing at.\n",
        "TRANSLATION_2": "They will soon come to know the truth of that which they have been scoffing at.\n",
        "TRANSLATION_3": "They have called (our revelation) lies. They will soon learn the consequences of what they mocked.\n",
        "TRANSLATION_4": "Indeed they have denied, so now soon coming upon them are the tidings of what they used to scoff at.\n",
        "TRANSLATION_5": "So, they have indeed denied, then the news of what they mocked at will come to them.\n",
        "TRANSLATION_6": "So they have indeed rejected (the truth), therefore the news of that which they mock shall soon come to them.\n",
        "TRANSLATION_7": "So they have cried lies; therefore assuredly tidings will come to them of that they mocked at.\n",
        "TRANSLATION_8": "Now they have denied (the Truth); but there will come unto them tidings of that whereat they used to scoff.\n",
        "TRANSLATION_9": "they have indeed rejected the message. But the truth of what they laughed to scorn will dawn upon them before long.\n",
        "TRANSLATION_10": "So they have surely belied; wherefore anon there shall come unto them the truth of that whereat they were wont to mock.\n",
        "TRANSLATION_11": "They have already denied [the truth], but soon there will come to them the news of what they have been deriding.\n",
        "TRANSLATION_12": "They have indeed rejected (the Message): so they will know soon (enough) the truth of what they mocked at!\n",
        "TRANSLATION_13": "So they have indeed denied (the truth - this Quran), then the news of what they mocked at, will come to them.\n",
        "TRANSLATION_14": "So, they belied, but surely the tidings of that they mocked will come to them.\n",
        "TRANSLATION_15": "They have denied the truth, but soon will come to them the news of what they ridiculed.\n",
        "TRANSLATION_16": "For they have already denied, but there will come to them the news of that which they used to ridicule.\n",
        "TRANSLATION_17": "[26:6] Verily then they have denied, it; but soon there will come to them the news, the consequences, of that which they used to deride.\n",
        "TRANSLATION_18": "(Now they have denied) Muhammad (pbuh) and the Qur'an; (but there will come unto them tidings) the news (of that whereat they used to scoff) of chastisement; it is also said that this means: there will come to them the news of their derision of Muhammad (pbuh) and of the Qur'an.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "26:6",
            "6:5",
            "54:4",
            "28:66",
            "26:69",
            "43:7",
            "20:99",
            "51:54",
            "6:67",
            "37:170"
        ],
        "BIBLE": [
            "torah:genesis:19:5",
            "prophets:jeremiah:7:32",
            "prophets:jeremiah:19:6",
            "torah:genesis:39:14",
            "writings:esther:9:26",
            "writings:esther:4:11",
            "torah:genesis:19:22",
            "torah:exodus:33:7",
            "torah:genesis:30:11",
            "torah:genesis:29:34"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:1"
        ]
    }
}