{
    "VERSE": "26:62",
    "ARABIC": "قَالَ كَلَّآ إِنَّ مَعِىَ رَبِّى سَيَهْدِينِ",
    "ENGLISH": {
        "TRANSLATION_0": "He said, 'Never! My Lord is with me and He will guide me.'",
        "TRANSLATION_1": "Moses replied: \"By no means. My Lord is with me. He will show me the way.\"\n",
        "TRANSLATION_2": "Moses said: \"Certainly not. My Lord is with me; He will direct me.\"\n",
        "TRANSLATION_3": "When the two groups came close to each other, the companions of Moses said, \"We will be caught\".\n",
        "TRANSLATION_4": "Said Moosa, “Never! Indeed my Lord is with me, He will now show me the way.”\n",
        "TRANSLATION_5": "(Musa) said: \"Nay, verily with me is my Lord. He will guide me.\"\n",
        "TRANSLATION_6": "He said: By no means; surely my Lord is with me: He will show me a way out.\n",
        "TRANSLATION_7": "Said he, 'No indeed; surely my Lord is with me; He will guide me.'\n",
        "TRANSLATION_8": "He said: Nay, verily! for lo! my Lord is with me. He will guide me.\n",
        "TRANSLATION_9": "Moses replied, \"No, My Lord is with me, and He will guide me.\"\n",
        "TRANSLATION_10": "Musa said: by no means; verily with me is my Lord; He shall guide me.\n",
        "TRANSLATION_11": "He said, ‘Certainly not! Indeed my Lord is with me. He will guide me.’\n",
        "TRANSLATION_12": "(Moses) said: \"By no means! my Lord is with me! Soon will He guide me!\"\n",
        "TRANSLATION_13": "[Musa (Moses)] said: \"Nay, verily! With me is my Lord, He will guide me.\"\n",
        "TRANSLATION_14": "No, indeed' he replied, 'my Lord is with me and He will guide me'\n",
        "TRANSLATION_15": "He said, “No; my Lord is with me, He will guide me.”\n",
        "TRANSLATION_16": "[Moses] said, \"No! Indeed, with me is my Lord; He will guide me.\"\n",
        "TRANSLATION_17": "[26:62] He, Moses, said, ‘Certainly not!, they shall not catch us up; indeed I have my Lord with me, to provide assistance. He will guide me’, to the route of deliverance.\n",
        "TRANSLATION_18": "(He said) Moses said: (Nay) they have not, (verily! for lo! my Lord is with me. He will guide me) He will save me from them and guide me to the right way.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "26:62",
            "37:99",
            "26:12",
            "36:25",
            "54:10",
            "7:125",
            "44:20",
            "83:15",
            "26:117",
            "89:28"
        ],
        "BIBLE": [
            "prophets:ii%20kings:4:27",
            "prophets:judges:21:5",
            "prophets:i%20kings:11:2",
            "torah:exodus:2:18",
            "prophets:isaiah:37:34",
            "prophets:ii%20kings:19:33",
            "torah:numbers:15:35",
            "torah:genesis:24:42",
            "writings:proverbs:7:13",
            "prophets:i%20kings:13:10"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:3:6",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:4:6"
        ]
    }
}