{
    "VERSE": "26:63",
    "ARABIC": "فَأَوْحَيْنَآ إِلَىٰ مُوسَىٰٓ أَنِ ٱضْرِب بِّعَصَاكَ ٱلْبَحْرَ فَٱنفَلَقَ فَكَانَ كُلُّ فِرْقٍ كَٱلطَّوْدِ ٱلْعَظِيمِ",
    "ENGLISH": {
        "TRANSLATION_0": "So We revealed to Musa, 'Strike the sea with your staff.' And it split in two, each part like a towering cliff.",
        "TRANSLATION_1": "We commanded Moses: \"Smite the sea with your staff.\" And it parted, and every parting was like a lofty mountain.\n",
        "TRANSLATION_2": "Then We revealed to Moses, (commanding him): \"Strike the sea with your rod.\" Thereupon the sea split up, and then each became like the mass of a huge mount.\n",
        "TRANSLATION_3": "Moses said, \"Certainly not. My Lord is with me and He will certainly guide me.\"\n",
        "TRANSLATION_4": "So We sent the divine revelation to Moosa that, “Strike the sea with your staff”; thereupon the sea parted; so each part was like a huge mountain.\n",
        "TRANSLATION_5": "Then We revealed to Musa (saying): \"Strike the sea with your stick.\" And it parted, and each separate part became like huge mountain.\n",
        "TRANSLATION_6": "Then We revealed to Musa: Strike the sea with your staff. So it had cloven asunder, and each part was like a huge mound.\n",
        "TRANSLATION_7": "Then We revealed to Moses, 'Strike with thy staff the sea'; and it clave, and each part was as a mighty mount.\n",
        "TRANSLATION_8": "Then We inspired Moses, saying: Smite the sea with thy staff. And it parted, and each part was as a mountain vast.\n",
        "TRANSLATION_9": "Then We bade Moses strike the sea with his staff. And it parted, and each part was like a huge mountain.\n",
        "TRANSLATION_10": "Then We revealed unto Musa, saying: smite thou the sea with thy staff. So it became separated, and each part was like unto a cliff mighty.\n",
        "TRANSLATION_11": "Thereupon We revealed to Moses: ‘Strike the sea with your staff!’ Whereupon it parted, and each part was as if it were a great mountain.\n",
        "TRANSLATION_12": "Then We told Moses by inspiration: \"Strike the sea with thy rod.\" So it divided, and each separate part became like the huge, firm mass of a mountain.\n",
        "TRANSLATION_13": "Then We inspired Musa (Moses) (saying): \"Strike the sea with your stick.\" And it parted, and each separate part (of that sea water) became like the huge, firm mass of a mountain.\n",
        "TRANSLATION_14": "Then We revealed to Moses: 'Strike the sea with your staff', so it divided and each part was as a mighty mount.\n",
        "TRANSLATION_15": "We inspired Moses: “Strike the sea with your staff.” Whereupon it parted, and each part was like a huge hill.\n",
        "TRANSLATION_16": "Then We inspired to Moses, \"Strike with your staff the sea,\" and it parted, and each portion was like a great towering mountain.\n",
        "TRANSLATION_17": "[26:63] God, exalted be He, says: Thereupon We revealed to Moses: ‘Strike the sea with your staff’, and he struck it, whereupon it parted, it split into twelve parts, and each part was as a mighty mountain, between each of these parts were paths which they followed, such that not even the saddles or the felts of the riders were touched by water.\n",
        "TRANSLATION_18": "(Then We inspired Moses, saying: Smite the sea with thy staff. And) when he hit it (it parted) into 12 roads, (and each part) and each road (was as a mountain vast) like a huge mountain.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "26:63",
            "7:117",
            "20:77",
            "69:52",
            "56:74",
            "56:96",
            "37:115",
            "21:76",
            "37:107",
            "55:24"
        ],
        "BIBLE": [
            "torah:exodus:24:12",
            "prophets:jeremiah:14:14",
            "prophets:joshua:9:24",
            "torah:exodus:19:23",
            "torah:exodus:8:12",
            "prophets:i%20kings:20:36",
            "torah:exodus:16:4",
            "torah:leviticus:8:5",
            "torah:numbers:9:8",
            "prophets:jonah:1:10"
        ]
    }
}