{
    "VERSE": "26:68",
    "ARABIC": "وَإِنَّ رَبَّكَ لَهُوَ ٱلْعَزِيزُ ٱلرَّحِيمُ",
    "ENGLISH": {
        "TRANSLATION_0": "Truly your Lord is the Almighty, the Most Merciful.",
        "TRANSLATION_1": "Indeed your Lord is mighty and merciful.\n",
        "TRANSLATION_2": "Verily your Lord is Immensely Mighty, Ever Compassionate.\n",
        "TRANSLATION_3": "In this there was certainly evidence (of the Truth), but most of them did not have any faith.\n",
        "TRANSLATION_4": "And indeed your Lord – only He is the Almighty, the Most Merciful.\n",
        "TRANSLATION_5": "And verily your Lord, He is truly the All-Mighty, the Most Merciful.\n",
        "TRANSLATION_6": "And most surely your Lord is the Mighty, the Merciful.\n",
        "TRANSLATION_7": "Surely thy Lord, He is the All-mighty, the All-compassionate.\n",
        "TRANSLATION_8": "And lo, thy Lord! He is indeed the Mighty, the Merciful.\n",
        "TRANSLATION_9": "truly, your Lord is the Mighty One, the Merciful.\n",
        "TRANSLATION_10": "And verily thy Lord! He is the Mighty, the Merciful.\n",
        "TRANSLATION_11": "Indeed your Lord is the All-mighty, the All-merciful.\n",
        "TRANSLATION_12": "And verily thy Lord is He, the Exalted in Might, Most Merciful.\n",
        "TRANSLATION_13": "And verily, your Lord! He is truly the All-Mighty, the Most Merciful.\n",
        "TRANSLATION_14": "Surely, your Lord is the Almighty, the Most Merciful.\n",
        "TRANSLATION_15": "Surely, your Lord is the Almighty, the Merciful.\n",
        "TRANSLATION_16": "And indeed, your Lord - He is the Exalted in Might, the Merciful.\n",
        "TRANSLATION_17": "[26:68] And surely your Lord, He is the Mighty, for He wrought vengeance upon the disbelievers by drowning them, the Merciful, to believers, delivering them from drowning.\n",
        "TRANSLATION_18": "(And lo, thy Lord! He is indeed the Mighty) in retribution against the disbelievers, (the Merciful) towards the believers, since He saved them from drowning. 411\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "26:159",
            "26:140",
            "26:175",
            "26:9",
            "26:191",
            "26:68",
            "26:122",
            "26:104",
            "36:5",
            "26:217"
        ],
        "BIBLE": [
            "prophets:isaiah:25:1",
            "prophets:isaiah:30:18",
            "writings:lamentations:3:22",
            "writings:psalms:40:12",
            "writings:psalms:89:20",
            "writings:psalms:117:2",
            "writings:psalms:86:15",
            "prophets:isaiah:5:16",
            "prophets:isaiah:54:8",
            "writings:psalms:119:151"
        ]
    }
}