{
    "VERSE": "26:71",
    "ARABIC": "قَالُوا۟ نَعْبُدُ أَصْنَامًا فَنَظَلُّ لَهَا عَٰكِفِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "They said, 'We worship idols and will continue to cling to them.'",
        "TRANSLATION_1": "They replied: \"We worship idols and are devoted to them.\"\n",
        "TRANSLATION_2": "They answered: \"There are some idols that we worship and are devoted to them with constancy.\"\n",
        "TRANSLATION_3": "when he asked his father and others, \"What do you worship?\"\n",
        "TRANSLATION_4": "They said, “We worship idols, and we keep squatting in seclusion before them.”\n",
        "TRANSLATION_5": "They said: \"We worship idols, and to them we are ever devoted.\"\n",
        "TRANSLATION_6": "They said: We worship idols, so we shall be their votaries.\n",
        "TRANSLATION_7": "They said, 'We serve idols, and continue cleaving to them.\n",
        "TRANSLATION_8": "They said: We worship idols, and are ever devoted unto them.\n",
        "TRANSLATION_9": "They said, \"We worship idols and will continue to cling to them.\"\n",
        "TRANSLATION_10": "They said: we worship idols, and we are unto them ever devoted\n",
        "TRANSLATION_11": "They said, ‘We worship idols, and are constant in our devotion to them.’\n",
        "TRANSLATION_12": "They said: \"We worship idols, and we remain constantly in attendance on them.\"\n",
        "TRANSLATION_13": "They said: \"We worship idols, and to them we are ever devoted.\"\n",
        "TRANSLATION_14": "They replied: 'We worship idols and continue cleaving to them'\n",
        "TRANSLATION_15": "They said, “We worship idols, and we remain devoted to them.”\n",
        "TRANSLATION_16": "They said, \"We worship idols and remain to them devoted.\"\n",
        "TRANSLATION_17": "[26:71]   They said, ‘We worship idols — they reiterate the verb [in the response] in order to supplement it with [the following remark] — and remain cleaving to them’, we remain worshipping them all day; they give a longer response to indicate their [misplaced] pride in such [an act].\n",
        "TRANSLATION_18": "(They said: We worship idols) deities, (and are ever devoted unto them) we worship them and remain devoted to their worship.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "26:71",
            "68:21",
            "26:60",
            "37:90",
            "26:157",
            "69:8",
            "26:203",
            "44:59",
            "37:94",
            "51:54"
        ],
        "BIBLE": [
            "prophets:i%20samuel:20:32",
            "torah:genesis:31:14",
            "torah:genesis:27:39",
            "torah:genesis:45:3",
            "prophets:ii%20kings:17:12",
            "prophets:jeremiah:11:5",
            "prophets:ii%20kings:6:3",
            "torah:numbers:32:31",
            "prophets:i%20samuel:10:12",
            "prophets:jeremiah:35:6"
        ]
    }
}