{
    "VERSE": "26:77",
    "ARABIC": "فَإِنَّهُمْ عَدُوٌّ لِّىٓ إِلَّا رَبَّ ٱلْعَٰلَمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "They are all my enemies - except for the Lord of all the worlds:",
        "TRANSLATION_1": "Yet they are my enemies except the Lord of all the worlds\n",
        "TRANSLATION_2": "They are all enemies to me; all, except the Lord of the Universe\n",
        "TRANSLATION_3": "are my enemies? Not so the Lord of the Universe.\n",
        "TRANSLATION_4": "“They are all my enemies, except the Lord Of The Creation.”\n",
        "TRANSLATION_5": "Verily, they are enemies to me, save the Lord of Al-`Alamin,\"\n",
        "TRANSLATION_6": "Surely they are enemies to me, but not (so) the Lord of the worlds;\n",
        "TRANSLATION_7": "They are an enemy to me, except the Lord of all Being\n",
        "TRANSLATION_8": "Lo! they are (all) an enemy unto me, save the Lord of the Worlds,\n",
        "TRANSLATION_9": "they are all my enemies, not so the Lord of the Universe,\n",
        "TRANSLATION_10": "Verily they are an enemy unto me, save the Lord of the worlds.\n",
        "TRANSLATION_11": "They are indeed enemies to me, but the Lord of all the worlds,\n",
        "TRANSLATION_12": "For they are enemies to me; not so the Lord and Cherisher of the Worlds;\n",
        "TRANSLATION_13": "Verily! They are enemies to me, save the Lord of the 'Alamin (mankind, jinns and all that exists);\n",
        "TRANSLATION_14": "They are enemies to me except the Lord of all the Worlds\n",
        "TRANSLATION_15": "They are enemies to me, but not so the Lord of the Worlds.\n",
        "TRANSLATION_16": "Indeed, they are enemies to me, except the Lord of the worlds,\n",
        "TRANSLATION_17": "[26:77] They are indeed hateful to me, I do not worship them; but the Lord of the Worlds, I do worship Him,\n",
        "TRANSLATION_18": "Lo! they are (all) an enemy unto me) and I disassociate myself from them, (save the Lord of the Worlds) except the worship of the Lord of the Worlds.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "26:77",
            "7:121",
            "26:47",
            "69:43",
            "56:80",
            "26:192",
            "2:131",
            "11:47",
            "26:98",
            "68:52"
        ],
        "BIBLE": [
            "writings:psalms:18:4",
            "prophets:isaiah:45:17",
            "prophets:ii%20samuel:22:4",
            "torah:deuteronomy:20:4",
            "prophets:isaiah:38:11",
            "prophets:i%20samuel:14:39",
            "prophets:jeremiah:51:45",
            "torah:numbers:14:42",
            "writings:psalms:96:10",
            "prophets:jeremiah:42:11"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:3:5",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:1:7"
        ]
    }
}