{
    "VERSE": "26:81",
    "ARABIC": "وَٱلَّذِى يُمِيتُنِى ثُمَّ يُحْيِينِ",
    "ENGLISH": {
        "TRANSLATION_0": "He who will cause my death, then give me life;",
        "TRANSLATION_1": "Who will make me die, then give me life again,\n",
        "TRANSLATION_2": "Who will cause me to die and then will again restore me to life;\n",
        "TRANSLATION_3": "He will cause me to die and will bring me back to life.\n",
        "TRANSLATION_4": "“And He will give me death, then resurrect me.”\n",
        "TRANSLATION_5": "And Who will cause me to die, and then will bring me to life.\n",
        "TRANSLATION_6": "And He Who will cause me to die, then give me life;\n",
        "TRANSLATION_7": "who makes me to die, then gives me life,\n",
        "TRANSLATION_8": "And Who causeth me to die, then giveth me life (again),\n",
        "TRANSLATION_9": "He who will cause me to die and bring me back to life;\n",
        "TRANSLATION_10": "And He Who shall cause me to die, and then shall quicken me.\n",
        "TRANSLATION_11": "who will make me die, then He will bring me to life,\n",
        "TRANSLATION_12": "Who will cause me to die, and then to life (again);\n",
        "TRANSLATION_13": "And Who will cause me to die, and then will bring me to life (again);\n",
        "TRANSLATION_14": "who makes me to die and then revives me,\n",
        "TRANSLATION_15": "He who makes me die, and then revives me.\n",
        "TRANSLATION_16": "And who will cause me to die and then bring me to life\n",
        "TRANSLATION_17": "[26:81] and Who will make me die, then give me life,\n",
        "TRANSLATION_18": "(And Who causeth me to die) in this worldly life, (then giveth me life (again)) on the Day of Judgement,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "26:81",
            "26:79",
            "26:78",
            "10:63",
            "92:16",
            "41:18",
            "27:53",
            "87:3",
            "74:23",
            "74:22"
        ],
        "BIBLE": [
            "torah:leviticus:17:11",
            "prophets:i%20samuel:2:6",
            "prophets:ii%20samuel:22:36",
            "prophets:i%20kings:5:23",
            "prophets:hosea:2:14",
            "torah:genesis:27:7",
            "torah:exodus:36:6",
            "writings:psalms:118:18",
            "writings:job:33:4",
            "prophets:nahum:1:14"
        ]
    }
}