{
    "VERSE": "26:82",
    "ARABIC": "وَٱلَّذِىٓ أَطْمَعُ أَن يَغْفِرَ لِى خَطِيٓـَٔتِى يَوْمَ ٱلدِّينِ",
    "ENGLISH": {
        "TRANSLATION_0": "He who I sincerely hope will forgive my mistakes on the Day of Reckoning.",
        "TRANSLATION_1": "And who, I hope, will condone my faults on the Day of Judgement.\n",
        "TRANSLATION_2": "Who, I hope, will forgive me my sins on the Day of Judgement.\"\n",
        "TRANSLATION_3": "It is He whom I expect to forgive my sins on the Day of Judgment.\n",
        "TRANSLATION_4": "“And the One Who, upon Whom I pin my hopes, will forgive me my mistakes on the Day of Judgement.”\n",
        "TRANSLATION_5": "And Who, I hope, will forgive me my faults on the Day of Recompense.\n",
        "TRANSLATION_6": "And Who, I hope, will forgive me my mistakes on the day of judgment.\n",
        "TRANSLATION_7": "and who I am eager shall forgive me my offence on the Day of Doom.\n",
        "TRANSLATION_8": "And Who, I ardently hope, will forgive me my sin on the Day of Judgment.\n",
        "TRANSLATION_9": "and He who will, I hope, forgive me my faults on the Day of the Judgement.\n",
        "TRANSLATION_10": "And He Who, long, shall forgive me my faults, on the Day of Requital.\n",
        "TRANSLATION_11": "and who, I hope, will forgive me my faults on the Day of Retribution.’\n",
        "TRANSLATION_12": "And who, I hope, will forgive me my faults on the day of Judgment.\n",
        "TRANSLATION_13": "And Who, I hope will forgive me my faults on the Day of Recompense, (the Day of Resurrection),\"\n",
        "TRANSLATION_14": "and whom I am eager shall forgive me my sins on the Day of Recompense'\n",
        "TRANSLATION_15": "He who, I hope, will forgive my sins on the Day of the Reckoning.”\n",
        "TRANSLATION_16": "And who I aspire that He will forgive me my sin on the Day of Recompense.\"\n",
        "TRANSLATION_17": "[26:82] and Who, I hope, will forgive me my iniquity on the Day of Judgement, [the Day] of Requital.\n",
        "TRANSLATION_18": "(And Who, I ardently hope, will forgive me my sin on the Day of Judgement) on the Day of Reckoning. His sins being his pretending that he was sick, and claiming that it was the biggest idol that smashed the smaller ones and also that his wife was his sister.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "26:82",
            "70:26",
            "83:11",
            "74:46",
            "82:17",
            "1:4",
            "82:18",
            "82:15",
            "51:12",
            "37:20"
        ],
        "BIBLE": [
            "torah:leviticus:23:27",
            "prophets:jeremiah:51:47",
            "prophets:jeremiah:48:47",
            "torah:leviticus:16:30",
            "torah:leviticus:23:28",
            "prophets:ezekiel:29:21",
            "torah:numbers:28:26",
            "prophets:isaiah:34:8",
            "torah:leviticus:27:23",
            "prophets:jeremiah:23:20"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:2:6",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:5:1"
        ]
    }
}