{
    "VERSE": "26:83",
    "ARABIC": "رَبِّ هَبْ لِى حُكْمًا وَأَلْحِقْنِى بِٱلصَّٰلِحِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "My Lord, give me right judgement and unite me with the righteous;",
        "TRANSLATION_1": "O Lord, give me wisdom and admit me among the righteous,\n",
        "TRANSLATION_2": "(And then Abraham prayed): \"My Lord, endow me with knowledge and wisdom and join me with the righteous,\n",
        "TRANSLATION_3": "Lord, grant me authority. Join me to the righteous ones.\n",
        "TRANSLATION_4": "“My Lord, bestow me the command and join me with those who deserve your proximity.”\n",
        "TRANSLATION_5": "My Lord! Bestow Hukm on me, and join me with the righteous.\n",
        "TRANSLATION_6": "My Lord: Grant me wisdom, and join me with the good\n",
        "TRANSLATION_7": "My Lord, give me Judgment, and join me with the righteous,\n",
        "TRANSLATION_8": "My Lord! Vouchsafe me wisdom and unite me to the righteous.\n",
        "TRANSLATION_9": "My Lord, bestow wisdom upon me; unite me with the righteous;\n",
        "TRANSLATION_10": "My Lord! bestow on me wisdom and join me with the righteous.\n",
        "TRANSLATION_11": "‘My Lord! Grant me [unerring] judgement, and unite me with the Righteous.\n",
        "TRANSLATION_12": "O my Lord! bestow wisdom on me, and join me with the righteous;\n",
        "TRANSLATION_13": "My Lord! Bestow Hukman (religious knowledge, right judgement of the affairs and Prophethood) on me, and join me with the righteous;\n",
        "TRANSLATION_14": "My Lord, give me judgment, and join me with the righteous.\n",
        "TRANSLATION_15": "“My Lord! Grant me wisdom, and include me with the righteous.\n",
        "TRANSLATION_16": "[And he said], \"My Lord, grant me authority and join me with the righteous.\n",
        "TRANSLATION_17": "[26:83] My Lord! Grant me [unerring] judgement, knowledge, and unite me with the righteous, the prophets.\n",
        "TRANSLATION_18": "(My Lord! Vouchsafe me wisdom) understanding and knowledge (and unite me to the righteous) to my forefathers, the messengers, in Paradise.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "26:83",
            "26:21",
            "36:27",
            "29:26",
            "37:100",
            "76:24",
            "84:2",
            "84:5",
            "23:98",
            "74:7"
        ],
        "BIBLE": [
            "torah:genesis:24:12",
            "writings:psalms:119:75",
            "writings:psalms:7:9",
            "prophets:jeremiah:14:11",
            "writings:psalms:119:137",
            "writings:daniel:9:4",
            "writings:ii%20chronicles:19:6",
            "torah:genesis:32:10",
            "prophets:i%20kings:18:36",
            "prophets:jonah:4:2"
        ]
    }
}