{
    "VERSE": "26:89",
    "ARABIC": "إِلَّا مَنْ أَتَى ٱللَّهَ بِقَلْبٍ سَلِيمٍ",
    "ENGLISH": {
        "TRANSLATION_0": "except to those who come to Allah with sound and flawless hearts.'",
        "TRANSLATION_1": "But to him who comes to God with a tranquil heart.\"\n",
        "TRANSLATION_2": "but only he that brings to Allah a sound heart will (attain to success).\"\n",
        "TRANSLATION_3": "except what is done in obedience to God with a submissive heart.\n",
        "TRANSLATION_4": "“Except he who presented himself before Allah, with a sound* heart.” (Intact or unblemished.)\n",
        "TRANSLATION_5": "Except him who brings to Allah a clean heart.\n",
        "TRANSLATION_6": "Except him who comes to Allah with a heart free (from evil).\n",
        "TRANSLATION_7": "except for him who comes to God with a pure heart.\n",
        "TRANSLATION_8": "Save him who bringeth unto Allah a whole heart.\n",
        "TRANSLATION_9": "and when he alone will be saved who comes to God with a sound heart.\"\n",
        "TRANSLATION_10": "Unless it be he, who shall bring unto Allah a whole heart,\n",
        "TRANSLATION_11": "except him who comes to Allah with a sound heart,’\n",
        "TRANSLATION_12": "But only he (will prosper) that brings to Allah a sound heart;\n",
        "TRANSLATION_13": "Except him who brings to Allah a clean heart [clean from Shirk (polytheism) and Nifaq (hypocrisy)].\n",
        "TRANSLATION_14": "except him who comes before Allah with a pure heart;\n",
        "TRANSLATION_15": "Except for him who comes to God with a sound heart.”\n",
        "TRANSLATION_16": "But only one who comes to Allah with a sound heart.\"\n",
        "TRANSLATION_17": "[26:89] except him who comes to God with a heart that is sound, [free] from idolatry and hypocrisy — and this is the heart of the believer, whom such [things] will avail.\n",
        "TRANSLATION_18": "Save him who bringeth unto Allah a whole heart) a heart free of sins and love for this worldly life; it is also said that this means: a heart free of hatred for the Companions of the Prophet (pbuh).\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "26:89",
            "13:28",
            "30:59",
            "37:84",
            "9:77",
            "64:11",
            "2:10",
            "9:64",
            "33:12",
            "9:15"
        ],
        "BIBLE": [
            "prophets:isaiah:35:4",
            "torah:deuteronomy:15:10",
            "prophets:i%20kings:11:2",
            "writings:psalms:138:1",
            "prophets:i%20kings:17:18",
            "torah:leviticus:2:8",
            "prophets:micah:1:15",
            "torah:leviticus:26:36",
            "prophets:isaiah:57:1",
            "writings:esther:6:6"
        ]
    }
}