{
    "VERSE": "26:93",
    "ARABIC": "مِن دُونِ ٱللَّهِ هَلْ يَنصُرُونَكُمْ أَوْ يَنتَصِرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Can they help you or even help themselves?'",
        "TRANSLATION_1": "Other than God? Can they save you or even save themselves?\"\n",
        "TRANSLATION_2": "beside Allah? Can they be of any help to you, or even be of any help to themselves?\"\n",
        "TRANSLATION_3": "besides God? Will the idols help you? Can they help themselves?\"\n",
        "TRANSLATION_4": "“Instead of Allah? Will they help you or retaliate?”\n",
        "TRANSLATION_5": "Instead of Allah Can they help you or help themselves\"\n",
        "TRANSLATION_6": "Besides Allah? Can they help you or yet help themselves?\n",
        "TRANSLATION_7": "apart from God? Do they help you or help themselves?'\n",
        "TRANSLATION_8": "Instead of Allah? Can they help you or help themselves?\n",
        "TRANSLATION_9": "besides God? Can they help you or even help themselves?\"\n",
        "TRANSLATION_10": "Beside Allah? Can they succour you or succour themselves?\n",
        "TRANSLATION_11": "besides Allah? Do they help you, or do they help each other?’\n",
        "TRANSLATION_12": "Besides Allah? Can they help you or help themselves?'\n",
        "TRANSLATION_13": "Instead of Allah? Can they help you or (even) help themselves?\"\n",
        "TRANSLATION_14": "other than Allah? Do they help you or even help themselves'\n",
        "TRANSLATION_15": "Besides God? Can they help you, or help themselves?”\n",
        "TRANSLATION_16": "Other than Allah? Can they help you or help themselves?\"\n",
        "TRANSLATION_17": "[26:93] besides God?, that is, other than Him, in the way of idols. Do they help you, by averting from you the chastisement, or do they help one another?’, by averting it from themselves? No [neither]!\n",
        "TRANSLATION_18": "(Instead of Allah? Can they help you) can they help you to avoid Allah's chastisement (or help themselves) or help themselves to avoid Allah's chastisement?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "26:93",
            "53:58",
            "36:74",
            "16:20",
            "72:22",
            "19:81",
            "21:67",
            "21:66",
            "18:43",
            "37:86"
        ],
        "BIBLE": [
            "writings:psalms:55:17",
            "writings:psalms:109:26",
            "prophets:ezekiel:37:23",
            "writings:psalms:69:2",
            "writings:i%20chronicles:17:2",
            "prophets:judges:10:13",
            "writings:lamentations:4:17",
            "writings:psalms:76:10",
            "torah:genesis:49:25",
            "writings:ii%20chronicles:25:8"
        ]
    }
}