{
    "VERSE": "26:94",
    "ARABIC": "فَكُبْكِبُوا۟ فِيهَا هُمْ وَٱلْغَاوُۥنَ",
    "ENGLISH": {
        "TRANSLATION_0": "They will be bundled into it head first, they and the misled,",
        "TRANSLATION_1": "They will then be thrown into Hell with those who had gone astray\n",
        "TRANSLATION_2": "Then the idols and those who strayed will be hurled into the Fire headlong, one upon another,\n",
        "TRANSLATION_3": "The idol worshippers, the idols, the rebellious ones,\n",
        "TRANSLATION_4": "So they and all the astray were flung into hell.\n",
        "TRANSLATION_5": "Then they will be thrown on their faces into it (the Fire), they and the astray.\n",
        "TRANSLATION_6": "So they shall be thrown down into it, they and the erring ones,\n",
        "TRANSLATION_7": "Then they shall be pitched into it, they and the perverse\n",
        "TRANSLATION_8": "Then will they be hurled therein, they and the seducers\n",
        "TRANSLATION_9": "Then they will be thrown headlong into Hell, both they and the misguided ones,\n",
        "TRANSLATION_10": "Then they shall be hurled therein, they and the seduced ones.\n",
        "TRANSLATION_11": "Then they will be cast into it on their faces—they and the perverse,\n",
        "TRANSLATION_12": "Then they will be thrown headlong into the (Fire),- they and those straying in Evil,\n",
        "TRANSLATION_13": "Then they will be thrown on their faces into the (Fire), They and the Ghawun (devils, and those who were in error).\n",
        "TRANSLATION_14": "And they will be pitched into it, they and the perverse\n",
        "TRANSLATION_15": "Then they will be toppled into it, together with the seducers.\n",
        "TRANSLATION_16": "So they will be overturned into Hellfire, they and the deviators\n",
        "TRANSLATION_17": "[26:94] Then they will be hurled, cast, into it, they and the perverse,\n",
        "TRANSLATION_18": "(Then they will be hurled therein) they will be cast all together in hell, (they) the disbelievers of Mecca and all the disbelievers among human beings (and the seducers) the disbelievers of the jinn and their deities,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "26:94",
            "37:116",
            "19:72",
            "25:76",
            "23:48",
            "51:35",
            "7:6",
            "26:219",
            "26:157",
            "32:30"
        ],
        "BIBLE": [
            "prophets:ezekiel:23:30",
            "prophets:ii%20kings:2:21",
            "prophets:judges:6:33",
            "prophets:ezekiel:6:9",
            "prophets:ezekiel:44:10",
            "prophets:ii%20samuel:16:13",
            "torah:genesis:49:9",
            "prophets:judges:15:9",
            "writings:daniel:3:11",
            "prophets:i%20kings:14:9"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:12",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:1:14",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:3:8",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:1:8"
        ]
    }
}