{
    "VERSE": "26:99",
    "ARABIC": "وَمَآ أَضَلَّنَآ إِلَّا ٱلْمُجْرِمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "It was only the evildoers who misguided us",
        "TRANSLATION_1": "No one but the sinners led us astray.\n",
        "TRANSLATION_2": "It is none but those steeped in guilt who led us into this error,\n",
        "TRANSLATION_3": "Only the sinful ones made us go astray.\n",
        "TRANSLATION_4": "“And none misled us but the guilty.”\n",
        "TRANSLATION_5": "And none has brought us into error except the criminals.\"\n",
        "TRANSLATION_6": "And none but the guilty led us astray;\n",
        "TRANSLATION_7": "It was naught but the sinners that led us astray;\n",
        "TRANSLATION_8": "It was but the guilty who misled us.\n",
        "TRANSLATION_9": "It was the evildoers who led us astray,\n",
        "TRANSLATION_10": "And none led us astray except the Culprits.\n",
        "TRANSLATION_11": "No one led us astray except the guilty.\n",
        "TRANSLATION_12": "And our seducers were only those who were steeped in guilt.\n",
        "TRANSLATION_13": "And none has brought us into error except the Mujrimun [Iblis (Satan) and those of human beings who commit crimes, murderers, polytheists, oppressors, etc.].\n",
        "TRANSLATION_14": "It was nothing but the evildoers who led us astray.\n",
        "TRANSLATION_15": "No one misled us except the sinners.\n",
        "TRANSLATION_16": "And no one misguided us except the criminals.\n",
        "TRANSLATION_17": "[26:99] And it was none other than the sinners, the devils or our predecessors, whose example we were following, that led us astray, from guidance.\n",
        "TRANSLATION_18": "(It was but the guilty) the idolaters who came before us and whom we emulated (who misled us) who turned us away from faith and obedience.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "26:99",
            "43:76",
            "74:45",
            "56:79",
            "69:37",
            "69:3",
            "86:2",
            "37:39",
            "26:114",
            "77:23"
        ],
        "BIBLE": [
            "torah:leviticus:4:22",
            "torah:leviticus:4:27",
            "torah:leviticus:5:15",
            "torah:leviticus:4:2",
            "prophets:isaiah:53:7",
            "torah:numbers:15:25",
            "writings:psalms:45:15",
            "prophets:amos:2:10",
            "torah:leviticus:4:13",
            "prophets:isaiah:51:18"
        ]
    }
}