{
    "VERSE": "66:12",
    "ARABIC": "وَمَرْيَمَ ٱبْنَتَ عِمْرَٰنَ ٱلَّتِىٓ أَحْصَنَتْ فَرْجَهَا فَنَفَخْنَا فِيهِ مِن رُّوحِنَا وَصَدَّقَتْ بِكَلِمَٰتِ رَبِّهَا وَكُتُبِهِۦ وَكَانَتْ مِنَ ٱلْقَٰنِتِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "And Maryam, the daughter of 'Imran, who guarded her chastity - We breathed Our Ruh into her and she confirmed the Words of her Lord and His Books and was one of the obedient.",
        "TRANSLATION_1": "And of Mary, daughter of 'Imran, who guarded her chastity, so that We breathed into her a new life from Us, and she believed the words of her Lord and His Books, and was among the obedient.\n",
        "TRANSLATION_2": "Allah has also set forth the parable of Mary, the daughter of Imran, who guarded her chastity, and into whom We breathed of Our Spirit, and who testified to the words of her Lord and His Books. She was among the obedient.\n",
        "TRANSLATION_3": "He has also told, as a parable, the story of Mary, daughter of Imran who preserved her virginity and (into whose womb) We breathed Our spirit. She made the words of her Lord and the predictions in His Books come true. She was an obedient woman.\n",
        "TRANSLATION_4": "And the example of Maryam the daughter of Imran, who guarded her chastity – We therefore breathed into her a Spirit from Ourselves – and she testified for the Words of her Lord and His Books, and was among the obedient.\n",
        "TRANSLATION_5": "And Maryam, the daughter of `Imran who guarded her chastity (private part). And We breathed into it through Our Ruh, and she testified to the truth of her Lords Kalimat, and His Kutub, and she was of the Qanitin.\n",
        "TRANSLATION_6": "And Marium, the daughter of Imran, who guarded her chastity, so We breathed into her of Our inspiration and she accepted the truth of the words of her Lord and His books, and she was of, the obedient ones.\n",
        "TRANSLATION_7": "And Mary, Imran's daughter, who guarded her virginity, so We breathed into her of Our Spirit, and she confirmed the Words of her Lord and His Books, and became one of the obedient.\n",
        "TRANSLATION_8": "And Mary, daughter of 'Imran, whose body was chaste, therefor We breathed therein something of Our Spirit. And she put faith in the words of her Lord and His scriptures, and was of the obedient.\n",
        "TRANSLATION_9": "[God gave another example in the story of] Mary, 'Imran's daughter, who preserved her chastity and We breathed Our spirit into her; she testified to the words of her Lord and His Scriptures, and was truly devout.\n",
        "TRANSLATION_10": "And the similitude of Maryram daughter of lmran, who preserved her chastity, wherefore We breathed in it Of Our Spirit. And she testified to the words of her Lord and His Books and she was of the devout.\n",
        "TRANSLATION_11": "And Mary, daughter of Imran, who guarded the chastity of her womb, so We breathed into it of Our spirit. She confirmed the words of her Lord and His Books, and she was one of the obedient.\n",
        "TRANSLATION_12": "And Mary the daughter of 'Imran, who guarded her chastity; and We breathed into (her body) of Our spirit; and she testified to the truth of the words of her Lord and of His Revelations, and was one of the devout (servants).\n",
        "TRANSLATION_13": "And Maryam (Mary), the daughter of 'Imran who guarded her chastity; and We breathed into (the sleeve of her shirt or her garment) through Our Ruh [i.e. Jibrael (Gabriel)], and she testified to the truth of the Words of her Lord [i.e. believed in the Words of Allah: \"Be!\" and he was; that is 'Iesa (Jesus) - son of Maryam (Mary); as a Messenger of Allah], and (also believed in) His Scriptures, and she was of the Qanitin (i.e. obedient to Allah).\n",
        "TRANSLATION_14": "And, Mary, 'Imran's daughter, who guarded her chastity so We breathed into her of Our Spirit (Gabriel); and she put her trust in the Words of her Lord andHis Books, and was among the devout.\n",
        "TRANSLATION_15": "And Mary, the daughter of Imran, who guarded her womb, and so We breathed into her of Our Spirit; and she believed in the truth of her Lord’s Words and His Books, and was one of the devout.\n",
        "TRANSLATION_16": "And [the example of] Mary, the daughter of 'Imran, who guarded her chastity, so We blew into [her garment] through Our angel, and she believed in the words of her Lord and His scriptures and was of the devoutly obedient.\n",
        "TRANSLATION_17": "[66:12] And Mary (wa-Maryama is a supplement to imra’ata Fir‘awna) daughter of ‘Imrān, who preserved [the chastity of] her womb, so We breathed into it of Our Spirit, namely, Gabriel — when he breathed into the opening of her shirt, by God’s creation of this action of his which reached her womb, thus conceiving Jesus — and she confirmed the words of her Lord, His prescriptions, and His, revealed, Scriptures and she was of the obedient, [one] of the obedient folk.\n",
        "TRANSLATION_18": "(And Mary, daughter of Imran, whose body was chaste, therefore We breathed therein something of Our Spirit) and so Gabriel breathed inside her garment and she became pregnant with Jesus. (And she put faith in the words of her Lord) she believed in what Gabriel told her that he was the Messenger of Allah entrusted with giving her a holy son (and His Scriptures) and she also believed in His Scriptures: the Torah, the Gospel and all other Scriptures; it is also said this means: she believed in the words of her Lord that Jesus the son of Mary will come into being by Allah saying \"Be!\" and he became a human being, and she also believed in His Scripture: the Gospel, (and was of the obedient) in times of hardship and comfort; and it is also said that this means: and she was obedient to He Who is far transcendent and majestic'. And of the surah in which Sovereignty is mentioned, which is Meccan and consists of 30 verses, 335 words and 1,313 letters: Surah 67: Sovereignty (al-Mulk) And of the surah in which Sovereignty is mentioned, which is Meccan and consists of 30 verses, 335 words and 1,313 letters:\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "66:12",
            "21:91",
            "18:27",
            "41:45",
            "11:110",
            "97:4",
            "7:137",
            "40:6",
            "32:2",
            "2:87"
        ],
        "BIBLE": [
            "writings:job:33:4",
            "prophets:judges:14:19",
            "prophets:joshua:6:16",
            "prophets:joshua:17:4",
            "prophets:i%20kings:5:21",
            "prophets:ii%20samuel:7:28",
            "prophets:ii%20samuel:8:14",
            "writings:ezra:7:11",
            "torah:deuteronomy:28:53",
            "writings:i%20chronicles:18:6"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:1:8"
        ]
    }
}