{
    "VERSE": "66:2",
    "ARABIC": "قَدْ فَرَضَ ٱللَّهُ لَكُمْ تَحِلَّةَ أَيْمَٰنِكُمْ وَٱللَّهُ مَوْلَىٰكُمْ وَهُوَ ٱلْعَلِيمُ ٱلْحَكِيمُ",
    "ENGLISH": {
        "TRANSLATION_0": "Allah has made the expiation of your oaths obligatory for you. Allah is your Master - He is the All-Knowing, the All-Wise.",
        "TRANSLATION_1": "Surely God has sanctioned the dissolution of your vows. God is your Lord: He is all-knowing, and all-wise.\n",
        "TRANSLATION_2": "Allah has prescribed for you a way for the absolution of your oaths. Allah is your Guardian. He is All-Knowing, Most Wise.\n",
        "TRANSLATION_3": "God has shown you how to absolve yourselves of your oaths. He is your Guardian and is All-knowing and All-wise.\n",
        "TRANSLATION_4": "Allah has ordained expiation for your oaths; and Allah is your Master; and Allah is the All Knowing, the Wise.\n",
        "TRANSLATION_5": "Allah has already ordained for you (O men) the absolution from your oaths. And Allah is your Protector and He is the All-Knower, the All-Wise.\n",
        "TRANSLATION_6": "Allah indeed has sanctioned for you the expiation of your oaths and Allah is your Protector, and He is the Knowing the Wise.\n",
        "TRANSLATION_7": "God has ordained for you the absolution of your oaths. God is your Protector, and He is the All-knowing, the All-wise.\n",
        "TRANSLATION_8": "Allah hath made lawful for you (Muslims) absolution from your oaths (of such a kind), and Allah is your Protector. He is the Knower, the Wise.\n",
        "TRANSLATION_9": "God has already ordained that you be absolved of such oaths. God is your patron. He is the All Knowing, the Wise One.\n",
        "TRANSLATION_10": "Surely Allah hath ordained for you absolution from your oaths; and Allah is your Patron and He is the Knower, the Wise.\n",
        "TRANSLATION_11": "Allah has certainly made lawful for you the dissolution of your oaths, and Allah is your master and He is the All-knowing, the All-wise.\n",
        "TRANSLATION_12": "Allah has already ordained for you, (O men), the dissolution of your oaths (in some cases): and Allah is your Protector, and He is Full of Knowledge and Wisdom.\n",
        "TRANSLATION_13": "Allah has already ordained for you (O men), the dissolution of your oaths. And Allah is your Maula (Lord, or Master, or Protector, etc.) and He is the All-Knower, the All-Wise.\n",
        "TRANSLATION_14": "Allah has absolved you from your oaths. Allah is your Guardian, the Knowing, the Wise.\n",
        "TRANSLATION_15": "God has decreed for you the dissolution of your oaths. God is your Master. He is the All-Knowing, the Most Wise.\n",
        "TRANSLATION_16": "Allah has already ordained for you [Muslims] the dissolution of your oaths. And Allah is your protector, and He is the Knowing, the Wise.\n",
        "TRANSLATION_17": "[66:2] Verily God has prescribed, He has made lawful, for you [when necessary] the absolution of your oaths, to absolve them by expiation, as mentioned in the sūrat al-Mā’ida [Q. 5:89] and the forbidding of [sexual relations with] a handmaiden counts as an oath, so did the Prophet (s) expiate? Muqātil [b. Sulaymān] said, ‘He set free a slave [in expiation] for his prohibition of Māriya’; whereas al-Hasan [al-Basrī] said, ‘He never expiated, because the Prophet (s) has been forgiven [all errors]’. And God is your Protector, your Helper, and He is the Knower, the Wise.\n",
        "TRANSLATION_18": "(Allah hath made lawful for you (Muslims) absolution from your oaths (of such a kind)) and so the Prophet (pbuh) absolved himself from his oath and married Maria the Copt, (and Allah is your Protector) and Helper. (He is the Knower) He knows that you forbade yourself Maria the Copt, (the Wise) in that which He enjoined about the expiation of oaths.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "66:2",
            "24:18",
            "8:71",
            "4:26",
            "4:104",
            "6:62",
            "76:30",
            "33:1",
            "2:224",
            "9:106"
        ],
        "BIBLE": [
            "prophets:jeremiah:10:23",
            "writings:psalms:25:4",
            "torah:genesis:24:42",
            "prophets:jeremiah:5:4",
            "prophets:ezekiel:14:23",
            "prophets:ii%20samuel:14:20",
            "prophets:ezekiel:36:32",
            "writings:psalms:144:15",
            "torah:deuteronomy:4:35",
            "writings:psalms:9:21"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:6:3"
        ]
    }
}