{
    "VERSE": "66:8",
    "ARABIC": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ تُوبُوٓا۟ إِلَى ٱللَّهِ تَوْبَةً نَّصُوحًا عَسَىٰ رَبُّكُمْ أَن يُكَفِّرَ عَنكُمْ سَيِّـَٔاتِكُمْ وَيُدْخِلَكُمْ جَنَّٰتٍ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَٰرُ يَوْمَ لَا يُخْزِى ٱللَّهُ ٱلنَّبِىَّ وَٱلَّذِينَ ءَامَنُوا۟ مَعَهُۥ نُورُهُمْ يَسْعَىٰ بَيْنَ أَيْدِيهِمْ وَبِأَيْمَٰنِهِمْ يَقُولُونَ رَبَّنَآ أَتْمِمْ لَنَا نُورَنَا وَٱغْفِرْ لَنَآ إِنَّكَ عَلَىٰ كُلِّ شَىْءٍ قَدِيرٌ",
    "ENGLISH": {
        "TRANSLATION_0": "You who have iman! repent sincerely to Allah. It may be that your Lord will erase your bad actions from you and admit you into Gardens with rivers flowing under them on the Day when Allah will not disgrace the ProDhet and those who had iman alona with him. Their liaht will stream out ahead of them and on their riaht. They will say, 'Our Lord, perfect our light for us and forgive us! You have power over all things.'",
        "TRANSLATION_1": "O you who believe, turn to God truly in repentance. Perhaps your Lord may forgive your ills and admit you to gardens with rivers flowing by on the day when God will not humiliate the Prophet and those who believe with him. Their light will move in front of them and to their right, and they will say: \"O Lord, perfect our light and forgive us. You have power over every thing.\"\n",
        "TRANSLATION_2": "Believers, turn to Allah in sincere repentance; maybe your Lord will expunge your evil deeds and admit you to the Gardens beneath which rivers flow. This will be on the Day when Allah will not disgrace the Prophet and those who have embraced faith and are with him; their light will be running before them and on their right hands, and they will say: “Our Lord, perfect for us our light and forgive us. Surely You have power over everything.”\n",
        "TRANSLATION_3": "Believers, turn to God in repentance with the intention of never repeating the same sin. Perhaps your Lord will expiate your evil deeds and admit you to Paradise wherein streams flow. On the Day of Judgment, God will not disgrace the Prophet and those who have believed in him. Their lights will shine in front of them and to their right. They will say, \"Our Lord, perfect our light for us and forgive our sins. You have power over all things\".\n",
        "TRANSLATION_4": "O People who Believe! Incline towards Allah in a repentance that becomes a guidance for the future; it is likely that your Lord will relieve you of your sins and admit you into Gardens beneath which rivers flow – on the day when Allah will not humble the Prophet and the believers along with him; their light will be running ahead of them and on their right; they will say, “Our Lord! Perfect our light for us, and forgive us; indeed You are Able to do all things.”\n",
        "TRANSLATION_5": "O you who believe! Turn to Allah with sincere repentance! It may be that your Lord will expiate from you your sins, and admit you into Gardens under which rivers flow -- the Day that Allah will not disgrace the Prophet and those who believe with him. Their light will run forward before them and in their right hands. They will say: \"Our Lord! Keep perfect our light for us and grant us forgiveness. Verily, You are Able to do all things.\"\n",
        "TRANSLATION_6": "O you who believe! turn to Allah a sincere turning; maybe your Lord will remove from you your evil and cause you to enter gardens beneath which rivers flow, on the day on which Allah will not abase the Prophet and those who believe with him; their light shall run on before them and on their right hands; they shall say: Our Lord! make perfect for us our light, and grant us protection, surely Thou hast power over all things.\n",
        "TRANSLATION_7": "Believers, turn to God in sincere repentance; it may be that your Lord will acquit you of your evil deeds, and will admit you into gardens underneath which rivers flow. Upon the day when God will not degrade the Prophet and those who believe with him, their light running before them, and on their right hands; and they say, 'Our 'Lord, perfect for us our light, and forgive us; surely Thou art powerful over everything.'\n",
        "TRANSLATION_8": "O ye who believe! Turn unto Allah in sincere repentance! It may be that your Lord will remit from you your evil deeds and bring you into Gardens underneath which rivers flow, on the day when Allah will not abase the Prophet and those who believe with him. Their light will run before them and on their right hands; they will say: Our Lord! Perfect our light for us, and forgive us! Lo! Thou art Able to do all things.\n",
        "TRANSLATION_9": "Believers, turn to God in sincere repentance. Your Lord may well forgive your bad deeds and admit you into gardens watered by running streams, on a Day when God will not abase the Prophet and those who have believed with him. Their light will shine out ahead of them and on their right, and they will say: \"Lord perfect our light for us, and forgive us; You have power over all things.\"\n",
        "TRANSLATION_10": "O ye who believe! turn Unto Allah with a sincere repentance. Belike your Lord will expiate from you your misdeeds and cause you to enter Gardens whereunder rivers flow, on the Day whereon Allah will not humiliate the prophet and those who believe with him. Their light will be running before them and on their right hands, and they will say: our Lord! perfect for us our light, and forgive us; verily Thou art over everything Potent.\n",
        "TRANSLATION_11": "O you who have faith! Repent to Allah with sincere repentance! Maybe your Lord will absolve you of your misdeeds and admit you into gardens with streams running in them, on the day when Allah will not let down the Prophet and the faithful who are with him. Their light will move swiftly before them and on their right. They will say, ‘Our Lord! Perfect our light for us, and forgive us! Indeed You have power over all things.’\n",
        "TRANSLATION_12": "O ye who believe! Turn to Allah with sincere repentance: In the hope that your Lord will remove from you your ills and admit you to Gardens beneath which Rivers flow,- the Day that Allah will not permit to be humiliated the Prophet and those who believe with him. Their Light will run forward before them and by their right hands, while they say, \"Our Lord! Perfect our Light for us, and grant us Forgiveness: for Thou hast power over all things.\"\n",
        "TRANSLATION_13": "O you who believe! Turn to Allah with sincere repentance! It may be that your Lord will remit from you your sins, and admit you into Gardens under which rivers flow (Paradise) the Day that Allah will not disgrace the Prophet (Muhammad SAW) and those who believe with him, their Light will run forward before them and with (their Records Books of deeds) in their right hands they will say: \"Our Lord! Keep perfect our Light for us [and do not put it off till we cross over the Sirat (a slippery bridge over the Hell) safely] and grant us forgiveness. Verily, You are Able to do all things.\"\n",
        "TRANSLATION_14": "Believers, turn to Allah in sincere repentance. Your Lord may acquit you of your sins, and admit you to Gardens underneath which rivers flow on a Day whenAllah will not degrade the Prophet and those who believe with him. Their light will run before them and on their right hands, and they will say: 'Our Lord, completeour light for us and forgive us. Surely, You have power over all things'\n",
        "TRANSLATION_15": "O you who believe! Repent to God with sincere repentance. Perhaps your Lord will remit your sins, and admit you into gardens beneath which rivers flow, on the Day when God will not disappoint the Prophet and those who believed with him. Their light streaming before them, and to their right, they will say, “Our Lord, complete our light for us, and forgive us; You are capable of all things.”\n",
        "TRANSLATION_16": "O you who have believed, repent to Allah with sincere repentance. Perhaps your Lord will remove from you your misdeeds and admit you into gardens beneath which rivers flow [on] the Day when Allah will not disgrace the Prophet and those who believed with him. Their light will proceed before them and on their right; they will say, \"Our Lord, perfect for us our light and forgive us. Indeed, You are over all things competent.\"\n",
        "TRANSLATION_17": "[66:8] O you who believe! Repent to God with sincere repentance (read nasūhan or nusūhan), a truthful [repentance], so that one does not return to [committing] that sin again, nor have the desire to return to it. It may be that your Lord (‘asā: [an expression denoting] ‘a hope’ that will be realised) will absolve you of your misdeeds and admit you into gardens, orchards, underneath which rivers flow, on the day when God will not let down, by admitting into the Fire, the Prophet and those who believe with him. Their light will be running before them, in front of them, and, it will be, on their right. They will say (yaqūlūna: this denotes the beginning of a new [syntactically independent] sentence), ‘Our Lord! Perfect our light for us, towards Paradise — whereas the hypocrites, their light will be extinguished — and forgive us, Our Lord. Assuredly You have power over all things’.\n",
        "TRANSLATION_18": "(0 ye who believe) in Muhammad (pbuh) and the Qur'an! (Turn unto Allah in sincere repentance!) repent of your sins truly and sincerely from the bottom of your hearts. This means feeling regret in one's heart, asking forgiveness with one's tongue and stop engaging in the particular sin one is repenting of with one's body and conscience, intending never to return to it (It may be) \"may be\" from Allah denotes a necessity (that your Lord will remit from you your evil deeds) forgive your sins through repentance (and bring you) in the Hereafter (into Gardens beneath which) beneath their trees and habitations (rivers flow) rivers of wine, water, honey and milk flow, (on the day) which is the Day of Judgement (when Allah will not abase the Prophet) as He abases the disbelievers; He says: He will not torment the Prophet (pbuh) (and those who believe with him) and will not torment those who believe in him, such as Abu Bakr and his believing brothers. (Their light will run) will shine (before them) on the Bridge over the Fire (and on their right hands: they will say) when the light of the hypocrites is put out: (Our Lord! Perfect our light for us) on the Bridge over hell, (and forgive us) our sins! (Lo! Thou art Able to do all things) of completing our light and forgiving us.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "66:8",
            "57:12",
            "22:17",
            "60:12",
            "22:14",
            "65:11",
            "64:9",
            "47:12",
            "41:30",
            "3:64"
        ],
        "BIBLE": [
            "writings:psalms:59:12",
            "writings:i%20chronicles:21:3",
            "prophets:jeremiah:3:16",
            "writings:daniel:6:13",
            "prophets:ii%20samuel:3:13",
            "prophets:ezekiel:32:14",
            "prophets:joel:2:17",
            "torah:exodus:34:10",
            "writings:ii%20chronicles:30:5",
            "prophets:zephaniah:3:5"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:13"
        ]
    }
}