{
    "VERSE": "113:1",
    "ARABIC": "بِسْمِ ٱللَّهِ ٱلرَّحْمَٰنِ ٱلرَّحِيمِ قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ",
    "ENGLISH": {
        "TRANSLATION_0": "Say: 'I seek refuge with the Lord of Daybreak,",
        "TRANSLATION_1": "SAY: \"I SEEK refuge with the Lord of rising day\n",
        "TRANSLATION_2": "Say: “I seek refuge with the Lord of the rising day;\n",
        "TRANSLATION_3": "(Muhammad), say, \"I seek protection from the Lord of the Dawn\n",
        "TRANSLATION_4": "Proclaim (O dear Prophet Mohammed – peace and blessings be upon him), “I take refuge of the One Who creates the Daybreak.”\n",
        "TRANSLATION_5": "Say: \"I seek refuge with the Lord of Al-Falaq,\"\n",
        "TRANSLATION_6": "Say: I seek refuge in the Lord of the dawn,\n",
        "TRANSLATION_7": "Say: 'I take refuge with the Lord of the Daybreak\n",
        "TRANSLATION_8": "Say: I seek refuge in the Lord of the Daybreak\n",
        "TRANSLATION_9": "Say, \"I seek refuge in the Lord of the daybreak\n",
        "TRANSLATION_10": "Say thou; I seek refuge with the Lord of the daybreak.\n",
        "TRANSLATION_11": "Say, ‘I seek the protection of the Lord of the daybreak\n",
        "TRANSLATION_12": "Say: I seek refuge with the Lord of the Dawn\n",
        "TRANSLATION_13": "Say: \"I seek refuge with (Allah) the Lord of the daybreak,\n",
        "TRANSLATION_14": "Say: 'I take refuge with the Lord of Daybreak\n",
        "TRANSLATION_15": "Say, “I take refuge with the Lord of Daybreak.\n",
        "TRANSLATION_16": "Say, \"I seek refuge in the Lord of daybreak\n",
        "TRANSLATION_17": "[113:1] Say: ‘I seek refuge in the Lord of the Daybreak, the morning,\n",
        "TRANSLATION_18": "And from his narration on the authority of Ibn 'Abbas that he said regarding the interpretation of Allah's saying (Say: I seek refuge in the Lord of Daybreak): '(Say: I seek refuge in the Lord of Daybreak) He says: Say, Muhammad, I seek protection, and it is said: I seek refuge, in the Lord of daybreak; and it is also said that al-falaq refers to a well in the Fire; and it is also said that al-falaq is a valley in the Fire.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "113:1",
            "37:100",
            "26:47",
            "7:121",
            "114:1",
            "26:98",
            "36:27",
            "29:30",
            "89:28",
            "68:50"
        ],
        "BIBLE": [
            "writings:psalms:96:2",
            "writings:i%20chronicles:16:23",
            "writings:psalms:142:6",
            "torah:deuteronomy:27:9",
            "torah:deuteronomy:33:23",
            "prophets:i%20kings:18:36",
            "writings:psalms:129:8",
            "prophets:isaiah:39:8",
            "prophets:isaiah:12:4",
            "prophets:judges:6:23"
        ]
    }
}