{
    "VERSE": "113:5",
    "ARABIC": "وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ",
    "ENGLISH": {
        "TRANSLATION_0": "and from the evil of an envier when he envies.'",
        "TRANSLATION_1": "From the evil of the envier when he envies.\n",
        "TRANSLATION_2": "and from the evil of the envier when he envies.”\n",
        "TRANSLATION_3": "and from the evil of the envious ones.\n",
        "TRANSLATION_4": "“And from the evil of the envier when he is envious of me.”\n",
        "TRANSLATION_5": "And from the evil of the envier when he envies.\"\n",
        "TRANSLATION_6": "And from the evil of the envious when he envies\n",
        "TRANSLATION_7": "from the evil of an envier when he envies.'\n",
        "TRANSLATION_8": "And from the evil of the envier when he envieth.\n",
        "TRANSLATION_9": "and from the evil of the envier when he envies.\"\n",
        "TRANSLATION_10": "And from the evil of the envier when he envieth.\n",
        "TRANSLATION_11": "and from the evil of the envious one when he envies.’\n",
        "TRANSLATION_12": "And from the mischief of the envious one as he practises envy.\n",
        "TRANSLATION_13": "And from the evil of the envier when he envies.\"\n",
        "TRANSLATION_14": "from the evil of the envier when he envies'\n",
        "TRANSLATION_15": "And from the evil of an envious when he envies.”\n",
        "TRANSLATION_16": "And from the evil of an envier when he envies.\"\n",
        "TRANSLATION_17": "[113:5] and from the evil of an envier when he envies’, [when] he manifests his envy and behaves in accordance with it — such as the mentioned Labīd from among the Jews who were envious of the Prophet (s); the mention of these three [elements of evil] which are [already] subsumed by [the statement] ‘of what He has created’, is because of the severity of their evil. Meccan or Medinese, consisting of 6 verses.\n",
        "TRANSLATION_18": "And from the evil of the envier when he envieth) this refers to Labid Ibn al-A'sam, the Jew, who was envious of the Prophet (pbuh) and used black magic to separate him from 'A'ishah'. And of the surah in which Mankind is mentioned, which is all Medinan, and consists of 6 verses, 20 words and 79 letters: Surah 114: Mankind (al-Nas) And of the surah in which Mankind is mentioned, which is all Medinan, and consists of 6 verses, 20 words and 79 letters:\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "113:5",
            "113:3",
            "113:2",
            "81:4",
            "17:83",
            "38:62",
            "70:20",
            "81:8",
            "113:4",
            "76:7"
        ],
        "BIBLE": [
            "writings:proverbs:24:8",
            "writings:proverbs:12:21",
            "prophets:habakkuk:1:13",
            "prophets:habakkuk:1:3",
            "writings:proverbs:24:2",
            "writings:psalms:94:20",
            "writings:job:38:41",
            "prophets:jonah:1:8",
            "writings:proverbs:3:31",
            "writings:psalms:49:6"
        ]
    }
}