{
    "VERSE": "55:13",
    "ARABIC": "فَبِأَىِّ ءَالَآءِ رَبِّكُمَا تُكَذِّبَانِ",
    "ENGLISH": {
        "TRANSLATION_0": "So which of your Lord's blessings do you both then deny?",
        "TRANSLATION_1": "How many favours of your Lord will then both of you deny?\n",
        "TRANSLATION_2": "Which of the bounties of your Lord will you twain – you men and jinn – then deny?\n",
        "TRANSLATION_3": "(Jinn and mankind) - which of the favors of your Lord do you deny?\n",
        "TRANSLATION_4": "So O men and jinns! Which favour of your Lord will you deny?\n",
        "TRANSLATION_5": "Then which of the blessings of your Lord will you both deny\n",
        "TRANSLATION_6": "Which then of the bounties of your Lord will you deny?\n",
        "TRANSLATION_7": "O which of your Lord's bounties will you and you deny?\n",
        "TRANSLATION_8": "Which is it, of the favours of your Lord, that ye deny?\n",
        "TRANSLATION_9": "Which of your Lord's wonders would you deny?\n",
        "TRANSLATION_10": "Which, then, of the benefits of your Lord, will ye twain belie?\n",
        "TRANSLATION_11": "So which of your Lord’s bounties will you both deny?\n",
        "TRANSLATION_12": "Then which of the favours of your Lord will ye deny?\n",
        "TRANSLATION_13": "Then which of the Blessings of your Lord will you both (jinns and men) deny?\n",
        "TRANSLATION_14": "Which favors of your Lord will you both (humans and jinn) belie?\n",
        "TRANSLATION_15": "So which of your Lord’s marvels will you deny?\n",
        "TRANSLATION_16": "So which of the favors of your Lord would you deny?\n",
        "TRANSLATION_17": "[55:13] So which of your Lord’s favours, graces, will you deny? (tukadhdhibān is mentioned thirty one times; the interrogative is meant [to be understood] as an affirmative, judging by what al-Hākim [al-Naysābūrī] reported [by way of an isnād] from Jābir [b. ‘Abd Allāh al-Ansārī], who said, ‘The Messenger of God (s) was reciting surāt al-Rahmān to us, and when he completed it, he said, “What is wrong with you that you have been silent [throughout]? Verily the jinn are more responsive than you. Not once did I recite this verse to them — So which of your Lord’s favours will you deny? — but that they said, ‘Not one of your graces, our Lord, do we deny, for [all] praise belongs to You’ ”).\n",
        "TRANSLATION_18": "(Which is it, of the favours of your Lord, that ye deny) and claim that they are not from Allah, jinn and humans? This is addressed to all human beings except Muhammad (pbuh).\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "55:47",
            "55:75",
            "55:38",
            "55:34",
            "55:23",
            "55:16",
            "55:21",
            "55:13",
            "55:53",
            "55:51"
        ],
        "BIBLE": [
            "prophets:i%20samuel:2:26",
            "writings:proverbs:29:26",
            "prophets:isaiah:65:8",
            "writings:psalms:89:6",
            "torah:deuteronomy:33:23",
            "writings:psalms:62:13",
            "writings:proverbs:19:6",
            "prophets:ii%20samuel:16:4",
            "prophets:zechariah:7:2",
            "prophets:ii%20samuel:23:17"
        ]
    }
}