{
    "VERSE": "55:17",
    "ARABIC": "رَبُّ ٱلْمَشْرِقَيْنِ وَرَبُّ ٱلْمَغْرِبَيْنِ",
    "ENGLISH": {
        "TRANSLATION_0": "The Lord of the two Easts and the Lord of the two Wests.",
        "TRANSLATION_1": "Lord of the two Easts, Lord of the two Wests.\n",
        "TRANSLATION_2": "Lord of the two easts and of the two wests is He.\n",
        "TRANSLATION_3": "He is the Lord of the East and West through all seasons.\n",
        "TRANSLATION_4": "Lord of both the Easts, and Lord of both the Wests!\n",
        "TRANSLATION_5": "The Lord of the two easts and the Lord of the two wests.\n",
        "TRANSLATION_6": "Lord of the East and Lord of the West.\n",
        "TRANSLATION_7": "Lord of the Two Easts, Lord of the Two Wests,\n",
        "TRANSLATION_8": "Lord of the two Easts, and Lord of the two Wests!\n",
        "TRANSLATION_9": "He is the Lord of the two easts and the Lord of the two wests.\n",
        "TRANSLATION_10": "He is Lord of the two easts and Lord of the two wests.\n",
        "TRANSLATION_11": "Lord of the two easts, and Lord of the two wests!\n",
        "TRANSLATION_12": "(He is) Lord of the two Easts and Lord of the two Wests:\n",
        "TRANSLATION_13": "(He is) the Lord of the two easts (places of sunrise during early summer and early winter) and the Lord of the two wests (places of sunset during early summer and early winter).\n",
        "TRANSLATION_14": "The Lord of the Two Easts, the Lord of the Two Wests.\n",
        "TRANSLATION_15": "Lord of the two Easts and Lord of the two Wests.\n",
        "TRANSLATION_16": "[He is] Lord of the two sunrises and Lord of the two sunsets.\n",
        "TRANSLATION_17": "[55:17] Lord of the two Easts, [the points of] the winter sunrise and the summer sunrise, and Lord of the two Wests: likewise [the two points of sunset].\n",
        "TRANSLATION_18": "(Lord of the two Easts) the East of winter and the East of summer, (and Lord of the two Wests) the West of winter and the West of summer! There are two Easts and two Wests. The East of winter and the East of summer have 180 phases just as the two Wests and the moon have 180 phases. It is also said that the Easts of summer and winter have 177 phases and the Wests of summer and winter as well as the moon have 177 phases. The sun rises throughout the year two days in the same phase and it also sets two days in the same phase.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "55:17",
            "70:40",
            "26:28",
            "73:9",
            "53:42",
            "37:5",
            "26:48",
            "7:122",
            "53:49",
            "7:137"
        ],
        "BIBLE": [
            "writings:ecclesiastes:1:5",
            "torah:genesis:19:13",
            "torah:deuteronomy:16:7",
            "writings:ii%20chronicles:29:4",
            "prophets:jeremiah:23:24",
            "prophets:ii%20kings:17:32",
            "writings:psalms:73:18",
            "torah:genesis:19:27",
            "writings:i%20chronicles:16:39",
            "prophets:i%20kings:12:31"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:14",
            "Sefer%20Yetzirah:4:2",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:13",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:2:6",
            "Sefer%20Yetzirah:1:9"
        ]
    }
}