{
    "VERSE": "55:20",
    "ARABIC": "بَيْنَهُمَا بَرْزَخٌ لَّا يَبْغِيَانِ",
    "ENGLISH": {
        "TRANSLATION_0": "with a barrier between them they do not break through.",
        "TRANSLATION_1": "With an interstice between them which they cannot cross.\n",
        "TRANSLATION_2": "and yet there is a barrier between them which they may not overstep.\n",
        "TRANSLATION_3": "but has created a barrier between them so that they will not merge totally.\n",
        "TRANSLATION_4": "Whereas there is a barrier between them so they cannot encroach upon one another.\n",
        "TRANSLATION_5": "Between them is a barrier which none of them can transgress.\n",
        "TRANSLATION_6": "Between them is a barrier which they cannot pass.\n",
        "TRANSLATION_7": "between them a barrier they do not overpass.\n",
        "TRANSLATION_8": "There is a barrier between them. They encroach not (one upon the other).\n",
        "TRANSLATION_9": "Between them is a barrier, which they do not overrun.\n",
        "TRANSLATION_10": "In-between the twain is a barrier which they pass not.\n",
        "TRANSLATION_11": "There is a barrier between them, which they do not overstep.\n",
        "TRANSLATION_12": "Between them is a Barrier which they do not transgress:\n",
        "TRANSLATION_13": "Between them is a barrier which none of them can transgress.\n",
        "TRANSLATION_14": "and between them is a barrier which they do not overpass.\n",
        "TRANSLATION_15": "Between them is a barrier, which they do not overrun.\n",
        "TRANSLATION_16": "Between them is a barrier [so] neither of them transgresses.\n",
        "TRANSLATION_17": "[55:20] Between them there is a barrier, by His power, exalted be He. They do not overstep, neither of the two encroaches upon the other to become mixed with it.\n",
        "TRANSLATION_18": "(There is a barrier) from Allah (between them) between the sweet and salty seas. (They encroach not (one upon the other)) nor does any one of them change the taste of the other.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "55:20",
            "55:4",
            "55:44",
            "56:60",
            "20:103",
            "44:38",
            "21:16",
            "25:67",
            "18:93",
            "23:101"
        ],
        "BIBLE": [
            "prophets:jeremiah:34:18",
            "writings:lamentations:3:37",
            "writings:ecclesiastes:8:7",
            "prophets:isaiah:10:28",
            "writings:psalms:89:42",
            "writings:proverbs:4:15",
            "writings:job:19:8",
            "prophets:i%20samuel:16:10",
            "torah:genesis:32:32",
            "writings:job:28:8"
        ]
    }
}