{
    "VERSE": "55:27",
    "ARABIC": "وَيَبْقَىٰ وَجْهُ رَبِّكَ ذُو ٱلْجَلَٰلِ وَٱلْإِكْرَامِ",
    "ENGLISH": {
        "TRANSLATION_0": "but the Face of your Lord will remain, Master of Majesty and Generosity.",
        "TRANSLATION_1": "But abiding is the glory of your Lord, full of majesty and beneficence.\n",
        "TRANSLATION_2": "only the Person of your Lord, full of majesty and splendour, will endure.\n",
        "TRANSLATION_3": "Only the Supreme Essence of your Glorious and Gracious Lord will remain forever.\n",
        "TRANSLATION_4": "And everlasting is the Entity of your Lord, the Most Majestic and the Most Honourable.\n",
        "TRANSLATION_5": "And the Face of your Lord Dhul-Jalal wal-Ikram will remain forever.\n",
        "TRANSLATION_6": "And there will endure for ever the person of your Lord, the Lord of glory and honor.\n",
        "TRANSLATION_7": "yet still abides the Face of thy Lord, majestic, splendid.\n",
        "TRANSLATION_8": "There remaineth but the Countenance of thy Lord of Might and Glory.\n",
        "TRANSLATION_9": "while your Lord's own Self will remain full of majesty and glory.\n",
        "TRANSLATION_10": "And there will remain the countenance of thine Lord, Owner of Majesty and Beneficence.\n",
        "TRANSLATION_11": "yet lasting is the majestic and munificent Face of your Lord.\n",
        "TRANSLATION_12": "But will abide (for ever) the Face of thy Lord,- full of Majesty, Bounty and Honour.\n",
        "TRANSLATION_13": "And the Face of your Lord full of Majesty and Honour will abide forever.\n",
        "TRANSLATION_14": "Yet the Face of your Lord will abide forever, Majestic and Splendid.\n",
        "TRANSLATION_15": "But will remain the Presence of your Lord, Full of Majesty and Splendor.\n",
        "TRANSLATION_16": "And there will remain the Face of your Lord, Owner of Majesty and Honor.\n",
        "TRANSLATION_17": "[55:27] yet there will remain the countenance of your Lord, His Essence, [the countenance] of majesty, magnificence, and munificence, towards believers, through His graces to them.\n",
        "TRANSLATION_18": "(There remaineth but the Countenance of thy Lord) dies not; and it is also said that this means: the righteous works which are performed for the sake of Allah's Countenance will not perish (of Might) Who possesses might and sovereignty (and Glory) and who also possesses forgiveness and beneficence.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "55:27",
            "55:78",
            "92:20",
            "74:3",
            "89:22",
            "93:3",
            "53:42",
            "94:8",
            "79:19",
            "74:7"
        ],
        "BIBLE": [
            "prophets:isaiah:54:8",
            "writings:psalms:13:2",
            "prophets:jeremiah:5:22",
            "writings:psalms:11:7",
            "prophets:zephaniah:1:2",
            "writings:psalms:41:13",
            "torah:deuteronomy:14:2",
            "torah:deuteronomy:7:6",
            "writings:psalms:67:2",
            "writings:psalms:88:15"
        ]
    }
}