{
    "VERSE": "55:31",
    "ARABIC": "سَنَفْرُغُ لَكُمْ أَيُّهَ ٱلثَّقَلَانِ",
    "ENGLISH": {
        "TRANSLATION_0": "Soon We will settle your affairs, you two weighty throngs.",
        "TRANSLATION_1": "We shall soon be free to turn to you, O weary caravans,\n",
        "TRANSLATION_2": "O you twain, who are a burden (on the earth), We shall attend to you and call you to account.\n",
        "TRANSLATION_3": "Jinn and mankind, We shall certainly settle your accounts.\n",
        "TRANSLATION_4": "Disposing all works quickly We tend towards your account, O you two large groups!\n",
        "TRANSLATION_5": "We shall attend to you, O Thaqalan!\n",
        "TRANSLATION_6": "Soon will We apply Ourselves to you, O you two armies.\n",
        "TRANSLATION_7": "We shall surely attend to you at leisure, you weight and you weight!\n",
        "TRANSLATION_8": "We shall dispose of you, O ye two dependents (man and jinn).\n",
        "TRANSLATION_9": "Soon We shall attend to you -- two big groups [of jinn and mankind].\n",
        "TRANSLATION_10": "Anon We shall direct Our selves to you, O ye two classes.\n",
        "TRANSLATION_11": "Soon We shall make Ourselves unoccupied for you, O you notable two!\n",
        "TRANSLATION_12": "Soon shall We settle your affairs, O both ye worlds!\n",
        "TRANSLATION_13": "We shall attend to you, O you two classes (jinns and men)!\n",
        "TRANSLATION_14": "We shall surely aim, O both burdened.\n",
        "TRANSLATION_15": "We will attend to you, O prominent two.\n",
        "TRANSLATION_16": "We will attend to you, O prominent beings.\n",
        "TRANSLATION_17": "[55:31] We will attend to you, We shall turn to reckon with you, O you two heavy ones!, mankind and jinn.\n",
        "TRANSLATION_18": "We shall dispose of you) We shall record the works that you do in the life of the world and take you to task for them on the Day of Judgement, (0 ye two dependents) human beings and the jinn.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "55:31",
            "73:5",
            "70:2",
            "99:2",
            "29:13",
            "27:27",
            "26:194",
            "15:12",
            "96:4",
            "26:200"
        ],
        "BIBLE": [
            "torah:genesis:13:16",
            "prophets:jeremiah:16:20",
            "torah:exodus:30:32",
            "torah:exodus:34:10",
            "prophets:ezekiel:15:3",
            "torah:genesis:1:26",
            "prophets:jeremiah:25:14",
            "writings:ecclesiastes:9:1",
            "prophets:micah:2:12",
            "torah:leviticus:11:43"
        ]
    }
}