{
    "VERSE": "55:44",
    "ARABIC": "يَطُوفُونَ بَيْنَهَا وَبَيْنَ حَمِيمٍ ءَانٍ",
    "ENGLISH": {
        "TRANSLATION_0": "They will go back and forth between fire and scalding water.",
        "TRANSLATION_1": "They will go round and around between it and boiling water.\n",
        "TRANSLATION_2": "They will keep circling around between Hell and boiling water.\n",
        "TRANSLATION_3": "They will run around in blazing fire and boiling water.\n",
        "TRANSLATION_4": "They shall keep going back and forth between it and the extremely hot boiling water.\n",
        "TRANSLATION_5": "They will go between it and Hamim An!\n",
        "TRANSLATION_6": "Round about shall they go between it and hot, boiling water.\n",
        "TRANSLATION_7": "they shall go round between it and between hot, boiling water.\n",
        "TRANSLATION_8": "They go circling round between it and fierce, boiling water.\n",
        "TRANSLATION_9": "They will go round between its flames and boiling water.\n",
        "TRANSLATION_10": "Going round between it and balling water fierce.\n",
        "TRANSLATION_11": "They shall circuit between it and boiling hot water.\n",
        "TRANSLATION_12": "In its midst and in the midst of boiling hot water will they wander round!\n",
        "TRANSLATION_13": "They will go between it (Hell) and the boiling hot water!\n",
        "TRANSLATION_14": "they shall go round between it, and between a hot, boiling water.\n",
        "TRANSLATION_15": "They circulate between it and between a seething bath.\n",
        "TRANSLATION_16": "They will go around between it and scalding water, heated [to the utmost degree].\n",
        "TRANSLATION_17": "[55:44] They shall pass round, they shall pace, between it and boiling hot water, [water] of extreme temperature, which they are given to drink every time they call to be rescued from the heat of the Fire (ānin is defective, like qādin).\n",
        "TRANSLATION_18": "(They go circling round between it) i.e. the Fire (and fierce, boiling water) water as hot as can be.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "55:44",
            "70:10",
            "25:67",
            "55:20",
            "21:93",
            "20:62",
            "26:118",
            "56:60",
            "40:72",
            "55:4"
        ],
        "BIBLE": [
            "prophets:zechariah:2:9",
            "writings:psalms:78:28",
            "prophets:ezekiel:5:12",
            "prophets:ezekiel:5:2",
            "torah:genesis:8:7",
            "prophets:isaiah:15:8",
            "torah:exodus:39:23",
            "prophets:ii%20kings:25:4",
            "prophets:jeremiah:52:7",
            "torah:exodus:28:32"
        ]
    }
}