{
    "VERSE": "55:54",
    "ARABIC": "مُتَّكِـِٔينَ عَلَىٰ فُرُشٍۭ بَطَآئِنُهَا مِنْ إِسْتَبْرَقٍ وَجَنَى ٱلْجَنَّتَيْنِ دَانٍ",
    "ENGLISH": {
        "TRANSLATION_0": "They will be reclining on couches lined with rich brocade, the fruits of the Gardens hanging close to hand.",
        "TRANSLATION_1": "Reclining there on carpets lined with brocade, fruits of the garden hanging low within reach.\n",
        "TRANSLATION_2": "They shall recline on couches lined with brocade, and within reach shall hang the fruits of the two Gardens.\n",
        "TRANSLATION_3": "(The dwellers of Paradise) will recline on couches lined with silk brocade and it will be easy to reach the ripe fruits from the two gardens.\n",
        "TRANSLATION_4": "Reclining upon thrones that are lined with brocade, with the fruit of both Gardens close enough to be picked from under.\n",
        "TRANSLATION_5": "Reclining upon the couches lined with Istabraq, and the fruits of the two Gardens will be near at hand.\n",
        "TRANSLATION_6": "Reclining on beds, the inner coverings of which are of silk brocade; and the fruits of the two gardens shall be within reach.\n",
        "TRANSLATION_7": "reclining upon couches lined with brocade, the fruits of the gardens nigh to gather --\n",
        "TRANSLATION_8": "Reclining upon couches lined with silk brocade, the fruit of both the gardens near to hand.\n",
        "TRANSLATION_9": "They will recline upon carpets lined with rich brocade; and the fruits of both these gardens will be within easy reach.\n",
        "TRANSLATION_10": "Reclining on carpets whereof the linings will be of brocade; and the fruit of the two Gardens shall be near at hand.\n",
        "TRANSLATION_11": "[They will be] reclining on beds lined with green silk. And the fruit of the two gardens will be near at hand.\n",
        "TRANSLATION_12": "They will recline on Carpets, whose inner linings will be of rich brocade: the Fruit of the Gardens will be near (and easy of reach).\n",
        "TRANSLATION_13": "Reclining upon the couches lined with silk brocade, and the fruits of the two Gardens will be near at hand.\n",
        "TRANSLATION_14": "(They shall) recline on couches lined with brocade, and the fruits of the Gardens will be near at hand.\n",
        "TRANSLATION_15": "Reclining on furnishings lined with brocade, and the fruits of the two gardens are near at hand.\n",
        "TRANSLATION_16": "[They are] reclining on beds whose linings are of silk brocade, and the fruit of the two gardens is hanging low.\n",
        "TRANSLATION_17": "[55:54] [They will be] reclining (muttaki’īna is a circumstantial qualifier operated by an omitted [verb], that is to say, yatana‘‘amūna, they will enjoy bliss [while reclining]’) upon couches lined with [heavy] silk brocade, (istabraq) thick or coarse silk, the outer lining being of fine silk (sundus). And the fruits of both gardens will be near, so that it may be reached by the one standing up, the one sitting down or the one lying down.\n",
        "TRANSLATION_18": "Reclining upon couches) sitting in comfort upon couches (lined with silk brocade) their outside is made of thick silk brocade while their inside is of soft silk brocade, (the fruit of both Gardens near to hand.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "55:54",
            "56:53",
            "56:34",
            "47:6",
            "26:90",
            "37:66",
            "26:85",
            "2:82",
            "36:34",
            "15:45"
        ],
        "BIBLE": [
            "prophets:ezekiel:20:34",
            "writings:lamentations:5:12",
            "torah:leviticus:26:25",
            "writings:job:27:11",
            "prophets:micah:2:1",
            "prophets:amos:9:2",
            "writings:job:9:24",
            "prophets:hosea:2:12",
            "writings:job:10:7",
            "writings:song%20of%20songs:6:2"
        ]
    }
}