{
    "VERSE": "55:68",
    "ARABIC": "فِيهِمَا فَٰكِهَةٌ وَنَخْلٌ وَرُمَّانٌ",
    "ENGLISH": {
        "TRANSLATION_0": "In them are fruits and date-palms and pomegranates.",
        "TRANSLATION_1": "With fruits in them, and dates and pomegranates --\n",
        "TRANSLATION_2": "Therein will be fruits and dates and pomegranates.\n",
        "TRANSLATION_3": "In both gardens there will be fruits, palm-trees, and pomegranates\n",
        "TRANSLATION_4": "In them are fruits (of all kinds), and dates and pomegranate.\n",
        "TRANSLATION_5": "In them (both) will be fruits, and date palms and pomegranates.\n",
        "TRANSLATION_6": "In both are fruits and palms and pomegranates.\n",
        "TRANSLATION_7": "therein fruits, and palm-trees, and pomegranates --\n",
        "TRANSLATION_8": "Wherein is fruit, the date-palm and pomegranate.\n",
        "TRANSLATION_9": "In both of them there will be fruit trees and date-palms and pomegranates.\n",
        "TRANSLATION_10": "In which will be fruit, the date-palm and pomegranate.\n",
        "TRANSLATION_11": "In both of them will be fruits, date-palms and pomegranates.\n",
        "TRANSLATION_12": "In them will be Fruits, and dates and pomegranates:\n",
        "TRANSLATION_13": "In them (both) will be fruits, and date- palms and pomegranates.\n",
        "TRANSLATION_14": "In them are fruits, palm trees and pomegranates.\n",
        "TRANSLATION_15": "In them are fruits, and date-palms, and pomegranates.\n",
        "TRANSLATION_16": "In both of them are fruit and palm trees and pomegranates.\n",
        "TRANSLATION_17": "[55:68] In both of them will be fruits and date-palms and pomegranates, the [latter] two [fruits] being from among these [fruits of the two gardens]; but it is also said that they belong to [the fruits of] some other [garden].\n",
        "TRANSLATION_18": "(Wherein) in the two Gardens (is fruit) different kinds of fruit, (the date-palm) different kinds of palm- trees (and pomegranate) different kinds of pomegranate in both taste and shape.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "55:68",
            "55:11",
            "37:42",
            "36:57",
            "56:20",
            "23:19",
            "52:22",
            "44:55",
            "56:32",
            "77:42"
        ],
        "BIBLE": [
            "writings:ecclesiastes:2:5",
            "writings:song%20of%20songs:4:13",
            "writings:song%20of%20songs:6:11",
            "torah:deuteronomy:8:8",
            "prophets:haggai:2:19",
            "prophets:joel:1:12",
            "prophets:jeremiah:29:5",
            "writings:song%20of%20songs:6:7",
            "torah:leviticus:23:40",
            "prophets:micah:7:13"
        ]
    }
}