{
    "VERSE": "55:9",
    "ARABIC": "وَأَقِيمُوا۟ ٱلْوَزْنَ بِٱلْقِسْطِ وَلَا تُخْسِرُوا۟ ٱلْمِيزَانَ",
    "ENGLISH": {
        "TRANSLATION_0": "Give just weight - do not skimp in the balance.",
        "TRANSLATION_1": "And observe correct measure, weigh with justice, and not cheat the balance.\n",
        "TRANSLATION_2": "but weigh things equitably and skimp not in the balance.\n",
        "TRANSLATION_3": "Therefore, maintain just measure and do not transgress against the Balance.\n",
        "TRANSLATION_4": "And establish the measures justly, nor decrease the due weight.\n",
        "TRANSLATION_5": "And observe the weight with equity and do not make the balance deficient.\n",
        "TRANSLATION_6": "And keep up the balance with equity and do not make the measure deficient.\n",
        "TRANSLATION_7": "and weigh with justice, and skimp not in the Balance.)\n",
        "TRANSLATION_8": "But observe the measure strictly, nor fall short thereof.\n",
        "TRANSLATION_9": "Always measure with justice and do not give short measure.\n",
        "TRANSLATION_10": "And observe the weight with equity, and make not deficient the balance.\n",
        "TRANSLATION_11": "Maintain the weights with justice, and do not shorten the balance!’\n",
        "TRANSLATION_12": "So establish weight with justice and fall not short in the balance.\n",
        "TRANSLATION_13": "And observe the weight with equity and do not make the balance deficient.\n",
        "TRANSLATION_14": "Give just weight and do not skimp the scales.\n",
        "TRANSLATION_15": "But maintain the weights with justice, and do not violate the balance.\n",
        "TRANSLATION_16": "And establish weight in justice and do not make deficient the balance.\n",
        "TRANSLATION_17": "[55:9] And observe the weights with justice, fairly, and do not skimp the balance, [do not] decrease [the value of] what is being weighed.\n",
        "TRANSLATION_18": "(But observe the measure strictly) keep the balance of the scale justly; and it is also said that this means: observe your tongues by saying only the Truth, (nor fall short thereof) do not weigh less for the people such that you take away their rights.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "55:9",
            "26:182",
            "55:8",
            "11:85",
            "55:7",
            "101:8",
            "2:42",
            "75:29",
            "7:8",
            "21:47"
        ],
        "BIBLE": [
            "prophets:ii%20samuel:22:36",
            "torah:leviticus:10:17",
            "prophets:nahum:3:6",
            "prophets:hosea:2:14",
            "torah:leviticus:17:11",
            "writings:esther:4:8",
            "torah:numbers:8:19",
            "prophets:jeremiah:30:11",
            "torah:deuteronomy:26:13",
            "prophets:i%20kings:5:23"
        ]
    }
}