{
    "VERSE": "35:1",
    "ARABIC": "بِسْمِ ٱللَّهِ ٱلرَّحْمَٰنِ ٱلرَّحِيمِ ٱلْحَمْدُ لِلَّهِ فَاطِرِ ٱلسَّمَٰوَٰتِ وَٱلْأَرْضِ جَاعِلِ ٱلْمَلَٰٓئِكَةِ رُسُلًا أُو۟لِىٓ أَجْنِحَةٍ مَّثْنَىٰ وَثُلَٰثَ وَرُبَٰعَ يَزِيدُ فِى ٱلْخَلْقِ مَا يَشَآءُ إِنَّ ٱللَّهَ عَلَىٰ كُلِّ شَىْءٍ قَدِيرٌ",
    "ENGLISH": {
        "TRANSLATION_0": "Praise be to Allah, the Bringer into Being of the heavens and earth, He who made the angels messengers, with wings - two, three or four. He adds to creation in any way He wills. Allah has power over all things.",
        "TRANSLATION_1": "ALL PRAISE BE to God, the originator of the heavens and the earth, who appointed angels as His messengers, with wings, two, three and four. He adds what He pleases to His creation. He has certainly power over everything.\n",
        "TRANSLATION_2": "All praise be to Allah, the Fashioner of the heavens and earth, Who appointed angels as His message bearers, having two, three, four wings. He adds to His creation whatever He pleases. Verily Allah has power over everything.\n",
        "TRANSLATION_3": "All praise belongs to God, the creator of the heavens and the earth who has made the angels Messengers of two or three or four wings. He increases the creation as He wills. God has power over all things.\n",
        "TRANSLATION_4": "All praise is to Allah, the Maker of the heavens and the earth, Who assigns angels as messengers – who have pairs of two, three, four wings; He increases in creation whatever He wills; indeed Allah is Able to do all things.\n",
        "TRANSLATION_5": "All praise is due to Allah, Fatir of the heavens and the earth, Who made the angels messengers with wings, two or three or four. He increases in creation what He wills. Verily, Allah is Able to do all things.\n",
        "TRANSLATION_6": "All praise is due to Allah, the Originator of the heavens and the earth, the Maker of the angels, apostles flying on wings, two, and three, and four; He increases in creation what He pleases; surely Allah has power over all things.\n",
        "TRANSLATION_7": "Praise belongs to God, Originator of the heavens and earth, who appointed the angels to be messengers having wings two, three and four, increasing creation as He wills. Surely God is powerful over everything.\n",
        "TRANSLATION_8": "Praise be to Allah, the Creator of the heavens and the earth, Who appointeth the angels messengers having wings two, three and four. He multiplieth in creation what He will. Lo! Allah is Able to do all things.\n",
        "TRANSLATION_9": "All praise be to God, Creator of the heavens and the earth, who made the angels His messengers, with wings -- two, or three, or four pairs. He adds to His creation whatever He wills; for God has the power to will anything.\n",
        "TRANSLATION_10": "All praise Unto Allah, the Creator Of the heavens and the earth, the Appointer of the angels as His messengers, with wings of twos and threes and fours. He addeth in creation what soever He listeth Verily Allah is over everything Potent.\n",
        "TRANSLATION_11": "All praise belongs to Allah, originator of the heavens and the earth, maker of the angels [His] messengers, possessing wings, two, three or four [of them]. He adds to the creation whatever He wishes. Indeed Allah has power over all things.\n",
        "TRANSLATION_12": "Praise be to Allah, Who created (out of nothing) the heavens and the earth, Who made the angels, messengers with wings,- two, or three, or four (pairs): He adds to Creation as He pleases: for Allah has power over all things.\n",
        "TRANSLATION_13": "All the praises and thanks be to Allah, the (only) Originator [or the (only) Creator] of the heavens and the earth, Who made the angels messengers with wings, - two or three or four. He increases in creation what He wills. Verily, Allah is Able to do all things.\n",
        "TRANSLATION_14": "Praise belongs for Allah, the Originator of the heavens and earth, who appointed the angels to be Messengers, with wings, two, three, and four. He increases the creation as He wills. Allah has power over all things.\n",
        "TRANSLATION_15": "Praise be to God, Originator of the heavens and the earth, Maker of the angels messengers with wings—double, triple, and quadruple. He adds to creation as He wills. God is Able to do all things.\n",
        "TRANSLATION_16": "[All] praise is [due] to Allah, Creator of the heavens and the earth, [who] made the angels messengers having wings, two or three or four. He increases in creation what He wills. Indeed, Allah is over all things competent.\n",
        "TRANSLATION_17": "[35:1] Praise be to God, God praises Himself with in these [terms], as explained at the beginning of [the preceding] sūrat Saba’, Originator of the heavens and the earth, the One Who created them without any precedent, Appointer of the angels as messengers, to [His] prophets, having wings in [sets of] two or three or four. He multiplies in creation, in angels and other [creatures], what He will. Surely God has power over all things.\n",
        "TRANSLATION_18": "And from his narration on the authority of Ibn 'Abbas that he said upon explaining Allah's words: (Praise be to Allah): '(Praise be to Allah) He says: gratitude and favour belong to Allah, (the Creator of the heavens and the earth, who appointeth the angels) Who created and honoured the angels and made them (messengers) i.e. He sends them with a message to His created beings; this refers to Gabriel, Michael, Seraphiel, the angel of death, thunder and the Guardian angels (having wings) i.e. the angels have wings (two, three and four) wings with which to fly. (He multiplieth in creation) in the creation of angels (what He will) it is also said that in those wings are what He wills; and it is also said: whomever He wills is in good fortune; and it is said that this means: whomsoever He wills has a good voice. (Lo! Allah is Able to do all things) of increase and decrease.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "35:1",
            "64:1",
            "5:120",
            "3:189",
            "5:40",
            "57:2",
            "4:126",
            "3:29",
            "85:9",
            "46:33"
        ],
        "BIBLE": [
            "torah:genesis:1:1",
            "writings:nehemiah:9:6",
            "prophets:jeremiah:14:22",
            "torah:genesis:1:28",
            "writings:daniel:9:27",
            "prophets:isaiah:65:17",
            "torah:leviticus:11:42",
            "torah:genesis:6:7",
            "prophets:jeremiah:10:12",
            "torah:genesis:26:4"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:3:3",
            
            "Sefer%20Yetzirah:1:11"
        ]
    }
}