{
    "VERSE": "35:10",
    "ARABIC": "مَن كَانَ يُرِيدُ ٱلْعِزَّةَ فَلِلَّهِ ٱلْعِزَّةُ جَمِيعًا إِلَيْهِ يَصْعَدُ ٱلْكَلِمُ ٱلطَّيِّبُ وَٱلْعَمَلُ ٱلصَّٰلِحُ يَرْفَعُهُۥ وَٱلَّذِينَ يَمْكُرُونَ ٱلسَّيِّـَٔاتِ لَهُمْ عَذَابٌ شَدِيدٌ وَمَكْرُ أُو۟لَٰٓئِكَ هُوَ يَبُورُ",
    "ENGLISH": {
        "TRANSLATION_0": "If anyone wants power, all power belongs to Allah. All good words rise to Him and virtuous deeds elevate them. But people who plot evil deeds will suffer a harsh punishment. The plotting of such people is profitless.",
        "TRANSLATION_1": "Whosoever desires honour (should remember) that all honour is with God. All good words ascend to Him, and all good deeds He exalts. As for those who are plotting evil, there is severe punishment for them, and their plots will be fruitless.\n",
        "TRANSLATION_2": "He who seeks glory, let him know that all glory belongs to Allah alone. To Him do good words go up, and righteous action uplifts them. But those who contrive evil deeds, a severe punishment lies in store for them, and their contriving will come to naught.\n",
        "TRANSLATION_3": "Whoever seeks honor should know that all honor belongs to God. Good words (worship) will be presented before Him and He will accept good deeds. Those who make evil plans will suffer intense torment. Their evil plans are doomed to destruction.\n",
        "TRANSLATION_4": "Whoever desires honour – therefore all honour belongs to Allah!* Towards Him only ascends the pure good speech, and He raises high the pious deed; and for those who conspire evil is a severe punishment; and their own conspiracy will be destroyed. (It is Allah Who bestows honour, to whomever He wills.)\n",
        "TRANSLATION_5": "Whosoever desires Al-`Izzah then to Allah belongs Al-`Izzah. To Him ascend the good words, and the righteous deeds exalt it, but those who plot evils, theirs will be a severe torment. And the plotting of such will perish.\n",
        "TRANSLATION_6": "Whoever desires honor, then to Allah belongs the honor wholly. To Him do ascend the good words; and the good deeds, lift them up, and (as for) those who plan evil deeds, they shall have a severe chastisement; and (as for) their plan, it shall perish.\n",
        "TRANSLATION_7": "Whosoever desires glory, the glory altogether belongs to God. To Him good words go up, and the righteous deed -- He uplifts it; but those who devise evil deeds -- theirs shall be a terrible chastisement, and their devising shall come to naught.\n",
        "TRANSLATION_8": "Whoso desireth power (should know that) all power belongeth to Allah. Unto Him good words ascend, and the pious deed doth He exalt; but those who plot iniquities, theirs will be an awful doom; and the plotting of such (folk) will come to naught.\n",
        "TRANSLATION_9": "If anyone seeks glory, let him know that glory belongs to God alone. Good words ascend to Him and righteous deeds are exalted by Him. Those who plot evil deeds shall be sternly punished and their plotting will come to nothing.\n",
        "TRANSLATION_10": "Whosoever desireth glory, then all glory is Allah's; unto Him mount up the goodly words; and the righteous works exalteth it. And those who plot evils,--theirs shall be a torment severe; and the plotting of those!--it shall perish.\n",
        "TRANSLATION_11": "Whoever seeks honour [should know that] honour entirely belongs to Allah. To Him ascends the good word, and He elevates righteous conduct; as for those who devise evil schemes, there is a severe punishment for them, and their plotting shall come to naught.\n",
        "TRANSLATION_12": "If any do seek for glory and power,- to Allah belong all glory and power. To Him mount up (all) Words of Purity: It is He Who exalts each Deed of Righteousness. Those that lay Plots of Evil,- for them is a Penalty terrible; and the plotting of such will be void (of result).\n",
        "TRANSLATION_13": "Whosoever desires honour, power and glory then to Allah belong all honour, power and glory [and one can get honour, power and glory only by obeying and worshipping Allah (Alone)]. To Him ascend (all) the goodly words, and the righteous deeds exalt it (the goodly words i.e. the goodly words are not accepted by Allah unless and until they are followed by good deeds), but those who plot evils, theirs will be severe torment. And the plotting of such will perish.\n",
        "TRANSLATION_14": "He who wants might, the Might belongs to Allah altogether. To Him ascend good words, and the righteous deed He raises. But those who devise evil deeds theirs shall be a terrible punishment, and their plotting shall be annulled.\n",
        "TRANSLATION_15": "Whoever desires honor—all honor belongs to God. To Him ascends speech that is pure, and He elevates righteous conduct. As for those who plot evil, a terrible punishment awaits them, and the planning of these will fail.\n",
        "TRANSLATION_16": "Whoever desires honor [through power] - then to Allah belongs all honor. To Him ascends good speech, and righteous work raises it. But they who plot evil deeds will have a severe punishment, and the plotting of those - it will perish.\n",
        "TRANSLATION_17": "[35:10] Whoever desires glory [should know that] all glory belongs to God, in this world and in the Hereafter, and it cannot be obtained from Him except through obedience to Him, so let such [a one] be obedient to Him. To Him ascends good words, that is to say, He is aware of such [good words], and these are [statements such as] ‘there is no god except God’ and the like; and as for righteous action, He exalts it, He accepts it; but those who plot evil, schemes against the Prophet — [as was the case] at the council assembly, in the way of imprisoning him, killing him or expelling him, as mentioned in [sūrat] al-Anfāl [Q. 8:30] — theirs shall be a severe chastisement and their plotting shall come to nothing: it shall be ruined.\n",
        "TRANSLATION_18": "(Whoso desireth power) i.e. whoever desires to know to whom belongs power, might and invincibility, ((should know that) all power belongeth to Allah) as belongs to Him might and invincibility. (Unto Him good words) the expression \"there is no deity save Allah\" (ascend, and the pious deed doth He exalt) He accepts pious deeds through the profession of \"there is no deity except Allah\"; (but those who plot iniquities) those who associate partners with Allah; it is also said this means: those who scheme to expel, imprison or assassinate Muhammad (pbuh) in Dar al-Nadwah, (theirs will be an awful doom) as awful as can be; (and the plotting of such (folk)) i.e. Abu Jahl and his host (will come to naught) will not succeed. It is also said that this verse was revealed about the people who deal with usury.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "35:10",
            "40:45",
            "41:27",
            "65:10",
            "14:2",
            "58:15",
            "50:26",
            "2:165",
            "3:4",
            "10:65"
        ],
        "BIBLE": [
            "writings:daniel:2:9",
            "torah:exodus:34:10",
            "prophets:i%20samuel:2:8",
            "writings:ii%20chronicles:5:13",
            "prophets:isaiah:49:11",
            "writings:psalms:71:16",
            "prophets:isaiah:32:6",
            "torah:deuteronomy:9:3",
            "torah:numbers:14:30",
            "writings:job:10:2"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:2:4"
        ]
    }
}