{
    "VERSE": "35:11",
    "ARABIC": "وَٱللَّهُ خَلَقَكُم مِّن تُرَابٍ ثُمَّ مِن نُّطْفَةٍ ثُمَّ جَعَلَكُمْ أَزْوَٰجًا وَمَا تَحْمِلُ مِنْ أُنثَىٰ وَلَا تَضَعُ إِلَّا بِعِلْمِهِۦ وَمَا يُعَمَّرُ مِن مُّعَمَّرٍ وَلَا يُنقَصُ مِنْ عُمُرِهِۦٓ إِلَّا فِى كِتَٰبٍ إِنَّ ذَٰلِكَ عَلَى ٱللَّهِ يَسِيرٌ",
    "ENGLISH": {
        "TRANSLATION_0": "Allah created you from dust and then from a drop of sperm and then made you into pairs. No female becomes pregnant or gives birth except with His knowledge. And no living thing lives long or has its life cut short without that being in a Book. That is easy for Allah.",
        "TRANSLATION_1": "It is God who created you from dust, then from a sperm, then formed you into pairs. Neither does a female conceive nor gives birth without His knowledge; nor do the old grow older or become younger in years but in accordance with the law (of nature). Indeed the law of God works inevitably.\n",
        "TRANSLATION_2": "Allah created you from dust, then from a drop of sperm, then He made you into pairs. No female conceives, nor delivers (a child) except with His knowledge. None is given a long life nor is any diminished in his life but it is written in a Book. Surely that is quite easy for Allah.\n",
        "TRANSLATION_3": "God created you from clay which He then turned into a living germ and made you into pairs. No female conceives or delivers without His knowledge. No one grows older nor can anything be reduced from one's life without having its record in the Book. This is not at all difficult for God.\n",
        "TRANSLATION_4": "And Allah created you from clay, then a drop of liquid, then made you as couples; and no female conceives or gives birth except with His knowledge; and every aged being that is given the age, and every one whose life is kept short – all this is in a Book; indeed this is easy for Allah.\n",
        "TRANSLATION_5": "And Allah did create you from dust, then from Nutfah, then He made you pairs. And no female conceives or gives birth but with His knowledge. And no aged man is granted a length of life nor is a part cut off from his life, but is in a Book. Surely, that is easy for Allah.\n",
        "TRANSLATION_6": "And Allah created you of dust, then of the life-germ, then He made you pairs; and no female bears, nor does she bring forth, except with His knowledge; and no one whose life is lengthened has his life lengthened, nor is aught diminished of one's life, but it is all in a book; surely this is easy to Allah.\n",
        "TRANSLATION_7": "God created you of dust then of a sperm-drop, then He made you pairs. No female bears or brings forth, save with His knowledge; and none is given long life who is given long life neither is any diminished in his life, but it is in a Book. Surely that is easy for God.\n",
        "TRANSLATION_8": "Allah created you from dust, then from a little fluid, then He made you pairs (the male and female). No female beareth or bringeth forth save with His knowledge. And no-one groweth old who groweth old, nor is aught lessened of his life, but it is recorded in a Book, Lo! that is easy for Allah.\n",
        "TRANSLATION_9": "God has created you from dust, then from a drop of semen and then divided you into pairs; no female conceives or gives birth without His knowledge; and no one's life is prolonged or shortened, but it is recorded in a Book. That surely is easy for God.\n",
        "TRANSLATION_10": "And Allah created you of dust, then of a seed; then He made you pairs. No female beareth or bringeth forth but with His knowledge. And no aged man growth old, nor is aught diminished of his life, but it is in a Book; verily for Allah that is easy.\n",
        "TRANSLATION_11": "Allah created you from dust, then from a drop of [seminal] fluid, then He made you mates. No female conceives or delivers except with His knowledge, and no elderly person advances in years, nor is anything diminished of his life, but it is [recorded] in a Book. That is indeed easy for Allah.\n",
        "TRANSLATION_12": "And Allah did create you from dust; then from a sperm-drop; then He made you in pairs. And no female conceives, or lays down (her load), but with His knowledge. Nor is a man long-lived granted length of days, nor is a part cut off from his life, but is in a Decree (ordained). All this is easy to Allah.\n",
        "TRANSLATION_13": "And Allah did create you (Adam) from dust, then from Nutfah (male and female discharge semen drops i.e. Adam's offspring), then He made you pairs (male and female). And no female conceives or gives birth, but with His Knowledge. And no aged man is granted a length of life, nor is a part cut off from his life (or another man's life), but is in a Book (AlLauh AlMahfuz) Surely, that is easy for Allah.\n",
        "TRANSLATION_14": "Allah created you from dust, then from a (sperm) drop. Then he made you pairs. No female conceives or is delivered except by His Knowledge. He whose life is long, whatsoever is increased or decreased of his age is in a Clear Book. Surely, that is easy for Allah.\n",
        "TRANSLATION_15": "God created you from dust, then from a small drop; then He made you pairs. No female conceives, or delivers, except with His knowledge. No living thing advances in years, or its life is shortened, except it be in a Record. That is surely easy for God.\n",
        "TRANSLATION_16": "And Allah created you from dust, then from a sperm-drop; then He made you mates. And no female conceives nor does she give birth except with His knowledge. And no aged person is granted [additional] life nor is his lifespan lessened but that it is in a register. Indeed, that for Allah is easy.\n",
        "TRANSLATION_17": "[35:11] And God created you from dust, by having created your father Adam from it, then from a drop of [seminal] fluid, in other words, from sperm, by creating his seed from it; then He made you pairs, males and females. And no female bears or brings forth except with His knowledge (illā bi-‘ilmihi is a circumstantial qualifier, in other words, ‘[except] that it is known by Him’) and no long-living person is given long life, in other words, the life of none is increased for one who has a long life, nor is anything diminished of his life, in other words, [of the life of] that same long-living person or some other long-living person, but it is [recorded] in a Book, namely, the Preserved Tablet. Surely that is easy for God.\n",
        "TRANSLATION_18": "(Allah created you from dust) He created you from Adam and Adam is from dust, (then from a little fluid) the sperm drops of your fathers, (then He made you pairs (the male and female). No female beareth) a child (or bringeth forth) gives birth after the full period of pregnancy or prematurely (save with His knowledge) save with the knowledge and command of Allah. (And no one groweth old who groweth old, nor is aught lessened of his life, but it is recorded in a Book) except that it is recorded in the Guarded Tablet. (Lo! That) recording that (is easy for Allah) even without writing.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "35:11",
            "57:22",
            "22:70",
            "33:6",
            "22:8",
            "31:20",
            "30:56",
            "4:127",
            "4:24",
            "35:29"
        ],
        "BIBLE": [
            "writings:ecclesiastes:8:8",
            "writings:ecclesiastes:8:15",
            "prophets:i%20samuel:11:3",
            "torah:numbers:31:47",
            "prophets:ezekiel:3:20",
            "prophets:i%20samuel:4:19",
            "prophets:joshua:1:8",
            "writings:ecclesiastes:5:17",
            "writings:job:29:21",
            "torah:exodus:21:29"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:8",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:3:5",
            "Sefer%20Yetzirah:4:5"
        ]
    }
}