{
    "VERSE": "35:15",
    "ARABIC": "يَٰٓأَيُّهَا ٱلنَّاسُ أَنتُمُ ٱلْفُقَرَآءُ إِلَى ٱللَّهِ وَٱللَّهُ هُوَ ٱلْغَنِىُّ ٱلْحَمِيدُ",
    "ENGLISH": {
        "TRANSLATION_0": "Mankind! you are the poor in need of Allah whereas Allah is the Rich Beyond Need, the Praiseworthy.",
        "TRANSLATION_1": "O men, it is you who stand in need of God. As for God, He is above all need, worthy of praise.\n",
        "TRANSLATION_2": "O people, it is you who stand in need of Allah; as for Allah, He is Self-Sufficient, Immensely Praiseworthy.\n",
        "TRANSLATION_3": "People, you are always in need of God and God is Self-sufficient and Praiseworthy.\n",
        "TRANSLATION_4": "O people! You are dependant on Allah; and Allah only is the Independent (Absolute, Not Needing Anything), the Most Praiseworthy.\n",
        "TRANSLATION_5": "O mankind! it is you who stand in need of Allah. But Allah is the Rich, Worthy of all praise.\n",
        "TRANSLATION_6": "O men! you are they who stand in need of Allah, and Allah is He Who is the Self-sufficient, the Praised One.\n",
        "TRANSLATION_7": "O men, you are the ones that have need of God; He is the All-sufficient, the All-laudable.\n",
        "TRANSLATION_8": "O mankind! Ye are the poor in your relation to Allah. And Allah! He is the Absolute, the Owner of Praise.\n",
        "TRANSLATION_9": "O men! It is you who stand in need of God -- God is self-sufficient, and praiseworthy --\n",
        "TRANSLATION_10": "O mankind! ye are needers Unto Allah, and Allah! He is the Selfsufficient, the Praiseworthy\n",
        "TRANSLATION_11": "O mankind! You are the ones who stand in need of Allah, and Allah—He is the All-sufficient, the All-laudable.\n",
        "TRANSLATION_12": "O ye men! It is ye that have need of Allah: but Allah is the One Free of all wants, worthy of all praise.\n",
        "TRANSLATION_13": "O mankind! it is you who stand in need of Allah, but Allah is Rich (Free of all wants and needs), Worthy of all praise.\n",
        "TRANSLATION_14": "People, it is you who are in need of Allah. He is the Rich, the Praised.\n",
        "TRANSLATION_15": "O people! It is you who are the poor, in need of God; while God is the Rich, the Praiseworthy.\n",
        "TRANSLATION_16": "O mankind, you are those in need of Allah, while Allah is the Free of need, the Praiseworthy.\n",
        "TRANSLATION_17": "[35:15] O mankind! You are the ones who are in need of God, in every state. And God, He is the Independent, [without any need] of His creatures, the Praised, the One Who is praised in whatever He does with them.\n",
        "TRANSLATION_18": "(0 mankind! Ye are the poor in your relation to Allah) in relation to His forgiveness, mercy, provision and well-being in the life of this world and to His Paradise in the Hereafter. (And Allah! He is the Absolute) He is free of need for what you have of wealth, (the Owner of Praise) He is praiseworthy in His acts.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "35:15",
            "57:24",
            "31:26",
            "22:64",
            "2:199",
            "2:267",
            "114:3",
            "14:8",
            "31:12",
            "64:6"
        ],
        "BIBLE": [
            "writings:psalms:75:2",
            "writings:ii%20chronicles:20:7",
            "writings:ii%20chronicles:10:16",
            "torah:leviticus:25:26",
            "prophets:jeremiah:26:16",
            "torah:genesis:34:22",
            "prophets:isaiah:7:13",
            "writings:proverbs:30:2",
            "writings:psalms:68:8",
            "torah:deuteronomy:22:5"
        ]
    }
}