{
    "VERSE": "35:16",
    "ARABIC": "إِن يَشَأْ يُذْهِبْكُمْ وَيَأْتِ بِخَلْقٍ جَدِيدٍ",
    "ENGLISH": {
        "TRANSLATION_0": "If He wills He can dispense with you and bring about a new creation.",
        "TRANSLATION_1": "He could take you away if He pleased and bring a new creation (in your place).\n",
        "TRANSLATION_2": "If He wishes, He can remove you and put in your place a new creation.\n",
        "TRANSLATION_3": "He could replace you by a new creation if He decided to.\n",
        "TRANSLATION_4": "If He wills, He can take you away and bring other creatures.\n",
        "TRANSLATION_5": "If He willed, He could destroy you and bring about a new creation.\n",
        "TRANSLATION_6": "If He please, He will take you off and bring a new generation.\n",
        "TRANSLATION_7": "If He will, He can put you away and bring a new creation;\n",
        "TRANSLATION_8": "If He will, He can be rid of you and bring (instead of you) some new creation.\n",
        "TRANSLATION_9": "if He so wished, He could take you away and replace you with a new creation;\n",
        "TRANSLATION_10": "If He will, He can take you away and bring about a new creation.\"\n",
        "TRANSLATION_11": "If He wishes, He will take you away, and bring about a new creation;\n",
        "TRANSLATION_12": "If He so pleased, He could blot you out and bring in a New Creation.\n",
        "TRANSLATION_13": "If He will, He could destroy you and bring about a new creation.\n",
        "TRANSLATION_14": "He can put you away, if He will, and bring a new creation\n",
        "TRANSLATION_15": "If He wills, He can do away with you, and produce a new creation.\n",
        "TRANSLATION_16": "If He wills, He can do away with you and bring forth a new creation.\n",
        "TRANSLATION_17": "[35:16] If He will, He can take you away and bring about a new creation, instead of you.\n",
        "TRANSLATION_18": "(If He will, He can be rid of you) He can destroy you, people of Mecca (and bring (instead of you) some new creation) who are better and more obedient than you.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "35:16",
            "14:19",
            "34:7",
            "32:10",
            "50:15",
            "17:49",
            "17:98",
            "13:5",
            "30:11",
            "36:68"
        ],
        "BIBLE": [
            "torah:exodus:23:20",
            "prophets:isaiah:6:12",
            "prophets:joshua:3:3",
            "torah:genesis:19:13",
            "torah:deuteronomy:26:2",
            "writings:lamentations:3:10",
            "writings:job:40:12",
            "prophets:isaiah:46:7",
            "prophets:jeremiah:29:14",
            "prophets:ezekiel:6:3"
        ]
    }
}