{
    "VERSE": "35:22",
    "ARABIC": "وَمَا يَسْتَوِى ٱلْأَحْيَآءُ وَلَا ٱلْأَمْوَٰتُ إِنَّ ٱللَّهَ يُسْمِعُ مَن يَشَآءُ وَمَآ أَنتَ بِمُسْمِعٍ مَّن فِى ٱلْقُبُورِ",
    "ENGLISH": {
        "TRANSLATION_0": "The living and dead are not the same. Allah makes anyone He wills hear but you cannot make those in the grave hear.",
        "TRANSLATION_1": "Equal are not the living and the dead. Verily God makes those He will to listen; but you cannot make those hear who are in their graves.\n",
        "TRANSLATION_2": "nor are the living and the dead alike. Allah makes to hear whomsoever He wishes, but you, (O Prophet), cannot cause to hear those who are in their graves.\n",
        "TRANSLATION_3": "nor are the living and the dead. God makes to listen whomever He wants. (Muhammad), you cannot make people in the graves to listen.\n",
        "TRANSLATION_4": "And not equal are the living and the dead! Indeed Allah causes them to listen*, whomever He wills; and you cannot make those who are in the graves** listen. (* Listen to guidance **The disbelievers are referred to as dead, whose fates are sealed.)\n",
        "TRANSLATION_5": "Nor are the living and the dead. Verily, Allah makes whom He wills to hear, but you cannot make hear those who are in graves.\n",
        "TRANSLATION_6": "Neither are the living and the dead alike. Surely Allah makes whom He pleases hear, and you cannot make those hear who are in the graves.\n",
        "TRANSLATION_7": "not equal are the living and the dead. God makes to hear whomsoever He will; thou canst not make those in their tombs to hear -\n",
        "TRANSLATION_8": "Nor are the living equal with the dead. Lo! Allah maketh whom He will to hear. Thou canst not reach those who are in the graves.\n",
        "TRANSLATION_9": "nor are the living and the dead. God causes whom He will to hear Him, but you cannot make those who are in their graves hear you.\n",
        "TRANSLATION_10": "Nor alike are the living and the dead. Verily Allah maketh whomsoever He listeth to hear and thou canst not make them hear who are in the graves.\n",
        "TRANSLATION_11": "nor are the living equal to the dead. Indeed Allah makes whomever He wishes to hear, and you cannot make those who are in the graves hear you.\n",
        "TRANSLATION_12": "Nor are alike those that are living and those that are dead. Allah can make any that He wills to hear; but thou canst not make those to hear who are (buried) in graves.\n",
        "TRANSLATION_13": "Nor are (alike) the living (believers) and the dead (disbelievers). Verily, Allah makes whom He will hear, but you cannot make hear those who are in graves.\n",
        "TRANSLATION_14": "nor are the living and the dead equal. Allah makes to hear whosoever He will, but you cannot make those who are in their graves hear.\n",
        "TRANSLATION_15": "Nor are equal the living and the dead. God causes whomever He wills to hear, but you cannot make those in the graves hear.\n",
        "TRANSLATION_16": "And not equal are the living and the dead. Indeed, Allah causes to hear whom He wills, but you cannot make hear those in the graves.\n",
        "TRANSLATION_17": "[35:22] nor are the living equal to the dead, the believers and the disbelievers [respectively] (the addition of the particle lā, ‘nor’, in all three instances is for emphasis). Indeed God makes to hear whomever He will, to be guided, so that such [a person] then responds to Him by embracing faith. But you cannot make those who are in the graves to hear, namely, the disbelievers — whom He has likened to the dead — [to hear] and so respond.\n",
        "TRANSLATION_18": "(Nor are the living equal with the dead) nor are the believers equal with the disbelievers in relation to obedience and honour. (Lo! Allah maketh whom He will) whoever deserves it (to hear) to understand. (Thou canst not reach) you cannot make understand (those who are in the graves) those who are as if dead and buried in the graves.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "35:22",
            "22:7",
            "2:154",
            "6:36",
            "6:95",
            "28:56",
            "2:73",
            "16:105",
            "14:42",
            "10:31"
        ],
        "BIBLE": [
            "writings:i%20chronicles:17:22",
            "prophets:jeremiah:7:16",
            "writings:psalms:71:12",
            "torah:deuteronomy:4:10",
            "writings:job:22:27",
            "writings:psalms:66:8",
            "writings:psalms:70:6",
            "prophets:i%20samuel:12:22",
            "torah:exodus:34:17",
            "prophets:ezekiel:20:31"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:1:14",
            "Sefer%20Yetzirah:3:2"
        ]
    }
}