{
    "VERSE": "35:26",
    "ARABIC": "ثُمَّ أَخَذْتُ ٱلَّذِينَ كَفَرُوا۟ فَكَيْفَ كَانَ نَكِيرِ",
    "ENGLISH": {
        "TRANSLATION_0": "Then I seized hold of those who were kafir and how absolute was My rejection!",
        "TRANSLATION_1": "So We seized the unbelievers. How great was the change I wrought in their condition then!\n",
        "TRANSLATION_2": "Then I seized those who denied the Truth, and how terrible was My punishment!\n",
        "TRANSLATION_3": "so I seized the unbelievers and how terrible was their torment.\n",
        "TRANSLATION_4": "Then I seized the disbelievers; so how did denial My rejection turn out?\n",
        "TRANSLATION_5": "Then I took hold of those who disbelieved, and how terrible was My denial!\n",
        "TRANSLATION_6": "Then did I punish those who disbelieved, so how was the manifestation of My disapproval?\n",
        "TRANSLATION_7": "then I seized the unbelievers, and how was My horror!\n",
        "TRANSLATION_8": "Then seized I those who disbelieved, and how intense was My abhorrence!\n",
        "TRANSLATION_9": "but in the end I seized those who were bent on denying the truth and how terrible was My punishment.\n",
        "TRANSLATION_10": "Then I took hold of those who disbelieved. So how terrible was My disapproval!\n",
        "TRANSLATION_11": "Then I seized the faithless. So how was My rebuttal!\n",
        "TRANSLATION_12": "In the end did I punish those who rejected Faith: and how (terrible) was My rejection (of them)!\n",
        "TRANSLATION_13": "Then I took hold of those who disbelieved, and how terrible was My denial (punishment)!\n",
        "TRANSLATION_14": "Then I seized those who disbelieved, and how was My rejection!\n",
        "TRANSLATION_15": "Then I seized those who disbelieved—so how was My rejection?\n",
        "TRANSLATION_16": "Then I seized the ones who disbelieved, and how [terrible] was My reproach.\n",
        "TRANSLATION_17": "[35:26] Then I seized those who disbelieved, for their denial, and how was My abhorrence!, [how was] My rebuttal   against them by way of punishment and destruction, in other words, it was appropriate.\n",
        "TRANSLATION_18": "(Then seized I) then I punished (those who disbelieved) in the Scriptures and messengers, (and how intense was My abhorrence!) see, Muhammad, how I turned against them with chastisement when they rejected faith.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "35:26",
            "22:44",
            "67:18",
            "74:20",
            "34:45",
            "6:24",
            "54:21",
            "54:16",
            "54:30",
            "13:32"
        ],
        "BIBLE": [
            "prophets:ii%20samuel:1:11",
            "prophets:jeremiah:49:24",
            "prophets:ii%20samuel:13:11",
            "prophets:jeremiah:51:41",
            "writings:psalms:48:7",
            "prophets:jeremiah:32:11",
            "prophets:jeremiah:8:21",
            "prophets:judges:19:29",
            "writings:psalms:119:53",
            "writings:job:30:16"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:13",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:2:6",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:4:6"
        ]
    }
}