{
    "VERSE": "35:28",
    "ARABIC": "وَمِنَ ٱلنَّاسِ وَٱلدَّوَآبِّ وَٱلْأَنْعَٰمِ مُخْتَلِفٌ أَلْوَٰنُهُۥ كَذَٰلِكَ إِنَّمَا يَخْشَى ٱللَّهَ مِنْ عِبَادِهِ ٱلْعُلَمَٰٓؤُا۟ إِنَّ ٱللَّهَ عَزِيزٌ غَفُورٌ",
    "ENGLISH": {
        "TRANSLATION_0": "And mankind and beasts and livestock are likewise of varying colours. Only those of His slaves with knowledge have fear of Allah. Allah is Almighty, Ever-Forgiving.",
        "TRANSLATION_1": "And so are among men, beasts and cattle, different shades. Only those of His creatures fear God who have knowledge. Verily He is all-mighty and forgiving.\n",
        "TRANSLATION_2": "and human beings too, and beasts, and cattle -- diverse are their hues. From among His servants, it is only those who know that fear Allah. Verily Allah is Most Mighty, Most Forgiving.\n",
        "TRANSLATION_3": "He has also created people, beasts, and cattle of various colors. Only God's knowledgeable servants fear Him. God is Majestic and All-pardoning.\n",
        "TRANSLATION_4": "And similarly the colours of men and beasts and cattle, are different; among the bondmen of Allah, only the people of knowledge fear Him; indeed Allah is the Most Honourable, Oft Forgiving.\n",
        "TRANSLATION_5": "And likewise, men and moving creature and cattle are of various colors. It is only those among His servants who have knowledge that fear Allah. Verily, Allah is Almighty, Oft-Forgiving.\n",
        "TRANSLATION_6": "And of men and beasts and cattle are various species of it likewise; those of His servants only who are possessed of knowledge fear Allah; surely Allah is Mighty, Forgiving.\n",
        "TRANSLATION_7": "men too, and beasts and cattle -- diverse are their hues. Even so only those of His servants fear God who have knowledge; surely God is All-mighty, All-forgiving.\n",
        "TRANSLATION_8": "And of men and beasts and cattle, in like manner, divers hues? The erudite among His bondmen fear Allah alone. Lo! Allah is Mighty, Forgiving.\n",
        "TRANSLATION_9": "in like manner, men, beasts, and cattle have their diverse hues too. Only those of His servants, who possess knowledge, fear God. God is almighty and most forgiving.\n",
        "TRANSLATION_10": "And of men and beasts and cattle, likewise of diverse colours. Those only of His bondmen who have knowledge fear Allah Verily Allahis the Mighty, the Forgiving.\n",
        "TRANSLATION_11": "And of humans and beasts and cattle there are likewise diverse hues. Only those of Allah’s servants having knowledge fear Him. Indeed Allah is all-mighty, all-forgiving.\n",
        "TRANSLATION_12": "And so amongst men and crawling creatures and cattle, are they of various colours. Those truly fear Allah, among His Servants, who have knowledge: for Allah is Exalted in Might, Oft-Forgiving.\n",
        "TRANSLATION_13": "And of men and AdDawab (moving living creatures, beasts, etc.), and cattle, in like manner of various colours. It is only those who have knowledge among His slaves that fear Allah. Verily, Allah is AllMighty, OftForgiving.\n",
        "TRANSLATION_14": "People too, and beasts and cattle have their different colors. But it is only those amongst His worshippers that fear Allah who have knowledge. Indeed, Allah is the Almighty and the Forgiving.\n",
        "TRANSLATION_15": "Likewise, human beings, animals, and livestock come in various colors. From among His servants, the learned fear God. God is Almighty, Oft-Forgiving.\n",
        "TRANSLATION_16": "And among people and moving creatures and grazing livestock are various colors similarly. Only those fear Allah, from among His servants, who have knowledge. Indeed, Allah is Exalted in Might and Forgiving.\n",
        "TRANSLATION_17": "[35:28] And of humans and beasts and cattle, there are diverse hues likewise, like the diversity of the [hues of] fruits and mountains. Indeed only those of God’s servants who have knowledge fear Him, in contrast to the ignorant, such as the disbelievers of Mecca. Truly God is Mighty, in His kingdom, Forgiving, of the sins of His faithful servants.\n",
        "TRANSLATION_18": "(And of men) there are also different colours (and beasts) there are different kinds of beasts (and cattle, in like manner, diverse hues) there are different kinds of cattle? (The erudite among His bondsmen fear Allah alone) He says: from among all His servants, it is the erudite who fears Allah. (Lo! Allah is Mighty) in His dominion and kingdom, (Forgiving) He forgives whoever believes in Him.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "35:28",
            "40:42",
            "2:199",
            "2:207",
            "35:45",
            "35:2",
            "29:60",
            "29:62",
            "33:63",
            "42:19"
        ],
        "BIBLE": [
            "prophets:joshua:4:24",
            "writings:esther:4:11",
            "writings:ecclesiastes:3:14",
            "writings:job:9:2",
            "prophets:isaiah:51:7",
            "prophets:isaiah:5:13",
            "writings:i%20chronicles:29:2",
            "writings:i%20chronicles:28:21",
            "writings:daniel:5:21",
            "writings:ruth:3:11"
        ]
    }
}