{
    "VERSE": "35:32",
    "ARABIC": "ثُمَّ أَوْرَثْنَا ٱلْكِتَٰبَ ٱلَّذِينَ ٱصْطَفَيْنَا مِنْ عِبَادِنَا فَمِنْهُمْ ظَالِمٌ لِّنَفْسِهِۦ وَمِنْهُم مُّقْتَصِدٌ وَمِنْهُمْ سَابِقٌۢ بِٱلْخَيْرَٰتِ بِإِذْنِ ٱللَّهِ ذَٰلِكَ هُوَ ٱلْفَضْلُ ٱلْكَبِيرُ",
    "ENGLISH": {
        "TRANSLATION_0": "Then We made Our chosen slaves inherit the Book. But some of them wrong themselves; some are ambivalent; and some outdo each other in good by Allah's permission. That is the great favour.",
        "TRANSLATION_1": "So We made those of Our creatures whom We had chosen, heirs to the Book; but some of these exceed themselves, and some follow the middle course, and some surpass others in goodness by God's will, which is the greatest blessing.\n",
        "TRANSLATION_2": "Then We bequeathed the Book to those of Our servants that We chose. Now, some of them wrong themselves and some follow the medium course; and some, by Allah's leave, vie with each other in acts of goodness. That is the great bounty.\n",
        "TRANSLATION_3": "We gave the Book as an inheritance to Our chosen servants, among whom some are unjust against their souls, some are moderate, and some are exceedingly virtuous by the permission of God. This is indeed a great favor.\n",
        "TRANSLATION_4": "We then made Our chosen bondmen the inheritors of the Book; so among them is one who wrongs himself; and among them is one who stays on the middle course; and among them is one who, by the command of Allah, surpassed others in good deeds; this is the great favour!\n",
        "TRANSLATION_5": "Then We gave the Book as inheritance to such of Our servants whom We chose. Then of them are some who wrong themselves, and of them are some who follow a middle course, and of them are some who are, by Allah's leave, foremost in good deeds. That -- that is indeed a great grace.\n",
        "TRANSLATION_6": "Then We gave the Book for an inheritance to those whom We chose from among Our servants; but of them is he who makes his soul to suffer a loss, and of them is he who takes a middle course, and of them is he who is foremost in deeds of goodness by Allah's permission; this is the great excellence.\n",
        "TRANSLATION_7": "Then We bequeathed the Book on those of Our servants We chose; but of them some wrong themselves, some of them are lukewarm, and some are outstrippers in good works by the leave of God; that is the great bounty.\n",
        "TRANSLATION_8": "Then We gave the Scripture as inheritance unto those whom We elected of Our bondmen. But of them are some who wrong themselves and of them are some who are lukewarm, and of them are some who outstrip (others) through good deeds, by Allah's leave. That is the great favour!\n",
        "TRANSLATION_9": "We have bestowed the Book on those of Our servants whom We have chosen. Some wrong their own souls, some keep half-way [between right and wrong]; some, by God's leave, excel others in good deeds. This is a great bounty of God:\n",
        "TRANSLATION_10": "Thereafter We made inheritors of the book those whom We chose of Our bondmen. Then of them are some who wrong themselves, and of them are some who keep the middle way, and of them are some who, by Allah's leave, go ahead in virtues. That! that is a great grace.\n",
        "TRANSLATION_11": "Then We made those whom We chose from Our servants heirs to the Book. Yet some of them are those who wrong themselves, and some of them are average, and some of them are those who take the lead in all the good works by Allah’s will. That is the greatest grace [of Allah]!\n",
        "TRANSLATION_12": "Then We have given the Book for inheritance to such of Our Servants as We have chosen: but there are among them some who wrong their own souls; some who follow a middle course; and some who are, by Allah's leave, foremost in good deeds; that is the highest Grace.\n",
        "TRANSLATION_13": "Then We gave the Book the Quran) for inheritance to such of Our slaves whom We chose (the followers of Muhammad SAW). Then of them are some who wrong their ownselves, and of them are some who follow a middle course, and of them are some who are, by Allah's Leave, foremost in good deeds. That (inheritance of the Quran), that is indeed a great grace.\n",
        "TRANSLATION_14": "Then, We gave the Book as an inheritance to those of our worshipers whom We chose. Among them, is he who was harmful to himself, and some who minimize, and some who, by the permission of Allah, race in charity, this is the greatest virtue.\n",
        "TRANSLATION_15": "Then We passed the Book to those of Our servants whom We chose. Some of them wrong their souls, and some follow a middle course, and some are in the foremost in good deeds by God’s leave; that is the greatest blessing.\n",
        "TRANSLATION_16": "Then we caused to inherit the Book those We have chosen of Our servants; and among them is he who wrongs himself, and among them is he who is moderate, and among them is he who is foremost in good deeds by permission of Allah. That [inheritance] is what is the great bounty.\n",
        "TRANSLATION_17": "[35:32] Then We gave the Book, the Qur’ān, to those of Our servants whom We chose, namely, your community. Yet some of them are those who wrong themselves, by failing to act fully in accordance with it, and some of them are moderate, acting in accordance with it most of the time, and some are those who take the lead in [performing] good works, so that in addition to his [acquiring] knowledge he disseminates it and shows [others] the way [to proper conduct] as well as acting in accordance [with the Qur’ān], by the leave of God, by His will. That, bequest to them of the Book, is the greatest favour!\n",
        "TRANSLATION_18": "(Then) after We sent Gabriel with the Qur'an to Muhammad (pbuh) (We gave the Scripture as inheritance) We gave the honour of memorising, writing and reciting the Qur'an (unto those whom We elected of our bondmen) by means of faith, i.e. the community of Muhammad (pbuh). (But of them are some who wrong themselves) through committing enormities, and these will not be saved unless there is intercession in their favour, or unless they are forgiven or when Allah's promise is fulfilled (and of them are some who are lukewarm) some of them did good works and evil works in equal measure; these will be slightly taken to task and then be saved, (and of them are some who outstrip (others) through good deeds) in the life of this world and among those brought near to the Garden of Eden in the Hereafter, (by Allah's leave) by Allah's given success and beneficence. (That) selection and outstripping (is the great favour) the greatest grace that Allah can bestow upon them!\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "35:32",
            "33:47",
            "2:90",
            "3:145",
            "2:207",
            "4:37",
            "35:31",
            "27:59",
            "10:107",
            "2:105"
        ],
        "BIBLE": [
            "torah:genesis:3:6",
            "prophets:joshua:1:8",
            "writings:nehemiah:2:1",
            "prophets:ii%20kings:10:15",
            "prophets:joshua:9:11",
            "torah:leviticus:17:11",
            "prophets:i%20kings:8:36",
            "writings:ii%20chronicles:6:27",
            "prophets:nahum:1:14",
            "torah:deuteronomy:29:7"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:13",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:3:2"
        ]
    }
}