{
    "VERSE": "35:35",
    "ARABIC": "ٱلَّذِىٓ أَحَلَّنَا دَارَ ٱلْمُقَامَةِ مِن فَضْلِهِۦ لَا يَمَسُّنَا فِيهَا نَصَبٌ وَلَا يَمَسُّنَا فِيهَا لُغُوبٌ",
    "ENGLISH": {
        "TRANSLATION_0": "He who has lodged us, out of His favour, in the Abode of Permanence where no weariness or fatigue affects us.'",
        "TRANSLATION_1": "Who has settled us by His grace in the mansions of eternal rest, where there is no labour for us, nor does weariness come upon us.\"\n",
        "TRANSLATION_2": "(the Lord) Who, out of His Bounty, has made us dwell in an abode wherein no toil, nor fatigue affects us.\n",
        "TRANSLATION_3": "It is He who has granted us, through His favor, an everlasting dwelling wherein we shall experience no hardship nor any fatigue.\"\n",
        "TRANSLATION_4": "“The One Who has, by His munificence, established us in a place of serenity; in which no hardship shall ever reach us nor any fatigue affect us.”\n",
        "TRANSLATION_5": "Who, out of His grace, has lodged us in a home that will last forever, where toil will touch us not nor weariness will touch us.\"\n",
        "TRANSLATION_6": "Who has made us alight in a house abiding for ever out of His grace; toil shall not touch us therein, nor shall fatigue therein afflict us.\n",
        "TRANSLATION_7": "who of His bounty has made us to dwell in the abode of everlasting life wherein no weariness assails us neither fatigue.'\n",
        "TRANSLATION_8": "Who, of His grace, hath installed us in the mansion of eternity, where toil toucheth us not nor can weariness affect us.\n",
        "TRANSLATION_9": "Through His grace He has admitted us to the everlasting Abode, where neither toil nor weariness affects us.\"\n",
        "TRANSLATION_10": "Who hath, through His grace, lodged us in the abode of permanence, wherein there will not touch us tall, and wherein there will not touch us weariness.\n",
        "TRANSLATION_11": "who has settled us in the everlasting abode by His grace. In it we are untouched by toil, and untouched by fatigue.’\n",
        "TRANSLATION_12": "Who has, out of His Bounty, settled us in a Home that will last: no toil nor sense of weariness shall touch us therein.\"\n",
        "TRANSLATION_13": "Who, out of His Grace, has lodged us in a home that will last forever; there, toil will touch us not, nor weariness will touch us.\"\n",
        "TRANSLATION_14": "Through His bounty He has made us to live in the abode of Everlasting Life, where neither weariness nor fatigue shall touch us'\n",
        "TRANSLATION_15": "He Who settled us in the Home of Permanence, by His grace, where boredom will not touch us, and fatigue will not afflict us.”\n",
        "TRANSLATION_16": "He who has settled us in the home of duration out of His bounty. There touches us not in it any fatigue, and there touches us not in it weariness [of mind].\"\n",
        "TRANSLATION_17": "[35:35] Who out of His favour has made us to dwell in the Abode of [everlasting] Stay, wherein no toil shall touch us, nor shall we be touched by any fatigue’, lack of strength caused by exhaustion, [and this is] because [religious] obligations no longer apply therein (the second of these [‘fatigue’], which is consequent upon the first [‘toil’], is mentioned in order to make explicit the non-existence [of any toil in Paradise]).\n",
        "TRANSLATION_18": "(Who, of His grace) out of His great favour, (has installed us in the mansion of eternity) in Paradise, (where toil toucheth us not nor can weariness affect us) in Paradise.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "35:35",
            "30:45",
            "15:48",
            "28:77",
            "11:67",
            "40:47",
            "42:26",
            "42:20",
            "60:8",
            "59:8"
        ],
        "BIBLE": [
            "writings:i%20chronicles:17:14",
            "writings:ii%20chronicles:8:11",
            "writings:psalms:26:8",
            "writings:ii%20chronicles:6:2",
            "prophets:i%20kings:8:13",
            "torah:exodus:15:17",
            "prophets:ii%20samuel:15:21",
            "prophets:ii%20kings:17:29",
            "prophets:ii%20kings:17:32",
            "prophets:ezekiel:45:4"
        ]
    }
}