{
    "VERSE": "35:37",
    "ARABIC": "وَهُمْ يَصْطَرِخُونَ فِيهَا رَبَّنَآ أَخْرِجْنَا نَعْمَلْ صَٰلِحًا غَيْرَ ٱلَّذِى كُنَّا نَعْمَلُ أَوَلَمْ نُعَمِّرْكُم مَّا يَتَذَكَّرُ فِيهِ مَن تَذَكَّرَ وَجَآءَكُمُ ٱلنَّذِيرُ فَذُوقُوا۟ فَمَا لِلظَّٰلِمِينَ مِن نَّصِيرٍ",
    "ENGLISH": {
        "TRANSLATION_0": "They will shout out in it, 'Our Lord! take us out! We will act rightly, differently from the way we used to act!' Did We not let you live long enough for anyone who was going to pay heed to pay heed? And did not the warner come to you? Taste it then! There is no helper for the wrongdoers.",
        "TRANSLATION_1": "There they will cry for help: \"O Lord, get us out that we may do the right, and not what we used to do.\" Did We not give you a long enough span of life so that he who remembered may reflect? And did not the warner come to you? So now taste (the punishment). The iniquitous will have none to help them.\n",
        "TRANSLATION_2": "They will cry out in Hell and say: “Our Lord, let us out so that we may act righteously, different from what we did before.” (They will be told): “Did we not grant you an age long enough for anyone to take heed if he had wanted to take heed? Besides, there came a warner to you. So have a taste of the torment now. None may come to the help of the wrong-doers.”\n",
        "TRANSLATION_3": "Therein they will cry-out, \"Lord, take us out of here. We shall act righteously and behave different to what we did before.\" They will be told, \"Did We not allow you to live long enough for you to seek guidance? Did We not send a warner to you? Suffer (the torment). There is no one to help the unjust.\"\n",
        "TRANSLATION_4": "And they shall be screaming in it; “Our Lord! Extricate us, so that we may do good deeds, the opposite of what we used to do”; (It will be said to them) “And did We not give you an age long enough, in which anyone who wants to understand would have understood? And the Herald of Warning did come to you; therefore now taste it – for the unjust do not have any supporter.”\n",
        "TRANSLATION_5": "Therein they will cry: \"Our Lord! Bring us out, we shall do righteous good deeds, not that we used to do.\" (Allah will reply:) \"Did We not give you lives long enough, so that whosoever would receive admonition could receive it And the warner came to you. So taste you. For the wrongdoers there is no helper.\"\n",
        "TRANSLATION_6": "And they shall cry therein for succour: O our Lord! take us out, we will do good deeds other than those which we used to do. Did We not preserve you alive long enough, so that he who would be mindful in it should mind? And there came to you the warner; therefore taste; because for the unjust, there is no helper.\n",
        "TRANSLATION_7": "Therein they shall shout, 'Our Lord, bring us forth, and we will do righteousness, other than what we have done.' 'What, did We not give you long life, enough to remember in for him who would remember? To you the warner came; taste you now! The evildoers shall have no helper.'\n",
        "TRANSLATION_8": "And they cry for help there, (saying): Our Lord! Release us; we will do right, not (the wrong) that we used to do. Did not We grant you a life long enough for him who reflected to reflect therein? And the warner came unto you. Now taste (the flavour of your deeds), for evil-doers have no helper.\n",
        "TRANSLATION_9": "There they will cry out, \"Lord, take us out! We shall do good deeds, and behave differently from the way we used to.\" But He will answer, \"Did We not make your life long enough to take warning if you were going to? The warner did come to you. So now have a taste of the punishment.\" Wrongdoers will have no supporter.\n",
        "TRANSLATION_10": "And they will be shouting therein: our Lord! take us out; we shall work righteously, not that which we have been working. Gave We not you lives long enough so that whosoever would receive admonition could receive admonition therein? and there came Unto you a warner; taste therefore and for the wrong-doers there will be no helper.\n",
        "TRANSLATION_11": "They shall cry therein for help: ‘Our Lord! Bring us out, so that we may act righteously—differently from what we used to do!’ ‘Did We not give you a lifelong enough that one who is heedful might take admonition? And [moreover] the warner had [also] come to you. Now taste [the consequence of your deeds], for the wrongdoers have no helper.’\n",
        "TRANSLATION_12": "Therein will they cry aloud (for assistance): \"Our Lord! Bring us out: we shall work righteousness, not the (deeds) we used to do!\" - \"Did We not give you long enough life so that he that would should receive admonition? and (moreover) the warner came to you. So taste ye (the fruits of your deeds): for the wrong-doers there is no helper.\"\n",
        "TRANSLATION_13": "Therein they will cry: \"Our Lord! Bring us out, we shall do righteous good deeds, not (the evil deeds) that we used to do.\" (Allah will reply): \"Did We not give you lives long enough, so that whosoever would receive admonition, - could receive it? And the warner came to you. So taste you (the evil of your deeds). For the Zalimun (polytheists and wrongdoers, etc.) there is no helper.\"\n",
        "TRANSLATION_14": "There they will cry out: 'Our Lord, bring us out, and we will do good, other than what we have done' What, did We not make your lives long enough to remember for whosoever would remember? A warner came to you, so taste now! None shall help the harmdoers.\n",
        "TRANSLATION_15": "And they will scream therein, “Our Lord, let us out, and we will act righteously, differently from the way we used to act.” Did We not give you a life long enough, in which anyone who wanted to understand would have understood? And the warner did come to you. So taste. The evildoers will have no helper.\n",
        "TRANSLATION_16": "And they will cry out therein, \"Our Lord, remove us; we will do righteousness - other than what we were doing!\" But did We not grant you life enough for whoever would remember therein to remember, and the warner had come to you? So taste [the punishment], for there is not for the wrongdoers any helper.\n",
        "TRANSLATION_17": "[35:37] While therein they will be crying out, calling for help in distress, howling and saying: ‘Our Lord! Bring us forth, from it, and we will act righteously, other than how we used to act’. But it will be said to them: ‘Did We not give you long life, enough, time, in which to take heed, for him who would take heed? And [moreover] the warner, the Messenger, came to you, but you did not respond to his call, so taste now [this chastisement]! For the evildoers, the disbelievers, have no helper’, to ward off from them the chastisement.\n",
        "TRANSLATION_18": "(And they) i.e. the disbelievers (cry for help there) in the Fire, and implore and beseech, ((saying): Our Lord!) our Lord! (Release us) from the Fire and return us to the life of the world, for we will believe in You; and (we will do right) sincerely believing in You, (not (the wrong) that we used to do) in our state of 494 idolatry. Allah will say to them: (Did not We grant you a life) did We not give you, group of disbelievers, in the life of the world a respite (long enough for who reflected to reflect) long enough for reflection (therein) for anyone who wanted to reflect? (And the warner) Muhammad (pbuh) (came unto you) with the Qur'an and warned you against this day, but you did not believe him. (Now taste (the flavour of your deeds)) taste the torment of the Fire, (for evil-doers) the disbelievers (have no helper) to save them from Allah's chastisement.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "35:37",
            "20:133",
            "51:36",
            "3:192",
            "36:27",
            "68:50",
            "1:7",
            "20:74",
            "95:6",
            "23:76"
        ],
        "BIBLE": [
            "torah:exodus:34:10",
            "prophets:i%20kings:19:4",
            "writings:ii%20chronicles:14:6",
            "prophets:ii%20kings:10:15",
            "prophets:ezekiel:3:20",
            "prophets:i%20kings:21:20",
            "prophets:judges:14:9",
            "torah:leviticus:10:17",
            "prophets:i%20kings:19:2",
            "torah:genesis:3:6"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:13",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:2:4"
        ]
    }
}