{
    "VERSE": "35:38",
    "ARABIC": "إِنَّ ٱللَّهَ عَٰلِمُ غَيْبِ ٱلسَّمَٰوَٰتِ وَٱلْأَرْضِ إِنَّهُۥ عَلِيمٌۢ بِذَاتِ ٱلصُّدُورِ",
    "ENGLISH": {
        "TRANSLATION_0": "Allah knows the Unseen of the heavens and earth. Allah knows what the heart contains.",
        "TRANSLATION_1": "Verily God knows the unknown of the heavens and the earth. Indeed He knows what lies in the hearts of men.\n",
        "TRANSLATION_2": "Surely Allah knows the Unseen in the heavens and the earth. He even knows the secrets hidden in people's breasts.\n",
        "TRANSLATION_3": "God has knowledge of whatever is unseen in the heavens and the earth. He knows best what the hearts contain.\n",
        "TRANSLATION_4": "Indeed Allah is All Knowing – of all the hidden things in the heavens and in the earth; indeed He knows what lies within the hearts.\n",
        "TRANSLATION_5": "Verily, Allah is the All-Knower of the Unseen of the heavens and the earth. Verily, He is the All-Knower of that is in the breasts.\n",
        "TRANSLATION_6": "Surely Allah is the Knower of what is unseen in the heavens and the earth; surely He is Cognizant of what is in the hearts.\n",
        "TRANSLATION_7": "God knows the Unseen in the heavens and the earth; He knows the thoughts within the breasts.\n",
        "TRANSLATION_8": "Lo! Allah is the Knower of the Unseen of the heavens and the earth. Lo! He is Aware of the secret of (men's) breasts.\n",
        "TRANSLATION_9": "God knows the hidden reality of the heavens and the earth. He has full knowledge of what is in the hearts of men;\n",
        "TRANSLATION_10": "Verily Allah is the Knower of the unseen of the heavens and the earth. Verily, He is the Knower of that which is in the breasts.\n",
        "TRANSLATION_11": "Indeed Allah is the knower of the Unseen of the heavens and the earth. Indeed, He knows well what is in the breasts.\n",
        "TRANSLATION_12": "Verily Allah knows (all) the hidden things of the heavens and the earth: verily He has full knowledge of all that is in (men's) hearts.\n",
        "TRANSLATION_13": "Verily, Allah is the AllKnower of the unseen of the heavens and the earth. Verily! He is the AllKnower of that is in the breasts.\n",
        "TRANSLATION_14": "Allah knows the Unseen in the heavens and earth. He knows that which is in the innermost of the chests.\n",
        "TRANSLATION_15": "God is the Knower of the future of the heavens and the earth. He knows what the hearts contain.\n",
        "TRANSLATION_16": "Indeed, Allah is Knower of the unseen [aspects] of the heavens and earth. Indeed, He is Knowing of that within the breasts.\n",
        "TRANSLATION_17": "[35:38] Truly God is Knower of the Unseen of the heavens and the earth; truly He knows well what is in the breasts, what is in the hearts — thus there is all the more reason that He should [also] have knowledge of other things, given the way people are.\n",
        "TRANSLATION_18": "(Lo! Allah is the knower of the Unseen of the heavens and the earth) He knows that were they to be returned to the life of this world, they would still engage in that which they were forbidden from. (Lo! He is Aware of the secret of (men's) breasts) He knows what is in the hearts whether it is good or evil.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "35:38",
            "64:4",
            "49:18",
            "27:65",
            "18:26",
            "3:5",
            "45:36",
            "43:84",
            "31:26",
            "24:41"
        ],
        "BIBLE": [
            "writings:i%20chronicles:29:17",
            "writings:ii%20chronicles:6:18",
            "torah:deuteronomy:4:39",
            "writings:i%20chronicles:16:26",
            "writings:psalms:96:5",
            "prophets:isaiah:51:7",
            "writings:daniel:2:30",
            "writings:job:10:13",
            "prophets:joshua:2:11",
            "prophets:jeremiah:17:9"
        ]
    }
}