{
    "VERSE": "35:39",
    "ARABIC": "هُوَ ٱلَّذِى جَعَلَكُمْ خَلَٰٓئِفَ فِى ٱلْأَرْضِ فَمَن كَفَرَ فَعَلَيْهِ كُفْرُهُۥ وَلَا يَزِيدُ ٱلْكَٰفِرِينَ كُفْرُهُمْ عِندَ رَبِّهِمْ إِلَّا مَقْتًا وَلَا يَزِيدُ ٱلْكَٰفِرِينَ كُفْرُهُمْ إِلَّا خَسَارًا",
    "ENGLISH": {
        "TRANSLATION_0": "It is He who made you khalifs on the earth. So whoever is kafir, his kufr is against himself. In Allah's sight, the kufr of the kafirun only increases their loathsomeness; the kufr of the kafirun only increases their loss.",
        "TRANSLATION_1": "He is the one who made you trustees on the earth. So he who disbelieves, will bear the consequence of his unbelief. but their unbelief will only increase disgust for unbelievers in the sight of their Lord; and their unbelief will only lead the unbelievers to greater loss.\n",
        "TRANSLATION_2": "It is He Who made you vicegerents in the earth. So whoever disbelieves will bear the burden of his unbelief. The unbelievers' unbelief adds nothing but Allah's wrath against them. The unbelievers' unbelief adds nothing but their own loss.\n",
        "TRANSLATION_3": "It is He who has made you each other's successors on earth. Whoever disbelieves, does so against his own self. The disbelief of the unbelievers will only increase the anger of their Lord and will only cause them greater loss.\n",
        "TRANSLATION_4": "It is He Who has made you the successors of your predecessors in the earth; so whoever disbelieves – (the harm of) his disbelief falls only on him; and for the disbelievers, their disbelief increases nothing in their Lord’s sight except disgust; and for the disbelievers, their disbelief increases nothing for them except ruin.\n",
        "TRANSLATION_5": "He it is Who has made you successors generations after generations in the earth, so whosoever disbelieves, on him will be his disbelief. And the disbelief of the disbelievers adds nothing but hatred of their Lord. And the disbelief of the disbelievers adds nothing but loss.\n",
        "TRANSLATION_6": "He it is Who made you rulers in the land; therefore whoever disbelieves, his unbelief is against himself; and their unbelief does not increase the disbelievers with their Lord in anything except hatred; and their unbelief does not increase the disbelievers in anything except loss.\n",
        "TRANSLATION_7": "It is He who appointed you viceroys in the earth. So whosoever disbelieves, his unbelief shall be charged against him; their unbelief increases the disbelievers only in hate in God's sight; their unbelief increases the disbelievers only in loss.\n",
        "TRANSLATION_8": "He it is Who hath made you regents in the earth; so he who disbelieveth, his disbelief be on his own head. Their disbelief increaseth for the disbelievers, in their Lord's sight, naught save abhorrence. Their disbelief increaseth for the disbelievers naught save loss.\n",
        "TRANSLATION_9": "it is He who has made you inherit the earth. He who denies Him shall bear the burden of his denial. God's displeasure with the deniers will only be increased by their denial of the truth, it will only increase their loss.\n",
        "TRANSLATION_10": "He it is who hath made you successors in the earth. So whosoever disbelieveth, on him will befall his infidelity. And for the infidels their infidelity increaseth with their Lord naught save abhorence. And for the infidels their infidelity increastth naught save loss.\n",
        "TRANSLATION_11": "It is He who made you successors on the earth. So whoever is faithless, his unfaith is to his own detriment. The unfaith of the faithless does not increase them with their Lord [in anything] except disfavour, and their unfaith increases the faithless in nothing except loss.\n",
        "TRANSLATION_12": "He it is That has made you inheritors in the earth: if, then, any do reject (Allah), their rejection (works) against themselves: their rejection but adds to the odium for the Unbelievers in the sight of their Lord: their rejection but adds to (their own) undoing.\n",
        "TRANSLATION_13": "He it is Who has made you successors generations after generations in the earth, so whosoever disbelieves (in Islamic Monotheism) on him will be his disbelief. And the disbelief of the disbelievers adds nothing but hatred with their Lord. And the disbelief of the disbelievers adds nothing but loss.\n",
        "TRANSLATION_14": "It is He who made you caliphs in the earth. He who disbelieves, his disbelief shall be charged against him. The unbelievers disbelief does nothing for them, except, increase them in hate with Allah their disbelief increases the unbelievers only in loss.\n",
        "TRANSLATION_15": "It is He who made you successors on earth. Whoever disbelieves, his disbelief will recoil upon him. The disbelief of the disbelievers adds only to their Lord's disfavor of them. The disbelief of the disbelievers adds only to their perdition.\n",
        "TRANSLATION_16": "It is He who has made you successors upon the earth. And whoever disbelieves - upon him will be [the consequence of] his disbelief. And the disbelief of the disbelievers does not increase them in the sight of their Lord except in hatred; and the disbelief of the disbelievers does not increase them except in loss.\n",
        "TRANSLATION_17": "[35:39] It is He Who made you successors in the earth (khalā’if, ‘successors’, is the plural of khalīfa) in other words, one succeeding the other. So whoever disbelieves, of you, his disbelief will be to his own detriment, that is, the evil consequences of his disbelief [will be so]. And their disbelief does not increase the disbelievers with their Lord [in anything] except disfavour, wrath. And their disbelief does not increase the disbelievers [in anything] except loss, of [the reward of] the Hereafter.\n",
        "TRANSLATION_18": "(He it is Who hath made you) community of Muhammad (pbuh) (regents in the earth) dwellers in the earth after the destruction of past nations; (so he who disbelieveth) in Allah, (his disbelief be on his own head) the punishment of his disbelief is against his own soul. (Their disbelief increaseth for the disbelievers) in Muhammad (pbuh) and in the Qur'an, (in their Lord's sight) in the Hereafter, (naught save abhorrence) nothing but detestation. (Their disbelief) in the life of this world (increaseth for the disbelievers naught save loss) in the Hereafter.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "35:39",
            "21:19",
            "2:30",
            "6:165",
            "2:277",
            "26:152",
            "63:7",
            "50:4",
            "41:38",
            "20:52"
        ],
        "BIBLE": [
            "prophets:i%20samuel:14:45",
            "prophets:ezekiel:22:31",
            "prophets:ii%20samuel:1:10",
            "writings:ii%20chronicles:20:18",
            "writings:nehemiah:8:6",
            "prophets:ezekiel:16:43",
            "prophets:i%20samuel:15:17",
            "prophets:joshua:7:6",
            "prophets:ezekiel:17:19",
            "writings:daniel:7:20"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:3:4",
            "Sefer%20Yetzirah:3:8",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:2:5",
            
            "Sefer%20Yetzirah:6:1"
        ]
    }
}