{
    "VERSE": "35:4",
    "ARABIC": "وَإِن يُكَذِّبُوكَ فَقَدْ كُذِّبَتْ رُسُلٌ مِّن قَبْلِكَ وَإِلَى ٱللَّهِ تُرْجَعُ ٱلْأُمُورُ",
    "ENGLISH": {
        "TRANSLATION_0": "If they deny you, Messengers before you were also denied. All matters return to Allah.",
        "TRANSLATION_1": "If they call you a liar, so have other messengers been denied before you. But all things will be brought back to God.\n",
        "TRANSLATION_2": "(O Prophet), (there is nothing novel in it) if they cry lies to you; Messengers before you were also cried lies to. To Allah shall all matters be sent back.\n",
        "TRANSLATION_3": "If they reject you, other Messengers had certainly been rejected before you. All decisions are in the hands of God.\n",
        "TRANSLATION_4": "And if they deny you, many Noble Messengers were denied before you; and towards Allah only is the return of all matters.\n",
        "TRANSLATION_5": "And if they deny you, so were Messengers denied before you. And to Allah return all matters.\n",
        "TRANSLATION_6": "And if they call you a liar, truly apostles before you were called liars, and to Allah are all affairs returned.\n",
        "TRANSLATION_7": "If they cry lies to thee, Messengers before thee were cried lies to; and unto God all matters are returned.\n",
        "TRANSLATION_8": "And if they deny thee, (O Muhammad), messengers (of Allah) were denied before thee. Unto Allah all things are brought back.\n",
        "TRANSLATION_9": "If they reject you, other messengers have been rejected before you. To God all affairs will be returned.\n",
        "TRANSLATION_10": "And if they belie thee, then surely apostles have been belied before thee. And Unto Allah shall be brought back all affairs.\n",
        "TRANSLATION_11": "If they impugn you, certainly [other] apostles were impugned before you, and all matters are returned to Allah.\n",
        "TRANSLATION_12": "And if they reject thee, so were messengers rejected before thee: to Allah back for decision all affairs.\n",
        "TRANSLATION_13": "And if they belie you (O Muhammad SAW), so were Messengers belied before you. And to Allah return all matters (for decision).\n",
        "TRANSLATION_14": "If they belie you, other Messengers have been belied before you. To Allah all matters are returned.\n",
        "TRANSLATION_15": "If they reject you, messengers before you were also rejected. To God all matters are returned.\n",
        "TRANSLATION_16": "And if they deny you, [O Muhammad] - already were messengers denied before you. And to Allah are returned [all] matters.\n",
        "TRANSLATION_17": "[35:4] And if they deny you, O Muhammad (s), with regard to your coming with [the message of] God’s Oneness, resurrection, reckoning and punishment, verily [other] messengers before you were denied, in this respect, so be steadfast as they were steadfast; and to God all matters are returned, in the Hereafter, when He will requite the deniers and grant victory to the messengers.\n",
        "TRANSLATION_18": "(And if they) the Quraysh (deny thee, (0 Muhammad), messengers (of Allah) were denied before thee) their folks denied them just as your people are denying you. (Unto Allah all things are brought back) the end results of all things are brought back to Allah in the Hereafter.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "35:4",
            "4:164",
            "29:18",
            "40:78",
            "4:80",
            "21:41",
            "21:25",
            "3:32",
            "29:3",
            "9:48"
        ],
        "BIBLE": [
            "prophets:jeremiah:23:14",
            "prophets:ii%20samuel:12:25",
            "writings:psalms:88:10",
            "prophets:ii%20kings:3:13",
            "prophets:judges:16:18",
            "prophets:i%20samuel:6:3",
            "prophets:i%20samuel:19:7",
            "prophets:ii%20kings:9:1",
            "prophets:i%20kings:17:11",
            "torah:leviticus:25:28"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:3",
            
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:2",
            "Sefer%20Yetzirah:1:2",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:1"
        ]
    }
}