{
    "VERSE": "35:40",
    "ARABIC": "قُلْ أَرَءَيْتُمْ شُرَكَآءَكُمُ ٱلَّذِينَ تَدْعُونَ مِن دُونِ ٱللَّهِ أَرُونِى مَاذَا خَلَقُوا۟ مِنَ ٱلْأَرْضِ أَمْ لَهُمْ شِرْكٌ فِى ٱلسَّمَٰوَٰتِ أَمْ ءَاتَيْنَٰهُمْ كِتَٰبًا فَهُمْ عَلَىٰ بَيِّنَتٍ مِّنْهُ بَلْ إِن يَعِدُ ٱلظَّٰلِمُونَ بَعْضُهُم بَعْضًا إِلَّا غُرُورًا",
    "ENGLISH": {
        "TRANSLATION_0": "Say: 'Have you thought about your partner gods, those you call upon besides Allah? Show me what they have created of the earth; or do they have a partnership in the heavens?' Have We given them a Book whose Clear Signs they follow? No indeed! The wrongdoers promise each other nothing but delusion.",
        "TRANSLATION_1": "Say: \"Look at the compeers you invoke apart from God. Show me, what of the earth have they created, or what share have they in the heavens?\" Or have We given them a Book whose testimony they possess? Not in the least. What the unbelievers have been promising one another is nothing but deceit.\n",
        "TRANSLATION_2": "Say to them (O Prophet): “Have you ever seen those of your associates upon whom you call apart from Allah? Show me what have they created in the earth? Or do they have any partnership (with Allah) in the heavens? Or have We given them a Book so that they have a clear proof (for associating others with Allah in His Divinity)?” Nay, what these wrong-doers promise each other is nothing but delusion.\n",
        "TRANSLATION_3": "(Muhammad), ask them, \"Think about the idols which you worship besides God. Show me what part of the earth they have created. Do they have any share in the heavens? Has God sent them a Book to confirm their authority? In fact, whatever the unjust promise each other is nothing but deceit.\"\n",
        "TRANSLATION_4": "Proclaim, “Just show me your partners (false deities) whom you worship other than Allah; show me which part of the earth have they created – or do they have any share in the heavens?” Or have We given them some Book, so they are on its clear proofs? In fact the unjust do not give promises to each other, except of deceit.\n",
        "TRANSLATION_5": "Say: \"Have you considered your partners whom you call upon besides Allah Show Me, what they have created of the earth. Or have they any share in the heavens Or have We given them a Book, so that they act on clear proof therefrom Nay, the wrongdoers promise one another nothing but delusions.\"\n",
        "TRANSLATION_6": "Say: Have you considered your associates which you call upon besides Allah? Show me what part of the earth they have created, or have they any share in the heavens; or, have We given them a book so that they follow a clear argument thereof? Nay, the unjust do not hold out promises one to another but only to deceive.\n",
        "TRANSLATION_7": "Say: 'Have you considered your associates on whom you call, apart from God? Show me what they have created in the earth; or have they a partnership in the heavens?' Or have We given them a Book, so that they are upon a clear sign from it? Nay, but the evildoers promise one another naught but delusion.\n",
        "TRANSLATION_8": "Say: Have ye seen your partner-gods to whom ye pray beside Allah? Show me what they created of the earth! Or have they any portion in the heavens? Or have We given them a scripture so they act on clear proof therefrom? Nay, the evil-doers promise one another only to deceive.\n",
        "TRANSLATION_9": "Say, \"Have you ever considered your associate gods whom you call on besides God? Show me what it is that they have created on earth. Or have they a share in the creation of the heavens?\" Or have We given them a book so that they may act on evidence from it? Indeed, the wrongdoers' promises to one another are nothing but deception.\n",
        "TRANSLATION_10": "Say thou: what bethink ye of your associate-gods upon which ye call besides Allah? Show me whatsoever they have created of the earth. Or, have they7 any partnership in the heavens? Or have We vouchsafed to them a Book so that they stand on an evidence therefrom? Nay! the wrong-doers promise each other only delusions.\n",
        "TRANSLATION_11": "Say, ‘Tell me about your ‘partners’ whom you invoke besides Allah? Show me what [part] of the earth have they created. Have they any share in the heavens?’ Have We given them a scripture so that they stand on a manifest proof from it? No, the wrongdoers do not promise one another [anything] except delusion.\n",
        "TRANSLATION_12": "Say: \"Have ye seen (these) 'Partners' of yours whom ye call upon besides Allah? Show Me what it is they have created in the (wide) earth. Or have they a share in the heavens? Or have We given them a Book from which they (can derive) clear (evidence)?- Nay, the wrong-doers promise each other nothing but delusions.\n",
        "TRANSLATION_13": "Say (O Muhammad SAW): \"Tell me or inform me (what) do you think about your (socalled) partnergods to whom you call upon besides Allah, show me, what they have created of the earth? Or have they any share in the heavens? Or have We given them a Book, so that they act on clear proof therefrom? Nay, the Zalimun (polytheists and wrongdoers, etc.) promise one another nothing but delusions.\"\n",
        "TRANSLATION_14": "Say: 'Have you considered your associates who you call upon, other than Allah? Show me what they have created in the earth! Or, have they a partnership in the heavens' Or, have We given them a Book so that they have proof of it? No, the harmdoers promise each other nothing else but delusion.\n",
        "TRANSLATION_15": "Say, “Have you considered those partners of yours that you worship instead of God? Show me what they have created on earth. Or do they have any share in the heavens?” Or have We given them a book whose clear teachings they follow? In fact, the wrongdoers promise one another nothing but delusions.\n",
        "TRANSLATION_16": "Say, \"Have you considered your 'partners' whom you invoke besides Allah? Show me what they have created from the earth, or have they partnership [with Him] in the heavens? Or have We given them a book so they are [standing] on evidence therefrom? [No], rather, the wrongdoers do not promise each other except delusion.\"\n",
        "TRANSLATION_17": "[35:40] Say: ‘Have you considered your associates on whom you call, [those whom] you worship, besides God?, in other words, other than God — and they are the idols whom you asserted to be partners of God, exalted be He. Show me, apprise me of, what [part] of the earth they have created. Or do they have some partnership, some share alongside God, in, the creation of, the heavens?’ Or have We given them a scripture, so that they are [acting] upon a clear proof, a definitive argument, therefrom?, to the effect that they have some partnership with Me? Nothing of the sort! Nay, but the evildoers, the disbelievers, promise one another nothing but delusion, falsehood, when they say that the idols will intercede for them.\n",
        "TRANSLATION_18": "(Say) Muhammad, to the people of Mecca: (Have ye seen your partner-gods) your deities (to whom ye pray) whom you worship (beside Allah? Show me what they created of the earth! Or have they any portion) with Allah (in the heavens) in the creation of the heavens? (Or have We given them) i.e. the disbelievers of Mecca (a Scripture so that they act on clear proof therefrom) that they will not be punished? (Nay, the evil- doers promise) what the idolaters say in the life of this world to (one another) i.e. the leaders to those who followed them (only to deceive) only vanity in the Hereafter.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "35:40",
            "46:4",
            "10:66",
            "34:22",
            "32:4",
            "29:52",
            "31:20",
            "10:18",
            "3:64",
            "13:33"
        ],
        "BIBLE": [
            "torah:genesis:31:42",
            "writings:ezra:9:13",
            "prophets:jeremiah:35:15",
            "torah:deuteronomy:9:23",
            "writings:ecclesiastes:5:17",
            "torah:genesis:28:6",
            "torah:deuteronomy:26:13",
            "prophets:i%20kings:14:8",
            "prophets:ezekiel:29:5",
            "prophets:joshua:17:14"
        ]
    }
}