{
    "VERSE": "35:42",
    "ARABIC": "وَأَقْسَمُوا۟ بِٱللَّهِ جَهْدَ أَيْمَٰنِهِمْ لَئِن جَآءَهُمْ نَذِيرٌ لَّيَكُونُنَّ أَهْدَىٰ مِنْ إِحْدَى ٱلْأُمَمِ فَلَمَّا جَآءَهُمْ نَذِيرٌ مَّا زَادَهُمْ إِلَّا نُفُورًا",
    "ENGLISH": {
        "TRANSLATION_0": "They swore by Allah with their most earnest oaths that if a warner came to them they would be better guided than any other community. But then when a warner did come to them, it only increased their aversion,",
        "TRANSLATION_1": "The unbelievers swore on oath emphatically that if an admonisher came to them they would be guided better than the other communities. But when the admonisher came to them their aversion for the truth increased,\n",
        "TRANSLATION_2": "Swearing by Allah their strongest oaths they claimed that if a warner came to them they would be better-guided than any other people. But when a warner did come to them, his coming only increased their aversion (to the Truth).\n",
        "TRANSLATION_3": "They solemnly swear that if a warner were to come to them, they would certainly have been better guided than any other nation. But when a warner came to them, it only increased their hatred\n",
        "TRANSLATION_4": "And they swore by Allah most vehemently in their oaths, that if a Herald of Warning came to them, they would be more upon guidance than any other group; then when a Herald of Warning did come to them, he increased nothing in them except hatred.\n",
        "TRANSLATION_5": "And they swore by Allah their most binding oath that if a warner came to them, they would be more guided than any of the nations; yet when a warner came to them, it increased in them nothing but flight (from the truth).\n",
        "TRANSLATION_6": "And they swore by Allah with the strongest of their oaths that if there came to them a warner they would be better guided than any of the nations; but when there came to them a warner it increased them in naught but aversion.\n",
        "TRANSLATION_7": "They have sworn by God the most earnest oaths that if a warner came to them, they would be more rightly guided than any one of the nations; but when a warner came to them, it increased them only in aversion,\n",
        "TRANSLATION_8": "And they swore by Allah, their most binding oath, that if a warner came unto them they would be more tractable than any of the nations; yet, when a warner came unto them it aroused in them naught save repugnance,\n",
        "TRANSLATION_9": "They swore their most solemn oaths that if a warner should ever come to them, they would be better guided than any other community. But when a warner did come to them, it only increased their aversion,\n",
        "TRANSLATION_10": "And`they swear by God with a most solemn oath, that if there came a warnet Unto them, they would surely be better guided than any of the other communities. Then when there did come Unto them a warner, it increased in them naught save aversion,-\n",
        "TRANSLATION_11": "They had sworn by Allah with solemn oaths that if a warner were to come to them, they would be better guided than any of the nations. But when a warner came to them, it only increased their distance [from the truth],\n",
        "TRANSLATION_12": "They swore their strongest oaths by Allah that if a warner came to them, they would follow his guidance better than any (other) of the Peoples: But when a warner came to them, it has only increased their flight (from righteousness),-\n",
        "TRANSLATION_13": "And they swore by Allah their most binding oath, that if a warner came to them, they would be more guided than any of the nations (before them), yet when a warner (Muhammad SAW) came to them, it increased in them nothing but flight (from the truth),\n",
        "TRANSLATION_14": "They solemnly swore by Allah that if a warner came to them they would be more rightly guided than any other of the nations. Yet, when a warner came to them, it only increased their aversion,\n",
        "TRANSLATION_15": "And they swore by God with their solemn oaths, that if a warner came to them, they would be more guided than any other people. Yet when a warner came to them, it only increased them in aversion.\n",
        "TRANSLATION_16": "And they swore by Allah their strongest oaths that if a warner came to them, they would be more guided than [any] one of the [previous] nations. But when a warner came to them, it did not increase them except in aversion.\n",
        "TRANSLATION_17": "[35:42]   And they, that is, the disbelievers of Mecca, swore by God their most solemn oaths, [they swore] with utmost effort [to be sincere] in them, that if a warner, a messenger, were to come to them, they would be more readily guided than any one of the communities, [than] the Jews, the Christians or others, in other words, [more readily guided] than any one of these — having [themselves] seen the extent to which these [groups] called each other liars, given that: The Jews say, ‘The Christians stand on nothing’, and the Christians say, ‘The Jews stand on nothing’, [Q. 2:113]. But when a warner, namely, Muhammad (s), did come to them, this, coming of his, only increased them in aversion, further away from [right] guidance,\n",
        "TRANSLATION_18": "(And they swore by Allah) i.e. the disbelievers of Mecca swore by Allah before the coming of the Prophet (pbuh) (their most binding oath) by Allah, (that if a warner) a warning Messenger (came unto them they would be more tractable) they would be swifter in responding and more guided in the religion (than any of the nations) than the Jews and Christians; (yet, when a warner) Muhammad (pbuh) (came unto them) with the Qur'an (it aroused in them naught save repugnance) from it,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "35:42",
            "6:109",
            "16:37",
            "16:120",
            "9:6",
            "6:35",
            "42:8",
            "16:93",
            "9:12",
            "24:6"
        ],
        "BIBLE": [
            "prophets:i%20kings:18:21",
            "prophets:joshua:14:9",
            "torah:numbers:32:11",
            "prophets:ii%20samuel:2:27",
            "prophets:judges:2:19",
            "prophets:i%20samuel:30:21",
            "prophets:ezekiel:22:4",
            "prophets:isaiah:35:4",
            "writings:ecclesiastes:9:2",
            "writings:ruth:1:16"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:6:2"
        ]
    }
}