{
    "VERSE": "35:43",
    "ARABIC": "ٱسْتِكْبَارًا فِى ٱلْأَرْضِ وَمَكْرَ ٱلسَّيِّئِ وَلَا يَحِيقُ ٱلْمَكْرُ ٱلسَّيِّئُ إِلَّا بِأَهْلِهِۦ فَهَلْ يَنظُرُونَ إِلَّا سُنَّتَ ٱلْأَوَّلِينَ فَلَن تَجِدَ لِسُنَّتِ ٱللَّهِ تَبْدِيلًا وَلَن تَجِدَ لِسُنَّتِ ٱللَّهِ تَحْوِيلًا",
    "ENGLISH": {
        "TRANSLATION_0": "shown by their arrogance in the land and evil plotting. But evil plotting envelops only those who do it. Do they expect anything but the pattern of previous peoples? You will not find any changing in the pattern of Allah. You will not find any alteration in the pattern of Allah.",
        "TRANSLATION_1": "As did their arrogance in the land, and their plotting of evil. But their evil plots will turn back on the plotters themselves. So can they expect any thing but what befell the earlier people? You will not find any change in the law of God, nor will you find divine law mutable.\n",
        "TRANSLATION_2": "They began to wax even more proud on earth and contrived evil designs although the contriving of evil designs only overtakes their authors. Are they waiting, then, for anything except what happened to the nations before them? You shall not find any change in the Way of Allah; and you shall not find anything that can ever alter the Way of Allah.\n",
        "TRANSLATION_3": "because of their pride in the land and their evil plots. Evil plots only affect the plotters. Do they expect anything other than (God's) tradition (torment) with those who lived before. You will never find any change in the tradition of God nor will you find any alteration in it.\n",
        "TRANSLATION_4": "Priding themselves in the earth and scheming evil; and the evil scheming falls only upon those who scheme it; so what are they waiting for, except the tradition of the earlier nations? So you will never find the traditions of Allah changing; and you will never find Allah’s law being avoided.\n",
        "TRANSLATION_5": "(They took to flight because of their) arrogance in the land and their plotting of evil. But the evil plot encompasses only him who makes it. Then, can they expect anything (else) but the Sunnah (way of dealing) of the peoples of old So, no change will you find in Allah's Sunnah, and no turning off will you find in Allah's Sunnah.\n",
        "TRANSLATION_6": "(In) behaving proudly in the land and in planning evil; and the evil plans shall not beset any save the authors of it. Then should they wait for aught except the way of the former people? For you shall not find any alteration in the course of Allah; and you shall not find any change in the course of Allah.\n",
        "TRANSLATION_7": "waxing proud in the land, and devising evil; but evil devising encompasses only those who do it; So do they expect anything but the wont of the ancients? And thou shalt never find any changing the Wont of God, and thou shalt never find any altering the wont of God.\n",
        "TRANSLATION_8": "(Shown in their) behaving arrogantly in the land and plotting evil; and the evil plot encloseth but the men who make it. Then, can they expect aught save the treatment of the folk of old? Thou wilt not find for Allah's way of treatment any substitute, nor wilt thou find for Allah's way of treatment aught of power to change.\n",
        "TRANSLATION_9": "and they behaved arrogantly in the land and plotted evil. But the plotting of evil only rebounds on those who plot. Are they but looking for the way the previous peoples [sinners] were dealt with? You will never find any change in the ways of God; nor will you ever find God's decree averted.\n",
        "TRANSLATION_10": "Through their stiff-neckedness in the land, And the plotting of evil only infoldeth the authors thereof. Wait they, then, but the dispensation of the ancients? And thou wilt not find in dispensation of Allah a change, nor wilt thou find in dispensation of Allah a turning off\n",
        "TRANSLATION_11": "due to their domineering [conduct] in the land and their devising of evil schemes; and evil schemes beset only their authors. So do they await anything except the precedent of the ancients? Yet you will never find any change in Allah’s precedent, and you will never find any revision in Allah’s precedent.\n",
        "TRANSLATION_12": "On account of their arrogance in the land and their plotting of Evil, but the plotting of Evil will hem in only the authors thereof. Now are they but looking for the way the ancients were dealt with? But no change wilt thou find in Allah's way (of dealing): no turning off wilt thou find in Allah's way (of dealing).\n",
        "TRANSLATION_13": "(They took to flight because of their) arrogance in the land and their plotting of evil. But the evil plot encompasses only him who makes it. Then, can they expect anything (else), but the Sunnah (way of dealing) of the peoples of old? So no change will you find in Allah's Sunnah (way of dealing), and no turning off will you find in Allah's Sunnah (way of dealing).\n",
        "TRANSLATION_14": "behaving arrogantly in the land and devising evil. But, evil devising coils only those who do it. Do they look except for the ways of former nations? You shall never find any change in the way of Allah.\n",
        "TRANSLATION_15": "Priding themselves on earth, and scheming evil. But evil scheming overwhelms none but its authors. Do they expect anything but the precedent of the ancients? You will not find any change in God’s practice, and you will not find any substitute to God’s practice.\n",
        "TRANSLATION_16": "[Due to] arrogance in the land and plotting of evil; but the evil plot does not encompass except its own people. Then do they await except the way of the former peoples? But you will never find in the way of Allah any change, and you will never find in the way of Allah any alteration.\n",
        "TRANSLATION_17": "[35:43] acting with disdain in the land, against faith (istikbāran fī’l-ardi, an object denoting reason) and devising, acts of, evil, in the way of idolatry and otherwise; and evil schemes will beset, surround, only their authors, namely, the one who devises [such evil] (the qualifying of makr, ‘scheme’, with the noun al-sayyi’, ‘evil’, is intrinsic [to the fact that it is a scheme], and so the annexation of the former to the latter is said to be alternative usage in which the annexed term is implied, as a precaution against annexing a noun to an adjective). So do they expect, do they await, anything but the precedent of the ancients?, God’s way [of dealing] with them, such as chastising them for their denial of the messengers? Yet you will never find any change in God’s precedent, and you will never find any revision in God’s precedent, that is to say, chastisement is never replaced by anything else, nor is it ever meted out other than to the one who deserves it.\n",
        "TRANSLATION_18": "((Shown in their) behaving arrogantly in the land) by rejecting faith in Muhammad (pbuh) and in the Qur'an (and plotting evil) to kill Muhammad (pbuh); (and the evil plot) evil words and works (encloseth but the men who make it) turn only against the people who make them. (Then, can they expect) can your people, once they disbelieved in you, expect (aught save the treatment of the folk of old) can they expect anything save the punishment of the people of old when they disbelieved in their messengers? (Thou wilt not find for Allah's way of treatment) for Allah's punishment (any substitute) any alteration, (nor wilt thou find for Allah's way of treatment aught of power to change) to someone other than Him. 495\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "35:43",
            "7:99",
            "15:13",
            "13:33",
            "53:31",
            "27:65",
            "46:32",
            "4:132",
            "39:68",
            "29:22"
        ],
        "BIBLE": [
            "torah:deuteronomy:4:25",
            "writings:daniel:6:13",
            "prophets:ii%20kings:7:19",
            "prophets:ii%20samuel:7:23",
            "torah:exodus:34:10",
            "writings:daniel:3:29",
            "writings:ezra:6:8",
            "writings:ecclesiastes:3:14",
            "prophets:ii%20kings:7:2",
            "prophets:isaiah:43:19"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:4"
        ]
    }
}