{
    "VERSE": "35:45",
    "ARABIC": "وَلَوْ يُؤَاخِذُ ٱللَّهُ ٱلنَّاسَ بِمَا كَسَبُوا۟ مَا تَرَكَ عَلَىٰ ظَهْرِهَا مِن دَآبَّةٍ وَلَٰكِن يُؤَخِّرُهُمْ إِلَىٰٓ أَجَلٍ مُّسَمًّى فَإِذَا جَآءَ أَجَلُهُمْ فَإِنَّ ٱللَّهَ كَانَ بِعِبَادِهِۦ بَصِيرًۢا",
    "ENGLISH": {
        "TRANSLATION_0": "If Allah were to take mankind to task for what they have earned, He would not leave a single creature crawling on it, but He is deferring them until a specified time. Then, when their time comes, Allah sees His slaves!",
        "TRANSLATION_1": "If God were to seize men for their doings, not a living being would be left upon the earth. But He gives them respite for a time ordained. When their time is come, surely God will keep (the interest of) His creatures in view.\n",
        "TRANSLATION_2": "If Allah were to take people to task for their deeds, He would not leave any living creature on earth, but He grants them respite to an appointed time. When their appointed time comes to an end, surely Allah fully observes His servants.\n",
        "TRANSLATION_3": "Were God to punish people for their deeds immediately, not one creature would have survived on earth. However, He has given them a respite for an appointed time and when their term comes to an end, let it be known that God watches over His servants.\n",
        "TRANSLATION_4": "If Allah were to seize people upon their deeds, He would leave no creature walking on the surface of the earth, but He gives them respite till a fixed term; and when their term comes – so indeed Allah is observing all His bondmen!\n",
        "TRANSLATION_5": "And if Allah were to punish men for that which they earned, He would not leave a moving creature on the surface of the earth; but He gives them respite to an appointed term, and when their term comes, then verily, Allah is Ever All-Seer of His servants.\n",
        "TRANSLATION_6": "And were Allah to punish men for what they earn, He would not leave on the back of it any creature, but He respites them till an appointed term; so when their doom shall come, then surely Allah is Seeing with respect to His servants.\n",
        "TRANSLATION_7": "If God should take men to task for what they have earned He would not leave upon the face of the earth one creature that crawls; but He is deferring them to a stated term. But when their term is come -- surely God sees His servants.\n",
        "TRANSLATION_8": "If Allah took mankind to task by that which they deserve, He would not leave a living creature on the surface of the earth; but He reprieveth them unto an appointed term, and when their term cometh - then verily (they will know that) Allah is ever Seer of His slaves.\n",
        "TRANSLATION_9": "If God were to take men to task for their misdeeds, He would not leave a single living creature on the surface of the earth; but He grants them respite until an appointed time; and when their appointed time comes, then they will know that God is indeed observant of all His servants.\n",
        "TRANSLATION_10": "Were Allah to take mankind to task for that which they earn, He would not leave a moving creature on the back thereof; but He putteth them off until a term appointed; then when their term cometh, - then, verily Allah is ever of His bondmen a Beholder.\n",
        "TRANSLATION_11": "Were Allah to take humans to task because of what they have earned, He would not leave any living being on its back. But He respites them until a specified time, and when their time comes, [He retributes them in accordance with their works], for Allah has been watching His servants.\n",
        "TRANSLATION_12": "If Allah were to punish men according to what they deserve. He would not leave on the back of the (earth) a single living creature: but He gives them respite for a stated Term: when their Term expires, verily Allah has in His sight all His Servants.\n",
        "TRANSLATION_13": "And if Allah were to punish men for that which they earned, He would not leave a moving (living) creature on the surface of the earth, but He gives them respite to an appointed term, and when their term comes, then verily, Allah is Ever AllSeer of His slaves.\n",
        "TRANSLATION_14": "If Allah should take people to task for what they have earned, He would not leave one creature that crawls upon the face (of the earth)! But, He is deferring them to a named time. And when their time comes, indeed, Allah is the Seer of His worshipers.\n",
        "TRANSLATION_15": "If God were to punish the people for what they have earned, He would not leave a single living creature on its surface. But He defers them until a stated time. Then, when their time has arrived—God is Observant of His creatures.\n",
        "TRANSLATION_16": "And if Allah were to impose blame on the people for what they have earned, He would not leave upon the earth any creature. But He defers them for a specified term. And when their time comes, then indeed Allah has ever been, of His servants, Seeing.\n",
        "TRANSLATION_17": "[35:45] Were God to take mankind to task for what they have acquired, of acts of disobedience, He would not leave on its surface, that is, the earth’s, a single creature, a single living thing moving thereon. But He reprieves them to an appointed term, namely, [to] the Day of Resurrection. And when their term comes — then truly [they will know that] God is ever Seer of His servants, and so He will requite them according to [the nature of] their deeds, rewarding the believers and punishing the disbelievers. Meccan, except for verse 45, which is Medinese; it consists of 83 verses, revealed after [sūrat] al-Jinn.\n",
        "TRANSLATION_18": "(If Allah took mankind) and the jinn (to task by that which they deserve) by their sins, (He would not leave a living creature on the surface of the earth; but He reprieveth them unto an appointed term, and when their term) when the time of their destruction (cometh then verily (they will know that) Allah is ever Seer of His slaves) He knows who to destroy and who to spare'. And of the surah in which Ya-Sin is mentioned, which is all Meccan and consists of 92 (sic) verses, 729 words and 3,000 letters: Surah 36: Ya-Sin And of the surah in which Ya-Sin is mentioned, which is all Meccan and consists of 92 (sic) verses, 729 words and 3,000 letters:\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "35:45",
            "16:61",
            "40:44",
            "2:207",
            "42:27",
            "10:11",
            "4:108",
            "4:58",
            "71:4",
            "39:36"
        ],
        "BIBLE": [
            "torah:genesis:30:9",
            "prophets:ezekiel:18:13",
            "writings:ecclesiastes:3:10",
            "writings:esther:9:27",
            "prophets:i%20kings:11:18",
            "writings:ezra:9:13",
            "prophets:i%20samuel:4:19",
            "prophets:judges:14:19",
            "writings:ecclesiastes:3:14",
            "torah:genesis:3:6"
        ]
    }
}