{
    "VERSE": "35:7",
    "ARABIC": "ٱلَّذِينَ كَفَرُوا۟ لَهُمْ عَذَابٌ شَدِيدٌ وَٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّٰلِحَٰتِ لَهُم مَّغْفِرَةٌ وَأَجْرٌ كَبِيرٌ",
    "ENGLISH": {
        "TRANSLATION_0": "Those who are kafir will suffer a harsh punishment. But those who have iman and do right actions will receive forgiveness and an immense reward.",
        "TRANSLATION_1": "For those who are unbelievers, there is severe punishment; but for those who believe and do the right is forgiveness and a great reward.\n",
        "TRANSLATION_2": "A severe chastisement lies in store for those that disbelieve, but there is pardon and a great reward for those that believe and work righteous deeds.\n",
        "TRANSLATION_3": "The unbelievers will suffer a severe torment, but the righteously striving believers will receive forgiveness and a great reward.\n",
        "TRANSLATION_4": "For the disbelievers is a severe punishment; and for those who accepted faith and did good deeds is forgiveness, and an immense reward.\n",
        "TRANSLATION_5": "Those who disbelieve, theirs will be a severe torment; and those who believe and do righteous good deeds, theirs will be forgiveness and a great reward.\n",
        "TRANSLATION_6": "(As for) those who disbelieve, they shall have a severe punishment, and (as for) those who believe and do good, they shall have forgiveness and a great reward.\n",
        "TRANSLATION_7": "Those who disbelieve -- there awaits them a terrible chastisement; but those who believe, and do deeds of righteousness -- theirs shall be forgiveness and a great wage.\n",
        "TRANSLATION_8": "Those who disbelieve, theirs will be an awful doom; and those who believe and do good works, theirs will be forgiveness and a great reward.\n",
        "TRANSLATION_9": "Those who are bent on denying the truth will have a severe punishment, while those who believe and do good deeds will have forgiveness and a great reward.\n",
        "TRANSLATION_10": "Those who disbelieve - theirs shall be a torment severe; and those who believe and work righteous works, - theirs shall be forgiveness and a great hire.\n",
        "TRANSLATION_11": "There is a severe punishment for the faithless; but for those who have faith and do righteous deeds, there will be forgiveness and a great reward.\n",
        "TRANSLATION_12": "For those who reject Allah, is a terrible Penalty: but for those who believe and work righteous deeds, is Forgiveness, and a magnificent Reward.\n",
        "TRANSLATION_13": "Those who disbelieve, theirs will be a severe torment; and those who believe (in the Oneness of Allah Islamic Monotheism) and do righteous good deeds, theirs will be forgiveness and a great reward (i.e. Paradise).\n",
        "TRANSLATION_14": "For the unbelievers awaits a terrible punishment, but for those who believe and do good deeds is forgiveness and a great recompense.\n",
        "TRANSLATION_15": "Those who disbelieve will suffer a harsh punishment, but those who believe and do righteous deeds will have forgiveness and a great reward.\n",
        "TRANSLATION_16": "Those who disbelieve will have a severe punishment, and those who believe and do righteous deeds will have forgiveness and great reward.\n",
        "TRANSLATION_17": "[35:7] Those who disbelieve, theirs will be a severe chastisement; but those who believe and perform righteous deeds, theirs will be forgiveness and a great reward — this is a declaration of what [fate] will be for the adherents of Satan and what will be for his opponents [respectively].\n",
        "TRANSLATION_18": "(Those who disbelieve) in Muhammad (pbuh) and in the Qur'an, i.e. Abu Jahl and his host, (theirs will be an awful doom; and those who believe) in Muhammad (pbuh) and in the Qur'an (and do good works) and do acts of obedience between them and their Lord, (theirs will be forgiveness) their sins will be forgiven in the life of this world (and a great reward) in Paradise.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "35:7",
            "11:11",
            "67:12",
            "42:26",
            "5:9",
            "84:25",
            "17:9",
            "41:27",
            "33:68",
            "58:15"
        ],
        "BIBLE": [
            "writings:ii%20chronicles:31:20",
            "writings:ecclesiastes:2:11",
            "prophets:isaiah:57:12",
            "prophets:habakkuk:1:5",
            "prophets:isaiah:26:12",
            "writings:psalms:24:5",
            "torah:exodus:34:10",
            "torah:leviticus:23:3",
            "writings:daniel:2:6",
            "writings:ecclesiastes:2:17"
        ]
    }
}