{
    "VERSE": "46:13",
    "ARABIC": "إِنَّ ٱلَّذِينَ قَالُوا۟ رَبُّنَا ٱللَّهُ ثُمَّ ٱسْتَقَٰمُوا۟ فَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Those who say, 'Our Lord is Allah,' and then go straight will feel no fear and will know no sorrow.",
        "TRANSLATION_1": "Surely for those who say, \"God is our Lord,\" and then remain firm, there is no fear or regret.\n",
        "TRANSLATION_2": "Surely those who said: “Our Lord is Allah” and then remained steadfast shall have nothing to fear nor to grieve.\n",
        "TRANSLATION_3": "Those who have said, \"Our Lord is God,\" and are steadfast in their belief need have no fear or be grieved.\n",
        "TRANSLATION_4": "Indeed those who said, “Allah is our Lord”, and then remained steadfast – upon them is neither any fear nor shall they grieve.\n",
        "TRANSLATION_5": "Verily, those who say: \"Our Lord is (only) Allah,\" and thereafter stand firm, on them shall be no fear, nor shall they grieve.\n",
        "TRANSLATION_6": "Surely those who say, Our Lord is Allah, then they continue on the right way, they shall have no fear nor shall they grieve.\n",
        "TRANSLATION_7": "Surely those who say, 'Our Lord is God' and then go straight, no fear shall be on them, neither shall they sorrow.\n",
        "TRANSLATION_8": "Lo! those who say: Our Lord is Allah, and thereafter walk aright, there shall no fear come upon them neither shall they grieve.\n",
        "TRANSLATION_9": "Surely those who say, \"Our Lord is God,\" and remain firm [on that path] shall feel no fear, nor shall they grieve:\n",
        "TRANSLATION_10": "Verily those who say: our Lord is Allah, and thereafter stand fast thereto, no fear shall come upon them, nor shall they grieve.\n",
        "TRANSLATION_11": "Those who say, ‘Our Lord is Allah,’ and then remain steadfast, they will have no fear, nor will they grieve.\n",
        "TRANSLATION_12": "Verily those who say, \"Our Lord is Allah,\" and remain firm (on that Path),- on them shall be no fear, nor shall they grieve.\n",
        "TRANSLATION_13": "Verily, those who say: \"Our Lord is (only) Allah,\" and thereafter Istaqamu (i.e. stood firm and straight on the Islamic Faith of Monotheism by abstaining from all kinds of sins and evil deeds which Allah has forbidden and by performing all kinds of good deeds which He has ordained), on them shall be no fear, nor shall they grieve.\n",
        "TRANSLATION_14": "Those who say: 'Our Lord is Allah' and follow the Straight Path shall have nothing to fear nor shall they sorrow.\n",
        "TRANSLATION_15": "Those who say, “Our Lord is God,” then lead a righteous life—they have nothing to fear, nor shall they grieve.\n",
        "TRANSLATION_16": "Indeed, those who have said, \"Our Lord is Allah,\" and then remained on a right course - there will be no fear concerning them, nor will they grieve.\n",
        "TRANSLATION_17": "[46:13] Assuredly those who say, ‘Our Lord is God’ and then remain upright, in [their adherence to] obedience, no fear will befall them, nor will they grieve.\n",
        "TRANSLATION_18": "(Lo! those who say: our Lord is Allah) those who declare Allah's divine Oneness, (and thereafter walk aright) and thereafter hold fast to performing the obligations of Allah and to avoiding transgressing against Him and, further, do not play about in matters of religion, (there shall no fear come upon them) in relation to future torment (neither shall they grieve) for what they have left behind; it is also said that this means: there shall be no fear upon them when the people of the Fire are in fear, and they shall not grieve when others do.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "46:13",
            "10:62",
            "18:38",
            "41:30",
            "13:27",
            "2:112",
            "2:62",
            "33:2",
            "4:168",
            "5:69"
        ],
        "BIBLE": [
            "prophets:jeremiah:6:16",
            "prophets:zechariah:1:11",
            "writings:ruth:3:10",
            "prophets:joshua:14:9",
            "prophets:jeremiah:5:12",
            "prophets:jeremiah:7:23",
            "prophets:ii%20kings:6:19",
            "prophets:i%20samuel:2:30",
            "prophets:joshua:7:13",
            "torah:numbers:22:34"
        ]
    }
}