{
    "VERSE": "46:14",
    "ARABIC": "أُو۟لَٰٓئِكَ أَصْحَٰبُ ٱلْجَنَّةِ خَٰلِدِينَ فِيهَا جَزَآءًۢ بِمَا كَانُوا۟ يَعْمَلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Such people are the Companions of the Garden, remaining in it timelessly, for ever, as repayment for what they did.",
        "TRANSLATION_1": "They are men of Paradise where they will abide for ever as a recompense for what they had done.\n",
        "TRANSLATION_2": "They are the people of Paradise. They shall remain in it forever as a reward for their deeds.\n",
        "TRANSLATION_3": "They will be the dwellers of Paradise wherein they will live forever as a reward for what they have done.\n",
        "TRANSLATION_4": "They are the People of Paradise, abiding in it forever; the reward of their deeds.\n",
        "TRANSLATION_5": "Such shall be the dwellers of Paradise, abiding therein (forever) -- a reward for what they used to do.\n",
        "TRANSLATION_6": "These are the dwellers of the garden, abiding therein: a reward for what they did.\n",
        "TRANSLATION_7": "Those are the inhabitants of Paradise, therein dwelling forever, as a recompense for that they have been doing.\n",
        "TRANSLATION_8": "Such are rightful owners of the Garden, immortal therein, as a reward for what they used to do.\n",
        "TRANSLATION_9": "it is they who are the people of Paradise, they shall abide therein as a reward for all that they have done.\n",
        "TRANSLATION_10": "Those are the fellows of the Carden: abiders therein: a recompense for that which they have been working.\n",
        "TRANSLATION_11": "They shall be the inhabitants of paradise, remaining in it [forever]—a reward for what they used to do.\n",
        "TRANSLATION_12": "Such shall be Companions of the Gardens, dwelling therein (for aye): a recompense for their (good) deeds.\n",
        "TRANSLATION_13": "Such shall be the dwellers of Paradise, abiding therein (forever), a reward for what they used to do.\n",
        "TRANSLATION_14": "Those, they shall be for ever the inhabitants of Paradise, a recompense for what they did.\n",
        "TRANSLATION_15": "These are the inhabitants of Paradise, where they will dwell forever—a reward for what they used to do.\n",
        "TRANSLATION_16": "Those are the companions of Paradise, abiding eternally therein as reward for what they used to do.\n",
        "TRANSLATION_17": "[46:14] Those will be the inhabitants of Paradise, abiding therein (khālidīna fīhā is a circumstantial qualifier) as a reward (jazā’an is in the accusative as a verbal noun, because of the implied verbal action, that is to say, yujzawna, ‘they will be rewarded’) for what they used to do.\n",
        "TRANSLATION_18": "(Such are rightful owners of the Garden, immortal thereafter) they will dwell therein forever, never to die nor leave it (as a reward for what they used to do) and say in the life of the world.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "46:14",
            "2:82",
            "11:23",
            "68:17",
            "7:42",
            "56:24",
            "5:85",
            "20:76",
            "10:26",
            "43:72"
        ],
        "BIBLE": [
            "prophets:jeremiah:29:32",
            "torah:genesis:34:22",
            "prophets:jeremiah:49:33",
            "torah:genesis:34:7",
            "prophets:habakkuk:2:8",
            "prophets:zechariah:14:11",
            "prophets:jeremiah:47:2",
            "torah:exodus:34:10",
            "writings:psalms:31:20",
            "prophets:isaiah:29:14"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:3:5",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:4:6"
        ]
    }
}