{
    "VERSE": "46:15",
    "ARABIC": "وَوَصَّيْنَا ٱلْإِنسَٰنَ بِوَٰلِدَيْهِ إِحْسَٰنًا حَمَلَتْهُ أُمُّهُۥ كُرْهًا وَوَضَعَتْهُ كُرْهًا وَحَمْلُهُۥ وَفِصَٰلُهُۥ ثَلَٰثُونَ شَهْرًا حَتَّىٰٓ إِذَا بَلَغَ أَشُدَّهُۥ وَبَلَغَ أَرْبَعِينَ سَنَةً قَالَ رَبِّ أَوْزِعْنِىٓ أَنْ أَشْكُرَ نِعْمَتَكَ ٱلَّتِىٓ أَنْعَمْتَ عَلَىَّ وَعَلَىٰ وَٰلِدَىَّ وَأَنْ أَعْمَلَ صَٰلِحًا تَرْضَىٰهُ وَأَصْلِحْ لِى فِى ذُرِّيَّتِىٓ إِنِّى تُبْتُ إِلَيْكَ وَإِنِّى مِنَ ٱلْمُسْلِمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "We have instructed man to be good to his parents. His mother bore him with difficulty and with difficulty gave birth to him; and his bearing and weaning take thirty months. Then when he achieves his full strength and reaches forty, he says, 'My Lord, keep me thankful for the blessing You bestowed on me and on my parents, and keep me acting rightly, pleasing You. And make my descendants righteous. I have made tawba to You and I am truly one of the Muslims.'",
        "TRANSLATION_1": "We have enjoined on man to be good to his parents: His mother carries him in her womb with hardship, and gives birth to him in pain. Thirty months is the period of her carrying and weaning him. When he attains to manhood and the age of forty, he says: \"O Lord, guide me to thank You for the favours You have bestowed on me and my parents, and to do things good as may please You, and give me a righteous off-spring. I turn to You in penitence and submit.\"\n",
        "TRANSLATION_2": "We have enjoined man to be kind to his parents. In pain did his mother bear him and in pain did she give birth to him. The carrying of the child to his weaning is a period of thirty months. And when he is grown to full maturity and reaches the age of forty, he prays: “My Lord, dispose me that I may give thanks for the bounty that You have bestowed upon me and my parents, and dispose me that I may do righteous deeds that would please You, and also make my descendants righteous. I repent to You, and I am one of those who surrender themselves to You.”\n",
        "TRANSLATION_3": "We have advised the human being to be kind to his parents; his mother bore him with hardship and delivered him while suffering a great deal of pain. The period in which his mother bore and weaned him lasted for thirty months. When he grew-up to manhood and became forty years old, he then said, \"Lord, inspire me to give You thanks for the bounties you have granted to me and my parents, and to act righteously to please You. Lord, make my offspring virtuous. Lord I turn to you in repentance; I am a Muslim\".\n",
        "TRANSLATION_4": "And We have commanded man to be good towards parents; his mother bore him with hardship, and delivered him with hardship; and carrying him and weaning him is for thirty months; until when he* reached maturity and became forty years of age, he said, “My Lord! Inspire me to be thankful for the favours you bestowed upon me and my parents, and that I may perform the deeds pleasing to You, and keep merit among my offspring; I have inclined towards you and I am a Muslim.” (* This verse was revealed concerning S. Abu Bakr – the first caliph, R. A. A)\n",
        "TRANSLATION_5": "And We have enjoined on man to be dutiful and kind to his parents. His mother bears him with hardship. And she delivers him with hardship. And (the period of) his gestation and the weaning of him is thirty months, till when he attains full strength and reaches forty years, he says: \"My Lord! Grant me the power and ability that I may be grateful for Your favor which You have bestowed upon me and upon my parents, and that I may do righteous good deeds, such as please You, and make my offspring good. Truly, I have turned to You in repentance, and truly, I am one of the Muslims.\"\n",
        "TRANSLATION_6": "And We have enjoined on man doing of good to his parents; with trouble did his mother bear him and with trouble did she bring him forth; and the bearing of him and the weaning of him was thirty months; until when he attains his maturity and reaches forty years, he says: My Lord! grant me that I may give thanks for Thy favor which Thou hast bestowed on me and on my parents, and that I may do good which pleases Thee and do good to me in respect of my offspring; surely I turn to Thee, and surely I am of those who submit.\n",
        "TRANSLATION_7": "We have charged man, that he be kind to his parents; his mother bore him painfully, and painfully she gave birth to him; his bearing and his weaning are thirty months. Until, when he is fully grown, and reaches forty years, he says, 'O my Lord, dispose me that I may be thankful for Thy blessing wherewith Thou hast blessed me and my father and mother, and that I may do righteousness well-pleasing to Thee; and make me righteous also in my seed. Behold, I repent to Thee, and am among those that surrender.'\n",
        "TRANSLATION_8": "And We have commended unto man kindness toward parents. His mother beareth him with reluctance, and bringeth him forth with reluctance, and the bearing of him and the weaning of him is thirty months, till, when he attaineth full strength and reacheth forty years, he saith: My Lord! Arouse me that I may give thanks for the favour wherewith Thou hast favoured me and my parents, and that I may do right acceptable unto Thee. And be gracious unto me in the matter of my seed. Lo! I have turned unto Thee repentant, and lo! I am of those who surrender (unto Thee).\n",
        "TRANSLATION_9": "We have enjoined on man kindness to his parents: his mother bore him, in pain and in pain she gave birth to him, and his bearing and weaning takes thirty months. At length, when he reaches the age of full maturity and attains forty years, he says, \"O my Lord! Help me to be grateful for Your favours which You have bestowed upon me, and upon both my parents, and to do good deeds that will please You. Grant me righteousness in my offspring. Truly, I have turned to You and, truly, I submit to You.\"\n",
        "TRANSLATION_10": "And We have enjoined upon man kindness Unto the parents: with hardship his mother beareth him and with hardship she bringeth him forth, and the bearing of him and the weaning of him is thirty months, until, when he attaineth his full strength and attaineth the age of forty years, he saith: my Lord! grant me that may give thanks for the favour wherewith. Thou hast favoured me and my parents and that may work righteously such as Thou mayest approve; and be Thou good Unto me in my progeny, verily have turned Unto Thee repentant, and verily I am of those who submit.\n",
        "TRANSLATION_11": "We have enjoined man to be kind to his parents. His mother has carried him in travail, and bore him in travail, and his gestation and weaning take thirty months. When he comes of age and reaches forty years, he says, ‘My Lord! Inspire me to give thanks for Your blessing with which You have blessed me and my parents, and that I may do righteous deeds which please You, and invest my descendants with righteousness. Indeed I have turned to you in penitence, and I am one of the Muslims.’\n",
        "TRANSLATION_12": "We have enjoined on man kindness to his parents: In pain did his mother bear him, and in pain did she give him birth. The carrying of the (child) to his weaning is (a period of) thirty months. At length, when he reaches the age of full strength and attains forty years, he says, \"O my Lord! Grant me that I may be grateful for Thy favour which Thou has bestowed upon me, and upon both my parents, and that I may work righteousness such as Thou mayest approve; and be gracious to me in my issue. Truly have I turned to Thee and truly do I bow (to Thee) in Islam.\"\n",
        "TRANSLATION_13": "And We have enjoined on man to be dutiful and kind to his parents. His mother bears him with hardship and she brings him forth with hardship, and the bearing of him, and the weaning of him is thirty (30) months, till when he attains full strength and reaches forty years, he says: \"My Lord! Grant me the power and ability that I may be grateful for Your Favour which You have bestowed upon me and upon my parents, and that I may do righteous good deeds, such as please You, and make my off-spring good. Truly, I have turned to You in repentance, and truly, I am one of the Muslims (submitting to Your Will).\"\n",
        "TRANSLATION_14": "We have charged the human to be kind to his parents. With much pain his mother bore him, and with much pain she gave birth to him; his bearing andweaning are thirty months. When he grows to manhood and attains his fortieth year, he says: 'Make me so disposed My Lord, so that I give thanks for the favorswith which You have blessed me, my father and mother, and that I will do good deeds that will please You. And, make me righteous and also my descendants. To You I repent, and I am among those who surrender'\n",
        "TRANSLATION_15": "We have enjoined upon man kindness to his parents. His mother carried him with difficulty, and delivered him with difficulty. His bearing and weaning takes thirty months. Until, when he has attained his maturity, and has reached forty years, he says, “Lord, enable me to appreciate the blessings You have bestowed upon me and upon my parents, and to act with righteousness, pleasing You. And improve my children for me. I have sincerely repented to You, and I am of those who have surrendered.”\n",
        "TRANSLATION_16": "And We have enjoined upon man, to his parents, good treatment. His mother carried him with hardship and gave birth to him with hardship, and his gestation and weaning [period] is thirty months. [He grows] until, when he reaches maturity and reaches [the age of] forty years, he says, \"My Lord, enable me to be grateful for Your favor which You have bestowed upon me and upon my parents and to work righteousness of which You will approve and make righteous for me my offspring. Indeed, I have repented to You, and indeed, I am of the Muslims.\"\n",
        "TRANSLATION_17": "[46:15] And We have enjoined man to be kind (husnan: a variant reading has ihsānan), that is to say, We have commanded him to act kindly towards both of them (thus ihsānan is in the accusative as a verbal noun, because of the implied verbal action; the same applies to husnan) to his parents. His mother carries him in travail, and gives birth to him in travail, that is to say, with suffering; and his gestation and his weaning, from suckling, take thirty months, six months being the minimum period for gestation, the remainder being the maximum period of suckling; it is also said that, regardless of whether she bore him for six or nine months, she should suckle him for the remainder. So that (hattā is a [particle of] purpose for an implied sentence, that is to say, wa-‘āsha hattā, ‘and he lived on so that …’) when he is mature, namely, at his prime in terms of his strength, intellect and reasoning, the minimum [age] for which is thirty or thirty three years, and reaches forty years, that is, exactly [forty years], which is the maximum for [attaining] maturity, he says, ‘My Lord!, [this] to the end [of this verse] was revealed regarding Abū Bakr al-Siddīq, when he had reached forty years of age, two years after the [beginning of the] Prophet’s Mission (s). He [Abū Bakr] believed in him, whereafter his parents believed [in the Prophet], followed by his son ‘Abd al-Rahmān, then ‘Abd al-Rahmān’s son Abū ‘Atīq [Muhammad b. ‘Abd al-Rahmān]. Inspire me to give thanks for Your favour with which You have favoured me and my parents, namely, [the grace of] affirming [God’s] Oneness, and that I may act righteously in a way that will please You, thus he [Abū Bakr] emancipated nine believers who had been enduring torture [at the hands of the idolaters] for [their belief in] God, and invest my seed with   righteousness, all of them were believers. Indeed I repent to You and I am truly of those who submit [to You]’.\n",
        "TRANSLATION_18": "(And We have commended unto man) We have commanded 'Abd al-Rahman Ibn Abi Bakr in the Qur'an (kindness towards parents) Abu Bakr Ibn Abi Quhafah and his wife. (His mother beareth him) in her womb (with reluctance) with hardship, (and bringeth him forth with reluctance) and delivers him in hardship, (and the bearing of him) in the womb of his mother (and the weaning of him is thirty months, till, when he attaineth full strength) between the age of 18 to the age of 30 (and reacheth forty years, he saith) Abu Bakr says: (My Lord! Arouse me) inspire in me (that I may give thanks for the favour) of believing in Your divine Oneness (wherewith Thou hast favoured me and my parents) who by then had both accepted Islam, (and that I may do right) sincere righteous works which are (acceptable unto Thee. And be gracious unto me in the matter of my seed) and honour my offspring with repentance and Islam, for 'Abd al-Rahman was not a Muslim by then; he became Muslim later. (Lo! I have turned unto Thee repentant, and lo! I am of those who surrender (unto Thee)) following their religion.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "46:15",
            "31:14",
            "27:19",
            "2:128",
            "2:124",
            "39:8",
            "3:38",
            "14:40",
            "65:4",
            "11:47"
        ],
        "BIBLE": [
            "prophets:i%20samuel:4:19",
            "torah:genesis:3:6",
            "writings:daniel:6:13",
            "writings:job:1:21",
            "prophets:ezekiel:3:20",
            "torah:numbers:17:11",
            "torah:genesis:19:34",
            "prophets:ii%20kings:10:5",
            "prophets:judges:14:19",
            "writings:ii%20chronicles:28:15"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:3:2",
            
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:4:9"
        ]
    }
}