{
    "VERSE": "46:16",
    "ARABIC": "أُو۟لَٰٓئِكَ ٱلَّذِينَ نَتَقَبَّلُ عَنْهُمْ أَحْسَنَ مَا عَمِلُوا۟ وَنَتَجَاوَزُ عَن سَيِّـَٔاتِهِمْ فِىٓ أَصْحَٰبِ ٱلْجَنَّةِ وَعْدَ ٱلصِّدْقِ ٱلَّذِى كَانُوا۟ يُوعَدُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Those are people whose best deeds will be accepted and whose wrong deeds will be overlooked. They are among the Companions of the Garden, in fulfilment of the true promise made to them.",
        "TRANSLATION_1": "They are those from whom We accept the very best of what they have done, and overlook their faults. They will be among the inmates of Paradise: A true promise they have been made.\n",
        "TRANSLATION_2": "Such are those from whom We accept their best deeds and whose evil deeds We overlook. They will be among the people of Paradise in consonance with the true promise made to them.\n",
        "TRANSLATION_3": "These are the ones from whom We accept righteous deeds and ignore their bad deeds. They will be among the dwellers of Paradise. It is the true promise which was given to them.\n",
        "TRANSLATION_4": "These are the ones whose good deeds We will accept, and overlook their shortfalls – among the People of Paradise; a true promise which is being given to them.\n",
        "TRANSLATION_5": "They are those from whom We shall accept the best of their deeds and overlook their evil deeds. (They shall be) among the dwellers of Paradise. That is a promise of truth that they had been promised.\n",
        "TRANSLATION_6": "These are they from whom We accept the best of what they have done and pass over their evil deeds, among the dwellers of the garden; the promise of truth which they were promised.\n",
        "TRANSLATION_7": "Those are they from whom We shall accept the best of what they have done, and We shall pass over their evil deeds. They are among the inhabitants of Paradise -- the promise of the very truth, which they were promised.\n",
        "TRANSLATION_8": "Those are they from whom We accept the best of what they do, and overlook their evil deeds. (They are) among the owners of the Garden. This is the true promise which they were promised (in the world).\n",
        "TRANSLATION_9": "We accept from such people the best of what they do and We overlook their bad deeds. They will be among the people of Paradise -- this is a true promise that has been given to them.\n",
        "TRANSLATION_10": "Those are they from whom We shall accept the best of that which they have worked, and their misdeeds We shall pass by: among the fellows of the Garden: a true promise this, which they have been promised.\n",
        "TRANSLATION_11": "Such are the ones from whom We accept the best of what they do, and overlook their misdeeds, [who will be] among the inhabitants of paradise—a true promise which they had been given.\n",
        "TRANSLATION_12": "Such are they from whom We shall accept the best of their deeds and pass by their ill deeds: (They shall be) among the Companions of the Garden: a promise! of truth, which was made to them (in this life).\n",
        "TRANSLATION_13": "They are those from whom We shall accept the best of their deeds and overlook their evil deeds. (They shall be) among the dwellers of Paradise, a promise of truth, which they have been promised.\n",
        "TRANSLATION_14": "Such are those from whom We will accept the best of what they have done and whose evil deeds We shall overlook. Those, they are among the inhabitants of Paradise; true is the promise that has been promised them.\n",
        "TRANSLATION_15": "Those are they from whom We accept the best of their deeds, and We overlook their misdeeds, among the dwellers of Paradise—the promise of truth which they are promised.\n",
        "TRANSLATION_16": "Those are the ones from whom We will accept the best of what they did and overlook their misdeeds, [their being] among the companions of Paradise. [That is] the promise of truth which they had been promised.\n",
        "TRANSLATION_17": "[46:16] Those, that is, those who say such words, Abū Bakr and others, are they from whom We accept the best of what they do, and overlook their misdeeds, [as they stand] among the inhabitants of Paradise (fī ashābi’lljannati, a circumstantial qualifier, in other words, ‘being among them’) — [this is] the true promise which they were promised, by His words, God has promised the believers, both men and women, Gardens … [Q. 9:72].\n",
        "TRANSLATION_18": "(Those are they from whom We accept the best of what they do) because of their good deeds, (and overlook their evil deeds) such that We do not punish them for these evil deeds. ((They are) among the owners of the Garden) they are with the inhabitants of the Garden in the Garden. (This is the true promise which they were promised) in the life of the world.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "46:16",
            "2:82",
            "29:7",
            "7:42",
            "11:23",
            "46:14",
            "10:26",
            "39:33",
            "25:24",
            "23:96"
        ],
        "BIBLE": [
            "prophets:i%20kings:8:56",
            "prophets:joshua:23:15",
            "writings:ecclesiastes:8:15",
            "torah:numbers:33:53",
            "torah:numbers:18:29",
            "torah:exodus:5:16",
            "writings:daniel:8:12",
            "writings:i%20chronicles:29:14",
            "prophets:i%20kings:8:36",
            "prophets:ezekiel:20:25"
        ]
    }
}