{
    "VERSE": "46:17",
    "ARABIC": "وَٱلَّذِى قَالَ لِوَٰلِدَيْهِ أُفٍّ لَّكُمَآ أَتَعِدَانِنِىٓ أَنْ أُخْرَجَ وَقَدْ خَلَتِ ٱلْقُرُونُ مِن قَبْلِى وَهُمَا يَسْتَغِيثَانِ ٱللَّهَ وَيْلَكَ ءَامِنْ إِنَّ وَعْدَ ٱللَّهِ حَقٌّ فَيَقُولُ مَا هَٰذَآ إِلَّآ أَسَٰطِيرُ ٱلْأَوَّلِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "But what of him who says to his parents, 'Fie on you! Do you promise me that I will be resurrected when generations before me have passed away?' They both call on Allah for help: 'Woe to you! Have iman! Allah's promise is true.' But he says, 'This is nothing but the myths of previous peoples.'",
        "TRANSLATION_1": "But he who says to his parents: \"Shame on you: You intimidate me that I will be resurrected when many generations will have passed before me?\" And (the parents) would implore God's help: \"Woe to you. You better believe. The promise of God is certainly true.\" Yet he answers: \"These are only fables of long ago.\"\n",
        "TRANSLATION_2": "But he who says to his parents: “Fie on you! Do you threaten me that I shall be resurrected, although myriad generations have passed away before me (and not one of them was resurrected)?” The parents beseech Allah (and say to their child): “Woe to you, have faith. Surely Allah's promise is true.” But he says: “All this is nothing but fables of olden times.”\n",
        "TRANSLATION_3": "There are people who say to their parents, \"Fie upon you! Are you telling us that we shall be raised from our graves? So many people have died before us and (none of them have been raised)\" Their parents plead to God and say to their child, \"Woe to you! Have faith; the promise of God is certainly true\" They reply, \"What you say is only ancient legends\".\n",
        "TRANSLATION_4": "And the one who said to his parents, “Uff – I am fed up with both of you! What! You promise me that I will be raised again whereas generations have passed away before me?” And they both seek Allah’s help and say to him, “May you be ruined, accept faith! Indeed Allah’s promise is true”; he therefore answers, “This is nothing except stories of former people.”\n",
        "TRANSLATION_5": "But he who says to his parents: \"Uff to you! Do you promise me that I will be raised up when generations before me have passed\" While they invoke Allah for help: \"Woe to you! Believe! Verily, the promise of Allah is true.\" But he says: \"This is nothing but the legends of the ancient.\"\n",
        "TRANSLATION_6": "And he who says to his parents: Fie on you! do you threaten me that I shall be brought forth when generations have already passed away before me? And they both call for Allah's aid: Woe to you! believe, surely the promise of Allah is true. But he says: This is nothing but stories of the ancients.\n",
        "TRANSLATION_7": "But he who says to his father and his mother, 'Fie upon you! Do you promise me that I shall be brought forth, when already generations have passed away before me?' while they call upon God for succour -- 'Woe upon thee! Believe; surely God's promise is true'; then he says, 'This is naught but the fairy-tales of the ancients' --\n",
        "TRANSLATION_8": "And whoso saith unto his parents: Fie upon you both! Do ye threaten me that I shall be brought forth (again) when generations before me have passed away? And they twain cry unto Allah for help (and say): Woe unto thee! Believe! Lo! the promise of Allah is true. But he saith: This is naught save fables of the men of old:\n",
        "TRANSLATION_9": "But he who says to his parents, \"Shame upon you! Do you threaten me with being taken out of the grave after death while many a generation has passed away before me and none has risen from among them?\" The parents both cry for God's help and say to him, \"Believe! Alas for you! God's promise is true.\" But he says, \"These are nothing but ancient fables.\"\n",
        "TRANSLATION_10": "And he who saith Unto his parents: fie upon you both! threaten me ye that I shall be taken forth, whereas generations have passed away before me? and the twain implore Allah's assistance woe Unto thee! come to believe! verily the promise of Allah is true; yet he saith: naught is this but fables of the ancients.\"\n",
        "TRANSLATION_11": "As for him who says to his parents, ‘Fie on you! Do you promise me that I shall be raised [from the dead] when generations have passed away before me?’ And they invoke Allah’s help [and say]: ‘Woe to you! Believe! Indeed Allah’s promise is true.’ But he says, ‘These are nothing but myths of the ancients.’\n",
        "TRANSLATION_12": "But (there is one) who says to his parents, \"Fie on you! Do ye hold out the promise to me that I shall be raised up, even though generations have passed before me (without rising again)?\" And they two seek Allah's aid, (and rebuke the son): \"Woe to thee! Have faith! for the promise of Allah is true.\" But he says, \"This is nothing but tales of the ancients!\"\n",
        "TRANSLATION_13": "But he who says to his parents: \"Fie upon you both! Do you hold out the promise to me that I shall be raised up (again) when generations before me have passed away (without rising)?\" While they (father and mother) invoke Allah for help (and rebuke their son): \"Woe to you! Believe! Verily, the Promise of Allah is true.\" But he says: \"This is nothing but the tales of the ancient.\"\n",
        "TRANSLATION_14": "But he who says to his father and his mother, 'Fie on you! Do you promise me that I shall be brought forth, when entire generations have passed away before me' Yet they supplicate to Allah for help 'Woe to you! Believe, surely the promise of Allah is true' Then he says: 'This is nothing but fairytales of the ancients'\n",
        "TRANSLATION_15": "As for him who says to his parents, “Enough of you! Are you promising me that I will be raised up, when generations have passed away before me?” While they cry for God’s help, “Woe to you! Believe! The promise of God is true!” But he says, “These are nothing but tales of the ancients.”\n",
        "TRANSLATION_16": "But one who says to his parents, \"Uff to you; do you promise me that I will be brought forth [from the earth] when generations before me have already passed on [into oblivion]?\" while they call to Allah for help [and to their son], \"Woe to you! Believe! Indeed, the promise of Allah is truth.\" But he says, \"This is not but legends of the former people\" -\n",
        "TRANSLATION_17": "[46:17] As for him who says to his parents (li-wālidayhi: a variant reading has li-wālidihi, ‘his parent’, denoting the generic noun): ‘Fie (read uffin or uffan, as a verbal noun, meaning: ‘[something] putrid and disgusting’) on you both: I am exasperated at both of you. Do you threaten me (a-ta‘idāninī: a variant reading has ata‘idānnī) that I shall be raised, from the grave, when already generations, communities, have passed away before me?’, and they have not been raised from their graves. And they call on God for succour, that he [their child] repent, saying [to him]: if you do not repent, ‘Woe to you (waylaka, that is to say, halākaka, ‘you are ruined!’). Believe!, in resurrection. Surely God’s promise is true’. But he says, ‘This, belief in resurrection, is nothing but the fables of the ancients’, lies of theirs.\n",
        "TRANSLATION_18": "(And whoso saith unto his parents: Fie upon you both!) the one who said this is 'Abd al-Rahman Ibn Abi Bakr; he said this to his parents before he became Muslim. (Do ye threaten me that I shall be brought forth (again)) from the grave for the resurrection (when generations before me have passed away) and I have not seen them resurrected? He was referring to two of his forefathers who died during the pagan era: Jad'an and 'Uthman the sons of 'Amr. (And they twain) his parents (cry unto Allah for help (and say): Woe unto thee) may Allah straiten your livelihood! (Believe) in Muhammad (pbuh) and the Qur'an! (Lo! the promise of Allah) about the resurrection (is true) will happen after death. (But he saith) 'Abd al-Rahman says: (This) which Muhammad says (is naught save fables of the men of old) nothing but the lies of the men of old:\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "46:17",
            "14:22",
            "30:60",
            "27:68",
            "23:83",
            "3:183",
            "17:33",
            "45:32",
            "40:78",
            "40:77"
        ],
        "BIBLE": [
            "prophets:judges:21:22",
            "torah:genesis:31:16",
            "prophets:i%20samuel:4:17",
            "torah:exodus:14:11",
            "prophets:ii%20kings:2:16",
            "torah:genesis:37:10",
            "prophets:zechariah:3:4",
            "prophets:judges:19:28",
            "torah:genesis:48:1",
            "prophets:ii%20kings:2:9"
        ]
    }
}