{
    "VERSE": "46:18",
    "ARABIC": "أُو۟لَٰٓئِكَ ٱلَّذِينَ حَقَّ عَلَيْهِمُ ٱلْقَوْلُ فِىٓ أُمَمٍ قَدْ خَلَتْ مِن قَبْلِهِم مِّنَ ٱلْجِنِّ وَٱلْإِنسِ إِنَّهُمْ كَانُوا۟ خَٰسِرِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Those are people of whom the statement about the nations, both of jinn and men, who passed away before them, has also proved true; truly they were the lost.",
        "TRANSLATION_1": "They are those on whom the sentence of God would be justified as on communities of jinns and men before them. They will surely perish.\n",
        "TRANSLATION_2": "It is against such that Allah's sentence (of punishment) has become due. They will join the communities of humans and jinn that have preceded them. Verily all of them will court utter loss.\n",
        "TRANSLATION_3": "Such people will be subject to the punishment of God, which was also decreed for many human beings and jinn before them. These people are certainly lost.\n",
        "TRANSLATION_4": "It is these upon whom the Word has proved true, among the nations that passed away before them, of jinns and men; indeed they were losers.\n",
        "TRANSLATION_5": "They are those against whom the Word (of torment) has justified among the previous generations of Jinn and mankind that have passed away. Verily, they are ever the losers.\n",
        "TRANSLATION_6": "These are they against whom the word has proved true among nations of the jinn and the men that have already passed away before them; surely they are losers.\n",
        "TRANSLATION_7": "such men are they against whom has been realized the Word concerning nations that passed away before them, men and jinn alike; they were losers.\n",
        "TRANSLATION_8": "Such are those on whom the Word concerning nations of the jinn and mankind which have passed away before them hath effect. Lo! they are the losers.\n",
        "TRANSLATION_9": "It is against such as these that the word of God has proved true, along with all the communities that went before them, jinns and humans: surely they are losers.\n",
        "TRANSLATION_10": "Those are they upon whom hath been justified the saying about the communities of the Jinn and mankind who have passed away before them; verily they are ever the losers.\n",
        "TRANSLATION_11": "Such are the ones against whom the word has become due, along with the nations of jinn and humans that have passed away before them. They were the losers.\n",
        "TRANSLATION_12": "Such are they against whom is proved the sentence among the previous generations of Jinns and men, that have passed away; for they will be (utterly) lost.\n",
        "TRANSLATION_13": "They are those against whom the Word (of torment) is justified among the previous generations of jinns and mankind that have passed away. Verily! They are ever the losers.\n",
        "TRANSLATION_14": "Such are they against whom the statement is realized concerning the nations of humans and jinn alike that passed away before them; they were the losers.\n",
        "TRANSLATION_15": "Those are they upon whom the sentence is justified, among the communities that have passed away before them, of jinn and humans. They are truly losers.\n",
        "TRANSLATION_16": "Those are the ones upon whom the word has come into effect, [who will be] among nations which had passed on before them of jinn and men. Indeed, they [all] were losers.\n",
        "TRANSLATION_17": "[46:18] Such are the ones against whom the Word, of chastisement, is due, is necessary, concerning communities of jinn and humans that have passed away before them. Truly they are losers.\n",
        "TRANSLATION_18": "(Such) the forefathers of 'Abd al-Rahman: Jad'an and 'Uthman (are those on whom the Word concerning nations) along with nations (of the jinn and mankind which have passed away before them hath effect) the word has been already decreed that these, along with the disbelievers of the jinn and human beings before them, will dwell in the Fire. (Lo! they are the losers) and they will not be resurrected in the life of the world until the Day of Judgement. 'Abd al-Rahman later accepted Islam and became a good Muslim.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "46:18",
            "41:25",
            "55:56",
            "55:74",
            "72:6",
            "6:42",
            "7:38",
            "29:18",
            "51:56",
            "29:3"
        ],
        "BIBLE": [
            "prophets:ii%20kings:20:4",
            "prophets:i%20kings:12:22",
            "prophets:ii%20kings:15:12",
            "prophets:ezekiel:32:17",
            "prophets:i%20samuel:9:27",
            "torah:numbers:22:35",
            "prophets:zechariah:8:23",
            "prophets:ezekiel:36:20",
            "prophets:ezekiel:26:1",
            "writings:i%20chronicles:17:3"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:4:6"
        ]
    }
}