{
    "VERSE": "46:20",
    "ARABIC": "وَيَوْمَ يُعْرَضُ ٱلَّذِينَ كَفَرُوا۟ عَلَى ٱلنَّارِ أَذْهَبْتُمْ طَيِّبَٰتِكُمْ فِى حَيَاتِكُمُ ٱلدُّنْيَا وَٱسْتَمْتَعْتُم بِهَا فَٱلْيَوْمَ تُجْزَوْنَ عَذَابَ ٱلْهُونِ بِمَا كُنتُمْ تَسْتَكْبِرُونَ فِى ٱلْأَرْضِ بِغَيْرِ ٱلْحَقِّ وَبِمَا كُنتُمْ تَفْسُقُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "On the Day when those who were kafir are exposed to the Fire: 'You dissipated the good things you had in your worldly life and enjoyed yourself in it. So today you are being repaid with the punishment of humiliation for being arrogant in the earth without any right and for being deviators.'",
        "TRANSLATION_1": "The day the unbelievers are brought to the Fire, (it will be said): \"You wasted all your good deeds in the life of the world, and enjoyed them to the full. You will now be requited with a shameful punishment, for you behaved with arrogance for no reason on the earth, and acted wickedly.\"\n",
        "TRANSLATION_2": "And on the Day when the unbelievers will be exposed to the Fire, they will be told: “You have exhausted your share of the bounties in the life of the world, and you took your fill of enjoyments. So, degrading chastisement shall be yours on this Day for you waxed arrogant in the earth without justification and acted iniquitously.”\n",
        "TRANSLATION_3": "On the day when the disbelievers will be exposed to the fire, they will be told, \"You have spent your happy days during your worldly life and enjoyed them. On this day you will suffer a humiliating torment for your unreasonably arrogant manners on earth and for the evil deeds which you have committed\".\n",
        "TRANSLATION_4": "And on the day when the disbelievers will be presented upon the fire; it will be said to them, “You have wasted your portion of the good things in the life of this world and enjoyed them; so this day you will be repaid with the disgraceful punishment, the recompense of your wrongfully priding yourself in the land, and because you used to disobey.”\n",
        "TRANSLATION_5": "On the Day when those who disbelieve will be exposed to the Fire (it will be said): \"You received your good things in the life of the world, and you took your pleasure therein. Today, you will be recompensed with the torment of extreme humiliation, because you were arrogant upon the earth without a right, and because you used to rebel against Allah's command.\n",
        "TRANSLATION_6": "And on the day when those who disbelieve shall be brought before the fire: You did away with your good things in your life of the world and you enjoyed them for a while, so today you shall be rewarded with the punishment of abasement because you were unjustly proud in the land and because you transgressed.\n",
        "TRANSLATION_7": "Upon the day when the unbelievers are exposed to the Fire: 'You dissipated your good things in your present life, and you took your enjoyment in them; therefore today you shall be recompensed with the chastisement of humiliation for that you waxed proud in the earth without right, and for your ungodliness.\n",
        "TRANSLATION_8": "And on the day when those who disbelieve are exposed to the Fire (it will be said): Ye squandered your good things in the life of the world and sought comfort therein. Now this day ye are rewarded with the doom of ignominy because ye were disdainful in the land without a right, and because ye used to transgress.\n",
        "TRANSLATION_9": "On the Day when those who deny the truth are brought before the Fire, it will be said to them, \"You have had the good things of the life of this world, and you enjoyed them. Now this Day you shall be requited with humiliating punishment, because you were arrogant in the land without justification, and because you acted rebelliously.\"\n",
        "TRANSLATION_10": "And on the Day whereon those who disbelieve shall be placed before the Fire: ye made away with your good things in your life of the world, and ye enjoyed yourselves therewith so Today ye shall be requited with the torment of ignominy, for that ye have been growing stiff-necked on the earth without justification, and for that ye have been transgressing.\n",
        "TRANSLATION_11": "The day when the faithless are exposed to the Fire, [they will be told,] ‘You have exhausted your good things in the life of the world and enjoyed them. So today you will be requited with a humiliating punishment for your acting arrogantly in the earth unduly, and because you used to transgress.’\n",
        "TRANSLATION_12": "And on the Day that the Unbelievers will be placed before the Fire, (It will be said to them): \"Ye received your good things in the life of the world, and ye took your pleasure out of them: but today shall ye be recompensed with a Penalty of humiliation: for that ye were arrogant on earth without just cause, and that ye (ever) transgressed.\"\n",
        "TRANSLATION_13": "On the Day when those who disbelieve (in the Oneness of Allah Islamic Monotheism) will be exposed to the Fire (it will be said): \"You received your good things in the life of the world, and you took your pleasure therein. Now this Day you shall be recompensed with a torment of humiliation, because you were arrogant in the land without a right, and because you used to rebel and disobey (Allah).\n",
        "TRANSLATION_14": "Upon the Day when the unbelievers are brought before the Fire, (We shall say to them): 'You squandered your good things in your earthly life and took your fill of enjoyment in them, therefore today you shall be recompensed with a humiliating punishment, because you were unrightfully proud in the earth and for that you were debauchers'\n",
        "TRANSLATION_15": "On the Day when the faithless will be paraded before the Fire: “You have squandered your good in your worldly life, and you took pleasure in them. So today you are being repaid with the torment of shame, because of your unjust arrogance on earth, and because you used to sin.”\n",
        "TRANSLATION_16": "And the Day those who disbelieved are exposed to the Fire [it will be said], \"You exhausted your pleasures during your worldly life and enjoyed them, so this Day you will be awarded the punishment of [extreme] humiliation because you were arrogant upon the earth without right and because you were defiantly disobedient.\"\n",
        "TRANSLATION_17": "[46:20] And on the day when those who disbelieve are exposed to the Fire, by its being revealed for them, it will be said to them: ‘You squandered (read with one hamza, adhhabtum, or with two hamzas [as an interrogative], a-adhhabtum, ‘have you sqaundered …?’; or with one hamza, adhhabtum, or with an initial long ‘a’, ādhhabtum, with both of these [pronounced fully] or without pronouncing the second [hamza]) your good things during your life of the world, by preoccupying yourselves with sensual delights, and enjoyed them. So today you will be requited with the chastisement of humiliation in return for acting arrogantly in the earth without right and in return for that regarding which you used to act immorally’, and [for] the torture you used to inflict [upon others] therein.\n",
        "TRANSLATION_18": "(And on the day when those who disbelieve are exposed to the Fire) before they actually enter it, ((it will be said)) to them: (Ye squandered your good things) you have used up the reward of your deeds (in the life of the world and sought comfort therein) and obtained benefit from the reward of your deeds in the life of the world. (Now this day ye are rewarded with the) severe (doom of ignominy because ye were disdainful) because you were too proud to accept faith (in the land without a right and because ye used to transgress) and because you used to disbelieve and transgress on the earth in the life of the world.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "46:20",
            "46:34",
            "42:42",
            "40:75",
            "2:86",
            "10:23",
            "34:42",
            "2:212",
            "7:51",
            "38:26"
        ],
        "BIBLE": [
            "prophets:ezekiel:17:12",
            "writings:nehemiah:9:25",
            "prophets:ii%20kings:8:9",
            "prophets:ii%20samuel:4:10",
            "prophets:isaiah:53:8",
            "writings:ecclesiastes:5:17",
            "prophets:ii%20kings:10:15",
            "torah:exodus:16:32",
            "torah:deuteronomy:1:25",
            "torah:exodus:14:11"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:4:1"
        ]
    }
}