{
    "VERSE": "46:21",
    "ARABIC": "وَٱذْكُرْ أَخَا عَادٍ إِذْ أَنذَرَ قَوْمَهُۥ بِٱلْأَحْقَافِ وَقَدْ خَلَتِ ٱلنُّذُرُ مِنۢ بَيْنِ يَدَيْهِ وَمِنْ خَلْفِهِۦٓ أَلَّا تَعْبُدُوٓا۟ إِلَّا ٱللَّهَ إِنِّىٓ أَخَافُ عَلَيْكُمْ عَذَابَ يَوْمٍ عَظِيمٍ",
    "ENGLISH": {
        "TRANSLATION_0": "Remember the brother of 'Ad when he warned his people by the sand-dunes - and warners passed away before and after him - 'Worship no one but Allah. I fear for you the punishment of a terrible Day.'",
        "TRANSLATION_1": "Remember (Hud) the brother of 'Ad. When he warned his people in Ahqaf -- though many a warner had come and gone before and after him: \"Do not worship any one but God, for I fear the punishment of an awful day for you,\"\n",
        "TRANSLATION_2": "Recount to them the story of (Hud), the brother of (the tribe of) 'Ad. Hud warned his people beside the sand-dunes -- and there have been other warners before him and since his time -- saying: “Serve none but Allah. Verily I fear that the chastisement of an awesome day shall come upon you.”\n",
        "TRANSLATION_3": "(Muhammad), recall the brother of the people of Ad, when he warned his people in the valley of al-ahqaf saying, \"There existed many warners before and after him. Do not worship anything other than God. I am afraid for you about the torment of the great Day\".\n",
        "TRANSLATION_4": "And remember the fellowman of the tribe of A’ad; when he warned his nation in the Ahqaf* – and indeed Heralds of warning passed away before and after him – that, “Do not worship anyone except Allah; indeed I fear the punishment of a Great Day upon you. (* A country among sand dunes.)\n",
        "TRANSLATION_5": "And remember the brother of `Ad, when he warned his people in Al-Ahqaf. And surely, warners had already passed on before him and after him (saying): \"Worship none but Allah; truly, I fear for you the torment of a mighty Day.\"\n",
        "TRANSLATION_6": "And mention the brother of Ad; when he warned his people in the sandy plains,-- and indeed warners came before him and after him-- saying Serve none but Allah; surely I fear for you the punishment of a grievous day.\n",
        "TRANSLATION_7": "And remember the brother of Ad, when he warned his people beside the sand-dunes -- and already warners had passed away alike before him and behind him -- saying, 'Serve none but God! Truly I fear for you the chastisement of a dreadful day.\n",
        "TRANSLATION_8": "And make mention (O Muhammad) of the brother of A'ad when he warned his folk among the wind-curved sandhills - and verily warners came and went before and after him - saying: Serve none but Allah. Lo! I fear for you the doom of a tremendous Day.\n",
        "TRANSLATION_9": "Tell of the brother of 'Ad; when he warned his people in the sand dunes -- and indeed warners came and went before him and after him -- saying, \"Worship none but God; surely I fear for you the punishment of an awful Day,\"\n",
        "TRANSLATION_10": "And remember thou the brother of the Aad when We warned his people in the sandhills - and surely there have passed away warners before him and after him - saying: worship none save Allah, verily I fear for you the torment of a mighty Day.\n",
        "TRANSLATION_11": "And mention [Hud] the brother of ‘Ad, when he warned his people at Ahqaf—and warners have passed away before and after him—saying, ‘Do not worship anyone but Allah. Indeed I fear for you the punishment of a tremendous day.’\n",
        "TRANSLATION_12": "Mention (Hud) one of 'Ad's (own) brethren: Behold, he warned his people about the winding Sand-tracts: but there have been warners before him and after him: \"Worship ye none other than Allah: Truly I fear for you the Penalty of a Mighty Day.\"\n",
        "TRANSLATION_13": "And remember (Hud) the brother of 'Ad, when he warned his people in Al-Ahqaf (the curved sand-hills in the southern part of Arabian Peninsula). And surely, there have passed away warners before him and after him (saying): \"Worship none but Allah; truly, I fear for you the torment of a mighty Day.\"\n",
        "TRANSLATION_14": "Remember Aad's brother who warned his nation in (the valley of) Al Ahqaf. Warners had already preceded and succeeded him saying: 'Worship noneexcept Allah! (he said) 'Indeed, I fear for you the punishment of a Dreadful Day'\n",
        "TRANSLATION_15": "And mention the brother of Aad, as he warned his people at the dunes. Warnings have passed away before him, and after him: “Worship none but God; I fear for you the punishment of a tremendous Day.”\n",
        "TRANSLATION_16": "And mention, [O Muhammad], the brother of 'Aad, when he warned his people in the [region of] al-Ahqaf - and warners had already passed on before him and after him - [saying], \"Do not worship except Allah. Indeed, I fear for you the punishment of a terrible day.\"\n",
        "TRANSLATION_17": "[46:21] And mention the brother of ‘Ād, namely, Hūd, peace be upon him, when (idh … [from here] to the end [of the verse] constitutes an inclusive substitution) he warned his people, he threatened them, at Ahqāf, [‘the Sand dunes’ is the name of] a valley in Yemen, where their dwellings were located — and already warners, messengers, had passed away before him and after him, that is to say, before Hūd [came to them] and after him, to their peoples — saying, ‘Do not worship anyone but God (the statement [beginning with] wa-qad khalat, ‘and already [warners] had passed away’, is a parenthetical one). Truly I fear for you — should you   worship other than God — the chastisement of a dreadful day’.\n",
        "TRANSLATION_18": "(And make mention) Muhammad to the disbelievers of Mecca (of the brother of 'Aad) the Prophet of the Banu 'Aad, i.e. Hud (when he warned his folk among the wind-curved sandhills) He says: he warned his folk of the mountains of fire; it is also said: he warned his people from a mountain near Yemen; and it is said: near Historic Syria; and it is said: from the mountain of al-Raml; and it is said in a place near Yemen, (and verily warners came and went before) before Hud (and after him) and after Hud (saying: Serve none but Allah) Hud said to them: declare the divine Oneness of none other than Allah. (Lo! I fear for you) I know that (the doom of a tremendous Day) a severe torment will befall you if you reject faith.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "46:21",
            "11:26",
            "7:59",
            "12:87",
            "11:84",
            "41:14",
            "34:46",
            "26:135",
            "22:76",
            "13:11"
        ],
        "BIBLE": [
            "torah:exodus:34:10",
            "prophets:ii%20samuel:7:23",
            "writings:daniel:6:13",
            "prophets:i%20kings:18:36",
            "writings:i%20chronicles:17:21",
            "torah:exodus:32:30",
            "prophets:ii%20kings:3:20",
            "prophets:joshua:23:7",
            "torah:deuteronomy:4:10",
            "torah:deuteronomy:9:7"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:4:3"
        ]
    }
}