{
    "VERSE": "46:24",
    "ARABIC": "فَلَمَّا رَأَوْهُ عَارِضًا مُّسْتَقْبِلَ أَوْدِيَتِهِمْ قَالُوا۟ هَٰذَا عَارِضٌ مُّمْطِرُنَا بَلْ هُوَ مَا ٱسْتَعْجَلْتُم بِهِۦ رِيحٌ فِيهَا عَذَابٌ أَلِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "When they saw it as a storm cloud advancing on their valleys they said, 'This is a storm cloud which will give us rain.' No, rather it is what you desired to hasten - a wind containing painful punishment,",
        "TRANSLATION_1": "So when they saw it as a cloud advancing towards their valleys, they said: \"This is just a passing cloud that will bring us rain.\" \"No. It is what you were trying to hasten: The wind which carries the grievous punishment!\n",
        "TRANSLATION_2": "When they saw the scourge advancing towards their valleys, they said: “This is a cloud that will bring much rain to us.” “By no means; it is what you had sought to hasten -- a wind-storm bearing a grievous chastisement\n",
        "TRANSLATION_3": "When they saw the torment as a cloud proceeding to their valleys, they said, \"This cloud will bring us rain.\" He said, \"No, it is the torment which you wanted to suffer immediately. It is a wind bearing and painful torment.\n",
        "TRANSLATION_4": "So when they saw the punishment coming towards their valleys, spread like a cloud on the horizon, they said, “That is a cloud which will shower rain upon us”; said Hud “In fact this is what you were being impatient for; a windstorm carrying a painful punishment.”\n",
        "TRANSLATION_5": "Then, when they saw it as a dense cloud approaching their valleys, they said: \"This is a cloud bringing us rain!\" Nay, but it is that which you were asking to be hastened - a wind wherein is a painful torment!\n",
        "TRANSLATION_6": "So when they saw it as a cloud appearing in the sky advancing towards their valleys, they said: This is a cloud which will give us rain. Nay! it is what you sought to hasten on, a blast of wind in which is a painful punishment,\n",
        "TRANSLATION_7": "Then, when they saw it as a sudden cloud coming towards their valleys, they said, 'This is a cloud, that shall give us rain!' 'Not so; rather it is that you sought to hasten -- a wind, wherein is a painful chastisement,\n",
        "TRANSLATION_8": "Then, when they beheld it as a dense cloud coming toward their valleys, they said: Here is a cloud bringing us rain. Nay, but it is that which ye did seek to hasten, a wind wherein is painful torment,\n",
        "TRANSLATION_9": "So, when they saw it in the shape of a dense cloud approaching their valleys, they exclaimed, \"This is only a heavy cloud which will bring us [welcome] rain!\" [But Hud said]: \"By no means! It is the very thing which you sought to hasten -- a wind bearing grievous suffering\n",
        "TRANSLATION_10": "Then when they beheld it as an overpeering cloud tending toward their valleys they said: yonder is an overpeering cloud bringing us rain. Nay it is that which ye sought to be hastened: a wind wherein is a torment afflictive.\n",
        "TRANSLATION_11": "When they saw it as a cloud advancing toward their valleys, they said, ‘This cloud brings us rain.’ ‘No, it is what you sought to hasten: a hurricane carrying a painful punishment,\n",
        "TRANSLATION_12": "Then, when they saw the (Penalty in the shape of) a cloud traversing the sky, coming to meet their valleys, they said, \"This cloud will give us rain!\" \"Nay, it is the (Calamity) ye were asking to be hastened!- A wind wherein is a Grievous Penalty!\n",
        "TRANSLATION_13": "Then, when they saw it as a dense cloud coming towards their valleys, they said: \"This is a cloud bringing us rain!\" Nay, but it is that (torment) which you were asking to be hastened! a wind wherein is a painful torment!\n",
        "TRANSLATION_14": "And when they saw it as a sudden cloud heading for their valley they said: 'This is a cloud that will bring us rain' 'Rather' (he replied): 'it is that which you have sought to hasten, a wind in which there is a painful punishment.\n",
        "TRANSLATION_15": "Then, when they saw a cloud approaching their valley, they said, “This is a cloud that will bring us rain.” “In fact, it is what you were impatient for: a wind in which is grievous suffering.”\n",
        "TRANSLATION_16": "And when they saw it as a cloud approaching their valleys, they said, \"This is a cloud bringing us rain!\" Rather, it is that for which you were impatient: a wind, within it a painful punishment,\n",
        "TRANSLATION_17": "[46:24] Then, when they saw it, that is, [when they saw] what chastisement [really] was, as a sudden cloud, a cloud that appeared [out of nowhere] on the horizon, heading towards their valleys, they said, ‘This is a cloud that will bring us rain!’. God, exalted be He, says: Nay, but it is what you sought to hasten, of the chastisement — a hurricane (rīhun substitutes for mā, ‘what’) containing a painful chastisement,\n",
        "TRANSLATION_18": "(Then when they beheld it a dense cloud coming towards their valleys, they said; Here is a cloud bringing us rain) bringing rain to our fields. Hud said to them: (Nay, but it is that which ye did seek to hasten) of punishment, (a wind wherein is painful torment,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "46:24",
            "84:24",
            "51:37",
            "26:201",
            "76:31",
            "2:10",
            "31:7",
            "34:5",
            "2:104",
            "4:138"
        ],
        "BIBLE": [
            "writings:ii%20chronicles:24:11",
            "prophets:ii%20kings:6:20",
            "writings:i%20chronicles:12:18",
            "prophets:isaiah:49:21",
            "prophets:jeremiah:16:19",
            "prophets:judges:11:35",
            "prophets:i%20samuel:10:14",
            "torah:genesis:45:27",
            "prophets:judges:16:18",
            "prophets:ii%20kings:2:15"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:5:2"
        ]
    }
}