{
    "VERSE": "46:27",
    "ARABIC": "وَلَقَدْ أَهْلَكْنَا مَا حَوْلَكُم مِّنَ ٱلْقُرَىٰ وَصَرَّفْنَا ٱلْءَايَٰتِ لَعَلَّهُمْ يَرْجِعُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "We destroyed the cities round about you and have variegated the Signs so that hopefully they will turn back.",
        "TRANSLATION_1": "We have destroyed habitations all around you, having explained Our signs in different ways to them that they may turn back.\n",
        "TRANSLATION_2": "Surely We destroyed many a town around you. We sent Our Messages to them repeatedly and in diverse forms that they may eschew (their evil ways) and return (to Allah).\n",
        "TRANSLATION_3": "We destroyed some towns around you and showed you the evidence (of the Truth) so that perhaps you would turn (to God).\n",
        "TRANSLATION_4": "And We indeed destroyed townships surrounding you, and brought several signs so that they may desist.\n",
        "TRANSLATION_5": "And indeed We have destroyed towns round about you, and We have shown (them) the signs in various ways so that they might return.\n",
        "TRANSLATION_6": "And certainly We destroyed the towns which are around you, and We repeat the communications that they might turn.\n",
        "TRANSLATION_7": "And We destroyed the cities about you, and We turned about the signs, that haply they would return.\n",
        "TRANSLATION_8": "And verily We have destroyed townships round about you, and displayed (for them) Our revelation, that haply they might return.\n",
        "TRANSLATION_9": "We have also destroyed other towns that once [flourished] around you, We had given them various signs so that they might return [to the right path],\n",
        "TRANSLATION_10": "And assuredly We have destroyed the cities round about you. and We have variously propounded our signs, that haply they might return.\n",
        "TRANSLATION_11": "Certainly We have destroyed the towns that were around you, and We have variously paraphrased the signs so that they may come back.\n",
        "TRANSLATION_12": "We destroyed aforetime populations round about you; and We have shown the Signs in various ways, that they may turn (to Us).\n",
        "TRANSLATION_13": "And indeed We have destroyed towns (populations) round about you, and We have (repeatedly) shown (them) the Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) in various ways that they might return (to the truth and believe in the Oneness of Allah - Islamic Monotheism).\n",
        "TRANSLATION_14": "We destroyed the villages around you and We repeated Our signs so that they might return.\n",
        "TRANSLATION_15": "We have destroyed many townships around you, and diversified the signs, so that they may return.\n",
        "TRANSLATION_16": "And We have already destroyed what surrounds you of [those] cities, and We have diversified the signs [or verses] that perhaps they might return [from disbelief].\n",
        "TRANSLATION_17": "[46:27] And We certainly destroyed the towns [that were] around you, that is, [We destroyed] their inhabitants, the likes of Thamūd, ‘Ād and the people of Lot, and We dispensed the signs, We repeated the clear proofs, so that perhaps they might return.\n",
        "TRANSLATION_18": "(And verily We have destroyed townships round about you) people of Mecca, (and displayed (for them) Our revelation) and explained the revelations detailing the commands, prohibitions and the destruction of those whom We had destroyed, (that haply they might return) from their disbelief and repent.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "46:27",
            "44:33",
            "28:51",
            "15:24",
            "54:15",
            "12:82",
            "42:35",
            "43:69",
            "23:30",
            "78:28"
        ],
        "BIBLE": [
            "prophets:jeremiah:35:15",
            "prophets:jeremiah:25:5",
            "prophets:i%20samuel:10:9",
            "prophets:joshua:23:15",
            "prophets:amos:4:6",
            "prophets:ezekiel:18:30",
            "torah:deuteronomy:3:20",
            "writings:psalms:60:6",
            "writings:ii%20chronicles:9:12",
            "prophets:i%20kings:13:5"
        ]
    }
}