{
    "VERSE": "18:1",
    "ARABIC": "بِسْمِ ٱللَّهِ ٱلرَّحْمَٰنِ ٱلرَّحِيمِ ٱلْحَمْدُ لِلَّهِ ٱلَّذِىٓ أَنزَلَ عَلَىٰ عَبْدِهِ ٱلْكِتَٰبَ وَلَمْ يَجْعَل لَّهُۥ عِوَجَا",
    "ENGLISH": {
        "TRANSLATION_0": "Praise belongs to Allah Who has sent down the Book to His slave and has put no crookedness in it.",
        "TRANSLATION_1": "ALL PRAISE BE to God who has revealed to His votary the Book which is free of all obliquity,\n",
        "TRANSLATION_2": "Praise be to Allah Who has revealed to His servant the Book devoid of all crookedness;\n",
        "TRANSLATION_3": "Praise be to God. He has sent the Book to His servant and has made it a flawless guide (for human beings)\n",
        "TRANSLATION_4": "All praise is to Allah Who sent down the Book upon His bondman, and has not kept any deviation in it.\n",
        "TRANSLATION_5": "All praise is due to Allah, Who has sent down to His servant the Book, and has not placed therein any crookedness.\n",
        "TRANSLATION_6": "(All) praise is due to Allah, Who revealed the Book to His servant and did not make in it any crookedness.\n",
        "TRANSLATION_7": "Praise belongs to God who has sent down upon His servant the Book and has not assigned unto it any crookedness;\n",
        "TRANSLATION_8": "Praise be to Allah Who hath revealed the Scripture unto His slave, and hath not placed therein any crookedness,\n",
        "TRANSLATION_9": "Praise be to God who has sent down to His servant -- the Book, which is free from any ambiguity\n",
        "TRANSLATION_10": "All praise unto Allah who hath sent down unto His bondman the Book, and hath not placed therein any crookedness.\n",
        "TRANSLATION_11": "All praise belongs to Allah, who has sent down the Book to His servant and did not let any crookedness be in it,\n",
        "TRANSLATION_12": "Praise be to Allah, Who hath sent to His Servant the Book, and hath allowed therein no Crookedness:\n",
        "TRANSLATION_13": "All the praises and thanks be to Allah, Who has sent down to His slave (Muhammad SAW) the Book (the Quran), and has not placed therein any crookedness.\n",
        "TRANSLATION_14": "Praise belongs to Allah who has sent down the Book to His worshiper (Prophet Muhammad) and has not made any crookedness in it,\n",
        "TRANSLATION_15": "Praise be to God, who revealed the Book to His servant, and allowed in it no distortion.\n",
        "TRANSLATION_16": "[All] praise is [due] to Allah, who has sent down upon His Servant the Book and has not made therein any deviance.\n",
        "TRANSLATION_17": "[18:1] Praise — which is the attribution [to a person] of that which is beautiful — is established [as something that], belongs to God [alone], exalted be He. Now, is the intention here to point this out for the purpose of believing in it, or to praise [God] thereby, or both? All are possibilities, the most profitable of which is [to understand] the third [as being the intention behind this statement]; Who has revealed to His servant, Muhammad (s), the Book, the Qur’ān, and has not allowed for it, that is, [He has not allowed that there be] in it, any crookedness, [any] variance or contradiction (the [last] sentence [wa-lam yaj‘al lahu ‘iwajan] is a circumstantial qualifier referring to al-kitāb, ‘the Book’);\n",
        "TRANSLATION_18": "And from his own narration on the authority of Ibn 'Abbas that he said regarding the meaning of Allah's words (Praise be to Allah): '(Praise be to Allah) He says: gratitude is Allah's and divinity is His (Who hath revealed the Scripture) who has sent Gabriel with the Qur'an (unto His slave) Muhammad (pbuh) (and hath not placed therein any crookedness) He did not reveal it as different from the Torah, the Gospel or other Scriptures, as far as divine Oneness and the attributes and description of Muhammad (pbuh) are concerned. This verse was revealed about the Jews when they claimed that the Qur'an was different from all previous Scriptures,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "18:1",
            "27:59",
            "27:15",
            "19:30",
            "13:39",
            "7:196",
            "9:104",
            "14:39",
            "3:20",
            "37:182"
        ],
        "BIBLE": [
            "prophets:jeremiah:34:10",
            "writings:ecclesiastes:7:13",
            "prophets:jeremiah:34:9",
            "prophets:i%20kings:11:34",
            "prophets:jeremiah:16:20",
            "writings:ii%20chronicles:30:5",
            "writings:psalms:66:8",
            "prophets:ii%20samuel:23:5",
            "prophets:i%20kings:19:2",
            "torah:deuteronomy:26:19"
        ]
    }
}