{
    "VERSE": "18:100",
    "ARABIC": "وَعَرَضْنَا جَهَنَّمَ يَوْمَئِذٍ لِّلْكَٰفِرِينَ عَرْضًا",
    "ENGLISH": {
        "TRANSLATION_0": "That Day We will display Hell in its totality to the kafirun,",
        "TRANSLATION_1": "Then We shall bring Hell right before the infidels\n",
        "TRANSLATION_2": "That will be the Day We shall place Hell before the unbelievers\n",
        "TRANSLATION_3": "We will fully expose the view of hell on that Day to the disbelievers,\n",
        "TRANSLATION_4": "And We shall bring hell in front of the disbelievers.\n",
        "TRANSLATION_5": "And on that Day We shall present Hell to the disbelievers, plain to view.\n",
        "TRANSLATION_6": "And We will bring forth hell, exposed to view, on that day before the unbelievers.\n",
        "TRANSLATION_7": "and upon that day We shall present Gehenna to the unbelievers\n",
        "TRANSLATION_8": "On that day we shall present hell to the disbelievers, plain to view,\n",
        "TRANSLATION_9": "On that Day We shall lay Hell bare before those who deny the truth,\n",
        "TRANSLATION_10": "And We shall set hell on that Day unto the infidels with a setting.\n",
        "TRANSLATION_11": "and on that day We shall bring hell into view visibly for the faithless.\n",
        "TRANSLATION_12": "And We shall present Hell that day for Unbelievers to see, all spread out,-\n",
        "TRANSLATION_13": "And on that Day We shall present Hell to the disbelievers, plain to view,\n",
        "TRANSLATION_14": "On that Day We shall present Gehenna (Hell) to the unbelievers,\n",
        "TRANSLATION_15": "On that Day, We will present the disbelievers to Hell, all displayed.\n",
        "TRANSLATION_16": "And We will present Hell that Day to the Disbelievers, on display -\n",
        "TRANSLATION_17": "[18:100] And on that day We shall present, We shall bring close, Hell to the disbelievers, plain to view,\n",
        "TRANSLATION_18": "(On that day) the Day of Judgement (We shall present hell) We shall reveal hell (to the disbelievers) before they enter it, (plain to view) clear for them to see,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "18:100",
            "15:9",
            "17:18",
            "94:4",
            "21:71",
            "70:2",
            "70:25",
            "56:73",
            "51:48",
            "26:224"
        ],
        "BIBLE": [
            "prophets:isaiah:42:4",
            "prophets:ezekiel:21:21",
            "torah:leviticus:27:11",
            "torah:genesis:43:9",
            "prophets:judges:6:18",
            "torah:numbers:5:16",
            "prophets:jeremiah:17:11",
            "prophets:isaiah:46:13",
            "torah:leviticus:24:8",
            "torah:genesis:48:20"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:13",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:1"
        ]
    }
}