{
    "VERSE": "18:101",
    "ARABIC": "ٱلَّذِينَ كَانَتْ أَعْيُنُهُمْ فِى غِطَآءٍ عَن ذِكْرِى وَكَانُوا۟ لَا يَسْتَطِيعُونَ سَمْعًا",
    "ENGLISH": {
        "TRANSLATION_0": "those whose eyes were blind to My remembrance and whose ears were unable to hear.",
        "TRANSLATION_1": "Whose eyes were veiled against My warning, and they could not hear.\n",
        "TRANSLATION_2": "whose eyes had become blind against My admonition and who were utterly disinclined to hear it.\n",
        "TRANSLATION_3": "whose eyes had been veiled against Our Quran and who were not able to hear (its recitation).\n",
        "TRANSLATION_4": "The ones whose eyes were covered from My remembrance, and who could not bear to hear Truth.\n",
        "TRANSLATION_5": "(To) those whose eyes had been under a covering from My Reminder, and they could not bear to hear (it).\n",
        "TRANSLATION_6": "They whose eyes were under a cover from My reminder and they could not even hear.\n",
        "TRANSLATION_7": "whose eyes were covered against My remembrance, and they were not able to hear.\n",
        "TRANSLATION_8": "Those whose eyes were hoodwinked from My reminder, and who could not bear to hear.\n",
        "TRANSLATION_9": "who have turned a blind eye to My reminder and a deaf ear to My warning.\n",
        "TRANSLATION_10": "Unto those whose eyes had been under a covering from My remembrance, nor had they been able to hear.\n",
        "TRANSLATION_11": "—Those whose eyes were blind to My remembrance and who could not hear.\n",
        "TRANSLATION_12": "(Unbelievers) whose eyes had been under a veil from remembrance of Me, and who had been unable even to hear.\n",
        "TRANSLATION_13": "(To) Those whose eyes had been under a covering from My Reminder (this Quran), and who could not bear to hear (it).\n",
        "TRANSLATION_14": "whose eyes were blinded to My remembrance and they were not able to hear.\n",
        "TRANSLATION_15": "Those whose eyes were screened to My message, and were unable to hear.\n",
        "TRANSLATION_16": "Those whose eyes had been within a cover [removed] from My remembrance, and they were not able to hear.\n",
        "TRANSLATION_17": "[18:101] those [disbelievers] whose eyes (alladhīna kānat a‘yunuhum substitutes for al-kāfirīna, ‘the disbelievers’) were masked from My remembrance, namely, the Qur’ān, such that they were blind, unable to be guided thereby, and who could not [bear to] hear, that is to say, they were unable to listen to what the Prophet used to recite to them, out of spite for him, and so they did not believe therein.\n",
        "TRANSLATION_18": "(Those whose eyes were hoodwinked) those whose eyes were blind (from My reminder) to My divine Oneness and Scripture, (and who could not bear to hear) the recitation of the Qur'an due to their hatred of the Prophet Muhammad (pbuh).\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "18:101",
            "11:37",
            "55:50",
            "43:75",
            "76:18",
            "88:12",
            "9:92",
            "21:23",
            "90:8",
            "26:87"
        ],
        "BIBLE": [
            "prophets:judges:4:18",
            "prophets:jonah:3:8",
            "prophets:jeremiah:44:5",
            "prophets:zechariah:7:11",
            "writings:psalms:91:4",
            "prophets:jeremiah:31:19",
            "writings:psalms:69:8",
            "prophets:ezekiel:12:12",
            "prophets:isaiah:50:5",
            "writings:job:24:15"
        ]
    }
}