{
    "VERSE": "18:103",
    "ARABIC": "قُلْ هَلْ نُنَبِّئُكُم بِٱلْأَخْسَرِينَ أَعْمَٰلًا",
    "ENGLISH": {
        "TRANSLATION_0": "Say: 'Shall I inform you of the greatest losers in their actions?",
        "TRANSLATION_1": "Say: \"Shall I tell you whose labour will be wasted?\n",
        "TRANSLATION_2": "Say, (O Muhammad): \"Shall We tell you who will be the greatest losers in respect of their works?\n",
        "TRANSLATION_3": "(Muhammad), tell them, \"Should I tell you who will face the greatest loss as a result of their deeds?\n",
        "TRANSLATION_4": "Say (O dear Prophet Mohammed – peace and blessings be upon him), “Shall we inform you whose are the most failed works?”\n",
        "TRANSLATION_5": "Say: \"Shall We tell you the greatest losers in respect of (their) deeds\"\n",
        "TRANSLATION_6": "Say: Shall We inform you of the greatest losers in (their) deeds?\n",
        "TRANSLATION_7": "Say: 'Shall We tell you who will be the greatest losers in their works?\n",
        "TRANSLATION_8": "Say: Shall We inform you who will be the greatest losers by their works?\n",
        "TRANSLATION_9": "Say, \"Shall I tell you of those who will lose the most through their actions?\n",
        "TRANSLATION_10": "Say thou: shall I declare unto you the greatest losers in respect of works?\n",
        "TRANSLATION_11": "Say, ‘Shall we inform you who are the biggest losers in their works?\n",
        "TRANSLATION_12": "Say: \"Shall we tell you of those who lose most in respect of their deeds?-\n",
        "TRANSLATION_13": "Say (O Muhammad SAW): \"Shall We tell you the greatest losers in respect of (their) deeds?\n",
        "TRANSLATION_14": "Say: 'Shall we tell you of those who are the greatest losers in deeds'\n",
        "TRANSLATION_15": "Say, “Shall We inform you of the greatest losers in their works?”\n",
        "TRANSLATION_16": "Say, [O Muhammad], \"Shall we [believers] inform you of the greatest losers as to [their] deeds?\n",
        "TRANSLATION_17": "[18:103] Say: ‘Shall We inform you who will be the greatest losers in [regard to] their works? (al-akhsarīna a‘mālan, a specification that happens to correspond to that which is specifically meant); and these [losers] are described in His words [as being]:\n",
        "TRANSLATION_18": "(Say) O Muhammad: (Shall We inform you who will be the greatest losers by their works) in the Hereafter?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "18:103",
            "26:168",
            "7:147",
            "27:4",
            "21:70",
            "68:6",
            "10:81",
            "26:98",
            "47:33",
            "23:67"
        ],
        "BIBLE": [
            "writings:psalms:40:6",
            "writings:psalms:71:17",
            "prophets:isaiah:26:12",
            "writings:psalms:118:17",
            "writings:psalms:96:3",
            "writings:i%20chronicles:16:24",
            "writings:psalms:92:6",
            "writings:psalms:107:22",
            "writings:daniel:2:4",
            "writings:nehemiah:6:14"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:1:13"
        ]
    }
}