{
    "VERSE": "18:106",
    "ARABIC": "ذَٰلِكَ جَزَآؤُهُمْ جَهَنَّمُ بِمَا كَفَرُوا۟ وَٱتَّخَذُوٓا۟ ءَايَٰتِى وَرُسُلِى هُزُوًا",
    "ENGLISH": {
        "TRANSLATION_0": "That is their repayment - Hell - because they were kafir and made a mockery of My Signs and of My",
        "TRANSLATION_1": "Their requital will be Hell, because they disbelieved and mocked My signs and messengers.\n",
        "TRANSLATION_2": "Hell is their recompense for disbelieving and their taking My revelations and My Messengers as objects of jest.\n",
        "TRANSLATION_3": "For their disbelief and their mocking Our revelations and Messengerss, their recompense will be hell.\n",
        "TRANSLATION_4": "This is their reward – hell – because they disbelieved, and made a mockery of My verses and My Noble Messengers.\n",
        "TRANSLATION_5": "That shall be their recompense, Hell; because they disbelieved and took My Ayat and My Messengers for jest.\"\n",
        "TRANSLATION_6": "Thus it is that their recompense is hell, because they disbelieved and held My communications and My apostles in mockery.\n",
        "TRANSLATION_7": "That is their recompense -- Gehenna for that they were unbelievers and took My signs and My messengers in mockery.\n",
        "TRANSLATION_8": "That is their reward: hell, because they disbelieved, and made a jest of Our revelations and Our messengers.\n",
        "TRANSLATION_9": "Hell will be their reward, because they denied the truth, and made a jest of My signs and My messengers.\n",
        "TRANSLATION_10": "That shall be their meed--Hell-for they disbelieved and held My revelations and My apostles in mockery.\n",
        "TRANSLATION_11": "That is their requital—hell—because of their unfaith and for deriding My signs and apostles.\n",
        "TRANSLATION_12": "That is their reward, Hell, because they rejected Faith, and took My Signs and My Messengers by way of jest.\n",
        "TRANSLATION_13": "That shall be their recompense, Hell; because they disbelieved and took My Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) and My Messengers by way of jest and mockery.\n",
        "TRANSLATION_14": "Gehenna is their recompense; because they disbelieved and mocked My verses, and My Messengers.\n",
        "TRANSLATION_15": "That is their requital—Hell—on account of their disbelief, and their taking My revelations and My messengers in mockery.\n",
        "TRANSLATION_16": "That is their recompense - Hell - for what they denied and [because] they took My signs and My messengers in ridicule.\n",
        "TRANSLATION_17": "[18:106] That, namely, the matter which I [God] have mentioned concerning the failure of their deeds and so on (dhālika, ‘that’, constitutes the subject) is their requital — Hell — because they disbelieved and took My signs and My messengers in mockery, that is to say, [taking] both of them as something to be derided.\n",
        "TRANSLATION_18": "(That is their reward: hell, because they disbelieved) in Muhammad (pbuh) and in the Qur'an, (and made a jest) and mockery (of Our revelations) Our Scripture (and Our messengers) Muhammad (pbuh) and others.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "18:106",
            "56:24",
            "18:56",
            "9:26",
            "25:41",
            "9:65",
            "40:63",
            "43:69",
            "78:28",
            "15:11"
        ],
        "BIBLE": [
            "writings:psalms:119:9",
            "prophets:jeremiah:50:33",
            "prophets:jeremiah:6:11",
            "prophets:isaiah:40:14",
            "writings:proverbs:20:16",
            "writings:proverbs:27:13",
            "torah:genesis:12:19",
            "prophets:jeremiah:10:2",
            "torah:genesis:4:15",
            "prophets:i%20samuel:8:3"
        ]
    }
}