{
    "VERSE": "18:107",
    "ARABIC": "إِنَّ ٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّٰلِحَٰتِ كَانَتْ لَهُمْ جَنَّٰتُ ٱلْفِرْدَوْسِ نُزُلًا",
    "ENGLISH": {
        "TRANSLATION_0": "Those who have iman and do right actions will have the Gardens of Firdaws as hospitality,",
        "TRANSLATION_1": "But surely those who believe and do the right will have gardens of Paradise as gift,\n",
        "TRANSLATION_2": "As for those who believe and do good works, the Gardens of Paradise shall be there to welcome them;\n",
        "TRANSLATION_3": "The righteously striving believers will have the gardens of Paradise as their dwelling place and therein they will live forever,\n",
        "TRANSLATION_4": "Indeed those who believed and did good deeds – their welcome are the Gardens of Paradise.\n",
        "TRANSLATION_5": "Verily, those who believe and do righteous deeds, shall have the Gardens of Al-Firdaws for their entertainment.\"\n",
        "TRANSLATION_6": "Surely (as for) those who believe and do good deeds, their place of entertainment shall be the gardens of paradise,\n",
        "TRANSLATION_7": "But those who believe, and do deeds of righteousness -- the Gardens. of Paradise shall be their hospitality,\n",
        "TRANSLATION_8": "Lo! those who believe and do good works, theirs are the Gardens of Paradise for welcome,\n",
        "TRANSLATION_9": "Those who believe and do good works shall have the gardens of Paradise for their abode.\n",
        "TRANSLATION_10": "Verily those who believe and do righteous works, unto them shall be gardens of Paradise for an entertainment.\n",
        "TRANSLATION_11": "As for those who have faith and do righteous deeds, they shall have the gardens of Firdaws for abode,\n",
        "TRANSLATION_12": "As to those who believe and work righteous deeds, they have, for their entertainment, the Gardens of Paradise,\n",
        "TRANSLATION_13": "Verily! Those who believe (in the Oneness of Allah Islamic Monotheism) and do righteous deeds, shall have the Gardens of Al-Firdaus (the Paradise) for their entertainment.\n",
        "TRANSLATION_14": "The hospitality of those who believe and do good works shall be the Gardens of Paradise\n",
        "TRANSLATION_15": "As for those who believe and do righteous deeds, they will have the Gardens of Paradise for hospitality.\n",
        "TRANSLATION_16": "Indeed, those who have believed and done righteous deeds - they will have the Gardens of Paradise as a lodging,\n",
        "TRANSLATION_17": "[18:107] Truly those who believe and perform righteous deeds — theirs will be, according to God’s prescience, the gardens of Firdaws, which are at the centre of Paradise and [at] its highest part (the annexation thereto [of firdaws to jannāt, ‘gardens’] is explicative) as [a place of] hospitality, as an abode;\n",
        "TRANSLATION_18": "(Lo! those who believe) in Muhammad (pbuh) and in the Qur'an (and do good works) acts of obedience, secretly between themselves and their Lord, (theirs are the Gardens of Paradise) the highest rank therein, (for welcome) as a dwelling for them,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "18:107",
            "31:8",
            "32:19",
            "47:6",
            "26:90",
            "11:23",
            "2:82",
            "43:72",
            "22:14",
            "43:70"
        ],
        "BIBLE": [
            "torah:genesis:18:24",
            "prophets:isaiah:26:12",
            "writings:ecclesiastes:2:11",
            "writings:ii%20chronicles:34:25",
            "writings:ii%20chronicles:31:20",
            "prophets:isaiah:57:12",
            "torah:leviticus:23:3",
            "writings:job:18:21",
            "prophets:habakkuk:1:5",
            "prophets:isaiah:51:3"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:1:13",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:5:2"
        ]
    }
}