{
    "VERSE": "18:12",
    "ARABIC": "ثُمَّ بَعَثْنَٰهُمْ لِنَعْلَمَ أَىُّ ٱلْحِزْبَيْنِ أَحْصَىٰ لِمَا لَبِثُوٓا۟ أَمَدًا",
    "ENGLISH": {
        "TRANSLATION_0": "Then We woke them up again so that We might see which of the two groups would better calculate the time they had stayed there.",
        "TRANSLATION_1": "Then roused them to ascertain which of the two groups could account for the period they had stayed.\n",
        "TRANSLATION_2": "and then roused them so that We might see which of the two parties could best tell the length of their stay.\n",
        "TRANSLATION_3": "Then We roused them to find out which of the party had the correct account of the duration of their sleep in the cave.\n",
        "TRANSLATION_4": "We then awakened them to see which of the two groups more accurately tells the period they had stayed.\n",
        "TRANSLATION_5": "Then We raised them up, that We might test which of the two parties was best at calculating the time period they tarried.\n",
        "TRANSLATION_6": "Then We raised them up that We might know which of the two parties was best able to compute the time for which they remained.\n",
        "TRANSLATION_7": "Afterwards. We raised them up again, that We might know which of the two parties would better calculate the while they had tarried.\n",
        "TRANSLATION_8": "And afterward We raised them up that We might know which of the two parties would best calculate the time that they had tarried.\n",
        "TRANSLATION_9": "Then We woke them up again so that We might see which of the two groups would better calculate the time they had stayed there.\n",
        "TRANSLATION_10": "Thereafter We raised them up that We might know which of the two parties was best at reckoning the time that they had tarried.\n",
        "TRANSLATION_11": "Then We aroused them that We might know which of the two groups better reckoned the period they had stayed.\n",
        "TRANSLATION_12": "Then We roused them, in order to test which of the two parties was best at calculating the term of years they had tarried!\n",
        "TRANSLATION_13": "Then We raised them up (from their sleep), that We might test which of the two parties was best at calculating the time period that they had tarried.\n",
        "TRANSLATION_14": "and thereafter We revived them to find out which of the two parties could best calculate the length of their stay.\n",
        "TRANSLATION_15": "Then We awakened them to know which of the two groups could better calculate the length of their stay.\n",
        "TRANSLATION_16": "Then We awakened them that We might show which of the two factions was most precise in calculating what [extent] they had remained in time.\n",
        "TRANSLATION_17": "[18:12] Then We aroused them, We awakened them, that We might know, a knowledge of direct vision, which of the two parties, the two groups in disagreement over the length of their stay [in the cave], was better in calculating (ahsā is [of the pattern] of af‘al, meaning ‘more precise’]) what they had tarried (li-mā labithū is semantically connected to the following) in [terms of the] length of time (amadan, [in the accusative] denotes purpose).\n",
        "TRANSLATION_18": "(And afterward We raised them up) We woke them up just as We sent them to sleep (that We might know) We might see (which of the two parties) the believers or the disbelievers (would best calculate the time) the duration (that they had tarried) in the Cave.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "18:12",
            "90:19",
            "72:25",
            "18:7",
            "38:11",
            "22:51",
            "35:6",
            "17:18",
            "16:44",
            "33:22"
        ],
        "BIBLE": [
            "prophets:judges:2:18",
            "prophets:i%20samuel:20:33",
            "prophets:hosea:6:2",
            "prophets:i%20kings:9:15",
            "prophets:judges:16:20",
            "prophets:habakkuk:3:2",
            "prophets:jeremiah:25:32",
            "torah:deuteronomy:8:2",
            "writings:ii%20chronicles:33:14",
            "writings:daniel:2:9"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:3:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:6"
        ]
    }
}