{
    "VERSE": "18:13",
    "ARABIC": "نَّحْنُ نَقُصُّ عَلَيْكَ نَبَأَهُم بِٱلْحَقِّ إِنَّهُمْ فِتْيَةٌ ءَامَنُوا۟ بِرَبِّهِمْ وَزِدْنَٰهُمْ هُدًى",
    "ENGLISH": {
        "TRANSLATION_0": "We will relate their story to you with truth. They were young men who had iman in their Lord and We increased them in guidance.",
        "TRANSLATION_1": "We narrate their story to you in all truth. They were a few young men who believed in their Lord; so We gave them greater guidance.\n",
        "TRANSLATION_2": "We narrate to you their true story. They were a party of young men who had faith in their Lord, and We increased them in guidance\n",
        "TRANSLATION_3": "We tell you this story for a genuine purpose. They were young people who believed in their Lord and We gave them further guidance.\n",
        "TRANSLATION_4": "We shall narrate their account to you accurately; they were young men who believed in their Lord, and We increased the guidance for them.\n",
        "TRANSLATION_5": "We narrate unto you their story with truth: Truly, they were young men who believed in their Lord (Allah), and We increased them in guidance.\n",
        "TRANSLATION_6": "We relate to you their story with the truth; surely they were youths who believed in their Lord and We increased them in guidance.\n",
        "TRANSLATION_7": "We will relate to thee their tidings truly. They were youths who believed in their Lord, and We increased them in guidance.\n",
        "TRANSLATION_8": "We narrate unto thee their story with truth. Lo! they were young men who believed in their Lord, and We increased them in guidance.\n",
        "TRANSLATION_9": "We shall tell you their story as it really was. They were young men who believed in their Lord, and on whom We bestowed further guidance.\n",
        "TRANSLATION_10": "We recount unto thee their tidings With truth. Verily they were certain youths who believed in their Lord, and We increased them in guidance.\n",
        "TRANSLATION_11": "We relate to you their account in truth. They were indeed youths who had faith in their Lord, and We had enhanced them in guidance,\n",
        "TRANSLATION_12": "We relate to thee their story in truth: they were youths who believed in their Lord, and We advanced them in guidance:\n",
        "TRANSLATION_13": "We narrate unto you (O Muhammad SAW) their story with truth: Truly! They were young men who believed in their Lord (Allah), and We increased them in guidance.\n",
        "TRANSLATION_14": "In truth We tell to you their news. They were young men who believed in their Lord, and We increased them in guidance.\n",
        "TRANSLATION_15": "We relate to you their story in truth. They were youths who believed in their Lord, and We increased them in guidance.\n",
        "TRANSLATION_16": "It is We who relate to you, [O Muhammad], their story in truth. Indeed, they were youths who believed in their Lord, and We increased them in guidance.\n",
        "TRANSLATION_17": "[18:13] We relate, recite, to you their story with truth, that is, truthfully. They were indeed youths who believed in their Lord, and We increased them in guidance.\n",
        "TRANSLATION_18": "(We narrate unto thee) We exposit to you (their story with truth. Lo! they were young men who believed in their Lord, and We increased them in guidance) in insight into the matter of their religion; it is also said that this means: We made them firm in their faith.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "18:13",
            "31:5",
            "2:5",
            "28:53",
            "28:3",
            "15:64",
            "39:69",
            "16:102",
            "34:26",
            "5:27"
        ],
        "BIBLE": [
            "writings:psalms:78:62",
            "writings:ii%20chronicles:33:10",
            "writings:psalms:119:169",
            "writings:lamentations:1:11",
            "torah:numbers:20:12",
            "torah:numbers:31:41",
            "prophets:zechariah:11:11",
            "writings:daniel:10:1",
            "torah:leviticus:19:24",
            "torah:numbers:18:29"
        ]
    }
}