{
    "VERSE": "18:19",
    "ARABIC": "وَكَذَٰلِكَ بَعَثْنَٰهُمْ لِيَتَسَآءَلُوا۟ بَيْنَهُمْ قَالَ قَآئِلٌ مِّنْهُمْ كَمْ لَبِثْتُمْ قَالُوا۟ لَبِثْنَا يَوْمًا أَوْ بَعْضَ يَوْمٍ قَالُوا۟ رَبُّكُمْ أَعْلَمُ بِمَا لَبِثْتُمْ فَٱبْعَثُوٓا۟ أَحَدَكُم بِوَرِقِكُمْ هَٰذِهِۦٓ إِلَى ٱلْمَدِينَةِ فَلْيَنظُرْ أَيُّهَآ أَزْكَىٰ طَعَامًا فَلْيَأْتِكُم بِرِزْقٍ مِّنْهُ وَلْيَتَلَطَّفْ وَلَا يُشْعِرَنَّ بِكُمْ أَحَدًا",
    "ENGLISH": {
        "TRANSLATION_0": "That was the situation when we woke them up so they could question one another. One of them asked, 'How long have you been here?' They replied, 'We have been here for a day or part of a day.' They said, 'Your Lord knows best how long you have been here. Send one of your number into the city with this silver you have, so he can see which food is purest and bring you some of it to eat. But he should go about with caution so that no one is aware of you,",
        "TRANSLATION_1": "Even so We roused them that they may question one another. One of them asked: \"How long have you stayed here?\" They said: \"A day or less than a day.\" \"Your Lord knows best,\" they said, \"how long you have stayed. So send one of you to the town with this money of yours to look for wholesome food and bring it for you; but he should be careful not to let your presence known.\n",
        "TRANSLATION_2": "Likewise, We roused them in a miraculous way that they might question one another. One of them asked: \"How long did you remain (in this state)?\" The others said: \"We remained so for a day or part of a day.\" Then they said: \"Your Lord knows better how long we remained in this state. Now send one of you to the city with this coin of yours and let him see who has the best food, and let him buy some provisions from there. Let him be cautious and not inform anyone of our whereabouts.\n",
        "TRANSLATION_3": "We roused them from their sleep so that they would question each other about their stay in the cave. One of them said, \"How long do you think we have stayed here?\" They replied, \"A day or part of a day.\" They added, \" Your Lord knows better how long we have stayed here. Let us send one of us with this money to the city to get some pure food so that we might eat. He should be careful so that no one will know about us. If they were to recognize us,\n",
        "TRANSLATION_4": "And similarly We awakened them so that they may enquire about each other; a speaker among them said, “How long have you stayed here?” Some among them said, “We have stayed a day or part of a day”; the others said, “Your Lord well knows how long you have stayed; therefore send one of you to the city with this silver coin – he may then check which food available there is purer, in order to bring some of it for you to eat – and he must be courteous and not inform anyone about you.”\n",
        "TRANSLATION_5": "Likewise, We woke them that they might question one another. A speaker among them said: \"How long have you stayed (here)\" They said: \"We have stayed a day or part of a day.\" They said: \"Your Lord knows best how long you have stayed (here). So send one of you with this silver coin of yours to the town, and let him find out which is the Azka food, and bring some of that to you. And let him be careful and let no man know of you.\"\n",
        "TRANSLATION_6": "And thus did We rouse them that they might question each other. A speaker among them said: How long have you tarried? They said: We have tarried for a day or a part of a day. (Others) said: Your Lord knows best how long you have tarried. Now send one of you with this silver (coin) of yours to the city, then let him see which of them has purest food, so let him bring you provision from it, and let him behave with gentleness, and by no means make your case known to any one:\n",
        "TRANSLATION_7": "And even so We raised them up again that they might question one another. One of them said, 'How long have you tarried?' They said, 'We have tarried a day, or part of a day.' They said, 'Your Lord knows very well how long you have tarried. Now send one of you forth with this silver to the city, and let him look for which of them has purest food, and bring you provision thereof; let him be courteous, and apprise no man of you.\n",
        "TRANSLATION_8": "And in like manner We awakened them that they might question one another. A speaker from among them said: How long have ye tarried? They said: We have tarried a day or some part of a day, (Others) said: Your Lord best knoweth what ye have tarried. Now send one of you with this your silver coin unto the city, and let him see what food is purest there and bring you a supply thereof. Let him be courteous and let no man know of you.\n",
        "TRANSLATION_9": "In the course of time, We raised them up again so that they might question one another. One of them asked, \"How long have you stayed [here]?\" They said, \"We have stayed a day, or part of a day.\" But others said, \"Your Lord knows best how long you have stayed here. Let one of you go then with these silver coins to the town, and let him find out what food is purest there, and bring you back a supply of it. Let him conduct himself with caution and not disclose your whereabouts to anyone:\n",
        "TRANSLATION_10": "And likewise we raised them up that they might question among themselves; there spake a speaker from amongst them: how long have ye tarried? They said we have tarried a day or part of a day. They said, your Lord knoweth best how long ye have tarried; now send one of you with this your money unto the city and let him see which food is purest there, and let him bring you a provision thereof, and let him be circumspect, and let him by no means discover you to anycne.\n",
        "TRANSLATION_11": "So it was that We aroused them [from sleep] so that they might question one another. One of them said, ‘How long have you stayed [here]?’ They said, ‘We have stayed a day, or part of a day.’ They said, ‘Your Lord knows best how long you have stayed. Send one of you to the city with this money. Let him observe which of them has the purest food, and bring you provisions from there. Let him be attentive, and let him not make anyone aware of you.\n",
        "TRANSLATION_12": "Such (being their state), we raised them up (from sleep), that they might question each other. Said one of them, \"How long have ye stayed (here)?\" They said, \"We have stayed (perhaps) a day, or part of a day.\" (At length) they (all) said, \"Allah (alone) knows best how long ye have stayed here.... Now send ye then one of you with this money of yours to the town: let him find out which is the best food (to be had) and bring some to you, that (ye may) satisfy your hunger therewith: And let him behave with care and courtesy, and let him not inform any one about you.\n",
        "TRANSLATION_13": "Likewise, We awakened them (from their long deep sleep) that they might question one another. A speaker from among them said: \"How long have you stayed (here)?\" They said: \"We have stayed (perhaps) a day or part of a day.\" They said: \"Your Lord (Alone) knows best how long you have stayed (here). So send one of you with this silver coin of yours to the town, and let him find out which is the good lawful food, and bring some of that to you. And let him be careful and let no man know of you.\n",
        "TRANSLATION_14": "As such We revived them so that they might question one another. 'How long have you stayed here' asked one of them. 'We have been here a day, or part of it' they replied. They said: 'Your Lord knows best how long we have stayed here. Let one of you go to the city with this silver (coin) and let him search for one who has the purest food and bring provision from it. Let him be courteous, but let no one sense it is you.\n",
        "TRANSLATION_15": "Even so, We awakened them, so that they may ask one another. A speaker among them said, “How long have you stayed?” They said, “We have stayed a day, or part of a day.” They said, “Your Lord knows best how long you have stayed.” “Send one of you to the city, with this money of yours, and let him see which food is most suitable, and let him bring you some provision thereof. And let him be gentle, and let no one become aware of you.”\n",
        "TRANSLATION_16": "And similarly, We awakened them that they might question one another. Said a speaker from among them, \"How long have you remained [here]?\" They said, \"We have remained a day or part of a day.\" They said, \"Your Lord is most knowing of how long you remained. So send one of you with this silver coin of yours to the city and let him look to which is the best of food and bring you provision from it and let him be cautious. And let no one be aware of you.\n",
        "TRANSLATION_17": "[18:19] And so, just as We did with them that which We have mentioned, it was that We aroused them, We awakened them, that they might question one another, concerning their state and the length of their stay [in the cave]. One of them said, ‘How long have you tarried?’ They said, ‘We have tarried a day, or part of a day’: [he said this] because they had entered the cave at sunrise and were awakened at sunset, and so they thought that it was [the time of] sunset on the day of their entry. Then, they said, unsure about this [fact], ‘Your Lord knows best how long you have tarried. Now send one of you with this silver coin of yours (read bi-warqikum or bi-wariqikum) to the city — which is said to be the one now called Tarsus (Tarasūs) — and let him see which is the purest food, that is, which of the foods of the city is the purest, and [let him] bring you a supply thereof. Let him be careful and not make anyone aware of you.\n",
        "TRANSLATION_18": "(And in like manner We awakened them), after 309 years, (that they might question one another) so that they might talk to one another. (A speaker from among them) this is their chief and leader: Maxmillian (Maksilmina) (said : How long have ye tarried) in this Cave after you slept? (They said: We have tarried a day) and when they left the cave and saw that the sun did set yet, they said: (or some part of a day. (Others) said) i.e. Maxmillian: (Your Lord best knoweth what ye have tarried) after you slept. (Now send one of you) Yamblichus (Yamlikha) (with this your silver coin unto the city) of Ephesus (Afsus), (and let him see what food is purest there) the largest quantity; it is also said that this means: the best of bread and most lawful slaughtered meat (and bring you a supply thereof. Let him be courteous) when buying (and let no man) let no Magian (know of you) find out about you.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "18:19",
            "6:53",
            "45:17",
            "42:15",
            "10:93",
            "34:31",
            "10:40",
            "41:9",
            "18:21",
            "3:50"
        ],
        "BIBLE": [
            "prophets:ii%20kings:7:19",
            "prophets:joshua:1:8",
            "prophets:ii%20kings:10:5",
            "torah:genesis:2:18",
            "prophets:amos:6:10",
            "torah:exodus:32:1",
            "writings:daniel:2:25",
            "prophets:ii%20kings:7:2",
            "torah:exodus:32:23",
            "torah:deuteronomy:1:22"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:4:5"
        ]
    }
}