{
    "VERSE": "18:26",
    "ARABIC": "قُلِ ٱللَّهُ أَعْلَمُ بِمَا لَبِثُوا۟ لَهُۥ غَيْبُ ٱلسَّمَٰوَٰتِ وَٱلْأَرْضِ أَبْصِرْ بِهِۦ وَأَسْمِعْ مَا لَهُم مِّن دُونِهِۦ مِن وَلِىٍّ وَلَا يُشْرِكُ فِى حُكْمِهِۦٓ أَحَدًا",
    "ENGLISH": {
        "TRANSLATION_0": "Say: 'Allah knows best how long they stayed. The Unseen of the heavens and the earth belongs to Him. How perfectly He sees, how well He hears! They have no protector apart from Him. Nor does He share His rule with anyone.'",
        "TRANSLATION_1": "You say: \"God only knows how long they stayed. He alone knows the secrets of the heavens and the earth. How distinctly He sees and hears! They have no other guardian but Him, and He does not share His authority with any one.\"\n",
        "TRANSLATION_2": "Say: \"Allah knows best how long they remained in it, for only He knows all that is hidden in the heavens and the earth. How well He sees; how well He hears! The creatures have no other guardian than Him; He allows none to share His authority.\"\n",
        "TRANSLATION_3": "(Muhammad), say, \"God knows best how long they stayed there; to Him belongs the unseen of both the heavens and the earth. How clear is His sight and how keen His hearing! No one other than Him is their guardian and no one shares His Judgment.\n",
        "TRANSLATION_4": "Say, “Allah well knows how long they stayed; for Him only are the hidden of the heavens and the earth; how well He sees and hears! They do not have any supporter besides Him; and He does not associate anyone in His command.”\n",
        "TRANSLATION_5": "Say: \"Allah knows best how long they stayed. With Him is the unseen of the heavens and the earth.\" How clearly He sees, and hears (everything)! They have no protector other than Him, and He makes none to share in His decision and His rule.\n",
        "TRANSLATION_6": "Say: Allah knows best how long they remained; to Him are (known) the unseen things of the heavens and the earth; how clear His sight and how clear His hearing! There is none to be a guardian for them besides Him, and He does not make any one His associate in His Judgment.\n",
        "TRANSLATION_7": "Say: 'God knows very well how long they tarried. To Him belongs the Unseen in the heavens and in the earth. How well He sees! How well He hears! They have no protector, apart from Him, and He associates in His government no one.'\n",
        "TRANSLATION_8": "Say: Allah is Best Aware how long they tarried. His is the Invisible of the heavens and the earth. How clear of sight is He and keen of hearing! They have no protecting friend beside Him, and He maketh none to share in His government.\n",
        "TRANSLATION_9": "Say, \"God knows best how long they stayed in it.\" Only God has knowledge of the unseen in the heavens and on the earth. How well He sees and how well He hears! Man has no other guardian besides Him. He allows none to share His sovereignty.\n",
        "TRANSLATION_10": "Say thou: Allah knoweth best how long they tarried; His alone is the hidden knowledge of the heavens and the earth. How well He seeth and heareth. They have no patron beside Him, nor in His rule He associateth anyone.\n",
        "TRANSLATION_11": "Say, ‘Allah knows best how long they remained. To Him belongs the Unseen of the heavens and the earth. How well does He see! How well does He hear! They have no guardian besides Him, and none shares with Him in His judgement.’\n",
        "TRANSLATION_12": "Say: \"Allah knows best how long they stayed: with Him is (the knowledge of) the secrets of the heavens and the earth: how clearly He sees, how finely He hears (everything)! They have no protector other than Him; nor does He share His Command with any person whatsoever.\n",
        "TRANSLATION_13": "Say: \"Allah knows best how long they stayed. With Him is (the knowledge of) the unseen of the heavens and the earth. How clearly He sees, and hears (everything)! They have no Wali (Helper, Disposer of affairs, Protector, etc.) other than Him, and He makes none to share in His Decision and His Rule.\"\n",
        "TRANSLATION_14": "Say: 'None but Allah knows how long they stayed. To Him belong the Unseen in the heavens and the earth. How well He sees, and how well He hears! They have no other guardian, other than Him, and He allows no one (to share) His rule'\n",
        "TRANSLATION_15": "Say, “God knows best how long they stayed.” His is the mystery of the heavens and the earth. By Him you see and hear. They have no guardian apart from Him, and He shares His Sovereignty with no one.\n",
        "TRANSLATION_16": "Say, \"Allah is most knowing of how long they remained. He has [knowledge of] the unseen [aspects] of the heavens and the earth. How Seeing is He and how Hearing! They have not besides Him any protector, and He shares not His legislation with anyone.\"\n",
        "TRANSLATION_17": "[18:26] Say: ‘God is more knowledgeable of how long they tarried, [more knowledgeable] than those contending over this [issue] — and this [fact] has already been mentioned [above, verse 19]. To Him belongs the Unseen of the heavens and the earth, that is, [to Him belongs] the knowledge thereof. How well He sees!, namely, God — this form is for [expressing] amazement [at something]. How well He hears!, likewise [for expressing amazement]. These two [expressions] are being used metaphorically. What is meant is that   nothing can escape God’s sight or hearing. They, the inhabitants of the heavens and the earth, have no guardian, someone to assist [them], besides Him, and He makes none to share in His rule’, for He is Independent, without need of a partner.\n",
        "TRANSLATION_18": "(Say) Muhammad: (Allah is best aware how long they tarried) after that. (His is the Invisible of the heavens and the earth) His is that which is hidden from the servants. (How clear of sight is He and keen of hearing!) so hear and know what I see and know about them and their matter (They have no protecting friend beside Him) they have no one to protect them beside Allah; it is also said that this means: the people of Mecca have no close one to benefit them against Allah's chastisement, (and He maketh none to share in His government) in His dominion of the Unseen.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "18:26",
            "29:22",
            "27:65",
            "9:116",
            "11:20",
            "42:31",
            "2:107",
            "57:1",
            "35:38",
            "46:32"
        ],
        "BIBLE": [
            "torah:exodus:32:1",
            "writings:daniel:2:26",
            "prophets:ii%20kings:7:19",
            "torah:genesis:22:12",
            "torah:genesis:2:18",
            "prophets:ii%20kings:7:2",
            "torah:exodus:23:13",
            "torah:genesis:1:26",
            "torah:exodus:18:16",
            "writings:daniel:6:13"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:5:1"
        ]
    }
}