{
    "VERSE": "18:32",
    "ARABIC": "وَٱضْرِبْ لَهُم مَّثَلًا رَّجُلَيْنِ جَعَلْنَا لِأَحَدِهِمَا جَنَّتَيْنِ مِنْ أَعْنَٰبٍ وَحَفَفْنَٰهُمَا بِنَخْلٍ وَجَعَلْنَا بَيْنَهُمَا زَرْعًا",
    "ENGLISH": {
        "TRANSLATION_0": "Make an example for them of two men. To one of them We gave two gardens of grape-vines and surrounded them with date-palms, putting between them some cultivated land.",
        "TRANSLATION_1": "Tell them the parable of two men. We gave one two gardens of grapes surrounded by date-palm trees, with corn fields in between.\n",
        "TRANSLATION_2": "(O Muhammad), propound a parable to them. There were two men of whom We bestowed upon one of the two vineyards, surrounding both of them with date-palms and putting a tillage in between.\n",
        "TRANSLATION_3": "(Muhammad), tell them the parable of the two men. To one of them We had given two gardens of vines surrounded by the palm trees with a piece of farm land between them\n",
        "TRANSLATION_4": "And relate to them the account of the two men – to one We gave two gardens of grapes, and covered them with date-palms and kept farms between them.\n",
        "TRANSLATION_5": "And put forward to them the example of two men: unto one of them We had given two gardens of grapes, and We had surrounded both with date palms; and had put between them green crops (cultivated fields).\n",
        "TRANSLATION_6": "And set forth to them a parable of two men; for one of them We made two gardens of grape vines, and We surrounded them both with palms, and in the midst of them We made cornfields.\n",
        "TRANSLATION_7": "And strike for them a similitude: two men. To one of them We assigned two gardens of vines, and surrounded them with palm-trees, and between them We set a sown field;\n",
        "TRANSLATION_8": "Coin for them a similitude: Two men, unto one of whom We had assigned two gardens of grapes, and We had surrounded both with date-palms and had put between them tillage.\n",
        "TRANSLATION_9": "Recite to them the parable of two men! One of them We provided with two vineyards which We surrounded with date-palms, and placed a field of grain in between;\n",
        "TRANSLATION_10": "Propound thou unto them the similitude of two men. We appointed to one of them two gardens of vine and hedged both with date- palms, and We placed in-between the twain tillage.\n",
        "TRANSLATION_11": "Draw for them the parable of two men for each of whom We had made two gardens of vines, and We had surrounded them with date palms, and placed crops between them.\n",
        "TRANSLATION_12": "Set forth to them the parable of two men: for one of them We provided two gardens of grape-vines and surrounded them with date palms; in between the two We placed corn-fields.\n",
        "TRANSLATION_13": "And put forward to them the example of two men; unto one of them We had given two gardens of grapes, and We had surrounded both with date-palms; and had put between them green crops (cultivated fields etc.).\n",
        "TRANSLATION_14": "Give them the parable of two men. To one we gave two gardens of vines and surrounded them with palm trees and in between the two we placed a sownfield.\n",
        "TRANSLATION_15": "And cite for them the parable of two men. To one of them We gave two gardens of vine, and We surrounded them with palms-trees, and We placed between them crops.\n",
        "TRANSLATION_16": "And present to them an example of two men: We granted to one of them two gardens of grapevines, and We bordered them with palm trees and placed between them [fields of] crops.\n",
        "TRANSLATION_17": "[18:32] And strike, coin, for them, for the disbelievers together with the believers, a similitude: two men (rajulayn is a substitute [for mathalan, ‘a similitude’] and constitutes, together with what follows, an explanation of the similitude), to one of whom, the disbeliever, We had assigned two gardens, orchards, of vines, and We had surrounded them with date-palms and had set between them [a field of] crops, from which he acquired [his]   food supplies.\n",
        "TRANSLATION_18": "(Coin for them a similitude) explain to the people of Mecca, the description of: (Two men) two brothers from the Children of Israel, one of whom is a believer, Yehuda, and the other a disbeliever, Abufatrus, (unto one of whom) the disbeliever (We had assigned two gardens of grapes, and We had surrounded both with date- palms and had put between them) between the gardens (tillage) a plantation.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "18:32",
            "36:34",
            "23:19",
            "17:91",
            "13:4",
            "16:11",
            "92:19",
            "2:266",
            "16:76",
            "26:57"
        ],
        "BIBLE": [
            "torah:numbers:16:14",
            "torah:exodus:21:29",
            "writings:job:29:21",
            "torah:genesis:20:16",
            "prophets:jeremiah:32:43",
            "torah:deuteronomy:26:10",
            "torah:exodus:10:15",
            "torah:deuteronomy:32:8",
            "torah:numbers:2:17",
            "prophets:joshua:19:49"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:4:8",
            "Sefer%20Yetzirah:4:3"
        ]
    }
}