{
    "VERSE": "18:33",
    "ARABIC": "كِلْتَا ٱلْجَنَّتَيْنِ ءَاتَتْ أُكُلَهَا وَلَمْ تَظْلِم مِّنْهُ شَيْـًٔا وَفَجَّرْنَا خِلَٰلَهُمَا نَهَرًا",
    "ENGLISH": {
        "TRANSLATION_0": "Both gardens yielded their crops and did not suffer any loss, and We made a river flow right through the",
        "TRANSLATION_1": "Each of the gardens yielded its fruit and did not withhold the least; and We made a stream flow in between them.\n",
        "TRANSLATION_2": "Both the vineyards yielded abundant produce without failure and We caused a stream to flow in their midst\n",
        "TRANSLATION_3": "and a stream flowing through the middle of the gardens.\n",
        "TRANSLATION_4": "Both the gardens gave yields and gave no shortfall in it – and We made a river to flow between the two.\n",
        "TRANSLATION_5": "Each of those two gardens brought forth its produce, and failed not in the least therein, and We caused a river to gush forth in the midst of both.\n",
        "TRANSLATION_6": "Both these gardens yielded their fruits, and failed not aught thereof, and We caused a river to gush forth in their midst,\n",
        "TRANSLATION_7": "each of the two gardens yielded its produce and failed naught in any wise; and We caused to gush amidst them a river.\n",
        "TRANSLATION_8": "Each of the gardens gave its fruit and withheld naught thereof. And We caused a river to gush forth therein.\n",
        "TRANSLATION_9": "each garden produced its fruit and did not fail to yield its best; We even caused a river to gush forth in the midst of them,\n",
        "TRANSLATION_10": "Each of the two gardens brought forth its produce and stinted not aught thereof; and We caused to gush forth in the midst of the twain a river.\n",
        "TRANSLATION_11": "Both gardens yielded their produce without stinting anything of it. And We had set a stream gushing through them.\n",
        "TRANSLATION_12": "Each of those gardens brought forth its produce, and failed not in the least therein: in the midst of them We caused a river to flow.\n",
        "TRANSLATION_13": "Each of those two gardens brought forth its produce, and failed not in the least therein, and We caused a river to gush forth in the midst of them.\n",
        "TRANSLATION_14": "Each of the two gardens yielded its produce and did not fail in the least and We made a river to gush through them,\n",
        "TRANSLATION_15": "Both gardens produced their harvest in full, and suffered no loss. And We made a river flow through them.\n",
        "TRANSLATION_16": "Each of the two gardens produced its fruit and did not fall short thereof in anything. And We caused to gush forth within them a river.\n",
        "TRANSLATION_17": "[18:33] Each of the two gardens (kiltā, ‘each [of the two]’ is a singular [noun] that indicates a dual [number]; and [the entire clause] is the subject) yielded (ātat is the predicate thereof) its produce, its fruit, without stinting, diminishing, anything thereof. And We caused a stream to gush forth therein, to run through them.\n",
        "TRANSLATION_18": "(Each of the gardens gave its fruit) every year (and withheld naught thereof. And We caused a river to gush forth therein) in their middle.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "18:33",
            "17:91",
            "15:19",
            "54:54",
            "13:35",
            "34:16",
            "32:7",
            "54:52",
            "51:49",
            "22:14"
        ],
        "BIBLE": [
            "torah:deuteronomy:26:10",
            "writings:song%20of%20songs:8:11",
            "torah:numbers:16:14",
            "prophets:i%20samuel:9:23",
            "torah:leviticus:19:24",
            "torah:deuteronomy:26:11",
            "prophets:joshua:19:49",
            "torah:numbers:18:29",
            "prophets:ezekiel:16:19",
            "prophets:ezekiel:29:5"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:3:6",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:2:4"
        ]
    }
}