{
    "VERSE": "18:34",
    "ARABIC": "وَكَانَ لَهُۥ ثَمَرٌ فَقَالَ لِصَٰحِبِهِۦ وَهُوَ يُحَاوِرُهُۥٓ أَنَا۠ أَكْثَرُ مِنكَ مَالًا وَأَعَزُّ نَفَرًا",
    "ENGLISH": {
        "TRANSLATION_0": "He was a man of wealth and property and he said to his companion, debating with him, 'I have more wealth than you and more people under me.'",
        "TRANSLATION_1": "So he became rich. Arguing one day with his friend he said: \"I have more wealth than you and more powerful kinsmen.\"\n",
        "TRANSLATION_2": "so the owner had fruit in abundance and he said to his neighbour, while conversing with him: \"I have greater wealth than you and I am stronger than you in numbers.\"\n",
        "TRANSLATION_3": "Both gardens would yield fruits to their fullest capacity. Whatever was produced belonged to him. To his friend he exclaimed, \"I have more wealth and greater man-power than you.\"\n",
        "TRANSLATION_4": "And he had fruit; he therefore said to his companion – and he used to debate with him – “I exceed you in wealth, and am more powerful in respect of men.”\n",
        "TRANSLATION_5": "And he had Thamar, and he said to his companion in the course of discussion: \"I am greater than you in wealth and have a mightier entourage.\"\n",
        "TRANSLATION_6": "And he possessed much wealth; so he said to his companion, while he disputed with him: I have greater wealth than you, and am mightier in followers.\n",
        "TRANSLATION_7": "So he had fruit; and he said to his fellow, as he was conversing with him, 'I have more abundance of wealth than thou and am mightier in respect of men.\n",
        "TRANSLATION_8": "And he had fruit. And he said unto his comrade, when he spake with him: I am more than thee in wealth, and stronger in respect of men.\n",
        "TRANSLATION_9": "and so he had fruit in abundance. While conversing with his companion, he said, \"I am wealthier than you are, and have a bigger following!\"\n",
        "TRANSLATION_10": "And he had property. Then he Said unto his fellow while he spake with him: I am more than thou in substance and am mightier in respect of retinue.\n",
        "TRANSLATION_11": "He had abundant fruits, so he said to his companion, as he conversed with him: ‘I have more wealth than you, and am stronger with respect to numbers.’\n",
        "TRANSLATION_12": "(Abundant) was the produce this man had: he said to his companion, in the course of a mutual argument: \"more wealth have I than you, and more honour and power in (my following of) men.\"\n",
        "TRANSLATION_13": "And he had property (or fruit) and he said to his companion, in the course of mutual talk: I am more than you in wealth and stronger in respect of men.\" [See Tafsir Qurtubi, Vol. 10, Page 403].\n",
        "TRANSLATION_14": "so he had fruit. As he spoke with his companion, as he was conversing with him, 'My wealth is more abundant than yours and men have a greater respect for me'\n",
        "TRANSLATION_15": "And thus he had abundant fruits. He said to his friend, as he conversed with him, “I am wealthier than you, and greater in manpower.”\n",
        "TRANSLATION_16": "And he had fruit, so he said to his companion while he was conversing with him, \"I am greater than you in wealth and mightier in [numbers of] men.\"\n",
        "TRANSLATION_17": "[18:34] And he had, together with his two gardens, fruit (read thamar, thumur, or thumr, [all of which constitute] the plural of thamra, [sing.] ‘a fruit’, similar [in pattern] to shajara [pl.] shajar, khashaba [pl.] khushb, or badana [pl.] budn) and he said to his companion, the believer, as he conversed with him, boasting before him: ‘I have more wealth than you and am stronger in respect of men’, in respect of clansmen.\n",
        "TRANSLATION_18": "(And he had fruit) the garden had fruits; or according to a different reading: wealth. (And he said unto his comrade) the believer: Yehuda, (when he spake with him) bragging to him about his wealth: (I am more than thee in wealth, and stronger about men) I have more servants.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "18:34",
            "17:6",
            "34:35",
            "68:48",
            "74:12",
            "14:36",
            "104:2",
            "54:29",
            "18:37",
            "3:186"
        ],
        "BIBLE": [
            "prophets:ii%20kings:9:11",
            "torah:exodus:2:13",
            "writings:daniel:10:19",
            "writings:daniel:10:11",
            "prophets:judges:14:18",
            "prophets:ii%20samuel:20:4",
            "writings:ecclesiastes:6:2",
            "writings:daniel:6:13",
            "prophets:ii%20kings:3:23",
            "torah:deuteronomy:26:5"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:1"
        ]
    }
}