{
    "VERSE": "18:35",
    "ARABIC": "وَدَخَلَ جَنَّتَهُۥ وَهُوَ ظَالِمٌ لِّنَفْسِهِۦ قَالَ مَآ أَظُنُّ أَن تَبِيدَ هَٰذِهِۦٓ أَبَدًا",
    "ENGLISH": {
        "TRANSLATION_0": "He entered his garden and wronged himself by saying, 'I do not think that this will ever end.",
        "TRANSLATION_1": "And he walked into his garden, and, (forgetting) his limit, said: \"I cannot imagine that this will ever be ruined,\n",
        "TRANSLATION_2": "Then he entered his vine-yard and said, wronging himself: \"Surely, I do not believe that all this will ever perish.\n",
        "TRANSLATION_3": "He unjustly entered his garden and said, \"I do not think this (property) will ever perish\n",
        "TRANSLATION_4": "He went into his garden and wronging himself said, “I do not think that this will ever perish.”\n",
        "TRANSLATION_5": "And he went into his garden while having been unjust to himself. He said: \"I do not think that this will ever perish.\"\n",
        "TRANSLATION_6": "And he entered his garden while he was unjust to himself. He said: I do not think that this will ever perish\n",
        "TRANSLATION_7": "And he entered his garden, wronging himself; he said, 'I do not think that this will ever perish;\n",
        "TRANSLATION_8": "And he went into his garden, while he (thus) wronged himself. He said: I think not that all this will ever perish.\n",
        "TRANSLATION_9": "Having thus harmed his own soul, he entered his garden saying, \"I do not think this will ever perish,\n",
        "TRANSLATION_10": "And he entered his garden, while he was a wrong-doer in respect of his own soul; he said: I imagine not that this shall ever perish.\n",
        "TRANSLATION_11": "He entered his garden while he wronged himself. He said, ‘I do not think that this will ever perish,\n",
        "TRANSLATION_12": "He went into his garden in a state (of mind) unjust to his soul: He said, \"I deem not that this will ever perish,\n",
        "TRANSLATION_13": "And he went into his garden while in a state (of pride and disbelief) unjust to himself. He said: \"I think not that this will ever perish.\n",
        "TRANSLATION_14": "And when, having wronged himself, he entered his garden, he said: 'I do not think that this will ever perish!\n",
        "TRANSLATION_15": "And he entered his garden, wronging himself. He said, “I do not think this will ever perish.”\n",
        "TRANSLATION_16": "And he entered his garden while he was unjust to himself. He said, \"I do not think that this will perish - ever.\n",
        "TRANSLATION_17": "[18:35] And he entered his garden, [taking] with him his companion, accompanying him all around it, showing him its fruits — God does not say [here] his ‘two gardens’, because what is meant is the beautiful [part of the] garden (rawda); or because [to mention just] one suffices — having wronged himself, through [his] disbelief. He said, ‘I do not think that [all] this will ever perish, become non-existent.\n",
        "TRANSLATION_18": "(And he went into his garden, while he (thus) wronged himself) through his disbelief. (He said: I think not that all this will ever perish). 316\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "18:35",
            "6:26",
            "20:41",
            "91:7",
            "11:21",
            "18:3",
            "82:5",
            "7:42",
            "7:192",
            "27:92"
        ],
        "BIBLE": [
            "prophets:ii%20kings:2:2",
            "prophets:ii%20kings:2:6",
            "writings:psalms:124:5",
            "prophets:ii%20kings:2:21",
            "prophets:ii%20kings:5:11",
            "prophets:ii%20kings:5:4",
            "writings:job:1:12",
            "prophets:zechariah:5:5",
            "writings:i%20chronicles:11:6",
            "prophets:jeremiah:6:16"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:3:7",
            "Sefer%20Yetzirah:2:5"
        ]
    }
}