{
    "VERSE": "18:38",
    "ARABIC": "لَّٰكِنَّا۠ هُوَ ٱللَّهُ رَبِّى وَلَآ أُشْرِكُ بِرَبِّىٓ أَحَدًا",
    "ENGLISH": {
        "TRANSLATION_0": "He is, however, Allah, my Lord, and I will not associate anyone with my Lord.",
        "TRANSLATION_1": "And He is God, my Lord, and I do not associate any one with my Lord.\n",
        "TRANSLATION_2": "As for myself, Allah alone is my Lord, and I associate none with my Lord in His Divinity.\n",
        "TRANSLATION_3": "I believe that He is God my Lord and I do not consider anything equal to Him.\"\n",
        "TRANSLATION_4": "“But I just say that only Allah is my Lord, and I do not ascribe anyone as a partner to my Lord.”\n",
        "TRANSLATION_5": "But as for my part, (I believe) that He is Allah, my Lord, and none shall I associate as partner with my Lord.\"\n",
        "TRANSLATION_6": "But as for me, He, Allah, is my Lord, and I do not associate anyone with my Lord.\n",
        "TRANSLATION_7": "But lo, He is God, my Lord, and I will not associate with my Lord any one.\n",
        "TRANSLATION_8": "But He is Allah, my Lord, and I ascribe unto my Lord no partner.\n",
        "TRANSLATION_9": "But as far as I am concerned, God alone is my Lord and I set up no partners with Him.\n",
        "TRANSLATION_10": "But he is Allah, my Lord; and with my Lord associate not anyone.\n",
        "TRANSLATION_11": "But I [say], ‘‘He is Allah, my Lord,’’ and I do not ascribe any partner to my Lord.\n",
        "TRANSLATION_12": "But (I think) for my part that He is Allah, My Lord, and none shall I associate with my Lord.\n",
        "TRANSLATION_13": "But as for my part (I believe) that He is Allah, my Lord and none shall I associate as partner with my Lord.\n",
        "TRANSLATION_14": "He is Allah, my Lord, and I will not associate anyone with My Lord.\n",
        "TRANSLATION_15": "But as for me, He is God, my Lord, and I never associate with my Lord anyone.\n",
        "TRANSLATION_16": "But as for me, He is Allah, my Lord, and I do not associate with my Lord anyone.\n",
        "TRANSLATION_17": "[18:38] But lo (lākinnā is actually [made up of] lākin anā, ‘but I … ’, where the hamza vowel has [either] been transferred onto the nūn [of lākin], or omitted [altogether] with the nūn assimilated with the like of it) He [is] (huwa, this is the pronoun of the [subject] matter [to be stated] and is clarified by the sentence that follows it: the meaning [in other words] is ‘[But, it is that] I say that [He is]’) God, my Lord, and I do not ascribe any partner to my Lord.\n",
        "TRANSLATION_18": "(But) I say (He is Allah, my Lord) my Creator and Provider, (and I ascribe unto my Lord no partner) among idols.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "18:38",
            "72:20",
            "112:1",
            "11:34",
            "72:7",
            "72:22",
            "33:39",
            "7:62",
            "46:13",
            "72:2"
        ],
        "BIBLE": [
            "torah:exodus:8:24",
            "writings:job:1:8",
            "torah:numbers:36:6",
            "writings:psalms:91:2",
            "writings:psalms:94:7",
            "torah:deuteronomy:5:24",
            "prophets:jonah:1:6",
            "prophets:amos:7:6",
            "prophets:zechariah:13:9",
            "prophets:hosea:2:25"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:4"
        ]
    }
}