{
    "VERSE": "18:41",
    "ARABIC": "أَوْ يُصْبِحَ مَآؤُهَا غَوْرًا فَلَن تَسْتَطِيعَ لَهُۥ طَلَبًا",
    "ENGLISH": {
        "TRANSLATION_0": "or morning finds its water drained into the earth so that you cannot get at it.'",
        "TRANSLATION_1": "Or else of a morning its water may sink underground, and you will not find a trace of it.\"\n",
        "TRANSLATION_2": "or the water of your vineyard will be drained deep into the ground so that you will not be able to seek it out.\"\n",
        "TRANSLATION_3": "or cause the streams in your garden to disappear under the ground such that you will never be able to find them.\n",
        "TRANSLATION_4": "“Or its water may sink into the earth, so you may never be able to find it.”\n",
        "TRANSLATION_5": "Or the water thereof becomes Ghawran so that you will never be able to seek it.\"\n",
        "TRANSLATION_6": "Or its waters should sink down into the ground so that you are unable to find it.\n",
        "TRANSLATION_7": "or in the morning the water of it will be sunk into the earth, so that thou wilt not be able to seek it out.'\n",
        "TRANSLATION_8": "Or some morning the water thereof will be lost in the earth so that thou canst not make search for it.\n",
        "TRANSLATION_9": "or its water may sink into the earth, so that you will never be able to find it again!\"\n",
        "TRANSLATION_10": "Or the water thereof become deep sunken so that therefor thou canst not make a search.\n",
        "TRANSLATION_11": "Or its water will sink down, so that you will never be able to obtain it.’\n",
        "TRANSLATION_12": "Or the water of the garden will run off underground so that thou wilt never be able to find it.\"\n",
        "TRANSLATION_13": "Or the water thereof (of the gardens) becomes deep-sunken (underground) so that you will never be able to seek it.\"\n",
        "TRANSLATION_14": "or, in the morning its water will be drained into the earth so that you will not have a means to reach it'\n",
        "TRANSLATION_15": "Or its water will sink into the ground, and you will be unable to draw it.”\n",
        "TRANSLATION_16": "Or its water will become sunken [into the earth], so you would never be able to seek it.\"\n",
        "TRANSLATION_17": "[18:41] or [maybe] its water will sink [deep] down (ghawran functions in meaning like ghā’iran, and it constitutes a supplement to yursila, ‘He [will] unleash’, but not [a supplement] to tusbiha, ‘it becomes’, because the sinking of water [deep into the earth] does not [necessarily] result from thunderbolts) so that you have no means of acquiring it’, no possible way of reaching it.\n",
        "TRANSLATION_18": "(Or some morning the water thereof) the water of the garden (will be lost in the earth) will sink in the earth, out of reach (so that thou canst not make search for it) so that you cannot access it.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "18:41",
            "79:31",
            "67:30",
            "86:6",
            "56:31",
            "54:11",
            "78:35",
            "56:25",
            "80:25",
            "14:16"
        ],
        "BIBLE": [
            "prophets:isaiah:28:9",
            "torah:deuteronomy:5:8",
            "torah:exodus:20:4",
            "prophets:isaiah:58:11",
            "writings:i%20chronicles:17:8",
            "prophets:ezekiel:26:21",
            "torah:genesis:24:3",
            "torah:leviticus:20:25",
            "prophets:isaiah:66:22",
            "torah:exodus:20:21"
        ]
    }
}