{
    "VERSE": "18:43",
    "ARABIC": "وَلَمْ تَكُن لَّهُۥ فِئَةٌ يَنصُرُونَهُۥ مِن دُونِ ٱللَّهِ وَمَا كَانَ مُنتَصِرًا",
    "ENGLISH": {
        "TRANSLATION_0": "There was no group to come to his aid, besides Allah, and he was not given any help.",
        "TRANSLATION_1": "He had no body to help him other than God, nor was he able to save himself.\n",
        "TRANSLATION_2": "And there was no host, beside Allah, to help him, nor could he be of any help to himself.\n",
        "TRANSLATION_3": "He had no one besides God to help him, nor could he himself achieve any success.\n",
        "TRANSLATION_4": "And he had no group to help him against Allah, nor was he capable of taking revenge.\n",
        "TRANSLATION_5": "And he had no group of men to help him against Allah, nor could he defend (or save) himself.\n",
        "TRANSLATION_6": "And he had no host to help him besides Allah nor could he defend himself.\n",
        "TRANSLATION_7": "But there was no host to help him, apart from God, and he was helpless.\n",
        "TRANSLATION_8": "And he had no troop of men to help him as against Allah, nor could he save himself.\n",
        "TRANSLATION_9": "He had no party to help him against God, nor was he able to defend himself.\n",
        "TRANSLATION_10": "And there could be no party suceouring him as against Allah, nor could he himself be an avenger.\n",
        "TRANSLATION_11": "He had no party to help him, besides Allah, nor could he help himself.\n",
        "TRANSLATION_12": "Nor had he numbers to help him against Allah, nor was he able to deliver himself.\n",
        "TRANSLATION_13": "And he had no group of men to help him against Allah, nor could he defend or save himself.\n",
        "TRANSLATION_14": "He had no host to help him besides Allah, and he was helpless\n",
        "TRANSLATION_15": "He had no faction to help him besides God, and he was helpless.\n",
        "TRANSLATION_16": "And there was for him no company to aid him other than Allah, nor could he defend himself.\n",
        "TRANSLATION_17": "[18:43] But there was no (read takun or yakun) party, [no] persons, to help him, besides God, at the moment of its destruction, nor could he help himself, at the moment of its destruction, [all by] himself.\n",
        "TRANSLATION_18": "(And he had no troop of men to help him as against Allah) i.e. against Allah's punishment, (nor could he save himself) from Allah's punishment.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "18:43",
            "28:81",
            "53:58",
            "36:74",
            "72:22",
            "16:20",
            "26:93",
            "21:67",
            "42:46",
            "42:6"
        ],
        "BIBLE": [
            "writings:psalms:7:2",
            "prophets:ezekiel:3:21",
            "writings:psalms:31:2",
            "writings:psalms:25:20",
            "torah:numbers:31:53",
            "writings:ecclesiastes:3:14",
            "writings:ii%20chronicles:24:24",
            "torah:genesis:2:22",
            "writings:ii%20chronicles:32:3",
            "writings:i%20chronicles:12:23"
        ]
    }
}