{
    "VERSE": "18:44",
    "ARABIC": "هُنَالِكَ ٱلْوَلَٰيَةُ لِلَّهِ ٱلْحَقِّ هُوَ خَيْرٌ ثَوَابًا وَخَيْرٌ عُقْبًا",
    "ENGLISH": {
        "TRANSLATION_0": "In that situation the only protection is from Allah, the Real. He gives the best reward and the best outcome.",
        "TRANSLATION_1": "The jurisdiction in this province belongs to God. His is the best reward, and His the best requital.\n",
        "TRANSLATION_2": "(Then he knew) that all power of protection rests with Allah, the True One. He is the best to reward, the best to determine the end of things.\n",
        "TRANSLATION_3": "In such helplessness, the human being realizes that it is God who is the true Guardian and His rewards and recompense are the best.\n",
        "TRANSLATION_4": "Here brought to light is that the authority is only for Allah, the True; the reward He bestows is the best, and believing in Him has the best outcome.\n",
        "TRANSLATION_5": "There (on the Day of Resurrection), Al-Walayah will be for Allah (Alone), the True God. He (Allah) is the best for reward and the best for the final end.\n",
        "TRANSLATION_6": "Here is protection only Allah's, the True One; He is best in (the giving of) reward and best in requiting.\n",
        "TRANSLATION_7": "Thereover protection belongs only to God the True; He is best rewarding, best in the issue.\n",
        "TRANSLATION_8": "In this case is protection only from Allah, the True, He is Best for reward, and best for consequence.\n",
        "TRANSLATION_9": "The only support is from God, the True God. He is the best in rewarding and the best in respect of the final outcome.\n",
        "TRANSLATION_10": "Herein is all protection from Allah the True: He is excellent in respect of reward and excellent in respect of the final end!\n",
        "TRANSLATION_11": "There, all authority belongs to Allah, the Real. He is best in rewarding, and best in requiting.\n",
        "TRANSLATION_12": "There, the (only) protection comes from Allah, the True One. He is the Best to reward, and the Best to give success.\n",
        "TRANSLATION_13": "There (on the Day of Resurrection), Al-Walayah (the protection, power, authority and kingdom) will be for Allah (Alone), the True God. He (Allah) is the Best for reward and the Best for the final end. (La ilaha ill-Allah none has the right to be worshipped but Allah).\n",
        "TRANSLATION_14": "that Day. Supremacy belongs only to Allah, the True. He is the best to reward and the best ending.\n",
        "TRANSLATION_15": "That is because authority belongs to God, the True. He is Best in rewarding, and Best in requiting.\n",
        "TRANSLATION_16": "There the authority is [completely] for Allah, the Truth. He is best in reward and best in outcome.\n",
        "TRANSLATION_17": "[18:44] There, that is, [on] the Day of Resurrection, [all] protection (walāya; if read wilāya, then [it means] ‘sovereignty’) belongs to God, the True (if read as al-haqqu then it is as an adjective qualifying walāya [or wilāya], or [if] read as al-haqqi, then it is an attribute of [God’s] Majesty). He is better at rewarding, than the rewarding of any [person] other than Him, if such [a person] were [in a position to] reward; and best in consequence (read ‘uquban or ‘uqban), [He is best] in terms of the consequence for believers (both [thawāban, ‘rewarding’, and ‘uqban, ‘consequence’] are in the accusative for [the purpose of] specification).\n",
        "TRANSLATION_18": "(In this case is protection only from Allah) i.e. on the Day of Judgement, dominion and sovereignty belong only to Allah, (the True) the Just. (He is best for reward) He is the best of those who reward, (and best for consequence) and the One who gives the best outcome.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "18:44",
            "28:80",
            "3:150",
            "3:54",
            "10:109",
            "10:30",
            "6:62",
            "47:21",
            "19:76",
            "29:16"
        ],
        "BIBLE": [
            "prophets:joshua:23:15",
            "writings:daniel:7:22",
            "prophets:judges:18:10",
            "prophets:jeremiah:25:31",
            "writings:daniel:2:37",
            "writings:i%20chronicles:29:14",
            "torah:deuteronomy:9:11",
            "writings:psalms:45:7",
            "prophets:ii%20kings:15:19",
            "prophets:isaiah:41:22"
        ]
    }
}