{
    "VERSE": "18:51",
    "ARABIC": "مَّآ أَشْهَدتُّهُمْ خَلْقَ ٱلسَّمَٰوَٰتِ وَٱلْأَرْضِ وَلَا خَلْقَ أَنفُسِهِمْ وَمَا كُنتُ مُتَّخِذَ ٱلْمُضِلِّينَ عَضُدًا",
    "ENGLISH": {
        "TRANSLATION_0": "I did not make them witnesses of the creation of the heavens and the earth nor of their own creation. I would not take as assistants those who lead astray!",
        "TRANSLATION_1": "I did not call them to witness the creation of the heavens and the earth, nor their own creation. I would not take as helpers those who lead (men) astray.\n",
        "TRANSLATION_2": "I did not call them to witness the creation of the heavens and the earth, nor in their own creation. I do not seek the aid of those who lead people astray.\n",
        "TRANSLATION_3": "I did not call (the unjust) to witness the creation of the heavens and earth nor to witness their own creation nor did I want to be helped by those who lead people astray.\n",
        "TRANSLATION_4": "Neither did I make them witness the creations of the heavens and the earth, nor witness their own creation; nor does it befit My Majesty to choose misleaders as aides.\n",
        "TRANSLATION_5": "They did not witness the creation of the heavens and the earth nor their own creation, nor did I take those who mislead as `Adudan.\n",
        "TRANSLATION_6": "I did not make them witnesses of the creation of the heavens and the earth, nor of the creation of their own souls; nor could I take those who lead (others) astray for aiders.\n",
        "TRANSLATION_7": "I made them not witnesses of the creation of the heavens and earth, neither of the creation of themselves; I would not ever take those who lead others astray to be My supporters.\n",
        "TRANSLATION_8": "I made them not to witness the creation of the heavens and the earth, nor their own creation; nor choose I misleaders for (My) helpers.\n",
        "TRANSLATION_9": "I did not call them to witness at the creation of the heavens and the earth, nor at their own creation; I do not take as My helpers those who lead others astray.\n",
        "TRANSLATION_10": "I Made them not present at the creation of the heavens and the earth nor at the creation of themselves; nor was I one to take the seducers as supporters;\n",
        "TRANSLATION_11": "I did not make them witness to the creation of the heavens and the earth, nor to their own creation, nor do I take those who mislead others as assistants.\n",
        "TRANSLATION_12": "I called them not to witness the creation of the heavens and the earth, nor (even) their own creation: nor is it for helpers such as Me to take as lead (men) astray!\n",
        "TRANSLATION_13": "I (Allah) made them (Iblis and his offspring) not to witness (nor took their help in) the creation of the heavens and the earth and not (even) their own creation, nor was I (Allah) to take the misleaders as helpers.\n",
        "TRANSLATION_14": "Neither did I make them witnesses at the creation of the heavens and the earth, nor at their own creation. I would never take those who lead others astray to be My supporters.\n",
        "TRANSLATION_15": "I did not call them to witness the creation of the heavens and the earth, nor their own creation; and I do not take the misleaders for assistants.\n",
        "TRANSLATION_16": "I did not make them witness to the creation of the heavens and the earth or to the creation of themselves, and I would not have taken the misguiders as assistants.\n",
        "TRANSLATION_17": "[18:51] I did not make them a witness, that is, Iblīs and his offspring, to the creation of the heavens and the earth, nor to their own creation, that is to say, I did not make any of them present at the [moment of the] creation of the other. Nor do I take misleaders, devils, as [My] support, as assistants in [the process of] creation, so why do you obey them?\n",
        "TRANSLATION_18": "(I made them not) i.e. the angels and the satans (to witness the creation of the heavens and the earth) when I created them, (nor their own creation) when I created them; it is also said that this means: I did not seek the help of angels and satans to create the heavens and the earth or to create them; (nor choose I 318 misleaders) the disbelievers, the Jews, Christians and idol worshippers (for (My) helpers).\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "18:51",
            "52:36",
            "44:29",
            "45:22",
            "40:57",
            "16:3",
            "42:29",
            "21:16",
            "44:38",
            "21:19"
        ],
        "BIBLE": [
            "torah:genesis:2:23",
            "prophets:isaiah:41:9",
            "prophets:isaiah:63:14",
            "prophets:ezekiel:15:3",
            "writings:i%20chronicles:28:4",
            "prophets:isaiah:48:15",
            "torah:exodus:34:10",
            "prophets:judges:9:48",
            "writings:nehemiah:5:12",
            "prophets:isaiah:50:2"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:3:7",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:3:5",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:5:2"
        ]
    }
}