{
    "VERSE": "18:53",
    "ARABIC": "وَرَءَا ٱلْمُجْرِمُونَ ٱلنَّارَ فَظَنُّوٓا۟ أَنَّهُم مُّوَاقِعُوهَا وَلَمْ يَجِدُوا۟ عَنْهَا مَصْرِفًا",
    "ENGLISH": {
        "TRANSLATION_0": "The evildoers will see the Fire and realise they are going to fall into it and find no way of escaping from it.",
        "TRANSLATION_1": "The sinners will see the Fire and know that they will be thrown into it and will not find a way of escape from it.\n",
        "TRANSLATION_2": "and the guilty shall behold the Fire and know that they are bound to fall into it, and will find no escape from it.\n",
        "TRANSLATION_3": "When the criminals see hell fire, they will have no doubt about falling (headlong) therein, nor of finding anyone to save them.\n",
        "TRANSLATION_4": "And when the guilty see hell, they will be certain of falling into it, and will find no place to escape from it.\n",
        "TRANSLATION_5": "And the criminals shall see the Fire and apprehend that they are to fall therein. And they will find no way of escape from it.\n",
        "TRANSLATION_6": "And the guilty shall see the fire, then they shall know that they are going to fall into it, and they shall not find a place to which to turn away from it.\n",
        "TRANSLATION_7": "Then the evildoers will see the Fire, and think that they are about to fall into it, and will find no escape from it.\n",
        "TRANSLATION_8": "And the guilty behold the Fire and know that they are about to fall therein, and they find no way of escape thence.\n",
        "TRANSLATION_9": "The guilty shall see the Fire and realize that they are going to fall into it: they shall find no way of escape from it.\n",
        "TRANSLATION_10": "And the culprits will behold the Fire and imagine that they are about to fall therein, and they shall not find therefrom a way of escape.\n",
        "TRANSLATION_11": "The guilty will sight the Fire and know that they are about to fall in it, for they will find no way to escape it.\n",
        "TRANSLATION_12": "And the Sinful shall see the fire and apprehend that they have to fall therein: no means will they find to turn away therefrom.\n",
        "TRANSLATION_13": "And the Mujrimun (criminals, polytheists, sinners), shall see the Fire and apprehend that they have to fall therein. And they will find no way of escape from there.\n",
        "TRANSLATION_14": "And when the evildoers see the Fire of Hell they will reckon it is there they shall fall. They shall find no escape from it.\n",
        "TRANSLATION_15": "And the sinners will see the Fire, and will realize that they will tumble into it. They will find no deliverance from it.\n",
        "TRANSLATION_16": "And the criminals will see the Fire and will be certain that they are to fall therein. And they will not find from it a way elsewhere.\n",
        "TRANSLATION_17": "[18:53]   And the criminals will behold the Fire and realise that, are certain that, they are about to fall into it. And they will find no means of avoiding it, of circumventing [it].\n",
        "TRANSLATION_18": "(And the guilty) and the idolaters (behold the Fire and know) and are ascertained (that they are about to fall therein) that they shall enter the Fire, (and they find no way of escape thence):\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "18:53",
            "55:15",
            "23:104",
            "3:131",
            "7:36",
            "59:20",
            "40:72",
            "41:24",
            "51:13",
            "8:14"
        ],
        "BIBLE": [
            "prophets:ii%20samuel:17:12",
            "prophets:ezekiel:38:20",
            "writings:proverbs:28:18",
            "torah:numbers:22:26",
            "writings:job:14:18",
            "prophets:i%20samuel:26:25",
            "prophets:jeremiah:13:7",
            "torah:numbers:24:25",
            "torah:genesis:18:33",
            "prophets:ii%20kings:5:11"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:12",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:14",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:5:1"
        ]
    }
}