{
    "VERSE": "18:56",
    "ARABIC": "وَمَا نُرْسِلُ ٱلْمُرْسَلِينَ إِلَّا مُبَشِّرِينَ وَمُنذِرِينَ وَيُجَٰدِلُ ٱلَّذِينَ كَفَرُوا۟ بِٱلْبَٰطِلِ لِيُدْحِضُوا۟ بِهِ ٱلْحَقَّ وَٱتَّخَذُوٓا۟ ءَايَٰتِى وَمَآ أُنذِرُوا۟ هُزُوًا",
    "ENGLISH": {
        "TRANSLATION_0": "We only send the Messengers to bring good news and to give warning. Those who are kafir use fallacious arguments to deny the truth. They make a mockery of My Signs and also of the warning they were given.",
        "TRANSLATION_1": "We never send apostles but to convey happy tidings, and to warn. But those who disbelieve contend with false arguments to nullify the truth. They make a mockery of My revelations and of what they had been warned.\n",
        "TRANSLATION_2": "We raise Messengers only to give good news and to warn. But the unbelievers resort to falsehood in order to rebut the truth with it, and scoff at My revelations and My warnings.\n",
        "TRANSLATION_3": "The only reason for Our sending the Messengers is to give the human being the glad news of Our mercy and to warn him about Our wrath. The disbelievers argue by false means to refute the Truth. They mock My miracles and warnings.\n",
        "TRANSLATION_4": "And We do not send the Noble Messengers except as Heralds of glad tidings and warnings; and the disbelievers debate by means of falsehood to drive away the Truth with it, and they took My signs and warnings they were given, as a mockery!\n",
        "TRANSLATION_5": "And We send not the Messengers except as bearers of good news and warners. But those who disbelieve, argue with falsehood, in order to refute the truth thereby. And they take My Ayat and that which they are warned for jest!\n",
        "TRANSLATION_6": "And We do not send apostles but as givers of good news and warning, and those who disbelieve make a false contention that they may render null thereby the truth, and they take My communications and that with which they are warned for a mockery.\n",
        "TRANSLATION_7": "And We send not the Envoys, but good tidings to bear, and warning. Yet do the unbelievers dispute with falsehood, that they may rebut thereby the truth. They have taken My signs, and what they are warned of, in mockery.\n",
        "TRANSLATION_8": "We send not the messengers save as bearers of good news and warners. Those who disbelieve contend with falsehood in order to refute the Truth thereby. And they take Our revelations and that wherewith they are threatened as a jest.\n",
        "TRANSLATION_9": "We only send the messengers to bring good news and to give warning. Those who deny use fallacious arguments to nullify the truth, treating My revelations and My warnings as a jest.\n",
        "TRANSLATION_10": "And We send not apostles save as bringers of glad tidings and warners; and those who disbelieve dispute with falsehood that they rebut thereby the truth; and they take My signs and that whereof they are warned as a mockery.\n",
        "TRANSLATION_11": "We do not send the apostles except as bearers of good news and as warners, but those who are faithless dispute fallaciously to refute thereby the truth, having taken My signs and what they are warned of in derision.\n",
        "TRANSLATION_12": "We only send the messengers to give Glad Tidings and to give warnings: But the unbelievers dispute with vain argument, in order therewith to weaken the truth, and they treat My Signs as a jest, as also the fact that they are warned!\n",
        "TRANSLATION_13": "And We send not the Messengers except as giver of glad tidings and warners. But those who disbelieve, dispute with false argument, in order to refute the truth thereby. And they treat My Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.), and that with which they are warned, as jest and mockery!\n",
        "TRANSLATION_14": "We send Our Messengers only to proclaim glad tidings and to give warning. But the unbelievers dispute with false arguments so that they may belie the truth. They have taken My verses and warnings in mockery.\n",
        "TRANSLATION_15": "We send the messengers only as deliverers of good news and warners. Those who disbelieve argue with false argument, in order to defeat the truth thereby. They take My Verses, and the warnings, for a joke.\n",
        "TRANSLATION_16": "And We send not the messengers except as bringers of good tidings and warners. And those who disbelieve dispute by [using] falsehood to [attempt to] invalidate thereby the truth and have taken My verses, and that of which they are warned, in ridicule.\n",
        "TRANSLATION_17": "[18:56] And We do not send messengers except as bearers of good tidings, to believers, and as warners, as threateners to disbelievers. But those who disbelieve dispute with falsehood, when they say that, ‘Has God sent a human as a messenger [from Him]?’ [Q. 17:94] and the like of such [statements], that they may refute thereby, that by way of their disputing they may invalidate, the truth, the Qur’ān. And they have taken My signs, namely, the Qur’ān, and that whereof they have been warned, in the way of the Fire, derisively, in mockery.\n",
        "TRANSLATION_18": "(We send not the messengers save as bearers of good news) Paradise for the believers (and warners) against hell for the disbelievers. (Those who disbelieve) in the scriptures and messengers (contend with falsehood) with idolatry (in order to refute) to nullify (the Truth) and guidance (thereby. And they take Our revelations) Our scriptures and messengers (and that wherewith they are threatened) of chastisement (as a jest) and mockery.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "18:56",
            "43:69",
            "7:118",
            "34:49",
            "15:8",
            "42:35",
            "18:106",
            "103:3",
            "6:49",
            "78:28"
        ],
        "BIBLE": [
            "torah:genesis:3:6",
            "torah:leviticus:10:17",
            "torah:exodus:36:6",
            "torah:leviticus:17:11",
            "prophets:ii%20samuel:4:10",
            "prophets:hosea:2:14",
            "prophets:ii%20samuel:22:36",
            "torah:genesis:31:9",
            "torah:leviticus:7:34",
            "prophets:nahum:1:14"
        ]
    }
}