{
    "VERSE": "18:59",
    "ARABIC": "وَتِلْكَ ٱلْقُرَىٰٓ أَهْلَكْنَٰهُمْ لَمَّا ظَلَمُوا۟ وَجَعَلْنَا لِمَهْلِكِهِم مَّوْعِدًا",
    "ENGLISH": {
        "TRANSLATION_0": "Those cities: We destroyed them when they did wrong and fixed a promised time for their destruction.",
        "TRANSLATION_1": "As for these habitations, We destroyed them only when they transgressed; even so We had fixed a time for their annihilation.\n",
        "TRANSLATION_2": "All the townships afflicted with scourge are before your eyes. When they committed wrong, We destroyed them. For the destruction of each We had set a definite term.\n",
        "TRANSLATION_3": "We only destroyed the inhabitants of certain towns when they had committed injustice and did not repent before Our deadline.\n",
        "TRANSLATION_4": "And these towns – We destroyed them when they committed injustice, and We had set an appointed time for their destruction.\n",
        "TRANSLATION_5": "And these towns, We destroyed them when they did wrong. And We appointed a fixed time for their destruction.\n",
        "TRANSLATION_6": "And (as for) these towns, We destroyed them when they acted unjustly, and We have appointed a time for their destruction.\n",
        "TRANSLATION_7": "And those cities, We destroyed them when they did evil, and appointed for their destruction a tryst.\n",
        "TRANSLATION_8": "And (all) those townships! We destroyed them when they did wrong, and We appointed a fixed time for their destruction.\n",
        "TRANSLATION_9": "We destroyed these communities when they went on doing wrong, and We appointed a time for their destruction.\n",
        "TRANSLATION_10": "And these cities! We destroyed them when they did wrong, and We had appointed for their destruction a tryst.\n",
        "TRANSLATION_11": "Those are the towns that We destroyed when they were wrongdoers, and We appointed a tryst for their destruction.\n",
        "TRANSLATION_12": "Such were the populations we destroyed when they committed iniquities; but we fixed an appointed time for their destruction.\n",
        "TRANSLATION_13": "And these towns (population, 'Ad, Thamud, etc.) We destroyed when they did wrong. And We appointed a fixed time for their destruction.\n",
        "TRANSLATION_14": "And those villages! When they became evil We destroyed them and appointed a meeting for their destruction.\n",
        "TRANSLATION_15": "And these towns—We destroyed them when they committed injustices, and We set for their destruction an appointed time.\n",
        "TRANSLATION_16": "And those cities - We destroyed them when they wronged, and We made for their destruction an appointed time.\n",
        "TRANSLATION_17": "[18:59] And those towns, that is to say, the inhabitants of those [towns], such as ‘Ād and Thamūd, as well as others, We destroyed them when they did evil, [when] they disbelieved, and We appointed for their destruction (a variant reading [for mahlikihim] has muhlakihim) a tryst.\n",
        "TRANSLATION_18": "(And (all) those townships!) And all the people of the townships of old (We destroyed them when they did wrong) when they disbelieved, (and We appointed a fixed time for their destruction).\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "18:59",
            "27:34",
            "17:16",
            "20:113",
            "29:31",
            "26:208",
            "21:9",
            "28:58",
            "36:13",
            "20:87"
        ],
        "BIBLE": [
            "prophets:i%20kings:14:4",
            "writings:proverbs:23:5",
            "torah:numbers:24:1",
            "writings:psalms:101:3",
            "torah:numbers:4:15",
            "prophets:amos:9:4",
            "writings:ii%20chronicles:15:5",
            "writings:ii%20chronicles:14:9",
            "writings:proverbs:19:18",
            "torah:genesis:44:21"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:2:5"
        ]
    }
}