{
    "VERSE": "18:6",
    "ARABIC": "فَلَعَلَّكَ بَٰخِعٌ نَّفْسَكَ عَلَىٰٓ ءَاثَٰرِهِمْ إِن لَّمْ يُؤْمِنُوا۟ بِهَٰذَا ٱلْحَدِيثِ أَسَفًا",
    "ENGLISH": {
        "TRANSLATION_0": "Perhaps you may destroy yourself with grief, chasing after them, if they do not have iman in these words.",
        "TRANSLATION_1": "Will you kill yourself for grief of them if they do not believe in this presentation?\n",
        "TRANSLATION_2": "(O Muhammad), if they do not believe in this Message, you will perhaps torment yourself to death with grief, sorrowing over them.\n",
        "TRANSLATION_3": "Perhaps you will destroy yourself out of grief because they disbelieve this Book.\n",
        "TRANSLATION_4": "Possibly you may risk your life by grieving (O dear Prophet Mohammed – peace and blessings be upon him) for them if they do not believe in this narration.\n",
        "TRANSLATION_5": "Perhaps, you would kill yourself in grief, over their footsteps, because they believe not in this narration.\n",
        "TRANSLATION_6": "Then maybe you will kill yourself with grief, sorrowing after them, if they do not believe in this announcement.\n",
        "TRANSLATION_7": "Yet perchance, if they believe not in this tiding, thou wilt consume thyself, following after them, of grief.\n",
        "TRANSLATION_8": "Yet it may be, if they believe not in this statement, that thou (Muhammad) wilt torment thy soul with grief over their footsteps.\n",
        "TRANSLATION_9": "Perhaps you may destroy yourself with grief if they do not believe in this message.\n",
        "TRANSLATION_10": "Haply thou art going to kill thyself over their footsteps, if they believe not in this discourse, out of sorrow.\n",
        "TRANSLATION_11": "You are liable to imperil your life out of grief for their sake, if they should not believe this discourse.\n",
        "TRANSLATION_12": "Thou wouldst only, perchance, fret thyself to death, following after them, in grief, if they believe not in this Message.\n",
        "TRANSLATION_13": "Perhaps, you, would kill yourself (O Muhammad SAW) in grief, over their footsteps (for their turning away from you), because they believe not in this narration (the Quran).\n",
        "TRANSLATION_14": "Yet perchance, if they do not believe in this tiding, you will consume yourself with grief and follow after them.\n",
        "TRANSLATION_15": "Perhaps you may destroy yourself with grief, chasing after them, if they do not believe in this information.\n",
        "TRANSLATION_16": "Then perhaps you would kill yourself through grief over them, [O Muhammad], if they do not believe in this message, [and] out of sorrow.\n",
        "TRANSLATION_17": "[18:6] Yet it may be that you will consume, destroy, yourself in their wake — following [your being with] them, that is, after they have left you — if they should not believe in this discourse, [in this] Qur’ān, out of grief, out of rage and anguish on your part, because of your eagerness that they believe (asafan, ‘out of grief’, is in the accusative because it functions as an object denoting reason).\n",
        "TRANSLATION_18": "(Yet it may be, if they believe not in this statement) if they do not believe in this Qur'an, (that thou) Muhammad (wilt torment thy soul) kill yourself (with grief over their footsteps) for them.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "18:6",
            "37:70",
            "20:96",
            "21:64",
            "26:3",
            "56:81",
            "68:44",
            "88:1",
            "52:34",
            "26:31"
        ],
        "BIBLE": [
            "torah:exodus:21:23",
            "prophets:ii%20samuel:2:27",
            "torah:deuteronomy:7:4",
            "torah:deuteronomy:18:22",
            "prophets:i%20samuel:14:46",
            "torah:genesis:44:4",
            "prophets:isaiah:59:13",
            "torah:genesis:26:29",
            "torah:deuteronomy:30:19",
            "writings:ii%20chronicles:20:20"
        ]
    }
}