{
    "VERSE": "18:60",
    "ARABIC": "وَإِذْ قَالَ مُوسَىٰ لِفَتَىٰهُ لَآ أَبْرَحُ حَتَّىٰٓ أَبْلُغَ مَجْمَعَ ٱلْبَحْرَيْنِ أَوْ أَمْضِىَ حُقُبًا",
    "ENGLISH": {
        "TRANSLATION_0": "Remember when Musa said to his servant, 'I will not give up until I reach the meeting-place of the two seas, even if I must press on for many years.'",
        "TRANSLATION_1": "When Moses said to his servant (Joshua): \"I will not give up till I reach the confluence of two oceans, or I will journey on and on.\"\n",
        "TRANSLATION_2": "(And recount to them the story of Moses) when Moses said to his servant: \"I will journey on until I reach the point where the two rivers meet, though I may march on for ages.\"\n",
        "TRANSLATION_3": "(Consider) when Moses said to his young companion, \"I shall continue travelling until I reach the junction of the two seas or have travelled for many years\".\n",
        "TRANSLATION_4": "And recall when Moosa said to his assistant, “I will not give up until I reach the place where the two seas meet or until I have progressed for ages.”\n",
        "TRANSLATION_5": "And (remember) when Musa said to his boy-servant: \"I will not give up until I reach the junction of the two seas or a Huqub passes.\"\n",
        "TRANSLATION_6": "And when Musa said to his servant: I will not cease until I reach the junction of the two rivers or I will go on for years.\n",
        "TRANSLATION_7": "And when Moses said to his page, 'I will not give up until I reach the meeting of the two seas, though I go on for many years.\n",
        "TRANSLATION_8": "And when Moses said unto his servant: I will not give up until I reach the point where the two rivers meet, though I march on for ages.\n",
        "TRANSLATION_9": "Recall how Moses said to his servant, \"I shall not give up until I reach the place where both seas meet, even if it takes me years!\"\n",
        "TRANSLATION_10": "And recall what time Musa said unto his page: I shall not cease until I reach the confluence of the two seas, or I shall go on for ages.\n",
        "TRANSLATION_11": "When Moses said to his lad, ‘I will go on [journeying] until I have reached the confluence of the two seas, or have spent a long time [travelling].’\n",
        "TRANSLATION_12": "Behold, Moses said to his attendant, \"I will not give up until I reach the junction of the two seas or (until) I spend years and years in travel.\"\n",
        "TRANSLATION_13": "And (remember) when Musa (Moses) said to his boy-servant: \"I will not give up (travelling) until I reach the junction of the two seas or (until) I spend years and years in travelling.\"\n",
        "TRANSLATION_14": "When Moses said to his (assisting) youth: 'I will not give up until I reach the point where the two seas meet even though I should go on for many years'\n",
        "TRANSLATION_15": "Recall when Moses said to his servant, “I will not give up until I reach the junction of the two rivers, even if it takes me years.”\n",
        "TRANSLATION_16": "And [mention] when Moses said to his servant, \"I will not cease [traveling] until I reach the junction of the two seas or continue for a long period.\"\n",
        "TRANSLATION_17": "[18:60] And, mention, when Moses, son of Amram (‘Imrān), said to his lad, Joshua son of Nun (Yūsha‘ bin Nūn),   who used to follow him around, serve him and acquire knowledge from him, ‘I will not give up, I will not stop journeying, until I have reached the juncture of the two seas — the point where the Byzantine sea and the Persian sea meet, beyond the east, — though I march on for ages’, for a very long time before reaching it, if it be far.\n",
        "TRANSLATION_18": "Allah then mentioned the story of Moses with Khidr. It so happened that it came to Moses's mind that there is no servant on the face of the earth who is more knowledgeable than him. And so Allah said to Moses: \"I have a servant on earth who is more obedient to Me and more knowledgeable than you, and this servant is Khidr\". Moses said: \"0 Lord! Guide me to him\". He said: \"Take with you salted fish and walk along the sea shores until you find a rock in which there is the fountain of life. Sprinkle some of the water on the fish until it comes back to life. There you will meet Khidr\". Allah said: (And when Moses said unto his servant) his servant was Shajardah Joshua ben Nun, an Israelite nobleman. He was his servant in the sense that he kept his company and served him: (I will not give up until I reach the point where the two rivers meet) where sea water meets with river water, i.e. where the Persian Gulf and the Mediterranean Sea meet, (though I march on for ages) or I will continue going on for years.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "18:60",
            "82:3",
            "81:6",
            "18:61",
            "52:6",
            "55:24",
            "10:77",
            "55:19",
            "42:32",
            "36:13"
        ],
        "BIBLE": [
            "prophets:ii%20kings:6:8",
            "prophets:joshua:9:11",
            "prophets:i%20kings:21:19",
            "writings:ii%20chronicles:32:12",
            "torah:genesis:18:31",
            "prophets:judges:21:22",
            "prophets:ii%20kings:18:22",
            "prophets:judges:19:28",
            "torah:numbers:31:49",
            "prophets:isaiah:36:7"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:3:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:5:2"
        ]
    }
}