{
    "VERSE": "18:62",
    "ARABIC": "فَلَمَّا جَاوَزَا قَالَ لِفَتَىٰهُ ءَاتِنَا غَدَآءَنَا لَقَدْ لَقِينَا مِن سَفَرِنَا هَٰذَا نَصَبًا",
    "ENGLISH": {
        "TRANSLATION_0": "When they had gone a distance further on, he said to his servant, 'Bring us our morning meal. Truly this journey of ours has made us tired.'",
        "TRANSLATION_1": "When they had gone past (the confluence), Moses said to his servant: \"Give me my breakfast. I am exhausted from this journey.\"\n",
        "TRANSLATION_2": "When they had journeyed further on, Moses said to his servant: \"Bring us our repast. We are surely fatigued by today's journey.\"\n",
        "TRANSLATION_3": "Moses asked his young companion when they crossed this point, \"Bring us our food; the journey has made us tired.\"\n",
        "TRANSLATION_4": "So when they had gone beyond that place, Moosa said to his assistant, “Bring our breakfast – we have indeed faced great exertion in this journey of ours.”\n",
        "TRANSLATION_5": "So when they passed further on, Musa said to his boy-servant: \"Bring us our morning meal; truly, we have suffered Nasaban in this, our journey.\"\n",
        "TRANSLATION_6": "But when they had gone farther, he said to his servant: Bring to us our morning meal, certainly we have met with fatigue from this our journey.\n",
        "TRANSLATION_7": "When they had passed over, he said to his page, 'Bring us our breakfast; indeed, we have encountered weariness from this our journey.'\n",
        "TRANSLATION_8": "And when they had gone further, he said unto his servant: Bring us our breakfast. Verily we have found fatigue in this our journey.\n",
        "TRANSLATION_9": "After they had passed the place, Moses said to his young companion, \"Bring us our morning meal; we have indeed been fatigued by this journey.\"\n",
        "TRANSLATION_10": "And when the twain had passed by, he said unto his page: bring us our morning-meal, assuredly we have met from this journey of ours, toil\n",
        "TRANSLATION_11": "So when they had passed on, he said to his lad, ‘Bring us our meal. We have certainly encountered much fatigue on this journey of ours.’\n",
        "TRANSLATION_12": "When they had passed on (some distance), Moses said to his attendant: \"Bring us our early meal; truly we have suffered much fatigue at this (stage of) our journey.\"\n",
        "TRANSLATION_13": "So when they had passed further on (beyond that fixed place), Musa (Moses) said to his boy-servant: \"Bring us our morning meal; truly, we have suffered much fatigue in this, our journey.\"\n",
        "TRANSLATION_14": "And when they had gone further, he said to his assisting youth; 'Bring us our breakfast; we are worn out from our journey'\n",
        "TRANSLATION_15": "When they went further, he said to his servant, “Bring us our lunch; we were exposed in our travel to much fatigue.”\n",
        "TRANSLATION_16": "So when they had passed beyond it, [Moses] said to his boy, \"Bring us our morning meal. We have certainly suffered in this, our journey, [much] fatigue.\"\n",
        "TRANSLATION_17": "[18:62] And when they had made the traverse, of that location, having journeyed until the morning of the following day, he, Moses, said to his lad, ‘Bring us our breakfast, (ghadā’) that [meal] which is consumed at the beginning of the day. We have certainly encountered on this journey of ours much fatigue’, exhaustion, which took its effect [on them] after the traverse.\n",
        "TRANSLATION_18": "(And when they had gone further) from the rock, (he said unto his servant) Shajardah: (Bring us our breakfast. Verily we have found fatigue in this our journey).\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "18:62",
            "12:12",
            "50:22",
            "35:35",
            "40:47",
            "21:60",
            "2:65",
            "11:109",
            "10:76",
            "32:23"
        ],
        "BIBLE": [
            "torah:genesis:30:14",
            "prophets:isaiah:49:20",
            "prophets:judges:15:6",
            "torah:genesis:32:1",
            "prophets:ezekiel:33:24",
            "writings:ezra:8:17",
            "prophets:i%20samuel:26:25",
            "writings:nehemiah:12:31",
            "writings:ii%20chronicles:9:12",
            "writings:ii%20chronicles:1:3"
        ]
    }
}