{
    "VERSE": "18:67",
    "ARABIC": "قَالَ إِنَّكَ لَن تَسْتَطِيعَ مَعِىَ صَبْرًا",
    "ENGLISH": {
        "TRANSLATION_0": "He said, 'You will not be able to bear with me.",
        "TRANSLATION_1": "He said: \"You will not be able to bear with me.\n",
        "TRANSLATION_2": "He answered: \"You will surely not be able to bear with me.\n",
        "TRANSLATION_3": "He replied, \"You will not be able to have patience with me.\n",
        "TRANSLATION_4": "He said, “You will never be able to patiently stay with me.”\n",
        "TRANSLATION_5": "He said: \"Verily, you will not be able to have patience with me!\"\n",
        "TRANSLATION_6": "He said: Surely you cannot have patience with me\n",
        "TRANSLATION_7": "Said he, 'Assuredly thou wilt not be able to bear with me patiently.\n",
        "TRANSLATION_8": "He said: Lo! thou canst not bear with me.\n",
        "TRANSLATION_9": "He replied, \"You will not be able to bear with me patiently.\n",
        "TRANSLATION_10": "He said: verily thou wilt not be able to have with me patience;\n",
        "TRANSLATION_11": "He said, ‘Indeed you cannot have patience with me!\n",
        "TRANSLATION_12": "(The other) said: \"Verily thou wilt not be able to have patience with me!\"\n",
        "TRANSLATION_13": "He (Khidr) said: \"Verily! You will not be able to have patience with me!\n",
        "TRANSLATION_14": "You will not bear patiently with me' He replied.\n",
        "TRANSLATION_15": "He said, “You will not be able to endure with me.\n",
        "TRANSLATION_16": "He said, \"Indeed, with me you will never be able to have patience.\n",
        "TRANSLATION_17": "[18:67] Said he, ‘Truly you will not be able to bear with me.\n",
        "TRANSLATION_18": "(He said) Moses: (Lo! thou canst not bear with me) for you may see me doing something that you will not be able to bear. 320\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "18:67",
            "18:72",
            "18:75",
            "26:62",
            "20:35",
            "18:78",
            "69:20",
            "2:153",
            "78:27",
            "26:12"
        ],
        "BIBLE": [
            "prophets:zechariah:4:13",
            "prophets:i%20samuel:26:14",
            "torah:genesis:31:43",
            "prophets:zechariah:4:5",
            "prophets:joshua:1:16",
            "prophets:judges:4:8",
            "prophets:ii%20samuel:1:8",
            "writings:job:34:1",
            "writings:job:35:1",
            "writings:esther:5:7"
        ]
    }
}