{
    "VERSE": "18:68",
    "ARABIC": "وَكَيْفَ تَصْبِرُ عَلَىٰ مَا لَمْ تُحِطْ بِهِۦ خُبْرًا",
    "ENGLISH": {
        "TRANSLATION_0": "How indeed could you bear with patience something you have not encompassed in your knowledge?'",
        "TRANSLATION_1": "How can you bear that which is beyond your comprehension?\"\n",
        "TRANSLATION_2": "For how can you patiently bear with something you cannot encompass in your knowledge?\"\n",
        "TRANSLATION_3": "How can you remain patient with that which you do not fully understand?\"\n",
        "TRANSLATION_4": "“And how will you bear something which your knowledge does not encompass?”\n",
        "TRANSLATION_5": "And how can you have patience about a thing which you know not\"\n",
        "TRANSLATION_6": "And how can you have patience in that of which you have not got a comprehensive knowledge?\n",
        "TRANSLATION_7": "And how shouldst thou bear patiently that thou hast never encompassed in thy knowledge?'\n",
        "TRANSLATION_8": "How canst thou bear with that whereof thou canst not compass any knowledge?\n",
        "TRANSLATION_9": "How could you be patient in matters beyond your knowledge?\"\n",
        "TRANSLATION_10": "And how canst thou have patience over that which thy knowledge encompasseth not\n",
        "TRANSLATION_11": "And how can you have patience about something you do not comprehend?’\n",
        "TRANSLATION_12": "And how canst thou have patience about things about which thy understanding is not complete?\"\n",
        "TRANSLATION_13": "And how can you have patience about a thing which you know not?\"\n",
        "TRANSLATION_14": "For how can you bear patiently with that which you have never encompassed in your knowledge'\n",
        "TRANSLATION_15": "And how will you endure what you have no knowledge of?”\n",
        "TRANSLATION_16": "And how can you have patience for what you do not encompass in knowledge?\"\n",
        "TRANSLATION_17": "[18:68] And how can you bear with that whereof you have never been informed?’: in the above-mentioned hadīth [of Bukhārī] after this verse [there is the following statement]: ‘O Moses, I possess knowledge which God has taught me and which you do not have, and [equally] you possess knowledge which God has taught you and which I do not have’. (His saying khubran, ‘informed’, is a verbal noun meaning that which you have never encompassed, in other words, the truth of which you have never been informed of.)\n",
        "TRANSLATION_18": "When Moses said he will be able to bear anything, Khidr said: (How canst thou) Moses (bear with that whereof thou canst not compass any knowledge) that the explanation of which you have not been given?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "18:68",
            "6:24",
            "68:36",
            "37:154",
            "18:91",
            "89:6",
            "74:20",
            "105:1",
            "17:21",
            "88:20"
        ],
        "BIBLE": [
            "writings:job:42:3",
            "writings:proverbs:4:7",
            "writings:proverbs:20:21",
            "torah:leviticus:5:17",
            "writings:proverbs:19:25",
            "writings:job:42:2",
            "writings:daniel:5:15",
            "prophets:jeremiah:4:22",
            "torah:exodus:14:18",
            "writings:ecclesiastes:3:14"
        ]
    }
}