{
    "VERSE": "18:69",
    "ARABIC": "قَالَ سَتَجِدُنِىٓ إِن شَآءَ ٱللَّهُ صَابِرًا وَلَآ أَعْصِى لَكَ أَمْرًا",
    "ENGLISH": {
        "TRANSLATION_0": "Musa said, 'You will find me patient, if Allah wills, and I will not disobey you in any matter.'",
        "TRANSLATION_1": "You will find me patient if God wills,\" said Moses; \"and I will not disobey you in any thing.\"\n",
        "TRANSLATION_2": "Moses replied: \"You shall find me, if Allah wills, patient; and I shall not disobey you in anything.\"\n",
        "TRANSLATION_3": "Moses said, \"If God wishes, you will find me patient and I shall not disobey any of your orders.\"\n",
        "TRANSLATION_4": "Said Moosa, “Allah willing, you will soon find me patient and I will not do anything against your instructions.”\n",
        "TRANSLATION_5": "Musa said: \"If Allah wills, you will find me patient, and I will not disobey you in aught.\"\n",
        "TRANSLATION_6": "He said: If Allah pleases, you will find me patient and I shall not disobey you in any matter.\n",
        "TRANSLATION_7": "He said, 'Yet thou shalt find me, if God will, patient; and I shall not rebel against thee in anything.'\n",
        "TRANSLATION_8": "He said: Allah willing, thou shalt find me patient and I shall not in aught gainsay thee.\n",
        "TRANSLATION_9": "Moses said, \"God willing, you will find me patient, and I will not disobey you in any thing.\"\n",
        "TRANSLATION_10": "Musa said: thou wilt find me, if Allah will, patient, and shall not disobey thee in any affair.\n",
        "TRANSLATION_11": "He said, ‘You will find me, God willing, to be patient, and I will not disobey you in any matter.’\n",
        "TRANSLATION_12": "Moses said: \"Thou wilt find me, if Allah so will, (truly) patient: nor shall I disobey thee in aught.\"\n",
        "TRANSLATION_13": "Musa (Moses) said: \"If Allah will, you will find me patient, and I will not disobey you in aught.\"\n",
        "TRANSLATION_14": "He (Moses) said: 'If Allah wills, you shall find me patient, I shall not disobey your order'\n",
        "TRANSLATION_15": "He said, “You will find me, God willing, patient; and I will not disobey you in any order of yours.”\n",
        "TRANSLATION_16": "[Moses] said, \"You will find me, if Allah wills, patient, and I will not disobey you in [any] order.\"\n",
        "TRANSLATION_17": "[18:69] He said, ‘You will find me, God willing, patient, and I will not disobey, in other words, and [you will also find me] non-disobedient [towards], you in any matter’, with which you charge me. He [Moses] made this [statement] conditional upon the Will [of God] because he was not confident of himself in what he had committed himself to. Indeed, this is the custom of prophets and saints, namely, that they do not put their trust in themselves for a single moment.\n",
        "TRANSLATION_18": "(He said: Allah willing, thou shalt find me) Khidr (patient) in relation to that which I see from you (and I shall not in aught gainsay thee) I will not disobey your command.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "18:69",
            "20:26",
            "47:26",
            "11:34",
            "11:33",
            "40:44",
            "15:69",
            "20:32",
            "16:1",
            "23:87"
        ],
        "BIBLE": [
            "torah:genesis:30:31",
            "prophets:i%20samuel:3:17",
            "prophets:ezekiel:24:19",
            "writings:daniel:6:6",
            "torah:numbers:32:20",
            "torah:exodus:18:17",
            "torah:exodus:33:17",
            "torah:leviticus:8:5",
            "prophets:jeremiah:40:16",
            "writings:nehemiah:5:9"
        ]
    }
}