{
    "VERSE": "18:74",
    "ARABIC": "فَٱنطَلَقَا حَتَّىٰٓ إِذَا لَقِيَا غُلَٰمًا فَقَتَلَهُۥ قَالَ أَقَتَلْتَ نَفْسًا زَكِيَّةًۢ بِغَيْرِ نَفْسٍ لَّقَدْ جِئْتَ شَيْـًٔا نُّكْرًا",
    "ENGLISH": {
        "TRANSLATION_0": "So they went on until they met a youngster whom he killed. Musa said, 'Have you killed a boy who has done no wrong, without it being in retaliation for someone else? This is truly an appalling thing that you have done!'",
        "TRANSLATION_1": "The two went on till they came to a boy, whom he killed. Moses exclaimed: \"You have killed an innocent soul who had taken no life. You have done a most abominable thing!\"\n",
        "TRANSLATION_2": "Then the two went forth until they met a lad whom he slew, whereupon Moses exclaimed: \"What! Have you slain an innocent person without his having slain anyone? Surely you have done a horrible thing.\"\n",
        "TRANSLATION_3": "They continued on their journey until they met a young boy whom he killed. Moses said, \"How could you murder an innocent soul? This is certainly a horrible act\".\n",
        "TRANSLATION_4": "So they set out again; until when they met a boy, the chosen bondman slew him – Moosa said, “Did you slay an innocent soul not in retribution for another? You have indeed done an extremely evil thing.”\n",
        "TRANSLATION_5": "Then they both proceeded till they met a boy, and he (Khidr) killed him. Musa said: \"Have you killed an innocent person without Nafs Verily, you have committed a thing Nukr!\"\n",
        "TRANSLATION_6": "So they went on until, when they met a boy, he slew him. (Musa) said: Have you slain an innocent person otherwise than for manslaughter? Certainly you have done an evil thing.\n",
        "TRANSLATION_7": "So they departed; until, when they met a lad, he slew him. He said, 'What, hast thou slain a soul innocent, and that not to retaliate for a soul slain? Thou hast indeed done a horrible thing.'\n",
        "TRANSLATION_8": "So they twain journeyed on till, when they met a lad, he slew him. (Moses) said: What! Hast thou slain an innocent soul who hath slain no man? Verily thou hast done a horrid thing.\n",
        "TRANSLATION_9": "So they travelled on. Then they met a young boy and the man killed him. Moses said, \"Have you slain an innocent person without his having slain anyone? Indeed, you have done a terrible thing!\"\n",
        "TRANSLATION_10": "Then the twain journeyed until when they met a boy, and he killed him. Musa said: hast thou slain a person innocent not in return for a Person Assuredly thou hast committed a thing formidable.\n",
        "TRANSLATION_11": "So they went on until they came upon a boy, whereat he slew him. He said, ‘Did you slay an innocent soul, without [his having slain] anyone? You have certainly done a dire thing!’\n",
        "TRANSLATION_12": "Then they proceeded: until, when they met a young man, he slew him. Moses said: \"Hast thou slain an innocent person who had slain none? Truly a foul (unheard of) thing hast thou done!\"\n",
        "TRANSLATION_13": "Then they both proceeded, till they met a boy, he (Khidr) killed him. Musa (Moses) said: \"Have you killed an innocent person who had killed none? Verily, you have committed a thing \"Nukra\" (a great Munkar - prohibited, evil, dreadful thing)!\"\n",
        "TRANSLATION_14": "and so they departed. Thereafter they met a boy and he killed him. He (Moses) exclaimed: 'What, have you killed a pure soul and it was not done (in retaliation) for a soul you have done a terrible thing'\n",
        "TRANSLATION_15": "Then they set out. Until, when they encountered a boy, he killed him. He said, “Did you kill a pure soul, who killed no one? You have done something terrible.”\n",
        "TRANSLATION_16": "So they set out, until when they met a boy, al-Khidh r killed him. [Moses] said, \"Have you killed a pure soul for other than [having killed] a soul? You have certainly done a deplorable thing.\"\n",
        "TRANSLATION_17": "[18:74] So they set off, after leaving the ship, making their way on foot, until, when they met a boy, who had not yet reached puberty, playing with [other] boys, among whom his face was the fairest — and he, al-Khidr, slew him, by slitting his throat with a knife while he lay down, or by tearing his head off with his hand, or by smashing his head against a wall, all of which are [different] opinions (the coordinating fā’ [of fa-qatalahu, ‘and he slew him’] is used here because [it indicates that] the slaying took place after the encounter; the response to idhā, ‘when’ is [the following statement, qāla …]) — he, Moses, said, to him: ‘Have you slain an innocent soul, that is, a pure one that had not reached the age of [legal] responsibility (a variant reading [for zākiya] has zakiyya), [one slain] not in retaliation for another soul?, in other words, one that has not slain any soul. Verily you have committed an dreadful thing’ (read nukran or nukuran), that is to say, an abomination.\n",
        "TRANSLATION_18": "(So the twain journeyed on till, when they met a lad) between two townships, (he slew him) Khidr killed him. ((Moses) said: What! Hast thou) Khidr (slain an innocent soul who hath slain no man? Verily thou hast done a horrid thing) you have committed a horrendous, evil act.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "18:74",
            "18:71",
            "54:6",
            "11:101",
            "6:164",
            "19:27",
            "11:57",
            "52:35",
            "36:54",
            "37:101"
        ],
        "BIBLE": [
            "prophets:ii%20kings:8:9",
            "torah:genesis:20:3",
            "prophets:ii%20kings:2:9",
            "prophets:ezekiel:3:21",
            "torah:genesis:12:5",
            "prophets:ii%20kings:10:15",
            "prophets:judges:19:28",
            "prophets:i%20samuel:28:21",
            "prophets:ii%20kings:1:6",
            "prophets:ii%20kings:2:10"
        ]
    }
}