{
    "VERSE": "18:75",
    "ARABIC": "قَالَ أَلَمْ أَقُل لَّكَ إِنَّكَ لَن تَسْتَطِيعَ مَعِىَ صَبْرًا",
    "ENGLISH": {
        "TRANSLATION_0": "He said, 'Did I not tell you that you would not be able to bear with me?'",
        "TRANSLATION_1": "He said: \"Did I not tell you you will not be able to bear with me?\"\n",
        "TRANSLATION_2": "He said: \"Did I not tell you that you will not be able to patiently bear with me?\"\n",
        "TRANSLATION_3": "He responded, \"Did I not tell you that you will not be able to remain patient with me?\"\n",
        "TRANSLATION_4": "He said, “Did I not tell you that you will never be able to patiently stay with me?”\n",
        "TRANSLATION_5": "He said: \"Did I not tell you that you can have no patience with me\"\n",
        "TRANSLATION_6": "He said: Did I not say to you that you will not be able to have patience with me?\n",
        "TRANSLATION_7": "Said he, 'Did I not say that thou couldst never bear with me patiently?'\n",
        "TRANSLATION_8": "He said: Did I not tell thee that thou couldst not bear with me?\n",
        "TRANSLATION_9": "The man said, \"Did I not tell you that you would not be able to have any patience with me?\"\n",
        "TRANSLATION_10": "He said: said I not unto thee that thou wouldst by no means be able to have with me patience?\n",
        "TRANSLATION_11": "He said, ‘Did I not tell you that you cannot have patience with me?’\n",
        "TRANSLATION_12": "He answered: \"Did I not tell thee that thou canst have no patience with me?\"\n",
        "TRANSLATION_13": "(Khidr) said: \"Did I not tell you that you can have no patience with me?\"\n",
        "TRANSLATION_14": "Did I not tell you' he replied, 'that you would not be able to bear patiently with me'\n",
        "TRANSLATION_15": "He said, “Did I not tell you that you will not be able to endure with me?”\n",
        "TRANSLATION_16": "[Al-Khidh r] said, \"Did I not tell you that with me you would never be able to have patience?\"\n",
        "TRANSLATION_17": "[18:75] He said, ‘Did I not say to you that you would never be able to bear with me?’ (laka, ‘to you’, has been added to that [same statement] which was made before because this time there could not be any excuse [for Moses’s impatience].\n",
        "TRANSLATION_18": "(He said) Khidr said: (Did I not tell thee) Moses (that thou couldst not bear with me? Did I not tell you that you might see me doing something that you will not be able to tolerate?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "18:75",
            "18:72",
            "18:67",
            "94:1",
            "18:78",
            "20:35",
            "71:9",
            "37:52",
            "2:153",
            "26:62"
        ],
        "BIBLE": [
            "prophets:ezekiel:37:3",
            "prophets:zechariah:4:13",
            "torah:genesis:44:15",
            "prophets:ii%20kings:8:14",
            "torah:numbers:22:37",
            "torah:exodus:4:1",
            "torah:numbers:23:26",
            "torah:exodus:33:20",
            "prophets:isaiah:2:9",
            "writings:nehemiah:6:11"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:3:5",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:3:6",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:3:8",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:4:8",
            "Sefer%20Yetzirah:4:9"
        ]
    }
}