{
    "VERSE": "18:78",
    "ARABIC": "قَالَ هَٰذَا فِرَاقُ بَيْنِى وَبَيْنِكَ سَأُنَبِّئُكَ بِتَأْوِيلِ مَا لَمْ تَسْتَطِع عَّلَيْهِ صَبْرًا",
    "ENGLISH": {
        "TRANSLATION_0": "He said, 'This is where you and I part company. I will let you know the explanation of those things about which you were not able to restrain yourself.",
        "TRANSLATION_1": "This is the parting of our \"ways,\" he said. \"But I will now explain the things you could not bear:\n",
        "TRANSLATION_2": "He said: \"This brings me and you to a parting of ways. Now I shall explain to you the true meaning of things about which you could not remain patient.\n",
        "TRANSLATION_3": "He replied, \"This is where we should depart from one another. I shall give an explanation to you for all that I have done for which you could not remain patient.\n",
        "TRANSLATION_4": "He said, “This is the parting between you and me; I shall now tell you the interpretation of the matters you could not patiently bear.”\n",
        "TRANSLATION_5": "He said: \"This is the parting between you and I, I will tell you the interpretation of (those) things over which you were not able to be patient.\"\n",
        "TRANSLATION_6": "He said: This shall be separation between me and you; now I will inform you of the significance of that with which you could not have patience.\n",
        "TRANSLATION_7": "Said he, 'This is the parting between me and thee. Now I will tell thee the interpretation of that thou couldst not bear patiently.\n",
        "TRANSLATION_8": "He said: This is the parting between thee and me! I will announce unto thee the interpretation of that thou couldst not bear with patience.\n",
        "TRANSLATION_9": "He answered, \"This is where you and I must part company. But first I will tell you the meaning of the things you could not bear with patiently.\n",
        "TRANSLATION_10": "He said: this shall be the parting between me and thee; now I shall declare unto thee the interpretation of that wherewith thou wast not able to have patience.\n",
        "TRANSLATION_11": "He said, ‘This is where you and I shall part. I will inform you about the interpretation of that over which you could not maintain patience.\n",
        "TRANSLATION_12": "He answered: \"This is the parting between me and thee: now will I tell thee the interpretation of (those things) over which thou wast unable to hold patience.\n",
        "TRANSLATION_13": "(Khidr) said: \"This is the parting between me and you, I will tell you the interpretation of (those) things over which you were unable to hold patience.\n",
        "TRANSLATION_14": "He said: 'This is the parting between me and you. But now I will tell you the interpretation of that which you could not patiently bear.\n",
        "TRANSLATION_15": "He said, “This is the parting between you and me. I will tell you the interpretation of what you were unable to endure.\n",
        "TRANSLATION_16": "[Al-Khidh r] said, \"This is parting between me and you. I will inform you of the interpretation of that about which you could not have patience.\n",
        "TRANSLATION_17": "[18:78] Said he, al-Khidr, to him, ‘This is the parting, that is, the moment for parting, between me and you (baynī wa-baynika, here [the preposition] bayna has been annexed to a non-multiple [noun], but this is allowed [grammatically] because it is then repeated with [its other noun together with] the coordinating wāw). I will inform you, before I part company with you, the interpretation of that over which you were not able to maintain patience.\n",
        "TRANSLATION_18": "321 (He said) Khidr said: (This is the parting between thee and me) Moses! (I will announce unto thee the interpretation of that thou couldst not bear with patience).\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "18:78",
            "69:26",
            "18:75",
            "16:127",
            "18:68",
            "18:67",
            "18:72",
            "56:60",
            "25:67",
            "7:126"
        ],
        "BIBLE": [
            "prophets:isaiah:43:9",
            "writings:job:32:6",
            "writings:daniel:2:7",
            "writings:daniel:5:15",
            "writings:daniel:2:10",
            "prophets:i%20kings:11:22",
            "torah:leviticus:20:25",
            "writings:daniel:2:24",
            "prophets:isaiah:41:22",
            "prophets:isaiah:46:10"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:2",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:2",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:1:3"
        ]
    }
}