{
    "VERSE": "18:8",
    "ARABIC": "وَإِنَّا لَجَٰعِلُونَ مَا عَلَيْهَا صَعِيدًا جُرُزًا",
    "ENGLISH": {
        "TRANSLATION_0": "We will certainly make everything on it a barren wasteland.",
        "TRANSLATION_1": "For We shall certainly turn it to barren dust.\n",
        "TRANSLATION_2": "In the ultimate, We shall reduce all that is on the earth to a barren plain.\n",
        "TRANSLATION_3": "Let it be known that We will turn all things on earth into dust.\n",
        "TRANSLATION_4": "And indeed We shall one day make all that is on it a barren plain.\n",
        "TRANSLATION_5": "And verily, We shall make all that is on it bare, dry soil.\n",
        "TRANSLATION_6": "And most surely We will make what is on it bare ground without herbage.\n",
        "TRANSLATION_7": "and We shall surely make all that is on it barren dust.\n",
        "TRANSLATION_8": "And lo! We shall make all that is thereon a barren mound.\n",
        "TRANSLATION_9": "but We shall reduce all this to barren waste.\n",
        "TRANSLATION_10": "And verily We are going to make whatsoever is thereon a soil bare.\n",
        "TRANSLATION_11": "And indeed We will turn whatever is on it into a barren plain.\n",
        "TRANSLATION_12": "Verily what is on earth we shall make but as dust and dry soil (without growth or herbage).\n",
        "TRANSLATION_13": "And verily! We shall make all that is on it (the earth) a bare dry soil (without any vegetation or trees, etc.).\n",
        "TRANSLATION_14": "We will surely reduce all that is on it to barren dust.\n",
        "TRANSLATION_15": "And We will turn what is on it into barren waste.\n",
        "TRANSLATION_16": "And indeed, We will make that which is upon it [into] a barren ground.\n",
        "TRANSLATION_17": "[18:8] And indeed We shall turn all that is therein into barren shreds, that produce no plants.\n",
        "TRANSLATION_18": "(And lo! We shall make) change (all that is therein) of ornament into (a barren mound) a smooth dust with no vegetation.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "18:8",
            "23:95",
            "37:137",
            "86:8",
            "26:56",
            "26:55",
            "37:165",
            "37:166",
            "69:49",
            "15:9"
        ],
        "BIBLE": [
            "prophets:hosea:5:9",
            "prophets:zephaniah:3:20",
            "prophets:ii%20samuel:7:23",
            "writings:i%20chronicles:17:21",
            "prophets:nahum:3:6",
            "torah:genesis:35:3",
            "writings:daniel:2:5",
            "prophets:isaiah:38:19",
            "prophets:isaiah:29:21",
            "torah:deuteronomy:5:8"
        ]
    }
}