{
    "VERSE": "18:81",
    "ARABIC": "فَأَرَدْنَآ أَن يُبْدِلَهُمَا رَبُّهُمَا خَيْرًا مِّنْهُ زَكَوٰةً وَأَقْرَبَ رُحْمًا",
    "ENGLISH": {
        "TRANSLATION_0": "We wanted their Lord to give them in exchange a purer son than him, one more compassionate.",
        "TRANSLATION_1": "We hoped their Lord would give them a substitute better than him in virtue and goodness.\n",
        "TRANSLATION_2": "and we desired that their Lord should grant them another in his place, a son more upright and more tender hearted.\n",
        "TRANSLATION_3": "so We decided that their Lord should replace him by a better and more virtuous son.\n",
        "TRANSLATION_4": "“So we wished that their Lord may bestow them a child – better, purer and nearer to mercy.”\n",
        "TRANSLATION_5": "So we intended that their Lord should exchange him for them for one better in righteousness and nearer to mercy.\"\n",
        "TRANSLATION_6": "So we desired that their Lord might give them in his place one better than him in purity and nearer to having compassion.\n",
        "TRANSLATION_7": "so we desired that their Lord should give to them in exchange one better than he in purity, and nearer in tenderness.\n",
        "TRANSLATION_8": "And we intended that their Lord should change him for them for one better in purity and nearer to mercy.\n",
        "TRANSLATION_9": "We wanted their Lord to replace him with someone purer than him and more compassionate.\n",
        "TRANSLATION_10": "So we intended that their Lord should change for the twain one better than he in piety and closer in affection.\n",
        "TRANSLATION_11": "So We desired that their Lord should give them in exchange one better than him in respect of purity and closer in mercy.\n",
        "TRANSLATION_12": "So we desired that their Lord would give them in exchange (a son) better in purity (of conduct) and closer in affection.\n",
        "TRANSLATION_13": "So we intended that their Lord should change him for them for one better in righteousness and near to mercy.\n",
        "TRANSLATION_14": "It was our wish that their Lord should grant them another in exchange, another better in purity and tenderness.\n",
        "TRANSLATION_15": "So we wanted their Lord to replace him with someone better in purity, and closer to mercy.\n",
        "TRANSLATION_16": "So we intended that their Lord should substitute for them one better than him in purity and nearer to mercy.\n",
        "TRANSLATION_17": "[18:81] So We desired that their Lord should give them in exchange (read yubaddilahumā or yubdilahumā) one better than him in purity, that is, in righteousness and God-fearing, and closer, than him, to mercy (read ruhman or ruhuman, in other words [it is to be understood as] rahmatan, ‘by way of mercy’) namely, [closer to] dutifulness towards his parents. Thus God, exalted be He, gave them in exchange a girl, who [afterwards] married a prophet and gave birth to a prophet through whom God guided an entire community.\n",
        "TRANSLATION_18": "(And We intended that their Lord should change him for them for one) another child (better in purity) righteous (and nearer to mercy) who is more keen to keep ties of kinship. Allah gave them instead of him a girl who later married a prophet and from whom she gave birth to a prophet at whose hand a great number of people were guided. The son killed by Khidr, whose name was Jaysur, was, on the other hand, a disbeliever, a thief and a murderer. This is why Khidr killed him.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "18:81",
            "68:32",
            "23:29",
            "23:118",
            "15:56",
            "18:40",
            "23:109",
            "45:30",
            "2:37",
            "17:28"
        ],
        "BIBLE": [
            "writings:psalms:145:9",
            "writings:psalms:103:17",
            "torah:numbers:10:29",
            "prophets:ii%20kings:22:19",
            "prophets:ii%20kings:13:23",
            "writings:psalms:103:8",
            "torah:genesis:18:26",
            "prophets:jonah:4:2",
            "writings:ii%20chronicles:1:3",
            "prophets:jeremiah:22:3"
        ]
    }
}