{
    "VERSE": "18:82",
    "ARABIC": "وَأَمَّا ٱلْجِدَارُ فَكَانَ لِغُلَٰمَيْنِ يَتِيمَيْنِ فِى ٱلْمَدِينَةِ وَكَانَ تَحْتَهُۥ كَنزٌ لَّهُمَا وَكَانَ أَبُوهُمَا صَٰلِحًا فَأَرَادَ رَبُّكَ أَن يَبْلُغَآ أَشُدَّهُمَا وَيَسْتَخْرِجَا كَنزَهُمَا رَحْمَةً مِّن رَّبِّكَ وَمَا فَعَلْتُهُۥ عَنْ أَمْرِى ذَٰلِكَ تَأْوِيلُ مَا لَمْ تَسْطِع عَّلَيْهِ صَبْرًا",
    "ENGLISH": {
        "TRANSLATION_0": "As for the wall, it belonged to two young orphans in the town and there was a treasure underneath it, belonging to them. Their father was one of the righteous and your Lord wanted them to come of age and then to unearth their treasure as a mercy from your Lord. I did not do it of my own volition. That is the explanation of the things about which you were not able to restrain yourself.'",
        "TRANSLATION_1": "As for that wall, it belonged to two orphan boys of the city, and their treasure was buried under it. Their father was an upright man. So your Lord willed that on reaching the age of maturity they should dig out their treasure as a favour from their Lord. So, I did not do that of my own accord. This is the explanation of things you could not bear with patience.\"\n",
        "TRANSLATION_2": "As for the wall, it belonged to two orphan boys in the city, and under it there was a treasure that belonged to them. Their father was a righteous man and your Lord intended that they should come of age and then bring forth their treasure as a mercy from your Lord; I did not do this of my own bidding. This is the true meaning of things with which you could not keep your patience.\"\n",
        "TRANSLATION_3": "The tumbling wall belonged to two orphans in the town whose father was a righteous person. Underneath the wall there was a treasure that belonged to them. Your Lord wanted the orphans to find the treasure through the mercy of your Lord when they mature. I did not repair the wall out of my own desire. These were the explanations of my deeds about which you could not remain patient.\"\n",
        "TRANSLATION_4": "“And in respect of the wall – it belonged to two orphan boys of the city, and beneath it was their treasure, and their father was a virtuous man; therefore your Lord willed that they should reach their maturity and remove their treasure; by the mercy of your Lord; and I have not done this at my own command; this is the interpretation of the matters you could not patiently bear.” (* Hazrat Khidr was given the knowledge of the hidden – as in all three explanations he gave).\n",
        "TRANSLATION_5": "And as for the wall, it belonged to two orphan boys in the town; and there was under it a treasure belonging to them; and their father was a righteous man, and your Lord intended that they should attain their age of full strength and take out their treasure as a mercy from your Lord. And I did them not of my own accord. That is the interpretation of those (things) over which you could not be patient.\n",
        "TRANSLATION_6": "And as for the wall, it belonged to two orphan boys in the city, and there was beneath it a treasure belonging to them, and their father was a righteous man; so your Lord desired that they should attain their maturity and take out their treasure, a mercy from your Lord, and I did not do it of my own accord. This is the significance of that with which you could not have patience.\n",
        "TRANSLATION_7": "As for the wall, it belonged to two orphan lads in the city, and under it was a treasure belonging to them. Their father was a righteous man; and thy Lord desired that they should come of age and then bring forth their treasure as a mercy from thy Lord. I did it not of my own bidding. This is the interpretation of that thou couldst not bear patiently.'\n",
        "TRANSLATION_8": "And as for the wall, it belonged to two orphan boys in the city, and there was beneath it a treasure belonging to them, and their father had been righteous, and thy Lord intended that they should come to their full strength and should bring forth their treasure as a mercy from their Lord; and I did it not upon my own command. Such is the interpretation of that wherewith thou couldst not bear.\n",
        "TRANSLATION_9": "The wall belonged to two young orphans in the town whose father had been a righteous man, and a treasure of theirs lay underneath it. So your Lord wanted them to come of age and then to dig up their treasure as a mercy from Him. I did not do [it] of my own accord. That is the explanation of the things about which you were not able to restrain yourself.\"\n",
        "TRANSLATION_10": "And as for the wall, it belonged to two orphan boys in the town and underneath it was a treasure belonging to them and their father had been righteous. So thy Lord intended that the twain should attain their maturity and bring forth for themselves their treasure as a mercy from thy Lord. And I did it not of mine own command; that is the interpretation of that wherewith thou wast not able to have patience.\n",
        "TRANSLATION_11": "As for the wall, it belonged to two boy orphans in the city. Under it there was a treasure belonging to them. Their father had been a righteous man. So your Lord desired that they should come of age and take out their treasure—as a mercy from your Lord. I did not do that out of my own accord. This is the interpretation of that over which you could not maintain patience.’\n",
        "TRANSLATION_12": "As for the wall, it belonged to two youths, orphans, in the Town; there was, beneath it, a buried treasure, to which they were entitled: their father had been a righteous man: So thy Lord desired that they should attain their age of full strength and get out their treasure - a mercy (and favour) from thy Lord. I did it not of my own accord. Such is the interpretation of (those things) over which thou wast unable to hold patience.\"\n",
        "TRANSLATION_13": "And as for the wall, it belonged to two orphan boys in the town; and there was under it a treasure belonging to them; and their father was a righteous man, and your Lord intended that they should attain their age of full strength and take out their treasure as a mercy from your Lord. And I did it not of my own accord. That is the interpretation of those (things) over which you could not hold patience.\"\n",
        "TRANSLATION_14": "As for the wall, it belonged to two orphan boys in the city. Beneath it was (buried) a treasure which belonged to them. Their father had been a righteous person and your Lord willed that when they reach manhood to bring out their treasure as a mercy from your Lord. What I did was not done by my own command. That is the interpretation of what you could not bear with patience'\n",
        "TRANSLATION_15": "And as for the wall, it belonged to two orphaned boys in the town. Beneath it was a treasure that belonged to them. Their father was a righteous man. Your Lord wanted them to reach their maturity, and then extract their treasure—as a mercy from your Lord. I did not do it of my own accord. This is the interpretation of what you were unable to endure.”\n",
        "TRANSLATION_16": "And as for the wall, it belonged to two orphan boys in the city, and there was beneath it a treasure for them, and their father had been righteous. So your Lord intended that they reach maturity and extract their treasure, as a mercy from your Lord. And I did it not of my own accord. That is the interpretation of that about which you could not have patience.\"\n",
        "TRANSLATION_17": "[18:82] And as for the wall, it belonged to two orphan boys [who lived] in the city, and beneath it there was a treasure, a buried trove of gold and silver, belonging to them. Their father had been a righteous man, and so because of his righteousness they were protected both in [terms of] their souls and their possessions, and your Lord desired that they should come of age, that is, [He desired for them] the attainment of maturity, and extract their treasure as a mercy from your Lord (rahmatan min rabbik is a direct object denoting reason, operated by [the verb] arāda, ‘He desired’). And I did not do it, namely, what has been mentioned of [his] making a hole in the ship, the slaying of the boy and the repair of the wall, of my own accord, that is, [out of] my own choosing; nay, it was because of a command in the form of an inspiration from God. This is the interpretation of that over which you could not maintain patience’ (one may say istā‘a or istatā‘a to mean ‘he had the capacity for [something]’; in this instance and the previous one both forms [of the verb] have been used. Moreover, there is a variety of expression in the use of fa-aradtu, ‘I desired’, fa-aradnā, ‘We desired’, and fa-arāda rabbuk, ‘Your Lord desired’).\n",
        "TRANSLATION_18": "(And as for the wall) which I repaired, (it belonged to two orphan boys) called Asram and Suraym (in the city) of Antioch, (and there was beneath it a treasure belonging to them) it was a tablet of gold containing knowledge and wisdom and written on it: \"In the name of Allah, the Beneficent, the Merciful. I am really amazed regarding a person who believes in death: how could he ever be happy; and amazed at a person who believes in the evanescence of this worldly life and the fluctuation of its people: how he can find tranquillity in it; there is no deity except Allah and Muhammad is the Messenger of Allah (pbuh)\" (and their father had been righteous) he was a trustworthy man called Kashih, (and your Lord intended that they should come to their full strength) that they should reach the age of puberty (and should bring forth their treasure) i.e. their golden tablet (as a mercy from their Lord) as a blessing from your Lord; it is also said that this means: as an inspiration from your Lord; (and I did it not upon my own command) I did not do it from my own initiative. (Such is the interpretation of that wherewith thou couldst not bear).\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "18:82",
            "27:19",
            "45:30",
            "19:21",
            "18:10",
            "17:24",
            "7:77",
            "18:80",
            "3:147",
            "7:151"
        ],
        "BIBLE": [
            "prophets:ezekiel:3:20",
            "prophets:i%20kings:3:6",
            "writings:daniel:2:23",
            "prophets:ezekiel:16:52",
            "prophets:ezekiel:18:13",
            "writings:ecclesiastes:1:13",
            "torah:deuteronomy:26:13",
            "prophets:ii%20kings:5:1",
            "torah:deuteronomy:28:52",
            "torah:deuteronomy:16:17"
        ]
    }
}