{
    "VERSE": "18:83",
    "ARABIC": "وَيَسْـَٔلُونَكَ عَن ذِى ٱلْقَرْنَيْنِ قُلْ سَأَتْلُوا۟ عَلَيْكُم مِّنْهُ ذِكْرًا",
    "ENGLISH": {
        "TRANSLATION_0": "They will ask you about Dhu'l-Qarnayn. Say: 'I will tell you something about him.'",
        "TRANSLATION_1": "They ask you about Dhu'l-Qarnain.\n",
        "TRANSLATION_2": "(O Muhammad), they ask you about Dhu al-Qarnayn. Say: \"I will give you an account of him.\"\n",
        "TRANSLATION_3": "(Muhammad), they will ask you about Dhu 'l-Qarnayn. Say, \"I shall tell you something about him\".\n",
        "TRANSLATION_4": "And they ask you regarding Zul-Qarnain; say, “I shall recite his story to you.”\n",
        "TRANSLATION_5": "And they ask you about Dhul-Qarnayn. Say: \"I shall recite to you something of his story.\"\n",
        "TRANSLATION_6": "And they ask you about Zulqarnain. Say: I will recite to you an account of him.\n",
        "TRANSLATION_7": "They will question thee concerning Dhool Karnain. Say: 'I will recite to you a mention of him.\n",
        "TRANSLATION_8": "They will ask thee of Dhu'l-Qarneyn. Say: I shall recite unto you a remembrance of him.\n",
        "TRANSLATION_9": "They will ask you about Dhu'l-Qarnayn. Say, \"I will give you an account of him.\"\n",
        "TRANSLATION_10": "And they ask thee of Zul Qarnain. Say thou: shall recite unto you of him some mention.\n",
        "TRANSLATION_11": "They question you concerning Dhul Qarnayn. Say, ‘I will relate to you an account of him.’\n",
        "TRANSLATION_12": "They ask thee concerning Zul-qarnain. Say, \"I will rehearse to you something of his story.\"\n",
        "TRANSLATION_13": "And they ask you about Dhul-Qarnain. Say: \"I shall recite to you something of his story.\"\n",
        "TRANSLATION_14": "They will ask you about ThulKarnain (the pious and chosen). Say: 'I will recite to you something of his story.\n",
        "TRANSLATION_15": "And they ask you about Zul-Qarnain. Say, “I will tell you something about him.”\n",
        "TRANSLATION_16": "And they ask you, [O Muhammad], about Dhul-Qarnayn. Say, \"I will recite to you about him a report.\"\n",
        "TRANSLATION_17": "[18:83] And they, the Jews, question you concerning Dhū’l-Qarnayn, whose name was Alexander; he was not a prophet. Say: ‘I shall recite, relate, to you a mention, an account, of him’, of his affair.\n",
        "TRANSLATION_18": "(They) the people of Mecca (will ask thee) Muhammad (of Dhu'l-Qarnayn) about the event of Dhu'l- Qarnayn. (Say) to them, Muhammad: (I shall recite unto you a remembrance of him) I shall recite to you an explanation of his event.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "18:83",
            "73:4",
            "27:27",
            "37:51",
            "26:19",
            "44:14",
            "38:86",
            "85:7",
            "26:5",
            "50:36"
        ],
        "BIBLE": [
            "prophets:jeremiah:45:2",
            "torah:genesis:21:6",
            "torah:genesis:34:12",
            "prophets:i%20kings:17:18",
            "torah:genesis:19:21",
            "torah:deuteronomy:13:13",
            "prophets:jeremiah:29:24",
            "torah:exodus:33:14",
            "prophets:ezekiel:37:18",
            "prophets:i%20kings:14:5"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:3",
            
            "Sefer%20Yetzirah:1:1"
        ]
    }
}