{
    "VERSE": "18:84",
    "ARABIC": "إِنَّا مَكَّنَّا لَهُۥ فِى ٱلْأَرْضِ وَءَاتَيْنَٰهُ مِن كُلِّ شَىْءٍ سَبَبًا",
    "ENGLISH": {
        "TRANSLATION_0": "We gave him power and authority on the earth and granted him a way to everything.",
        "TRANSLATION_1": "Say: \"I will cite before you his commemoration.\" We gave him authority in the land and means of accomplishing every end.\n",
        "TRANSLATION_2": "We granted him power in the land and endowed him with all kinds of resources.\n",
        "TRANSLATION_3": "We had given him great power in the land and all kinds of resources.\n",
        "TRANSLATION_4": "Indeed We gave him authority in the land and bestowed him the means of everything.\n",
        "TRANSLATION_5": "Verily, We established him in the earth, and We gave him the means of everything.\n",
        "TRANSLATION_6": "Surely We established him in the land and granted him means of access to every thing.\n",
        "TRANSLATION_7": "We established him in the land, and We gave him a way to everything;\n",
        "TRANSLATION_8": "Lo! We made him strong in the land and gave him unto every thing a road.\n",
        "TRANSLATION_9": "We established him in the land, and gave him the means to achieve all things.\n",
        "TRANSLATION_10": "Verily We! We established him in the earth, and vouchsafed unto him of everything a way.\n",
        "TRANSLATION_11": "Indeed We had granted him power in the land and given him the means to all things.\n",
        "TRANSLATION_12": "Verily We established his power on earth, and We gave him the ways and the means to all ends.\n",
        "TRANSLATION_13": "Verily, We established him in the earth, and We gave him the means of everything.\n",
        "TRANSLATION_14": "We established him in the land and gave him means to all things.\n",
        "TRANSLATION_15": "We established him on earth, and gave him all kinds of means.\n",
        "TRANSLATION_16": "Indeed We established him upon the earth, and We gave him to everything a way.\n",
        "TRANSLATION_17": "[18:84] Indeed We empowered him throughout the land, by facilitating [for him] the journeying therein, and We gave him to everything, of which one might have need, a way, a route to lead him to that which he sought.\n",
        "TRANSLATION_18": "(Lo! We made him strong in the land and gave unto every thing a road) the knowledge of the roads and constellation.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "18:84",
            "15:19",
            "54:52",
            "21:81",
            "4:126",
            "57:2",
            "42:12",
            "14:38",
            "25:2",
            "3:5"
        ],
        "BIBLE": [
            "prophets:judges:18:10",
            "torah:genesis:35:12",
            "torah:genesis:15:18",
            "prophets:jeremiah:25:31",
            "writings:proverbs:31:3",
            "prophets:joshua:23:15",
            "prophets:jeremiah:25:5",
            "torah:deuteronomy:26:12",
            "writings:daniel:2:37",
            "prophets:joshua:19:49"
        ]
    }
}