{
    "VERSE": "18:86",
    "ARABIC": "حَتَّىٰٓ إِذَا بَلَغَ مَغْرِبَ ٱلشَّمْسِ وَجَدَهَا تَغْرُبُ فِى عَيْنٍ حَمِئَةٍ وَوَجَدَ عِندَهَا قَوْمًا قُلْنَا يَٰذَا ٱلْقَرْنَيْنِ إِمَّآ أَن تُعَذِّبَ وَإِمَّآ أَن تَتَّخِذَ فِيهِمْ حُسْنًا",
    "ENGLISH": {
        "TRANSLATION_0": "until he reached the setting of the sun and found it setting in a muddy spring and found a people by it. We said, 'Dhu'l-Qarnayn! You can either punish them or else you can treat them with gentleness.'",
        "TRANSLATION_1": "Till he reached the point of the setting sun, and saw it set behind a muddy lake, and near it found a people. We said: \"O Dhu'l-Qarnain, you may either punish them or treat them with kindness.\"\n",
        "TRANSLATION_2": "until when he reached the very limits where the sun sets, he saw it setting in dark turbid waters; and nearby he met a people. We said: \"O Dhu al-Qarnayn, you have the power to punish or to treat them with kindness.\"\n",
        "TRANSLATION_3": "to the West where he found the sun setting into a warm source (spring) of water and a people living near by. We asked him, \"Dhu 'l-Qarnayn, you may punish them or treat them with kindness?\"\n",
        "TRANSLATION_4": "To the extent that when he reached the setting-place of the sun, he found it setting in a muddy spring, and found a nation there; We said, “O Zul-Qarnain – either punish them or choose kindness for them.”\n",
        "TRANSLATION_5": "Until, when he reached the setting place of the sun, he found it setting in a spring of Hami'ah. And he found near it a people. We said: \"O Dhul-Qarnayn! Either you punish them or treat them with kindness.\"\n",
        "TRANSLATION_6": "Until when he reached the place where the sun set, he found it going down into a black sea, and found by it a people. We said: O Zulqarnain! either give them a chastisement or do them a benefit.\n",
        "TRANSLATION_7": "until, when he reached the setting of the sun, he found it setting in a muddy spring, and he found nearby a people. We said, 'O Dhool Karnain, either thou shalt chastise them, or thou shalt take towards them a way of kindness.'\n",
        "TRANSLATION_8": "Till, when he reached the setting-place of the sun, he found it setting in a muddy spring, and found a people thereabout. We said: O Dhu'l-Qarneyn! Either punish or show them kindness.\n",
        "TRANSLATION_9": "until, when he reached the setting of the sun, he found it setting in a spring of murky water and near it he found some people. We said, \"Dhu'l-Qarnayn! You can either punish them or else you can treat them with gentleness.\"\n",
        "TRANSLATION_10": "Until when he reached the setting-place of the sun, he perceived it setting in a miry spring, and he found beside it a nation. We said: Zul Qarnian! either chastise them or take in respect of them the way of kindness.\n",
        "TRANSLATION_11": "When he reached the place where the sun sets, he found it setting over a warm sea, and by it he found a people. We said, ‘O Dhul Qarnayn! You will either punish them, or treat them with kindness.’\n",
        "TRANSLATION_12": "Until, when he reached the setting of the sun, he found it set in a spring of murky water: Near it he found a People: We said: \"O Zul-qarnain! (thou hast authority,) either to punish them, or to treat them with kindness.\"\n",
        "TRANSLATION_13": "Until, when he reached the setting place of the sun, he found it setting in a spring of black muddy (or hot) water. And he found near it a people. We (Allah) said (by inspiration): \"O Dhul-Qarnain! Either you punish them, or treat them with kindness.\"\n",
        "TRANSLATION_14": "until, when he reached the setting of the sun, he found it setting in a muddy spring, and nearby he found a nation. 'ThulKarnain' We said, 'you must either punish them or show them kindness'\n",
        "TRANSLATION_15": "Until, when he reached the setting of the sun, he found it setting in a murky spring, and found a people in its vicinity. We said, “O Zul-Qarnain, you may either inflict a penalty, or else treat them kindly.”\n",
        "TRANSLATION_16": "Until, when he reached the setting of the sun, he found it [as if] setting in a spring of dark mud, and he found near it a people. Allah said, \"O Dhul-Qarnayn, either you punish [them] or else adopt among them [a way of] goodness.\"\n",
        "TRANSLATION_17": "[18:86] until, when he reached the setting of the sun, the place where it sets, he found it setting in a muddy spring (‘ayn hami’a: [a spring] containing ham’a, which is black clay): its setting in a spring is [described as seen] from the perspective of the eye, for otherwise it is far larger [in size] than this world; and he found by it, that is, [by] the spring, a folk, of disbelievers. We said, ‘O Dhū’l-Qarnayn — by [means of] inspiration — either chastise, the folk, by slaying [them], or treat them kindly’, by [merely] taking them captive.\n",
        "TRANSLATION_18": "(Till, when he reached the setting place of the sun) where the sun sets, (he found it setting in a muddy spring) a blackened, muddy and stinking spring; it is also said that this means: a hot spring, (and found a 322 people thereabout) these people were disbelievers: (We said: Dhu'l-Qarnayn!) We inspired him (Either punish) either kill them until they accept to believe that there is no deity except Allah (or show them kindness) or you pardon them and let them be.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "18:86",
            "7:137",
            "18:90",
            "19:73",
            "37:48",
            "39:31",
            "43:38",
            "50:39",
            "18:93",
            "2:258"
        ],
        "BIBLE": [
            "prophets:i%20samuel:26:25",
            "torah:deuteronomy:14:24",
            "torah:numbers:24:1",
            "torah:deuteronomy:1:31",
            "prophets:ii%20kings:2:21",
            "torah:deuteronomy:17:14",
            "prophets:ii%20kings:2:15",
            "prophets:jeremiah:21:8",
            "prophets:zechariah:5:11",
            "prophets:judges:19:17"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:3:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:4:4"
        ]
    }
}