{
    "VERSE": "18:87",
    "ARABIC": "قَالَ أَمَّا مَن ظَلَمَ فَسَوْفَ نُعَذِّبُهُۥ ثُمَّ يُرَدُّ إِلَىٰ رَبِّهِۦ فَيُعَذِّبُهُۥ عَذَابًا نُّكْرًا",
    "ENGLISH": {
        "TRANSLATION_0": "He said, 'As for those who do wrong, we will punish them and then they will be returned to their Lord and He will punish them with a dreadful punishment.",
        "TRANSLATION_1": "He said: \"I shall punish whosoever is wicked. He will then be sent back to his Lord who will inflict on him a terrible punishment.\n",
        "TRANSLATION_2": "He said: \"We will chastise him who does wrong, whereafter he will be returned to his Lord and He will chastise him grievously.\n",
        "TRANSLATION_3": "He replied, \"I shall punish the unjust ones among them and then they will return to their Lord, who will punish them more sternly\".\n",
        "TRANSLATION_4": "He submitted, “Regarding one who has done injustice, we shall soon punish him – he will then be brought back to his Lord, Who will punish him severely.”\n",
        "TRANSLATION_5": "He said: \"As for him who does wrong, we shall punish him, and then he will be brought back unto his Lord, Who will punish him with a terrible torment (Hell).\"\n",
        "TRANSLATION_6": "He said: As to him who is unjust, we will chastise him, then shall he be returned to his Lord, and He will chastise him with an exemplary chastisement:\n",
        "TRANSLATION_7": "He said, 'As for the evildoer, him we shall chastise, then he shall be returned to his Lord and He shall chastise him with a horrible chastisement.\n",
        "TRANSLATION_8": "He said: As for him who doeth wrong, we shall punish him, and then he will be brought back unto his Lord, Who will punish him with awful punishment!\n",
        "TRANSLATION_9": "He said, \"We shall certainly punish him who does wrong; then he shall be brought back to his Lord who will punish him with a grievous punishment,\n",
        "TRANSLATION_10": "He said: as for him who doeth wrong, presently we shall torment him, and thereafter he shall be brought back to his Lord, and He shall torment him with a torment formidable.\n",
        "TRANSLATION_11": "He said, ‘As for him who is a wrongdoer, we will punish him. Then he shall be returned to his Lord and He will punish him with a dire punishment.\n",
        "TRANSLATION_12": "He said: \"Whoever doth wrong, him shall we punish; then shall he be sent back to his Lord; and He will punish him with a punishment unheard-of (before).\n",
        "TRANSLATION_13": "He said: \"As for him (a disbeliever in the Oneness of Allah) who does wrong, we shall punish him; and then he will be brought back unto his Lord; Who will punish him with a terrible torment (Hell).\n",
        "TRANSLATION_14": "He replied: 'The evildoer we shall punish. Then he shall return to his Lord and He will punish him with a stern punishment.\n",
        "TRANSLATION_15": "He said, “As for him who does wrong, we will penalize him, then he will be returned to his Lord, and He will punish him with an unheard-of torment.\n",
        "TRANSLATION_16": "He said, \"As for one who wrongs, we will punish him. Then he will be returned to his Lord, and He will punish him with a terrible punishment.\n",
        "TRANSLATION_17": "[18:87] He said, ‘As for him who does wrong, by way of [practising] idolatry, we shall chastise him, We shall slay him. Then he shall be returned to his Lord and He shall chastise him with an awful chastisement (read nukran or nukuran), that is, a severe [one], in the Fire.\n",
        "TRANSLATION_18": "(He said: As for him who doth wrong) as for him who disbelieves in Allah, (we shall punish him) in this worldly life by killing him, (and then he will be brought back unto his Lord) in the Hereafter, (who will punish him) by means of the Fire (with awful punishment!) with a severe punishment.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "18:87",
            "72:17",
            "11:39",
            "68:50",
            "20:122",
            "70:27",
            "44:12",
            "89:13",
            "93:11",
            "39:40"
        ],
        "BIBLE": [
            "torah:exodus:5:22",
            "torah:exodus:3:12",
            "torah:genesis:18:10",
            "prophets:i%20samuel:6:4",
            "torah:exodus:11:1",
            "torah:genesis:37:30",
            "torah:deuteronomy:9:28",
            "prophets:ii%20kings:1:5",
            "prophets:jeremiah:3:7",
            "writings:psalms:126:1"
        ]
    }
}