{
    "VERSE": "18:95",
    "ARABIC": "قَالَ مَا مَكَّنِّى فِيهِ رَبِّى خَيْرٌ فَأَعِينُونِى بِقُوَّةٍ أَجْعَلْ بَيْنَكُمْ وَبَيْنَهُمْ رَدْمًا",
    "ENGLISH": {
        "TRANSLATION_0": "He said, 'The power my Lord has granted me is better than that. Just give me a strong helping hand and I will build a solid barrier between you and them.",
        "TRANSLATION_1": "He said: \"The ability my Lord has given me is better. So help me with your manual labour; I will build a wall between you and them.\n",
        "TRANSLATION_2": "He answered: \"Whatever my Lord has granted me is good enough. But help me with your labour and I will erect a rampart between you and them.\n",
        "TRANSLATION_3": "He replied, \"The power that my Lord has granted me is better (than your tax). Help me with your man-power and I shall construct a barrier between you and Gog and Magog.\n",
        "TRANSLATION_4": "He said, “That which my Lord has given me control over is better, therefore help me with strength – I shall set up a barrier between you and them.”\n",
        "TRANSLATION_5": "He said: \"That in which my Lord had established me is better. So help me with strength, I will erect between you and them a barrier.\"\n",
        "TRANSLATION_6": "He said: That in which my Lord has established me is better, therefore you only help me with workers, I will make a fortified barrier between you and them;\n",
        "TRANSLATION_7": "He said, 'That wherein my Lord has established me is better; so aid me forcefully, and I will set up a rampart between you and between them.\n",
        "TRANSLATION_8": "He said: That wherein my Lord hath established me is better (than your tribute). Do but help me with strength (of men), I will set between you and them a bank.\n",
        "TRANSLATION_9": "He said, \"What My Lord has given me is better [than any tribute]. Help me with a force of labourers and I will erect a barrier between you and them:\n",
        "TRANSLATION_10": "He said: better is that where in my Lord hath established me; so help me with might, and I shall place between you and them a rampart.\n",
        "TRANSLATION_11": "He said, ‘What my Lord has furnished me is better. Yet help me with some strength, and I will make a bulwark between you and them.\n",
        "TRANSLATION_12": "He said: \"(The power) in which my Lord has established me is better (than tribute): Help me therefore with strength (and labour): I will erect a strong barrier between you and them:\n",
        "TRANSLATION_13": "He said: \"That (wealth, authority and power) in which my Lord had established me is better (than your tribute). So help me with strength (of men), I will erect between you and them a barrier.\n",
        "TRANSLATION_14": "He replied: 'That which my Lord has given me is better, therefore help me with all your power, and I will build a barrier between you and between them.\n",
        "TRANSLATION_15": "He said, “What my Lord has empowered me with is better. But assist me with strength, and I will build between you and them a dam.”\n",
        "TRANSLATION_16": "He said, \"That in which my Lord has established me is better [than what you offer], but assist me with strength; I will make between you and them a dam.\n",
        "TRANSLATION_17": "[18:95] He said, ‘That, wealth and so on, wherewith my Lord has empowered me (makkannī, a variant reading has makkananī) is better, than the tribute that you offer me, and so I have no need for it. I shall build for you the barrier without [demanding] a fee; so help me with strength, in that which I [will] demand from you, and I will build between you and them a rampart, a fortified barricade.\n",
        "TRANSLATION_18": "(He said: That wherein my Lord hath established me) the dominion that my Lord has given me is (better) than your reward or wage. (Do but help me with strength) they said: \"which strength do you want from us\" and he said: \"the strength of blacksmiths\", (I will set between you and them a bank) a barrier.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "18:95",
            "32:25",
            "23:29",
            "23:118",
            "2:68",
            "16:124",
            "6:57",
            "23:26",
            "23:39",
            "23:109"
        ],
        "BIBLE": [
            "writings:ii%20chronicles:14:6",
            "prophets:hosea:2:14",
            "writings:ii%20chronicles:25:9",
            "prophets:ii%20kings:4:43",
            "writings:ecclesiastes:5:18",
            "torah:genesis:2:18",
            "prophets:ii%20kings:7:19",
            "torah:leviticus:10:17",
            "prophets:ezekiel:37:26",
            "writings:i%20chronicles:29:12"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:6"
        ]
    }
}