{
    "VERSE": "18:97",
    "ARABIC": "فَمَا ٱسْطَٰعُوٓا۟ أَن يَظْهَرُوهُ وَمَا ٱسْتَطَٰعُوا۟ لَهُۥ نَقْبًا",
    "ENGLISH": {
        "TRANSLATION_0": "They were, therefore, unable to climb over it nor were they able to make a breach in it.",
        "TRANSLATION_1": "Thus (Gog and Magog) could neither climb over it nor dig a hole through (the rampart).\n",
        "TRANSLATION_2": "Such was the rampart that Gog and Magog could not scale, nor could they pierce it.\n",
        "TRANSLATION_3": "(Thus he constructed the barrier which) neither Gog nor Magog were able to climb nor were they able to dig a tunnel through the iron and brass barrier.\n",
        "TRANSLATION_4": "Therefore Yajuj and Majuj were neither able to surmount it, nor could they pierce it.\n",
        "TRANSLATION_5": "So they could not scale it or dig through it.\n",
        "TRANSLATION_6": "So they were not able to scale it nor could they make a hole in it.\n",
        "TRANSLATION_7": "So they were unable either to scale it or pierce it.\n",
        "TRANSLATION_8": "And (Gog and Magog) were not able to surmount, nor could they pierce (it).\n",
        "TRANSLATION_9": "So they [Gog and Magog] were not able to scale it, nor were they able to bore through it,\n",
        "TRANSLATION_10": "Thus they Were not able to mount it, nor Were they able to burrow through it.\n",
        "TRANSLATION_11": "So they could neither scale it, nor could they make a hole in it.\n",
        "TRANSLATION_12": "Thus were they made powerless to scale it or to dig through it.\n",
        "TRANSLATION_13": "So they [Ya'juj and Ma'juj (Gog and Magog)] were made powerless to scale it or dig through it.\n",
        "TRANSLATION_14": "Thereafter they could neither scale it, nor could they pierce it.\n",
        "TRANSLATION_15": "So they were unable to climb it, and they could not penetrate it.\n",
        "TRANSLATION_16": "So Gog and Magog were unable to pass over it, nor were they able [to effect] in it any penetration.\n",
        "TRANSLATION_17": "[18:97] And so they, Gog and Magog, were not able to scale it, to climb up its length, because of its [great] height and smoothness, nor could they pierce it, because of its firmness and thickness.\n",
        "TRANSLATION_18": "(And (Gog and Magog) were not able to surmount) to climb over it, (nor could they pierce (it)) from beneath.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "18:97",
            "51:45",
            "26:14",
            "26:211",
            "41:48",
            "83:33",
            "16:46",
            "84:20",
            "51:54",
            "30:49"
        ],
        "BIBLE": [
            "torah:leviticus:26:19",
            "prophets:ezekiel:35:7",
            "torah:exodus:27:4",
            "writings:psalms:59:12",
            "torah:exodus:27:2",
            "prophets:isaiah:60:17",
            "writings:job:9:15",
            "prophets:jeremiah:20:9",
            "writings:ezra:10:3",
            "prophets:isaiah:45:2"
        ]
    }
}