{
    "VERSE": "14:1",
    "ARABIC": "بِسْمِ ٱللَّهِ ٱلرَّحْمَٰنِ ٱلرَّحِيمِ الٓر كِتَٰبٌ أَنزَلْنَٰهُ إِلَيْكَ لِتُخْرِجَ ٱلنَّاسَ مِنَ ٱلظُّلُمَٰتِ إِلَى ٱلنُّورِ بِإِذْنِ رَبِّهِمْ إِلَىٰ صِرَٰطِ ٱلْعَزِيزِ ٱلْحَمِيدِ",
    "ENGLISH": {
        "TRANSLATION_0": "Alif Lam Ra This is a Book We have sent down to you so that you can bring mankind from the darkness to the light, by the permission of their Lord, to the Path of the Almighty, the Praiseworthy.",
        "TRANSLATION_1": "ALIF LAM RA. A Book We have sent down to you that you may lead men out of darkness into light, by their Lord's command, to the path of the mighty, the worthy of praise.\n",
        "TRANSLATION_2": "Alif. Lam. Ra'. This is a Book which We have revealed to you that you may bring forth mankind from every kind of darkness into light, and direct them, with the leave of their Lord, to the Way of the Mighty, the Innately Praiseworthy,\n",
        "TRANSLATION_3": "Alif. Lam. Ra. A Book has been revealed to you, (Muhammad), so that, by the permission of their Lord, you would be able to lead people from darkness into light along the path of the Majestic, Praised One.\n",
        "TRANSLATION_4": "Alif-Lam-Ra; it is a Book which We have sent down upon you (O dear Prophet Mohammed – peace and blessings be upon him) so that you may bring forth people from the realms of darkness into light – by the command of their Lord, towards the path of the Most Honourable, the Most Praiseworthy.\n",
        "TRANSLATION_5": "Alif-Lam-Ra. (This is) a Book which We have revealed unto you in order that you might lead mankind out of darkness into light by their Lord's leave to the path of the Almighty, the Praised.\n",
        "TRANSLATION_6": "Alif Lam Ra. (This is) a Book which We have revealed to you that you may bring forth men, by their Lord's permission from utter darkness into light-- to the way of the Mighty, the Praised One,\n",
        "TRANSLATION_7": "Alif Lam Ra. A Book We have sent down to thee that thou mayest bring forth mankind from the shadows to the light by the leave of their Lord, to the path of the All-mighty, the All-laudable,\n",
        "TRANSLATION_8": "Alif. Lam. Ra. (This is) a Scripture which We have revealed unto thee (Muhammad) that thereby thou mayst bring forth mankind from darkness unto light, by the permission of their Lord, unto the path of the Mighty, the Owner of Praise,\n",
        "TRANSLATION_9": "Alif Lam Ra. We have revealed to you this Book so that, by their Lord's command, you may lead men from darkness to the light: to the path of the Mighty, the Praiseworthy One,\n",
        "TRANSLATION_10": "Alif. Lam. Ra. This is a Book which We have sent down unto thee, that thou mayest bring the mankind forth from the darknesses unto the light, by the command of their Lord: unto the path of the Mighty, the Praiseworthy.\n",
        "TRANSLATION_11": "Alif, Lam, Ra. [This is] a Book We have sent down to you that you may bring mankind out from darkness into light, by the command of their Lord, to the path of the All-mighty, the All-laudable\n",
        "TRANSLATION_12": "A. L. R. A Book which We have revealed unto thee, in order that thou mightest lead mankind out of the depths of darkness into light - by the leave of their Lord - to the Way of (Him) the Exalted in power, worthy of all praise!-\n",
        "TRANSLATION_13": "Alif-Lam-Ra. [These letters are one of the miracles of the Quran, and none but Allah (Alone) knows their meanings]. (This is) a Book which We have revealed unto you (O Muhammad SAW) in order that you might lead mankind out of darkness (of disbelief and polytheism) into light (of belief in the Oneness of Allah and Islamic Monotheism) by their Lord's Leave to the Path of the All-Mighty, the Owner of all Praise.\n",
        "TRANSLATION_14": "AlifLaamRa. We have sent down to you (this Book) in order that you bring mankind from darkness to the light by the permission of your Lord, to the Path of the Almighty, the Praised.\n",
        "TRANSLATION_15": "Alif, Lam, Ra. A Scripture that We revealed to you, that you may bring humanity from darkness to light—with the permission of their Lord—to the path of the Almighty, the Praiseworthy.\n",
        "TRANSLATION_16": "Alif, Lam, Ra. [This is] a Book which We have revealed to you, [O Muhammad], that you might bring mankind out of darknesses into the light by permission of their Lord - to the path of the Exalted in Might, the Praiseworthy -\n",
        "TRANSLATION_17": "[14:1] Alif lām rā’: God knows best what He means by these [letters]. This Qur’ān is, a Book We have revealed to you, O Muhammad (s), that you may bring forth mankind from darkness, [from] unbelief, into light, [into] faith, by the leave, by the command, of their Lord (ilā’l-nūr, ‘into light’, may be substituted by [the following ilā sirāt]), to the path, the way, of the Mighty, the Victor, the Praised, the One who is [constantly] praised.\n",
        "TRANSLATION_18": "And from his own chain of transmitters on the authority of Ibn 'Abbas that he said in the explanation of Allah's words (Alif. Lam. Ra.): '(Alif. Lam. Ra.) He says: I am Allah: I see what you say and do; it is also said that it is an oath by which Allah swore. ((This is) a Scripture which We have revealed unto thee (Muhammad)) with which We have sent Gabriel to you (that thereby thou mayst bring forth mankind) that you may call the people of Mecca (from darkness unto light) to leave disbelieve and accept faith, (by the permission of their Lord) you call them by the command of their Lord, (unto the path) to Religion (of the Mighty) in His retribution against those who do not believe, (the Owner of Praise) in the eyes of him who professes His divine Oneness; it is also said that this means: the Praised One in His acts. 264\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "14:1",
            "34:6",
            "5:16",
            "2:129",
            "2:213",
            "42:52",
            "33:43",
            "22:24",
            "6:1",
            "114:1"
        ],
        "BIBLE": [
            "prophets:jeremiah:10:23",
            "prophets:isaiah:42:16",
            "prophets:ii%20samuel:5:2",
            "writings:job:10:22",
            "writings:psalms:43:3",
            "torah:genesis:19:8",
            "torah:genesis:42:33",
            "writings:i%20chronicles:11:2",
            "torah:genesis:18:19",
            "prophets:i%20kings:13:26"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:2"
        ]
    }
}