{
    "VERSE": "14:12",
    "ARABIC": "وَمَا لَنَآ أَلَّا نَتَوَكَّلَ عَلَى ٱللَّهِ وَقَدْ هَدَىٰنَا سُبُلَنَا وَلَنَصْبِرَنَّ عَلَىٰ مَآ ءَاذَيْتُمُونَا وَعَلَى ٱللَّهِ فَلْيَتَوَكَّلِ ٱلْمُتَوَكِّلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "And why indeed should we not put our trust in Allah when He has guided us to our ways? We will be steadfast however much you harm us. Those who trust put their trust in Allah.'",
        "TRANSLATION_1": "And why should we not repose our trust in God when He has shown us our paths of duty to Him? We shall bear with fortitude the hardships you inflict upon us. The trusting place their trust in God.\"\n",
        "TRANSLATION_2": "And why should we not put our trust in Allah when it is indeed He Who has guided us to the ways of our life? We shall surely continue to remain steadfast in face of your persecution. All those who have to put trust, should put their trust only in Allah.\"\n",
        "TRANSLATION_3": "Why should we not trust in God when He has shown us the right way? We shall exercise patience against the troubles with which you afflict us. Whoever needs a trustee should trust in God.\"\n",
        "TRANSLATION_4": "“And what is the matter with us that we should not rely on Allah? He has in fact shown us our ways; and we will surely be patient upon the troubles you cause us; and those who trust must rely only upon Allah.”\n",
        "TRANSLATION_5": "And why should we not put our trust in Allah while He indeed has guided us in our ways And we shall certainly bear with patience all the hurt you may cause us, and in Allah (alone) let those who trust, put their trust.\"\n",
        "TRANSLATION_6": "And what reason have we that we should not rely on Allah? And He has indeed guided us in our ways; and certainly we would bear with patience your persecution of us; and on Allah should the reliant rely.\n",
        "TRANSLATION_7": "And why should we not put our trust in God, seeing that He has guided us in our ways? We will surely endure patiently, whatever you hurt us; and in God let all put their trust who put their trust.'\n",
        "TRANSLATION_8": "How should we not put our trust in Allah when He hath shown us our ways? We surely will endure the hurt ye do us. In Allah let the trusting put their trust.\n",
        "TRANSLATION_9": "and why should we not put our trust in God when He has already guided us to our paths? We will, surely, bear with patience all the harm you do us. So in God let those who trust put their trust.\"\n",
        "TRANSLATION_10": "And wherefore should we not rely on Allah when He hath surely guided us our ways! And surely we shall bear patiently that with which ye afflict us and in Allah then let the trustful put their trust.\n",
        "TRANSLATION_11": "And why should we not put our trust in Allah, seeing that He has guided us in our ways? Surely, we will put up patiently with whatever torment you may inflict upon us, and in Allah let all the trusting put their trust.’\n",
        "TRANSLATION_12": "No reason have we why we should not put our trust on Allah. Indeed He Has guided us to the Ways we (follow). We shall certainly bear with patience all the hurt you may cause us. For those who put their trust should put their trust on Allah.\"\n",
        "TRANSLATION_13": "And why should we not put our trust in Allah while He indeed has guided us our ways. And we shall certainly bear with patience all the hurt you may cause us, and in Allah (Alone) let those who trust, put their trust.\"\n",
        "TRANSLATION_14": "And why should we not put our trust in Allah, when He has already guided us to our Paths? We will endure your hurt patiently. In Allah, let all who trust place their trust'\n",
        "TRANSLATION_15": "“And why should we not trust in God, when He has guided us in our ways? We will persevere in the face of your persecution. And upon God the reliant should rely.”\n",
        "TRANSLATION_16": "And why should we not rely upon Allah while He has guided us to our [good] ways. And we will surely be patient against whatever harm you should cause us. And upon Allah let those who would rely [indeed] rely.\"\n",
        "TRANSLATION_17": "[14:12] And why, indeed, should we not put our trust in God, in other words, there is nothing to prevent us from [doing] this, when He has guided us our ways? And we shall surely endure the hurt you do us. And in God let the trusting put their trust’.\n",
        "TRANSLATION_18": "They said to the messengers: \"do yourselves put your trust in Allah so that you can see what He will do with you\". The messengers said: (How should we not put our trust in Allah when He hath shown us our ways) when He favoured us with prophethood and complete surrender to Him? (We surely will endure that hurt ye do us) we will endure your physical harm through obedience of Allah. (In Allah let the trusting put their trust!) let them rely on Allah.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "14:12",
            "29:69",
            "4:88",
            "9:51",
            "29:3",
            "9:93",
            "16:56",
            "47:34",
            "64:13",
            "3:160"
        ],
        "BIBLE": [
            "torah:genesis:32:31",
            "torah:leviticus:10:17",
            "torah:numbers:18:32",
            "torah:deuteronomy:1:31",
            "writings:ecclesiastes:5:17",
            "writings:job:19:28",
            "prophets:joshua:3:3",
            "prophets:ezekiel:13:3",
            "torah:deuteronomy:14:24",
            "writings:job:8:18"
        ]
    }
}