{
    "VERSE": "14:14",
    "ARABIC": "وَلَنُسْكِنَنَّكُمُ ٱلْأَرْضَ مِنۢ بَعْدِهِمْ ذَٰلِكَ لِمَنْ خَافَ مَقَامِى وَخَافَ وَعِيدِ",
    "ENGLISH": {
        "TRANSLATION_0": "We will leave you the land to live in after them. That is the reward of those who fear My station and fear",
        "TRANSLATION_1": "And establish you in their place. This is for him who fears My station, and dreads My commination.\"\n",
        "TRANSLATION_2": "and will then cause you to settle in the land as their successors. That is the reward for him who fears to stand for reckoning and holds My threat in awe.\"\n",
        "TRANSLATION_3": "and settle you in the land thereafter. This is for those who are afraid of Me and of My warning.\"\n",
        "TRANSLATION_4": "“And indeed We will establish you in the land after them; this is for him who fears to stand before Me and fears the commands of punishment declared by Me.”\n",
        "TRANSLATION_5": "And indeed, We shall make you dwell in the land after them. This is for him who fears standing before Me and also fears My threat.\"\n",
        "TRANSLATION_6": "And most certainly We will settle you in the land after them; this is for him who fears standing in My presence and who fears My threat.\n",
        "TRANSLATION_7": "and We will surely make you to dwell in the land after them -- that, for him who fears My station and fears My threat.'\n",
        "TRANSLATION_8": "And verily We shall make you to dwell in the land after them. This is for him who feareth My Majesty and feareth My threats.\n",
        "TRANSLATION_9": "and settle you on the land to succeed them. That is [in store] for anyone who is in awe of meeting Me, and who heeds My warnings.\"\n",
        "TRANSLATION_10": "And We will surely cause you to dwell in the land after them: that is for him who feareth standing before Me and feareth My threat.\n",
        "TRANSLATION_11": "and surely We will settle you in the land after them. This [promise] is for someone who is awed to stand before Me and fears My threat.’\n",
        "TRANSLATION_12": "And verily We shall cause you to abide in the land, and succeed them. This for such as fear the Time when they shall stand before My tribunal,- such as fear the punishment denounced.\"\n",
        "TRANSLATION_13": "And indeed, We shall make you dwell in the land after them. This is for him who fears standing before Me (on the Day of Resurrection or fears My Punishment) and also fears My Threat.\"\n",
        "TRANSLATION_14": "and let you live in the land after them. This is for him who fears My station and fears My threat'\n",
        "TRANSLATION_15": "“And We will settle you in the land after them. That is for him who fears My Majesty, and fears My threats.”\n",
        "TRANSLATION_16": "And We will surely cause you to dwell in the land after them. That is for he who fears My position and fears My threat.\"\n",
        "TRANSLATION_17": "[14:14] and We shall surely make you dwell in the land, their land, after them, after they have been destroyed — that, victory [over them] and bequest of the land [to you] is, for whoever fears the standing before Me, that is, [whoever fears] when he comes to stand before Me, and fears My threat’, of chastisement.\n",
        "TRANSLATION_18": "(And verily We shall make you to dwell in the land) in their township and habitations (after them) after their destruction. (This) dwelling in their land (is for him who feareth My Majesty) standing before Me [on the Day of Judgement] (and feareth My threats) My chastisement.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "14:14",
            "79:30",
            "12:9",
            "30:19",
            "16:65",
            "45:13",
            "16:13",
            "30:24",
            "24:55",
            "15:39"
        ],
        "BIBLE": [
            "prophets:ezekiel:26:20",
            "prophets:ezekiel:39:26",
            "torah:genesis:21:18",
            "prophets:ezekiel:34:26",
            "prophets:jeremiah:50:44",
            "prophets:jeremiah:49:19",
            "prophets:hosea:12:10",
            "torah:deuteronomy:9:7",
            "prophets:isaiah:13:13",
            "torah:leviticus:25:46"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:6:1"
        ]
    }
}