{
    "VERSE": "14:16",
    "ARABIC": "مِّن وَرَآئِهِۦ جَهَنَّمُ وَيُسْقَىٰ مِن مَّآءٍ صَدِيدٍ",
    "ENGLISH": {
        "TRANSLATION_0": "And beyond him is Hell where he will be given pus to drink.",
        "TRANSLATION_1": "Before him is Hell, and he will get putrid liquid to drink.\n",
        "TRANSLATION_2": "Hell is before him and he shall be made to drink of the oozing pus,\n",
        "TRANSLATION_3": "Thereafter they will face hell fire wherein they will drink boiling water.\n",
        "TRANSLATION_4": "Hell went after him, and he will be made to drink liquid pus*. (* Discharged from the wounds of other people in hell.)\n",
        "TRANSLATION_5": "In front of him is Hell, and he will be made to drink boiling, festering water.\n",
        "TRANSLATION_6": "Hell is before him and he shall be given to drink of festering water:\n",
        "TRANSLATION_7": "beyond him Gehenna, and he is given to drink of oozing pus,\n",
        "TRANSLATION_8": "Hell is before him, and he is made to drink a festering water,\n",
        "TRANSLATION_9": "Beyond him is Hell, and he shall drink putrid water;\n",
        "TRANSLATION_10": "Behind him is Hell, and he shall be made to drink of fetid water.\n",
        "TRANSLATION_11": "with hell lying ahead of him, [where] he shall be given to drink of a purulent fluid,\n",
        "TRANSLATION_12": "In front of such a one is Hell, and he is given, for drink, boiling fetid water.\n",
        "TRANSLATION_13": "In front of him (every obstinate, arrogant dictator) is Hell, and he will be made to drink boiling, festering water.\n",
        "TRANSLATION_14": "Gehenna (Hell) is before him and he is given oozing pus to drink,\n",
        "TRANSLATION_15": "Beyond him lies Hell, and he will be given to drink putrid water.\n",
        "TRANSLATION_16": "Before him is Hell, and he will be given a drink of purulent water.\n",
        "TRANSLATION_17": "[14:16] beyond him, that is, in front of him, is Hell, which he will enter, and he is given to drink, in it, of festering   fluid — which is what issues out of the insides of the people of the Fire, mixed with pus and blood —\n",
        "TRANSLATION_18": "(Hell is before him) Hell is before this arrogant person when he dies, (and he is made to drink a festering water) and he is made to drink what comes of his skin of puss and blood.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "14:16",
            "86:6",
            "79:31",
            "85:20",
            "56:31",
            "11:71",
            "78:14",
            "32:8",
            "45:10",
            "77:20"
        ],
        "BIBLE": [
            "torah:genesis:21:19",
            "writings:job:22:7",
            "writings:nehemiah:12:38",
            "writings:ii%20chronicles:22:6",
            "prophets:ii%20kings:8:29",
            "torah:numbers:20:24",
            "torah:numbers:32:7",
            "torah:exodus:17:2",
            "prophets:ii%20samuel:8:14",
            "writings:esther:3:15"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:3:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:3:7",
            
            "Sefer%20Yetzirah:1:11"
        ]
    }
}