{
    "VERSE": "14:17",
    "ARABIC": "يَتَجَرَّعُهُۥ وَلَا يَكَادُ يُسِيغُهُۥ وَيَأْتِيهِ ٱلْمَوْتُ مِن كُلِّ مَكَانٍ وَمَا هُوَ بِمَيِّتٍ وَمِن وَرَآئِهِۦ عَذَابٌ غَلِيظٌ",
    "ENGLISH": {
        "TRANSLATION_0": "He gulps at it but can hardly swallow it down. Death comes at him from every side but he does not die. And beyond him is relentless punishment.",
        "TRANSLATION_1": "He will sip it, yet will not be able to gulp it down. Death will crowd in upon him from every side, but die he will not. A terrible torment trails him.\n",
        "TRANSLATION_2": "which he will gulp but will scarcely swallow, and death will come upon him from every quarter, and yet he will not be able to die. A terrible chastisement lies ahead in pursuit of him.\n",
        "TRANSLATION_3": "As they sip the unpleasant water, death will approach them from all sides, but they will never die. In addition to this, they will experience the most intense torment.\n",
        "TRANSLATION_4": "He will sip it with difficulty but be unable to swallow, and death will approach him from every side and he will not die; and a severe punishment is after him.\n",
        "TRANSLATION_5": "He will sip it unwillingly, and he will find great difficulty in swallowing it down his throat, and death will come to him from every side, yet he will not die, and in front of him, will be a great torment.\n",
        "TRANSLATION_6": "He will drink it little by little and will not be able to swallow it agreeably, and death will come to him from every quarter, but he shall not die; and there shall be vehement chastisement before him.\n",
        "TRANSLATION_7": "the which he gulps, and can scarce swallow, and death comes upon him from every side, yet he cannot die; and still beyond him is a harsh chastisement.\n",
        "TRANSLATION_8": "Which he sippeth but can hardly swallow, and death cometh unto him from every side while yet he cannot die, and before him is a harsh doom.\n",
        "TRANSLATION_9": "he will sip and will not find it easy to swallow it. Death will approach him from every quarter, yet he will not die. More intense suffering will lie ahead of him.\n",
        "TRANSLATION_10": "Which he gulpeth, but wellnigh swalloweth not. And death cometh upon him from every side, while yet he is not dead, and behind him is a torment terrible.\n",
        "TRANSLATION_11": "gulping it down, but hardly swallowing it: death will assail him from every side, but he will not die, and there is [yet] a harsh punishment ahead of him.\n",
        "TRANSLATION_12": "In gulps will he sip it, but never will he be near swallowing it down his throat: death will come to him from every quarter, yet will he not die: and in front of him will be a chastisement unrelenting.\n",
        "TRANSLATION_13": "He will sip it unwillingly, and he will find a great difficulty to swallow it down his throat, and death will come to him from every side, yet he will not die and in front of him, will be a great torment.\n",
        "TRANSLATION_14": "which he gulps and can scarcely swallow. Death will come to him from every side, yet he cannot not die, and yet to come is a dreadful punishment.\n",
        "TRANSLATION_15": "He will guzzle it, but he will not swallow it. Death will come at him from every direction, but he will not die. And beyond this is relentless suffering.\n",
        "TRANSLATION_16": "He will gulp it but will hardly [be able to] swallow it. And death will come to him from everywhere, but he is not to die. And before him is a massive punishment.\n",
        "TRANSLATION_17": "[14:17] which he sips, gulping it repeatedly, because of its acridity, but can scarcely swallow, [scarcely] ingest because it is so foul and disgusting; and death, that is, those causes of it that necessarily bring it about, in the way of [different] types of chastisement, comes to him from every side, yet he cannot die; and still beyond him, after that chastisement, there is a harsh chastisement, a severe one, following on [from the previous one].\n",
        "TRANSLATION_18": "(Which he sippeth) he sips puss and holds it in his throat (but can hardly swallow, and death) the agony of death (cometh unto him from every side) from beneath every single hair that he has; it is also said that this means: the Fire surrounds him from every side (while yet he cannot die) from such a torment, (and before him) after sipping puss (is a harsh doom) harsher than drinking puss.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "14:17",
            "56:60",
            "31:24",
            "10:97",
            "45:10",
            "5:37",
            "44:56",
            "35:36",
            "40:27",
            "32:20"
        ],
        "BIBLE": [
            "prophets:ezekiel:47:9",
            "torah:genesis:48:7",
            "prophets:judges:21:5",
            "torah:exodus:7:18",
            "prophets:isaiah:28:15",
            "prophets:i%20kings:13:22",
            "writings:ezra:10:6",
            "torah:numbers:35:21",
            "torah:deuteronomy:23:12",
            "torah:exodus:30:20"
        ]
    }
}