{
    "VERSE": "14:26",
    "ARABIC": "وَمَثَلُ كَلِمَةٍ خَبِيثَةٍ كَشَجَرَةٍ خَبِيثَةٍ ٱجْتُثَّتْ مِن فَوْقِ ٱلْأَرْضِ مَا لَهَا مِن قَرَارٍ",
    "ENGLISH": {
        "TRANSLATION_0": "The metaphor of a corrupt word is that of a rotten tree, uprooted on the surface of the earth. It has no staying-power.",
        "TRANSLATION_1": "An evil act is like a rotten tree torn out of the earth with no (base or) firmness.\n",
        "TRANSLATION_2": "And the example of an evil word is that of an evil tree, uprooted from the surface of the earth, wholly unable to endure.\n",
        "TRANSLATION_3": "An evil word is compared to an evil tree with no firm roots in the land and thus has no stability.\n",
        "TRANSLATION_4": "And the example of a bad saying is like a filthy tree, which is cut off above the ground, therefore not having stability.\n",
        "TRANSLATION_5": "And the parable of an evil word is that of an evil tree uprooted from the surface of earth, having no stability.\n",
        "TRANSLATION_6": "And the parable of an evil word is as an evil tree pulled up from the earth's surface; it has no stability.\n",
        "TRANSLATION_7": "And the likeness of a corrupt word is as a corrupt tree -- uprooted from the earth, having no stablishment.\n",
        "TRANSLATION_8": "And the similitude of a bad saying is as a bad tree, uprooted from upon the earth, possessing no stability.\n",
        "TRANSLATION_9": "but an evil word is like an evil tree torn out of the earth; it has no foothold.\n",
        "TRANSLATION_10": "And the similitude of the foul word is as a foul tree, uprooted from upon the earth, and there is for it no stability.\n",
        "TRANSLATION_11": "And the parable of a bad word is that of a bad tree: uprooted from the ground, it has no stability.\n",
        "TRANSLATION_12": "And the parable of an evil Word is that of an evil tree: It is torn up by the root from the surface of the earth: it has no stability.\n",
        "TRANSLATION_13": "And the parable of an evil word is that of an evil tree uprooted from the surface of earth having no stability.\n",
        "TRANSLATION_14": "The likeness of a corrupt word is like a corrupt tree uprooted from the earth having no stability.\n",
        "TRANSLATION_15": "And the parable of a bad word is that of a bad tree—it is uprooted from the ground; it has no stability.\n",
        "TRANSLATION_16": "And the example of a bad word is like a bad tree, uprooted from the surface of the earth, not having any stability.\n",
        "TRANSLATION_17": "[14:26] And the similitude of a bad saying, that is, the word of unbelief, is as a bad tree, a colocynth, uprooted from upon the earth, having no stability, [no] fixing or foundation. Similarly, the word of unbelief has no foundation, and no shoot or blessing.\n",
        "TRANSLATION_18": "(And the similitude of a bad saying) associating partners with Allah (is as a bad tree) this refers to the idolater. He says: idolatry is blameworthy and no aspect of it is praiseworthy, just as the idolater is censored and there is nothing praiseworthy about him; it is also said that the bad tree refers to the colocynth which is bitter and useless, and so is the idolater: useless and censored, (uprooted from upon the earth, possessing no stability) it has no firmness on the face of the earth; and so is the idolater: he does not have any proof to cling to, just as the colocynth does not have roots which keep it firmly grounded. Moreover, while a person is an idolater none of his works are accepted.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "14:26",
            "14:24",
            "25:39",
            "47:10",
            "31:27",
            "44:29",
            "36:13",
            "91:6",
            "99:2",
            "15:19"
        ],
        "BIBLE": [
            "prophets:joshua:7:9",
            "torah:deuteronomy:15:9",
            "torah:deuteronomy:4:18",
            "torah:deuteronomy:9:5",
            "writings:job:14:8",
            "prophets:jeremiah:42:10",
            "prophets:ezekiel:17:9",
            "prophets:i%20samuel:20:15",
            "prophets:i%20kings:7:37",
            "prophets:i%20kings:7:43"
        ]
    }
}