{
    "VERSE": "14:27",
    "ARABIC": "يُثَبِّتُ ٱللَّهُ ٱلَّذِينَ ءَامَنُوا۟ بِٱلْقَوْلِ ٱلثَّابِتِ فِى ٱلْحَيَوٰةِ ٱلدُّنْيَا وَفِى ٱلْءَاخِرَةِ وَيُضِلُّ ٱللَّهُ ٱلظَّٰلِمِينَ وَيَفْعَلُ ٱللَّهُ مَا يَشَآءُ",
    "ENGLISH": {
        "TRANSLATION_0": "Allah makes those who have iman firm with the Firm Word in the life of this world and the Next World. But Allah misguides the wrongdoers. Allah does whatever He wills.",
        "TRANSLATION_1": "With immutuble words God makes the faithful dauntless in the life of the world and the life to come, but leads the unjust into error, for God does as He pleases.\n",
        "TRANSLATION_2": "Thus, through a firm word, Allah grants firmness to the believers both in this world and in the Hereafter. As for the wrong-doers, Allah lets them go astray. Allah does whatever He wills.\n",
        "TRANSLATION_3": "God strengthens the faith of the believers by the true Words in this world and in the life to come. He causes the unjust to go astray and does whatever He pleases.\n",
        "TRANSLATION_4": "Allah keeps the believers firm upon the truth in the life of this world and in the Hereafter; and Allah sends the unjust astray; and Allah may do whatever He wills.\n",
        "TRANSLATION_5": "Allah will keep firm those who believe, with the word that stands firm in this world, and in the Hereafter. And Allah will cause the wrongdoers to go astray, and Allah does what He wills.\n",
        "TRANSLATION_6": "Allah confirms those who believe with the sure word in this world's life and in the hereafter, and Allah causes the unjust to go astray, and Allah does what He pleases.\n",
        "TRANSLATION_7": "God confirms those who believe with the firm word, in the present life and in the world to come; and God leads astray the evildoers; and God does what He will.\n",
        "TRANSLATION_8": "Allah confirmeth those who believe by a firm saying in the life of the world and in the Hereafter, and Allah sendeth wrong-doers astray. And Allah doeth what He will.\n",
        "TRANSLATION_9": "God will strengthen the believers with His steadfast word, both in the present life and in the Hereafter. God lets the wrongdoers go astray. He does what He wills.\n",
        "TRANSLATION_10": "Allah keepeth firm those who believe by the firm Word in the life of the world and in the Hereafter, and Allah sendeth astray the wrong-doers. And Allah doth that which He willeth.\n",
        "TRANSLATION_11": "Allah fortifies those who have faith with a constant creed in the life of this world and in the Hereafter, and Allah leads astray the wrongdoers, and Allah does whatever He wishes.\n",
        "TRANSLATION_12": "Allah will establish in strength those who believe, with the word that stands firm, in this world and in the Hereafter; but Allah will leave, to stray, those who do wrong: Allah doeth what He willeth.\n",
        "TRANSLATION_13": "Allah will keep firm those who believe, with the word that stands firm in this world (i.e. they will keep on worshipping Allah Alone and none else), and in the Hereafter. And Allah will cause to go astray those who are Zalimun (polytheists and wrong-doers, etc.), and Allah does what He wills.\n",
        "TRANSLATION_14": "Allah will strengthen the believers with a steadfast Word, both in this life and in the Everlasting Life. Allah leads the evildoers astray. Allah does what He will.\n",
        "TRANSLATION_15": "God gives firmness to those who believe, with the firm word, in this life, and in the Hereafter. And God leads the wicked astray. God does whatever He wills.\n",
        "TRANSLATION_16": "Allah keeps firm those who believe, with the firm word, in worldly life and in the Hereafter. And Allah sends astray the wrongdoers. And Allah does what He wills.\n",
        "TRANSLATION_17": "[14:27] God confirms those who believe by a firm saying, namely, the profession of [His] Oneness, in the life of this world and in the Hereafter, that is, in the grave, when the two angels question them about their Lord, their religion and their Prophet, and they respond correctly, as [reported] in the hadīth of the two Shaykhs [alBukhārī and Muslim]; and God sends astray the evildoers, the disbelievers, and therefore they are not guided to the correct response, saying instead, ‘We do not know’, as [reported] in the hadīth; and God does what He will.\n",
        "TRANSLATION_18": "(Allah confirmeth those who believe) in Muhammad (pbuh) and in the Qur'an; it is also said that this means: those who believed were on the day of the Covenant with a good disposition of the soul, and these are the felicitous people, (by a firm saying) the testification that there is no god but Allah (in the life of the world) so that they do not go back on it (and in the Hereafter) i.e. in the grave when asked about it, (and Allah sendeth wrong-doers) the idolaters (astray) from the testification of there is no god but Allah in the life of this world, so that they do not say it with a good disposition of the soul, nor in the grave nor when they come out of it. These are the people destined for damnation. (And Allah doeth what He will) whether it is sending astray or holding people firm; it is also said: (And Allah doeth what He will) about turning away Munkar and Nakir.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "14:27",
            "13:26",
            "16:107",
            "30:7",
            "13:34",
            "14:3",
            "41:31",
            "39:26",
            "2:86",
            "33:57"
        ],
        "BIBLE": [
            "torah:leviticus:17:11",
            "prophets:i%20kings:19:2",
            "prophets:hosea:2:14",
            "writings:ii%20chronicles:35:21",
            "prophets:i%20kings:13:21",
            "prophets:jeremiah:25:31",
            "prophets:ii%20kings:19:4",
            "prophets:ezekiel:12:23",
            "prophets:isaiah:37:4",
            "torah:numbers:8:19"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:4:3"
        ]
    }
}