{
    "VERSE": "14:35",
    "ARABIC": "وَإِذْ قَالَ إِبْرَٰهِيمُ رَبِّ ٱجْعَلْ هَٰذَا ٱلْبَلَدَ ءَامِنًا وَٱجْنُبْنِى وَبَنِىَّ أَن نَّعْبُدَ ٱلْأَصْنَامَ",
    "ENGLISH": {
        "TRANSLATION_0": "When Ibrahim said, 'My Lord! Make this land a place of safety and keep me and my sons from worshipping idols.",
        "TRANSLATION_1": "Remember when Abraham prayed: \"O Lord, make this a city of peace, and preserve me and my progeny from worshipping idols:\n",
        "TRANSLATION_2": "And call to mind when Abraham prayed: \"My Lord! Make this city secure, and keep me and my sons away from worshipping the idols.\n",
        "TRANSLATION_3": "(Muhammad), consider when Abraham prayed, \"Lord, make this (Mecca) a peaceful territory and save me and my offspring from worshipping idols.\n",
        "TRANSLATION_4": "And remember when Ibrahim prayed, “O my Lord! Make this town (Mecca) a safe one, and safeguard me and my sons from worshipping idols.”\n",
        "TRANSLATION_5": "And (remember) when Ibrahim said: \"O my Lord! Make this city (Makkah) one of peace and security, and keep me and my sons away from worshipping idols.\n",
        "TRANSLATION_6": "And when Ibrahim said: My Lord! make this city secure, and save me and my sons from worshipping idols:\n",
        "TRANSLATION_7": "And when Abraham said, 'My Lord, make this land secure, and turn me and my sons away from serving idols;\n",
        "TRANSLATION_8": "And when Abraham said: My Lord! Make safe this territory, and preserve me and my sons from serving idols.\n",
        "TRANSLATION_9": "[Remember] when Abraham said, \"My Lord, make this a city of peace and help me and my children to keep away from worshipping idols.\n",
        "TRANSLATION_10": "And recall what time Ibrahim said: my Lord! make this City secure and keep me and my sons away from worshipping the idols.\n",
        "TRANSLATION_11": "When Abraham said, ‘My Lord! Make this city a sanctuary, and save me and my children from worshiping idols.\n",
        "TRANSLATION_12": "Remember Abraham said: \"O my Lord! make this city one of peace and security: and preserve me and my sons from worshipping idols.\n",
        "TRANSLATION_13": "And (remember) when Ibrahim (Abraham) said: \"O my Lord! Make this city (Makkah) one of peace and security, and keep me and my sons away from worshipping idols.\n",
        "TRANSLATION_14": "And when Abraham said: 'My Lord, make this a land secure. Turn me and my children away from worshipping idols.\n",
        "TRANSLATION_15": "Recall that Abraham said, “O my Lord, make this land peaceful, and keep me and my sons from worshiping idols.”\n",
        "TRANSLATION_16": "And [mention, O Muhammad], when Abraham said, \"My Lord, make this city [Makkah] secure and keep me and my sons away from worshipping idols.\n",
        "TRANSLATION_17": "[14:35] And, mention, when Abraham said, ‘My Lord, make this land, Mecca, secure — God granted him this petition and thus made it [Mecca] a sanctuary in which no human blood is shed, no person is wronged, prey is not hunted and one which is never deserted in any of its parts — and turn me and my sons away from serving idols.\n",
        "TRANSLATION_18": "(And when Abraham said) after the building of the House: (My Lord!) my Lord! (Make safe) such that no turmoil takes place and whoever is in fear finds safety in (this territory) Mecca, (and preserve me and my sons from serving idols) from worshipping idols or fire.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "14:35",
            "27:91",
            "14:41",
            "28:22",
            "95:3",
            "26:10",
            "23:98",
            "23:118",
            "23:29",
            "7:172"
        ],
        "BIBLE": [
            "prophets:zephaniah:3:20",
            "prophets:jeremiah:27:7",
            "prophets:joshua:5:2",
            "prophets:joshua:23:7",
            "writings:psalms:118:25",
            "writings:psalms:77:12",
            "writings:psalms:70:2",
            "prophets:jeremiah:3:16",
            "prophets:isaiah:26:13",
            "torah:deuteronomy:28:69"
        ]
    }
}