{
    "VERSE": "14:36",
    "ARABIC": "رَبِّ إِنَّهُنَّ أَضْلَلْنَ كَثِيرًا مِّنَ ٱلنَّاسِ فَمَن تَبِعَنِى فَإِنَّهُۥ مِنِّى وَمَنْ عَصَانِى فَإِنَّكَ غَفُورٌ رَّحِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "My Lord! They have misguided many of mankind. If anyone follows me, he is with me but if anyone disobeys me, You are Ever-Forgiving, Most Merciful.",
        "TRANSLATION_1": "Many a man have they led astray, O Lord. So he who follows me is truly of me; but as for him who disobeys me, surely You are forgiving and kind.\n",
        "TRANSLATION_2": "My Lord! They have caused many people to go astray. Now, if anyone follows my way, he is from me; and if anyone follows a way opposed to mine, then surely You are Ever-Forgiving, Most Merciful.\"\n",
        "TRANSLATION_3": "Lord, the idols have misled many people. Whoever follows me is my friend. As for those who disobey, You are certainly All-forgiving and All-merciful.\n",
        "TRANSLATION_4": "“O my Lord! The idols have led many people astray; so whoever followed me, is indeed mine; and whoever disobeyed me – then indeed You are Oft Forgiving, Most Merciful.”\n",
        "TRANSLATION_5": "O my Lord! They have indeed led astray many among mankind. But whoso follows me, he verily, is of me. And whoso disobeys me, still You are indeed Oft-Forgiving, Most Merciful.\n",
        "TRANSLATION_6": "My Lord! surely they have led many men astray; then whoever follows me, he is surely of me, and whoever disobeys me, Thou surely art Forgiving, Merciful:\n",
        "TRANSLATION_7": "my Lord, they have led astray many men. Then whoso follows me belongs to me; and whoso rebels against me, surely Thou art All-forgiving, All-compassionate.\n",
        "TRANSLATION_8": "My Lord! Lo! they have led many of mankind astray. But whoso followeth me, he verily is of me. And whoso disobeyeth me - Still Thou art Forgiving, Merciful.\n",
        "TRANSLATION_9": "My Lord, they have led so many men astray! Anyone who follows me is with me, but if anyone turns against me, You are surely forgiving and merciful.\n",
        "TRANSLATION_10": "My Lord! they have sent astray many among mankind; whosoever followeth me, verily he is of me; and whosoever disobeyeth me, then verily Thou art Forgiving, Merciful.\n",
        "TRANSLATION_11": "My Lord! Indeed they have misled many people. So whoever follows me indeed belongs to me, and as for those who disobey me, well, You are indeed all-forgiving, all-merciful.\n",
        "TRANSLATION_12": "O my Lord! they have indeed led astray many among mankind; He then who follows my (ways) is of me, and he that disobeys me,- but Thou art indeed Oft-forgiving, Most Merciful.\n",
        "TRANSLATION_13": "O my Lord! They have indeed led astray many among mankind. But whoso follows me, he verily is of me. And whoso disobeys me, - still You are indeed Oft-Forgiving, Most Merciful.\n",
        "TRANSLATION_14": "My Lord they have led many people astray. Whosoever follows me belongs to me. Whosoever rebels against me, You are surely Forgiving, the MostMerciful.\n",
        "TRANSLATION_15": "“My Lord, they have led many people astray. Whoever follows me belongs with me; and whoever disobeys me—You are Forgiving and Merciful.\n",
        "TRANSLATION_16": "My Lord, indeed they have led astray many among the people. So whoever follows me - then he is of me; and whoever disobeys me - indeed, You are [yet] Forgiving and Merciful.\n",
        "TRANSLATION_17": "[14:36] My Lord, truly they, idols, have led many of mankind astray, because of their [mankind’s] worship of them. So whoever follows me, believing in the Oneness of God, verily belongs with me, belongs with those who follow my religion; and whoever disobeys me, truly You are Forgiving, Merciful: this was before he was aware of the fact that God does not forgive idolatry.\n",
        "TRANSLATION_18": "269 And preserve me (My Lord!) my Lord! (Lo! they have led many of mankind astray) i.e. they were made to lead many people astray; it is also said that this means: many people went astray because of them. (But whoso followeth me) whoever follows my religion and obeys me, (he verily is of me) he follows my religion. (And whoso disobeyeth me) whoever opposes my religion, (still Thou art Forgiving) of whoever repent of among them, (Merciful) towards whoever dies repentant.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "14:36",
            "28:16",
            "12:98",
            "7:153",
            "2:199",
            "34:36",
            "12:53",
            "16:110",
            "15:56",
            "2:37"
        ],
        "BIBLE": [
            "writings:job:34:27",
            "prophets:ii%20kings:6:19",
            "prophets:jeremiah:26:3",
            "prophets:zephaniah:1:6",
            "prophets:jeremiah:23:22",
            "prophets:i%20samuel:12:20",
            "prophets:i%20kings:18:37",
            "prophets:ezekiel:33:11",
            "prophets:isaiah:53:6",
            "torah:deuteronomy:3:1"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:3:6",
            "Sefer%20Yetzirah:4:5"
        ]
    }
}