{
    "VERSE": "14:39",
    "ARABIC": "ٱلْحَمْدُ لِلَّهِ ٱلَّذِى وَهَبَ لِى عَلَى ٱلْكِبَرِ إِسْمَٰعِيلَ وَإِسْحَٰقَ إِنَّ رَبِّى لَسَمِيعُ ٱلدُّعَآءِ",
    "ENGLISH": {
        "TRANSLATION_0": "Praise be to Allah Who, despite my old age, has given me Ismail and Ishaq. My Lord is the Hearer of Prayer.",
        "TRANSLATION_1": "All praise be to God who bestowed on me Ishmael and Isaac in old age. Verily my Lord listens to prayer.\n",
        "TRANSLATION_2": "All praise be to Allah Who, despite my old age, has given me Ishmael and Isaac. Surely my Lord hears all prayers.\n",
        "TRANSLATION_3": "It is only God who deserves all praise. I praise Him for His giving me my sons Ishmael and Isaac during my old age. My Lord, certainly, hears all prayers.\n",
        "TRANSLATION_4": "“All praise is to Allah Who gave me Ismail and Ishaq, in my old age; indeed my Lord is the Listener of Prayer.”\n",
        "TRANSLATION_5": "All praise is due to Allah, Who has given me in old age Isma'il and Ishaq. Verily, my Lord is indeed the All-Hearer of invocations.\"\n",
        "TRANSLATION_6": "Praise be to Allah, Who has given me in old age Ismail and Ishaq; most surely my Lord is the Hearer of prayer:\n",
        "TRANSLATION_7": "Praise be to God, who has given me, though I am old, Ishmael and Isaac; surely my Lord hears the petition.\n",
        "TRANSLATION_8": "Praise be to Allah Who hath given me, in my old age, Ishmael and Isaac! Lo! my Lord is indeed the Hearer of Prayer.\n",
        "TRANSLATION_9": "Praise be to God who has bestowed upon me, despite my old age, Ishmael and Isaac. Surely my Lord is the hearer of prayer.\n",
        "TRANSLATION_10": "All praise be unto Allah who hath bestowed upon me, despite old age lsma'il and ls-haq; verily my Lord is the Hearer of supplication.\n",
        "TRANSLATION_11": "All praise belongs to Allah, who gave me Ishmael and Isaac despite [my] old age. Indeed my Lord hears all supplications.\n",
        "TRANSLATION_12": "Praise be to Allah, Who hath granted unto me in old age Isma'il and Isaac: for truly my Lord is He, the Hearer of Prayer!\n",
        "TRANSLATION_13": "All the praises and thanks be to Allah, Who has given me in old age Isma'il (Ishmael) and Ishaque (Isaac). Verily! My Lord is indeed the All-Hearer of invocations.\n",
        "TRANSLATION_14": "Praise be to Allah who has given me Ishmael and Isaac in my old age! Indeed, my Lord is the Hearer of the supplication.\n",
        "TRANSLATION_15": "“Praise be to God, Who has given me, in my old age, Ishmael and Isaac. My Lord is the Hearer of Prayers.”\n",
        "TRANSLATION_16": "Praise to Allah, who has granted to me in old age Ishmael and Isaac. Indeed, my Lord is the Hearer of supplication.\n",
        "TRANSLATION_17": "[14:39] Praise be to God Who has given me, despite [my] old age, Ishmael — born to him when he [Abraham] was 99 years old — and Isaac — born to him when he was 112 years old. Lo! my Lord is indeed the Hearer of supplication.\n",
        "TRANSLATION_18": "(Praise be to Allah) Thanks to Allah (Who hath given me, in my old age, Ishmael and Isaac!) he was then 100 years old and his wife Sarah was 99 years old. (Lo! my Lord is indeed the Hearer of Prayer) He answers prayers.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "14:39",
            "37:182",
            "35:34",
            "1:2",
            "45:36",
            "6:45",
            "6:1",
            "18:1",
            "27:93",
            "10:10"
        ],
        "BIBLE": [
            "prophets:i%20samuel:1:27",
            "torah:leviticus:19:24",
            "writings:psalms:118:18",
            "torah:deuteronomy:16:17",
            "prophets:i%20kings:5:18",
            "prophets:joshua:13:14",
            "torah:numbers:18:8",
            "prophets:joshua:13:33",
            "torah:numbers:3:51",
            "torah:numbers:3:9"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:3:2"
        ]
    }
}