{
    "VERSE": "14:4",
    "ARABIC": "وَمَآ أَرْسَلْنَا مِن رَّسُولٍ إِلَّا بِلِسَانِ قَوْمِهِۦ لِيُبَيِّنَ لَهُمْ فَيُضِلُّ ٱللَّهُ مَن يَشَآءُ وَيَهْدِى مَن يَشَآءُ وَهُوَ ٱلْعَزِيزُ ٱلْحَكِيمُ",
    "ENGLISH": {
        "TRANSLATION_0": "We have not sent any Messenger except with the language of his people so he can make things clear to them. Allah misguides anyone He wills and guides anyone He wills. He is the Almighty, the All-Wise.",
        "TRANSLATION_1": "We never sent a messenger who did not speak the tongue of his people, that he may explain to them distinctly. God leads whosoever He wills astray, and shows whoever He wills the way: He is all-mighty and all-wise.\n",
        "TRANSLATION_2": "Never have We sent a Messenger but he has addressed his people in their language that he may fully expound his Message to them. (And after the Message is expounded), Allah lets go astray whomsoever He wills, and guides to the Right Way whomsoever He wills. He is the All-Mighty, the All-Wise.\n",
        "TRANSLATION_3": "All the Messengers that We sent spoke the language of their people so that they could explain (their message to them). God guides or causes to go astray whomever He wants. He is Majestic and All-wise.\n",
        "TRANSLATION_4": "And We sent every Noble Messenger with the same language as his people*, so that he may clearly explain to them; then Allah sends astray whomever He wills, and He guides whomever He wills; and He only is the Most Honourable, the Wise. (* Prophet Mohammed (peace and blessings be upon him) was taught all the languages as he is sent towards all.)\n",
        "TRANSLATION_5": "And We sent not a Messenger except with the language of his people, in order that he might make (the Message) clear for them. Then Allah misleads whom He wills and guides whom He wills. And He is the All-Mighty, the All-Wise.\n",
        "TRANSLATION_6": "And We did not send any apostle but with the language of his people, so that he might explain to them clearly; then Allah makes whom He pleases err and He guides whom He pleases and He is the Mighty, the Wise.\n",
        "TRANSLATION_7": "And We have sent no Messenger save with the tongue of his people, that he might make all clear to them; then God leads astray whomsoever He will, and He guides whomsoever He will; and He is the All-mighty, the All-wise.\n",
        "TRANSLATION_8": "And We never sent a messenger save with the language of his folk, that he might make (the message) clear for them. Then Allah sendeth whom He will astray, and guideth whom He will. He is the Mighty, the Wise.\n",
        "TRANSLATION_9": "Each messenger We have sent has spoken in the language of his own people, so that he might make the message clear to them. But God lets go astray whom He will and guides whom He pleases. He is the Almighty, the All Wise.\n",
        "TRANSLATION_10": "And We sent not an apostle but with the speech of his people that he might expound unto them. Then Allah sendeth astray whomsoever He will, and guideth whomsoever He will. And He is the Mighty, the Wise.\n",
        "TRANSLATION_11": "We did not send any apostle except with the language of his people, so that he might make [Our messages] clear to them. Then Allah leads astray whomever He wishes, and He guides whomsoever He wishes, and He is the All-mighty, the All-wise.\n",
        "TRANSLATION_12": "We sent not a messenger except (to teach) in the language of his (own) people, in order to make (things) clear to them. Now Allah leaves straying those whom He pleases and guides whom He pleases: and He is Exalted in power, full of Wisdom.\n",
        "TRANSLATION_13": "And We sent not a Messenger except with the language of his people, in order that he might make (the Message) clear for them. Then Allah misleads whom He wills and guides whom He wills. And He is the All-Mighty, the All-Wise.\n",
        "TRANSLATION_14": "We have sent no Messenger except in the tongue of his own nation, so that he might make everything plain to them. But Allah leads astray whom He will and guides whom He will. He is the Almighty, the Wise.\n",
        "TRANSLATION_15": "We never sent any messenger except in the language of his people, to make things clear for them. God leads astray whom He wills, and guides whom He wills. He is the Mighty, the Wise.\n",
        "TRANSLATION_16": "And We did not send any messenger except [speaking] in the language of his people to state clearly for them, and Allah sends astray [thereby] whom He wills and guides whom He wills. And He is the Exalted in Might, the Wise.\n",
        "TRANSLATION_17": "[14:4] And We have not sent any Messenger except with the tongue, with the language, of his people, that he might make [the Message] clear to them, that he might make them understand what he brings to them; God then sends astray whomever He will and He guides whomever He will; and He is the Mighty, in His kingdom, the Wise, in His actions.\n",
        "TRANSLATION_18": "(And We never sent a messenger save with the language of his folk, that he might make (the message) clear for them) in their own language what they have been commanded with and prohibited from; it is also said that this means: in a language through which it is possible for them to learn. (Then Allah sendeth whom He will astray) from His religion, (and guideth) to His religion (whom He will) whoever deserves to be guided. (He is the Mighty) in His kingdom and sovereignty; it is also said that this means: the Mighty in His retribution against those who do not believe, (the Wise) in His command and decree; it is also said that this means: the Wise in guiding some and misguiding others.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "14:4",
            "35:2",
            "3:126",
            "4:165",
            "59:1",
            "61:1",
            "57:1",
            "59:24",
            "8:10",
            "39:37"
        ],
        "BIBLE": [
            "writings:daniel:3:29",
            "prophets:isaiah:42:16",
            "prophets:ii%20samuel:23:5",
            "prophets:micah:3:5",
            "torah:exodus:23:13",
            "prophets:isaiah:40:3",
            "writings:psalms:106:8",
            "writings:i%20chronicles:21:3",
            "writings:psalms:59:12",
            "torah:deuteronomy:26:19"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:3:1"
        ]
    }
}