{
    "VERSE": "14:41",
    "ARABIC": "رَبَّنَا ٱغْفِرْ لِى وَلِوَٰلِدَىَّ وَلِلْمُؤْمِنِينَ يَوْمَ يَقُومُ ٱلْحِسَابُ",
    "ENGLISH": {
        "TRANSLATION_0": "Our Lord! Forgive me and my parents and the muminun on the Day the Reckoning takes place.'",
        "TRANSLATION_1": "O Lord, forgive me, my parents and the faithful on the Day the reckoning is done.\"\n",
        "TRANSLATION_2": "Our Lord! Forgive me and my parents and the believers on the Day when the reckoning will take place.\"\n",
        "TRANSLATION_3": "Lord, on the Day of Judgment, forgive me and my parents and all the believers.\"\n",
        "TRANSLATION_4": "“O our Lord! And forgive me, and my parents, and all the Muslims on the day when the account will be established.”\n",
        "TRANSLATION_5": "Our Lord! Forgive me and my parents, and (all) the believers on the Day when the reckoning will be established.\"\n",
        "TRANSLATION_6": "O our Lord! grant me protection and my parents and the believers on the day when the reckoning shall come to pass!\n",
        "TRANSLATION_7": "Our Lord, forgive Thou me and my parents, and the believers, upon the day when the reckoning shall come to pass.\n",
        "TRANSLATION_8": "Our Lord! Forgive me and my parents and believers on the day when the account is cast.\n",
        "TRANSLATION_9": "Forgive me, Lord, and forgive my parents and all the believers on the Day of Reckoning.\"\n",
        "TRANSLATION_10": "Our Lord! forgive me and my parents and the believers on the Day whereon will be set up the reckoning.\n",
        "TRANSLATION_11": "Our Lord! Forgive me and my parents, and all the faithful, on the day when the reckoning is held.’\n",
        "TRANSLATION_12": "O our Lord! cover (us) with Thy Forgiveness - me, my parents, and (all) Believers, on the Day that the Reckoning will be established!\n",
        "TRANSLATION_13": "Our Lord! Forgive me and my parents, and (all) the believers on the Day when the reckoning will be established.\"\n",
        "TRANSLATION_14": "Forgive me, our Lord, and forgive my parents and all the believers on the Day of Reckoning'\n",
        "TRANSLATION_15": "“Our Lord, forgive me, and my parents, and the believers, on the Day the Reckoning takes place.”\n",
        "TRANSLATION_16": "Our Lord, forgive me and my parents and the believers the Day the account is established.\"\n",
        "TRANSLATION_17": "[14:41] Our Lord, forgive me and my parents — this was before their enmity towards God, Mighty and Majestic, became clear; but it is also said that his mother submitted [to God], (the alternative reading [here] being the singular wālidī [‘my father’]; or [yet another variant reading being] waladī, ‘my son’) and [forgive] believers on the day when the reckoning shall come to pass’, [the day] it shall be effected. God, exalted be He, says:\n",
        "TRANSLATION_18": "(Our Lord!) our Lord! (Forgive me) my sins (and my parents) and forgive my believing forefathers (and believers) and forgive all believing men and women (on the day when the account is cast) when there is reckoning and both the good and evil deeds are displayed, such as those whose good deeds outweigh their evil deeds will enter Paradise and those whose evil works outweigh their good deeds will enter hell; while those whose good works equal their evil works will be among the people of the Heights.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "14:41",
            "38:16",
            "71:28",
            "15:36",
            "38:79",
            "40:27",
            "37:100",
            "36:27",
            "74:46",
            "83:6"
        ],
        "BIBLE": [
            "writings:i%20chronicles:17:11",
            "prophets:isaiah:7:23",
            "prophets:zechariah:14:13",
            "prophets:isaiah:2:2",
            "prophets:micah:4:1",
            "prophets:jeremiah:3:16",
            "prophets:jeremiah:6:11",
            "prophets:i%20samuel:21:7",
            "prophets:jeremiah:49:39",
            "prophets:isaiah:27:12"
        ]
    }
}