{
    "VERSE": "14:47",
    "ARABIC": "فَلَا تَحْسَبَنَّ ٱللَّهَ مُخْلِفَ وَعْدِهِۦ رُسُلَهُۥٓ إِنَّ ٱللَّهَ عَزِيزٌ ذُو ٱنتِقَامٍ",
    "ENGLISH": {
        "TRANSLATION_0": "Do not imagine that Allah will break His promise to His Messengers. Allah is Almighty, Exactor of Revenge.",
        "TRANSLATION_1": "Think not that God would go back on His promise (made) to the apostles. Indeed God is mighty, the Lord of retribution.\n",
        "TRANSLATION_2": "So, do not think, (O Prophet), that Allah will go back upon His promise to His Messengers. Surely Allah is Mighty, Lord of retribution.\n",
        "TRANSLATION_3": "You must not even think that God will disregard His promise to His messengers. God is Majestic and Revengeful.\n",
        "TRANSLATION_4": "So do not ever assume that Allah will not fulfil His promise to His Noble Messengers; indeed Allah is the Dominant, the Avenger.\n",
        "TRANSLATION_5": "So think not that Allah will fail to keep His promise to His Messengers. Certainly, Allah is All-Mighty, All-Able of Retribution.\n",
        "TRANSLATION_6": "Therefore do not think Allah (to be one) failing in His promise to His apostles; surely Allah is Mighty, the Lord of Retribution.\n",
        "TRANSLATION_7": "So do not deem that God will fail in His promise to His Messengers; surely God is All-mighty, Vengeful.\n",
        "TRANSLATION_8": "So think not that Allah will fail to keep His promise to His messengers. Lo! Allah is Mighty, Able to Requite (the wrong).\n",
        "TRANSLATION_9": "Never think that God will fail in His promise to His messengers. God is mighty and capable of retribution.\n",
        "TRANSLATION_10": "So deem not thouthat Allah is going to fail His promise to His apostles; verily Allah is Mighty, Lord of vengeance\n",
        "TRANSLATION_11": "So do not suppose that Allah will break His promise to His apostles. Indeed Allah is all-mighty, avenger.\n",
        "TRANSLATION_12": "Never think that Allah would fail his messengers in His promise: for Allah is Exalted in power, - the Lord of Retribution.\n",
        "TRANSLATION_13": "So think not that Allah will fail to keep His Promise to His Messengers. Certainly, Allah is All-Mighty, - All-Able of Retribution.\n",
        "TRANSLATION_14": "Do not think that Allah will break the promise He gave to His Messengers. Mighty is Allah, and Vengeful.\n",
        "TRANSLATION_15": "Do not ever think that God will break His promise to His messengers. God is Strong, Able to Avenge.\n",
        "TRANSLATION_16": "So never think that Allah will fail in His promise to His messengers. Indeed, Allah is Exalted in Might and Owner of Retribution.\n",
        "TRANSLATION_17": "[14:47] So do not suppose that God will fail [to keep] His promise, of victory, to His messengers. Truly God is Mighty, Victor, nothing able to escape Him, Lord of Retribution, against those who disobey Him.\n",
        "TRANSLATION_18": "(So think not that Allah will fail to keep His promise to His messengers) that He will help and destroy their enemies. (Lo! Allah is Mighty) in His dominion and sovereignty, (Able to Requite) Able to act in retribution against His enemies in this worldly life and in the Hereafter.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "14:47",
            "58:21",
            "30:60",
            "3:32",
            "22:74",
            "63:8",
            "63:1",
            "48:13",
            "24:52",
            "44:42"
        ],
        "BIBLE": [
            "prophets:ezekiel:39:23",
            "torah:exodus:32:24",
            "prophets:ezekiel:17:18",
            "prophets:ezekiel:17:16",
            "prophets:ezekiel:13:13",
            "prophets:ezekiel:30:22",
            "prophets:ezekiel:16:59",
            "prophets:jeremiah:28:11",
            "torah:leviticus:26:44",
            "prophets:micah:2:13"
        ]
    }
}