{
    "VERSE": "14:5",
    "ARABIC": "وَلَقَدْ أَرْسَلْنَا مُوسَىٰ بِـَٔايَٰتِنَآ أَنْ أَخْرِجْ قَوْمَكَ مِنَ ٱلظُّلُمَٰتِ إِلَى ٱلنُّورِ وَذَكِّرْهُم بِأَيَّىٰمِ ٱللَّهِ إِنَّ فِى ذَٰلِكَ لَءَايَٰتٍ لِّكُلِّ صَبَّارٍ شَكُورٍ",
    "ENGLISH": {
        "TRANSLATION_0": "We sent Musa with Our Signs: 'Bring your people from the darkness to the light, and remind them of the Days of Allah.' There are certainly Signs in that for everyone who is steadfast, thankful.",
        "TRANSLATION_1": "Remember when We sent Moses with Our signs (We said): \"Bring your people out of darkness into light, and remind them of the visitations of God. Indeed there are signs in this for every steadfast, thankful soul\"\n",
        "TRANSLATION_2": "We indeed sent Moses with Our Signs, saying: \"Lead your people out of all kinds of darkness into light, and admonish them by narrating to them anecdotes from the Days of Allah.\" Verily in it there are great Signs for everyone who is patient and gives thanks (to Allah).\n",
        "TRANSLATION_3": "We sent Moses and gave him miracles in order to lead his people from darkness into light and to remind them of the days of God. In this there is evidence (of the truth) for those who exercise patience and give thanks.\n",
        "TRANSLATION_4": "And indeed We sent Moosa along with Our signs that, “Bring your people from the realms of darkness into light – and remind them of the days of Allah*; indeed in them are signs for every greatly enduring, grateful person.” (* When various favours were bestowed – in order to give thanks and be patient.)\n",
        "TRANSLATION_5": "And indeed We sent Musa with Our Ayat (saying): \"Bring out your people from darkness into light, and remind them of the annals (or days) of Allah. Truly, therein are Ayat for every patient, thankful (person).\"\n",
        "TRANSLATION_6": "And certainly We sent Musa with Our communications, saying: Bring forth your people from utter darkness into light and remind them of the days of Allah; most surely there are signs in this for every patient, grateful one.\n",
        "TRANSLATION_7": "And We sent Moses with Our signs -- 'Bring forth thy people from the shadows to the light and remind thou them of the Days of God.' Surely in that are signs for every man enduring, thankful!\n",
        "TRANSLATION_8": "We verily sent Moses with Our revelations, saying: Bring thy people forth from darkness unto light. And remind them of the days of Allah. Lo! therein are revelations for each steadfast, thankful (heart).\n",
        "TRANSLATION_9": "We sent Moses with Our signs, saying, \"Lead your people out of the darkness into the light, and remind them of God's Days. In that there are signs for every patient, grateful person.\"\n",
        "TRANSLATION_10": "And assuredly We sent Musa with our signs saying: bring thy people forth from the darknesses unto the light, and remind them of the annals of Allah. Verily therein are signs for everyone patient, and thankful.\n",
        "TRANSLATION_11": "Certainly We sent Moses with Our signs: ‘Bring your people out from darkness into light and remind them of Allah’s [holy] days. There are indeed signs in that for every patient and grateful [servant].’\n",
        "TRANSLATION_12": "We sent Moses with Our signs (and the command). \"Bring out thy people from the depths of darkness into light, and teach them to remember the Days of Allah.\" Verily in this there are Signs for such as are firmly patient and constant,- grateful and appreciative.\n",
        "TRANSLATION_13": "And indeed We sent Musa (Moses) with Our Ayat (signs, proofs, and evidences) (saying): \"Bring out your people from darkness into light, and make them remember the annals of Allah. Truly, therein are evidences, proofs and signs for every patient, thankful (person).\"\n",
        "TRANSLATION_14": "We sent Moses with Our signs, 'Bring your nation out of darkness into the light, and remind them of the Days of Allah' Surely, in that are signs for every patient, thankful (person).\n",
        "TRANSLATION_15": "We sent Moses with Our signs: “Bring your people out of darkness into light, and remind them of the Days of God.” In that are signs for every patient and thankful person.”\n",
        "TRANSLATION_16": "And We certainly sent Moses with Our signs, [saying], \"Bring out your people from darknesses into the light and remind them of the days of Allah.\" Indeed in that are signs for everyone patient and grateful.\n",
        "TRANSLATION_17": "[14:5] And verily We sent Moses with Our signs, the nine [signs], and We said to him: ‘Bring forth your people, the Children of Israel, out of darkness, [out of] unbelief, into light, [into] faith, and remind them of the Days of God’, of His graces. Surely in that, reminder, are signs for every man enduring, in obedience [to God], thankful, for [His] graces.\n",
        "TRANSLATION_18": "(We verily sent Moses with Our revelations) the nine signs: the hand, the staff, the flood, the locusts, the lice, the frogs, blood and the drought and shortage of foodstuff, (saying: Bring your people forth) invite your people (from darkness unto light) to embrace faith and leave disbelief. (And remind them of the days of Allah) of the days when Allah sent His chastisement; it is also said that this means: remind them of the days of Allah's mercy. (Lo! Therein) in what I have mentioned (are revelations) signs (for each steadfast) in obedience, (thankful (heart)) for the blessings bestowed upon him.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "14:5",
            "31:31",
            "29:24",
            "42:33",
            "39:52",
            "30:37",
            "57:9",
            "22:17",
            "6:97",
            "29:35"
        ],
        "BIBLE": [
            "torah:exodus:36:6",
            "prophets:i%20kings:3:6",
            "writings:ii%20chronicles:35:21",
            "torah:deuteronomy:4:10",
            "prophets:ii%20kings:10:5",
            "prophets:i%20kings:3:9",
            "torah:leviticus:17:11",
            "prophets:nahum:1:14",
            "writings:daniel:6:13",
            "prophets:hosea:2:14"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:9"
        ]
    }
}