{
    "VERSE": "14:50",
    "ARABIC": "سَرَابِيلُهُم مِّن قَطِرَانٍ وَتَغْشَىٰ وُجُوهَهُمُ ٱلنَّارُ",
    "ENGLISH": {
        "TRANSLATION_0": "wearing shirts of tar, their faces enveloped in the Fire.",
        "TRANSLATION_1": "Of molten pitch shall be their garments, their faces covered with flames,\n",
        "TRANSLATION_2": "their garments shall be black as if made out of pitch, and flames of the Fire shall cover their faces\n",
        "TRANSLATION_3": "with garments of pitch and faces covered by fire.\n",
        "TRANSLATION_4": "Their cloaks will be of pitch and fire will cover their faces.\n",
        "TRANSLATION_5": "Their garments will be of Qatiran (tar), and fire will cover their faces.\n",
        "TRANSLATION_6": "Their shirts made of pitch and the fire covering their faces\n",
        "TRANSLATION_7": "of pitch their shirts, their faces enveloped by the Fire,\n",
        "TRANSLATION_8": "Their raiment of pitch, and the Fire covering their faces,\n",
        "TRANSLATION_9": "their garments shall be of pitch and the fire shall envelop their faces.\n",
        "TRANSLATION_10": "Their trouser hell be of pitch, and the Fire shall cover their faces.\n",
        "TRANSLATION_11": "their garments made of pitch, and the Fire covering their faces,\n",
        "TRANSLATION_12": "Their garments of liquid pitch, and their faces covered with Fire;\n",
        "TRANSLATION_13": "Their garments will be of pitch, and fire will cover their faces.\n",
        "TRANSLATION_14": "their garments shall be of melted tar, and their faces enveloped by the Fire.\n",
        "TRANSLATION_15": "Their garments made of tar, and the Fire covering their faces.\n",
        "TRANSLATION_16": "Their garments of liquid pitch and their faces covered by the Fire.\n",
        "TRANSLATION_17": "[14:50] their shirts [made] of pitch, because it ignites fire more intensely, and their faces are engulfed by the Fire,\n",
        "TRANSLATION_18": "(Their raiment of pitch) of black fire, like tar; it is also said that this means: their raiment are made of very hot, trickling tar, (and the Fire covering their faces).\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "14:50",
            "23:104",
            "55:15",
            "15:27",
            "27:90",
            "33:66",
            "54:48",
            "21:39",
            "55:27",
            "3:131"
        ],
        "BIBLE": [
            "writings:job:15:27",
            "prophets:ezekiel:7:18",
            "torah:exodus:10:5",
            "torah:leviticus:16:13",
            "prophets:jeremiah:51:51",
            "prophets:isaiah:59:6",
            "prophets:habakkuk:2:14",
            "writings:job:22:14",
            "prophets:ezekiel:1:11",
            "prophets:ezekiel:1:23"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:1:14",
            "Sefer%20Yetzirah:1:12",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:3:8",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:8"
        ]
    }
}