{
    "VERSE": "14:7",
    "ARABIC": "وَإِذْ تَأَذَّنَ رَبُّكُمْ لَئِن شَكَرْتُمْ لَأَزِيدَنَّكُمْ وَلَئِن كَفَرْتُمْ إِنَّ عَذَابِى لَشَدِيدٌ",
    "ENGLISH": {
        "TRANSLATION_0": "And when your Lord announced: \"If you are grateful, I will certainly give you increase, but if you are ungrateful, My punishment is severe.'\"",
        "TRANSLATION_1": "Remember, your Lord proclaimed: \"I shall give you more if you are grateful; but if you are thankless then surely My punishment is very great.\"\n",
        "TRANSLATION_2": "Also call to mind when your Lord proclaimed: \"If you give thanks, I will certainly grant you more; but if you are ungrateful for My favours, My chastisement is terrible.\n",
        "TRANSLATION_3": "Remember when your Lord said to you, 'If you give thanks, I shall give you greater (favors), but if you deny the Truth, know that My retribution is severe \".\n",
        "TRANSLATION_4": "And remember when your Lord proclaimed, “If you give thanks, I will give you more, and if you are ungrateful then (know that) My punishment is severe.”\n",
        "TRANSLATION_5": "And (remember) when your Lord proclaimed: \"If you give thanks, I will give you more; but if you are thankless, verily, My punishment is indeed severe.\"\n",
        "TRANSLATION_6": "And when your Lord made it known: If you are grateful, I would certainly give to you more, and if you are ungrateful, My chastisement is truly severe.\n",
        "TRANSLATION_7": "And when your Lord proclaimed, \"If you are thankful, surely I will increase you, but if you are thankless My chastisement is surely terrible.\"'\n",
        "TRANSLATION_8": "And when your Lord proclaimed: If ye give thanks, I will give you more; but if ye are thankless, lo! My punishment is dire.\n",
        "TRANSLATION_9": "Remember also the time when your Lord declared, 'If you are grateful, I will surely bestow more favours on you; but if you are ungrateful, then know that My punishment is severe indeed.'\"\n",
        "TRANSLATION_10": "And what time your Lord proclaimed: if ye give thanks, surely I will increase you, and if ye disbelieve, verily My torment severe.\n",
        "TRANSLATION_11": "And when your Lord proclaimed, “If you are grateful, I will surely enhance you [in blessing], but if you are ungrateful, My punishment is indeed severe.” ’\n",
        "TRANSLATION_12": "And remember! your Lord caused to be declared (publicly): \"If ye are grateful, I will add more (favours) unto you; But if ye show ingratitude, truly My punishment is terrible indeed.\"\n",
        "TRANSLATION_13": "And (remember) when your Lord proclaimed: \"If you give thanks (by accepting Faith and worshipping none but Allah), I will give you more (of My Blessings), but if you are thankless (i.e. disbelievers), verily! My Punishment is indeed severe.\"\n",
        "TRANSLATION_14": "And when your Lord proclaimed: \"If you give thanks, I will increase you, but, if you are unthankful My punishment is indeed stern.'\n",
        "TRANSLATION_15": "And when your Lord proclaimed: “If you give thanks, I will grant you increase; but if you are ungrateful, My punishment is severe.”\n",
        "TRANSLATION_16": "And [remember] when your Lord proclaimed, 'If you are grateful, I will surely increase you [in favor]; but if you deny, indeed, My punishment is severe.' \"\n",
        "TRANSLATION_17": "[14:7] And when your Lord proclaimed, [when] He made it known that: “If you are thankful, for My graces, through affirmation of [My] Oneness and obedience [to Me], then assuredly I shall give you more; but if you are thankless, [if] you deny [the truth of] the grace, through disbelief and disobedience, then assuredly I shall chastise you — as is indicated by [His following words] — My chastisement is indeed severe” ’.\n",
        "TRANSLATION_18": "(And when your Lord proclaimed) when your Lord said and informed you in the Scripture: (If ye give thanks) for your success, safety, favour and blessings, (I will give you more) success, safety, favour and blessings; (but if ye are thankless) if you do not believe me or are ungrateful for the blessings bestowed upon you, (lo! my punishment is dire) for the one who disbelieves.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "14:7",
            "52:7",
            "85:12",
            "21:46",
            "27:21",
            "44:12",
            "41:27",
            "70:27",
            "39:13",
            "6:15"
        ],
        "BIBLE": [
            "prophets:jeremiah:31:34",
            "writings:daniel:2:8",
            "prophets:i%20samuel:20:3",
            "prophets:isaiah:12:4",
            "torah:genesis:4:13",
            "prophets:isaiah:48:6",
            "prophets:i%20kings:22:16",
            "prophets:isaiah:46:10",
            "writings:ii%20chronicles:28:13",
            "prophets:i%20samuel:20:12"
        ]
    }
}