{
    "VERSE": "68:19",
    "ARABIC": "فَطَافَ عَلَيْهَا طَآئِفٌ مِّن رَّبِّكَ وَهُمْ نَآئِمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "So a visitation from your Lord came upon it while they slept",
        "TRANSLATION_1": "Then a calamity from your Lord fell upon it, but they remained fast asleep.\n",
        "TRANSLATION_2": "Thereupon a calamity from your Lord passed over it while they were asleep,\n",
        "TRANSLATION_3": "A visitor from your Lord circled around the garden during the night while they were asleep\n",
        "TRANSLATION_4": "So an envoy from your Lord completed his round upon the garden, whilst they were sleeping.\n",
        "TRANSLATION_5": "Then there passed over it a Ta'if from your Lord while they were asleep.\n",
        "TRANSLATION_6": "Then there encompassed it a visitation from your Lord while they were sleeping.\n",
        "TRANSLATION_7": "Then a visitation from thy Lord visited it, while they were sleeping,\n",
        "TRANSLATION_8": "Then a visitation from thy Lord came upon it while they slept\n",
        "TRANSLATION_9": "A calamity from your Lord befell the orchard as they slept.\n",
        "TRANSLATION_10": "Wherefore an encircling visitation visited it even as they slept on.\n",
        "TRANSLATION_11": "Then, a visitation from your Lord visited it while they were asleep.\n",
        "TRANSLATION_12": "Then there came on the (garden) a visitation from thy Lord, (which swept away) all around, while they were asleep.\n",
        "TRANSLATION_13": "Then there passed by on the (garden) something (fire) from your Lord at night and burnt it while they were asleep.\n",
        "TRANSLATION_14": "Then, a visitation from your Lord came down upon it while they slept,\n",
        "TRANSLATION_15": "But a calamity from your Lord went around it while they slept.\n",
        "TRANSLATION_16": "So there came upon the garden an affliction from your Lord while they were asleep.\n",
        "TRANSLATION_17": "[68:19] Then a visitation from your Lord visited it, [that is] a fire consumed it during the night, while they slept.\n",
        "TRANSLATION_18": "(Then a visitation) a punishment from your Lord (came upon it) upon the garden (while they slept) and was burned.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "68:19",
            "79:44",
            "75:23",
            "21:2",
            "84:5",
            "84:2",
            "89:28",
            "94:8",
            "74:7",
            "37:100"
        ],
        "BIBLE": [
            "torah:genesis:15:12",
            "prophets:judges:13:20",
            "writings:daniel:6:19",
            "prophets:ii%20samuel:2:29",
            "torah:exodus:16:13",
            "prophets:jeremiah:39:4",
            "writings:ruth:1:19",
            "prophets:joshua:6:20",
            "prophets:i%20kings:16:18",
            "torah:genesis:15:17"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:1:6"
        ]
    }
}