{
    "VERSE": "68:22",
    "ARABIC": "أَنِ ٱغْدُوا۟ عَلَىٰ حَرْثِكُمْ إِن كُنتُمْ صَٰرِمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "'Leave early for your land if you want to pick the fruit.'",
        "TRANSLATION_1": "If you want to gather the fruits, let us go early to the plantation.\"\n",
        "TRANSLATION_2": "“Hurry to your orchard if you would gather its fruit.”\n",
        "TRANSLATION_3": "Go early to your farms, if you want to pluck the fruits\".\n",
        "TRANSLATION_4": "That, “Go to your fields at early morn, if you want to harvest.”\n",
        "TRANSLATION_5": "Saying: \"Go to your tilth in the morning, if you would pluck (the fruits).\"\n",
        "TRANSLATION_6": "Saying: Go early to your tilth if you would cut (the produce).\n",
        "TRANSLATION_7": "Come forth betimes upon your tillage, if you would pluck!'\n",
        "TRANSLATION_8": "Saying: Run unto your field if ye would pluck (the fruit).\n",
        "TRANSLATION_9": "saying, \"Be quick to reach your orchard, if you want to gather all your fruits.\"\n",
        "TRANSLATION_10": "Saying: go out betimes to your tilth if ye would reap.\n",
        "TRANSLATION_11": "‘Get off early to your field if you have to gather [the fruits].’\n",
        "TRANSLATION_12": "Go ye to your tilth (betimes) in the morning, if ye would gather the fruits.\"\n",
        "TRANSLATION_13": "Saying: \"Go to your tilth in the morning, if you would pluck the fruits.\"\n",
        "TRANSLATION_14": "Come out to your tillage if you want to reap'\n",
        "TRANSLATION_15": "“Go early to your plantation, if you are going to harvest.”\n",
        "TRANSLATION_16": "[Saying], \"Go early to your crop if you would cut the fruit.\"\n",
        "TRANSLATION_17": "[68:22] [saying], ‘Go forth early to your tillage, your produce (ani’ghdū ‘alā harthikum constitutes an explication of [the import of] tanādaw, ‘they called out to one another’; otherwise, an relates to the verbal action, [to be understood as] being bi-an) if you are going to pluck’, if your intention is to pick [the fruits] (the response to the conditional is indicated by what preceded it).\n",
        "TRANSLATION_18": "(Saying: Run unto your field if ye would pluck (the fruit)) before the needy ones come to know about it.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "68:22",
            "56:87",
            "27:31",
            "68:25",
            "26:113",
            "75:25",
            "17:8",
            "37:70",
            "47:22",
            "56:16"
        ],
        "BIBLE": [
            "prophets:i%20samuel:20:11",
            "writings:psalms:83:5",
            "writings:job:24:6",
            "writings:psalms:88:17",
            "prophets:ii%20kings:7:12",
            "torah:genesis:30:16",
            "writings:nehemiah:5:3",
            "writings:ruth:2:2",
            "torah:leviticus:19:9",
            "torah:leviticus:23:22"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:3:4",
            "Sefer%20Yetzirah:5:2"
        ]
    }
}