{
    "VERSE": "68:28",
    "ARABIC": "قَالَ أَوْسَطُهُمْ أَلَمْ أَقُل لَّكُمْ لَوْلَا تُسَبِّحُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "The best of them said, 'Did I not say to you, \"Why do you not glorify Allah?'\"",
        "TRANSLATION_1": "One who was temperate among them, said: \"Did I not say: 'Why don't you priase God?'\"\n",
        "TRANSLATION_2": "The best among them said: “Did I not say to you: why do you not give glory to (your Lord)?”\n",
        "TRANSLATION_3": "A reasonable one among them said, \"Did I not tell you that you should glorify God?\"\n",
        "TRANSLATION_4": "The best among them said, “Did I not tell you, ‘Why do you not proclaim His purity?’”\n",
        "TRANSLATION_5": "The Awsat among them said; \"Did I not tell you, `Why do you not Tusabbihun.\"'\n",
        "TRANSLATION_6": "The best of them said: Did I not say to you, Why do you not glorify (Allah)?\n",
        "TRANSLATION_7": "Said the most moderate of them, 'Did I not say to you, \"Why do you not give glory?\"'\n",
        "TRANSLATION_8": "The best among them said: Said I not unto you: Why glorify ye not (Allah)?\n",
        "TRANSLATION_9": "The more upright of the two said, \"Did I not bid you to glorify God?\"\n",
        "TRANSLATION_10": "The most moderate of them said: said I not Unto you, wherefore hallow him ye not!\n",
        "TRANSLATION_11": "The most upright among them said, ‘Did I not tell you, ‘‘Why do you not glorify [Allah]?’’ ’\n",
        "TRANSLATION_12": "Said one of them, more just (than the rest): \"Did I not say to you, 'Why not glorify (Allah)?'\"\n",
        "TRANSLATION_13": "The best among them said: \"Did I not tell you: why do you not say: Insha' Allah (If Allah will).\"\n",
        "TRANSLATION_14": "(Whereupon) the best among them said: 'Did I not say to you to exalt (Allah)'\n",
        "TRANSLATION_15": "The most reasonable of them said, “Did I not say to you, ‘if only you would glorify?’”\n",
        "TRANSLATION_16": "The most moderate of them said, \"Did I not say to you, 'Why do you not exalt [Allah]?' \"\n",
        "TRANSLATION_17": "[68:28] The most moderate, the best one, among them said, ‘Did I not say to you, “Why do you not glorify?” ’, God, repenting [to Him].\n",
        "TRANSLATION_18": "(The best among them) in intellect and opinion; and it is also said this means: the older one of them; and it 684 is also said: the most upright among them (said: Said I not unto you: Why glorify ye not (Allah)) why not say: Allah willing? He said this when they made their vow.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "68:28",
            "26:106",
            "26:161",
            "37:25",
            "37:92",
            "37:29",
            "61:2",
            "90:8",
            "26:25",
            "37:124"
        ],
        "BIBLE": [
            "writings:ii%20chronicles:18:17",
            "prophets:i%20kings:22:18",
            "prophets:isaiah:28:12",
            "prophets:ii%20kings:4:28",
            "prophets:jeremiah:13:12",
            "prophets:joshua:7:19",
            "torah:genesis:2:18",
            "prophets:jeremiah:6:16",
            "torah:numbers:22:37",
            "torah:exodus:33:14"
        ]
    }
}