{
    "VERSE": "68:29",
    "ARABIC": "قَالُوا۟ سُبْحَٰنَ رَبِّنَآ إِنَّا كُنَّا ظَٰلِمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "They said, 'Glory be to our Lord! Truly we have been wrongdoers.'",
        "TRANSLATION_1": "Glory to our Lord,\" they said; we were really in the wrong.\"\n",
        "TRANSLATION_2": "They cried out: “Glory be to our Lord! Certainly we were sinners.”\n",
        "TRANSLATION_3": "They said, \"All glory belongs to God. We have certainly been unjust\".\n",
        "TRANSLATION_4": "They said, “Purity is to our Lord – we have indeed been unjust.”\n",
        "TRANSLATION_5": "They said: \"Glory to Our Lord! Verily, we have been wrongdoers.\"\n",
        "TRANSLATION_6": "They said: Glory be to our Lord, surely we were unjust.\n",
        "TRANSLATION_7": "They said, 'Glory be to God, our Lord; truly, we were evildoers.'\n",
        "TRANSLATION_8": "They said: Glorified be our Lord! Lo! we have been wrong-doers.\n",
        "TRANSLATION_9": "They said, \"Glory be to God, our Lord. We have surely done wrong.\"\n",
        "TRANSLATION_10": "They said: hallowed be Our Lord! verily we have been wrong- doers.\n",
        "TRANSLATION_11": "They said, ‘Immaculate is our Lord! We have indeed been wrongdoers!’\n",
        "TRANSLATION_12": "They said: \"Glory to our Lord! Verily we have been doing wrong!\"\n",
        "TRANSLATION_13": "They said: \"Glory to Our Lord! Verily, we have been Zalimun (wrong-doers, etc.).\"\n",
        "TRANSLATION_14": "Exaltations to Allah, our Lord' they said, 'We were truly harmdoers'\n",
        "TRANSLATION_15": "They said, “Glory to our Lord—We were indeed in the wrong.”\n",
        "TRANSLATION_16": "They said, \"Exalted is our Lord! Indeed, we were wrongdoers.\"\n",
        "TRANSLATION_17": "[68:29] They said, ‘Glory be to God, our Lord. Verily we have been wrongdoers’, by denying the poor folk [what is] their due.\n",
        "TRANSLATION_18": "(They said: Glorified be our Lord!) We ask forgiveness of our Lord. (Lo! we have been wrong-doers) we harmed ourselves by our transgression and intention to deprive the needy ones and also by failing to say \"Allah willing\".\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "68:29",
            "7:125",
            "17:108",
            "26:12",
            "36:16",
            "37:180",
            "37:31",
            "23:107",
            "20:45",
            "26:50"
        ],
        "BIBLE": [
            "prophets:joshua:7:20",
            "writings:psalms:31:15",
            "torah:genesis:18:20",
            "prophets:judges:10:10",
            "torah:numbers:12:13",
            "torah:leviticus:8:5",
            "prophets:isaiah:25:9",
            "prophets:jeremiah:4:10",
            "prophets:i%20kings:17:20",
            "torah:genesis:40:8"
        ]
    }
}