{
    "VERSE": "68:32",
    "ARABIC": "عَسَىٰ رَبُّنَآ أَن يُبْدِلَنَا خَيْرًا مِّنْهَآ إِنَّآ إِلَىٰ رَبِّنَا رَٰغِبُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Maybe our Lord will give us something better than it in exchange. We entreat our Lord.'",
        "TRANSLATION_1": "Maybe our Lord will give us better than this. We turn to our Lord in supplication.\"\n",
        "TRANSLATION_2": "Maybe our Lord will give us a better orchard in its place; to our Lord do we penitently turn.”\n",
        "TRANSLATION_3": "Perhaps our Lord will replace it with a better garden. We turn in repentance to our Lord\".\n",
        "TRANSLATION_4": "“Hopefully, our Lord will give us a better replacement than this – we now incline towards our Lord.”\n",
        "TRANSLATION_5": "We hope that our Lord will give us in exchange better than it. Truly, we hope in our Lord.\"\n",
        "TRANSLATION_6": "Maybe, our Lord will give us instead one better than it; surely to our Lord do we make our humble petition.\n",
        "TRANSLATION_7": "It may be that our Lord will give us in exchange a better than it; to our Lord we humbly turn.'\n",
        "TRANSLATION_8": "It may be that our Lord will give us better than this in place thereof. Lo! we beseech our Lord.\n",
        "TRANSLATION_9": "May be our Lord will give us a better orchard in its stead; we turn to Him.\"\n",
        "TRANSLATION_10": "Belike our Lord may exchange for us better garden than this; verily we are Unto our Lord beseechers.\n",
        "TRANSLATION_11": "Maybe our Lord will give us a better one in its place. Indeed we earnestly beseech our Lord.’\n",
        "TRANSLATION_12": "It may be that our Lord will give us in exchange a better (garden) than this: for we do turn to Him (in repentance)!\"\n",
        "TRANSLATION_13": "We hope that our Lord will give us in exchange a better (garden) than this. Truly, we turn to our Lord (wishing for good that He may forgive our sins, and reward us in the Hereafter).\"\n",
        "TRANSLATION_14": "It may be that our Lord will give us better than it in exchange. To our Lord we humbly turn'\n",
        "TRANSLATION_15": "Perhaps our Lord will give us a better substitute for it. We are turning to our Lord.”\n",
        "TRANSLATION_16": "Perhaps our Lord will substitute for us [one] better than it. Indeed, we are toward our Lord desirous.\"\n",
        "TRANSLATION_17": "[68:32]   It may be that our Lord will give us in its place (read yubaddilanā or yubdilanā) one that is better than it. Truly we turn humbly to our Lord’, that He might accept our repentance and give us back [a garden that is] better than our garden — it is reported that they were indeed given a better one in its place.\n",
        "TRANSLATION_18": "(It may be) and \"may be\" when used in connection with Allah denotes necessity (that our Lord will give us) in the Hereafter in exchange (better than this in place thereof) better than this garden. (Lo! we beseech our Lord) our desire is with Allah.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "68:32",
            "7:125",
            "23:107",
            "20:45",
            "26:12",
            "23:29",
            "23:118",
            "26:50",
            "75:23",
            "36:16"
        ],
        "BIBLE": [
            "prophets:jeremiah:19:12",
            "prophets:i%20kings:8:33",
            "prophets:jeremiah:15:11",
            "writings:ii%20chronicles:6:24",
            "prophets:isaiah:13:13",
            "prophets:amos:9:14",
            "prophets:zephaniah:3:20",
            "writings:job:41:20",
            "prophets:nahum:1:8",
            "prophets:jeremiah:31:13"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:1:3"
        ]
    }
}