{
    "VERSE": "68:34",
    "ARABIC": "إِنَّ لِلْمُتَّقِينَ عِندَ رَبِّهِمْ جَنَّٰتِ ٱلنَّعِيمِ",
    "ENGLISH": {
        "TRANSLATION_0": "The people who have taqwa will have Gardens of Delight with their Lord.",
        "TRANSLATION_1": "For those who fear God there are pleasure gardens with their Lord.\n",
        "TRANSLATION_2": "Surely the God-fearing shall have Gardens of bliss with their Lord.\n",
        "TRANSLATION_3": "The pious ones will receive a beautiful Paradise from their Lord.\n",
        "TRANSLATION_4": "Indeed for the pious, with their Lord, are Gardens of Serenity.\n",
        "TRANSLATION_5": "Verily, for those who have Taqwa are Gardens of Delight with their Lord.\n",
        "TRANSLATION_6": "Surely those who guard (against evil) shall have with their Lord gardens of bliss.\n",
        "TRANSLATION_7": "Surely for the godfearing shall be Gardens of Bliss with their Lord.\n",
        "TRANSLATION_8": "Lo! for those who keep from evil are gardens of bliss with their Lord.\n",
        "TRANSLATION_9": "Those who are mindful of their Lord will be rewarded with gardens of bliss.\n",
        "TRANSLATION_10": "Verily for the God-fearing, are with their Lord Gardens of Delight.\n",
        "TRANSLATION_11": "Indeed for the Godwary there will be gardens of bliss near their Lord.\n",
        "TRANSLATION_12": "Verily, for the Righteous, are Gardens of Delight, in the Presence of their Lord.\n",
        "TRANSLATION_13": "Verily, for the Muttaqun (pious and righteous persons - see V. 2:2) are Gardens of delight (Paradise) with their Lord.\n",
        "TRANSLATION_14": "Surely, the cautious shall have Gardens of Bliss with their Lord.\n",
        "TRANSLATION_15": "For the righteous are Gardens of Delight with their Lord.\n",
        "TRANSLATION_16": "Indeed, for the righteous with their Lord are the Gardens of Pleasure.\n",
        "TRANSLATION_17": "[68:34] Verily for the God-fearing there will be the Gardens of Bliss near their Lord.\n",
        "TRANSLATION_18": "(Lo! for those who keep from evil) for those who ward off disbelief, idolatry and indecencies (are Gardens of Bliss) whose bliss is continuous and eternal (with their Lord) in the Hereafter.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "68:34",
            "51:34",
            "31:8",
            "52:17",
            "56:12",
            "37:43",
            "10:9",
            "43:49",
            "39:34",
            "26:85"
        ],
        "BIBLE": [
            "writings:psalms:24:5",
            "writings:psalms:5:5",
            "writings:psalms:140:14",
            "torah:deuteronomy:3:22",
            "prophets:ezekiel:5:11",
            "prophets:ezekiel:11:8",
            "torah:deuteronomy:10:17",
            "writings:psalms:146:2",
            "writings:psalms:104:33",
            "writings:psalms:49:16"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:1:13",
            "Sefer%20Yetzirah:6:3"
        ]
    }
}