{
    "VERSE": "68:4",
    "ARABIC": "وَإِنَّكَ لَعَلَىٰ خُلُقٍ عَظِيمٍ",
    "ENGLISH": {
        "TRANSLATION_0": "Indeed you are truly vast in character.",
        "TRANSLATION_1": "For you are verily born of sublime nature.\n",
        "TRANSLATION_2": "and you are certainly on the most exalted standard of moral excellence.\n",
        "TRANSLATION_3": "You have attained a high moral standard.\n",
        "TRANSLATION_4": "And indeed you possess an exemplary character.\n",
        "TRANSLATION_5": "And verily, you are on an exalted character.\n",
        "TRANSLATION_6": "And most surely you conform (yourself) to sublime morality.\n",
        "TRANSLATION_7": "surely thou art upon a mighty morality.\n",
        "TRANSLATION_8": "And lo! thou art of a tremendous nature.\n",
        "TRANSLATION_9": "For you are truly of a sublime character.\n",
        "TRANSLATION_10": "And verily thou art of a high and noble disposition.\n",
        "TRANSLATION_11": "and indeed you possess a great character.\n",
        "TRANSLATION_12": "And thou (standest) on an exalted standard of character.\n",
        "TRANSLATION_13": "And verily, you (O Muhammad SAW) are on an exalted standard of character.\n",
        "TRANSLATION_14": "Surely, you (Prophet Muhammad) are of a great morality.\n",
        "TRANSLATION_15": "And you are of a great moral character.\n",
        "TRANSLATION_16": "And indeed, you are of a great moral character.\n",
        "TRANSLATION_17": "[68:4] And assuredly you possess a magnificent nature, [a magnificent] religion.\n",
        "TRANSLATION_18": "(And lo! thou art) O Muhammad (of a tremendous nature) following a noble religion which is honoured by Allah; it is also said this means: you have great character traits with which Allah has honoured you.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "68:4",
            "17:49",
            "56:76",
            "17:98",
            "36:78",
            "37:53",
            "37:16",
            "56:46",
            "37:60",
            "56:47"
        ],
        "BIBLE": [
            "prophets:jeremiah:10:6",
            "writings:psalms:92:9",
            "prophets:isaiah:45:15",
            "torah:deuteronomy:9:1",
            "writings:psalms:40:10",
            "writings:psalms:104:1",
            "writings:psalms:119:151",
            "writings:psalms:36:7",
            "writings:psalms:71:19",
            "writings:lamentations:2:20"
        ]
    }
}