{
    "VERSE": "68:46",
    "ARABIC": "أَمْ تَسْـَٔلُهُمْ أَجْرًا فَهُم مِّن مَّغْرَمٍ مُّثْقَلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Or do you ask them for a wage so they are weighed down with debt?",
        "TRANSLATION_1": "Do you ask for any compensation from them that they are burdened with want?\n",
        "TRANSLATION_2": "Or are you asking them for some compensation so that they feel burdened with debt?\n",
        "TRANSLATION_3": "(Muhammad), do you ask for your preaching any recompense which is too heavy a price for them to pay?\n",
        "TRANSLATION_4": "Or is it that you (O dear Prophet Mohammed – peace and blessings be upon him) ask any fee from them, so they are burdened with the penalty?\n",
        "TRANSLATION_5": "Or is it that you ask them a wage, so that they are heavily burdened with debt\n",
        "TRANSLATION_6": "Or do you ask from them a reward, so that they are burdened with debt?\n",
        "TRANSLATION_7": "Or askest thou them for a wage, and so they are weighed down with debt?\n",
        "TRANSLATION_8": "Or dost thou (Muhammad) ask a fee from them so that they are heavily taxed?\n",
        "TRANSLATION_9": "Do you demand some recompense from them that would weigh them down with debt?\n",
        "TRANSLATION_10": "Askest thou a hire from them so that they are laden with debt?\n",
        "TRANSLATION_11": "Do you ask them for a reward, so that they are weighed down with debt?\n",
        "TRANSLATION_12": "Or is it that thou dost ask them for a reward, so that they are burdened with a load of debt?-\n",
        "TRANSLATION_13": "Or is it that you (O Muhammad SAW) ask them a wage, so that they are heavily burdened with debt?\n",
        "TRANSLATION_14": "Or, do you ask them for a wage, so that they are burdened withdebt?\n",
        "TRANSLATION_15": "Or do you ask them for a fee, so they are burdened with debt?\n",
        "TRANSLATION_16": "Or do you ask of them a payment, so they are by debt burdened down?\n",
        "TRANSLATION_17": "[68:46] Or are you asking them a fee, in return for delivering the Message, so that they are weighed down with debt?, [so that they are weighed down] with what they will [have to] give you, and that is why they do not believe.\n",
        "TRANSLATION_18": "(Or dost thou (Muhammad) ask a fee) or provision in exchange for faith (from them) from the people of Mecca (so that they are heavily taxed) they are too much indebted by accepting your invitation to accept faith?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "52:40",
            "68:46",
            "95:6",
            "38:86",
            "41:8",
            "36:21",
            "12:104",
            "84:25",
            "51:45",
            "43:79"
        ],
        "BIBLE": [
            "prophets:jeremiah:23:33",
            "writings:ruth:2:12",
            "writings:psalms:40:6",
            "prophets:isaiah:48:18",
            "writings:daniel:10:19",
            "torah:deuteronomy:33:23",
            "writings:lamentations:2:20",
            "prophets:isaiah:46:1",
            "prophets:jeremiah:12:1",
            "prophets:i%20kings:14:6"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:2:2",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:5:1"
        ]
    }
}