{
    "VERSE": "68:51",
    "ARABIC": "وَإِن يَكَادُ ٱلَّذِينَ كَفَرُوا۟ لَيُزْلِقُونَكَ بِأَبْصَٰرِهِمْ لَمَّا سَمِعُوا۟ ٱلذِّكْرَ وَيَقُولُونَ إِنَّهُۥ لَمَجْنُونٌ",
    "ENGLISH": {
        "TRANSLATION_0": "Those who are kafir all but strike you down with their evil looks when they hear the Reminder and say, 'He is quite mad.'",
        "TRANSLATION_1": "But the unbelievers would like to stare you out of balance when they hear the warning, and say: \"Surely he is possessed;\"\n",
        "TRANSLATION_2": "When the unbelievers hear this Exhortation, they look at you as though they would knock you off your feet with their (hostile) glances. They say: “Surely he is afflicted with madness”;\n",
        "TRANSLATION_3": "When the disbelievers listen to you reciting the Quran they almost try to destroy you with their piercing eyes. Then they say, \"He is certainly insane\".\n",
        "TRANSLATION_4": "And indeed the disbelievers seem as if they would topple you with their evil gaze when they hear the Qur’an, and they say, “He is indeed insane.”\n",
        "TRANSLATION_5": "And verily, those who disbelieve would almost make you slip with their eyes (through hatred) when they hear the Reminder (the Qur'an), and they say: \"Verily, he is a madman!\"\n",
        "TRANSLATION_6": "And those who disbelieve would almost smite you with their eyes when they hear the reminder, and they say: Most surely he is mad.\n",
        "TRANSLATION_7": "The unbelievers wellnigh strike thee down with their glances, when they hear the Reminder, and they say, 'Surely he is a man possessed!'\n",
        "TRANSLATION_8": "And lo! those who disbelieve would fain disconcert thee with their eyes when they hear the Reminder, and they say: Lo! he is indeed mad;\n",
        "TRANSLATION_9": "When those who deny the truth hear the admonition, they would almost cause you to stumble with their evil eyes; and they say, \"He is certainly mad.\"\n",
        "TRANSLATION_10": "And those who disbelieve well-nigh cause thee to stumble with their looks when they hear the Admonition, and they say: verily he is mad.\n",
        "TRANSLATION_11": "Indeed the faithless almost devour you with their eyes when they hear this Reminder, and they say, ‘He is indeed crazy.’\n",
        "TRANSLATION_12": "And the Unbelievers would almost trip thee up with their eyes when they hear the Message; and they say: \"Surely he is possessed!\"\n",
        "TRANSLATION_13": "And verily, those who disbelieve would almost make you slip with their eyes through hatredness when they hear the Reminder (the Quran), and they say: \"Verily, he (Muhammad SAW) is a madman!\"\n",
        "TRANSLATION_14": "When the unbelievers hear the Reminder, they nearly strike you down with their glances, and say: 'Surely, he is mad'\n",
        "TRANSLATION_15": "Those who disbelieve almost stab you with their glances when they hear the message, and say, “He is crazy!”\n",
        "TRANSLATION_16": "And indeed, those who disbelieve would almost make you slip with their eyes when they hear the message, and they say, \"Indeed, he is mad.\"\n",
        "TRANSLATION_17": "[68:51] Indeed those who disbelieve would almost throw you down [to the ground] (read la-yuzliqūnaka or layazliqūnaka) with their looks, looking at you in a severe way, almost hurling you to the ground or making you fall from your place, when they hear the Reminder, the Qur’ān, and they say, out of envy: ‘He is truly a madman!’, on account of the Qur’ān that he has brought.\n",
        "TRANSLATION_18": "(And lo! those who disbelieve) the disbelievers of Mecca (would fain disconcert thee) would kill you (with their eyes) and it is said this means: they would give you the evil eye (when they hear the Reminder) when they hear you recite the Qur'an, (and they) i.e. the people of Mecca (say: Lo! he is) i.e. Muhammad (indeed mad) bewitched;\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "68:51",
            "15:6",
            "20:35",
            "41:41",
            "11:112",
            "7:6",
            "23:74",
            "75:7",
            "53:17",
            "29:9"
        ],
        "BIBLE": [
            "prophets:isaiah:3:16",
            "prophets:jeremiah:15:11",
            "prophets:ii%20kings:7:19",
            "torah:deuteronomy:32:35",
            "prophets:ii%20kings:7:2",
            "prophets:judges:8:24",
            "torah:genesis:2:18",
            "prophets:ezekiel:24:17",
            "prophets:amos:6:10",
            "torah:numbers:14:12"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:3",
            
            "Sefer%20Yetzirah:4:5"
        ]
    }
}