{
    "VERSE": "68:52",
    "ARABIC": "وَمَا هُوَ إِلَّا ذِكْرٌ لِّلْعَٰلَمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "But it is nothing less than a Reminder to all the worlds,",
        "TRANSLATION_1": "Whilst it is no more than reminder for the people of the world.\n",
        "TRANSLATION_2": "although this is nothing but an Exhortation (to goodness) for everyone in the world.\n",
        "TRANSLATION_3": "The Quran is nothing but a reminder from God to mankind.\n",
        "TRANSLATION_4": "Whereas it is not but an advice to the entire creation!\n",
        "TRANSLATION_5": "But it is nothing else than a Reminder to all the creatures (`Alamin).\n",
        "TRANSLATION_6": "And it is naught but a reminder to the nations.\n",
        "TRANSLATION_7": "And it is nothing but a Reminder unto all beings.\n",
        "TRANSLATION_8": "When it is naught else than a Reminder to creation.\n",
        "TRANSLATION_9": "Yet it is purely an admonition to mankind.\n",
        "TRANSLATION_10": "While it is naught but an admonition Unto the worlds.\n",
        "TRANSLATION_11": "Yet it is just a reminder for all the nations.\n",
        "TRANSLATION_12": "But it is nothing less than a Message to all the worlds.\n",
        "TRANSLATION_13": "But it is nothing else than a Reminder to all the 'Alamin (mankind, jinns and all that exists).\n",
        "TRANSLATION_14": "But it is nothing other than a Reminder for all the worlds.\n",
        "TRANSLATION_15": "But it is no less than a reminder to all the Worlds.\n",
        "TRANSLATION_16": "But it is not except a reminder to the worlds.\n",
        "TRANSLATION_17": "[68:52]   Yet it, namely, the Qur’ān, is just a Reminder, an admonition, for all the worlds, of [both] humans and jinn, and cannot be the cause of any dementia.\n",
        "TRANSLATION_18": "(When it is) i.e. the Qur'an (naught else than a Reminder to creation) to the jinn and humankind'. And of the surah in which Reality is mentioned, which is all Meccan and consists of 50 verses, 256 words and 1,480 letters: Surah 69: Reality (al-Haqqah) And of the surah in which Reality is mentioned, which is all Meccan and consists of 50 verses, 256 words and 1,480 letters:\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "68:52",
            "81:27",
            "38:87",
            "21:107",
            "12:104",
            "81:29",
            "26:77",
            "15:70",
            "43:20",
            "2:131"
        ],
        "BIBLE": [
            "writings:psalms:96:10",
            "prophets:isaiah:34:1",
            "writings:i%20chronicles:16:26",
            "writings:psalms:96:5",
            "writings:nehemiah:13:26",
            "writings:psalms:9:9",
            "writings:psalms:49:2",
            "prophets:habakkuk:2:5",
            "writings:psalms:33:12",
            "prophets:ezekiel:36:14"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:3:5",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:14",
            "Sefer%20Yetzirah:2:5"
        ]
    }
}