{
    "VERSE": "68:9",
    "ARABIC": "وَدُّوا۟ لَوْ تُدْهِنُ فَيُدْهِنُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "They wish that you would conciliate them, then they too would be conciliating.",
        "TRANSLATION_1": "They only want that you should relent, so that they may come to terms.\n",
        "TRANSLATION_2": "they would wish you to be pliant so that they too may be pliant.\n",
        "TRANSLATION_3": "They would like you to relent to them so that they could also relent towards you.\n",
        "TRANSLATION_4": "They wish that in some way you may yield, so they too might soften their stand.\n",
        "TRANSLATION_5": "They wish that you should compromise with them, so they (too) would compromise with you.\n",
        "TRANSLATION_6": "They wish that you should be pliant so they (too) would be pliant.\n",
        "TRANSLATION_7": "They wish that thou shouldst compromise, then they would compromise.\n",
        "TRANSLATION_8": "Who would have had thee compromise, that they may compromise.\n",
        "TRANSLATION_9": "They want you to make concessions to them and then they will reciprocate.\n",
        "TRANSLATION_10": "Fain would they that thou shouldst be pliant, so that they will be pliant.\n",
        "TRANSLATION_11": "who are eager that you should be flexible, so that they [too] may be flexible [towards you].\n",
        "TRANSLATION_12": "Their desire is that thou shouldst be pliant: so would they be pliant.\n",
        "TRANSLATION_13": "They wish that you should compromise (in religion out of courtesy) with them, so they (too) would compromise with you.\n",
        "TRANSLATION_14": "they wish you would compromise, then, they would compromise.\n",
        "TRANSLATION_15": "They would like you to compromise, so they would compromise.\n",
        "TRANSLATION_16": "They wish that you would soften [in your position], so they would soften [toward you].\n",
        "TRANSLATION_17": "[68:9] They desire, they yearn, that (law relates to the verbal action) you should be pliable, [that] you should yield to them, so that they may be pliable [towards you], [so that] they may yield to you (fa-yudhinūna is a supplement to tudhinu, ‘you should be pliable’, but if it is understood to be the response to the optative clause of waddū, ‘they yearn’, then [a free standing pronoun] hum should be read as implied before it after the fā’ [sc. fa-hum yudhinūna]).\n",
        "TRANSLATION_18": "(Who would have had you) who would wish you to (compromise, that they may compromise) i.e. who would wish that you lean towards them so that they would lean towards you; it is also said that this means: who would wish that you agree with them so that they agree with you and that you flatter them so that they would flatter you.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "68:9",
            "68:23",
            "79:23",
            "74:2",
            "80:21",
            "69:30",
            "26:73",
            "15:84",
            "77:36",
            "54:29"
        ],
        "BIBLE": [
            "writings:daniel:10:14",
            "torah:deuteronomy:20:12",
            "torah:deuteronomy:13:15",
            "writings:job:40:28",
            "torah:exodus:34:12",
            "prophets:jeremiah:3:16",
            "prophets:ezekiel:29:12",
            "torah:exodus:30:37",
            "prophets:ezekiel:45:20",
            "torah:leviticus:25:9"
        ]
    }
}