{
    "VERSE": "65:10",
    "ARABIC": "أَعَدَّ ٱللَّهُ لَهُمْ عَذَابًا شَدِيدًا فَٱتَّقُوا۟ ٱللَّهَ يَٰٓأُو۟لِى ٱلْأَلْبَٰبِ ٱلَّذِينَ ءَامَنُوا۟ قَدْ أَنزَلَ ٱللَّهُ إِلَيْكُمْ ذِكْرًا",
    "ENGLISH": {
        "TRANSLATION_0": "Allah has prepared a terrible punishment for them. So have taqwa of Allah, people of intelligence - those who have iman - Allah has sent down a reminder to you,",
        "TRANSLATION_1": "God has prepared for them severe punishment. So, you men of wisdom, and those who believe, take heed for yourselves and fear God. God has indeed sent down a Reminder for you,\n",
        "TRANSLATION_2": "Allah has laid in store for them a grievous chastisement. So fear Allah, O people of understanding who have attained to faith. Allah has sent down to you an Exhortation,\n",
        "TRANSLATION_3": "God has prepared severe retribution for them. People of understanding and believers, have fear of God. God has certainly sent you a reminder,\n",
        "TRANSLATION_4": "Allah has kept prepared a severe punishment for them – therefore fear Allah, O men of intellect! O People who Believe! Allah has sent down a Remembrance (or an honour) for you. (The Holy Prophet is a Remembrance from Allah.)\n",
        "TRANSLATION_5": "Allah has prepared for them a severe torment. So have Taqwa of Allah, O men of understanding, those who believe! Allah has indeed sent down to you a Reminder.\n",
        "TRANSLATION_6": "Allah has prepared for them severe chastisement, therefore be careful of (your duty to) Allah, O men of understanding who believe! Allah has indeed revealed to you a reminder,\n",
        "TRANSLATION_7": "God prepared for them a terrible chastisement. So fear God, O men possessed of minds! Believers, God has sent down to you, for a remembrance,\n",
        "TRANSLATION_8": "Allah hath prepared for them stern punishment; so keep your duty to Allah, O men of understanding! O ye who believe! Now Allah hath sent down unto you a reminder,\n",
        "TRANSLATION_9": "God has prepared a severe punishment for them. So, fear God, O men of understanding, who have believed. God has sent down to you a Reminder\n",
        "TRANSLATION_10": "Allah hath gotten ready for them a grievous torment; so fear Allah, O men of understanding! those who have believed. Surely He hath sent down Unto you an admonition.\n",
        "TRANSLATION_11": "Allah has prepared for them a severe punishment. So be wary of Allah, O you who possess intellect and have faith! Allah has already sent down to you a reminder,\n",
        "TRANSLATION_12": "Allah has prepared for them a severe Punishment (in the Hereafter). Therefore fear Allah, O ye men of understanding - who have believed!- for Allah hath indeed sent down to you a Message,-\n",
        "TRANSLATION_13": "Allah has prepared for them a severe torment. So fear Allah and keep your duty to Him, O men of understanding who have believed! - Allah has indeed sent down to you a Reminder (this Quran).\n",
        "TRANSLATION_14": "Allah has prepared a severe punishment for them. So those possessing understanding fear Allah. Believers, Allah has sent this down for you as a Reminder,\n",
        "TRANSLATION_15": "God has prepared for them a severe retribution. So beware of God, O you who possess intellect and have faith. God has sent down to you a Reminder.\n",
        "TRANSLATION_16": "Allah has prepared for them a severe punishment; so fear Allah, O you of understanding who have believed. Allah has sent down to you the Qur'an.\n",
        "TRANSLATION_17": "[65:10] God has prepared for them a severe chastisement (the reiteration of the threat is for emphasis). So fear God, O people of pith, O possessors of intellect, [you] who believe! (this is a description of the vocative, or an explication of it) God has certainly revealed to you a [source of] remembrance, that is, the Qur’ān;\n",
        "TRANSLATION_18": "(Allah hath prepared for them) in the Hereafter (stern punishment) an intense punishment, one kind of punishment after the other; (so keep your duty to Allah) so fear Allah, (0 men of understanding) you who possess intellect among people! (0 ye who believe) in Muhammad (pbuh) and the Qur'an! (Now Allah hath sent down unto you a reminder) a reminder with the Messenger,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "65:10",
            "58:15",
            "50:26",
            "40:45",
            "14:2",
            "39:18",
            "48:16",
            "42:26",
            "7:164",
            "88:24"
        ],
        "BIBLE": [
            "writings:daniel:9:15",
            "writings:proverbs:4:7",
            "prophets:jeremiah:48:36",
            "prophets:isaiah:26:15",
            "prophets:ezekiel:28:4",
            "torah:deuteronomy:32:6",
            "torah:exodus:15:16",
            "writings:job:34:10",
            "prophets:isaiah:29:14",
            "writings:ecclesiastes:1:16"
        ]
    }
}