{
    "VERSE": "65:12",
    "ARABIC": "ٱللَّهُ ٱلَّذِى خَلَقَ سَبْعَ سَمَٰوَٰتٍ وَمِنَ ٱلْأَرْضِ مِثْلَهُنَّ يَتَنَزَّلُ ٱلْأَمْرُ بَيْنَهُنَّ لِتَعْلَمُوٓا۟ أَنَّ ٱللَّهَ عَلَىٰ كُلِّ شَىْءٍ قَدِيرٌ وَأَنَّ ٱللَّهَ قَدْ أَحَاطَ بِكُلِّ شَىْءٍ عِلْمًۢا",
    "ENGLISH": {
        "TRANSLATION_0": "It is Allah who created the seven heavens and of the earth the same number, the Command descending down through all of them, so that you might know that Allah has power over all things and that Allah encompasses all things in His knowledge.",
        "TRANSLATION_1": "It is God who created several skies, and as many earths. The commandment is sent down among them so that you may know that God has power over everything, and everything is held within the knowledge of God.\n",
        "TRANSLATION_2": "Allah it is He Who created seven heavens, and, like them, the earth. His commandment descends among them. (All this is being stated so that you know) that Allah has power over everything, and that Allah encompasses all things in His knowledge.\n",
        "TRANSLATION_3": "It is God who has created the seven heavens and a like number of earths. His commandments are sent between them, so that you would know that God has power over all things and that His knowledge encompasses all.\n",
        "TRANSLATION_4": "It is Allah Who has created the seven heavens, and seven earthly worlds like them; the command descends within them, so that you may know that Allah is Able to do all things, and that Allah’s knowledge encompasses everything.\n",
        "TRANSLATION_5": "It is Allah Who has created seven heavens and of the earth the like thereof. His command descends between them, that you may know that Allah has power over all things, and that Allah surrounds all things with (His) knowledge.\n",
        "TRANSLATION_6": "Allah is He Who created seven heavens, and of the earth the like of them; the decree continues to descend among them, that you may know that Allah has power over all things and that Allah indeed encompasses all things in (His) knowledge.\n",
        "TRANSLATION_7": "It is God who created seven heavens, and of earth their like, between them the Command descending, that you may know that God is powerful over everything and that God encompasses everything in knowledge.\n",
        "TRANSLATION_8": "Allah it is who hath created seven heavens, and of the earth the like thereof. The commandment cometh down among them slowly, that ye may know that Allah is Able to do all things, and that Allah surroundeth all things in knowledge.\n",
        "TRANSLATION_9": "It is God who created the seven heavens and the same number of earths. His commandment descends among them, so that you may know that God has power over all things;  and that He encompasses all things with His knowledge.\n",
        "TRANSLATION_10": "Allah it is Who hath created seven heavens, and of the earth the like thereof; the commandment cometh down between them, that ye may know that Allah is over everything Potent, and that Allah! He encompasseth everything in knowledge.\n",
        "TRANSLATION_11": "It is Allah who has created seven heavens, and of the earth [a number] similar to them. The command gradually descends through them, that you may know that Allah has power over all things, and that Allah comprehends all things in knowledge.\n",
        "TRANSLATION_12": "Allah is He Who created seven Firmaments and of the earth a similar number. Through the midst of them (all) descends His Command: that ye may know that Allah has power over all things, and that Allah comprehends, all things in (His) Knowledge.\n",
        "TRANSLATION_13": "It is Allah Who has created seven heavens and of the earth the like thereof (i.e. seven). His Command descends between them (heavens and earth), that you may know that Allah has power over all things, and that Allah surrounds (comprehends) all things in (His) Knowledge.\n",
        "TRANSLATION_14": "It is Allah who has created the seven heavens, and of the earth their like, and the Command descends between them so that you know Allah is powerful over all things, and that Allah encompasses everything in knowledge.\n",
        "TRANSLATION_15": "God is He Who created seven heavens, and their like of earth. The command descends through them, so that you may know that God is Capable of everything, and that God Encompasses everything in knowledge.\n",
        "TRANSLATION_16": "It is Allah who has created seven heavens and of the earth, the like of them. [His] command descends among them so you may know that Allah is over all things competent and that Allah has encompassed all things in knowledge.\n",
        "TRANSLATION_17": "[65:12] God it is Who created seven heavens, and of earth the like thereof, that is to say, seven earths. The command, the revelation, descends between them, between the heavens and the earth: Gabriel descends with it from the seventh heaven to the seventh earth, that you may know (li-ta‘lamū is semantically connected to an omitted clause, that is to say, ‘He apprises you of this creation and this sending down [that you may know]’), that God has power over all things and that God encompasses all things in knowledge. Medinese, consists of 12 verses.\n",
        "TRANSLATION_18": "675 (Allah it is Who hath created seven heavens) one above the other like a dome, (and of the earth the like thereof) seven earths but they are flat. (The commandment cometh down among them slowly) He says: He sends the angels down from heaven with revelation, Scripture and calamities, (that ye may know) and acknowledge (that Allah is Able to do all things) relating to the dwellers of the heavens and the earths, (and that Allah surroundeth all things in knowledge) and that His knowledge encompasses everything'. And of the surah in which Banning is mentioned, which is all Medinan and consists of 13 verses, 249 words and 1,060 letters: Surah 66: Banning [al-Tahrim) And of the surah in which Banning is mentioned, which is all Medinan and consists of 13 verses, 249 words and 1,060 letters:\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "65:12",
            "5:120",
            "3:29",
            "49:16",
            "5:40",
            "3:189",
            "5:17",
            "2:284",
            "64:1",
            "46:33"
        ],
        "BIBLE": [
            "torah:deuteronomy:4:32",
            "writings:psalms:89:12",
            "prophets:jeremiah:10:12",
            "torah:exodus:16:16",
            "writings:psalms:40:6",
            "prophets:isaiah:41:23",
            "prophets:isaiah:36:21",
            "prophets:ii%20kings:18:36",
            "torah:leviticus:20:25",
            "prophets:jeremiah:51:15"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:1:2",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:1:5"
        ]
    }
}