{
    "VERSE": "74:16",
    "ARABIC": "كَلَّآ إِنَّهُۥ كَانَ لِءَايَٰتِنَا عَنِيدًا",
    "ENGLISH": {
        "TRANSLATION_0": "No indeed! He is obdurate about Our Signs.",
        "TRANSLATION_1": "Never. He is refractory of Our signs.\n",
        "TRANSLATION_2": "By no means; he is stubbornly opposed to Our Signs.\n",
        "TRANSLATION_3": "Never will he receive more. He has been hostile to Our revelations.\n",
        "TRANSLATION_4": "Never! For he is an enemy to Our signs!\n",
        "TRANSLATION_5": "Nay! Verily, he has been opposing Our Ayat.\n",
        "TRANSLATION_6": "By no means! surely he offers opposition to Our communications.\n",
        "TRANSLATION_7": "Nay! He is forward unto Our signs;\n",
        "TRANSLATION_8": "Nay! For lo! he hath been stubborn to Our revelations.\n",
        "TRANSLATION_9": "By no means! He has been stubbornly hostile to Our revelation:\n",
        "TRANSLATION_10": "By no means! Verily he hath been Unto Our signs a foe.\n",
        "TRANSLATION_11": "No indeed! He is an obstinate opponent of Our signs.\n",
        "TRANSLATION_12": "By no means! For to Our Signs he has been refractory!\n",
        "TRANSLATION_13": "Nay! Verily, he has been stubborn and opposing Our Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.).\n",
        "TRANSLATION_14": "Not at all! Surely, he has been disobedient to Our verses.\n",
        "TRANSLATION_15": "By no means! He was stubborn towards Our revelations.\n",
        "TRANSLATION_16": "No! Indeed, he has been toward Our verses obstinate.\n",
        "TRANSLATION_17": "[74:16] Nay!, I shall not give him more than that. He is indeed stubborn to Our signs, [to] the Qur’ān.\n",
        "TRANSLATION_18": "706 (Nay!) I will not give him more. And since then his wealth kept decreasing. (For lo! He) i.e. al-Walid Ibn al- Mughirah (hath been stubborn to Our revelations) to Our Scripture and Messenger; he turned away from them in disbelief.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "74:16",
            "26:15",
            "44:5",
            "78:28",
            "23:30",
            "29:50",
            "43:69",
            "74:54",
            "42:35",
            "2:242"
        ],
        "BIBLE": [
            "writings:ii%20chronicles:7:7",
            "prophets:jeremiah:18:15",
            "prophets:i%20kings:8:64",
            "torah:numbers:17:3",
            "prophets:i%20samuel:14:10",
            "torah:leviticus:21:17",
            "writings:i%20chronicles:21:24",
            "writings:ezra:6:17",
            "prophets:malachi:1:8",
            "prophets:ezekiel:47:13"
        ]
    }
}