{
    "VERSE": "74:17",
    "ARABIC": "سَأُرْهِقُهُۥ صَعُودًا",
    "ENGLISH": {
        "TRANSLATION_0": "I will force him to climb a fiery slope.",
        "TRANSLATION_1": "I shall inflict on him hardship,\n",
        "TRANSLATION_2": "I shall soon constrain him to a hard ascent.\n",
        "TRANSLATION_3": "We shall make him suffer the torment of hell without relief.\n",
        "TRANSLATION_4": "Soon I shall mount him on Saood, the hill of fire.\n",
        "TRANSLATION_5": "I shall force him to Sa`ud!\n",
        "TRANSLATION_6": "I will make a distressing punishment overtake him.\n",
        "TRANSLATION_7": "and I shall constrain him to a hard ascent.\n",
        "TRANSLATION_8": "On him I shall impose a fearful doom.\n",
        "TRANSLATION_9": "I shall force him to endure a painful uphill climb!\n",
        "TRANSLATION_10": "Anon I shall afflict him with a fearful woe.\n",
        "TRANSLATION_11": "Soon I will overwhelm him with hardship.\n",
        "TRANSLATION_12": "Soon will I visit him with a mount of calamities!\n",
        "TRANSLATION_13": "I shall oblige him to (climb a slippery mountain in the Hell-fire called As-Sa'ud, or to) face a severe torment!\n",
        "TRANSLATION_14": "I will constrain him to a hard ascent.\n",
        "TRANSLATION_15": "I will exhaust him increasingly.\n",
        "TRANSLATION_16": "I will cover him with arduous torment.\n",
        "TRANSLATION_17": "[74:17] [Soon] I shall burden him with a trying chastisement; alternatively [sa‘ūdan means] a mountain of fire which he will be made to ascend and then fall down from, forever.\n",
        "TRANSLATION_18": "(On him I shall impose a fearful doom) I shall make him climb a smooth rock in the Fire such that whenever he puts his hands on it, he wwould melt, and then he will be restored to how he used to be; it is also said that Allah will make him climb a rock of copper which pulls him from the front and hits him from the back.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "74:17",
            "74:26",
            "70:6",
            "72:17",
            "83:21",
            "92:10",
            "73:18",
            "78:4",
            "105:5",
            "26:120"
        ],
        "BIBLE": [
            "prophets:isaiah:56:7",
            "prophets:isaiah:48:15",
            "prophets:ezekiel:32:7",
            "writings:psalms:141:1",
            "prophets:ezekiel:24:17",
            "prophets:isaiah:48:1",
            "prophets:ezekiel:26:19",
            "torah:exodus:28:42",
            "torah:exodus:24:16",
            "prophets:ii%20samuel:3:13"
        ]
    }
}