{
    "VERSE": "74:31",
    "ARABIC": "وَمَا جَعَلْنَآ أَصْحَٰبَ ٱلنَّارِ إِلَّا مَلَٰٓئِكَةً وَمَا جَعَلْنَا عِدَّتَهُمْ إِلَّا فِتْنَةً لِّلَّذِينَ كَفَرُوا۟ لِيَسْتَيْقِنَ ٱلَّذِينَ أُوتُوا۟ ٱلْكِتَٰبَ وَيَزْدَادَ ٱلَّذِينَ ءَامَنُوٓا۟ إِيمَٰنًا وَلَا يَرْتَابَ ٱلَّذِينَ أُوتُوا۟ ٱلْكِتَٰبَ وَٱلْمُؤْمِنُونَ وَلِيَقُولَ ٱلَّذِينَ فِى قُلُوبِهِم مَّرَضٌ وَٱلْكَٰفِرُونَ مَاذَآ أَرَادَ ٱللَّهُ بِهَٰذَا مَثَلًا كَذَٰلِكَ يُضِلُّ ٱللَّهُ مَن يَشَآءُ وَيَهْدِى مَن يَشَآءُ وَمَا يَعْلَمُ جُنُودَ رَبِّكَ إِلَّا هُوَ وَمَا هِىَ إِلَّا ذِكْرَىٰ لِلْبَشَرِ",
    "ENGLISH": {
        "TRANSLATION_0": "We have only appointed angels as masters of the Fire and We have only specified their number as a trial for those who are kafir; so that those who were given the Book might gain in certainty, and those who have iman might increase in their iman, and both those who were given the Book and the muminun might have no doubt; and so that those with sickness in their hearts and the kuffar might say, 'What did Allah intend by this example?' In this way Allah misguides those He wills and guides those He wills. No one knows the legions of your Lord but Him. This is nothing but a reminder to all human beings.",
        "TRANSLATION_1": "We have not appointed any one but angels as keepers of Hell, and their number that We have fixed is to make it a means of contention for disbelievers, so that those who were given the Book may be certain, and the faith of the believers may have greater increase, and the people of the Book and believers may not be deceived, and the sceptics and infidels may say: \"What does God mean by this parable?\" That is how God leads whosoever He will astray, and guides whosoever He will. None knows the armies of your Lord save Him self. This is no more than reminder for mankind.\n",
        "TRANSLATION_2": "We have appointed none but angels as the keepers of the Fire, and We have not made their number but as a trial for the unbelievers so that those who have been endowed with the Book will be convinced and the believers' faith will increase, and neither those who have been endowed with the Book nor the believers will fall into any doubt. As for those in whose hearts there is a sickness as well as the unbelievers, they will say: “What did Allah aim at by this strange parable?” Thus does Allah let whomsoever He pleases to go astray, and directs whomsoever He pleases to the Right Way. And none knows the hosts of your Lord but He. (And Hell has only been mentioned here) that people may take heed.\n",
        "TRANSLATION_3": "We have made only angels as the keepers of the fire (for they are the strongest in carrying out Our commands). Our informing (people) of the numbers of these angels is a trial for the disbelievers. It gives more certainty to the people of the Book and strengthens the faith of the believers. The people of the Book and the believers have no doubt about it. We have fixed the number to make the disbelievers and those whose hearts are sick say, \"What does God mean by such a parable?\" Thus, God guides and causes to go astray whomever He wants. No one knows about the army of your Lord except He Himself. This parable is a reminder for mankind.\n",
        "TRANSLATION_4": "We have not appointed the guards of hell, except angels; and did not keep this number except to test the disbelievers – in order that the People given the Book(s) may be convinced, and to increase the faith of the believers – and so that the People given the Book(s) and the Muslims may not have any doubt – and so that those in whose hearts is a disease and the disbelievers, may say, “What does Allah mean by this amazing example?” This is how Allah sends astray whomever He wills, and guides whomever He wills; and no one knows the armies of Allah except Him; and this is not but an advice to man.\n",
        "TRANSLATION_5": "And We have set none but angels as guardians of the Fire. And We have fixed their number only as a trial for the disbelievers, in order that the People of the Scripture may arrive at a certainty and that the believers may increase in faith, and that no doubt may be left for the People of the Scripture and the believers, and that those in whose hearts is a disease and the disbelievers may say: \"What does Allah intend by this example\" Thus Allah leads astray whom He wills and guides whom He wills. And none can know the hosts of your Lord but He. And this is nothing but a reminder to mankind.\n",
        "TRANSLATION_6": "And We have not made the wardens of the fire others than angels, and We have not made their number but as a trial for those who disbelieve, that those who have been given the book may be certain and those who believe may increase in faith, and those who have been given the book and the believers may not doubt, and that those in whose hearts is a disease and the unbelievers may say: What does Allah mean by this parable? Thus does Allah make err whom He pleases, and He guides whom He pleases, and none knows the hosts of your Lord but He Himself; and this is naught but a reminder to the mortals.\n",
        "TRANSLATION_7": "We have appointed only angels to be masters of the Fire, and their number We have appointed only as a trial for the unbelievers, that those who were given the Book may have certainty, and that those who believe may increase in belief, and that those who were given the Book and those who believe may not be in-doubt, and that those in whose hearts there is sickness, and the unbelievers, may say, 'What did God intend by this as a similitude?' So God leads astray whomsoever He will, and He guides whomsoever He will; and none knows the hosts of thy Lord but He. And it is naught but a Reminder to mortals.\n",
        "TRANSLATION_8": "We have appointed only angels to be wardens of the Fire, and their number have We made to be a stumbling-block for those who disbelieve; that those to whom the Scripture hath been given may have certainty, and that believers may increase in faith; and that those to whom the Scripture hath been given and believers may not doubt; and that those in whose hearts there is disease, and disbelievers, may say: What meaneth Allah by this similitude? Thus Allah sendeth astray whom He will, and whom He will He guideth. None knoweth the hosts of thy Lord save Him. This is naught else than a Reminder unto mortals.\n",
        "TRANSLATION_9": "We have appointed only angels to be wardens of the Fire. We have specified their number only as a trial for those who are bent on denying the truth, so that those who were given the Book might gain in certainty, and those who believe might increase in faith -- and so that neither those who have been given the Scripture nor the believers might have any doubts, and that those sick at heart and those who deny the truth might ask, \"What does God mean by this parable?\" In this way, God lets go astray whom He wills, and guides whom He wills. And none knows the forces of your Lord but He. This is but a Reminder for man.\n",
        "TRANSLATION_10": "And We have appointed none but the angels to be wardens of the Fire. And their number we have made only a trial for those who disbelieve, so that those who are vouchsafed the Book may be convinced, and that those who believe may increase in faith, and that those who are vouchsafed the Book and the believers may not doubt, and that those in whose hearts is a disease and the infidels may say: what meaneth Allah by this description! In this wise Allah sendeth astray whomsoever He will, and guideth whomsoever He will. And none knoweth the hosts of thy Lord but He. And it is naught but an admonition Unto man.\n",
        "TRANSLATION_11": "We have assigned only angels as keepers of the Fire, and We have made their number merely a stumbling block for the faithless, and so that those who were given the Book may be reassured, and the faithful may increase in [their] faith, and so that those who were given the Book and the faithful may not be in doubt, and so that the faithless and those in whose hearts is a sickness may say, ‘What did Allah mean by this description?’ Thus does Allah lead astray whomever He wishes and guides whomever He wishes. No one knows the hosts of your Lord except Him, and it is just an admonition for all humans.\n",
        "TRANSLATION_12": "And We have set none but angels as Guardians of the Fire; and We have fixed their number only as a trial for Unbelievers,- in order that the People of the Book may arrive at certainty, and the Believers may increase in Faith,- and that no doubts may be left for the People of the Book and the Believers, and that those in whose hearts is a disease and the Unbelievers may say, \"What symbol doth Allah intend by this?\" Thus doth Allah leave to stray whom He pleaseth, and guide whom He pleaseth: and none can know the forces of thy Lord, except He and this is no other than a warning to mankind.\n",
        "TRANSLATION_13": "And We have set none but angels as guardians of the Fire, and We have fixed their number (19) only as a trial for the disbelievers, in order that the people of the Scripture (Jews and Christians) may arrive at a certainty [that this Quran is the truth as it agrees with their Books i.e. their number (19) is written in the Taurat (Torah) and the Injeel (Gospel)] and the believers may increase in Faith (as this Quran is the truth) and that no doubts may be left for the people of the Scripture and the believers, and that those in whose hearts is a disease (of hypocrisy) and the disbelievers may say: \"What Allah intends by this (curious) example?\" Thus Allah leads astray whom He wills and guides whom He wills. And none can know the hosts of your Lord but He. And this (Hell) is nothing else than a (warning) reminder to mankind.\n",
        "TRANSLATION_14": "We have appointed none but angels to guard the Fire, and made their number only as a trial for the unbelievers, so that those to whom the Book was given are certain and those who believe increase in belief. And that those who were given the Book, and those who believe will not be in doubt. And that those in whose hearts there is a sickness, together with the unbelievers, may say: 'What did Allah intend by this as an example' As such, Allah leaves in error whom He will and He guides whomsoever He will. None knows the hosts of your Lord except He. This is no more than a Reminder to humans.\n",
        "TRANSLATION_15": "We have appointed only angels to be wardens of the Fire, and caused their number to be a stumbling block for those who disbelieve; so that those given the Scripture may attain certainty; and those who believe may increase in faith; and those given the Scripture and the believers may not doubt; and those in whose hearts is sickness and the unbelievers may say, “What did God intend by this parable?” Thus God leads astray whom He wills, and guides whom He wills. None knows the soldiers of your Lord except He. This is nothing but a reminder for the mortals.\n",
        "TRANSLATION_16": "And We have not made the keepers of the Fire except angels. And We have not made their number except as a trial for those who disbelieve - that those who were given the Scripture will be convinced and those who have believed will increase in faith and those who were given the Scripture and the believers will not doubt and that those in whose hearts is hypocrisy and the disbelievers will say, \"What does Allah intend by this as an example?\" Thus does Allah leave astray whom He wills and guides whom He wills. And none knows the soldiers of your Lord except Him. And mention of the Fire is not but a reminder to humanity.\n",
        "TRANSLATION_17": "[74:31] And We have appointed only angels as wardens of the Fire, in other words, and so they cannot be withstood as these [disbelievers are wont to] imagine; and We have made their number, so, only as a stumbling-block, a cause for error, for those who disbelieve, when they then say, ‘Why are there nineteen of them?’, so that those who were given the Scripture, namely, the Jews, may be certain, of the sincerity of the Prophet (s) in [saying that] they are nineteen, for this concords with what is in their Scripture; and that those who believe, from among the People of the Scripture, may increase in faith, in affirmation of the truth, given that what the Prophet (s) has said concords with what is in their Scripture, and that those given the Scripture and the   believers, [those] other than these [Jews], may not be in doubt, concerning the number of [these] angels, and that those in whose hearts there is a sickness, an uncertainty, [those] in Medina, and the disbelievers, in Mecca, may say, ‘What did God mean by this, number [as a], similitude?’ (mathalan: they referred to it thus [as a mathal] on account of it being a curious matter; in terms of syntax, it [mathalan] is a circumstantial qualifier). Thus, that is, just as the one who rejects this number is led astray and the one who affirms the truth of it is guided, God leads astray whom He will and guides whom He will. And none knows the hosts of your Lord, namely, the angels, [none knows them] in terms of their strength and their assistants, except Him. And it, that is, Saqar, is nothing but a reminder for humans.\n",
        "TRANSLATION_18": "(We have appointed) We set on the dwellers of the Fire (only angels) the keepers of the Fire (to be wardens of the Fire, and their number have We made) and We have not mentioned the fewness of the keepers of the Fire save (to be a stumbling block) except in order to be a calamity (for those who disbelieve) the disbelievers of Mecca: Abu'l-Ashadd Ibn Usayd Ibn Kildah who said: \"I will take care of seventeen angels, nine on my back and eight on my chest; therefore you should take care of the other two\"; (that those to whom the scripture) the Torah, i.e. 'Abdullah Ibn Salam and his followers, for it is written in the Torah that the number of the keepers of the Fire is nineteen (hath been given may have certainty, and that believers may increase in faith) when they know that what is in their Scripture is similar to that which is in the Torah; (and that those to whom the Scripture hath been given) 'Abdullah Ibn Salam and his followers, when they see that there is no difference between what is in the Qur'an and that which is in the Torah (and believers) also for the same reason (may not doubt; and that those in whose hearts there is disease) doubt and hypocrisy, (and disbelievers) the Jews and Christians; and it is said: the disbelievers of Mecca, (may say: What meaneth Allah by this similitude) when he mentioned the small number of angels who are in charge of the Fire? (Thus Allah sendeth astray) through this similitude (whom He will) whomever deserves it, (and whom He will) and whomever deserves (He guideth) by means of this similitude. (None knoweth the hosts of your Lord) among the angels (save Him. This is) i.e. Saqar, the fourth gate of the Fire (naught else than a Reminder unto mortals) an admonition to people in order to warn them.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "74:31",
            "2:275",
            "42:15",
            "47:3",
            "22:53",
            "3:191",
            "39:23",
            "2:26",
            "3:7",
            "6:38"
        ],
        "BIBLE": [
            "prophets:ii%20kings:4:43",
            "writings:ii%20chronicles:30:5",
            "torah:exodus:36:6",
            "prophets:jeremiah:20:9",
            "writings:ii%20chronicles:14:6",
            "prophets:nahum:1:14",
            "writings:ecclesiastes:1:13",
            "prophets:ii%20kings:5:1",
            "prophets:amos:6:10",
            "torah:deuteronomy:32:8"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:4"
        ]
    }
}