{
    "VERSE": "74:48",
    "ARABIC": "فَمَا تَنفَعُهُمْ شَفَٰعَةُ ٱلشَّٰفِعِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "The intercession of the interceders will not help them.",
        "TRANSLATION_1": "So, the intercession of intercessors will not avail them.\n",
        "TRANSLATION_2": "The intercession of the intercessors shall then be of no avail to them.\n",
        "TRANSLATION_3": "The intercession of the intercessors will be of no benefit to them.\n",
        "TRANSLATION_4": "So the intercession of the intercessors will not benefit them. (The disbelievers will not have any intercessor.)\n",
        "TRANSLATION_5": "So no intercession of intercessors will be of any use to them.\n",
        "TRANSLATION_6": "So the intercession of intercessors shall not avail them.\n",
        "TRANSLATION_7": "Then the intercession of the intercessors shall not profit them.\n",
        "TRANSLATION_8": "The mediation of no mediators will avail them then.\n",
        "TRANSLATION_9": "So no intercession will avail them.\n",
        "TRANSLATION_10": "Then there will not Profit them intercision of the interceders,\n",
        "TRANSLATION_11": "So the intercession of the intercessors will not avail them.\n",
        "TRANSLATION_12": "Then will no intercession of (any) intercessors profit them.\n",
        "TRANSLATION_13": "So no intercession of intercessors will be of any use to them.\n",
        "TRANSLATION_14": "The intercession of their intercessors shall not benefit them.\n",
        "TRANSLATION_15": "But the intercession of intercessors will not help them.\n",
        "TRANSLATION_16": "So there will not benefit them the intercession of [any] intercessors.\n",
        "TRANSLATION_17": "[74:48] Thus the intercession of the intercessors, from among the angels, the prophets and the righteous, will not avail them, in other words, there will be no intercession for them.\n",
        "TRANSLATION_18": "(The mediation of no mediators will avail them then) Allah says: the intercession of the angels, prophets and 709 righteous ones will not benefit them.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "74:48",
            "26:46",
            "26:60",
            "68:21",
            "84:16",
            "51:54",
            "37:116",
            "20:109",
            "51:45",
            "19:87"
        ],
        "BIBLE": [
            "prophets:isaiah:30:5",
            "prophets:jeremiah:31:5",
            "prophets:isaiah:50:7",
            "writings:daniel:11:34",
            "torah:numbers:35:33",
            "prophets:isaiah:53:12",
            "writings:psalms:119:175",
            "prophets:jeremiah:20:11",
            "prophets:ii%20samuel:16:19",
            "torah:leviticus:7:7"
        ]
    }
}