{
    "VERSE": "74:49",
    "ARABIC": "فَمَا لَهُمْ عَنِ ٱلتَّذْكِرَةِ مُعْرِضِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "What is the matter with them that they run from the Reminder",
        "TRANSLATION_1": "Why then do they turn away from the admonition\n",
        "TRANSLATION_2": "What is the matter with people that they are turning away from this Exhortation,\n",
        "TRANSLATION_3": "If such will be the Day of Judgment, what is the matter with them? Why do they run away from guidance,\n",
        "TRANSLATION_4": "So what is the matter with them that they turn away from the advice?\n",
        "TRANSLATION_5": "Then what is wrong with them that they turn away from admonition\n",
        "TRANSLATION_6": "What is then the matter with them, that they turn away from the admonition\n",
        "TRANSLATION_7": "What ails them, that they turn away from the Reminder,\n",
        "TRANSLATION_8": "Why now turn they away from the Admonishment,\n",
        "TRANSLATION_9": "Then what is wrong with them that they turn away from admonition,\n",
        "TRANSLATION_10": "What aileth them, therefore, that they are from the Admonition turning away?\n",
        "TRANSLATION_11": "What is the matter with them that they evade the Reminder\n",
        "TRANSLATION_12": "Then what is the matter with them that they turn away from admonition?-\n",
        "TRANSLATION_13": "Then what is wrong with them (i.e. the disbelievers) that they turn away from (receiving) admonition?\n",
        "TRANSLATION_14": "What is the matter with them that they turn away from this Reminder,\n",
        "TRANSLATION_15": "Why are they turning away from the Reminder?\n",
        "TRANSLATION_16": "Then what is [the matter] with them that they are, from the reminder, turning away\n",
        "TRANSLATION_17": "[74:49] So what (fa-mā: the subject) is wrong with them (lahum: the predicate thereof, semantically connected to an omitted clause, the person of which has been transposed onto it) that they turn away (mu‘ridīna is a circumstantial qualifier referring to the [suffixed] pronoun [in lahum, ‘them’]) from the Reminder — in other words, ‘what has happened to them that they have turned away from admonition’ —\n",
        "TRANSLATION_18": "(Why now turn they away from) disbelieve in (the Admonishment) the Qur'an\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "74:49",
            "107:4",
            "26:100",
            "70:2",
            "10:80",
            "74:41",
            "69:2",
            "15:94",
            "69:8",
            "52:11"
        ],
        "BIBLE": [
            "prophets:jeremiah:48:47",
            "prophets:isaiah:5:25",
            "writings:job:37:12",
            "prophets:jonah:3:9",
            "torah:numbers:21:33",
            "prophets:jeremiah:46:21",
            "prophets:ezekiel:16:53",
            "writings:job:24:4",
            "prophets:ezekiel:41:24",
            "writings:ezra:10:14"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:4:8"
        ]
    }
}