{
    "VERSE": "74:56",
    "ARABIC": "وَمَا يَذْكُرُونَ إِلَّآ أَن يَشَآءَ ٱللَّهُ هُوَ أَهْلُ ٱلتَّقْوَىٰ وَأَهْلُ ٱلْمَغْفِرَةِ",
    "ENGLISH": {
        "TRANSLATION_0": "But they will only pay heed if Allah wills. He is entitled to be feared and entitled to forgive,",
        "TRANSLATION_1": "But they will not remember except as God wills: He is worthy to be feared, and He is worthy of forgiving\n",
        "TRANSLATION_2": "But they will not benefit from it unless Allah Himself so wills. He is worthy to be feared; and He is worthy to forgive (those that fear Him).\n",
        "TRANSLATION_3": "No one will seek guidance unless God wills it. He alone is worthy of being feared and He is the Source of Forgiveness.\n",
        "TRANSLATION_4": "And what advice will they heed, except if Allah wills? Only He deserves to be feared, and His only is the greatness of forgiving.\n",
        "TRANSLATION_5": "And they will not receive admonition unless Allah wills; He is the One, deserving of the Taqwa and He is the One Who forgives.\n",
        "TRANSLATION_6": "And they will not mind unless Allah please. He is worthy to be feared and worthy to forgive.\n",
        "TRANSLATION_7": "And they will not remember, except that God wills; He is worthy to be feared, -- worthy to forgive.\n",
        "TRANSLATION_8": "And they will not heed unless Allah willeth (it). He is the fount of fear. He is the fount of Mercy.\n",
        "TRANSLATION_9": "they will only take heed if God so wills: He is the Lord who is worthy to be feared: the Lord of forgiveness.\n",
        "TRANSLATION_10": "And they shall not heed unless Allah Willeth. He is the Lord of piety. and the Lord of forgiveness\n",
        "TRANSLATION_11": "And they will not be mindful unless Allah wishes. He is worthy of [your] being wary [of Him] and He is worthy to forgive.\n",
        "TRANSLATION_12": "But none will keep it in remembrance except as Allah wills: He is the Lord of Righteousness, and the Lord of Forgiveness.\n",
        "TRANSLATION_13": "And they will not receive admonition unless Allah wills; He (Allah) is the One, deserving that mankind should be afraid of, and should be dutiful to Him, and should not take any Ilah (God) along with Him, and He is the One Who forgives (sins).\n",
        "TRANSLATION_14": "But none will remember, unless Allah wills, He is the Owner of fear, the Owner of forgiveness.\n",
        "TRANSLATION_15": "But they will not remember, unless God wills. He is the Source of Righteousness, and the Source of Forgiveness.\n",
        "TRANSLATION_16": "And they will not remember except that Allah wills. He is worthy of fear and adequate for [granting] forgiveness.\n",
        "TRANSLATION_17": "[74:56] And they will not remember (yadhkurūna or [read second person plural] tadhkurūna) unless God wills [it]. He is [the One] worthy of [your] fear, and [the One] worthy to forgive, by forgiving those who fear Him.\n",
        "TRANSLATION_18": "(And they will not heed unless Allah willeth (it). He is the fount of fear) He deserves to be feared such that He is not disobeyed. (He is the fount of Mercy) He is capable of forgiving those who repent, for He is the possessor of forgiveness when the Day of Resurrection takes place'. And of the surah in which the Rising of the Dead is mentioned, which is all Mecca and consists of 39 verses, 99 words and 652 letters: Surah 75: The Rising of the Dead (al-Qiyamah) And of the surah in which the Rising of the Dead is mentioned, which is all Mecca and consists of 39 verses, 99 words and 652 letters:\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "74:56",
            "3:54",
            "4:99",
            "10:72",
            "9:32",
            "5:99",
            "81:29",
            "2:9",
            "9:51",
            "5:74"
        ],
        "BIBLE": [
            "writings:psalms:24:5",
            "writings:psalms:103:17",
            "writings:psalms:25:7",
            "writings:nehemiah:13:22",
            "prophets:jeremiah:31:34",
            "prophets:ezekiel:21:29",
            "writings:psalms:147:11",
            "writings:psalms:49:16",
            "torah:deuteronomy:3:22",
            "torah:deuteronomy:7:18"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:13",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:1:3"
        ]
    }
}