{
    "VERSE": "74:6",
    "ARABIC": "وَلَا تَمْنُن تَسْتَكْثِرُ",
    "ENGLISH": {
        "TRANSLATION_0": "Do not give out of a desire for gain.",
        "TRANSLATION_1": "Do not bestow favours in expectation of return,\n",
        "TRANSLATION_2": "and bestow not favour in order to seek from others a greater return,\n",
        "TRANSLATION_3": "and do not think that by doing such deeds, you have done a great favor to God.\n",
        "TRANSLATION_4": "And do not favour others in order to receive more.\n",
        "TRANSLATION_5": "And give not a thing in order to have more.\n",
        "TRANSLATION_6": "And bestow not favors that you may receive again with increase,\n",
        "TRANSLATION_7": "Give not, thinking to gain greater\n",
        "TRANSLATION_8": "And show not favour, seeking wordly gain!\n",
        "TRANSLATION_9": "do not bestow a favour in the expectation of receiving more in return;\n",
        "TRANSLATION_10": "And bestow not favour that thou mayest receive more.\n",
        "TRANSLATION_11": "Do not grant a favour seeking a greater gain,\n",
        "TRANSLATION_12": "Nor expect, in giving, any increase (for thyself)!\n",
        "TRANSLATION_13": "And give not a thing in order to have more (or consider not your deeds of Allah's obedience as a favour to Allah).\n",
        "TRANSLATION_14": "Do not give, thinking to gain greater\n",
        "TRANSLATION_15": "And show no favor seeking gain.\n",
        "TRANSLATION_16": "And do not confer favor to acquire more\n",
        "TRANSLATION_17": "[74:6] And do not grant a favour seeking greater gain (read tastakthiru as a circumstantial qualifier) in other words, do not give something in order to demand more in return: this [stipulation] is specific to the Prophet (s), since he is enjoined to [adopt] the fairest traits and the noblest of manners;\n",
        "TRANSLATION_18": "(And show not favour, seeking worldly gain!) such that you give a little and receive instead what is more and better in the life of the world; it is also said this means: do not deem the works you do for Allah to be too much.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "74:6",
            "74:28",
            "80:1",
            "96:19",
            "75:31",
            "68:18",
            "53:60",
            "93:10",
            "23:108",
            "74:23"
        ],
        "BIBLE": [
            "prophets:jeremiah:25:5",
            "writings:ezra:9:13",
            "torah:deuteronomy:3:20",
            "torah:genesis:9:3",
            "writings:ecclesiastes:1:13",
            "torah:genesis:28:4",
            "prophets:jeremiah:35:15",
            "torah:deuteronomy:26:12",
            "writings:ii%20chronicles:19:6",
            "torah:deuteronomy:26:13"
        ]
    }
}