{
    "VERSE": "25:1",
    "ARABIC": "بِسْمِ ٱللَّهِ ٱلرَّحْمَٰنِ ٱلرَّحِيمِ تَبَارَكَ ٱلَّذِى نَزَّلَ ٱلْفُرْقَانَ عَلَىٰ عَبْدِهِۦ لِيَكُونَ لِلْعَٰلَمِينَ نَذِيرًا",
    "ENGLISH": {
        "TRANSLATION_0": "Blessed be He who has sent down the Furqan to His slave so that he can be a warner to all beings;",
        "TRANSLATION_1": "BLESSED IS HE who revealed the Criterion (of right and wrong) to His votary that it may be a warning for the world, --\n",
        "TRANSLATION_2": "Highly blessed is He, Who has sent down Al-Furqan, to His servant so that it may be a warner to all mankind:\n",
        "TRANSLATION_3": "Blessed is He who has revealed the criteria (for discerning truth from falsehood) to His servant so that He could warn mankind.\n",
        "TRANSLATION_4": "Most Auspicious is He Who has sent down the Furqan (the Criterion – the Holy Qur’an) upon His chosen bondman for him to be a Herald of Warning to the entire world. (Prophet Mohammed – peace and blessings be upon him – is the Prophet towards all mankind.)\n",
        "TRANSLATION_5": "Blessed be He Who sent down (Nazzala) the criterion to His servant that he may be a warner to all nations.\n",
        "TRANSLATION_6": "Blessed is He Who sent down the Furqan upon His servant that he may be a warner to the nations;\n",
        "TRANSLATION_7": "Blessed be He who has sent down the Salvation upon His servant, that he may be a warner to all beings;\n",
        "TRANSLATION_8": "Blessed is He Who hath revealed unto His slave the Criterion (of right and wrong), that he may be a warner to the peoples.\n",
        "TRANSLATION_9": "Blessed be He who has revealed the criterion [the Quran] to His servant that he may warn the nations.\n",
        "TRANSLATION_10": "Blest be He who hath revealed the Criterion unto His bondman thathe may be unto the worlds a warner.\n",
        "TRANSLATION_11": "Blessed is He who sent down the Criterion to His servant that he may be a warner to all the nations.\n",
        "TRANSLATION_12": "Blessed is He who sent down the criterion to His servant, that it may be an admonition to all creatures;-\n",
        "TRANSLATION_13": "Blessed be He Who sent down the criterion (of right and wrong, i.e. this Quran) to His slave (Muhammad SAW) that he may be a warner to the 'Alamin (mankind and jinns).\n",
        "TRANSLATION_14": "Blessed is He who has sent down the Criterion to His worshiper (Prophet Muhammad), that he is a warner to all mankind;\n",
        "TRANSLATION_15": "Blessed is He who sent down the Criterion upon His servant, to be a warning to humanity.\n",
        "TRANSLATION_16": "Blessed is He who sent down the Criterion upon His Servant that he may be to the worlds a warner -\n",
        "TRANSLATION_17": "[25:1] Blessed, exalted, is He Who revealed the Criterion (al-furqān), the Qur’ān — called thus [al-furqān] because it has discriminated (faraqa) between truth and falsehood — to His servant, Muhammad (s), that he may be to all the worlds, [to] mankind and the jinn, but not the angels, a warner, a threatening of God’s chastisement.\n",
        "TRANSLATION_18": "And from his narration on the authority of Ibn 'Abbas that he said concerning the interpretation of Allah's saying (Blessed is): '(Blessed is) He says: He is the Possessor of grace; it is also said that this means: He is exalted and transcendent above and exonerated from having a son or partner (He Who hath revealed unto His slave) Muhammad (pbuh) (the Criterion (of right and wrong)) He Who sent Gabriel with the Qur'an, (that he) Muhammad (pbuh) (may be a warner) a Messenger warning by the Qur'an (to the peoples) the jinn and human beings.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "25:1",
            "2:131",
            "41:46",
            "23:109",
            "27:15",
            "17:107",
            "7:121",
            "26:47",
            "21:71",
            "50:29"
        ],
        "BIBLE": [
            "writings:psalms:96:10",
            "prophets:isaiah:59:8",
            "writings:ezra:9:11",
            "prophets:isaiah:43:9",
            "writings:i%20chronicles:17:27",
            "writings:psalms:98:2",
            "prophets:isaiah:52:7",
            "writings:psalms:3:9",
            "prophets:isaiah:34:1",
            "writings:psalms:98:1"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:3:6"
        ]
    }
}