{
    "VERSE": "25:14",
    "ARABIC": "لَّا تَدْعُوا۟ ٱلْيَوْمَ ثُبُورًا وَٰحِدًا وَٱدْعُوا۟ ثُبُورًا كَثِيرًا",
    "ENGLISH": {
        "TRANSLATION_0": "'Do not cry out today for just one destruction, cry out for many destructions!'",
        "TRANSLATION_1": "Do not ask for one death but many deaths on this day.\"\n",
        "TRANSLATION_2": "(Then it will be said to them:) \"Do not call for one death today, but call for many deaths.\"\n",
        "TRANSLATION_3": "They will be told, \"Do not pray to die only once but pray to die many times.\"\n",
        "TRANSLATION_4": "It will be said “Do not pray this day for one death – and pray for many deaths.”\n",
        "TRANSLATION_5": "Exclaim not today for one destruction, but exclaim for many destructions.\n",
        "TRANSLATION_6": "Call not this day for one destruction, but call for destructions many.\n",
        "TRANSLATION_7": "Call not out today for one destruction, but call for many!'\n",
        "TRANSLATION_8": "Pray not that day for one destruction, but pray for many destructions!\n",
        "TRANSLATION_9": "But they will be told, \"Do not call today for one death, call for many deaths!\"\n",
        "TRANSLATION_10": "Call not to-day for a single death but call for death manifold.\n",
        "TRANSLATION_11": "[They will be told:] ‘Do not pray for a single annihilation today, but pray for many annihilations!’\n",
        "TRANSLATION_12": "This day plead not for a single destruction: plead for destruction oft-repeated!\"\n",
        "TRANSLATION_13": "Exclaim not today for one destruction, but exclaim for many destructions.\n",
        "TRANSLATION_14": "Do not call out today for one destruction; call out for many destructions'\n",
        "TRANSLATION_15": "“Do not plead for one death today, but plead for a great many deaths.”\n",
        "TRANSLATION_16": "[They will be told], \"Do not cry this Day for one destruction but cry for much destruction.\"\n",
        "TRANSLATION_17": "[25:14] ‘Do not pray for a single annihilation on this day, but pray for many annihilations!’, which will be [the nature of] your chastisement.\n",
        "TRANSLATION_18": "Allah will say to them: (Pray not that day for one destruction, but pray for many destructions) for what has befallen you!\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "25:14",
            "36:59",
            "85:2",
            "28:65",
            "73:14",
            "20:34",
            "23:65",
            "26:87",
            "21:103",
            "79:6"
        ],
        "BIBLE": [
            "prophets:judges:16:28",
            "torah:genesis:49:1",
            "torah:genesis:20:9",
            "prophets:ii%20samuel:1:15",
            "writings:lamentations:3:57",
            "prophets:judges:6:32",
            "prophets:i%20kings:2:42",
            "prophets:hosea:1:9",
            "torah:genesis:29:34",
            "torah:genesis:26:9"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:2:4"
        ]
    }
}