{
    "VERSE": "25:20",
    "ARABIC": "وَمَآ أَرْسَلْنَا قَبْلَكَ مِنَ ٱلْمُرْسَلِينَ إِلَّآ إِنَّهُمْ لَيَأْكُلُونَ ٱلطَّعَامَ وَيَمْشُونَ فِى ٱلْأَسْوَاقِ وَجَعَلْنَا بَعْضَكُمْ لِبَعْضٍ فِتْنَةً أَتَصْبِرُونَ وَكَانَ رَبُّكَ بَصِيرًا",
    "ENGLISH": {
        "TRANSLATION_0": "We never sent any Messengers before you who did not eat food and walk in the market-place. But We have made some of you a trial for others to see if you will be steadfast? Your Lord sees everything.",
        "TRANSLATION_1": "We never sent before you apostles who did not eat food and walk the market places. We make some of you the means of trying the others. So will you persevere? Your Lord is always watching.\n",
        "TRANSLATION_2": "O Muhammad,, all the Messengers whom We sent before you also ate food and moved about in the streets. In fact, We have made you all a means of test for one another. Will you show patience? for your Lord sees everything.\n",
        "TRANSLATION_3": "All the Messengerss whom We sent before, certainly, ate food and walked through the streets. We have made some of you (people) a trial for the others. Would you then exercise patience? Your Lord is All-aware.\n",
        "TRANSLATION_4": "And all the Noble Messengers We sent before you were like this – eating food and walking in the markets; and We have made some of you a test for others; so will you, O people, patiently endure? And O dear Prophet, your Lord is All Seeing.\n",
        "TRANSLATION_5": "And We never sent before you any of the Messengers but verily, they ate food and walked in the markets. And We have made some of you as a trial for others; will you have patience And your Lord is Ever All-Seer.\n",
        "TRANSLATION_6": "And We have not sent before you any apostles but they most surely ate food and went about in the markets; and We have made some of you a trial for others; will you bear patiently? And your Lord is ever Seeing.\n",
        "TRANSLATION_7": "And We sent not before thee any Envoys, but that they ate food, and went in the markets; and We appointed some of you to be a trial for others: 'Will you endure?' Thy Lord is ever All-seeing.\n",
        "TRANSLATION_8": "We never sent before thee any messengers but lo! they verily ate food and walked in the markets. And We have appointed some of you a test for others: Will ye be steadfast? And thy Lord is ever Seer.\n",
        "TRANSLATION_9": "We never sent any messengers before you who did not eat food and walk in the market-place. We make some of you a means of trial for others, to see whether you are steadfast. Your Lord is all seeing.\n",
        "TRANSLATION_10": "And We have not sent before thee ony of the sent ones but verily they ate food and walked about in the market places. And We have made some of you unto some others a temptation; will ye have patience! And thy Lord is ever a Beholder. pART XIX\n",
        "TRANSLATION_11": "We did not send any apostles before you but that they indeed ate food and walked in marketplaces. We have made you a [means of] test for one another, [to see] if you will be patient and steadfast, and your Lord is all-seeing.\n",
        "TRANSLATION_12": "And the messengers whom We sent before thee were all (men) who ate food and walked through the streets: We have made some of you as a trial for others: will ye have patience? for Allah is One Who sees (all things).\n",
        "TRANSLATION_13": "And We never sent before you (O Muhammad SAW) any of the Messengers but verily, they ate food and walked in the markets. And We have made some of you as a trial for others: will you have patience? And your Lord is Ever All-Seer (of everything).\n",
        "TRANSLATION_14": "We did not send Messengers before you but that they ate food and walked about in the markets, We have appointed some of you to be a trial for others. Will you endure? Your Lord is the Seer.\n",
        "TRANSLATION_15": "We never sent any messengers before you, but they ate food and walked in the marketplaces. And We made some of you tempters for one another—will you be patient? Your Lord is always Observing.\n",
        "TRANSLATION_16": "And We did not send before you, [O Muhammad], any of the messengers except that they ate food and walked in the markets. And We have made some of you [people] as trial for others - will you have patience? And ever is your Lord, Seeing.\n",
        "TRANSLATION_17": "[25:20] And We did not send before you any messengers but that they ate food and walked in the marketplaces, and so you are like them in this respect, and truly what was said to them is being said to you. And We have made some of you a trial for others:, a test, trying the rich with the poor, the healthy with the sick, the honourable with the vulgar, in each case the latter would say, ‘Why can I not be like the other person?’ Will you be steadfast?, [and endure] what you hear from those with whom you are tried? (the interrogative is meant as an imperative, in other words, ‘Be steadfast!’. And your Lord is ever Watchful, of those who remain steadfast and those who become miserable.\n",
        "TRANSLATION_18": "(We never sent before you) Muhammad (any messengers but lo! they ate food) as you do; this is in response to the disbelievers of Mecca who said: (What ails this messenger (of Allah) that he eats food), (and walked in the markets) just as you walk. (And We have appointed some of you a test) a trial (for others) We test the pure Arab with the client, and the noble by birth with the lowly and the rich with the poor; Allah said to Abu Jahl and his host: (Will ye be steadfast) with the Companions of the Prophet (pbuh) Salman and his fellow believers, such that you become with them, in relation to Religion and other matters, equal and that you sit together with them? (And thy Lord is ever Seer) that they will not be steadfast regarding this. It is also said that this means: will you be steadfast, Companions of the Prophet (pbuh) in the face of their harm until I grant you the reward of the steadfast, and your Lord sees who believes among you and who does not?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "25:20",
            "6:158",
            "41:43",
            "7:155",
            "7:129",
            "17:60",
            "29:10",
            "28:53",
            "54:27",
            "38:16"
        ],
        "BIBLE": [
            "writings:ecclesiastes:2:24",
            "torah:leviticus:10:17",
            "writings:i%20chronicles:17:21",
            "prophets:amos:6:10",
            "writings:nehemiah:8:12",
            "prophets:ii%20samuel:7:23",
            "prophets:judges:9:48",
            "prophets:ii%20kings:7:19",
            "torah:exodus:34:10",
            "prophets:isaiah:38:16"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:5:1"
        ]
    }
}