{
    "VERSE": "25:22",
    "ARABIC": "يَوْمَ يَرَوْنَ ٱلْمَلَٰٓئِكَةَ لَا بُشْرَىٰ يَوْمَئِذٍ لِّلْمُجْرِمِينَ وَيَقُولُونَ حِجْرًا مَّحْجُورًا",
    "ENGLISH": {
        "TRANSLATION_0": "On the Day they see the angels, there will be no good news that Day for the evildoers. They will say, 'There is an absolute ban.'",
        "TRANSLATION_1": "The day they see the angels there will be no happy tidings for the sinners; and they will say: \"There is an insurmountable barrier!\"\n",
        "TRANSLATION_2": "The Day, when they will see the angels, will not be a day of rejoicing for the criminals; they will cry out, \"May Allah save us!\"\n",
        "TRANSLATION_3": "On the day when the criminals see the angels, there will, certainly, be no rejoicing for them. Rather, they will plead to the angels, \"Please keep away from us (do not drive us into hell).\"\n",
        "TRANSLATION_4": "The day when they will see the angels – that day will not be of any happiness for the guilty – and they will cry, “O God, erect a barrier between us and them!”\n",
        "TRANSLATION_5": "On the Day they will see the angels -- no good news will there be for the criminals that day. And they will say: \"Hijran Mahjura.\"\n",
        "TRANSLATION_6": "On the day when they shall see the angels, there shall be no joy on that day for the guilty, and they shall say: It is a forbidden thing totally prohibited.\n",
        "TRANSLATION_7": "Upon the day that they see the angels, no good tidings that day for the sinners; they shall say, 'A ban forbidden!'\n",
        "TRANSLATION_8": "On the day when they behold the angels, on that day there will be no good tidings for the guilty; and they will cry: A forbidding ban!\n",
        "TRANSLATION_9": "There will be no good tidings for the guilty on the day they see the angels; and they will cry out, \"Keep away, keep away!\"\n",
        "TRANSLATION_10": "The Day whereon they shall behold the angels on that day there will be nea joy for the culprits, and they will say: away! away!\n",
        "TRANSLATION_11": "The day they will see the angels, there will be no good news for the guilty on that day, and they will say, ‘Keep off [from paradise]!’\n",
        "TRANSLATION_12": "The Day they see the angels,- no joy will there be to the sinners that Day: The (angels) will say: \"There is a barrier forbidden (to you) altogether!\"\n",
        "TRANSLATION_13": "On the Day they will see the angels, no glad tidings will there be for the Mujrimun (criminals, disbelievers, polytheists, sinners, etc.) that day. And they (angels) will say: \"All kinds of glad tidings are forbidden for you,\" [None will be allowed to enter Paradise except the one who said: La ilaha ill-Allah, \"(none has the right to be worshipped but Allah) and acted practically on its legal orders and obligations].\n",
        "TRANSLATION_14": "On the Day when they behold the angels, there will be no glad tidings for the sinners. They will say: 'A refuge which is forbidden'\n",
        "TRANSLATION_15": "On the Day when they see the angels—there will be no good news for sinners on that Day; and they will say, “A protective refuge.”\n",
        "TRANSLATION_16": "The day they see the angels - no good tidings will there be that day for the criminals, and [the angels] will say, \"Prevented and inaccessible.\"\n",
        "TRANSLATION_17": "[25:22] The day when they see the angels, [while they stand] together with the rest of creation, namely, on the Day of Resurrection (yawma is in the accusative because of an implied [preceding] udhkur, ‘mention’), there will be no good tidings on that day for the guilty, that is, the disbelievers, in contrast to the believers for whom there shall be the good tidings of Paradise, and they will say, ‘A forbidding ban!’, as was their [the pagan] custom in this world whenever a misfortune befell them; in other words [they mean] ‘awdhan ma‘ādhan, seeking refuge from the angels [who will chastise them]. God, exalted be He, says:\n",
        "TRANSLATION_18": "(On the day) which is the Day of Judgement (when they behold the angels) at the moment of death, (on that day there will be no good tidings) the angels will say to them: there is no good tidings, i.e. there is no Paradise (for the guilty) for the idolaters; (and they will cry) i.e. the angels will cry: (A forbidding ban) the glad tiding of Paradise is forbidden for the disbelievers; and it is also said that this means: the disbelievers will say upon seeing the angels: let a great distance be between you and us!\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "25:22",
            "78:38",
            "34:40",
            "21:103",
            "12:92",
            "26:87",
            "18:47",
            "20:101",
            "40:18",
            "25:26"
        ],
        "BIBLE": [
            "prophets:isaiah:25:9",
            "prophets:jeremiah:16:19",
            "prophets:i%20samuel:20:12",
            "prophets:jeremiah:42:4",
            "writings:daniel:6:13",
            "torah:exodus:16:4",
            "prophets:ii%20kings:7:9",
            "prophets:zephaniah:3:19",
            "writings:nehemiah:5:9",
            "prophets:i%20kings:18:36"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:1:13"
        ]
    }
}