{
    "VERSE": "25:23",
    "ARABIC": "وَقَدِمْنَآ إِلَىٰ مَا عَمِلُوا۟ مِنْ عَمَلٍ فَجَعَلْنَٰهُ هَبَآءً مَّنثُورًا",
    "ENGLISH": {
        "TRANSLATION_0": "We will advance on the actions they have done and make them scattered specks of dust.",
        "TRANSLATION_1": "We shall turn to their deeds and scatter them like particles of dust.\n",
        "TRANSLATION_2": "Then We shall turn to what they had done and render it vain like scattered dust.\n",
        "TRANSLATION_3": "We shall call their deeds into Our presence and scatter them into the air as dust (turn them devoid of all virtue).\n",
        "TRANSLATION_4": "And We turned all the deeds they had performed into scattered floating specks of dust.\n",
        "TRANSLATION_5": "And We shall turn to whatever deeds they did, and We shall make such deeds as scattered floating particles of dust.\n",
        "TRANSLATION_6": "And We will proceed to what they have done of deeds, so We shall render them as scattered floating dust.\n",
        "TRANSLATION_7": "We shall advance upon what work they have done, and make it a scattered dust.\n",
        "TRANSLATION_8": "And We shall turn unto the work they did and make it scattered motes.\n",
        "TRANSLATION_9": "and We shall take all that they did and turn it into scattered dust.\n",
        "TRANSLATION_10": "And We shall set upon that which they worked, and shall make it as dust wind-scattered.\n",
        "TRANSLATION_11": "Then We shall attend to the works they have done and then turn them into scattered dust.\n",
        "TRANSLATION_12": "And We shall turn to whatever deeds they did (in this life), and We shall make such deeds as floating dust scattered about.\n",
        "TRANSLATION_13": "And We shall turn to whatever deeds they (disbelievers, polytheists, sinners, etc.) did, and We shall make such deeds as scattered floating particles of dust.\n",
        "TRANSLATION_14": "Then We shall advance upon the work which they have done and render it as scattered dust.\n",
        "TRANSLATION_15": "We will proceed to the works they did, and will turn them into scattered dust.\n",
        "TRANSLATION_16": "And We will regard what they have done of deeds and make them as dust dispersed.\n",
        "TRANSLATION_17": "[25:23] And We shall attend to, We shall turn to, the works they did, that were good, such as voluntary alms or kindness to kin, a hospitable reception of a guest or the succour of a troubled person in this world, and turn them into scattered dust (habā’an manthūran), namely, [as] those individual particles of dust which one might observe near a window when the sun is shining through. In other words, [We shall make their good works] like those [particles of dust] in their uselessness, there being no reward for such [works], for lack of any [binding] obligation [to reward them therefor]; but they are rewarded for it in the life of this world.\n",
        "TRANSLATION_18": "(And We shall turn unto the work they did) the good work they did in the life of this world (and make it) in the Hereafter (scattered motes) like scattered dust in the hooves of beasts; it is also said that this means: like tiny particles of dust which can be seen when, from a hole, light enters into a dark place, but these particles cannot be touched even though one can see them.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "25:23",
            "10:41",
            "36:42",
            "47:1",
            "47:28",
            "47:8",
            "39:65",
            "21:82",
            "46:19",
            "8:3"
        ],
        "BIBLE": [
            "torah:exodus:34:10",
            "writings:job:41:20",
            "prophets:jeremiah:31:13",
            "writings:ii%20chronicles:6:24",
            "torah:exodus:23:27",
            "prophets:i%20kings:8:33",
            "prophets:zephaniah:3:20",
            "prophets:hosea:11:8",
            "prophets:ezekiel:29:12",
            "writings:psalms:21:13"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:10",
            "Sefer%20Yetzirah:2:3",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:4:8",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:3:4"
        ]
    }
}