{
    "VERSE": "25:24",
    "ARABIC": "أَصْحَٰبُ ٱلْجَنَّةِ يَوْمَئِذٍ خَيْرٌ مُّسْتَقَرًّا وَأَحْسَنُ مَقِيلًا",
    "ENGLISH": {
        "TRANSLATION_0": "The Companions of the Garden on that Day will have better lodging and a better resting-place,",
        "TRANSLATION_1": "The inmates of Paradise will have a better abode that day, and a better resting place.\n",
        "TRANSLATION_2": "(On the contrary) only those who have deserved the Garden, will have a good abode on that Day and a cool place for midday rest.\n",
        "TRANSLATION_3": "The dwellers of Paradise on that day will have the best residence and resting place.\n",
        "TRANSLATION_4": "And for the People of the Garden on that day is a better destination and account, and a better place of afternoon rest.\n",
        "TRANSLATION_5": "The dwellers of Paradise will, on that Day, have the best abode, and have the fairest of places for repose.\n",
        "TRANSLATION_6": "The dwellers of the garden shall on that day be in a better abiding-place and a better resting-place.\n",
        "TRANSLATION_7": "The inhabitants of Paradise that day, better shall be their lodging, fairer their resting-place.\n",
        "TRANSLATION_8": "Those who have earned the Garden on that day will be better in their home and happier in their place of noonday rest;\n",
        "TRANSLATION_9": "The inhabitants of the Garden will have the best residence and the finest lodging on that Day.\n",
        "TRANSLATION_10": "Fellows of the Garden shall be on that Day in a goodly abode and a gocdly re pose.\n",
        "TRANSLATION_11": "On that day the inhabitants of paradise will be in the best abode and an excellent resting place.\n",
        "TRANSLATION_12": "The Companions of the Garden will be well, that Day, in their abode, and have the fairest of places for repose.\n",
        "TRANSLATION_13": "The dwellers of Paradise (i.e. those who deserved it through their Faith and righteousness) will, on that Day, have the best abode, and have the fairest of places for repose.\n",
        "TRANSLATION_14": "On that Day, the companions of Paradise (will have) a better abode and a finer restingplace.\n",
        "TRANSLATION_15": "The companions of Paradise on that Day will be better lodged, and more fairly accommodated.\n",
        "TRANSLATION_16": "The companions of Paradise, that Day, are [in] a better settlement and better resting place.\n",
        "TRANSLATION_17": "[25:24] Those who will be the inhabitants of Paradise on that day, the Day of Resurrection, will be in a [far] better abode, than are the disbelievers in this world, and a [far] better resting place, than theirs [the latter’s]; in other words, a [better] place for qā’ila, which is a rest taken during midday during hot days. From this [last interpretation of maqīlan] it has been inferred that the Reckoning will be concluded in half a day, as is stated in one hadīth.\n",
        "TRANSLATION_18": "(Those who have earned the Garden) Muhammad (pbuh) and his Companions (on that day) the Day of Judgement (will be better in their home) abode (and happier in their place of noonday rest) better and happier than the homes and places of Abu Jahl and their hosts;\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "25:24",
            "59:20",
            "2:82",
            "46:16",
            "11:23",
            "81:13",
            "27:89",
            "10:26",
            "26:90",
            "46:14"
        ],
        "BIBLE": [
            "prophets:isaiah:34:14",
            "prophets:ezekiel:26:5",
            "torah:deuteronomy:23:17",
            "prophets:joshua:3:3",
            "prophets:zechariah:8:8",
            "torah:deuteronomy:16:11",
            "prophets:jeremiah:17:6",
            "writings:ii%20chronicles:6:21",
            "prophets:zechariah:2:15",
            "prophets:i%20kings:8:30"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:9"
        ]
    }
}