{
    "VERSE": "25:25",
    "ARABIC": "وَيَوْمَ تَشَقَّقُ ٱلسَّمَآءُ بِٱلْغَمَٰمِ وَنُزِّلَ ٱلْمَلَٰٓئِكَةُ تَنزِيلًا",
    "ENGLISH": {
        "TRANSLATION_0": "the Day when Heaven is split apart in clouds, and the angels are sent down rank upon rank.",
        "TRANSLATION_1": "The day the heavens splits asunder with a dazzling white cloud gathering and the angels descend in a continuous stream,\n",
        "TRANSLATION_2": "On that Day, a cloud will appear rending the sky and the angels will be senthi down rank after rank.\n",
        "TRANSLATION_3": "On that day the sky will be crystal blue, clear of clouds. The angels will descend in groups\n",
        "TRANSLATION_4": "And the day when the sky will be split asunder with clouds and the angels will be sent down in full.\n",
        "TRANSLATION_5": "And (remember) the Day when the heaven shall be rent asunder with clouds, and the angels will be sent down, with a grand descending.\n",
        "TRANSLATION_6": "And on the day when the heaven shall burst asunder with the clouds, and the angels shall be sent down descending (in ranks).\n",
        "TRANSLATION_7": "Upon the day that heaven is split asunder with the clouds and the angels are sent down in majesty,\n",
        "TRANSLATION_8": "A day when the heaven with the clouds will be rent asunder and the angels will be sent down, a grand descent.\n",
        "TRANSLATION_9": "On a Day when the sky will split open with its clouds and the angels are sent down rank upon rank,\n",
        "TRANSLATION_10": "And on the Day whereon the heaven shall be rent asunderg from the q clouds and the angelhall be sent downll with a great descending.\n",
        "TRANSLATION_11": "The day when the sky with its clouds will be split open, and the angels will be sent down [in a majestic] descent,\n",
        "TRANSLATION_12": "The Day the heaven shall be rent asunder with clouds, and angels shall be sent down, descending (in ranks),-\n",
        "TRANSLATION_13": "And (remember) the Day when the heaven shall be rent asunder with clouds, and the angels will be sent down, with a grand descending.\n",
        "TRANSLATION_14": "On that Day, the heaven is split asunder with clouds and the angels are sent down in majesty,\n",
        "TRANSLATION_15": "The Day when the sky is cleft with clouds, and the angels are sent down in streams.\n",
        "TRANSLATION_16": "And [mention] the Day when the heaven will split open with [emerging] clouds, and the angels will be sent down in successive descent.\n",
        "TRANSLATION_17": "[25:25] And on the day when the heaven, each of the [seven] heavens, will be split asunder with the clouds, in other words, [split asunder] together with them [the clouds] (al-ghamām is white cloud) and the angels will be sent down, from every heaven, in a [majestic] descent, and this is the Day of Resurrection (it [yawma, ‘on the day’] is in the accusative because of an implied [preceding] udhkur, ‘mention’; a variant reading [for tashaqqaqu] is tashshaqqaqu, ‘will be split asunder’, where the second tā’ [of the original form tatashaqqaqu] has been assimilated with it the [the shīn]; another variant reading [instead of nuzzila almalā’ikatu, ‘the angels will be sent down’] has nunzilu al-malā’ikata, ‘We will send down the angels’);\n",
        "TRANSLATION_18": "(A day when the heaven with the clouds will be rent asunder) for the descent of Allah and this descent is without any modality (bi-la kayf) (and the angels will be sent down, a grand descent) one after another.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "25:25",
            "70:8",
            "52:9",
            "45:27",
            "86:1",
            "44:10",
            "34:40",
            "81:11",
            "77:9",
            "88:18"
        ],
        "BIBLE": [
            "prophets:ezekiel:30:16",
            "writings:job:26:8",
            "torah:genesis:9:16",
            "writings:lamentations:2:1",
            "prophets:ezekiel:30:3",
            "writings:song%20of%20songs:6:7",
            "prophets:isaiah:30:25",
            "prophets:joel:2:2",
            "torah:deuteronomy:16:3",
            "prophets:ezekiel:38:16"
        ]
    }
}