{
    "VERSE": "25:27",
    "ARABIC": "وَيَوْمَ يَعَضُّ ٱلظَّالِمُ عَلَىٰ يَدَيْهِ يَقُولُ يَٰلَيْتَنِى ٱتَّخَذْتُ مَعَ ٱلرَّسُولِ سَبِيلًا",
    "ENGLISH": {
        "TRANSLATION_0": "the Day when a wrongdoer will bite his hands and say, 'Alas for me! If only I had gone the way of the",
        "TRANSLATION_1": "The sinner will then bite his hand and say: \"Would that I had taken the road with the Prophet.\n",
        "TRANSLATION_2": "The unjust man will bite at his hand and say, \"Would that I had stood by the Messenger!\n",
        "TRANSLATION_3": "It will be a hard day for the unbelievers. It will be a day when the unjust will bite their fingers, (regretfully) saying, \"Would that we had followed the path of the Messengers.\n",
        "TRANSLATION_4": "And the day when the unjust will gnaw his hands, saying, “Alas, if only I had chosen a way along with the (Noble) Messenger (of Allah)!”\n",
        "TRANSLATION_5": "And (remember) the Day when the wrongdoer will bite at his hands, he will say: \"Oh! Would that I had taken a path with the Messenger.\"\n",
        "TRANSLATION_6": "And the day when the unjust one shall bite his hands saying: O! would that I had taken a way with the Apostle\n",
        "TRANSLATION_7": "Upon the day the evildoer shall bite his hands, saying, 'Would that I had taken a way along with the Messenger!\n",
        "TRANSLATION_8": "On the day when the wrong-doer gnaweth his hands, he will say: Ah, would that I had chosen a way together with the messenger (of Allah)!\n",
        "TRANSLATION_9": "On that Day, the wrongdoer will bite his hands and say, \"Would that I had walked in the Messenger's path!\n",
        "TRANSLATION_10": "On the Day when the wrong-doer shall gnaw his hands saying: would that had taken with the apostle a way!\n",
        "TRANSLATION_11": "It will be a day when the wrongdoer will bite his hands, saying, ‘I wish I had followed the Apostle’s way!\n",
        "TRANSLATION_12": "The Day that the wrong-doer will bite at his hands, he will say, \"Oh! would that I had taken a (straight) path with the Messenger!\n",
        "TRANSLATION_13": "And (remember) the Day when the Zalim (wrong-doer, oppressor, polytheist, etc.) will bite at his hands, he will say: \"Oh! Would that I had taken a path with the Messenger (Muhammad SAW).\n",
        "TRANSLATION_14": "Upon that Day the harmdoer shall bite his hands, and say: 'Would that I had taken a Path with the Messenger!\n",
        "TRANSLATION_15": "On that Day, the wrongdoer will bite his hands, and say, “If only I had followed the way with the Messenger.\n",
        "TRANSLATION_16": "And the Day the wrongdoer will bite on his hands [in regret] he will say, \"Oh, I wish I had taken with the Messenger a way.\n",
        "TRANSLATION_17": "[25:27] And [it will be] a day when the wrongdoer, the idolater, ‘Uqba b. Abī Mu‘ayt — who had uttered the two-part profession [‘there is no god but God, Muhammad (s) is His Messenger’] but retracted it in order to please Ubayy b. Khalaf — will bite his hands, in regret and anguish on the Day of Resurrection, saying, ‘O (yā is for drawing attention) would that I had followed a way with the Messenger!, Muhammad (s), a route to guidance.\n",
        "TRANSLATION_18": "399 (On the day when the wrong-doer) the disbeliever, i.e. 'Uqbah Ibn Ma'it (gnaweth his hands) his fingers, (he will say: Ah, would that I had chosen a way together with the messenger (of Allah)) would that I had chosen, and were upright in following the religion of the Prophet!\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "25:27",
            "40:32",
            "33:66",
            "40:38",
            "3:194",
            "19:33",
            "36:65",
            "23:51",
            "40:51",
            "14:41"
        ],
        "BIBLE": [
            "prophets:i%20samuel:12:4",
            "prophets:ii%20kings:8:8",
            "prophets:ezekiel:33:8",
            "torah:numbers:27:18",
            "torah:genesis:24:61",
            "prophets:ii%20kings:6:19",
            "prophets:i%20samuel:17:26",
            "prophets:ii%20kings:2:10",
            "prophets:ii%20kings:6:7",
            "torah:genesis:43:15"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:4:11",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:6"
        ]
    }
}