{
    "VERSE": "25:29",
    "ARABIC": "لَّقَدْ أَضَلَّنِى عَنِ ٱلذِّكْرِ بَعْدَ إِذْ جَآءَنِى وَكَانَ ٱلشَّيْطَٰنُ لِلْإِنسَٰنِ خَذُولًا",
    "ENGLISH": {
        "TRANSLATION_0": "He led me astray from the Reminder after it came to me.' Shaytan always leaves man in the lurch.",
        "TRANSLATION_1": "He led me astray from the Warning after it had come to me. Satan always betrays man.\n",
        "TRANSLATION_2": "For it was he, who had deluded me to reject the Admonition which had come to me. Satan has proved very treacherous to man. \"\n",
        "TRANSLATION_3": "He led me away from the true guidance after it had come to us. Satan is a traitor to people.\"\n",
        "TRANSLATION_4": "“He indeed led me astray from the advice that had come to me”; and Satan deserts man, leaving him unaided.\n",
        "TRANSLATION_5": "He indeed led me astray from the Reminder after it had come to me. And Shaytan is to man ever a deserter.\"\n",
        "TRANSLATION_6": "Certainly he led me astray from the reminder after it had come to me; and the Shaitan fails to aid man.\n",
        "TRANSLATION_7": "He indeed led me astray from the Remembrance, after it had come to me; Satan is ever a forsaker of men.'\n",
        "TRANSLATION_8": "He verily led me astray from the Reminder after it had reached me. Satan was ever man's deserter in the hour of need.\n",
        "TRANSLATION_9": "he made me forgetful of the warning after it had reached me. Satan is man's great betrayer.\"\n",
        "TRANSLATION_10": "Assuredly he misled me from the admonition after it had come unto ine. Verily the Satan is ever unto man a betrayer.\n",
        "TRANSLATION_11": "Certainly he led me astray from the Reminder after it had come to me, and Satan is a deserter of man.’\n",
        "TRANSLATION_12": "He did lead me astray from the Message (of Allah) after it had come to me! Ah! the Evil One is but a traitor to man!\"\n",
        "TRANSLATION_13": "He indeed led me astray from the Reminder (this Quran) after it had come to me. And Shaitan (Satan) is ever a deserter to man in the hour of need.\"\n",
        "TRANSLATION_14": "He led me astray from the Remembrance after it had reached me, satan is ever the foresaker of humans'\n",
        "TRANSLATION_15": "He led me away from the Message after it had come to me; for Satan has always been a betrayer of man.”\n",
        "TRANSLATION_16": "He led me away from the remembrance after it had come to me. And ever is Satan, to man, a deserter.\"\n",
        "TRANSLATION_17": "[25:29] Verily he has led me astray from the Remembrance, namely, the Qur’ān, after it had come to me, by causing me to recant my belief in it. God, exalted be He, says: And Satan is ever a deserter of, the disbelieving, man’, abandoning him and dissociating from him in [times of] tribulation.\n",
        "TRANSLATION_18": "(He verily led me astray from the Reminder) from Allah's divine Oneness and obedience (after it had reached me) after Muhammad (pbuh) reached me with Allah's divine Oneness. (Satan was ever man's deserter in the hour of need) he lets him down at the time of need.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "25:29",
            "17:53",
            "99:3",
            "90:4",
            "23:12",
            "43:62",
            "47:25",
            "22:53",
            "29:38",
            "26:210"
        ],
        "BIBLE": [
            "prophets:i%20samuel:14:20",
            "prophets:i%20kings:17:18",
            "prophets:isaiah:57:1",
            "prophets:jeremiah:9:1",
            "writings:ii%20chronicles:6:32",
            "torah:numbers:22:17",
            "writings:job:42:11",
            "writings:esther:8:6",
            "prophets:ezekiel:12:16",
            "torah:numbers:22:20"
        ]
    }
}