{
    "VERSE": "25:30",
    "ARABIC": "وَقَالَ ٱلرَّسُولُ يَٰرَبِّ إِنَّ قَوْمِى ٱتَّخَذُوا۟ هَٰذَا ٱلْقُرْءَانَ مَهْجُورًا",
    "ENGLISH": {
        "TRANSLATION_0": "The Messenger says, 'My Lord, my people treat this Qur'an as something to be ignored.'",
        "TRANSLATION_1": "The prophet will say: \"O my Lord, my people had fettered the Qur'an.\"\n",
        "TRANSLATION_2": "And the Messenger will say, \"O my Lord, my people had made this Qur'an the object of their ridicule.\"\n",
        "TRANSLATION_3": "The Messengers will say, \"Lord, my people had abandoned this Quran.\"\n",
        "TRANSLATION_4": "And the Noble Messenger submitted, “O my Lord – indeed my people took this Qur’an as worthy of being abandoned.”\n",
        "TRANSLATION_5": "And the Messenger will say: \"O my Lord! Verily, my people deserted this Qur'an.\"\n",
        "TRANSLATION_6": "And the Apostle cried out: O my Lord! surely my people have treated this Quran as a forsaken thing.\n",
        "TRANSLATION_7": "The Messenger says, 'O my Lord, behold, my people have taken this Koran as a thing to be shunned.'\n",
        "TRANSLATION_8": "And the messenger saith: O my Lord! Lo! mine own folk make this Qur'an of no account.\n",
        "TRANSLATION_9": "The Messenger will say, \"Lord, my people did indeed discard the Quran,\"\n",
        "TRANSLATION_10": "And the Apostle will say: my lord! verily my people too k this Qur'an as a thing to be shunned.\n",
        "TRANSLATION_11": "And the Apostle will say, ‘O my Lord! Indeed my people consigned this Quran to oblivion.’\n",
        "TRANSLATION_12": "Then the Messenger will say: \"O my Lord! Truly my people took this Qur'an for just foolish nonsense.\"\n",
        "TRANSLATION_13": "And the Messenger (Muhammad SAW) will say: \"O my Lord! Verily, my people deserted this Quran (neither listened to it, nor acted on its laws and orders).\n",
        "TRANSLATION_14": "The Messenger says: 'O my Lord, my people have taken this Koran while deserting it'\n",
        "TRANSLATION_15": "And the Messenger will say, “My Lord, my people have abandoned this Quran.”\n",
        "TRANSLATION_16": "And the Messenger has said, \"O my Lord, indeed my people have taken this Qur'an as [a thing] abandoned.\"\n",
        "TRANSLATION_17": "[25:30] And the Messenger, Muhammad (s), says, ‘O my Lord, lo! my people, the [tribe of] Quraysh, consider this Qur’ān as something to be shunned’, to be disregarded.\n",
        "TRANSLATION_18": "(And the messenger) Muhammad (pbuh) (saith: my Lord! Lo! mine own folk make this Qur'an of no account) they speak ill of it, they do not believe in it and do not act upon its teachings.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "25:30",
            "43:88",
            "26:117",
            "7:104",
            "7:79",
            "7:61",
            "7:67",
            "29:30",
            "6:78",
            "26:10"
        ],
        "BIBLE": [
            "torah:exodus:34:10",
            "writings:daniel:6:13",
            "prophets:i%20kings:20:34",
            "prophets:ii%20samuel:11:25",
            "prophets:ezekiel:35:3",
            "prophets:joshua:9:11",
            "prophets:jeremiah:38:14",
            "prophets:i%20samuel:12:22",
            "torah:exodus:24:8",
            "torah:genesis:18:31"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:2:2",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:4:2"
        ]
    }
}