{
    "VERSE": "25:32",
    "ARABIC": "وَقَالَ ٱلَّذِينَ كَفَرُوا۟ لَوْلَا نُزِّلَ عَلَيْهِ ٱلْقُرْءَانُ جُمْلَةً وَٰحِدَةً كَذَٰلِكَ لِنُثَبِّتَ بِهِۦ فُؤَادَكَ وَرَتَّلْنَٰهُ تَرْتِيلًا",
    "ENGLISH": {
        "TRANSLATION_0": "Those who are kafir say, 'Why was the Qur'an not sent down to him all in one go?' It is so that We can fortify your heart by it. We have recited it distinctly, little by little.",
        "TRANSLATION_1": "The unbelievers say: \"Why was the whole Qur'an not sent down all at once to him?\" It was sent thus that We may keep your heart resolute. So We enunciated it by steps and distinctly.\n",
        "TRANSLATION_2": "The disbelievers say, \"Why has not the entire Qur'an been sent down to this man all at nce?\" -Well, this has been done to impress it deeply on your mind, and (for the same object) We have sent it down piecemeal by degrees.\n",
        "TRANSLATION_3": "The unbelievers have said, \"Why was the whole Quran not revealed to him at once?\" We have revealed it to you in gradual steps to strengthen your hearts and give you explanations.\n",
        "TRANSLATION_4": "And the disbelievers say, “Why was the Qur’an not sent down to him all at once?” This is how We sent it in stages, in order to strengthen your heart with it and We read it slowly, in stages.\n",
        "TRANSLATION_5": "And those who disbelieve say: \"Why is not the Qur'an revealed to him all at once\" Thus, that We may strengthen your heart thereby. And We have revealed it to you gradually, in stages.\n",
        "TRANSLATION_6": "And those who disbelieve say: Why has not the Quran been revealed to him all at once? Thus, that We may strengthen your heart by it and We have arranged it well in arranging.\n",
        "TRANSLATION_7": "The unbelievers say, 'Why has the Koran not been sent down upon him all at once?' Even so, that We may strengthen thy heart thereby, and We have chanted it very distinctly.\n",
        "TRANSLATION_8": "And those who disbelieve say: Why is the Qur'an not revealed unto him all at once? (It is revealed) thus that We may strengthen thy heart therewith; and We have arranged it in right order.\n",
        "TRANSLATION_9": "Those who deny the truth say, \"Why was the Quran not sent down to him in a single revelation?\" We sent it in this manner, so that We might strengthen your heart. We gave it to you in gradual revelation.\n",
        "TRANSLATION_10": "And those who disbelieve say: wherefore is the Qur'an not revealed unto him entire at once! Thus---We reveal- that We may establish thy heart there with; and We have repeated it with a repetition.\n",
        "TRANSLATION_11": "The faithless say, ‘Why has not the Quran been sent down to him all at once?’ So it was, that We may strengthen your heart with it, and We have recited it [to you] in a measured tone.\n",
        "TRANSLATION_12": "Those who reject Faith say: \"Why is not the Qur'an revealed to him all at once? Thus (is it revealed), that We may strengthen thy heart thereby, and We have rehearsed it to thee in slow, well-arranged stages, gradually.\n",
        "TRANSLATION_13": "And those who disbelieve say: \"Why is not the Quran revealed to him all at once?\" Thus (it is sent down in parts), that We may strengthen your heart thereby. And We have revealed it to you gradually, in stages. (It was revealed to the Prophet SAW in 23 years.).\n",
        "TRANSLATION_14": "The unbelievers ask: 'Why was the Koran not sent down to him all at once' As such We strengthen your heart thereby, and We have recited it very distinctly.\n",
        "TRANSLATION_15": "Those who disbelieve say, “Why was the Quran not revealed to him at once?” Thus in order to strengthen your heart thereby, and We revealed it in stages.\n",
        "TRANSLATION_16": "And those who disbelieve say, \"Why was the Qur'an not revealed to him all at once?\" Thus [it is] that We may strengthen thereby your heart. And We have spaced it distinctly.\n",
        "TRANSLATION_17": "[25:32] And those who disbelieve say, ‘Why has the Qur’ān not been revealed to him all at once?’, as the Torah, the Gospel and the Book of Psalms [were]. God, exalted be He, says: We have revealed it, thus, in parts, [it is], that We may strengthen your inner-heart with it, and We have arranged it in a specific order, that is to say, We produce it in stages one part after another, gradually and deliberately, in order to facilitate its comprehension and its memorisation.\n",
        "TRANSLATION_18": "(And those who disbelieve) Abu Jahl and his host (say: Why is the Qur'an not revealed unto him all at once) just like the Torah was revealed all at once to Moses, and the Gospel to Jesus and the Psalms to David? ((It is revealed) thus) He says: We have sent Gabriel with the Qur'an in instalments (that We may strengthen thy heart therewith) that We may gladden your heart and preserve your heart; (and We have arranged it in right order) We exposited it by detailing the commands and prohibitions; it is also said that this means: We have sent Gabriel with the Qur'an in instalments verse after verse.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "25:32",
            "73:4",
            "6:113",
            "20:2",
            "76:23",
            "17:106",
            "104:7",
            "28:10",
            "41:26",
            "7:70"
        ],
        "BIBLE": [
            "torah:genesis:20:16",
            "prophets:i%20kings:3:6",
            "writings:ecclesiastes:1:13",
            "prophets:joshua:6:2",
            "prophets:ii%20kings:10:15",
            "prophets:ezekiel:4:15",
            "prophets:i%20kings:3:12",
            "writings:ii%20chronicles:19:6",
            "prophets:jeremiah:35:15",
            "writings:psalms:119:34"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:4"
        ]
    }
}