{
    "VERSE": "25:36",
    "ARABIC": "فَقُلْنَا ٱذْهَبَآ إِلَى ٱلْقَوْمِ ٱلَّذِينَ كَذَّبُوا۟ بِـَٔايَٰتِنَا فَدَمَّرْنَٰهُمْ تَدْمِيرًا",
    "ENGLISH": {
        "TRANSLATION_0": "We said, 'Go to the people who have denied Our Signs,' and We annihilated them completely.",
        "TRANSLATION_1": "Then We told them: \"Go to the people who have rejected Our signs.\" Then We annihilated them completely.\n",
        "TRANSLATION_2": "then We said to them, \"Go to the people who have treated Our Revelations as false. \" So We annihilated those people utterly.\n",
        "TRANSLATION_3": "We told them, \"Both of you go to the people who have rejected Our revelations.\" We completely destroyed these unbelievers.\n",
        "TRANSLATION_4": "We therefore said, “Go, both of you, to the people who have denied Our signs”; then ruining the people, We destroyed them completely.\n",
        "TRANSLATION_5": "And We said: \"Go you both to the people who have denied Our Ayat.\" Then We destroyed them with utter destruction.\n",
        "TRANSLATION_6": "Then We said: Go you both to the people who rejected Our communications; so We destroyed them with utter destruction.\n",
        "TRANSLATION_7": "and We said, 'Go to the people who have cried lies to Our signs'; then We destroyed them utterly.\n",
        "TRANSLATION_8": "Then We said: Go together unto the folk who have denied Our revelations. Then We destroyed them, a complete destruction.\n",
        "TRANSLATION_9": "Then We said, \"Go together to the people who have denied Our signs.\" We utterly destroyed them!\n",
        "TRANSLATION_10": "Then We said: go ye twain unto a people who have belied Our signs. Then We annihilated them an utter annihilation.\n",
        "TRANSLATION_11": "Then We said, ‘Let the two of you go to the people who have denied Our signs.’ Then We destroyed them utterly.\n",
        "TRANSLATION_12": "And We command: \"Go ye both, to the people who have rejected our Signs:\" And those (people) We destroyed with utter destruction.\n",
        "TRANSLATION_13": "And We said: \"Go you both to the people who have denied Our Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.).\" Then We destroyed them with utter destruction.\n",
        "TRANSLATION_14": "(Then) We said: 'Go to the nation who have belied Our signs' And We utterly destroyed them.\n",
        "TRANSLATION_15": "We said, “Go to the people who rejected Our signs,” and We destroyed them completely.\n",
        "TRANSLATION_16": "And We said, \"Go both of you to the people who have denied Our signs.\" Then We destroyed them with [complete] destruction.\n",
        "TRANSLATION_17": "[25:36] Then We said, ‘Go both of you to the people who have denied Our signs’, that is, to the Egyptians — Pharaoh and his folk. So they went to them with the Message but they [the Egyptians] denied both of them. Then We destroyed them utterly.\n",
        "TRANSLATION_18": "(Then We said: Go together unto the folk who have denied Our revelations) those who disbelieved in Our nine signs, i.e. Pharaoh and his people, the Copts. (Then We destroyed them, a complete destruction) by 400 drowning them.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "25:36",
            "21:77",
            "7:177",
            "7:64",
            "6:98",
            "6:105",
            "43:69",
            "27:52",
            "51:32",
            "45:31"
        ],
        "BIBLE": [
            "prophets:isaiah:22:4",
            "torah:numbers:14:11",
            "prophets:ezekiel:36:20",
            "torah:genesis:41:55",
            "prophets:ezekiel:36:3",
            "writings:daniel:2:24",
            "prophets:ii%20kings:5:4",
            "prophets:i%20kings:20:42",
            "torah:genesis:25:22",
            "prophets:ii%20samuel:2:27"
        ]
    }
}