{
    "VERSE": "25:37",
    "ARABIC": "وَقَوْمَ نُوحٍ لَّمَّا كَذَّبُوا۟ ٱلرُّسُلَ أَغْرَقْنَٰهُمْ وَجَعَلْنَٰهُمْ لِلنَّاسِ ءَايَةً وَأَعْتَدْنَا لِلظَّٰلِمِينَ عَذَابًا أَلِيمًا",
    "ENGLISH": {
        "TRANSLATION_0": "And when the people of Nuh denied the Messengers, We drowned them and made them a Sign for all",
        "TRANSLATION_1": "We had drowned the people of Noah when they had accused the apostles of lies, and turned them into an example for men. We have prepared a painful punishment for the wicked.\n",
        "TRANSLATION_2": "The same was the case with the people of Noah when they charged the Messenger with imposture: We drowned them and made them a sign of warning for entire mankind, and We have prepared a painful chastisement for the unjust.\n",
        "TRANSLATION_3": "We drowned the people of Noah because of their rejection of the Messengers and made them evidence of the Truth for mankind. We have prepared a painful torment for the unjust ones.\n",
        "TRANSLATION_4": "And the people of Nooh – when they denied the Noble Messengers, We drowned them and made them a sign for mankind; and We have kept prepared a painful punishment for the unjust.\n",
        "TRANSLATION_5": "And Nuh's people, when they denied the Messengers, We drowned them, and We made them as a sign for mankind. And We have prepared a painful torment for the wrongdoers.\n",
        "TRANSLATION_6": "And the people of Nuh, when they rejected the apostles, We drowned them, and made them a sign for men, and We have prepared a painful punishment for the unjust;\n",
        "TRANSLATION_7": "And the people of Noah, when they cried lies to the Messengers, We drowned them, and made them to be a sign to mankind; and We have prepared for the evildoers a painful chastisement.\n",
        "TRANSLATION_8": "And Noah's folk, when they denied the messengers, We drowned them and made of them a portent for mankind. We have prepared a painful doom for evil-doers.\n",
        "TRANSLATION_9": "We drowned the people of Noah also when they rejected their messengers and We made them an example to all mankind. We have prepared a painful punishment for the wrongdoers,\n",
        "TRANSLATION_10": "And the people of Nuh! When they belied the apostles We drowned them, and made them a sign unto mankind. And We have gotten ready unto the wrong-doers a torment afflictive,\n",
        "TRANSLATION_11": "And Noah’s people, We drowned them when they impugned the apostles, and We made them a sign for mankind, and We have prepared for the wrongdoers a painful punishment.\n",
        "TRANSLATION_12": "And the people of Noah,- when they rejected the messengers, We drowned them, and We made them as a Sign for mankind; and We have prepared for (all) wrong-doers a grievous Penalty;-\n",
        "TRANSLATION_13": "And Nuh's (Noah) people, when they denied the Messengers We drowned them, and We made them as a sign for mankind. And We have prepared a painful torment for the Zalimun (polytheists and wrong-doers, etc).\n",
        "TRANSLATION_14": "The nation of Noah, We drowned them when they belied their Messenger, and made of them a sign to the nation. For the harmdoers We have prepared a painful punishment\n",
        "TRANSLATION_15": "And the people of Noah: when they rejected the messengers, We drowned them, and made them a lesson for mankind. We have prepared for the wrongdoers a painful retribution.\n",
        "TRANSLATION_16": "And the people of Noah - when they denied the messengers, We drowned them, and We made them for mankind a sign. And We have prepared for the wrongdoers a painful punishment.\n",
        "TRANSLATION_17": "[25:37] And, mention, the people of Noah, when they denied the messengers, in denying Noah — it is as though he were many messengers given the length of time he remained among them; or [it is thus expressed in the plural] because to deny him is [equivalent] to denying all the other messengers, for they all came with the same [Message concerning] affirmation of God’s Oneness — We drowned them (this is the response to lammā, ‘when’) and made them a sign, a lesson, for mankind, thereafter, and We have prepared, in the Hereafter, for the evildoers, the disbelievers, a painful chastisement, in addition to what [chastisement] may befall them in this world.\n",
        "TRANSLATION_18": "(And Noah's folk) and We destroyed the people of Noah, (when they denied the messengers) i.e. Noah and the rest of messengers, (We drowned them) by means of the flood (and made of them a portent for mankind) We made them an admonition for other people so that they do not follow their example. (We have prepared a painful doom) in the Fire (for evil-doers) for the idolaters, the idolaters of Mecca.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "25:37",
            "51:37",
            "44:11",
            "4:161",
            "10:97",
            "58:5",
            "46:31",
            "3:21",
            "34:5",
            "9:90"
        ],
        "BIBLE": [
            "prophets:ezekiel:38:12",
            "prophets:i%20kings:2:43",
            "prophets:ii%20kings:17:15",
            "prophets:judges:20:8",
            "prophets:isaiah:1:4",
            "prophets:ezekiel:11:15",
            "prophets:i%20kings:20:39",
            "prophets:ezekiel:26:2",
            "prophets:jeremiah:26:3",
            "prophets:i%20samuel:14:28"
        ]
    }
}