{
    "VERSE": "25:39",
    "ARABIC": "وَكُلًّا ضَرَبْنَا لَهُ ٱلْأَمْثَٰلَ وَكُلًّا تَبَّرْنَا تَتْبِيرًا",
    "ENGLISH": {
        "TRANSLATION_0": "We gave examples to each one of them and each one of them We utterly wiped out.",
        "TRANSLATION_1": "We administered warnings to each of them, and then destroyed them completely.\n",
        "TRANSLATION_2": "We admonished each one of them by citing the examples (of those who were destroyed before them) and ultimately annihilated all of them.\n",
        "TRANSLATION_3": "We gave guidance and drove each to destruction.\n",
        "TRANSLATION_4": "And We illustrated examples to each one of them; and ruining them, annihilated them all.\n",
        "TRANSLATION_5": "And for each We put forward examples, and each We brought to utter ruin.\n",
        "TRANSLATION_6": "And to every one We gave examples and every one did We destroy with utter destruction.\n",
        "TRANSLATION_7": "for each We struck similitudes, and each We ruined utterly.\n",
        "TRANSLATION_8": "Each (of them) We warned by examples, and each (of them) We brought to utter ruin.\n",
        "TRANSLATION_9": "To each of them We gave warnings and each of them We destroyed completely.\n",
        "TRANSLATION_10": "And unto each! We propounded similitude thereunto; and each We ruined an utter ruin.\n",
        "TRANSLATION_11": "For each of them We drew examples, and each We destroyed utterly.\n",
        "TRANSLATION_12": "To each one We set forth Parables and examples; and each one We broke to utter annihilation (for their sins).\n",
        "TRANSLATION_13": "And for each of them We put forward examples (as proofs and lessons, etc.), and each (of them) We brought to utter ruin (because of their disbelief and evil deeds).\n",
        "TRANSLATION_14": "to each of them We gave examples, and each of them We utterly ruined.\n",
        "TRANSLATION_15": "To each We presented the parables; and each We devastated utterly.\n",
        "TRANSLATION_16": "And for each We presented examples [as warnings], and each We destroyed with [total] destruction.\n",
        "TRANSLATION_17": "[25:39] For each [of them] We struck similitudes, when establishing arguments against them, and We destroyed them only after warning [them], and each [of them] We ruined utterly, We destroyed utterly, because of their denial of the prophets sent to them.\n",
        "TRANSLATION_18": "(Each (of them) We warned by examples) We explained to each generation the chastisement We inflicted upon the generations before them, but still they did not believe, (and each (of them) We brought to utter ruin) one after the other.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "25:39",
            "39:27",
            "36:42",
            "6:86",
            "43:56",
            "36:13",
            "29:43",
            "21:72",
            "17:89",
            "16:74"
        ],
        "BIBLE": [
            "prophets:ii%20samuel:23:16",
            "writings:i%20chronicles:11:18",
            "torah:exodus:32:24",
            "prophets:i%20kings:5:23",
            "prophets:ezekiel:17:18",
            "writings:psalms:89:41",
            "prophets:ezekiel:5:16",
            "prophets:ezekiel:34:4",
            "torah:genesis:24:43",
            "writings:ruth:4:7"
        ]
    }
}