{
    "VERSE": "25:4",
    "ARABIC": "وَقَالَ ٱلَّذِينَ كَفَرُوٓا۟ إِنْ هَٰذَآ إِلَّآ إِفْكٌ ٱفْتَرَىٰهُ وَأَعَانَهُۥ عَلَيْهِ قَوْمٌ ءَاخَرُونَ فَقَدْ جَآءُو ظُلْمًا وَزُورًا",
    "ENGLISH": {
        "TRANSLATION_0": "Those who are kafir say, 'This is nothing but a lie he has invented and other people have helped him to do it. They have brought injustice and falsehood.'",
        "TRANSLATION_1": "Yet the unbelievers say: \"This is nothing but a lie he has concocted in which others have aided him.\" They have come down to mischief and lies.\n",
        "TRANSLATION_2": "Those who have rejected the Message of the Prophet, say, \"This (Al-Furgan) is a forgery which this man himself has devised, and some others have helped him at it. \" What a cruel injustice and an impudent lie!\n",
        "TRANSLATION_3": "The unbelievers say, \"This (Quran) is no more than a slanderous statement which he (Muhammad), with the help of some other people, has falsely invented.\" Certainly, this statement is unjust and sinful.\n",
        "TRANSLATION_4": "And the disbelievers said, “This is nothing but a slur he has fabricated and others have helped him upon it”; so indeed the disbelievers have stooped to injustice and lie.\n",
        "TRANSLATION_5": "Those who disbelieve say: \"This is nothing but a lie that he has invented, and others have helped him in it.\" In fact, they have produced an unjust wrong and a lie.\n",
        "TRANSLATION_6": "And those who disbelieve say: This is nothing but a lie which he has forged, and other people have helped him at it; so indeed they have done injustice and (uttered) a falsehood.\n",
        "TRANSLATION_7": "The unbelievers say, 'This is naught but a calumny he has forged, and other folk have helped him to it.' So they have committed wrong and falsehood.\n",
        "TRANSLATION_8": "Those who disbelieve say: This is naught but a lie that he hath invented, and other folk have helped him with it, so that they have produced a slander and a lie.\n",
        "TRANSLATION_9": "Those who deny the truth say, \"This is only a forgery of his own invention in which others have helped him.\" What they say is unjust and false.\n",
        "TRANSLATION_10": "And those who disbelieve, say. this is naught but a falsehood thathe hath fabricated and there have assisted him therein other people. so surelythey have aimed at a wrong and a fraud.\n",
        "TRANSLATION_11": "The faithless say, ‘This is nothing but a lie that he has fabricated, and other people have abetted him in it.’ Thus they have certainly come out with wrongdoing and falsehood.\n",
        "TRANSLATION_12": "But the misbelievers say: \"Naught is this but a lie which he has forged, and others have helped him at it.\" In truth it is they who have put forward an iniquity and a falsehood.\n",
        "TRANSLATION_13": "Those who disbelieve say: \"This (the Quran) is nothing but a lie that he (Muhammad SAW) has invented, and others have helped him at it, so that they have produced an unjust wrong (thing) and a lie.\"\n",
        "TRANSLATION_14": "The unbelievers say: 'This is but a falsehood he has forged? another nation has helped him' So they have come with wrong and falsehood.\n",
        "TRANSLATION_15": "Those who disbelieve say, “This is nothing but a lie that he made up, and others have helped him at it.” They have committed an injustice and a perjury.\n",
        "TRANSLATION_16": "And those who disbelieve say, \"This [Qur'an] is not except a falsehood he invented, and another people assisted him in it.\" But they have committed an injustice and a lie.\n",
        "TRANSLATION_17": "[25:4] And those who disbelieve say, ‘This, Qur’ān, is nothing but a calumny, a lie, that he, Muhammad (s), has invented, and other folk have helped him with it’, who [according to the disbelievers] were from among the People of the Scripture. God, exalted be He, says: Verily thus they have committed wrong and [spoken] falsehood, [they have come with] disbelief and mendacity.\n",
        "TRANSLATION_18": "(Those who disbelieve) the disbelievers of Mecca (say: This) Qur'an (is naught but a lie that he hath invented) that Muhammad (pbuh) has invented, (and other folk) Jabr, Yasar and Fukayhah al-Rumi (have helped him with it) to invent it, (so that they have produced a slander and a lie.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "25:4",
            "44:28",
            "11:36",
            "46:11",
            "23:46",
            "52:32",
            "43:54",
            "23:33",
            "11:57",
            "41:7"
        ],
        "BIBLE": [
            "prophets:jeremiah:14:14",
            "prophets:isaiah:43:9",
            "prophets:joshua:22:20",
            "prophets:ezekiel:11:2",
            "torah:genesis:6:7",
            "torah:leviticus:8:5",
            "torah:leviticus:20:17",
            "prophets:ezekiel:8:17",
            "prophets:i%20kings:20:42",
            "prophets:ii%20kings:23:17"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:1:8"
        ]
    }
}