{
    "VERSE": "25:40",
    "ARABIC": "وَلَقَدْ أَتَوْا۟ عَلَى ٱلْقَرْيَةِ ٱلَّتِىٓ أُمْطِرَتْ مَطَرَ ٱلسَّوْءِ أَفَلَمْ يَكُونُوا۟ يَرَوْنَهَا بَلْ كَانُوا۟ لَا يَرْجُونَ نُشُورًا",
    "ENGLISH": {
        "TRANSLATION_0": "They themselves have come across the city which was rained on by an evil rain. Did they not then see it? But they do not expect to rise again.",
        "TRANSLATION_1": "They must have surely passed by the town on which We had rained the terrible rain of ruin. How could they not have seen it? Still they do not dread the Resurrection.\n",
        "TRANSLATION_2": "Surely, these people have passed by that habitation on which was rained an evil rain: have they not seen its ruins? But they do not expect another life in the Hereafter.\n",
        "TRANSLATION_3": "Our Messengers came into the town which was struck by a fatal rain. Did they (unbelievers), not see what had happened to this town? In fact, they had no faith in the Resurrection.\n",
        "TRANSLATION_4": "And indeed they have visited the township upon which had rained a harmful rain; so were they not seeing it? In fact, they never expected to be raised again.\n",
        "TRANSLATION_5": "And indeed they have passed by the town on which was rained the evil rain. Did they not then see it Nay! But they used not to expect any resurrection.\n",
        "TRANSLATION_6": "And certainly they have (often) passed by the town on which was rained an evil rain; did they not then see it? Nay! they did not hope to be raised again.\n",
        "TRANSLATION_7": "Surely they have come by the city that was rained on by an evil rain; what, have they not seen it? Nay, but they look for no upraising.\n",
        "TRANSLATION_8": "And indeed they have passed by the township whereon was rained the fatal rain. Can it be that they have not seen it? Nay, but they hope for no resurrection.\n",
        "TRANSLATION_9": "Indeed they must have come upon the town on which an evil rain had poured down. Did they not see it? Yet they have no faith in the Resurrection.\n",
        "TRANSLATION_10": "And assuredly they have gone by the township whereon was rained the evil rain. Are they not wont to see it? Aye! they expect not Resurrection.\n",
        "TRANSLATION_11": "Certainly they must have passed the town on which an evil shower was rained. Have they not seen it? Rather, they did not expect resurrection [to happen].\n",
        "TRANSLATION_12": "And the (Unbelievers) must indeed have passed by the town on which was rained a shower of evil: did they not then see it (with their own eyes)? But they fear not the Resurrection.\n",
        "TRANSLATION_13": "And indeed they have passed by the town [of Prophet Lout (Lot)] on which was rained the evil rain. Did they (disbelievers) not then see it (with their own eyes)? Nay! But they used not to expect for any resurrection.\n",
        "TRANSLATION_14": "They have surely passed by the village which was rained upon by evil rain (of stones); what, have they never seen it? No, they look for no resurrection.\n",
        "TRANSLATION_15": "And they came upon the city that was drenched by the terrible rain. Did they not see it? But they do not expect resurrection.\n",
        "TRANSLATION_16": "And they have already come upon the town which was showered with a rain of evil. So have they not seen it? But they are not expecting resurrection.\n",
        "TRANSLATION_17": "[25:40] And verily they, namely, the disbelievers of Mecca, will have passed by the town on which an evil shower was rained (al-saw’, ‘evil’, is the verbal noun from sā’a, ‘was evil’), that is, [it was showered] with stones. This was the principal town of the towns inhabited by the people of Lot; God destroyed its inhabitants for their committing acts of lewdness. Can it be that they have not seen it?, on their journeys to Syria, and so take heed thereof? (the interrogative is affirmative). Nay, but it is that they do not expect, they have [no] fear of [any], resurrection, and so they do not believe.\n",
        "TRANSLATION_18": "(And indeed they) the people of Mecca (have passed by the township) the town of Lot (whereon was rained the fatal rain) a rain of stones. (Can it be that they have not seen it) have they not seen what was done to it and to its people, and thus refrain from disbelieving in you and in what you say? (Nay, but they hope for no resurrection) they do not fear resurrection after death.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "25:40",
            "27:58",
            "26:173",
            "29:7",
            "12:82",
            "46:27",
            "21:95",
            "28:84",
            "17:16",
            "21:74"
        ],
        "BIBLE": [
            "prophets:joshua:8:14",
            "prophets:i%20samuel:10:11",
            "writings:ruth:1:19",
            "prophets:i%20kings:13:25",
            "prophets:ii%20kings:6:20",
            "prophets:ii%20samuel:15:24",
            "prophets:i%20kings:16:18",
            "torah:genesis:29:10",
            "writings:ii%20chronicles:25:16",
            "writings:i%20chronicles:12:18"
        ]
    }
}