{
    "VERSE": "25:41",
    "ARABIC": "وَإِذَا رَأَوْكَ إِن يَتَّخِذُونَكَ إِلَّا هُزُوًا أَهَٰذَا ٱلَّذِى بَعَثَ ٱللَّهُ رَسُولًا",
    "ENGLISH": {
        "TRANSLATION_0": "When they see you they only make a mockery of you: 'Is this the one Allah has sent as a Messenger?",
        "TRANSLATION_1": "When they see you they take you only in jest: \"Is this the one whom God has sent as messenger?\n",
        "TRANSLATION_2": "When these people see you, they scoff at you, (saying), \"Is this the man whom Allah has sent as His Messenger?\n",
        "TRANSLATION_3": "(Muhammad), when they see you, they will only mock you and say, \"Has God really sent him as a Messengers?\n",
        "TRANSLATION_4": "And when they see you (O dear Prophet Mohammed – peace and blessings be upon him) they take you but as a mockery, “Is this the one whom Allah sent as a (Noble) Messenger?”\n",
        "TRANSLATION_5": "And when they see you, they treat you only in mockery (saying): \"Is this the one whom Allah has sent as a Messenger\"\n",
        "TRANSLATION_6": "And when they see you, they do not take you for aught but a mockery: Is this he whom Allah has raised to be an apostle?\n",
        "TRANSLATION_7": "And when they see thee, they take thee in mockery only: 'What, is this he whom God sent forth as a Messenger?\n",
        "TRANSLATION_8": "And when they see thee (O Muhammad) they treat thee only as a jest (saying): Is this he whom Allah sendeth as a messenger?\n",
        "TRANSLATION_9": "Whenever they see you they only make a mockery of you -- \"Is this the one God has sent as His Messenger?\n",
        "TRANSLATION_10": "And when they behold thee, they hold thee up for mockery: is this the one whom Allah hath sent as an apostle\n",
        "TRANSLATION_11": "When they see you they just take you in derision: ‘Is this the one whom Allah has sent as an apostle!?\n",
        "TRANSLATION_12": "When they see thee, they treat thee no otherwise than in mockery: \"Is this the one whom Allah has sent as a messenger?\"\n",
        "TRANSLATION_13": "And when they see you (O Muhammad SAW), they treat you only as a mockery (saying):\"Is this the one whom Allah has sent as a Messenger?\n",
        "TRANSLATION_14": "Whenever they see you, they mock you (saying): 'Is this whom Allah has sent as a Messenger?\n",
        "TRANSLATION_15": "And when they see you, they take you for nothing but mockery: “Is this the one God sent as a messenger?”\n",
        "TRANSLATION_16": "And when they see you, [O Muhammad], they take you not except in ridicule, [saying], \"Is this the one whom Allah has sent as a messenger?\n",
        "TRANSLATION_17": "[25:41]   And when they see you, they take you in mockery only, as an object of derision, saying, ‘Is this the one whom God has sent as a messenger?, as he is wont to claim? — contemptuously of him as one not worthy of being a messenger.\n",
        "TRANSLATION_18": "(And when they) the disbelievers of Mecca (see thee (0 Muhammad) they treat thee only as a jest) they only speak to you in jest and derision ((saying): Is this he whom Allah sendeth as a messenger) to us?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "25:41",
            "21:36",
            "33:22",
            "4:61",
            "63:1",
            "63:5",
            "24:52",
            "33:39",
            "3:132",
            "36:47"
        ],
        "BIBLE": [
            "writings:job:11:3",
            "prophets:amos:6:10",
            "torah:genesis:2:18",
            "prophets:jeremiah:20:15",
            "prophets:ii%20kings:5:7",
            "torah:exodus:34:10",
            "prophets:ii%20kings:10:5",
            "prophets:i%20kings:19:2",
            "prophets:jeremiah:20:9",
            "torah:leviticus:10:3"
        ]
    }
}