{
    "VERSE": "25:43",
    "ARABIC": "أَرَءَيْتَ مَنِ ٱتَّخَذَ إِلَٰهَهُۥ هَوَىٰهُ أَفَأَنتَ تَكُونُ عَلَيْهِ وَكِيلًا",
    "ENGLISH": {
        "TRANSLATION_0": "Have you seen him who has taken his whims and desires to be his god? Will you then be his guardian?",
        "TRANSLATION_1": "Have you considered him who takes his own lust for his god? Can you stand a surety for him?\n",
        "TRANSLATION_2": "Have you ever considered the case of the person who has made his lust his god? Can you take the responsibility of guiding such a one aright?\n",
        "TRANSLATION_3": "How can you be the guardian of those who have chosen their own desires as their Lord?\n",
        "TRANSLATION_4": "Did you see the one who chose his own desires as his God? So will you accept the responsibility of guarding him?\n",
        "TRANSLATION_5": "Have you seen him who has taken as his god his own vain desire Would you then be a guardian over him\n",
        "TRANSLATION_6": "Have you seen him who takes his low desires for his god? Will you then be a protector over him?\n",
        "TRANSLATION_7": "Hast thou seen him who has taken his caprice to be his god? Wilt thou be a guardian over them?\n",
        "TRANSLATION_8": "Hast thou seen him who chooseth for his god his own lust? Wouldst thou then be guardian over him?\n",
        "TRANSLATION_9": "Have you seen him who has taken his own desire to be his god? Can you be a guardian over him?\n",
        "TRANSLATION_10": "Hast thou observed him who hath taken as his god his own desire! wilt thou be over him a trustee?\n",
        "TRANSLATION_11": "Have you seen him who has taken his desire to be his god? Is it your duty to watch over him?\n",
        "TRANSLATION_12": "Seest thou such a one as taketh for his god his own passion (or impulse)? Couldst thou be a disposer of affairs for him?\n",
        "TRANSLATION_13": "Have you (O Muhammad SAW) seen him who has taken as his ilah (god) his own desire? Would you then be a Wakil (a disposer of his affairs or a watcher) over him?\n",
        "TRANSLATION_14": "Have you seen him who has made gods of his own desires? Would you be a guardian over him?\n",
        "TRANSLATION_15": "Have you seen him who chose his desire as his god? Would you be an agent for him?\n",
        "TRANSLATION_16": "Have you seen the one who takes as his god his own desire? Then would you be responsible for him?\n",
        "TRANSLATION_17": "[25:43] Have you seen — inform Me [about] — him who has taken as his god his own desire?, that is, as something that will be bring about his ruin (the indirect object [ilāhahu, ‘as his god’] precedes the direct object because it is more important; the clause [beginning] man ittakhadha, ‘him who has taken’, constitutes the first direct object of a-ra’ayta, ‘have you seen’, the second being [the following, a-fa-anta …]) Will you be a guardian over him?, a protector to preserve him from following his desires? No.\n",
        "TRANSLATION_18": "(Hast thou) Muhammad (seen him who chooseth for his god his own lust) who worshipped his god, i.e. al- Nadr and his host, out of the whim of his ego? (Wouldst thou) Muhammad (then be guardian over him) a protector against going out for such corruption? But this was abrogated by the verse of jihad; it is also said that this means: would you be their protector from chastisement?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "25:43",
            "33:3",
            "6:107",
            "39:62",
            "33:48",
            "42:6",
            "45:23",
            "21:62",
            "6:102",
            "53:12"
        ],
        "BIBLE": [
            "writings:psalms:31:8",
            "prophets:judges:11:36",
            "writings:psalms:71:1",
            "writings:ii%20chronicles:19:7",
            "prophets:isaiah:8:10",
            "writings:i%20chronicles:17:25",
            "prophets:jeremiah:1:12",
            "prophets:isaiah:52:5",
            "writings:psalms:31:2",
            "writings:psalms:7:2"
        ]
    }
}