{
    "VERSE": "25:49",
    "ARABIC": "لِّنُحْۦِىَ بِهِۦ بَلْدَةً مَّيْتًا وَنُسْقِيَهُۥ مِمَّا خَلَقْنَآ أَنْعَٰمًا وَأَنَاسِىَّ كَثِيرًا",
    "ENGLISH": {
        "TRANSLATION_0": "so that by it We can bring a dead land to life and give drink to many of the animals and people We created.",
        "TRANSLATION_1": "To quicken a region that was dead, and to give it as drink to animals We have created and to men in plenty.\n",
        "TRANSLATION_2": "so that He may revive the dead land, and quench the thirst of many of His creatures from among beasts and men.\n",
        "TRANSLATION_3": "to revive the barren land and provide water for many creatures, cattle, and people.\n",
        "TRANSLATION_4": "In order that We may revive a dead city with it, and give it to the many beasts and men that We have created, to drink.\n",
        "TRANSLATION_5": "That We may give life thereby to a dead land, and We give to drink thereof many of the cattle and men that We have created.\n",
        "TRANSLATION_6": "That We may give life thereby to a dead land and give it for drink, out of what We have created, to cattle and many people.\n",
        "TRANSLATION_7": "so that We might revive a dead land, and give to drink of it, of that We created, cattle and men a many.\n",
        "TRANSLATION_8": "That We may give life thereby to a dead land, and We give many beasts and men that We have created to drink thereof.\n",
        "TRANSLATION_9": "so that We may bring life to a dead land; and slake the thirst of Our creation; cattle and men, in great numbers.\n",
        "TRANSLATION_10": "That We may quicken thereby a dead land, and We give drink thereof to that which We have created of cattle and human beings many.\n",
        "TRANSLATION_11": "with which We revive a dead country and provide water to many of the cattle and humans We have created.\n",
        "TRANSLATION_12": "That with it We may give life to a dead land, and slake the thirst of things We have created,- cattle and men in great numbers.\n",
        "TRANSLATION_13": "That We may give life thereby to a dead land, and We give to drink thereof many of the cattle and men that We had created.\n",
        "TRANSLATION_14": "so, that with it We revive dead lands and provide drink for the cattle and the human We created.\n",
        "TRANSLATION_15": "To revive dead lands thereby, and to provide drink for the multitude of animals and humans We created.\n",
        "TRANSLATION_16": "That We may bring to life thereby a dead land and give it as drink to those We created of numerous livestock and men.\n",
        "TRANSLATION_17": "[25:49]   with which We revive a dead land (read maytan, in the softened form, equally valid for the masculine and the feminine, but in the masculine [here] because of the [masculine] noun indicating ‘place’ [implicit therein]) and We give it, the water, as drink to the many cattle, camels, cows and sheep, and humans We have created (anāsiyy is the plural of insān: properly it [the plural] should be anāsīn but the [final] nūn has been replaced with a yā’, with which the [other] yā’ has been assimilated; or it [anāsiyy] is [simply] the plural of insiyy).\n",
        "TRANSLATION_18": "(That We may give life thereby to a dead land) a land that has no vegetation, (and We give many beasts and men that We have created to drink thereof.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "25:49",
            "43:11",
            "34:35",
            "39:49",
            "50:11",
            "42:34",
            "50:16",
            "22:34",
            "4:160",
            "29:8"
        ],
        "BIBLE": [
            "writings:i%20chronicles:11:19",
            "prophets:judges:7:6",
            "prophets:ii%20samuel:23:17",
            "writings:ii%20chronicles:6:5",
            "prophets:ezekiel:47:9",
            "prophets:jeremiah:50:38",
            "torah:genesis:6:17",
            "torah:genesis:2:19",
            "writings:psalms:104:11",
            "prophets:jonah:3:7"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:2",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:1:3"
        ]
    }
}