{
    "VERSE": "25:50",
    "ARABIC": "وَلَقَدْ صَرَّفْنَٰهُ بَيْنَهُمْ لِيَذَّكَّرُوا۟ فَأَبَىٰٓ أَكْثَرُ ٱلنَّاسِ إِلَّا كُفُورًا",
    "ENGLISH": {
        "TRANSLATION_0": "We have variegated it for them so they might pay heed but most people spurn anything else but kufr.",
        "TRANSLATION_1": "And We distribute it among them in various ways that they may ponder and reflect; yet most men disdain everything but denial and thanklessness.\n",
        "TRANSLATION_2": "We present the same phenomenon over and over again before them so that they may learn a lesson from it; but most people decline to adopt any other attitude than of disbelief and ingratitude.\n",
        "TRANSLATION_3": "We send them rain from time to time so that they may take heed. Many people have responded, but ungratefully.\n",
        "TRANSLATION_4": "And indeed We kept cycles of water among them that they may remember; so most men did not accept, except to be ungrateful.\n",
        "TRANSLATION_5": "And indeed We have distributed it among them in order that they may remember the grace of Allah, but most men refuse (out of) gratitude.\n",
        "TRANSLATION_6": "And certainly We have repeated this to them that they may be mindful, but the greater number of men do not consent to aught except denying.\n",
        "TRANSLATION_7": "We have indeed turned it about amongst them, so that they may remember; yet most men refuse all but unbelief.\n",
        "TRANSLATION_8": "And verily We have repeated it among them that they may remember, but most of mankind begrudge aught save ingratitude.\n",
        "TRANSLATION_9": "We have explained it to them in diverse ways, so that they may take heed, but most persist in their ingratitude.\n",
        "TRANSLATION_10": "And We set it forth among them, that they may be admonished, but most men begrudge aught save infidelity.\n",
        "TRANSLATION_11": "Certainly We distribute it among them so that they may take admonition. But most people are only intent on ingratitude.\n",
        "TRANSLATION_12": "And We have distributed the (water) amongst them, in order that they may celebrate (our) praises, but most men are averse (to aught) but (rank) ingratitude.\n",
        "TRANSLATION_13": "And indeed We have distributed it (rain or water) amongst them in order that they may remember the Grace of Allah, but most men refuse (or deny the Truth or Faith) and accept nothing but disbelief or ingratitude.\n",
        "TRANSLATION_14": "We have indeed turned it about them, so that they remember; yet most people refuse all except disbelief.\n",
        "TRANSLATION_15": "We have circulated it among them, that they may reflect, but most people persist in thanklessness.\n",
        "TRANSLATION_16": "And We have certainly distributed it among them that they might be reminded, but most of the people refuse except disbelief.\n",
        "TRANSLATION_17": "[25:50] And verily We have distributed it, the water, among them, so that they may remember (li-yadhdhakkarū should actually be li-yatadhakkarū, but the tā’ has been assimilated with the dhāl; a variant reading has liyadhkurū), that is to say, [so that they may remember] therewith the grace of God. But most people are only intent on ingratitude, on denial of the grace, saying, ‘We have received [this] rain because of such-andsuch a storm’.\n",
        "TRANSLATION_18": "And verily We have repeated it) the rain (among them) year after year (that they may remember) that they may take heed, (but most of mankind begrudge aught save in gratitude) they refused and stayed firm in ingratitude towards Allah and His blessings.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "25:50",
            "17:89",
            "10:19",
            "12:103",
            "40:59",
            "36:7",
            "34:28",
            "27:73",
            "16:44",
            "37:158"
        ],
        "BIBLE": [
            "writings:daniel:9:13",
            "torah:deuteronomy:32:8",
            "prophets:ezekiel:31:14",
            "torah:genesis:3:24",
            "writings:ii%20chronicles:30:5",
            "prophets:jeremiah:26:3",
            "torah:deuteronomy:9:12",
            "prophets:malachi:2:9",
            "prophets:judges:20:42",
            "prophets:jeremiah:38:22"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:10"
        ]
    }
}