{
    "VERSE": "25:51",
    "ARABIC": "وَلَوْ شِئْنَا لَبَعَثْنَا فِى كُلِّ قَرْيَةٍ نَّذِيرًا",
    "ENGLISH": {
        "TRANSLATION_0": "If We had wished We could have sent a warner to every town.",
        "TRANSLATION_1": "Had We pleased We could have raised a warner in every town.\n",
        "TRANSLATION_2": "Had We willed, We would have raised up a separate Warner in each habitation.\n",
        "TRANSLATION_3": "Had We wanted We could have sent a Prophet to every town.\n",
        "TRANSLATION_4": "If We willed, We could have sent a Herald of Warning to every village.\n",
        "TRANSLATION_5": "And had We willed, We would have raised a warner in every town.\n",
        "TRANSLATION_6": "And if We had pleased We would certainly have raised a warner in every town.\n",
        "TRANSLATION_7": "If We had willed, We would have raised up in every city a warner.\n",
        "TRANSLATION_8": "If We willed, We could raise up a warner in every village.\n",
        "TRANSLATION_9": "If We had so wished, We might have sent a warner into every town,\n",
        "TRANSLATION_10": "And if We had willed, We would have raised up in each town a warner.\n",
        "TRANSLATION_11": "Had We wished, We would have sent a warner to every town.\n",
        "TRANSLATION_12": "Had it been Our Will, We could have sent a warner to every centre of population.\n",
        "TRANSLATION_13": "And had We willed, We would have raised a warner in every town.\n",
        "TRANSLATION_14": "Had it been Our will, We could have raised a warner in every village.\n",
        "TRANSLATION_15": "Had We willed, We could have sent to every town a warner.\n",
        "TRANSLATION_16": "And if We had willed, We could have sent into every city a warner.\n",
        "TRANSLATION_17": "[25:51] And had We willed, We could have sent forth in every town a warner, to threaten its inhabitants [with God’s chastisement]; instead We have sent you to the inhabitants of all towns as a warner for your reward to be a great one.\n",
        "TRANSLATION_18": "(If We willed, We could raise up) We could have sent (a warner) a warning messenger (in every village) to the people of every village. Instead, We have sent you to all mankind as a Messenger so that reward and honour will be all yours.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "25:51",
            "34:34",
            "6:123",
            "48:8",
            "12:82",
            "26:208",
            "25:56",
            "11:25",
            "20:56",
            "21:93"
        ],
        "BIBLE": [
            "prophets:jeremiah:29:15",
            "torah:deuteronomy:18:18",
            "prophets:joshua:5:7",
            "prophets:i%20samuel:2:35",
            "prophets:isaiah:49:11",
            "prophets:i%20kings:11:14",
            "writings:psalms:30:2",
            "writings:ii%20chronicles:33:14",
            "prophets:micah:5:4",
            "prophets:ezekiel:41:8"
        ]
    }
}