{
    "VERSE": "25:55",
    "ARABIC": "وَيَعْبُدُونَ مِن دُونِ ٱللَّهِ مَا لَا يَنفَعُهُمْ وَلَا يَضُرُّهُمْ وَكَانَ ٱلْكَافِرُ عَلَىٰ رَبِّهِۦ ظَهِيرًا",
    "ENGLISH": {
        "TRANSLATION_0": "Yet they worship instead of Allah what can neither help nor harm them. The kuffar are always biased against their Lord.",
        "TRANSLATION_1": "And yet they worship besides God what cannot bring them gain or do them harm. The unbeliever has always been an auxiliary against his Lord.\n",
        "TRANSLATION_2": "Yet they worship, instead of Allah, those who can neither benefit them nor harm them: more than this, the disbeliever has become a helper of every rebel against his Lord.\n",
        "TRANSLATION_3": "They worship besides God things that can neither benefit nor harm them. The unbelievers are defiant against their Lord.\n",
        "TRANSLATION_4": "And they worship such, other than Allah, which neither benefit nor hurt them; and the disbeliever helps the devil instead of his Lord.\n",
        "TRANSLATION_5": "And they worship besides Allah, that which can neither profit them nor harm them; and the disbeliever is ever a helper against his Lord.\n",
        "TRANSLATION_6": "And they serve besides Allah that which neither profits them nor causes them harm; and the unbeliever is a partisan against his Lord.\n",
        "TRANSLATION_7": "And they serve, apart from God, what neither profits them nor hurts them; and the unbeliever is ever a partisan against his Lord.\n",
        "TRANSLATION_8": "Yet they worship instead of Allah that which can neither benefit them nor hurt them. The disbeliever was ever a partisan against his Lord.\n",
        "TRANSLATION_9": "Yet they worship besides God that which can neither benefit them nor harm them. One who denies the truth is a helper [of evil] against his Lord.\n",
        "TRANSLATION_10": "And yet they worship, besides Allah, that which can neither benefit them nor hurt them; and the infidel is ever an aider of the devil against his Lord.\n",
        "TRANSLATION_11": "They worship besides Allah that which neither brings them any benefit nor causes them any harm, and the faithless one is ever an abettor against his Lord.\n",
        "TRANSLATION_12": "Yet do they worship, besides Allah, things that can neither profit them nor harm them: and the Misbeliever is a helper (of Evil), against his own Lord!\n",
        "TRANSLATION_13": "And they (disbelievers, polytheists, etc.) worship besides Allah, that which can neither profit them nor harm them, and the disbeliever is ever a helper (of the Satan) against his Lord.\n",
        "TRANSLATION_14": "Yet they (the unbelievers) worship, other than Allah, that which can neither benefit nor harm them. Surely, the unbeliever is ever a partisan against his Lord.\n",
        "TRANSLATION_15": "And yet, instead of God, they serve what neither profits them nor harms them. The disbeliever has always turned his back on his Lord.\n",
        "TRANSLATION_16": "But they worship rather than Allah that which does not benefit them or harm them, and the disbeliever is ever, against his Lord, an assistant [to Satan].\n",
        "TRANSLATION_17": "[25:55] And they, the disbelievers, worship besides God that which neither benefits them, when they worship it, nor harms them, should they refrain therefrom — and these are idols; and the disbeliever is ever a partisan against his Lord, an assistant to Satan through his obedience to him.\n",
        "TRANSLATION_18": "402 Yet they) the disbelievers of Mecca (worship instead of Allah that which can neither benefit them) in this world or in the next, if they worshipped and obeyed them (nor hurt them) in this world or in the next, if they were to disobey them and abstain from their worship. (The disbeliever) Abu Jahl (was ever a partisan) rebellious (against his Lord) it is also that this means: he is always a helper, through his disbelief, to the disbelievers against his Lord.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "25:55",
            "22:12",
            "19:48",
            "42:6",
            "18:43",
            "10:106",
            "16:20",
            "36:74",
            "39:3",
            "6:106"
        ],
        "BIBLE": [
            "torah:deuteronomy:11:16",
            "prophets:joshua:24:20",
            "prophets:i%20samuel:12:21",
            "prophets:ii%20samuel:14:20",
            "writings:ii%20chronicles:12:12",
            "writings:daniel:9:13",
            "torah:deuteronomy:23:6",
            "prophets:i%20samuel:15:30",
            "torah:deuteronomy:1:32",
            "prophets:i%20samuel:12:24"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:1:2",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:2"
        ]
    }
}