{
    "VERSE": "25:57",
    "ARABIC": "قُلْ مَآ أَسْـَٔلُكُمْ عَلَيْهِ مِنْ أَجْرٍ إِلَّا مَن شَآءَ أَن يَتَّخِذَ إِلَىٰ رَبِّهِۦ سَبِيلًا",
    "ENGLISH": {
        "TRANSLATION_0": "Say: 'I do not ask you for any wage for it - only that anyone who wants to should make his way towards his Lord.'",
        "TRANSLATION_1": "Tell them: \"I do not ask any recompense of you for this other than (urging) whoever likes may take the way to his Lord.\"\n",
        "TRANSLATION_2": "Tell them, \"I do not ask of you any recompense for this work: I only ask of the one, who will, to adopt the way of his Lord.\n",
        "TRANSLATION_3": "Tell them, \"I ask no recompense for my preaching to you, except the fact that whoever wants should choose the way of God.\"\n",
        "TRANSLATION_4": "Proclaim, “I do not ask any fee from you for this, except that whoever wills may take the way to his Lord.”\n",
        "TRANSLATION_5": "Say: \"No reward do I ask of you for this, save that whosoever wills may take a path to his Lord.\"\n",
        "TRANSLATION_6": "Say: I do not ask you aught in return except that he who will, may take the way to his Lord.\n",
        "TRANSLATION_7": "Say: 'I do not ask of you a wage for this, except for him who wishes to take to his Lord a way.'\n",
        "TRANSLATION_8": "Say: I ask of you no reward for this, save that whoso will may choose a way unto his Lord.\n",
        "TRANSLATION_9": "Say, \"I do not ask you for any recompense for this except that anyone who so wishes should take the right path to his Lord.\"\n",
        "TRANSLATION_10": "Say thou. ask of you no hire for this, save that whosoever will may take unto his Lord a way.\n",
        "TRANSLATION_11": "Say, ‘I do not ask you any reward for it, except that anyone who wishes should take the way to his Lord.’\n",
        "TRANSLATION_12": "Say: \"No reward do I ask of you for it but this: that each one who will may take a (straight) Path to his Lord.\"\n",
        "TRANSLATION_13": "Say: \"No reward do I ask of you for this (that which I have brought from my Lord and its preaching, etc.), save that whosoever wills, may take a Path to his Lord.\n",
        "TRANSLATION_14": "Say: 'I demand of you no wage for this except for he who wishes to take the Path to his Lord'\n",
        "TRANSLATION_15": "Say, “I ask of you no payment for this—only that whoever wills may take a path to his Lord.”\n",
        "TRANSLATION_16": "Say, \"I do not ask of you for it any payment - only that whoever wills might take to his Lord a way.\"\n",
        "TRANSLATION_17": "[25:57] Say: ‘I do not ask of you in return for this, that is, for delivering that [Message] with which I have been sent, any reward, except that whoever wishes to follow a way to his Lord [should do so]’, by expending his wealth for the sake of [attaining] God’s pleasure, exalted be He; then [whoever wishes to do so] I will not prevent him from doing so.\n",
        "TRANSLATION_18": "(Say) Muhammad to the people of Mecca: (I ask of you no reward) no payment or provision (for this) for professing Allah's divine Oneness and for the Qur'an, (save that whoso will may choose a way unto his Lord) through faith; it is also said that this means: save for the one who desires to profess Allah's divine Oneness and by means of this profession tread a way back to his Lord whereby he will find his reward.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "25:57",
            "26:109",
            "26:145",
            "26:127",
            "26:180",
            "26:164",
            "76:29",
            "73:19",
            "38:86",
            "21:2"
        ],
        "BIBLE": [
            "prophets:jeremiah:42:3",
            "writings:ruth:2:12",
            "writings:psalms:40:6",
            "prophets:isaiah:62:11",
            "writings:ezra:8:21",
            "prophets:i%20kings:13:26",
            "prophets:ii%20samuel:19:37",
            "torah:exodus:15:26",
            "writings:proverbs:21:8",
            "prophets:i%20kings:2:3"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:9"
        ]
    }
}