{
    "VERSE": "25:58",
    "ARABIC": "وَتَوَكَّلْ عَلَى ٱلْحَىِّ ٱلَّذِى لَا يَمُوتُ وَسَبِّحْ بِحَمْدِهِۦ وَكَفَىٰ بِهِۦ بِذُنُوبِ عِبَادِهِۦ خَبِيرًا",
    "ENGLISH": {
        "TRANSLATION_0": "Put your trust in the Living who does not die and glorify Him with praise. He is well aware of the wrong actions of His slaves:",
        "TRANSLATION_1": "Have trust in God the Living, who will never die, and sing His hallelujas; for He is well aware of the sins of His creatures.\n",
        "TRANSLATION_2": "O Muhammad trust in that Allah Who is Ever-Living and will never die' Glorify Him with His praise, for He alone is sufficient to be aware of the sins of His servants.\n",
        "TRANSLATION_3": "Also trust in the Living One who never dies and glorify Him with His praise. He has sufficient knowledge of the sins of His servants.\n",
        "TRANSLATION_4": "And trust the Living One Who will never die, and praising Him proclaim His Purity; and He is Sufficient upon the sins of His bondmen, All Aware.\n",
        "TRANSLATION_5": "And put your trust in the Ever Living One Who dies not, and glorify His praises, and sufficient is He as the All-Knower of the sins of His servants,\n",
        "TRANSLATION_6": "And rely on the Ever-living Who dies not, and celebrate His praise; and Sufficient is He as being aware of the faults of His servants,\n",
        "TRANSLATION_7": "Put thy trust in the Living God, the Undying, and proclaim His praise. Sufficiently is He aware of His servants sins\n",
        "TRANSLATION_8": "And trust thou in the Living One Who dieth not, and hymn His praise. He sufficeth as the Knower of His bondmen's sins,\n",
        "TRANSLATION_9": "Put your trust in the One who is the Ever-Living [God], who never dies, and glorify Him with His praise. He is fully aware of the sins of His servants;\n",
        "TRANSLATION_10": "And trust thou in the Living One who dieth not, and hallow His praise; it sufficeth that he of the sins of His bondmen is Aware.\n",
        "TRANSLATION_11": "Put your trust in the Living One who does not die, and celebrate His praise. He suffices as one all-aware of the sins of His servants.\n",
        "TRANSLATION_12": "And put thy trust in Him Who lives and dies not; and celebrate his praise; and enough is He to be acquainted with the faults of His servants;-\n",
        "TRANSLATION_13": "And put your trust (O Muhammad SAW) in the Ever Living One Who dies not, and glorify His Praises, and Sufficient is He as the All-Knower of the sins of His slaves;\n",
        "TRANSLATION_14": "Put your trust in the All Living who never dies, and exalt with His praise, He is sufficiently aware of His worshipers' sins.\n",
        "TRANSLATION_15": "And put your trust in the Living, the One who never dies; and celebrate His praise. He suffices as the All-Informed Knower of the faults of His creatures.\n",
        "TRANSLATION_16": "And rely upon the Ever-Living who does not die, and exalt [Allah] with His praise. And sufficient is He to be, with the sins of His servants, Acquainted -\n",
        "TRANSLATION_17": "[25:58] And put your trust in the Living One Who does not die, and make glorifications, ensconced, in His praise, in other words, say: subhāna’Llāhi wa’l-hamdu li’Llāh, ‘Glory be to God and praise be to God’. And He suffices as One Aware, as Knower, of the sins of His servants (khabīran, ‘One Aware’, is semantically connected to bi-dhunūbi, ‘of the sins’).\n",
        "TRANSLATION_18": "(And trust thou) Muhammad (in the Living One Who dieth not) and do not trust in those living who die such as Abu Talib or Khadijah, nor trust yet in the dead who have no movement, (and hymn His praise) and pray by His command. (He sufficeth as the Knower of His bondmen's sins) He is aware of the sins of His bondmen,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "25:58",
            "27:59",
            "17:17",
            "6:18",
            "2:86",
            "18:1",
            "17:30",
            "27:15",
            "27:19",
            "39:53"
        ],
        "BIBLE": [
            "writings:psalms:146:2",
            "writings:psalms:71:22",
            "torah:genesis:44:9",
            "writings:psalms:104:33",
            "prophets:i%20samuel:12:19",
            "writings:psalms:21:14",
            "writings:psalms:30:13",
            "writings:psalms:27:9",
            "prophets:isaiah:25:1",
            "prophets:ii%20samuel:19:7"
        ]
    }
}