{
    "VERSE": "25:6",
    "ARABIC": "قُلْ أَنزَلَهُ ٱلَّذِى يَعْلَمُ ٱلسِّرَّ فِى ٱلسَّمَٰوَٰتِ وَٱلْأَرْضِ إِنَّهُۥ كَانَ غَفُورًا رَّحِيمًا",
    "ENGLISH": {
        "TRANSLATION_0": "Say: 'The One Who sent it down is He Who knows all hidden secrets in the heavens and earth . He is Ever-Forgiving, Most Merciful.'",
        "TRANSLATION_1": "Say: \"He who knows the secrets of the heavens and the earth has revealed it to me; and He is surely forgiving and kind.\"\n",
        "TRANSLATION_2": "O Muhammad, say to them, \"This has been sent down by Him, Who knows the secret of the heavens and the earth.\" The fact is that He is very Forgiving and Merciful.\n",
        "TRANSLATION_3": "(Muhammad), tell them, \"The One who knows all the secrets of the heavens and the earth has revealed it; He is All-forgiving and All-merciful.\"\n",
        "TRANSLATION_4": "Proclaim (O dear Prophet Mohammed – peace and blessings be upon him), “It is sent down by Him Who knows all the secrets of the heavens and the earth; indeed He Oft Forgiving, Most Merciful.\"\n",
        "TRANSLATION_5": "Say: \"It has been sent down by Him Who knows the secret of the heavens and the earth. Truly, He is Oft-Forgiving, Most Merciful.\"\n",
        "TRANSLATION_6": "Say: He has revealed it Who knows the secret in the heavens and the earth; surely He is ever Forgiving, Merciful.\n",
        "TRANSLATION_7": "Say: 'He sent it down, who knows the secret in the heavens and earth; He is All-forgiving, All-compassionate.'\n",
        "TRANSLATION_8": "Say (unto them, O Muhammad): He who knoweth the secret of the heavens and the earth hath revealed it. Lo! He ever is Forgiving, Merciful.\n",
        "TRANSLATION_9": "Say to them, \"It has been revealed by Him who knows every secret that is in the heavens and on the earth. Truly, He is most forgiving and most merciful.\"\n",
        "TRANSLATION_10": "Say thou; He hath sent it down Who knoweth the secret of the heavens and the earth; verily He is ever Forgiving, Merciful.\n",
        "TRANSLATION_11": "Say, ‘It has been sent down by Him who knows the hidden in the heavens and the earth. Indeed He is all-forgiving, all-merciful.’\n",
        "TRANSLATION_12": "Say: \"The (Qur'an) was sent down by Him who knows the mystery (that is) in the heavens and the earth: verily He is Oft-Forgiving, Most Merciful.\"\n",
        "TRANSLATION_13": "Say: \"It (this Quran) has been sent down by Him (Allah) (the Real Lord of the heavens and earth) Who knows the secret of the heavens and the earth. Truly, He is Oft-Forgiving, Most Merciful.\"\n",
        "TRANSLATION_14": "Say: 'It was sent down by Him who knows the secrets of heavens and earth. He is Forgiving, the Most Merciful.\n",
        "TRANSLATION_15": "Say, “It was revealed by He who knows the Secret in the heavens and the earth. He is always Forgiving and Merciful.”\n",
        "TRANSLATION_16": "Say, [O Muhammad], \"It has been revealed by He who knows [every] secret within the heavens and the earth. Indeed, He is ever Forgiving and Merciful.\"\n",
        "TRANSLATION_17": "[25:6] Say: ‘It has been revealed by Him Who knows the secret, the Unseen, of the heavens and the earth. Truly He is ever Forgiving, of believers, Merciful’, to them.\n",
        "TRANSLATION_18": "(Say) to them, Muhammad: (He Who knoweth the secret of the heavens and the earth has revealed it) i.e. He sent Gabriel with the Qur'an. (Lo! He ever is Forgiving) He forgives those who repent among them, (Merciful) He shows mercy towards those who die in a state of repentance.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "25:6",
            "34:2",
            "3:129",
            "48:14",
            "42:5",
            "6:3",
            "6:165",
            "11:107",
            "17:44",
            "44:29"
        ],
        "BIBLE": [
            "prophets:jeremiah:28:9",
            "prophets:jonah:4:2",
            "prophets:ii%20kings:19:15",
            "prophets:i%20kings:18:36",
            "writings:daniel:2:47",
            "writings:i%20chronicles:16:31",
            "prophets:i%20samuel:20:7",
            "prophets:i%20samuel:20:13",
            "writings:psalms:83:19",
            "prophets:jeremiah:4:10"
        ]
    }
}