{
    "VERSE": "25:63",
    "ARABIC": "وَعِبَادُ ٱلرَّحْمَٰنِ ٱلَّذِينَ يَمْشُونَ عَلَى ٱلْأَرْضِ هَوْنًا وَإِذَا خَاطَبَهُمُ ٱلْجَٰهِلُونَ قَالُوا۟ سَلَٰمًا",
    "ENGLISH": {
        "TRANSLATION_0": "The slaves of the All-Merciful are those who walk lightly on the earth and, who, when the ignorant speak to them, say, 'Peace';",
        "TRANSLATION_1": "Devotees of Ar-Rahman are those who walk with humility on the earth, and when they are addressed by the ignorant, say: 'Peace;\"\n",
        "TRANSLATION_2": "The (true) servants of the Merciful are those who walk humbly on the earth who, when the ignorant people behave insolently towards them, say, \"Peace to you\"\n",
        "TRANSLATION_3": "(Among) the servants of the Beneficent God are those who walk gently on the earth and when addressed by the ignorant ones, their only response is, \"Peace be with you.\"\n",
        "TRANSLATION_4": "And the bondmen of the Most Gracious who walk upon the earth humbly, and when the ignorant address them they answer, “Peace”. (Good –bye)\n",
        "TRANSLATION_5": "And the servants of the Most Gracious are those who walk on the earth Hawna, and when the foolish address them they say; \"Salama.\"\n",
        "TRANSLATION_6": "And the servants of the Beneficent Allah are they who walk on the earth in humbleness, and when the ignorant address them, they say: Peace.\n",
        "TRANSLATION_7": "The servants of the All-merciful are those who walk in the earth modestly and who, when the ignorant address them, say, 'Peace';\n",
        "TRANSLATION_8": "The (faithful) slaves of the Beneficent are they who walk upon the earth modestly, and when the foolish ones address them answer: Peace;\n",
        "TRANSLATION_9": "The true servants of the Gracious One are those who walk upon the earth with humility and when they are addressed by the ignorant ones, their response is, \"Peace\";\n",
        "TRANSLATION_10": "And the bondmen of the Compassionate are those Who Walk upon the earth meekly and when the ignorant address them, they say peace\n",
        "TRANSLATION_11": "The servants of the All-beneficent are those who walk humbly on the earth, and when the ignorant address them, say, ‘Peace!’\n",
        "TRANSLATION_12": "And the servants of (Allah) Most Gracious are those who walk on the earth in humility, and when the ignorant address them, they say, \"Peace!\";\n",
        "TRANSLATION_13": "And the slaves of the Most Beneficent (Allah) are those who walk on the earth in humility and sedateness, and when the foolish address them (with bad words) they reply back with mild words of gentleness.\n",
        "TRANSLATION_14": "The worshipers of the Merciful are those who walk humbly on the earth, and when the ignorant address them say: 'Peace'\n",
        "TRANSLATION_15": "The servants of the Merciful are those who walk the earth in humility, and when the ignorant address them, they say, “Peace.”\n",
        "TRANSLATION_16": "And the servants of the Most Merciful are those who walk upon the earth easily, and when the ignorant address them [harshly], they say [words of] peace,\n",
        "TRANSLATION_17": "[25:63] And the [true] servants of the Compassionate One (‘ibādu’l-rahmāni is the subject, and what comes after it, all the way up to ūlā’ika yujzawna, ‘they will be rewarded’ [of verse 75 below] are adjectival qualifiers of this [subject], with the exception of the parenthetical statements) are those who walk upon the earth modestly, that is, peacefully and humbly, and who, when the ignorant address them, with what they are averse to, say [words of] peace (salām), in other words, words by which they are safe (yaslamūna) from [committing] any sin;\n",
        "TRANSLATION_18": "403 (The (faithful) slaves of the Beneficent) the elite of the Beneficent (are they who walk upon the earth modestly) with humility from the fear of Allah, (and when the foolish ones) the disbelievers and sinners (address them answer: Peace) they answer with that which is good and say only nice words;\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "25:63",
            "27:59",
            "19:93",
            "21:26",
            "21:19",
            "43:19",
            "38:28",
            "26:152",
            "43:45",
            "27:19"
        ],
        "BIBLE": [
            "prophets:ii%20kings:18:36",
            "torah:exodus:19:8",
            "prophets:jeremiah:42:4",
            "prophets:ii%20samuel:20:17",
            "torah:genesis:41:16",
            "prophets:isaiah:36:21",
            "prophets:jeremiah:16:10",
            "torah:numbers:22:18",
            "prophets:malachi:2:17",
            "torah:exodus:24:3"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:4:12"
        ]
    }
}