{
    "VERSE": "25:64",
    "ARABIC": "وَٱلَّذِينَ يَبِيتُونَ لِرَبِّهِمْ سُجَّدًا وَقِيَٰمًا",
    "ENGLISH": {
        "TRANSLATION_0": "those who pass the night prostrating and standing before their Lord;",
        "TRANSLATION_1": "And those who spend their nights bowed and standing before their Lord;\n",
        "TRANSLATION_2": "who pass their nights in prostrating themselves and standing before their Lord:\n",
        "TRANSLATION_3": "They are those who spend the night worshipping their Lord, prostrating, and standing,\n",
        "TRANSLATION_4": "And who spend the night prostrating and standing, for their Lord.\n",
        "TRANSLATION_5": "And those who spend the night in worship of their Lord, prostrate and standing.\n",
        "TRANSLATION_6": "And they who pass the night prostrating themselves before their Lord and standing.\n",
        "TRANSLATION_7": "who pass the night prostrate to their Lord and standing;\n",
        "TRANSLATION_8": "And who spend the night before their Lord, prostrate and standing,\n",
        "TRANSLATION_9": "and those who spend the night prostrating themselves, and standing before their Lord,\n",
        "TRANSLATION_10": "And these who pass the night before their Lord, prostrate and standing up.\n",
        "TRANSLATION_11": "Those who spend the night for their Lord, prostrating and standing [in worship].\n",
        "TRANSLATION_12": "Those who spend the night in adoration of their Lord prostrate and standing;\n",
        "TRANSLATION_13": "And those who spend the night before their Lord, prostrate and standing.\n",
        "TRANSLATION_14": "who pass the night prostrating and standing to their Lord.\n",
        "TRANSLATION_15": "And those who pass the night prostrating themselves to their Lord and standing up.\n",
        "TRANSLATION_16": "And those who spend [part of] the night to their Lord prostrating and standing [in prayer]\n",
        "TRANSLATION_17": "[25:64] and who spend the night before their Lord, prostrating (sujjad is the plural of sājid) and standing [in worship], in other words, they spend the night performing prayers;\n",
        "TRANSLATION_18": "(And who spend the night before their Lord) praying, (prostrate and standing) in the night prayer,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "25:64",
            "29:59",
            "16:42",
            "23:59",
            "84:5",
            "84:2",
            "2:46",
            "74:7",
            "108:2",
            "23:58"
        ],
        "BIBLE": [
            "prophets:ii%20samuel:7:4",
            "torah:genesis:24:52",
            "torah:genesis:32:22",
            "writings:i%20chronicles:17:3",
            "writings:psalms:105:19",
            "writings:lamentations:3:37",
            "prophets:isaiah:21:8",
            "torah:exodus:33:9",
            "writings:daniel:6:19",
            "prophets:jeremiah:42:7"
        ]
    }
}