{
    "VERSE": "25:65",
    "ARABIC": "وَٱلَّذِينَ يَقُولُونَ رَبَّنَا ٱصْرِفْ عَنَّا عَذَابَ جَهَنَّمَ إِنَّ عَذَابَهَا كَانَ غَرَامًا",
    "ENGLISH": {
        "TRANSLATION_0": "those who say, 'Our Lord, avert from us the punishment of Hell, its punishment is inescapable pain.",
        "TRANSLATION_1": "Who say: \"O our Lord, avert from us the torment of Hell: Its punishment is surely continuous.\n",
        "TRANSLATION_2": "who pray, \"Our Lord, save us from the torment of Hell, for its torment is killing:\n",
        "TRANSLATION_3": "who pray, \"Lord, protect us from the torment of hell; it is a great loss.\n",
        "TRANSLATION_4": "And who submit, “Our Lord – avert the punishment of hell from us; indeed its punishment is a permanent neck-shackle.”\n",
        "TRANSLATION_5": "And those who say: \"Our Lord! Avert from us the torment of Hell. Verily, its torment is ever an inseparable, permanent punishment.\"\n",
        "TRANSLATION_6": "And they who say: O our Lord! turn away from us the punishment of hell, surely the punishment thereof is a lasting\n",
        "TRANSLATION_7": "who say, 'Our Lord, turn Thou from us the chastisement of Gehenna; surely its chastisement is torment most terrible;\n",
        "TRANSLATION_8": "And who say: Our Lord! Avert from us the doom of hell; lo! the doom thereof is anguish;\n",
        "TRANSLATION_9": "who say, \"Our Lord, ward off from us the punishment of Hell, for its punishment is a dreadful torment to suffer.\n",
        "TRANSLATION_10": "And these who say: our Lord! avert from us the torment of Hell verily the torment thereof is perishment.\n",
        "TRANSLATION_11": "Those who say, ‘Our Lord! Turn away from us the punishment of hell. Indeed its punishment is enduring.\n",
        "TRANSLATION_12": "Those who say, \"Our Lord! avert from us the Wrath of Hell, for its Wrath is indeed an affliction grievous,-\n",
        "TRANSLATION_13": "And those who say: \"Our Lord! Avert from us the torment of Hell. Verily! Its torment is ever an inseparable, permanent punishment.\"\n",
        "TRANSLATION_14": "Who say: 'Our Lord, turn from us the punishment of Gehenna, for its punishment is the most terrible;\n",
        "TRANSLATION_15": "And those who say, ‘‘Our Lord, avert from us the suffering of Hell, for its suffering is continuous.\n",
        "TRANSLATION_16": "And those who say, \"Our Lord, avert from us the punishment of Hell. Indeed, its punishment is ever adhering;\n",
        "TRANSLATION_17": "[25:65]   and who say, ‘Our Lord, avert from us from the chastisement of Hell. Truly its chastisement is abiding, that is, irrevocable.\n",
        "TRANSLATION_18": "(And who say: Our Lord!) our Lord! (Avert from us the doom of hell; lo! the doom thereof is anguish) binding and persistent;\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "25:65",
            "70:27",
            "44:12",
            "3:16",
            "40:60",
            "52:18",
            "11:76",
            "70:28",
            "16:42",
            "29:59"
        ],
        "BIBLE": [
            "prophets:ii%20samuel:15:31",
            "prophets:jeremiah:31:18",
            "prophets:isaiah:12:1",
            "prophets:ii%20samuel:18:30",
            "writings:lamentations:5:21",
            "prophets:ezekiel:33:11",
            "prophets:ii%20kings:20:2",
            "writings:lamentations:5:22",
            "writings:lamentations:1:20",
            "prophets:ii%20kings:23:26"
        ]
    }
}