{
    "VERSE": "25:67",
    "ARABIC": "وَٱلَّذِينَ إِذَآ أَنفَقُوا۟ لَمْ يُسْرِفُوا۟ وَلَمْ يَقْتُرُوا۟ وَكَانَ بَيْنَ ذَٰلِكَ قَوَامًا",
    "ENGLISH": {
        "TRANSLATION_0": "those who, when they spend, are neither extravagant nor mean, but take a stance mid way between the two;",
        "TRANSLATION_1": "Who are neither prodigal nor miserly in their spending but follow a middle path;\n",
        "TRANSLATION_2": "who, when they spend, are neither extravagant nor miserly but keep the golden mean between the two (extremes):\n",
        "TRANSLATION_3": "who in their spending are neither extravagant nor stingy but maintain moderation,\n",
        "TRANSLATION_4": "And those who, when spending, neither exceed the limits nor act miserly, and stay in moderation between the two.\n",
        "TRANSLATION_5": "And those who, when they spend, are neither extravagant nor stingy, but are in a just balance between them.\n",
        "TRANSLATION_6": "And they who when they spend, are neither extravagant nor parsimonious, and (keep) between these the just mean.\n",
        "TRANSLATION_7": "who, when they expend, are neither prodigal nor parsimonious, but between that is a just stand;\n",
        "TRANSLATION_8": "And those who, when they spend, are neither prodigal nor grudging; and there is ever a firm station between the two;\n",
        "TRANSLATION_9": "They are those who are neither extravagant nor niggardly, but keep a balance between the two;\n",
        "TRANSLATION_10": "And those who when they expend, are neither extravagant nor sparing, and it is a medium in-between.\n",
        "TRANSLATION_11": "Those who are neither wasteful nor tightfisted when spending, but balanced between these [two extremes].\n",
        "TRANSLATION_12": "Those who, when they spend, are not extravagant and not niggardly, but hold a just (balance) between those (extremes);\n",
        "TRANSLATION_13": "And those, who, when they spend, are neither extravagant nor niggardly, but hold a medium (way) between those (extremes).\n",
        "TRANSLATION_14": "who when they spend are neither wasteful nor miserly, between that is a just stand,\n",
        "TRANSLATION_15": "And those who, when they spend, are neither wasteful nor stingy, but choose a middle course between that.\n",
        "TRANSLATION_16": "And [they are] those who, when they spend, do so not excessively or sparingly but are ever, between that, [justly] moderate\n",
        "TRANSLATION_17": "[25:67] And who, when they expend, upon their dependants, are neither prodigal nor parsimonious (read yaqturū or yuqtirū); but between such, prodigality and parsimony, lies — [between the two] their expenditure [is in] — moderation;\n",
        "TRANSLATION_18": "Allah then mentioned their spending, saying: (And those who, when they spend, are neither prodigal) they are not prodigal with regard to transgression (nor grudging) they do not withhold that which is right; (and there is ever a firm station) a middle ground (between the two) between prodigality and being miserly;\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "25:67",
            "18:52",
            "18:93",
            "55:44",
            "32:25",
            "16:124",
            "29:35",
            "56:60",
            "2:113",
            "55:20"
        ],
        "BIBLE": [
            "prophets:isaiah:33:23",
            "writings:job:23:11",
            "prophets:ii%20samuel:20:2",
            "prophets:ii%20samuel:6:22",
            "prophets:ii%20kings:6:19",
            "torah:genesis:24:21",
            "writings:psalms:32:9",
            "prophets:i%20kings:8:65",
            "prophets:joshua:14:9",
            "prophets:i%20kings:2:9"
        ]
    }
}