{
    "VERSE": "25:69",
    "ARABIC": "يُضَٰعَفْ لَهُ ٱلْعَذَابُ يَوْمَ ٱلْقِيَٰمَةِ وَيَخْلُدْ فِيهِۦ مُهَانًا",
    "ENGLISH": {
        "TRANSLATION_0": "and on the Day of Rising his punishment will be doubled and he will be humiliated in it timelessly, for ever,",
        "TRANSLATION_1": "Whose punishment will be doubled on the Day of Judgement, and he will live for ever in disgrace,\n",
        "TRANSLATION_2": "and his torment shall be doubled on the Day of Resurrection, and he shall abide in a state of ignominy,\n",
        "TRANSLATION_3": "and on the Day of Judgment their torment will be double. They will suffer forever in disgrace.\n",
        "TRANSLATION_4": "The punishment shall be increased for him on the Day of Resurrection, and he will remain in it forever, with humiliation.\n",
        "TRANSLATION_5": "The torment will be doubled for him on the Day of Resurrection, and he will abide therein in disgrace;\n",
        "TRANSLATION_6": "The punishment shall be doubled to him on the day of resurrection, and he shall abide therein in abasement;\n",
        "TRANSLATION_7": "of sin-doubled shall be the chastisement for him on the Resurrection Day, and he shall dwell therein humbled,\n",
        "TRANSLATION_8": "The doom will be doubled for him on the Day of Resurrection, and he will abide therein disdained for ever;\n",
        "TRANSLATION_9": "he shall have his suffering doubled on the Day of Resurrection and he will abide forever in disgrace,\n",
        "TRANSLATION_10": "Multiplied for him shall be the torment on the Day of Resurrection, and he shall therein abide disgraced.\n",
        "TRANSLATION_11": "the punishment being doubled for him on the Day of Resurrection. In it he will abide in humiliation forever,\n",
        "TRANSLATION_12": "(But) the Penalty on the Day of Judgment will be doubled to him, and he will dwell therein in ignominy,-\n",
        "TRANSLATION_13": "The torment will be doubled to him on the Day of Resurrection, and he will abide therein in disgrace;\n",
        "TRANSLATION_14": "doubled for him on the Day of Resurrection is his punishment, and therein he shall live, humbled,\n",
        "TRANSLATION_15": "The punishment will be doubled for him on the Day of Resurrection, and he will dwell therein in humiliation forever.\n",
        "TRANSLATION_16": "Multiplied for him is the punishment on the Day of Resurrection, and he will abide therein humiliated -\n",
        "TRANSLATION_17": "[25:69] doubled (yudā‘af: a variant reading has yuda‘‘af) will be the chastisement for him on the Day of Resurrection and he will abide therein (both verbs may be read in [the imperfect] apocopated form [yudā‘af, ‘it will be doubled’, and yakhlud, ‘he will abide’] as substitutions, or with the [indicative] damma inflection [yudā‘afu and yakhludu] to indicate the beginning of a new sentence) abased (muhānan is a circumstantial qualifier);\n",
        "TRANSLATION_18": "(The doom will be doubled for him on the Day of Resurrection, and he will abide therein) in the doom (disdained) humiliated (for ever;\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "25:69",
            "43:39",
            "20:101",
            "39:24",
            "23:16",
            "75:1",
            "75:6",
            "37:9",
            "11:8",
            "40:32"
        ],
        "BIBLE": [
            "writings:proverbs:9:11",
            "torah:leviticus:23:27",
            "prophets:jeremiah:51:47",
            "prophets:jeremiah:3:16",
            "prophets:zechariah:2:15",
            "torah:deuteronomy:21:8",
            "prophets:ezekiel:45:25",
            "writings:esther:9:19",
            "writings:proverbs:19:19",
            "torah:exodus:8:18"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:4:8",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:1:6"
        ]
    }
}