{
    "VERSE": "25:71",
    "ARABIC": "وَمَن تَابَ وَعَمِلَ صَٰلِحًا فَإِنَّهُۥ يَتُوبُ إِلَى ٱللَّهِ مَتَابًا",
    "ENGLISH": {
        "TRANSLATION_0": "for certainly all who make tawba and act rightly have turned sincerely towards Allah;",
        "TRANSLATION_1": "Whosoever repents and does the right, will have turned back to God by way of repentance;\n",
        "TRANSLATION_2": "In fact, the one who repents and does righteous deeds, returns to Allah as one ightly should. -\n",
        "TRANSLATION_3": "Those who repent and act righteously have truly returned to God,\n",
        "TRANSLATION_4": "And whoever repents and does good deeds – so he has inclined towards Allah with repentance as was required.\n",
        "TRANSLATION_5": "And whosoever repents and does righteous good deeds; then indeed he has repented to Allah Mataba.\n",
        "TRANSLATION_6": "And whoever repents and does good, he surely turns to Allah a (goodly) turning.\n",
        "TRANSLATION_7": "and whosoever repents, and does righteousness, he truly turns to God in repentance.\n",
        "TRANSLATION_8": "And whosoever repenteth and doeth good, he verily repenteth toward Allah with true repentance -\n",
        "TRANSLATION_9": "He who repents and does good deeds has truly turned to God.\n",
        "TRANSLATION_10": "And whosoever repenteth and worketh righteously, then verily he repenteth toward Allah with a true repentance.\n",
        "TRANSLATION_11": "And whoever repents and acts righteously indeed turns to Allah with due penitence).\n",
        "TRANSLATION_12": "And whoever repents and does good has truly turned to Allah with an (acceptable) conversion;-\n",
        "TRANSLATION_13": "And whosoever repents and does righteous good deeds, then verily, he repents towards Allah with true repentance.\n",
        "TRANSLATION_14": "He who repents and does good works truly turns to Allah in repentance,\n",
        "TRANSLATION_15": "Whoever repents and acts righteously—has inclined towards God with repentance.\n",
        "TRANSLATION_16": "And he who repents and does righteousness does indeed turn to Allah with [accepted] repentance.\n",
        "TRANSLATION_17": "[25:71] and whoever repents, of his sins, from among other than those mentioned, and acts righteously, indeed turns to God with due repentance, that is, he returns to God a sincere return, and God will requite him with good;\n",
        "TRANSLATION_18": "(And whosoever repenteth) from sins (and does good) sincerely between him and his Lord, (he verily repenteth towards Allah with true repentance) he will find the reward of this with his Lord.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "25:71",
            "2:156",
            "53:62",
            "6:36",
            "16:128",
            "37:152",
            "26:150",
            "26:144",
            "26:179",
            "26:131"
        ],
        "BIBLE": [
            "prophets:jonah:3:10",
            "prophets:ezekiel:18:30",
            "torah:deuteronomy:30:3",
            "writings:proverbs:18:5",
            "prophets:ezekiel:3:20",
            "prophets:isaiah:55:7",
            "prophets:isaiah:53:6",
            "prophets:jeremiah:26:3",
            "torah:numbers:22:26",
            "writings:ii%20chronicles:29:6"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:13",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:6:5"
        ]
    }
}