{
    "VERSE": "25:72",
    "ARABIC": "وَٱلَّذِينَ لَا يَشْهَدُونَ ٱلزُّورَ وَإِذَا مَرُّوا۟ بِٱللَّغْوِ مَرُّوا۟ كِرَامًا",
    "ENGLISH": {
        "TRANSLATION_0": "those who do not bear false witness and who, when they pass by worthless talk, pass by with dignity;",
        "TRANSLATION_1": "And those who do not give false evidence, and if they come across unbecoming talk ignore it and pass by in a sedate way;\n",
        "TRANSLATION_2": "(And the servants of the Merciful are those:) who do not bear witness to falsehood and who; if they have ever to pass by what is vain, pass by like dignified people:\n",
        "TRANSLATION_3": "those who do not testify falsely and when they come across something impious, pass it by nobly,\n",
        "TRANSLATION_4": "And those who do not give false testimony, and when they pass near some indecency, they pass by it saving their honour.\n",
        "TRANSLATION_5": "And those who do not bear witness to falsehood, and if they pass by some evil play or evil talk, they pass by it with dignity.\n",
        "TRANSLATION_6": "And they who do not bear witness to what is false, and when they pass by what is vain, they pass by nobly.\n",
        "TRANSLATION_7": "And those who bear not false witness and, when they pass by idle talk, pass by with dignity;\n",
        "TRANSLATION_8": "And those who will not witness vanity, but when they pass near senseless play, pass by with dignity.\n",
        "TRANSLATION_9": "And those who do not bear false witness, and when they pass by frivolity, they pass by with dignity;\n",
        "TRANSLATION_10": "And those who witness not falsehood, and when they pass by some vanity pass by with dignity.\n",
        "TRANSLATION_11": "Those who do not give false testimony, and when they come upon frivolity, pass by with dignity.\n",
        "TRANSLATION_12": "Those who witness no falsehood, and, if they pass by futility, they pass by it with honourable (avoidance);\n",
        "TRANSLATION_13": "And those who do not witness falsehood, and if they pass by some evil play or evil talk, they pass by it with dignity.\n",
        "TRANSLATION_14": "and those who do not bear false witness, and when they pass by idle talk, pass by with honor\n",
        "TRANSLATION_15": "And those who do not bear false witness; and when they come across indecencies, they pass by with dignity.\n",
        "TRANSLATION_16": "And [they are] those who do not testify to falsehood, and when they pass near ill speech, they pass by with dignity.\n",
        "TRANSLATION_17": "[25:72] and those who do not give false testimony, that is, [testimony containing] mendacity and falsehood, and, when they come across senseless talk, in the way of vile speech and otherwise, they pass by with dignity, shunning such [vanity];\n",
        "TRANSLATION_18": "(And those who will not witness vanity) those who do not attend the sessions of false testimony, (but when they pass near senseless play) the assemblies of falsehood, (pass by with dignity) they avoid them out of clemency.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "25:72",
            "23:3",
            "78:35",
            "56:25",
            "56:44",
            "28:55",
            "22:50",
            "41:7",
            "52:23",
            "34:4"
        ],
        "BIBLE": [
            "writings:psalms:37:5",
            "prophets:ii%20samuel:15:23",
            "writings:job:19:8",
            "torah:deuteronomy:31:21",
            "prophets:jeremiah:18:15",
            "prophets:i%20kings:13:33",
            "prophets:hosea:4:9",
            "prophets:jeremiah:3:5",
            "prophets:jeremiah:36:7",
            "prophets:jeremiah:5:31"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:10",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:9"
        ]
    }
}