{
    "VERSE": "25:73",
    "ARABIC": "وَٱلَّذِينَ إِذَا ذُكِّرُوا۟ بِـَٔايَٰتِ رَبِّهِمْ لَمْ يَخِرُّوا۟ عَلَيْهَا صُمًّا وَعُمْيَانًا",
    "ENGLISH": {
        "TRANSLATION_0": "those who, when they are reminded of the Signs of their Lord, do not turn their backs, deaf and blind to them;",
        "TRANSLATION_1": "Who, when reminded of their Lord's revelations, do not fall for them like the deaf and blind;\n",
        "TRANSLATION_2": "who do not behave like the blind and the deaf, when the Revelations of their Lord are recited to them for admonition;\n",
        "TRANSLATION_3": "who, when reminded of the revelations of their Lord, do not try to ignore them as though deaf and blind. Rather, they try to understand and think about them.\n",
        "TRANSLATION_4": "And those who, when they are reminded of the signs of their Lord, do not fall deaf and blind upon them.\n",
        "TRANSLATION_5": "And those who, when they are reminded of the Ayat of their Lord, fall not deaf and blind thereat.\n",
        "TRANSLATION_6": "And they who, when reminded of the communications of their Lord, do not fall down thereat deaf and blind.\n",
        "TRANSLATION_7": "who, when they are reminded of the signs of their Lord, fall not down thereat deaf and blind;\n",
        "TRANSLATION_8": "And those who, when they are reminded of the revelations of their Lord, fall not deaf and blind thereat.\n",
        "TRANSLATION_9": "who do not turn a blind eye and a deaf ear to the signs of their Lord when they are reminded of them;\n",
        "TRANSLATION_10": "And those who, when they are admonished by the commands of Allah, fall not down thereat, deaf and blind.\n",
        "TRANSLATION_11": "Those who, when reminded of the signs of their Lord, do not turn a deaf ear and a blind eye to them.\n",
        "TRANSLATION_12": "Those who, when they are admonished with the Signs of their Lord, droop not down at them as if they were deaf or blind;\n",
        "TRANSLATION_13": "And those who, when they are reminded of the Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) of their Lord, fall not deaf and blind thereat.\n",
        "TRANSLATION_14": "and who when they are reminded of the verses of their Lord, they do not fall down deaf and blind.\n",
        "TRANSLATION_15": "And those who, when reminded of the revelations of their Lord, do not fall before them deaf and blind.\n",
        "TRANSLATION_16": "And those who, when reminded of the verses of their Lord, do not fall upon them deaf and blind.\n",
        "TRANSLATION_17": "[25:73] and those who, when they are reminded, [when] they are admonished, of the revelations of their Lord, that is, [reminded] of the Qur’ān, do not fall on them deaf and blind, but fall [on them] listening, contemplating, benefiting and obedient;\n",
        "TRANSLATION_18": "404 (And those who, when they are reminded of) admonished about (the revelations of their Lord, fall not deaf) unable to hear (and blind) unable to see while being very capable of hearing and seeing (thereat) the signs of Allah.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "25:73",
            "23:58",
            "32:15",
            "36:46",
            "23:59",
            "29:59",
            "16:42",
            "43:69",
            "7:126",
            "37:14"
        ],
        "BIBLE": [
            "writings:daniel:11:19",
            "prophets:jeremiah:8:12",
            "prophets:jeremiah:6:15",
            "writings:daniel:9:13",
            "torah:deuteronomy:11:28",
            "prophets:i%20kings:22:43",
            "prophets:ii%20kings:22:2",
            "torah:numbers:14:43",
            "torah:deuteronomy:31:29",
            "writings:ii%20chronicles:20:32"
        ]
    }
}