{
    "VERSE": "25:74",
    "ARABIC": "وَٱلَّذِينَ يَقُولُونَ رَبَّنَا هَبْ لَنَا مِنْ أَزْوَٰجِنَا وَذُرِّيَّٰتِنَا قُرَّةَ أَعْيُنٍ وَٱجْعَلْنَا لِلْمُتَّقِينَ إِمَامًا",
    "ENGLISH": {
        "TRANSLATION_0": "those who say, 'Our Lord, give us joy in our wives and children and make us a good example for those who have taqwa';",
        "TRANSLATION_1": "And those who say: \"O Lord, give us comfort in our spouses and children, and make us paragons of those who follow the straight path.\"\n",
        "TRANSLATION_2": "who pray, \"Our Lord, bless us with wives and children, who may be the comfort of our eyes, and make us leaders of the righteous. \" -\n",
        "TRANSLATION_3": "They pray, \"Lord, let our spouses and children be the delight of our eyes and ourselves examples for the pious ones.\"\n",
        "TRANSLATION_4": "And who submit, “Our Lord, soothe our eyes with our wives and our children, and make us leaders of the pious.”\n",
        "TRANSLATION_5": "And those who say: \"Our Lord! Bestow on us from our wives and our offspring the comfort of our eyes, and make us leaders of those who have Taqwa.\"\n",
        "TRANSLATION_6": "And they who say: O our Lord! grant us in our wives and our offspring the joy of our eyes, and make us guides to those who guard (against evil).\n",
        "TRANSLATION_7": "who say, 'Our Lord, give us refreshment of our wives and seed, and make us a model to the godfearing.'\n",
        "TRANSLATION_8": "And who say: Our Lord! Vouchsafe us comfort of our wives and of our offspring, and make us patterns for (all) those who ward off (evil).\n",
        "TRANSLATION_9": "who say, \"Lord, grant us joy in our wives and children and make us a model for the righteous.\"\n",
        "TRANSLATION_10": "And those who say: our Lord bestow on us coolness of eyes from our wives and our offspring, and make us unto the God-fearing a pattern.\n",
        "TRANSLATION_11": "And those who say, ‘Our Lord! Give us joy and comfort in our spouses and offspring, and make us imams of the Godwary.’\n",
        "TRANSLATION_12": "And those who pray, \"Our Lord! Grant unto us wives and offspring who will be the comfort of our eyes, and give us (the grace) to lead the righteous.\"\n",
        "TRANSLATION_13": "And those who say: \"Our Lord! Bestow on us from our wives and our offspring who will be the comfort of our eyes, and make us leaders for the Muttaqun\" (pious - see V. 2:2 and the footnote of V. 3:164).\"\n",
        "TRANSLATION_14": "Those who say: 'Lord give us of our wives and children what pleases our eyes and make us leaders to the fearful'\n",
        "TRANSLATION_15": "And those who say, “Our Lord, grant us delight in our spouses and our children, and make us a good example for the righteous.”\n",
        "TRANSLATION_16": "And those who say, \"Our Lord, grant us from among our wives and offspring comfort to our eyes and make us an example for the righteous.\"\n",
        "TRANSLATION_17": "[25:74] and those who say, ‘Our Lord! Grant us in our spouses and our offspring (read plural dhurriyyātinā or singular dhurriyyatinā) a joyful sight, for us, so that we see them obedient to You, and make us paragons, of   virtue, for the God-fearing’.\n",
        "TRANSLATION_18": "(And who say: Our Lord!) our Lord! (Vouchsafe us comfort of our wives and of our offspring) make our wives and offspring righteous so that we may find comfort in them, (and make us patterns for (all) those who ward off (evil)) make us righteous so that they emulate us.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "25:74",
            "40:8",
            "26:166",
            "15:88",
            "2:128",
            "42:38",
            "25:64",
            "32:17",
            "20:131",
            "23:50"
        ],
        "BIBLE": [
            "prophets:nahum:1:14",
            "torah:numbers:8:19",
            "prophets:hosea:2:14",
            "torah:exodus:36:6",
            "torah:genesis:3:6",
            "writings:ii%20chronicles:14:6",
            "torah:leviticus:17:11",
            "torah:leviticus:10:17",
            "prophets:isaiah:49:20",
            "torah:numbers:20:12"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:5:2"
        ]
    }
}