{
    "VERSE": "25:77",
    "ARABIC": "قُلْ مَا يَعْبَؤُا۟ بِكُمْ رَبِّى لَوْلَا دُعَآؤُكُمْ فَقَدْ كَذَّبْتُمْ فَسَوْفَ يَكُونُ لِزَامًۢا",
    "ENGLISH": {
        "TRANSLATION_0": "Say: 'What has My Lord to do with you if you do not call on Him? But you have denied the truth, so punishment is bound to come.'",
        "TRANSLATION_1": "Say: \"My Lord is not concerned on your account if you do not pray to Him. You have surely done with denying; soon will come the inevitable judgement.\n",
        "TRANSLATION_2": "O Muhammad, tell the people, \"MyLord does not care at all if you do not invoke Him. Now that you have denied (His Revelation), you will soon be awarded such a punishment which you will never be able to avoid.\"\n",
        "TRANSLATION_3": "(Muhammad), say (to the disbeliever) \"It does not matter to my Lord whether you worship Him or not. You have rejected His guidance and your punishment is inevitable.\"\n",
        "TRANSLATION_4": "Say (O dear Prophet Mohammed – peace and blessings be upon him) “You have no value before My Lord if you do not worship Him; so you have denied – therefore the punishment that remains, will occur.”\n",
        "TRANSLATION_5": "Say: \"My Lord pays attention to you only because of your invocation to Him. But now you have indeed denied. So the torment will be yours forever.\"\n",
        "TRANSLATION_6": "Say: My Lord would not care for you were it not for your prayer; but you have indeed rejected (the truth), so that which shall cleave shall come.\n",
        "TRANSLATION_7": "Say: 'My Lord esteems you not at all were it not for your prayer, for you have cried lies, and it shall surely be fastened.'\n",
        "TRANSLATION_8": "Say (O Muhammad, unto the disbelievers): My Lord would not concern Himself with you but for your prayer. But now ye have denied (the Truth), therefor there will be judgment.\n",
        "TRANSLATION_9": "Say, \"What would my Lord care for you, if you do not call on Him. Because you have indeed rejected the truth and His punishment is bound to overtake you.\n",
        "TRANSLATION_10": "Say thou: my Lord careth not for you were it not for your prayer. whereas ye have even belied, so presently this denial shall come as the cleaving punishment.\n",
        "TRANSLATION_11": "Say, ‘Were it not for the sake of summoning you [to faith], what store my Lord would have set by you? But you impugned [me and my summons], so it will soon follow as a result.’\n",
        "TRANSLATION_12": "Say (to the Rejecters): \"My Lord is not uneasy because of you if ye call not on Him: But ye have indeed rejected (Him), and soon will come the inevitable (punishment)!\"\n",
        "TRANSLATION_13": "Say (O Muhammad SAW to the disbelievers): \"My Lord pays attention to you only because of your invocation to Him. But now you have indeed denied (Him). So the torment will be yours for ever (inseparable permanent punishment).\"\n",
        "TRANSLATION_14": "Say: 'My Lord cares little for you if it was not for your supplication, indeed you have belied (the Messenger and the Koran) so it (the punishment) will be fastened'\n",
        "TRANSLATION_15": "Say, “What are you to my Lord without your prayers? You have denied the truth, and the inevitable will happen.”\n",
        "TRANSLATION_16": "Say, \"What would my Lord care for you if not for your supplication?\" For you [disbelievers] have denied, so your denial is going to be adherent.\n",
        "TRANSLATION_17": "[25:77] Say, O Muhammad (s), to the people of Mecca: ‘My Lord would not be concerned with you (mā is for negation) were it not for your supplications, to Him [when you are] in adversity, which He then removes. But, why should He be concerned with you when, you have denied, the Messenger and the Qur’ān, and so that, the chastisement, will remain binding’, permanently bound to you in the Hereafter, in addition to what will befall you in this world; and so on the day of Badr seventy of them were slain (the response to [the conditional] lawlā, ‘were it not for …’ is indicated the preceding words). Meccan, except for verses 197, and from 224 to the end of the sūra, [all of] which are Medinese; it consists of 227 verses, revealed after [sūrat] al-Wāqi‘a.\n",
        "TRANSLATION_18": "(Say) Muhammad, to the disbelievers of Mecca: (My Lord would not concern himself with you) what would my Lord do with your bodies and forms (but for your prayer) if He commands you to profess Allah's divine Oneness. (But now ye have denied) you have disbelieved in Muhammad (pbuh) and in the Qur'an, (therefore) this is a threat to them from Allah (there will be judgement) the punishment of the Day of Badr through beating, killing and enslaving them; this is to say: you have disbelieved in your Prophet and, therefore, the chastisement must necessarily befall you'. And of the surah in which the poets are mentioned, which is all Meccan except for the verses: (As for poets, the erring follow them. Hast thou not seen how they stray in every valley. And how they say that which they do not? Save those who believe and do good works, and remember Allah much, and vindicate themselves after they have been wronged. Those who do wrong will come to know by what a (great) reverse they will be overturned!) which were revealed in Medina, and it consists of 126 (sic) verses, 1,267 words and 5,542 letter: Surah 26: Poets (al-Shu'ara') And of the surah in which the poets are mentioned, which is all Meccan except for the verses: (As for poets, the erring follow them. Hast thou not seen how they stray in every valley. And how they say that which they do not? Save those who believe and do good works, and remember Allah much, and vindicate themselves after they have been wronged. Those who do wrong will come to know by what a (great) reverse they will be overturned 1 .) which were revealed in Medina, and it consists of 126 (sic) verses , 1,267 words and 5,542 letters:\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "25:77",
            "36:25",
            "26:188",
            "23:26",
            "23:39",
            "19:48",
            "14:40",
            "55:16",
            "55:13",
            "55:77"
        ],
        "BIBLE": [
            "prophets:ii%20kings:9:18",
            "prophets:i%20kings:18:21",
            "prophets:ii%20samuel:2:27",
            "prophets:i%20samuel:10:19",
            "torah:genesis:44:4",
            "torah:deuteronomy:17:14",
            "prophets:jeremiah:26:8",
            "prophets:judges:6:18",
            "torah:exodus:19:12",
            "prophets:ezekiel:36:22"
        ]
    }
}