{
    "VERSE": "25:8",
    "ARABIC": "أَوْ يُلْقَىٰٓ إِلَيْهِ كَنزٌ أَوْ تَكُونُ لَهُۥ جَنَّةٌ يَأْكُلُ مِنْهَا وَقَالَ ٱلظَّٰلِمُونَ إِن تَتَّبِعُونَ إِلَّا رَجُلًا مَّسْحُورًا",
    "ENGLISH": {
        "TRANSLATION_0": "Why has treasure not been showered down on him? Why does he not have a garden to give him food?' The wrongdoers say, 'You are merely following a man who is bewitched.'",
        "TRANSLATION_1": "Or a treasure should have been given to him, or he should have had an orchard from which he could eat.\" And these wicked people say: \"You only follow a man ensorcelled.\"\n",
        "TRANSLATION_2": "Or why has not at least a treasure been sent down for him or a garden given to him for (easy) sustenance?\" And the wicked people say, \"You are following a man bewitched.\"\n",
        "TRANSLATION_3": "Why has a treasure not been laid out for him or a garden from which he could eat been given to him.\" The unjust ones say, \"You are merely following a bewitched person\".\n",
        "TRANSLATION_4": "“Or that he should have obtained a hidden treasure, or should have had a garden from which to eat”; and the unjust said, “You do not follow but a man under a magic spell.”\n",
        "TRANSLATION_5": "Or (why) has not a treasure been granted to him, or why has he not a garden whereof he may eat\" And the wrongdoers say: \"You follow none but a man bewitched.\"\n",
        "TRANSLATION_6": "Or (why is not) a treasure sent down to him, or he is made to have a garden from which he should eat? And the unjust say: You do not follow any but a man deprived of reason.\n",
        "TRANSLATION_7": "Or why is not a treasure thrown to him, or why has he not a Garden to eat of?' The evildoers say, 'You are only following a man bewitched!'\n",
        "TRANSLATION_8": "Or (why is not) treasure thrown down unto him, or why hath he not a paradise from whence to eat? And the evil-doers say: Ye are but following a man bewitched.\n",
        "TRANSLATION_9": "Or a treasure should have been sent down to him, or he should have had a garden from which to eat.\" The wrongdoers say, \"You are surely following a man who is bewitched.\"\n",
        "TRANSLATION_10": "Or, whereforeis not there cast down unto him a treasure or he has a garden whereof he may eat! And the wrong-doeray: ye follow only a man bewitched.\n",
        "TRANSLATION_11": "Or, ‘[Why is not] a treasure thrown to him, or [why does] he [not] have a garden from which he may eat?’ And the wrongdoers say, ‘You are just following a bewitched man.’\n",
        "TRANSLATION_12": "Or (Why) has not a treasure been bestowed on him, or why has he (not) a garden for enjoyment?\" The wicked say: \"Ye follow none other than a man bewitched.\"\n",
        "TRANSLATION_13": "Or (why) has not a treasure been granted to him, or why has he not a garden whereof he may eat?\" And the Zalimun (polytheists and wrong-doers, etc.) say: \"You follow none but a man bewitched.\"\n",
        "TRANSLATION_14": "Or, why has no treasure been thrown to him, or a garden for him to eat from' And the harmdoers say: 'The man you follow is surely bewitched'\n",
        "TRANSLATION_15": "Or, “If only a treasure was dropped on him.” Or, “If only he had a garden from which he eats.” The evildoers also say, “You are following but a man under spell.”\n",
        "TRANSLATION_16": "Or [why is not] a treasure presented to him [from heaven], or does he [not] have a garden from which he eats?\" And the wrongdoers say, \"You follow not but a man affected by magic.\"\n",
        "TRANSLATION_17": "[25:8] Or a treasure thrown down to him, from the heaven, for him to spend from so as not to be in need of walking through the marketplaces in order to earn his livelihood. Or he has a garden, an orchard, for him to eat from?’, that is, [to eat] from its fruits and satisfy himself therewith (a variant reading [for ya’kulu, ‘for him to eat’] has na’kulu, ‘for us to eat’) and thus possess because of that [garden] an advantage over us. The wrongdoers, namely, the disbelievers, say, to the believers: ‘You are just following a man bewitched!’, one duped, his mind overcome. God, exalted be He, says:\n",
        "TRANSLATION_18": "(Or (why is not) a treasure thrown down unto him) for him to use, (or why hath he not a Paradise) a garden (from whence to eat) and be full? (And the evil-doers) the idolaters: Abu Jahl, al-Nadr and Umayyah and their hosts (say: Ye are but following a man) Muhammad (bewitched) who is possessed and mad.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "25:8",
            "47:6",
            "26:90",
            "23:25",
            "17:47",
            "18:107",
            "43:70",
            "16:43",
            "38:62",
            "11:104"
        ],
        "BIBLE": [
            "prophets:ii%20kings:4:43",
            "torah:numbers:11:13",
            "prophets:hosea:2:14",
            "prophets:ezekiel:4:15",
            "torah:genesis:3:12",
            "torah:exodus:17:2",
            "writings:ii%20chronicles:19:6",
            "prophets:jeremiah:44:20",
            "torah:numbers:11:18",
            "torah:genesis:20:16"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:3:8"
        ]
    }
}