{
    "VERSE": "47:11",
    "ARABIC": "ذَٰلِكَ بِأَنَّ ٱللَّهَ مَوْلَى ٱلَّذِينَ ءَامَنُوا۟ وَأَنَّ ٱلْكَٰفِرِينَ لَا مَوْلَىٰ لَهُمْ",
    "ENGLISH": {
        "TRANSLATION_0": "That is because Allah is the Protector of those who have iman and because those who are kafir have no protector.",
        "TRANSLATION_1": "This is so for God is the friend of those who believe while the unbelievers have no friend.\n",
        "TRANSLATION_2": "That is because Allah is the Protector of the believers whereas the unbelievers have none to protect them.\n",
        "TRANSLATION_3": "God is the guardian of the believers, but the disbelievers have no guardian.\n",
        "TRANSLATION_4": "This is because Allah is the Supporter of the believers, whereas the disbelievers do not have any supporter.\n",
        "TRANSLATION_5": "That is because Allah is the Protector of those who believe, whereas the disbelievers have no protector.\n",
        "TRANSLATION_6": "That is because Allah is the Protector of those who believe, and because the unbelievers shall have no protector for them.\n",
        "TRANSLATION_7": "That is because God is the Protector of the believers, and that the unbelievers have no protector.\n",
        "TRANSLATION_8": "That is because Allah is patron of those who believe, and because the disbelievers have no patron.\n",
        "TRANSLATION_9": "That is because God is the protector of the believers, and those who deny the truth have no protector at all.\n",
        "TRANSLATION_10": "That is because Allah is the patron of those who believe, and because the infidels! no patron is theirs.\n",
        "TRANSLATION_11": "That is because Allah is the protector of the faithful, and because the faithless have no protector.\n",
        "TRANSLATION_12": "That is because Allah is the Protector of those who believe, but those who reject Allah have no protector.\n",
        "TRANSLATION_13": "That is because Allah is the Maula (Lord, Master, Helper, Protector, etc.) of those who believe, and the disbelievers have no Maula (lord, master, helper, protector, etc.).\n",
        "TRANSLATION_14": "that is because Allah is the Guardian of the believers, and the unbelievers have no guardian.\n",
        "TRANSLATION_15": "That is because God is the Master of those who believe, while the disbelievers have no master.\n",
        "TRANSLATION_16": "That is because Allah is the protector of those who have believed and because the disbelievers have no protector.\n",
        "TRANSLATION_17": "[47:11] That, granting of victory to the believers and the vanquishing of the disbelievers, is because God is Patron, Ally and Helper, of those who believe and because the disbelievers have no patron.\n",
        "TRANSLATION_18": "(That) i.e. helping the believers (is because Allah is patron) helper (of those who believe) in Muhammad (pbuh) and the Qur'an, (and because the disbelievers) of Mecca (have no patron) have no helper.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "47:11",
            "9:51",
            "10:95",
            "3:141",
            "7:196",
            "8:40",
            "9:43",
            "47:26",
            "16:105",
            "39:61"
        ],
        "BIBLE": [
            "torah:deuteronomy:12:4",
            "torah:deuteronomy:1:32",
            "prophets:jeremiah:42:5",
            "prophets:isaiah:43:10",
            "prophets:malachi:1:6",
            "prophets:isaiah:25:1",
            "prophets:ii%20kings:17:14",
            "prophets:ezekiel:39:8",
            "torah:genesis:24:27",
            "torah:exodus:4:5"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:14"
        ]
    }
}