{
    "VERSE": "47:13",
    "ARABIC": "وَكَأَيِّن مِّن قَرْيَةٍ هِىَ أَشَدُّ قُوَّةً مِّن قَرْيَتِكَ ٱلَّتِىٓ أَخْرَجَتْكَ أَهْلَكْنَٰهُمْ فَلَا نَاصِرَ لَهُمْ",
    "ENGLISH": {
        "TRANSLATION_0": "How many cities We have destroyed, greater in strength than your city which has driven you out, and there was no one to help them.",
        "TRANSLATION_1": "How many were the habitations, mightier than your city which has turned you out, which We destroyed; and they did not have a helper.\n",
        "TRANSLATION_2": "(O Prophet), how many are the cities that had greater power than your city that drove you out? We destroyed them and there was none to protect them.\n",
        "TRANSLATION_3": "(Muhammad), how many towns, much more powerful than the one from which you have been expelled, have We destroyed and left helpless?\n",
        "TRANSLATION_4": "And many a township existed which was stronger than your town (O dear Prophet Mohammed – peace and blessings be upon him) – those who removed you from your town – We destroyed them, so they do not have a supporter!\n",
        "TRANSLATION_5": "And how many a town mightier than your town that has driven you out We have destroyed, with none to help them!\n",
        "TRANSLATION_6": "And how many a town which was far more powerful than the town of yours which has driven you out: We destroyed them so there was no helper for them.\n",
        "TRANSLATION_7": "How many a city that was stronger in might than thy city which has expelled thee have We destroyed! And there was no helper for them.\n",
        "TRANSLATION_8": "And how many a township stronger than thy township (O Muhammad) which hath cast thee out, have We destroyed, and they had no helper!\n",
        "TRANSLATION_9": "How many towns We have destroyed, greater in strength than your city which has driven you out, and there was no one to help them.\n",
        "TRANSLATION_10": "And many a city, mightier In strength than the city which drave thee forth, We destroyed them, and there was no helper of theirs.\n",
        "TRANSLATION_11": "How many a town We have destroyed which was more powerful than your town which expelled you, and they had no helper.\n",
        "TRANSLATION_12": "And how many cities, with more power than thy city which has driven thee out, have We destroyed (for their sins)? and there was none to aid them.\n",
        "TRANSLATION_13": "And many a town, stronger than your town (Makkah) (O Muhammad SAW) which has driven you out We have destroyed. And there was none to help them.\n",
        "TRANSLATION_14": "How many a village mightier than your own village, which has expelled you, We have destroyed there was none to help them!\n",
        "TRANSLATION_15": "How many a town was more powerful than your town which evicted you? We destroyed them, and there was no helper for them.\n",
        "TRANSLATION_16": "And how many a city was stronger than your city [Makkah] which drove you out? We destroyed them; and there was no helper for them.\n",
        "TRANSLATION_17": "[47:13] And how many (ka-ayyin means kam) a town, by which is meant the inhabitants thereof, mightier in power than your town, Mecca, that is to say, its inhabitants, which expelled you (akhrajatka [is feminine despite the plural sense of inhabitants meant is because it] takes into account the [feminine] form of qarya, ‘town’), have We destroyed (ahlaknāhum takes into account the former [plural] import of qarya, ‘town’), and they had none to help them, against Our destruction [of them].\n",
        "TRANSLATION_18": "(And how many a township) how many inhabitants of townships (stronger) physically and numerically (than thy township (0 Muhammad)) i.e. Mecca (which hath cast thee out) whose inhabitants caused you to move to Medina, (have We destroyed) when they rejected faith, (and they had no helper) they had no one to save them from Allah's chastisement!\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "47:13",
            "26:208",
            "86:10",
            "53:5",
            "45:18",
            "40:82",
            "15:4",
            "17:16",
            "21:95",
            "11:80"
        ],
        "BIBLE": [
            "writings:daniel:10:8",
            "writings:daniel:9:16",
            "writings:nehemiah:9:26",
            "prophets:jeremiah:31:23",
            "writings:job:26:2",
            "prophets:joel:2:20",
            "writings:psalms:22:20",
            "prophets:joel:2:14",
            "writings:ii%20chronicles:14:10",
            "prophets:ii%20samuel:22:38"
        ]
    }
}