{
    "VERSE": "47:19",
    "ARABIC": "فَٱعْلَمْ أَنَّهُۥ لَآ إِلَٰهَ إِلَّا ٱللَّهُ وَٱسْتَغْفِرْ لِذَنۢبِكَ وَلِلْمُؤْمِنِينَ وَٱلْمُؤْمِنَٰتِ وَٱللَّهُ يَعْلَمُ مُتَقَلَّبَكُمْ وَمَثْوَىٰكُمْ",
    "ENGLISH": {
        "TRANSLATION_0": "Know then that there is no god except Allah and ask forgiveness for your wrongdoing, and for the men and women who have iman. Allah knows both your activity and your repose.",
        "TRANSLATION_1": "Know then, therefore, there is no god but He, and ask forgiveness for your sins and those of believing men and women. God knows your wanderings and your destination.\n",
        "TRANSLATION_2": "Know, therefore, (O Prophet), that there is no god but Allah, and ask forgiveness for your shortcomings and also for (the shortcomings of) believing men and believing women. Allah knows the places where you move about and where you dwell.\n",
        "TRANSLATION_3": "Know that God is the only Lord. Ask forgiveness for your sins and for the sins of the believing men and women. God knows when you move and when you rest.\n",
        "TRANSLATION_4": "Therefore know (O dear Prophet Mohammed – peace and blessings be upon him) that there is none worthy of worship except Allah, and seek the forgiveness of sins of your close ones and for the common believing men and women; and Allah knows your movements during the day and your resting during the night.\n",
        "TRANSLATION_5": "So know that La ilaha illallah and ask forgiveness for your sin, and also for (the sin of) believing men and women. And Allah knows well your moving about, and your place of rest.\n",
        "TRANSLATION_6": "So know that there is no god but Allah, and, ask protection for your fault and for the believing men and the believing women; and Allah knows the place of your returning and the place of your abiding.\n",
        "TRANSLATION_7": "Know thou therefore that there is no god but God, and ask forgiveness for thy sin, and for the believers, men and women. God knows your going to and fro, and your lodging.\n",
        "TRANSLATION_8": "So know (O Muhammad) that there is no Allah save Allah, and ask forgiveness for thy sin and for believing men and believing women. Allah knoweth (both) your place of turmoil and your place of rest.\n",
        "TRANSLATION_9": "Know then that there is no god except God. Ask forgiveness for your wrongdoing, and for the men and women who believe. God knows both your movements and your lodging.\n",
        "TRANSLATION_10": "So know thou that there is no god save Allah, and ask forgiveness for thy fault and for believing men and believing women. And Allah knoweth well your moving about and your place of rest.\n",
        "TRANSLATION_11": "Know that there is no god except Allah, and plead [to Allah] for forgiveness of your sin and for the faithful, men and women. Allah knows your itinerary and your [final] abode.\n",
        "TRANSLATION_12": "Know, therefore, that there is no god but Allah, and ask forgiveness for thy fault, and for the men and women who believe: for Allah knows how ye move about and how ye dwell in your homes.\n",
        "TRANSLATION_13": "So know (O Muhammad SAW) that La ilaha ill-Allah (none has the right to be worshipped but Allah), and ask forgiveness for your sin, and also for (the sin of) believing men and believing women. And Allah knows well your moving about, and your place of rest (in your homes).\n",
        "TRANSLATION_14": "Therefore, know that there is no god except Allah and ask for forgiveness of your sins and for the believers, men and women. Allah knows your going to and fro, and your lodging.\n",
        "TRANSLATION_15": "Know that there is no god but God, and ask forgiveness for your sin, and for the believing men and believing women. God knows your movements, and your resting-place.\n",
        "TRANSLATION_16": "So know, [O Muhammad], that there is no deity except Allah and ask forgiveness for your sin and for the believing men and believing women. And Allah knows of your movement and your resting place.\n",
        "TRANSLATION_17": "[47:19] Know, then, that there is no god except God, that is to say, adhere, O Muhammad (s), to knowledge of this [fact] that will benefit you at the Resurrection, and ask forgiveness for your sin — this was said to him, despite his infallibility (‘isma), so that his community might emulate him [in this respect]. Indeed he did do this. The Prophet (s) said, ‘Verily I do ask God for forgiveness a hundred times every day’ — and for the believing men and believing women — herein is an honouring for them, by having their Prophet enjoined to ask forgiveness for them. And God knows your going to and fro, your bustle during the day in pursuit of   your business, and your place of rest, when you retire to where you sleep at night. In other words, He has knowledge of all your states, nothing of which can be hidden from Him, so be mindful of Him — the address [in this verse] is meant for believers as well as others.\n",
        "TRANSLATION_18": "592 (So know) Muhammad (that there is no God save Allah) there is none that harms or benefits, gives or withholds, raises or abases except Allah; and it is also said that this means: and know there is nothing that has the merit of \"there is no deity save Allah\", (and ask forgiveness for thy sin) Muhammad, when he beat up Zayd Ibn al-Samin, the Jew (and for believing men and believing women) and seek forgiveness for the sins of the believing men and believing women. (Allah knoweth (both) your place of turmoil) your goings and comings as well as your works in the life of the world (and your place of rest) and He knows your destination and abode in the Hereafter.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "47:19",
            "20:14",
            "16:74",
            "71:4",
            "53:62",
            "40:14",
            "9:51",
            "2:132",
            "47:11",
            "64:13"
        ],
        "BIBLE": [
            "torah:deuteronomy:1:31",
            "torah:deuteronomy:1:33",
            "prophets:i%20samuel:26:25",
            "writings:ruth:1:7",
            "torah:deuteronomy:16:6",
            "torah:genesis:32:1",
            "torah:genesis:18:33",
            "prophets:jeremiah:51:62",
            "torah:genesis:38:22",
            "prophets:ii%20samuel:19:40"
        ]
    }
}