{
    "VERSE": "47:20",
    "ARABIC": "وَيَقُولُ ٱلَّذِينَ ءَامَنُوا۟ لَوْلَا نُزِّلَتْ سُورَةٌ فَإِذَآ أُنزِلَتْ سُورَةٌ مُّحْكَمَةٌ وَذُكِرَ فِيهَا ٱلْقِتَالُ رَأَيْتَ ٱلَّذِينَ فِى قُلُوبِهِم مَّرَضٌ يَنظُرُونَ إِلَيْكَ نَظَرَ ٱلْمَغْشِىِّ عَلَيْهِ مِنَ ٱلْمَوْتِ فَأَوْلَىٰ لَهُمْ",
    "ENGLISH": {
        "TRANSLATION_0": "Those who have iman say, 'If only a sura could be sent down.' But when a straightforward sura is sent down and fighting is mentioned in it, you see those with sickness in their hearts looking at you with the look of someone about to faint from fear of death. More fitting for them",
        "TRANSLATION_1": "Those who believe say: \"How is it no Surah was revealed?\" But when a categorical Surah is revealed that mentions war, you should see those who are sceptical staring at you like a man in the swoon of death. Alas the woe for them!\n",
        "TRANSLATION_2": "The believers used to say: “Why is a surah (that would ordain fighting) not revealed?” But when a definitive surah was revealed wherein fighting was mentioned, you saw that those in whose hearts there was a sickness looked at you as though they were about to faint at the approach of death. Pity on them!\n",
        "TRANSLATION_3": "The believers say, \"Why is a chapter about jihad - fighting for the cause of God - not revealed?\" But when such a chapter, with clear commands and a mention of jihad is revealed, you will see those whose hearts are sick look at you as if suffering the agony of death. One can expect nothing better from them!\n",
        "TRANSLATION_4": "And the Muslims say, “Why was not a chapter sent down?” So when a positive chapter was sent down, and war was commanded in it, you will see those in whose hearts is a disease looking at you with the dazed looks of a dying man; so it would be better for them. –\n",
        "TRANSLATION_5": "Those who believe say: \"Why is not a Surah sent down (for us)\" But now that a decisive Surah is sent down mentioning fighting, you can see those in whose hearts is disease (of hypocrisy) looking at you with the look of one who is about to faint for fear of death. But it was better for them.\n",
        "TRANSLATION_6": "And those who believe say: Why has not a chapter been revealed? But when a decisive chapter is revealed, and fighting is mentioned therein you see those in whose hearts is a disease look to you with the look of one fainting because of death. Woe to them then!\n",
        "TRANSLATION_7": "Those who believe say, 'Why has a sura not been sent down?' Then, when a clear sura is sent down, and therein fighting is mentioned, thou seest those in whose hearts is sickness looking at thee as one who swoons of death; but better for them would be\n",
        "TRANSLATION_8": "And those who believe say: If only a surah were revealed! But when a decisive surah is revealed and war is mentioned therein, thou seest those in whose hearts is a disease looking at thee with the look of men fainting unto death. Therefor woe unto them!\n",
        "TRANSLATION_9": "Those who believe ask why no chapter [about fighting] has been sent down. Yet when a decisive chapter that mentions fighting is sent down, you can see the sick of heart looking at you [Prophet] as if they were under the shadow of death. Therefore, woe to them!\n",
        "TRANSLATION_10": "And those who believe say wherefore hath not a Surah been revealed? Then when there is sent down a Surah firmly constructed, and fighting is mentioned therein, thou seest those in whose hearts is a disease looking at thee with the look of one swooning Unto death. So also for them!\n",
        "TRANSLATION_11": "The faithful say, ‘If only a surah were sent down!’ But when a conclusive surah is sent down and war is mentioned in it, you see those in whose hearts is a sickness looking upon you with the look of someone fainting at death. So woe to them!\n",
        "TRANSLATION_12": "Those who believe say, \"Why is not a sura sent down (for us)?\" But when a sura of basic or categorical meaning is revealed, and fighting is mentioned therein, thou wilt see those in whose hearts is a disease looking at thee with a look of one in swoon at the approach of death. But more fitting for them-\n",
        "TRANSLATION_13": "Those who believe say: \"Why is not a Surah (chapter of the Quran) sent down (for us)? But when a decisive Surah (explaining and ordering things) is sent down, and fighting (Jihad - holy fighting in Allah's Cause) is mentioned (i.e. ordained) therein, you will see those in whose hearts is a disease (of hypocrisy) looking at you with a look of one fainting to death. But it was better for them (hypocrites, to listen to Allah and to obey Him).\n",
        "TRANSLATION_14": "The believers ask: 'Has a chapter been sent down' But when a clear chapter is sent down and fighting is mentioned in it, you see those in whose hearts is sickness looking towards you as one who swoons at death.\n",
        "TRANSLATION_15": "Those who believe say, “If only a chapter is sent down.” Yet when a decisive chapter is sent down, and fighting is mentioned in it, you see those in whose hearts is sickness looking at you with the look of someone fainting at death. So woe to them!\n",
        "TRANSLATION_16": "Those who believe say, \"Why has a surah not been sent down? But when a precise surah is revealed and fighting is mentioned therein, you see those in whose hearts is hypocrisy looking at you with a look of one overcome by death. And more appropriate for them [would have been]\n",
        "TRANSLATION_17": "[47:20] And those who believe say, seeking to take part in the struggle: ‘Why has a sūra not been revealed?’, [one] in which there is mention of the [command to participate in the] struggle. But when a definitive sūra is revealed, one in which nothing is abrogated (naskh), and fighting, that is to say, requirement for it, is mentioned in it, you see those in whose hearts is a sickness, that is, doubt — and they are the hypocrites — looking at you with the look of someone fainting at [the point of] death, because of [their] fear of it and [their] aversion to it; in other words, they fear fighting and are averse to it. Yet more fitting for them (faawlā lahum is a subject, the predicate of which [is the following, tā‘atun wa-qawlun ma‘rūfun])\n",
        "TRANSLATION_18": "(And those who believe) in Muhammad (pbuh) and in the Qur'an, the sincere ones, (say: If only a surah were revealed) if only Gabriel would bring down a surah! They said this out of longing for the remembrance of Allah and wishing to engage in more acts of obedience. (But when a decisive surah is revealed) explaining the lawful and unlawful, the commands and prohibitions (and war is mentioned therein) and fighting is commanded therein, (thou seest those in whose hearts is a disease) i.e. doubt and hypocrisy (looking at thee) upon mentioning fighting (with the look of men fainting unto death) as people who are suffering the pangs of death because of their dislike of fighting the enemies. (Therefore woe unto them!) This is a threat to them with Allah's chastisement.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "47:20",
            "33:32",
            "9:125",
            "5:52",
            "33:60",
            "33:12",
            "5:113",
            "24:50",
            "8:24",
            "22:53"
        ],
        "BIBLE": [
            "prophets:i%20samuel:16:7",
            "writings:i%20chronicles:29:17",
            "writings:nehemiah:6:8",
            "prophets:jeremiah:14:14",
            "writings:job:38:17",
            "writings:ii%20chronicles:10:16",
            "torah:genesis:20:6",
            "torah:genesis:22:12",
            "prophets:ezekiel:16:30",
            "writings:proverbs:25:7"
        ]
    }
}