{
    "VERSE": "47:22",
    "ARABIC": "فَهَلْ عَسَيْتُمْ إِن تَوَلَّيْتُمْ أَن تُفْسِدُوا۟ فِى ٱلْأَرْضِ وَتُقَطِّعُوٓا۟ أَرْحَامَكُمْ",
    "ENGLISH": {
        "TRANSLATION_0": "Is it not likely that, if you did turn away, you would cause corruption in the earth and sever your ties of kinship?",
        "TRANSLATION_1": "Is it possible that if placed in authority you will create disorder in the land and sever your bonds of relationship?\n",
        "TRANSLATION_2": "Now, if you were to turn away, what else can be expected but that you will work corruption in the land and fly at each other's throats?\n",
        "TRANSLATION_3": "If you ignore the commands of God would you then also spread evil in the land and sever the ties of kinship?\n",
        "TRANSLATION_4": "So do you* portray that if you get governance, you would spread chaos in the land and sever your relations? (* The hypocrites)\n",
        "TRANSLATION_5": "So would you perhaps, if you turned away, spread corruption on earth, and sever your ties of kinship\n",
        "TRANSLATION_6": "But if you held command, you were sure to make mischief in the land and cut off the ties of kinship!\n",
        "TRANSLATION_7": "If you turned away, would you then haply work corruption in the land, and break your bonds of kin?\n",
        "TRANSLATION_8": "Would ye then, if ye were given the command, work corruption in the land and sever your ties of kinship?\n",
        "TRANSLATION_9": "Then if you turn away, you are likely to spread corruption on the earth and sever your ties of kinship.\n",
        "TRANSLATION_10": "Then, belike ye are, if ye turn to cause corruption in the earth away, and to sever your kinship.\n",
        "TRANSLATION_11": "May it not be that if you were to wield authority you would cause corruption in the land and ill-treat your blood relations?\n",
        "TRANSLATION_12": "Then, is it to be expected of you, if ye were put in authority, that ye will do mischief in the land, and break your ties of kith and kin?\n",
        "TRANSLATION_13": "Would you then, if you were given the authority, do mischief in the land, and sever your ties of kinship?\n",
        "TRANSLATION_14": "Could it be, that if you turn away, you might make corruption in the land and break the ties of kinship?\n",
        "TRANSLATION_15": "If you turn away, you are likely to make mischief on earth, and sever your family ties.\n",
        "TRANSLATION_16": "So would you perhaps, if you turned away, cause corruption on earth and sever your [ties of] relationship?\n",
        "TRANSLATION_17": "[47:22] May it not be [the case] with you, (read ‘asītum or ‘asaytum; there is a shift here from the third person to the second person address), that if you were to turn away, [if] you were to shun faith, you would then cause corruption in the land and sever your kinship ties?, in other words, [that] you would then return to the ways of pagandom such as belligerence and fighting.\n",
        "TRANSLATION_18": "(Would ye then, if ye were given the command) would you then, group of hypocrites, wish that if you were given the command of this community after the Prophet (pbuh) (work corruption in the land) through killing, transgressions and corruption (and sever your ties of kinship) by making disbelief manifest?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "47:22",
            "23:84",
            "7:110",
            "51:48",
            "23:79",
            "28:5",
            "67:16",
            "38:28",
            "26:152",
            "67:24"
        ],
        "BIBLE": [
            "prophets:i%20kings:5:23",
            "torah:leviticus:26:19",
            "writings:ezra:9:14",
            "prophets:hosea:2:20",
            "prophets:nahum:1:14",
            "torah:deuteronomy:31:20",
            "torah:exodus:34:10",
            "prophets:ezekiel:17:18",
            "prophets:isaiah:42:3",
            "prophets:joshua:22:4"
        ]
    }
}