{
    "VERSE": "47:23",
    "ARABIC": "أُو۟لَٰٓئِكَ ٱلَّذِينَ لَعَنَهُمُ ٱللَّهُ فَأَصَمَّهُمْ وَأَعْمَىٰٓ أَبْصَٰرَهُمْ",
    "ENGLISH": {
        "TRANSLATION_0": "Such are the people Allah has cursed, making them deaf and blinding their eyes.",
        "TRANSLATION_1": "They are those who were condemned by God, whose ears were blocked by Him and their eyes blinded.\n",
        "TRANSLATION_2": "It is these upon whom Allah has laid His curse: so He made them deaf and deprived them of their sight.\n",
        "TRANSLATION_3": "God has condemned these people and made them deaf, dumb, and blind.\n",
        "TRANSLATION_4": "It is these whom Allah has cursed, so He made them deaf to the Truth and blinded their eyes.\n",
        "TRANSLATION_5": "Such are the ones whom Allah has cursed, so that He has made them deaf and blinded their vision.\n",
        "TRANSLATION_6": "Those it is whom Allah has cursed so He has made them deaf and blinded their eyes.\n",
        "TRANSLATION_7": "Those are they whom God has cursed, and so made them deaf, and blinded their eyes.\n",
        "TRANSLATION_8": "Such are they whom Allah curseth so that He deafeneth them and maketh blind their eyes.\n",
        "TRANSLATION_9": "Such are those whom God has rejected, making their ears deaf and their eyes blind.\n",
        "TRANSLATION_10": "Those are they whom Allah hath cursed, and then hath deafened them and blinded their sights.\n",
        "TRANSLATION_11": "They are the ones whom Allah has cursed, so He made them deaf, and blinded their sight.\n",
        "TRANSLATION_12": "Such are the men whom Allah has cursed for He has made them deaf and blinded their sight.\n",
        "TRANSLATION_13": "Such are they whom Allah has cursed, so that He has made them deaf and blinded their sight.\n",
        "TRANSLATION_14": "Such are those whom Allah has cursed, making them deaf and blinding their eyes.\n",
        "TRANSLATION_15": "Those are they whom God has cursed. He made them deaf, and blinded their sight.\n",
        "TRANSLATION_16": "Those [who do so] are the ones that Allah has cursed, so He deafened them and blinded their vision.\n",
        "TRANSLATION_17": "[47:23] Those, that is, the agents of corruption, are the ones whom God has cursed, so made them deaf, to hearing the truth, and blinded their eyes, to the path of guidance.\n",
        "TRANSLATION_18": "(Such) the hypocrites (are they whom Allah curseth) are they whom Allah banished from any good (so that He deafeneth them) from the Truth and guidance (and maketh blind their eyes) such that they do not see the Truth and guidance.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "47:23",
            "16:108",
            "64:2",
            "24:52",
            "16:128",
            "3:141",
            "26:179",
            "26:150",
            "26:163",
            "26:110"
        ],
        "BIBLE": [
            "prophets:jeremiah:16:20",
            "prophets:ii%20kings:7:19",
            "writings:ecclesiastes:9:1",
            "writings:daniel:6:12",
            "writings:ecclesiastes:7:13",
            "torah:deuteronomy:26:19",
            "writings:daniel:6:27",
            "writings:daniel:10:14",
            "prophets:jeremiah:49:15",
            "writings:i%20chronicles:17:22"
        ]
    }
}