{
    "VERSE": "47:24",
    "ARABIC": "أَفَلَا يَتَدَبَّرُونَ ٱلْقُرْءَانَ أَمْ عَلَىٰ قُلُوبٍ أَقْفَالُهَآ",
    "ENGLISH": {
        "TRANSLATION_0": "Will they not then ponder the Qur'an or are there locks upon their hearts?",
        "TRANSLATION_1": "Do they not ponder on what the Qur'an says? Or have their hearts been sealed with locks?\n",
        "TRANSLATION_2": "Do they, then, not reflect on the Qur'an? Or are there locks on their hearts?\n",
        "TRANSLATION_3": "Is it that they do not think about the Quran or are their hearts sealed?\n",
        "TRANSLATION_4": "So do they not ponder the Qur’an deeply, or are there locks on some of their hearts?\n",
        "TRANSLATION_5": "Will they not then reflect upon the Qur'an, or are there locks upon their hearts\n",
        "TRANSLATION_6": "Do they not then reflect on the Quran? Nay, on the hearts there are locks.\n",
        "TRANSLATION_7": "What, do they not ponder the Koran? Or is it that there are locks upon their hearts?\n",
        "TRANSLATION_8": "Will they then not meditate on the Qur'an, or are there locks on the hearts?\n",
        "TRANSLATION_9": "Will they not, then, ponder over this Quran? Or are there locks upon their hearts?\n",
        "TRANSLATION_10": "Ponder then they not on the Qur'an, or are on the hearts locks thereof?\n",
        "TRANSLATION_11": "Do they not contemplate the Quran, or are there locks on the hearts?\n",
        "TRANSLATION_12": "Do they not then earnestly seek to understand the Qur'an, or are their hearts locked up by them?\n",
        "TRANSLATION_13": "Do they not then think deeply in the Quran, or are their hearts locked up (from understanding it)?\n",
        "TRANSLATION_14": "Will they not then contemplate on the Koran? Or are there locks upon their hearts!\n",
        "TRANSLATION_15": "Will they not ponder the Quran? Or are there locks upon their hearts?\n",
        "TRANSLATION_16": "Then do they not reflect upon the Qur'an, or are there locks upon [their] hearts?\n",
        "TRANSLATION_17": "[47:24] Do they not contemplate the Qur’ān?, and so recognise the truth. Or (am here is like bal, ‘nay, but’) is it that there are locks on, their, hearts?, so they are unable to comprehend it.\n",
        "TRANSLATION_18": "(Will they then not meditate on the Qur'an) regarding that which has been revealed about them, (or are there locks on the hearts) or are there locks on the hearts of the hypocrites such that they do not understand what is revealed about them?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "47:24",
            "84:21",
            "73:4",
            "76:23",
            "5:113",
            "9:87",
            "20:2",
            "55:2",
            "26:194",
            "30:59"
        ],
        "BIBLE": [
            "writings:i%20chronicles:17:2",
            "prophets:i%20samuel:14:7",
            "prophets:isaiah:44:18",
            "writings:psalms:10:13",
            "prophets:jeremiah:31:20",
            "writings:job:17:4",
            "prophets:isaiah:44:19",
            "writings:esther:7:5",
            "torah:exodus:4:14",
            "writings:psalms:49:4"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:1:13",
            "Sefer%20Yetzirah:1:3"
        ]
    }
}