{
    "VERSE": "47:27",
    "ARABIC": "فَكَيْفَ إِذَا تَوَفَّتْهُمُ ٱلْمَلَٰٓئِكَةُ يَضْرِبُونَ وُجُوهَهُمْ وَأَدْبَٰرَهُمْ",
    "ENGLISH": {
        "TRANSLATION_0": "How will it be when the angels take them in death, beating their faces and their backs?",
        "TRANSLATION_1": "How will it be when the angels draw out their souls striking their faces and their backs?\n",
        "TRANSLATION_2": "But how will they fare when angels will take their souls at death and will carry them, striking their faces and backs?\n",
        "TRANSLATION_3": "How terrible it will be for them when the angels take away their souls by striking their faces and their backs.\n",
        "TRANSLATION_4": "So how (dreadful) will it be when the angels remove their souls, striking at their faces and their backs!\n",
        "TRANSLATION_5": "Then how (will it be) when the angels will take their souls at death, striking their faces and their backs\n",
        "TRANSLATION_6": "But how will it be when the angels cause them to die smiting their backs.\n",
        "TRANSLATION_7": "How shall it be, when the angels take them, beating their faces and their backs?\n",
        "TRANSLATION_8": "Then how (will it be with them) when the angels gather them, smiting their faces and their backs!\n",
        "TRANSLATION_9": "Then how will it be when the angels take their souls, beating them on their faces and their backs,\n",
        "TRANSLATION_10": "How then shall it be when the angels shall take them away at death smiting their faces and their backs!\n",
        "TRANSLATION_11": "But how will it be [with them] when the angels take them away, striking their faces and their backs?!\n",
        "TRANSLATION_12": "But how (will it be) when the angels take their souls at death, and smite their faces and their backs?\n",
        "TRANSLATION_13": "Then how (will it be) when the angels will take their souls at death, smiting their faces and their backs?\n",
        "TRANSLATION_14": "How shall it be when the angels (of death) take them and beat them on their face and back?\n",
        "TRANSLATION_15": "How about when the angels take them at death, beating their faces and their backs?\n",
        "TRANSLATION_16": "Then how [will it be] when the angels take them in death, striking their faces and their backs?\n",
        "TRANSLATION_17": "[47:27] Then how will it be, their predicament, when the angels take them away, beating (yadribūna is a   circumstantial qualifier referring to the angels) their faces and their backs?, with hooked iron rods.\n",
        "TRANSLATION_18": "(Then how (will it be with them) when the angels gather them) when the angels take away the souls of the Jews, (smiting their faces and their backs) with iron skewers!\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "47:27",
            "8:50",
            "7:84",
            "88:19",
            "19:29",
            "89:22",
            "54:45",
            "50:40",
            "20:116",
            "28:40"
        ],
        "BIBLE": [
            "prophets:ii%20kings:25:21",
            "prophets:jeremiah:52:27",
            "writings:psalms:49:18",
            "prophets:jeremiah:29:14",
            "prophets:isaiah:57:13",
            "prophets:jeremiah:43:3",
            "torah:numbers:24:22",
            "prophets:jeremiah:29:7",
            "writings:job:24:10",
            "prophets:isaiah:41:16"
        ],
        "KABBALAH": [
            
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:3:7",
            "Sefer%20Yetzirah:2:2",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:5"
        ]
    }
}