{
    "VERSE": "47:29",
    "ARABIC": "أَمْ حَسِبَ ٱلَّذِينَ فِى قُلُوبِهِم مَّرَضٌ أَن لَّن يُخْرِجَ ٱللَّهُ أَضْغَٰنَهُمْ",
    "ENGLISH": {
        "TRANSLATION_0": "Or did those with sickness in their hearts imagine that Allah would not expose their malevolence?",
        "TRANSLATION_1": "Do they whose minds are filled with doubt, think that God will not expose their malice?\n",
        "TRANSLATION_2": "Or do they, in whose hearts there is a sickness, believe that Allah will not bring their failings to light?\n",
        "TRANSLATION_3": "Do those whose hearts are sick think that God will never make their malice public?\n",
        "TRANSLATION_4": "What! Do they, in whose hearts is a disease, fancy that Allah will not expose concealed enmities?\n",
        "TRANSLATION_5": "Or do those in whose hearts is a disease, think that Allah will not expose their ill--wills\n",
        "TRANSLATION_6": "Or do those in whose hearts is a disease think that Allah will not bring forth their spite?\n",
        "TRANSLATION_7": "Or did those in whose hearts is sickness think that God would not bring to light their rancour?\n",
        "TRANSLATION_8": "Or do those in whose hearts is a disease deem that Allah will not bring to light their (secret) hates?\n",
        "TRANSLATION_9": "Do the sick at heart imagine that God will not bring to light their malice?\n",
        "TRANSLATION_10": "Deem those in whose hearts is a disease that Allah will never bring to light their secret malevolence?\n",
        "TRANSLATION_11": "Do those in whose hearts is a sickness suppose that Allah will not expose their spite?\n",
        "TRANSLATION_12": "Or do those in whose hearts is a disease, think that Allah will not bring to light all their rancour?\n",
        "TRANSLATION_13": "Or do those in whose hearts is a disease (of hypocrisy), think that Allah will not bring to light all their hidden ill-wills?\n",
        "TRANSLATION_14": "Or, do those who have a disease in their hearts think that Allah will not reveal their hatred?\n",
        "TRANSLATION_15": "Do those in whose hearts is sickness think that God will not expose their malice?\n",
        "TRANSLATION_16": "Or do those in whose hearts is disease think that Allah would never expose their [feelings of] hatred?\n",
        "TRANSLATION_17": "[47:29] Or did those in whose hearts is a sickness suppose that God would not expose their rancour?, [that] He would [not] bring to light their spite against the Prophet (s) and the believers.\n",
        "TRANSLATION_18": "(Or do those in whose hearts is a disease) doubt and hypocrisy (deem that Allah will not bring to light their (secret) hates) and enmity towards Allah and His Messenger; and it is also said that this means: did they think that Allah will not bring to light their hypocrisy, enmity and hatred for the believers to know?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "47:29",
            "24:50",
            "33:12",
            "30:59",
            "2:10",
            "13:28",
            "9:110",
            "5:52",
            "9:64",
            "9:77"
        ],
        "BIBLE": [
            "writings:psalms:37:6",
            "prophets:ezekiel:32:8",
            "prophets:isaiah:42:16",
            "torah:exodus:25:37",
            "prophets:jeremiah:32:40",
            "writings:ecclesiastes:9:1",
            "prophets:jeremiah:49:16",
            "writings:ii%20chronicles:29:10",
            "writings:psalms:74:8",
            "prophets:ezekiel:32:7"
        ]
    }
}