{
    "VERSE": "47:3",
    "ARABIC": "ذَٰلِكَ بِأَنَّ ٱلَّذِينَ كَفَرُوا۟ ٱتَّبَعُوا۟ ٱلْبَٰطِلَ وَأَنَّ ٱلَّذِينَ ءَامَنُوا۟ ٱتَّبَعُوا۟ ٱلْحَقَّ مِن رَّبِّهِمْ كَذَٰلِكَ يَضْرِبُ ٱللَّهُ لِلنَّاسِ أَمْثَٰلَهُمْ",
    "ENGLISH": {
        "TRANSLATION_0": "That is because those who are kafir follow falsehood whereas those who have iman follow the truth from their Lord. In that way Allah makes comparisons for mankind.",
        "TRANSLATION_1": "That is because those who refuse to believe only follow what is false; but those who believe follow the truth from their Lord. That is how God gives men precepts of wisdom.\n",
        "TRANSLATION_2": "That is because those who disbelieved followed falsehood whereas those who believed followed the Truth that came to them from their Lord. Thus does Allah set forth to people parables showing their true state.\n",
        "TRANSLATION_3": "This is because the disbelievers have followed falsehood and the believers have followed the Truth from their Lord. Thus God explains to the human being their own prospects.\n",
        "TRANSLATION_4": "This is because the disbelievers followed falsehood and the believers followed the Truth which is from their Lord; this is how Allah illustrates the examples of people to them.\n",
        "TRANSLATION_5": "That is because those who disbelieve follow falsehood, while those who believe follow the truth from their Lord. Thus does Allah set forth for mankind their parables.\n",
        "TRANSLATION_6": "That is because those who disbelieve follow falsehood, and have given them their dowries, taking (them) in marriage, not fornicating nor taking them for paramours in secret; and whoever denies faith, his work indeed is of no account, and in the hereafter he shall be one of the losers.\n",
        "TRANSLATION_7": "That is because those who disbelieve follow falsehood, and those who believe follow the truth from their Lord. Even so God strikes their similitudes for men.\n",
        "TRANSLATION_8": "That is because those who disbelieve follow falsehood and because those who believe follow the truth from their Lord. Thus Allah coineth their similitudes for mankind.\n",
        "TRANSLATION_9": "That is because the ones who deny the truth follow falsehood, while those who believe follow the Truth from their Lord. Thus God sets forth comparisons for mankind.\n",
        "TRANSLATION_10": "That is because those who disbelieve follow the falsehood, and those who believe follow the truth from their Lord. And thus Allah propoundeth Unto mankind their similitude.\n",
        "TRANSLATION_11": "That is because the faithless follow falsehood, and the faithful follow the truth from their Lord. That is how Allah draws comparisons for mankind.\n",
        "TRANSLATION_12": "This because those who reject Allah follow vanities, while those who believe follow the Truth from their Lord: Thus does Allah set forth for men their lessons by similitudes.\n",
        "TRANSLATION_13": "That is because those who disbelieve follow falsehood, while those who believe follow the truth from their Lord. Thus does Allah set forth their parables for mankind.\n",
        "TRANSLATION_14": "This is because the unbelievers follow falsehood while the believers follow the truth from their Lord. As such Allah sets forth for people their examples.\n",
        "TRANSLATION_15": "That is because those who disbelieve follow falsehoods, while those who believe follow the truth from their Lord. God thus cites for the people their examples.\n",
        "TRANSLATION_16": "That is because those who disbelieve follow falsehood, and those who believe follow the truth from their Lord. Thus does Allah present to the people their comparisons.\n",
        "TRANSLATION_17": "[47:3] That, rendering void of their works and the absolution of evil deeds, is because those who disbelieve follow falsehood, Satan, and because those who believe follow the truth, the Qur’ān, from their Lord. Thus, in the same manner of clarification, does God strike for mankind similitudes of themselves, [that is how] He clarifies for them their states, in other words, the disbeliever has his work rendered void while the believer is forgiven.\n",
        "TRANSLATION_18": "Then Allah explained why He thwarts the works of the disbelievers, saying: (That is because those who disbelieve) in Muhammad (pbuh) and the Qur'an (follow falsehood) i.e. ascribing partners to Allah (and because those who believe) in Muhammad (pbuh) (follow the Truth from their Lord) i.e. the Qur'an. (Thus Allah coineth) thus Allah present (their similitudes) the similitudes of those who came before them: how Allah had destroyed them when they denied the messengers (for mankind) for the community of Muhammad (pbuh).\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "47:3",
            "14:25",
            "2:26",
            "13:1",
            "22:54",
            "13:21",
            "31:30",
            "5:84",
            "22:62",
            "16:38"
        ],
        "BIBLE": [
            "torah:numbers:31:47",
            "prophets:ii%20kings:4:43",
            "prophets:ezekiel:18:8",
            "prophets:i%20kings:11:18",
            "prophets:judges:14:19",
            "prophets:i%20kings:19:21",
            "writings:esther:8:2",
            "writings:job:1:21",
            "prophets:i%20samuel:4:19",
            "writings:i%20chronicles:21:5"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:8"
        ]
    }
}