{
    "VERSE": "47:33",
    "ARABIC": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓا۟ أَطِيعُوا۟ ٱللَّهَ وَأَطِيعُوا۟ ٱلرَّسُولَ وَلَا تُبْطِلُوٓا۟ أَعْمَٰلَكُمْ",
    "ENGLISH": {
        "TRANSLATION_0": "You who have iman! obey Allah and obey the Messenger. Do not make your actions of no worth.",
        "TRANSLATION_1": "O you who believe, obey God and the Prophet, and do not waste your deeds.\n",
        "TRANSLATION_2": "Believers, obey Allah and obey the Messenger and do not cause your works to be nullified.\n",
        "TRANSLATION_3": "Believers, obey God and the Messenger and do not invalidate your deeds.\n",
        "TRANSLATION_4": "O People who Believe! Obey Allah and obey the Noble Messenger, and do not render your deeds void.\n",
        "TRANSLATION_5": "O you who believe! Obey Allah, and obey the Messenger and invalidate not your deeds.\n",
        "TRANSLATION_6": "O you who believe! obey Allah and obey the Apostle, and do not make your deeds of no effect.\n",
        "TRANSLATION_7": "O believers, obey God, and obey the Messenger, and do not make your own works vain.\n",
        "TRANSLATION_8": "O ye who believe! Obey Allah and obey the messenger, and render not your actions vain.\n",
        "TRANSLATION_9": "Believers, obey God and obey the Messenger: do not let your deeds go to waste --\n",
        "TRANSLATION_10": "Ye who believe! obey Allah and obey the apostle, and render not Your works vain.\n",
        "TRANSLATION_11": "O you who have faith! Obey Allah and obey the Apostle, and do not render your works void.\n",
        "TRANSLATION_12": "O ye who believe! Obey Allah, and obey the messenger, and make not vain your deeds!\n",
        "TRANSLATION_13": "O you who believe! Obey Allah, and obey the Messenger (Muhammad SAW) and render not vain your deeds.\n",
        "TRANSLATION_14": "Believers, obey Allah and His Messenger and never let your labors go in vain!\n",
        "TRANSLATION_15": "O you who believe! obey God, and obey the Messenger, and do not let your deeds go to waste.\n",
        "TRANSLATION_16": "O you who have believed, obey Allah and obey the Messenger and do not invalidate your deeds.\n",
        "TRANSLATION_17": "[47:33] O you who believe! Obey God and obey the Messenger, and do not render your own works void, by [engaging in] acts of disobedience, for example.\n",
        "TRANSLATION_18": "(0 ye who believe) openly! (Obey Allah and obey the messenger) in private, (and render not your actions vain) through hypocrisy, hatred, enmity and opposition of the Messenger; it is also said that this verse was 594 revealed about true believers. Allah says to them: you who believe in Muhammad (pbuh) and the Qur'an, obey Allah in that which He commands you of obligations and spending, and obey also the Messenger in that which he commands you of the Sunnah, conquest and Jihad; and do not annul your works through ostentation and seeking fame.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "47:33",
            "8:27",
            "8:20",
            "3:132",
            "9:119",
            "3:200",
            "47:1",
            "9:1",
            "3:32",
            "3:130"
        ],
        "BIBLE": [
            "torah:deuteronomy:32:43",
            "torah:exodus:34:10",
            "writings:psalms:71:12",
            "prophets:joel:2:17",
            "writings:psalms:70:2",
            "prophets:isaiah:26:13",
            "writings:i%20chronicles:17:22",
            "writings:psalms:109:11",
            "writings:ecclesiastes:7:13",
            "writings:psalms:66:8"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:6",
            
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:4:3"
        ]
    }
}