{
    "VERSE": "47:37",
    "ARABIC": "إِن يَسْـَٔلْكُمُوهَا فَيُحْفِكُمْ تَبْخَلُوا۟ وَيُخْرِجْ أَضْغَٰنَكُمْ",
    "ENGLISH": {
        "TRANSLATION_0": "If He did ask you for it and put you under pressure, you would be tight-fisted and it would bring out your",
        "TRANSLATION_1": "If He asks for all you possess and insist upon it, you will become niggardly, and it will bring out your malevolence.\n",
        "TRANSLATION_2": "If He were to ask you for your possessions and press you (in that regard), you would have grown niggardly, and Allah would have brought your failings to light.\n",
        "TRANSLATION_3": "Should He ask for your possessions you would be niggardly as it would be hard for you to give. Thus, He would make your malice become public.\n",
        "TRANSLATION_4": "Were He to ask it from you, and ask in plenty, you would be miserly, and the miserliness would expose the filth within your hearts.\n",
        "TRANSLATION_5": "If He would demand of you all of it and urge you, you would withhold. And He will expose your (secret) ill--wills.\n",
        "TRANSLATION_6": "If He should ask you for it and urge you, you will be niggardly, and He will bring forth your malice.\n",
        "TRANSLATION_7": "If He asks you for them, and presses you, you are niggardly, and He brings to light your rancour.\n",
        "TRANSLATION_8": "If He should ask it of you and importune you, ye would hoard it, and He would bring to light your (secret) hates.\n",
        "TRANSLATION_9": "If He were to ask it [wealth] of you, and continued to press you, you would be niggardly, and this would show your ill-will.\n",
        "TRANSLATION_10": "If He required it of you and importuned you, ye would be niggardly, and He will bring to light your secret malevolence.\n",
        "TRANSLATION_11": "Should He ask it from you and press you, you will be stingy, and He will expose your spite.\n",
        "TRANSLATION_12": "If He were to ask you for all of them, and press you, ye would covetously withhold, and He would bring out all your ill-feeling.\n",
        "TRANSLATION_13": "If He were to ask you of it, and press you, you would covetously withhold, and He will bring out all your (secret) ill-wills.\n",
        "TRANSLATION_14": "If He asked you for them, and presses you, you would be mean and He would expose your anger.\n",
        "TRANSLATION_15": "Were He to ask you for it, and press you, you would become tightfisted, and He would expose your unwillingness.\n",
        "TRANSLATION_16": "If He should ask you for them and press you, you would withhold, and He would expose your unwillingness.\n",
        "TRANSLATION_17": "[47:37] If He were to ask you for it, and press you, demand it persistently, you would be niggardly, and this, niggardliness, would expose your rancour, towards the religion of Islam.\n",
        "TRANSLATION_18": "(If He should ask it) if He should ask all of it (of you) to give to charity (and importune you) and burden you, (ye would hoard it) you would refrain from giving alms in obedience of Allah, (and He would bring to light your (secret) hates) and He would bring to light your miserliness.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "47:37",
            "56:87",
            "93:7",
            "93:8",
            "71:18",
            "25:76",
            "25:66",
            "23:84",
            "69:30",
            "37:167"
        ],
        "BIBLE": [
            "torah:exodus:25:37",
            "writings:psalms:37:6",
            "prophets:jeremiah:49:16",
            "torah:exodus:31:6",
            "torah:genesis:48:4",
            "prophets:jeremiah:32:40",
            "prophets:isaiah:42:16",
            "prophets:ezekiel:32:8",
            "writings:ii%20chronicles:29:10",
            "prophets:ezekiel:18:31"
        ]
    }
}