{
    "VERSE": "47:7",
    "ARABIC": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓا۟ إِن تَنصُرُوا۟ ٱللَّهَ يَنصُرْكُمْ وَيُثَبِّتْ أَقْدَامَكُمْ",
    "ENGLISH": {
        "TRANSLATION_0": "You who have iman! if you help Allah, He will help you and make your feet firm.",
        "TRANSLATION_1": "O you who believe, if you help (in the cause of) God He will surely come to your aid, and firmly plant your feet.\n",
        "TRANSLATION_2": "Believers, if you aid Allah, He will come to your aid and will plant your feet firmly.\n",
        "TRANSLATION_3": "Believers, if you help God, He will help you and make you steadfast (in your faith).\n",
        "TRANSLATION_4": "O People who Believe! If you help the religion of Allah, He will help you and will stabilise you.\n",
        "TRANSLATION_5": "O you who believe! If you support (in the cause of) Allah, He will support you, and make your foothold firm.\n",
        "TRANSLATION_6": "O you who believe! if you help (the cause of) Allah, He will help you and make firm your feet.\n",
        "TRANSLATION_7": "O believers, if you help God, He will help you, and confirm your feet.\n",
        "TRANSLATION_8": "O ye who believe! If ye help Allah, He will help you and will make your foothold firm.\n",
        "TRANSLATION_9": "Believers! If you succour God, He will succour you and make your footsteps firm.\n",
        "TRANSLATION_10": "O ye who believe! if ye and shall succour Allah, He shall succour you make firm your feet.\n",
        "TRANSLATION_11": "O you who have faith! If you help Allah, He will help you and make your feet steady.\n",
        "TRANSLATION_12": "O ye who believe! If ye will aid (the cause of) Allah, He will aid you, and plant your feet firmly.\n",
        "TRANSLATION_13": "O you who believe! If you help (in the cause of) Allah, He will help you, and make your foothold firm.\n",
        "TRANSLATION_14": "Believers, if you help Allah, He will help you and strengthen your feet.\n",
        "TRANSLATION_15": "O you who believe! If you support God, He will support you, and will strengthen your foothold.\n",
        "TRANSLATION_16": "O you who have believed, if you support Allah, He will support you and plant firmly your feet.\n",
        "TRANSLATION_17": "[47:7] O you who believe! If you help God, that is to say, His religion and His Messenger, He will help you, against your enemy, and make your foothold firm, He will make you stand firm [while you fight] on the battleground.\n",
        "TRANSLATION_18": "(0 ye who believe) in Muhammad (pbuh) and the Qur'an! (If ye help Allah, He will help you) if you help Allah's Prophet, Muhammad (pbuh) in fighting against the enemy, Allah will help you to conquer this enemy (and will make your foothold firm) in fighting so that you do not swerve.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "47:7",
            "3:200",
            "9:119",
            "33:70",
            "2:172",
            "2:278",
            "21:68",
            "18:4",
            "11:30",
            "16:19"
        ],
        "BIBLE": [
            "writings:psalms:71:12",
            "writings:psalms:70:2",
            "writings:psalms:70:6",
            "writings:psalms:40:14",
            "prophets:malachi:3:21",
            "writings:psalms:85:14",
            "writings:psalms:71:16",
            "prophets:jeremiah:5:14",
            "prophets:joshua:23:7",
            "prophets:isaiah:26:13"
        ]
    }
}