{
    "VERSE": "47:8",
    "ARABIC": "وَٱلَّذِينَ كَفَرُوا۟ فَتَعْسًا لَّهُمْ وَأَضَلَّ أَعْمَٰلَهُمْ",
    "ENGLISH": {
        "TRANSLATION_0": "But those who are kafir will have utter ruin and He will make their actions go astray.",
        "TRANSLATION_1": "As for the unbelievers, they will suffer misfortunes, and their deeds will be rendered ineffective.\n",
        "TRANSLATION_2": "As to those who disbelieve, perdition lies in store for them and Allah has reduced their works to nought.\n",
        "TRANSLATION_3": "The fate of the disbelievers will be to stumble and their deeds will have no virtuous results;\n",
        "TRANSLATION_4": "And for those who disbelieve – may they be ruined, and may Allah destroy all their deeds!\n",
        "TRANSLATION_5": "But as for those who disbelieve, misery awaits them, and (Allah) will make their deeds vain.\n",
        "TRANSLATION_6": "And (as for) those who disbelieve, for them is destruction and He has made their deeds ineffective.\n",
        "TRANSLATION_7": "But as for the unbelievers, ill chance shall befall them! He will send their works astray.\n",
        "TRANSLATION_8": "And those who disbelieve, perdition is for them, and He will make their actions vain.\n",
        "TRANSLATION_9": "But as for those who are bent on denying the truth, destruction will be their lot, and [God] will make their deeds come to nothing.\n",
        "TRANSLATION_10": "And those who disbelieve, downfall shall be theirs, and He shall send astray their Works.\n",
        "TRANSLATION_11": "As for the faithless, their lot will be to fall [into ruin], and He will render their works fruitless.\n",
        "TRANSLATION_12": "But those who reject (Allah),- for them is destruction, and (Allah) will render their deeds astray (from their mark).\n",
        "TRANSLATION_13": "But those who disbelieve (in the Oneness of Allah Islamic Monotheism), for them is destruction, and (Allah) will make their deeds vain.\n",
        "TRANSLATION_14": "But the unbelievers shall be the destroyed losers. He will bring their deeds to nothing.\n",
        "TRANSLATION_15": "But as for those who disbelieve, for them is perdition, and He will waste their deeds.\n",
        "TRANSLATION_16": "But those who disbelieve - for them is misery, and He will waste their deeds.\n",
        "TRANSLATION_17": "[47:8] And as for those who disbelieve, from among the people of Mecca (wa’lladhīna kafarū is the subject, the predicate of which is [an implicit] ta‘isū, ‘they shall be wretched’, as indicated [by what follows]) wretchedness shall be their lot, that is, destruction and defeat from God. And He will make their works go to waste (wa-adalla a‘mālahum is a supplement to [the implied] ta‘isū, ‘they shall be wretched’).\n",
        "TRANSLATION_18": "(And those who disbelieve) in Muhammad (pbuh) and the Qur'an: these are those who fed the army of disbelievers at Badr, (perdition) and abasement (is for them, and He will make their actions vain) He will thwart their good deeds and spending at Badr.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "47:8",
            "10:41",
            "47:1",
            "27:4",
            "25:23",
            "47:9",
            "3:22",
            "47:28",
            "43:83",
            "70:42"
        ],
        "BIBLE": [
            "torah:leviticus:16:10",
            "torah:deuteronomy:28:24",
            "writings:proverbs:11:5",
            "writings:ecclesiastes:7:13",
            "torah:deuteronomy:9:3",
            "writings:daniel:6:27",
            "torah:exodus:34:10",
            "prophets:isaiah:49:17",
            "prophets:jeremiah:25:9",
            "torah:genesis:40:14"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:6:2"
        ]
    }
}