{
    "VERSE": "47:9",
    "ARABIC": "ذَٰلِكَ بِأَنَّهُمْ كَرِهُوا۟ مَآ أَنزَلَ ٱللَّهُ فَأَحْبَطَ أَعْمَٰلَهُمْ",
    "ENGLISH": {
        "TRANSLATION_0": "That is because they hate what Allah has sent down, so He has made their actions come to nothing.",
        "TRANSLATION_1": "That is so as they were averse to what has been revealed by God, and their actions will be nullified.\n",
        "TRANSLATION_2": "That was because they were averse to what Allah had revealed; so He let their works go to waste.\n",
        "TRANSLATION_3": "they have hated God's revelation, and thus, He has made their deeds devoid of all virtue.\n",
        "TRANSLATION_4": "This is because they disliked what Allah has sent down – He has therefore squandered all their deeds.\n",
        "TRANSLATION_5": "That is because they hate that which Allah has sent down; so He has made their deeds fruitless.\n",
        "TRANSLATION_6": "That is because they hated what Allah revealed, so He rendered their deeds null.\n",
        "TRANSLATION_7": "That is because they have been averse to what God has sent down, so He has made their works to fail.\n",
        "TRANSLATION_8": "That is because they are averse to that which Allah hath revealed, therefor maketh He their actions fruitless.\n",
        "TRANSLATION_9": "It is because they are averse to what God has revealed that He has rendered their deeds futile.\n",
        "TRANSLATION_10": "That is because they detest that which Allah hath sent down, and so He shall make of non-effect their works.\n",
        "TRANSLATION_11": "That is because they loathed what Allah has sent down, so He made their works fail.\n",
        "TRANSLATION_12": "That is because they hate the Revelation of Allah; so He has made their deeds fruitless.\n",
        "TRANSLATION_13": "That is because they hate that which Allah has sent down (this Quran and Islamic laws, etc.), so He has made their deeds fruitless.\n",
        "TRANSLATION_14": "That is because they hated what Allah has sent down, so He annulled their deeds.\n",
        "TRANSLATION_15": "That is because they hated what God revealed, so He nullified their deeds.\n",
        "TRANSLATION_16": "That is because they disliked what Allah revealed, so He rendered worthless their deeds.\n",
        "TRANSLATION_17": "[47:9] That, wretchedness and wasting [of their works], is because they are averse to what God has revealed, of the Qur’ān with all that it includes of religious obligations (takālīf), so He has made their works fail.\n",
        "TRANSLATION_18": "(That) thwarting (is because they are averse to) they deny (that which Allah hath revealed) that which Allah has sent Gabriel with to Muhammad (pbuh) (therefore maketh He their action fruitless) therefore He thwarts their good deeds and spending at Badr.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "47:9",
            "47:28",
            "84:23",
            "10:81",
            "5:53",
            "47:1",
            "47:26",
            "40:63",
            "3:63",
            "22:68"
        ],
        "BIBLE": [
            "writings:ecclesiastes:7:13",
            "prophets:isaiah:49:17",
            "prophets:ezekiel:35:14",
            "writings:ecclesiastes:9:1",
            "prophets:jeremiah:25:14",
            "prophets:hosea:2:14",
            "prophets:jeremiah:16:20",
            "prophets:ezekiel:15:8",
            "prophets:ezekiel:24:9",
            "prophets:ezekiel:12:23"
        ]
    }
}