{
    "VERSE": "51:14",
    "ARABIC": "ذُوقُوا۟ فِتْنَتَكُمْ هَٰذَا ٱلَّذِى كُنتُم بِهِۦ تَسْتَعْجِلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "'Taste your torment! This is what you were trying to hasten!'",
        "TRANSLATION_1": "(And told:) \"Taste your punishment. This is what you were trying to hasten.\"\n",
        "TRANSLATION_2": "(and be told): “Taste your ordeal! This is what you were seeking to hasten.”\n",
        "TRANSLATION_3": "and will be told, \"Suffer the torment which you wanted to experience immediately\".\n",
        "TRANSLATION_4": "And it will be said to them, “Taste your own roasting; this is what you were impatient for.”\n",
        "TRANSLATION_5": "Taste you your trial! This is what you used to ask to be hastened!\"\n",
        "TRANSLATION_6": "Taste your persecution! this is what you would hasten on.\n",
        "TRANSLATION_7": "Taste your trial! This is that you were seeking to hasten.'\n",
        "TRANSLATION_8": "(And it will be said unto them): Taste your torment (which ye inflicted). This is what ye sought to hasten.\n",
        "TRANSLATION_9": "Taste your trial. This is what you sought to hasten.\"\n",
        "TRANSLATION_10": "Taste your burning: this is that which ye sought to be hastened.\n",
        "TRANSLATION_11": "[and will be told]: ‘Taste your torment. This is what you used to hasten.’\n",
        "TRANSLATION_12": "Taste ye your trial! This is what ye used to ask to be hastened!\"\n",
        "TRANSLATION_13": "Taste you your trial (burning)! This is what you used to ask to be hastened!\"\n",
        "TRANSLATION_14": "Taste your trial. This is what you have sought to hasten'\n",
        "TRANSLATION_15": "“Taste your ordeal. This is what you used to challenge.”\n",
        "TRANSLATION_16": "[And will be told], \"Taste your torment. This is that for which you were impatient.\"\n",
        "TRANSLATION_17": "[51:14] ‘Taste this torment of yours, this chastisement of yours. This, chastisement, is what you sought to hasten on!’, in the world in derision.\n",
        "TRANSLATION_18": "610 The angels of the Fire will say to them: (Taste your torment. This) chastisement (is what ye sought to hasten) in the life of the world.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "51:14",
            "83:17",
            "37:63",
            "52:14",
            "55:43",
            "44:50",
            "36:63",
            "7:76",
            "9:49",
            "26:132"
        ],
        "BIBLE": [
            "prophets:isaiah:7:12",
            "writings:ecclesiastes:7:23",
            "prophets:i%20samuel:20:30",
            "writings:job:1:16",
            "torah:exodus:21:25",
            "writings:ii%20chronicles:26:18",
            "prophets:ii%20samuel:12:5",
            "torah:exodus:3:7",
            "prophets:joshua:11:6",
            "prophets:jonah:1:10"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:1:3"
        ]
    }
}