{
    "VERSE": "51:15",
    "ARABIC": "إِنَّ ٱلْمُتَّقِينَ فِى جَنَّٰتٍ وَعُيُونٍ",
    "ENGLISH": {
        "TRANSLATION_0": "The people with taqwa will be among Gardens and Fountains,",
        "TRANSLATION_1": "Surely those who fear God and follow the straight path will be amidst gardens and fresh springs of water,\n",
        "TRANSLATION_2": "As for the God-fearing, they shall be in the midst of gardens and fountains,\n",
        "TRANSLATION_3": "The pious ones will live amidst gardens and springs,\n",
        "TRANSLATION_4": "Indeed the pious are among Gardens and water springs.\n",
        "TRANSLATION_5": "Verily, those who have Taqwa will be in the midst of Gardens and Springs,\n",
        "TRANSLATION_6": "Surely those who guard (against evil) shall be in gardens and fountains.\n",
        "TRANSLATION_7": "Surely the godfearing shall be among gardens and fountains\n",
        "TRANSLATION_8": "Lo! those who keep from evil will dwell amid gardens and watersprings,\n",
        "TRANSLATION_9": "Surely the God-fearing will find themselves in the midst of gardens and springs.\n",
        "TRANSLATION_10": "Verily the God-fearing will be amid Gardens and water- springs.\n",
        "TRANSLATION_11": "Indeed the Godwary will be amid gardens and springs,\n",
        "TRANSLATION_12": "As to the Righteous, they will be in the midst of Gardens and Springs,\n",
        "TRANSLATION_13": "Verily, the Muttaqun (pious - see V. 2:2) will be in the midst of Gardens and Springs (in the Paradise),\n",
        "TRANSLATION_14": "The righteous shall live among gardens and fountains,\n",
        "TRANSLATION_15": "But the pious are amidst gardens and springs.\n",
        "TRANSLATION_16": "Indeed, the righteous will be among gardens and springs,\n",
        "TRANSLATION_17": "[51:15]   Truly the God-fearing will be amid gardens, orchards, and springs, flowing therein,\n",
        "TRANSLATION_18": "Then Allah explained the abode of the believers, like Abu Bakr and his fellow believers, saying: (Lo! those who keep from evil) those who ward off disbelief, idolatry and indecencies (will dwell amid Gardens and watersprings) of pure water.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "15:45",
            "51:15",
            "44:52",
            "26:147",
            "26:134",
            "52:17",
            "44:25",
            "77:41",
            "26:57",
            "54:54"
        ],
        "BIBLE": [
            "prophets:zechariah:8:8",
            "prophets:isaiah:41:18",
            "torah:genesis:16:7",
            "torah:deuteronomy:16:11",
            "writings:psalms:68:26",
            "writings:song%20of%20songs:4:15",
            "torah:deuteronomy:29:10",
            "torah:genesis:1:6",
            "writings:ruth:3:10",
            "prophets:zechariah:2:14"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:14",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:1:11"
        ]
    }
}