{
    "VERSE": "51:20",
    "ARABIC": "وَفِى ٱلْأَرْضِ ءَايَٰتٌ لِّلْمُوقِنِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "There are certainly Signs in the earth for people with certainty;",
        "TRANSLATION_1": "There are signs in the earth for those who are firm in their faith,\n",
        "TRANSLATION_2": "There are many Signs on earth for those of sure faith,\n",
        "TRANSLATION_3": "In the earth there is evidence (of the Truth) for those who have strong faith.\n",
        "TRANSLATION_4": "And in the earth are signs for those who are certain.\n",
        "TRANSLATION_5": "And on the earth are signs for those who have faith with certainty.\n",
        "TRANSLATION_6": "And in the earth there are signs for those who are sure,\n",
        "TRANSLATION_7": "In the earth are signs for those having sure faith;\n",
        "TRANSLATION_8": "And in the earth are portents for those whose faith is sure.\n",
        "TRANSLATION_9": "On the earth, and in yourselves,\n",
        "TRANSLATION_10": "And on the earth there are signs for those who would be convinced.\n",
        "TRANSLATION_11": "In the earth are signs for those who have conviction,\n",
        "TRANSLATION_12": "On the earth are signs for those of assured Faith,\n",
        "TRANSLATION_13": "And on the earth are signs for those who have Faith with certainty,\n",
        "TRANSLATION_14": "For those with sure belief there are signs in the earth,\n",
        "TRANSLATION_15": "And on earth are signs for the convinced.\n",
        "TRANSLATION_16": "And on the earth are signs for the certain [in faith]\n",
        "TRANSLATION_17": "[51:20] And in the earth, in the way of mountains, seas, trees, fruits, plants and other things, there are signs, indications of God’s power, glory be to Him, exalted be He, and of His Oneness, for those who know with certainty,\n",
        "TRANSLATION_18": "(And in the earth are portents) signs and lessons, like the trees, beasts, mountains and seas (for those whose faith is sure) for those who have certainty in Muhammad (pbuh) and the Qur'an,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "51:20",
            "45:3",
            "12:105",
            "23:84",
            "84:3",
            "26:152",
            "38:28",
            "23:79",
            "16:13",
            "36:33"
        ],
        "BIBLE": [
            "writings:psalms:146:6",
            "prophets:isaiah:28:2",
            "prophets:i%20kings:8:27",
            "writings:daniel:6:28",
            "prophets:jeremiah:32:21",
            "torah:exodus:31:17",
            "prophets:i%20kings:2:2",
            "torah:leviticus:11:44",
            "prophets:jeremiah:15:10",
            "writings:daniel:3:33"
        ]
    }
}