{
    "VERSE": "51:21",
    "ARABIC": "وَفِىٓ أَنفُسِكُمْ أَفَلَا تُبْصِرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "and in yourselves as well. Do you not then see?",
        "TRANSLATION_1": "And within yourselves. Can you not perceive?\n",
        "TRANSLATION_2": "and also in your own selves. Do you not see?\n",
        "TRANSLATION_3": "There is also evidence of the Truth within your own selves. Will you then not see?\n",
        "TRANSLATION_4": "And in your own selves; so can you not perceive?\n",
        "TRANSLATION_5": "And also in yourselves. Will you not then see\n",
        "TRANSLATION_6": "And in your own souls (too); will you not then see?\n",
        "TRANSLATION_7": "and in your selves; what, do you not see?\n",
        "TRANSLATION_8": "And (also) in yourselves. Can ye then not see?\n",
        "TRANSLATION_9": "there are signs for firm believers. Do you not see then?\n",
        "TRANSLATION_10": "And also in Your own selves. Behold ye not?\n",
        "TRANSLATION_11": "and in your souls [as well]. Will you not then perceive?\n",
        "TRANSLATION_12": "As also in your own selves: Will ye not then see?\n",
        "TRANSLATION_13": "And also in your ownselves. Will you not then see?\n",
        "TRANSLATION_14": "and also in yourselves. Can you not see?\n",
        "TRANSLATION_15": "And within yourselves. Do you not see?\n",
        "TRANSLATION_16": "And in yourselves. Then will you not see?\n",
        "TRANSLATION_17": "[51:21] and in your souls, there are also signs, from the beginning of your creation to its end, and in the marvelous aspects of your creation. Will you not then perceive?, [all] that and thus infer therefrom the Creator of it and His power.\n",
        "TRANSLATION_18": "(And (also) in yourselves) there are signs and lessons such as pain, sickness and misfortune. A person for example administers his food and drink from one place but they come out from two different places. (Can ye then not see?) Do you then not perceive such that you reflect upon that which Allah has created?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "51:21",
            "20:41",
            "21:102",
            "7:192",
            "91:7",
            "2:44",
            "82:5",
            "37:155",
            "36:73",
            "11:21"
        ],
        "BIBLE": [
            "prophets:ezekiel:18:4",
            "torah:exodus:4:8",
            "prophets:i%20samuel:10:7",
            "prophets:i%20kings:8:27",
            "prophets:i%20samuel:20:4",
            "torah:deuteronomy:28:46",
            "writings:ii%20chronicles:6:18",
            "writings:psalms:74:9",
            "prophets:isaiah:38:7",
            "prophets:isaiah:7:14"
        ]
    }
}