{
    "VERSE": "51:23",
    "ARABIC": "فَوَرَبِّ ٱلسَّمَآءِ وَٱلْأَرْضِ إِنَّهُۥ لَحَقٌّ مِّثْلَ مَآ أَنَّكُمْ تَنطِقُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "By the Lord of heaven and earth, it is certainly the truth, just as you have speech.",
        "TRANSLATION_1": "By the Lord of the heavens and the earth, this is certainly true even as you speak.\n",
        "TRANSLATION_2": "So, by the Lord of the heaven and the earth, this is certainly true, as true as the fact of your speaking.\n",
        "TRANSLATION_3": "This, by the Lord of the heavens and the earth is as certain as your ability to speak.\n",
        "TRANSLATION_4": "So by oath of the Lord of the heavens and the earth, this Qur’an is the Truth, in the same language that you speak.\n",
        "TRANSLATION_5": "Then by the Lord of the heaven and the earth, it is the truth, just as you can speak.\n",
        "TRANSLATION_6": "And by the Lord of the heavens and the earth! it is most surely the truth, just as you do speak.\n",
        "TRANSLATION_7": "So by the Lord of heaven and earth, it is as surely true as that you have speech.\n",
        "TRANSLATION_8": "And by the Lord of the heavens and the earth, it is the truth, even as (it is true) that ye speak.\n",
        "TRANSLATION_9": "By the Lord of the heaven and the earth, it is certainly the truth. It is as true as your ability to speak.\n",
        "TRANSLATION_10": "By the Lord of the heaven and the earth it is sure, even as it is a fact that ye are speaking.\n",
        "TRANSLATION_11": "By the Lord of the sky and the earth, it is indeed the truth, just as [it is a fact that] you speak.\n",
        "TRANSLATION_12": "Then, by the Lord of heaven and earth, this is the very Truth, as much as the fact that ye can speak intelligently to each other.\n",
        "TRANSLATION_13": "Then, by the Lord of the heaven and the earth, it is the truth (i.e. what has been promised to you), just as it is the truth that you can speak.\n",
        "TRANSLATION_14": "So by the Lord of heaven and earth, it is as true as your speech.\n",
        "TRANSLATION_15": "By the Lord of the heaven and the earth, it is as true as the fact that you speak.\n",
        "TRANSLATION_16": "Then by the Lord of the heaven and earth, indeed, it is truth - just as [sure as] it is that you are speaking.\n",
        "TRANSLATION_17": "[51:23] So by the Lord of the heaven and the earth, it, that which you are promised, is as assuredly true as [the fact] that you have [power of] speech (read mithlu, in the nominative, as an adjective, with the mā being extra; or read mithla, in the accusative, as being a compound with mā), that is to say: [it is as true] as your speech is in reality, that is, in your knowing it to be [true] necessarily by its issuing from you.\n",
        "TRANSLATION_18": "(And by the Lord of the heavens and the earth) Allah swore by Himself, (it) that which I have related to you concerning provision (is the Truth) it will surely happen, (even as (it is true) that ye speak) even as you say: there is no deity except Allah.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "51:23",
            "16:3",
            "11:107",
            "21:56",
            "23:71",
            "26:24",
            "44:7",
            "43:82",
            "64:3",
            "29:44"
        ],
        "BIBLE": [
            "torah:genesis:11:1",
            "prophets:jeremiah:31:37",
            "torah:deuteronomy:6:15",
            "prophets:i%20kings:8:27",
            "torah:deuteronomy:10:14",
            "torah:genesis:11:9",
            "writings:psalms:146:6",
            "writings:psalms:124:8",
            "torah:genesis:1:1",
            "torah:deuteronomy:32:1"
        ]
    }
}