{
    "VERSE": "51:24",
    "ARABIC": "هَلْ أَتَىٰكَ حَدِيثُ ضَيْفِ إِبْرَٰهِيمَ ٱلْمُكْرَمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Has the story reached you of the honoured guests of Ibrahim?",
        "TRANSLATION_1": "Has the story of Abraham's honoured guests come to you?\n",
        "TRANSLATION_2": "(O Prophet), did the story of Abraham's honoured guests reach you?\n",
        "TRANSLATION_3": "Have you heard the story of the honorable guests of Abraham?\n",
        "TRANSLATION_4": "Did the news of Ibrahim’s honourable guests reach you (O dear Prophet Mohammed – peace and blessings be upon him)?\n",
        "TRANSLATION_5": "Has the story reached you, of the honored guests of Ibrahim\n",
        "TRANSLATION_6": "Has there come to you information about the honored guests of Ibrahim?\n",
        "TRANSLATION_7": "Hast thou received the story of the honoured guests of Abraham?\n",
        "TRANSLATION_8": "Hath the story of Abraham's honoured guests reached thee (O Muhammad)?\n",
        "TRANSLATION_9": "Have you heard the story of Abraham's honoured guests?\n",
        "TRANSLATION_10": "Hath there come Unto thee the story of Ibrahim's honoured guests?\n",
        "TRANSLATION_11": "Did you receive the story of Abraham’s honoured guests?\n",
        "TRANSLATION_12": "Has the story reached thee, of the honoured guests of Abraham?\n",
        "TRANSLATION_13": "Has the story reached you, of the honoured guests [three angels; Jibrael (Gabriel) along with another two] of Ibrahim (Abraham)?\n",
        "TRANSLATION_14": "Have you heard the story of Abraham's honored guests?\n",
        "TRANSLATION_15": "Has the story of Abraham’s honorable guests reached you?\n",
        "TRANSLATION_16": "Has there reached you the story of the honored guests of Abraham? -\n",
        "TRANSLATION_17": "[51:24] Has the story reached you — addressing the Prophet (s) — of Abraham’s honoured guests? — these were [said to be either] twelve, ten or three angels, one of whom was Gabriel.\n",
        "TRANSLATION_18": "611 (Hath the story of Abraham's honoured guests) has the event of the guests of Abraham who were honoured by being offered a calf to eat (reached thee) Muhammad?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "51:24",
            "88:1",
            "79:15",
            "20:9",
            "85:17",
            "15:51",
            "53:59",
            "56:81",
            "37:54",
            "15:68"
        ],
        "BIBLE": [
            "writings:psalms:102:2",
            "writings:ii%20chronicles:25:16",
            "prophets:jeremiah:2:31",
            "prophets:i%20kings:18:36",
            "writings:psalms:86:9",
            "prophets:i%20kings:17:18",
            "prophets:ii%20kings:5:8",
            "writings:i%20chronicles:12:19",
            "writings:ii%20chronicles:30:27",
            "prophets:jeremiah:38:25"
        ]
    }
}