{
    "VERSE": "51:28",
    "ARABIC": "فَأَوْجَسَ مِنْهُمْ خِيفَةً قَالُوا۟ لَا تَخَفْ وَبَشَّرُوهُ بِغُلَٰمٍ عَلِيمٍ",
    "ENGLISH": {
        "TRANSLATION_0": "He felt afraid of them but they said, 'Do not be afraid!' and gave him the good news of a son imbued with knowledge.",
        "TRANSLATION_1": "He felt afraid of them; but they said: \"Have no fear,\" and gave him the good news of a wise son.\n",
        "TRANSLATION_2": "Then he became afraid of them. They said: “Fear not,” and announced to him the good news of (the birth of) a boy endowed with knowledge.\n",
        "TRANSLATION_3": "He began to feel afraid. They said, \"Do not be afraid,\" and then gave him the glad news of the birth of a knowledgeable son.\n",
        "TRANSLATION_4": "He therefore inwardly sensed fear of them; they said, “Do not fear!”; and they gave him the glad tidings of a knowledgeable son.\n",
        "TRANSLATION_5": "Then he conceived fear of them (when they ate not). They said: \"Fear not.\" And they gave him glad tidings of a son having knowledge.\n",
        "TRANSLATION_6": "So he conceived in his mind a fear on account of them. They said: Fear not. And they gave him the good news of a boy possessing knowledge.\n",
        "TRANSLATION_7": "Then he conceived a fear of them. They said, 'Be not afraid!' And they gave him good tidings of a cunning boy.\n",
        "TRANSLATION_8": "Then he conceived a fear of them. They said: Fear not! and gave him tidings of (the birth of) a wise son.\n",
        "TRANSLATION_9": "beginning to be afraid of them. But they said, \"Don't be afraid\"; and they gave him the good news of a son who would be endowed with knowledge.\n",
        "TRANSLATION_10": "Then he conceived a fear of them. They said: fear not. And they gave him the tidings of a youth knowing.\n",
        "TRANSLATION_11": "Then he felt a fear of them. They said, ‘Do not be afraid!’ and they gave him the good news of a wise son.\n",
        "TRANSLATION_12": "(When they did not eat), He conceived a fear of them. They said, \"Fear not,\" and they gave him glad tidings of a son endowed with knowledge.\n",
        "TRANSLATION_13": "Then he conceived a fear of them (when they ate not). They said: \"Fear not.\" And they gave him glad tidings of an intelligent son, having knowledge (about Allah and His religion of True Monotheism).\n",
        "TRANSLATION_14": "Then he conceived a fear about them, and they said: 'Have no fear', and gave him the glad tidings that he was to have a knowledgeable son.\n",
        "TRANSLATION_15": "And he harbored fear of them. They said, “Do not fear,” and they announced to him the good news of a knowledgeable boy.\n",
        "TRANSLATION_16": "And he felt from them apprehension. They said, \"Fear not,\" and gave him good tidings of a learned boy.\n",
        "TRANSLATION_17": "[51:28] Then he conceived, he kept secret in himself, a fear of them. They said, ‘Do not be afraid!’, we are messengers from your Lord. And they gave him good tidings of [the birth of] a knowledgeable boy, one endowed with much knowledge, and this was Isaac, as mentioned in sūrat Hūd [Q. 11:71].\n",
        "TRANSLATION_18": "(Then he conceived a fear of them) Abraham concealed his fear of them when they did not eat his food. He thought they were thieves. This is because, in his time, to eat of the food of another person was a sign of coming with a good intention. When the angels realised his fear. (They said: Fear not!) Fear us not, Abraham! We are the messengers of your Lord (and gave him tidings of (the birth of) a wise son) a son who is wise in his childhood, great when he grows older: this is Isaac.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "51:28",
            "15:53",
            "37:101",
            "26:112",
            "11:70",
            "7:112",
            "106:4",
            "10:40",
            "12:19",
            "10:79"
        ],
        "BIBLE": [
            "prophets:ii%20kings:6:29",
            "prophets:ii%20samuel:17:7",
            "torah:genesis:3:12",
            "torah:genesis:3:6",
            "prophets:malachi:2:5",
            "torah:genesis:29:33",
            "torah:genesis:38:18",
            "writings:esther:3:11",
            "torah:genesis:16:5",
            "torah:deuteronomy:2:9"
        ]
    }
}