{
    "VERSE": "51:29",
    "ARABIC": "فَأَقْبَلَتِ ٱمْرَأَتُهُۥ فِى صَرَّةٍ فَصَكَّتْ وَجْهَهَا وَقَالَتْ عَجُوزٌ عَقِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "His wife came up with a shriek and struck her face and said, 'What, and me a barren old woman!'",
        "TRANSLATION_1": "His wife came out lamenting, striking her forehead, and said: \"I, am old and barren woman?\"\n",
        "TRANSLATION_2": "So hearing his wife went forth shouting. She struck her face and exclaimed: “A barren old woman am I.”\n",
        "TRANSLATION_3": "His wife came forward, crying and beating her face, saying, \"I am an old barren woman!\"\n",
        "TRANSLATION_4": "So his wife came screaming, and striking her forehead cried, “What! For a barren old woman?”\n",
        "TRANSLATION_5": "Then his wife came forward with a loud voice; she smote her face, and said: \"A barren old woman!\"\n",
        "TRANSLATION_6": "Then his wife came up in great grief, and she struck her face and said: An old barren woman!\n",
        "TRANSLATION_7": "Then came forward his wife, clamouring, and she smote her face, and said, 'An old woman, barren!'\n",
        "TRANSLATION_8": "Then his wife came forward, making moan, and smote her face, and cried: A barren old woman!\n",
        "TRANSLATION_9": "Then his wife came forward, crying and beating her brow. She said, \"I am surely a barren, old woman.\"\n",
        "TRANSLATION_10": "Then his wife drew near vociferating, and smote her face, and said: an old barren woman!\n",
        "TRANSLATION_11": "Then his wife came forward crying [with joy]. She beat her face, and said, ‘A barren old woman!’\n",
        "TRANSLATION_12": "But his wife came forward (laughing) aloud: she smote her forehead and said: \"A barren old woman!\"\n",
        "TRANSLATION_13": "Then his wife came forward with a loud voice, she smote her face, and said: \"A barren old woman!\"\n",
        "TRANSLATION_14": "(Sarah) his wife came with an exclamation and clasped her face, and said: 'Surely, I am a barren old woman'\n",
        "TRANSLATION_15": "His wife came forward crying. She clasped her face, and said, “A barren old woman?”\n",
        "TRANSLATION_16": "And his wife approached with a cry [of alarm] and struck her face and said, \"[I am] a barren old woman!\"\n",
        "TRANSLATION_17": "[51:29] Then his wife, Sarah, came forward clamouring, shouting (fī sarratin is a circumstantial qualifier, that is to say, she came shouting) and smote, slapped, her face, and said, ‘A barren old woman!’, who has never given birth to a child, aged ninety-nine, with Abraham being one hundred years old; or [alternatively] he was a hundred and twenty years old and she was ninety years old.\n",
        "TRANSLATION_18": "(Then his wife came forward) his wife Sarah came, (making moan) and wailing, (and smote her face) she gathered the extremities of her fingers and hit her face and forehead, (and cried: A barren old woman!) A barren old woman giving birth, how is this possible?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "51:29",
            "11:71",
            "27:57",
            "12:93",
            "23:104",
            "7:83",
            "31:22",
            "67:27",
            "3:107",
            "20:32"
        ],
        "BIBLE": [
            "prophets:i%20kings:19:13",
            "prophets:ezekiel:11:13",
            "prophets:i%20kings:13:4",
            "prophets:joshua:9:6",
            "prophets:isaiah:58:4",
            "prophets:i%20samuel:17:41",
            "prophets:judges:13:11",
            "writings:psalms:142:2",
            "prophets:joshua:5:13",
            "writings:esther:5:5"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:2:3",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:13"
        ]
    }
}