{
    "VERSE": "51:30",
    "ARABIC": "قَالُوا۟ كَذَٰلِكِ قَالَ رَبُّكِ إِنَّهُۥ هُوَ ٱلْحَكِيمُ ٱلْعَلِيمُ",
    "ENGLISH": {
        "TRANSLATION_0": "They said, 'That is what your Lord says. He is the All-Wise, the All-Knowing.'",
        "TRANSLATION_1": "They said: \"Thus said your Lord. He is indeed all-wise and all-knowing.\"\n",
        "TRANSLATION_2": "They said: “So has your Lord said (that you shall have a boy). Surely He is Most Wise, All-Knowing.”\n",
        "TRANSLATION_3": "They said, \"This is true but your Lord has said, (that you will have a son); He is All-wise and All-knowing\".\n",
        "TRANSLATION_4": "They said, “This is how your Lord has decreed; indeed He only is the Wise, the All Knowing.”\n",
        "TRANSLATION_5": "They said: \"Even so says your Lord. Verily, He is the All-Wise, the All-Knower.\"\n",
        "TRANSLATION_6": "They said: Thus says your Lord: Surely He is the Wise, the Knowing.\n",
        "TRANSLATION_7": "They said, 'So says thy Lord; He is the All-wise, the All-knowing.'\n",
        "TRANSLATION_8": "They said: Even so saith thy Lord. Lo! He is the Wise, the Knower.\n",
        "TRANSLATION_9": "Such is the will of your Lord,\" they replied. \"He is the Wise, the All Knowing.\"\n",
        "TRANSLATION_10": "They said: even so saith thine Lords Verily He! He is the Wise, the Knower.\n",
        "TRANSLATION_11": "They said, ‘So has your Lord said. Indeed He is the All-wise, the All-knowing.’\n",
        "TRANSLATION_12": "They said, \"Even so has thy Lord spoken: and He is full of Wisdom and Knowledge.\"\n",
        "TRANSLATION_13": "They said: \"Even so says your Lord. Verily, He is the All-Wise, the All-Knower.\"\n",
        "TRANSLATION_14": "Such, says your Lord' they replied: 'He is the Wise, the Knower'\n",
        "TRANSLATION_15": "They said, “Thus spoke your Lord. He is the Wise, the Knowing.”\n",
        "TRANSLATION_16": "They said, \"Thus has said your Lord; indeed, He is the Wise, the Knowing.\"\n",
        "TRANSLATION_17": "[51:30] They said, ‘So, just like what we have said with regard to the good tiding, has your Lord said. Indeed He is the Wise, in His actions, the Knower’, of His creatures.\n",
        "TRANSLATION_18": "(They said) Gabriel and the angels with him said: (Even so) just as we have said to you, Sarah, (saith thy Lord. Lo! He is the Wise) He decrees the birth of children from those who are barren and those who are not, (the Knower) what will come out of both you in the future.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "51:30",
            "15:25",
            "27:78",
            "26:47",
            "7:121",
            "29:26",
            "44:6",
            "6:83",
            "2:131",
            "26:192"
        ],
        "BIBLE": [
            "torah:numbers:12:2",
            "torah:deuteronomy:18:17",
            "prophets:zechariah:1:9",
            "prophets:ii%20kings:9:12",
            "torah:genesis:22:16",
            "prophets:i%20kings:3:26",
            "prophets:hosea:10:3",
            "writings:ecclesiastes:7:23",
            "torah:deuteronomy:2:2",
            "torah:deuteronomy:2:17"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:5:4"
        ]
    }
}