{
    "VERSE": "51:32",
    "ARABIC": "قَالُوٓا۟ إِنَّآ أُرْسِلْنَآ إِلَىٰ قَوْمٍ مُّجْرِمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "They said, 'We have been sent to a people of evildoers",
        "TRANSLATION_1": "They said: \"We have been sent to a wicked people\n",
        "TRANSLATION_2": "They replied: “Behold, we have been sent to a wicked people\n",
        "TRANSLATION_3": "They replied, \"We have been sent to a sinful people\n",
        "TRANSLATION_4": "They said, “We have been sent towards a guilty nation.”\n",
        "TRANSLATION_5": "They said: \"We have been sent to a people who are criminals.\"\n",
        "TRANSLATION_6": "They said: Surely we are sent to a guilty people,\n",
        "TRANSLATION_7": "They said, 'We have been sent to a people of sinners,\n",
        "TRANSLATION_8": "They said: Lo! we are sent unto a guilty folk,\n",
        "TRANSLATION_9": "They replied, \"We have been sent to a sinful people,\n",
        "TRANSLATION_10": "They said: verily we are sent Unto a people, guilty.\n",
        "TRANSLATION_11": "They said, ‘We have been sent toward a guilty people,\n",
        "TRANSLATION_12": "They said, \"We have been sent to a people (deep) in sin;-\n",
        "TRANSLATION_13": "They said: \"We have been sent to a people who are Mujrimun (polytheists, sinners, criminals, disbelievers in Allah);\n",
        "TRANSLATION_14": "They replied: 'We are sent to a sinful nation,\n",
        "TRANSLATION_15": "They said, “We are sent to a people guilty of sin.”\n",
        "TRANSLATION_16": "They said, \"Indeed, we have been sent to a people of criminals\n",
        "TRANSLATION_17": "[51:32] They said, ‘Lo! we have been sent to a guilty folk, disbelievers — these were the people of Lot —\n",
        "TRANSLATION_18": "(They said: Lo! we are sent unto a guilty folk) idolatrous folk who brought ruin upon themselves because of engaging in an abominable act; referring here to the folk of Lot,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "51:32",
            "15:58",
            "15:62",
            "43:54",
            "51:53",
            "26:117",
            "51:46",
            "43:44",
            "15:15",
            "26:11"
        ],
        "BIBLE": [
            "torah:exodus:9:27",
            "torah:exodus:1:9",
            "prophets:ezekiel:8:9",
            "torah:exodus:32:9",
            "torah:genesis:11:6",
            "torah:exodus:32:31",
            "torah:genesis:47:23",
            "torah:exodus:32:21",
            "torah:exodus:32:14",
            "prophets:isaiah:63:8"
        ]
    }
}