{
    "VERSE": "51:36",
    "ARABIC": "فَمَا وَجَدْنَا فِيهَا غَيْرَ بَيْتٍ مِّنَ ٱلْمُسْلِمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "but found in it only one house of Muslims.",
        "TRANSLATION_1": "But did not find more than a single family of believers.\n",
        "TRANSLATION_2": "– and We did not find there any, apart from a single house of Muslims –\n",
        "TRANSLATION_3": "but We found only one Muslim house.\n",
        "TRANSLATION_4": "We therefore found just one house over there that was Muslim.\n",
        "TRANSLATION_5": "But We found not there any household of the Muslims except one.\n",
        "TRANSLATION_6": "But We did not find therein save a (single) house of those who submitted (the Muslims).\n",
        "TRANSLATION_7": "but We found not therein except one house of those that have surrendered themselves.\n",
        "TRANSLATION_8": "But We found there but one house of those surrendered (to Allah).\n",
        "TRANSLATION_9": "We found in it only one household of true believers --\n",
        "TRANSLATION_10": "And We found not therein more than one house of the Muslims.\n",
        "TRANSLATION_11": "but We did not find there other than one house of Muslims,\n",
        "TRANSLATION_12": "But We found not there any just (Muslim) persons except in one house:\n",
        "TRANSLATION_13": "But We found not there any household of the Muslims except one [i.e. Lout (Lot) and his two daughters].\n",
        "TRANSLATION_14": "But We found in it only one household of those who had surrendered themselves,\n",
        "TRANSLATION_15": "But found in it only one household of Muslims.\n",
        "TRANSLATION_16": "And We found not within them other than a [single] house of Muslims.\n",
        "TRANSLATION_17": "[51:36]   but We did not find therein other than one house of those who had submitted [to God]: these were Lot and his two daughters. They have been described [here] with [the terms] ‘belief’ and ‘submission’ because they had affirmed [faith] in their hearts and used their limbs to perform acts of obedience.\n",
        "TRANSLATION_18": "(But We found there) in the townships of Lot's folk (but one house) but the inhabitants of one house (of those surrendered (to Allah)) of those close to Allah: Lot and his two daughters, Za'ura and Raytha.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "51:36",
            "51:35",
            "35:37",
            "24:29",
            "7:162",
            "3:85",
            "33:58",
            "15:82",
            "26:149",
            "52:35"
        ],
        "BIBLE": [
            "prophets:zechariah:12:12",
            "prophets:zechariah:12:13",
            "prophets:judges:6:15",
            "prophets:zechariah:12:7",
            "torah:genesis:34:19",
            "prophets:joshua:6:17",
            "prophets:isaiah:38:20",
            "prophets:zechariah:10:6",
            "prophets:i%20kings:3:18",
            "writings:i%20chronicles:23:11"
        ]
    }
}