{
    "VERSE": "51:37",
    "ARABIC": "وَتَرَكْنَا فِيهَآ ءَايَةً لِّلَّذِينَ يَخَافُونَ ٱلْعَذَابَ ٱلْأَلِيمَ",
    "ENGLISH": {
        "TRANSLATION_0": "And We left a Sign in it for those who fear the painful punishment.",
        "TRANSLATION_1": "We left a sign in this for those who fear the grievous punishment,\n",
        "TRANSLATION_2": "and We left therein a Sign for those who fear the grievous chastisement.\n",
        "TRANSLATION_3": "We left therein evidence for those who fear the painful torment.\n",
        "TRANSLATION_4": "And We kept a sign remaining in it, for those who fear the painful punishment.\n",
        "TRANSLATION_5": "And We have left there a sign for those who fear the painful torment.\n",
        "TRANSLATION_6": "And We left therein a sign for those who fear the painful punishment.\n",
        "TRANSLATION_7": "And therein We left a sign to those who fear the painful chastisement.\n",
        "TRANSLATION_8": "And We left behind therein a portent for those who fear a painful doom.\n",
        "TRANSLATION_9": "and We left therein a sign for those who fear a painful punishment.\n",
        "TRANSLATION_10": "And We left therein a sign for those who fear the afflictive torment.\n",
        "TRANSLATION_11": "and We have left therein a sign for those who fear a painful punishment.’\n",
        "TRANSLATION_12": "And We left there a Sign for such as fear the Grievous Penalty.\n",
        "TRANSLATION_13": "And We have left there a sign (i.e. the place of the Dead Sea, well-known in Palestine) for those who fear the painful torment.\n",
        "TRANSLATION_14": "and left therein a sign for those who fear the painful punishment.\n",
        "TRANSLATION_15": "And We left in it a sign for those who fear the painful punishment.\n",
        "TRANSLATION_16": "And We left therein a sign for those who fear the painful punishment.\n",
        "TRANSLATION_17": "[51:37] And We left therein, after destroying the disbelievers, a sign, an indication of their destruction, for those who fear the painful chastisement, so that they may not do what these [sinners] did.\n",
        "TRANSLATION_18": "(And We left behind therein) in the townships of Lot's folk (a portent) a sign and lesson (for those who fear a painful doom) in the Hereafter such that they do not emulate their abominable act.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "51:37",
            "34:5",
            "34:38",
            "6:49",
            "10:97",
            "16:104",
            "2:104",
            "17:10",
            "76:31",
            "22:57"
        ],
        "BIBLE": [
            "torah:numbers:24:11",
            "writings:proverbs:15:3",
            "writings:ecclesiastes:5:12",
            "prophets:ii%20samuel:7:10",
            "prophets:jeremiah:44:29",
            "prophets:ezekiel:36:36",
            "writings:ecclesiastes:10:4",
            "prophets:ezekiel:41:11",
            "writings:ecclesiastes:1:7",
            "prophets:joshua:22:3"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:4:2",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:12"
        ]
    }
}