{
    "VERSE": "51:38",
    "ARABIC": "وَفِى مُوسَىٰٓ إِذْ أَرْسَلْنَٰهُ إِلَىٰ فِرْعَوْنَ بِسُلْطَٰنٍ مُّبِينٍ",
    "ENGLISH": {
        "TRANSLATION_0": "And also in Musa when We sent him to Pharaoh with clear authority.",
        "TRANSLATION_1": "As (there was) in Moses when We sent him to the Pharaoh with clear authority.\n",
        "TRANSLATION_2": "There is also a Sign for you in the story of Moses when We sent him with a clear authority to Pharaoh.\n",
        "TRANSLATION_3": "There is also evidence (of the Truth) in the story of Moses when We sent him to the Pharaoh with clear authority.\n",
        "TRANSLATION_4": "And in Moosa, when We sent him with a clear proof towards Firaun.\n",
        "TRANSLATION_5": "And in Musa, when We sent him to Fir`awn with a manifest authority.\n",
        "TRANSLATION_6": "And in Musa: When We sent him to Firon with clear authority.\n",
        "TRANSLATION_7": "And also in Moses, when We sent him unto Pharaoh, with a clear authority,\n",
        "TRANSLATION_8": "And in Moses (too, there is a portent) when We sent him unto Pharaoh with clear warrant,\n",
        "TRANSLATION_9": "There is another sign in Moses: We sent him to Pharaoh with clear authority.\n",
        "TRANSLATION_10": "And in Musa also was a lesson, when We sent him Unto Fir'awn with authority manifest.\n",
        "TRANSLATION_11": "And in Moses [too there is a sign] when We sent him to Pharaoh with a manifest authority.\n",
        "TRANSLATION_12": "And in Moses (was another Sign): Behold, We sent him to Pharaoh, with authority manifest.\n",
        "TRANSLATION_13": "And in Musa (Moses) (too, there is a sign). When We sent him to Fir'aun (Pharaoh) with a manifest authority.\n",
        "TRANSLATION_14": "In Moses, too, (there were signs). We sent him to Pharaoh with clear authority,\n",
        "TRANSLATION_15": "And in Moses. We sent him to Pharaoh with a clear authority.\n",
        "TRANSLATION_16": "And in Moses [was a sign], when We sent him to Pharaoh with clear authority.\n",
        "TRANSLATION_17": "[51:38] And [a sign too] in Moses (wa-fī Mūsā is a supplement to fīhā, ‘therein’), that is to say, We also left a sign in the story of Moses, when We sent him to Pharaoh, vested, with a clear warrant, with a manifest proof;\n",
        "TRANSLATION_18": "(And in Moses (too, there is a portent) when We sent him unto Pharaoh with clear warrant) with clear proof: the hand and the staff,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "51:38",
            "40:23",
            "11:96",
            "23:45",
            "30:35",
            "16:100",
            "37:156",
            "69:29",
            "52:38",
            "44:19"
        ],
        "BIBLE": [
            "writings:psalms:135:9",
            "torah:deuteronomy:34:11",
            "torah:exodus:4:28",
            "torah:exodus:10:1",
            "torah:exodus:7:7",
            "torah:exodus:4:30",
            "torah:deuteronomy:11:3",
            "torah:numbers:31:6",
            "torah:exodus:7:3",
            "torah:genesis:44:16"
        ]
    }
}