{
    "VERSE": "51:39",
    "ARABIC": "فَتَوَلَّىٰ بِرُكْنِهِۦ وَقَالَ سَٰحِرٌ أَوْ مَجْنُونٌ",
    "ENGLISH": {
        "TRANSLATION_0": "But he turned away with his forces, saying, 'A magician or a madman!'",
        "TRANSLATION_1": "But he turned to his counsellors, and said: \"He is a magician or lunatic.\"\n",
        "TRANSLATION_2": "But Pharaoh turned away, showing arrogance on account of his power, and said (about Moses): “He is either a sorcerer or a madman.”\n",
        "TRANSLATION_3": "The Pharaoh and his forces turned away from him, saying, \"He is either a magician or an insane person\".\n",
        "TRANSLATION_4": "In response, he turned away along with his army and said, “He is a magician or a madman.”\n",
        "TRANSLATION_5": "But (he) turned away along with his hosts, and said: \"A sorcerer or a madman.\"\n",
        "TRANSLATION_6": "But he turned away with his forces and said: A magician or a mad man.\n",
        "TRANSLATION_7": "but he turned his back, with his court, saying, 'A sorcerer, or a man possessed!'\n",
        "TRANSLATION_8": "But he withdrew (confiding) in his might, and said: A wizard or a madman.\n",
        "TRANSLATION_9": "But he turned his back, he and his courtiers, and said, \"This is a sorcerer or a madman.\"\n",
        "TRANSLATION_10": "Then he turned away with his court, and said: a magician or a madman.\n",
        "TRANSLATION_11": "But he turned away assured of his might, and said, ‘A magician or a crazy man!’\n",
        "TRANSLATION_12": "But (Pharaoh) turned back with his Chiefs, and said, \"A sorcerer, or one possessed!\"\n",
        "TRANSLATION_13": "But [Fir'aun (Pharaoh)] turned away (from Belief in might) along with his hosts, and said: \"A sorcerer, or a madman.\"\n",
        "TRANSLATION_14": "but he turned his back with his Assembly, saying: 'He is (either) a sorcerer or a mad man'\n",
        "TRANSLATION_15": "But he turned away with his warlords, and said, “A sorcerer or a madman.”\n",
        "TRANSLATION_16": "But he turned away with his supporters and said,\" A magician or a madman.\"\n",
        "TRANSLATION_17": "[51:39] but he turned away, he rejected belief, to his supports (bi-ruknihi), his hosts, [so called] because to him they are like a support [rukn], saying, to Moses that he [Moses] was: ‘A sorcerer, or a madman!’\n",
        "TRANSLATION_18": "(But he withdrew (confiding) in his might) pharaoh refused to believe in the proof or in Moses, relying instead on his troops, (and said: A wizard or a madman) bewitched.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "51:39",
            "16:46",
            "36:72",
            "11:80",
            "68:41",
            "37:90",
            "32:30",
            "51:45",
            "30:44",
            "16:34"
        ],
        "BIBLE": [
            "prophets:zechariah:4:6",
            "prophets:zechariah:1:6",
            "prophets:zechariah:13:7",
            "prophets:ii%20samuel:15:31",
            "prophets:judges:20:8",
            "prophets:isaiah:12:1",
            "prophets:ezekiel:26:2",
            "prophets:isaiah:44:20",
            "writings:psalms:40:5",
            "prophets:zechariah:7:9"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:6:1"
        ]
    }
}