{
    "VERSE": "51:41",
    "ARABIC": "وَفِى عَادٍ إِذْ أَرْسَلْنَا عَلَيْهِمُ ٱلرِّيحَ ٱلْعَقِيمَ",
    "ENGLISH": {
        "TRANSLATION_0": "And also in 'Ad when We unleashed against them the barren wind,",
        "TRANSLATION_1": "In 'Ad (also is a sign), when We sent a blasting wind against them,\n",
        "TRANSLATION_2": "There is also a Sign for you in (the story of) Ad, when We let loose upon them an ominous wind\n",
        "TRANSLATION_3": "There is also evidence of the Truth in the story of Ad whom We struck with a violent wind\n",
        "TRANSLATION_4": "And in the tribe of A’ad, when we sent a dry windstorm upon them.\n",
        "TRANSLATION_5": "And in `Ad when We sent against them the barren wind;\n",
        "TRANSLATION_6": "And in Ad: When We sent upon them the destructive wind.\n",
        "TRANSLATION_7": "And also in Ad, when We loosed against them the withering wind\n",
        "TRANSLATION_8": "And in (the tribe of) A'ad (there is a portent) when we sent the fatal wind against them.\n",
        "TRANSLATION_9": "There is another sign in the [tribe of] 'Ad, when We sent against them a life-destroying wind\n",
        "TRANSLATION_10": "And in `A-ad also was a lesson, when We sent against them the barren wind.\n",
        "TRANSLATION_11": "And in ‘Ad when We unleashed upon them a barren wind.\n",
        "TRANSLATION_12": "And in the 'Ad (people) (was another Sign): Behold, We sent against them the devastating Wind:\n",
        "TRANSLATION_13": "And in 'Ad (there is also a sign) when We sent against them the barren wind;\n",
        "TRANSLATION_14": "And in Aad. We let loose on them a withering wind\n",
        "TRANSLATION_15": "And in Aad. We unleashed against them the devastating wind.\n",
        "TRANSLATION_16": "And in 'Aad [was a sign], when We sent against them the barren wind.\n",
        "TRANSLATION_17": "[51:41] And [also] in, the destruction of, ‘Ād, was a sign, when We unleashed against them a barren wind, [a wind] which brings nothing of good, for it does not bear any rain and does not pollinate any trees; this [wind] was the west wind (al-dabūr).\n",
        "TRANSLATION_18": "(And in (the tribe of) 'Aad) the people of Hud ((there is a portent) when We sent) We set on them (the fatal wind against them) the severe wind in which there was no comfort for them, this is the west wind.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "51:41",
            "69:6",
            "69:4",
            "26:123",
            "53:50",
            "26:193",
            "30:51",
            "38:12",
            "41:13",
            "21:86"
        ],
        "BIBLE": [
            "prophets:isaiah:7:2",
            "torah:genesis:41:23",
            "prophets:micah:2:11",
            "writings:ecclesiastes:4:16",
            "prophets:ii%20samuel:12:15",
            "prophets:isaiah:28:2",
            "prophets:jeremiah:51:1",
            "torah:genesis:41:6",
            "torah:numbers:22:5",
            "prophets:ezekiel:1:4"
        ]
    }
}