{
    "VERSE": "51:42",
    "ARABIC": "مَا تَذَرُ مِن شَىْءٍ أَتَتْ عَلَيْهِ إِلَّا جَعَلَتْهُ كَٱلرَّمِيمِ",
    "ENGLISH": {
        "TRANSLATION_0": "which left nothing it touched without turning it to dust.",
        "TRANSLATION_1": "Which turned everything it touched to ashes.\n",
        "TRANSLATION_2": "that left nothing that it came upon without reducing it to rubble.\n",
        "TRANSLATION_3": "which turned everything it approached into dust.\n",
        "TRANSLATION_4": "It left out nothing in its path, but which it split up into fragments.\n",
        "TRANSLATION_5": "It spared nothing that it reached, but blew it into broken spreads of rotten ruins.\n",
        "TRANSLATION_6": "It did not leave aught on which it blew, but it made it like ashes.\n",
        "TRANSLATION_7": "that left nothing it came upon, but made it as stuff decayed.\n",
        "TRANSLATION_8": "It spared naught that it reached, but made it (all) as dust.\n",
        "TRANSLATION_9": "and it destroyed everything over which it passed and reduced it to dust.\n",
        "TRANSLATION_10": "It left not aught whereon it came but it made it as matter decayed.\n",
        "TRANSLATION_11": "It left nothing that it came upon without making it like decayed bones.\n",
        "TRANSLATION_12": "It left nothing whatever that it came up against, but reduced it to ruin and rottenness.\n",
        "TRANSLATION_13": "It spared nothing that it reached, but blew it into broken spreads of rotten ruins.\n",
        "TRANSLATION_14": "that left nothing it came upon, except that it was ashes.\n",
        "TRANSLATION_15": "It spared nothing it came upon, but rendered it like decayed ruins.\n",
        "TRANSLATION_16": "It left nothing of what it came upon but that it made it like disintegrated ruins.\n",
        "TRANSLATION_17": "[51:42] It did not leave anything, any soul or property, that it came upon without making it like decayed bones, like something that is withered and in scattered pieces.\n",
        "TRANSLATION_18": "(It spared naught) neither them nor their belongings (that it reached) that the wind reached to, (but made it (all) as dust.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "51:42",
            "80:18",
            "3:128",
            "52:35",
            "36:15",
            "26:5",
            "6:69",
            "18:70",
            "56:79",
            "69:37"
        ],
        "BIBLE": [
            "writings:job:41:20",
            "torah:exodus:23:27",
            "prophets:isaiah:29:21",
            "writings:ezra:10:14",
            "prophets:ezekiel:20:17",
            "prophets:ii%20kings:3:20",
            "prophets:i%20kings:11:4",
            "prophets:i%20samuel:10:9",
            "writings:ii%20chronicles:18:32",
            "prophets:i%20kings:22:33"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:1:4"
        ]
    }
}