{
    "VERSE": "51:43",
    "ARABIC": "وَفِى ثَمُودَ إِذْ قِيلَ لَهُمْ تَمَتَّعُوا۟ حَتَّىٰ حِينٍ",
    "ENGLISH": {
        "TRANSLATION_0": "And also in Thamud, when they were told: 'Enjoy yourselves a while!'",
        "TRANSLATION_1": "And in Thamud, when We said to them: \"Enjoy yourselves for a while;\"\n",
        "TRANSLATION_2": "There is also a Sign for you in (the story of) Thamud. They were told: “Enjoy yourselves for a while.”\n",
        "TRANSLATION_3": "There is also evidence (of the Truth) in the story of the Thamud, who were told to enjoy themselves for an appointed time.\n",
        "TRANSLATION_4": "And in the tribe of Thamud when it was told to them, “Enjoy for a while.”\n",
        "TRANSLATION_5": "And in Thamud, when they were told: \"Enjoy yourselves for a while!\"\n",
        "TRANSLATION_6": "And in Samood: When it was said to them: Enjoy yourselves for a while.\n",
        "TRANSLATION_7": "And also in Thamood, when it was said to them, 'Take your enjoyment for a while!'\n",
        "TRANSLATION_8": "And in (the tribe of) Thamud (there is a portent) when it was told them: Take your ease awhile.\n",
        "TRANSLATION_9": "In the Thamud [there was another sign], when they were told, \"Make the most of your lives for a while.\"\n",
        "TRANSLATION_10": "And in Thamud's also was a lesson, when it was said Unto them: enjoy yourselves for a season.\n",
        "TRANSLATION_11": "And in Thamud, when they were told, ‘Enjoy for a while.’\n",
        "TRANSLATION_12": "And in the Thamud (was another Sign): Behold, they were told, \"Enjoy (your brief day) for a little while!\"\n",
        "TRANSLATION_13": "And in Thamud (there is also a sign), when they were told: \"Enjoy yourselves for a while!\"\n",
        "TRANSLATION_14": "And in Thamood it was said to them: 'Take your enjoyment for awhile'\n",
        "TRANSLATION_15": "And in Thamood. They were told, “Enjoy yourselves for a while.”\n",
        "TRANSLATION_16": "And in Thamud, when it was said to them, \"Enjoy yourselves for a time.\"\n",
        "TRANSLATION_17": "[51:43] And [also] in, the destruction of, Thamūd, was a sign, when it was said to them, after the hamstringing of the she-camel, ‘Enjoy [yourselves] for a while!’, until the end of your terms [of life] — as stated in the [other] verse, ‘Enjoy [yourselves] in your dwellings for three days’ [Q.11:65].\n",
        "TRANSLATION_18": "And in (the tribe of) Thamud) the folk of Salih ((there is a portent) when it was told them) Salih told them after they hamstrung the she-camel: (Take your ease awhile) enjoy your life until the advent of the chastisement.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "51:43",
            "56:84",
            "16:6",
            "37:174",
            "37:178",
            "37:148",
            "26:218",
            "23:54",
            "30:17",
            "109:6"
        ],
        "BIBLE": [
            "writings:daniel:8:19",
            "prophets:i%20kings:19:2",
            "writings:daniel:7:12",
            "prophets:i%20kings:20:34",
            "prophets:i%20samuel:9:24",
            "prophets:joshua:6:18",
            "prophets:ii%20kings:13:15",
            "prophets:joshua:5:2",
            "torah:genesis:41:9",
            "writings:i%20chronicles:10:4"
        ]
    }
}