{
    "VERSE": "51:46",
    "ARABIC": "وَقَوْمَ نُوحٍ مِّن قَبْلُ إِنَّهُمْ كَانُوا۟ قَوْمًا فَٰسِقِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "And the people of Nuh before, they were a people of deviators.",
        "TRANSLATION_1": "(So had We destroyed) the people of Noah before them: They were surely a sinful people.\n",
        "TRANSLATION_2": "Before all these We destroyed the people of Noah: they were a wicked people.\n",
        "TRANSLATION_3": "The people of Noah who lived before them were also evil doing people.\n",
        "TRANSLATION_4": "And before them, We destroyed the people of Nooh; they were indeed a sinning nation.\n",
        "TRANSLATION_5": "(So were) the people of Nuh before them. Verily, they were a people who were rebellious.\n",
        "TRANSLATION_6": "And the people of Nuh before, surely they were a transgressing people.\n",
        "TRANSLATION_7": "And the people of Noah before; surely they were an ungodly people.\n",
        "TRANSLATION_8": "And the folk of Noah aforetime. Lo! they were licentious folk.\n",
        "TRANSLATION_9": "[We destroyed] the people of Noah before them. They were certainly a sinful people.\n",
        "TRANSLATION_10": "And the people of Nuh We destroyed aforetime; verily they were a people transgressing.\n",
        "TRANSLATION_11": "And the people of Noah aforetime. Indeed, they were a transgressing lot.\n",
        "TRANSLATION_12": "So were the People of Noah before them for they wickedly transgressed.\n",
        "TRANSLATION_13": "(So were) the people of Nuh (Noah) before them. Verily, they were a people who were Fasiqun (rebellious, disobedient to Allah).\n",
        "TRANSLATION_14": "And before them the nation of Noah, indeed they were a debauched nation.\n",
        "TRANSLATION_15": "And before that, the people of Noah. They were immoral people.\n",
        "TRANSLATION_16": "And [We destroyed] the people of Noah before; indeed, they were a people defiantly disobedient.\n",
        "TRANSLATION_17": "[51:46]   And the people of Noah (read wa qawmi Nūhin, as a supplement to Thamūda, in other words: ‘in the destruction of these [two peoples] by what [destructive power] exists in the heavens and the earth there is [also] a sign’; or read wa qawma Nūhin, in other words, ‘We also destroyed the people of Noah’) aforetime, that is, before the destruction of those mentioned. Indeed they were an immoral lot.\n",
        "TRANSLATION_18": "(And the folk of Noah) We had also destroyed them (aforetime) before the folk of Salih. (Lo! they were licentious folk) they were disbelieving folk.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "51:46",
            "53:52",
            "5:102",
            "44:37",
            "54:9",
            "71:1",
            "15:58",
            "22:42",
            "51:32",
            "50:12"
        ],
        "BIBLE": [
            "writings:psalms:9:6",
            "prophets:zephaniah:2:9",
            "writings:ii%20chronicles:36:14",
            "prophets:ezekiel:2:3",
            "prophets:ezekiel:33:12",
            "torah:exodus:9:24",
            "writings:psalms:37:38",
            "writings:psalms:148:6",
            "prophets:ii%20kings:21:9",
            "torah:exodus:23:21"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:2:2",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:5"
        ]
    }
}