{
    "VERSE": "51:47",
    "ARABIC": "وَٱلسَّمَآءَ بَنَيْنَٰهَا بِأَيْي۟دٍ وَإِنَّا لَمُوسِعُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "As for heaven - We built it with great power and gave it its vast expanse.",
        "TRANSLATION_1": "We built the heavens by Our authority; and We are the Lord of power and expanse.\n",
        "TRANSLATION_2": "And heaven – We made it with Our Own Power and We have the Power to do so.\n",
        "TRANSLATION_3": "We have made the heavens with Our own hands and We expanded it.\n",
        "TRANSLATION_4": "And We have built the heaven with hands (the Divine Power), and it is We Who give the expanse.\n",
        "TRANSLATION_5": "With Hands We constructed the heaven. Verily, We are able to expand the vastness of space thereof.\n",
        "TRANSLATION_6": "And the heaven, We raised it high with power, and most surely We are the makers of things ample.\n",
        "TRANSLATION_7": "And heaven -- We built it with might, and We extend it wide.\n",
        "TRANSLATION_8": "We have built the heaven with might, and We it is Who make the vast extent (thereof).\n",
        "TRANSLATION_9": "We built the universe with Our might, giving it its vast expanse.\n",
        "TRANSLATION_10": "And the heaven! We have built it with might, and verily We are powerful.\n",
        "TRANSLATION_11": "We have built the heaven with might, and indeed it is We who are its expanders.\n",
        "TRANSLATION_12": "With power and skill did We construct the Firmament: for it is We Who create the vastness of pace.\n",
        "TRANSLATION_13": "With power did We construct the heaven. Verily, We are Able to extend the vastness of space thereof.\n",
        "TRANSLATION_14": "We built the heaven with might, and We widely extended it.\n",
        "TRANSLATION_15": "We constructed the universe with power, and We are expanding it.\n",
        "TRANSLATION_16": "And the heaven We constructed with strength, and indeed, We are [its] expander.\n",
        "TRANSLATION_17": "[51:47] And the heaven, We built it with might, and indeed We are powerful (one says āda’l-rajulu or ya’īdu, to mean, ‘he is strong’; and awsa‘a’l-rajulu, to mean, ‘he has become capable [dhū sa‘a] and strong’).\n",
        "TRANSLATION_18": "(We have built) created (the heaven with might, and We it is who make the vast extent (thereof)) as We will; it is also said that this means: we expand the provision thereof.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "51:47",
            "21:32",
            "91:5",
            "45:3",
            "86:1",
            "15:9",
            "15:16",
            "23:18",
            "15:23",
            "81:11"
        ],
        "BIBLE": [
            "writings:i%20chronicles:29:12",
            "writings:psalms:119:73",
            "prophets:ezekiel:30:12",
            "prophets:joshua:6:2",
            "prophets:judges:18:10",
            "writings:ii%20chronicles:14:6",
            "prophets:hosea:2:14",
            "prophets:isaiah:35:3",
            "prophets:isaiah:49:11",
            "prophets:ii%20kings:7:2"
        ]
    }
}