{
    "VERSE": "51:48",
    "ARABIC": "وَٱلْأَرْضَ فَرَشْنَٰهَا فَنِعْمَ ٱلْمَٰهِدُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "And the earth - We spread it like a carpet and how well We smoothed it out!",
        "TRANSLATION_1": "We spread the earth a carpet; what comfort We provide!\n",
        "TRANSLATION_2": "And the earth – We spread it out, and how well have We smoothed it!\n",
        "TRANSLATION_3": "We have spread out the earth and how brilliantly it is spread!\n",
        "TRANSLATION_4": "And We made the earth a base, so how well do We lay out!\n",
        "TRANSLATION_5": "And We have made the earth a Firash; how excellent spreader (thereof) are We!\n",
        "TRANSLATION_6": "And the earth, We have made it a wide extent; how well have We then spread (it) out.\n",
        "TRANSLATION_7": "And the earth -- We spread it forth; O excellent Smoothers!\n",
        "TRANSLATION_8": "And the earth have We laid out, how gracious is the Spreader (thereof)!\n",
        "TRANSLATION_9": "We have spread out the earth, how well We have spread it out,\n",
        "TRANSLATION_10": "And the earth! We have stretched it forth beneath; an excellent Spreader are We!\n",
        "TRANSLATION_11": "And We have spread out the earth, so how excellent spreaders We have been!\n",
        "TRANSLATION_12": "And We have spread out the (spacious) earth: How excellently We do spread out!\n",
        "TRANSLATION_13": "And We have spread out the earth, how Excellent Spreader (thereof) are We!\n",
        "TRANSLATION_14": "and We cradled the earth. And We are the Best of Cradlers.\n",
        "TRANSLATION_15": "And the earth—We spread it out—How well We prepared it!\n",
        "TRANSLATION_16": "And the earth We have spread out, and excellent is the preparer.\n",
        "TRANSLATION_17": "[51:48] And the earth, We spread it out: We made it level: what excellent Spreaders then!, We are.\n",
        "TRANSLATION_18": "(And the earth have We laid out) on water, (how gracious was the Spreader (thereof)!\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "51:48",
            "91:6",
            "84:3",
            "19:40",
            "99:2",
            "23:84",
            "55:10",
            "38:28",
            "80:26",
            "26:152"
        ],
        "BIBLE": [
            "prophets:isaiah:42:5",
            "writings:psalms:74:18",
            "writings:ii%20chronicles:4:14",
            "prophets:isaiah:44:24",
            "prophets:i%20kings:7:43",
            "prophets:i%20kings:7:27",
            "torah:numbers:8:4",
            "prophets:i%20kings:7:34",
            "prophets:isaiah:51:13",
            "prophets:i%20kings:7:30"
        ]
    }
}