{
    "VERSE": "51:49",
    "ARABIC": "وَمِن كُلِّ شَىْءٍ خَلَقْنَا زَوْجَيْنِ لَعَلَّكُمْ تَذَكَّرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "And We created all things in pairs so that hopefully you would pay heed.",
        "TRANSLATION_1": "And We created pairs of everything that you may contemplate.\n",
        "TRANSLATION_2": "And of everything We have created pairs; perhaps you will take heed.\n",
        "TRANSLATION_3": "We have created everything in pairs so that perhaps you may take heed.\n",
        "TRANSLATION_4": "And We created all things in pairs, so that you may ponder.\n",
        "TRANSLATION_5": "And of everything We have created pairs, that you may remember.\n",
        "TRANSLATION_6": "And of everything We have created pairs that you may be mindful.\n",
        "TRANSLATION_7": "And of everything created We two kinds; haply you will remember.\n",
        "TRANSLATION_8": "And all things We have created by pairs, that haply ye may reflect.\n",
        "TRANSLATION_9": "and We created pairs of all things so that you might reflect.\n",
        "TRANSLATION_10": "And of every thing We have created pairs, that haply ye may remember.\n",
        "TRANSLATION_11": "In all things We have created pairs so that you may take admonition.\n",
        "TRANSLATION_12": "And of every thing We have created pairs: That ye may receive instruction.\n",
        "TRANSLATION_13": "And of everything We have created pairs, that you may remember (the Grace of Allah).\n",
        "TRANSLATION_14": "We created two kinds of all things, so that you will remember.\n",
        "TRANSLATION_15": "We created all things in pairs, so that you may reflect and ponder.\n",
        "TRANSLATION_16": "And of all things We created two mates; perhaps you will remember.\n",
        "TRANSLATION_17": "[51:49] And of all things (wa-min kulli shay’in is semantically connected to His [following] words khalaqnā) We created pairs, two kinds, such as male and female, heaven and earth, sun and moon, plain and mountain, summer and winter, sweet and bitter, light and darkness, that perhaps you might remember (tadhakkarūna: one of the two original tā’ letters [of tatadhakkarūna] has been omitted), and hence realise that the Creator of pairs is [Himself] Singular, that you might then worship him.\n",
        "TRANSLATION_18": "And all things We have created by pairs) in the earth, (that haply ye may reflect) on the creation of Allah.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "51:49",
            "15:19",
            "78:8",
            "78:29",
            "54:52",
            "54:49",
            "39:62",
            "50:7",
            "18:84",
            "38:58"
        ],
        "BIBLE": [
            "writings:proverbs:19:20",
            "prophets:isaiah:65:17",
            "prophets:isaiah:43:18",
            "prophets:ezekiel:16:61",
            "prophets:jeremiah:17:23",
            "prophets:jeremiah:32:33",
            "torah:exodus:23:13",
            "writings:job:22:22",
            "prophets:joshua:1:17",
            "writings:proverbs:8:10"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:2",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:2",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:3:2"
        ]
    }
}