{
    "VERSE": "51:51",
    "ARABIC": "وَلَا تَجْعَلُوا۟ مَعَ ٱللَّهِ إِلَٰهًا ءَاخَرَ إِنِّى لَكُم مِّنْهُ نَذِيرٌ مُّبِينٌ",
    "ENGLISH": {
        "TRANSLATION_0": "Do not set up another god together with Allah. Truly I bring you a clear warning from Him.",
        "TRANSLATION_1": "Do not set up another god with God. I give you a clear warning from Him.\n",
        "TRANSLATION_2": "and do not set up any deity with Allah. Surely I am a clear warner to you from Him.\n",
        "TRANSLATION_3": "Do not choose other gods besides Him. I have been sent from Him to plainly warn you\".\n",
        "TRANSLATION_4": "“And do not appoint other deities along with Allah; indeed I am from Him, a clear Herald of Warning towards you.”\n",
        "TRANSLATION_5": "And set not up any other god along with Allah. Verily, I am a plain warner to you from Him.\n",
        "TRANSLATION_6": "And do not set up with Allah another god: surely I am a plain warner to you from Him.\n",
        "TRANSLATION_7": "And set not up with God another god; I am a clear warner from Him to you.\n",
        "TRANSLATION_8": "And set not any other god along with Allah; lo! I am a plain warner unto you from Him.\n",
        "TRANSLATION_9": "Do not set up another god, along with God. I come from Him to warn you plainly.\n",
        "TRANSLATION_10": "And set not up another god with Allah; verily I am Unto you from Him a warner manifest.\n",
        "TRANSLATION_11": "Do not set up another god besides Allah. Indeed I am from Him a manifest warner to you.’\n",
        "TRANSLATION_12": "And make not another an object of worship with Allah: I am from Him a Warner to you, clear and open!\n",
        "TRANSLATION_13": "And set not up (or worship) any other ilahan (god) along with Allah [Glorified be He (Alone), Exalted above all that they associate as partners with Him]. Verily, I (Muhammad SAW) am a plain warner to you from Him.\n",
        "TRANSLATION_14": "Do not set up with Allah another god. I am a clear warner to you from Him.\n",
        "TRANSLATION_15": "“And do not set up any other god with God. I am to you from Him a clear warner.”\n",
        "TRANSLATION_16": "And do not make [as equal] with Allah another deity. Indeed, I am to you from Him a clear warner.\n",
        "TRANSLATION_17": "[51:51] And do not set up another god alongside God. Truly I am a clear warner to you from Him (before fa-firrū, ‘so flee’, one may read an implicit [preceding] qul lahum, ‘Say to them’).\n",
        "TRANSLATION_18": "(And set not any other god along with Allah) refrain from saying: Allah has a son or partner; (lo! I am a plain warner) in a language you understand (unto you from Him) from Allah.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "51:51",
            "51:50",
            "11:2",
            "17:22",
            "26:213",
            "15:69",
            "23:117",
            "15:96",
            "67:26",
            "16:128"
        ],
        "BIBLE": [
            "prophets:joshua:23:7",
            "torah:genesis:48:20",
            "prophets:i%20samuel:8:12",
            "prophets:isaiah:26:13",
            "prophets:isaiah:36:8",
            "prophets:ii%20kings:18:23",
            "torah:numbers:21:8",
            "torah:genesis:31:44",
            "prophets:isaiah:40:3",
            "torah:exodus:35:10"
        ]
    }
}