{
    "VERSE": "51:52",
    "ARABIC": "كَذَٰلِكَ مَآ أَتَى ٱلَّذِينَ مِن قَبْلِهِم مِّن رَّسُولٍ إِلَّا قَالُوا۟ سَاحِرٌ أَوْ مَجْنُونٌ",
    "ENGLISH": {
        "TRANSLATION_0": "Equally, no Messenger came to those before them without their saying, 'A magician or a madman!'",
        "TRANSLATION_1": "Even thus no apostle came to those before them but they said: \"He is a sorcerer or a mad man.\"\n",
        "TRANSLATION_2": "Thus has it been (in the past): never did a Messenger come to the nations that preceded them but they said: “(He is) a sorcerer, or a mad-man.”\n",
        "TRANSLATION_3": "In the same way no Messenger came to those who lived before them without his people calling him a magician or an insane person.\n",
        "TRANSLATION_4": "Similarly, whenever a Noble Messenger came to those before them they always said, “He is a magician or a madman.”\n",
        "TRANSLATION_5": "Likewise, no Messenger came to those before them but they said: \"A sorcerer or a madman!\"\n",
        "TRANSLATION_6": "Thus there did not come to those before them an apostle but they said: A magician or a mad man.\n",
        "TRANSLATION_7": "Even so not a Messenger came to those before them but they said, 'A sorcerer, or a man possessed!'\n",
        "TRANSLATION_8": "Even so there came no messenger unto those before them but they said: A wizard or a madman!\n",
        "TRANSLATION_9": "Likewise, there came no messenger to those before them, but they said, \"He is a sorcerer or a madman.\"\n",
        "TRANSLATION_10": "Likewise, there came not an apostle Unto those before them but they said: a magician or a madman!\n",
        "TRANSLATION_11": "So it was that there did not come any apostle to those who were before them but they said, ‘A magician,’ or ‘A crazy man!’\n",
        "TRANSLATION_12": "Similarly, no messenger came to the Peoples before them, but they said (of him) in like manner, \"A sorcerer, or one possessed\"!\n",
        "TRANSLATION_13": "Likewise, no Messenger came to those before them, but they said: \"A sorcerer or a madman!\"\n",
        "TRANSLATION_14": "Similarly, no Messenger came to those before them but they said: 'Sorcerer, or mad'\n",
        "TRANSLATION_15": "Likewise, no messenger came to those before them, but they said, “A sorcerer or a madman.”\n",
        "TRANSLATION_16": "Similarly, there came not to those before them any messenger except that they said, \"A magician or a madman.\"\n",
        "TRANSLATION_17": "[51:52] Thus there did not come to those who were before them any messenger but they said, that he was: ‘A sorcerer, or a madman!’, in other words, their denial of you, by saying that you are a sorcerer or a madman, was like the denial of communities before them of their messengers by saying that [same thing].\n",
        "TRANSLATION_18": "(Even so) just as your own people accused you of being a wizard and madman (there came no messenger) calling to Allah (unto those before them) before your people (but they said) to that messenger: (A wizard or a madman!\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "51:52",
            "21:41",
            "15:11",
            "6:10",
            "41:48",
            "21:25",
            "29:18",
            "16:35",
            "4:164",
            "17:77"
        ],
        "BIBLE": [
            "torah:genesis:19:5",
            "torah:genesis:3:9",
            "torah:genesis:27:1",
            "prophets:judges:9:54",
            "prophets:ii%20samuel:15:2",
            "torah:genesis:30:11",
            "prophets:isaiah:35:8",
            "torah:genesis:3:20",
            "prophets:i%20kings:13:12",
            "prophets:ii%20kings:7:10"
        ]
    }
}