{
    "VERSE": "51:53",
    "ARABIC": "أَتَوَاصَوْا۟ بِهِۦ بَلْ هُمْ قَوْمٌ طَاغُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Did they bequeathe this to one another? Indeed they are an unbridled people.",
        "TRANSLATION_1": "Is this the legacy they have passed down from one to the other? In fact, they are a rebellious people.\n",
        "TRANSLATION_2": "Have they arrived at a common understanding concerning this? No; but they are a people given to transgression.\n",
        "TRANSLATION_3": "Have they inherited such dealings with the Prophets from their predecessors or are they a rebellious people?\n",
        "TRANSLATION_4": "What! Have they willed this utterance to one another? In fact they are a rebellious people.\n",
        "TRANSLATION_5": "Have they transmitted this saying to these Nay, they are themselves a people transgressing beyond bounds!\n",
        "TRANSLATION_6": "Have they charged each other with this? Nay! they are an inordinate people.\n",
        "TRANSLATION_7": "What, have they bequeathed it one to another? Nay, but they are an insolent people.\n",
        "TRANSLATION_8": "Have they handed down (the saying) as an heirloom one unto another? Nay, but they are froward folk.\n",
        "TRANSLATION_9": "Have they handed this down to one another? They are certainly a people who exceed all bounds,\n",
        "TRANSLATION_10": "Have they bequeathed its Unto each other! Nay! they are a people contumacious.\n",
        "TRANSLATION_11": "Did they enjoin this upon one another?! Rather, they were a rebellious lot.\n",
        "TRANSLATION_12": "Is this the legacy they have transmitted, one to another? Nay, they are themselves a people transgressing beyond bounds!\n",
        "TRANSLATION_13": "Have they (the people of the past) transmitted this saying to these (Quraish pagans)? Nay, they are themselves a people transgressing beyond bounds (in disbelief)!\n",
        "TRANSLATION_14": "Have they handed this down from one to another? No, rather, they are an insolent nation.\n",
        "TRANSLATION_15": "Did they recommend it to one another? In fact, they are rebellious people.\n",
        "TRANSLATION_16": "Did they suggest it to them? Rather, they [themselves] are a transgressing people.\n",
        "TRANSLATION_17": "[51:53] Have they, all, enjoined this upon one another? (an interrogative intended as a denial). Nay, but they are an insolent folk, [a folk] whose own [proclivity to] insolence has made them all say the same thing.\n",
        "TRANSLATION_18": "Have they handed down (the saying) as an heirloom one unto another) did all these folks conspire to say to their respective messenger: you are a wizard or madman? (Nay, but they are froward folk) disbelieving folk.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "51:53",
            "36:19",
            "26:11",
            "51:32",
            "15:58",
            "37:124",
            "15:62",
            "52:32",
            "20:83",
            "5:102"
        ],
        "BIBLE": [
            "writings:job:15:19",
            "prophets:joshua:17:14",
            "torah:deuteronomy:26:13",
            "prophets:i%20kings:5:21",
            "writings:esther:4:8",
            "torah:deuteronomy:2:9",
            "prophets:amos:2:12",
            "prophets:joshua:17:4",
            "torah:numbers:11:18",
            "torah:genesis:15:18"
        ]
    }
}