{
    "VERSE": "51:56",
    "ARABIC": "وَمَا خَلَقْتُ ٱلْجِنَّ وَٱلْإِنسَ إِلَّا لِيَعْبُدُونِ",
    "ENGLISH": {
        "TRANSLATION_0": "I only created jinn and man to worship Me.",
        "TRANSLATION_1": "I have not created the jinns and men but to worship Me.\n",
        "TRANSLATION_2": "I created the jinn and humans for nothing else but that they may serve Me;\n",
        "TRANSLATION_3": "We have created jinn and human beings only that they might worship Me.\n",
        "TRANSLATION_4": "And I created the jinns and men, only for them to worship Me.\n",
        "TRANSLATION_5": "And I created not the Jinn and mankind except that they should worship Me.\n",
        "TRANSLATION_6": "And I have not created the jinn and the men except that they should serve Me.\n",
        "TRANSLATION_7": "I have not created jinn and mankind except to serve Me.\n",
        "TRANSLATION_8": "I created the jinn and humankind only that they might worship Me.\n",
        "TRANSLATION_9": "I created the jinn and mankind only so that they might worship Me:\n",
        "TRANSLATION_10": "And have not created the Jinn and mankind but that they should worship Me.\n",
        "TRANSLATION_11": "I did not create the jinn and the humans except that they may worship Me.\n",
        "TRANSLATION_12": "I have only created Jinns and men, that they may serve Me.\n",
        "TRANSLATION_13": "And I (Allah) created not the jinns and humans except they should worship Me (Alone).\n",
        "TRANSLATION_14": "I have not created mankind and jinn except to worship Me.\n",
        "TRANSLATION_15": "I did not create the jinn and the humans except to worship Me.\n",
        "TRANSLATION_16": "And I did not create the jinn and mankind except to worship Me.\n",
        "TRANSLATION_17": "[51:56] And I did not create the jinn and mankind except that they may worship Me: the fact that disbelievers do not worship [God] does not contradict this [statement], since a purpose does not have to be realised [in an   act, for it to be valid], as when you may say: ‘I sharpened this pencil in order to write with it’, even though you might not actually write with it.\n",
        "TRANSLATION_18": "(I created the jinn and humankind only that they might worship Me) to worship me; this concerns only His obedient servants; and it is also said: had Allah created them for worship, they would not have disobeyed him for a blink of an eye. 'AN Ibn Abi Talib said: I have not created them except to command them and entrust them with legal responsibility; and it is also said that this means: I created the jinn and humankind only that they might declare My divine Oneness and worship Me.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "51:56",
            "27:17",
            "99:3",
            "53:39",
            "26:99",
            "72:6",
            "80:17",
            "96:5",
            "72:5",
            "89:30"
        ],
        "BIBLE": [
            "writings:daniel:3:12",
            "prophets:ii%20kings:25:24",
            "torah:deuteronomy:29:25",
            "prophets:jeremiah:40:9",
            "prophets:judges:9:28",
            "prophets:ii%20samuel:16:19",
            "torah:exodus:10:7",
            "torah:exodus:10:11",
            "prophets:jeremiah:25:6",
            "torah:deuteronomy:17:3"
        ]
    }
}