{
    "VERSE": "51:57",
    "ARABIC": "مَآ أُرِيدُ مِنْهُم مِّن رِّزْقٍ وَمَآ أُرِيدُ أَن يُطْعِمُونِ",
    "ENGLISH": {
        "TRANSLATION_0": "I do not require any provision from them and I do not require them to nourish Me.",
        "TRANSLATION_1": "I want no sustenance from them nor do I want them to feed Me.\n",
        "TRANSLATION_2": "I desire from them no provision, nor do I want them to feed Me.\n",
        "TRANSLATION_3": "I do not expect to receive any sustenance from them or that they should feed Me.\n",
        "TRANSLATION_4": "I do not ask any sustenance from them, nor wish that they give Me food.\n",
        "TRANSLATION_5": "I seek not any provision from them nor do I ask that they should feed Me.\n",
        "TRANSLATION_6": "I do not desire from them any sustenance and I do not desire that they should feed Me.\n",
        "TRANSLATION_7": "I desire of them no provision, neither do I desire that they should feed Me.\n",
        "TRANSLATION_8": "I seek no livelihood from them, nor do I ask that they should feed Me.\n",
        "TRANSLATION_9": "I seek no sustenance from them, nor do I want them to feed Me --\n",
        "TRANSLATION_10": "I seek not any provision from them, nor I desire that they should feed Me.\n",
        "TRANSLATION_11": "I desire no provision from them, nor do I desire that they should feed Me.\n",
        "TRANSLATION_12": "No Sustenance do I require of them, nor do I require that they should feed Me.\n",
        "TRANSLATION_13": "I seek not any provision from them (i.e. provision for themselves or for My creatures) nor do I ask that they should feed Me (i.e. feed themselves or My creatures).\n",
        "TRANSLATION_14": "I do not desire provision from them, nor do I desire that they should feed Me.\n",
        "TRANSLATION_15": "I need no livelihood from them, nor do I need them to feed Me.\n",
        "TRANSLATION_16": "I do not want from them any provision, nor do I want them to feed Me.\n",
        "TRANSLATION_17": "[51:57] I do not desire from them any provision, [either] for Myself, for themselves, or for others, nor do I desire that they should feed Me, or [feed] themselves or others.\n",
        "TRANSLATION_18": "(I seek no livelihood from them) I have not made them responsible to provide sustenance for themselves, (nor do I ask that they should feed Me) nor do I ask them to help Me to provide their provisions.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "51:57",
            "56:82",
            "51:45",
            "83:33",
            "37:41",
            "51:22",
            "89:16",
            "23:98",
            "26:211",
            "40:13"
        ],
        "BIBLE": [
            "prophets:ezekiel:34:10",
            "writings:psalms:132:15",
            "prophets:joshua:9:14",
            "prophets:isaiah:58:2",
            "prophets:judges:13:23",
            "writings:job:3:12",
            "prophets:ezekiel:16:61",
            "writings:psalms:10:4",
            "prophets:zephaniah:3:7",
            "prophets:ezekiel:34:2"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:3",
            
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:5:2"
        ]
    }
}