{
    "VERSE": "51:58",
    "ARABIC": "إِنَّ ٱللَّهَ هُوَ ٱلرَّزَّاقُ ذُو ٱلْقُوَّةِ ٱلْمَتِينُ",
    "ENGLISH": {
        "TRANSLATION_0": "Truly Allah, He is the Provider, the Possessor of Strength, the Sure.",
        "TRANSLATION_1": "God is certainly the great provider, Lord of strength and power.\n",
        "TRANSLATION_2": "Surely Allah is the Bestower of all provision, the Lord of all power, the Strong.\n",
        "TRANSLATION_3": "It is God Who is the Sustainer and the Lord of invincible strength.\n",
        "TRANSLATION_4": "Indeed it is Allah, Who is the Greatest Sustainer, the Strong, the Able.\n",
        "TRANSLATION_5": "Verily, Allah is the All-Provider, Owner of power, the Most Strong.\n",
        "TRANSLATION_6": "Surely Allah is the Bestower of sustenance, the Lord of Power, the Strong.\n",
        "TRANSLATION_7": "Surely God is the All-provider, the Possessor of Strength, the Ever-Sure.\n",
        "TRANSLATION_8": "Lo! Allah! He it is that giveth livelihood, the Lord of unbreakable might.\n",
        "TRANSLATION_9": "it is God who is the great Sustainer, the Mighty One, the Invincible.\n",
        "TRANSLATION_10": "Verily Allah! He is the Provider, Owner of power, Firm.\n",
        "TRANSLATION_11": "Indeed it is Allah who is the All-provider, Powerful and All-strong.\n",
        "TRANSLATION_12": "For Allah is He Who gives (all) Sustenance,- Lord of Power,- Steadfast (for ever).\n",
        "TRANSLATION_13": "Verily, Allah is the All-Provider, Owner of Power, the Most Strong.\n",
        "TRANSLATION_14": "Surely, Allah is the Provider, the Possessor of Power, the Mighty.\n",
        "TRANSLATION_15": "God is the Provider, the One with Power, the Strong.\n",
        "TRANSLATION_16": "Indeed, it is Allah who is the [continual] Provider, the firm possessor of strength.\n",
        "TRANSLATION_17": "[51:58] Indeed it is God Who is the Provider, the Lord of Strength, the Firm, the Stern.\n",
        "TRANSLATION_18": "(Lo! Allah! He it is that giveth livelihood) to His slaves, (the Lord of unbreakable might) against His enemies, Who has in store a severe chastisement for them.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "51:58",
            "104:6",
            "58:21",
            "30:37",
            "39:52",
            "13:26",
            "63:6",
            "3:2",
            "10:85",
            "9:96"
        ],
        "BIBLE": [
            "writings:daniel:2:37",
            "prophets:i%20kings:5:18",
            "torah:deuteronomy:16:17",
            "writings:ii%20chronicles:32:29",
            "prophets:joshua:13:33",
            "prophets:judges:11:24",
            "writings:psalms:118:27",
            "prophets:joshua:13:14",
            "writings:ecclesiastes:5:18",
            "torah:deuteronomy:25:19"
        ]
    }
}