{
    "VERSE": "51:60",
    "ARABIC": "فَوَيْلٌ لِّلَّذِينَ كَفَرُوا۟ مِن يَوْمِهِمُ ٱلَّذِى يُوعَدُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Woe then to those who are kafir on account of the Day they have been promised!",
        "TRANSLATION_1": "Alas the woe for those who refuse to believe in the Day which has been promised them.\n",
        "TRANSLATION_2": "Woe, then, betide those who disbelieved in that Day of theirs which they are being asked to hold in dread.\n",
        "TRANSLATION_3": "Woe to the disbelievers when the day with which they have been threatened comes!\n",
        "TRANSLATION_4": "So ruin is for disbelievers, from their day – which they are promised.\n",
        "TRANSLATION_5": "Then woe to those who disbelieve from their Day which they have been promised.\n",
        "TRANSLATION_6": "Therefore woe to those who disbelieve because of their day which they are threatened with.\n",
        "TRANSLATION_7": "So woe to the unbelievers, for that day of theirs that they are promised.\n",
        "TRANSLATION_8": "And woe unto those who disbelieve, from (that) their day which they are promised.\n",
        "TRANSLATION_9": "woe, then, to those who are bent on denying the truth, when the Day arrives which they have been promised.\n",
        "TRANSLATION_10": "Woe, then, Unto those who disbelieve in their Day which they are promised.\n",
        "TRANSLATION_11": "Woe to the faithless for the day they are promised!\n",
        "TRANSLATION_12": "Woe, then, to the Unbelievers, on account of that Day of theirs which they have been promised!\n",
        "TRANSLATION_13": "Then, woe to those who disbelieve (in Allah and His Oneness Islamic Monotheism) from (that) their Day which they have been promised (for their punishment).\n",
        "TRANSLATION_14": "Woe then to the unbelievers for their Day which they were promised!\n",
        "TRANSLATION_15": "So woe to those who disbelieve because of that Day of theirs which they are promised.\n",
        "TRANSLATION_16": "And woe to those who have disbelieved from their Day which they are promised.\n",
        "TRANSLATION_17": "[51:60] For woe, a terrible chastisement [will come], to those who disbelieve, from, upon, that day of theirs which they are promised, that is, the Day of Resurrection.\n",
        "TRANSLATION_18": "And woe) severe punishment (unto those who disbelieve) in Muhammad (pbuh) and the Qur'an, (from (that) their day which they are promised) from the torment with which they are threatened and which was explained in surah the Mount (al-Tur)'. And of the surah in which the Mount is mentioned, which is all Meccan and consists of 49 verses, 812 words and 1,500 letters: Surah 52: The Mount (al-Tur) And of the surah in which the Mount is mentioned, which is all Meccan and consists of 49 verses, 812 words and 1,500 letters:\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "51:60",
            "43:83",
            "70:42",
            "52:45",
            "83:34",
            "7:14",
            "77:12",
            "15:36",
            "38:79",
            "38:53"
        ],
        "BIBLE": [
            "prophets:isaiah:10:3",
            "prophets:micah:7:12",
            "prophets:jeremiah:17:16",
            "writings:psalms:73:14",
            "prophets:jeremiah:9:24",
            "prophets:ii%20kings:20:17",
            "prophets:i%20samuel:29:3",
            "prophets:jeremiah:16:19",
            "prophets:ezekiel:22:4",
            "prophets:judges:21:6"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:4:11",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:5"
        ]
    }
}