{
    "VERSE": "54:1",
    "ARABIC": "بِسْمِ ٱللَّهِ ٱلرَّحْمَٰنِ ٱلرَّحِيمِ ٱقْتَرَبَتِ ٱلسَّاعَةُ وَٱنشَقَّ ٱلْقَمَرُ",
    "ENGLISH": {
        "TRANSLATION_0": "The Hour has drawn near and the moon has split.",
        "TRANSLATION_1": "THE HOUR HAS come and split is the moon.\n",
        "TRANSLATION_2": "The Hour of Resurrection drew near and the moon split asunder.\n",
        "TRANSLATION_3": "The Hour of Doom is drawing near and the moon is rent asunder.\n",
        "TRANSLATION_4": "The Last Day came near, and the moon split apart.\n",
        "TRANSLATION_5": "The Hour has drawn near, and the moon has been cleft asunder.\n",
        "TRANSLATION_6": "The hour drew nigh and the moon did rend asunder.\n",
        "TRANSLATION_7": "The Hour has drawn nigh: the moon is split.\n",
        "TRANSLATION_8": "The hour drew nigh and the moon was rent in twain.\n",
        "TRANSLATION_9": "The Last Hour draws near and the moon is split asunder.\n",
        "TRANSLATION_10": "The Hour hath drawn nigh, and the moon hath been rent in sunder.. And if they behold a sign, they turn away and say: magic continuous.\n",
        "TRANSLATION_11": "The Hour has drawn near and the moon is split.\n",
        "TRANSLATION_12": "The Hour (of Judgment) is nigh, and the moon is cleft asunder.\n",
        "TRANSLATION_13": "The Hour has drawn near, and the moon has been cleft asunder (the people of Makkah requested Prophet Muhammad SAW to show them a miracle, so he showed them the splitting of the moon).\n",
        "TRANSLATION_14": "The Hour is drawing near, and the moon is split (in two).\n",
        "TRANSLATION_15": "The Hour has drawn near, and the moon has split.\n",
        "TRANSLATION_16": "The Hour has come near, and the moon has split [in two].\n",
        "TRANSLATION_17": "[54:1] The Hour has drawn near, the Resurrection is close at hand, and the moon has split, it broke in two at [Mount] Abū Qubays and Qu‘ayqa‘ān, as a sign for the Prophet (s), for it had been demanded of him, and [when it took place] he said, ‘Bear witness [now]!’ — as reported by the two Shaykhs [al-Bukhārī and Muslim].\n",
        "TRANSLATION_18": "And from his narration on the authority of Ibn 'Abbas that he said in the interpretation of Allah's saying (The hour drew nigh): '(The hour drew nigh) He says: the coming of the Hour drew nigh by the advent of Muhammad (pbuh) and the coming down of the smock (and the moon was rent in twain) this is also another sign of the closeness of the Day of Judgement.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "54:1",
            "75:8",
            "84:18",
            "30:12",
            "75:9",
            "91:2",
            "30:14",
            "74:32",
            "25:11",
            "30:55"
        ],
        "BIBLE": [
            "torah:genesis:38:29",
            "prophets:judges:19:9",
            "prophets:i%20samuel:9:11",
            "torah:genesis:18:23",
            "prophets:isaiah:41:5",
            "prophets:ii%20kings:5:8",
            "prophets:joshua:8:11",
            "writings:ecclesiastes:12:1",
            "prophets:joshua:8:6",
            "prophets:ii%20kings:16:12"
        ]
    }
}