{
    "VERSE": "54:11",
    "ARABIC": "فَفَتَحْنَآ أَبْوَٰبَ ٱلسَّمَآءِ بِمَآءٍ مُّنْهَمِرٍ",
    "ENGLISH": {
        "TRANSLATION_0": "So We opened the gates of heaven with torrential water",
        "TRANSLATION_1": "And We opened up the flood gates of the sky with water pouring down in torrents,\n",
        "TRANSLATION_2": "Thereupon We opened the gates of the sky for water to pour down,\n",
        "TRANSLATION_3": "We opened the gates of the sky and water started to pour down.\n",
        "TRANSLATION_4": "We therefore opened the gates of heaven, with water flowing furiously.\n",
        "TRANSLATION_5": "So, We opened the gates of the heaven with water Munhamir.\n",
        "TRANSLATION_6": "So We opened the gates of the cloud with water pouring\n",
        "TRANSLATION_7": "Then We opened the gates of heaven unto water torrential,\n",
        "TRANSLATION_8": "Then opened We the gates of heaven with pouring water\n",
        "TRANSLATION_9": "So We opened the gates of the sky with water pouring down in torrents,\n",
        "TRANSLATION_10": "Then We opened the portals of heaven with water poured out.\n",
        "TRANSLATION_11": "Then We opened the gates of the sky with pouring waters,\n",
        "TRANSLATION_12": "So We opened the gates of heaven, with water pouring forth.\n",
        "TRANSLATION_13": "So We opened the gates of heaven with water pouring forth.\n",
        "TRANSLATION_14": "We opened the Gates of Heaven with torrential water\n",
        "TRANSLATION_15": "So We opened the floodgates of heaven with water pouring down.\n",
        "TRANSLATION_16": "Then We opened the gates of the heaven with rain pouring down\n",
        "TRANSLATION_17": "[54:11] Then We opened (read fa-fatahnā or fa-fattahnā) the gates of the heaven with torrential waters, [waters] pouring down intensely,\n",
        "TRANSLATION_18": "(Then opened We the gates of heaven) for 40 days (with pouring water) with pouring rain.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "54:11",
            "78:19",
            "15:14",
            "50:9",
            "80:25",
            "69:16",
            "43:11",
            "23:18",
            "69:11",
            "26:187"
        ],
        "BIBLE": [
            "writings:psalms:77:18",
            "torah:genesis:6:17",
            "prophets:isaiah:55:10",
            "writings:job:3:24",
            "writings:job:29:23",
            "writings:psalms:147:8",
            "writings:psalms:78:23",
            "torah:genesis:7:6",
            "writings:job:26:8",
            "prophets:ezekiel:47:8"
        ]
    }
}