{
    "VERSE": "54:12",
    "ARABIC": "وَفَجَّرْنَا ٱلْأَرْضَ عُيُونًا فَٱلْتَقَى ٱلْمَآءُ عَلَىٰٓ أَمْرٍ قَدْ قُدِرَ",
    "ENGLISH": {
        "TRANSLATION_0": "and made the earth burst forth with gushing springs. And the waters met together in a way which was decreed.",
        "TRANSLATION_1": "And We opened up the springs of the earth; and the waters met for a decreed end.\n",
        "TRANSLATION_2": "and We made the earth burst forth with springs, and all this water converged to fulfil that which had been decreed.\n",
        "TRANSLATION_3": "We caused the earth to burst forth with springs so that the waters could come together for a predestined purpose.\n",
        "TRANSLATION_4": "And caused springs to gush out from the earth, so that the two waters met totalling a quantity that had been destined.\n",
        "TRANSLATION_5": "And We caused springs to gush forth from the earth. So, the waters met for a matter predestined.\n",
        "TRANSLATION_6": "And We made water to flow forth in the land in springs, so the water gathered together according to a measure already ordained.\n",
        "TRANSLATION_7": "and made the earth to gush with fountains, and the waters met for a matter decreed.\n",
        "TRANSLATION_8": "And caused the earth to gush forth springs, so that the waters met for a predestined purpose.\n",
        "TRANSLATION_9": "and We caused the earth to burst with gushing springs: so that the waters met for a purpose which had been decreed.\n",
        "TRANSLATION_10": "And We made the earth break forth with springs; SO that the water met for an affair already decreed.\n",
        "TRANSLATION_11": "and We made the earth burst forth with springs, and the waters met for a preordained purpose.\n",
        "TRANSLATION_12": "And We caused the earth to gush forth with springs, so the waters met (and rose) to the extent decreed.\n",
        "TRANSLATION_13": "And We caused the earth to gush forth with springs. So the waters (of the heaven and the earth) met for a matter predestined.\n",
        "TRANSLATION_14": "and caused the earth to gush with springs, so that the waters met for a predestined matter.\n",
        "TRANSLATION_15": "And We made the earth burst with springs, and the waters met for a purpose already destined.\n",
        "TRANSLATION_16": "And caused the earth to burst with springs, and the waters met for a matter already predestined.\n",
        "TRANSLATION_17": "[54:12] and We made the earth burst forth with springs, that flowed forth, and the waters, the waters of the heaven and the earth, met for a purpose, a circumstance, that was preordained, [a matter] which had been decreed since pre-eternity, namely, their destruction by drowning.\n",
        "TRANSLATION_18": "(And caused the earth to gush forth springs) for 40 days, (so that the waters) of the heaven and the earth (met for a predestined purpose) met for a measure that We have appointed: the rain of heaven and the water of springs; it is also said that this means: the waters met for a decreed purpose to destroy the folk of Noah.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "54:12",
            "51:48",
            "11:44",
            "23:18",
            "3:109",
            "44:29",
            "57:5",
            "79:31",
            "8:44",
            "21:16"
        ],
        "BIBLE": [
            "prophets:isaiah:49:13",
            "writings:daniel:12:7",
            "torah:exodus:9:9",
            "prophets:isaiah:14:25",
            "prophets:isaiah:14:7",
            "prophets:jeremiah:1:14",
            "torah:numbers:31:16",
            "prophets:ezekiel:4:16",
            "torah:deuteronomy:31:20",
            "prophets:jeremiah:31:32"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:3:7",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:6:1"
        ]
    }
}