{
    "VERSE": "54:15",
    "ARABIC": "وَلَقَد تَّرَكْنَٰهَآ ءَايَةً فَهَلْ مِن مُّدَّكِرٍ",
    "ENGLISH": {
        "TRANSLATION_0": "We left it as a Sign. But is there any rememberer there?",
        "TRANSLATION_1": "And We left it as a sign. Is there anyone who will be warned?\n",
        "TRANSLATION_2": "And We left the Ark as a Sign. Is there, then, any who will take heed?\n",
        "TRANSLATION_3": "We made (the story of Noah) as evidence of the Truth. However, is there anyone who would take heed?\n",
        "TRANSLATION_4": "And We left it as a sign – so is there one who would ponder?\n",
        "TRANSLATION_5": "And indeed, We have left this as a sign. Then is there any that will remember\n",
        "TRANSLATION_6": "And certainly We left it as a sign, but is there anyone who\n",
        "TRANSLATION_7": "And We left it for a sign. Is there any that will remember?\n",
        "TRANSLATION_8": "And verily We left it as a token; but is there any that remembereth?\n",
        "TRANSLATION_9": "We have left this as a sign: but will anyone take heed?\n",
        "TRANSLATION_10": "And assuredly We left it for a sign. Is there then anyone who would be admonished?\n",
        "TRANSLATION_11": "Certainly We have left it as a sign; so is there anyone who will be admonished?\n",
        "TRANSLATION_12": "And We have left this as a Sign (for all time): then is there any that will receive admonition?\n",
        "TRANSLATION_13": "And indeed, We have left this as a sign, then is there any that will remember (or receive admonition)?\n",
        "TRANSLATION_14": "We have left it as a sign. Is there any that will remember?\n",
        "TRANSLATION_15": "And We left it as a sign. Is there anyone who would take heed?\n",
        "TRANSLATION_16": "And We left it as a sign, so is there any who will remember?\n",
        "TRANSLATION_17": "[54:15] And verily We left it, We preserved this [deed], as a sign, for whomever might be admonished by it, in other words, the news of this [deed] became widely-known and endured. So is there anyone who will remember?, [anyone who] will take heed from, or be admonished by, it? (muddakir is actually mudhtakir, but the tā’ has been replaced with a dāl, likewise the dhāl, and it [the dāl] has been assimilated with it [the other dāl]).\n",
        "TRANSLATION_18": "(And verily We left it as a token) as a sign for people, i.e. We left the ark of Noah, after the death of Noah, as a sign for people; it is also said that this means: We left the similitude of Noah as a sign for people; (but is there any that remembereth) is there any that will take admonition from what was done to the folk of Noah and, hence, desist from transgression?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "54:15",
            "15:81",
            "20:56",
            "54:51",
            "39:59",
            "23:30",
            "78:28",
            "43:47",
            "54:17",
            "54:22"
        ],
        "BIBLE": [
            "prophets:ezekiel:16:61",
            "prophets:ii%20samuel:20:18",
            "writings:ecclesiastes:4:13",
            "prophets:jeremiah:31:20",
            "torah:genesis:29:35",
            "prophets:jeremiah:5:3",
            "writings:daniel:2:8",
            "prophets:ii%20kings:5:26",
            "torah:deuteronomy:28:46",
            "prophets:i%20samuel:9:24"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:3:4",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:11"
        ]
    }
}