{
    "VERSE": "54:16",
    "ARABIC": "فَكَيْفَ كَانَ عَذَابِى وَنُذُرِ",
    "ENGLISH": {
        "TRANSLATION_0": "How terrible were My punishment and warnings!",
        "TRANSLATION_1": "How was then My punishment and My commination!\n",
        "TRANSLATION_2": "So how awesome were My chastisement and My warnings!\n",
        "TRANSLATION_3": "How terrible was My torment and the result of (their disregard) of My warning.\n",
        "TRANSLATION_4": "So how did My punishment turn out, and My threats?\n",
        "TRANSLATION_5": "Then how (terrible) was My torment and My warnings\n",
        "TRANSLATION_6": "How (great) was then My punishment and My warning!\n",
        "TRANSLATION_7": "How then were My chastisement and My warnings?\n",
        "TRANSLATION_8": "Then see how (dreadful) was My punishment after My warnings!\n",
        "TRANSLATION_9": "How terrible then was My punishment and My warning.\n",
        "TRANSLATION_10": "So how dreadful have been My torment and My warning!\n",
        "TRANSLATION_11": "So how were My punishment and warnings?\n",
        "TRANSLATION_12": "But how (terrible) was My Penalty and My Warning?\n",
        "TRANSLATION_13": "Then how (terrible) was My Torment and My Warnings?\n",
        "TRANSLATION_14": "How then were My punishment and My warnings!\n",
        "TRANSLATION_15": "So how were My punishment and My warnings?\n",
        "TRANSLATION_16": "And how [severe] were My punishment and warning.\n",
        "TRANSLATION_17": "[54:16] How [dreadful] then were My chastisement and My warnings? (this is an interrogative meant as an affirmative; kayfa, ‘how’, is the predicate of kāna, ‘was’, and it is here being used to inquire about a ‘state’; the intention is to prompt those who are being addressed to affirm the fact that God’s chastisement of those who denied Noah was fully deserved).\n",
        "TRANSLATION_18": "(Then see how (dreadful) was My punishment after My warnings!) See, Muhammad, how My punishment of these folk and how the state of those warned became, when Noah warned them but they rejected faith.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "54:16",
            "54:21",
            "54:30",
            "54:18",
            "54:39",
            "54:37",
            "67:17",
            "22:44",
            "15:89",
            "35:26"
        ],
        "BIBLE": [
            "prophets:jeremiah:44:22",
            "prophets:jeremiah:30:14",
            "prophets:isaiah:26:16",
            "writings:psalms:73:14",
            "writings:psalms:119:6",
            "prophets:isaiah:25:4",
            "prophets:habakkuk:1:7",
            "prophets:ezekiel:7:20",
            "torah:deuteronomy:10:17",
            "writings:daniel:3:33"
        ]
    }
}