{
    "VERSE": "54:18",
    "ARABIC": "كَذَّبَتْ عَادٌ فَكَيْفَ كَانَ عَذَابِى وَنُذُرِ",
    "ENGLISH": {
        "TRANSLATION_0": "'Ad denied the truth. How terrible were My punishment and warnings!",
        "TRANSLATION_1": "The 'Ad had also disavowed. How was then My punishment and My commination!\n",
        "TRANSLATION_2": "Ad also gave the lie (to Hud). So how awesome were My chastisement and My warnings!\n",
        "TRANSLATION_3": "The people of `Ad rejected Our guidance. How terrible was My torment and the result (of their disregard) of My warning.\n",
        "TRANSLATION_4": "The tribe of A’ad denied – so how did My punishment turn out, and My warnings?\n",
        "TRANSLATION_5": "`Ad denied; then how was My torment and My warnings\n",
        "TRANSLATION_6": "Ad treated (the truth) as a lie, so how (great) was My punishment and My warning!\n",
        "TRANSLATION_7": "Ad cried lies. How then were My chastisement and My warnings?\n",
        "TRANSLATION_8": "(The tribe of) A'ad rejected warnings. Then how (dreadful) was My punishment after My warnings.\n",
        "TRANSLATION_9": "The people of 'Ad too rejected the truth. How terrible was My punishment and My warning.\n",
        "TRANSLATION_10": "And there belied the 'A-ad; so how dreadful have been My torment and warning!\n",
        "TRANSLATION_11": "[The people of] ‘Ad impugned [their apostle]. So how were My punishment and warnings?\n",
        "TRANSLATION_12": "The 'Ad (people) (too) rejected (Truth): then how terrible was My Penalty and My Warning?\n",
        "TRANSLATION_13": "Ad (people) belied (their Prophet, Hud), then how (terrible) was My Torment and My Warnings?\n",
        "TRANSLATION_14": "Aad too belied. How then were My punishment and My warnings!\n",
        "TRANSLATION_15": "Aad denied the truth. So how were My punishment and My warnings?\n",
        "TRANSLATION_16": "Aad denied; and how [severe] were My punishment and warning.\n",
        "TRANSLATION_17": "[54:18] ‘Ād denied, their prophet Hūd and so they were chastised. How then were My chastisement and My warnings?, [how then was] My warning them of the chastisement before it was sent down? In other words, it was justified, and He explains this [chastisement] by saying:\n",
        "TRANSLATION_18": "((The tribe of) 'Aad rejected warnings) the folk of Hud denied Hud. (Then how dreadful) was My punishment after My warnings) see, Muhammad, how the state of those warned by Hud became when they disbelieved in him.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "54:18",
            "54:30",
            "54:16",
            "54:21",
            "54:39",
            "89:6",
            "54:37",
            "67:17",
            "22:44",
            "15:89"
        ],
        "BIBLE": [
            "writings:psalms:135:12",
            "writings:psalms:78:62",
            "writings:lamentations:1:11",
            "prophets:joshua:13:24",
            "prophets:joshua:13:15",
            "writings:ii%20chronicles:33:10",
            "prophets:joshua:14:3",
            "torah:numbers:20:24",
            "writings:ezra:3:11",
            "prophets:joshua:21:9"
        ]
    }
}