{
    "VERSE": "54:2",
    "ARABIC": "وَإِن يَرَوْا۟ ءَايَةً يُعْرِضُوا۟ وَيَقُولُوا۟ سِحْرٌ مُّسْتَمِرٌّ",
    "ENGLISH": {
        "TRANSLATION_0": "If they see a Sign they turn away, saying There is no end to this witchcraft!'",
        "TRANSLATION_1": "But if they see a sign they turn away, and say: \"This is the same old lie continuing,\"\n",
        "TRANSLATION_2": "(Regardless of any Signs these people see), they turn away and say: “This is an ongoing sorcery.”\n",
        "TRANSLATION_3": "Whenever they see a miracle, they turn away from it and say, \"This is just a powerful magic\".\n",
        "TRANSLATION_4": "And when they see a sign, they turn away and say, “Just a customary magic!”\n",
        "TRANSLATION_5": "And if they see an Ayah, they turn away and say: \"This is magic, Mustamir.\"\n",
        "TRANSLATION_6": "And if they see a miracle they turn aside and say: Transient magic.\n",
        "TRANSLATION_7": "Yet if they see a sign they turn away, and they say 'A continuous sorcery!'\n",
        "TRANSLATION_8": "And if they behold a portent they turn away and say: Prolonged illusion.\n",
        "TRANSLATION_9": "Yet, when they see a sign they [who deny the truth] turn their backs and say, \"The same old sorcery!\"\n",
        "TRANSLATION_10": "And if they behold a sign, they turn away and say: \"magic continous\"\n",
        "TRANSLATION_11": "If they see a sign, they turn away, and say, ‘An incessant magic!’\n",
        "TRANSLATION_12": "But if they see a Sign, they turn away, and say, \"This is (but) transient magic.\"\n",
        "TRANSLATION_13": "And if they see a sign, they turn away, and say: \"This is continuous magic.\"\n",
        "TRANSLATION_14": "Yet if they see a sign (the unbelievers) turn their backs and say: 'This is but a continuation of sorcery'\n",
        "TRANSLATION_15": "Yet whenever they see a miracle, they turn away, and say, “Continuous magic.”\n",
        "TRANSLATION_16": "And if they see a miracle, they turn away and say, \"Passing magic.\"\n",
        "TRANSLATION_17": "[54:2] And if they, the disbelievers among Quraysh, see a sign, a miracle of the Prophet (s), they turn away and say, this is: ‘A powerful sorcery!’ (mustamirr, ‘powerful’, derives from al-mirra, meaning ‘strength’; or it [mustamirr] means ‘incessant’).\n",
        "TRANSLATION_18": "(And if they behold a portent) like the splitting of the moon (they turn away) they deny the sign (and say:) this sign is nothing but (Prolonged illusion) which will vanish.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "54:2",
            "27:13",
            "37:15",
            "37:14",
            "78:28",
            "43:69",
            "51:18",
            "46:7",
            "15:81",
            "23:58"
        ],
        "BIBLE": [
            "prophets:joshua:7:8",
            "prophets:judges:20:8",
            "prophets:i%20kings:20:39",
            "prophets:jeremiah:36:16",
            "prophets:i%20samuel:10:9",
            "prophets:i%20kings:22:32",
            "writings:ruth:3:8",
            "prophets:i%20samuel:15:30",
            "prophets:isaiah:42:17",
            "torah:exodus:3:3"
        ]
    }
}