{
    "VERSE": "54:20",
    "ARABIC": "تَنزِعُ ٱلنَّاسَ كَأَنَّهُمْ أَعْجَازُ نَخْلٍ مُّنقَعِرٍ",
    "ENGLISH": {
        "TRANSLATION_0": "It plucked up men like uprooted stumps.",
        "TRANSLATION_1": "Which snatched away men as though they were palm trees pulled out by the roots.\n",
        "TRANSLATION_2": "which tore people away and hurled them as though they were trunks of uprooted palm-trees.\n",
        "TRANSLATION_3": "which hurled people around like uprooted trunks of palm-trees.\n",
        "TRANSLATION_4": "Smashing down men as if they were uprooted trunks of date palms.\n",
        "TRANSLATION_5": "Plucking out men as if they were uprooted stems of date palms.\n",
        "TRANSLATION_6": "Tearing men away as if they were the trunks of palm-trees torn up.\n",
        "TRANSLATION_7": "plucking up men as if they were stumps of uprooted palm-trees.\n",
        "TRANSLATION_8": "Sweeping men away as though they were uprooted trunks of palm-trees.\n",
        "TRANSLATION_9": "It swept people away as if they were trunks of uprooted palm trees.\n",
        "TRANSLATION_10": "Carrying men away as though they were trunks of palm-trees uprooted.\n",
        "TRANSLATION_11": "knocking down people as if they were trunks of uprooted palm trees.\n",
        "TRANSLATION_12": "Plucking out men as if they were roots of palm-trees torn up (from the ground).\n",
        "TRANSLATION_13": "Plucking out men as if they were uprooted stems of date-palms.\n",
        "TRANSLATION_14": "and snatched people up as though they were stumps of uprooted palmtrees.\n",
        "TRANSLATION_15": "Plucking the people away, as though they were trunks of uprooted palm-trees.\n",
        "TRANSLATION_16": "Extracting the people as if they were trunks of palm trees uprooted.\n",
        "TRANSLATION_17": "[54:20] tearing people away, wrenching them from the holes in the ground in which they had been embedded and flinging them down [to the ground] head first, thereby crushing their necks and severing [their] heads from [their] bodies, as if they were, [while lying] in this mentioned state, trunks of uprooted palm-trees, severed and thrown on the ground — they are likened to palm-trees because of their tallness (nakhlun, ‘palm-trees’, is masculine here but feminine in [sūrat] al-Hāqqa, nakhlun khāwiya, ‘fallen down [or hollow] palm-trees’, [Q. 69:7], in order to harmonise with the end-rhyme of the verses in both instances).\n",
        "TRANSLATION_18": "(Sweeping men away as though they were uprooted trunks of palm-trees.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "54:20",
            "83:2",
            "69:7",
            "21:61",
            "26:39",
            "21:1",
            "29:2",
            "99:6",
            "114:3",
            "114:2"
        ],
        "BIBLE": [
            "prophets:ii%20kings:24:14",
            "prophets:nahum:3:10",
            "prophets:ii%20kings:24:15",
            "prophets:i%20kings:8:46",
            "writings:ii%20chronicles:6:36",
            "prophets:jeremiah:52:28",
            "prophets:ii%20samuel:13:13",
            "torah:genesis:44:1",
            "writings:psalms:49:18",
            "torah:genesis:42:19"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:3:6",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:8",
            "Sefer%20Yetzirah:4:9"
        ]
    }
}