{
    "VERSE": "54:24",
    "ARABIC": "فَقَالُوٓا۟ أَبَشَرًا مِّنَّا وَٰحِدًا نَّتَّبِعُهُۥٓ إِنَّآ إِذًا لَّفِى ضَلَٰلٍ وَسُعُرٍ",
    "ENGLISH": {
        "TRANSLATION_0": "They said, 'Are we to follow a human being, one of us? Then we would truly be misguided, quite insane!",
        "TRANSLATION_1": "And said: \"Should we follow only one man among us? In that case we shall he in error and insane.\n",
        "TRANSLATION_2": "saying: “Are we to follow a single mortal, one from among ourselves? If we do that, we shall surely be in error and folly.\n",
        "TRANSLATION_3": "They said, \"Should we follow only one person among us. We shall be clearly in error and in trouble (if we do so).\n",
        "TRANSLATION_4": "So they said, “What! Shall we follow a man from among us? If we do, we are indeed astray, and insane!”\n",
        "TRANSLATION_5": "And they said: \"A man, alone among us -- shall we follow him Truly, then we should be in error and distress!\"\n",
        "TRANSLATION_6": "So they said: What! a single mortal from among us! Shall we follow him? Most surely we shall in that case be in sure error and distress:\n",
        "TRANSLATION_7": "and said, 'What, shall we follow a mortal, one out of ourselves? Then indeed we should be in error and insanity!\n",
        "TRANSLATION_8": "For they said; Is it a mortal man, alone among us, that we are to follow? Then indeed we should fall into error and madness.\n",
        "TRANSLATION_9": "they said, \"Are we to follow a man from amongst ourselves? We would surely then fall into error and madness.\n",
        "TRANSLATION_10": "And they said: a mere humanbeing from amongst us, and single! shall we follow him! verily then we should fall in error and madness.\n",
        "TRANSLATION_11": "and they said, ‘Are we to follow a lone human from ourselves?! Indeed then we would be in error and madness.’\n",
        "TRANSLATION_12": "For they said: \"What! a man! a Solitary one from among ourselves! shall we follow such a one? Truly should we then be straying in mind, and mad!\n",
        "TRANSLATION_13": "For they said: \"A man! Alone from among us, that we are to follow? Truly, then we should be in error and distress or madness!\"\n",
        "TRANSLATION_14": "They said: 'Are we to follow a mortal who is one of us? Then indeed, we would surely be in error and insane.\n",
        "TRANSLATION_15": "They said, “Are we to follow one of us, a human being? We would then go astray, and end up in Hell.\n",
        "TRANSLATION_16": "And said, \"Is it one human being among us that we should follow? Indeed, we would then be in error and madness.\n",
        "TRANSLATION_17": "[54:24] and they said, ‘Is it a mortal (basharan is in the accusative because it is governed [by a succeeding verb]) alone among us (minnā wāhidan are both adjectives of basharan) that we are to follow? (nattabi‘uhu, this explains the verb which renders it [basharan, ‘mortal’] accusative; the interrogative is meant as a negative, in other words: why should we follow him when there are many of us and he is only one among us and not a king? That is to say, we will not follow him). Then indeed, if we were to follow him, we would be in error, a parting with reason, and insanity!\n",
        "TRANSLATION_18": "(For they said: Is it a mortal man) he is a human being like us, (alone among us, that we are to follow) his matter and religion? (Then) if we follow him (indeed we should fall into error) in manifest error (and madness) tiredness and toil.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "54:24",
            "54:47",
            "30:51",
            "36:24",
            "12:8",
            "23:34",
            "42:18",
            "37:36",
            "41:6",
            "21:54"
        ],
        "BIBLE": [
            "prophets:ii%20kings:6:19",
            "prophets:judges:4:20",
            "torah:deuteronomy:31:17",
            "torah:genesis:44:4",
            "writings:nehemiah:6:11",
            "prophets:i%20samuel:9:6",
            "torah:genesis:32:20",
            "prophets:joshua:14:9",
            "prophets:ii%20samuel:2:27",
            "prophets:ii%20samuel:24:14"
        ]
    }
}