{
    "VERSE": "54:25",
    "ARABIC": "أَءُلْقِىَ ٱلذِّكْرُ عَلَيْهِ مِنۢ بَيْنِنَا بَلْ هُوَ كَذَّابٌ أَشِرٌ",
    "ENGLISH": {
        "TRANSLATION_0": "Has the Reminder been given to him of all of us? No indeed! He is an impudent liar.'",
        "TRANSLATION_1": "Was he the one of all of us to have been given the exposition? He is surely an impudent liar.\"\n",
        "TRANSLATION_2": "Was there none but he to whom the Reminder could be vouchsafed excluding all others? Nay; he is an insolent liar.”\n",
        "TRANSLATION_3": "How is it that he has received guidance? In fact, he is the most untruthfull and arrogant person\".\n",
        "TRANSLATION_4": "“What! Of all the men among us, the remembrance has come down upon him? In fact, he is a mischievous, great liar.”\n",
        "TRANSLATION_5": "Is it that the Reminder is sent to him alone from among us Nay, he is an insolent liar!\"\n",
        "TRANSLATION_6": "Has the reminder been made to light upon him from among us? Nay! he is an insolent liar!\n",
        "TRANSLATION_7": "Has the Reminder been cast upon him alone among us? Nay, rather he is an impudent liar.'\n",
        "TRANSLATION_8": "Hath the remembrance been given unto him alone among us? Nay, but he is a rash liar.\n",
        "TRANSLATION_9": "Has the [Divine] message been revealed to him alone of all of us? No, he is a boastful liar.\"\n",
        "TRANSLATION_10": "Hath the Admonition been laid upon him from amongst us! Aye! he is a liar insolent.\n",
        "TRANSLATION_11": "‘Has the Reminder been cast upon him from among us? No, he is a self-conceited liar.’\n",
        "TRANSLATION_12": "Is it that the Message is sent to him, of all people amongst us? Nay, he is a liar, an insolent one!\"\n",
        "TRANSLATION_13": "Is it that the Reminder is sent to him [Prophet Salih (Saleh)] alone from among us? Nay, he is an insolent liar!\"\n",
        "TRANSLATION_14": "Out of all of us has the Reminder been given to him alone? Rather, he is indeed an arrogant liar'\n",
        "TRANSLATION_15": "Was the message given to him, out of all of us? In fact, he is a wicked liar.”\n",
        "TRANSLATION_16": "Has the message been sent down upon him from among us? Rather, he is an insolent liar.\"\n",
        "TRANSLATION_17": "[54:25] Has the Reminder, the revelation, been cast (read a-ulqiya pronouncing both hamzas, or by not pronouncing the second one but in both cases inserting an intervening alif, or leaving this [insertion] out) upon him [alone] from among us?, in other words, nothing has been revealed to him. Nay, but he is a conceited, an arrogant and insolent, liar, in his saying that the mentioned has been revealed to him. God, exalted be He, says:\n",
        "TRANSLATION_18": "(Hath the remembrance) prophethood (been given unto him alone among us) when we are nobler than him? (Nay, but he is a rash liar) Salih is a vain liar who lies against Allah.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "54:25",
            "38:8",
            "54:26",
            "55:4",
            "38:4",
            "40:28",
            "6:53",
            "75:19",
            "10:50",
            "20:133"
        ],
        "BIBLE": [
            "prophets:jeremiah:44:20",
            "prophets:ii%20kings:4:43",
            "writings:ecclesiastes:6:10",
            "writings:ii%20chronicles:20:11",
            "writings:ii%20chronicles:19:6",
            "prophets:ezekiel:11:15",
            "torah:genesis:20:16",
            "prophets:isaiah:55:4",
            "prophets:jeremiah:35:15",
            "torah:exodus:11:3"
        ]
    }
}