{
    "VERSE": "54:28",
    "ARABIC": "وَنَبِّئْهُمْ أَنَّ ٱلْمَآءَ قِسْمَةٌۢ بَيْنَهُمْ كُلُّ شِرْبٍ مُّحْتَضَرٌ",
    "ENGLISH": {
        "TRANSLATION_0": "Inform them that the water is to be shared out between them, each drinking by turn.'",
        "TRANSLATION_1": "Tell them that the water is to be apportioned between them (and her); and every turn of drinking will be fixed (for each).\"\n",
        "TRANSLATION_2": "Let them know that the water should be divided between them and the she-camel, each availing their turn.”\n",
        "TRANSLATION_3": "Tell them that each one of them has the right to have a certain share of water\".\n",
        "TRANSLATION_4": "“And inform them that the water is to be shared between them; only those may come whose turn it is.”\n",
        "TRANSLATION_5": "And inform them that the water is to be shared between (her and) them, each one's right to drink being established (by turns).\n",
        "TRANSLATION_6": "And inform them that the water is shared between them; every share of the water shall be regulated.\n",
        "TRANSLATION_7": "And tell them that the water is to be divided between them, each drink for each in turn.\n",
        "TRANSLATION_8": "And inform them that the water is to be shared between (her and) them. Every drinking will be witnessed.\n",
        "TRANSLATION_9": "And tell them that the water [of the well] is to be divided between them, and that each one should drink in turn.\"\n",
        "TRANSLATION_10": "And declare thou Unto them that water hath been divided between them; every drinking shall be by turns.\n",
        "TRANSLATION_11": "Inform them that the water is to be shared between them; each of them showing up at his turn.’\n",
        "TRANSLATION_12": "And tell them that the water is to be divided between them: Each one's right to drink being brought forward (by suitable turns).\n",
        "TRANSLATION_13": "And inform them that the water is to be shared between (her and) them. Each one's right to drink being established (by turns).\n",
        "TRANSLATION_14": "Tell them that the water is to be divided between them, a drink each for them in turn'\n",
        "TRANSLATION_15": "And inform them that the water is to be shared between them; each share of drink made available.\n",
        "TRANSLATION_16": "And inform them that the water is shared between them, each [day of] drink attended [by turn].\n",
        "TRANSLATION_17": "[54:28] And inform them that the water is to be divided between them, and the She-camel: one day for them and the next for it, every drinking, [every] portion of water, will be attended’, by the people [drawing water] on their [designated] day, and by the She-camel on its day. They adhered to this [regime] but eventually became impatient with it and decided to slaughter the She-camel.\n",
        "TRANSLATION_18": "(And inform them that the water) of the well (is to be shared between (her and) them) one day for her and one day for them. (Every drinking will be witnessed) Salih informed them of this. They agreed to comply and observed this for a while but then their wretchedness overtook them.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "54:28",
            "21:93",
            "10:47",
            "37:5",
            "22:17",
            "25:48",
            "80:25",
            "21:16",
            "44:38",
            "16:10"
        ],
        "BIBLE": [
            "prophets:isaiah:41:22",
            "torah:genesis:24:14",
            "torah:genesis:26:32",
            "prophets:i%20kings:20:13",
            "prophets:ezekiel:38:8",
            "prophets:hosea:6:3",
            "writings:ii%20chronicles:25:16",
            "prophets:jeremiah:38:25",
            "prophets:jeremiah:32:7",
            "prophets:ezekiel:12:16"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:13",
            "Sefer%20Yetzirah:1:4",
            
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:3:3"
        ]
    }
}