{
    "VERSE": "54:34",
    "ARABIC": "إِنَّآ أَرْسَلْنَا عَلَيْهِمْ حَاصِبًا إِلَّآ ءَالَ لُوطٍ نَّجَّيْنَٰهُم بِسَحَرٍ",
    "ENGLISH": {
        "TRANSLATION_0": "We unleashed a sudden squall of stones against all of them, except the family of Lut, who We rescued before dawn.",
        "TRANSLATION_1": "We sent a stone-hurtling storm against them, except the family of Lot whom We saved in the early hours of the morning\n",
        "TRANSLATION_2": "and behold, We let loose upon them a tempest which rained stones upon them, except upon Lot's household whom We rescued in the last hours of the night\n",
        "TRANSLATION_3": "We sent down upon them a violent sandstorm (which destroyed them all) except for the family of Lot, whom We saved in the early morning by Our favor.\n",
        "TRANSLATION_4": "Indeed We sent a shower of stones upon them, except the family of Lut; We rescued them before dawn.\n",
        "TRANSLATION_5": "Verily, We sent against them Hasib (a violent storm of stones), except the family of Lut, them We saved in the last hour of the night,\n",
        "TRANSLATION_6": "Surely We sent upon them a stonestorm, except Lut's followers; We saved them a little before daybreak,\n",
        "TRANSLATION_7": "We loosed against them a squall of pebbles except the folk of Lot; We delivered them at the dawn --\n",
        "TRANSLATION_8": "Lo! We sent a storm of stones upon them (all) save the family of Lot, whom We rescued in the last watch of the night,\n",
        "TRANSLATION_9": "We sent a sandstorm against them which destroyed them all, except the family of Lot, whom We saved at the break of dawn,\n",
        "TRANSLATION_10": "Verily We! We sent upon them a gravel-storm save the household of Lut; them We delivered at early dawn.\n",
        "TRANSLATION_11": "We unleashed upon them a rain of stones, excepting the family of Lot, whom We delivered at dawn\n",
        "TRANSLATION_12": "We sent against them a violent Tornado with showers of stones, (which destroyed them), except Lut's household: them We delivered by early Dawn,-\n",
        "TRANSLATION_13": "Verily, We sent against them a violent storm of stones (which destroyed them all), except the family of Lout (Lot), whom We saved in last hour of the night,\n",
        "TRANSLATION_14": "We let loose on all of them a squall of claystones, except for the house of Lot whom We saved at dawn\n",
        "TRANSLATION_15": "We unleashed upon them a shower of stones, except for the family of Lot; We rescued them at dawn.\n",
        "TRANSLATION_16": "Indeed, We sent upon them a storm of stones, except the family of Lot - We saved them before dawn\n",
        "TRANSLATION_17": "[54:34] Indeed We unleashed upon them a squall of pebbles, a wind hurling at them pebbles, namely, small stones, a single one [of these] being no larger than the palm of the hand, and they were destroyed; [all] except the family of Lot, namely, his two daughters, together with him, whom We delivered at dawn, from among the dawns, the morning time of an unspecified day (had a specific day been meant [for that mentioned dawn], it [sahar] would have been treated as a diptote [instead of the declined form saharin], being a definite noun derived from al-sahar, for with definite nouns one ought to use [the preceding definite article] al). So was the squall unleashed at first with the family of Lot [still there]? There are two opinions regarding this: in the case of the former [that it was unleashed upon them including the family of Lot] the exception is understood as a continuous one, while in the case of the latter [opinion that they were delivered before the squall] the exception is understood as a discontinuous one, even if it [‘the family of Lot’] is actually subsumed by the collective noun [‘the people of Lot’, and so they were delivered] as a kindness [from God];\n",
        "TRANSLATION_18": "(Lo! We sent a storm of stones upon them (all) save the family of Lot) save Lot and his two daughters: Za'ura and Raytha, (whom We rescued in the last watch of the night) We rescued them at dawn,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "54:34",
            "15:59",
            "51:18",
            "28:36",
            "2:50",
            "27:56",
            "43:30",
            "37:15",
            "3:17",
            "15:61"
        ],
        "BIBLE": [
            "prophets:i%20samuel:19:11",
            "prophets:judges:6:15",
            "prophets:ii%20kings:19:11",
            "prophets:isaiah:37:11",
            "prophets:ii%20kings:22:5",
            "prophets:amos:9:8",
            "prophets:isaiah:28:2",
            "prophets:i%20kings:3:18",
            "prophets:ii%20samuel:16:8",
            "writings:psalms:134:1"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:5:1",
            
            "Sefer%20Yetzirah:3:4",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:14",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:2:1"
        ]
    }
}