{
    "VERSE": "54:35",
    "ARABIC": "نِّعْمَةً مِّنْ عِندِنَا كَذَٰلِكَ نَجْزِى مَن شَكَرَ",
    "ENGLISH": {
        "TRANSLATION_0": "It was a blessing direct from Our presence. That is how We recompense those who give thanks.",
        "TRANSLATION_1": "As a favour from Us. That is how We reward the grateful.\n",
        "TRANSLATION_2": "as a favour from Us. Thus do We reward those who give thanks.\n",
        "TRANSLATION_3": "Thus do We recompense the grateful ones.\n",
        "TRANSLATION_4": "As a reward from Us; this is how We reward one who gives thanks.\n",
        "TRANSLATION_5": "As a favor from Us. Thus do We reward him who gives thanks.\n",
        "TRANSLATION_6": "A favor from Us; thus do We reward him who gives thanks.\n",
        "TRANSLATION_7": "a blessing from Us; even so We recompense him who is thankful.\n",
        "TRANSLATION_8": "As grace from Us. Thus We reward him who giveth thanks.\n",
        "TRANSLATION_9": "as a blessing from Us: this is how We reward the thankful.\n",
        "TRANSLATION_10": "As a favour from us. Thus We recompense him who giveth thanks.\n",
        "TRANSLATION_11": "as a blessing from Us. Thus do We reward those who give thanks.\n",
        "TRANSLATION_12": "As a Grace from Us: thus do We reward those who give thanks.\n",
        "TRANSLATION_13": "As a Favour from Us, thus do We reward him who gives thanks (by obeying Us).\n",
        "TRANSLATION_14": "through Our Mercy. So it is that We recompense the thankful.\n",
        "TRANSLATION_15": "A blessing from Us. Thus We reward the thankful.\n",
        "TRANSLATION_16": "As favor from us. Thus do We reward he who is grateful.\n",
        "TRANSLATION_17": "[54:35] as a grace (ni‘matan is a verbal noun, that is to say in‘āman, ‘an act of grace’) from Us. So, like that requital, do We requite him who gives thanks, for Our graces and is a believer, or [it means] him who is a believer in God and His messenger and is obedient to both.\n",
        "TRANSLATION_18": "(As grace from Us) as mercy from Us. (Thus We reward him who gives thanks) thus We save he who believes in Our divine Oneness and gives thanks for Our bounty.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "54:35",
            "92:19",
            "44:5",
            "44:27",
            "68:34",
            "36:71",
            "39:34",
            "21:82",
            "26:22",
            "27:47"
        ],
        "BIBLE": [
            "writings:psalms:136:21",
            "torah:deuteronomy:16:17",
            "writings:ezra:3:11",
            "torah:genesis:28:4",
            "writings:psalms:124:6",
            "writings:psalms:45:7",
            "prophets:judges:1:15",
            "torah:genesis:39:21",
            "prophets:i%20kings:5:18",
            "writings:job:41:3"
        ]
    }
}