{
    "VERSE": "54:4",
    "ARABIC": "وَلَقَدْ جَآءَهُم مِّنَ ٱلْأَنۢبَآءِ مَا فِيهِ مُزْدَجَرٌ",
    "ENGLISH": {
        "TRANSLATION_0": "News has come to them which contains a threat:",
        "TRANSLATION_1": "Messages deterring them from evil had come to them,\n",
        "TRANSLATION_2": "Surely there came to them narratives (of the ancient nations) that should suffice to deter (them from transgression),\n",
        "TRANSLATION_3": "They have certainly received the kind of news in which there is a lesson and strong words of wisdom,\n",
        "TRANSLATION_4": "And indeed the news which had a lot of deterrence, came to them.\n",
        "TRANSLATION_5": "And indeed there has come to them news wherein there is Muzdajar.\n",
        "TRANSLATION_6": "And certainly some narratives have come to them wherein is prevention--\n",
        "TRANSLATION_7": "And there have come to them such tidings as contain a deterrent --\n",
        "TRANSLATION_8": "And surely there hath come unto them news whereof the purport should deter,\n",
        "TRANSLATION_9": "there has come to them many a tiding wherein there are warnings,\n",
        "TRANSLATION_10": "And assuredly there hath come Unto them tidings wherein is a deterrent.\n",
        "TRANSLATION_11": "There have already come to them reports containing admonishment,\n",
        "TRANSLATION_12": "There have already come to them Recitals wherein there is (enough) to check (them),\n",
        "TRANSLATION_13": "And indeed there has come to them news (in this Quran) wherein there is (enough warning) to check (them from evil),\n",
        "TRANSLATION_14": "Tidings containing a deterrent have come to them\n",
        "TRANSLATION_15": "And there came to them news containing a deterrent.\n",
        "TRANSLATION_16": "And there has already come to them of information that in which there is deterrence -\n",
        "TRANSLATION_17": "[54:4] And verily there has come to them such tidings, stories about the destruction of communities which denied their messengers, as contain a deterrent, to them (muzdajar is a verbal noun, or a noun of place; the dāl [of muzdajar] replaces the tā’ of [the 8th form] ifta‘ala; one may say, izdajartuhu or zajartuhu, to mean ‘I forbade him sternly’; mā, ‘such as’, either indicates a relative clause, or it is qualified by an adjective);\n",
        "TRANSLATION_18": "(And surely there hath come unto them) unto the people of Mecca in the Qur'an (news) of the nations of old, how they were destroyed when they disbelieved (whereof the purport should deter) and take admonition,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "54:4",
            "26:6",
            "37:112",
            "26:69",
            "15:24",
            "29:9",
            "43:7",
            "37:72",
            "20:99",
            "6:5"
        ],
        "BIBLE": [
            "prophets:jeremiah:46:1",
            "prophets:i%20kings:10:7",
            "prophets:jeremiah:38:27",
            "writings:ii%20chronicles:9:6",
            "writings:proverbs:2:1",
            "writings:nehemiah:6:6",
            "prophets:judges:16:16",
            "writings:esther:9:26",
            "writings:esther:4:9",
            "prophets:jeremiah:25:13"
        ]
    }
}