{
    "VERSE": "54:44",
    "ARABIC": "أَمْ يَقُولُونَ نَحْنُ جَمِيعٌ مُّنتَصِرٌ",
    "ENGLISH": {
        "TRANSLATION_0": "Or do they say, 'We are an assembly who will win'?",
        "TRANSLATION_1": "Or do they say: \"We are a well-accoutred army?\"\n",
        "TRANSLATION_2": "Or do they say: “We are a strong legion, strong enough for victory?”\n",
        "TRANSLATION_3": "Do they say, \"We shall be victorious because we are united?\"\n",
        "TRANSLATION_4": "Or they say, “We shall all take revenge as a group.”\n",
        "TRANSLATION_5": "Or say they: \"We are a great multitude, victorious\"\n",
        "TRANSLATION_6": "Or do they say: We are a host allied together to help each other?\n",
        "TRANSLATION_7": "Or do they say, 'We are a congregation that shall be succoured?'\n",
        "TRANSLATION_8": "Or say they: We are a host victorious?\n",
        "TRANSLATION_9": "Or do they say, \"We are a united group, and we are bound to prevail?\"\n",
        "TRANSLATION_10": "Or is it that they say: we are a multitude prevailing!\n",
        "TRANSLATION_11": "Do they say, ‘We are a confederate league’?\n",
        "TRANSLATION_12": "Or do they say: \"We acting together can defend ourselves\"?\n",
        "TRANSLATION_13": "Or do they say: \"We are a great multitude, and we shall be victorious?\"\n",
        "TRANSLATION_14": "Or do they say: 'We are a gathering that will be victorious'\n",
        "TRANSLATION_15": "Or do they say, “We are united, and we will be victorious”?\n",
        "TRANSLATION_16": "Or do they say, \"We are an assembly supporting [each other]\"?\n",
        "TRANSLATION_17": "[54:44] Or do they, the disbelievers of Quraysh, say: ‘We are a host that will be helped to victory’?, against Muhammad (s)? When Abū Jahl, on the day of Badr, said: ‘We are a host that will be helped to victory’, the following was revealed:\n",
        "TRANSLATION_18": "(Or say they) i.e. the disbelievers of Mecca: (We are a host victorious) and immune from punishment?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "54:44",
            "100:5",
            "26:56",
            "43:55",
            "4:71",
            "38:85",
            "54:45",
            "26:65",
            "11:55",
            "70:14"
        ],
        "BIBLE": [
            "writings:proverbs:5:14",
            "prophets:judges:21:5",
            "torah:numbers:16:3",
            "writings:ii%20chronicles:14:10",
            "writings:daniel:4:32",
            "torah:numbers:15:35",
            "writings:i%20chronicles:19:12",
            "torah:genesis:25:23",
            "prophets:judges:16:6",
            "writings:nehemiah:5:7"
        ]
    }
}