{
    "VERSE": "54:45",
    "ARABIC": "سَيُهْزَمُ ٱلْجَمْعُ وَيُوَلُّونَ ٱلدُّبُرَ",
    "ENGLISH": {
        "TRANSLATION_0": "The assembly will be routed and will turn their backs in flight.",
        "TRANSLATION_1": "The army will be routed and put to flight.\n",
        "TRANSLATION_2": "Soon shall this legion be routed and shall turn their backs and flee.\n",
        "TRANSLATION_3": "(Let them know that) this united group will soon run away in defeat.\n",
        "TRANSLATION_4": "The group will soon be routed, and will turn their backs to flee.\n",
        "TRANSLATION_5": "Their multitude will be put to flight, and they will show their backs.\n",
        "TRANSLATION_6": "Soon shall the hosts be routed, and they shall turn (their) backs.\n",
        "TRANSLATION_7": "Certainly the host shall be routed, and turn their backs.\n",
        "TRANSLATION_8": "The hosts will all be routed and will turn and flee.\n",
        "TRANSLATION_9": "The hosts shall soon be routed and they shall be put to flight.\n",
        "TRANSLATION_10": "Anon will their multitude be vanquished, and they will turn the back.\n",
        "TRANSLATION_11": "The league will be routed and turn its back [to flee].\n",
        "TRANSLATION_12": "Soon will their multitude be put to flight, and they will show their backs.\n",
        "TRANSLATION_13": "Their multitude will be put to flight, and they will show their backs.\n",
        "TRANSLATION_14": "Most certainly their gatherings shall be routed, and they will turn their backs.\n",
        "TRANSLATION_15": "The multitude will be defeated, and they will turn their backs.\n",
        "TRANSLATION_16": "[Their] assembly will be defeated, and they will turn their backs [in retreat].\n",
        "TRANSLATION_17": "[54:45] The host will [truly] be routed and turn its back [to flee], and so they were defeated at Badr and God’s Messenger (s) was granted victory over them.\n",
        "TRANSLATION_18": "(The hosts) the hosts of the disbelieving (will all be routed) on the Day of Badr (and will turn and flee) defeated; this refers to Abu Jahl and his host, some of whom were killed on the Day of Badr and others defeated.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "54:45",
            "54:44",
            "18:99",
            "59:12",
            "100:5",
            "107:7",
            "12:27",
            "70:14",
            "50:40",
            "47:27"
        ],
        "BIBLE": [
            "prophets:ii%20samuel:22:41",
            "prophets:isaiah:14:27",
            "prophets:joshua:7:8",
            "writings:psalms:18:41",
            "prophets:joshua:7:12",
            "writings:psalms:129:5",
            "torah:deuteronomy:2:27",
            "prophets:zechariah:13:7",
            "writings:psalms:70:3",
            "prophets:ezekiel:29:16"
        ]
    }
}