{
    "VERSE": "54:46",
    "ARABIC": "بَلِ ٱلسَّاعَةُ مَوْعِدُهُمْ وَٱلسَّاعَةُ أَدْهَىٰ وَأَمَرُّ",
    "ENGLISH": {
        "TRANSLATION_0": "In fact the Hour is their promised appointment and the Hour is more disastrous and bitter!",
        "TRANSLATION_1": "Surely the Hour will be the moment of their promise, and that moment will be calamitous and distressing.\n",
        "TRANSLATION_2": "Nay; the Hour of Doom is their appointed time, and the Hour shall be more calamitous and bitter.\n",
        "TRANSLATION_3": "In fact, the Hour of Doom is the time for them to suffer. The suffering of this hour is the most calamitous and the most bitter (of all suffering).\n",
        "TRANSLATION_4": "In fact their promise is upon the Last Day – and the Last Day is very severe and very bitter!\n",
        "TRANSLATION_5": "Nay, but the Hour is their appointed time, and the Hour will be more grievous and more bitter.\n",
        "TRANSLATION_6": "Nay, the hour is their promised time, and the hour shall be most grievous and bitter.\n",
        "TRANSLATION_7": "Nay, but the Hour is their tryst, and the Hour is very calamitous and bitter.\n",
        "TRANSLATION_8": "Nay, but the Hour (of doom) is their appointed tryst, and the Hour will be more wretched and more bitter (than their earthly failure).\n",
        "TRANSLATION_9": "Indeed, the Hour of Doom is their appointed time, and the Last Hour will be the most severe, and the most bitter.\n",
        "TRANSLATION_10": "Aye! the Hour is their appointed term, and the Hour shall be far more grievous and far more bitter.\n",
        "TRANSLATION_11": "Indeed, the Hour is their tryst; and the Hour will be most calamitous and bitter.\n",
        "TRANSLATION_12": "Nay, the Hour (of Judgment) is the time promised them (for their full recompense): And that Hour will be most grievous and most bitter.\n",
        "TRANSLATION_13": "Nay, but the Hour is their appointed time (for their full recompense), and the Hour will be more grievous and more bitter.\n",
        "TRANSLATION_14": "Rather, the Hour is their encounter. And that Hour will be most calamitous and bitter.\n",
        "TRANSLATION_15": "The Hour is their appointed time—the Hour is more disastrous, and most bitter.\n",
        "TRANSLATION_16": "But the Hour is their appointment [for due punishment], and the Hour is more disastrous and more bitter.\n",
        "TRANSLATION_17": "[54:46] Nay, but the Hour is their tryst, for chastisement, and the Hour, that is, the chastisement thereat, will be more calamitous, greater in affliction, and more bitter, than the chastisement of this world.\n",
        "TRANSLATION_18": "(Nay, but the Hour (of doom)) the advent of the Hour (is their appointed tryst) of punishment, (and the Hour) of punishment (will be more wretched) more tremendous (and more bitter) than the punishment they suffered on the Day of Badr.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "54:46",
            "54:1",
            "30:14",
            "25:11",
            "30:12",
            "34:30",
            "30:55",
            "21:9",
            "18:59",
            "21:49"
        ],
        "BIBLE": [
            "writings:job:34:23",
            "writings:proverbs:19:19",
            "writings:job:9:19",
            "writings:ecclesiastes:8:6",
            "writings:psalms:10:5",
            "writings:ecclesiastes:8:5",
            "torah:exodus:9:18",
            "writings:daniel:11:29",
            "writings:daniel:11:27",
            "prophets:habakkuk:2:3"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:3:4",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:1:7"
        ]
    }
}