{
    "VERSE": "54:49",
    "ARABIC": "إِنَّا كُلَّ شَىْءٍ خَلَقْنَٰهُ بِقَدَرٍ",
    "ENGLISH": {
        "TRANSLATION_0": "We have created all things in due measure.",
        "TRANSLATION_1": "We have indeed created all things by measure;\n",
        "TRANSLATION_2": "We have created everything in a determined measure.\n",
        "TRANSLATION_3": "We have created everything to fulfill a certain purpose.\n",
        "TRANSLATION_4": "We have indeed created all things by a proper measure.\n",
        "TRANSLATION_5": "Verily, We have created all things with Qadar.\n",
        "TRANSLATION_6": "Surely We have created everything according to a measure.\n",
        "TRANSLATION_7": "Surely We have created everything in measure.\n",
        "TRANSLATION_8": "Lo! We have created every thing by measure.\n",
        "TRANSLATION_9": "We have created everything in due measure;\n",
        "TRANSLATION_10": "Veriiy everything! We have created it by a measure.\n",
        "TRANSLATION_11": "Indeed We have created everything in a measure,\n",
        "TRANSLATION_12": "Verily, all things have We created in proportion and measure.\n",
        "TRANSLATION_13": "Verily, We have created all things with Qadar (Divine Preordainments of all things before their creation, as written in the Book of Decrees Al-Lauh Al-Mahfuz).\n",
        "TRANSLATION_14": "Indeed, We have created all things according to a measure.\n",
        "TRANSLATION_15": "Everything We created is precisely measured.\n",
        "TRANSLATION_16": "Indeed, all things We created with predestination.\n",
        "TRANSLATION_17": "[54:49] Truly everything (read inna kulla shay’in is [in the accusative as a] dependent clause because of a verb governing it) have We created in a measure, by ordainment (bi-qadarin, ‘in a measure’, is a circumstantial qualifier referring to kulla, ‘every’, in other words, ‘[already] predetermined’; a variant reading [for kulla] has [nominative] kullu as the subject, the predicate of which is khalaqnāhu, ‘We have created’).\n",
        "TRANSLATION_18": "(Lo! We have created every thing) of your works (by measure) by you rejected this. This verse was revealed about those who argued about destiny.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "54:49",
            "67:1",
            "48:21",
            "22:6",
            "78:29",
            "41:54",
            "11:4",
            "18:84",
            "20:50",
            "3:26"
        ],
        "BIBLE": [
            "writings:daniel:11:36",
            "prophets:jeremiah:25:13",
            "prophets:hosea:8:12",
            "torah:deuteronomy:29:20",
            "prophets:ezekiel:40:35",
            "prophets:joshua:8:34",
            "prophets:joshua:1:17",
            "writings:esther:9:32",
            "prophets:ii%20kings:23:24",
            "prophets:ii%20kings:22:13"
        ]
    }
}