{
    "VERSE": "54:50",
    "ARABIC": "وَمَآ أَمْرُنَآ إِلَّا وَٰحِدَةٌ كَلَمْحٍۭ بِٱلْبَصَرِ",
    "ENGLISH": {
        "TRANSLATION_0": "Our command is only one word, like the blinking of an eye.",
        "TRANSLATION_1": "And Our command is but one (word) swift as the winking of an eye.\n",
        "TRANSLATION_2": "Our command consists of only one Word which is carried out in the twinkling of an eye.\n",
        "TRANSLATION_3": "It takes only a single command from Us (to bring the Day of Judgment) and that can be achieved within the twinkling of an eye.\n",
        "TRANSLATION_4": "And Our command is only a fleeting one – like the batting of an eyelid.\n",
        "TRANSLATION_5": "And Our commandment is but one as the twinkling of an eye.\n",
        "TRANSLATION_6": "And Our command is but one, as the twinkling of an eye.\n",
        "TRANSLATION_7": "Our commandment is but one word, as the twinkling of an eye.\n",
        "TRANSLATION_8": "And Our commandment is but one (commandment), as the twinkling of an eye.\n",
        "TRANSLATION_9": "We command but once: Our will is done in the twinkling of an eye;\n",
        "TRANSLATION_10": "And Our commandment shall be but one, as the twinkling of an eye.\n",
        "TRANSLATION_11": "and Our command is but a single [word], like the twinkling of an eye.\n",
        "TRANSLATION_12": "And Our Command is but a single (Act),- like the twinkling of an eye.\n",
        "TRANSLATION_13": "And Our Commandment is but one, as the twinkling of an eye.\n",
        "TRANSLATION_14": "And Our Order is but one word like the flashing of an eye.\n",
        "TRANSLATION_15": "And Our command is but once, like the twinkling of an eye.\n",
        "TRANSLATION_16": "And Our command is but one, like a glance of the eye.\n",
        "TRANSLATION_17": "[54:50] And Our command, for a thing which We want to bring into existence, is but a single word, like the twinkling of an eye, in terms of speed, and this is the saying of kun, ‘Be’, whereat it comes into existence. His command, when He wills a thing, is just to say to it ‘Be’, and it is [Q. 36:82].\n",
        "TRANSLATION_18": "(And Our commandment) concerning the coming of the Hour (is but one (commandment)) is but one word, (as the twinkling of an eye) in its swiftness. It is also said that (We have created every thing) means: We 631 have created for everything something similar to it and also that which agrees with it of clothes and things.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "54:50",
            "53:17",
            "16:77",
            "21:27",
            "17:85",
            "6:110",
            "40:44",
            "37:59",
            "31:28",
            "28:44"
        ],
        "BIBLE": [
            "prophets:joshua:4:3",
            "torah:genesis:50:25",
            "prophets:joshua:4:8",
            "prophets:jeremiah:52:9",
            "prophets:joel:4:5",
            "prophets:ii%20kings:25:6",
            "prophets:jeremiah:28:3",
            "prophets:i%20samuel:30:2",
            "torah:exodus:13:19",
            "writings:ii%20chronicles:24:11"
        ]
    }
}