{
    "VERSE": "54:51",
    "ARABIC": "وَلَقَدْ أَهْلَكْنَآ أَشْيَاعَكُمْ فَهَلْ مِن مُّدَّكِرٍ",
    "ENGLISH": {
        "TRANSLATION_0": "We destroyed those of your kind in the past. But is there any rememberer there?",
        "TRANSLATION_1": "We have destroyed the likes of you in the past: So is there any one who will be warned?\n",
        "TRANSLATION_2": "We did indeed destroy many like you. Is there, then, any who will heed?\n",
        "TRANSLATION_3": "We destroyed many people like you (disbelievers) but is there anyone who would take heed (of Our warning)?\n",
        "TRANSLATION_4": "And We have indeed destroyed your kind, so is there one who would ponder?\n",
        "TRANSLATION_5": "And indeed, We have destroyed your likes; then is there any that will remember\n",
        "TRANSLATION_6": "And certainly We have already destroyed the likes of you, but is there anyone who will mind?\n",
        "TRANSLATION_7": "We have destroyed the likes of you; is there any that will remember?\n",
        "TRANSLATION_8": "And verily We have destroyed your fellows; but is there any that remembereth?\n",
        "TRANSLATION_9": "We have indeed destroyed many a people like you. Is there anyone who would receive admonition?\n",
        "TRANSLATION_10": "And assuredly We have destroyed your likes; so is there any one who shall be admonished?\n",
        "TRANSLATION_11": "Certainly We have destroyed your likes. So is there anyone who will be admonished?\n",
        "TRANSLATION_12": "And (oft) in the past, have We destroyed gangs like unto you: then is there any that will receive admonition?\n",
        "TRANSLATION_13": "And indeed, We have destroyed your likes, then is there any that will remember (or receive admonition)?\n",
        "TRANSLATION_14": "And We destroyed those like you, is there any that will remember!\n",
        "TRANSLATION_15": "We have destroyed your likes. Is there anyone who would ponder?\n",
        "TRANSLATION_16": "And We have already destroyed your kinds, so is there any who will remember?\n",
        "TRANSLATION_17": "[54:51] And verily We have destroyed the likes of you, the likes of you in terms of disbelief, from among past communities. So is there anyone who will remember? (this is an interrogative meant as an imperative, that is to say, ‘Remember and be admonished!’).\n",
        "TRANSLATION_18": "(And verily We have destroyed your fellows) We have destroyed the like of you and those who followed your religion, people of Mecca; (but is there any that remembereth) is there any that takes admonition from what was done with them and, thus, desist from transgression?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "54:51",
            "54:15",
            "15:24",
            "37:83",
            "15:10",
            "54:40",
            "54:32",
            "54:22",
            "54:17",
            "37:72"
        ],
        "BIBLE": [
            "prophets:jeremiah:31:20",
            "torah:deuteronomy:27:18",
            "writings:ezra:6:12",
            "writings:psalms:81:9",
            "prophets:ezekiel:16:61",
            "prophets:jeremiah:37:12",
            "torah:exodus:19:12",
            "torah:exodus:8:5",
            "prophets:micah:5:7",
            "prophets:isaiah:8:11"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:3:6",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:1:5"
        ]
    }
}