{
    "VERSE": "54:52",
    "ARABIC": "وَكُلُّ شَىْءٍ فَعَلُوهُ فِى ٱلزُّبُرِ",
    "ENGLISH": {
        "TRANSLATION_0": "Everything they did is in the Books.",
        "TRANSLATION_1": "All things they do are (recorded) in the books;\n",
        "TRANSLATION_2": "All their deeds are recorded in the Scrolls;\n",
        "TRANSLATION_3": "Whatever they have done has been recorded in the Books (records of the deeds).\n",
        "TRANSLATION_4": "And all what they did is in the Books.\n",
        "TRANSLATION_5": "And everything they have done is noted in Az-Zubur.\n",
        "TRANSLATION_6": "And everything they have done is in the writings.\n",
        "TRANSLATION_7": "Every thing that they have done is in the Scrolls,\n",
        "TRANSLATION_8": "And every thing they did is in the scriptures,\n",
        "TRANSLATION_9": "All their deeds are recorded in their books:\n",
        "TRANSLATION_10": "And everything they have wrought is in the Writs.\n",
        "TRANSLATION_11": "Everything they have done is in the books,\n",
        "TRANSLATION_12": "All that they do is noted in (their) Books (of Deeds):\n",
        "TRANSLATION_13": "And each and everything they have done is noted in (their) Records (of deeds).\n",
        "TRANSLATION_14": "All their deeds are in the Scrolls,\n",
        "TRANSLATION_15": "Everything they have done is in the Books.\n",
        "TRANSLATION_16": "And everything they did is in written records.\n",
        "TRANSLATION_17": "[54:52] And everything they, that is, servants, have done is, recorded, in the scrolls, the books of the Guardian Angels (al-hafaza),\n",
        "TRANSLATION_18": "(And every thing they did) of transgression in their state of idolatry and opposition of the prophets (is in the Scriptures) written down; and it is said this means: it is written in the Guarded Tablet. This also was revealed about those who disputed about fate.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "54:52",
            "15:19",
            "18:84",
            "78:29",
            "36:12",
            "51:49",
            "67:1",
            "54:49",
            "32:7",
            "41:54"
        ],
        "BIBLE": [
            "prophets:i%20kings:16:20",
            "prophets:joshua:7:15",
            "writings:psalms:98:1",
            "torah:genesis:34:7",
            "prophets:jeremiah:48:30",
            "torah:deuteronomy:17:4",
            "prophets:isaiah:26:12",
            "prophets:ii%20kings:17:11",
            "prophets:i%20kings:11:41",
            "prophets:isaiah:40:17"
        ]
    }
}