{
    "VERSE": "54:54",
    "ARABIC": "إِنَّ ٱلْمُتَّقِينَ فِى جَنَّٰتٍ وَنَهَرٍ",
    "ENGLISH": {
        "TRANSLATION_0": "The people who have taqwa will be amid Gardens and Rivers,",
        "TRANSLATION_1": "Surely those who fear God and follow the straight path will be amidst gardens and light,\n",
        "TRANSLATION_2": "Surely those who shun disobedience will dwell amidst Gardens and running streams\n",
        "TRANSLATION_3": "The pious ones will live in Paradise wherein streams flow,\n",
        "TRANSLATION_4": "Indeed the pious are amidst Gardens and springs.\n",
        "TRANSLATION_5": "Verily, those who have Taqwa, will be in the midst of Gardens and Rivers.\n",
        "TRANSLATION_6": "Surely those who guard (against evil) shall be in gardens and rivers,\n",
        "TRANSLATION_7": "Surely the godfearing shall dwell amid gardens and a river\n",
        "TRANSLATION_8": "Lo! the righteous will dwell among gardens and rivers,\n",
        "TRANSLATION_9": "The God-conscious will find themselves in gardens and rivers,\n",
        "TRANSLATION_10": "Verily the God-fearing will be in Gardens and among rivers.\n",
        "TRANSLATION_11": "Indeed the Godwary will be amid gardens and streams,\n",
        "TRANSLATION_12": "As to the Righteous, they will be in the midst of Gardens and Rivers,\n",
        "TRANSLATION_13": "Verily, The Muttaqun (pious), will be in the midst of Gardens and Rivers (Paradise).\n",
        "TRANSLATION_14": "Indeed, the cautious shall live amid gardens and a river,\n",
        "TRANSLATION_15": "The righteous will be amidst gardens and rivers.\n",
        "TRANSLATION_16": "Indeed, the righteous will be among gardens and rivers,\n",
        "TRANSLATION_17": "[54:54] Assuredly the God-fearing will be amid gardens, orchards, and rivers (the collective noun is meant here; a variant reading [for nahar] has the plural nuhur, similar [in form] to asad, ‘lion’, [plural] usud), the meaning being that they will drink from its rivers water milk, honey and wine;\n",
        "TRANSLATION_18": "(Lo! the righteous) those who ward off disbelief, idolatry and indecencies (will dwell among Gardens and rivers) many rivers; and it is said: in vast meadows,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "54:54",
            "15:45",
            "52:17",
            "51:15",
            "10:9",
            "22:14",
            "26:90",
            "17:91",
            "88:10",
            "69:22"
        ],
        "BIBLE": [
            "prophets:zephaniah:3:5",
            "prophets:zechariah:8:8",
            "writings:ii%20chronicles:16:9",
            "writings:psalms:104:10",
            "writings:proverbs:6:18",
            "prophets:amos:8:12",
            "writings:proverbs:4:18",
            "prophets:zechariah:4:10",
            "prophets:ezekiel:22:7",
            "prophets:nahum:2:5"
        ]
    }
}