{
    "VERSE": "54:55",
    "ARABIC": "فِى مَقْعَدِ صِدْقٍ عِندَ مَلِيكٍ مُّقْتَدِرٍۭ",
    "ENGLISH": {
        "TRANSLATION_0": "on seats of honour in the presence of an Ail-Powerful King.",
        "TRANSLATION_1": "At the still centre in the proximity of the King all-powerful.\n",
        "TRANSLATION_2": "where they will be honourably seated in the presence of a King, Mighty in Power.\n",
        "TRANSLATION_3": "honorably seated in the presence of the All-dominant King.\n",
        "TRANSLATION_4": "Seated in an assembly of the Truth, in the presence of Allah, the Omnipotent King.\n",
        "TRANSLATION_5": "In a seat of truth, near the Muqtadir King.\n",
        "TRANSLATION_6": "In the seat of honor with a most Powerful King.\n",
        "TRANSLATION_7": "in a sure abode, in the presence of a King Omnipotent.\n",
        "TRANSLATION_8": "Firmly established in the favour of a Mighty King.\n",
        "TRANSLATION_9": "in the seat of truth with an all-powerful sovereign.\n",
        "TRANSLATION_10": "In a good seat, near a Sovereign Omnipotent.\n",
        "TRANSLATION_11": "in the abode of truthfulness with an omnipotent King.\n",
        "TRANSLATION_12": "In an Assembly of Truth, in the Presence of a Sovereign Omnipotent.\n",
        "TRANSLATION_13": "In a seat of truth (i.e. Paradise), near the Omnipotent King (Allah, the All-Blessed, the Most High, the Owner of Majesty and Honour).\n",
        "TRANSLATION_14": "in a secure abode, in the presence of the Powerful King.\n",
        "TRANSLATION_15": "In an assembly of virtue, in the presence of an Omnipotent King.\n",
        "TRANSLATION_16": "In a seat of honor near a Sovereign, Perfect in Ability.\n",
        "TRANSLATION_17": "[54:55] in an abode of truth, a place of truth, wherein there is no idle talk or cause for sin — (the collective noun [maq‘ad] is meant here; a variant reading has maqā‘id, ‘abodes’), in other words, they are in congregations in Paradise that are free from idle talk and cause for sin, in contrast to the congregations of this world, which are rarely free from such things (syntactically, this statement is considered a second predicate and also a substitution; it [the ‘abode’] may be understood as being ‘one of truth’ regardless of whether one reads the substitution as being of the part [for the whole] or otherwise); before a King (malīk: this form is hyperbolic, that is to say, One of a mighty and vast kingdom) [Who is] Omnipotent, Powerful, Whom nothing can thwart, namely, God, exalted be He (‘inda indicates [glorious] rank and closeness to His bounty, exalted be He). Meccan, except for verse 29, which is Medinese; it consists of 76 or 78 verses.\n",
        "TRANSLATION_18": "(Firmly established) they are in an honoured place in Paradise (in the favour of a Mighty King) Who is able to dispense both reward and punishment to His slaves'. And of the surah in which the Beneficent is mentioned, which is all Meccan and consists of 78 verses, 351 words and 1,636 letters: Surah 55: The Beneficent (al-Rahman) And of the surah in which the Beneficent is mentioned, which is all Meccan and consists of 78 verses, 351 words and 1,636 letters:\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "54:55",
            "20:52",
            "92:19",
            "50:17",
            "53:14",
            "51:34",
            "10:2",
            "37:168",
            "26:84",
            "19:50"
        ],
        "BIBLE": [
            "writings:proverbs:29:14",
            "writings:psalms:21:8",
            "prophets:i%20kings:2:45",
            "writings:daniel:11:25",
            "writings:psalms:2:6",
            "writings:proverbs:16:12",
            "writings:proverbs:25:5",
            "writings:ii%20chronicles:9:8",
            "writings:daniel:4:21",
            "writings:daniel:5:18"
        ]
    }
}