{
    "VERSE": "54:6",
    "ARABIC": "فَتَوَلَّ عَنْهُمْ يَوْمَ يَدْعُ ٱلدَّاعِ إِلَىٰ شَىْءٍ نُّكُرٍ",
    "ENGLISH": {
        "TRANSLATION_0": "Turn away from them then. On the Day the Summoner summons them to something unspeakably terrible,",
        "TRANSLATION_1": "So turn away from them. When on the Day the crier calls to the painful business,\n",
        "TRANSLATION_2": "So turn away from them, (O Prophet). On the Day when a caller shall call them to a thing most terrible,\n",
        "TRANSLATION_3": "(Muhammad), leave them alone. On the day when they will be called to a terrible punishment,\n",
        "TRANSLATION_4": "Therefore turn away from them; on the day when the announcer will call towards a severe unknown matter –\n",
        "TRANSLATION_5": "So withdraw from them. The Day that the caller will call (them) to a terrible thing.\n",
        "TRANSLATION_6": "So turn (your) back on them (for) the day when the inviter shall invite them to a hard task,\n",
        "TRANSLATION_7": "So turn thou away from them. Upon the day when the Caller shall call unto a horrible thing,\n",
        "TRANSLATION_8": "So withdraw from them (O Muhammad) on the day when the Summoner summoneth unto a painful thing.\n",
        "TRANSLATION_9": "so ignore them. On the Day when the Crier will call out about a horrible event,\n",
        "TRANSLATION_10": "Wherefore withdrew thou from them. The Day whereon the sum- moner Will summon mankind Unto a thing unpleasant.\n",
        "TRANSLATION_11": "So turn away from them! The day when the Caller calls to a dire thing,\n",
        "TRANSLATION_12": "Therefore, (O Prophet,) turn away from them. The Day that the Caller will call (them) to a terrible affair,\n",
        "TRANSLATION_13": "So (O Muhammad SAW) withdraw from them. The Day that the caller will call (them) to a terrible thing.\n",
        "TRANSLATION_14": "Therefore, turn away from them. On the Day when the Caller summons them to a terrible thing,\n",
        "TRANSLATION_15": "So turn away from them. On the Day when the Caller calls to something terrible.\n",
        "TRANSLATION_16": "So leave them, [O Muhammad]. The Day the Caller calls to something forbidding,\n",
        "TRANSLATION_17": "[54:6] So turn away from them! (this is the import of the preceding statement and it completes what is being said). On the day when the Summoner, namely, Isrāfīl (yawma, ‘the day’, is rendered accusative by yakhrujūna, ‘they will emerge’, next [verse]), summons to an awful thing (read nukur or nukr, in the sense of munkar, ‘disagreeable’), [a thing] which the souls will find awful, and this is the Reckoning;\n",
        "TRANSLATION_18": "(So withdraw from them) so turn away from them, Muhammad-but he was later commanded to fight them-(on the day) which is the Day of Judgement (when the Summoner summoneth unto a painful thing) a tremendous and frightful thing whereby the dwellers of Paradise will be taken to Paradise and the dwellers of hell to hell.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "54:6",
            "52:46",
            "83:34",
            "44:41",
            "36:54",
            "51:13",
            "7:14",
            "79:6",
            "15:36",
            "38:79"
        ],
        "BIBLE": [
            "writings:lamentations:5:21",
            "writings:lamentations:5:22",
            "prophets:isaiah:12:1",
            "writings:esther:9:26",
            "writings:ii%20chronicles:7:14",
            "prophets:jeremiah:34:15",
            "torah:exodus:3:4",
            "prophets:jeremiah:14:9",
            "writings:psalms:88:10",
            "prophets:ezekiel:20:29"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:11",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:4"
        ]
    }
}