{
    "VERSE": "54:7",
    "ARABIC": "خُشَّعًا أَبْصَٰرُهُمْ يَخْرُجُونَ مِنَ ٱلْأَجْدَاثِ كَأَنَّهُمْ جَرَادٌ مُّنتَشِرٌ",
    "ENGLISH": {
        "TRANSLATION_0": "they will emerge from their graves with downcast eyes, like swarming locusts,",
        "TRANSLATION_1": "They will come out of the graves with downcast eyes like an expanding swarm of locusts.\n",
        "TRANSLATION_2": "with down-cast eyes they shall go forth from their graves, as though they were scattered locusts.\n",
        "TRANSLATION_3": "they will come out of their graves, their eyes cast down, hastening towards their Summoner as locusts rushing about.\n",
        "TRANSLATION_4": "They will come out from the graves with eyes lowered, as if they were spread locusts.\n",
        "TRANSLATION_5": "They will come forth, with humbled eyes from (their) graves as if they were locusts spread abroad,\n",
        "TRANSLATION_6": "Their eyes cast down, going forth from their graves as if they were scattered locusts,\n",
        "TRANSLATION_7": "abasing their eyes, they shall come forth from the tombs as if they were scattered grasshoppers,\n",
        "TRANSLATION_8": "With downcast eyes, they come forth from the graves as they were locusts spread abroad,\n",
        "TRANSLATION_9": "with downcast eyes they shall come out of their graves, as if they were locusts milling about\n",
        "TRANSLATION_10": "With looks downcast they will come forth, from the tombs, as though they were locusts scattered abroad.\n",
        "TRANSLATION_11": "they will emerge from the graves as if they were scattered locusts with a humbled look [in their eyes],\n",
        "TRANSLATION_12": "They will come forth,- their eyes humbled - from (their) graves, (torpid) like locusts scattered abroad,\n",
        "TRANSLATION_13": "They will come forth, with humbled eyes from (their) graves as if they were locusts spread abroad,\n",
        "TRANSLATION_14": "their eyes will be humbled as they come out from their graves as if they were scattered locusts,\n",
        "TRANSLATION_15": "Their eyes humiliated, they will emerge from the graves, as if they were swarming locusts.\n",
        "TRANSLATION_16": "Their eyes humbled, they will emerge from the graves as if they were locusts spreading,\n",
        "TRANSLATION_17": "[54:7] with their downcast (khāshi‘an: a variant reading has khushsha‘an), humiliated, looks (absāruhum is a circumstantial qualifier referring to the subject of the verb [yakhrujūna, ‘they will emerge’]) they, that is, mankind, will emerge from the graves as though they were scattered locusts, not knowing where to go, out of fear and perplexity (this sentence [ka’annahum jarādun muntashirun] is a circumstantial qualifier referring to the subject of [the verb] yakhrujūna, ‘they will emerge’, and so is His saying [muhti‘īna]),\n",
        "TRANSLATION_18": "(With downcast eyes) humbled, (they come forth from the graves) upon the first blow of the Trumpet (as they were locusts spread abroad) He says: they fall on each other like locusts,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "54:7",
            "70:43",
            "36:51",
            "68:43",
            "79:9",
            "75:7",
            "20:35",
            "53:17",
            "38:63",
            "68:51"
        ],
        "BIBLE": [
            "torah:exodus:10:14",
            "writings:job:7:8",
            "torah:exodus:9:29",
            "prophets:ii%20kings:2:21",
            "prophets:ezekiel:6:9",
            "writings:psalms:77:18",
            "writings:psalms:121:8",
            "prophets:i%20samuel:11:10",
            "writings:psalms:109:23",
            "torah:exodus:9:33"
        ]
    }
}