{
    "VERSE": "54:8",
    "ARABIC": "مُّهْطِعِينَ إِلَى ٱلدَّاعِ يَقُولُ ٱلْكَٰفِرُونَ هَٰذَا يَوْمٌ عَسِرٌ",
    "ENGLISH": {
        "TRANSLATION_0": "necks outstretched, eyes transfixed, rushing headlong to the Summoner. The kuffar will say, This is a pitiless day!'",
        "TRANSLATION_1": "They will hasten forward to the caller, gazes fixed. And the unbelievers will say: \"This is the day of untold woe.\"\n",
        "TRANSLATION_2": "They shall be hurrying forth towards the caller, and the unbelievers (who had once denied this Day), will say: “This is a woeful Day.”\n",
        "TRANSLATION_3": "These disbelievers will say, \"This is a hard day\".\n",
        "TRANSLATION_4": "Rushing towards the caller; the disbelievers will say, “This is a tough day.”\n",
        "TRANSLATION_5": "Hastening towards the caller. The disbelievers will say: \"This is a hard Day.\"\n",
        "TRANSLATION_6": "Hastening to the inviter. The unbelievers shall say: This is a hard day.\n",
        "TRANSLATION_7": "running with outstretched necks to the Caller. The unbelievers shall say, 'This is a hard day!'\n",
        "TRANSLATION_8": "Hastening toward the summoner; the disbelievers say: This is a hard day.\n",
        "TRANSLATION_9": "hastening towards the Crier. Those who deny the truth will cry, \"This is such a hard day!\"\n",
        "TRANSLATION_10": "Hastening toward the summoner. The infidels will say: this is a day diffrcult.\n",
        "TRANSLATION_11": "scrambling toward the summoner. The faithless will say, ‘This is a hard day!’\n",
        "TRANSLATION_12": "Hastening, with eyes transfixed, towards the Caller!- \"Hard is this Day!\", the Unbelievers will say.\n",
        "TRANSLATION_13": "Hastening towards the caller, the disbelievers will say: \"This is a hard Day.\"\n",
        "TRANSLATION_14": "running (with their necks extended) to the Caller. The unbelievers will say: 'This is indeed a harsh Day'\n",
        "TRANSLATION_15": "Scrambling towards the Caller, the disbelievers will say, “This is a difficult Day.”\n",
        "TRANSLATION_16": "Racing ahead toward the Caller. The disbelievers will say, \"This is a difficult Day.\"\n",
        "TRANSLATION_17": "[54:8] scrambling, hastening with their necks stretched out, toward the Summoner. The disbelievers, among them, will say: ‘This is a hard day!’, a difficult one for disbelievers — as is stated in [sūrat] al-Muddaththir, a day of hardship for the disbelievers [Q. 74:9-10].\n",
        "TRANSLATION_18": "(Hastening towards the Summoner) to find out about what he is going to command them; (the disbelievers say) on the Day of Judgement: (This is a hard day) on them, that is. 627\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "54:8",
            "74:9",
            "86:9",
            "19:85",
            "38:53",
            "79:6",
            "85:2",
            "30:12",
            "7:14",
            "25:26"
        ],
        "BIBLE": [
            "prophets:hosea:2:9",
            "prophets:zechariah:4:10",
            "prophets:judges:13:10",
            "writings:ii%20chronicles:16:9",
            "prophets:i%20samuel:8:11",
            "prophets:i%20kings:1:5",
            "torah:numbers:11:27",
            "torah:leviticus:15:13",
            "writings:proverbs:6:18",
            "prophets:i%20kings:19:20"
        ]
    }
}