{
    "VERSE": "83:12",
    "ARABIC": "وَمَا يُكَذِّبُ بِهِۦٓ إِلَّا كُلُّ مُعْتَدٍ أَثِيمٍ",
    "ENGLISH": {
        "TRANSLATION_0": "No one denies it except for every evil aggressor.",
        "TRANSLATION_1": "None denies it but the sinful transgressors.\n",
        "TRANSLATION_2": "Yet none gives the lie to it except the transgressor immersed in sin;\n",
        "TRANSLATION_3": "No one rejects it except the sinful transgressors\n",
        "TRANSLATION_4": "And none will deny it, except every transgressor, rebel.\n",
        "TRANSLATION_5": "And none can deny it except every transgressor beyond bounds, the sinner!\n",
        "TRANSLATION_6": "And none gives the lie to it but every exceeder of limits, sinful one\n",
        "TRANSLATION_7": "and none cries lies to it but every guilty aggressor.\n",
        "TRANSLATION_8": "Which none denieth save each criminal transgressor,\n",
        "TRANSLATION_9": "No one denies it except for the evil aggressor.\n",
        "TRANSLATION_10": "And none belieth it save each trespasser, sinner.\n",
        "TRANSLATION_11": "and none denies it except every sinful transgressor.\n",
        "TRANSLATION_12": "And none can deny it but the Transgressor beyond bounds the Sinner!\n",
        "TRANSLATION_13": "And none can deny it except every transgressor beyond bounds, (in disbelief, oppression and disobedience of Allah, the sinner!)\n",
        "TRANSLATION_14": "None belies it except every guilty sinner.\n",
        "TRANSLATION_15": "But none denies it except the sinful aggressor.\n",
        "TRANSLATION_16": "And none deny it except every sinful transgressor.\n",
        "TRANSLATION_17": "[83:12] and none deny it but every sinful (the form [athīm] is hyperbolic) transgressor, overstepping the bounds.\n",
        "TRANSLATION_18": "(Which none denieth) i.e. none denies the Day of Judgement (save each criminal transgressor) save each sinful and unjust person who transgresses against the Truth, such as al-Walid Ibn al-Mughirah al-Makhzumi,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "83:12",
            "26:222",
            "45:7",
            "7:112",
            "2:276",
            "6:67",
            "50:32",
            "10:79",
            "6:120",
            "64:11"
        ],
        "BIBLE": [
            "prophets:i%20kings:5:18",
            "writings:psalms:86:16",
            "writings:job:15:19",
            "prophets:judges:21:14",
            "writings:psalms:16:7",
            "writings:psalms:111:5",
            "writings:psalms:60:6",
            "prophets:i%20samuel:11:3",
            "prophets:i%20kings:21:20",
            "writings:psalms:106:15"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:2:3",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:5:1"
        ]
    }
}