{
    "VERSE": "83:13",
    "ARABIC": "إِذَا تُتْلَىٰ عَلَيْهِ ءَايَٰتُنَا قَالَ أَسَٰطِيرُ ٱلْأَوَّلِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "When Our Signs are recited to him, he says, 'Just myths and legends of the previous peoples!'",
        "TRANSLATION_1": "When Our revelations are recited before him, he says: \"These are fables of long ago.\"\n",
        "TRANSLATION_2": "who, when Our verses are recited to him, says: “Mere tales of olden times!”\n",
        "TRANSLATION_3": "who, when listening to Our revelations, say, \"These are only ancient legends\".\n",
        "TRANSLATION_4": "When you recite Our verses to him, he says, “Stories of earlier men!”\n",
        "TRANSLATION_5": "When Our Ayat are recited to him, he says: \"Tales of the ancients!\"\n",
        "TRANSLATION_6": "When Our communications are recited to him, he says: Stories of those of yore.\n",
        "TRANSLATION_7": "When our signs are recited to him, he says, 'Fairy-tales of the ancients!'\n",
        "TRANSLATION_8": "Who, when thou readest unto him Our revelations, saith: (Mere) fables of the men of old.\n",
        "TRANSLATION_9": "When Our revelations are conveyed to him, he says, \"Fables of the ancients!\"\n",
        "TRANSLATION_10": "And when Our revelations are rehearsed Unto him, she saith:'fables of the ancients!\n",
        "TRANSLATION_11": "When Our signs are recited to him, he says, ‘Myths of the ancients!’\n",
        "TRANSLATION_12": "When Our Signs are rehearsed to him, he says, \"Tales of the ancients!\"\n",
        "TRANSLATION_13": "When Our Verses (of the Quran) are recited to him he says: \"Tales of the ancients!\"\n",
        "TRANSLATION_14": "When Our verses are recited to him, he says: 'Fictitious tales of the ancients'\n",
        "TRANSLATION_15": "When Our revelations are recited to him, he says, “Legends of the ancients.”\n",
        "TRANSLATION_16": "When Our verses are recited to him, he says, \"Legends of the former peoples.\"\n",
        "TRANSLATION_17": "[83:13] When Our signs, [of] the Qur’ān, are recited to him, he says, ‘[Mere] fables (asātīr) of the ancients!’, [mere] tales that were written down (sutirat) in ancient times (asātīr is the plural of ustūra or istāra).\n",
        "TRANSLATION_18": "(Who, when thou readest unto him) unto al-Walid Ibn al-Mughirah (Our revelations) the Qur'an explaining the commands and prohibitions, (saith: (Mere) fables of the men of old) this is nothing but the lies and idle talk of the people of old. 739\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "83:13",
            "68:15",
            "8:31",
            "16:24",
            "25:5",
            "6:25",
            "27:68",
            "23:83",
            "38:29",
            "26:51"
        ],
        "BIBLE": [
            "prophets:i%20kings:20:8",
            "prophets:i%20kings:20:42",
            "prophets:isaiah:29:11",
            "torah:exodus:8:5",
            "torah:numbers:11:16",
            "prophets:ii%20kings:4:16",
            "torah:exodus:12:33",
            "prophets:ezekiel:12:27",
            "torah:numbers:11:21",
            "prophets:i%20samuel:24:10"
        ]
    }
}