{
    "VERSE": "83:14",
    "ARABIC": "كَلَّا بَلْ رَانَ عَلَىٰ قُلُوبِهِم مَّا كَانُوا۟ يَكْسِبُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "No indeed! Rather what they have earned has rusted up their hearts.",
        "TRANSLATION_1": "No. In fact what they have been doing has rusted their hearts.\n",
        "TRANSLATION_2": "No indeed! The truth is that their hearts have become rusted on account of their evil deeds.\n",
        "TRANSLATION_3": "They will never have faith. In fact, their hearts are stained from their deeds.\n",
        "TRANSLATION_4": "Not at all – but rather their earnings have heaped rust upon their hearts.\n",
        "TRANSLATION_5": "Nay! But on their hearts is the Ran (covering) which they used to earn.\n",
        "TRANSLATION_6": "Nay! rather, what they used to do has become like rust upon their hearts.\n",
        "TRANSLATION_7": "No indeed; but that they were earning has rusted upon their hearts.\n",
        "TRANSLATION_8": "Nay, but that which they have earned is rust upon their hearts.\n",
        "TRANSLATION_9": "No! Their own deeds have cast a veil over their hearts.\n",
        "TRANSLATION_10": "By no means!' Aye! encrusted upon their hearts is that which they have been earning.\n",
        "TRANSLATION_11": "No, that is not the case! Rather, their hearts have been sullied by what they have been earning.\n",
        "TRANSLATION_12": "By no means! but on their hearts is the stain of the (ill) which they do!\n",
        "TRANSLATION_13": "Nay! But on their hearts is the Ran (covering of sins and evil deeds) which they used to earn.\n",
        "TRANSLATION_14": "No indeed! Their own deeds have cast a veil over their hearts.\n",
        "TRANSLATION_15": "Not at all. Their hearts have become corroded by what they used to earn.\n",
        "TRANSLATION_16": "No! Rather, the stain has covered their hearts of that which they were earning.\n",
        "TRANSLATION_17": "[83:14]   No indeed! — a deterrent and a warning against saying such [things]. Rather there has slayed, engulfed, their hearts, covering them like rust that which they earned, of acts of disobedience.\n",
        "TRANSLATION_18": "(Nay) truly, Muhammad, (but that which they have earned) which they have done and said in their state of idolatry (is rust upon their hearts) Allah has sealed the hearts of those who disbelieve in the Day of Judgement; it is also said that the accumulation of sins blackens the heart and this is what is meant by the rust of hearts.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "83:14",
            "26:194",
            "30:59",
            "5:113",
            "63:3",
            "15:12",
            "85:19",
            "26:200",
            "22:35",
            "13:28"
        ],
        "BIBLE": [
            "writings:proverbs:6:18",
            "writings:psalms:119:32",
            "writings:ii%20chronicles:16:9",
            "prophets:ezekiel:28:16",
            "writings:nehemiah:3:37",
            "writings:psalms:91:4",
            "prophets:isaiah:25:7",
            "torah:numbers:4:20",
            "prophets:amos:8:12",
            "torah:exodus:10:5"
        ]
    }
}