{
    "VERSE": "83:15",
    "ARABIC": "كَلَّآ إِنَّهُمْ عَن رَّبِّهِمْ يَوْمَئِذٍ لَّمَحْجُوبُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "No indeed! Rather that Day they will be veiled from their Lord.",
        "TRANSLATION_1": "Therefore they will be screened off from their Lord that day,\n",
        "TRANSLATION_2": "No indeed! On that Day they will be screened off from seeing their Lord,\n",
        "TRANSLATION_3": "On the Day of Judgment, they will certainly be barred from the mercy of their Lord.\n",
        "TRANSLATION_4": "Yes indeed – they will be deprived of seeing their Lord on that day.\n",
        "TRANSLATION_5": "Nay! Surely, they will be veiled from seeing their Lord that Day.\n",
        "TRANSLATION_6": "Nay! most surely they shall on that day be debarred from their Lord.\n",
        "TRANSLATION_7": "No indeed; but upon that day they shall be veiled from their Lord,\n",
        "TRANSLATION_8": "Nay, but surely on that day they will be covered from (the mercy of) their Lord.\n",
        "TRANSLATION_9": "Indeed! On that Day a barrier will be set between them and their Lord,\n",
        "TRANSLATION_10": "By no means! Verily on that Day from their Lord they will be shut Out.\n",
        "TRANSLATION_11": "Indeed, they will be alienated from their Lord on that day.\n",
        "TRANSLATION_12": "Verily, from (the Light of) their Lord, that Day, will they be veiled.\n",
        "TRANSLATION_13": "Nay! Surely, they (evil-doers) will be veiled from seeing their Lord that Day.\n",
        "TRANSLATION_14": "No indeed, on that Day they shall be veiled from their Lord.\n",
        "TRANSLATION_15": "Not at all. On that Day, they will be screened from their Lord.\n",
        "TRANSLATION_16": "No! Indeed, from their Lord, that Day, they will be partitioned.\n",
        "TRANSLATION_17": "[83:15] Nay!, verily, they, on that day, the Day of Resurrection, will be screened off from their Lord, and so they will not see Him.\n",
        "TRANSLATION_18": "(Nay) truly, Muhammad, (but surely on that day) the Day of Judgement (they) i.e. the deniers of the Day of Judgement (will be covered from (the mercy of) their Lord) they will be prevented from beholding their Lord while the believers will behold Him.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "83:15",
            "100:11",
            "36:16",
            "43:14",
            "7:125",
            "37:31",
            "75:12",
            "26:12",
            "26:62",
            "85:12"
        ],
        "BIBLE": [
            "prophets:isaiah:60:2",
            "prophets:ezekiel:24:7",
            "torah:deuteronomy:30:15",
            "prophets:joshua:24:7",
            "torah:numbers:4:8",
            "prophets:i%20kings:2:24",
            "torah:genesis:38:15",
            "prophets:ezekiel:32:7",
            "writings:job:3:16",
            "writings:psalms:104:9"
        ]
    }
}