{
    "VERSE": "83:24",
    "ARABIC": "تَعْرِفُ فِى وُجُوهِهِمْ نَضْرَةَ ٱلنَّعِيمِ",
    "ENGLISH": {
        "TRANSLATION_0": "You will recognise in their faces the radiance of delight.",
        "TRANSLATION_1": "On their faces you will see the glow of beatitude.\n",
        "TRANSLATION_2": "You shall see upon their faces the glow of bliss.\n",
        "TRANSLATION_3": "You can trace on their faces the joy of their bliss.\n",
        "TRANSLATION_4": "You will recognise the freshness of serenity on their faces.\n",
        "TRANSLATION_5": "You will recognize in their faces the brightness of delight.\n",
        "TRANSLATION_6": "You will recognize in their faces the brightness of bliss.\n",
        "TRANSLATION_7": "thou knowest in their faces the radiancy of bliss\n",
        "TRANSLATION_8": "Thou wilt know in their faces the radiance of delight.\n",
        "TRANSLATION_9": "You will find in their faces the brightness of bliss.\n",
        "TRANSLATION_10": "Thou wilt recognize in their faces the brightness of delight.\n",
        "TRANSLATION_11": "You will perceive in their faces the freshness of bliss.\n",
        "TRANSLATION_12": "Thou wilt recognise in their faces the beaming brightness of Bliss.\n",
        "TRANSLATION_13": "You will recognise in their faces the brightness of delight.\n",
        "TRANSLATION_14": "and in their faces you shall know the radiance of bliss.\n",
        "TRANSLATION_15": "You will recognize on their faces the radiance of bliss.\n",
        "TRANSLATION_16": "You will recognize in their faces the radiance of pleasure.\n",
        "TRANSLATION_17": "[83:24] You will perceive in their faces the radiancy of bliss, the splendour and beauty of blissfulness,\n",
        "TRANSLATION_18": "(Thou wilt know) Muhammad (in their faces) the faces of the inhabitants of Paradise (the radiance of delight 740\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "83:24",
            "23:104",
            "37:43",
            "56:12",
            "44:27",
            "54:48",
            "26:85",
            "31:8",
            "52:17",
            "83:22"
        ],
        "BIBLE": [
            "writings:i%20chronicles:29:17",
            "writings:psalms:16:11",
            "torah:genesis:18:28",
            "writings:ecclesiastes:3:12",
            "writings:psalms:51:18",
            "prophets:isaiah:47:8",
            "prophets:hosea:2:22",
            "torah:exodus:33:12",
            "writings:job:34:33",
            "prophets:i%20kings:2:9"
        ]
    }
}