{
    "VERSE": "83:26",
    "ARABIC": "خِتَٰمُهُۥ مِسْكٌ وَفِى ذَٰلِكَ فَلْيَتَنَافَسِ ٱلْمُتَنَٰفِسُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "whose seal is musk - let people with aspiration aspire to that! -",
        "TRANSLATION_1": "With a sealing of musk, which those who aspire for the best should desire, --\n",
        "TRANSLATION_2": "whose seal is musk – so let all aspirants aspire after that –\n",
        "TRANSLATION_3": "which have the fragrance of musk. This is the kind of place for which one should really aspire.\n",
        "TRANSLATION_4": "Its seal is upon musk; and for this should those who crave be eager.\n",
        "TRANSLATION_5": "Sealed with musk, and for this let those strive who want to strive.\n",
        "TRANSLATION_6": "The sealing of it is (with) musk; and for that let the aspirers aspire.\n",
        "TRANSLATION_7": "whose seal is musk -- so after that let the strivers strive --\n",
        "TRANSLATION_8": "Whose seal is musk - for this let (all) those strive who strive for bliss -\n",
        "TRANSLATION_9": "its seal will be of musk -- for this let the aspirants aspire --\n",
        "TRANSLATION_10": "The seal thereof will be of musk and to this end let the aspirers aspire -\n",
        "TRANSLATION_11": "whose seal is musk—for such let the viers vie—\n",
        "TRANSLATION_12": "The seal thereof will be Musk: And for this let those aspire, who have aspirations:\n",
        "TRANSLATION_13": "The last thereof (that wine) will be the smell of musk, and for this let (all) those strive who want to strive (i.e. hasten earnestly to the obedience of Allah).\n",
        "TRANSLATION_14": "its seal is musk, for this let the competitors compete;\n",
        "TRANSLATION_15": "Whose seal is musk—this is what competitors should compete for.\n",
        "TRANSLATION_16": "The last of it is musk. So for this let the competitors compete.\n",
        "TRANSLATION_17": "[83:26] whose seal is musk, that is, whose final sip is followed by an emanating scent of musk — so for such [bliss] let the viers vie, let them desire to apply themselves to obedience of God —\n",
        "TRANSLATION_18": "(Whose seal) whose end result (is musk. For this) for what I have mentioned (let (all) those who strive for bliss) let those who work and those who strive and those who hasten and those who take the initiative take the initiative.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "83:26",
            "96:17",
            "80:24",
            "37:61",
            "21:88",
            "26:94",
            "37:110",
            "83:21",
            "26:46",
            "51:35"
        ],
        "BIBLE": [
            "writings:daniel:1:5",
            "torah:exodus:28:7",
            "prophets:nahum:1:8",
            "writings:psalms:9:7",
            "prophets:i%20samuel:21:3",
            "torah:genesis:27:28",
            "writings:ii%20chronicles:6:40",
            "writings:nehemiah:2:3",
            "prophets:ii%20samuel:17:12",
            "prophets:ezekiel:47:11"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:2:4"
        ]
    }
}