{
    "VERSE": "83:29",
    "ARABIC": "إِنَّ ٱلَّذِينَ أَجْرَمُوا۟ كَانُوا۟ مِنَ ٱلَّذِينَ ءَامَنُوا۟ يَضْحَكُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Those who did evil used to laugh at those who had iman.",
        "TRANSLATION_1": "The sinners indeed laughed at believers\n",
        "TRANSLATION_2": "Behold, the wicked were wont to laugh at the believers:\n",
        "TRANSLATION_3": "The sinners had been laughing at the believers.\n",
        "TRANSLATION_4": "Indeed the guilty used to laugh at the believers.\n",
        "TRANSLATION_5": "Verily, those who committed crimes used to laugh at those who believed.\n",
        "TRANSLATION_6": "Surely they who are guilty used to laugh at those who believe.\n",
        "TRANSLATION_7": "Behold, the sinners were laughing at the believers,\n",
        "TRANSLATION_8": "Lo! the guilty used to laugh at those who believed,\n",
        "TRANSLATION_9": "The wicked used to laugh at the believers --\n",
        "TRANSLATION_10": "Veriiy those who have sinned were wont at those who had believed to laugh,\n",
        "TRANSLATION_11": "Indeed the guilty used to laugh at the faithful,\n",
        "TRANSLATION_12": "Those in sin used to laugh at those who believed,\n",
        "TRANSLATION_13": "Verily! (During the worldly life) those who committed crimes used to laugh at those who believed.\n",
        "TRANSLATION_14": "The sinners laughed at the believers\n",
        "TRANSLATION_15": "Those who committed crimes used to laugh at those who believed.\n",
        "TRANSLATION_16": "Indeed, those who committed crimes used to laugh at those who believed.\n",
        "TRANSLATION_17": "[83:29] Verily the guilty, like Abū Jahl and his ilk, used to laugh at the believers, such as ‘Ammār [b. Yāsir] and Bilāl [the Ethiopian] and those like them, in mockery of them;\n",
        "TRANSLATION_18": "(Lo! the guilty) the idolaters, Abu Jahl and his host (used to laugh at those who believed) used to mock and poke fun at 'AN and his fellow believers,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "83:29",
            "7:76",
            "70:39",
            "107:6",
            "52:12",
            "26:153",
            "26:185",
            "8:59",
            "85:19",
            "7:15"
        ],
        "BIBLE": [
            "writings:proverbs:10:16",
            "torah:numbers:32:23",
            "prophets:ezekiel:33:15",
            "prophets:ezekiel:18:21",
            "torah:deuteronomy:21:22",
            "torah:numbers:35:31",
            "prophets:i%20samuel:20:1",
            "writings:proverbs:12:10",
            "prophets:ezekiel:33:16",
            "torah:numbers:17:3"
        ]
    }
}