{
    "VERSE": "83:3",
    "ARABIC": "وَإِذَا كَالُوهُمْ أَو وَّزَنُوهُمْ يُخْسِرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "but when they give them a measure or weight, hand over less than is due.",
        "TRANSLATION_1": "Whilst when they measure or weigh for them, give less.\n",
        "TRANSLATION_2": "but who, when they measure or weigh for others, give less than their due.\n",
        "TRANSLATION_3": "but when they measure or weigh, give less.\n",
        "TRANSLATION_4": "Whereas when they give others after measuring or weighing, they give them less!\n",
        "TRANSLATION_5": "And when they have to give by measure or weight to men, give less than due.\n",
        "TRANSLATION_6": "But when they measure out to others or weigh out for them, they are deficient.\n",
        "TRANSLATION_7": "but, when they measure for them or weigh for them, do skimp.\n",
        "TRANSLATION_8": "But if they measure unto them or weight for them, they cause them loss.\n",
        "TRANSLATION_9": "but when they give by measurement or weight to others, they give them less.\n",
        "TRANSLATION_10": "And who, when they measure Unto them or weigh for them, diminish.\n",
        "TRANSLATION_11": "but diminish when they measure or weigh for them.\n",
        "TRANSLATION_12": "But when they have to give by measure or weight to men, give less than due.\n",
        "TRANSLATION_13": "And when they have to give by measure or weight to men, give less than due.\n",
        "TRANSLATION_14": "but when they measure or weigh for others, they reduce!\n",
        "TRANSLATION_15": "But when they measure or weigh to others, they cheat.\n",
        "TRANSLATION_16": "But if they give by measure or by weight to them, they cause loss.\n",
        "TRANSLATION_17": "[83:3] but [who] when they measure for them or weigh for them, they cause [them] loss, they diminish [for them] the measure or the weight.\n",
        "TRANSLATION_18": "(But if they measure unto them) but when they measure for others (or weigh for them, they cause them loss) they decrease the measurement or the weight and behave very badly; it is also said that the above means: severe punishment on that day is unto the defrauders in the prayer, the poor-due, fasting and other acts of worship.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "83:3",
            "83:30",
            "37:13",
            "26:73",
            "26:80",
            "7:119",
            "68:18",
            "80:22",
            "10:63",
            "83:32"
        ],
        "BIBLE": [
            "writings:proverbs:20:10",
            "torah:leviticus:19:35",
            "writings:job:28:25",
            "torah:deuteronomy:25:2",
            "torah:deuteronomy:25:15",
            "prophets:ezekiel:4:16",
            "prophets:jeremiah:10:24",
            "prophets:zechariah:5:8",
            "writings:job:17:8",
            "prophets:jeremiah:9:1"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:3:8",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:3:6",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:3:5",
            "Sefer%20Yetzirah:2:2",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:5:2"
        ]
    }
}