{
    "VERSE": "83:30",
    "ARABIC": "وَإِذَا مَرُّوا۟ بِهِمْ يَتَغَامَزُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "When they passed by them, they would wink at one another.",
        "TRANSLATION_1": "And winked at one another as they passed by them;\n",
        "TRANSLATION_2": "when they passed by them they winked,\n",
        "TRANSLATION_3": "When passing by them, they would wink at one another\n",
        "TRANSLATION_4": "And when the believers used to pass by, they used to gesture at each other with their eyes.\n",
        "TRANSLATION_5": "And, whenever they passed by them, used to wink one to another.\n",
        "TRANSLATION_6": "And when they passed by them, they winked at one another.\n",
        "TRANSLATION_7": "when them passed them by winking at one another,\n",
        "TRANSLATION_8": "And wink one to another when they passed them;\n",
        "TRANSLATION_9": "when they passed by them, they would wink at one another;\n",
        "TRANSLATION_10": "And, when they passed them, to wink at each other,\n",
        "TRANSLATION_11": "and when they passed them by they would wink at each other,\n",
        "TRANSLATION_12": "And whenever they passed by them, used to wink at each other (in mockery);\n",
        "TRANSLATION_13": "And whenever they passed by them, used to wink one to another (in mockery);\n",
        "TRANSLATION_14": "and winked at one another as they passed them by.\n",
        "TRANSLATION_15": "And when they passed by them, they would wink at one another.\n",
        "TRANSLATION_16": "And when they passed by them, they would exchange derisive glances.\n",
        "TRANSLATION_17": "[83:30] and when they, the believers, passed them by, they would wink at one another, the guilty beckoned with their eyebrows and eyelids towards the believers in mockery;\n",
        "TRANSLATION_18": "(And wink one to another) they slander the believers (when they passed them) when the believers passed the disbelievers in their way to the Messenger of Allah (pbuh);\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "83:30",
            "83:3",
            "37:13",
            "26:80",
            "26:211",
            "85:7",
            "44:14",
            "77:36",
            "12:71",
            "7:119"
        ],
        "BIBLE": [
            "torah:genesis:30:41",
            "writings:proverbs:16:30",
            "prophets:i%20samuel:3:2",
            "torah:genesis:27:1",
            "writings:song%20of%20songs:3:4",
            "writings:psalms:37:36",
            "writings:nehemiah:6:16",
            "writings:job:28:8",
            "prophets:joshua:4:23",
            "torah:deuteronomy:24:1"
        ]
    }
}