{
    "VERSE": "83:34",
    "ARABIC": "فَٱلْيَوْمَ ٱلَّذِينَ ءَامَنُوا۟ مِنَ ٱلْكُفَّارِ يَضْحَكُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "So today those who have iman are laughing at the kuffar,",
        "TRANSLATION_1": "So, the believers will laugh at the infidels on that day,\n",
        "TRANSLATION_2": "But today the believers are laughing at the unbelievers;\n",
        "TRANSLATION_3": "On the Day of Judgment, the believers will laugh at the disbelievers\n",
        "TRANSLATION_4": "So this day it is the believers who laugh at the disbelievers.\n",
        "TRANSLATION_5": "But this Day those who believe will laugh at the disbelievers\n",
        "TRANSLATION_6": "So today those who believe shall laugh at the unbelievers;\n",
        "TRANSLATION_7": "So today the believers are laughing at the unbelievers,\n",
        "TRANSLATION_8": "This day it is those who believe who have the laugh of disbelievers,\n",
        "TRANSLATION_9": "so today those who believe shall [be able to] laugh at those who denied the truth\n",
        "TRANSLATION_10": "Wherefore Today, those who believed at the infidels are laughing,\n",
        "TRANSLATION_11": "So today the faithful will laugh at the faithless,\n",
        "TRANSLATION_12": "But on this Day the Believers will laugh at the Unbelievers:\n",
        "TRANSLATION_13": "But this Day (the Day of Resurrection) those who believe will laugh at the disbelievers\n",
        "TRANSLATION_14": "But on this Day the believers will laugh at the unbelievers\n",
        "TRANSLATION_15": "But on that Day, those who believed will laugh at the unbelievers.\n",
        "TRANSLATION_16": "So Today those who believed are laughing at the disbelievers,\n",
        "TRANSLATION_17": "[83:34] So today, that is, the Day of Resurrection, the believers will be laughing at the disbelievers,\n",
        "TRANSLATION_18": "(This day) which is the Day of Judgement (it is those who believe) in Muhammad (pbuh) and the Qur'an: i.e. 'Ali and his fellow believers (who have the laugh of disbelievers) who will laugh at the disbelievers,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "83:34",
            "51:60",
            "43:83",
            "52:45",
            "70:42",
            "79:6",
            "83:36",
            "83:11",
            "54:6",
            "36:64"
        ],
        "BIBLE": [
            "torah:leviticus:23:27",
            "torah:leviticus:23:15",
            "prophets:jeremiah:51:47",
            "writings:nehemiah:6:15",
            "prophets:ezekiel:45:21",
            "prophets:zechariah:14:1",
            "torah:numbers:29:1",
            "prophets:isaiah:19:24",
            "prophets:jeremiah:51:52",
            "torah:leviticus:23:32"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:4:8",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:2:6",
            "Sefer%20Yetzirah:4:5"
        ]
    }
}