{
    "VERSE": "83:6",
    "ARABIC": "يَوْمَ يَقُومُ ٱلنَّاسُ لِرَبِّ ٱلْعَٰلَمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "the Day mankind will stand before the Lord of all the worlds?",
        "TRANSLATION_1": "The day all mankind will stand before the Lord of all the worlds?\n",
        "TRANSLATION_2": "a Day when mankind will stand before the Lord of the Universe?\n",
        "TRANSLATION_3": "when mankind will stand before the Lord of the Universe?\n",
        "TRANSLATION_4": "The day when everyone will stand before the Lord Of The Creation.\n",
        "TRANSLATION_5": "The Day when (all) mankind will stand before the Lord of all that exists\n",
        "TRANSLATION_6": "The day on which men shall stand before the Lord of the worlds?\n",
        "TRANSLATION_7": "a day when mankind shall stand before the Lord of all Being?\n",
        "TRANSLATION_8": "The day when (all) mankind stand before the Lord of the Worlds?\n",
        "TRANSLATION_9": "The Day when mankind will stand before the Lord of the Universe?\n",
        "TRANSLATION_10": "A Day whereon mankind shall stand before the Lord of the worlds?\n",
        "TRANSLATION_11": "a day when mankind will stand before the Lord of all the worlds?\n",
        "TRANSLATION_12": "A Day when (all) mankind will stand before the Lord of the Worlds?\n",
        "TRANSLATION_13": "The Day when (all) mankind will stand before the Lord of the 'Alamin (mankind, jinns and all that exists)?\n",
        "TRANSLATION_14": "the Day when people will stand before the Lord of the Worlds?\n",
        "TRANSLATION_15": "The Day when mankind will stand before the Lord of the Worlds?\n",
        "TRANSLATION_16": "The Day when mankind will stand before the Lord of the worlds?\n",
        "TRANSLATION_17": "[83:6] a day when (yawma is a substitution for the [syntactical] locus of li-yawmin, ‘to an [awful] day’, and as such is in the accusative because of [the verb] mab‘ūthūna, ‘will be resurrected’) mankind will rise, from their graves, before the Lord of the Worlds?, [the Lord of] all creatures, for His affair, His reckoning and His requital.\n",
        "TRANSLATION_18": "(The day when (all) mankind stand) after emerging from the graves (before the Lord of the Worlds) the Lord of every living being who walks on the earth and the Lord of the dwellers of heaven? When the Prophet (pbuh) read to them this surah, they repented and started giving full weight and measurement.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "83:6",
            "114:1",
            "2:131",
            "69:43",
            "56:80",
            "26:98",
            "7:121",
            "26:47",
            "101:4",
            "3:9"
        ],
        "BIBLE": [
            "torah:deuteronomy:19:17",
            "prophets:joshua:1:5",
            "prophets:joshua:23:9",
            "writings:proverbs:19:21",
            "torah:deuteronomy:29:9",
            "prophets:isaiah:38:11",
            "torah:numbers:19:14",
            "torah:leviticus:15:24",
            "torah:deuteronomy:24:11",
            "prophets:i%20samuel:6:20"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:11",
            "Sefer%20Yetzirah:3:5",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:5:4"
        ]
    }
}