{
    "VERSE": "83:7",
    "ARABIC": "كَلَّآ إِنَّ كِتَٰبَ ٱلْفُجَّارِ لَفِى سِجِّينٍ",
    "ENGLISH": {
        "TRANSLATION_0": "No indeed! The book of the dissolute is in Sijjin.",
        "TRANSLATION_1": "Indeed the ledger of the wicked will be in (the lowest depths) Sijjin.\n",
        "TRANSLATION_2": "No indeed! Verily the deeds of the wicked are in the Record locked up in the prison-house!\n",
        "TRANSLATION_3": "Woe to them! Let them know that the records of the sinner's deeds are in Sijin.\n",
        "TRANSLATION_4": "Indeed, the record of the disbelievers is in the lowest place, the Sijjeen.\n",
        "TRANSLATION_5": "Nay! Truly, the Record of the wicked is in Sijjin.\n",
        "TRANSLATION_6": "Nay! most surely the record of the wicked is in the Sijjin.\n",
        "TRANSLATION_7": "No indeed; the Book of the libertines is in Sijjin;\n",
        "TRANSLATION_8": "Nay, but the record of the vile is in Sijjin -\n",
        "TRANSLATION_9": "Indeed! The record of the wicked is in the Sijjin --\n",
        "TRANSLATION_10": "By no means! Verily the record of the ungodly is in Sijjin.\n",
        "TRANSLATION_11": "Indeed, the record of the vicious is in Sijjeen.\n",
        "TRANSLATION_12": "Nay! Surely the record of the wicked is (preserved) in Sijjin.\n",
        "TRANSLATION_13": "Nay! Truly, the Record (writing of the deeds) of the Fujjar (disbelievers, sinners, evil-doers and wicked) is (preserved) in Sijjin.\n",
        "TRANSLATION_14": "No indeed, the Book of the immoral is in Sijjeen.\n",
        "TRANSLATION_15": "Not at all. The record of the wicked is in Sijjeen.\n",
        "TRANSLATION_16": "No! Indeed, the record of the wicked is in sijjeen.\n",
        "TRANSLATION_17": "[83:7] Nay!, verily, the record of the profligates, that is to say, the record of the deeds of the disbelievers, is in Sijjīn — this is said to be a book containing [the record of] all the deeds of the devils and the disbelievers; but it is also said to be a location in the lowermost part of the seventh earth, the place of Satan and his hosts.\n",
        "TRANSLATION_18": "(Nay) truly, Muhammad, (but the record of the vile) the works of the disbelievers (is in Sijjin\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "83:7",
            "83:18",
            "56:78",
            "43:2",
            "44:2",
            "19:51",
            "96:6",
            "83:9",
            "83:20",
            "23:49"
        ],
        "BIBLE": [
            "writings:job:18:21",
            "prophets:jeremiah:44:29",
            "writings:ii%20chronicles:34:24",
            "writings:job:40:12",
            "writings:psalms:37:10",
            "writings:psalms:69:29",
            "prophets:isaiah:45:3",
            "torah:genesis:28:16",
            "writings:ii%20chronicles:34:31",
            "prophets:ezekiel:36:36"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:4:2",
            "Sefer%20Yetzirah:6:1"
        ]
    }
}