{
    "VERSE": "2:103",
    "ARABIC": "وَلَوْ أَنَّهُمْ ءَامَنُوا۟ وَٱتَّقَوْا۟ لَمَثُوبَةٌ مِّنْ عِندِ ٱللَّهِ خَيْرٌ لَّوْ كَانُوا۟ يَعْلَمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "If only they had had iman and shown taqwa! A reward from Allah is better, if they only knew.",
        "TRANSLATION_1": "Had they come to believe instead, and taken heed for themselves, they would surely have earned from God a far better reward. If only they had sense!\n",
        "TRANSLATION_2": "Had they believed in Allah and practised piety, they would have received a far better reward from AIIah, if they had but known it.\n",
        "TRANSLATION_3": "Would that they had known that if they had embraced the faith and avoided evil, they would have received better rewards from God.\n",
        "TRANSLATION_4": "And had they believed and been pious, then the recompense from Allah is extremely good; if only they knew!\n",
        "TRANSLATION_5": "And if they had believed and guarded themselves from evil and kept their duty to Allah, far better would have been the reward from their Lord, if they but knew!\n",
        "TRANSLATION_6": "And if they had believed and guarded themselves (against evil), reward from Allah would certainly have been better; had they but known (this).\n",
        "TRANSLATION_7": "Yet had they believed, and been godfearing, a recompense from God had been better, if they had but known.\n",
        "TRANSLATION_8": "And if they had believed and kept from evil, a recompense from Allah would be better, if they only knew.\n",
        "TRANSLATION_9": "And had they but believed and been mindful of God, His reward would have been far better for them, if they had but known it.\n",
        "TRANSLATION_10": "And had they believed and feared, surely better had been the reward from before Allah, if they but knew!\n",
        "TRANSLATION_11": "Had they been faithful and Godwary, the reward from Allah would have been better, had they known!\n",
        "TRANSLATION_12": "If they had kept their Faith and guarded themselves from evil, far better had been the reward from their Lord, if they but knew!\n",
        "TRANSLATION_13": "And if they had believed, and guarded themselves from evil and kept their duty to Allah, far better would have been the reward from their Lord, if they but knew!\n",
        "TRANSLATION_14": "Had they believed and were cautious, far better for them would be the reward from Allah, if they but knew.\n",
        "TRANSLATION_15": "Had they believed and been righteous, the reward from God would have been better, if they only knew.\n",
        "TRANSLATION_16": "And if they had believed and feared Allah, then the reward from Allah would have been [far] better, if they only knew.\n",
        "TRANSLATION_17": "[2:103] Yet if only they, the Jews, had believed, in the Prophet and the Qur’ān, and been fearful, of God’s chastisement, by abandoning acts of disobedience towards Him, such as sorcery (the response to the [conditional clause beginning with] law, ‘if’, has been omitted, [but it is intimated to be] ‘they would have been rewarded’, and this is indicated by [His following words]) verily, a reward from God would have been better, than that for which they sold themselves, if they had but known, that this is better they would not have preferred that over this (la-mathūbatun, ‘verily the reward’, is the subject; the lām is that of oaths; and min ‘indi’Llāhi khayrun, ‘from God, would have been better’, is the predicate).\n",
        "TRANSLATION_18": "(And if they) i.e. the Jews (had believed) in Muhammad and the Qur'an (and kept from evil) repented from Judaism and sorcery, (a recompense from Allah) a reward from Allah (would be better) than Judaism and sorcery, (if they only knew) if they believed in Allah's reward, but they do not know nor do they believe; and it is said that they knew all this from their Book.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:103",
            "8:23",
            "3:54",
            "38:47",
            "47:21",
            "6:58",
            "49:5",
            "62:11",
            "39:57",
            "2:110"
        ],
        "BIBLE": [
            "writings:psalms:16:1",
            "prophets:joshua:23:11",
            "prophets:jeremiah:51:56",
            "writings:ecclesiastes:3:14",
            "writings:psalms:31:2",
            "writings:psalms:7:2",
            "writings:psalms:141:8",
            "writings:ii%20chronicles:19:7",
            "prophets:jeremiah:23:2",
            "writings:job:34:5"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:3",
            
            "Sefer%20Yetzirah:5:2"
        ]
    }
}