{
    "VERSE": "2:105",
    "ARABIC": "مَّا يَوَدُّ ٱلَّذِينَ كَفَرُوا۟ مِنْ أَهْلِ ٱلْكِتَٰبِ وَلَا ٱلْمُشْرِكِينَ أَن يُنَزَّلَ عَلَيْكُم مِّنْ خَيْرٍ مِّن رَّبِّكُمْ وَٱللَّهُ يَخْتَصُّ بِرَحْمَتِهِۦ مَن يَشَآءُ وَٱللَّهُ ذُو ٱلْفَضْلِ ٱلْعَظِيمِ",
    "ENGLISH": {
        "TRANSLATION_0": "Those of the People of the Book who are kafir and the idolaters do not like anything good to be sent down to you from your Lord. But Allah selects for His mercy whomever He wills. Allah's favour is truly vast.",
        "TRANSLATION_1": "Those without faith among the people of the Book, and those who worship idols, do not wish that good should come to you from your Lord. But God chooses whom He likes for His grace; and the bounty of God is infinite.\n",
        "TRANSLATION_2": "The people who have rejected the message of Truth, be they the people of the Book or the mushriks, would never like that any good be sent down to you from your Lord, but Allah chooses for His mercy whom He wills, and Allah is Most Bountiful.\n",
        "TRANSLATION_3": "(Muhammad) the disbelievers among the People of the Book and the pagans do not like to see anything good revealed to you from your Lord. God reserves His mercy for whomever He chooses. The generosity of God is great.\n",
        "TRANSLATION_4": "Those who disbelieve – the People given the Book(s) or the polytheists – do not wish that any good be sent down upon you from your Lord; and Allah chooses whomever He wills by His Mercy; and Allah is the Most Munificent.\n",
        "TRANSLATION_5": "Neither those who disbelieve among the People of the Scripture (Jews and Christians) nor Al-Mushrikin (the idolaters) like that there should be sent down unto you any good from your Lord. But Allah chooses for His mercy whom He wills. And Allah is the Owner of great bounty.\n",
        "TRANSLATION_6": "Those who disbelieve from among the followers of the Book do not like, nor do the polytheists, that the good should be sent down to you from your Lord, and Allah chooses especially whom He pleases for His mercy, and Allah is the Lord of mighty grace.\n",
        "TRANSLATION_7": "Those unbelievers of the People of the Book and the idolaters wish not that any good should be sent down upon you from your Lord; but God singles out for His mercy whom He will; God is of bounty abounding.\n",
        "TRANSLATION_8": "Neither those who disbelieve among the people of the Scripture nor the idolaters love that there should be sent down unto you any good thing from your Lord. But Allah chooseth for His mercy whom He will, and Allah is of Infinite Bounty.\n",
        "TRANSLATION_9": "They who deny the truth from among the People of the Book, or from among those who associate partners with God, do not desire that any good should be sent down to you from your Lord. But God singles out for His grace whom He wills -- for God is limitless in His great bounty.\n",
        "TRANSLATION_10": "Fain would they who disbelieve, be they of the people of the Book or of the associators, that naught of good should be sent down unto you from Your Lord; whereas Allah singleth out for His mercy whomsoever He will and Allah is the Lord of mighty grace.\n",
        "TRANSLATION_11": "Neither the faithless from among the People of the Book nor the idolaters like that any good be showered on you from your Lord; but Allah singles out for His mercy whomever He wishes, and Allah is dispenser of a mighty grace.\n",
        "TRANSLATION_12": "It is never the wish of those without Faith among the People of the Book, nor of the Pagans, that anything good should come down to you from your Lord. But Allah will choose for His special Mercy whom He will - for Allah is Lord of grace abounding.\n",
        "TRANSLATION_13": "Neither those who disbelieve among the people of the Scripture (Jews and Christians) nor Al-Mushrikun (the disbelievers in the Oneness of Allah, idolaters, polytheists, pagans, etc.) like that there should be sent down unto you any good from your Lord. But Allah chooses for His Mercy whom He wills. And Allah is the Owner of Great Bounty.\n",
        "TRANSLATION_14": "The unbelievers among the People of the Book (Jews and Nazarenes) and the idolaters resent that any good should have been sent down to you from your Lord. But Allah chooses whom He will for His Mercy. And Allah is of great bounty.\n",
        "TRANSLATION_15": "It is never the wish of the disbelievers from among the People of the Book, nor of the polytheists, that any good should be sent down to you from your Lord. But God chooses for His mercy whomever He wills. God is Possessor of Sublime Grace.\n",
        "TRANSLATION_16": "Neither those who disbelieve from the People of the Scripture nor the polytheists wish that any good should be sent down to you from your Lord. But Allah selects for His mercy whom He wills, and Allah is the possessor of great bounty.\n",
        "TRANSLATION_17": "[2:105] Those disbelievers of the People of the Scripture and the idolaters, from among the Arabs (al-mushrikīna, ‘idolaters’, is a supplement to ahl al-kitābi, ‘People of the Scripture’, and the min, ‘of’, is explicative), do not wish that any good, any Inspiration, should be revealed to you from your Lord, out of envy of you, but God singles out for His mercy, [for] the office of His Prophet, whom He will; God is of bounty abounding.\n",
        "TRANSLATION_18": "(Neither those who disbelieve among the people of the Scripture) Ka'b Ibn al-Ashraf and his companions (nor the idolaters) the idolaters of Arabia: Abu Jahl and his companions (love that there should be sent down unto you) that Allah should send Gabriel unto your Prophet (any good thing) the good of prophethood, Islam and the Book (from your Lord. But Allah chooseth for His mercy) chooses for His religion, prophethood, Islam and the Book (whom He will) whoever deserves to be chosen, i.e. Muhammad (pbuh) (and Allah is of infinite mercy) His favour in giving Muhammad prophethood and Islam is great indeed.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:105",
            "57:29",
            "3:74",
            "4:113",
            "10:58",
            "62:4",
            "10:107",
            "24:14",
            "24:33",
            "4:54"
        ],
        "BIBLE": [
            "prophets:joshua:23:15",
            "writings:ezra:3:11",
            "writings:i%20chronicles:29:14",
            "prophets:judges:18:10",
            "prophets:joshua:23:16",
            "prophets:i%20kings:8:56",
            "torah:deuteronomy:12:21",
            "torah:deuteronomy:28:52",
            "torah:deuteronomy:26:13",
            "torah:deuteronomy:9:23"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:8"
        ]
    }
}