{
    "VERSE": "2:106",
    "ARABIC": "مَا نَنسَخْ مِنْ ءَايَةٍ أَوْ نُنسِهَا نَأْتِ بِخَيْرٍ مِّنْهَآ أَوْ مِثْلِهَآ أَلَمْ تَعْلَمْ أَنَّ ٱللَّهَ عَلَىٰ كُلِّ شَىْءٍ قَدِيرٌ",
    "ENGLISH": {
        "TRANSLATION_0": "Whenever We abrogate an ayat or cause it to be forgotten, We bring one better than it or equal to it. Do you not know that Allah has power over all things?",
        "TRANSLATION_1": "When We cancel a message (sent to an earlier prophet) or throw it into oblivion, We replace it with one better or one similar. Do you not know that God has power over all things?\n",
        "TRANSLATION_2": "We bring a better verse or at least the like of it for whatever we abrogate or cause it to be forgotten.\n",
        "TRANSLATION_3": "For whatever sign We change or eliminate or cause to recede into oblivion, We bring forth a better sign, one that is identical. Do you not know that God has power over all things?\n",
        "TRANSLATION_4": "When We abrogate a verse or cause it to be forgotten, We will bring one better than it or one similar; do you not know that Allah is Able to do all things?\n",
        "TRANSLATION_5": "Whatever a verse (revelation) do Nansakh (We abrogate) or Nunsiha (cause to be forgotten), We bring a better one or similar to it. Know you not that Allah is Able to do all things\n",
        "TRANSLATION_6": "Whatever communications We abrogate or cause to be forgotten, We bring one better than it or like it. Do you not know that Allah has power over all things?\n",
        "TRANSLATION_7": "And for whatever verse We abrogate or cast into oblivion, We bring a better or the like of it; knowest thou not that God is powerful over everything?\n",
        "TRANSLATION_8": "Nothing of our revelation (even a single verse) do we abrogate or cause be forgotten, but we bring (in place) one better or the like thereof. Knowest thou not that Allah is Able to do all things?\n",
        "TRANSLATION_9": "If We abrogate a verse or cause it to be forgotten, We will replace it by a better one or one similar to it. Do you not know that God has power over all things?\n",
        "TRANSLATION_10": "Whatsoever verse We abrogate or cause to be forgotten We bring a better one or the like thereof; knowest thou not that Allah is over everything Potent?\n",
        "TRANSLATION_11": "For any verse that We abrogate or cause to be forgotten, We bring another which is better than it, or similar to it. Do you not know that Allah has power over all things?\n",
        "TRANSLATION_12": "None of Our revelations do We abrogate or cause to be forgotten, but We substitute something better or similar: Knowest thou not that Allah Hath power over all things?\n",
        "TRANSLATION_13": "Whatever a Verse (revelation) do We abrogate or cause to be forgotten, We bring a better one or similar to it. Know you not that Allah is able to do all things?\n",
        "TRANSLATION_14": "If We supersede any verse or cause it to be forgotten, We bring a better one or one similar. Do you not know that Allah has power over all things!\n",
        "TRANSLATION_15": "We never nullify a verse, nor cause it to be forgotten, unless We bring one better than it, or similar to it. Do you not know that God is capable of all things?\n",
        "TRANSLATION_16": "We do not abrogate a verse or cause it to be forgotten except that We bring forth [one] better than it or similar to it. Do you not know that Allah is over all things competent?\n",
        "TRANSLATION_17": "[2:106] When the disbelievers began to deride the matter of abrogation, saying that one day Muhammad enjoins his Companions to one thing and then the next day he forbids it, God revealed: And whatever verse (mā is the conditional particle), that has been revealed containing a judgement, We abrogate, either together with its recital or not [that is only its judgement, but its recital continues]; there is a variant reading, nunsikh, meaning ‘[Whatever verse] We command you or Gabriel to abrogate’, or postpone, so that We do not reveal the judgement contained in it, and We withhold its recital or retain it in the Preserved Tablet; a variant reading [of nunsi’hā] is nunsihā, from ‘to forget’: so ‘[Whatever verse We abrogate] or We make you forget, that is, We erase from your heart’; the response to the conditional sentence [begun with mā] is: We bring [in place] a better, one that is more beneficial for [Our] servants, either because it is easier [to implement] or contains much reward; or the like of it, in terms of religious obligation and reward; do you not know that God has power over all things?, including abrogating and substituting [verses]? (the interrogative here is meant as an affirmative).\n",
        "TRANSLATION_18": "Then Allah mentions what was abrogated of the Qur'an and that which was not abrogated, as a direct reference to the claim of the Quraysh who said to the Prophet: Muhammad! Why do you command us to do something and then forbid it, saying: (Such of Our revelations as We abrogate) We do not erase a verse that was acted upon before and which is now not acted upon (or cause to be forgotten) or leave unabrogated so that it is acted upon, (We bring one better) We send Gabriel with that which more profitable and easier to act upon (or the like) in reward, benefit and action. (Knowest thou not) Muhammad (that Allah is Able to do all things?) of the abrogated and unabrogated.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:106",
            "48:21",
            "6:17",
            "3:26",
            "2:148",
            "3:165",
            "5:40",
            "22:6",
            "33:27",
            "11:4"
        ],
        "BIBLE": [
            "writings:nehemiah:13:26",
            "writings:ii%20chronicles:25:8",
            "writings:ecclesiastes:3:14",
            "prophets:ezekiel:24:24",
            "prophets:i%20kings:18:36",
            "torah:deuteronomy:13:3",
            "writings:i%20chronicles:28:9",
            "writings:ii%20chronicles:25:16",
            "writings:daniel:5:15",
            "prophets:isaiah:61:11"
        ]
    }
}