{
    "VERSE": "2:108",
    "ARABIC": "أَمْ تُرِيدُونَ أَن تَسْـَٔلُوا۟ رَسُولَكُمْ كَمَا سُئِلَ مُوسَىٰ مِن قَبْلُ وَمَن يَتَبَدَّلِ ٱلْكُفْرَ بِٱلْإِيمَٰنِ فَقَدْ ضَلَّ سَوَآءَ ٱلسَّبِيلِ",
    "ENGLISH": {
        "TRANSLATION_0": "Or do you want to question your Messenger as Musa was questioned before? Anyone who exchanges iman for kufr has definitely gone astray from the level way.",
        "TRANSLATION_1": "Do you too, O believers, wish to question your Apostle as Moses was in the past? But he who takes unbelief in exchange for belief only strays from the right path.\n",
        "TRANSLATION_2": "Would you then ask your Prophet such questions as were asked of Moses in former times? In fact, anyone, who changes the way of belief for that of disbelief, has surely swerved from the Right way.\n",
        "TRANSLATION_3": "Do you want to address the Prophet in the same manner in which Moses was addressed? Anyone who exchanges belief for disbelief has certainly gone down the wrong path.\n",
        "TRANSLATION_4": "Do you wish to ask your Noble Messenger a question similar to what Moosa was asked before? And whoever chooses disbelief instead of faith has gone astray from the Right Path.\n",
        "TRANSLATION_5": "Or do you want to ask your Messenger (Muhammad) as Musa (Moses) was asked before (i.e. show us openly our Lord) And he who changes faith for disbelief, verily, he has gone astray from the right way.\n",
        "TRANSLATION_6": "Rather you wish to put questions to your Apostle, as Musa was questioned before; and whoever adopts unbelief instead of faith, he indeed has lost the right direction of the way.\n",
        "TRANSLATION_7": "Or do you desire to question your Messenger as Moses was questioned in former time? Whoso exchanges belief for unbelief has surely strayed from the right way.\n",
        "TRANSLATION_8": "Or would ye question your messenger as Moses was questioned aforetime? He who chooseth disbelief instead of faith, verily he hath gone astray from a plain road.\n",
        "TRANSLATION_9": "Do you [all] want to question your messenger just as Moses was questioned previously? Anyone who exchanges faith for unbelief has strayed from the right path.\n",
        "TRANSLATION_10": "Seek ye to question your apostle, even as Musa was questioned afore. And whosoever changeth belief for infidelity, he hath of a surety strayed from the even way.\n",
        "TRANSLATION_11": "Would you question your Apostle as Moses was questioned formerly? Whoever changes faith for unfaith certainly strays from the right way.\n",
        "TRANSLATION_12": "Would ye question your Messenger as Moses was questioned of old? but whoever changeth from Faith to Unbelief, Hath strayed without doubt from the even way.\n",
        "TRANSLATION_13": "Or do you want to ask your Messenger (Muhammad Peace be upon him) as Musa (Moses) was asked before (i.e. show us openly our Lord?) And he who changes Faith for disbelief, verily, he has gone astray from the right way.\n",
        "TRANSLATION_14": "Would you rather demand of your Messenger that which was once demanded of Moses! He who exchanges belief for disbelief has surely strayed from the Right Path.\n",
        "TRANSLATION_15": "Or do you want to question your Messenger as Moses was questioned before? Whoever exchanges faith for disbelief has strayed from the right path.\n",
        "TRANSLATION_16": "Or do you intend to ask your Messenger as Moses was asked before? And whoever exchanges faith for disbelief has certainly strayed from the soundness of the way.\n",
        "TRANSLATION_17": "[2:108] When the Meccans asked [the Prophet] to enlarge the size of Mecca and make Safā full of gold, the following was revealed: Or do you desire to question your Messenger as Moses was questioned, by his people, aforetime?, when they asked him to show them God openly among other things; whoever exchanges belief for unbelief, taking the latter in place of the former by refraining from contemplating the clear proofs and by requesting others instead, has surely strayed from the even way, meaning, he has mistaken the proper path (al-sawā‘ essentially means al-wasat, ‘middle way’).\n",
        "TRANSLATION_18": "(Or would ye question your messenger) ask him to see your Lord, hear His speech and other similar things (as Moses was questioned) as the Children of Israel asked Moses (before) before the advent of Muhammad (pbuh)? (He who chooseth disbelief instead of faith, verily he hath gone astray from a plain road) he has relinquished the path of guidance.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:108",
            "21:41",
            "6:10",
            "3:184",
            "60:1",
            "3:144",
            "29:18",
            "4:164",
            "3:183",
            "35:4"
        ],
        "BIBLE": [
            "prophets:i%20samuel:6:12",
            "prophets:isaiah:40:14",
            "writings:ii%20chronicles:20:21",
            "prophets:ii%20kings:2:9",
            "torah:deuteronomy:1:33",
            "torah:exodus:34:34",
            "prophets:isaiah:59:8",
            "prophets:judges:18:24",
            "writings:esther:9:27",
            "writings:job:27:2"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:13",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:1:8"
        ]
    }
}