{
    "VERSE": "2:112",
    "ARABIC": "بَلَىٰ مَنْ أَسْلَمَ وَجْهَهُۥ لِلَّهِ وَهُوَ مُحْسِنٌ فَلَهُۥٓ أَجْرُهُۥ عِندَ رَبِّهِۦ وَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Not so! All who submit themselves completely to Allah and are good-doers will find their reward with their Lord. They will feel no fear and will know no sorrow.",
        "TRANSLATION_1": "Only he who surrenders to God with all his heart and also does good, will find his reward with his Lord, and will have no fear or regret.\n",
        "TRANSLATION_2": "The fact is that no one has any special claim to Paradise; whoever surrenders himself to Allah in obedience and follows the Right Way, shall get his reward from his Lord: there shall be neither fear nor grief for such people.\n",
        "TRANSLATION_3": "However, one who accepts Islam in submission to God and does good, will have his reward with God. Such people will have nothing to fear nor to grieve about.\n",
        "TRANSLATION_4": "Yes, why not? Whoever submits his face for the sake of Allah, and is virtuous, his reward is with his Lord; and there shall be no fear upon them nor shall they grieve.\n",
        "TRANSLATION_5": "Yes! But whoever submits his face (himself) to Allah (i.e. follows Allah's religion of Islamic Monotheism) and he is a Muhsin then his reward is with his Lord (Allah), on such shall be no fear, nor shall they grieve.\n",
        "TRANSLATION_6": "Yes! whoever submits himself entirely to Allah and he is the doer of good (to others) he has his reward from his Lord, and there is no fear for him nor shall he grieve.\n",
        "TRANSLATION_7": "Nay, but whosoever submits his will to God, being a good-doer, his wage is with his Lord, and no fear shall be on them, neither shall they sorrow.\n",
        "TRANSLATION_8": "Nay, but whosoever surrendereth his purpose to Allah while doing good, his reward is with his Lord; and there shall no fear come upon them neither shall they grieve.\n",
        "TRANSLATION_9": "Indeed, those who submit themselves to God and act righteously shall be rewarded by their Lord: they shall have no fear, nor shall they grieve.\n",
        "TRANSLATION_10": "Aye! whosoever submitteth himself unto Allah and he is a well-doer-his hire is with his Lord; no fear shall come on them nor shall they grieve.\n",
        "TRANSLATION_11": "Certainly, whoever submits his will to Allah and is virtuous, he shall have his reward from his Lord, and they will have no fear, nor shall they grieve.\n",
        "TRANSLATION_12": "Nay,-whoever submits His whole self to Allah and is a doer of good,- He will get his reward with his Lord; on such shall be no fear, nor shall they grieve.\n",
        "TRANSLATION_13": "Yes, but whoever submits his face (himself) to Allah (i.e. follows Allah's Religion of Islamic Monotheism) and he is a Muhsin (good-doer i.e. performs good deeds totally for Allah's sake only without any show off or to gain praise or fame, etc., and in accordance with the Sunnah of Allah's Messenger Muhammad Peace be upon him) then his reward is with his Lord (Allah), on such shall be no fear, nor shall they grieve. [See Tafsir Ibn Kathir, Vol. 1, Page 154].\n",
        "TRANSLATION_14": "Indeed, whoever submits his face to Allah and does good works shall be rewarded by his Lord; there they shall have nothing to fear nor shall they be saddened.\n",
        "TRANSLATION_15": "In fact, whoever submits himself to God, and is a doer of good, will have his reward with his Lord—they have nothing to fear, nor shall they grieve.\n",
        "TRANSLATION_16": "Yes [on the contrary], whoever submits his face in Islam to Allah while being a doer of good will have his reward with his Lord. And no fear will there be concerning them, nor will they grieve.\n",
        "TRANSLATION_17": "[2:112] Nay, but, others will also enter Paradise, namely, whoever submits his purpose to God, that is, adheres to His commands (wajh, ‘face’ [sc. ‘purpose’], is here mentioned because it is the most noble part of the body, so that [when it has submitted] there is all the more reason for the other parts [to follow]), being virtuous, affirming God’s Oneness, his reward is with his Lord, the reward of his deeds being Paradise, and no fear shall befall them, neither shall they grieve, in the Hereafter.\n",
        "TRANSLATION_18": "(Nay) it is certainly not as you have claimed, (but whoever surrendereth his purpose to Allah) whoever makes sincere his Religion and works to Allah (while doing good) in words and deeds, (his reward is with his Lord) in Paradise; (and there shall no fear come upon them) about staying eternally in hell (neither shall they grieve) about the prospect of missing Paradise.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:112",
            "2:62",
            "2:277",
            "2:262",
            "46:13",
            "2:274",
            "3:57",
            "2:76",
            "33:69",
            "23:117"
        ],
        "BIBLE": [
            "torah:deuteronomy:15:10",
            "prophets:jeremiah:30:24",
            "prophets:jeremiah:23:20",
            "prophets:jeremiah:23:17",
            "prophets:joshua:14:8",
            "prophets:i%20samuel:12:20",
            "prophets:jeremiah:24:7",
            "writings:ecclesiastes:3:17",
            "prophets:isaiah:59:13",
            "prophets:micah:3:11"
        ]
    }
}