{
    "VERSE": "2:117",
    "ARABIC": "بَدِيعُ ٱلسَّمَٰوَٰتِ وَٱلْأَرْضِ وَإِذَا قَضَىٰٓ أَمْرًا فَإِنَّمَا يَقُولُ لَهُۥ كُن فَيَكُونُ",
    "ENGLISH": {
        "TRANSLATION_0": "the Originator of the heavens and earth. When He decides on something, He just says to it, 'Be!' and it is.",
        "TRANSLATION_1": "Creator of the heavens and the earth from nothingness, He has only to say when He wills a thing: \"Be\", and it is.\n",
        "TRANSLATION_2": "He is the Creator of the heavens and the earth: when He decrees a thing, He merely says, \"Be,\" and there it is.\n",
        "TRANSLATION_3": "God is the Originator of the heavens and the earth. Whenever He decides to do anything, He just commands it to exist and it comes into existence.\n",
        "TRANSLATION_4": "The Originator of the heavens and the earth – and when He commands a thing, He only says to it, “Be\", and it thereupon happens.\n",
        "TRANSLATION_5": "The Originator of the heavens and the earth. When He decrees a matter, He only says to it: \"Be! ـ and it is.\n",
        "TRANSLATION_6": "Wonderful Originator of the heavens and the earth, and when He decrees an affair, He only says to it, Be, so there it is.\n",
        "TRANSLATION_7": "the Creator of the heavens and the earth; and when He decrees a thing, He but says to it 'Be,' and it is.\n",
        "TRANSLATION_8": "The Originator of the heavens and the earth! When He decreeth a thing, He saith unto it only: Be! and it is.\n",
        "TRANSLATION_9": "He is the Originator of the heavens and the earth, and when He decrees something, He says only, \"Be!\" and it is.\n",
        "TRANSLATION_10": "The Originator of the heavens and the earth; and whensoever He decreeth an affair, He only saith unto it: be; and it becometh.\n",
        "TRANSLATION_11": "the Originator of the heavens and the earth. When He decides on a matter, He just says to it, ‘Be!’ and it is.\n",
        "TRANSLATION_12": "To Him is due the primal origin of the heavens and the earth: When He decreeth a matter, He saith to it: \"Be,\" and it is.\n",
        "TRANSLATION_13": "The Originator of the heavens and the earth. When He decrees a matter, He only says to it: \"Be!\" - and it is.\n",
        "TRANSLATION_14": "Creator of the heavens and the earth! When He decrees a thing, He only says: 'Be' and it is.\n",
        "TRANSLATION_15": "Originator of the heavens and the earth. Whenever He decrees a thing, He says to it, “Be,” and it becomes.\n",
        "TRANSLATION_16": "Originator of the heavens and the earth. When He decrees a matter, He only says to it, \"Be,\" and it is.\n",
        "TRANSLATION_17": "[2:117] Creator of the heavens and the earth, making them exist without any exemplary precedent; and when He decrees, wills, a thing, to exist, He but says to it ‘Be’ and it is, that is to say, it becomes (fa-yakūnu: a variant reading has fa-yakūna, on account of it being the response [in the subjunctive mood] to the jussive statement).\n",
        "TRANSLATION_18": "(The Originator of the heavens and the earth!) He originated them when they were nothing before. (When He decreeth a thing) when He wants to create a child without a father, like Jesus, (He saith unto it only: Be!) be a child without a father, just like Adam was without a father or mother, (And it is).\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:117",
            "3:109",
            "44:29",
            "30:25",
            "11:107",
            "40:68",
            "57:5",
            "11:44",
            "2:11",
            "45:3"
        ],
        "BIBLE": [
            "prophets:jeremiah:10:11",
            "torah:numbers:22:38",
            "torah:genesis:42:36",
            "torah:genesis:22:1",
            "torah:leviticus:8:5",
            "prophets:jeremiah:16:19",
            "torah:leviticus:9:6",
            "torah:genesis:1:24",
            "prophets:ezekiel:37:9",
            "writings:daniel:2:10"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:14"
        ]
    }
}