{
    "VERSE": "2:118",
    "ARABIC": "وَقَالَ ٱلَّذِينَ لَا يَعْلَمُونَ لَوْلَا يُكَلِّمُنَا ٱللَّهُ أَوْ تَأْتِينَآ ءَايَةٌ كَذَٰلِكَ قَالَ ٱلَّذِينَ مِن قَبْلِهِم مِّثْلَ قَوْلِهِمْ تَشَٰبَهَتْ قُلُوبُهُمْ قَدْ بَيَّنَّا ٱلْءَايَٰتِ لِقَوْمٍ يُوقِنُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Those who do not know say, 'If only Allah would speak to us, or some sign come to us!' just like those before them who said the same as they say. Their hearts are much the same. We have made the Signs clear for people who have certainty.",
        "TRANSLATION_1": "But those who are ignorant say: \"Why does God not speak or show us a sign?\" The same question had been asked by men before them, who were like them in their hearts. But to those who are firm in their faith We have shown Our signs already.\n",
        "TRANSLATION_2": "The ignorant people say, \"Why does not Allah Himself talk to us or why does not a Sign come to us?\" The people before them also talked like this, for all (who swerve from the Right Path) have the same mentality. We have already shown clear Signs to those who believe;\n",
        "TRANSLATION_3": "The ignorant have asked, \"Why does He not speak to us and why has no evidence come to show us (that He exists)?\" People before them had also asked such questions. They all think in the same way. We have already made the evidence very clear for those who have certainty.\n",
        "TRANSLATION_4": "And the ignorant people said, “Why does not Allah speak to us, or some sign come to us?” Those before them had also spoken in the same way as they speak; their hearts (and of those before them) are all alike; undoubtedly, We have made the signs clear for the people who have faith.\n",
        "TRANSLATION_5": "And those who have no knowledge say: \"Why does not Allah speak to us (face to face) or why does not a sign come to us\" So said the people before them words of similar import. Their hearts are alike, We have indeed made plain the signs for people who believe with certainty.\n",
        "TRANSLATION_6": "And those who have no knowledge say: Why does not Allah speak to us or a sign come to us? Even thus said those before them, the like of what they say; their hearts are all alike. Indeed We have made the communications clear for a people who are sure.\n",
        "TRANSLATION_7": "And they that know not say, 'Why does God not speak to us? Why does a sign not come to us?' So spoke those before them as these men say; their hearts are much alike. Yet We have made clear the signs unto a people who are sure\n",
        "TRANSLATION_8": "And those who have no knowledge say: Why doth not Allah speak unto us, or some sign come unto us? Even thus, as they now speak, spake those (who were) before them. Their hearts are all alike. We have made clear the revelations for people who are sure.\n",
        "TRANSLATION_9": "Those who are devoid of knowledge say, \"Why does God not speak to us or show us a sign?\" The same demand was made by those before them; their hearts are all alike. We have made the signs clear to those whose faith is firm.\n",
        "TRANSLATION_10": "And those who know not, say: Wherefore speakest not God unto us? or cometh not unto us a sign? Thus aid those before them the like of their saying: consimilar are their hearts. We have already manifested the signs unto the people who would be convinced.\n",
        "TRANSLATION_11": "Those who have no knowledge say, ‘Why does not Allah speak to us, or come to us a sign?’ So said those who were before them, [words] similar to what they say. Alike are their hearts. We have certainly made the signs clear for a people who have certainty.\n",
        "TRANSLATION_12": "Say those without knowledge: \"Why speaketh not Allah unto us? or why cometh not unto us a Sign?\" So said the people before them words of similar import. Their hearts are alike. We have indeed made clear the Signs unto any people who hold firmly to Faith (in their hearts).\n",
        "TRANSLATION_13": "And those who have no knowledge say: \"Why does not Allah speak to us (face to face) or why does not a sign come to us?\" So said the people before them words of similar import. Their hearts are alike, We have indeed made plain the signs for people who believe with certainty.\n",
        "TRANSLATION_14": "And those who do not know say: 'Why does not Allah speak to us or a sign come to us' Likewise, those who were before them said similar to their saying. Their hearts are alike. Indeed, We have clarified the signs to a nation who are certain.\n",
        "TRANSLATION_15": "Those who do not know say, “If only God would speak to us, or a sign would come to us.” Thus said those who were before them. Their hearts are alike. We have made the signs clear for people who are certain.\n",
        "TRANSLATION_16": "Those who do not know say, \"Why does Allah not speak to us or there come to us a sign?\" Thus spoke those before them like their words. Their hearts resemble each other. We have shown clearly the signs to a people who are certain [in faith].\n",
        "TRANSLATION_17": "[2:118] And they, that is the disbelievers of Mecca, who do not know, say, to the Prophet (s): ‘Why does God not speak to us?, [to say] that you are His Messenger; Why does a sign not come to us?’, of the sort we have requested in order to show your sincerity. So, in the same way that these [disbelievers] have spoken, spoke those before them, from among past communities, to their prophets, the like of what they say, in [their] obstinacy and demand for signs; their hearts are much alike, in terms of unbelief and stubbornness: this is meant as consolation for the Prophet (s). Yet We have made clear the signs to a people who are certain, [a people] who know that these are [God’s] signs and so they believe in them, for to request other signs would be obduracy.\n",
        "TRANSLATION_18": "(And those who have no knowledge) who do not know the Oneness of Allah, i.e. the Jews (say: Why doth not Allah speak unto us) directly, (or some sign come unto us) a sign confirming the prophethood of Muhammad (pbuh); for then, we would surely believe? (Even thus, as they now speak, spoke) similar words (those before them) their forefathers. (Their hearts are all alike) their words and hearts are the same. (We have made clear the revelations) the signs: the commands, prohibitions and your traits in the Torah (for people who are sure) who believe.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:118",
            "62:5",
            "30:59",
            "29:3",
            "24:34",
            "6:33",
            "40:63",
            "7:177",
            "8:2",
            "3:140"
        ],
        "BIBLE": [
            "torah:numbers:22:20",
            "torah:exodus:19:9",
            "prophets:jeremiah:38:4",
            "prophets:jeremiah:20:9",
            "prophets:i%20kings:13:26",
            "writings:esther:6:6",
            "prophets:i%20kings:2:4",
            "writings:daniel:10:12",
            "prophets:i%20kings:20:28",
            "prophets:ii%20kings:18:36"
        ]
    }
}