{
    "VERSE": "2:119",
    "ARABIC": "إِنَّآ أَرْسَلْنَٰكَ بِٱلْحَقِّ بَشِيرًا وَنَذِيرًا وَلَا تُسْـَٔلُ عَنْ أَصْحَٰبِ ٱلْجَحِيمِ",
    "ENGLISH": {
        "TRANSLATION_0": "We have sent you with the Truth, bringing good news and giving warning. Do not ask about the inhabitants of the Blazing Fire.",
        "TRANSLATION_1": "And We have sent you with the truth to give glad tidings and to warn. You will not be questioned about those and who are inmates of Hell.\n",
        "TRANSLATION_2": "(what greater Sign could there be than that) We have sent you with the knowledge of the Truth and made you a bearer of good tidings and a Warner? Now, you are not responsible and answerable for those who are bent upon going to Hell.\n",
        "TRANSLATION_3": "We have sent you (Muhammad) for a genuine purpose to proclaim glad news and warnings. You will not be blamed for the dwellers of blazing hell.\n",
        "TRANSLATION_4": "Undoubtedly, We have sent you (O dear Prophet Mohammed – peace and blessings be upon him) with the truth, giving glad tidings and conveying warning, and you will not be questioned about the people of hell.\n",
        "TRANSLATION_5": "Verily, We have sent you (O Muhammad) with the truth (Islam), a bringer of glad tidings (for those who believe in what you brought, that they will enter Paradise) and a warner (for those who disbelieve in what you brought, that they will enter the Hellfire). And you will not be asked about the dwellers of the blazing Fire.\n",
        "TRANSLATION_6": "Surely We have sent you with the truth as a bearer of good news and as a warner, and you shall not be called upon to answer for the companions of the flaming fire.\n",
        "TRANSLATION_7": "We have sent thee with the truth, good tidings to bear, and warning. Thou shalt not be questioned touching the inhabitants of Hell.\n",
        "TRANSLATION_8": "Lo! We have sent thee (O Muhammad) with the truth, a bringer of glad tidings and a warner. And thou wilt not be asked about the owners of hell-fire.\n",
        "TRANSLATION_9": "We have sent you with the truth, bearing good news and giving warning. You will not be held accountable for the people of the Fire.\n",
        "TRANSLATION_10": "Verily We have sent thee with the truth, as a bearer of glad tidings and a warner, and thou shalt not be questioned of the fellows of the Flame.\n",
        "TRANSLATION_11": "Indeed We have sent you with the truth, as a bearer of good news and as a warner, and you will not be questioned concerning the inmates of hell.\n",
        "TRANSLATION_12": "Verily We have sent thee in truth as a bearer of glad tidings and a warner: But of thee no question shall be asked of the Companions of the Blazing Fire.\n",
        "TRANSLATION_13": "Verily, We have sent you (O Muhammad Peace be upon him) with the truth (Islam), a bringer of glad tidings (for those who believe in what you brought, that they will enter Paradise) and a warner (for those who disbelieve in what you brought, they will enter the Hell-fire). And you will not be asked about the dwellers of the blazing Fire.\n",
        "TRANSLATION_14": "We have sent you (Prophet Muhammad) forth with the truth, a giver of glad tidings and a giver of warning. You shall not be questioned about the companions of Hell.\n",
        "TRANSLATION_15": "We have sent you with the truth—bringing good news, and giving warnings. You will not be questioned about the inmates of Hell.\n",
        "TRANSLATION_16": "Indeed, We have sent you, [O Muhammad], with the truth as a bringer of good tidings and a warner, and you will not be asked about the companions of Hellfire.\n",
        "TRANSLATION_17": "[2:119] We have sent you, Muhammad (s), with the truth, the guidance, a bearer of good tidings, of Paradise, for those who respond to this [guidance], and warner, of the Fire, to those who do not respond to it. You shall not be asked about the inhabitants of Hell-fire, that is, about why the disbelievers did not believe, for your responsibility is only to deliver the Message (a variant reading of lā tus’al is lā tas’al, ‘do not ask’, with the final apocopation of the vowel on account of it being an imperative).\n",
        "TRANSLATION_18": "(Lo! We have sent thee) Muhammad (with the Truth) with the Qur'an and the declaration of the Oneness of Allah, (a bringer of glad tidings) that Paradise shall be for the believers (and a warner) against hell for those who disbelieve in Allah. (And thou wilt not be asked about the owners of hellfire) it is not befitting that you should ask about the dwellers of hell; and it is said that this means: do not ask for the forgiveness of the dwellers of hell.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:119",
            "35:24",
            "17:105",
            "5:86",
            "5:10",
            "15:64",
            "48:8",
            "41:4",
            "15:89",
            "22:51"
        ],
        "BIBLE": [
            "writings:song%20of%20songs:5:6",
            "writings:daniel:10:1",
            "prophets:isaiah:65:1",
            "prophets:judges:15:18",
            "prophets:i%20kings:2:9",
            "torah:genesis:41:45",
            "prophets:i%20kings:18:26",
            "prophets:i%20kings:9:13",
            "torah:genesis:26:29",
            "prophets:isaiah:9:5"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:12",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:5:2"
        ]
    }
}