{
    "VERSE": "2:122",
    "ARABIC": "يَٰبَنِىٓ إِسْرَٰٓءِيلَ ٱذْكُرُوا۟ نِعْمَتِىَ ٱلَّتِىٓ أَنْعَمْتُ عَلَيْكُمْ وَأَنِّى فَضَّلْتُكُمْ عَلَى ٱلْعَٰلَمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Tribe of Israel! remember the blessing I conferred on you, and that I preferred you over all other beings.",
        "TRANSLATION_1": "O children of Israel, remember the favours I bestowed on you, and made you exalted among the nations of the world.\n",
        "TRANSLATION_2": "O children of Israel, remember that special favour I bestowed upon you, and that I exalted you above all the communities of the world.\n",
        "TRANSLATION_3": "Children of Israel, recall My favor to you and the preference that I gave to you over all the other nations.\n",
        "TRANSLATION_4": "O Descendants of Israel! Remember the favour of Mine which I bestowed upon you and made you superior to all others of your time. (By sending Noble Messengers among you).\n",
        "TRANSLATION_5": "O Children of Israel! Remember My favor which I bestowed upon you and that I preferred you over the nations.\n",
        "TRANSLATION_6": "O children of Israel, call to mind My favor which I bestowed on you and that I made you excel the nations.\n",
        "TRANSLATION_7": "Children of Israel, remember My blessing wherewith I blessed you, and that I have preferred you above all beings;\n",
        "TRANSLATION_8": "O Children of Israel! Remember My favour wherewith I favoured you and how I preferred you to (all) creatures.\n",
        "TRANSLATION_9": "Children of Israel, remember My favour which I have bestowed upon you, and how I preferred you above all other people;\n",
        "TRANSLATION_10": "O Children of Isra'il! remember My favour wherewith favoured you, and that I preferred you over the world.\n",
        "TRANSLATION_11": "O Children of Israel, remember My blessing which I bestowed upon you, and that I gave you an advantage over all the nations.\n",
        "TRANSLATION_12": "O Children of Israel! call to mind the special favour which I bestowed upon you, and that I preferred you to all others (for My Message).\n",
        "TRANSLATION_13": "O Children of Israel! Remember My Favour which I bestowed upon you and that I preferred you to the 'Alamin (mankind and jinns) (of your time-period, in the past).\n",
        "TRANSLATION_14": "Children of Israel, remember My favor which I bestowed upon you and that I preferred your (prophets among you) above the worlds.\n",
        "TRANSLATION_15": "O Children of Israel! Remember My blessing which I bestowed upon you, and that I have favored you over all people.\n",
        "TRANSLATION_16": "O Children of Israel, remember My favor which I have bestowed upon you and that I preferred you over the worlds.\n",
        "TRANSLATION_17": "[2:122] O Children of Israel, remember My favour wherewith I favoured you, and that I have preferred you over all the worlds: a similar verse has already been mentioned.\n",
        "TRANSLATION_18": "20 Allah then mentions His favour upon the Children of Israel, saying: (0 Children of Israel!) Children of Jacob (Remember) recollect (My favour wherewith I favoured you) favoured your forefathers by delivering them from Pharaoh and his people as well as by the blessings and bounties that I favoured them with (and how I preferred you) with Islam (to the worlds) the people of your time.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:47",
            "2:122",
            "2:40",
            "26:22",
            "26:133",
            "23:51",
            "43:16",
            "7:104",
            "45:16",
            "5:7"
        ],
        "BIBLE": [
            "torah:deuteronomy:32:8",
            "torah:numbers:20:24",
            "torah:deuteronomy:3:18",
            "writings:psalms:135:12",
            "writings:i%20chronicles:6:49",
            "prophets:joshua:21:3",
            "writings:psalms:111:6",
            "prophets:joshua:13:24",
            "prophets:ezekiel:28:25",
            "prophets:jeremiah:35:15"
        ]
    }
}