{
    "VERSE": "2:124",
    "ARABIC": "وَإِذِ ٱبْتَلَىٰٓ إِبْرَٰهِۦمَ رَبُّهُۥ بِكَلِمَٰتٍ فَأَتَمَّهُنَّ قَالَ إِنِّى جَاعِلُكَ لِلنَّاسِ إِمَامًا قَالَ وَمِن ذُرِّيَّتِى قَالَ لَا يَنَالُ عَهْدِى ٱلظَّٰلِمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Remember when Ibrahim was tested by his Lord with certain words which he carried out completely. He said, 'I will make you a model for mankind.' He asked, 'And what of my descendants?' He said, 'My contract does not include the wrongdoers.'",
        "TRANSLATION_1": "Remember, when his Lord tried Abraham by a number of commands which he fulfilled, God said to him: \"I will make you a leader among men.\" And when Abraham asked: \"From my progeny too?\" the Lord said: \"My pledge does not include transgressors.\"\n",
        "TRANSLATION_2": "Recall to mind that when his Lord put Abraham to test in certain things and he fulfilled all of them, He said, \"I am going to make you the leader of mankind.\" Abraham humbly asked, \"Does this promise apply to my descendants also?\" He replied, \"My promise does not apply to the transgressors.\"\n",
        "TRANSLATION_3": "When his Lord tested Abraham's faith, (by His words) and he satisfied the test, He said, \"I am appointing you as the leader of mankind.\" Abraham asked, \"Will this leadership also continue through my descendants?\" The Lord replied, \"The unjust do not have the right to exercise My authority.\"\n",
        "TRANSLATION_4": "And (remember) when Ibrahim’s (Abraham’s) Lord tested him in some matters and he fulfilled them; He said, “I am going to appoint you as a leader for mankind”; invoked Ibrahim, “And of my offspring”; He said, “My covenant does not include the unjust (wrong-doers).”\n",
        "TRANSLATION_5": "And (remember) when the Lord of Ibrahim (Abraham) tried him with (certain) commands, which he fulfilled. He (Allah) said (to him), \"Verily, I am going to make you an Imam (a leader) for mankind (to follow you).\" (Ibrahim) said, \"And of my offspring (to make leaders).\" (Allah) said, \"My covenant (prophethood) includes not Zalimin (polytheists and wrongdoers).\"\n",
        "TRANSLATION_6": "And when his Lord tried Ibrahim with certain words, he fulfilled them. He said: Surely I will make you an Imam of men. Ibrahim said: And of my offspring? My covenant does not include the unjust, said He.\n",
        "TRANSLATION_7": "And when his Lord tested Abraham with certain words, and he fulfilled them. He said, 'Behold, I make you a leader for the people.' Said he, 'And of my seed?' He said 'My covenant shall not reach the evildoers.'\n",
        "TRANSLATION_8": "And (remember) when his Lord tried Abraham with (His) commands, and he fulfilled them, He said: Lo! I have appointed thee a leader for mankind. (Abraham) said: And of my offspring (will there be leaders)? He said: My covenant includeth not wrong-doers.\n",
        "TRANSLATION_9": "When his Lord tested Abraham with certain commands and he fulfilled them, He said, \"I will make you a leader of men.\" Abraham asked, \"And what of my descendants?\" He answered, \"My covenant does not extend to the transgressors.\"\n",
        "TRANSLATION_10": "And recall what time his Lord Proved Ibrahim with certain words then he performed them. He said: verily I am going to make thee a leader unto mankind. Ibrahim said: and also of my progeny? Allah said: My covenant shall not reach the wrong-doers.\n",
        "TRANSLATION_11": "When his Lord tested Abraham with certain words and he fulfilled them, He said, ‘I am making you the Imam of mankind.’ Said he, ‘And from among my descendants?’ He said, ‘My pledge does not extend to the unjust.’\n",
        "TRANSLATION_12": "And remember that Abraham was tried by his Lord with certain commands, which he fulfilled: He said: \"I will make thee an Imam to the Nations.\" He pleaded: \"And also (Imams) from my offspring!\" He answered: \"But My Promise is not within the reach of evil-doers.\"\n",
        "TRANSLATION_13": "And (remember) when the Lord of Ibrahim (Abraham) [i.e., Allah] tried him with (certain) Commands, which he fulfilled. He (Allah) said (to him), \"Verily, I am going to make you a leader (Prophet) of mankind.\" [Ibrahim (Abraham)] said, \"And of my offspring (to make leaders).\" (Allah) said, \"My Covenant (Prophethood, etc.) includes not Zalimun (polytheists and wrong-doers).\"\n",
        "TRANSLATION_14": "And when Abraham was tested by His Lord with certain words and he fulfilled them, He said: 'I have appointed you as a leader for the nation' (Abraham) asked: 'And of my descendants' 'My covenant' said He, 'the harmdoers shall not receive it'\n",
        "TRANSLATION_15": "And when his Lord tested Abraham with certain words, and he fulfilled them. He said, “I am making you a leader of humanity.” He said, “And my descendants?” He said, “My pledge does not include the wrongdoers.”\n",
        "TRANSLATION_16": "And [mention, O Muhammad], when Abraham was tried by his Lord with commands and he fulfilled them. [Allah] said, \"Indeed, I will make you a leader for the people.\" [Abraham] said, \"And of my descendants?\" [Allah] said, \"My covenant does not include the wrongdoers.\"\n",
        "TRANSLATION_17": "[2:124] And, mention, when his Lord tested, tried, Abraham (Ibrāhīm: also read Ibrāhām) with certain words, with certain commands and prohibitions with which He charged him: it is said that these included the rituals of the Pilgrimage, the rinsing of the mouth, snuffing up water into the nostrils [to clean them], cleaning of the teeth, trimming facial hair, combing of the hair, trimming the fingernails, shaving armpit and pubic hair, circumcision and washing one’s private parts after elimination; and he fulfilled them, he performed them thoroughly; He, God, exalted, said, to him: ‘I make you a leader, an exemplar in religion, for the people.’ Said he, ‘And of my seed?’, my progeny, make leaders [from among them]; He said, ‘My covenant, of leadership, shall not reach the evildoers’, the disbelievers from among them: this indicates that [the covenant] will reach only those who are not evildoers.\n",
        "TRANSLATION_18": "Allah then mentioned His favour upon Abraham, His close friend, saying: (And when his Lord tried Abraham with some words) He commanded him to fulfil ten traits: five in relation to his head and five to his body, (and he fulfilled them) he complied. It is also said that (And when his Lord tried Abraham with some words) means: with every single word he prayed to Allah, (He said) to him: (Lo! I have appointed you a leader for mankind) a vicegerent that people may emulate you. (He) Abraham (said: And of my offspring) make of my offspring vicegerents that people would emulate? (He) Allah (said: My covenant) with you and My promise to you and the honour and mercy I bestowed upon you (includeth not wrong-doers) from among your offspring; it is also said that this means: My covenant will not include the wrong-doers in the Hereafter but it will include them in this life.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:124",
            "2:128",
            "10:19",
            "7:144",
            "3:38",
            "22:67",
            "11:118",
            "3:9",
            "6:115",
            "38:35"
        ],
        "BIBLE": [
            "torah:exodus:34:10",
            "writings:daniel:6:13",
            "prophets:ii%20kings:7:19",
            "prophets:ii%20kings:7:2",
            "prophets:joel:2:19",
            "prophets:jeremiah:42:4",
            "torah:deuteronomy:4:10",
            "torah:genesis:13:16",
            "prophets:joel:2:17",
            "writings:daniel:8:19"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:1:5"
        ]
    }
}