{
    "VERSE": "2:127",
    "ARABIC": "وَإِذْ يَرْفَعُ إِبْرَٰهِۦمُ ٱلْقَوَاعِدَ مِنَ ٱلْبَيْتِ وَإِسْمَٰعِيلُ رَبَّنَا تَقَبَّلْ مِنَّآ إِنَّكَ أَنتَ ٱلسَّمِيعُ ٱلْعَلِيمُ",
    "ENGLISH": {
        "TRANSLATION_0": "And when Ibrahim built the foundations of the House with Isma'il: 'Our Lord, accept this from us! You are the All-Hearing, the All-Knowing.",
        "TRANSLATION_1": "And when Abraham was raising the plinth of the House with Ishmael, (he prayed): \"Accept this from us, O Lord, for You hear and know everything;\n",
        "TRANSLATION_2": "And remember that when Abraham and Ishmael were raising the walls of the House, they prayed, \"Lord, accept this service from us; You are All-Hearing and All-Knowing.\n",
        "TRANSLATION_3": "While Abraham and Ishmael were raising the foundation of the house, they prayed, \"Lord, accept our labor. You are All-hearing and All-knowing.\n",
        "TRANSLATION_4": "And (remember) when Ibrahim was raising the foundations of the House, along with Ismail; (saying), “Our Lord! Accept it from us; indeed You only are the All Hearing, the All Knowing.”\n",
        "TRANSLATION_5": "And (remember) when Ibrahim and (his son) Isma`il were raising the foundations of the House (the Ka`bah at Makkah), (saying), \"Our Lord! Accept (this service) from us. Verily, You are the Hearer, the Knower.\"\n",
        "TRANSLATION_6": "And when Ibrahim and Ismail raised the foundations of the House: Our Lord! accept from us; surely Thou art the Hearing, the Knowing:\n",
        "TRANSLATION_7": "And when Abraham, and Ishmael with him, raised up the foundations of the House: 'Our Lord, receive this from us; Thou art the All-hearing, the All-knowing;\n",
        "TRANSLATION_8": "And when Abraham and Ishmael were raising the foundations of the House, (Abraham prayed): Our Lord! Accept from us (this duty). Lo! Thou, only Thou, art the Hearer, the Knower.\n",
        "TRANSLATION_9": "And when Abraham and Ishmael were laying the foundations of the House, [they prayed], \"Our Lord, accept this from us; for You are All Hearing, All Knowing.\n",
        "TRANSLATION_10": "And recall what time Ibrahim was raising the foundation of the House and also Ismai'l, praying: our Lord! accept of us; verily Thou! Thou art the Hearer, the Knower!\n",
        "TRANSLATION_11": "As Abraham raised the foundations of the House with Ishmael, [they prayed]: ‘Our Lord, accept it from us! Indeed You are the All-hearing, the All-knowing.\n",
        "TRANSLATION_12": "And remember Abraham and Isma'il raised the foundations of the House (With this prayer): \"Our Lord! Accept (this service) from us: For Thou art the All-Hearing, the All-knowing.\n",
        "TRANSLATION_13": "And (remember) when Ibrahim (Abraham) and (his son) Isma'il (Ishmael) were raising the foundations of the House (the Ka'bah at Makkah), (saying), \"Our Lord! Accept (this service) from us. Verily! You are the All-Hearer, the All-Knower.\"\n",
        "TRANSLATION_14": "And when Abraham and Ishmael raised the foundations of the House (supplicating): 'O our Lord, accept this from us, You are the Hearer, the Knower.\n",
        "TRANSLATION_15": "As Abraham raises the foundations of the House, together with Ishmael, “Our Lord, accept it from us, You are the Hearer, the Knower.\n",
        "TRANSLATION_16": "And [mention] when Abraham was raising the foundations of the House and [with him] Ishmael, [saying], \"Our Lord, accept [this] from us. Indeed You are the Hearing, the Knowing.\n",
        "TRANSLATION_17": "[2:127] And, mention, when Abraham raised up the foundations, the supports or the walls, of the House, building it (min al-bayt, ‘of the House’, is semantically connected to yarfa‘u, ‘raises up’), and Ishmael with him (waIsmā‘īlu is a supplement to Ibrāhīmu), both of them saying: ‘Our Lord! Receive this, building, from us. Truly You are the Hearing, of words, the Knowing, of deeds.\n",
        "TRANSLATION_18": "(And when Abraham and Ishmael were raising the foundation of the House) built the foundation of the House and Ishmael was helping him and when they finished, they prayed: (Our Lord!) our Lord! (Accept from us) the building of Your house. (Lo! Thou, only Thou, art the Hearer) of our prayer, (the Knower) of the answer to this prayer; it is also said that this means: the Knower of our intention in building Your house.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:127",
            "44:6",
            "12:34",
            "3:35",
            "6:115",
            "3:121",
            "21:4",
            "26:220",
            "15:86",
            "7:104"
        ],
        "BIBLE": [
            "prophets:ezekiel:41:8",
            "prophets:i%20kings:9:3",
            "prophets:ii%20samuel:7:27",
            "writings:psalms:137:7",
            "prophets:ezekiel:33:30",
            "prophets:i%20kings:9:15",
            "prophets:jeremiah:5:15",
            "prophets:i%20kings:18:36",
            "prophets:zechariah:4:9",
            "prophets:i%20kings:14:14"
        ]
    }
}