{
    "VERSE": "2:128",
    "ARABIC": "رَبَّنَا وَٱجْعَلْنَا مُسْلِمَيْنِ لَكَ وَمِن ذُرِّيَّتِنَآ أُمَّةً مُّسْلِمَةً لَّكَ وَأَرِنَا مَنَاسِكَنَا وَتُبْ عَلَيْنَآ إِنَّكَ أَنتَ ٱلتَّوَّابُ ٱلرَّحِيمُ",
    "ENGLISH": {
        "TRANSLATION_0": "Our Lord, make us both Muslims submitted to You, and our descendants a Muslim community submitted to You. Show us our rites of worship and turn towards us. You are the Ever-Returning, the Most Merciful.",
        "TRANSLATION_1": "And make us submit, O Lord, to Your will, and our progeny a people submissive to You. Teach us the way of worship and forgive our trespasses, for You are compassionate and merciful;\n",
        "TRANSLATION_2": "Lord, make us Your Muslims (submissive servants) and also raise from our offspring a community which should be Muslim (submissive to Your Will). Show us the ways of Your worship and forbear our shortcomings: You are Forgiving and Merciful.\n",
        "TRANSLATION_3": "Lord, make us good Muslims (one who submits himself to God) and from our descendants make a good Muslim nation. Teach us the rules of worship and accept our repentance; You are All-forgiving and All-merciful.\n",
        "TRANSLATION_4": "“Our Lord! And make us submissive towards you and from our offspring a nation obedient to You – and show us the ways of our worship, and incline towards us with Your mercy; indeed You only are the Most Acceptor of Repentance, the Most Merciful.”\n",
        "TRANSLATION_5": "Our Lord! And make us submissive unto You and of our offspring a nation submissive unto You, and show us our Manasik, and accept our repentance. Truly, You are the One Who accepts repentance, the Most Merciful.\n",
        "TRANSLATION_6": "Our Lord! and make us both submissive to Thee and (raise) from our offspring a nation submitting to Thee, and show us our ways of devotion and turn to us (mercifully), surely Thou art the Oft-returning (to mercy), the Merciful.\n",
        "TRANSLATION_7": "and, our Lord, make us submissive to Thee, and of our seed a nation submissive to Thee; and show us our holy rites, and turn towards us; surely Thou turnest, and art All-compassionate;\n",
        "TRANSLATION_8": "Our Lord! And make us submissive unto Thee and of our seed a nation submissive unto Thee, and show us our ways of worship, and relent toward us. Lo! Thou, only Thou, art the Relenting, the Merciful.\n",
        "TRANSLATION_9": "Lord, make us submissive to You; make of our descendants a nation that will submit to You. Teach us our rites of worship and turn to us with mercy; You are the Forgiving One and the Merciful.\n",
        "TRANSLATION_10": "Our Lord! make us twain submissive unto Thee, and of our progeny community submissive unto Thee, and show us our rites, and relent toward us! verily Thou! Thou art the Relentant, the Merciful!\n",
        "TRANSLATION_11": "‘Our Lord, make us submissive to You, and [raise] from our progeny a nation submissive to You, and show us our rites [of worship], and turn to us clemently. Indeed You are the All-clement, the All-merciful.’\n",
        "TRANSLATION_12": "Our Lord! make of us Muslims, bowing to Thy (Will), and of our progeny a people Muslim, bowing to Thy (will); and show us our place for the celebration of (due) rites; and turn unto us (in Mercy); for Thou art the Oft-Returning, Most Merciful.\n",
        "TRANSLATION_13": "Our Lord! And make us submissive unto You and of our offspring a nation submissive unto You, and show us our Manasik (all the ceremonies of pilgrimage - Hajj and 'Umrah, etc.), and accept our repentance. Truly, You are the One Who accepts repentance, the Most Merciful.\n",
        "TRANSLATION_14": "Our Lord, make us both submissive to You, and of our descendants a submissive nation to You. Show us our rites and accept us; You are the Receiver of Repentance, the Merciful.\n",
        "TRANSLATION_15": "Our Lord, and make us submissive to You, and from our descendants a community submissive to You. And show us our rites, and accept our repentance. You are the Acceptor of Repentance, the Merciful.\n",
        "TRANSLATION_16": "Our Lord, and make us Muslims [in submission] to You and from our descendants a Muslim nation [in submission] to You. And show us our rites and accept our repentance. Indeed, You are the Accepting of repentance, the Merciful.\n",
        "TRANSLATION_17": "[2:128] Our Lord! And make us submissive, compliant, to You and, make, of our seed, our progeny, a community, a people, submissive to You (min [in the phrase min dhurriyyatinā, ‘of our seed’] here is partitive, and is used here in accordance with God’s above-mentioned saying My covenant shall not reach the evildoers); and show us, teach us, our holy rites, our ceremonies for worship or for the pilgrimage, and relent to us. Surely You are the Relenting, the Merciful: they asked Him to turn towards them, despite their [moral] impeccability, out of humbleness and in order to teach their progeny.\n",
        "TRANSLATION_18": "21 (Our Lord!) our Lord! (And make us submissive) obedient and sincere (unto Thee) by not ascribing any partners to you and through worshipping You (and of our seed a nation submissive) obedient and sincere (unto Thee) by not ascribing any partners to you and through worshipping You, (and show us our rites) teach us the rites of our pilgrimage, (and relent towards us) overlook our shortcomings. (Lo! Thou, only Thou, art the Relenting) You who overlooks shortcomings, (the Merciful) towards the believers.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:128",
            "22:67",
            "2:37",
            "2:124",
            "26:122",
            "26:9",
            "26:104",
            "26:159",
            "26:68",
            "26:175"
        ],
        "BIBLE": [
            "prophets:joel:2:17",
            "prophets:isaiah:63:17",
            "prophets:isaiah:49:11",
            "torah:exodus:34:10",
            "writings:psalms:69:17",
            "torah:deuteronomy:7:2",
            "prophets:zephaniah:3:20",
            "prophets:isaiah:26:13",
            "torah:exodus:23:27",
            "torah:deuteronomy:26:19"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:3"
        ]
    }
}