{
    "VERSE": "2:13",
    "ARABIC": "وَإِذَا قِيلَ لَهُمْ ءَامِنُوا۟ كَمَآ ءَامَنَ ٱلنَّاسُ قَالُوٓا۟ أَنُؤْمِنُ كَمَآ ءَامَنَ ٱلسُّفَهَآءُ أَلَآ إِنَّهُمْ هُمُ ٱلسُّفَهَآءُ وَلَٰكِن لَّا يَعْلَمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "When they are told, 'Have iman in the way that the people have iman,' they say, 'What! Are we to have iman in the way that fools have iman?' No indeed! They are the fools, but they do not know it.",
        "TRANSLATION_1": "When asked to believe as others do, they say: \"Should we believe like fools?\" And yet they are the fools, even though they do not know.\n",
        "TRANSLATION_2": "And when it is said to them, \"Believe sincerely as the other people have believed\", they reply, \"Should we believe as fools have believed?\" Beware! they themselves are the fools, but they know it not.\n",
        "TRANSLATION_3": "When they are told to believe as everyone else does, they say, \"Should we believe as fools do?\" In fact, they themselves are fools, but they do not know it.\n",
        "TRANSLATION_4": "And when it is said to them, “Believe as the others believe”, they say, “Shall we believe as the foolish believe?” It is they who are the fools, but they do not know.\n",
        "TRANSLATION_5": "And when it is said to them: Believe as the people believe,\" They say: \"Shall we believe as the fools have believed\" Verily, they are the fools, but they do not know.\n",
        "TRANSLATION_6": "And when it is said to them: Believe as the people believe, they say: Shall we believe as the fools believe? Now surely they themselves are the fools, but they do not know.\n",
        "TRANSLATION_7": "When it is said to them, 'Believe as the people believe', they say, 'Shall we believe, as fools believe?' Truly, they are the foolish ones, but they do not know.\n",
        "TRANSLATION_8": "And when it is said unto them: believe as the people believe, they say: shall we believe as the foolish believe? are not they indeed the foolish? But they know not.\n",
        "TRANSLATION_9": "And when they are told, \"Believe as other people have believed,\" they say, \"Are we to believe just as fools believe?\" Surely they are the fools, even though they do not realize it.\n",
        "TRANSLATION_10": "And when it said unto them: believe even as mankind have believed, they say: shall we believe even as the fools have believed? Lo! verily it is they who are the fools; and yet they know not.\n",
        "TRANSLATION_11": "And when they are told, ‘Believe like the people who have believed,’ they say, ‘Shall we believe like the fools who have believed?’ Behold! They are themselves the fools, but they do not know.\n",
        "TRANSLATION_12": "When it is said to them: \"Believe as the others believe:\" They say: \"Shall we believe as the fools believe?\" Nay, of a surety they are the fools, but they do not know.\n",
        "TRANSLATION_13": "And when it is said to them (hypocrites): \"Believe as the people (followers of Muhammad Peace be upon him, Al-Ansar and Al-Muhajirun) have believed,\" they say: \"Shall we believe as the fools have believed?\" Verily, they are the fools, but they know not.\n",
        "TRANSLATION_14": "When it is said to them: 'Believe as (other) people believe,' they reply, 'Are we to believe as fools believe?' It is they who are the fools, if only they knew!\n",
        "TRANSLATION_15": "And when it is said to them, “Believe as the people have believed,” they say, “Shall we believe as the fools have believed?” In fact, it is they who are the fools, but they do not know.\n",
        "TRANSLATION_16": "And when it is said to them, \"Believe as the people have believed,\" they say, \"Should we believe as the foolish have believed?\" Unquestionably, it is they who are the foolish, but they know [it] not.\n",
        "TRANSLATION_17": "[2:13] When it is said to them, ‘Believe as the people believe’, that is, as the Companions of the Prophet (s), They say, ‘Shall we believe as fools believe?’, that is, as the ignorant do? No we do not follow their way. The exalted One refutes them, saying: Truly, they are the foolish ones, but they know, this, not.\n",
        "TRANSLATION_18": "(And when it is said unto them) i.e. to Jews, (believe) in Muhammad (pbuh) (as the people believe), i.e. 'Abdullah Ibn Salam and his companions, (they say: Shall we believe) in Muhammad (pbuh) and the Qur'an, (as the foolish believe?), i.e. as the stupid and ignorant do, (Surely they are the fools) the stupid and ignorant. (But they know not) that they are so.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:13",
            "29:2",
            "26:39",
            "2:12",
            "83:2",
            "46:6",
            "4:108",
            "2:44",
            "10:44",
            "43:76"
        ],
        "BIBLE": [
            "prophets:i%20samuel:20:7",
            "torah:genesis:44:15",
            "torah:genesis:43:7",
            "writings:ruth:4:4",
            "prophets:jeremiah:4:10",
            "prophets:jonah:1:10",
            "prophets:jeremiah:5:4",
            "prophets:ezekiel:6:10",
            "torah:numbers:14:31",
            "prophets:ii%20kings:20:19"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:2:5"
        ]
    }
}