{
    "VERSE": "2:130",
    "ARABIC": "وَمَن يَرْغَبُ عَن مِّلَّةِ إِبْرَٰهِۦمَ إِلَّا مَن سَفِهَ نَفْسَهُۥ وَلَقَدِ ٱصْطَفَيْنَٰهُ فِى ٱلدُّنْيَا وَإِنَّهُۥ فِى ٱلْءَاخِرَةِ لَمِنَ ٱلصَّٰلِحِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Who would deliberately renounce the religion of Ibrahim except someone who reveals himself to be a fool? We chose him in this world and in the Next World he will be one of the righteous.",
        "TRANSLATION_1": "Who will turn away from the creed of Abraham but one dull of soul? We made him the chosen one here in the world, and one of the best in the world to come,\n",
        "TRANSLATION_2": "Now, who else can have aversion to the way of Abraham but the one who has debased himself with folly and ignorance? Abraham was the man whom We chose for Our service in this world, and in the Next World he shall be among the righteous.\n",
        "TRANSLATION_3": "No one turns away from Abraham's Tradition except one who makes a fool of himself. To Abraham We have granted distinction in this world and in the life hereafter he will be among the righteous ones.\n",
        "TRANSLATION_4": "And who will renounce the religion of Ibrahim except him who is a fool at heart? We indeed chose him (Ibrahim) in this world; and indeed in the Hereafter he is among those worthy of being closest to Us.\n",
        "TRANSLATION_5": "And who turns away from the religion of Ibrahim (i.e. Islamic Monotheism) except him who fools himself Truly, We chose him in this world and verily, in the Hereafter he will be among the righteous.\n",
        "TRANSLATION_6": "And who forsakes the religion of Ibrahim but he who makes himself a fool, and most certainly We chose him in this world, and in the hereafter he is most surely among the righteous.\n",
        "TRANSLATION_7": "Who therefore shrinks from the religion of Abraham, except he be foolish-minded? Indeed, We chose him in the present world, and in the world to come he shall be among the righteous.\n",
        "TRANSLATION_8": "And who forsaketh the religion of Abraham save him who befooleth himself? Verily We chose him in the world, and lo! in the Hereafter he is among the righteous.\n",
        "TRANSLATION_9": "Who but a foolish man would turn away from the religion of Abraham? We chose him in this world, and in the Hereafter he shall be among the righteous.\n",
        "TRANSLATION_10": "And who shall be averse from the faith of Ibrahim, save one who befooleth his soul! And assuredly We chose him in this World, and verily he in the Hereafter shall be of the righteous.\n",
        "TRANSLATION_11": "And who will [ever] forsake Abraham’s creed except one who debases himself? We certainly chose him in the [present] world, and in the Hereafter he will indeed be among the Righteous.\n",
        "TRANSLATION_12": "And who turns away from the religion of Abraham but such as debase their souls with folly? Him We chose and rendered pure in this world: And he will be in the Hereafter in the ranks of the Righteous.\n",
        "TRANSLATION_13": "And who turns away from the religion of Ibrahim (Abraham) (i.e. Islamic Monotheism) except him who befools himself? Truly, We chose him in this world and verily, in the Hereafter he will be among the righteous.\n",
        "TRANSLATION_14": "And who has no desire for the religion of Abraham, except he who fooled himself? We chose him in this world, and in the Everlasting world, he shall be among the righteous.\n",
        "TRANSLATION_15": "Who would forsake the religion of Abraham, except he who fools himself? We chose him in this world, and in the Hereafter he will be among the righteous.\n",
        "TRANSLATION_16": "And who would be averse to the religion of Abraham except one who makes a fool of himself. And We had chosen him in this world, and indeed he, in the Hereafter, will be among the righteous.\n",
        "TRANSLATION_17": "[2:130] Who therefore, meaning ‘none’, shrinks from the religion of Abraham, abandoning it, except he who fools himself?, that is to say, either the one who ignores that his soul has been created for God, and that it is obliged to worship Him, or the one who treats it with frivolity and degrades it. Indeed We chose him, We elected him, in this world, for prophethood and friendship, and in the Hereafter he shall be among the righteous, those of the high stations [al-darajāt al-‘ulā, cf. Q. 20:75].\n",
        "TRANSLATION_18": "(And who forsaketh the religion of Abraham) renounces the Religion of Abraham and his practices (save him who befooleth himself?) has ruined himself, lost his mind or is foolish? (Verily We chose him) i.e. Abraham (in the world) by taking him as a friend; as it is said this means: We have chosen him in this world by bestowing upon him prophethood, Islam and goodly offspring, (and lo! In the Hereafter he is among the righteous ones) with his forefathers, the messengers, in Paradise.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:130",
            "16:122",
            "3:22",
            "41:31",
            "38:7",
            "3:145",
            "3:152",
            "33:57",
            "42:20",
            "29:27"
        ],
        "BIBLE": [
            "prophets:jeremiah:32:40",
            "prophets:isaiah:55:3",
            "torah:exodus:23:27",
            "prophets:ii%20samuel:23:5",
            "prophets:isaiah:29:21",
            "writings:psalms:85:14",
            "torah:deuteronomy:28:29",
            "prophets:ezekiel:21:24",
            "torah:exodus:30:16",
            "prophets:isaiah:50:2"
        ]
    }
}