{
    "VERSE": "2:138",
    "ARABIC": "صِبْغَةَ ٱللَّهِ وَمَنْ أَحْسَنُ مِنَ ٱللَّهِ صِبْغَةً وَنَحْنُ لَهُۥ عَٰبِدُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "The colouring of Allah - and what colouring could be better than Allah's? It is Him we worship.",
        "TRANSLATION_1": "We have taken the colouring of God; and whose shade is better than God's? Him alone we worship.\"\n",
        "TRANSLATION_2": "Say, \"Take Allah's colour, and who can give a better colour than Allah? Therefore, we worship and submit to Him alone. \"\n",
        "TRANSLATION_3": "Say, \"Belief in God and following the guidance of Islam are God's means of purification for us. Islam is the baptism of God. No one is a better baptizer than He and we Muslims worship Him.\"\n",
        "TRANSLATION_4": "“We have taken the colour (religion) of Allah; and whose colour (religion) is better than that of Allah? And only Him do we worship.”\n",
        "TRANSLATION_5": "[Our Sibghah (religion) is] the Sibghah of Allah (Islam) and which Sibghah can be better than Allah's And we are His worshippers.\n",
        "TRANSLATION_6": "(Receive) the baptism of Allah, and who is better than Allah in baptising? and Him do we serve.\n",
        "TRANSLATION_7": "the baptism of God; and who is there that baptizes fairer than God? Him we are serving.\n",
        "TRANSLATION_8": "(We take our) colour from Allah, and who is better than Allah at colouring. We are His worshippers.\n",
        "TRANSLATION_9": "We take on God's own dye. Who has a better dye than God's? We worship Him alone.\n",
        "TRANSLATION_10": "Ours is the dye of Allah! and who is better at dyeing than Allah! And we are His worshippers.\n",
        "TRANSLATION_11": "‘The baptism of Allah, and who baptizes better than Allah? And Him do we worship.’\n",
        "TRANSLATION_12": "(Our religion is) the Baptism of Allah: And who can baptize better than Allah? And it is He Whom we worship.\n",
        "TRANSLATION_13": "[Our Sibghah (religion) is] the Sibghah (Religion) of Allah (Islam) and which Sibghah (religion) can be better than Allah's? And we are His worshippers. [Tafsir Ibn Kathir.]\n",
        "TRANSLATION_14": "The (indelible) marking of Allah. And who marks better than Allah! And for Him we are worshipers.\n",
        "TRANSLATION_15": "God’s coloring. And who gives better coloring than God? “And we are devoted to Him.”\n",
        "TRANSLATION_16": "[And say, \"Ours is] the religion of Allah. And who is better than Allah in [ordaining] religion? And we are worshippers of Him.\"\n",
        "TRANSLATION_17": "[2:138] The mark of God (sibghata’Llāhi: a verbal noun reaffirming the earlier āmannā, and it is in the accusative, because of the verbal construction implied, that is to say, sabaghanā’Llāhu, ‘God has marked us’): this denotes His religion, the one towards which He made human beings naturally inclined, as it leaves its mark on a person, in the same way that a dye leaves its mark on a garment; and who has, that is, none [has], a better mark (sibghatan, ‘marking’, is for specification) than God? And Him we worship: the Jews said to the Muslims, ‘We are the people of the first Book and our direction of prayer (qibla) is more ancient, and prophets were never sent from among the Arabs; if Muhammad were a prophet, he would have been one of us’. Thus, the following was revealed:\n",
        "TRANSLATION_18": "((We take our) colour from Allah) i.e. follow the Religion of Allah, (and who is better than Allah at colouring) better than the Religion of Allah. (And We are His worshippers) say: we are monotheists and acknowledge that we worship Him and declare that there is only one true God.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:138",
            "41:33",
            "24:38",
            "5:50",
            "4:85",
            "4:125",
            "53:62",
            "8:64",
            "21:98",
            "39:18"
        ],
        "BIBLE": [
            "prophets:judges:3:6",
            "prophets:joshua:23:16",
            "torah:genesis:31:9",
            "prophets:judges:15:6",
            "writings:job:1:21",
            "torah:numbers:18:6",
            "writings:ii%20chronicles:34:33",
            "prophets:ezekiel:18:13",
            "torah:numbers:8:16",
            "prophets:ii%20samuel:4:10"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:2:5",
            
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:8"
        ]
    }
}