{
    "VERSE": "2:14",
    "ARABIC": "وَإِذَا لَقُوا۟ ٱلَّذِينَ ءَامَنُوا۟ قَالُوٓا۟ ءَامَنَّا وَإِذَا خَلَوْا۟ إِلَىٰ شَيَٰطِينِهِمْ قَالُوٓا۟ إِنَّا مَعَكُمْ إِنَّمَا نَحْنُ مُسْتَهْزِءُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "When they meet those who have iman, they say, 'We have iman.' But then when they go apart with their shaytans, they say, 'We are really with you. We were only mocking.'",
        "TRANSLATION_1": "When they meet the faithful they say: \"We believe;\" but when alone with the devils (their fellows), they say: \"We are really with you; we were joking.\"\n",
        "TRANSLATION_2": "When they meet those who believe, they say, \"We, too, are believers\", but when they privily meet their evil geniuses, they say, \"Indeed we are with you: we are only mocking at these people\".\n",
        "TRANSLATION_3": "To the believers they declare belief and, in secret to their own devils, they say, \"We were only mocking\".\n",
        "TRANSLATION_4": "And when they meet with the believers, they say, “We believe”; and when they are alone with their devils, they say, “We are undoubtedly with you, we were just mocking!”\n",
        "TRANSLATION_5": "And when they meet those who believe, they say: \"We believe,\" but when they are alone with their Shayatin (devils), they say: \"Truly, we are with you; verily, we were but mocking.\"\n",
        "TRANSLATION_6": "And when they meet those who believe, they say: We believe; and when they are alone with their Shaitans, they say: Surely we are with you, we were only mocking.\n",
        "TRANSLATION_7": "When they meet those who believe, they say, 'We believe'; but when they go privily to their Satans, they say, 'We are with you; we were only mocking.'\n",
        "TRANSLATION_8": "And when they fall in with those who believe, they say: We believe; but when they go apart to their devils they declare: Lo! we are with you; verily we did but mock.\n",
        "TRANSLATION_9": "When they meet those who believe, they say, \"We believe.\" But when they are alone with their evil leaders, they say, \"We are really with you; we were only mocking.\"\n",
        "TRANSLATION_10": "And when they meet those who have believed, they say: We believe. And when they are alone with their Satans, they say: verily we are with you, we were but mocking.\n",
        "TRANSLATION_11": "When they meet the faithful, they say, ‘We believe,’ but when they are alone with their devils, they say, ‘We are with you; we were only deriding [them].’\n",
        "TRANSLATION_12": "When they meet those who believe, they say: \"We believe;\" but when they are alone with their evil ones, they say: \"We are really with you: We (were) only jesting.\"\n",
        "TRANSLATION_13": "And when they meet those who believe, they say: \"We believe,\" but when they are alone with their Shayatin (devils - polytheists, hypocrites, etc.), they say: \"Truly, we are with you; verily, we were but mocking.\"\n",
        "TRANSLATION_14": "When they meet those who believe, they say, 'We, too believe.' But when they are alone with their devils, they say to them: 'We follow none but you, we were only mocking\n",
        "TRANSLATION_15": "And when they come across those who believe, they say, “We believe”; but when they are alone with their devils, they say, “We are with you; we were only ridiculing.”\n",
        "TRANSLATION_16": "And when they meet those who believe, they say, \"We believe\"; but when they are alone with their evil ones, they say, \"Indeed, we are with you; we were only mockers.\"\n",
        "TRANSLATION_17": "[2:14] When they meet (laqū is actually laquyū, but the damma has been omitted, being too cumbersome for pronunciation; likewise the yā’ [is omitted], because it is unvocalised and is followed by a wāw); those who believe, they say, ‘We believe’; but when they go apart, away from them and return, to their devils, their leaders, they say, ‘We are with you, in religion; we were only mocking, them [the believers] by feigning belief.\n",
        "TRANSLATION_18": "(And when they), i.e. the hypocrites, (fall in with those who believe), i.e. Abu Bakr and his companions, (they say: We believe) deep in our hearts and are genuine in our faith just as you believe deep in your hearts and are genuine in your faith; (but when they go apart to their devils), to their soothsayers and leaders who were five in number, namely, Ka'b Ibn al-Ashraf in Medina, Abu Burdah al-Aslami in Banu Aslam, Ibn al-Sawda' in Historic Syria (al-Sham), 'Abd al-Dar in Juhaynah and 'Awf Ibn 'Amir in Banu 'Amir, (they declare) to their leaders: (Lo! We are with you) we follow your religion in secret; (surely we did but mock) Muhammad (pbuh) and his Companions.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:14",
            "7:201",
            "7:76",
            "26:210",
            "37:24",
            "11:122",
            "2:156",
            "3:175",
            "16:100",
            "47:25"
        ],
        "BIBLE": [
            "prophets:ii%20samuel:2:27",
            "prophets:i%20kings:20:10",
            "writings:ruth:1:16",
            "torah:genesis:44:4",
            "prophets:joshua:14:9",
            "prophets:i%20kings:18:21",
            "torah:deuteronomy:12:30",
            "prophets:ii%20kings:5:21",
            "writings:i%20chronicles:17:7",
            "prophets:hosea:2:25"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:3"
        ]
    }
}