{
    "VERSE": "2:147",
    "ARABIC": "ٱلْحَقُّ مِن رَّبِّكَ فَلَا تَكُونَنَّ مِنَ ٱلْمُمْتَرِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "The truth is from your Lord, so on no account be among the doubters.",
        "TRANSLATION_1": "The truth is from your Lord, so be not among those who are sceptics.\n",
        "TRANSLATION_2": "This is in fact a Commandment from your Lord; so you should not have any doubt concerning this.\n",
        "TRANSLATION_3": "Never doubt that the essence of truth comes from your Lord\n",
        "TRANSLATION_4": "This is the Truth from your Lord, therefore (O those who listen) beware – do not be in doubt.\n",
        "TRANSLATION_5": "This is) the truth from your Lord. So be you not one of those who doubt.\n",
        "TRANSLATION_6": "The truth is from your Lord, therefore you should not be of the doubters.\n",
        "TRANSLATION_7": "The truth comes from thy Lord; then be not among the doubters.\n",
        "TRANSLATION_8": "It is the Truth from thy Lord (O Muhammad), so be not thou of those who waver.\n",
        "TRANSLATION_9": "Truth is what comes from your Lord; therefore, do not be of those who doubt.\n",
        "TRANSLATION_10": "The truth is from thy Lord; be then thou not of the doubters.\n",
        "TRANSLATION_11": "This is the truth from your Lord; so do not be among the skeptics.\n",
        "TRANSLATION_12": "The Truth is from thy Lord; so be not at all in doubt.\n",
        "TRANSLATION_13": "(This is) the truth from your Lord. So be you not one of those who doubt.\n",
        "TRANSLATION_14": "The truth comes from your Lord so do not be among the doubters.\n",
        "TRANSLATION_15": "The truth is from your Lord, so do not be a skeptic.\n",
        "TRANSLATION_16": "The truth is from your Lord, so never be among the doubters.\n",
        "TRANSLATION_17": "[2:147] The truth comes from your Lord; then be not among the doubters, who doubt it, that is to say, ‘[be not] of such a disposition’, which is more eloquent than merely saying, ‘do not waver’.\n",
        "TRANSLATION_18": "(It is the Truth from thy Lord (0 Muhammad)) that you are a Prophet sent by Allah. (So be not thou of those who waver) who doubt whether they know or not.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:147",
            "3:60",
            "15:55",
            "10:94",
            "68:50",
            "37:100",
            "15:98",
            "10:53",
            "8:5",
            "108:2"
        ],
        "BIBLE": [
            "writings:psalms:119:151",
            "prophets:i%20samuel:15:13",
            "writings:psalms:86:9",
            "prophets:jeremiah:32:23",
            "writings:psalms:119:6",
            "writings:psalms:119:166",
            "prophets:jeremiah:50:31",
            "prophets:jeremiah:49:4",
            "prophets:ii%20samuel:7:28",
            "prophets:ezekiel:36:22"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:10",
            "Sefer%20Yetzirah:1:14",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:4:12"
        ]
    }
}