{
    "VERSE": "2:150",
    "ARABIC": "وَمِنْ حَيْثُ خَرَجْتَ فَوَلِّ وَجْهَكَ شَطْرَ ٱلْمَسْجِدِ ٱلْحَرَامِ وَحَيْثُ مَا كُنتُمْ فَوَلُّوا۟ وُجُوهَكُمْ شَطْرَهُۥ لِئَلَّا يَكُونَ لِلنَّاسِ عَلَيْكُمْ حُجَّةٌ إِلَّا ٱلَّذِينَ ظَلَمُوا۟ مِنْهُمْ فَلَا تَخْشَوْهُمْ وَٱخْشَوْنِى وَلِأُتِمَّ نِعْمَتِى عَلَيْكُمْ وَلَعَلَّكُمْ تَهْتَدُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Wherever you come from, turn your face to the Masjid al-Haram. Wherever you are, turn your faces towards it so that people will have no argument against you - except for those among them who do wrong and then you should not fear them but rather fear Me - and so that I may complete My blessing upon you so that hopefully you will be guided.",
        "TRANSLATION_1": "Whichever place you come from turn towards the Holy Mosque, and wherever you are, turn your faces towards it so that people may have no cause for argument against you, except such among them as are wicked. But do not fear them, fear Me that I may accomplish My favours on you, and you may find the right way perchance.\n",
        "TRANSLATION_2": "At whatever place you may be, you must turn your face towards the Masjid Haram, and wherever you may be, you must turn your face towards the same at prayer so that people might not find an argument against you. As for the unjust people, they will never stop talking; so do not fear them but fear Me -- (Do this) so that I may complete My favour upon you and you may find the way to real success,\n",
        "TRANSLATION_3": "(Muhammad) wherever you go, turn your face to the Sacred Mosque and Muslims, wherever you are, turn your faces in the same direction so that no group of people, except the unjust among them, would have any reason against you and so that I may establish My commandments for your people to have proper guidance. (The unjust may criticize you) but do not fear them, fear only Me.\n",
        "TRANSLATION_4": "And O dear Prophet (Mohammed – peace and blessings be upon him) wherever you come from, turn your face towards the Sacred Mosque; and wherever you may be, O Muslims, turn your faces towards it only, so that people may not have an argument against you – except those among them who do injustice; therefore do not fear them, and fear Me; and this is in order that I complete My favour upon you and that you may attain guidance. –\n",
        "TRANSLATION_5": "And from wheresoever you start forth (for prayers), turn your face in the direction of Al-Masjid Al-Haram (at Makkah), and wheresoever you are, turn your faces towards it (when you pray) so that men may have no argument against you except those of them that are wrongdoers, so fear them not, but fear Me! ـ And so that I may complete My blessings on you and that you may be guided.\n",
        "TRANSLATION_6": "And from whatsoever place you come forth, turn your face towards the Sacred Mosque; and wherever you are turn your faces towards it, so that people shall have no accusation against you, except such of them as are unjust; so do not fear them, and fear Me, that I may complete My favor on you and that you may walk on the right course.\n",
        "TRANSLATION_7": "From whatsoever place thou issuest, turn thy face towards the Holy Mosque; and wherever you may be, turn your faces towards it, that the people may not have any argument against you, excepting the evildoers of them; and fear you them not, but fear you Me; and that I may perfect My blessing upon you, and that haply so you may be guided;\n",
        "TRANSLATION_8": "Whencesoever thou comest forth turn thy face toward the Inviolable Place of Worship; and wheresoever ye may be (O Muslims) turn your faces toward it (when ye pray) so that men may have no argument against you, save such of them as do injustice - Fear them not, but fear Me! - and so that I may complete My grace upon you, and that ye may be guided.\n",
        "TRANSLATION_9": "wherever you come from, turn your face to the Sacred Mosque; wherever you may be, turn your faces towards it, so that people will not have any argument against you except for the wrongdoers among them. Do not fear them; fear Me, so that I may perfect My favour to you and you may be rightly guided.\n",
        "TRANSLATION_10": "And from whencesoever thou goest forth, turn thy face toward the Sacred Mosque, and wheresoever ye be, turn your face toward it, lest there should be with people an argument against you, except those of them who do wrong so fear them not, but fear Me; so that I may accomplish My favour upon you, and that ye may remain guided-\n",
        "TRANSLATION_11": "And whencesoever you may go out, turn your face towards the Holy Mosque, and wherever you may be, turn your faces towards it, so that the people may have no allegation against you, neither those of them who are wrongdoers. So do not fear them, but fear Me, that I may complete My blessing on you and so that you may be guided.\n",
        "TRANSLATION_12": "So from whencesoever Thou startest forth, turn Thy face in the direction of the sacred Mosque; and wheresoever ye are, Turn your face thither: that there be no ground of dispute against you among the people, except those of them that are bent on wickedness; so fear them not, but fear Me; and that I may complete My favours on you, and ye May (consent to) be guided;\n",
        "TRANSLATION_13": "And from wheresoever you start forth (for prayers), turn your face in the direction of Al-Masjid-al-Haram (at Makkah), and wheresoever you are, turn your faces towards, it (when you pray) so that men may have no argument against you except those of them that are wrong-doers, so fear them not, but fear Me! - And so that I may complete My Blessings on you and that you may be guided.\n",
        "TRANSLATION_14": "From wherever you emerge, turn your face towards the Sacred Mosque, and wherever you are, face towards it, so that the people will have no argument against you, except the harmdoers among them. Do not fear them, fear Me, so that I will perfect My Favor to you and that you will be guided.\n",
        "TRANSLATION_15": "And wherever you come from, turn your face towards the Sacred Mosque. And wherever you may be, turn your faces towards it. So that the people may not have any argument against you—except those who do wrong among them. So do not fear them, but fear Me, that I may complete My blessings upon you, and that you may be guided.\n",
        "TRANSLATION_16": "And from wherever you go out [for prayer], turn your face toward al-Masjid al-Haram. And wherever you [believers] may be, turn your faces toward it in order that the people will not have any argument against you, except for those of them who commit wrong; so fear them not but fear Me. And [it is] so I may complete My favor upon you and that you may be guided.\n",
        "TRANSLATION_17": "[2:150] From whatever place you issue, turn your face towards the Sacred Mosque; and wherever you may be, turn your faces towards it (all of which is being repeated for emphasis), so that there be not any argument from the people, the Jews or the idolaters, against you, [so that there be not] any cause for contention regarding the change to a different direction of prayer. In this way, their contentions against you will cease to exist,   both [the contentions] of the Jews when they say, ‘He [Muhammad (s)] rejects our religion, but follows our direction of prayer’, and of the idolaters when they say, ‘He [Muhammad (s)] claims to follow the creed of Abraham, but he contravenes his [Abraham’s] qibla’; excepting the evildoers among them, acting in obstinacy, who will say, ‘He [Muhammad (s)] only changed to this direction because of his [natural] inclination towards the [idolatrous] religion of his forefathers’. The exceptive statement [indicated by illā] is a continuous one, the meaning being: ‘No one will have anything to say against you, except for what these people say’; and do not fear them, do not fear their arguing [with you] regarding the change to it [the Ka‘ba], but fear Me, by complying with My command; and that I may perfect My grace upon you, by guiding you to the principal rituals of your religion, and that you may be guided, to the truth (wa-li-utimma, ‘that I may perfect’, is a supplement to li-allā yakūna, ‘that there be not’).\n",
        "TRANSLATION_18": "(Whencesoever thou comest forth) you are to (turn thy face) in prayer (towards the Inviolable Place of Worship; and wheresoever ye may be (0 Muslims)) on land or at sea (turn your faces) in prayer (towards it (when ye pray) so that men) 'Abdullah Ibn Salam and his Companions (may have no argument against you) regarding the changing of the Qiblah because in their Scripture the Inviolable Place of Worship was the Qiblah of Abraham; therefore if you pray towards it, they will have no argument against you, (save such of them as do injustice) nor would those who transgressed with their words have any argument against you, and these included Ka'b Ibn Ashraf and the Arab idolaters (-Fear them not) regarding the changing of the Qiblah, (but fear Me) in leaving the old Qiblah (-so that I may complete My grace upon you) by giving you a Qiblah just as I have completed for you your Religion, (and that you be guided) to the Qiblah of Abraham.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:150",
            "2:149",
            "2:144",
            "2:191",
            "8:34",
            "9:7",
            "30:30",
            "17:7",
            "2:24",
            "22:25"
        ],
        "BIBLE": [
            "prophets:judges:20:42",
            "writings:job:37:12",
            "torah:exodus:20:21",
            "writings:ii%20chronicles:7:14",
            "torah:exodus:33:16",
            "prophets:i%20samuel:9:13",
            "prophets:ii%20samuel:17:12",
            "prophets:ezekiel:33:11",
            "prophets:ezekiel:3:20",
            "prophets:i%20kings:2:3"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:1:6"
        ]
    }
}