{
    "VERSE": "2:154",
    "ARABIC": "وَلَا تَقُولُوا۟ لِمَن يُقْتَلُ فِى سَبِيلِ ٱللَّهِ أَمْوَٰتٌۢ بَلْ أَحْيَآءٌ وَلَٰكِن لَّا تَشْعُرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Do not say that those who are killed in the Way of Allah are dead. On the contrary, they are alive but you are not aware of it.",
        "TRANSLATION_1": "Do not say that those who are killed in the way of God, are dead, for indeed they are alive, even though you are not aware.\n",
        "TRANSLATION_2": "And do not say of those who are slain in the way of Allah, \"they are dead.\" In fact, they are alive but you do not perceive that life.\n",
        "TRANSLATION_3": "Do not consider those who are slain for the cause of God to be dead. They are alive but you are unaware of them.\n",
        "TRANSLATION_4": "And do not utter regarding those who are slain in Allah's cause as “dead”; in fact they are alive, but it is you who are unaware.\n",
        "TRANSLATION_5": "And say not of those who are killed in the way of Allah, \"They are dead.\" Nay, they are living, but you perceive (it) not.\n",
        "TRANSLATION_6": "And do not speak of those who are slain in Allah's way as dead; nay, (they are) alive, but you do not perceive.\n",
        "TRANSLATION_7": "And say not of those slain in God's way, 'They are dead'; rather they are living, but you are not aware.\n",
        "TRANSLATION_8": "And call not those who are slain in the way of Allah \"dead.\" Nay, they are living, only ye perceive not.\n",
        "TRANSLATION_9": "Do not say that those who are killed in God's cause are dead; they are alive, but you are not aware of it.\n",
        "TRANSLATION_10": "And say not of those who are slain in the way of Allah: dead. Nay, they are living, but ye perceive not.\n",
        "TRANSLATION_11": "Do not call those who were slain in Allah’s way ‘dead.’ No, they are living, but you are not aware.\n",
        "TRANSLATION_12": "And say not of those who are slain in the way of Allah: \"They are dead.\" Nay, they are living, though ye perceive (it) not.\n",
        "TRANSLATION_13": "And say not of those who are killed in the Way of Allah, \"They are dead.\" Nay, they are living, but you perceive (it) not.\n",
        "TRANSLATION_14": "Do not say that those killed in the Way of Allah are dead, they are alive, although you are unaware.\n",
        "TRANSLATION_15": "And do not say of those who are killed in the cause of God, “Dead.” Rather, they are alive, but you do not perceive.\n",
        "TRANSLATION_16": "And do not say about those who are killed in the way of Allah, \"They are dead.\" Rather, they are alive, but you perceive [it] not.\n",
        "TRANSLATION_17": "[2:154] And say not of those slain in God’s way, that, ‘They are dead’; rather they are living, their spirits are, according to a hadīth, contained in green birds that take wing freely wherever they wish in Paradise; but you are not aware, [but you] do not know their condition.\n",
        "TRANSLATION_18": "Allah thereafter mentions the saying of the hypocrites apropos the martyrs of Badr, Uhud and all the other battles: \"So-and-so has died and lost all comfort and happiness\", this in order to aggravate sincere believers, and so Allah says: (And call not those who are slain in the way of Allah) in obedience of Allah, on the Day of Badr or in any other battle (\"dead\") like any other dead people. (Nay they are living) they are rather living like those living in Paradise, being provided with comfort and bounties, (only ye perceive not) you are not aware of the honour bestowed upon them or of their real state.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:154",
            "3:169",
            "35:22",
            "10:31",
            "2:190",
            "7:186",
            "4:143",
            "42:46",
            "4:88",
            "6:95"
        ],
        "BIBLE": [
            "writings:psalms:139:24",
            "prophets:joshua:22:24",
            "torah:genesis:28:20",
            "prophets:i%20kings:13:26",
            "prophets:i%20kings:3:22",
            "prophets:ii%20samuel:15:21",
            "prophets:ezekiel:14:23",
            "prophets:jeremiah:13:12",
            "prophets:i%20kings:3:23",
            "prophets:ii%20kings:5:7"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:8",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:14",
            "Sefer%20Yetzirah:3:6",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:1:6"
        ]
    }
}