{
    "VERSE": "2:157",
    "ARABIC": "أُو۟لَٰٓئِكَ عَلَيْهِمْ صَلَوَٰتٌ مِّن رَّبِّهِمْ وَرَحْمَةٌ وَأُو۟لَٰٓئِكَ هُمُ ٱلْمُهْتَدُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Those are the people who will have blessings and mercy from their Lord; they are the ones who are guided.",
        "TRANSLATION_1": "On such men are the blessings of God and His mercy, for they are indeed on the right path.\n",
        "TRANSLATION_2": "Their Lord will bestow great blessings and mercy upon them; such are the people who are rightly guided.\n",
        "TRANSLATION_3": "It is they who will receive blessings and mercy from God and who follow the right guidance.\n",
        "TRANSLATION_4": "These are the people upon whom are the blessings from their Lord, and mercy; and it is they who are on guidance.\n",
        "TRANSLATION_5": "They are those on whom are the Salawat (i.e., who are blessed and will be forgiven) from their Lord, and (they are those who) receive His mercy, and it is they who are the guided ones.\n",
        "TRANSLATION_6": "Those are they on whom are blessings and mercy from their Lord, and those are the followers of the right course.\n",
        "TRANSLATION_7": "upon those rest blessings and mercy from their Lord, and those -- they are the truly guided.\n",
        "TRANSLATION_8": "Such are they on whom are blessings from their Lord, and mercy. Such are the rightly guided.\n",
        "TRANSLATION_9": "are the ones who will have blessings and mercy from their Lord: it is they who are on the right path!\n",
        "TRANSLATION_10": "These! on them shall be benedictions from their Lord and His mercy, and these! they are the rightly guided.\n",
        "TRANSLATION_11": "It is they who receive the blessings of their Lord and [His] mercy, and it is they who are the [rightly] guided.\n",
        "TRANSLATION_12": "They are those on whom (Descend) blessings from Allah, and Mercy, and they are the ones that receive guidance.\n",
        "TRANSLATION_13": "They are those on whom are the Salawat (i.e. blessings, etc.) (i.e. who are blessed and will be forgiven) from their Lord, and (they are those who) receive His Mercy, and it is they who are the guided-ones.\n",
        "TRANSLATION_14": "On those will be prayers and mercy from their Lord, those are guided.\n",
        "TRANSLATION_15": "Upon these are blessings and mercy from their Lord. These are the guided ones.\n",
        "TRANSLATION_16": "Those are the ones upon whom are blessings from their Lord and mercy. And it is those who are the [rightly] guided.\n",
        "TRANSLATION_17": "[2:157] Upon those rest blessings, forgiveness, and mercy, grace, from their Lord, and those — they are the truly guided, to rectitude.\n",
        "TRANSLATION_18": "(Such) those who have these traits (are they on whom are blessings) forgiveness (from their Lord) in this world, (and mercy) in that they are not tormented in the Hereafter. (And such are they who are rightly guided) to remember that we are Allah's and unto Him we shall return.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:157",
            "15:56",
            "31:5",
            "2:5",
            "14:40",
            "45:30",
            "8:3",
            "21:86",
            "17:28",
            "17:57"
        ],
        "BIBLE": [
            "writings:psalms:24:5",
            "torah:deuteronomy:4:3",
            "torah:deuteronomy:16:17",
            "writings:psalms:66:20",
            "prophets:judges:8:5",
            "writings:psalms:23:6",
            "prophets:i%20samuel:25:27",
            "writings:job:27:13",
            "prophets:ii%20samuel:7:19",
            "torah:deuteronomy:16:20"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:1:13",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:1:1"
        ]
    }
}