{
    "VERSE": "2:165",
    "ARABIC": "وَمِنَ ٱلنَّاسِ مَن يَتَّخِذُ مِن دُونِ ٱللَّهِ أَندَادًا يُحِبُّونَهُمْ كَحُبِّ ٱللَّهِ وَٱلَّذِينَ ءَامَنُوٓا۟ أَشَدُّ حُبًّا لِّلَّهِ وَلَوْ يَرَى ٱلَّذِينَ ظَلَمُوٓا۟ إِذْ يَرَوْنَ ٱلْعَذَابَ أَنَّ ٱلْقُوَّةَ لِلَّهِ جَمِيعًا وَأَنَّ ٱللَّهَ شَدِيدُ ٱلْعَذَابِ",
    "ENGLISH": {
        "TRANSLATION_0": "Some people set up equals to Allah, loving them as they should love Allah. But those who have iman have greater love for Allah. If only you could see those who do wrong at the time when they see the punishment, and that truly all strength belongs to Allah, and that Allah is severe in punishment.",
        "TRANSLATION_1": "And yet there are men who take others as compeers of God, and bestow on them love due to God; but the love of the faithful for God is more intense. If only the wicked could see now the agony that they will behold (on the Day of Resurrection), they will know that to God belongs the power entirely'. And the punishment of God is severe.\n",
        "TRANSLATION_2": "(In spite of such clear signs of the Oneness of Allah), there are people who set up equals and rivals with Allah and adore them with the adoration due to Allah. whereas the Believers adore Allah most ardently. Would that these transgressors could realize now what they will realize, when they will see the chastisement before them that power and authority wholly belong to Allah and that Allah is severe in punishment!\n",
        "TRANSLATION_3": "Some people consider certain things equal to God and love them just as one should love God. However, the strongest of the believers' love is their love of God. Had the unjust been able to reflect about their condition, when facing the torment, they would have had no doubt that to God belongs All-power and that He is stern in His retribution.\n",
        "TRANSLATION_4": "And some people create for themselves Gods (objects of worship) other than Allah, with devotion (love) equal to the devotion of Allah; and the believers do not love anybody with love equal to the love of Allah; and what will be their state, when the punishment will be before the eyes of the unjust (disbelievers)? For all power belongs wholly to Allah, and because Allah’s punishment is very severe.\n",
        "TRANSLATION_5": "And of mankind are some who take (for worship) others besides Allah as rivals (to Allah). They love them as they love Allah. But those who believe, love Allah more (than anything else). If only, those who do wrong could see, when they will see the torment, that all power belongs to Allah and that Allah is severe in punishment.\n",
        "TRANSLATION_6": "And there are some among men who take for themselves objects of worship besides Allah, whom they love as they love Allah, and those who believe are stronger in love for Allah and O, that those who are unjust had seen, when they see the chastisement, that the power is wholly Allah's and that Allah is severe in requiting (evil).\n",
        "TRANSLATION_7": "Yet there be men who take to themselves compeers apart from God, loving them as God is loved; but those that believe love God more ardently. O if the evildoers might see, when they see the chastisement, that the power altogether belongs to God, and that God is terrible in chastisement,\n",
        "TRANSLATION_8": "Yet of mankind are some who take unto themselves (objects of worship which they set as) rivals to Allah, loving them with a love like (that which is the due) of Allah (only) - those who believe are stauncher in their love for Allah - Oh, that those who do evil had but known, (on the day) when they behold the doom, that power belongeth wholly to Allah, and that Allah is severe in punishment!\n",
        "TRANSLATION_9": "Yet there are some who set up equals with God and adore them with the adoration due to God, but those who believe love God most. If only the wrongdoers could see, as they will see when they face the punishment, that all power belongs to God, and that God is severe in punishment.\n",
        "TRANSLATION_10": "And of mankind are some that set up compeers; unto Allah they love them as with the love due to Allah. And those who believe are strongest in love of Allah. Would that those who do wrong saw, when they saw the torment, that verily power belonged wholly unto Allah, and that Allah was severe in requital -\n",
        "TRANSLATION_11": "Among the people are those who set up compeers besides Allah, loving them as if loving Allah—but the faithful have a more ardent love for Allah—though the wrongdoers will see, when they sight the punishment, that power, altogether, belongs to Allah, and that Allah is severe in punishment.\n",
        "TRANSLATION_12": "Yet there are men who take (for worship) others besides Allah, as equal (with Allah): They love them as they should love Allah. But those of Faith are overflowing in their love for Allah. If only the unrighteous could see, behold, they would see the penalty: that to Allah belongs all power, and Allah will strongly enforce the penalty.\n",
        "TRANSLATION_13": "And of mankind are some who take (for worship) others besides Allah as rivals (to Allah). They love them as they love Allah. But those who believe, love Allah more (than anything else). If only, those who do wrong could see, when they will see the torment, that all power belongs to Allah and that Allah is Severe in punishment.\n",
        "TRANSLATION_14": "And among the people are those who take to themselves rivals, other than Allah, loving them as Allah is loved. But those who believe are more loving to Allah. When the harmdoers see when they see the punishment because the power altogether belongs to Allah, and that Allah is firm in punishment,\n",
        "TRANSLATION_15": "Yet among the people are those who take other than God as equals to Him. They love them as the love of God. But those who believe have greater love for God. If only the wrongdoers would realize, when they see the torment; that all power is God’s, and that God is severe in punishment.\n",
        "TRANSLATION_16": "And [yet], among the people are those who take other than Allah as equals [to Him]. They love them as they [should] love Allah. But those who believe are stronger in love for Allah. And if only they who have wronged would consider [that] when they see the punishment, [they will be certain] that all power belongs to Allah and that Allah is severe in punishment.\n",
        "TRANSLATION_17": "[2:165] Yet there be people who take to themselves compeers, idols, besides God, that is, other than God, loving them, by magnifying them and being subservient to them, as God is loved, that is, as their love of Him; but those who believe love God more ardently, than those who love their compeers, because the former never reject God, whereas the latter when faced with hardship soon abandon those [compeers] for God; If he, [if you] O Muhammad (s), were to see those who did evil, by taking to themselves compeers, when (idh here denotes idhā) they see (read either as active [yarawna, ‘they see’] or passive [yurawna, ‘they are made to see’]) the chastisement, you would see a grave sight, that, this is because, the might, the power and the vanquishing, altogether (a circumstantial qualifier) belongs to God, and that God is terrible in chastisement (according to one reading, the person listening [to the verse] governs the verb yarā, ‘he sees’, and constitutes the subject [of the clause]; according to another [reading], it is the ‘evildoers’ [who constitute the subject of the clause and govern the verb yarā]; and so it [yarā] has the sense of ya‘lam, ‘he knows’; the particle an, ‘that’, and what comes after it have taken the place of the objects in both cases; the response to the [initial conditional] law, ‘if’, has been omitted). The general meaning [of the verse] then is: ‘If they were aware in this world of the severity of God’s chastisement and of the fact that power is God’s alone, the moment they come to see it with their own eyes, on the Day of Resurrection, they would not take to themselves compeers’.\n",
        "TRANSLATION_18": "Allah mentions after this the unbelievers' love for their objects of worship in this world, and how they disown each other in the Hereafter, saying: (Yet of mankind) i.e. the unbelievers (are some who take unto themselves) who worship (rivals to Allah) idols, (loving them with a love like (that which is the due) of Allah) like the love that sincere believers have for Allah (-Those who believe are stauncher) more lasting (in their love for Allah) than are the unbelievers vis-a-vis their idols; it is also said that this verse was revealed about the hypocrites who buried their gold and silver or hid it in caves; and it is also said that this means: they took their leaders as gods (-that those who do evil had but known) if only the idolaters knew, (when they behold the doom) on the Day of Judgement, (that power) and might and invincibility (belongeth wholly to Allah, and that Allah is severe in punishment!) in the Hereafter-if they knew this, they would certainly have believed in this world.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:165",
            "22:73",
            "3:4",
            "58:15",
            "7:164",
            "4:37",
            "35:10",
            "14:21",
            "4:139",
            "22:25"
        ],
        "BIBLE": [
            "writings:ecclesiastes:7:15",
            "writings:i%20chronicles:29:17",
            "torah:deuteronomy:11:2",
            "torah:deuteronomy:7:19",
            "writings:daniel:6:8",
            "prophets:jeremiah:44:2",
            "writings:daniel:4:15",
            "torah:deuteronomy:10:21",
            "torah:exodus:32:1",
            "torah:deuteronomy:4:9"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:1"
        ]
    }
}