{
    "VERSE": "2:168",
    "ARABIC": "يَٰٓأَيُّهَا ٱلنَّاسُ كُلُوا۟ مِمَّا فِى ٱلْأَرْضِ حَلَٰلًا طَيِّبًا وَلَا تَتَّبِعُوا۟ خُطُوَٰتِ ٱلشَّيْطَٰنِ إِنَّهُۥ لَكُمْ عَدُوٌّ مُّبِينٌ",
    "ENGLISH": {
        "TRANSLATION_0": "Mankind! eat what is good and lawful on the earth. And do not follow in the footsteps of Shaytan. He truly is an outright enemy to you.",
        "TRANSLATION_1": "O men, eat only the things of the earth that are lawful and good. Do not walk in the footsteps of Satan, your acknowledged enemy.\n",
        "TRANSLATION_2": "O people, eat of what is lawful and clean in the earth and do not follow the ways of Satan, for he is your avowed enemy.\n",
        "TRANSLATION_3": "People, eat of the good and lawful things on earth. Do not follow the footsteps of Satan; he is clearly your enemy.\n",
        "TRANSLATION_4": "O mankind! Eat from what is lawful and clean in the earth; and do not follow the footsteps of the devil; undoubtedly he is your open enemy.\n",
        "TRANSLATION_5": "O mankind! Eat of that which is lawful and good on the earth, and follow not the footsteps of Shaytan (Satan). Verily, he is to you an open enemy.\n",
        "TRANSLATION_6": "O men! eat the lawful and good things out of what is in the earth, and do not follow the footsteps of the Shaitan; surely he is your open enemy.\n",
        "TRANSLATION_7": "O men, eat of what is in the earth lawful and good; and follow not the steps of Satan; he is a manifest foe to you.\n",
        "TRANSLATION_8": "O mankind! Eat of that which is lawful and wholesome in the earth, and follow not the footsteps of the devil. Lo! he is an open enemy for you.\n",
        "TRANSLATION_9": "O mankind, eat whatever is lawful and wholesome on the earth; and do not follow in the footsteps of Satan; for he is indeed your avowed enemy.\n",
        "TRANSLATION_10": "Mankind! eat of whatsoever is, the earth, lawful, and clean and follow not the footsteps of Satan; verily he is an enemy unto you manifest.\n",
        "TRANSLATION_11": "O mankind! Eat of what is lawful and pure in the earth, and do not follow in Satan’s steps. Indeed, he is your manifest enemy.\n",
        "TRANSLATION_12": "O ye people! Eat of what is on earth, Lawful and good; and do not follow the footsteps of the evil one, for he is to you an avowed enemy.\n",
        "TRANSLATION_13": "O mankind! Eat of that which is lawful and good on the earth, and follow not the footsteps of Shaitan (Satan). Verily, he is to you an open enemy.\n",
        "TRANSLATION_14": "People, eat of what is lawful and good on the earth and do not walk in satan's footsteps, because he is for you a clear enemy,\n",
        "TRANSLATION_15": "O people! Eat of what is lawful and good on earth, and do not follow the footsteps of Satan. He is to you an open enemy.\n",
        "TRANSLATION_16": "O mankind, eat from whatever is on earth [that is] lawful and good and do not follow the footsteps of Satan. Indeed, he is to you a clear enemy.\n",
        "TRANSLATION_17": "[2:168] The following was revealed when some said that it was unlawful to take a camel that has been let loose (sawā’ib): O people, eat of what is in the earth, lawful (halālan is a circumstantial qualifier) and wholesome (tayyiban is an adjective for emphasis), that is to say, what is delicious; and follow not the steps, the ways, of Satan, meaning, what he embellishes [of temptations]; he is a manifest foe to you, whose enmity is clear;\n",
        "TRANSLATION_18": "Allah then mentions the lawfulness of cultivating land and raising cattle, saying: (0 mankind) people of Mecca! (Eat of that which is lawful and wholesome) that is not prohibited by Allah (in the earth) of what is cultivated in lands and of cattle, (and follow not the footsteps of the devil) the embellishments and whisperings of the devil concerning the unlawfulness of the cultivation of land and of raising cattle. (Lo! He is an open enemy for you) whose enmity towards you is quite manifest.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:168",
            "2:208",
            "6:142",
            "2:36",
            "35:6",
            "36:60",
            "43:62",
            "4:101",
            "8:26",
            "19:44"
        ],
        "BIBLE": [
            "prophets:jeremiah:10:23",
            "writings:psalms:38:21",
            "torah:leviticus:5:4",
            "torah:numbers:5:10",
            "prophets:ii%20kings:6:19",
            "torah:leviticus:22:4",
            "writings:proverbs:2:12",
            "writings:proverbs:16:9",
            "torah:numbers:32:11",
            "torah:leviticus:11:42"
        ]
    }
}