{
    "VERSE": "2:169",
    "ARABIC": "إِنَّمَا يَأْمُرُكُم بِٱلسُّوٓءِ وَٱلْفَحْشَآءِ وَأَن تَقُولُوا۟ عَلَى ٱللَّهِ مَا لَا تَعْلَمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "He only commands you to do evil and indecent acts and to say about Allah what you do not know.",
        "TRANSLATION_1": "He will ask you to indulge in evil, indecency, and to speak lies of God you cannot even conceive.\n",
        "TRANSLATION_2": "He enjoins you to commit vice and indecency and induces you to attribute to Allah's name things you do not know to be from Him.\n",
        "TRANSLATION_3": "He tries to make you do evil and shameful things and speak against God without knowledge.\n",
        "TRANSLATION_4": "For he will only instruct you towards the evil and the shameful, and that you fabricate matters concerning Allah, what you do not know.\n",
        "TRANSLATION_5": "He (Satan) commands you only what is evil and Fahsha' (sinful), and that you should say about Allah what you know not.\n",
        "TRANSLATION_6": "He only enjoins you evil and indecency, and that you may speak against Allah what you do not know.\n",
        "TRANSLATION_7": "He only commands you to evil and indecency, and that you should speak against God such things as you know not.\n",
        "TRANSLATION_8": "He enjoineth upon you only the evil and the foul, and that ye should tell concerning Allah that which ye know not.\n",
        "TRANSLATION_9": "He bids you only to do evil and to commit deeds of abomination and to attribute to God something of which you have no knowledge.\n",
        "TRANSLATION_10": "He only commandeth you to evil and indecency, and that ye should say against Allah that which ye know not\n",
        "TRANSLATION_11": "He only prompts you to [commit] evil and indecent acts, and that you attribute to Allah what you do not know.\n",
        "TRANSLATION_12": "For he commands you what is evil and shameful, and that ye should say of Allah that of which ye have no knowledge.\n",
        "TRANSLATION_13": "[Shaitan (Satan)] commands you only what is evil and Fahsha (sinful), and that you should say against Allah what you know not.\n",
        "TRANSLATION_14": "he orders you to commit evil and indecency and to assert about Allah what you do not know.\n",
        "TRANSLATION_15": "He commands you to do evil and vice, and to say about God what you do not know.\n",
        "TRANSLATION_16": "He only orders you to evil and immorality and to say about Allah what you do not know.\n",
        "TRANSLATION_17": "[2:169] he only commands you to evil, sin, and indecency, what is abhorred by the Law, and that you should speak against God what you do not know, such as forbidding what He has not forbidden and otherwise.\n",
        "TRANSLATION_18": "(He) the devil (enjoineth upon you only the evil) evil works (and the foul) transgressions, (and that ye should tell) lies (concerning Allah that which ye know not).\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:169",
            "39:61",
            "7:28",
            "13:21",
            "11:33",
            "9:64",
            "7:33",
            "3:120",
            "11:54",
            "72:7"
        ],
        "BIBLE": [
            "torah:exodus:23:13",
            "writings:psalms:32:5",
            "prophets:isaiah:43:19",
            "prophets:ii%20samuel:23:5",
            "writings:daniel:5:15",
            "writings:job:10:2",
            "torah:exodus:18:16",
            "prophets:joshua:7:19",
            "torah:deuteronomy:13:15",
            "torah:exodus:32:23"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:1:4"
        ]
    }
}