{
    "VERSE": "2:179",
    "ARABIC": "وَلَكُمْ فِى ٱلْقِصَاصِ حَيَوٰةٌ يَٰٓأُو۟لِى ٱلْأَلْبَٰبِ لَعَلَّكُمْ تَتَّقُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "There is life for you in retaliation, people of intelligence, so that hopefully you will have taqwa.",
        "TRANSLATION_1": "In retribution there is life (and preservation). O men of sense, you may haply take heed for yourselves.\n",
        "TRANSLATION_2": "There is security of life for you in the law of retribution. It is expected that you will refrain from breaking this law.\n",
        "TRANSLATION_3": "People of understanding, the law of the death penalty as retaliation grants you life so that perhaps you will have fear of God.\n",
        "TRANSLATION_4": "And there is life for you in retribution, O men of understanding, so that you may avoid.\n",
        "TRANSLATION_5": "And there is (a saving of) life for you in Al-Qisas (the Law of equality in punishment), O men of understanding, that you may acquire Taqwa.\n",
        "TRANSLATION_6": "And there is life for you in (the law of) retaliation, O men of understanding, that you may guard yourselves.\n",
        "TRANSLATION_7": "In retaliation there is life for you, men possessed of minds; haply you will be godfearing.\n",
        "TRANSLATION_8": "And there is life for you in retaliation, O men of understanding, that ye may ward off (evil).\n",
        "TRANSLATION_9": "In [this law of] retribution there is life for you, O people of understanding, so that perhaps you will be mindful of God.\n",
        "TRANSLATION_10": "And for you in retaliation is life men of insight! that haply ye may fear God.\n",
        "TRANSLATION_11": "There is life for you in retribution, O you who possess intellects! Maybe you will be Godwary!\n",
        "TRANSLATION_12": "In the Law of Equality there is (saving of) Life to you, o ye men of understanding; that ye may restrain yourselves.\n",
        "TRANSLATION_13": "And there is (a saving of) life for you in Al-Qisas (the Law of Equality in punishment), O men of understanding, that you may become Al-Muttaqun (the pious - see V. 2:2).\n",
        "TRANSLATION_14": "O owners of minds, for you in retaliation is life, in order that you be cautious.\n",
        "TRANSLATION_15": "There is life for you in retaliation, O people of understanding, so that you may refrain.\n",
        "TRANSLATION_16": "And there is for you in legal retribution [saving of] life, O you [people] of understanding, that you may become righteous.\n",
        "TRANSLATION_17": "[2:179] In retaliation there is life for you, that is great longevity, O people of pith, possessors of intellect, because if the would-be killer knew that he would be killed [in retaliation], he would refrain [from such action] and would have thereby given life to himself and to the one whom he had intended to kill; and so it [retaliation] was stipulated by the Law, so that you might fear killing, fearing retaliation.\n",
        "TRANSLATION_18": "(And there is a life for you in retaliation) a continuation of existence and a lesson, (0 men of understanding) those who possess sound minds among people, (that ye may ward off (evil)) that you may ward off killing one another for fear of retaliation.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:179",
            "89:24",
            "65:10",
            "5:100",
            "38:29",
            "13:19",
            "40:54",
            "26:51",
            "39:18",
            "20:54"
        ],
        "BIBLE": [
            "prophets:ezekiel:16:59",
            "prophets:isaiah:27:11",
            "prophets:ezekiel:6:4",
            "torah:exodus:9:9",
            "writings:daniel:12:7",
            "writings:psalms:3:8",
            "prophets:isaiah:49:13",
            "prophets:ezekiel:17:15",
            "prophets:isaiah:24:5",
            "torah:deuteronomy:31:16"
        ]
    }
}