{
    "VERSE": "2:182",
    "ARABIC": "فَمَنْ خَافَ مِن مُّوصٍ جَنَفًا أَوْ إِثْمًا فَأَصْلَحَ بَيْنَهُمْ فَلَآ إِثْمَ عَلَيْهِ إِنَّ ٱللَّهَ غَفُورٌ رَّحِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "But if someone fears bias or wrongdoing on the part of the person making the will, and puts things right between the people involved, in that case he has not committed any crime. Allah is Ever-Forgiving, Most",
        "TRANSLATION_1": "He who suspects wrong or partiality on the part of the testator and brings about a settlement, does not incure any guilt, for God is verily forgiving and merciful.\n",
        "TRANSLATION_2": "If, however. one apprehends genuinely that the testator had intentionally or unintentionally done some injustice, and then alters the will to set things right between the parties concerned, in that case he does not incur any sin. Allah is Forgiving and Merciful.\n",
        "TRANSLATION_3": "One who is afraid of the testator's deviations and sin and settles the matter among the parties involved, he has not committed a sin. God is All-forgiving and All-merciful.\n",
        "TRANSLATION_4": "Then if one fears that the will maker (the deceased) has done injustice or sin, and he makes a reconciliation between the parties, there shall be no sin upon him; indeed Allah is Oft Forgiving, Most Merciful.\n",
        "TRANSLATION_5": "But he who fears from a testator some unjust act or wrongdoing, and thereupon he makes peace between the parties concerned, there shall be no sin on him. Certainly, Allah is Oft-Forgiving, Most Merciful.\n",
        "TRANSLATION_6": "But he who fears an inclination to a wrong course or an act of disobedience on the part of the testator, and effects an agreement between the parties, there is no blame on him. Surely Allah is Forgiving, Merciful.\n",
        "TRANSLATION_7": "But if any man fears injustice or sin from one making testament, and so makes things right between them, then sin shall not rest upon him; surely God is All-forgiving, All-compassionate.\n",
        "TRANSLATION_8": "But he who feareth from a testator some unjust or sinful clause, and maketh peace between the parties, (it shall be) no sin for him. Lo! Allah is Forgiving, Merciful.\n",
        "TRANSLATION_9": "But if anyone apprehends partiality or an injustice on the part of a testator, it shall be no sin for him to bring about a settlement between the parties. God is forgiving and merciful.\n",
        "TRANSLATION_10": "How beit whosoever apprehendeth from the testator a mistake or a sin and thereupon he maketh up the matter between them, on him there shall be no sin; verily Allah is Forgiving, Merciful.\n",
        "TRANSLATION_11": "But should someone, fearing deviance or sin on the testator’s behalf, set things right between them, there is no sin upon him. Indeed Allah is all-forgiving, all-merciful.\n",
        "TRANSLATION_12": "But if anyone fears partiality or wrong-doing on the part of the testator, and makes peace between (The parties concerned), there is no wrong in him: For Allah is Oft-forgiving, Most Merciful.\n",
        "TRANSLATION_13": "But he who fears from a testator some unjust act or wrong-doing, and thereupon he makes peace between the parties concerned, there shall be no sin on him. Certainly, Allah is Oft-Forgiving, Most Merciful.\n",
        "TRANSLATION_14": "He who fears injustice or sin on the part of a testator and brings about a settlement among the parties incurs no guilt. Allah is the Forgiver and the Most Merciful.\n",
        "TRANSLATION_15": "Should someone suspect bias or injustice on the part of a testator, and then reconciles between them, he commits no sin. God is Forgiving and Merciful.\n",
        "TRANSLATION_16": "But if one fears from the bequeather [some] error or sin and corrects that which is between them, there is no sin upon him. Indeed, Allah is Forgiving and Merciful.\n",
        "TRANSLATION_17": "[2:182] But if any one fears injustice, an error, in straying from what is right, or sin, because he has purposely increased the share of a third or specified a rich individual, from one making testament (read mūsī or muwassī), and so makes things right between them, the testator and the trustee, by commanding that justice be done, then no sin shall be upon him, with regard to this matter; surely God is Forgiving, Merciful.\n",
        "TRANSLATION_18": "until, that is, the following verse was revealed: (But he who feareth from a testator) knows that the testator has committed (some unjust or sinful clause) purposefully committed a mistake or transgression (and maketh peace between the parties) between the inheritors and the testator, i.e. he corrects what is in the will by reducing any bequest to a maximum of a third of the wealth, (no sin for him) he bears no sin in doing so. (Lo! Allah is Forgiving) He forgives the deceased if he transgresses or makes a mistake, (Merciful) in relation to the deed of the testator; it is also said that this means: He forgives the testator, and He is also merciful because He gave dispensation to reduce bequests to a third and thus commanded that one adhere to fairness.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:182",
            "2:192",
            "5:39",
            "4:152",
            "2:173",
            "46:8",
            "5:74",
            "4:106",
            "60:7",
            "4:129"
        ],
        "BIBLE": [
            "torah:leviticus:5:18",
            "prophets:amos:6:10",
            "writings:ezra:5:5",
            "writings:daniel:9:27",
            "torah:leviticus:5:13",
            "writings:daniel:6:13",
            "torah:leviticus:5:16",
            "writings:daniel:11:17",
            "torah:leviticus:5:26",
            "prophets:ii%20kings:7:19"
        ]
    }
}