{
    "VERSE": "2:183",
    "ARABIC": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ كُتِبَ عَلَيْكُمُ ٱلصِّيَامُ كَمَا كُتِبَ عَلَى ٱلَّذِينَ مِن قَبْلِكُمْ لَعَلَّكُمْ تَتَّقُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "You who have iman! fasting is prescribed for you, as it was prescribed for those before you - so that hopefully you will have taqwa -",
        "TRANSLATION_1": "O believers, fasting is enjoined on you as it was on those before you, so that you might become righteous.\n",
        "TRANSLATION_2": "O Believers, the Fast has been made obligatory on you just as it was prescribed for the followers of the Prophets before you. It is expected that this will produce piety in you.\n",
        "TRANSLATION_3": "Believers, fasting has been made mandatory for you as it was made mandatory for the people before you, so that you may have fear of God.\n",
        "TRANSLATION_4": "O People who Believe! Fasting is made compulsory for you, like it was ordained for those before you, so that you may attain piety.\n",
        "TRANSLATION_5": "O you who believe! Fasting is prescribed for you as it was prescribed for those before you, that you may acquire Taqwa.\n",
        "TRANSLATION_6": "O you who believe! fasting is prescribed for you, as it was prescribed for those before you, so that you may guard (against evil).\n",
        "TRANSLATION_7": "O believers, prescribed for you is the Fast, even as it was prescribed for those that were before you -- haply you will be godfearing --\n",
        "TRANSLATION_8": "O ye who believe! Fasting is prescribed for you, even as it was prescribed for those before you, that ye may ward off (evil);\n",
        "TRANSLATION_9": "Believers, fasting has been prescribed for you, just as it was prescribed for those before you, so that you may guard yourselves against evil.\n",
        "TRANSLATION_10": "O ye who believe! prescribed unto you is fasting even as it was prescribed unto those before you, that haply ye may fear God.\n",
        "TRANSLATION_11": "O you who have faith! Prescribed for you is fasting as it was prescribed for those who were before you, so that you may be Godwary.\n",
        "TRANSLATION_12": "O ye who believe! Fasting is prescribed to you as it was prescribed to those before you, that ye may (learn) self-restraint,-\n",
        "TRANSLATION_13": "O you who believe! Observing As-Saum (the fasting) is prescribed for you as it was prescribed for those before you, that you may become Al-Muttaqun (the pious - see V. 2:2).\n",
        "TRANSLATION_14": "Believers, fasting is decreed for you as it was decreed for those before you; perchance you will be cautious.\n",
        "TRANSLATION_15": "O you who believe! Fasting is prescribed for you, as it was prescribed for those before you, that you may become righteous.\n",
        "TRANSLATION_16": "O you who have believed, decreed upon you is fasting as it was decreed upon those before you that you may become righteous -\n",
        "TRANSLATION_17": "[2:183] O you who believe, prescribed for you, obligatory [for you], is the Fast, just as it was prescribed for those, communities, that were before you so that you might guard yourselves, against acts of disobedience, for, it [the fast] curbs the desires that prompt these [acts].\n",
        "TRANSLATION_18": "(0 ye who believe! Fasting is prescribed for you) for a specific number of days; it is said that this means: fasting is prescribed for you: you abstain from eating and drinking and from sexual intercourse from the dawn prayer or from the time one sleeps before the dawn prayer, (even as it was prescribed for those before you) for the people of the Book, (that ye may ward off (evil)) that you may ward off eating, drinking and sexual intercourse after the last night prayer or before sleeping after the last night prayer. However, this is abrogated by the verses: (It is made lawful for you to go unto your wives on the night of the fast) and (and eat and drink until the white thread becomes distinct to you from the black thread of the dawn). 30\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:183",
            "2:21",
            "2:254",
            "10:102",
            "60:13",
            "41:48",
            "33:49",
            "39:50",
            "5:102",
            "28:52"
        ],
        "BIBLE": [
            "torah:exodus:20:17",
            "prophets:ezekiel:36:3",
            "prophets:ezekiel:37:12",
            "torah:deuteronomy:6:25",
            "prophets:ezekiel:11:17",
            "prophets:ezekiel:27:3",
            "torah:deuteronomy:6:3",
            "prophets:hosea:2:25",
            "prophets:jonah:3:5",
            "prophets:i%20samuel:12:19"
        ]
    }
}