{
    "VERSE": "2:189",
    "ARABIC": "يَسْـَٔلُونَكَ عَنِ ٱلْأَهِلَّةِ قُلْ هِىَ مَوَٰقِيتُ لِلنَّاسِ وَٱلْحَجِّ وَلَيْسَ ٱلْبِرُّ بِأَن تَأْتُوا۟ ٱلْبُيُوتَ مِن ظُهُورِهَا وَلَٰكِنَّ ٱلْبِرَّ مَنِ ٱتَّقَىٰ وَأْتُوا۟ ٱلْبُيُوتَ مِنْ أَبْوَٰبِهَا وَٱتَّقُوا۟ ٱللَّهَ لَعَلَّكُمْ تُفْلِحُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "They will ask you about the crescent moons. Say, 'They are set times for mankind and for the hajj.' It is not devoutness for you to enter houses by the back. Rather devoutness is possessed by those who have taqwa. So come to houses by their doors and have taqwa of Allah, so that hopefully you will be successful.",
        "TRANSLATION_1": "They ask you of the new moons. Say: \"These are periods set for men (to reckon) time, and for pilgrimage.\" Piety does not lie in entering the house through the back door, for the pious man is he who follows the straight path. Enter the house through the main gate, and obey God. You may haply find success.\n",
        "TRANSLATION_2": "They ask you about the phases of the moon. Say, \"These are signs for the people to reckon dates and fix the periods for hajj.\" Also tell them, \"It is no virtue to enter your houses from their backs during the Hajj days); real virtue is that one should refrain from incurring the displeasure of Allah; so enter your houses by their proper doors. and fear Allah so that you may gain (true) success.\n",
        "TRANSLATION_3": "(Muhammad), they ask you about the different phases of the moon. Tell them that they are there to indicate to people the phases of time and the pilgrimage season. It is not a righteous act to enter houses from the back. Righteousness is to be pious and enter the houses from the front door. Have fear of God so that perhaps you will have lasting happiness.\n",
        "TRANSLATION_4": "They ask you, (O dear Prophet Mohammed – peace and blessings be upon him), regarding the crescents; say, “They are indicators of time for mankind and for Hajj (the pilgrimage)”; and it is not a virtue at all that you enter the houses by demolishing their back portions, but in reality virtue is piety; and enter the houses using their gates – and keep fearing Allah, hoping that you achieve success.\n",
        "TRANSLATION_5": "They ask you (O Muhammad) about the crescents. Say: \"These are signs to mark fixed periods of time for mankind and for the pilgrimage.\" It is not Al-Birr (piety, righteousness, etc.) that you enter the houses from the back, but Al-Birr is from Taqwa. So enter houses through their proper doors, and have Taqwa of Allah that you may be successful.\n",
        "TRANSLATION_6": "They ask you concerning the new moon. Say: They are times appointed for (the benefit of) men, and (for) the pilgrimage; and it is not righteousness that you should enter the houses at their backs, but righteousness is this that one should guard (against evil); and go into the houses by their doors and be careful (of your duty) to Allah, that you may be successful.\n",
        "TRANSLATION_7": "They will question thee concerning the new moons. Say: 'They are appointed times for the people, and the Pilgrimage.' It is not piety to come to the houses from the backs of them; but piety is to be godfearing; so come to the houses by their doors, and fear God; haply so you will prosper.\n",
        "TRANSLATION_8": "They ask thee, (O Muhammad), of new moons, say: They are fixed seasons for mankind and for the pilgrimage. It is not righteousness that ye go to houses by the backs thereof (as do the idolaters at certain seasons), but the righteous man is he who wardeth off (evil). So go to houses by the gates thereof, and observe your duty to Allah, that ye may be successful.\n",
        "TRANSLATION_9": "They ask you about the phases of the moon. Say, \"They are a means of determining time for the regulation of people's affairs and for the pilgrimage.\" Piety does not consist in entering your houses from the rear. Indeed, one who guards himself against evil out of fear of God is the truly righteous one. Enter your houses by their doors and be mindful of God, so that you may prosper.\n",
        "TRANSLATION_10": "They ask thee of new moons. Say thou: they are time-marks to mankind and for pilgrimage. And it is not piety that ye enter your houses by the backs thereof, but Piety is of him who feareth God; so enter the houses by the doors thereof, and fear Allah that haply ye may thrive.\n",
        "TRANSLATION_11": "They question you concerning the new moons. Say, ‘They are timekeeping signs for the people and [for the sake of] hajj.’ It is not piety that you enter houses from their rear; rather, piety is [personified by] one who is Godwary, and enter houses from their doors and be wary of Allah, so that you may be felicitous.\n",
        "TRANSLATION_12": "They ask thee concerning the New Moons. Say: They are but signs to mark fixed periods of time in (the affairs of) men, and for Pilgrimage. It is no virtue if ye enter your houses from the back: It is virtue if ye fear Allah. Enter houses through the proper doors: And fear Allah: That ye may prosper.\n",
        "TRANSLATION_13": "They ask you (O Muhammad SAW) about the new moons. Say: These are signs to mark fixed periods of time for mankind and for the pilgrimage. It is not Al-Birr (piety, righteousness, etc.) that you enter the houses from the back but Al-Birr (is the quality of the one) who fears Allah. So enter houses through their proper doors, and fear Allah that you may be successful.\n",
        "TRANSLATION_14": "They question you about the crescents. Say: 'They are times fixed for people and for the pilgrimage' Righteousness does not consist in entering dwellings from the back. But righteousness is he who wardsoff (sin). Enter dwellings by their doors and fear Allah, so that you will prosper.\n",
        "TRANSLATION_15": "They ask you about the crescents. Say, “They are timetables for people, and for the Hajj.” It is not virtuous that you approach homes from their backs, but virtue is to be pious. So approach homes from their doors, and observe God, that you may succeed.\n",
        "TRANSLATION_16": "They ask you, [O Muhammad], about the new moons. Say, \"They are measurements of time for the people and for Hajj.\" And it is not righteousness to enter houses from the back, but righteousness is [in] one who fears Allah. And enter houses from their doors. And fear Allah that you may succeed.\n",
        "TRANSLATION_17": "[2:189] They will ask you, O Muhammad (s), about the new moons (ahilla, plural of hilāl): ‘Why do they seem very thin, and then wax until they are full of light, and then wane again as at the first, and are not always the same, in the way that the sun is?’ Say, to them: ‘They are appointed times (mawāqīt is the plural of mīqāt) for the people, for them to know the times for sowing the land, for business, for their women’s waiting periods, their fast and their breaking it, and the Pilgrimage’ (wa’l-hajji and the Pilgrimage’, is a supplement to li’l-nāsi, ‘for the people’), that is to say, [appointed times] by which its season is known, for if they [the new moons] always looked the same, none of these things could be known. It is not piety to come to the houses from their backs, in [your] state of pilgrimage inviolability (ihrām), when you would bore holes in them to enter them and then exit, disregarding their doors; they used to do this and claim that it was out of piety; but piety is to fear, God by not contravening His commands; so come to the houses by their doors, when in a state of pilgrimage inviolability, and fear God, that you may prosper, [that you may] triumph.\n",
        "TRANSLATION_18": "(They ask thee (0 Muhammad), of new moons) they ask you about the increase and decrease of the moon. (Say) Muhammad! (They are fixed seasons for mankind) they are signs for people so that they pay back their debts and know the waiting periods of their women and the timing of their fast and the breaking of their fast (and for the pilgrimage) and for the timing of pilgrimage. This verse was revealed about Mu'adh Ibn Jabal when he asked the Prophet (pbuh) about the timing of the pilgrimage. (It is not righteousness) it is not an act of obedience or God-fearing (that ye go to houses by the backs thereof) during ritual consecration (ihram), (but the righteous man) the obedient person during the time of ritual consecration (is he who wardeth off (evil)) hunting and other things. (So go to the houses) enter the houses (by the gates thereof) by the gates you used to enter, (and observe your duty to Allah) fear Allah during the time of ritual consecration, (that ye may be successful) so that you will be spared Allah's wrath and punishment. This verse was revealed about a group of Companions of the Prophet (pbuh) from the tribes of Kinanah and Khuza'ah, who used to enter their houses, during the time of ritual consecration, from the back or from the roof, as was the habit during the pre-Islamic era.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:189",
            "3:97",
            "3:134",
            "4:108",
            "3:187",
            "3:173",
            "47:3",
            "43:34",
            "3:110",
            "12:23"
        ],
        "BIBLE": [
            "writings:daniel:6:13",
            "prophets:ezekiel:44:5",
            "torah:exodus:8:5",
            "writings:ii%20chronicles:23:19",
            "writings:daniel:3:12",
            "prophets:i%20samuel:9:24",
            "prophets:ezekiel:12:27",
            "prophets:ezekiel:40:4",
            "prophets:amos:6:10",
            "writings:daniel:6:8"
        ]
    }
}