{
    "VERSE": "2:193",
    "ARABIC": "وَقَٰتِلُوهُمْ حَتَّىٰ لَا تَكُونَ فِتْنَةٌ وَيَكُونَ ٱلدِّينُ لِلَّهِ فَإِنِ ٱنتَهَوْا۟ فَلَا عُدْوَٰنَ إِلَّا عَلَى ٱلظَّٰلِمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Fight them until there is no more fitna and the deen belongs to Allah alone. If they cease, there should be no enmity towards any but wrongdoers.",
        "TRANSLATION_1": "Fight them till sedition comes to end, and the law of God (prevails). If they desist, then cease to be hostile, except against those who oppress.\n",
        "TRANSLATION_2": "Go on fighting with them till there is no more a state of tribulation and Allah's way is established instead. Then if they desist from it, there should be no more hostility except against those who had been guilty of cruelty and brutality.\n",
        "TRANSLATION_3": "Fight them so that there will be no disbelief in God and God's religion will become dominant. If they change their behavior, there would be no hostility against anyone except the unjust.\n",
        "TRANSLATION_4": "And fight them until no mischief remains, and only Allah is worshipped; then if they desist, do not harm them, except the unjust.\n",
        "TRANSLATION_5": "And fight them until there is no more Fitnah (disbelief and worshipping of others along with Allah) and the religion (all and every kind of worship) is for Allah (Alone). But if they cease, let there be no transgression except against Az-Zalimin (the polytheists and wrongdoers).\n",
        "TRANSLATION_6": "And fight with them until there is no persecution, and religion should be only for Allah, but if they desist, then there should be no hostility except against the oppressors.\n",
        "TRANSLATION_7": "Fight them, till there is no persecution and the religion is God's; then if they give over, there shall be no enmity save for evildoers.\n",
        "TRANSLATION_8": "And fight them until persecution is no more, and religion is for Allah. But if they desist, then let there be no hostility except against wrong-doers.\n",
        "TRANSLATION_9": "Fight them until there is no more fitna [religious persecution] and religion belongs to God alone. If they desist, then let there be no hostility, except towards aggressors.\n",
        "TRANSLATION_10": "And fight them until there be no more temptation, and their obedience be wholly unto Allah. So if they desist, then there is to be no violence save against the wrong-doers.\n",
        "TRANSLATION_11": "Fight them until persecution is no more, and religion becomes [exclusively] for Allah. Then if they desist, there shall be no reprisal except against the wrongdoers.\n",
        "TRANSLATION_12": "And fight them on until there is no more Tumult or oppression, and there prevail justice and faith in Allah; but if they cease, Let there be no hostility except to those who practise oppression.\n",
        "TRANSLATION_13": "And fight them until there is no more Fitnah (disbelief and worshipping of others along with Allah) and (all and every kind of) worship is for Allah (Alone). But if they cease, let there be no transgression except against Az-Zalimun (the polytheists, and wrong-doers, etc.)\n",
        "TRANSLATION_14": "Fight against them until there is no dissension, and the religion is for Allah. But if they desist, there shall be no aggression except against the harmdoers.\n",
        "TRANSLATION_15": "And fight them until there is no oppression, and worship becomes devoted to God alone. But if they cease, then let there be no hostility except against the oppressors.\n",
        "TRANSLATION_16": "Fight them until there is no [more] fitnah and [until] worship is [acknowledged to be] for Allah. But if they cease, then there is to be no aggression except against the oppressors.\n",
        "TRANSLATION_17": "[2:193] Fight them till there is no sedition, no idolatry, and the religion, all worship, is for God, alone and none are worshipped apart from Him; then if they desist, from idolatry, do not aggress against them. This is indicated by the following words, there shall be no enmity, no aggression through slaying or otherwise, save against evildoers. Those that desist, however, are not evildoers and should not be shown any enmity.\n",
        "TRANSLATION_18": "(And fight them) if they initiate fighting against you whether you are in the Sacred Precinct or not (until persecution is no more) until there is not association of partners with Allah in the Sacred Precinct, (and religion is for Allah) and Islam and worship of Allah reign in the Sacred Precinct. (If they desist) from fighting you in the Sacred Precinct, (then let there be no hostility) you are not allowed to kill them (except 32 against wrong-doers) except those who start the fight against you.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:193",
            "8:39",
            "40:14",
            "60:9",
            "3:160",
            "16:37",
            "5:87",
            "60:8",
            "39:14",
            "3:32"
        ],
        "BIBLE": [
            "writings:daniel:6:16",
            "prophets:ezekiel:37:23",
            "writings:esther:1:19",
            "writings:proverbs:28:2",
            "prophets:jeremiah:3:13",
            "prophets:ezekiel:18:30",
            "writings:ecclesiastes:5:7",
            "prophets:jeremiah:23:5",
            "prophets:jeremiah:50:4",
            "prophets:hosea:14:10"
        ]
    }
}