{
    "VERSE": "2:195",
    "ARABIC": "وَأَنفِقُوا۟ فِى سَبِيلِ ٱللَّهِ وَلَا تُلْقُوا۟ بِأَيْدِيكُمْ إِلَى ٱلتَّهْلُكَةِ وَأَحْسِنُوٓا۟ إِنَّ ٱللَّهَ يُحِبُّ ٱلْمُحْسِنِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Spend in the Way of Allah. Do not cast yourselves into destruction. And do good: Allah loves good- doers.",
        "TRANSLATION_1": "Spend in the way of God, and do not seek destruction at your own hands. So do good for God loves those who do good.\n",
        "TRANSLATION_2": "Spend your wealth in the Way of Allah and do not cast yourselves into ruin with your own hands. Do all things gracefully, for Allah loves those who do all things with excellence\n",
        "TRANSLATION_3": "Give money for the cause of God but do not push yourselves into perdition. Do good; God loves the people who do good deeds.\n",
        "TRANSLATION_4": "And spend your wealth in Allah's cause, and do not fall into ruin with your own hands; and be virtuous; undoubtedly the righteous are the beloved of Allah.\n",
        "TRANSLATION_5": "And spend in the cause of Allah and do not throw yourselves into destruction, and do good. Truly, Allah loves Al-Muhsinin (those who do good).\n",
        "TRANSLATION_6": "And spend in the way of Allah and cast not yourselves to perdition with your own hands, and do good (to others); surely Allah loves the doers of good.\n",
        "TRANSLATION_7": "And expend in the way of God; and cast not yourselves by your own hands into destruction, but be good-doers; God loves the good-doers.\n",
        "TRANSLATION_8": "Spend your wealth for the cause of Allah, and be not cast by your own hands to ruin; and do good. Lo! Allah loveth the beneficent.\n",
        "TRANSLATION_9": "Spend for God's cause: do not cast yourselves into destruction by your own hands. Do good, God loves the doers of good.\n",
        "TRANSLATION_10": "And expend in the way of Allah, and cast not yourselves with your hands into perdition, and do well. verily Allah loveth the well- doers,\n",
        "TRANSLATION_11": "Spend in the way of Allah, and do not cast yourselves with your own hands into destruction; and be virtuous. Indeed Allah loves the virtuous.\n",
        "TRANSLATION_12": "And spend of your substance in the cause of Allah, and make not your own hands contribute to (your) destruction; but do good; for Allah loveth those who do good.\n",
        "TRANSLATION_13": "And spend in the Cause of Allah (i.e. Jihad of all kinds, etc.) and do not throw yourselves into destruction (by not spending your wealth in the Cause of Allah), and do good. Truly, Allah loves Al-Muhsinun (the good-doers).\n",
        "TRANSLATION_14": "Spend in the way of Allah and do not cast into destruction with your own hands. Be gooddoers; Allah loves the gooddoers.\n",
        "TRANSLATION_15": "And spend in the cause of God, and do not throw yourselves with your own hands into ruin, and be charitable. God loves the charitable.\n",
        "TRANSLATION_16": "And spend in the way of Allah and do not throw [yourselves] with your [own] hands into destruction [by refraining]. And do good; indeed, Allah loves the doers of good.\n",
        "TRANSLATION_17": "[2:195] And spend in the way of God, in obedience to Him, in holy struggle and the like; and cast not your own hands, yourselves (the bā’ of bi-aydīkum ‘with your hands’ is extra) into destruction, by withholding funds needed for the struggle or abandoning it altogether, because this will give your enemy the advantage over you; but be virtuous, by spending etc.; God loves the virtuous, that is, He rewards them.\n",
        "TRANSLATION_18": "(Spend your wealth for the cause of Allah) in obedience of Allah so as to perform the lesser pilgrimage, (and be not cast by your own hands to ruin) Allah says: do not refrain from giving in His cause lest you ruin yourselves. It is also said that this means: do not be the cause of your own ruin; and it is also said that this means: do not despair of Allah's mercy lest you ruin yourselves; (and do good) by spending in the cause of Allah; it is also said that this means: have a good opinion about Allah; and it is also said that this means: be good in your spending in the way of Allah. (Lo! Allah loveth the beneficent) who spend in His cause. The verses from (Fight in the way of Allah against those who fight against you) to (and do good. Lo! Allah loveth the beneficent) were revealed about the Companions who were in ritual consecration with the Prophet (pbuh) on their way to perform the lesser pilgrimage after the year of al-Hudaybiyyah.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:195",
            "2:190",
            "9:67",
            "29:69",
            "5:35",
            "4:76",
            "8:51",
            "3:182",
            "2:244",
            "14:30"
        ],
        "BIBLE": [
            "prophets:judges:18:10",
            "prophets:nahum:3:6",
            "writings:psalms:28:4",
            "prophets:judges:9:16",
            "writings:ecclesiastes:9:1",
            "prophets:i%20kings:8:56",
            "writings:psalms:119:73",
            "writings:i%20chronicles:21:3",
            "writings:nehemiah:2:8",
            "prophets:joshua:23:15"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:2"
        ]
    }
}