{
    "VERSE": "2:198",
    "ARABIC": "لَيْسَ عَلَيْكُمْ جُنَاحٌ أَن تَبْتَغُوا۟ فَضْلًا مِّن رَّبِّكُمْ فَإِذَآ أَفَضْتُم مِّنْ عَرَفَٰتٍ فَٱذْكُرُوا۟ ٱللَّهَ عِندَ ٱلْمَشْعَرِ ٱلْحَرَامِ وَٱذْكُرُوهُ كَمَا هَدَىٰكُمْ وَإِن كُنتُم مِّن قَبْلِهِۦ لَمِنَ ٱلضَّآلِّينَ",
    "ENGLISH": {
        "TRANSLATION_0": "There is nothing wrong in seeking bounty from your Lord. When you pour down from Arafat, remember Allah at the Sacred Landmark.* Remember Him because He has guided you, even though before this you were astray.",
        "TRANSLATION_1": "It is no sin to seek the favours of your Lord (by trading). When you start from 'Arafat in a concourse, remember God at the monument that is sacred (al-Mash'ar al-haram), and remember Him as He has shown you the way, for in the olden days you we're a people astray.\n",
        "TRANSLATION_2": "And there is nothing wrong if you also seek the bounty of your Lord during the pilgrimage. Moreover, when you return from 'Arafat, stay at Mash'aril-Haram (Muzdalifah) and remember Allah. And remember Him just as He has enjoined you, for you had gone astray before this.\n",
        "TRANSLATION_3": "It is not a sin if you try to make a profit out of the bounty of your Lord (by trading during hajj). When you leave Arafah, commemorate the name of your Lord in Mash'ar, the sacred reminder of God. Commemorate His name as He has given you guidance while prior to that you had been in error.\n",
        "TRANSLATION_4": "It is no sin for you that you seek the bounty of your Lord; so when you return from Arafat, remember Allah near the Sacred Symbol (Mash’ar al Haram) – and remember Him in the manner He has guided you; and indeed, before this, you were of the astray.\n",
        "TRANSLATION_5": "There is no sin on you if you seek the bounty of your Lord (during pilgrimage by trading). Then when you leave `Arafat, remember Allah (by glorifying His praises, i.e., prayers and invocations) at the Mash`ar-il-Haram. And remember Him (by invoking Allah for all good) as He has guided you, and verily you were before, of those who were astray.\n",
        "TRANSLATION_6": "There is no blame on you in seeking bounty from your Lord, so when you hasten on from \"Arafat\", then remember Allah near the Holy Monument, and remember Him as He has guided you, though before that you were certainly of the erring ones.\n",
        "TRANSLATION_7": "It is no fault in you, that you should seek bounty from your Lord; but when you press on from Arafat, then remember God at the Holy Waymark, and remember Him as He has guided you, though formerly you were gone astray.\n",
        "TRANSLATION_8": "It is no sin for you that ye seek the bounty of your Lord (by trading). But, when ye press on in the multitude from 'Arafat, remember Allah by the sacred monument. Remember Him as He hath guided you, although before ye were of those astray.\n",
        "TRANSLATION_9": "You will be committing no sin if [during the pilgrimage] you seek to obtain any bounty from your Lord. When you return from Arafat, remember God at the sacred place, and remember Him as He has guided you. Before this you were surely astray.\n",
        "TRANSLATION_10": "No fault it is in you if ye seek grace from your Lord. Then when ye hurry from Arafat, remember Allah near the sacred monument. Remember Him as He hath guided you, and ye were afore of the erring.\n",
        "TRANSLATION_11": "There is no sin upon you in seeking your Lord’s bounty [during the hajj season]. Then when you stream out of ‘Arafat remember Allah at the Holy Mash‘ar, and remember Him as He has guided you, and earlier you were indeed among the astray.\n",
        "TRANSLATION_12": "It is no crime in you if ye seek of the bounty of your Lord (during pilgrimage). Then when ye pour down from (Mount) Arafat, celebrate the praises of Allah at the Sacred Monument, and celebrate His praises as He has directed you, even though, before this, ye went astray.\n",
        "TRANSLATION_13": "There is no sin on you if you seek the Bounty of your Lord (during pilgrimage by trading, etc.). Then when you leave 'Arafat, remember Allah (by glorifying His Praises, i.e. prayers and invocations, etc.) at the Mash'ar-il-Haram. And remember Him (by invoking Allah for all good, etc.) as He has guided you, and verily, you were, before, of those who were astray.\n",
        "TRANSLATION_14": "It shall be no offense for you to seek the bounty of your Lord. When you surge on from Arafat, remember Allah as you approach the Holy Mountain of Mash'ar. Remember Him as it is He who guided you though before that you were amongst the astray.\n",
        "TRANSLATION_15": "You commit no error by seeking bounty from your Lord. When you disperse from Arafat, remember God at the Sacred Landmark. And remember Him as He has guided you. Although, before that, you were of those astray.\n",
        "TRANSLATION_16": "There is no blame upon you for seeking bounty from your Lord [during Hajj]. But when you depart from 'Arafat, remember Allah at al- Mash'ar al-Haram. And remember Him, as He has guided you, for indeed, you were before that among those astray.\n",
        "TRANSLATION_17": "[2:198] You would not be at fault if you should seek bounty, sustenance, from your Lord, by engaging in commerce at the Pilgrimage: this was revealed in response to their aversion to such an idea; but when you press on, push on, from ‘Arafāt, having stood [in prayer] upon it, then remember God, after the overnight stay at Muzdalifa, by repeating the talbiya [sc. labbayka Llāhummā labbayk, ‘at thy service, O God, at thy service’], the tahlīl [lā ilāha illā Llāh, ‘no god but God’] and making supplications, at the Sacred Waymark, a mountain at the end of Muzdalifa, called Quzah. In one hadīth, the Prophet (s) stood there remembering God and supplicating until his face began to glow brightly, according to Muslim; and remember Him as He has guided you, to the principal rites of His religion and the rituals of His Pilgrimage (the kāf of ka-mā, ‘as’, is the particle denoting the reason), though previously, before His guidance, you were astray.\n",
        "TRANSLATION_18": "(It is no sin) there is no constraint (for you that ye seek the bounty of your Lord (by trading)) by engaging in trade in the Sacred Precinct. This was revealed about a group of people who were against buying and selling in the Sacred Precinct, and so legal dispensation was given to allow it. (But, when you press on in the multitude from 'Arafat) when you return from 'Arafat to the Sacred monument, (remember Allah) with your heart and tongue (by the Sacred monument. Remember Him as He hath guided you, although before) before Muhammad (pbuh) the Qur'an and Islam (ye were of the astray) among the unbelievers.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:198",
            "2:64",
            "2:158",
            "3:73",
            "2:194",
            "2:89",
            "2:76",
            "2:112",
            "22:30",
            "5:2"
        ],
        "BIBLE": [
            "torah:leviticus:10:17",
            "prophets:nahum:1:14",
            "writings:ii%20chronicles:6:27",
            "torah:deuteronomy:9:7",
            "torah:genesis:18:33",
            "prophets:joshua:1:8",
            "writings:ii%20chronicles:14:6",
            "torah:deuteronomy:12:21",
            "prophets:amos:4:6",
            "prophets:i%20kings:8:36"
        ]
    }
}