{
    "VERSE": "2:2",
    "ARABIC": "ذَٰلِكَ ٱلْكِتَٰبُ لَا رَيْبَ فِيهِ هُدًى لِّلْمُتَّقِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "That is the Book, without any doubt. It contains guidance for those who have taqwa:",
        "TRANSLATION_1": "This is The Book free of doubt and involution, a guidance for those who preserve themselves from evil and follow the straight path,\n",
        "TRANSLATION_2": "This is the Book of Allah: there is no doubt about it. It is guidance to Godfearing people,\n",
        "TRANSLATION_3": "There is no doubt that this book is a guide for the pious;\n",
        "TRANSLATION_4": "This is the exalted Book (the Qur’an), in which there is no place for doubt; a guidance for the pious.\n",
        "TRANSLATION_5": "That is Book in which there is no Rayb, guidance for the Muttaqin.\n",
        "TRANSLATION_6": "This Book, there is no doubt in it, is a guide to those who guard (against evil).\n",
        "TRANSLATION_7": "That is the Book, wherein is no doubt, a guidance to the godfearing\n",
        "TRANSLATION_8": "This is the Scripture whereof there is no doubt, a guidance unto those who ward off (evil).\n",
        "TRANSLATION_9": "This is the Book; there is no doubt in it. It is a guide for those who are mindful of God,\n",
        "TRANSLATION_10": "This Book whereof there is no doubt, is a guidance unto the God-fearing.\n",
        "TRANSLATION_11": "This is the Book, there is no doubt in it, a guidance to the Godwary,\n",
        "TRANSLATION_12": "This is the Book; in it is guidance sure, without doubt, to those who fear Allah;\n",
        "TRANSLATION_13": "This is the Book (the Quran), whereof there is no doubt, a guidance to those who are Al-Muttaqun [the pious and righteous persons who fear Allah much (abstain from all kinds of sins and evil deeds which He has forbidden) and love Allah much (perform all kinds of good deeds which He has ordained)].\n",
        "TRANSLATION_14": "That is the (Holy) Book, where there is no doubt. It is a guidance for the cautious (of evil and Hell).\n",
        "TRANSLATION_15": "This is the Book in which there is no doubt, a guide for the righteous.\n",
        "TRANSLATION_16": "This is the Book about which there is no doubt, a guidance for those conscious of Allah -\n",
        "TRANSLATION_17": "[2:2] That, meaning, this, Book, which Muhammad (s) recites, in it there is no doubt, no uncertainty, that it is from God (the negation [lĀ rayba fĪhi] is the predicate of dhĀlika; the use of the demonstrative here is intended to glorify [the Book]). A guidance (hudĀ is a second predicate, meaning that it [the Book] ‘guides’), for the God-fearing, namely, those that tend towards piety by adhering to commands and avoiding things prohibited, thereby guarding themselves from the Fire;\n",
        "TRANSLATION_18": "(This is the Scripture), i.e. this is the Book that Muhammad (pbuh) is reciting to you; (whereof there is no doubt). There is no doubt that it has come from Me; if you believe in it, I shall guide you, but if you do not believe in it, I will torment you. It is also said that (This is the Scripture) refers to the Guarded Tablet. It is also said that this means: This is the Book that I promised to reveal to you on the Day of the Covenant (yawm al-mithaq). It is also said (this is the Scripture whereof there is no doubt) means there is no doubt that the description and traits of Muhammad are found in the Torah and Gospel. (A guidance unto those who ward off (evil)), means that the Qur'an is an exposition for those who ward off disbelief, associating partners with Allah and indecencies. It is also said that it means: it is a favour to the believers; or that it means it is a mercy unto those who ward off evil from among the community of Muhammad (pbuh).\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:2",
            "32:2",
            "32:23",
            "16:64",
            "17:2",
            "56:78",
            "68:37",
            "40:53",
            "26:2",
            "28:2"
        ],
        "BIBLE": [
            "prophets:ii%20samuel:17:9",
            "writings:psalms:38:21",
            "writings:proverbs:15:3",
            "writings:ii%20chronicles:34:24",
            "prophets:i%20kings:13:33",
            "prophets:ezekiel:46:20",
            "torah:exodus:18:23",
            "prophets:jeremiah:24:5",
            "torah:deuteronomy:6:24",
            "prophets:judges:2:12"
        ]
    }
}