{
    "VERSE": "2:202",
    "ARABIC": "أُو۟لَٰٓئِكَ لَهُمْ نَصِيبٌ مِّمَّا كَسَبُوا۟ وَٱللَّهُ سَرِيعُ ٱلْحِسَابِ",
    "ENGLISH": {
        "TRANSLATION_0": "They will have a good share from what they have earned. Allah is swift at reckoning.",
        "TRANSLATION_1": "They are those who will surely have their share of whatsoever they have earned; for God is swift at the reckoning.\n",
        "TRANSLATION_2": "Such people shall have their due share (in both the worlds) according to what they earn. And Allah is swift at settling accounts.\n",
        "TRANSLATION_3": "They will have their share of the reward for their deeds. God's reckoning is swift.\n",
        "TRANSLATION_4": "For such is a portion from what they have earned; and Allah is Swift At Taking Account.\n",
        "TRANSLATION_5": "For them there will be alloted a share for what they have earned. And Allah is swift at reckoning.\n",
        "TRANSLATION_6": "They shall have (their) portion of what they have earned, and Allah is swift in reckoning.\n",
        "TRANSLATION_7": "those -- they shall have a portion from what they have earned; and God is swift at the reckoning.\n",
        "TRANSLATION_8": "For them there is in store a goodly portion out of that which they have earned. Allah is swift at reckoning.\n",
        "TRANSLATION_9": "They shall have a good share from what they have earned. God is swift in His reckoning.\n",
        "TRANSLATION_10": "These! for them will be a share for that which they have earned. and Allah is swift at reckoning.\n",
        "TRANSLATION_11": "Such shall partake of what they have earned, and Allah is swift at reckoning.\n",
        "TRANSLATION_12": "To these will be allotted what they have earned; and Allah is quick in account.\n",
        "TRANSLATION_13": "For them there will be alloted a share for what they have earned. And Allah is Swift at reckoning.\n",
        "TRANSLATION_14": "These shall have a share of what they have earned. Swift is the reckoning of Allah.\n",
        "TRANSLATION_15": "These will have a share of what they have earned. God is swift in reckoning.\n",
        "TRANSLATION_16": "Those will have a share of what they have earned, and Allah is swift in account.\n",
        "TRANSLATION_17": "[2:202] Those — they shall have a portion, a reward, from, as a result of, what they have earned, the deeds they have performed, such as Pilgrimage and supplication; and God is swift at reckoning, reckoning with the whole of creation in half a day of this world, as one hadīth states.\n",
        "TRANSLATION_18": "(For these) who are thus (there is in store a goodly portion) a great portion in Paradise (out of that which they have earned) from their pilgrimage. (Allah is swift in reckoning) Allah says: when He takes people to task, His reckoning is swift; it is also said that this means: swift in His protection. It is said that this means: His punishment is severe towards those who show off in their devotional works. 34\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:202",
            "16:56",
            "4:52",
            "6:136",
            "5:4",
            "4:61",
            "5:80",
            "84:23",
            "47:23",
            "4:32"
        ],
        "BIBLE": [
            "prophets:jeremiah:32:38",
            "writings:ecclesiastes:4:9",
            "prophets:jeremiah:30:22",
            "torah:deuteronomy:18:8",
            "prophets:jeremiah:42:4",
            "prophets:ezekiel:37:27",
            "writings:ezra:7:18",
            "prophets:jeremiah:29:32",
            "prophets:ii%20kings:8:11",
            "prophets:joshua:1:17"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:5:2"
        ]
    }
}