{
    "VERSE": "2:203",
    "ARABIC": "وَٱذْكُرُوا۟ ٱللَّهَ فِىٓ أَيَّامٍ مَّعْدُودَٰتٍ فَمَن تَعَجَّلَ فِى يَوْمَيْنِ فَلَآ إِثْمَ عَلَيْهِ وَمَن تَأَخَّرَ فَلَآ إِثْمَ عَلَيْهِ لِمَنِ ٱتَّقَىٰ وَٱتَّقُوا۟ ٱللَّهَ وَٱعْلَمُوٓا۟ أَنَّكُمْ إِلَيْهِ تُحْشَرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Remember Allah on the designated days. Those who hurry on in two days have done no wrong, and those who stay another day have done no wrong - those of them who have taqwa. So have taqwa of Allah. And know that you will be gathered back to Him.",
        "TRANSLATION_1": "Remember God during the stated days; but if a person comes away after two days, it will not be a sin; and if one tarries, he will not transgress, if he keep away from evil. Follow the law of God, and remember that you will have to gather before Him in the end.\n",
        "TRANSLATION_2": "So pass these few appointed days in remembering Allah; then there is nothing wrong if one hastens on (from Mina) after two days or stays there (a day) longer, \" provided that he spends these days it piety. Do not disobey Him and remember that One Day you shall be mustered before Him.\n",
        "TRANSLATION_3": "Commemorate (the names of) God in the prescribed days. For one who observes piety, it is not a sin to be hasty or tardy during the two days. Have fear of God and know that before Him you will all be raised after death.\n",
        "TRANSLATION_4": "And remember Allah in the counted days; so whoever hastens by departing in two days, there is no sin on him; and whoever stays on, there is no sin for him – for the pious; and keep fearing Allah, and know well that it is to Him you will be raised.\n",
        "TRANSLATION_5": "And remember Allah during the Appointed Days. But whosoever hastens to leave in two days, there is no sin on him and whosoever stays on, there is no sin on him, if his aim is to do good and obey Allah (fear Him), and know that you will surely be gathered unto Him.\n",
        "TRANSLATION_6": "And laud Allah during the numbered days; then whoever hastens off in two days, there is no blame on him, and whoever remains behind, there is no blame on him, (this is) for him who guards (against evil), and be careful (of your duty) to Allah, and know that you shall be gathered together to Him.\n",
        "TRANSLATION_7": "And remember God during certain days numbered. If any man hastens on in two days, that is no sin in him; and if any delays, it is not a sin in him, if he be godfearing. And fear you God, and know that unto Him you shall be mustered.\n",
        "TRANSLATION_8": "Remember Allah through the appointed days. Then whoso hasteneth (his departure) by two days, it is no sin for him, and whoso delayeth, it is no sin for him; that is for him who wardeth off (evil). Be careful of your duty to Allah, and know that unto Him ye will be gathered.\n",
        "TRANSLATION_9": "Remember God during the appointed days; for one who hastens to leave in two days, it shall be no sin; and for one who stays on, it shall be no sin for him either. This is for one who fears God. Have fear of God, and know that you shall all be gathered before Him.\n",
        "TRANSLATION_10": "And remember Allah on the days numbered. Then whosoever hastenoth in two days on him is no sin, and whosoever delayeth, On him is no sin: this for him: who feareth. So fear Allah, and know that verily unto Him shall ye be gathered.\n",
        "TRANSLATION_11": "Remember Allah in the appointed days. Then whoever hastens off in a couple of days, there is no sin upon him, and whoever delays, there is no sin upon him—that for one who has been Godwary—and be wary of Allah and know that toward Him you will be mustered.\n",
        "TRANSLATION_12": "Celebrate the praises of Allah during the Appointed Days. But if any one hastens to leave in two days, there is no blame on him, and if any one stays on, there is no blame on him, if his aim is to do right. Then fear Allah, and know that ye will surely be gathered unto Him.\n",
        "TRANSLATION_13": "And remember Allah during the appointed Days. But whosoever hastens to leave in two days, there is no sin on him and whosoever stays on, there is no sin on him, if his aim is to do good and obey Allah (fear Him), and know that you will surely be gathered unto Him.\n",
        "TRANSLATION_14": "Remember Allah during counted days. Whosoever hastens on in two days, no sin shall be on him. And if any delay, no sin shall be on him, for he who wardsoff (evil). And fear Allah, and know that you shall be assembled unto Him.\n",
        "TRANSLATION_15": "And remember God during the designated days. But whoever hurries on in two days commits no wrong, and whoever stays on commits no wrong—provided he maintains righteousness. And obey God, and know that to Him you will be gathered.\n",
        "TRANSLATION_16": "And remember Allah during [specific] numbered days. Then whoever hastens [his departure] in two days - there is no sin upon him; and whoever delays [until the third] - there is no sin upon him - for him who fears Allah. And fear Allah and know that unto Him you will be gathered.\n",
        "TRANSLATION_17": "[2:203] And remember God, by making takbīr [saying Allāhu akbar, ‘God is Great’] while you cast your stones at the Jamarāt, during certain days numbered, the three days of tashrīq. If any man hastens on, his departure from Minā, in two days, that is, on the second day of tashrīq after he has cast his stones, that, hastening, is no sin for him; and if he delays, such that he stays until the third night and cast his stones, it is not a sin for him: that is, they have the choice of either, for the sin has been precluded in both cases; if he fears, God during his pilgrimage — for such [a person] is truly a pilgrim — and fear God, and know that to Him you shall be gathered, in the Hereafter, that He may requite you for your deeds.\n",
        "TRANSLATION_18": "(Remember Allah) by saying: \"Allah is great\", \"there is no god except Allah\" and \"glory be to Allah\", (through the appointed days) during five days: the day of 'Arafah, the day of immolation and the three days after it. (Then whoso hasteneth (in departure)) to return to his family (by two days) after the day of immolation, (it is no sin for him) by this hastening, (and whoso delayeth) it to the third day, (it is no sin for him) by this delay; it is said that this means: there is no reproach on him because of this delay and he shall leave with his sins forgiven; (that is for him who wardeth off (evil)) He says: hastening departure is for him who avoids hunting until the third day. (Be careful of your duty to Allah) He says: fear Allah in taking what is hunted until the third day, (and know that unto Him ye will be gathered) after you die\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:203",
            "40:33",
            "9:77",
            "12:92",
            "7:186",
            "16:37",
            "14:42",
            "5:69",
            "2:281",
            "2:173"
        ],
        "BIBLE": [
            "writings:esther:4:11",
            "prophets:jeremiah:23:5",
            "torah:deuteronomy:31:29",
            "writings:daniel:6:13",
            "prophets:i%20samuel:28:1",
            "prophets:ezekiel:3:20",
            "torah:exodus:32:1",
            "prophets:ezekiel:18:24",
            "prophets:judges:19:9",
            "prophets:ezekiel:33:12"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:6:2"
        ]
    }
}