{
    "VERSE": "2:204",
    "ARABIC": "وَمِنَ ٱلنَّاسِ مَن يُعْجِبُكَ قَوْلُهُۥ فِى ٱلْحَيَوٰةِ ٱلدُّنْيَا وَيُشْهِدُ ٱللَّهَ عَلَىٰ مَا فِى قَلْبِهِۦ وَهُوَ أَلَدُّ ٱلْخِصَامِ",
    "ENGLISH": {
        "TRANSLATION_0": "Among the people there is someone whose words about the life of this world excite your admiration, and he calls Allah to witness what is in his heart, while he is in fact the most hostile of adversaries.",
        "TRANSLATION_1": "There is a man who talks well of the world to your pleasing, and makes God witness to what is in his heart, yet he is the most contentious;\n",
        "TRANSLATION_2": "There is a certain type of man who charms you in this worldly life with his glib talk. He calls Allah to witness again and again that he cherishes good intentions in his heart, whereas, in fact, he is the deadliest opponent of the Truth.\n",
        "TRANSLATION_3": "There are some people whose words about this life may please you. They say that God knows what they have in their hearts. But, in fact, they are the most quarrelsome opponents.\n",
        "TRANSLATION_4": "And among men is one whose conversation may please you in the life of this world, and he brings Allah as witness to what is in his heart, whereas he is the biggest quarreller!\n",
        "TRANSLATION_5": "And of mankind there is he whose speech may please you (O Muhammad), in this worldly life, and he calls Allah to witness as to that which is in his heart, yet he is the most quarrelsome of the opponents.\n",
        "TRANSLATION_6": "And among men is he whose speech about the life of this world causes you to wonder, and he calls on Allah to witness as to what is in his heart, yet he is the most violent of adversaries.\n",
        "TRANSLATION_7": "And some men there are whose saying upon the present world pleases thee, and such a one calls on God to witness what is in his heart, yet he is most stubborn in altercation,\n",
        "TRANSLATION_8": "And of mankind there is he whoso conversation on the life of this world pleaseth thee (Muhammad), and he calleth Allah to witness as to that which is in his heart; yet he is the most rigid of opponents.\n",
        "TRANSLATION_9": "There are some men whose views on the affairs of this life may please you. They even call on God to witness whatever is in their heart, yet they are the most contentious of quarrellers.\n",
        "TRANSLATION_10": "And of mankind is he whose discourse for the purpose of this world thou admirest, and he taketh Allah to witness as to that which is in his heart, whereas he is the most contentious of the adversaries.\n",
        "TRANSLATION_11": "Among the people is he whose talk about worldly life impresses you, and he holds Allah witness to what is in his heart, though he is the staunchest of enemies.\n",
        "TRANSLATION_12": "There is the type of man whose speech about this world's life May dazzle thee, and he calls Allah to witness about what is in his heart; yet is he the most contentious of enemies.\n",
        "TRANSLATION_13": "And of mankind there is he whose speech may please you (O Muhammad SAW), in this worldly life, and he calls Allah to witness as to that which is in his heart, yet he is the most quarrelsome of the opponents.\n",
        "TRANSLATION_14": "There is he whose sayings pleases you in this worldly life and uses Allah as a witness for what is in his heart, but he is most stubborn in adversary.\n",
        "TRANSLATION_15": "Among the people is he whose speech about the worldly life impresses you, and he calls God to witness what is in his heart, while he is the most hostile of adversaries.\n",
        "TRANSLATION_16": "And of the people is he whose speech pleases you in worldly life, and he calls Allah to witness as to what is in his heart, yet he is the fiercest of opponents.\n",
        "TRANSLATION_17": "[2:204] And among people there is he whose speech in the life of this world pleases you, but it would not please you in the Hereafter because it contradicts what he actually used to believe; and who calls on God to witness what is in his heart, as being in accordance with what he says; yet he is most stubborn in dispute, with you and your followers on account of his enmity towards you: this was al-Akhnas b. Sharīq, a hypocrite who spoke kindly in the presence of the Prophet (s), swearing that he believed in him and that he loved him, and frequently sitting with him. God then revealed his mendacity in this matter. On one occasion he passed by some crops and livestock that belonged to the Muslims and later that night he set fire to them [the crops] and slaughtered them [the livestock]. God, moreover, says:\n",
        "TRANSLATION_18": "(And of mankind there is he whose conversation on the life of this world pleaseth thee (Muhammad)) his speech, words and outward appearance pleases you, (and he calleth Allah to witness as to that which is in his heart) he swears by Allah that he loves and follows you; (yet he is the most rigid of opponents) yet he argues about falsehood and is a staunch opponent.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:204",
            "14:27",
            "13:26",
            "16:107",
            "13:34",
            "9:55",
            "22:35",
            "4:109",
            "2:8",
            "9:77"
        ],
        "BIBLE": [
            "prophets:jeremiah:20:9",
            "prophets:i%20kings:2:42",
            "writings:proverbs:22:21",
            "prophets:i%20samuel:28:15",
            "prophets:ii%20kings:10:5",
            "writings:job:11:3",
            "torah:deuteronomy:4:10",
            "prophets:isaiah:48:1",
            "torah:exodus:32:23",
            "prophets:isaiah:38:16"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:3:6",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:4:8"
        ]
    }
}