{
    "VERSE": "2:209",
    "ARABIC": "فَإِن زَلَلْتُم مِّنۢ بَعْدِ مَا جَآءَتْكُمُ ٱلْبَيِّنَٰتُ فَٱعْلَمُوٓا۟ أَنَّ ٱللَّهَ عَزِيزٌ حَكِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "If you backslide after the Clear Signs have come to you, know that Allah is Almighty, All-Wise.",
        "TRANSLATION_1": "If you falter even after Our signs have reached you, then do not forget that God is all-powerful and all-wise.\n",
        "TRANSLATION_2": "If you lapse back after receiving the clear teachings that have come to you, know it well that Allah is All-Powerful, All-Wise.\n",
        "TRANSLATION_3": "If you are seduced after you have received the authoritative guidance, know that God is Majestic and Wise.\n",
        "TRANSLATION_4": "And if you renege, even after the clear commands have come to you, then know well that Allah is Almighty, Wise.\n",
        "TRANSLATION_5": "Then if you slide back after the clear signs (Prophet Muhammad, and this Qur'an and Islam) have come to you, then know that Allah is All-Mighty, All-Wise.\n",
        "TRANSLATION_6": "But if you slip after clear arguments have come to you, then know that Allah is Mighty, Wise.\n",
        "TRANSLATION_7": "But if you slip, after the clear signs have come to you, know then that God is All-mighty, All-wise.\n",
        "TRANSLATION_8": "And if ye slide back after the clear proofs have come unto you, then know that Allah is Mighty, Wise.\n",
        "TRANSLATION_9": "But if you lapse after the clear signs that have come to you, then know that God is mighty and wise.\n",
        "TRANSLATION_10": "Wherefore if ye slip after that which hath come unto you of the evidence then - know that Allah is Mighty, Wise.\n",
        "TRANSLATION_11": "And should you stumble after the manifest proofs that have come to you, know that Allah is all-mighty, all-wise.\n",
        "TRANSLATION_12": "If ye backslide after the clear (Signs) have come to you, then know that Allah is Exalted in Power, Wise.\n",
        "TRANSLATION_13": "Then if you slide back after the clear signs (Prophet Muhammad SAW and this Quran, and Islam) have come to you, then know that Allah is All-Mighty, All-Wise.\n",
        "TRANSLATION_14": "If you lapse back after the clear verses that have come to you, know that Allah is the Almighty, the Wise.\n",
        "TRANSLATION_15": "But if you slip after the proofs have come to you, know that God is Powerful and Wise.\n",
        "TRANSLATION_16": "But if you deviate after clear proofs have come to you, then know that Allah is Exalted in Might and Wise.\n",
        "TRANSLATION_17": "[2:209] But if you slip, and incline away from implementing all of its precepts, after the clear proofs, the lucid arguments, have come to you, to the effect that this is the truth, know then that God is Mighty, and nothing can prevent Him from taking His vengeance against you; Wise, in His actions.\n",
        "TRANSLATION_18": "(And if ye slide back after the clear proofs have come unto you) after the exposition which is in your Scripture, (then know that Allah is Mighty) in His vengeance towards anyone who does not follow His Messenger, (Wise) in abrogating the laws of bygone nations. This was revealed about 'Abdullah Ibn Salam and his companions because they disliked the Sabbath and the meat of camels amongst other things. 35\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:209",
            "35:2",
            "29:42",
            "39:1",
            "45:2",
            "46:2",
            "5:38",
            "8:49",
            "4:158",
            "8:63"
        ],
        "BIBLE": [
            "writings:ii%20chronicles:25:16",
            "prophets:ii%20kings:5:8",
            "writings:psalms:78:6",
            "torah:numbers:22:38",
            "prophets:ezekiel:24:24",
            "writings:psalms:49:16",
            "prophets:isaiah:41:23",
            "prophets:i%20kings:18:36",
            "writings:daniel:2:29",
            "torah:genesis:19:8"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:7"
        ]
    }
}