{
    "VERSE": "2:210",
    "ARABIC": "هَلْ يَنظُرُونَ إِلَّآ أَن يَأْتِيَهُمُ ٱللَّهُ فِى ظُلَلٍ مِّنَ ٱلْغَمَامِ وَٱلْمَلَٰٓئِكَةُ وَقُضِىَ ٱلْأَمْرُ وَإِلَى ٱللَّهِ تُرْجَعُ ٱلْأُمُورُ",
    "ENGLISH": {
        "TRANSLATION_0": "What are they waiting for but for Allah to come to them in the shadows of the clouds, together with the angels, in which case the matter will have been settled? All matters return to Allah.",
        "TRANSLATION_1": "Are they waiting for God to appear in the balconies of clouds with a host of angels, and the matter to be settled? But all things rest with God in the end.\n",
        "TRANSLATION_2": "(If people do not follow the right way even after receiving such clear admonitions), do they await that Allah Himself should come down to them in the canopies of clouds with a retinue of angels, and seal their doom Ultimately every thing shall be presented before Allah (for judgement).\n",
        "TRANSLATION_3": "Have they decided not to believe until God comes down in a shadow of clouds with the angels so that then the matter is settled? To God do all matters return.\n",
        "TRANSLATION_4": "What are they waiting for, except that Allah’s punishment should come through stretched clouds and the angels descend and the matter be finished? And all matters are directed only towards Allah.\n",
        "TRANSLATION_5": "Do they then wait for anything other than that Allah should come to them over the shadows of the clouds and the angels (Then) the case would be already judged. And to Allah return all matters (for decision).\n",
        "TRANSLATION_6": "They do not wait aught but that Allah should come to them in the shadows of the clouds along with the angels, and the matter has (already) been decided; and (all) matters are returned to Allah.\n",
        "TRANSLATION_7": "What do they look for, but that God shall come to them in the cloud -- shadows, and the angels? The matter is determined, and unto God all matters are returned.\n",
        "TRANSLATION_8": "Wait they for naught else than that Allah should come unto them in the shadows of the clouds with the angels? Then the case would be already judged. All cases go back to Allah (for judgment).\n",
        "TRANSLATION_9": "Are they only waiting for God as well as the angels to come down to them under canopies of clouds, so that the matter will be settled? All things return to God.\n",
        "TRANSLATION_10": "Await they only that Allah shall come unto them in the shadows of the Clouds, and also the angels, and the affair is decreed! And unto Allah are all affairs returned.\n",
        "TRANSLATION_11": "Do they await anything but that Allah [’s command] should come to them in the shades of the clouds, with the angels, and the matter be decided [once for all]? To Allah all matters are returned.\n",
        "TRANSLATION_12": "Will they wait until Allah comes to them in canopies of clouds, with angels (in His train) and the question is (thus) settled? but to Allah do all questions go back (for decision).\n",
        "TRANSLATION_13": "Do they then wait for anything other than that Allah should come to them in the shadows of the clouds and the angels? (Then) the case would be already judged. And to Allah return all matters (for decision).\n",
        "TRANSLATION_14": "Are they waiting for Allah to come to them in the shadows of the clouds with the angels! Their matter will have been settled then. To Allah shall all things return.\n",
        "TRANSLATION_15": "Are they waiting for God Himself to come to them in the shadows of the clouds, together with the angels, and thus the matter is settled? All things are returned to God.\n",
        "TRANSLATION_16": "Do they await but that Allah should come to them in covers of clouds and the angels [as well] and the matter is [then] decided? And to Allah [all] matters are returned.\n",
        "TRANSLATION_17": "[2:210] What do they, those that fail to enter into it [sc. Islam] completely, wait for, await, that God shall come to them, that is, His Command; this is similar to where God says, or that God’s command should come to pass [Q. 16:33], meaning His chastisement, in the shadows (zulal, plural of zulla) of clouds, and the angels? The matter is determined, the matter of their destruction has been completed, and to God all matters are returned, in the Hereafter, where He will requite each according to his deeds (read passive [turja‘u al-umūr, ‘matters are returned’] or active [tarji‘u al-umūr, ‘matters return’]).\n",
        "TRANSLATION_18": "(Wait they) the people of Mecca (for nothing else than that Allah should come unto them) on the Day of Judgement, but this coming is without any modality (bila-kayfa) (in the shadows of the clouds with the angels? Then the case would be already judged) the people of Paradise would already be in Paradise and the people of hell in hell. (All cases go back to Allah) the consequences of all things go back to Allah in the Hereafter.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:210",
            "16:33",
            "57:5",
            "8:44",
            "16:2",
            "3:109",
            "2:257",
            "35:4",
            "4:166",
            "53:26"
        ],
        "BIBLE": [
            "writings:ezra:5:5",
            "prophets:ezekiel:46:9",
            "writings:ruth:1:16",
            "prophets:zechariah:8:3",
            "torah:exodus:13:17",
            "prophets:i%20kings:18:21",
            "writings:ii%20chronicles:25:16",
            "prophets:ii%20samuel:15:24",
            "prophets:isaiah:10:23",
            "torah:exodus:19:9"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:3:6"
        ]
    }
}