{
    "VERSE": "2:212",
    "ARABIC": "زُيِّنَ لِلَّذِينَ كَفَرُوا۟ ٱلْحَيَوٰةُ ٱلدُّنْيَا وَيَسْخَرُونَ مِنَ ٱلَّذِينَ ءَامَنُوا۟ وَٱلَّذِينَ ٱتَّقَوْا۟ فَوْقَهُمْ يَوْمَ ٱلْقِيَٰمَةِ وَٱللَّهُ يَرْزُقُ مَن يَشَآءُ بِغَيْرِ حِسَابٍ",
    "ENGLISH": {
        "TRANSLATION_0": "To those who are kafir, the life of this world is painted in glowing colours and they laugh at those who have iman. But on the Day of Rising those who fear Allah will be over them. Allah provides for whomever He wills without any reckoning.",
        "TRANSLATION_1": "Enamoured are the unbelievers of the life of this world, and scoff at the faithful. But those who keep from evil and follow the straight path will have a higher place than they on the Day of Reckoning; for God gives in measure without number whomsoever He will.\n",
        "TRANSLATION_2": "This worldly life has been made very charming and alluring for those who have adopted the way of disbelief. So they mock at those who have adopted the way of belief, but (they forget that) the pious people will rank above them on the Day of Resurrection. As to the wordly provisions, Allah has full authority and power to bestow these without measure on anyone He wills.\n",
        "TRANSLATION_3": "The worldly life is made to seem attractive to the disbelievers who scoff at the faithful, but the pious, in the life hereafter, will have a position far above them. God grants sustenance (without account) to anyone He wants.\n",
        "TRANSLATION_4": "The life of this world is made to appear beautiful in the sight of the disbelievers, and they make fun of the believers; and the pious will be above them on the Day of Resurrection; and Allah may give to whomever He wills, without account.\n",
        "TRANSLATION_5": "Beautified is the life of this world for those who disbelieve, and they mock at those who believe. But those who have Taqwa, will be above them on the Day of Resurrection. And Allah gives (of His bounty, blessings, favors, and honors on the Day of Resurrection) to whom He wills without limit.\n",
        "TRANSLATION_6": "The life of this world is made to seem fair to those who disbelieve, and they mock those who believe, and those who guard (against evil) shall be above them on the day of resurrection; and Allah gives means of subsistence to whom he pleases without measure.\n",
        "TRANSLATION_7": "Decked out fair to the unbelievers is the present life, and they deride the believers; but those who were godfearing shall be above them on the Resurrection Day; and God provides whomsoever He will without reckoning.\n",
        "TRANSLATION_8": "Beautified is the life of the world for those who disbelieve; they make a jest of the believers. But those who keep their duty to Allah will be above them on the Day of Resurrection. Allah giveth without stint to whom He will.\n",
        "TRANSLATION_9": "The life of this world is made to appear attractive for those who deny the truth and they scoff at those who believe. But those who fear God shall be above them on the Day of Resurrection: God bestows His bounties on whoever He pleases without stinting.\n",
        "TRANSLATION_10": "Fair-seeming is made the life of the world unto those who disbelieve, and they scoff at those who believe, whereas those who fear God shall be above them on the Day of Resurrection. And Allah provideth whomsoever He listeth without reckoning.\n",
        "TRANSLATION_11": "Worldly life has been glamorized for the faithless, and they ridicule the faithful. But those who are Godwary shall be above them on the Day of Resurrection, and Allah provides for whomever He wishes without any reckoning.\n",
        "TRANSLATION_12": "The life of this world is alluring to those who reject faith, and they scoff at those who believe. But the righteous will be above them on the Day of Resurrection; for Allah bestows His abundance without measure on whom He will.\n",
        "TRANSLATION_13": "Beautified is the life of this world for those who disbelieve, and they mock at those who believe. But those who obey Allah's Orders and keep away from what He has forbidden, will be above them on the Day of Resurrection. And Allah gives (of His Bounty, Blessings, Favours, Honours, etc. on the Day of Resurrection) to whom He wills without limit.\n",
        "TRANSLATION_14": "For those who disbelieve, the worldly life is decked with all manner of decorations. They scoff at those who believe, but the cautious shall be above them on the Day of Resurrection. Allah gives without count to whom He will.\n",
        "TRANSLATION_15": "Beautified is the life of this world for those who disbelieve, and they ridicule those who believe. But the righteous will be above them on the Day of Resurrection. God provides to whomever He wills without measure.\n",
        "TRANSLATION_16": "Beautified for those who disbelieve is the life of this world, and they ridicule those who believe. But those who fear Allah are above them on the Day of Resurrection. And Allah gives provision to whom He wills without account.\n",
        "TRANSLATION_17": "[2:212] Decked out fair to the disbelievers, of Mecca, is the life of this world, in disguise and they have fallen in love with it; and they deride the believers, on account of their poverty, the likes of Bilāl [al-Habashī], ‘Ammār [b. Yāsir], and Suhayb [al-Rūmī], mocking them and treating them condescendingly with their wealth; but those who fear, idolatry, namely, those mentioned, shall be above them on the Day of Resurrection; and God sustains whomever He will without reckoning, with ample sustenance in the Hereafter or in this world, when He gives to those that were mocked possession of the property and lives of those that mocked them.\n",
        "TRANSLATION_18": "(Beautified is the life of the world) what is in this world of comfortable living (for those who disbelieve) Abu Jahl and his entourage; (they make a jest of believers) Salman [al-Farisi], Bilal [Ibn Rabah], Suhayb [al- Rumi] and their fellow believers because of their abject poverty. (But those who ward off) disbelief and ascribing partners to Allah: i.e. Salman and his fellow believers (will be above them) in this world by having a strong argument against them and also by having status and standing (on the Day of Resurrection. Allah giveth) abundant wealth (without stint) without faltering or affectation; it is also said that He gives to whoever He wills in Paradise without stint (to whom He will).\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:212",
            "4:109",
            "7:32",
            "14:27",
            "16:107",
            "45:35",
            "45:14",
            "13:26",
            "3:55",
            "29:25"
        ],
        "BIBLE": [
            "torah:leviticus:10:17",
            "torah:leviticus:17:11",
            "writings:ii%20chronicles:30:5",
            "prophets:i%20kings:5:23",
            "prophets:judges:18:10",
            "torah:deuteronomy:9:7",
            "torah:leviticus:23:28",
            "prophets:nahum:1:14",
            "torah:exodus:36:6",
            "writings:ii%20chronicles:32:29"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:6:1"
        ]
    }
}