{
    "VERSE": "2:221",
    "ARABIC": "وَلَا تَنكِحُوا۟ ٱلْمُشْرِكَٰتِ حَتَّىٰ يُؤْمِنَّ وَلَأَمَةٌ مُّؤْمِنَةٌ خَيْرٌ مِّن مُّشْرِكَةٍ وَلَوْ أَعْجَبَتْكُمْ وَلَا تُنكِحُوا۟ ٱلْمُشْرِكِينَ حَتَّىٰ يُؤْمِنُوا۟ وَلَعَبْدٌ مُّؤْمِنٌ خَيْرٌ مِّن مُّشْرِكٍ وَلَوْ أَعْجَبَكُمْ أُو۟لَٰٓئِكَ يَدْعُونَ إِلَى ٱلنَّارِ وَٱللَّهُ يَدْعُوٓا۟ إِلَى ٱلْجَنَّةِ وَٱلْمَغْفِرَةِ بِإِذْنِهِۦ وَيُبَيِّنُ ءَايَٰتِهِۦ لِلنَّاسِ لَعَلَّهُمْ يَتَذَكَّرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Do not marry women of the idolaters until they have iman. A slavegirl who is one of the muminun is better for you than a woman of the idolaters, even though she may attract you. And do not give (your women) in marriage to men of the mushrikun until they have iman. A slave who is one of the muminun is better for you than a man of the idolaters, even though he may attract you. Such people call you to the Fire whereas Allah calls you, with His permission, to the Garden and forgiveness. He makes His Signs clear to people so that hopefully they will pay heed.",
        "TRANSLATION_1": "Do not marry idolatrous women unless they join the faith. A maid servant who is a believer is better than an idolatress even though you may like her. And do not marry your daughters to idolaters until they accept the faith. A servant who is a believer is better than an idolater even though you may like him. They invite you to Hell, but God calls you to Paradise and pardon by His grace. And He makes His signs manifest that men may haply take heed.\n",
        "TRANSLATION_2": "Do not marry mushrik women unless they believe; a slave woman who believes is better than a free woman who does not believe, even though the latter may appear very attractive to you. (Likewise) do not wed your women to mushrik men unless they believe; a slave man who believes is better than a free man who does not, even though he may be very pleasing to you. These mushrik people invite you to the Fire while Allah by His grace invites you to the Garden and His pardon, and He makes His revelations plain to the people so that they should learn a lesson and follow the admonition.\n",
        "TRANSLATION_3": "Do not marry pagan women unless they believe in God. A believing slave girl is better than an idolater, even though the idolaters may attract you. Do not marry pagan men unless they believe in God. A believing slave is better than an idolater, even though the idolater may attract you. The pagans invite you to the fire, but God invites you to Paradise and forgiveness through His will. God shows His evidence to people so that they may take heed.\n",
        "TRANSLATION_4": "And do not marry polytheist women until they become Muslims; for undoubtedly a Muslim bondwoman is better than a polytheist woman, although you may like her; and do not give your women in marriage to polytheist men until they accept faith; for undoubtedly a Muslim slave is better than a polytheist, although you may like him; they invite you towards the fire; and Allah invites towards Paradise and forgiveness by His command; and explains His verses to mankind so that they may accept guidance.\n",
        "TRANSLATION_5": "And do not marry Al-Mushrikat (idolatresses) till they believe (worship Allah Alone). And indeed a slave woman who believes is better than a (free) Mushrikah (idolatress), even though she pleases you. And give not (your daughters) in marriage to Al-Mushrikin till they believe (in Allah Alone) and verily, a believing servant is better than a (free) Mushrik (idolator), even though he pleases you. Those (Mushrikin) invite you to the Fire, but Allah invites (you) to Paradise and forgiveness by His leave, and makes His Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) clear to mankind that they may remember.\n",
        "TRANSLATION_6": "And do not marry the idolatresses until they believe, and certainly a believing maid is better than an idolatress woman, even though she should please you; and do not give (believing women) in marriage to idolaters until they believe, and certainly a believing servant is better than an idolater, even though he should please you; these invite to the fire, and Allah invites to the garden and to forgiveness by His will, and makes clear His communications to men, that they may be mindful.\n",
        "TRANSLATION_7": "Do not marry idolatresses, until they believe; a believing slavegirl is better than an idolatress, though you may admire her. And do not marry idolaters, until they believe. A believing slave is better than an idolater, though you may admire him. Those call unto the Fire; and God calls unto Paradise, and pardon, by His leave, and He makes clear His signs to the people; haply they will remember.\n",
        "TRANSLATION_8": "Wed not idolatresses till they believe; for lo! a believing bondwoman is better than an idolatress though she please you; and give not your daughters in marriage to idolaters till they believe, for lo! a believing slave is better than an idolater though he please you. These invite unto the Fire, and Allah inviteth unto the Garden, and unto forgiveness by His grace, and expoundeth His revelations to mankind that haply they may remember.\n",
        "TRANSLATION_9": "Do not marry women who associate partners with God until they believe. A believing bondwoman is better than a woman who associates partners with God, however pleasing she may appear to you. Nor give believing women in marriage to men who associate partners with God, till they have believed; a believing bondman is certainly better than a man who associates partners with God, even though he may please you. Such people call you to Hell-fire; but God calls you to Paradise and to forgiveness. He makes His messages clear to people, so that they might bear them in mind.\n",
        "TRANSLATION_10": "And wed not infidel women until they believe; of a surety a believing bondwoman is better than an infidel Woman, albeit she please you. And wed not your women to infidel men until they believe; of a surety a believing bondman is better than an infidel, albeit the please you. These Call you unto the Fire, and Allah calleth you unto the Garden and unto forgiveness, by His leave; and He expoundeth His commandments unto mankind that haply they may be admonished.\n",
        "TRANSLATION_11": "Do not marry idolatresses until they embrace faith. A faithful slave girl is better than an idolatress, though she should impress you. And do not marry [your daughters] to idolaters until they embrace faith. A faithful slave is better than an idolater, though he should impress you. Those invite [others] to the Fire, but Allah invites to paradise and pardon, by His will, and He clarifies His signs for the people so that they may take admonition.\n",
        "TRANSLATION_12": "Do not marry unbelieving women (idolaters), until they believe: A slave woman who believes is better than an unbelieving woman, even though she allures you. Nor marry (your girls) to unbelievers until they believe: A man slave who believes is better than an unbeliever, even though he allures you. Unbelievers do (but) beckon you to the Fire. But Allah beckons by His Grace to the Garden (of bliss) and forgiveness, and makes His Signs clear to mankind: That they may celebrate His praise.\n",
        "TRANSLATION_13": "And do not marry Al-Mushrikat (idolatresses, etc.) till they believe (worship Allah Alone). And indeed a slave woman who believes is better than a (free) Mushrikah (idolatress, etc.), even though she pleases you. And give not (your daughters) in marriage to Al-Mushrikun till they believe (in Allah Alone) and verily, a believing slave is better than a (free) Mushrik (idolater, etc.), even though he pleases you. Those (Al-Mushrikun) invite you to the Fire, but Allah invites (you) to Paradise and Forgiveness by His Leave, and makes His Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) clear to mankind that they may remember.\n",
        "TRANSLATION_14": "Do not wed idolatresses, until they believe. A believing slavegirl is better than a (free) idolatress, even if she pleases you. And do not wed idolaters, until they believe. A believing slave is better than a (free) idolater, even though he pleases you. Those call to the Fire; but Allah calls to Paradise and pardon by His permission. He makes plain His verses to the people, in order that they will remember.\n",
        "TRANSLATION_15": "Do not marry idolatresses, unless they have believed. A believing maid is better than an idolatress, even if you like her. And do not marry idolaters, unless they have believed. A believing servant is better than an idolater, even if you like him. These call to the Fire, but God calls to the Garden and to forgiveness, by His leave. He makes clear His communications to the people, that they may be mindful.\n",
        "TRANSLATION_16": "And do not marry polytheistic women until they believe. And a believing slave woman is better than a polytheist, even though she might please you. And do not marry polytheistic men [to your women] until they believe. And a believing slave is better than a polytheist, even though he might please you. Those invite [you] to the Fire, but Allah invites to Paradise and to forgiveness, by His permission. And He makes clear His verses to the people that perhaps they may remember.\n",
        "TRANSLATION_17": "[2:221] O Muslims, Do not marry idolatresses, disbelievers, until they believe; a believing slavegirl is better than an idolatress, who may be a free woman; this was revealed as a rebuttal of the idea that it was shameful to marry a slavegirl and that it was better to marry an idolatress free woman; though you may admire her, because of her beauty and wealth: this provision excludes the womenfolk of the People of the Scripture (as indicated by the verse [Q. 5:5], [lawful to you] are the chaste women among those who were given the Scripture). And do not marry, off believing women to, idolaters, until they believe. A believing slave is better than an idolater, though you may admire him, for his wealth and good looks. Those, the people of idolatry, call to the Fire, because they invite one to perform deeds that merit this, and for this reason one should not marry with them; and God calls, through the voice of His prophets, to Paradise and pardon, that is, to the deeds that merit these two, by His leave, by His will, so that His call may be heeded by marrying with His friends; and He makes clear His signs to the people so that they might remember, [that] they [might] be admonished.\n",
        "TRANSLATION_18": "(Wed not idolatresses). This was revealed about Marthad Ibn Abi Marthad Al-Ghanawi who wanted to marry an idolatress woman by the name of 'Inaq. Allah prohibited such marriage, saying: do not marry idolatresses women (till they believe) in Allah; (for lo! A believing bondwoman) marrying a believing slave woman (is better than an idolatress) who is a free woman (though she pleases you) though you may like her comeliness and beauty; (and give not your daughters in marriage to idolaters till they believe) in Allah, (for lo! A believing slave) Allah says: giving your daughters in marriage to a believing slave (is better than an idolater) is better than your daughter marrying an idolater who is free (though he pleases you) though his body and strength may please you. (These invite unto the Fire) they invite to disbelief and to works that lead to hell, (and Allah inviteth unto the Garden) by means of His divine Oneness, (and unto forgiveness) through repentance (by His grace) by His leave, (and He expoundeth thus His revelations) His commands and prohibitions regarding marriage (to mankind that they may remember) so that they may take admonition and refrain from unlawful marriage.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:221",
            "49:5",
            "3:110",
            "2:207",
            "57:9",
            "10:11",
            "35:32",
            "9:3",
            "10:107",
            "29:24"
        ],
        "BIBLE": [
            "prophets:i%20kings:2:42",
            "prophets:jeremiah:34:9",
            "torah:genesis:2:18",
            "prophets:isaiah:50:2",
            "prophets:isaiah:48:1",
            "writings:ecclesiastes:9:1",
            "writings:daniel:6:13",
            "writings:esther:4:11",
            "writings:daniel:6:8",
            "writings:daniel:8:16"
        ]
    }
}