{
    "VERSE": "2:224",
    "ARABIC": "وَلَا تَجْعَلُوا۟ ٱللَّهَ عُرْضَةً لِّأَيْمَٰنِكُمْ أَن تَبَرُّوا۟ وَتَتَّقُوا۟ وَتُصْلِحُوا۟ بَيْنَ ٱلنَّاسِ وَٱللَّهُ سَمِيعٌ عَلِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "Do not, by your oaths, make Allah a pretext to avoid good action and having taqwa and putting things right between people. Allah is All-Hearing, All-Knowing.",
        "TRANSLATION_1": "Do not implicate God in your oaths to avoid doing good and being pious and keeping peace among men, for God hears all and knows everything.\n",
        "TRANSLATION_2": "Do not use Allah's name for such oaths which are taken to keep back from virtue, piety and the welfare of mankind:\n",
        "TRANSLATION_3": "Do not swear by God not to do good things, or have piety, or make peace among people. God is All-hearing and All-knowing.\n",
        "TRANSLATION_4": "And do not make Allah a target of your oaths, by pledging against being virtuous and pious, and against making peace among mankind; and Allah is All Hearing, All Knowing.\n",
        "TRANSLATION_5": "And make not Allah's (Name) an excuse in your oaths against doing good and acting piously, and making peace among mankind. And Allah is All-Hearer, All-Knower (i.e., do not swear much and if you have sworn against doing something good then give an expiation for the oath and do good).\n",
        "TRANSLATION_6": "And make not Allah because of your swearing (by Him) an obstacle to your doing good and guarding (against evil) and making peace between men, and Allah is Hearing, Knowing.\n",
        "TRANSLATION_7": "Do not make God a hindrance, through your oaths, to being pious and godfearing, and putting things right between men. Surely God is All-hearing, All-knowing.\n",
        "TRANSLATION_8": "And make not Allah, by your oaths, a hindrance to your being righteous and observing your duty unto Him and making peace among mankind. Allah is Hearer, Knower.\n",
        "TRANSLATION_9": "Do not make God a pretext, when you swear by Him, to avoid doing good, being righteous and making peace between people. God is all hearing and all knowing.\n",
        "TRANSLATION_10": "And make not Allah a butt of your oaths that ye shall not act piously nor fear Allah nor set things right between and Allah is Hearing, Knowing.\n",
        "TRANSLATION_11": "Do not make Allah an obstacle, through your oaths, to being pious and Godwary, and to bringing about concord between people. And Allah is all-hearing, all-knowing.\n",
        "TRANSLATION_12": "And make not Allah's (name) an excuse in your oaths against doing good, or acting rightly, or making peace between persons; for Allah is One Who heareth and knoweth all things.\n",
        "TRANSLATION_13": "And make not Allah's (Name) an excuse in your oaths against your doing good and acting piously, and making peace among mankind. And Allah is All-Hearer, All-Knower (i.e. do not swear much and if you have sworn against doing something good then give an expiation for the oath and do good).\n",
        "TRANSLATION_14": "Do not make Allah a deterrent through your oaths, that you be righteous, cautious, and reform between people. Surely, Allah is Hearing and Knowing.\n",
        "TRANSLATION_15": "And do not allow your oaths in God's name to hinder you from virtue, and righteousness, and making peace between people. God is Listener and Knower.\n",
        "TRANSLATION_16": "And do not make [your oath by] Allah an excuse against being righteous and fearing Allah and making peace among people. And Allah is Hearing and Knowing.\n",
        "TRANSLATION_17": "[2:224] Do not make God, by swearing in His Name, a hindrance, a cause of impediment, in your oaths, that is, setting up [such impediments] by swearing in His Name frequently, so as not, to be pious and God-fearing; in such instances oaths are hateful, and result in perjury, which requires a redemption, effected by doing the opposite [of the oath], such as performing righteous deeds and so forth, which constitute an act of obedience; and to put things right between people: this means, do not be prevented from doing righteous deeds, as mentioned, just because you swore against them; nay, do them and make redemption; [this understanding of the verse is] justified by the reason for its revelation, namely, their refraining from such deeds; surely God is All-Hearing, of what you say, Knower, of your circumstances.\n",
        "TRANSLATION_18": "(And make not Allah, by your oaths, a hindrance) a reason by means of which you make your oaths. This 38 was revealed about 'Abdullah Ibn Rawahah who swore not to show kindness to his sister and her husband and not to speak with them or make up between them. But Allah warned him against doing so, saying: do not make Allah a reason by means of which you make oaths, (to your being righteous) that you should not honour your oath (and observing your duty unto Him) and ward off severing ties of kinship (and making peace) and not make peace (among mankind). He says: return to that which is better for you and make amend for your oaths; it is also said that this means: avoid making oaths by Allah about not showing kindness to anyone and your not making peace between people. (For Allah is Hearer) of your oath to stop showing kindness to people, (Knower) of your intentions and the amends that will absolve you from your oaths.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:224",
            "4:58",
            "66:2",
            "49:1",
            "5:76",
            "2:244",
            "8:61",
            "3:34",
            "40:66",
            "5:49"
        ],
        "BIBLE": [
            "writings:ecclesiastes:3:14",
            "prophets:isaiah:42:6",
            "prophets:ezekiel:15:3",
            "torah:exodus:23:13",
            "prophets:amos:6:10",
            "torah:exodus:18:16",
            "prophets:ezekiel:14:8",
            "torah:exodus:32:23",
            "writings:daniel:6:13",
            "prophets:micah:3:5"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:5"
        ]
    }
}