{
    "VERSE": "2:226",
    "ARABIC": "لِّلَّذِينَ يُؤْلُونَ مِن نِّسَآئِهِمْ تَرَبُّصُ أَرْبَعَةِ أَشْهُرٍ فَإِن فَآءُو فَإِنَّ ٱللَّهَ غَفُورٌ رَّحِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "Those who swear to abstain from sexual relations with their wives can wait for a period of up to four",
        "TRANSLATION_1": "Those who swear to keep away from their wives (with intent of divorcing them) have four months of grace; then if they reconcile (during this period), surely God is forgiving and kind.\n",
        "TRANSLATION_2": "Those who take an oath to keep apart from their wives are given four months (for a final decision), Then if they resume their relations, Allah is Forgiving and Merciful.\n",
        "TRANSLATION_3": "Those who swear by God not to ever have any carnal relations with their wives (will not be punished), if they decide to resume marital relations again within four months. God is All-forgiving and All-merciful.\n",
        "TRANSLATION_4": "Those who swear not to touch their wives have four months’ time; so if they turn back during this period, indeed Allah is Oft Forgiving, Most Merciful.\n",
        "TRANSLATION_5": "Those who take an oath not to have sexual relation with their wives must wait for four months, then if they return, verily, Allah is Oft-Forgiving, Most Merciful.\n",
        "TRANSLATION_6": "Those who swear that they will not go in to their wives should wait four months; so if they go back, then Allah is surely Forgiving, Merciful.\n",
        "TRANSLATION_7": "For those who forswear their women a wait of four months; if they revert, God is All-forgiving, All-compassionate;\n",
        "TRANSLATION_8": "Those who forswear their wives must wait four months; then, if they change their mind, lo! Allah is Forgiving, Merciful.\n",
        "TRANSLATION_9": "For those who swear that they will not approach their wives, there shall be a waiting period of four months: if they revert to conciliation, surely, God is most forgiving and ever merciful;\n",
        "TRANSLATION_10": "For those who swear off from their wives is a awaiting of four months; then if they go back, verily Allah is Forgiving, Merciful.\n",
        "TRANSLATION_11": "For those who forswear their wives shall be a waiting [period]of four months. And if they recant, Allah is indeed all-forgiving, all-merciful.\n",
        "TRANSLATION_12": "For those who take an oath for abstention from their wives, a waiting for four months is ordained; if then they return, Allah is Oft-forgiving, Most Merciful.\n",
        "TRANSLATION_13": "Those who take an oath not to have sexual relation with their wives must wait four months, then if they return (change their idea in this period), verily, Allah is Oft-Forgiving, Most Merciful.\n",
        "TRANSLATION_14": "For those who swear a wait of four months from their women, if they revert, Allah is Forgiving, the Most Merciful.\n",
        "TRANSLATION_15": "Those who vow abstinence from their wives must wait for four months. But if they reconcile—God is Forgiving and Merciful.\n",
        "TRANSLATION_16": "For those who swear not to have sexual relations with their wives is a waiting time of four months, but if they return [to normal relations] - then indeed, Allah is Forgiving and Merciful.\n",
        "TRANSLATION_17": "[2:226] For those who forswear their women, by swearing that they will not have sexual intercourse with them, a wait of four months; if they revert, back from the oath, or repeal it and resume sexual relations, God is Forgiving, of the harm they caused their women by swearing, Merciful, to them.\n",
        "TRANSLATION_18": "(Those who forswear their wives) those who abstain from having sex with their wives because of an oath they have made, should not touch them for a period of four months (may wait up to four months) they should wait four months; (then, if they change their mind) if they have sex with them before the elapse of four months, (lo! Allah is Forgiving) that they have not honoured their oath, provided they repent, (Merciful) in that He made the amends due on them clear.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:226",
            "2:192",
            "24:5",
            "3:89",
            "5:39",
            "3:31",
            "4:106",
            "2:218",
            "4:16",
            "5:34"
        ],
        "BIBLE": [
            "prophets:judges:21:14",
            "prophets:joshua:1:15",
            "writings:ii%20chronicles:30:9",
            "prophets:ezekiel:16:34",
            "torah:deuteronomy:16:17",
            "prophets:ezekiel:18:13",
            "prophets:i%20samuel:18:19",
            "torah:numbers:18:26",
            "prophets:i%20kings:5:18",
            "torah:deuteronomy:3:18"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:2:5"
        ]
    }
}