{
    "VERSE": "2:236",
    "ARABIC": "لَّا جُنَاحَ عَلَيْكُمْ إِن طَلَّقْتُمُ ٱلنِّسَآءَ مَا لَمْ تَمَسُّوهُنَّ أَوْ تَفْرِضُوا۟ لَهُنَّ فَرِيضَةً وَمَتِّعُوهُنَّ عَلَى ٱلْمُوسِعِ قَدَرُهُۥ وَعَلَى ٱلْمُقْتِرِ قَدَرُهُۥ مَتَٰعًۢا بِٱلْمَعْرُوفِ حَقًّا عَلَى ٱلْمُحْسِنِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "There is nothing wrong in your divorcing women before you have touched them or allotted a dowry to them. But give them a gift - he who is wealthy according to his means and he who is less well off according to his means - a gift to be given with correctness and courtesy: a duty for all good-doers.",
        "TRANSLATION_1": "There is no sin in divorcing your wives before the consummation of marriage or settling the dowry; but then provide adequately for them, the affluent according to their means, the poor in accordance with theirs as is befitting. This is surely the duty of those who do good.\n",
        "TRANSLATION_2": "It is no sin if you divorce your wives while you have not yet touched them or fixed any dower for them. In such a case, pay them something anyhow. A rich man should pay fairly according to his means and a poor man according to his resources, for this is an obligation on the righteous people.\n",
        "TRANSLATION_3": "Also, it is not a sin if you divorce your wives before the consummation of the marriage or the fixing of the dowry. But the dowry will be due from a husband whether he is rich or poor. It is payable in a reasonable amount according to the husband's financial ability. This is an obligation for the righteous ones.\n",
        "TRANSLATION_4": "There is no sin upon you if you divorce women while you have not touched them or appointed their bridal money; and give them some provision; the rich according to their means, and the poor according to their means; a fair provision according to custom; this is a duty upon the virtuous.\n",
        "TRANSLATION_5": "There is no sin on you, if you divorce women while yet you have not touched them, nor appointed for them their due (dowry). But give them a Mut`ah (a suitable gift), the rich according to his means, and the poor according to his means, a gift of reasonable amount is a duty on the doers of good.\n",
        "TRANSLATION_6": "There is no blame on you if you divorce women when you have not touched them or appointed for them a portion, and make provision for them, the wealthy according to his means and the straitened in circumstances according to his means, a provision according to usage; (this is) a duty on the doers of good (to others).\n",
        "TRANSLATION_7": "There is no fault in you, if you divorce women while as yet you have not touched them nor appointed any marriage-portion for them; yet make provision for them, the affluent man according to his means, and according to his means the needy man, honourably -- an obligation on the good-doers.\n",
        "TRANSLATION_8": "It is no sin for you if ye divorce women while yet ye have not touched them, nor appointed unto them a portion. Provide for them, the rich according to his means, and the straitened according to his means, a fair provision. (This is) a bounden duty for those who do good.\n",
        "TRANSLATION_9": "You will not be blamed [for not paying the dower money] if you divorce women when you have not yet consummated the marriage or fixed a dower money upon them, but make fair provision for them, the affluent according to his means and the straitened according to his means; this is binding on righteous men.\n",
        "TRANSLATION_10": "No blame is on you if ye divorce women while yet ye have not touched them nor settled unto them a settlement. Benefit them on the affluent is due according to his means, and on the straitened is due according to his means. a reputable present, and duty on the well-doers.\n",
        "TRANSLATION_11": "There is no sin upon you if you divorce women while you have not yet touched them or settled a dowry for them. Yet provide for them—the well-off according to his capacity, and the poorly-off according to his capacity—with a sustenance that is honourable, an obligation on the virtuous.\n",
        "TRANSLATION_12": "There is no blame on you if ye divorce women before consummation or the fixation of their dower; but bestow on them (A suitable gift), the wealthy according to his means, and the poor according to his means;- A gift of a reasonable amount is due from those who wish to do the right thing.\n",
        "TRANSLATION_13": "There is no sin on you, if you divorce women while yet you have not touched (had sexual relation with) them, nor appointed unto them their Mahr (bridal money given by the husband to his wife at the time of marriage). But bestow on them (a suitable gift), the rich according to his means, and the poor according to his means, a gift of reasonable amount is a duty on the doers of good.\n",
        "TRANSLATION_14": "It shall be no offense for you to divorce your wives as long as you have not touched them or obligated a right for them. Provide for them with fairness; the rich according to his means, and the restricted according to his. A right on the gooddoers.\n",
        "TRANSLATION_15": "You commit no error by divorcing women before having touched them, or before having set the dowry for them. And compensate them—the wealthy according to his means, and the poor according to his means—with a fair compensation, a duty upon the doers of good.\n",
        "TRANSLATION_16": "There is no blame upon you if you divorce women you have not touched nor specified for them an obligation. But give them [a gift of] compensation - the wealthy according to his capability and the poor according to his capability - a provision according to what is acceptable, a duty upon the doers of good.\n",
        "TRANSLATION_17": "[2:236] You would not be at fault if you divorce women while you have not touched them (tamassūhunna: also read tumāssūhunna), that is, [while] you have not had sexual intercourse with them, nor appointed any obligation, dowry, for them (the particle mā, ‘while’, relates to the verbal action and is also adverbial) that is to say, there are no sinful consequences for divorcing them if you have not copulated with them or assigned them a dowry, so divorce them; yet make provision of comforts for them honourably, that is, in accordance with the Law (bi’l-ma‘rūf, ‘honourably’, is an adjectival qualification of matā‘an, ‘comforts’), giving them what they can enjoy, the one of ample means, the affluent among you, according to his means, and the needy man, of restricted income, according to his means — an obligation (haqqan, ‘obligation’, is either a second qualifier of matā‘an, ‘comforts’, or an emphatic verbal noun), on the virtuous, the obedient ones.\n",
        "TRANSLATION_18": "(There is no sin on you if ye divorce women while yet ye have not touched them) while you have not had sex with them, (nor appointed unto them a portion) or have not specified a dowry for them. (Provide for them) as divorce requires, (the rich according to his means, and the strained according to his means, a fair provision) this is in surplus of the price given to the prostitute for her services (mahr al-baghiy), the least amount of it consists of a chemise, a head covering and a wrap. ((This is) a bounden duty for those who do good) it is an obligation upon those who believe in the divine Oneness of Allah because it is a substitute for the dowry. 41\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:236",
            "2:241",
            "4:24",
            "2:235",
            "24:49",
            "13:17",
            "2:240",
            "2:284",
            "2:233",
            "4:102"
        ],
        "BIBLE": [
            "torah:exodus:36:6",
            "prophets:ezekiel:3:20",
            "torah:deuteronomy:32:8",
            "torah:genesis:3:6",
            "prophets:ii%20kings:4:43",
            "torah:leviticus:17:11",
            "writings:ecclesiastes:5:18",
            "prophets:ezekiel:26:20",
            "torah:leviticus:5:13",
            "torah:leviticus:10:17"
        ]
    }
}