{
    "VERSE": "2:238",
    "ARABIC": "حَٰفِظُوا۟ عَلَى ٱلصَّلَوَٰتِ وَٱلصَّلَوٰةِ ٱلْوُسْطَىٰ وَقُومُوا۟ لِلَّهِ قَٰنِتِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Safeguard the salat - especially the middle one. Stand in obedience to Allah.",
        "TRANSLATION_1": "Be wakeful of your service of prayer, and the midmost service; and honour God by standing before Him in devotion.\n",
        "TRANSLATION_2": "Take great care of your Prayers, especially of a Prayer that has excellent qualities of Salat and stand before Allah like devoted servants.\n",
        "TRANSLATION_3": "Pay due attention to your prayers, especially the middle prayer and stand up while praying, in obedience to God.\n",
        "TRANSLATION_4": "Guard all your prayers, and the middle prayer; and stand with reverence before Allah.\n",
        "TRANSLATION_5": "Guard strictly (five obligatory) As-Salawat (the prayers) especially the Middle Salah. And stand before Allah with obedience.\n",
        "TRANSLATION_6": "Attend constantly to prayers and to the middle prayer and stand up truly obedient to Allah.\n",
        "TRANSLATION_7": "Be you watchful over the prayers, and the middle prayer; and do you stand obedient to God.\n",
        "TRANSLATION_8": "Be guardians of your prayers, and of the midmost prayer, and stand up with devotion to Allah.\n",
        "TRANSLATION_9": "Be ever mindful of prayers, especially the middle prayer; and stand up before God in submissive devotion.\n",
        "TRANSLATION_10": "Guard the prayers, and the middle prayer, and stand up to Allah truly devout.\n",
        "TRANSLATION_11": "Be watchful of your prayers, and [especially] the middle prayer, and stand in obedience to Allah;\n",
        "TRANSLATION_12": "Guard strictly your (habit of) prayers, especially the Middle Prayer; and stand before Allah in a devout (frame of mind).\n",
        "TRANSLATION_13": "Guard strictly (five obligatory) As-Salawat (the prayers) especially the middle Salat (i.e. the best prayer - 'Asr). And stand before Allah with obedience [and do not speak to others during the Salat (prayers)].\n",
        "TRANSLATION_14": "And preserve the prayers and the middle prayer, and stand obedient to Allah.\n",
        "TRANSLATION_15": "Guard your prayers, and the middle prayer, and stand before God in devotion.\n",
        "TRANSLATION_16": "Maintain with care the [obligatory] prayers and [in particular] the middle prayer and stand before Allah, devoutly obedient.\n",
        "TRANSLATION_17": "[2:238]   Maintain the, five, prayers, by performing them at their appointed times, and the middle prayer, either that of the afternoon, or the morning, or the midday, or another prayer (there are many opinions on this matter); God has singled it out for mention because of its merit; and stand, in prayer, submissive to God, li Lllāhi qānitīn: some have said that this means ‘obedience’, on account of the Prophet (s) saying, ‘Wherever the [expression] qunūt [‘submission’], appears in the Qur’ān, it denotes obedience’, as reported by Ahmad [b. Hanbal] and others; it is also said to mean ‘in silence’ [sākitīn], on the basis of a hadīth of Zayd b. Arqam, in which he said, ‘We used to speak to each other sometimes during prayer, but when this was revealed, we were commanded to be silent and were forbidden to talk’, as reported by the two Shaykhs [Bukhārī and Muslim].\n",
        "TRANSLATION_18": "Allah then prompted the believers to observe the five daily prayers, saying: (Be guardians of your prayers) the five daily prayers including the ritual ablution that precede them, their bowings, prostrations, and everything prescribed in them during their appointed times, (and of the midmost prayer) the 'Asr prayer specifically, (and stand up with devotion to Allah) pray to Allah, by performing the bowings and prostrations this prayer includes; it is also said that this means: pray to Him by being obedient to Him in the prayer and not disobedient through engagement in mundane talk.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:238",
            "20:14",
            "22:35",
            "71:19",
            "53:62",
            "2:153",
            "4:103",
            "33:64",
            "30:31",
            "3:132"
        ],
        "BIBLE": [
            "torah:numbers:16:9",
            "writings:ii%20chronicles:31:21",
            "writings:i%20chronicles:28:20",
            "torah:deuteronomy:6:24",
            "writings:i%20chronicles:28:21",
            "writings:i%20chronicles:23:28",
            "prophets:joshua:22:27",
            "prophets:jeremiah:5:31",
            "torah:numbers:18:7",
            "prophets:joshua:22:24"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:1:3"
        ]
    }
}