{
    "VERSE": "2:239",
    "ARABIC": "فَإِنْ خِفْتُمْ فَرِجَالًا أَوْ رُكْبَانًا فَإِذَآ أَمِنتُمْ فَٱذْكُرُوا۟ ٱللَّهَ كَمَا عَلَّمَكُم مَّا لَمْ تَكُونُوا۟ تَعْلَمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "If you are afraid, then do salat on foot or mounted. But when you are safe, remember Allah in the way He taught you when previously you did not know.",
        "TRANSLATION_1": "If you fear (war or danger), pray while standing or on horseback; but when you have safety again remember God, for He taught you what you did not know.\n",
        "TRANSLATION_2": "Even if you are in danger, you must offer your Prayers anyhow on foot or on horseback. And when you have peace again, remember Allah in the manner He has taught you, which you did not know before.\n",
        "TRANSLATION_3": "In an emergency you may say your prayers while walking or riding; but when you are safe, remember God, as He has taught you what you did not know before.\n",
        "TRANSLATION_4": "And if you are in fear, pray while on foot or while riding, as you can; when you are in peace remember Allah the way He has taught you, which you did not know.\n",
        "TRANSLATION_5": "And if you fear (an enemy), (perform Salah) on foot or riding. And when you are in safety, then remember Allah (pray) in the manner He has taught you, which you knew not (before).\n",
        "TRANSLATION_6": "But if you are in danger, then (say your prayers) on foot or on horseback; and when you are secure, then remember Allah, as He has taught you what you did not know.\n",
        "TRANSLATION_7": "And if you are in fear, then afoot or mounted; but when you are secure, then remember God, as He taught you the things that you knew not.\n",
        "TRANSLATION_8": "And if ye go in fear, then (pray) standing or on horseback. And when ye are again in safety, remember Allah, as He hath taught you that which (heretofore) ye knew not.\n",
        "TRANSLATION_9": "When you are exposed to danger, pray on foot or while riding; when you are safe again, remember God, for He has taught you what you did not know.\n",
        "TRANSLATION_10": "And if ye fear, then pray on foot or riding; then when ye are secure, remember Allah in the way He hath taught you which ye ever knew not.\n",
        "TRANSLATION_11": "and should you fear [a danger], then [pray] on foot or mounted, and when you are safe remember Allah, as He taught you what you did not know.\n",
        "TRANSLATION_12": "If ye fear (an enemy), pray on foot, or riding, (as may be most convenient), but when ye are in security, celebrate Allah's praises in the manner He has taught you, which ye knew not (before).\n",
        "TRANSLATION_13": "And if you fear (an enemy), perfrom Salat (pray) on foot or riding. And when you are in safety, offer the Salat (prayer) in the manner He has taught you, which you knew not (before).\n",
        "TRANSLATION_14": "And if you fear, then (pray) on foot or riding. But when you are safe, then remember Allah, as He has taught you what you did not know.\n",
        "TRANSLATION_15": "But if you are in fear, then on foot, or riding. And when you are safe, remember God, as He taught you what you did not know.\n",
        "TRANSLATION_16": "And if you fear [an enemy, then pray] on foot or riding. But when you are secure, then remember Allah [in prayer], as He has taught you that which you did not [previously] know.\n",
        "TRANSLATION_17": "[2:239] And if you are in fear, of an enemy, or a torrent, or a predatory animal, then standing (rijāl, plural of rājil), praying while walking, or mounted (rukbān, plural of rākib). In other words, in whichever way you can, facing the direction of the qibla or otherwise, making the gestures of genuflexion and prostration; but when you are secure, from any fear, then remember God, by performing prayer, as He taught you what you knew not, before He taught you its obligations and its proper ways (the particle kāf [of ka-mā, ‘as’] has the same meaning as mithl [‘like’], while the mā is related to the verbal action, or is relative).\n",
        "TRANSLATION_18": "(And if ye go in fear) of the enemy's sword, (then (pray) standing or on horseback) in whatever direction. (And when ye are again in safety) from the enemy, (remember Allah) pray to Allah performing the bowings and prostrations, (as He hath taught you) in the Qur'an: the traveller prays two units of prayer while the resident prays four units (that which ye knew not) before the revelation of the Qur'an.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:239",
            "5:23",
            "23:38",
            "10:72",
            "11:33",
            "33:23",
            "7:190",
            "3:32",
            "53:62",
            "16:19"
        ],
        "BIBLE": [
            "writings:nehemiah:7:65",
            "prophets:jeremiah:7:23",
            "writings:proverbs:1:15",
            "prophets:judges:18:5",
            "prophets:jeremiah:42:3",
            "prophets:joshua:7:13",
            "torah:numbers:22:34",
            "writings:nehemiah:5:9",
            "writings:i%20chronicles:29:17",
            "prophets:jeremiah:18:15"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:3:6"
        ]
    }
}