{
    "VERSE": "2:242",
    "ARABIC": "كَذَٰلِكَ يُبَيِّنُ ٱللَّهُ لَكُمْ ءَايَٰتِهِۦ لَعَلَّكُمْ تَعْقِلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "In this way Allah makes His Signs clear to you, so that hopefully you will use your intellect.",
        "TRANSLATION_1": "So does God pronounce His decrees that you may understand.\n",
        "TRANSLATION_2": "Thus Allah makes clear His commandments for you: it is expected that you will use your common sense.\n",
        "TRANSLATION_3": "Thus does God explain His revelations to you so that perhaps you will have understanding.\n",
        "TRANSLATION_4": "This is how Allah explains His verses to you so that you may understand.\n",
        "TRANSLATION_5": "Thus Allah makes clear His Ayat (Laws) to you, in order that you may understand.\n",
        "TRANSLATION_6": "Allah thus makes clear to you His communications that you may understand.\n",
        "TRANSLATION_7": "So God makes clear His signs for you; haply you will understand.\n",
        "TRANSLATION_8": "Thus Allah expoundeth unto you His revelations so that ye may understand.\n",
        "TRANSLATION_9": "Thus God makes His commandments clear to you, so that you may understand.\n",
        "TRANSLATION_10": "In this wise Allah expoundeth unto you His commandments, haply ye may reflect.\n",
        "TRANSLATION_11": "Thus does Allah clarify His signs to you so that you may exercise your reason.\n",
        "TRANSLATION_12": "Thus doth Allah Make clear His Signs to you: In order that ye may understand.\n",
        "TRANSLATION_13": "Thus Allah makes clear His Ayat (Laws) to you, in order that you may understand.\n",
        "TRANSLATION_14": "Like this Allah clarifies to you His verses in order that you understand.\n",
        "TRANSLATION_15": "God thus explains His revelations to you, so that you may understand.\n",
        "TRANSLATION_16": "Thus does Allah make clear to you His verses that you might use reason.\n",
        "TRANSLATION_17": "[2:242] So, in the same way that He has explained to you what has been mentioned, God makes clear His signs for you, so that you might understand, reflect.\n",
        "TRANSLATION_18": "(Thus Allah expoundeth unto you His revelations) His commands and prohibitions (so that ye may understand) what you have been commanded to do.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:242",
            "40:63",
            "40:81",
            "22:16",
            "2:73",
            "7:174",
            "2:252",
            "6:118",
            "53:62",
            "13:27"
        ],
        "BIBLE": [
            "writings:psalms:119:98",
            "prophets:isaiah:40:3",
            "writings:ezra:10:3",
            "prophets:ii%20samuel:23:5",
            "torah:exodus:18:16",
            "writings:ezra:7:21",
            "writings:psalms:119:35",
            "writings:psalms:71:16",
            "writings:psalms:19:8",
            "prophets:ezekiel:15:8"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:1:1",
            
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:3"
        ]
    }
}