{
    "VERSE": "2:246",
    "ARABIC": "أَلَمْ تَرَ إِلَى ٱلْمَلَإِ مِنۢ بَنِىٓ إِسْرَٰٓءِيلَ مِنۢ بَعْدِ مُوسَىٰٓ إِذْ قَالُوا۟ لِنَبِىٍّ لَّهُمُ ٱبْعَثْ لَنَا مَلِكًا نُّقَٰتِلْ فِى سَبِيلِ ٱللَّهِ قَالَ هَلْ عَسَيْتُمْ إِن كُتِبَ عَلَيْكُمُ ٱلْقِتَالُ أَلَّا تُقَٰتِلُوا۟ قَالُوا۟ وَمَا لَنَآ أَلَّا نُقَٰتِلَ فِى سَبِيلِ ٱللَّهِ وَقَدْ أُخْرِجْنَا مِن دِيَٰرِنَا وَأَبْنَآئِنَا فَلَمَّا كُتِبَ عَلَيْهِمُ ٱلْقِتَالُ تَوَلَّوْا۟ إِلَّا قَلِيلًا مِّنْهُمْ وَٱللَّهُ عَلِيمٌۢ بِٱلظَّٰلِمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "What do you think about the council of the tribe of Israel after Musa's time when they said to one of their Prophets, 'Give us a king and we will fight in the Way of Allah!'? He said, 'Is it not possible that if fighting were prescribed for you, you would not fight?' They said, 'How could we not fight in the way of Allah when we have been driven from our homes and children?' But then when fighting was prescribed for them, they turned their backs - except for a few of them. Allah knows the wrongdoers.",
        "TRANSLATION_1": "Have you thought of the elders of Israel after Moses, and how they said to their apostle: \"Set up a king for us, then we shall fight in the way of God?\" He replied: \"This too is possible that when commanded to fight you may not fight at all.\" They said: \"How is it we should not fight in the way of God when we have been driven from our homes and deprived of our Sons?\" But when they were ordered to fight they turned away, except for a few; yet God knows the sinners.\n",
        "TRANSLATION_2": "Have you also reflected upon the matter concerning the chiefs of the Israelites after (the death of) Moses? They said to their Prophet, \"Appoint a king for us so that we may fight in the way of Allah.\" The Prophet asked them, \"Might it be that you will not fight, if fighting is prescribed for you?\" They replied, \"How can it be that we would refuse to fight in the way of Allah when we have been turned out of our homes and separated from our children?\" But (in spite of this assurance) when they were enjoined to fight, they all, except a few of them, turned their backs. And Allah knows each and everyone of these transgressors.\n",
        "TRANSLATION_3": "(Muhammad), remember that group of the Israelites after Moses who demanded a Prophet of their own to appoint a king for them who would lead them in the fight for the cause of God. Their Prophet then said, \"What if you are ordered to fight and you disobey?\" They said, \"Why should we not fight for the cause of God when we and our sons have been expelled from our homes?\" However, when they were ordered to fight, all refused except a few among them. God knows well the unjust.\n",
        "TRANSLATION_4": "Did you (O dear Prophet Mohammed – peace and blessings be upon him) not see a group of the Descendants of Israel, after Moosa? When they said to one of their Prophets (Shamueel – Samuel), “Appoint a king for us so that we may fight in Allah’s way”? He said, “Do you think you would refrain from fighting if it is made obligatory for you?” They said, “What is the matter with us that we should not fight in Allah’s cause, whereas we have been driven away from our homeland and our children?” So when fighting was ordained for them, they all turned away, except a few; and Allah is Well Aware of the unjust.\n",
        "TRANSLATION_5": "Have you not thought about the group of the Children of Israel after (the time of) Musa When they said to a Prophet of theirs, \"Appoint for us a king and we will fight in Allah's way.\" He said, \"Would you then refrain from fighting, if fighting was prescribed for you\" They said, \"Why should we not fight in Allah's way while we have been driven out of our homes and our children (families have been taken as captives)\" But when fighting was ordered for them, they turned away, all except a few of them. And Allah is All-Aware of the wrongdoers.\n",
        "TRANSLATION_6": "Have you not considered the chiefs of the children of Israel after Musa, when they said to a prophet of theirs: Raise up for us a king, (that) we may fight in the way of Allah. He said: May it not be that you would not fight if fighting is ordained for you? They said: And what reason have we that we should not fight in the way of Allah, and we have indeed been compelled to abandon our homes and our children. But when fighting was ordained for them, they turned back, except a few of them, and Allah knows the unjust.\n",
        "TRANSLATION_7": "Hast thou not regarded the Council of the Children of Israel, after Moses, when they said to a Prophet of theirs, 'Raise up for us a king, and we will fight in God's way.' He said, 'Might it be that, if fighting is prescribed for you, you will not fight?' They said, 'Why should we not fight in God's way, who have been expelled from our habitations and our children?' Yet when fighting was prescribed for them, they turned their backs except a few of them; and God has knowledge of the evildoers.\n",
        "TRANSLATION_8": "Bethink thee of the leaders of the Children of Israel after Moses, how they said unto a prophet whom they had: Set up for us a king and we will fight in Allah's way. He said: Would ye then refrain from fighting if fighting were prescribed for you? They said: Why should we not fight in Allah's way when we have been driven from our dwellings with our children? Yet, when fighting was prescribed for them, they turned away, all save a few of them. Allah is aware of evil-doers.\n",
        "TRANSLATION_9": "Have you not heard of what the chiefs of the Children of Israel demanded of one of their prophets after Moses? They said, \"Appoint for us a king, and we will fight for the cause of God.\" He replied, \"What if you refuse to fight, when ordered to do so?\" \"Why should we not fight for the cause of God,\" they replied, \"when we have been driven forth from our homes and our children?\" But when at last they were commanded to fight, they all refused, except a few of them. God knows the wrongdoers.\n",
        "TRANSLATION_10": "Bethinkest thou not of the chiefs of the Children of Isra'il, after Musa? They said unto a Prophet of theirs: raise for us a king that we may fight in the way of God. He said: may it not be that if fighting were prescribed unto you, ye would not fight! They said: and wherefore shall we not fight in the way of God, whereas we have been driven forth from our habitations and children. Then when fighting was prescribed unto them, they turned away, save a few of them: and Allah is the Knower of the wrong-doers.\n",
        "TRANSLATION_11": "Have you not regarded the elite of the Israelites after Moses, when they said to their prophet, ‘Appoint for us a king that we may fight in the way of Allah.’ He said, ‘May it not be that you will not fight if fighting were prescribed for you?’ They said, ‘Why should we not fight in the way of Allah, when we have been expelled from our homes and [separated from] our children?’ So when fighting was prescribed for them, they turned back except a few of them, and Allah knows well the wrongdoers.\n",
        "TRANSLATION_12": "Hast thou not Turned thy vision to the Chiefs of the Children of Israel after (the time of) Moses? they said to a prophet (That was) among them: \"Appoint for us a king, that we May fight in the cause of Allah.\" He said: \"Is it not possible, if ye were commanded to fight, that that ye will not fight?\" They said: \"How could we refuse to fight in the cause of Allah, seeing that we were turned out of our homes and our families?\" but when they were commanded to fight, they turned back, except a small band among them. But Allah Has full knowledge of those who do wrong.\n",
        "TRANSLATION_13": "Have you not thought about the group of the Children of Israel after (the time of) Musa (Moses)? When they said to a Prophet of theirs, \"Appoint for us a king and we will fight in Allah's Way.\" He said, \"Would you then refrain from fighting, if fighting was prescribed for you?\" They said, \"Why should we not fight in Allah's Way while we have been driven out of our homes and our children (families have been taken as captives)?\" But when fighting was ordered for them, they turned away, all except a few of them. And Allah is All-Aware of the Zalimun (polytheists and wrong-doers).\n",
        "TRANSLATION_14": "Have you not seen the congregation of the Children of Israel who demanded of one of their Prophets after (the death of) Moses? 'Raise up for us a king' they said, 'and we will fight in the way of Allah' He replied: 'Might it be that if fighting is written for you, you will not fight' 'Why shouldn't we fight in the way of Allah' they replied, 'when we and all our children have been driven from our dwellings' Yet, when fighting was written for them all except for a few, turned away. And Allah has knowledge of the harmdoers.\n",
        "TRANSLATION_15": "Have you not considered the notables of the Children of Israel after Moses? When they said to a prophet of theirs, “Appoint a king for us, and we will fight in the cause of God.” He said, “Is it possible that, if fighting was ordained for you, you would not fight?” They said, “Why would we not fight in the cause of God, when we were driven out of our homes, along with our children?” But when fighting was ordained for them, they turned away, except for a few of them. But God is aware of the wrongdoers.\n",
        "TRANSLATION_16": "Have you not considered the assembly of the Children of Israel after [the time of] Moses when they said to a prophet of theirs, \"Send to us a king, and we will fight in the way of Allah \"? He said, \"Would you perhaps refrain from fighting if fighting was prescribed for you?\" They said, \"And why should we not fight in the cause of Allah when we have been driven out from our homes and from our children?\" But when fighting was prescribed for them, they turned away, except for a few of them. And Allah is Knowing of the wrongdoers.\n",
        "TRANSLATION_17": "[2:246] Have you not seen, the story and the tale of, the council, an assembly, of the Children of Israel, after, the death of, Moses, when they said to a prophet of theirs, namely, Samuel, ‘Send, establish, for us a king, to unite us and to whom we can refer [matters], and we will fight, with him, in God’s way’. He, the prophet, said, to them: ‘Might it be that (‘asaytum, or ‘asītum) if fighting is prescribed for you, you will not fight? (allā tuqātilū is the predicate of ‘asā, ‘might it be’; the interrogative is intended to confirm the expectation that follows [sc. that they will not fight]). They said, ‘Why should we not fight in God’s way, when we have been expelled from our habitations and our children?’, as a result of these latter being taken captive or killed, that which they suffered at the hands of Goliath and his men. The meaning is, ‘There is nothing to stop us fighting, provided the requirement [we demanded] is forthcoming’. God, exalted be He, says, Yet when fighting was prescribed for them, they turned their backs, from fighting in cowardice, except a few of them, the ones that crossed the river with Saul (Tālūt), as will be mentioned; and God has knowledge of the evildoers, and will requite them accordingly. The prophet then asked his Lord to send forth a king, and God responded by sending forth Saul.\n",
        "TRANSLATION_18": "(Bethink thee) have you not been told (of the leaders of the Children of Israel after Moses, how they said unto a prophet whom they had) the prophet is Samuel (Shamwil): (Set up for us a king) show to us the king of this army (and we will fight) under his command against our enemy (in Allah's way) in Allah's obedience. (He said: Would ye then) do you suppose then that you will (refrain from fighting if fighting) against your enemy (were prescribed for you?) made obligatory upon you. (They said: why should we not fight in Allah's way when we have been expelled from our dwellings) from our homes (and separated from our children) who were taken as slaves? (Yet, when fighting was prescribed for them) was made obligatory upon them, (they turned away) they refrained from fighting their enemy, (all save a few of them) 313 men. (And Allah is Aware of evil-doers) who shy away from fighting their enemy.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:246",
            "5:20",
            "2:247",
            "14:12",
            "7:89",
            "3:167",
            "42:44",
            "46:10",
            "2:215",
            "4:88"
        ],
        "BIBLE": [
            "writings:ii%20chronicles:25:16",
            "torah:genesis:30:15",
            "prophets:zephaniah:3:15",
            "writings:ii%20chronicles:24:11",
            "torah:deuteronomy:3:21",
            "prophets:jeremiah:23:2",
            "prophets:ii%20kings:5:8",
            "writings:ezra:10:14",
            "writings:ii%20chronicles:10:16",
            "prophets:i%20kings:12:16"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:5"
        ]
    }
}