{
    "VERSE": "2:25",
    "ARABIC": "وَبَشِّرِ ٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّٰلِحَٰتِ أَنَّ لَهُمْ جَنَّٰتٍ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَٰرُ كُلَّمَا رُزِقُوا۟ مِنْهَا مِن ثَمَرَةٍ رِّزْقًا قَالُوا۟ هَٰذَا ٱلَّذِى رُزِقْنَا مِن قَبْلُ وَأُتُوا۟ بِهِۦ مُتَشَٰبِهًا وَلَهُمْ فِيهَآ أَزْوَٰجٌ مُّطَهَّرَةٌ وَهُمْ فِيهَا خَٰلِدُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Give the good news to those who have iman and do right actions that they will have Gardens with rivers flowing under them. When they are given fruit there as provision, they will say, 'This is what we were given before.' But they were only given a simulation of it. They will have there spouses of perfect purity and will remain there timelessly, for ever.",
        "TRANSLATION_1": "Announce to those who believe and have done good deeds, glad tidings of gardens under which rivers flow, and where, when they eat the fruits that grow, they will say: \"Indeed they are the same as we were given before,\" so like in semblance the food would be. And they shall have fair spouses there, and live there abidingly.\n",
        "TRANSLATION_2": "And give good news (O Muhammad), to those who believe in this Book and do good deeds (in accordance with its teachings). For them there will be gardens underneath which canals flow. Their fruits will so resemble the fruits on the Earth that every time they will be provided with fruits, they will say, \"Such fruits were provided to us before on the Earth. \" And there will be pure spouses for them and therein they will live for ever.\n",
        "TRANSLATION_3": "(Muhammad), tell the righteously striving believers of the happy news, that for them there are gardens wherein streams flow. Whenever they get any fruit from the gardens as food, they will say, \"This is just what we had before (we came here). These fruits are produced very much like them (those we had before).\" They will have purified spouses and it is they who will live forever.\n",
        "TRANSLATION_4": "And give glad tidings to those who believe and do good deeds; that for them are Gardens beneath which rivers flow; when they are provided with a fruit of the Gardens, they will say, “This is the same food as what was given to us before” whereas it is in resemblance; and in the Gardens are pure spouses for them; and they shall abide in it forever.\n",
        "TRANSLATION_5": "And give glad tidings to those who believe and do righteous good deeds, that for them will be Gardens under which rivers flow (Paradise). Every time they will be provided with a fruit therefrom, they will say: \"This is what we were provided with before,\" and they will be given things in resemblance (i.e. in the same form but different in taste) and they shall have therein Azwajun Mutahharatun (purified mates or wives), and they will abide therein forever.\n",
        "TRANSLATION_6": "And convey good news to those who believe and do good deeds, that they shall have gardens in which rivers flow; whenever they shall be given a portion of the fruit thereof, they shall say: This is what was given to us before; and they shall be given the like of it, and they shall have pure mates in them, and in them, they shall abide.\n",
        "TRANSLATION_7": "Give thou good tidings to those who believe and do deeds of righteousness, that for them await gardens underneath which rivers flow; whensoever they are provided with fruits therefrom they shall say, 'This is that wherewithal we were provided before'; that they shall be given in perfect semblance; and there for them shall be spouses purified; therein they shall dwell forever.\n",
        "TRANSLATION_8": "And give glad tidings (O Muhammad) unto those who believe and do good works; that theirs are Gardens underneath which rivers flow; as often as they are regaled with food of the fruit thereof, they say: this is what was given us aforetime; and it is given to them in resemblance. There for them are pure companions; there for ever they abide.\n",
        "TRANSLATION_9": "Give the good news to those who believe and do good works, that they will have Gardens through which rivers flow: whenever they are given fruit to eat they will say, \"This is what we were provided with before,\" because they were given similar things. And there will be pure spouses for them, and they will abide there forever.\n",
        "TRANSLATION_10": "And bear thou the glad tidings unto those who believe and do righteous works that verily for them shall be Gardens whereunder rivers flow. So oft as they shall be provided with a fruit therefrom they will say: this is that wherewith we were provided afore; and they shall be vouchsafed that which is consimilar; and for them shall be therein spouses purified, and therein they shall be abiders.\n",
        "TRANSLATION_11": "And give good news to those who have faith and do righteous deeds, that for them shall be gardens with streams running in them: whenever they are provided with their fruit for nourishment, they will say, ‘This is what we were provided before,’ and they were given something resembling it. There will be chaste mates for them, and they will remain therein [forever].\n",
        "TRANSLATION_12": "But give glad tidings to those who believe and work righteousness, that their portion is Gardens, beneath which rivers flow. Every time they are fed with fruits therefrom, they say: \"Why, this is what we were fed with before,\" for they are given things in similitude; and they have therein companions pure (and holy); and they abide therein (for ever).\n",
        "TRANSLATION_13": "And give glad tidings to those who believe and do righteous good deeds, that for them will be Gardens under which rivers flow (Paradise). Every time they will be provided with a fruit therefrom, they will say: \"This is what we were provided with before,\" and they will be given things in resemblance (i.e. in the same form but different in taste) and they shall have therein Azwajun Mutahharatun (purified mates or wives), (having no menses, stools, urine, etc.) and they will abide therein forever.\n",
        "TRANSLATION_14": "Bear glad tidings to those who believe and do good works. They shall live in Gardens underneath which rivers flow. Whenever they are given fruit as provision they will say: 'This is what we were given before,' for they shall be given in resemblance. Therein they shall have pure spouses, and shall live there for ever.\n",
        "TRANSLATION_15": "And give good news to those who believe and do righteous deeds; that they will have gardens beneath which rivers flow. Whenever they are provided with fruit therefrom as sustenance, they will say, “This is what we were provided with before,” and they will be given the like of it. And they will have pure spouses therein, and they will abide therein forever.\n",
        "TRANSLATION_16": "And give good tidings to those who believe and do righteous deeds that they will have gardens [in Paradise] beneath which rivers flow. Whenever they are provided with a provision of fruit therefrom, they will say, \"This is what we were provided with before.\" And it is given to them in likeness. And they will have therein purified spouses, and they will abide therein eternally.\n",
        "TRANSLATION_17": "[2:25] And give good tidings to, inform, those who believe, who have faith in God, and perform righteous deeds, such as the obligatory and supererogatory [rituals], that theirs shall be Gardens, of trees, and habitations, underneath which, that is, underneath these trees and palaces, rivers run (tajrī min tahtihā’l-anhāru), that is, there are waters in it (al-nahr is the place in which water flows [and is so called] because the water carves [yanhar] its way through it; the reference to it as ‘running’ is figurative); whensoever they are provided with fruits therefrom, that is, whenever they are given to eat from these gardens, they shall say, ‘This is what, that is, the like of what we were provided with before’, that is, before this, in Paradise, since its fruits are similar (and this is evidenced by [the following statement]): they shall be given it, the provision, in perfect semblance, that is, resembling one another in colour, but different in taste; and there for them shall be spouses, of houris and others, purified, from menstruation and impurities; therein they shall abide: dwelling therein forever, neither perishing nor departing therefrom. And when the Jews said, ‘Why does God strike a similitude about flies, where He says, And if a fly should rob them of anything [Q. 22:73] and about a spider, where He says, As the likeness of the spider [Q. 29:41]: what does God want with these vile creatures? God then revealed the following:\n",
        "TRANSLATION_18": "Then He mentioned the favours enjoyed by the believers in Paradise, saying: (And give glad tidings unto those who believe) in Muhammad (pbuh) and in the Qur'an (and do good works) of obedience that bind to their Lord; and it is also that this refers to doing any righteous deeds; (that theirs are Gardens beneath which), trees and habitations, (rivers flow) rivers of wine, milk, honey and water; (as often as they are provided with food), whenever they are fed in Paradise (of the fruit thereof) with different kinds of fruit, (they say: This is what was given us before), this is what we ate before, (and it is given to them) i.e. the food (in resemblance) as far as the colour is concerned but not the taste which is different. (There for them) in Paradise (are pure spouses), pure from menses or any kind of filth, (therein), in Paradise, (forever they abide) dwelling forever: never to die or be banished from it.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:25",
            "4:57",
            "85:11",
            "13:35",
            "10:9",
            "22:14",
            "14:23",
            "20:76",
            "13:3",
            "5:85"
        ],
        "BIBLE": [
            "writings:i%20chronicles:29:14",
            "writings:ezra:5:3",
            "prophets:ezekiel:16:52",
            "torah:deuteronomy:26:13",
            "torah:genesis:1:30",
            "torah:numbers:11:18",
            "prophets:ezekiel:3:20",
            "torah:genesis:1:29",
            "writings:ii%20chronicles:35:21",
            "prophets:isaiah:49:20"
        ]
    }
}