{
    "VERSE": "2:255",
    "ARABIC": "ٱللَّهُ لَآ إِلَٰهَ إِلَّا هُوَ ٱلْحَىُّ ٱلْقَيُّومُ لَا تَأْخُذُهُۥ سِنَةٌ وَلَا نَوْمٌ لَّهُۥ مَا فِى ٱلسَّمَٰوَٰتِ وَمَا فِى ٱلْأَرْضِ مَن ذَا ٱلَّذِى يَشْفَعُ عِندَهُۥٓ إِلَّا بِإِذْنِهِۦ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَىْءٍ مِّنْ عِلْمِهِۦٓ إِلَّا بِمَا شَآءَ وَسِعَ كُرْسِيُّهُ ٱلسَّمَٰوَٰتِ وَٱلْأَرْضَ وَلَا يَـُٔودُهُۥ حِفْظُهُمَا وَهُوَ ٱلْعَلِىُّ ٱلْعَظِيمُ",
    "ENGLISH": {
        "TRANSLATION_0": "Allah, there is no god but Him, the Living, the Self-Sustaining. He is not subject to drowsiness or sleep. Everything in the heavens and the earth belongs to Him. Who can intercede with Him except by His permission? He knows what is before them and what is behind them but they cannot grasp any of His knowledge save what He wills. His Footstool encompasses the heavens and the earth and their preservation does not tire Him. He is the Most High, the Magnificent.",
        "TRANSLATION_1": "God: There is no god but He, the living, eternal, self-subsisting, ever sustaining. Neither does somnolence affect Him nor sleep. To Him belongs all that is in the heavens and the earth: and who can intercede with Him except by His leave? Known to Him is all that is present before men and what is hidden (in time past and time future), and not even a little of His knowledge can they grasp except what He will. His seat extends over heavens and the earth, and He tires not protecting them: He alone is all high and supreme.\n",
        "TRANSLATION_2": "Allah: the Everlasting, the Sustainer of the whole Universe; there is no god but He. He does neither slumber nor sleep. Whatsoever is in the heavens and in the earth is His. Who is there that can intercede with Him except by His own permission.? He knows what is before the people and also what is hidden from them. And they cannot comprehend anything of His knowledge save whatever He Himself pleases to reveal. His Kingdom spreads over the heavens and the earth and the guarding of these does not weary Him. He alone is the Supreme and the Exalted.\n",
        "TRANSLATION_3": "God exists. There is no God but He, the Everlasting and the Guardian of life. Drowsiness or sleep do not seize him. To Him belongs all that is in the heavens and the earth. No one can intercede with Him for others except by His permission. He knows about people's present and past. No one can grasp anything from His knowledge besides what He has permitted them to grasp. The heavens and the earth are under His dominion. He does not experience fatigue in preserving them both. He is the Highest and the Greatest.\n",
        "TRANSLATION_4": "Allah – there is no God except Him; He is Alive (eternally, on His own) and the Upholder (keeps others established); He never feels drowsy nor does He sleep; to Him only belongs all whatever is in the heavens and all whatever is in the earth; who is he that can intercede* with Him except by His command? He knows what is in front of them and what is behind them; and they do not achieve anything of His knowledge except what He wills; His Throne (of Sovereignty) encompasses the heavens and the earth; and it is not difficult for Him to guard them; and He is the Supreme, the Greatest. (This Verse is popularly known as Ayat Al-Kursi. It has a special status and reciting it carries great reward. *Prophet Mohammed – peace and blessings be upon him – will be the first one to be granted the permission to intercede, others will follow.)\n",
        "TRANSLATION_5": "Allah! None has the right to be worshipped but He, the Ever Living, the One Who sustains and protects all that exists. Neither slumber nor sleep overtakes Him. To Him belongs whatever is in the heavens and whatever is on the earth. Who is he that can intercede with Him except with His permission He knows what happens to them (His creatures) in this world, and what will happen to them in the Hereafter. And they will never compass anything of His Knowledge except that which He wills. His Kursi extends over the heavens and the earth, and He feels no fatigue in guarding and preserving them. And He is the Most High, the Most Great.\n",
        "TRANSLATION_6": "Allah is He besides Whom there is no god, the Everliving, the Self-subsisting by Whom all subsist; slumber does not overtake Him nor sleep; whatever is in the heavens and whatever is in the earth is His; who is he that can intercede with Him but by His permission? He knows what is before them and what is behind them, and they cannot comprehend anything out of His knowledge except what He pleases, His knowledge extends over the heavens and the earth, and the preservation of them both tires Him not, and He is the Most High, the Great.\n",
        "TRANSLATION_7": "God there is no god but He, the Living, the Everlasting. Slumber seizes Him not, neither sleep; to Him belongs all that is in the heavens and the earth. Who is there that shall intercede with Him save by His leave? He knows what lies before them and what is after them, and they comprehend not anything of His knowledge save such as He wills. His Throne comprises the heavens and earth; the preserving of them oppresses Him not; He is the All-high, the All-glorious.\n",
        "TRANSLATION_8": "Allah! There is no deity save Him, the Alive, the Eternal. Neither slumber nor sleep overtaketh Him. Unto Him belongeth whatsoever is in the heavens and whatsoever is in the earth. Who is he that intercedeth with Him save by His leave? He knoweth that which is in front of them and that which is behind them, while they encompass nothing of His knowledge save what He will. His throne includeth the heavens and the earth, and He is never weary of preserving them. He is the Sublime, the Tremendous.\n",
        "TRANSLATION_9": "God: there is no deity save Him, the Living, the Eternal One. Neither slumber nor sleep overtakes Him. To Him belong whatsoever is in the heavens and whatsoever is on the earth. Who can intercede with Him except by His permission? He knows all that is before them and all that is behind them. They can grasp only that part of His knowledge which He wills. His throne extends over the heavens and the earth; and their upholding does not weary Him. He is the Sublime, the Almighty One!\n",
        "TRANSLATION_10": "Allah! There is no God but he, the Living, the Sustainer Slumber taketh hold of Him not, nor sleep. His is whatsoever is in the heavens and whatsoever is on the earth. Who is he that shall intercede With Him except with His leave! He knoweth that which was before them and that which shall he after them, and they encompass not aught of His knowledge save that which He willeth. His throne comprehendeth the heavens and the earth, and the guarding of the twain wearieth Him not. And He is the High, the Supreme.\n",
        "TRANSLATION_11": "Allah—there is no god except Him—is the Living One, the All-sustainer. Neither drowsiness befalls Him nor sleep. To Him belongs whatever is in the heavens and whatever is on the earth. Who is it that may intercede with Him except with His permission? He knows what is before them and what is behind them, and they do not comprehend anything of His knowledge except what He wishes. His seat embraces the heavens and the earth and He is not wearied by their preservation, and He is the All-exalted, the All-supreme.\n",
        "TRANSLATION_12": "Allah! There is no god but He,-the Living, the Self-subsisting, Eternal. No slumber can seize Him nor sleep. His are all things in the heavens and on earth. Who is there can intercede in His presence except as He permitteth? He knoweth what (appeareth to His creatures as) before or after or behind them. Nor shall they compass aught of His knowledge except as He willeth. His Throne doth extend over the heavens and the earth, and He feeleth no fatigue in guarding and preserving them for He is the Most High, the Supreme (in glory).\n",
        "TRANSLATION_13": "Allah! La ilaha illa Huwa (none has the right to be worshipped but He), the Ever Living, the One Who sustains and protects all that exists. Neither slumber, nor sleep overtake Him. To Him belongs whatever is in the heavens and whatever is on earth. Who is he that can intercede with Him except with His Permission? He knows what happens to them (His creatures) in this world, and what will happen to them in the Hereafter. And they will never compass anything of His Knowledge except that which He wills. His Kursi extends over the heavens and the earth, and He feels no fatigue in guarding and preserving them. And He is the Most High, the Most Great. [This Verse 2:255 is called Ayat-ul-Kursi.]\n",
        "TRANSLATION_14": "Allah, there is no god except He, the Living, the Everlasting. Neither dozing, nor sleep overtakes Him. To Him belongs all that is in the heavens and the earth. Who is he that shall intercede with Him except by His permission! He knows what will be before their hands and what was behind them, and they do not comprehend anything of His Knowledge except what He willed. His Seat embraces the heavens and the earth, and the preserving of them does not weary Him. He is the High, the Great.\n",
        "TRANSLATION_15": "God! There is no god except He, the Living, the Everlasting. Neither slumber overtakes Him, nor sleep. To Him belongs everything in the heavens and everything on earth. Who is he that can intercede with Him except with His permission? He knows what is before them, and what is behind them; and they cannot grasp any of His knowledge, except as He wills. His Throne extends over the heavens and the earth, and their preservation does not burden Him. He is the Most High, the Great.\n",
        "TRANSLATION_16": "Allah - there is no deity except Him, the Ever-Living, the Sustainer of [all] existence. Neither drowsiness overtakes Him nor sleep. To Him belongs whatever is in the heavens and whatever is on the earth. Who is it that can intercede with Him except by His permission? He knows what is [presently] before them and what will be after them, and they encompass not a thing of His knowledge except for what He wills. His Kursi extends over the heavens and the earth, and their preservation tires Him not. And He is the Most High, the Most Great.\n",
        "TRANSLATION_17": "[2:255] God, there is no god, that is, there is none worthy of being worshipped in [all] existence, except Him, the Living, the Everlasting, the Eternal Sustainer, the One constantly engaged in the management of His creation. Slumber does not seize Him, neither sleep; to Him belongs all that is in the heavens and the earth, as possessions, creatures and servants; who is there, that is to say, none is there, that shall intercede with Him save by His leave?, in this for him. He knows what lies before them, that is, creation, and what is after them, of the affairs of this world and the Hereafter; and they encompass nothing of His knowledge, that is, they know nothing of what He knows, save such as He wills, to inform of it by way of His messengers. His throne subsumes the heavens and the earth, it is said that His knowledge encompasses them both; it is also said that the kursī (‘throne’) itself subsumes them on account of its vastness, as in the hadīth, ‘The seven heavens compared to the kursī are like seven silver coins lying in a metal shield [of armour]’; the preserving of them, the heavens and the earth, wearies Him not, does not burden Him; He is the Sublime, above His creation by virtue of His subjugation [of them], the Tremendous, the Great.\n",
        "TRANSLATION_18": "Allah then praises Himself, saying: (Allah! There is no God save Him, the Alive) Who dies not, (the Eternal) the Self-existent Who has no beginning. (Neither slumber nor) deep (sleep overtaketh Him) such that He is distracted from running and commanding it. (Unto Him belongeth whatever is in the heavens) of angels (and whatever is in the earth) of created beings. (Who is he that intercedeth with Him) from amongst the dwellers of the heavens and the earth on the Day of Judgement (save by His leave?) except by His command? (He knoweth that which is in front of them) in front of the angels regarding the matter of the Hereafter and who is to intercede (and that which is behind them) of the life of this world, (while they encompass nothing of His knowledge save that He will). Allah says: the angels know nothing of the Hereafter or of the life of this world save that which Allah has taught them. (His throne includeth the heaven and the earth) He says that His Chair extends far beyond the heavens and the earth, (and He is never weary of preserving them) it is not burdensome for Him to preserve the Throne and Chair without the angels. (He is the Sublime) more sublime than anything, (the Tremendous) more tremendous than anything.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:255",
            "49:16",
            "29:52",
            "10:18",
            "4:126",
            "43:85",
            "16:73",
            "24:64",
            "63:7",
            "42:4"
        ],
        "BIBLE": [
            "prophets:isaiah:42:6",
            "writings:esther:4:11",
            "writings:daniel:4:14",
            "torah:genesis:3:22",
            "writings:lamentations:2:15",
            "prophets:jeremiah:21:7",
            "prophets:jeremiah:38:4",
            "prophets:isaiah:49:22",
            "prophets:isaiah:50:2",
            "prophets:jeremiah:14:9"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:4:3"
        ]
    }
}