{
    "VERSE": "2:271",
    "ARABIC": "إِن تُبْدُوا۟ ٱلصَّدَقَٰتِ فَنِعِمَّا هِىَ وَإِن تُخْفُوهَا وَتُؤْتُوهَا ٱلْفُقَرَآءَ فَهُوَ خَيْرٌ لَّكُمْ وَيُكَفِّرُ عَنكُم مِّن سَيِّـَٔاتِكُمْ وَٱللَّهُ بِمَا تَعْمَلُونَ خَبِيرٌ",
    "ENGLISH": {
        "TRANSLATION_0": "If you make your sadaqa public, that is good. But if you conceal it and give it to the poor, that is better for you, and We will erase some of your bad actions from you. Allah is aware of what you do.",
        "TRANSLATION_1": "If you give alms openly, it is well; but if you do it secretly and give to the poor, that is better. This will absolve you of some of your sins; and God is cognisant of all you do.\n",
        "TRANSLATION_2": "If you practise charity publicly, it is good; but if you give charity secretly to the needy, it is much better for you, for this will expiate many of your sins. Anyhow, Allah is well aware of whatever you do.\n",
        "TRANSLATION_3": "It is not bad to give alms in public. However if you give them privately to the poor, it would be better for you and an expiation for some of your sins. God is Well-Aware of what you do.\n",
        "TRANSLATION_4": "If you give charity openly, what an excellent deed it is! And if you secretly give it to the poor, it is the best for you; and it will redeem some of your sins; and Allah is Aware of your deeds.\n",
        "TRANSLATION_5": "If you disclose your Sadaqat (almsgiving), it is well; but if you conceal them and give them to the poor, that is better for you. (Allah) will expiate you some of your sins. And Allah is Well-Acquainted with what you do.\n",
        "TRANSLATION_6": "If you give alms openly, it is well, and if you hide it and give it to the poor, it is better for you; and this will do away with some of your evil deeds; and Allah is aware of what you do.\n",
        "TRANSLATION_7": "If you publish your freewill offerings, it is excellent; but if you conceal them, and give them to the poor, that is better for you, and will acquit you of your evil deeds; God is aware of the things you do.\n",
        "TRANSLATION_8": "If ye publish your almsgiving, it is well, but if ye hide it and give it to the poor, it will be better for you, and will atone for some of your ill-deeds. Allah is Informed of what ye do.\n",
        "TRANSLATION_9": "If you give charity openly, it is good, but if you keep it secret and give to the needy in private, that is better for you, and it will atone for some of your bad deeds. God is aware of all that you do.\n",
        "TRANSLATION_10": "If ye disclose the alms, even so it is well, and if ye hide them and give them unto the poor, it will be better for you and He will expiate some of your misdeeds Allah is of that which ye work Aware.\n",
        "TRANSLATION_11": "If you disclose your charities, that is well, but if you hide them and give them to the poor, that is better for you, and it will atone for some of your misdeeds, and Allah is well aware of what you do.\n",
        "TRANSLATION_12": "If ye disclose (acts of) charity, even so it is well, but if ye conceal them, and make them reach those (really) in need, that is best for you: It will remove from you some of your (stains of) evil. And Allah is well acquainted with what ye do.\n",
        "TRANSLATION_13": "If you disclose your Sadaqat (alms-giving), it is well, but if you conceal it, and give it to the poor, that is better for you. (Allah) will forgive you some of your sins. And Allah is Well-Acquainted with what you do.\n",
        "TRANSLATION_14": "If you reveal your charity it is good, but to give charity to the poor in private is better and will acquit you from some of your evil deeds. Allah is Knowledgeable of what you do.\n",
        "TRANSLATION_15": "If you give charity openly, that is good. But if you keep it secret, and give it to the needy in private, that is better for you. It will atone for some of your misdeeds. God is cognizant of what you do.\n",
        "TRANSLATION_16": "If you disclose your charitable expenditures, they are good; but if you conceal them and give them to the poor, it is better for you, and He will remove from you some of your misdeeds [thereby]. And Allah, with what you do, is [fully] Acquainted.\n",
        "TRANSLATION_17": "[2:271] If you proclaim, make manifest, your voluntary almsgivings, that is, your supererogatory deeds, it is a fine thing, to show them; but if you conceal them, and give them to the poor, that is even better for you, than making them manifest or giving it to the rich. As regards the obligatory almsgiving, it is better to make it manifest, so that it serves as an example and so that one is not accused [falsely of not giving]; as regards giving it to the poor, this is obligatory; and it will absolve you of, some of, your evil deeds (read yukaffir, ‘it will absolve’, or nukaffir, ‘We will absolve’, either in apocopated form [with no final vowel, yukaffir, nukaffir], being a supplement to the locus of fa-huwa, ‘that is’, or with nominative inflection [yukaffiru, nukaffiru], indicating the beginning of a new sentence). God is aware of what you do, knowing its inner and outer aspects, nothing of it being hidden from Him.\n",
        "TRANSLATION_18": "Allah then mentions almsgiving that is done in the open and that which is done secretly because they asked about it, saying: (If ye publish) if you show (your almsgiving) which is obligated upon you, (it is well, but if ye hide it) the supererogatory almsgiving (and give it to the poor) the folk of the Platform (ashab al-Suffah), (it will be better for you) than giving it in the open, but both are accepted from you, (and will atone for some of your ill deeds) in proportion of your almsgiving. (Allah is Informed of what ye do). He knows of the alms that you give.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:271",
            "7:87",
            "4:149",
            "11:86",
            "3:54",
            "10:109",
            "2:110",
            "64:8",
            "64:16",
            "2:273"
        ],
        "BIBLE": [
            "torah:leviticus:5:13",
            "writings:nehemiah:10:34",
            "torah:leviticus:5:16",
            "torah:leviticus:16:16",
            "writings:daniel:9:27",
            "torah:leviticus:5:10",
            "prophets:ii%20samuel:23:5",
            "torah:leviticus:5:26",
            "torah:leviticus:4:26",
            "writings:psalms:32:5"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:2",
            "Sefer%20Yetzirah:4:1"
        ]
    }
}