{
    "VERSE": "2:276",
    "ARABIC": "يَمْحَقُ ٱللَّهُ ٱلرِّبَوٰا۟ وَيُرْبِى ٱلصَّدَقَٰتِ وَٱللَّهُ لَا يُحِبُّ كُلَّ كَفَّارٍ أَثِيمٍ",
    "ENGLISH": {
        "TRANSLATION_0": "Allah obliterates usury but makes sadaqa grow in value! Allah does not love any persistently ungrateful wrongdoer.",
        "TRANSLATION_1": "God takes away (gain) from usury, but adds (profit) to charity; and God does not love the ungrateful and sinners.\n",
        "TRANSLATION_2": "Allah deprives interest of all blessing and develops charity; and Allah does not like an ungrateful, sinful person.\n",
        "TRANSLATION_3": "God makes unlawful interest devoid of all blessings and causes charity to increase. God does not love sinful unbelievers.\n",
        "TRANSLATION_4": "Allah destroys usury and increases charity; and Allah does not like any ungrateful, excessive sinner.\n",
        "TRANSLATION_5": "Allah will destroy Riba and will give increase for Sadaqat. And Allah likes not the disbelievers, sinners.\n",
        "TRANSLATION_6": "Allah does not bless usury, and He causes charitable deeds to prosper, and Allah does not love any ungrateful sinner.\n",
        "TRANSLATION_7": "God blots out usury, but freewill offerings He augments with interest. God loves not any guilty ingrate.\n",
        "TRANSLATION_8": "Allah hath blighted usury and made almsgiving fruitful. Allah loveth not the impious and guilty.\n",
        "TRANSLATION_9": "God blights usury and blesses charitable deeds. God does not love the ungrateful wrongdoer.\n",
        "TRANSLATION_10": "Allah obliterateth usury, and increaseth the alms. And Allah loveth not any ingrate sinner.\n",
        "TRANSLATION_11": "Allah brings usury to naught, but He makes charities flourish. Allah does not like any sinful ingrate.\n",
        "TRANSLATION_12": "Allah will deprive usury of all blessing, but will give increase for deeds of charity: For He loveth not creatures ungrateful and wicked.\n",
        "TRANSLATION_13": "Allah will destroy Riba (usury) and will give increase for Sadaqat (deeds of charity, alms, etc.) And Allah likes not the disbelievers, sinners.\n",
        "TRANSLATION_14": "Allah effaces usury and nurtures charity. Allah does not love any ungrateful sinner.\n",
        "TRANSLATION_15": "God condemns usury, and He blesses charities. God does not love any sinful ingrate.\n",
        "TRANSLATION_16": "Allah destroys interest and gives increase for charities. And Allah does not like every sinning disbeliever.\n",
        "TRANSLATION_17": "[2:276] God effaces usury, diminishing it and eliminating any blessing in it, but He augments voluntary almsgivings with interest, increasing them, making them grow and multiplying their reward. God loves not, that is to say, He will requite, any guilty, profligate devouring it, ingrate, who deems usury licit.\n",
        "TRANSLATION_18": "If they are sincere (Allah hath blighted usury) He has wiped it out and removed its blessedness in the life of this world and in the Hereafter (and made) the obligatory and supererogatory (almsgiving fruitful) accepted and rewarded many times over, when they are done sincerely for His sake. (Allah loveth not the impious) disbeliever who denies the unlawfulness of usury (and guilty) the impudent who consumes it.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:276",
            "3:130",
            "25:55",
            "22:38",
            "83:12",
            "26:222",
            "9:79",
            "9:104",
            "6:64",
            "14:28"
        ],
        "BIBLE": [
            "prophets:ezekiel:18:13",
            "torah:genesis:3:6",
            "torah:leviticus:4:35",
            "torah:leviticus:7:34",
            "prophets:ezekiel:18:8",
            "torah:genesis:31:9",
            "torah:leviticus:10:17",
            "prophets:judges:3:6",
            "prophets:ezekiel:18:16",
            "prophets:ii%20samuel:22:36"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:1:9"
        ]
    }
}