{
    "VERSE": "2:279",
    "ARABIC": "فَإِن لَّمْ تَفْعَلُوا۟ فَأْذَنُوا۟ بِحَرْبٍ مِّنَ ٱللَّهِ وَرَسُولِهِۦ وَإِن تُبْتُمْ فَلَكُمْ رُءُوسُ أَمْوَٰلِكُمْ لَا تَظْلِمُونَ وَلَا تُظْلَمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "If you do not, know that it means war from Allah and His Messenger. But if you make tawba you may have your capital, without wronging and without being wronged.",
        "TRANSLATION_1": "If you do not, beware of war on the part of God and His Apostle. But if you repent, you shall keep your principal. Oppress none and no one will oppress you.\n",
        "TRANSLATION_2": "but if you do not do so, then you are warned of the declaration of war against you by Allah and His Messenger. If, however, you repent even now (and forego interest), you are entitled to your principal; do no wrong, and no wrong will be done to you.\n",
        "TRANSLATION_3": "If you will not give up the unlawful interest which you demand, know that you are in the state of war with God and His Messenger. But if you repent, you will have your capital without being wronged or having done wrong to others.\n",
        "TRANSLATION_4": "And if you do not, then be certain of a war with Allah and His Noble Messenger; and if you repent, take back your principal amount; neither you cause harm to someone, nor you be harmed.\n",
        "TRANSLATION_5": "And if you do not do it, then take a notice of war from Allah and His Messenger but if you repent, you shall have your capital sums. Deal not unjustly, and you shall not be dealt with unjustly.\n",
        "TRANSLATION_6": "But if you do (it) not, then be apprised of war from Allah and His Apostle; and if you repent, then you shall have your capital; neither shall you make (the debtor) suffer loss, nor shall you be made to suffer loss.\n",
        "TRANSLATION_7": "But if you do not, then take notice that God shall war with you, and His Messenger; yet if you repent, you shall have your principal, unwronging and unwronged.\n",
        "TRANSLATION_8": "And if ye do not, then be warned of war (against you) from Allah and His messenger. And if ye repent, then ye have your principal (without interest). Wrong not, and ye shall not be wronged.\n",
        "TRANSLATION_9": "For, if you do not do so, then know that you are at war with God and His Messenger. But if you repent, you may retain your capital. Do not wrong [others] and you will not be wronged.\n",
        "TRANSLATION_10": "But if ye will do it not, then be apprised of war from Allah and His apostle. And if ye repent, then yours shall be your capital sums; ye shall neither wrong nor be wronged.\n",
        "TRANSLATION_11": "And if you do not, then be informed of a war from Allah and His apostle. And if you repent, then you will have your principal, neither harming others, nor suffering harm.\n",
        "TRANSLATION_12": "If ye do it not, Take notice of war from Allah and His Messenger: But if ye turn back, ye shall have your capital sums: Deal not unjustly, and ye shall not be dealt with unjustly.\n",
        "TRANSLATION_13": "And if you do not do it, then take a notice of war from Allah and His Messenger but if you repent, you shall have your capital sums. Deal not unjustly (by asking more than your capital sums), and you shall not be dealt with unjustly (by receiving less than your capital sums).\n",
        "TRANSLATION_14": "but if you do not, then take notice of war from Allah and His Messenger. Yet, if you repent, you shall have the principal of your wealth. Neither will you harm nor will you be harmed.\n",
        "TRANSLATION_15": "If you do not, then take notice of a war by God and His Messenger. But if you repent, you may keep your capital, neither wronging, nor being wronged.\n",
        "TRANSLATION_16": "And if you do not, then be informed of a war [against you] from Allah and His Messenger. But if you repent, you may have your principal - [thus] you do no wrong, nor are you wronged.\n",
        "TRANSLATION_17": "[2:279] But if you do not, do what you have been commanded, then be warned, have knowledge, of war from God, and His Messenger, against you: herein is a grave threat for them. When it was revealed, they said, ‘What power can we have in a war against Him!’ Yet if you repent, and forgo it, you shall have your principal sums, the original amounts, not being unjust, by charging interest, and no injustice being done to you, by way of any diminution.\n",
        "TRANSLATION_18": "(And if ye do not) if you do not abstain from usury, (then be warned of war (against you) from Allah and His Messenger) then be ready for a torment from God in the Hereafter by means of the Fire and its chastisement and also be ready for the sword from His Messenger in the life of this world. (And if ye repent) from usury, (then ye have your principal (without interest)) that is owed to you by the Banu Makhzum. (Wrong not) anyone by demanding interest, (and ye shall not be wronged) by anyone if they give you back your capitals; it is also said that 'wrong not' means: do not harm others; and 'you shall not be wronged' meaning: you shall not be harmed because of your debts.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:279",
            "3:32",
            "63:5",
            "61:11",
            "7:62",
            "48:27",
            "9:62",
            "9:1",
            "48:13",
            "5:92"
        ],
        "BIBLE": [
            "prophets:ezekiel:39:7",
            "prophets:i%20kings:8:47",
            "prophets:isaiah:43:19",
            "torah:deuteronomy:13:15",
            "prophets:i%20samuel:28:15",
            "writings:daniel:5:15",
            "prophets:isaiah:56:7",
            "torah:deuteronomy:4:25",
            "prophets:ezekiel:35:9",
            "torah:exodus:23:13"
        ]
    }
}