{
    "VERSE": "2:280",
    "ARABIC": "وَإِن كَانَ ذُو عُسْرَةٍ فَنَظِرَةٌ إِلَىٰ مَيْسَرَةٍ وَأَن تَصَدَّقُوا۟ خَيْرٌ لَّكُمْ إِن كُنتُمْ تَعْلَمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "If someone is in difficult circumstances, there should be a deferral until things are easier. But making a free gift of it would be better for you if you only knew.",
        "TRANSLATION_1": "If a debtor is in want, give him time until his circumstances improve; but if you forego (the debt) as charity, that will be to your good, if you really understand.\n",
        "TRANSLATION_2": "If your debtor be in straitened circumstances, give him time till his monetary condition becomes better. But if you remit the debt by way of charity, it would be better for you, if you only knew it.\n",
        "TRANSLATION_3": "One who faces hardship in paying his debts must be given time until his financial condition improves. Would that you knew that waiving such a loan as charity would be better for you!\n",
        "TRANSLATION_4": "And if the debtor is in difficulty, give him respite till the time of ease; and your foregoing the entire debt from him is still better for you, if only you realise.\n",
        "TRANSLATION_5": "And if the debtor is having a hard time, then grant him time till it is easy for him to repay; but if you remit it by way of charity, that is better for you if you did but know.\n",
        "TRANSLATION_6": "And if (the debtor) is in straitness, then let there be postponement until (he is in) ease; and that you remit (it) as alms is better for you, if you knew.\n",
        "TRANSLATION_7": "And if any man should be in difficulties, let him have respite till things are easier; but that you should give freewill offerings is better for you, did you but know.\n",
        "TRANSLATION_8": "And if the debtor is in straitened circumstances, then (let there be) postponement to (the time of) ease; and that ye remit the debt as almsgiving would be better for you if ye did but know.\n",
        "TRANSLATION_9": "If the debtor is in straitened circumstances, then grant him respite till a time of ease. If you were to write it off as an act of charity, that would be better for you, if only you knew.\n",
        "TRANSLATION_10": "And if one be in difficulties, then let there be and deferment until easiness. But if ye forego, it were better for you if ye knew.\n",
        "TRANSLATION_11": "If [the debtor] is in straits, let there be a respite until the time of ease; and if you remit [the debt] as charity, it will be better for you, should you know.\n",
        "TRANSLATION_12": "If the debtor is in a difficulty, grant him time Till it is easy for him to repay. But if ye remit it by way of charity, that is best for you if ye only knew.\n",
        "TRANSLATION_13": "And if the debtor is in a hard time (has no money), then grant him time till it is easy for him to repay, but if you remit it by way of charity, that is better for you if you did but know.\n",
        "TRANSLATION_14": "If he should be in hardship, then a postponement until ease; while if you give charity it is better for you if you know.\n",
        "TRANSLATION_15": "But if he is in hardship, then deferment until a time of ease. But to remit it as charity is better for you, if you only knew.\n",
        "TRANSLATION_16": "And if someone is in hardship, then [let there be] postponement until [a time of] ease. But if you give [from your right as] charity, then it is better for you, if you only knew.\n",
        "TRANSLATION_17": "[2:280] And if any man, in debt, should be in difficulties, then, let him have, respite, a postponement, till things are easier (read maysara or maysura, meaning ‘a time of ease’); but that you should give (tassaddaqū, where the second tā’ of the softened form, tatasaddaqū, has been assimilated with the sād), the one in difficulty, a voluntary almsgiving, by waiving his debt, is better for you, did you but know, [if you know] that it is better for you, then do it. In a hadīth it is said, ‘Whoever gives respite to one in difficulty, or waives his debt, God will place him under His shade, on a day when there shall be no shade except God’s’, as reported by Muslim.\n",
        "TRANSLATION_18": "(And if the debtor) the Banu Makhzum (is in straitened circumstances, then (let there be) postponement to (the time of) ease; and that ye remit the debt as almsgiving would be better for you) than being paid or postponing the debt (if ye did but know) this.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:280",
            "16:126",
            "70:41",
            "87:8",
            "64:16",
            "27:89",
            "3:104",
            "44:21",
            "2:103",
            "18:36"
        ],
        "BIBLE": [
            "prophets:hosea:14:10",
            "prophets:isaiah:59:8",
            "prophets:ezekiel:7:4",
            "prophets:ezekiel:7:9",
            "torah:genesis:19:8",
            "prophets:ezekiel:36:11",
            "torah:genesis:42:33",
            "prophets:i%20samuel:25:15",
            "prophets:i%20samuel:20:12",
            "prophets:ii%20samuel:14:20"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:4:9"
        ]
    }
}