{
    "VERSE": "2:283",
    "ARABIC": "وَإِن كُنتُمْ عَلَىٰ سَفَرٍ وَلَمْ تَجِدُوا۟ كَاتِبًا فَرِهَٰنٌ مَّقْبُوضَةٌ فَإِنْ أَمِنَ بَعْضُكُم بَعْضًا فَلْيُؤَدِّ ٱلَّذِى ٱؤْتُمِنَ أَمَٰنَتَهُۥ وَلْيَتَّقِ ٱللَّهَ رَبَّهُۥ وَلَا تَكْتُمُوا۟ ٱلشَّهَٰدَةَ وَمَن يَكْتُمْهَا فَإِنَّهُۥٓ ءَاثِمٌ قَلْبُهُۥ وَٱللَّهُ بِمَا تَعْمَلُونَ عَلِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "If you are on a journey and cannot find a writer, something can be left as a security. If you leave things on trust with one another the one who is trusted must deliver up his trust and have taqwa of Allah his Lord. Do not conceal testimony. If someone does conceal it, his heart commits a crime. Allah knows what you do.",
        "TRANSLATION_1": "If you are on a journey and cannot find a scribe, pledge your goods (against the Loan); and if one trusts the other, then let him who is trusted deliver the thing entrusted, and have fear of God, his Lord. Do not suppress any evidence, for he who conceals evidence is sinful of heart; and God is aware of all you do.\n",
        "TRANSLATION_2": "If you are on a journey and cannot find a scribe to write the document, then transact your business on the security of a pledge in hand. And, if any one transacts a piece of business with another merely on trust, then the one who is trusted should fulfil his trust and fear Allah, his Lord And never conceal evidence for he who conceals it, has a sinful heart: Allah knows everything that you do.\n",
        "TRANSLATION_3": "If you are on a journey where you cannot find a scribe, finalize your contract in the form of a deposit in which the goods are already given to the parties. If you trust each other in such a contract, let him pay back what he has entrusted you with and have fear of God, his Lord. Do not refuse to testify to what you bore witness. Whoever does so has committed a sin. God knows what you do.\n",
        "TRANSLATION_4": "And if you are on a journey and cannot find a scribe, then a mortgage (deposit) must be handed over; and if one of you trusts the other, the one who is trusted may return the mortgage entrusted to him and fear Allah, his Lord; and do not hide testimony; and if one hides it, his heart is sinful from within; and Allah knows what you do.\n",
        "TRANSLATION_5": "And if you are on a journey and cannot find a scribe, then let there be a pledge taken (mortgaging), then if one of you entrusts the other, let the one who is entrusted discharge his trust, and let him have Taqwa of Allah, his Lord. And conceal not the evidence, for he who hides it, surely, his heart is sinful. And Allah is All-Knower of what you do.\n",
        "TRANSLATION_6": "And if you are upon a journey and you do not find a scribe, then (there may be) a security taken into possession; but if one of you trusts another, then he who is trusted should deliver his trust, and let him be careful (of his duty to) Allah, his Lord; and do not conceal testimony, and whoever conceals it, his heart is surely sinful; and Allah knows what you do.\n",
        "TRANSLATION_7": "And if you are upon a journey, and you do not find a writer, then a pledge in hand. But if one of you trusts another, let him who is trusted deliver his trust, and let him fear God his Lord. And do not conceal the testimony; whoso conceals it, his heart is sinful; and God has knowledge of the things you do.\n",
        "TRANSLATION_8": "If ye be on a journey and cannot find a scribe, then a pledge in hand (shall suffice). And if one of you entrusteth to another let him who is trusted deliver up that which is entrusted to him (according to the pact between them) and let him observe his duty to Allah his Lord. Hide not testimony. He who hideth it, verily his heart is sinful. Allah is Aware of what ye do.\n",
        "TRANSLATION_9": "If you are on a journey and do not find any literate person, something should be handed over as security. If one of you entrusts another with something, let the trustee restore the pledge to its owner; and let him fear God, his Lord. Do not conceal testimony. If someone does conceal it, in his heart he commits a crime. God knows what you do.\n",
        "TRANSLATION_10": "And if ye be on a journey and ye find not a scribe, then let there be a pledge taken; then, if one of you entrusteth the other, let the one is trusted discharge his trust, and let him fear Allah, his Lord. And hide not testimony whosoever hideth and it, his heart verily is Knower. Allah is of that which ye work\n",
        "TRANSLATION_11": "If you are on a journey and cannot find a writer, then a retained pledge [shall suffice]. And if one of you entrusts [an asset] to another, let him who is trusted deliver his trust, and let him be wary of Allah, his Lord. And do not conceal your testimony; anyone who conceals it, his heart will indeed be sinful, and Allah knows well what you do.\n",
        "TRANSLATION_12": "If ye are on a journey, and cannot find a scribe, a pledge with possession (may serve the purpose). And if one of you deposits a thing on trust with another, Let the trustee (Faithfully) discharge His trust, and let him fear his Lord. Conceal not evidence; for whoever conceals it,- His heart is tainted with sin. And Allah Knoweth all that ye do.\n",
        "TRANSLATION_13": "And if you are on a journey and cannot find a scribe, then let there be a pledge taken (mortgaging); then if one of you entrust the other, let the one who is entrusted discharge his trust (faithfully), and let him be afraid of Allah, his Lord. And conceal not the evidence for he, who hides it, surely his heart is sinful. And Allah is All-Knower of what you do.\n",
        "TRANSLATION_14": "If you are upon a journey and a scribe cannot be found, then let pledges be taken. If any of you trusts another let the trusted deliver his trust; and let him fear Allah his Lord. And you shall not conceal the testimony. He who conceals it, his heart is sinful. Allah has knowledge of what you do.\n",
        "TRANSLATION_15": "If you are on a journey, and cannot find a scribe, then a security deposit should be handed over. But if you trust one another, let the trustee fulfill his trust, and let him fear God, his Lord. And do not conceal testimony. Whoever conceals it is sinner at heart. God is aware of what you do.\n",
        "TRANSLATION_16": "And if you are on a journey and cannot find a scribe, then a security deposit [should be] taken. And if one of you entrusts another, then let him who is entrusted discharge his trust [faithfully] and let him fear Allah, his Lord. And do not conceal testimony, for whoever conceals it - his heart is indeed sinful, and Allah is Knowing of what you do.\n",
        "TRANSLATION_17": "[2:283] And if you are upon a journey, travelling and you contract a debt, and you do not find a writer, then a pledge (ruhun or rihān, plural of rahn) in hand, as a guarantee for you. The Sunna clarifies the permissibility of making pledges in towns, where writers may be forthcoming; but the stipulation is made in the event of travel because in this case it is more important to have a guarantee; God’s reference to it being ‘in hand’ (maqbūda) is a condition for the pledge given to be valid, and to satisfy the pledgee or his representative. But if one of you, the creditor, trusts another, the debtor, over the debt and does not require a pledge, let   him who is trusted, the debtor, deliver his trust, the debt; and let him fear God his Lord, when delivering it. And do not conceal the testimony, if you are summoned to give it; whoever conceals it, his heart is sinful: the heart is mentioned because it is the locus of the testimony, and because if it sins, there are other sinful consequences, and so the person will be punished as though he were a sinner; and God knows what you do, nothing of which can be hidden from Him.\n",
        "TRANSLATION_18": "(If ye be on a journey and you cannot find a scribe) or the means by which to write, (then a pledge in hand (shall suffice)) then let the creditor take from the indebted person a security for his loan. (And if one of you entrusteth another) to give a loan without security (let him who is trusted) with the debt (deliver up that which is entrusted to him) the right of his creditor (and let him observe his duty to Allah, his Lord.) the debtor should fear Allah regarding repayment of his debt, (Hide not testimony) from the judges in court. (He who hideth it) i.e. his testimony, (surely his heart is sinful) his heart is impious. (Allah is Aware of what ye do) in relation to hiding or giving testimony.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:283",
            "3:160",
            "5:44",
            "5:51",
            "8:2",
            "23:117",
            "3:63",
            "3:73",
            "8:61",
            "24:6"
        ],
        "BIBLE": [
            "prophets:ezekiel:18:13",
            "torah:leviticus:5:23",
            "writings:ecclesiastes:3:14",
            "prophets:joshua:1:15",
            "torah:deuteronomy:26:13",
            "prophets:joshua:23:16",
            "writings:ecclesiastes:8:8",
            "prophets:isaiah:47:8",
            "prophets:i%20samuel:4:19",
            "prophets:jeremiah:35:15"
        ]
    }
}