{
    "VERSE": "2:284",
    "ARABIC": "لِّلَّهِ مَا فِى ٱلسَّمَٰوَٰتِ وَمَا فِى ٱلْأَرْضِ وَإِن تُبْدُوا۟ مَا فِىٓ أَنفُسِكُمْ أَوْ تُخْفُوهُ يُحَاسِبْكُم بِهِ ٱللَّهُ فَيَغْفِرُ لِمَن يَشَآءُ وَيُعَذِّبُ مَن يَشَآءُ وَٱللَّهُ عَلَىٰ كُلِّ شَىْءٍ قَدِيرٌ",
    "ENGLISH": {
        "TRANSLATION_0": "Everything in the heavens and everything in the earth belongs to Allah. Whether you divulge what is in yourselves or keep it hidden, Allah will still call you to account for it. He forgives whomever He wills and He punishes whoever He wills. Allah has power over all things.",
        "TRANSLATION_1": "To God belongs all that is in the heavens and the earth; and whether you reveal what is in your heart or conceal it, you will have to account for it to God who will pardon whom He please and punish whom He will, for God has the power over all things.\n",
        "TRANSLATION_2": "To Allah belongs whatever is in the heavens and the earth. \" Allah will call you to account for what is in your minds whether you disclose it or hide it. He, however, had full authority to pardon or punish anyone He pleases, for Allah has complete power over everything.\n",
        "TRANSLATION_3": "God belongs whatever is in the heavens and the earth. God will call you to account for all that you may reveal from your souls and all that you may conceal. God will forgive or punish whomever He wants. God has power over all things.\n",
        "TRANSLATION_4": "To Allah only belongs all whatever is in the heavens and all whatever is in the earth; and whether you disclose what is in your hearts or hide it, Allah will take account of it from you; so He will forgive whomever He wills and punish whomever He wills; and Allah is Able to do all things.\n",
        "TRANSLATION_5": "To Allah belongs all that is in the heavens and all that is on the earth, and whether you disclose what is in yourselves or conceal it, Allah will call you to account for it. Then He forgives whom He wills and punishes whom He wills. And Allah is able to do all things.\n",
        "TRANSLATION_6": "Whatever is in the heavens and whatever is in the earth is Allah's; and whether you manifest what is in your minds or hide it, Allah will call you to account according to it; then He will forgive whom He pleases and chastise whom He pleases, and Allah has power over all things.\n",
        "TRANSLATION_7": "To God belongs all that is in the heavers and earth. Whether you publish what is in your hearts or hide it, God shall make reckoning with you for it. He will forgive whom He will, and chastise whom He will; God is powerful over everything.\n",
        "TRANSLATION_8": "Unto Allah (belongeth) whatsoever is in the heavens and whatsoever is in the earth; and whether ye make known what is in your minds or hide it, Allah will bring you to account for it. He will forgive whom He will and He will punish whom He will. Allah is Able to do all things.\n",
        "TRANSLATION_9": "All that the heavens and the earth contain belongs to God, whether you disclose what is in your minds or keep it hidden. God will bring you to account for it. He will forgive whom He will and punish whom He pleases: He has power over all things.\n",
        "TRANSLATION_10": "Allah's is whatsoever is in the heavens and Whatsoever is in the earth, and whether ye disclose that which is in your soul or conceal it, Allah will reckon with you therefor, then He will forgive whomsoever He will, and torment whomsoever He will, And Allah is over everything Potent.\n",
        "TRANSLATION_11": "To Allah belongs whatever is in the heavens and the earth. Whether you disclose what is in your hearts or hide it, Allah will bring you to account for it. Then He will forgive whomever He wishes and punish whomever He wishes, and Allah has power over all things.\n",
        "TRANSLATION_12": "To Allah belongeth all that is in the heavens and on earth. Whether ye show what is in your minds or conceal it, Allah Calleth you to account for it. He forgiveth whom He pleaseth, and punisheth whom He pleaseth, for Allah hath power over all things.\n",
        "TRANSLATION_13": "To Allah belongs all that is in the heavens and all that is on the earth, and whether you disclose what is in your ownselves or conceal it, Allah will call you to account for it. Then He forgives whom He wills and punishes whom He wills. And Allah is Able to do all things.\n",
        "TRANSLATION_14": "To Allah belongs all that is in the heavens and the earth. Whether you reveal what is in your hearts or hide it Allah will bring you to account for it. He will forgive whom He will and punish whom He will; He has power over all things.\n",
        "TRANSLATION_15": "To God belongs everything in the heavens and the earth. Whether you reveal what is within your selves, or conceal it, God will call you to account for it. He forgives whom He wills, and He punishes whom He wills. God is Able to do all things.\n",
        "TRANSLATION_16": "To Allah belongs whatever is in the heavens and whatever is in the earth. Whether you show what is within yourselves or conceal it, Allah will bring you to account for it. Then He will forgive whom He wills and punish whom He wills, and Allah is over all things competent.\n",
        "TRANSLATION_17": "[2:284] To God belongs all that is in the heavens and the earth. Whether you disclose, manifest, what is in your hearts or hide it, of evil and resolve for it, God shall take you to account for it, informing you of it on the Day of Resurrection. Then He will forgive whom He will, to forgive, and chastise whom He will, to chastise (both verbs are apocopated [fa-yaghfir, ‘he will forgive’, wa-yu‘adhdhib, ‘he will chastise’] if taken as the responses to the conditional, in tubdū, ‘if you proclaim’; but they may also be read with a final nominative inflection [yaghfiru, yu‘adhdhibu] in which case, it would [constitute a new clause and] follow on from an implicit fahuwa, ‘then He’). And God has power over all things, including reckoning with you and requiting you.\n",
        "TRANSLATION_18": "(Unto Allah (belongeth) whatsoever is in the heavens and whatsoever is in the earth) of created beings and marvels; He commands His servants with whatever He wills; (and whether ye make known what is in your minds) in your hearts; this refers to the discourse of the soul after the arousal of one's misgivings but before one divulges it (or hide it, Allah will bring you to account for it) Allah will requite you for it. The same applies to forgetfulness after one remembers, error after being right and coercion after exerting one's effort freely. (He will forgive whom He will) He will forgive the one who repents of all sins (and He will punish whom He will) He will punish the one who does not repent. (And Allah is Able to do all things) in terms of forgiveness and punishment.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:284",
            "3:29",
            "4:126",
            "5:120",
            "3:189",
            "5:40",
            "64:1",
            "57:2",
            "49:16",
            "45:22"
        ],
        "BIBLE": [
            "prophets:ii%20samuel:7:21",
            "torah:deuteronomy:4:9",
            "writings:i%20chronicles:17:19",
            "prophets:ezekiel:35:11",
            "torah:leviticus:20:25",
            "torah:deuteronomy:4:23",
            "torah:exodus:30:37",
            "writings:daniel:5:15",
            "torah:leviticus:11:43",
            "writings:psalms:51:8"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:3:7",
            "Sefer%20Yetzirah:6:1"
        ]
    }
}