{
    "VERSE": "2:33",
    "ARABIC": "قَالَ يَٰٓـَٔادَمُ أَنۢبِئْهُم بِأَسْمَآئِهِمْ فَلَمَّآ أَنۢبَأَهُم بِأَسْمَآئِهِمْ قَالَ أَلَمْ أَقُل لَّكُمْ إِنِّىٓ أَعْلَمُ غَيْبَ ٱلسَّمَٰوَٰتِ وَٱلْأَرْضِ وَأَعْلَمُ مَا تُبْدُونَ وَمَا كُنتُمْ تَكْتُمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "He said, 'Adam, tell them their names.' When he had told them their names, He said, 'Did I not tell you that I know the Unseen of the heavens and the earth, and I know what you make known and what you hide?'",
        "TRANSLATION_1": "Then He said to Adam: \"Convey to them their names.\" And when he had told them, God said: \"Did I not tell you that I know the unknown of the heavens and the earth, and I know what you disclose and know what you hide?\"\n",
        "TRANSLATION_2": "Then Allah said to Adam, \"Tell them the names of these things.\" When Adam told them the names of all those things, Allah declared, \"Did I not tell you that I know those truths about the Earth and the Heavens which are hidden from you? I know what you disclose and what you hide.\"\n",
        "TRANSLATION_3": "The Lord said to Adam, \"Tell the names of the beings to the angels.\" When Adam said their names, the Lord said, \"Did I not tell you (angels) that I know the secrets of the heavens and the earth and all that you reveal or hide?\"\n",
        "TRANSLATION_4": "He said “O Adam! Inform them the names”; and when Adam had informed them their names, He said, “Did I not tell you that I know all the secrets of the heavens and the earth? And I know all what you disclose and all what you hide?”\n",
        "TRANSLATION_5": "He said: \"O Adam! Inform them of their names,\" and when he had informed them of their names, He said: \"Did I not tell you that I know the Ghayb (unseen) in the heavens and the earth, and I know what you reveal and what you have been concealing\"\n",
        "TRANSLATION_6": "He said: O Adam! inform them of their names. Then when he had informed them of their names, He said: Did I not say to you that I surely know what is ghaib in the heavens and the earth and (that) I know what you manifest and what you hide?\n",
        "TRANSLATION_7": "He said, 'Adam, tell them their names.' And when he had told them their names He said, 'Did I not tell you I know the unseen things of the heavens and earth? And I know what things you reveal, and what you were hiding.'\n",
        "TRANSLATION_8": "He said: O Adam! Inform them of their names, and when he had informed them of their names, He said: Did I not tell you that I know the secret of the heavens and the earth? And I know that which ye disclose and which ye hide.\n",
        "TRANSLATION_9": "Then He said, \"O Adam, tell them their names.\" When Adam had told them the names, God said to the angels, \"Did I not say to you: I know the secrets of the heavens and of the earth, and I know what you reveal and what you conceal?\"\n",
        "TRANSLATION_10": "Allah said: O Adam! declare thou unto them the names of those objects. Then when he had declared unto them the names of those, He said: said I not unto you, verily I know the hidden in the heavens and the earth, and know that which ye disclose and that which ye are wont to conceal!\n",
        "TRANSLATION_11": "He said, ‘O Adam, inform them of their names,’ and when he had informed them of their names, He said, ‘Did I not tell you that I know the Unseen of the heavens and the earth, and that I know whatever you disclose and whatever you conceal?’\n",
        "TRANSLATION_12": "He said: \"O Adam! Tell them their names.\" When he had told them, Allah said: \"Did I not tell you that I know the secrets of heaven and earth, and I know what ye reveal and what ye conceal?\"\n",
        "TRANSLATION_13": "He said: \"O Adam! Inform them of their names,\" and when he had informed them of their names, He said: \"Did I not tell you that I know the Ghaib (unseen) in the heavens and the earth, and I know what you reveal and what you have been concealing?\"\n",
        "TRANSLATION_14": "Then He said to Adam: 'Tell them their names.' And when Adam had named them, He said: 'Did I not tell you that I know the unseen of the heavens and earth, and all that you reveal and all that you hide'\n",
        "TRANSLATION_15": "He said, “O Adam, tell them their names.” And when he told them their names, He said, “Did I not tell you that I know the secrets of the heavens and the earth, and that I know what you reveal and what you conceal?”\n",
        "TRANSLATION_16": "He said, \"O Adam, inform them of their names.\" And when he had informed them of their names, He said, \"Did I not tell you that I know the unseen [aspects] of the heavens and the earth? And I know what you reveal and what you have concealed.\"\n",
        "TRANSLATION_17": "[2:33] He, exalted be He, said, ‘Adam, tell them, the angels, their names’, all of the things named; so, he named each thing by its appellation and mentioned the wisdom behind its creation; And when he had told them their names He, exalted, said, in rebuke, ‘Did I not tell you that I know the Unseen in the heavens and the earth?, what is unseen in them, And I know what you reveal, what you manifested when you said, ‘What, will You appoint therein …’, and what you were hiding, what you were keeping secret when you were saying that God would not create anything more knowledgeable or more noble in His eyes than us.\n",
        "TRANSLATION_18": "(He said: Adam! Inform them of their names, and when he had informed them of their names, He said: Did I not tell you that I know the secret of the heavens and the earth?) the unseen that will take place in the heavens and on the earth. (And I know that which ye disclose), what you show to your Lord in terms of your obedience to Adam (and that which ye hide) of this obedience. It is also said that this refers to what Satan disclosed and kept hidden from them.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:33",
            "49:18",
            "27:65",
            "11:123",
            "44:29",
            "67:16",
            "11:107",
            "16:3",
            "16:52",
            "35:38"
        ],
        "BIBLE": [
            "prophets:i%20samuel:3:17",
            "prophets:isaiah:48:6",
            "writings:psalms:40:6",
            "writings:daniel:2:47",
            "prophets:jeremiah:10:11",
            "torah:genesis:21:26",
            "prophets:jeremiah:13:12",
            "prophets:jeremiah:36:19",
            "torah:genesis:15:8",
            "prophets:ii%20kings:19:15"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:4:2"
        ]
    }
}