{
    "VERSE": "2:38",
    "ARABIC": "قُلْنَا ٱهْبِطُوا۟ مِنْهَا جَمِيعًا فَإِمَّا يَأْتِيَنَّكُم مِّنِّى هُدًى فَمَن تَبِعَ هُدَاىَ فَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "We said, 'Go down from it, every one of you! Then when guidance comes to you from Me, those who follow My guidance will feel no fear and will know no sorrow.'",
        "TRANSLATION_1": "And We said to them: \"Go, all of you. When I send guidance, whoever follows it will neither have fear nor regret;\n",
        "TRANSLATION_2": "We said, \"Now go down, all of you from here. Henceforth there shall come to you Guidance from Me now and again: whoever will follow it shall have neither fear nor sorrow\n",
        "TRANSLATION_3": "We ordered them all to get out of the garden and told them that when Our guidance came to them, those who would follow it would have neither fear nor grief.\n",
        "TRANSLATION_4": "We said, “Go down from Paradise, all of you; then if some guidance comes to you from Me – so whoever follows My guidance, for such is neither fear nor any grief.”\n",
        "TRANSLATION_5": "We said: \"Get down all of you from this place (the Paradise), then whenever there comes to you Hudan (guidance) from Me, and whoever follows My guidance, there shall be no fear on them, nor shall they grieve.\n",
        "TRANSLATION_6": "We said: Go forth from this (state) all; so surely there will come to you a guidance from Me, then whoever follows My guidance, no fear shall come upon them, nor shall they grieve.\n",
        "TRANSLATION_7": "We said, 'Get you down out of it, all together; yet there shall come to you guidance from Me, and whosoever follows My guidance, no fear shall be on them, neither shall they sorrow.\n",
        "TRANSLATION_8": "We said: Go down, all of you, from hence; but verily there cometh unto you from Me a guidance; and whoso followeth My guidance, there shall no fear come upon them neither shall they grieve.\n",
        "TRANSLATION_9": "We said, \"Go down, all of you, from here: then when guidance comes to you from Me, anyone who follows My guidance will have no fear, nor will they grieve --\n",
        "TRANSLATION_10": "We said: get ye all down from hence, and if there cometh unto you a guidance from Me, then whosoever shall follow Mine guidance, -- no fear shall come on them, nor shall they grieve.\n",
        "TRANSLATION_11": "We said, ‘Get down from it, all together! Yet, should any guidance come to you from Me, those who follow My guidance shall have no fear, nor shall they grieve.\n",
        "TRANSLATION_12": "We said: \"Get ye down all from here; and if, as is sure, there comes to you Guidance from me, whosoever follows My guidance, on them shall be no fear, nor shall they grieve.\n",
        "TRANSLATION_13": "We said: \"Get down all of you from this place (the Paradise), then whenever there comes to you Guidance from Me, and whoever follows My Guidance, there shall be no fear on them, nor shall they grieve.\n",
        "TRANSLATION_14": "Go down, all together,' We said, 'so if a guidance shall come to you from Me, whosoever follows My guidance no fear shall be on them, neither shall they be saddened.\n",
        "TRANSLATION_15": "We said, “Go down from it, all of you. Yet whenever guidance comes to you from Me, then whoever follows My guidance—they have nothing to fear, nor shall they grieve.\n",
        "TRANSLATION_16": "We said, \"Go down from it, all of you. And when guidance comes to you from Me, whoever follows My guidance - there will be no fear concerning them, nor will they grieve.\n",
        "TRANSLATION_17": "[2:38] We said, ‘Go down from it, from the Garden, all together (He has repeated this [phrase qulnā ihbitū] in order to supplement it with), yet (fa-immā: the nūn of the conditional particle in [‘if’] has been assimilated with the extra mā) there shall come to you from Me guidance, a Book and a prophet, and whoever follows My guidance, believing in me and performing deeds in obedience of Me, no fear shall befall them, neither shall they grieve, in the Hereafter, since they will be admitted into Paradise.\n",
        "TRANSLATION_18": "(We said) to Adam, Eve, the serpent, the peacock and Satan: (Go down) from heaven, (all of you). Then Allah, Exalted is He, mentioned Adam's progeny, (from hence; but verily there cometh unto you), when and whenever it comes to you, (from Me a guidance), a scripture and an emissary; (whoso followeth My guidance) the scripture and the emissary, (there shall no fear come upon them) regarding any torment in the future, (neither shall they grieve) about what they have left behind them. It is also said that this means that no fear will come upon them perpetually and nor will they grieve perpetually; no fear will come upon them when death is slain and they will not grieve when hell is closed.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:38",
            "20:123",
            "6:48",
            "11:55",
            "7:18",
            "7:35",
            "16:37",
            "43:68",
            "32:13",
            "7:198"
        ],
        "BIBLE": [
            "torah:exodus:11:8",
            "torah:numbers:14:40",
            "prophets:ii%20kings:5:11",
            "prophets:i%20samuel:14:46",
            "prophets:judges:21:5",
            "prophets:ii%20samuel:17:9",
            "prophets:ii%20samuel:11:10",
            "torah:deuteronomy:1:31",
            "prophets:ii%20kings:2:23",
            "prophets:ii%20samuel:2:27"
        ]
    }
}