{
    "VERSE": "2:39",
    "ARABIC": "وَٱلَّذِينَ كَفَرُوا۟ وَكَذَّبُوا۟ بِـَٔايَٰتِنَآ أُو۟لَٰٓئِكَ أَصْحَٰبُ ٱلنَّارِ هُمْ فِيهَا خَٰلِدُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "But those who are kafir and deny Our Signs are the Companions of the Fire, remaining in it timelessly, for ever.",
        "TRANSLATION_1": "But those who deny and reject Our signs will belong to Hell, and there abide unchanged.\"\n",
        "TRANSLATION_2": "and whoever will refuse to accept it and defy Our Revelations they shall be doomed to the Fire wherein they shall remain for ever.\n",
        "TRANSLATION_3": "But those who would deny the Truth and reject Our revelations would be the companions of the Fire in which they would live forever.\n",
        "TRANSLATION_4": "And those who disbelieve and deny Our signs, are the people of fire (hell); they will remain in it forever.\n",
        "TRANSLATION_5": "But those who disbelieve and belie Our Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) ـ such are the dwellers of the Fire. They shall abide therein forever.\"\n",
        "TRANSLATION_6": "And (as to) those who disbelieve in and reject My communications, they are the inmates of the fire, in it they shall abide.\n",
        "TRANSLATION_7": "As for the unbelievers who cry lies to Our signs, those shall be the inhabitants of the Fire, therein dwelling forever.'\n",
        "TRANSLATION_8": "But they who disbelieve, and deny Our revelations, such are rightful Peoples of the Fire. They will abide therein.\n",
        "TRANSLATION_9": "those who deny and reject Our signs shall be the inhabitants of the Fire; therein shall they abide forever.\"\n",
        "TRANSLATION_10": "And those who disbelieve and belie Our signs, --they, shall be fellows of the Fire; therein they shall be abiders.\n",
        "TRANSLATION_11": "But those who are faithless and deny Our signs, they shall be the inmates of the Fire and they shall remain in it [forever].\n",
        "TRANSLATION_12": "But those who reject Faith and belie Our Signs, they shall be companions of the Fire; they shall abide therein.\"\n",
        "TRANSLATION_13": "But those who disbelieve and belie Our Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) such are the dwellers of the Fire, they shall abide therein forever.\n",
        "TRANSLATION_14": "But those who disbelieve and belie Our verses shall be the companions of the Fire, and there they shall live for ever'\n",
        "TRANSLATION_15": "But as for those who disbelieve and reject Our signs—these are the inmates of the Fire—wherein they will remain forever.”\n",
        "TRANSLATION_16": "And those who disbelieve and deny Our signs - those will be companions of the Fire; they will abide therein eternally.\"\n",
        "TRANSLATION_17": "[2:39]   As for the disbelievers who deny Our signs, Our Books, those shall be the inhabitants of the Fire, abiding therein’, enduring perpetually, neither perishing nor exiting therefrom.\n",
        "TRANSLATION_18": "(But those who disbelieve, and deny our revelations), the scripture and the Emissary, (such are rightful owners of the Fire), the dwellers of hell. (They will abide therein forever), they will remain perpetually in hell: never to die or be released from it.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:39",
            "7:36",
            "64:10",
            "5:10",
            "5:86",
            "22:51",
            "90:19",
            "2:82",
            "2:81",
            "3:116"
        ],
        "BIBLE": [
            "torah:numbers:33:55",
            "prophets:isaiah:33:24",
            "prophets:ezekiel:12:19",
            "prophets:jeremiah:49:33",
            "prophets:ezekiel:20:41",
            "writings:ii%20chronicles:6:18",
            "torah:numbers:14:11",
            "prophets:jeremiah:50:39",
            "prophets:zechariah:8:8",
            "prophets:ezekiel:37:23"
        ]
    }
}