{
    "VERSE": "2:40",
    "ARABIC": "يَٰبَنِىٓ إِسْرَٰٓءِيلَ ٱذْكُرُوا۟ نِعْمَتِىَ ٱلَّتِىٓ أَنْعَمْتُ عَلَيْكُمْ وَأَوْفُوا۟ بِعَهْدِىٓ أُوفِ بِعَهْدِكُمْ وَإِيَّٰىَ فَٱرْهَبُونِ",
    "ENGLISH": {
        "TRANSLATION_0": "Tribe of Israel! remember the blessing I conferred on you. Honour My contract and I will honour your contract. Have dread of Me alone.",
        "TRANSLATION_1": "O children of Israel, remember the favours I bestowed on you. So keep your pledge to Me, and I will mine to you, and be fearful of Me,\n",
        "TRANSLATION_2": "O children of Israel! Just recall to mind My favour wherewith I blessed you fulfil your covenant with Me and I shall fulfil My covenant with you, and fear Me alone.\n",
        "TRANSLATION_3": "Children of Israel, recall My favors which you enjoyed. Fulfill your covenant with Me and I shall fulfill Mine. Revere only Me.\n",
        "TRANSLATION_4": "O Descendants of Israel (Jacob)! Remember My favour which I bestowed upon you, and fulfil your covenant towards Me, I shall fulfil My covenant towards you; and fear Me alone.\n",
        "TRANSLATION_5": "O Children of Israel! Remember My favor which I bestowed upon you, and fulfill (your obligations to) My covenant (with you) so that I fulfill (My obligations to) your covenant (with Me), and fear none but Me.\n",
        "TRANSLATION_6": "O children of Israel! call to mind My favor which I bestowed on you and be faithful to (your) covenant with Me, I will fulfill (My) covenant with you; and of Me, Me alone, should you be afraid.\n",
        "TRANSLATION_7": "Children of Israel, remember My blessing wherewith I blessed you, and fulfil My covenant and I shall fulfil your covenant; and have awe of Me.\n",
        "TRANSLATION_8": "O Children of Israel! Remember My favour wherewith I favoured you, and fulfil your (part of the) covenant, I shall fulfil My (part of the) covenant, and fear Me.\n",
        "TRANSLATION_9": "Children of Israel, remember the favours I have bestowed upon you, and fulfil the covenant that you made with Me. I shall fulfil the covenant I made with you. Fear Me alone.\n",
        "TRANSLATION_10": "Children of Israel! remember My favour wherewith favoured you, and fulfil My covenant, and shall fulfil your covenant, and Me alone shall ye dread.\n",
        "TRANSLATION_11": "O Children of Israel, remember My blessing which I bestowed upon you, and fulfill My covenant that I may fulfill your covenant, and be in awe of Me [alone].\n",
        "TRANSLATION_12": "O Children of Israel! call to mind the (special) favour which I bestowed upon you, and fulfil your covenant with Me as I fulfil My Covenant with you, and fear none but Me.\n",
        "TRANSLATION_13": "O Children of Israel! Remember My Favour which I bestowed upon you, and fulfill (your obligations to) My Covenant (with you) so that I fulfill (My Obligations to) your covenant (with Me), and fear none but Me.\n",
        "TRANSLATION_14": "Children of Israel, remember My favor I have bestowed upon you. Fulfill My covenant, and I will fulfill your covenant with you. Me, you must fear.\n",
        "TRANSLATION_15": "O Children of Israel! Remember My blessings which I bestowed upon you, and fulfill your pledge to Me, and I will fulfill My pledge to you, and fear Me.\n",
        "TRANSLATION_16": "O Children of Israel, remember My favor which I have bestowed upon you and fulfill My covenant [upon you] that I will fulfill your covenant [from Me], and be afraid of [only] Me.\n",
        "TRANSLATION_17": "[2:40] O Children of Israel, sons of Jacob, remember My favour wherewith I favoured you, that is, your forefathers, saving them from Pharaoh, parting the sea, sending clouds as shelter and other instances, for which you should show gratitude by being obedient to Me; and fulfil My covenant, that which I took from you, that you believe in Muhammad (s), and I shall fulfil your covenant, that which I gave to you, that you shall be rewarded for this with Paradise; and be in awe of Me, fear Me and not anyone else when you have abandoned belief in him [the Prophet].\n",
        "TRANSLATION_18": "Allah then mentioned His blessings upon the Children of Israel, saying: (0 Children of Israel!) Children of Jacob, (Remember My favour), be thankful and grateful for my blessings (wherewith I favoured you), I favoured you with the Scripture and the emissary, escape from Pharaoh and from drowning as well as sending you honey and quails and other blessings, (and fulfil My covenant) fulfil my covenant regarding this Prophet (pbuh) (I shall fulfil your covenant), by admitting you to Paradise, (and fear Me) as regards the breaking of this covenant and do not fear anyone save Me.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:40",
            "2:122",
            "2:47",
            "26:133",
            "26:22",
            "43:16",
            "26:59",
            "70:32",
            "23:8",
            "33:9"
        ],
        "BIBLE": [
            "prophets:isaiah:44:21",
            "torah:numbers:6:27",
            "torah:exodus:6:5",
            "torah:deuteronomy:33:1",
            "prophets:zechariah:8:13",
            "prophets:isaiah:43:1",
            "prophets:jeremiah:30:10",
            "torah:numbers:25:13",
            "prophets:jeremiah:46:27",
            "torah:exodus:31:16"
        ]
    }
}