{
    "VERSE": "2:45",
    "ARABIC": "وَٱسْتَعِينُوا۟ بِٱلصَّبْرِ وَٱلصَّلَوٰةِ وَإِنَّهَا لَكَبِيرَةٌ إِلَّا عَلَى ٱلْخَٰشِعِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Seek help in steadfastness and salat. But that is a very hard thing, except for the humble:",
        "TRANSLATION_1": "Find strength in fortitude and prayer, which is heavy and exacting but for those who are humble and meek,\n",
        "TRANSLATION_2": "Seek help with the Salat and fortitude: no doubt, Salat is a hard task but not for those obedient servants,\n",
        "TRANSLATION_3": "Help yourselves (in your affairs) with patience and prayer. It is a difficult task indeed, but not for the humble ones\n",
        "TRANSLATION_4": "And seek help in patience and prayer; and truly it is hard except for those who prostrate before Me with sincerity.\n",
        "TRANSLATION_5": "And seek help in patience and As-Salat (the prayer) and truly, it is extremely heavy and hard except for Al-Khashi`in.\n",
        "TRANSLATION_6": "And seek assistance through patience and prayer, and most surely it is a hard thing except for the humble ones,\n",
        "TRANSLATION_7": "Seek you help in patience and prayer, for grievous it is, save to the humble\n",
        "TRANSLATION_8": "Seek help in patience and prayer; and truly it is hard save for the humble-minded,\n",
        "TRANSLATION_9": "Seek help with patience and prayer; this is indeed an exacting discipline, but not to the humble,\n",
        "TRANSLATION_10": "And seek help in patience and prayer and verily it is, hard except prayer unto the meek.\n",
        "TRANSLATION_11": "And take recourse in patience and prayer, and it is indeed hard except for the humble\n",
        "TRANSLATION_12": "Nay, seek (Allah's) help with patient perseverance and prayer: It is indeed hard, except to those who bring a lowly spirit,-\n",
        "TRANSLATION_13": "And seek help in patience and As-Salat (the prayer) and truly it is extremely heavy and hard except for Al-Khashi'un [i.e. the true believers in Allah - those who obey Allah with full submission, fear much from His Punishment, and believe in His Promise (Paradise, etc.) and in His Warnings (Hell, etc.)].\n",
        "TRANSLATION_14": "And seek help in patience and prayer. For it is heavy, except to the humble,\n",
        "TRANSLATION_15": "And seek help through patience and prayer. But it is difficult, except for the devout.\n",
        "TRANSLATION_16": "And seek help through patience and prayer, and indeed, it is difficult except for the humbly submissive [to Allah]\n",
        "TRANSLATION_17": "[2:45] Seek help, ask for assistance in your affairs, in patience, by restraining the soul in the face of that which it dislikes; and prayer. The singling out of this for mention is a way of emphasising its great importance; in one hadīth, [it is stated], ‘When something bothered the Prophet (s), he would immediately resort to prayer’; it is said that the address here is to the Jews: when greed and desire for leadership became impediments to their faith, they were enjoined to forbearance, which constituted fasting and prayer, since, the former stems from lust and the latter yields humility and negates pride. For it, prayer, is grievous, burdensome, except to the humble, those that are at peace in obedience,\n",
        "TRANSLATION_18": "(And seek help in patience and prayer) in performing the obligations prescribed by Allah and abstaining from transgression; (for truly it), the prayer (is hard) heavy (save for the humble-minded,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:45",
            "2:153",
            "6:72",
            "7:170",
            "29:45",
            "2:43",
            "30:31",
            "20:14",
            "2:3",
            "23:9"
        ],
        "BIBLE": [
            "torah:exodus:18:18",
            "prophets:ii%20kings:2:16",
            "writings:job:26:2",
            "writings:job:42:8",
            "writings:job:30:24",
            "prophets:jeremiah:45:5",
            "prophets:jeremiah:16:19",
            "prophets:i%20samuel:12:24",
            "prophets:zechariah:10:6",
            "writings:ii%20chronicles:14:10"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:10",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:1:7"
        ]
    }
}