{
    "VERSE": "2:47",
    "ARABIC": "يَٰبَنِىٓ إِسْرَٰٓءِيلَ ٱذْكُرُوا۟ نِعْمَتِىَ ٱلَّتِىٓ أَنْعَمْتُ عَلَيْكُمْ وَأَنِّى فَضَّلْتُكُمْ عَلَى ٱلْعَٰلَمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Tribe of Israel! remember the blessing I conferred on you and that I preferred you over all other beings.",
        "TRANSLATION_1": "Remember, O children of Israel, the favours I bestowed on you, and made you exalted among the nations of the world.\n",
        "TRANSLATION_2": "O Children of Israel! Just recall to mind My favour that bestowed upon you, and remember that I exalted you above all the peoples of the world.\n",
        "TRANSLATION_3": "Children of Israel, recall My favors to you and the preference that I gave to you over all nations.\n",
        "TRANSLATION_4": "O Descendants of Israel! Remember the favour of Mine, which I bestowed upon you and gave you superiority over others of your time. (by sending the Noble Messengers to your nation)\n",
        "TRANSLATION_5": "O Children of Israel! Remember My favor which I bestowed upon you and that I preferred you over the `Alamin (nations)\n",
        "TRANSLATION_6": "O children of Israel! call to mind My favor which I bestowed on you and that I made you excel the nations.\n",
        "TRANSLATION_7": "Children of Israel, remember My blessing wherewith I blessed you, and that I have preferred you above all beings;\n",
        "TRANSLATION_8": "O Children of Israel! Remember My favour wherewith I favoured you and how I preferred you to (all) creatures.\n",
        "TRANSLATION_9": "Children of Israel, remember My blessing which I have bestowed on you, and how I favoured you above all other people.\n",
        "TRANSLATION_10": "O Children of Israel: remember My favour wherewith I favoured you, and that verily I preferred you over the world.\n",
        "TRANSLATION_11": "O Children of Israel, remember My blessing which I bestowed upon you, and that I gave you an advantage over all the nations.\n",
        "TRANSLATION_12": "Children of Israel! call to mind the (special) favour which I bestowed upon you, and that I preferred you to all other (for My Message).\n",
        "TRANSLATION_13": "O Children of Israel! Remember My Favour which I bestowed upon you and that I preferred you to the 'Alamin (mankind and jinns) (of your time period, in the past).\n",
        "TRANSLATION_14": "Children of Israel, remember the favors I have bestowed on you, and that I have preferred you (the prophets among you) above the worlds.\n",
        "TRANSLATION_15": "O Children of Israel! Remember My favor which I bestowed upon you, and I that favored you over all nations.\n",
        "TRANSLATION_16": "O Children of Israel, remember My favor that I have bestowed upon you and that I preferred you over the worlds.\n",
        "TRANSLATION_17": "[2:47] O Children of Israel, remember My favour wherewith I favoured you, by giving thanks through obedience to Me, and that I have preferred you, your forefathers, above all the worlds, of their time;\n",
        "TRANSLATION_18": "Then He also mentioned His blessings upon the Children of Israel, saying: (0 Children of Israel!), Children of Jacob! (Remember My favour), recollect my blessings (wherewith I favoured you) with the scripture, the Messenger and Islam (and how I preferred you to the worlds) sought you in preference to the other peoples of your time.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:47",
            "2:122",
            "2:40",
            "26:22",
            "26:133",
            "23:51",
            "43:16",
            "7:104",
            "45:16",
            "5:7"
        ],
        "BIBLE": [
            "torah:deuteronomy:32:8",
            "torah:numbers:20:24",
            "writings:psalms:135:12",
            "torah:deuteronomy:3:18",
            "writings:psalms:111:6",
            "prophets:jeremiah:35:15",
            "writings:ii%20chronicles:35:7",
            "prophets:ezekiel:28:25",
            "prophets:joshua:19:49",
            "torah:deuteronomy:2:12"
        ]
    }
}