{
    "VERSE": "2:49",
    "ARABIC": "وَإِذْ نَجَّيْنَٰكُم مِّنْ ءَالِ فِرْعَوْنَ يَسُومُونَكُمْ سُوٓءَ ٱلْعَذَابِ يُذَبِّحُونَ أَبْنَآءَكُمْ وَيَسْتَحْيُونَ نِسَآءَكُمْ وَفِى ذَٰلِكُم بَلَآءٌ مِّن رَّبِّكُمْ عَظِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "Remember when We rescued you from the people of Pharaoh. They were inflicting an evil punishment on you - slaughtering your sons and letting your women live. In that there was a terrible trial for you from your Lord.",
        "TRANSLATION_1": "Remember, We saved you from the Pharaoh's people who wronged and oppressed you and slew your sons but spared your women: In this was a great favour from your Lord.\n",
        "TRANSLATION_2": "Recall the time when We delivered you from the slavery of Pharaoh's people. They had inflicted a dreadful torment on you: they killed your sons and let your daughters live. And in this there was a hard trial for you from your your Lord.\n",
        "TRANSLATION_3": "(Children of Israel, recall My favor) of saving you from the Pharaoh's people who afflicted you with the worst kind of cruelty, slaying your sons and sparing your women. Your suffering was indeed a great trial from your Lord.\n",
        "TRANSLATION_4": "(And remember) When We rescued you from Firaun’s people, for they were inflicting you with a dreadful torment, slaying your sons and sparing your daughters; that was a tremendous trial from your Lord (or a great reward).\n",
        "TRANSLATION_5": "And (remember) when We delivered you from Fir`awn's (Pharaoh) people, who were afflicting you with a horrible torment, killing your sons and sparing your women, and therein was a mighty trial from your Lord.\n",
        "TRANSLATION_6": "And when We delivered you from Firon's people, who subjected you to severe torment, killing your sons and sparing your women, and in this there was a great trial from your Lord.\n",
        "TRANSLATION_7": "And when We delivered you from the folk of Pharaoh who were visiting you with evil chastisement, slaughtering your sons, and sparing your women; and in that was a grievous trial from your Lord.\n",
        "TRANSLATION_8": "And (remember) when We did deliver you from Pharaoh's folk, who were afflicting you with dreadful torment, slaying your sons and sparing your women: that was a tremendous trial from your Lord.\n",
        "TRANSLATION_9": "Remember when We delivered you from Pharaoh's people, who subjected you to grievous torment, slaying your sons and sparing only your daughters,  surely in that there was a great trial for you from your Lord,\n",
        "TRANSLATION_10": "And recall what time We delivered you from the house of Fir'awn imposing upon you evil torment, slaughtering your sons and letting your women live; and therein was a trial, from your Lord, Mighty.\n",
        "TRANSLATION_11": "[Remember] when We delivered you from Pharaoh’s clan who inflicted a terrible torment on you, and slaughtered your sons and spared your women, and in that there was a great test from your Lord.\n",
        "TRANSLATION_12": "And remember, We delivered you from the people of Pharaoh: They set you hard tasks and punishments, slaughtered your sons and let your women-folk live; therein was a tremendous trial from your Lord.\n",
        "TRANSLATION_13": "And (remember) when We delivered you from Fir'aun's (Pharaoh) people, who were afflicting you with a horrible torment, killing your sons and sparing your women, and therein was a mighty trial from your Lord.\n",
        "TRANSLATION_14": "(Remember) how We saved you from Pharaoh's people who had oppressed you cruelly, slaying your sons and sparing your women. Surely, that was a great trial from your Lord.\n",
        "TRANSLATION_15": "And recall that We delivered you from the people of Pharaoh. They inflicted on you terrible persecution, killing your sons and sparing your women. Therein was a tremendous trial from your Lord.\n",
        "TRANSLATION_16": "And [recall] when We saved your forefathers from the people of Pharaoh, who afflicted you with the worst torment, slaughtering your [newborn] sons and keeping your females alive. And in that was a great trial from your Lord.\n",
        "TRANSLATION_17": "[2:49] And, remember, when We delivered you, your forefathers: the address here and henceforth directed to those living at the time of the our Prophet, is about how God blessed their forefathers, and is intended to remind them of God’s grace so that they might believe; from the folk of Pharaoh who were visiting you with, that is, making you taste, evil chastisement, of the worst kind (the sentence here is a circumstantial qualifier referring to the person of the pronoun [suffixed] in najjaynākum, ‘We delivered you’); slaughtering your, newly-born, sons: this is explaining what has just been said; and sparing, retaining, your women, [doing so] because of the saying of some of their priests that a child born among the Israelites shall bring about the end of your rule [Pharaoh]; and for you therein, chastisement or deliverance, was a tremendous trial, a test or a grace, from your Lord.\n",
        "TRANSLATION_18": "(And (remember) when We did deliver you from Pharaoh's folk), from Pharaoh and his people, (who were afflicting you with dreadful torment), and here Allah mentions the torment He sent on them: (slaying your sons) in their tender years (and sparing), using (your women) who were of age: (That was a tremendous trial from your Lord), a tremendous calamity from your Lord; and it is also said this means: a tremendous blessing.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:141",
            "2:49",
            "14:6",
            "40:45",
            "26:156",
            "7:165",
            "3:105",
            "17:40",
            "44:30",
            "24:23"
        ],
        "BIBLE": [
            "prophets:ii%20kings:21:7",
            "prophets:habakkuk:2:9",
            "prophets:jeremiah:7:30",
            "writings:daniel:12:1",
            "torah:numbers:2:34",
            "prophets:ezekiel:16:21",
            "writings:nehemiah:4:8",
            "prophets:i%20samuel:9:24",
            "prophets:ii%20kings:12:10",
            "torah:numbers:17:6"
        ]
    }
}