{
    "VERSE": "2:50",
    "ARABIC": "وَإِذْ فَرَقْنَا بِكُمُ ٱلْبَحْرَ فَأَنجَيْنَٰكُمْ وَأَغْرَقْنَآ ءَالَ فِرْعَوْنَ وَأَنتُمْ تَنظُرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "And when We parted the sea for you and rescued you, and drowned the people of Pharaoh while you watched.",
        "TRANSLATION_1": "Remember, We parted the sea and saved you, and drowned the men of Pharaoh before your very eyes.\n",
        "TRANSLATION_2": "Remember the time when We parted the sea to make way for you and let you pass safely through it and then drowned Pharaoh's people before your very eyes.\n",
        "TRANSLATION_3": "We parted the sea to save you and drowned Pharaoh's people before your very eyes.\n",
        "TRANSLATION_4": "And when We split the sea for you thereby rescuing you, and drowned the Firaun's people in front of your eyes.\n",
        "TRANSLATION_5": "And (remember) when We separated the sea for you and saved you and drowned Fir`awn's (Pharaoh) people while you were watching.\n",
        "TRANSLATION_6": "And when We parted the sea for you, so We saved you and drowned the followers of Firon and you watched by.\n",
        "TRANSLATION_7": "And when We divided for you the sea and delivered you, and drowned Pharaoh's folk while you were beholding.\n",
        "TRANSLATION_8": "And when We brought you through the sea and rescued you, and drowned the folk of Pharaoh in your sight.\n",
        "TRANSLATION_9": "and when We divided the sea for you and saved you and drowned Pharaoh's people, while you looked on.\n",
        "TRANSLATION_10": "And recall what time We separated the sea for you and delivered you and drowned Fir'awn's house while ye looked on.\n",
        "TRANSLATION_11": "And when We parted the sea with you, and We delivered you and drowned Pharaoh’s clan as you looked on.\n",
        "TRANSLATION_12": "And remember We divided the sea for you and saved you and drowned Pharaoh's people within your very sight.\n",
        "TRANSLATION_13": "And (remember) when We separated the sea for you and saved you and drowned Fir'aun's (Pharaoh) people while you were looking (at them, when the sea-water covered them).\n",
        "TRANSLATION_14": "We parted the sea for you, and, taking you to safety, drowned the family of Pharaoh before your eyes.\n",
        "TRANSLATION_15": "And recall that We parted the sea for you, so We saved you, and We drowned the people of Pharaoh as you looked on.\n",
        "TRANSLATION_16": "And [recall] when We parted the sea for you and saved you and drowned the people of Pharaoh while you were looking on.\n",
        "TRANSLATION_17": "[2:50] And, remember, when We divided, split in two, for you, on account of you, the sea, such that you were able to cross it and escape from your enemy; and We delivered you, from drowning, and drowned Pharaoh’s folk, his people with him, while you were beholding the sea crashing down on top of them.\n",
        "TRANSLATION_18": "Then Allah mentioned the favour of saving them from drowning and the drowning of Pharaoh and his folk, saying (And when We brought you through) split (the sea and rescued you) from drowning,(and drowned the folk of Pharaoh) and his folk (in your sight) while you were looking at them, three days later.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:50",
            "81:6",
            "82:3",
            "52:6",
            "15:61",
            "39:12",
            "55:19",
            "54:34",
            "43:6",
            "54:41"
        ],
        "BIBLE": [
            "prophets:i%20kings:17:23",
            "prophets:ii%20kings:5:24",
            "prophets:jeremiah:43:9",
            "prophets:joshua:7:17",
            "torah:genesis:24:65",
            "prophets:ezekiel:16:8",
            "torah:deuteronomy:20:7",
            "prophets:ezekiel:17:12",
            "prophets:ii%20kings:19:1",
            "prophets:isaiah:37:1"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:8"
        ]
    }
}