{
    "VERSE": "2:56",
    "ARABIC": "ثُمَّ بَعَثْنَٰكُم مِّنۢ بَعْدِ مَوْتِكُمْ لَعَلَّكُمْ تَشْكُرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Then We brought you back to life after your death, so that perhaps you would show thanks.",
        "TRANSLATION_1": "Even then We revived you after you had become senseless that you might give thanks;\n",
        "TRANSLATION_2": "Then We raised you to life so that you might become grateful for this favour.\n",
        "TRANSLATION_3": "Then We brought you back to life in the hope that you might appreciate Our favors.\n",
        "TRANSLATION_4": "Then We brought you back to life after your death, so that you may be grateful.\n",
        "TRANSLATION_5": "Then We raised you up after your death, so that you might be grateful.\n",
        "TRANSLATION_6": "Then We raised you up after your death that you may give thanks.\n",
        "TRANSLATION_7": "Then We raised you up after you were dead, that haply you should be thankful.\n",
        "TRANSLATION_8": "Then We revived you after your extinction, that ye might give thanks.\n",
        "TRANSLATION_9": "Then We brought you back to life after your death, so that you might be grateful.\n",
        "TRANSLATION_10": "Then We raised you after your death that haply ye may return thanks.\n",
        "TRANSLATION_11": "Then We raised you up after your death so that you might give thanks.\n",
        "TRANSLATION_12": "Then We raised you up after your death: Ye had the chance to be grateful.\n",
        "TRANSLATION_13": "Then We raised you up after your death, so that you might be grateful.\n",
        "TRANSLATION_14": "Then We raised you from your death, so that you might give thanks.\n",
        "TRANSLATION_15": "Then We revived you after your death, so that you may be appreciative.\n",
        "TRANSLATION_16": "Then We revived you after your death that perhaps you would be grateful.\n",
        "TRANSLATION_17": "[2:56] Then We raised you up, brought you back to life, after you were dead, so that you might be thankful, for this favour of Ours.\n",
        "TRANSLATION_18": "(Then We revived you) We brought you back to life (after your death) after burning you, (that ye might give thanks) that you might give thanks that I brought you back to life.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:56",
            "2:52",
            "23:15",
            "26:120",
            "30:19",
            "57:17",
            "8:6",
            "56:60",
            "2:73",
            "9:66"
        ],
        "BIBLE": [
            "prophets:hosea:6:2",
            "writings:psalms:41:11",
            "prophets:judges:16:30",
            "writings:job:10:21",
            "prophets:jeremiah:29:15",
            "writings:proverbs:14:32",
            "prophets:micah:5:2",
            "prophets:ezekiel:7:13",
            "prophets:joshua:5:7",
            "writings:job:10:12"
        ]
    }
}