{
    "VERSE": "2:58",
    "ARABIC": "وَإِذْ قُلْنَا ٱدْخُلُوا۟ هَٰذِهِ ٱلْقَرْيَةَ فَكُلُوا۟ مِنْهَا حَيْثُ شِئْتُمْ رَغَدًا وَٱدْخُلُوا۟ ٱلْبَابَ سُجَّدًا وَقُولُوا۟ حِطَّةٌ نَّغْفِرْ لَكُمْ خَطَٰيَٰكُمْ وَسَنَزِيدُ ٱلْمُحْسِنِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Remember when We said, 'Go into this town, and eat from it wherever you like, freely. Enter the gate prostrating and say, \"Relieve us of our burdens!\" Your mistakes will be forgiven. We will grant increase to all good-doers.'",
        "TRANSLATION_1": "And remember, We said to you: \"Enter this city, eat wherever you like, as much as you please, but pass through the gates in humility and say: 'May our sins be forgiven.' We shall forgive your trespasses and give those who do good abundance.\n",
        "TRANSLATION_2": "Then call to mind the time when We said, \"Go into the town' before you and eat to your hearts' content therein, wherefrom you will, but enter the gate bowing down with humility, repeating 'hittatun'; We will forgive your sins and increase the reward of the righteous\".\n",
        "TRANSLATION_3": "(Children of Israel, recall My favors) when We told you, \"Enter this city, enjoy eating whatever you want therein, prostrate yourselves and ask forgiveness when passing through the gate, and We shall forgive your sins, and add to the rewards of the righteous ones\".\n",
        "TRANSLATION_4": "And when We said, “Enter this town and eat freely from what is in it, and enter the gate whilst prostrating, and say, ‘May our sins be forgiven’ – We will forgive you your sins; and We will soon increase the reward for the righteous.”\n",
        "TRANSLATION_5": "And (remember) when We said: \"Enter this town (Jerusalem) and eat bountifully therein with pleasure and delight wherever you wish, and enter the gate in prostration (or bowing with humility) and say: `Forgive us,' and We shall forgive you your sins and shall increase (reward) for the good-doers.\"\n",
        "TRANSLATION_6": "And when We said: Enter this city, then eat from it a plenteous (food) wherever you wish, and enter the gate making obeisance, and say, forgiveness. We will forgive you your wrongs and give more to those who do good (to others).\n",
        "TRANSLATION_7": "And when We said, 'Enter this township, and eat easefully of it wherever you will, and enter in at the gate, prostrating, and say, Unburdening; We will forgive you your transgressions, and increase the good-doers.'\n",
        "TRANSLATION_8": "And when We said: Go into this township and eat freely of that which is therein, and enter the gate prostrate, and say: \"Repentance.\" We will forgive you your sins and will increase (reward) for the right-doers.\n",
        "TRANSLATION_9": "Remember when We said, \"Enter this land and eat freely wherever you will. Make your way through the gates, bowing down and saying, \"God! Forgive us our sins.\" We shall forgive you your sins and We shall give abundance to those who do good.\"\n",
        "TRANSLATION_10": "And recall what time We said: enter this town and eat plenteously therefrom as ye list, and enter the gate prostrating yourselves and say: forgiveness; We shall forgive you your trespasses, and anon We shall increase unto the well-doers.\n",
        "TRANSLATION_11": "And when We said, ‘Enter this town, and eat thereof freely whencesoever you wish, and enter while prostrating at the gate, and say, ‘‘Relieve [us of the burden of our sins],’’ so that We may forgive your iniquities and We will soon enhance the virtuous.’\n",
        "TRANSLATION_12": "And remember We said: \"Enter this town, and eat of the plenty therein as ye wish; but enter the gate with humility, in posture and in words, and We shall forgive you your faults and increase (the portion of) those who do good.\"\n",
        "TRANSLATION_13": "And (remember) when We said: \"Enter this town (Jerusalem) and eat bountifully therein with pleasure and delight wherever you wish, and enter the gate in prostration (or bowing with humility) and say: 'Forgive us,' and We shall forgive you your sins and shall increase (reward) for the good-doers.\"\n",
        "TRANSLATION_14": "Enter this village' We said, 'and eat wherever you will and as much as you wish. Make your way prostrating through the gates, saying: \"Unburdening.\" We shall forgive you your sins and We will increase the gooddoers'\n",
        "TRANSLATION_15": "And recall that We said, “Enter this town, and eat plentifully from it whatever you wish; but enter the gate humbly, and say, 'Pardon.' We will forgive your sins, and give increase to the virtuous.”\n",
        "TRANSLATION_16": "And [recall] when We said, \"Enter this city and eat from it wherever you will in [ease and] abundance, and enter the gate bowing humbly and say, 'Relieve us of our burdens.' We will [then] forgive your sins for you, and We will increase the doers of good [in goodness and reward].\"\n",
        "TRANSLATION_17": "[2:58] And when We said, to them, after they came out of the wilderness, ‘Enter this city, either the Holy House [of Jerusalem] (Bayt al-Maqdis) or Jericho (Arīhā), and eat freely therein wherever you will, plentifully and without any restrictions, and enter it at the gate, its gate, prostrating, bowing, and say, ‘our request is for [an] exoneration’, that is, ‘That we be exonerated from our transgressions’, and We shall forgive (naghfir: a variant reading has one of the two passive forms yughfar or tughfar, ‘[they] will be forgiven’) you your transgressions and We shall give more to those who are virtuous’ — through obedience — in terms of reward.\n",
        "TRANSLATION_18": "(And when We said: Go into this township) the village of Jericho (Ariha) (and eat freely of that which is therein) whenever you will, (and enter the gate prostrate, and say: \"Repentance\".) i.e. say: \"forgive our sins\"; as it is also said that this means: say: \"there is no god save Allah\"; (We will forgive your sins and increase for the right-doers) increase their good deeds.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:58",
            "7:161",
            "2:35",
            "36:13",
            "17:16",
            "68:44",
            "4:91",
            "21:11",
            "11:100",
            "40:76"
        ],
        "BIBLE": [
            "writings:daniel:2:9",
            "prophets:ezekiel:12:23",
            "torah:deuteronomy:4:10",
            "writings:nehemiah:8:12",
            "torah:leviticus:16:16",
            "writings:psalms:32:5",
            "writings:psalms:74:8",
            "writings:ii%20chronicles:14:6",
            "prophets:joshua:5:2",
            "writings:daniel:5:17"
        ]
    }
}