{
    "VERSE": "2:61",
    "ARABIC": "وَإِذْ قُلْتُمْ يَٰمُوسَىٰ لَن نَّصْبِرَ عَلَىٰ طَعَامٍ وَٰحِدٍ فَٱدْعُ لَنَا رَبَّكَ يُخْرِجْ لَنَا مِمَّا تُنۢبِتُ ٱلْأَرْضُ مِنۢ بَقْلِهَا وَقِثَّآئِهَا وَفُومِهَا وَعَدَسِهَا وَبَصَلِهَا قَالَ أَتَسْتَبْدِلُونَ ٱلَّذِى هُوَ أَدْنَىٰ بِٱلَّذِى هُوَ خَيْرٌ ٱهْبِطُوا۟ مِصْرًا فَإِنَّ لَكُم مَّا سَأَلْتُمْ وَضُرِبَتْ عَلَيْهِمُ ٱلذِّلَّةُ وَٱلْمَسْكَنَةُ وَبَآءُو بِغَضَبٍ مِّنَ ٱللَّهِ ذَٰلِكَ بِأَنَّهُمْ كَانُوا۟ يَكْفُرُونَ بِـَٔايَٰتِ ٱللَّهِ وَيَقْتُلُونَ ٱلنَّبِيِّۦنَ بِغَيْرِ ٱلْحَقِّ ذَٰلِكَ بِمَا عَصَوا۟ وَّكَانُوا۟ يَعْتَدُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "And when you said, 'Musa, we will not put up with just one kind of food so ask your Lord to supply to us some of what the earth produces - its green vegetables, cucumbers, grains, lentils and onions,' he said, 'Do you want to replace what is better with what is inferior? Go back to Egypt, then you will have what you are asking for.' Abasement and destitution were stamped upon them. They brought down anger from Allah upon themselves. That was because they rejected Allah's Signs and killed the Prophets without any right to do so. That was because they rebelled and went beyond the limits.",
        "TRANSLATION_1": "Remember, when you said: \"O Moses, we are tired of eating the same food (day after day), ask your Lord to give us fruits of the earth, herbs and cucumbers, grains and lentils and onions;\" he said: \"Would you rather exchange what is good with what is bad? Go then to the city, you shall have what you ask.\" So they were disgraced and became indigent, earning the anger of God, for they disbelieved the word of God, and slayed the prophets unjustly, for they transgressed and rebelled.\n",
        "TRANSLATION_2": "Remember: You grumbled: \"O Moses, we cannot endure one and the same sort of food. Pray your Lord to bring for us the products of the earth green herbs, vegetables, corn, garlic, onions, pulses and the like.\" Moses replied: \"What! would you exchange that which is meaner for that which is nobler? Well, go and live in a town and you will get there what you demand.\" By and by, they became so degraded that disgrace and humiliation, misery and wretchedness were stamped upon them and they incurred Allah's wrath. That was because they began to reject the Revelations of Allah and kill His Messengers without any just cause; that was the consequence of their disobedience and their persistent transgression against the Law.\n",
        "TRANSLATION_3": "When you demanded Moses to provide you with a variety of food, saying, \"We no longer have patience with only one kind of food, ask your Lord to grow green herbs, cucumbers, corn, lentils, and onions for us,\" Moses replied, \"Would you change what is good for what is worse? Go to any town and you will get what you want.\" Despised and afflicted with destitution, they brought the wrath of God back upon themselves, for they denied the evidence (of the existence of God) and murdered His Prophets without reason; they were disobedient transgressors.\n",
        "TRANSLATION_4": "And when you said, “O Moosa! We shall never put up with only one kind of food, so call upon your Lord to produce for us what the earth grows – some herbs, cucumbers, corn, lentils and onions”; he said, “What! You wish to exchange the better for something inferior? Therefore settle down in Egypt or any city, where you will get what you demand”; and disgrace and misery were destined for them; and they returned towards Allah’s wrath; that was because they disbelieved in Allah’s signs and wrongfully martyred the Prophets; that was for their disobedience and transgression.\n",
        "TRANSLATION_5": "And (remember) when you said, \"O Musa! We cannot endure one kind of food. So invoke your Lord for us to bring forth for us of what the earth grows, its herbs, its cucumber its Fum, its lentils and its onions.\" He said, \"Would you exchange that which is better for that which is lower Go you down to any town and you shall find what you want!\" And they were covered with humiliation and misery, and they drew on themselves the wrath of Allah. That was because they used to disbelieve in the Ayat (proofs, evidence) of Allah and killed the Prophets wrongfully. That was because they disobeyed and used to transgress the bounds (in their disobedience to Allah, i.e. commit crimes and sins.)\n",
        "TRANSLATION_6": "And when you said: O Musa! we cannot bear with one food, therefore pray Lord on our behalf to bring forth for us out of what the earth grows, of its herbs and its cucumbers and its garlic and its lentils and its onions. He said: Will you exchange that which is better for that which is worse? Enter a city, so you will have what you ask for. And abasement and humiliation were brought down upon them, and they became deserving of Allah's wrath; this was so because they disbelieved in the communications of Allah and killed the prophets unjustly; this was so because they disobeyed and exceeded the limits.\n",
        "TRANSLATION_7": "And when you said, 'Moses, we will not endure one sort of food; pray to thy Lord for us, that He may bring forth for us of that the earth produces - green herbs, cucumbers, corn, lentils, onions.' He said, 'Would you have in exchange what is meaner for what is better? Get you down to Egypt; you shall have there that you demanded.' And abasement and poverty were pitched upon them, and they were laden with the burden of God's anger; that, because they had disbelieved the signs of God and slain the Prophets unrightfully; that, because they disobeyed, and were transgressors.\n",
        "TRANSLATION_8": "And when ye said: O Moses! We are weary of one kind of food; so call upon thy Lord for us that He bring forth for us of that which the earth groweth - of its herbs and its cucumbers and its corn and its lentils and its onions. He said: Would ye exchange that which is higher for that which is lower? Go down to settled country, thus ye shall get that which ye demand. And humiliation and wretchedness were stamped upon them and they were visited with wrath from Allah. That was because they disbelieved in Allah's revelations and slew the prophets wrongfully. That was for their disobedience and transgression.\n",
        "TRANSLATION_9": "When you said, \"Moses, we cannot bear to eat only one kind of food, so pray to your Lord to bring forth for us some of the earth's produce, its herbs and cucumbers, its garlic, lentils, and onions.\" Moses said, \"Would you take a lesser thing in exchange for what is better? Go to some town and there you will find all that you demand.\" Abasement and destitution were stamped upon them, and they incurred the wrath of God, for having rejected His signs, and they killed His prophets unjustly, because they were rebels and transgressors.\n",
        "TRANSLATION_10": "And recall what time ye said: O Musa! we shall by no means bear patiently with one food, wherefore supplicate for us unto thy Lord that He bring forth for us of that which the earth groweth, of its vegetables, and its cucumbers, and its Wheat, and its lentils, and its onions. He Said: would ye take in exchange that which is mean for that which is better! Get ye down into a City, as verily therein is for you that which ye ask for. And stuck upon them were abjection and poverty. And they drew on themselves indignation from Allah. This, because they were ever disbelieving in the signs of Allah and slaying the prophets without justice. This, because they disobeyed and were ever trespassing.\n",
        "TRANSLATION_11": "And when you said, ‘O Moses, ‘We will not put up with one kind of food. So invoke your Lord for us, so that He may bring forth for us of that which the earth grows—its greens and cucumbers, its garlic, lentils, and onions.’ He said, ‘Do you seek to replace what is superior with that which is inferior? Go down to any town and you will indeed get what you ask for!’ So they were struck with abasement and poverty, and they earned Allah’s wrath. That, because they would deny the signs of Allah and kill the prophets unjustly. That, because they would disobey and commit transgressions.\n",
        "TRANSLATION_12": "And remember ye said: \"O Moses! we cannot endure one kind of food (always); so beseech thy Lord for us to produce for us of what the earth groweth, -its pot-herbs, and cucumbers, Its garlic, lentils, and onions.\" He said: \"Will ye exchange the better for the worse? Go ye down to any town, and ye shall find what ye want!\" They were covered with humiliation and misery; they drew on themselves the wrath of Allah. This because they went on rejecting the Signs of Allah and slaying His Messengers without just cause. This because they rebelled and went on transgressing.\n",
        "TRANSLATION_13": "And (remember) when you said, \"O Musa (Moses)! We cannot endure one kind of food. So invoke your Lord for us to bring forth for us of what the earth grows, its herbs, its cucumbers, its Fum (wheat or garlic), its lentils and its onions.\" He said, \"Would you exchange that which is better for that which is lower? Go you down to any town and you shall find what you want!\" And they were covered with humiliation and misery, and they drew on themselves the Wrath of Allah. That was because they used to disbelieve the Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) of Allah and killed the Prophets wrongfully. That was because they disobeyed and used to transgress the bounds (in their disobedience to Allah, i.e. commit crimes and sins).\n",
        "TRANSLATION_14": "Moses' you said, 'we will no longer be patient with one type of food. Call on your Lord to bring forth for us some of the produce of the earth, green herbs and cucumbers, corn, lentils and onions' 'What' he answered, 'Would you exchange that which is lesser for what is better? Go down into Egypt, there you shall find all that you have asked' Humiliation and abasement were pitched upon them, and they incurred the Anger of Allah; because they disbelieved His signs and slew His Prophets unjustly; because they disobeyed and were transgressors.\n",
        "TRANSLATION_15": "And recall when you said, “O Moses, we cannot endure one kind of food, so call to your Lord to produce for us of what the earth grows: of its herbs, and its cucumbers, and its garlic, and its lentils, and its onions.” He said, “Would you substitute worse for better? Go down to Egypt, where you will have what you asked for.” They were struck with humiliation and poverty, and incurred wrath from God. That was because they rejected God’s revelations and wrongfully killed the prophets. That was because they disobeyed and transgressed.\n",
        "TRANSLATION_16": "And [recall] when you said, \"O Moses, we can never endure one [kind of] food. So call upon your Lord to bring forth for us from the earth its green herbs and its cucumbers and its garlic and its lentils and its onions.\" [Moses] said, \"Would you exchange what is better for what is less? Go into [any] settlement and indeed, you will have what you have asked.\" And they were covered with humiliation and poverty and returned with anger from Allah [upon them]. That was because they [repeatedly] disbelieved in the signs of Allah and killed the prophets without right. That was because they disobeyed and were [habitually] transgressing.\n",
        "TRANSLATION_17": "[2:61]   And when you said, ‘Moses, we will not endure one sort of food, that is to say, manna and quails; pray to your Lord for us, that He may bring forth for us, something, of (min here is explicative) what the earth produces — green herbs, cucumbers, garlic, lentils, onions’, he, Moses, said, to them, ‘Would you exchange what is better, more noble, that is, do you substitute this, with what is lowlier?’ (the hamza of a-tastabdilūna is for rebuke); they thus refused to change their mind and he [Moses] supplicated to God, and He, exalted be He, said, ‘Go down to a city, whichever city it may be; you shall have, there, what you demanded’ of vegetable produce; And abasement, submissiveness, and wretchedness, that is, the signs of poverty on account of their submissiveness and debasement that always accompany them, even if they be rich, in the same way that a coin never changes its mint; were cast upon them, and they incurred, ended up with God’s wrath; that, that is, that affliction and wrath, was because they used to disbelieve the signs of God and slay prophets, such as Zachariah and John, without right, that is, unjustly; that was because they disobeyed, and they were transgressors, overstepping the bounds in disobedience (here the repetition [dhālik bi-mā ‘asaw wa-kānū ya‘tadūn] is for emphasis).\n",
        "TRANSLATION_18": "(And when you said: Moses! We will not endure one kind of food) we will not endure eating just honey and quails; (so pray unto your Lord) ask your Lord (for us that He bring forth for us of that which the earth groweth of its herbs and its cucumbers and its corn and its lentils and its onions. He) i.e. Moses (said: Would you exchange that which is higher) i.e. that which is better and more honourable: honey and quails (for that which is lower) that which is much worse: lentils and onions? (Go down to any city) where you came from; and it is also said that this means any city, (thus you shall get that which you demand) what you have requested is to be found there. (And humiliation) the capitation tax (and wretchedness) the attire of poverty (were stamped upon them) were imposed on them (and they were visited with wrath from Allah) as they deserved to be forsaken by Allah. (That) being forsaken by Allah and visited by humiliation and wretchedness (was because they disbelieved in Allah's revelations) they disbelieved in Muhammad (pbuh) and in the Qur'an (and slew the prophets wrongfully) without any right and for no crime whatsoever. (That) Allah's wrath (was for their disobedience) on the Sabbath (and transgression) slaying the prophets and declaring transgressions to be lawful.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:61",
            "3:112",
            "3:21",
            "4:170",
            "39:10",
            "11:61",
            "6:57",
            "41:15",
            "7:73",
            "47:3"
        ],
        "BIBLE": [
            "torah:deuteronomy:13:6",
            "prophets:joshua:4:18",
            "writings:esther:7:8",
            "torah:exodus:16:3",
            "torah:exodus:10:15",
            "writings:daniel:6:13",
            "torah:numbers:4:15",
            "prophets:jeremiah:42:4",
            "prophets:judges:19:9",
            "prophets:ii%20kings:8:9"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:8",
            
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:4:1"
        ]
    }
}