{
    "VERSE": "2:62",
    "ARABIC": "إِنَّ ٱلَّذِينَ ءَامَنُوا۟ وَٱلَّذِينَ هَادُوا۟ وَٱلنَّصَٰرَىٰ وَٱلصَّٰبِـِٔينَ مَنْ ءَامَنَ بِٱللَّهِ وَٱلْيَوْمِ ٱلْءَاخِرِ وَعَمِلَ صَٰلِحًا فَلَهُمْ أَجْرُهُمْ عِندَ رَبِّهِمْ وَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Those with iman, those who are Jews, and the Christians and Sabaeans, all who have iman in Allah and the Last Day and act rightly, will have their reward with their Lord. They will feel no fear and will know no sorrow.",
        "TRANSLATION_1": "Surely the believers and the Jews, Nazareans and the Sabians, whoever believes in God and the Last Day, and whosoever does right, shall have his reward with his Lord and will neither have fear nor regret.\n",
        "TRANSLATION_2": "Rest assured that whosoever from among the Muslims or the Jews or the Christians or the Sabaeans believes in Allah and the Last Day, and performs good deeds, he will have his reward with his Lord and he will have no cause for fear and grief.\n",
        "TRANSLATION_3": "However, those who have become believers (the Muslims), and the Jews, the Christians and the Sabaeans who believe in God and the Day of Judgment and strive righteously will receive their reward from the Lord and will have nothing to fear nor will they be grieved.\n",
        "TRANSLATION_4": "Indeed the believers (the Muslims) and those among the Jews, the Christians, and the Sabeans who sincerely accept faith in Allah and the Last Day* and do good deeds – their reward is with their Lord; and there shall be no fear upon them nor shall they grieve. (* i.e. convert to Islam)\n",
        "TRANSLATION_5": "Verily, those who believe and those who are Jews and Christians, and Sabians (Sabi'in), whoever believes in Allah and the Last Day and does righteous good deeds shall have their reward with their Lord, on them shall be no fear, nor shall they grieve.\n",
        "TRANSLATION_6": "Surely those who believe, and those who are Jews, and the Christians, and the Sabians, whoever believes in Allah and the Last day and does good, they shall have their reward from their Lord, and there is no fear for them, nor shall they grieve.\n",
        "TRANSLATION_7": "Surely they that believe, and those of Jewry, and the Christians, and those Sabaeans, whoso believes in God and the Last Day, and works righteousness -- their wage awaits them with their Lord, and no fear shall be on them; neither shall they sorrow.\n",
        "TRANSLATION_8": "Lo! Those who believe (in that which is revealed unto thee, Muhammad), and those who are Jews, and Christians, and Sabaeans - whoever believeth in Allah and the Last Day and doeth right - surely their reward is with their Lord, and there shall no fear come upon them neither shall they grieve.\n",
        "TRANSLATION_9": "The believers, the Jews, the Christians, and the Sabaeans, all those who believe in God and the Last Day and do good deeds, will be rewarded by their Lord; they shall have no fear, nor shall they grieve.\n",
        "TRANSLATION_10": "Verily those who believe, and those who are Judaised, and the Nazarenes, and the Sabians, - whosoever, believeth in Allah and the Last Day and worketh righteously, these! unto them shall be their hire with their Lord, no feal shall come on them nor shall they grieve.\n",
        "TRANSLATION_11": "Indeed the faithful, the Jews, the Christians and the Sabaeans—those of them who have faith in Allah and the Last Day and act righteously—they shall have their reward from their Lord, and they will have no fear, nor will they grieve.\n",
        "TRANSLATION_12": "Those who believe (in the Qur'an), and those who follow the Jewish (scriptures), and the Christians and the Sabians,- any who believe in Allah and the Last Day, and work righteousness, shall have their reward with their Lord; on them shall be no fear, nor shall they grieve.\n",
        "TRANSLATION_13": "Verily! Those who believe and those who are Jews and Christians, and Sabians, whoever believes in Allah and the Last Day and do righteous good deeds shall have their reward with their Lord, on them shall be no fear, nor shall they grieve.\n",
        "TRANSLATION_14": "Those who believe, Jews, Nazarenes and Sabaeans whoever believes in Allah and the Last Day and does good deeds shall be rewarded by their Lord; they have nothing to fear nor are they saddened.\n",
        "TRANSLATION_15": "Those who believe, and those who are Jewish, and the Christians, and the Sabeans—any who believe in God and the Last Day, and act righteously—will have their reward with their Lord; they have nothing to fear, nor will they grieve.\n",
        "TRANSLATION_16": "Indeed, those who believed and those who were Jews or Christians or Sabeans [before Prophet Muhammad] - those [among them] who believed in Allah and the Last Day and did righteousness - will have their reward with their Lord, and no fear will there be concerning them, nor will they grieve.\n",
        "TRANSLATION_17": "[2:62] Surely those who believe, [who believed] before, in the prophets, and those of Jewry, the Jews, and the Christians, and the Sabaeans, a Christian or Jewish sect, whoever, from among them, believes in God and the Last Day, in the time of our Prophet, and performs righteous deeds, according to the Law given to him — their wage, that is, the reward for their deeds, is with their Lord, and no fear shall befall them, neither shall they grieve (the [singular] person of the verbs āmana, ‘believes’, and ‘amila, ‘performs’, takes account of the [singular] form of man, ‘whoever’, but in what comes afterwards [of the plural pronouns] its [plural] meaning [is taken into account]).\n",
        "TRANSLATION_18": "Then Allah went on to mention the believers among them, saying: (Lo! Those who believe) in Moses and all 11 the other prophets, these earn their reward from their Lord in Paradise; they shall have no fear perpetually and they shall perpetually not grieve. It is said that this means that no fear will come upon them concerning torment in the future life nor will they grieve about anything they have left behind. And it is also said that this means: they shall have no fear when death is slain and hell is closed. Then He mentioned those who did not believe in Moses or the other prophets, saying: (and those who are Jews) who deviated from the religion of Moses, (and Christians) those who became Christians (and Sabaeans) a Christian sect whose members shave the middle of their heads, read the Gospel, worship the angels and say: \"our hearts have returned (saba'at) unto Allah\", (whoever believeth) from amongst them (in Allah and the Last Day and does right) in that which is between them and their Lord, (surely their reward is with their Lord, and there shall no fear come upon them neither shall they grieve).\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:62",
            "5:69",
            "2:112",
            "2:277",
            "2:262",
            "23:117",
            "2:274",
            "46:13",
            "22:47",
            "9:99"
        ],
        "BIBLE": [
            "torah:exodus:35:2",
            "torah:exodus:31:15",
            "torah:leviticus:23:3",
            "prophets:i%20samuel:15:11",
            "prophets:micah:3:11",
            "prophets:isaiah:57:12",
            "torah:deuteronomy:15:10",
            "writings:ezra:3:8",
            "prophets:joshua:14:9",
            "writings:nehemiah:6:16"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:2:5"
        ]
    }
}