{
    "VERSE": "2:67",
    "ARABIC": "وَإِذْ قَالَ مُوسَىٰ لِقَوْمِهِۦٓ إِنَّ ٱللَّهَ يَأْمُرُكُمْ أَن تَذْبَحُوا۟ بَقَرَةً قَالُوٓا۟ أَتَتَّخِذُنَا هُزُوًا قَالَ أَعُوذُ بِٱللَّهِ أَنْ أَكُونَ مِنَ ٱلْجَٰهِلِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "And when Musa said to his people, 'Allah commands you to sacrifice a cow,' they said, 'What! Are you",
        "TRANSLATION_1": "Remember, when Moses said to his people: \"God demands that you sacrifice a cow,\" they said: \"Are you making fun of us?\" And he said: \"God forbid that I be of the ignorant.\"\n",
        "TRANSLATION_2": "Then call to mind the other event: when Moses said to his people, \"Allah commands you to sacrifice a cow,\" they replied, \"Do you mean to have a jest with us?\" He answered, \"I crave Allah's protection from behaving like ignorant people.\"\n",
        "TRANSLATION_3": "When Moses said to his people, \"God commands you to sacrifice a cow,\" they asked, \"Are you mocking us?\" \"God forbid, how would I be so ignorant,\" said Moses.\n",
        "TRANSLATION_4": "And (remember) when Moosa said to his people, “Allah commands you to sacrifice a cow”; they said, “Are you making fun of us?” He answered, “Allah forbid that I should be of the ignorant!”\n",
        "TRANSLATION_5": "And (remember) when Musa said to his people: \"Verily, Allah commands you that you slaughter a cow.\" They said, \"Do you make fun of us\" He said, \"I take Allah's refuge from being among Al-Jahilin (the ignorant or the foolish).\"\n",
        "TRANSLATION_6": "And when Musa said to his people: Surely Allah commands you that you should sacrifice a cow; they said: Do you ridicule us? He said: I seek the protection of Allah from being one of the ignorant.\n",
        "TRANSLATION_7": "And when Moses said to his people, 'God commands you to sacrifice a cow.' They said, 'Dost thou take us in mockery?' He said, 'I take refuge with God, lest I should be one of the ignorant.'\n",
        "TRANSLATION_8": "And when Moses said unto his people: Lo! Allah commandeth you that ye sacrifice a cow, they said: Dost thou make game of us? He answered: Allah forbid that I should be among the foolish!\n",
        "TRANSLATION_9": "When Moses said to his people, \"God commands you to sacrifice a heifer,\" they said, \"Are you making a mockery of us?\" He answered, \"God forbid that I should be so ignorant!\"\n",
        "TRANSLATION_10": "And recall what time Musa said unto his people: verily Allah commandeth you that ye slaughter a cow. They said: makest thou a jest of us? He said take refuge with Allah that I should be of the ignorant.\n",
        "TRANSLATION_11": "And when Moses said to his people, ‘Allah commands you to slaughter a cow,’ they said, ‘Are you mocking us?’ He said, ‘I seek Allah’s protection lest I should be one of the ignorant!’\n",
        "TRANSLATION_12": "And remember Moses said to his people: \"Allah commands that ye sacrifice a heifer.\" They said: \"Makest thou a laughing-stock of us?\" He said: \"Allah save me from being an ignorant (fool)!\"\n",
        "TRANSLATION_13": "And (remember) when Musa (Moses) said to his people: \"Verily, Allah commands you that you slaughter a cow.\" They said, \"Do you make fun of us?\" He said, \"I take Allah's Refuge from being among Al-Jahilun (the ignorants or the foolish).\"\n",
        "TRANSLATION_14": "When Moses said to his nation: 'Allah commands you to slaughter a cow' they replied: 'Are you taking us in mockery' 'I seek protection with Allah lest I should be one of the ignorant' he said.\n",
        "TRANSLATION_15": "And recall when Moses said to his people, “God commands you to sacrifice a heifer.” They said, “Do you make a mockery of us?” He said, “God forbid that I should be so ignorant.”\n",
        "TRANSLATION_16": "And [recall] when Moses said to his people, \"Indeed, Allah commands you to slaughter a cow.\" They said, \"Do you take us in ridicule?\" He said, \"I seek refuge in Allah from being among the ignorant.\"\n",
        "TRANSLATION_17": "[2:67] And, mention, when Moses said to his people, when one among them was killed and the killer was not known, and so they asked Moses to pray to God to reveal the killer, which he did; ‘God commands you to sacrifice a cow’. They said, ‘Do you take us in mockery?’, that is, making fun of us when you answer us like this? He said, ‘I take refuge with, I seek defence with, God lest I should be one of the ignorant’, one of   those who indulge in mockery.\n",
        "TRANSLATION_18": "Allah then mentions the story of the cow, saying: (And when Moses said unto his people: Lo! Allah commandeth you that ye sacrifice a cow) any cow, (they said: Dost thou make game of us?) are you really mocking us? (He) Moses (answered: Allah forbid that I should be among the foolish!) God forbid that I ever mock the believers.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:67",
            "9:56",
            "7:128",
            "29:29",
            "7:138",
            "5:84",
            "28:76",
            "29:16",
            "10:84",
            "9:96"
        ],
        "BIBLE": [
            "prophets:i%20samuel:9:12",
            "torah:exodus:34:15",
            "prophets:ii%20kings:7:19",
            "prophets:i%20samuel:4:17",
            "torah:exodus:34:10",
            "prophets:joel:2:19",
            "prophets:ii%20kings:7:2",
            "writings:nehemiah:2:4",
            "prophets:i%20samuel:2:29",
            "prophets:i%20kings:19:2"
        ]
    }
}