{
    "VERSE": "2:7",
    "ARABIC": "خَتَمَ ٱللَّهُ عَلَىٰ قُلُوبِهِمْ وَعَلَىٰ سَمْعِهِمْ وَعَلَىٰٓ أَبْصَٰرِهِمْ غِشَٰوَةٌ وَلَهُمْ عَذَابٌ عَظِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "Allah has sealed up their hearts and hearing and over their eyes is a blindfold. They will have a terrible punishment.",
        "TRANSLATION_1": "God has sealed their hearts and ears, and veiled their eyes. For them is great deprivation.\n",
        "TRANSLATION_2": "Allah has sealed up their hearts and ears and a covering has fallen over their eyes, and they have incurred the severest punishment.\n",
        "TRANSLATION_3": "God has sealed their hearts and hearing and their vision is veiled; a great punishment awaits them.\n",
        "TRANSLATION_4": "Allah has sealed their hearts and their ears, and on their eyes is a covering; and for them is a terrible punishment.\n",
        "TRANSLATION_5": "Allah has set a seal on their hearts and on their hearing, and on their eyes there is a covering. Theirs will be a great torment.\n",
        "TRANSLATION_6": "Allah has set a seal upon their hearts and upon their hearing and there is a covering over their eyes, and there is a great punishment for them.\n",
        "TRANSLATION_7": "God has set a seal on their hearts and on their hearing, and on their eyes is a covering, and there awaits them a mighty chastisement.\n",
        "TRANSLATION_8": "Allah hath sealed their hearing and their hearts, and on their eyes there is a covering. Theirs will be an awful doom.\n",
        "TRANSLATION_9": "God has sealed their hearts and their ears, and over their eyes there is a covering. They will have a terrible punishment.\n",
        "TRANSLATION_10": "Allah hath set a seal upon their hearts and upon their hearing, and over their sights is a covering; and unto them shall be a torment mighty.\n",
        "TRANSLATION_11": "Allah has set a seal on their hearts and their hearing, and there is a blindfold on their sight, and there is a great punishment for them.\n",
        "TRANSLATION_12": "Allah hath set a seal on their hearts and on their hearing, and on their eyes is a veil; great is the penalty they (incur).\n",
        "TRANSLATION_13": "Allah has set a seal on their hearts and on their hearings, (i.e. they are closed from accepting Allah's Guidance), and on their eyes there is a covering. Theirs will be a great torment.\n",
        "TRANSLATION_14": "Allah has set a seal upon their hearts and ears; their sight is dimmed and for them is a great punishment.\n",
        "TRANSLATION_15": "God has set a seal on their hearts and on their hearing, and over their vision is a veil. They will have a severe torment.\n",
        "TRANSLATION_16": "Allah has set a seal upon their hearts and upon their hearing, and over their vision is a veil. And for them is a great punishment.\n",
        "TRANSLATION_17": "[2:7] God has set a seal on their hearts, impressing on them and making certain that no good enters them; and on their hearing, [in which He has] deposited something so that they cannot profit from the truth they hear; and on their eyes is a covering, that is, a veil so that they do not see the truth; and for them there will be a mighty chastisement, that is, intense and everlasting.\n",
        "TRANSLATION_18": "(Allah hath sealed their hearts), stamped their hearts, (and their hearing, and on their eyes there is a covering), on their eyes there is a shield (and theirs will be an awful doom) an awful torment in the Hereafter. This refers in particular to the Jews Ka'b Ibn al-Ashraf, Huyayy Ibn Akhtab and Judayy Ibn Akhtab. It is also said that it refers to the idolaters of Mecca 'Utbah [Ibn Rabi'ah], Shaybah [Ibn Rabi'ah] and al-Walid [Ibn al-Mughirah].\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:7",
            "16:108",
            "45:23",
            "2:10",
            "4:93",
            "16:106",
            "6:46",
            "52:27",
            "45:10",
            "2:20"
        ],
        "BIBLE": [
            "torah:numbers:4:8",
            "torah:numbers:4:11",
            "prophets:jeremiah:44:12",
            "prophets:ezekiel:40:4",
            "torah:numbers:24:4",
            "prophets:ezekiel:23:25",
            "writings:proverbs:10:8",
            "prophets:ezekiel:16:18",
            "writings:psalms:55:5",
            "prophets:isaiah:29:10"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:13",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:1:1"
        ]
    }
}