{
    "VERSE": "2:72",
    "ARABIC": "وَإِذْ قَتَلْتُمْ نَفْسًا فَٱدَّٰرَْٰٔتُمْ فِيهَا وَٱللَّهُ مُخْرِجٌ مَّا كُنتُمْ تَكْتُمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Remember when you killed someone and violently accused each other of it, and Allah brought out what you were hiding.",
        "TRANSLATION_1": "Remember when you killed a man and blamed each other for the deed, God brought to light what you concealed.\n",
        "TRANSLATION_2": "You should also recall to mind another incident: You slew a man and began to dispute about the murder and accuse one another of it, but Allah had decreed that what you were trying to hide should be disclosed.\n",
        "TRANSLATION_3": "When you murdered someone, each one of you tried to accuse others of being guilty. However, God made public what you were hiding.\n",
        "TRANSLATION_4": "And (remember) when you slew a man and were therefore accusing each other concerning it; and Allah wanted to expose what you were hiding.\n",
        "TRANSLATION_5": "And (remember) when you killed a man and disagreed among yourselves as to the crime. But Allah brought forth that which you were Taktumun.\n",
        "TRANSLATION_6": "And when you killed a man, then you disagreed with respect to that, and Allah was to bring forth that which you were going to hide.\n",
        "TRANSLATION_7": "And when you killed a living soul, and disputed thereon -- and God disclosed what you were hiding --\n",
        "TRANSLATION_8": "And (remember) when ye slew a man and disagreed concerning it and Allah brought forth that which ye were hiding.\n",
        "TRANSLATION_9": "Then, when you [Israelites] killed someone and started to blame one another, God brought to light what you concealed,\n",
        "TRANSLATION_10": "And recall what time ye slew a person, then quarrelled among yourselves respecting it, and Allah was to bring out that which ye were hiding.\n",
        "TRANSLATION_11": "And when you killed a soul, and accused one another about it—and Allah was to expose what you were concealing—\n",
        "TRANSLATION_12": "Remember ye slew a man and fell into a dispute among yourselves as to the crime: But Allah was to bring forth what ye did hide.\n",
        "TRANSLATION_13": "And (remember) when you killed a man and fell into dispute among yourselves as to the crime. But Allah brought forth that which you were hiding.\n",
        "TRANSLATION_14": "And when you slew a soul and then fell out with one another concerning it, Allah made known what you concealed.\n",
        "TRANSLATION_15": "And recall when you killed a person, and disputed in the matter; but God was to expose what you were hiding.\n",
        "TRANSLATION_16": "And [recall] when you slew a man and disputed over it, but Allah was to bring out that which you were concealing.\n",
        "TRANSLATION_17": "[2:72] And when you killed a living soul, and disputed thereon (iddāra’tum: the tā’ [of the root-form itdāra’tum] has been assimilated with the dāl) — and God disclosed what you were hiding (this is a parenthetical statement; the story begins here [with wa-idh qataltum nafsan, ‘and when you killed a soul’… and continues in the following]):\n",
        "TRANSLATION_18": "Then Allah mentioned the murdered person, saying: (And (remember) when ye slew a man) 'Amil (and disagreed concerning it) concerning his murder (and Allah brought forth that which ye were hiding) thus demonstrating what you hid with regard to his murder.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:72",
            "2:9",
            "63:11",
            "59:19",
            "16:19",
            "91:7",
            "64:16",
            "4:63",
            "2:281",
            "8:33"
        ],
        "BIBLE": [
            "prophets:joshua:22:20",
            "prophets:ii%20samuel:11:17",
            "prophets:ii%20kings:2:14",
            "prophets:joshua:6:20",
            "prophets:ii%20samuel:1:4",
            "prophets:ii%20kings:1:13",
            "prophets:i%20samuel:9:9",
            "writings:daniel:8:17",
            "prophets:i%20samuel:14:34",
            "prophets:ezekiel:9:3"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:2",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:3:7",
            "Sefer%20Yetzirah:4:1"
        ]
    }
}