{
    "VERSE": "2:74",
    "ARABIC": "ثُمَّ قَسَتْ قُلُوبُكُم مِّنۢ بَعْدِ ذَٰلِكَ فَهِىَ كَٱلْحِجَارَةِ أَوْ أَشَدُّ قَسْوَةً وَإِنَّ مِنَ ٱلْحِجَارَةِ لَمَا يَتَفَجَّرُ مِنْهُ ٱلْأَنْهَٰرُ وَإِنَّ مِنْهَا لَمَا يَشَّقَّقُ فَيَخْرُجُ مِنْهُ ٱلْمَآءُ وَإِنَّ مِنْهَا لَمَا يَهْبِطُ مِنْ خَشْيَةِ ٱللَّهِ وَمَا ٱللَّهُ بِغَٰفِلٍ عَمَّا تَعْمَلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Then your hearts became hardened after that, so they were like rocks or even harder still. There are some rocks from which rivers gush out, and others which split open and water pours out, and others which crash down from fear of Allah. Allah is not unaware of what you do.",
        "TRANSLATION_1": "Yet, in spite of this, your hearts only hardened like rocks or even harder, but among rocks are those from which rivers flow; and there are also those which split open and water gushes forth; as well as those that roll down for fear of God. And God is not negligent of all that you do.\n",
        "TRANSLATION_2": "But even after seeing these Signs your hearts hardened and became as hard as rocks; nay, even harder than rocks. For there are some rocks out of which springs gush forth, and others which split open, and water issues out of them; then there are some which tumble down for fear of Allah. And Allah is not unaware of what you are doing.\n",
        "TRANSLATION_3": "Thereafter, your hearts turned as hard as rocks or even harder for some rocks give way to the streams to flow. Water comes out of some rocks when they are torn apart and others tumble down in awe before God. God does not ignore what you do.\n",
        "TRANSLATION_4": "Then after it, your hearts hardened – so they are like rocks, or even harder; for there are some rocks that rivers gush forth from them; and some that water flows from them when they split asunder; and there are rocks that fall down for the fear of Allah; and Allah is not unaware of your deeds.\n",
        "TRANSLATION_5": "Then after that your hearts were hardened and became as stones or even worse in hardness. And indeed, there are stones out of which rivers gush forth, and indeed, there are of them (stones) which split asunder so that water flows from them, and indeed, there are of them (stones) which fall down for fear of Allah. And Allah is not unaware of what you do.\n",
        "TRANSLATION_6": "Then your hearts hardened after that, so that they were like rocks, rather worse in hardness; and surely there are some rocks from which streams burst forth, and surely there are some of them which split asunder so water issues out of them, and surely there are some of them which fall down for fear of Allah, and Allah is not at all heedless of what you do.\n",
        "TRANSLATION_7": "Then your hearts became hardened thereafter and are like stones, or even yet harder; for there are stones from which rivers come gushing, and others split, so that water issues from them, and others crash down in the fear of God. And God is not heedless of the things you do.\n",
        "TRANSLATION_8": "Then, even after that, your hearts were hardened and became as rocks, or worse than rocks, for hardness. For indeed there are rocks from out which rivers gush, and indeed there are rocks which split asunder so that water floweth from them. And indeed there are rocks which fall down for the fear of Allah. Allah is not unaware of what ye do.\n",
        "TRANSLATION_9": "Then your hearts became as hard as rock or even harder: for, there are rocks from which streams gush forth; and, there are some that cleave asunder and water flows out from them, while others fall down for fear of God. God is not unaware of what you do.\n",
        "TRANSLATION_10": "Then your hearts hardened thereafter, so they are as stones or stronger in hardness: and verily of stones there are some from which gush forth rivers, and verily there are of them some that cleave asunder and water issueth therefrom, and verily there are of them some that fall down in awe of Allah: and Allah is not neglectful of that which ye work.\n",
        "TRANSLATION_11": "Then your hearts hardened after that; so they are like stones, or even harder. For there are some stones from which streams gush forth, and there are some of them that split, and water issues from them, and there are some that fall for the fear of Allah. And Allah is not oblivious of what you do.\n",
        "TRANSLATION_12": "Thenceforth were your hearts hardened: They became like a rock and even worse in hardness. For among rocks there are some from which rivers gush forth; others there are which when split asunder send forth water; and others which sink for fear of Allah. And Allah is not unmindful of what ye do.\n",
        "TRANSLATION_13": "Then, after that, your hearts were hardened and became as stones or even worse in hardness. And indeed, there are stones out of which rivers gush forth, and indeed, there are of them (stones) which split asunder so that water flows from them, and indeed, there are of them (stones) which fall down for fear of Allah. And Allah is not unaware of what you do.\n",
        "TRANSLATION_14": "Yet after that your hearts became as hard as rock or even harder. Indeed among the stones are those from which rivers burst. And others split so that water issues from them; and others crash down through fear of Allah. Allah is not inattentive of what you do.\n",
        "TRANSLATION_15": "Then after that your hearts hardened. They were as rocks, or even harder. For there are some rocks from which rivers gush out, and others that splinter and water comes out from them, and others that sink in awe of God. God is not unaware of what you do.\n",
        "TRANSLATION_16": "Then your hearts became hardened after that, being like stones or even harder. For indeed, there are stones from which rivers burst forth, and there are some of them that split open and water comes out, and there are some of them that fall down for fear of Allah. And Allah is not unaware of what you do.\n",
        "TRANSLATION_17": "[2:74] Then your hearts became hardened, O you Jews, they [your hearts] became stiffened against acceptance of the truth, thereafter, that is, after what is mentioned of the bringing back to life of the slain man and the other signs before this; and they are like stones, in their hardness, or even yet harder, than these; for there   are stones from which rivers come gushing, and others split (yashshaqqaq: the initial tā’ [of the root-form yatashaqqaq] has been assimilated with the shīn), so that water issues from them; and others come down, from on high, in fear of God, while your hearts are unmoved, unstirred and not humbled; And God is not heedless of what you do, but instead, He gives you respite until your time comes (ta‘malūna, ‘you do’: a variant reading has ya‘malūna, ‘they do’, indicating a shift to the third person address).\n",
        "TRANSLATION_18": "(Then, even after that) after bringing 'Amil back to life and informing you about his murderer, (your hearts were hardened) dry and barren (and became as rocks, or worse than rock, for hardness. For indeed there are rocks from out which rivers gush, and indeed there are some which split asunder so that water floweth from them. And indeed there are some which fall down) from the top of mountains to the bottom (for the fear of Allah) but your hearts are not moved by fear of Allah. (Allah is not unaware of) will not leave unpunished (what ye do) of transgressions; and it is said the meaning is: what you hide of transgression.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:74",
            "22:32",
            "16:65",
            "2:64",
            "9:127",
            "24:55",
            "9:117",
            "40:34",
            "24:47",
            "10:74"
        ],
        "BIBLE": [
            "prophets:ezekiel:16:30",
            "prophets:i%20samuel:10:9",
            "prophets:i%20kings:11:4",
            "prophets:jonah:3:10",
            "writings:i%20chronicles:29:17",
            "prophets:i%20samuel:25:37",
            "torah:exodus:24:10",
            "prophets:isaiah:60:5",
            "torah:deuteronomy:15:10",
            "writings:i%20chronicles:12:18"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:14"
        ]
    }
}