{
    "VERSE": "2:75",
    "ARABIC": "أَفَتَطْمَعُونَ أَن يُؤْمِنُوا۟ لَكُمْ وَقَدْ كَانَ فَرِيقٌ مِّنْهُمْ يَسْمَعُونَ كَلَٰمَ ٱللَّهِ ثُمَّ يُحَرِّفُونَهُۥ مِنۢ بَعْدِ مَا عَقَلُوهُ وَهُمْ يَعْلَمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Do you really hope they will follow you in iman when a group of them heard Allah's Word and then, after grasping it, knowingly distorted it?",
        "TRANSLATION_1": "How do you expect them to put their faith in you, when you know that some among them heard the word of God and, having understood, perverted it knowingly?\n",
        "TRANSLATION_2": "O Muslims, do you then expect that these people will accept your invitation and become believers? whereas there have always been among them some who have been hearing the Word of God, understanding it well and then perverting and tampering with it knowingly.\n",
        "TRANSLATION_3": "Do you, the believers in truth, desire the unbelievers to believe you? There was a group among them who would hear the word of God and understand it. Then they would purposely misinterpret it.\n",
        "TRANSLATION_4": "So O Muslims, do you wish for the Jews to accept faith in you whereas a group of them used to listen to the Words of Allah, and then after having understood it, purposely changed it?\n",
        "TRANSLATION_5": "Do you (faithful believers) covet that they will believe in your religion inspite of the fact that a party of them (Jewish rabbis) used to hear the Word of Allah (the Tawrah), then they used to change it knowingly after they understood it\n",
        "TRANSLATION_6": "Do you then hope that they would believe in you, and a party from among them indeed used to hear the Word of Allah, then altered it after they had understood it, and they know (this).\n",
        "TRANSLATION_7": "Are you then so eager that they should believe you, seeing there is a party of them that heard God's word, and then tampered with it, and that after they had comprehended it, wittingly?\n",
        "TRANSLATION_8": "Have ye any hope that they will be true to you when a party of them used to listen to the word of Allah, then used to change it, after they had understood it, knowingly?\n",
        "TRANSLATION_9": "Do you then hope that they will believe in you when some of them have already heard the word of God and then, after having understood it, they knowingly perverted it?\n",
        "TRANSLATION_10": "Covet ye then that they would believe for you whereas surely a Party of them hath been hearing the Word of Allah and then reverting it after they have understood it, While they know.\n",
        "TRANSLATION_11": "Are you then eager that they should believe you, though a part of them would hear the word of Allah and then they would distort it after they had understood it, and they knew [what they were doing]?\n",
        "TRANSLATION_12": "Can ye (o ye men of Faith) entertain the hope that they will believe in you?- Seeing that a party of them heard the Word of Allah, and perverted it knowingly after they understood it.\n",
        "TRANSLATION_13": "Do you (faithful believers) covet that they will believe in your religion inspite of the fact that a party of them (Jewish rabbis) used to hear the Word of Allah [the Taurat (Torah)], then they used to change it knowingly after they understood it?\n",
        "TRANSLATION_14": "Do you then hope that they will believe in you, when some of them have already heard the Word of Allah and knowingly tampered with it, after they understood it!\n",
        "TRANSLATION_15": "Do you hope that they will believe in you, when some of them used to hear the Word of God, and then deliberately distort it, even after understanding it?\n",
        "TRANSLATION_16": "Do you covet [the hope, O believers], that they would believe for you while a party of them used to hear the words of Allah and then distort the Torah after they had understood it while they were knowing?\n",
        "TRANSLATION_17": "[2:75] Are you then so eager, O believers, that they, the Jews, should believe you, seeing there is a party of them, a group of their rabbis, that heard God’s word, in the Torah, and then tampered with it, changing it, and that, after they had comprehended it, [after] they had understood it, knowingly?, [knowing full well] that they were indulging in mendacity (the hamza [at the beginning of the verb a-fa-tatma‘ūn] is [an interrogative] for rejection, in other words, ‘Do not be so eager, for they have disbelieved before’).\n",
        "TRANSLATION_18": "(Have ye any hope that they will be true to you) do you hope, Muhammad, that the Jews will believe in you (when a party of them) the 70 men who were with Moses (used to listen to the Word of Allah) used to listen to Moses reciting the Word of Allah, (then used to change it) alter it, (after they had understood it) after knowing it and fully understanding it (knowingly?) while knowing that they were altering it?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:75",
            "24:47",
            "6:80",
            "5:61",
            "26:227",
            "30:54",
            "10:16",
            "9:27",
            "21:57",
            "2:27"
        ],
        "BIBLE": [
            "prophets:ii%20kings:9:26",
            "prophets:i%20kings:10:7",
            "prophets:judges:6:22",
            "writings:ii%20chronicles:10:16",
            "writings:ii%20chronicles:9:6",
            "writings:i%20chronicles:29:17",
            "writings:ecclesiastes:6:11",
            "torah:exodus:3:7",
            "prophets:i%20samuel:16:18",
            "torah:genesis:24:30"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:1:5"
        ]
    }
}