{
    "VERSE": "2:77",
    "ARABIC": "أَوَلَا يَعْلَمُونَ أَنَّ ٱللَّهَ يَعْلَمُ مَا يُسِرُّونَ وَمَا يُعْلِنُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Do they not know that Allah knows what they keep secret and what they make public?",
        "TRANSLATION_1": "Do they not know that God is aware of what they hide and what they disclose?\n",
        "TRANSLATION_2": "Do they really not know that Allah is fully aware of what they hide and what they disclose?\n",
        "TRANSLATION_3": "Do they not know that God knows whatever they conceal or reveal?\n",
        "TRANSLATION_4": "Do they not know that Allah knows all whatever they hide and whatever they disclose?\n",
        "TRANSLATION_5": "Know they (Jews) not that Allah knows what they conceal and what they reveal\n",
        "TRANSLATION_6": "Do they not know that Allah knows what they keep secret and what they make known?\n",
        "TRANSLATION_7": "Know they not that God knows what they keep secret and what they publish?\n",
        "TRANSLATION_8": "Are they then unaware that Allah knoweth that which they keep hidden and that which they proclaim?\n",
        "TRANSLATION_9": "Do they not know that God knows all that they conceal and all that they disclose?\n",
        "TRANSLATION_10": "Know they not that Allah knoweth that which they hide and that which they make known?\n",
        "TRANSLATION_11": "Do they not know that Allah knows whatever they hide and whatever they disclose?\n",
        "TRANSLATION_12": "Know they not that Allah knoweth what they conceal and what they reveal?\n",
        "TRANSLATION_13": "Know they (Jews) not that Allah knows what they conceal and what they reveal?\n",
        "TRANSLATION_14": "Do they not know that Allah has knowledge of all they hide and all that they reveal!\n",
        "TRANSLATION_15": "Do they not know that God knows what they conceal and what they reveal?\n",
        "TRANSLATION_16": "But do they not know that Allah knows what they conceal and what they declare?\n",
        "TRANSLATION_17": "[2:77] God says: Know they not (the interrogative is affirmative, the inserted wāw [of a-wa-lā] is to indicate the supplement) that God knows what they keep secret and what they proclaim?, that is, what they hide and what they reveal in this matter and all other matters, so that they may desist from these things.\n",
        "TRANSLATION_18": "Allah, Exalted is He, says: (Are they) i.e. these leaders (then unaware that Allah knoweth that which they keep hidden) amongst themselves (and that which they proclaim?) to Muhammad and his Companions.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:77",
            "16:19",
            "16:23",
            "23:85",
            "23:87",
            "96:14",
            "37:96",
            "16:128",
            "26:226",
            "37:152"
        ],
        "BIBLE": [
            "writings:job:10:2",
            "writings:psalms:25:14",
            "writings:daniel:5:15",
            "writings:job:31:15",
            "torah:exodus:34:17",
            "prophets:jeremiah:16:20",
            "torah:exodus:32:23",
            "torah:exodus:23:32",
            "prophets:ezekiel:35:11",
            "torah:exodus:18:16"
        ]
    }
}