{
    "VERSE": "2:8",
    "ARABIC": "وَمِنَ ٱلنَّاسِ مَن يَقُولُ ءَامَنَّا بِٱللَّهِ وَبِٱلْيَوْمِ ٱلْءَاخِرِ وَمَا هُم بِمُؤْمِنِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Among the people there are some who say, 'We have iman in Allah and the Last Day,' when they are not",
        "TRANSLATION_1": "And there are some who, though they say: \"We believe in God and the Last Day,\" (in reality) do not believe.\n",
        "TRANSLATION_2": "Then there are some who say, \"We believe in Allah and the Last Day\", whereas they do not believe at all.\n",
        "TRANSLATION_3": "Some people say, \"We believe in God and the Day of Judgment,\" but they are not true believers.\n",
        "TRANSLATION_4": "And among the people are some* that say, “We believe in Allah and the Last Day**” whereas they are not believers! (* The hypocrites ** the Day of Resurrection)\n",
        "TRANSLATION_5": "And of mankind, there are some who say: \"We believe in Allah and the Last Day\" while in fact they do not believe.\n",
        "TRANSLATION_6": "And there are some people who say: We believe in Allah and the last day; and they are not at all believers.\n",
        "TRANSLATION_7": "And some men there are who say, 'We believe in God and the Last Day'; but they are not believers.\n",
        "TRANSLATION_8": "And of mankind are some who say: We believe in Allah and the Last Day, when they believe not.\n",
        "TRANSLATION_9": "There are some who say, \"We believe in God and the Last Day,\" yet they are not believers.\n",
        "TRANSLATION_10": "And of mankind are some who say: we believe in Allah and in the Last Day: whereas they are not believers.\n",
        "TRANSLATION_11": "Among the people are those who say, ‘We have faith in Allah and the Last Day,’ but they have no faith.\n",
        "TRANSLATION_12": "Of the people there are some who say: \"We believe in Allah and the Last Day;\" but they do not (really) believe.\n",
        "TRANSLATION_13": "And of mankind, there are some (hypocrites) who say: \"We believe in Allah and the Last Day\" while in fact they believe not.\n",
        "TRANSLATION_14": "There are some people who say: 'We believe in Allah and the Last Day,'yet they are not believers.\n",
        "TRANSLATION_15": "Among the people are those who say, “We believe in God and in the Last Day,” but they are not believers.\n",
        "TRANSLATION_16": "And of the people are some who say, \"We believe in Allah and the Last Day,\" but they are not believers.\n",
        "TRANSLATION_17": "[2:8] The following was revealed concerning the hypocrites: and some people there are who say, ‘We believe in God and the Last Day’, that is, in the Day of Resurrection because it is the very last day; but they are not believers (the [plural] import of man [in man yaqūl, ‘who says’] is taken into account here, as expressed by a pronoun [hum] that expresses this [plural] meaning).\n",
        "TRANSLATION_18": "(And of mankind are some who say: We believe in Allah), i.e. in the open and we are genuine in our belief, (and the last Day) and we believe in resurrection after death whereupon our deeds shall be requited, (when they believe not) i.e. secretly nor are they genuine in their belief.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:8",
            "4:39",
            "4:38",
            "4:108",
            "3:114",
            "40:33",
            "5:69",
            "9:44",
            "9:45",
            "14:27"
        ],
        "BIBLE": [
            "prophets:ezekiel:38:14",
            "prophets:ii%20samuel:19:23",
            "writings:daniel:6:6",
            "prophets:jeremiah:26:16",
            "writings:job:32:13",
            "prophets:ezekiel:30:2",
            "torah:genesis:6:3",
            "prophets:i%20samuel:11:13",
            "prophets:ezekiel:43:18",
            "prophets:ii%20samuel:20:4"
        ]
    }
}