{
    "VERSE": "2:82",
    "ARABIC": "وَٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّٰلِحَٰتِ أُو۟لَٰٓئِكَ أَصْحَٰبُ ٱلْجَنَّةِ هُمْ فِيهَا خَٰلِدُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "whereas those who have iman and do right actions, such people are the Companions of the Garden, remaining in it timelessly, for ever.",
        "TRANSLATION_1": "But those who believe and do good deeds are people of Paradise, and shall live there forever.\n",
        "TRANSLATION_2": "Only those people who believe and do good deeds, will be the dwellers of the Garden and live there for ever.\n",
        "TRANSLATION_3": "As for the righteously striving believers, they will be among the people of Paradise wherein they will live forever.\n",
        "TRANSLATION_4": "And those who believe and do good deeds – they are the People of Paradise; they will abide in it forever.\n",
        "TRANSLATION_5": "And those who believe and do righteous good deeds, they are dwellers of Paradise, they will dwell therein forever.\n",
        "TRANSLATION_6": "And (as for) those who believe and do good deeds, these are the dwellers of the garden; in it they shall abide.\n",
        "TRANSLATION_7": "And those that believe, and do deeds of righteousness -- those are the inhabitants of Paradise; there they shall dwell forever.'\n",
        "TRANSLATION_8": "And those who believe and do good works: such are rightful owners of the Garden. They will abide therein.\n",
        "TRANSLATION_9": "but those who believe and do good works are the heirs of Paradise; there they shall abide forever.\n",
        "TRANSLATION_10": "And those who believe and do righteous works, --those shall be the fellows of the Garden, as abiders therein.\n",
        "TRANSLATION_11": "And those who have faith and do righteous deeds—they shall be the inhabitants of paradise; they will remain in it [forever].\n",
        "TRANSLATION_12": "But those who have faith and work righteousness, they are companions of the Garden: Therein shall they abide (For ever).\n",
        "TRANSLATION_13": "And those who believe (in the Oneness of Allah - Islamic Monotheism) and do righteous good deeds, they are dwellers of Paradise, they will dwell therein forever.\n",
        "TRANSLATION_14": "But those who believe and do good works are the people of Paradise; for ever they shall live in it.\n",
        "TRANSLATION_15": "As for those who believe and do righteous deeds—these are the inhabitants of Paradise, wherein they will dwell forever.\n",
        "TRANSLATION_16": "But they who believe and do righteous deeds - those are the companions of Paradise; they will abide therein eternally.\n",
        "TRANSLATION_17": "[2:82] And those who believe and perform righteous deeds — those are the inhabitants of Paradise, therein abiding.\n",
        "TRANSLATION_18": "Allah then mentions the believers, saying: (And those who believe) in Muhammad and the Qur'an (and do good works) acts of obedience that are between them and their Lord, (such are rightful owners of Paradise. They will abide therein forever) perpetually, they will never die or come out of it.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:82",
            "11:23",
            "46:14",
            "7:42",
            "2:39",
            "7:36",
            "59:20",
            "46:16",
            "47:6",
            "43:72"
        ],
        "BIBLE": [
            "prophets:jeremiah:29:32",
            "prophets:isaiah:60:21",
            "prophets:isaiah:32:16",
            "torah:numbers:33:55",
            "prophets:zechariah:8:8",
            "writings:psalms:37:29",
            "torah:deuteronomy:2:4",
            "prophets:isaiah:29:14",
            "prophets:isaiah:33:24",
            "torah:deuteronomy:9:6"
        ]
    }
}