{
    "VERSE": "2:89",
    "ARABIC": "وَلَمَّا جَآءَهُمْ كِتَٰبٌ مِّنْ عِندِ ٱللَّهِ مُصَدِّقٌ لِّمَا مَعَهُمْ وَكَانُوا۟ مِن قَبْلُ يَسْتَفْتِحُونَ عَلَى ٱلَّذِينَ كَفَرُوا۟ فَلَمَّا جَآءَهُم مَّا عَرَفُوا۟ كَفَرُوا۟ بِهِۦ فَلَعْنَةُ ٱللَّهِ عَلَى ٱلْكَٰفِرِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "When a Book does come to them from Allah, confirming what is with them - even though before that they were praying for victory over the kafirun - yet when what they recognise does come to them, they reject it. Allah's curse is on the kafirun.",
        "TRANSLATION_1": "And when the Book was sent to them by God verifying what had been revealed to them already even though before it they used to pray for victory over the unbelievers and even though they recognised it when it came to them, they renounced it. The curse of God be on those who deny!\n",
        "TRANSLATION_2": "And how are they behaving now towards a Book which has come to them from Allah? Inspite of the fact that it confirms the Scriptures which they already possessed. and, inspite of the fact that, before it came, they used to pray for a signal victory over the disbelievers, they rejected it when it came, although they recognized it. May Allah's curse be upon such disbelievers!\n",
        "TRANSLATION_3": "When a Book came to them from God which confirms what is with them (the fact of truthfulness of the Prophet Muhammad in their Scripture), and, despite the fact that they had been praying for victory over the disbelievers (by the help of the truthful Prophet), they refuse to accept this book, even though they know it (to be the Truth). May God condemn those who hide the Truth!\n",
        "TRANSLATION_4": "And when the Book from Allah (the Holy Qu’ran) came to them, which confirms the Book in their possession (the Taurat / Torah) – and before that they used to seek victory through the medium of this very Prophet (Mohammed – peace and blessings be upon him) over the disbelievers; so when the one whom they fully recognised (the Holy Prophet) came to them, they turned disbelievers – therefore Allah’s curse is upon the disbelievers.\n",
        "TRANSLATION_5": "And when there came to them (the Jews), a Book (this Qur'an) from Allah confirming what is with them (the Tawrah) and the Injil (Gospel), although aforetime they had invoked Allah (for the coming of Muhammad) in order to gain victory over those who disbelieved, then when there came to them that which they had recognised, they disbelieved in it. So let the curse of Allah be on the disbelievers.\n",
        "TRANSLATION_6": "And when there came to them a Book from Allah verifying that which they have, and aforetime they used to pray for victory against those who disbelieve, but when there came to them (Prophet) that which they did not recognize, they disbelieved in him; so Allah's curse is on the unbelievers.\n",
        "TRANSLATION_7": "When there came to them a Book from God, confirming what was with them -- and they aforetimes prayed for victory over the unbelievers -- when there came to them that they recognized, they disbelieved in it; and the curse of God is on the unbelievers.\n",
        "TRANSLATION_8": "And when there cometh unto them a scripture from Allah, confirming that in their possession - though before that they were asking for a signal triumph over those who disbelieved - and when there cometh unto them that which they know (to be the truth) they disbelieve therein. The curse of Allah is on disbelievers.\n",
        "TRANSLATION_9": "And now that a Book has come to them from God, fulfilling that [predictions about the final prophet in their scriptures] which is with them, they deny it, whereas previously they used to pray for victory against the disbelievers, yet when there came to them that which they recognized as the truth, they rejected it. God's rejection is the due of all who deny the truth.\n",
        "TRANSLATION_10": "And when there came unto them a Book from before Allah confirming that which was with them, --and afore they were entreating God for victory over these who disbelieved, -then when there came unto them that which they recognised. they disbelieved therein wherefore Allah's curse be on the infidels!\n",
        "TRANSLATION_11": "And when there came to them a Book from Allah, confirming that which is with them—and earlier they would pray for victory over the pagans—so when there came to them what they recognized, they denied it. So may the curse of Allah be on the faithless!\n",
        "TRANSLATION_12": "And when there comes to them a Book from Allah, confirming what is with them,- although from of old they had prayed for victory against those without Faith,- when there comes to them that which they (should) have recognised, they refuse to believe in it but the curse of Allah is on those without Faith.\n",
        "TRANSLATION_13": "And when there came to them (the Jews), a Book (this Quran) from Allah confirming what is with them [the Taurat (Torah) and the Injeel (Gospel)], although aforetime they had invoked Allah (for coming of Muhammad Peace be upon him) in order to gain victory over those who disbelieved, then when there came to them that which they had recognised, they disbelieved in it. So let the Curse of Allah be on the disbelievers.\n",
        "TRANSLATION_14": "And when a Book came to them from Allah confirming what was with them, while before that they used to pray for victory over the unbelievers when there came to them what they knew, they disbelieved him. Therefore, the curse of Allah be upon the unbelievers!\n",
        "TRANSLATION_15": "And when a scripture came to them from God, confirming what they have—although previously they were seeking victory against those who disbelieved—but when there came to them what they recognized, they disbelieved in it. So God’s curse is upon the disbelievers.\n",
        "TRANSLATION_16": "And when there came to them a Book from Allah confirming that which was with them - although before they used to pray for victory against those who disbelieved - but [then] when there came to them that which they recognized, they disbelieved in it; so the curse of Allah will be upon the disbelievers.\n",
        "TRANSLATION_17": "[2:89] When there came to them a Book from God, confirming what was with them, in the Torah, that is the Qur’ān — and they formerly, before it came, prayed for victory, for assistance, over the disbelievers, saying: ‘God, give us assistance against them through the Prophet that shall be sent at the end of time’; but when there came to them what they recognised, as the truth, that is, the mission of the Prophet, they disbelieved in it, out of envy and for fear of losing leadership (the response to the first lammā particle is indicated by the response to the second one); and the curse of God is on the disbelievers.\n",
        "TRANSLATION_18": "(And when there cometh unto them a Scripture from Allah, confirming that in their possession) which accords with that which is in their possession (though before that) before Muhammad (pbuh) (they were asking for a signal triumph) through Muhammad and the Qur'an (over those who disbelieved) of their enemies: the tribes of Asad, Ghatafan, Muzaynah, and Juhaynah (and when there cometh unto them that which they knew) of his traits and description in their Book (they disbelieved therein) they denied it was him. (The curse of Allah) His wrath and torment (is on disbelievers) the Jews. 15\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:89",
            "2:79",
            "13:39",
            "2:101",
            "13:43",
            "57:16",
            "28:49",
            "4:47",
            "3:78",
            "28:52"
        ],
        "BIBLE": [
            "writings:ezra:10:14",
            "torah:deuteronomy:23:6",
            "prophets:isaiah:55:5",
            "prophets:ii%20kings:5:8",
            "writings:ii%20chronicles:25:16",
            "torah:genesis:30:30",
            "writings:nehemiah:13:2",
            "prophets:amos:6:12",
            "writings:ii%20chronicles:20:10",
            "torah:genesis:38:16"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:1",
            
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:9"
        ]
    }
}