{
    "VERSE": "2:9",
    "ARABIC": "يُخَٰدِعُونَ ٱللَّهَ وَٱلَّذِينَ ءَامَنُوا۟ وَمَا يَخْدَعُونَ إِلَّآ أَنفُسَهُمْ وَمَا يَشْعُرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "They think they deceive Allah and those who have iman. They deceive no one but themselves but they are not aware of it.",
        "TRANSLATION_1": "They (try to) deceive God and those who believe, yet deceive none but themselves although they do not know.\n",
        "TRANSLATION_2": "They thus try to deceive Allah and the Believers, but they succeed in deceiving none except themselves and they realize it not.\n",
        "TRANSLATION_3": "They deceive God and the believers. However, they have deceived no one but themselves, a fact of which they are not aware.\n",
        "TRANSLATION_4": "They wish to deceive Allah and the believers; and in fact they deceive none except themselves and they do not have any understanding.\n",
        "TRANSLATION_5": "They try to deceive Allah and those who believe, while they only deceive themselves, and perceive (it) not!\n",
        "TRANSLATION_6": "They desire to deceive Allah and those who believe, and they deceive only themselves and they do not perceive.\n",
        "TRANSLATION_7": "They would trick God and the believers, and only themselves they deceive, and they are not aware.\n",
        "TRANSLATION_8": "They think to beguile Allah and those who believe, and they beguile none save themselves; but they perceive not.\n",
        "TRANSLATION_9": "They seek to deceive God and the believers, but they only deceive themselves, though they do not realize it.\n",
        "TRANSLATION_10": "They would deceive Allah and those who believe, whereas they deceive not save themselves, and they perceive not.\n",
        "TRANSLATION_11": "They seek to deceive Allah and those who have faith, yet they deceive no one but themselves, but they are not aware.\n",
        "TRANSLATION_12": "Fain would they deceive Allah and those who believe, but they only deceive themselves, and realise (it) not!\n",
        "TRANSLATION_13": "They (think to) deceive Allah and those who believe, while they only deceive themselves, and perceive (it) not!\n",
        "TRANSLATION_14": "They seek to deceive Allah and those who believe, but they deceive none except themselves, though they do not sense it.\n",
        "TRANSLATION_15": "They seek to deceive God and those who believe, but they deceive none but themselves, though they are not aware.\n",
        "TRANSLATION_16": "They [think to] deceive Allah and those who believe, but they deceive not except themselves and perceive [it] not.\n",
        "TRANSLATION_17": "[2:9] They would deceive God and the believers, by manifesting the opposite of the unbelief they hide, so that they can avoid His rulings in this world; and only themselves they deceive (yukhādi‘ūn), for the evil consequences of their deception will rebound upon them, as they are disgraced in this world when God makes known to His Prophet what they are hiding, and they will be punished in the Hereafter; and they are not aware, and they do not know that they are actually deceiving themselves (mukhāda‘a [although a third verbal form, from khāda‘a] actually denotes a one-way action, such as [when one says] ‘āqabtu al-lissa, ‘I punished the thief’ [using the third verbal form ‘āqaba]; the mention of ‘God’ in [this statement] is for [rhetorical] effect; a variant reading [for wa-mā yukhādi‘ūna] has wa-mā yakhda‘ūna).\n",
        "TRANSLATION_18": "(They try to deceive Allah) contravene against Him and denying Him in secret. It is also said that this means that they were so daring with Allah to the extent that they thought they had deceived Him; (and those who believe), Abu Bakr and all the Companions of Muhammad Allah bless him and give him peace; (and they deceive) lie to (none save themselves; but they perceive not), they do not know that Allah informs His Prophet about that which lies secret in their hearts.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:9",
            "2:72",
            "6:26",
            "3:135",
            "8:33",
            "59:19",
            "10:100",
            "4:49",
            "37:96",
            "2:281"
        ],
        "BIBLE": [
            "prophets:isaiah:43:10",
            "prophets:jeremiah:4:22",
            "writings:job:13:3",
            "writings:ecclesiastes:8:17",
            "torah:deuteronomy:1:32",
            "prophets:ii%20kings:17:14",
            "writings:job:39:17",
            "prophets:jeremiah:29:11",
            "writings:job:36:5",
            "writings:ii%20chronicles:32:31"
        ]
    }
}