{
    "VERSE": "29:11",
    "ARABIC": "وَلَيَعْلَمَنَّ ٱللَّهُ ٱلَّذِينَ ءَامَنُوا۟ وَلَيَعْلَمَنَّ ٱلْمُنَٰفِقِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Allah knows those who have iman and He knows the hypocrites.",
        "TRANSLATION_1": "God will surely know the believers and know the hypocrites.\n",
        "TRANSLATION_2": "Allah will surely ascertain who are the believers and who are the hypocrites.\n",
        "TRANSLATION_3": "God certainly knows all about the believers and the hypocrites.\n",
        "TRANSLATION_4": "And indeed Allah will make known the believers, and indeed He will expose the hypocrites.\n",
        "TRANSLATION_5": "And indeed Allah knows those who believe, and verily, He knows the hypocrites.\n",
        "TRANSLATION_6": "And most certainly Allah will know those who believe and most certainly He will know the hypocrites.\n",
        "TRANSLATION_7": "God surely knows the believers, and He knows the hypocrites.\n",
        "TRANSLATION_8": "Verily Allah knoweth those who believe, and verily He knoweth the hypocrites.\n",
        "TRANSLATION_9": "Most certainly God will mark out those who believe and mark out those who are hypocrites.\n",
        "TRANSLATION_10": "And surely Allah shall come to know those who believe, and surely He shall come to know the hypocrites.\n",
        "TRANSLATION_11": "Allah shall surely ascertain those who have faith, and He shall surely ascertain the hypocrites.\n",
        "TRANSLATION_12": "And Allah most certainly knows those who believe, and as certainly those who are Hypocrites.\n",
        "TRANSLATION_13": "Verily, Allah knows those who believe, and verily, He knows the hypocrites [i.e. Allah will test the people with good and hard days to discriminate the good from the wicked (although Allah knows all that before putting them to test)].\n",
        "TRANSLATION_14": "Most certainly Allah knows the believers and the hypocrites.\n",
        "TRANSLATION_15": "God certainly knows those who believe, and He certainly knows the hypocrites.\n",
        "TRANSLATION_16": "And Allah will surely make evident those who believe, and He will surely make evident the hypocrites.\n",
        "TRANSLATION_17": "[29:11] And God shall surely ascertain those who believe, in their hearts, and He shall surely ascertain the hypocrites, and He will requite each group accordingly (the lām in both verbs [la-ya‘lamanna, ‘He shall ascertain’] is for oaths).\n",
        "TRANSLATION_18": "(Verily Allah knoweth) He sees and distinguishes (those who believe) in private and openly, (and verily He knoweth) He sees and distinguishes (the hypocrites) on the Day of Badr.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "29:11",
            "3:141",
            "37:152",
            "9:119",
            "29:3",
            "29:69",
            "9:43",
            "16:128",
            "10:95",
            "9:75"
        ],
        "BIBLE": [
            "writings:daniel:10:14",
            "prophets:hosea:5:9",
            "prophets:isaiah:38:19",
            "prophets:jeremiah:31:33",
            "prophets:i%20samuel:28:2",
            "prophets:ezekiel:43:27",
            "writings:i%20chronicles:17:22",
            "prophets:i%20kings:14:13",
            "prophets:hosea:12:10",
            "prophets:ii%20samuel:17:2"
        ]
    }
}