{
    "VERSE": "29:3",
    "ARABIC": "وَلَقَدْ فَتَنَّا ٱلَّذِينَ مِن قَبْلِهِمْ فَلَيَعْلَمَنَّ ٱللَّهُ ٱلَّذِينَ صَدَقُوا۟ وَلَيَعْلَمَنَّ ٱلْكَٰذِبِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "We tested those before them so that Allah would know the truthful and would know the liars.",
        "TRANSLATION_1": "We had tried those who were before them so that God knew who spoke the truth, and who were liars.\n",
        "TRANSLATION_2": "for We indeed tested those who went before them? Allah will most certainly ascertain those who spoke the truth and those who lied.\n",
        "TRANSLATION_3": "We had certainly tried those who lived before them to make sure who were truthful in their faith and who were liars.\n",
        "TRANSLATION_4": "We indeed tested those before them – so Allah will surely test the truthful, and will surely test the liars.\n",
        "TRANSLATION_5": "And We indeed tested those who were before them so that Allah will indeed know those who are true, and He will know those who are liars.\n",
        "TRANSLATION_6": "And certainly We tried those before them, so Allah will certainly know those who are true and He will certainly know the liars.\n",
        "TRANSLATION_7": "We certainly tried those that were before them, and assuredly God knows those who speak truly, and assuredly He knows the liars.\n",
        "TRANSLATION_8": "Lo! We tested those who were before you. Thus Allah knoweth those who are sincere, and knoweth those who feign.\n",
        "TRANSLATION_9": "We certainly tried those who have gone before them, so God will certainly distinguish between those who are truthful and those who are lying.\n",
        "TRANSLATION_10": "And assuredly We have tempted those who were before them. So Allah will surely know those who are true and He will surely know the liars.\n",
        "TRANSLATION_11": "Certainly We tested those who were before them. So Allah shall surely ascertain those who are truthful, and He shall surely ascertain the liars.\n",
        "TRANSLATION_12": "We did test those before them, and Allah will certainly know those who are true from those who are false.\n",
        "TRANSLATION_13": "And We indeed tested those who were before them. And Allah will certainly make (it) known (the truth of) those who are true, and will certainly make (it) known (the falsehood of) those who are liars, (although Allah knows all that before putting them to test).\n",
        "TRANSLATION_14": "We tried those who have gone before them. Allah knows those who are truthful and those who lie.\n",
        "TRANSLATION_15": "We have tested those before them. God will surely know the truthful, and He will surely know the liars.\n",
        "TRANSLATION_16": "But We have certainly tried those before them, and Allah will surely make evident those who are truthful, and He will surely make evident the liars.\n",
        "TRANSLATION_17": "[29:3] And certainly We tried those who were before them. So God shall surely know those who are sincere, in their faith — a knowledge of direct vision — and He shall surely know those who are liars, regarding it.\n",
        "TRANSLATION_18": "(Lo! We tested those who were before you) before the Companions of Muhammad (pbuh) after the demise of their prophets, with caprice, blameworthy innovations and the violation of sanctities. (Thus Allah knoweth) in order that Allah sees and distinguishes (those who are sincere) in their faith by avoiding caprice, blameworthy innovation and by shunning that which is unlawful, (and knoweth those who feign) i.e. the insincere in their faith who follow caprice, blameworthy innovation and the violation of sanctities.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "29:3",
            "29:11",
            "33:15",
            "29:69",
            "48:23",
            "33:62",
            "4:164",
            "3:141",
            "9:75",
            "39:65"
        ],
        "BIBLE": [
            "prophets:ezekiel:35:11",
            "prophets:isaiah:38:19",
            "prophets:i%20samuel:28:2",
            "writings:psalms:89:2",
            "writings:job:10:2",
            "prophets:i%20samuel:9:27",
            "torah:genesis:35:3",
            "prophets:jeremiah:50:3",
            "prophets:isaiah:28:16",
            "writings:proverbs:22:21"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:14"
        ]
    }
}