{
    "VERSE": "29:30",
    "ARABIC": "قَالَ رَبِّ ٱنصُرْنِى عَلَى ٱلْقَوْمِ ٱلْمُفْسِدِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "He said, 'My Lord, help me against the people of corruption!'",
        "TRANSLATION_1": "O Lord, help me against the wicked people,\"(Lot) prayed.\n",
        "TRANSLATION_2": "Lot said: “My Lord, aid me against these mischievous people.”\n",
        "TRANSLATION_3": "He prayed, \"Lord help me against the evil-doing people.\"\n",
        "TRANSLATION_4": "He submitted, “My Lord! Help me against these mischievous people.”\n",
        "TRANSLATION_5": "He said: \"My Lord! Give me victory over the people who are corrupt.\"\n",
        "TRANSLATION_6": "He said: My Lord! help me against the mischievous people.\n",
        "TRANSLATION_7": "He said, 'My Lord, help me against the people that work corruption.'\n",
        "TRANSLATION_8": "He said: My Lord! Give me victory over folk who work corruption.\n",
        "TRANSLATION_9": "Lot prayed, \"Lord, help me against this wicked people.\"\n",
        "TRANSLATION_10": "He said: my Lord! give me victory over the corrupt people.\n",
        "TRANSLATION_11": "He said, ‘My Lord! Help me against this corruptive lot.’\n",
        "TRANSLATION_12": "He said: \"O my Lord! help Thou me against people who do mischief!\"\n",
        "TRANSLATION_13": "He said: \"My Lord! Give me victory over the people who are Mufsidun (those who commit great crimes and sins, oppressors, tyrants, mischief-makers, corrupts).\n",
        "TRANSLATION_14": "My Lord' he said, 'help me against this corrupt nation'\n",
        "TRANSLATION_15": "He said, “My Lord, help me against the people of corruption.”\n",
        "TRANSLATION_16": "He said, \"My Lord, support me against the corrupting people.\"\n",
        "TRANSLATION_17": "[29:30] He said, ‘My Lord, help me, by making that of which I spoke come true regarding the sending down of chastisement, against the people who work corruption’, those who are disobedient, by coming unto men. So God answered his call.\n",
        "TRANSLATION_18": "(He said) Lot said: (My Lord! Give me victory) by sending Your punishment (over folk who work corruption) on the idolaters.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "29:30",
            "28:21",
            "23:94",
            "26:117",
            "23:106",
            "26:10",
            "37:100",
            "44:22",
            "6:77",
            "11:52"
        ],
        "BIBLE": [
            "prophets:i%20kings:21:20",
            "prophets:joshua:17:14",
            "prophets:i%20samuel:14:41",
            "torah:exodus:17:2",
            "torah:deuteronomy:2:9",
            "prophets:ezekiel:29:20",
            "prophets:hosea:9:14",
            "prophets:i%20samuel:1:27",
            "writings:i%20chronicles:23:25",
            "prophets:i%20samuel:8:6"
        ]
    }
}