{
    "VERSE": "29:31",
    "ARABIC": "وَلَمَّا جَآءَتْ رُسُلُنَآ إِبْرَٰهِيمَ بِٱلْبُشْرَىٰ قَالُوٓا۟ إِنَّا مُهْلِكُوٓا۟ أَهْلِ هَٰذِهِ ٱلْقَرْيَةِ إِنَّ أَهْلَهَا كَانُوا۟ ظَٰلِمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "When Our messengers came with the good news to Ibrahim, they said, 'We are going to destroy the people of this city. Truly its inhabitants are wrongdoers.'",
        "TRANSLATION_1": "When Our messengers came to Abraham with good news, they said: \"We have to destroy this city as its inhabitants have become sinful.\"\n",
        "TRANSLATION_2": "When Our emissaries brought the good news to Abraham, and said (to him): “We are surely going to destroy the inhabitants of this city; its inhabitants are immersed in wrong-doing.”\n",
        "TRANSLATION_3": "When Our angelic Messengers brought glad news to Abraham, they told him, \"We are about to destroy the people of this town for their injustice\".\n",
        "TRANSLATION_4": "And when Our sent angels came with glad tidings to Ibrahim, they said, “We will surely destroy the people of that town; indeed its inhabitants are unjust.”\n",
        "TRANSLATION_5": "And when Our messengers came to Ibrahim with the glad tidings they said: \"Verily, we are going to destroy the people of this town; truly, its people have been wrongdoers.\"\n",
        "TRANSLATION_6": "And when Our apostles came to Ibrahim with the good news, they said: Surely we are going to destroy the people of this town, for its people are unjust.\n",
        "TRANSLATION_7": "And when Our messengers came to Abraham with the good tidings, they said, 'We shall destroy the people of this city, for its people are evildoers.'\n",
        "TRANSLATION_8": "And when Our messengers brought Abraham the good news, they said: Lo! we are about to destroy the people of that township, for its people are wrong-doers.\n",
        "TRANSLATION_9": "When Our messengers brought Abraham the good news [of the birth of Isaac] they [also] said, \"We are indeed going to destroy the people of this city, for the people of this city are truly wrongdoers.\"\n",
        "TRANSLATION_10": "And when Our messengers came unto Ibrahim with the glad tidings, they said: verily we are about to destroy the inhabitants of that city: verily the inhabitants thereof have been wrong-doers.\n",
        "TRANSLATION_11": "And when Our messengers came to Abraham with the good news, they said, ‘We are indeed going to destroy the people of this town. Its people are indeed wrongdoers.’\n",
        "TRANSLATION_12": "When Our Messengers came to Abraham with the good news, they said: \"We are indeed going to destroy the people of this township: for truly they are (addicted to) crime.\"\n",
        "TRANSLATION_13": "And when Our Messengers came to Ibrahim (Abraham) with the glad tidings they said: \"Verily, we are going to destroy the people of this [Lout's (Lot's)] town (i.e. the town of Sodom in Palestine) truly, its people have been Zalimun [wrong-doers, polytheists and disobedient to Allah, and have also belied their Messenger Lout (Lot)].\"\n",
        "TRANSLATION_14": "And when Our Messengers brought Abraham the glad tidings they said: 'We are destroying the people of this village, because its people are harmdoers'\n",
        "TRANSLATION_15": "And when Our envoys brought Abraham the good news, they said, “We are going to destroy the people of this town; its people are wrongdoers.”\n",
        "TRANSLATION_16": "And when Our messengers came to Abraham with the good tidings, they said, \"Indeed, we will destroy the people of that Lot's city. Indeed, its people have been wrongdoers.\"\n",
        "TRANSLATION_17": "[29:31] And when Our messengers came to Abraham with the good tidings, of Isaac and Jacob after him, they said, ‘We shall assuredly destroy the people of this town, namely, the town of Lot, for truly its people are evildoers’, disbelievers.\n",
        "TRANSLATION_18": "(And when Our messengers) Gabriel and the angels who were with him (brought Abraham the good news) that he will have a son, (they said) to Abraham: (Lo! we are about to destroy the people of that township) the township of Lot, (for its people are wrong-doers) they are idolaters who brought destruction upon themselves because of their abominable acts.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "29:31",
            "29:34",
            "29:33",
            "28:59",
            "7:94",
            "27:34",
            "7:98",
            "7:97",
            "11:117",
            "24:51"
        ],
        "BIBLE": [
            "prophets:i%20samuel:29:6",
            "prophets:i%20samuel:15:20",
            "prophets:ii%20samuel:11:22",
            "prophets:i%20samuel:5:10",
            "prophets:ezekiel:36:20",
            "torah:exodus:19:9",
            "prophets:ii%20samuel:11:10",
            "prophets:ii%20samuel:6:12",
            "prophets:i%20samuel:11:5",
            "torah:genesis:19:14"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:5:4"
        ]
    }
}