{
    "VERSE": "29:35",
    "ARABIC": "وَلَقَد تَّرَكْنَا مِنْهَآ ءَايَةًۢ بَيِّنَةً لِّقَوْمٍ يَعْقِلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "We have left a Clear Sign of them behind for people who use their intellect.",
        "TRANSLATION_1": "Verily We have left a clear sign of this for people of sense to see.\n",
        "TRANSLATION_2": "And We have left a vestige of it in that city as a Clear Sign for a people who use their reason.\n",
        "TRANSLATION_3": "We left manifest evidence (of the truth) there for the people of understanding.\n",
        "TRANSLATION_4": "And We have undoubtedly kept a part of it as a clear sign for people of intellect.\n",
        "TRANSLATION_5": "And indeed We have left thereof an evident Ayah for a folk who understand.\n",
        "TRANSLATION_6": "And certainly We have left a clear sign of it for a people who understand.\n",
        "TRANSLATION_7": "And indeed, We have left thereof a sign, a clear sign? unto a people who understand.\n",
        "TRANSLATION_8": "And verily of that We have left a clear sign for people who have sense.\n",
        "TRANSLATION_9": "Surely the ruins We left of that city are a clear sign for a people who use their reason.\n",
        "TRANSLATION_10": "And assuredly We have left thereof manifest sign for a people who reflect.\n",
        "TRANSLATION_11": "Certainly We have left of it a manifest sign for people who exercise their reason.\n",
        "TRANSLATION_12": "And We have left thereof an evident Sign, for any people who (care to) understand.\n",
        "TRANSLATION_13": "And indeed We have left thereof an evident Ayah (a lesson and a warning and a sign the place where the Dead Sea is now in Palestine) for a folk who understand.\n",
        "TRANSLATION_14": "Indeed, We left a clear sign for a nation that understands.\n",
        "TRANSLATION_15": "And We left behind a clear trace of it, for people who understand.\n",
        "TRANSLATION_16": "And We have certainly left of it a sign as clear evidence for a people who use reason.\n",
        "TRANSLATION_17": "[29:35] And verily We have left of that a clear sign, a manifest one — namely, the remains of its [the town’s] ruins — for a people who understand, [a people who] reflect.\n",
        "TRANSLATION_18": "(And verily of that) of the township of Lot (We have left a clear sign for people who have sense) for people who believe and know what was done to them so that they do not emulate them.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "29:35",
            "24:34",
            "6:98",
            "54:15",
            "6:126",
            "24:1",
            "6:105",
            "2:99",
            "27:52",
            "10:13"
        ],
        "BIBLE": [
            "writings:job:28:20",
            "writings:job:28:12",
            "prophets:ezekiel:36:36",
            "prophets:jeremiah:44:29",
            "torah:numbers:24:11",
            "torah:deuteronomy:4:6",
            "prophets:i%20kings:8:13",
            "prophets:jeremiah:7:12",
            "writings:proverbs:15:3",
            "writings:ii%20chronicles:34:21"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:13"
        ]
    }
}