{
    "VERSE": "29:42",
    "ARABIC": "إِنَّ ٱللَّهَ يَعْلَمُ مَا يَدْعُونَ مِن دُونِهِۦ مِن شَىْءٍ وَهُوَ ٱلْعَزِيزُ ٱلْحَكِيمُ",
    "ENGLISH": {
        "TRANSLATION_0": "Allah knows what you call upon besides Himself. He is the Almighty, the All-Wise.",
        "TRANSLATION_1": "Verily God knows what they invoke in His place, for He is all-mighty and all-wise.\n",
        "TRANSLATION_2": "Surely Allah knows fully what they call upon apart from Him. He is the Most Powerful, the Most Wise.\n",
        "TRANSLATION_3": "God knows whatever they worship besides Him; He is the Majestic and All-wise.\n",
        "TRANSLATION_4": "Allah knows what they worship instead of Him; He is the Almighty, the Wise.\n",
        "TRANSLATION_5": "Verily, Allah knows what things they invoke instead of Him. He is the All-Mighty, the All-Wise.\n",
        "TRANSLATION_6": "Surely Allah knows whatever thing they call upon besides Him; and He is the Mighty, the Wise.\n",
        "TRANSLATION_7": "God knows whatever thing they call upon apart from Him; He is the All-mighty, the All-wise.\n",
        "TRANSLATION_8": "Lo! Allah knoweth what thing they invoke instead of Him. He is the Mighty, the Wise.\n",
        "TRANSLATION_9": "God surely knows what they invoke besides Him. He is the Mighty, the Wise One.\n",
        "TRANSLATION_10": "Verily Allah knoweth whatsoever thing they invoke beside Him. And He is the Mighty, the Wise.\n",
        "TRANSLATION_11": "Allah indeed knows whatever thing they invoke besides Him, and He is the All-mighty, the All-wise.\n",
        "TRANSLATION_12": "Verily Allah doth know of (every thing) whatever that they call upon besides Him: and He is Exalted (in power), Wise.\n",
        "TRANSLATION_13": "Verily, Allah knows what things they invoke instead of Him. He is the All-Mighty, the All-Wise.\n",
        "TRANSLATION_14": "Allah knows whatever they call upon other than Him; He is the Almighty, the Wise.\n",
        "TRANSLATION_15": "God knows what they invoke besides Him. He is the Almighty, the Wise.\n",
        "TRANSLATION_16": "Indeed, Allah knows whatever thing they call upon other than Him. And He is the Exalted in Might, the Wise.\n",
        "TRANSLATION_17": "[29:42] Truly God knows whatever thing (mā functions like alladhī) they call on, [what] they worship (read yad‘ūna, ‘they call on’, or tad‘ūna, ‘you call on’) besides Him, other than Him. And He is the Mighty, in His kingdom, the Wise, in what He does.\n",
        "TRANSLATION_18": "(Lo! Allah knoweth what thing they invoke) they worship (instead of Him) of idols do not benefit them in this 452 worldly life nor in the Hereafter. (He is the Mighty) in retribution against those who worship them, (the Wise) He decreed that none should be worshipped except Him.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "29:42",
            "16:20",
            "27:9",
            "40:20",
            "21:66",
            "35:2",
            "19:81",
            "57:1",
            "2:209",
            "42:3"
        ],
        "BIBLE": [
            "writings:job:18:21",
            "torah:deuteronomy:12:26",
            "prophets:zephaniah:2:11",
            "writings:daniel:11:38",
            "prophets:isaiah:45:3",
            "torah:exodus:18:23",
            "writings:job:28:23",
            "writings:proverbs:30:18",
            "prophets:ii%20kings:17:9",
            "writings:psalms:46:11"
        ]
    }
}