{
    "VERSE": "29:44",
    "ARABIC": "خَلَقَ ٱللَّهُ ٱلسَّمَٰوَٰتِ وَٱلْأَرْضَ بِٱلْحَقِّ إِنَّ فِى ذَٰلِكَ لَءَايَةً لِّلْمُؤْمِنِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Allah created the heavens and the earth with truth. There is certainly a Sign in that for the muminun.",
        "TRANSLATION_1": "God has created the heavens and the earth with reason. Surely in this is a sign for those who believe.\n",
        "TRANSLATION_2": "Allah has created the heavens and the earth in Truth. Certainly there is a Sign in this for those who believe.\n",
        "TRANSLATION_3": "God has created the heavens and the earth for a genuine purpose. In this there is evidence (of the truth) for the believers.\n",
        "TRANSLATION_4": "Allah created the heavens and the earth with the truth; indeed in this is a sign for the Muslims.\n",
        "TRANSLATION_5": "Allah created the heavens and the earth with truth. Verily, therein is surely a sign for those who believe.\n",
        "TRANSLATION_6": "Allah created the heavens and the earth with truth; most surely there is a sign in this for the believers.\n",
        "TRANSLATION_7": "God created the heavens and the earth with the truth; surely in that is a sign to the believers.\n",
        "TRANSLATION_8": "Allah created the heavens and the earth with truth. Lo! therein is indeed a portent for believers.\n",
        "TRANSLATION_9": "God has created the heavens and the earth for a purpose; surely in this there is a sign for true believers.\n",
        "TRANSLATION_10": "Allah hath created the heavens and the earth in truth; verily there in is a sign for the believers.\n",
        "TRANSLATION_11": "Allah created the heavens and the earth with consummate wisdom. There is indeed a sign in that for the faithful.\n",
        "TRANSLATION_12": "Allah created the heavens and the earth in true (proportions): verily in that is a Sign for those who believe.\n",
        "TRANSLATION_13": "(Allah says to His Prophet Muhammad SAW): \"Allah (Alone) created the heavens and the earth with truth (and none shared Him in their creation).\" Verily! Therein is surely a sign for those who believe.\n",
        "TRANSLATION_14": "Allah has created the heavens and the earth with the truth. Surely, in that there is a sign for believers.\n",
        "TRANSLATION_15": "God created the heavens and the earth with truth. Surely in that is a sign for the believers.\n",
        "TRANSLATION_16": "Allah created the heavens and the earth in truth. Indeed in that is a sign for the believers.\n",
        "TRANSLATION_17": "[29:44] God created the heavens and the earth with truth, that is, rightly. Surely in that there is a sign, indicating His power, exalted be He, for believers — they are specifically mentioned because they are the ones to benefit thereby in their faith, in contrast to disbelievers.\n",
        "TRANSLATION_18": "(Allah created the heavens and the earth with truth) for the Truth, not for falsehood. (Lo! Therein) in the similitudes that I coined (is indeed a portent) a lesson (for believers) in Muhammad (pbuh) and in the Qur'an.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "29:44",
            "45:3",
            "39:63",
            "10:6",
            "16:65",
            "2:252",
            "22:64",
            "10:55",
            "3:5",
            "4:132"
        ],
        "BIBLE": [
            "prophets:jeremiah:10:11",
            "prophets:ii%20kings:19:15",
            "torah:deuteronomy:10:14",
            "writings:i%20chronicles:16:31",
            "prophets:i%20kings:8:27",
            "torah:genesis:2:4",
            "prophets:jeremiah:14:13",
            "torah:genesis:14:19",
            "writings:psalms:58:12",
            "torah:genesis:1:1"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:4:3"
        ]
    }
}