{
    "VERSE": "29:45",
    "ARABIC": "ٱتْلُ مَآ أُوحِىَ إِلَيْكَ مِنَ ٱلْكِتَٰبِ وَأَقِمِ ٱلصَّلَوٰةَ إِنَّ ٱلصَّلَوٰةَ تَنْهَىٰ عَنِ ٱلْفَحْشَآءِ وَٱلْمُنكَرِ وَلَذِكْرُ ٱللَّهِ أَكْبَرُ وَٱللَّهُ يَعْلَمُ مَا تَصْنَعُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Recite what has been revealed to you of the Book and establish salat. Salat precludes indecency and wrongdoing. And remembrance of Allah is greater still. Allah knows what you do.",
        "TRANSLATION_1": "Recite what has been revealed to you of this Book, and be constant in devotion. Surely prayer keeps you away from the obscene and detestable, but the remembrance of God is greater far; and God knows what you do.\n",
        "TRANSLATION_2": "(O Prophet), recite the Book that has been revealed to you and establish Prayer. Surely Prayer forbids indecency and evil. And Allah's remembrance is of even greater merit. Allah knows all that you do.\n",
        "TRANSLATION_3": "(Muhammad), recite to them what has been revealed to you in the Book and be steadfast in prayer; prayer keeps one away from indecency and evil. It is the greatest act of worshipping God. God knows what you do.\n",
        "TRANSLATION_4": "O dear Prophet (Mohammed – peace and blessings be upon him), recite from the Book which has been sent down to you, and establish the prayer; indeed the prayer stops from indecency and evil; and indeed the remembrance of Allah is the greatest; and Allah knows all what you do.\n",
        "TRANSLATION_5": "Recite what has been revealed to you of the Book, and perform the Salah. Verily, the Salah prevents from Al-Fahsha' (immoral sins) and Al-Munkar (evil deeds) and the remembering (praising) of Allah is greater indeed. And Allah knows what you do.\n",
        "TRANSLATION_6": "Recite that which has been revealed to you of the Book and keep up prayer; surely prayer keeps (one) away from indecency and evil, and certainly the remembrance of Allah is the greatest, and Allah knows what you do.\n",
        "TRANSLATION_7": "Recite what has been revealed to thee of the Book, and perform the prayer; prayer forbids indecency and dishonour. God's remembrance is greater; and God knows the things you work.\n",
        "TRANSLATION_8": "Recite that which hath been inspired in thee of the Scripture, and establish worship. Lo! worship preserveth from lewdness and iniquity, but verily remembrance of Allah is more important. And Allah knoweth what ye do.\n",
        "TRANSLATION_9": "Recite what has been revealed to you of the book, and pray regularly. Surely prayer restrains one from indecency and evil and remembrance of God is greater. God has knowledge of all your actions.\n",
        "TRANSLATION_10": "Recite thou that which hath been revealed unto thee of the Book and establish thou the prayer; verily prayer preventeth man from indecency and that which is disreputable: and surely the remembrance of Allah is the greatest. And Allah knoweth that which ye perform.\n",
        "TRANSLATION_11": "Recite what has been revealed to you of the Book, and maintain the prayer. Indeed the prayer restrains from indecent and wrongful conduct, and the remembrance of Allah is surely greater. And Allah knows whatever [deeds] you do.\n",
        "TRANSLATION_12": "Recite what is sent of the Book by inspiration to thee, and establish regular Prayer: for Prayer restrains from shameful and unjust deeds; and remembrance of Allah is the greatest (thing in life) without doubt. And Allah knows the (deeds) that ye do.\n",
        "TRANSLATION_13": "Recite (O Muhammad SAW) what has been revealed to you of the Book (the Quran), and perform As-Salat (Iqamat-as-Salat). Verily, As-Salat (the prayer) prevents from Al-Fahsha' (i.e. great sins of every kind, unlawful sexual intercourse, etc.) and Al-Munkar (i.e. disbelief, polytheism, and every kind of evil wicked deed, etc.) and the remembering (praising, etc.) of (you by) Allah (in front of the angels) is greater indeed [than your remembering (praising, etc.) Allah in prayers, etc.]. And Allah knows what you do.\n",
        "TRANSLATION_14": "Recite what has been sent down to you of the Book, and establish the prayer. Prayer forbids indecency and dishonor. The remembrance of Allah is greater, and Allah knows what you do.\n",
        "TRANSLATION_15": "Recite what is revealed to you of the Scripture, and perform the prayer. The prayer prevents indecencies and evils. And the remembrance of God is greater. And God knows what you do.\n",
        "TRANSLATION_16": "Recite, [O Muhammad], what has been revealed to you of the Book and establish prayer. Indeed, prayer prohibits immorality and wrongdoing, and the remembrance of Allah is greater. And Allah knows that which you do.\n",
        "TRANSLATION_17": "[29:45] Recite what has been revealed to you of the Book, the Qur’ān, and maintain prayer; truly prayer prohibits lewd acts and indecency, [defined as such] according to the Law. In other words, that is its purpose provided that the person adheres to [observance of] it. And the remembrance of God is surely greater, than other acts of obedience, and God knows what you do, and He will requite you for them.\n",
        "TRANSLATION_18": "(Recite that which hath been inspired in thee of the Scripture) He says: recite unto them, Muhammad, that which Gabriel brought down to you, i.e. the Qur'an, (and establish worship) fulfil the five daily prayers. (Lo! worship preserveth from lewdness) transgressions (and iniquity) that which is unknown in the Shari'ah or Sunnah; as long as one performs the prayers, they will prevent one from lewdness and iniquity, (but verily remembrance of Allah is more important) He says: Allah's remembrance of you, through His forgiveness and reward, is greater than your remembrance of Him during the prayer. (And Allah knoweth what ye do) whether it is good or evil.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "29:45",
            "4:103",
            "35:29",
            "40:10",
            "2:153",
            "2:169",
            "7:196",
            "33:47",
            "35:31",
            "13:36"
        ],
        "BIBLE": [
            "torah:genesis:39:9",
            "writings:psalms:141:4",
            "prophets:jeremiah:31:34",
            "prophets:i%20samuel:20:13",
            "prophets:i%20samuel:25:34",
            "prophets:isaiah:26:12",
            "prophets:i%20kings:17:18",
            "prophets:ezekiel:18:24",
            "writings:ecclesiastes:7:15",
            "torah:leviticus:5:17"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:4:3"
        ]
    }
}