{
    "VERSE": "29:49",
    "ARABIC": "بَلْ هُوَ ءَايَٰتٌۢ بَيِّنَٰتٌ فِى صُدُورِ ٱلَّذِينَ أُوتُوا۟ ٱلْعِلْمَ وَمَا يَجْحَدُ بِـَٔايَٰتِنَآ إِلَّا ٱلظَّٰلِمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "No, it is Clear Signs reposited in the hearts of those who have been given knowledge. Only wrongdoers deny Our Signs.",
        "TRANSLATION_1": "In fact, in the minds of those who have intelligence these are clear signs. No one denies Our revelations except those who are unjust.\n",
        "TRANSLATION_2": "But it is a set of Clear Signs in the hearts of those who have been endowed with knowledge. None except the utterly unjust will deny Our Signs.\n",
        "TRANSLATION_3": "In fact, the Quran consists of illustrious verses that exist in the hearts of those who have knowledge. No one rejects Our revelations except the unjust ones.\n",
        "TRANSLATION_4": "In fact they are clear verses in the hearts of those who have been given knowledge; and none deny Our verses except the unjust.\n",
        "TRANSLATION_5": "Nay, but it is clear Ayat, (preserved) in the breasts of those who have been given knowledge. And none but the wrongdoers deny Our Ayat.\n",
        "TRANSLATION_6": "Nay! these are clear communications in the breasts of those who are granted knowledge; and none deny Our communications except the unjust.\n",
        "TRANSLATION_7": "Nay; rather it is signs, clear signs in the breasts of those who have been given knowledge; and none denies Our signs but the evildoers.\n",
        "TRANSLATION_8": "But it is clear revelations in the hearts of those who have been given knowledge, and none deny Our revelations save wrong-doers.\n",
        "TRANSLATION_9": "But the Quran is a revelation that is clear to the hearts of those endowed with knowledge. Only the evil-doers refuse to acknowledge Our revelations.\n",
        "TRANSLATION_10": "Aye! it in itself manifest signs in the breasts of those who have been vouchsafed knowledge, and none gainsay Our signs save the wrong-doers.\n",
        "TRANSLATION_11": "Indeed, it is [present as] manifest signs in the breasts of those who have been given knowledge, and none contests Our signs except wrongdoers.\n",
        "TRANSLATION_12": "Nay, here are Signs self-evident in the hearts of those endowed with knowledge: and none but the unjust reject Our Signs.\n",
        "TRANSLATION_13": "Nay, but they, the clear Ayat [i.e. the description and the qualities of Prophet Muhammad SAW written like verses in the Taurat (Torah) and the Injeel (Gospel)] are preserved in the breasts of those who have been given knowledge (from the people of the Scriptures). And none but the Zalimun (polytheists and wrongdoers, etc.) deny Our Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.).\n",
        "TRANSLATION_14": "No, rather they are clear verses in the chests of those who have been given knowledge. None disbelieves Our verses except the harmdoers.\n",
        "TRANSLATION_15": "In fact, it is clear signs in the hearts of those given knowledge. No one renounce Our signs except the unjust.\n",
        "TRANSLATION_16": "Rather, the Qur'an is distinct verses [preserved] within the breasts of those who have been given knowledge. And none reject Our verses except the wrongdoers.\n",
        "TRANSLATION_17": "[29:49] Nay, but it, that is, the Qur’ān which you have brought, is clear signs in the breasts of those who have been given knowledge, namely, the believers, who preserve it [in their hearts], and none denies Our signs except wrongdoers, namely, the Jews — they denied them after they were manifested to them.\n",
        "TRANSLATION_18": "(But it) your attributes and description (is clear revelations) are clear signs whose knowledge is (in the hearts of those who have been given knowledge) the knowledge of the Torah; it is also said this means: the Qur'an consists of clear verses which explain the lawful and the unlawful, the commands and prohibitions, and this is preserved in the hearts of those who have been given knowledge of the Qur'an, (and none deny 453 our revelations) Muhammad (pbuh) and the Qur'an (save wrong-doers) the disbelievers: the Jews, Christians and idolaters.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "29:49",
            "2:99",
            "40:83",
            "6:49",
            "51:37",
            "28:36",
            "20:133",
            "57:6",
            "7:147",
            "42:35"
        ],
        "BIBLE": [
            "prophets:i%20kings:3:9",
            "prophets:i%20kings:3:12",
            "prophets:i%20kings:14:8",
            "prophets:isaiah:47:8",
            "writings:psalms:21:3",
            "writings:psalms:119:34",
            "prophets:isaiah:55:4",
            "torah:numbers:20:24",
            "writings:ecclesiastes:1:13",
            "writings:psalms:111:6"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:3:4"
        ]
    }
}