{
    "VERSE": "29:5",
    "ARABIC": "مَن كَانَ يَرْجُوا۟ لِقَآءَ ٱللَّهِ فَإِنَّ أَجَلَ ٱللَّهِ لَءَاتٍ وَهُوَ ٱلسَّمِيعُ ٱلْعَلِيمُ",
    "ENGLISH": {
        "TRANSLATION_0": "As for those who look forward to meeting Allah, Allah's appointed time is certainly coming. He is the All- Hearing, the All-Knowing.",
        "TRANSLATION_1": "He who hopes to meet God (should know) that God's appointed time will surely come. He is all-hearing and all-knowing.\n",
        "TRANSLATION_2": "Let him who looks forward to meeting Allah know that Allah's appointed term will surely come to pass. He is All-Hearing, All-Knowing.\n",
        "TRANSLATION_3": "Let those who have the desire to be in the presence of God on the Day of Judgment know that their day will certainly be coming. God is All-Hearing and All-Knowing.\n",
        "TRANSLATION_4": "Whoever expects to meet Allah – then indeed the time appointed by Allah will come; and He is the All Hearing, the All Knowing.\n",
        "TRANSLATION_5": "Whoever hopes in meeting with Allah, then Allah's term is surely coming, and He is the All-Hearer, the All-Knower.\n",
        "TRANSLATION_6": "Whoever hopes to meet Allah, the term appointed by Allah will then most surely come; and He is the Hearing, the Knowing.\n",
        "TRANSLATION_7": "Whoso looks to encounter God, God's term is coming; He is the All-hearing, the All-knowing.\n",
        "TRANSLATION_8": "Whoso looketh forward to the meeting with Allah (let him know that) Allah's reckoning is surely nigh, and He is the Hearer, the Knower.\n",
        "TRANSLATION_9": "He who hopes to meet God should know that God's appointed hour is sure to come. He is the All Hearing, the All Knowing.\n",
        "TRANSLATION_10": "Whosoever hopeth for the meeting with Allah, then Allah's term is surely coming, and He is the Hearer, the Knower.\n",
        "TRANSLATION_11": "Whoever expects to encounter Allah [should know that] Allah’s [appointed] time will indeed come, and He is the All-hearing, the All-knowing.\n",
        "TRANSLATION_12": "For those whose hopes are in the meeting with Allah (in the Hereafter, let them strive); for the term (appointed) by Allah is surely coming and He hears and knows (all things).\n",
        "TRANSLATION_13": "Whoever hopes for the Meeting with Allah, then Allah's Term is surely coming. and He is the All-Hearer, the All-Knower.\n",
        "TRANSLATION_14": "He who hopes to meet Allah (must know) that the term of Allah is coming. He is the Hearer, the Knower.\n",
        "TRANSLATION_15": "Whoever looks forward to the meeting with God—the appointed time of God is coming. He is the All-Hearing, the All-Knowing.\n",
        "TRANSLATION_16": "Whoever should hope for the meeting with Allah - indeed, the term decreed by Allah is coming. And He is the Hearing, the Knowing.\n",
        "TRANSLATION_17": "[29:5] Whoever expects to encounter God, [should know that] God’s [appointed] term, for this [encounter], will indeed come; so let him prepare for it. And He is the Hearer, of the sayings of His servants, the Knower, of their actions.\n",
        "TRANSLATION_18": "(Whoso looketh forward to) whoever fears (the meeting with Allah (let him know that) Allah's reckoning) resurrection after death (is surely nigh) will surely happen, (and He is the Hearer) of what both parties said on the Day of Badr, (the Knower) of that which befalls them.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "29:5",
            "2:227",
            "8:61",
            "10:65",
            "41:36",
            "2:244",
            "2:137",
            "22:59",
            "28:56",
            "26:220"
        ],
        "BIBLE": [
            "prophets:isaiah:44:7",
            "writings:daniel:2:29",
            "prophets:zechariah:14:7",
            "prophets:i%20kings:18:36",
            "prophets:jeremiah:42:4",
            "prophets:ezekiel:38:18",
            "prophets:zechariah:6:15",
            "prophets:ezekiel:47:9",
            "prophets:joshua:23:14",
            "prophets:zechariah:8:23"
        ]
    }
}