{
    "VERSE": "29:50",
    "ARABIC": "وَقَالُوا۟ لَوْلَآ أُنزِلَ عَلَيْهِ ءَايَٰتٌ مِّن رَّبِّهِۦ قُلْ إِنَّمَا ٱلْءَايَٰتُ عِندَ ٱللَّهِ وَإِنَّمَآ أَنَا۠ نَذِيرٌ مُّبِينٌ",
    "ENGLISH": {
        "TRANSLATION_0": "They say, 'Why have no Signs been sent down to him from his Lord?' Say: The Signs are with Allah. I am only a clear warner.'",
        "TRANSLATION_1": "For they say: \"How Is it no signs were sent down to him from his Lord?\" Say: \"The signs are with God. I am only a warner, plain and simple.\"\n",
        "TRANSLATION_2": "They say: “Why were Signs from his Lord not sent down upon him?” Say: “The Signs are only with Allah. As for me, I am no more than a plain warner.”\n",
        "TRANSLATION_3": "They say, \"Why a miracle is not sent to him from his Lord.\" Say, \"Miracles are in the hands of God. I am simply a warner.\"\n",
        "TRANSLATION_4": "And they said, “Why did not signs come down to him from his Lord?” Say, “Signs are only with Allah; and I am purely a Herald of plain warning.”\n",
        "TRANSLATION_5": "And they say: \"Why are not signs sent down to him from his Lord\" Say: \"The signs are only with Allah, and I am only a plain warner.\"\n",
        "TRANSLATION_6": "And they say: Why are not signs sent down upon him from his Lord? Say: The signs are only with Allah, and I am only a plain warner.\n",
        "TRANSLATION_7": "They say, 'Why have signs not been gent down upon him from his Lord?' Say: 'The signs are only with God, and I am only a plain warner.\n",
        "TRANSLATION_8": "And they say: Why are not portents sent down upon him from his Lord? Say: Portents are with Allah only, and I am but a plain warner.\n",
        "TRANSLATION_9": "They say, \"Why has no sign been given to him by his Lord?\" Say, \"The signs are in the hands of God. I am but a plain warner.\"\n",
        "TRANSLATION_10": "And they say: wherefore are not signs sent down upon him from his Lord! Say thou: signs are with Allah only, and I am but a manifest warner.\n",
        "TRANSLATION_11": "They say, ‘Why has not some sign been sent down to him from his Lord?’ Say, ‘These signs are only from Allah, and I am only a manifest warner.’\n",
        "TRANSLATION_12": "Ye they say: \"Why are not Signs sent down to him from his Lord?\" Say: \"The signs are indeed with Allah: and I am indeed a clear Warner.\"\n",
        "TRANSLATION_13": "And they say: \"Why are not signs sent down to him from his Lord? Say: \"The signs are only with Allah, and I am only a plain warner.\"\n",
        "TRANSLATION_14": "They ask: 'Why has not a sign been sent down upon him from his Lord' Say: 'The signs are only with Allah. I am only a clear warner'\n",
        "TRANSLATION_15": "And they said, “If only a miracle from his Lord was sent down to him.” Say, “Miracles are only with God, and I am only a clear warner.”\n",
        "TRANSLATION_16": "But they say, \"Why are not signs sent down to him from his Lord?\" Say, \"The signs are only with Allah, and I am only a clear warner.\"\n",
        "TRANSLATION_17": "[29:50] And they, namely, the disbelievers of Mecca, say, ‘Why has not some sign been sent down to him, [to] Muhammad (s), from his Lord?’ (āyatun, ‘sign’: a variant reading has āyātun, ‘signs’) such as the she-camel of Sālih, or the staff of Moses, or the Table of Jesus. Say, to them: ‘Signs are only with God, and He sends them down as He will, and I am only a plain warner’, making manifest my warning of [the punishment of] the Fire for disobedient people.\n",
        "TRANSLATION_18": "(And they say) the Jews, Christians and idolaters say: (Why are not portents) signs (sent down upon him) upon Muhammad (from his Lord) as were sent down to Moses and Jesus? (Say) to them, Muhammad: (Portents are with Allah only) signs are from Allah only, (and I am but a plain warner) a warning messenger addressing you in a language you understand.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "29:50",
            "10:20",
            "13:27",
            "67:26",
            "8:2",
            "6:37",
            "23:117",
            "22:47",
            "6:109",
            "28:87"
        ],
        "BIBLE": [
            "prophets:jeremiah:32:25",
            "prophets:jeremiah:32:36",
            "writings:i%20chronicles:22:18",
            "writings:psalms:119:73",
            "torah:genesis:24:18",
            "prophets:joshua:6:2",
            "prophets:joshua:8:1",
            "torah:numbers:15:23",
            "torah:genesis:31:42",
            "prophets:i%20samuel:30:23"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:3",
            
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:9"
        ]
    }
}