{
    "VERSE": "29:54",
    "ARABIC": "يَسْتَعْجِلُونَكَ بِٱلْعَذَابِ وَإِنَّ جَهَنَّمَ لَمُحِيطَةٌۢ بِٱلْكَٰفِرِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "They ask you to hasten the punishment but Hell already encircles the kafirun.",
        "TRANSLATION_1": "They want you to hasten the punishment: Hell will indeed surround the unbelievers.\n",
        "TRANSLATION_2": "They ask you to hasten the chastisement upon them although Hell encompasses the unbelievers.\n",
        "TRANSLATION_3": "They demand you to bring upon them the torment immediately. Hell will certainly engulf the unbelievers.\n",
        "TRANSLATION_4": "They urge you to hasten the punishment; and indeed hell has encompassed the disbelievers.\n",
        "TRANSLATION_5": "They ask you to hasten on the torment. And verily, Hell, of a surety, will encompass the disbelievers.\n",
        "TRANSLATION_6": "They ask you to hasten on the chastisement, and most surely hell encompasses the unbelievers;\n",
        "TRANSLATION_7": "They demand of thee to hasten the chastisement! Lo, Gehenna encompasses the unbelievers.\n",
        "TRANSLATION_8": "They bid thee hasten on the doom, when lo! hell verily will encompass the disbelievers\n",
        "TRANSLATION_9": "They ask you to hasten the punishment, but surely, Hell is [already] encompassing those who deny the truth.\n",
        "TRANSLATION_10": "They ask thee to hasten on the torment; and verily the Hell is about to encompass the infidels.\n",
        "TRANSLATION_11": "They ask you to hasten the punishment, and indeed hell will besiege the faithless\n",
        "TRANSLATION_12": "They ask thee to hasten on the Punishment: but, of a surety, Hell will encompass the Rejecters of Faith!-\n",
        "TRANSLATION_13": "They ask you to hasten on the torment. And verily! Hell, of a surety, will encompass the disbelievers.\n",
        "TRANSLATION_14": "They demand that you hasten on the punishment! Gehenna (Hell) will encompass the unbelievers.\n",
        "TRANSLATION_15": "They urge you to hasten the punishment. But Hell will engulf the disbelievers.\n",
        "TRANSLATION_16": "They urge you to hasten the punishment. And indeed, Hell will be encompassing of the disbelievers\n",
        "TRANSLATION_17": "[29:54] And they ask you to hasten the chastisement, in this world. And lo! Hell shall encompass the disbelievers,\n",
        "TRANSLATION_18": "(They bid you) Muhammad (hasten on the doom) in the life of this world, (when lo! Hell verily will encompass the disbelievers) and gather them all together.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "29:54",
            "43:74",
            "3:88",
            "2:162",
            "20:48",
            "85:10",
            "23:76",
            "23:64",
            "37:33",
            "44:30"
        ],
        "BIBLE": [
            "torah:genesis:43:9",
            "torah:leviticus:26:41",
            "torah:genesis:44:32",
            "torah:exodus:3:12",
            "torah:exodus:11:1",
            "prophets:jeremiah:30:14",
            "prophets:isaiah:43:9",
            "torah:exodus:16:32",
            "writings:proverbs:30:7",
            "torah:deuteronomy:9:28"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:4"
        ]
    }
}