{
    "VERSE": "29:59",
    "ARABIC": "ٱلَّذِينَ صَبَرُوا۟ وَعَلَىٰ رَبِّهِمْ يَتَوَكَّلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "those who are steadfast and put their trust in their Lord.",
        "TRANSLATION_1": "Who persevere and place their trust in their Lord.\n",
        "TRANSLATION_2": "who remained steadfast and put their trust in their Lord!\n",
        "TRANSLATION_3": "who have exercised patience and who have had trust in their Lord.\n",
        "TRANSLATION_4": "Those who patiently endured and who rely only upon their Lord.\n",
        "TRANSLATION_5": "Those who are patient, and put their trust in their Lord.\n",
        "TRANSLATION_6": "Those who are patient, and on their Lord do they rely.\n",
        "TRANSLATION_7": "such men as are patient, and put their trust in their Lord.\n",
        "TRANSLATION_8": "Who persevere, and put their trust in their Lord!\n",
        "TRANSLATION_9": "and who are steadfast and put their trust in their Lord.\n",
        "TRANSLATION_10": "Who persevere and in their Lord trust!\n",
        "TRANSLATION_11": "—Those who are patient and who put their trust in their Lord.\n",
        "TRANSLATION_12": "Those who persevere in patience, and put their trust, in their Lord and Cherisher.\n",
        "TRANSLATION_13": "Those who are patient, and put their trust (only) in their Lord (Allah).\n",
        "TRANSLATION_14": "those who are patient, and put their trust in their Lord.\n",
        "TRANSLATION_15": "Those who endure patiently, and in their Lord they trust.\n",
        "TRANSLATION_16": "Who have been patient and upon their Lord rely.\n",
        "TRANSLATION_17": "[29:59] they are, those who are steadfast, in [enduring] the harm inflicted [upon them] by the idolaters, and in [enduring] the Emigration, in order to make manifest the religion [of Islam], and who put their trust in their Lord, so that He provides for them whence they do not expect.\n",
        "TRANSLATION_18": "(Who persevere) who are steadfast in performing the commands of Allah and in facing hardship, (and put their trust in their Lord) and not in anyone other than Him!\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "16:42",
            "29:59",
            "25:64",
            "23:59",
            "2:46",
            "20:122",
            "84:2",
            "84:5",
            "23:58",
            "23:98"
        ],
        "BIBLE": [
            "prophets:jeremiah:17:7",
            "writings:psalms:146:3",
            "writings:psalms:40:5",
            "writings:psalms:118:8",
            "prophets:ezekiel:37:14",
            "prophets:ezekiel:14:18",
            "writings:proverbs:29:25",
            "writings:job:20:4",
            "prophets:ezekiel:36:10",
            "prophets:zechariah:7:2"
        ]
    }
}