{
    "VERSE": "29:6",
    "ARABIC": "وَمَن جَٰهَدَ فَإِنَّمَا يُجَٰهِدُ لِنَفْسِهِۦٓ إِنَّ ٱللَّهَ لَغَنِىٌّ عَنِ ٱلْعَٰلَمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Whoever does jihad does it entirely for himself. Allah is Rich Beyond Need of any being.",
        "TRANSLATION_1": "He who strives does so for himself. Verily God is independent of the creatures of the world.\n",
        "TRANSLATION_2": "Whosoever strives (in the cause of Allah) does so to his own good. Surely Allah stands in no need of anyone in the whole Universe.\n",
        "TRANSLATION_3": "Whoever strives hard should know that it is for his own good. God is independent of the whole world.\n",
        "TRANSLATION_4": "And whoever strives in Allah's cause, strives only for his own benefit; indeed Allah is Independent of the entire creation.\n",
        "TRANSLATION_5": "And whosoever strives, he strives only for himself. Verily, Allah stands not in need of any of the creatures.\n",
        "TRANSLATION_6": "And whoever strives hard, he strives only for his own soul; most surely Allah is Self-sufficient, above (need of) the worlds.\n",
        "TRANSLATION_7": "Whosoever struggles, struggles only to his own gain; surely God is All-sufficient nor needs any being.\n",
        "TRANSLATION_8": "And whosoever striveth, striveth only for himself, for lo! Allah is altogether Independent of (His) creatures.\n",
        "TRANSLATION_9": "And whoever strives, strives only for himself, God is independent of all His creation,\n",
        "TRANSLATION_10": "And whosoever strive, striveth only for himself: verily Allah is Independent of the worlds.\n",
        "TRANSLATION_11": "Whoever strives, strives only for his own sake. Indeed Allah has no need of the creatures.\n",
        "TRANSLATION_12": "And if any strive (with might and main), they do so for their own souls: for Allah is free of all needs from all creation.\n",
        "TRANSLATION_13": "And whosoever strives, he strives only for himself. Verily, Allah is free of all wants from the 'Alamin (mankind, jinns, and all that exists).\n",
        "TRANSLATION_14": "He who strives, strives for himself. Allah is the Rich, independent of the worlds.\n",
        "TRANSLATION_15": "Whoever strives, strives only for himself. God is Independent of the beings.\n",
        "TRANSLATION_16": "And whoever strives only strives for [the benefit of] himself. Indeed, Allah is free from need of the worlds.\n",
        "TRANSLATION_17": "[29:6] And whoever struggles, in war or against [the temptations of] his own soul, struggles only for his own sake, because the benefits [to be reaped] from his struggle will be for his sake and not for God’s. For truly God is Independent of [the creatures of] all the Worlds, mankind, jinn and angels, and [He is also without need] of their worship.\n",
        "TRANSLATION_18": "It was then revealed about 'AN and his two fellow companions and the boasting they had uttered: (And whosoever striveth) in the way of Allah on the Day of Badr, (striveth only for himself) he has the reward of that, (for lo! Allah is altogether Independent of (His) creatures) He is free of need for the striving of His creatures.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "29:6",
            "31:12",
            "4:111",
            "29:5",
            "28:56",
            "27:92",
            "3:61",
            "14:8",
            "47:38",
            "22:64"
        ],
        "BIBLE": [
            "prophets:ezekiel:14:23",
            "torah:deuteronomy:4:21",
            "prophets:isaiah:55:2",
            "writings:proverbs:19:8",
            "writings:psalms:143:8",
            "torah:genesis:45:1",
            "torah:numbers:30:10",
            "prophets:ezekiel:36:11",
            "prophets:isaiah:56:11",
            "writings:proverbs:11:17"
        ]
    }
}