{
    "VERSE": "29:68",
    "ARABIC": "وَمَنْ أَظْلَمُ مِمَّنِ ٱفْتَرَىٰ عَلَى ٱللَّهِ كَذِبًا أَوْ كَذَّبَ بِٱلْحَقِّ لَمَّا جَآءَهُۥٓ أَلَيْسَ فِى جَهَنَّمَ مَثْوًى لِّلْكَٰفِرِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Who could do greater wrong than someone who invents lies against Allah or denies the truth when it comes to him? Is there not shelter in Hell for the kafirun?",
        "TRANSLATION_1": "Who is more unjust than he who fabricates a lie about God, or denies the truth when it has come to him? Is there not an abode for unbelievers in Hell?\n",
        "TRANSLATION_2": "Who can be more unjust than he who foists a lie on Allah or gives the lie to the Truth after it has come to him? Is Hell not the resort of the unbelievers?\n",
        "TRANSLATION_3": "Who is more unjust than one who invents falsehood against God or rejects the Truth after it has come to him? Is not hell the dwelling for the disbelievers.\n",
        "TRANSLATION_4": "And who is more unjust than one who fabricates lies against Allah, or denies the truth* when it comes to him? Is there not a place in hell for disbelievers? (* The Holy Prophet and / or the Holy Qur’an).\n",
        "TRANSLATION_5": "And who does more wrong than he who invents a lie against Allah or denies the truth, when it comes to him Is there not a dwelling in Hell for the disbelievers\n",
        "TRANSLATION_6": "And who is more unjust than one who forges a lie against Allah, or gives the lie to the truth when it has come to him? Will not in hell be the abode of the unbelievers?\n",
        "TRANSLATION_7": "And who does greater evil than he who forges against God a lie, or cries lies to the truth when it comes to him? What, is there not in Gehenna a lodging for the unbelievers?\n",
        "TRANSLATION_8": "Who doeth greater wrong than he who inventeth a lie concerning Allah, or denieth the truth when it cometh unto him? Is not there a home in hell for disbelievers?\n",
        "TRANSLATION_9": "Who does greater wrong than he who invents a lie about God or rejects the truth when it comes to him? Is Hell not the home for those who deny the truth.\n",
        "TRANSLATION_10": "And who is a greater wrong-doer than he who fabricateth a lie against Allah or belieth the truth when it cometh unto him Will there not be in the Hell an abiding-place for the infidels?\n",
        "TRANSLATION_11": "Who is a greater wrongdoer than him who fabricates a lie against Allah, or denies the truth when it comes to him? Is not the [final] abode of the faithless in hell?\n",
        "TRANSLATION_12": "And who does more wrong than he who invents a lie against Allah or rejects the Truth when it reaches him? Is there not a home in Hell for those who reject Faith?\n",
        "TRANSLATION_13": "And who does more wrong than he who invents a lie against Allah or denies the truth (Muhammad SAW and his doctrine of Islamic Monotheism and this Quran), when it comes to him? Is there not a dwelling in Hell for disbelievers (in the Oneness of Allah and in His Messenger Muhammad SAW)?\n",
        "TRANSLATION_14": "And who does greater evil that he who forges a lie against Allah or belied the truth when it comes to him! Is there not a lodging in Gehenna for the unbelievers?\n",
        "TRANSLATION_15": "And who does greater wrong than he who fabricates lies and attributes them to God, or calls the truth a lie when it has come to him? Is there not in Hell a dwelling for the blasphemers?\n",
        "TRANSLATION_16": "And who is more unjust than one who invents a lie about Allah or denies the truth when it has come to him? Is there not in Hell a [sufficient] residence for the disbelievers?\n",
        "TRANSLATION_17": "[29:68] And who — in other words, there is none [who] — does greater wrong than he who invents a lie against God, by ascribing partners to Him, or denies truth, be it the Prophet or the Book, when it comes to him? Is there not in Hell a lodging, an abode, for the disbelievers?, in other words, there is such [an abode] therein and such [a person] belongs with them.\n",
        "TRANSLATION_18": "(Who doeth greater wrong) who is more insolent towards, and bolder against, Allah (than he who inventeth a lie concerning Allah) thus ascribing to Him a son and partners, (or denieth the Truth) or denies Muhammad (pbuh) and the Qur'an (when it cometh unto him) when Muhammad (pbuh) and the Qur'an come to him? (Is not there a home in hell for disbelievers) Abu Jahl and his host?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "29:68",
            "39:32",
            "6:21",
            "10:17",
            "61:7",
            "10:82",
            "58:14",
            "11:18",
            "39:60",
            "18:15"
        ],
        "BIBLE": [
            "prophets:jeremiah:7:14",
            "torah:genesis:30:6",
            "prophets:judges:18:10",
            "prophets:jeremiah:7:7",
            "prophets:judges:15:19",
            "prophets:jeremiah:19:6",
            "prophets:ezekiel:16:33",
            "torah:deuteronomy:12:21",
            "torah:genesis:30:18",
            "prophets:i%20kings:9:13"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:1:12",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:5:1"
        ]
    }
}