{
    "VERSE": "29:69",
    "ARABIC": "وَٱلَّذِينَ جَٰهَدُوا۟ فِينَا لَنَهْدِيَنَّهُمْ سُبُلَنَا وَإِنَّ ٱللَّهَ لَمَعَ ٱلْمُحْسِنِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "As for those who do jihad in Our Way, We will guide them to Our Paths. Truly Allah is with the good- doers.",
        "TRANSLATION_1": "We shall guide those who strive in Our cause to the paths leading straight to Us. Surely God is with those who do good.\n",
        "TRANSLATION_2": "As for those who strive in Our cause, We shall surely guide them to Our Ways. Indeed Allah is with those who do good.\n",
        "TRANSLATION_3": "We shall certainly guide those who strive for Our cause to Our path. God is certainly with the righteous ones.\n",
        "TRANSLATION_4": "And those who strove in Our way – We shall surely show them Our paths; and indeed Allah is with the virtuous.\n",
        "TRANSLATION_5": "As for those who strive hard for Us, We will surely guide them to Our paths. And verily, Allah is with the doers of good.\n",
        "TRANSLATION_6": "And (as for) those who strive hard for Us, We will most certainly guide them in Our ways; and Allah is most surely with the doers of good.\n",
        "TRANSLATION_7": "But those who struggle in Our cause, surely We shall guide them in Our ways; and God is with the good-doers.\n",
        "TRANSLATION_8": "As for those who strive in Us, We surely guide them to Our paths, and lo! Allah is with the good.\n",
        "TRANSLATION_9": "We will surely guide in Our ways those who strive hard for Our cause, God is surely with the righteous.\n",
        "TRANSLATION_10": "And those who strive hard in us, We shall surely guide them in Our paths; verily Allah is with the welldoers.\n",
        "TRANSLATION_11": "As for those who strive in Us, We shall surely guide them in Our ways, and Allah is indeed with the virtuous.\n",
        "TRANSLATION_12": "And those who strive in Our (cause),- We will certainly guide them to our Paths: For verily Allah is with those who do right.\n",
        "TRANSLATION_13": "As for those who strive hard in Us (Our Cause), We will surely guide them to Our Paths (i.e. Allah's Religion - Islamic Monotheism). And verily, Allah is with the Muhsinun (good doers).\"\n",
        "TRANSLATION_14": "Those who struggle in Our cause, We will surely guide them to Our ways; and Allah is with those who do good.\n",
        "TRANSLATION_15": "As for those who strive for Us—We will guide them in Our ways. God is with the doers of good.\n",
        "TRANSLATION_16": "And those who strive for Us - We will surely guide them to Our ways. And indeed, Allah is with the doers of good.\n",
        "TRANSLATION_17": "[29:69] But as for those who struggle for Our sake, for Our truth, We shall assuredly guide them in Our ways, that is, the means to come to Us, and truly God is with the virtuous, the believers, assisting and helping. Meccan, except for verse 17, which is Medinese; it consists of 60 verses, revealed after [sūrat] al-Inshiqāq.\n",
        "TRANSLATION_18": "(As for those who strive in Us) in Our obedience; Ibn 'Abbas said this means: those who strive for Our Word, (We surely guide them to Our paths) i.e. whoever acts upon what he knows, We shall give him success to know that which he do not know; it is also said that this means: We shall honour them with a natural aptitude, easiness and sweetness [of faith]; it is also said that this means: We shall guide them to obey Us, (and lo! Allah is with the good) He helps those who are good in their works and speech by giving them success and holding them back from transgression'. And of the surah in which the Romans are mentioned, which is all Meccan and consists of 70 verses, 819 words and 3,530 letters: Surah 30: The Romans [al-Rum) And of the surah in which the Romans are mentioned, which is all Meccan and consists of 70 verses, 819 words and 3,530 letters:\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "29:69",
            "29:11",
            "2:190",
            "16:128",
            "29:3",
            "5:35",
            "43:37",
            "22:58",
            "37:152",
            "47:1"
        ],
        "BIBLE": [
            "prophets:jeremiah:31:9",
            "writings:proverbs:12:26",
            "prophets:isaiah:3:12",
            "writings:psalms:5:9",
            "prophets:ezekiel:14:23",
            "writings:psalms:107:7",
            "writings:psalms:1:6",
            "writings:ezra:8:21",
            "writings:proverbs:13:15",
            "prophets:jeremiah:6:16"
        ]
    }
}