{
    "VERSE": "29:9",
    "ARABIC": "وَٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّٰلِحَٰتِ لَنُدْخِلَنَّهُمْ فِى ٱلصَّٰلِحِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "As for those who have iman and do right actions, We will admit them among the righteous.",
        "TRANSLATION_1": "We shall admit those who believe and do the right among the righteous.\n",
        "TRANSLATION_2": "As for those who believed and acted righteously, We shall certainly admit them among the righteous.\n",
        "TRANSLATION_3": "We shall admit the righteously striving believers into the company of the pious ones.\n",
        "TRANSLATION_4": "And those who accepted faith and did good deeds – We shall indeed include them among the virtuous.\n",
        "TRANSLATION_5": "And for those who believe and do righteous deeds, surely, We shall admit them among the righteous.\n",
        "TRANSLATION_6": "And (as for) those who believe and do good, We will most surely cause them to enter among the good.\n",
        "TRANSLATION_7": "And those who believe, and do righteous deeds assuredly We shall admit them among the righteous.\n",
        "TRANSLATION_8": "And as for those who believe and do good works, We verily shall make them enter in among the righteous.\n",
        "TRANSLATION_9": "We shall surely admit those who believe and do good deeds to the company of the righteous.\n",
        "TRANSLATION_10": "And those who believe and work righteous works--We shall surely cause them enter among the righteous.\n",
        "TRANSLATION_11": "Those who have faith and do righteous deeds, We will surely admit them among the righteous.\n",
        "TRANSLATION_12": "And those who believe and work righteous deeds,- them shall We admit to the company of the Righteous.\n",
        "TRANSLATION_13": "And for those who believe (in the Oneness of Allah and other items of Faith) and do righteous good deeds, surely, We shall make them enter in (the enterance of) the righteous (i.e. in Paradise).\n",
        "TRANSLATION_14": "Those who believe and do good works shall be admitted among the righteous.\n",
        "TRANSLATION_15": "Those who believe and do good works—We will admit them into the company of the righteous.\n",
        "TRANSLATION_16": "And those who believe and do righteous deeds - We will surely admit them among the righteous [into Paradise].\n",
        "TRANSLATION_17": "[29:9] And those who believe and perform righteous deeds, assuredly We shall admit them among the righteous, [among] the prophets and the saints, by gathering in the company of one another [at the Resurrection].\n",
        "TRANSLATION_18": "(And as for those who believe) in Muhammad (pbuh) and in the Qur'an (and do good works) acts of obedience between them and their Lord at all times, (We verily shall make them enter in among the righteous) with the righteous in Paradise: Abu Bakr al-Siddiq (the Veracious), 'Umar al-Faruq (the Distinguisher (between good and evil)), 'Uthman of the two lights, and 'AN the trustworthy, may Allah be well pleased with all of them. 448\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "29:9",
            "7:6",
            "19:72",
            "26:19",
            "15:6",
            "29:11",
            "52:12",
            "23:11",
            "85:7",
            "26:94"
        ],
        "BIBLE": [
            "torah:exodus:34:10",
            "torah:genesis:32:13",
            "prophets:ezekiel:15:8",
            "prophets:jeremiah:25:14",
            "prophets:isaiah:42:1",
            "writings:nehemiah:2:8",
            "torah:exodus:22:10",
            "writings:ecclesiastes:7:13",
            "writings:ecclesiastes:9:1",
            "prophets:ezekiel:39:26"
        ]
    }
}