{
    "VERSE": "48:13",
    "ARABIC": "وَمَن لَّمْ يُؤْمِنۢ بِٱللَّهِ وَرَسُولِهِۦ فَإِنَّآ أَعْتَدْنَا لِلْكَٰفِرِينَ سَعِيرًا",
    "ENGLISH": {
        "TRANSLATION_0": "Whoever does not have iman in Allah and His Messenger - We have prepared a Blazing Fire for the kafirun.",
        "TRANSLATION_1": "He who does not believe in God and His Apostle (should know) We have prepared for unbelievers a blazing fire.\"\n",
        "TRANSLATION_2": "As for those who do not believe in Allah and His Messenger, for such unbelievers We have prepared a Blazing Fire.\n",
        "TRANSLATION_3": "Those who do not believe in God and His Messenger should know that We have prepared hell for the disbelievers.\n",
        "TRANSLATION_4": "And whoever does not accept faith in Allah and His Noble Messenger – We have indeed kept prepared a blazing fire for disbelievers.\n",
        "TRANSLATION_5": "And whosoever does not believe in Allah and His Messenger, then verily, We have prepared for the disbelievers a blazing Fire.\n",
        "TRANSLATION_6": "And whoever does not believe in Allah and His Apostle, then surely We have prepared burning fire for the unbelievers.\n",
        "TRANSLATION_7": "Whoso believes not in God and His Messenger, We have prepared for the unbelievers a Blaze.\n",
        "TRANSLATION_8": "And so for him who believeth not in Allah and His messenger - Lo! We have prepared a flame for disbelievers.\n",
        "TRANSLATION_9": "For those who deny the truth, who do not believe in God and His Messenger, We have prepared a blazing Fire.\n",
        "TRANSLATION_10": "And whosoever believeth not in Allah and His apostle then verily We have gotten ready for the infidels a Blaze.\n",
        "TRANSLATION_11": "Those who have no faith in Allah and His Apostle [should know that] We have prepared a blaze for the faithless.\n",
        "TRANSLATION_12": "And if any believe not in Allah and His Messenger, We have prepared, for those who reject Allah, a Blazing Fire!\n",
        "TRANSLATION_13": "And whosoever does not believe in Allah and His Messenger (Muhammad SAW), then verily, We have prepared for the disbelievers a blazing Fire.\n",
        "TRANSLATION_14": "But whosoever disbelieves in Allah and His Messenger; We have prepared a Blazing Fire for the unbelievers.\n",
        "TRANSLATION_15": "He who does not believe in God and His Messenger—We have prepared for the disbelievers a Blazing Fire.\n",
        "TRANSLATION_16": "And whoever has not believed in Allah and His Messenger - then indeed, We have prepared for the disbelievers a Blaze.\n",
        "TRANSLATION_17": "[48:13] And whoever does not believe in God and His Messenger, We have prepared for the disbelievers a blaze, a severe fire.\n",
        "TRANSLATION_18": "(And as for him who believeth not in Allah and His messenger) as for him who is not true in his faith in Allah and His Messenger. (Lo! We have prepared a flame for disbelievers) for disbelievers who disbelieve openly or secretly.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "48:13",
            "33:64",
            "24:52",
            "3:32",
            "3:132",
            "24:54",
            "63:1",
            "58:20",
            "4:61",
            "4:80"
        ],
        "BIBLE": [
            "torah:leviticus:6:6",
            "torah:exodus:14:18",
            "writings:proverbs:20:21",
            "writings:job:20:18",
            "prophets:i%20kings:11:10",
            "torah:exodus:21:36",
            "prophets:i%20samuel:21:6",
            "writings:job:31:25",
            "prophets:ezekiel:28:4",
            "writings:ecclesiastes:2:8"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:14",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:1:12",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:2:5"
        ]
    }
}