{
    "VERSE": "48:19",
    "ARABIC": "وَمَغَانِمَ كَثِيرَةً يَأْخُذُونَهَا وَكَانَ ٱللَّهُ عَزِيزًا حَكِيمًا",
    "ENGLISH": {
        "TRANSLATION_0": "and with much booty which they will take. Allah is Almighty, All-Wise.",
        "TRANSLATION_1": "And the many spoils that they were to take. God is all-mighty and all-wise.\n",
        "TRANSLATION_2": "and with abundant spoils which they shall acquire. Allah is Most Mighty, Most Wise.\n",
        "TRANSLATION_3": "and the booty which they received from it (the Battle). God is Majestic and All-wise.\n",
        "TRANSLATION_4": "And plenty of war booty, to take; and Allah is Most Honourable, Wise.\n",
        "TRANSLATION_5": "And abundant spoils that they will capture. And Allah is Ever All-Mighty, All-Wise.\n",
        "TRANSLATION_6": "And many acquisitions which they will take; and Allah is Mighty, Wise.\n",
        "TRANSLATION_7": "and many spoils to take; and God is ever All-mighty, All-wise.\n",
        "TRANSLATION_8": "And much booty that they will capture. Allah is ever Mighty, Wise.\n",
        "TRANSLATION_9": "and with many future gains -- God is mighty and wise.\n",
        "TRANSLATION_10": "And spoils in abundance that they are taking. And Allah is ever Mighty, Wise.\n",
        "TRANSLATION_11": "and abundant spoils that they will capture, and Allah is all-mighty, all-wise.\n",
        "TRANSLATION_12": "And many gains will they acquire (besides): and Allah is Exalted in Power, Full of Wisdom.\n",
        "TRANSLATION_13": "And abundant spoils that they will capture. And Allah is Ever All-Mighty, All-Wise.\n",
        "TRANSLATION_14": "and they took many spoils, and Allah is the Almighty, and the Wise.\n",
        "TRANSLATION_15": "And abundant gains for them to capture. God is Mighty and Wise.\n",
        "TRANSLATION_16": "And much war booty which they will take. And ever is Allah Exalted in Might and Wise.\n",
        "TRANSLATION_17": "[48:19] and abundant spoils which they will capture, from Khaybar, and God is ever Mighty, Wise, that is to say, He is ever possessed of such attributes.\n",
        "TRANSLATION_18": "(And much booty that they will capture) the booty of Khaybar. (Allah is ever Mighty) in retribution against His foes, (Wise) in giving help, conquest and booty to the Prophet (pbuh) and his Companions.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "48:19",
            "4:158",
            "16:83",
            "31:9",
            "48:3",
            "27:9",
            "57:1",
            "29:42",
            "42:3",
            "59:1"
        ],
        "BIBLE": [
            "prophets:jeremiah:51:56",
            "writings:ii%20chronicles:20:25",
            "torah:numbers:24:23",
            "torah:numbers:31:53",
            "torah:deuteronomy:2:35",
            "writings:psalms:49:16",
            "torah:deuteronomy:3:7",
            "prophets:ezekiel:21:31",
            "torah:genesis:5:24",
            "writings:job:27:2"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:1:7"
        ]
    }
}