{
    "VERSE": "48:26",
    "ARABIC": "إِذْ جَعَلَ ٱلَّذِينَ كَفَرُوا۟ فِى قُلُوبِهِمُ ٱلْحَمِيَّةَ حَمِيَّةَ ٱلْجَٰهِلِيَّةِ فَأَنزَلَ ٱللَّهُ سَكِينَتَهُۥ عَلَىٰ رَسُولِهِۦ وَعَلَى ٱلْمُؤْمِنِينَ وَأَلْزَمَهُمْ كَلِمَةَ ٱلتَّقْوَىٰ وَكَانُوٓا۟ أَحَقَّ بِهَا وَأَهْلَهَا وَكَانَ ٱللَّهُ بِكُلِّ شَىْءٍ عَلِيمًا",
    "ENGLISH": {
        "TRANSLATION_0": "Those who are kafir filled their hearts with fanatical rage - the fanatical rage of the Time of Ignorance and Allah sent down serenity to His Messenger and to the muminun, and bound them to the expression of taqwa which they had most right to and were most entitled to. Allah has knowledge of all things.",
        "TRANSLATION_1": "When the unbelievers fostered a sense of honour in their hearts, a sense of pagan honour, God sent down a sense of tranquility on His Apostle and the believers, and obliged them to an act of self-restraint, for they were deserving and worthy of it. God is cognisant of everything.\n",
        "TRANSLATION_2": "(This is why) when the unbelievers set in their hearts a fierce bigotry -- the bigotry of ignorance -- Allah bestowed inner peace upon His Messenger and upon the believers and made the word of piety binding on them. They were more deserving and worthier thereof. Allah has knowledge of everything.\n",
        "TRANSLATION_3": "Since the disbelievers held zealous ignorance in their hearts, like that of the pre-Islamic age of darkness, God gave confidence to His Messenger and to the believers, binding them to the principle of piety which they deserve. God has the knowledge of all things.\n",
        "TRANSLATION_4": "Whereas the disbelievers had set up in their hearts an obstinacy – the same obstinacy of the days of ignorance – so Allah sent down His solace upon His Noble Messenger and upon the believers, and decreed upon them the words of piety, and they were more deserving and suitable for it; and Allah is the All Knowing.\n",
        "TRANSLATION_5": "When those who disbelieve had put in their hearts pride and haughtiness -- the pride and haughtiness of the time of ignorance, -- then Allah sent down His calmness and tranquillity upon His Messenger and upon the believers, and made them stick to the word of Taqwa; and they were well entitled to it and worthy of it. And Allah is the All-Knower of everything.\n",
        "TRANSLATION_6": "When those who disbelieved harbored in their hearts (feelings of) disdain, the disdain of (the days of) ignorance, but Allah sent down His tranquillity on His Apostle and on the believers, and made them keep the word of guarding (against evil), and they were entitled to it and worthy of it; and Allah is Cognizant of all things.\n",
        "TRANSLATION_7": "When the unbelievers set in their hearts fierceness, the fierceness of pagandom, then God sent down His Shechina upon His Messenger and the believers, and fastened to them the word of godfearing to which they have better right and are worthy of; and God has' knowledge of everything.\n",
        "TRANSLATION_8": "When those who disbelieve had set up in their hearts zealotry, the zealotry of the Age of Ignorance, then Allah sent down His peace of reassurance upon His messenger and upon the believers and imposed on them the word of self-restraint, for they were worthy of it and meet for it. And Allah is Aware of all things.\n",
        "TRANSLATION_9": "While those who deny the truth made it a prestige issue [in their hearts], the bigotry of the days of ignorance, God sent His tranquillity down on to His Messenger and believers and firmly established in them the principle of righteousness, for they were indeed better entitled to it and more worthy of it. God has full knowledge of all things.\n",
        "TRANSLATION_10": "When those who disbelieve had put in their hearts a zeal, the zeal of Paganism, then Allah sent down His tranquillity upon His apostle and upon the believers, and kept them fixed on the way of piety, and they were worthy thereof and meet therefor; and Allah is of everything ever Knower.\n",
        "TRANSLATION_11": "When the faithless nourished bigotry in their hearts, the bigotry of pagan ignorance, Allah sent down His composure upon His Apostle and the faithful, and made them abide by the word of Godwariness, for they were the worthiest of it and deserved it, and Allah has knowledge of all things.\n",
        "TRANSLATION_12": "While the Unbelievers got up in their hearts heat and cant - the heat and cant of ignorance,- Allah sent down His Tranquillity to his Messenger and to the Believers, and made them stick close to the command of self-restraint; and well were they entitled to it and worthy of it. And Allah has full knowledge of all things.\n",
        "TRANSLATION_13": "When those who disbelieve had put in their hearts pride and haughtiness the pride and haughtiness of the time of ignorance, then Allah sent down His Sakinah (calmness and tranquillity) upon His Messenger (SAW) and upon the believers, and made them stick to the word of piety (i.e. none has the right to be worshipped but Allah), and they were well entitled to it and worthy of it. And Allah is the All-Knower of everything.\n",
        "TRANSLATION_14": "And when the unbelievers established in their hearts fierce bigotry, the fierce bigotry of ignorance, Allah sent down His tranquility on His Messenger and the believers and firmly fastened to them the Word of 'taqwa' (there is no god except Allah, and Muhammad is His Messenger, as it is the cause of righteousness) to which they have better right and are worthy of it. Allah has knowledge of all things.\n",
        "TRANSLATION_15": "Those who disbelieved filled their hearts with rage—the rage of the days of ignorance. But God sent His serenity down upon His Messenger, and upon the believers, and imposed on them the words of righteousness—of which they were most worthy and deserving. God is aware of everything.\n",
        "TRANSLATION_16": "When those who disbelieved had put into their hearts chauvinism - the chauvinism of the time of ignorance. But Allah sent down His tranquillity upon His Messenger and upon the believers and imposed upon them the word of righteousness, and they were more deserving of it and worthy of it. And ever is Allah, of all things, Knowing.\n",
        "TRANSLATION_17": "[48:26] When those who disbelieve (alladhīna kafarū is the subject [of the following verb ja‘ala]) nourished (idh ja‘ala is semantically connected to ‘adhdhabnā) in their hearts zealotry (al-hamiyya, [means] ‘disdain of something’), the zealotry of pagandom (hamiyyata’l-jāhiliyyati substitutes for al-hamiyyata, ‘zealotry’), namely, their barring of the Prophet and his Companions from [visiting] the Sacred Mosque, [but] then God sent down His spirit of Peace upon His Messenger and the believers, and so they [the disbelievers] made a truce with them on the condition that they [the believers] would [be allowed to] return the following year, and [such] zealotry would not overcome them [the believers] as it did the disbelievers [then] until they would come to fight them [later], and He made them, the believers, abide by the word of God-fearing (kalimata’l-taqwā): ‘there is no god except God, [and] Muhammad is His Messenger’ (it [kalima, ‘word’] is annexed to al-taqwā because it is the cause of it), for they were worthier of it, of the word, than the disbelievers, and deserving of it (wa-ahlahā is an explanatory supplement). And God is ever Knower of all things, that is to say, He is ever possessed of such an attribute, and among the things He knows is that they are worthy of it.\n",
        "TRANSLATION_18": "(When those who disbelieve) the disbelievers of Mecca (had set up in their hearts zealotry, the zealotry of the Age of Ignorance) by preventing the Messenger of Allah (pbuh) and his Companions from the House, (then Allah sent down His peace of reassurance) His tranquillity (upon His messenger and upon the believers) and removed zealotry from them (and imposed on them) and inspired them with (the word of self restraint) \"there is no deity save Allah and Muhammad is the Messenger of Allah\", (for they were worthy of it) they were worthy of \"there is no deity save Allah and Muhammad is the Messenger of Allah\", as it was in Allah's beginninglessly eternal knowledge (and meet for it) in the life of this world. (And Allah is Aware of all things) regarding honouring the believers.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "48:26",
            "48:28",
            "24:64",
            "33:54",
            "64:11",
            "29:62",
            "33:40",
            "48:4",
            "42:24",
            "9:115"
        ],
        "BIBLE": [
            "prophets:i%20kings:3:6",
            "prophets:i%20kings:14:8",
            "prophets:ii%20kings:10:15",
            "prophets:joshua:23:16",
            "torah:deuteronomy:26:13",
            "prophets:isaiah:50:4",
            "prophets:i%20samuel:22:8",
            "prophets:i%20kings:3:12",
            "writings:ecclesiastes:1:13",
            "writings:ecclesiastes:8:15"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:4:1"
        ]
    }
}