{
    "VERSE": "48:7",
    "ARABIC": "وَلِلَّهِ جُنُودُ ٱلسَّمَٰوَٰتِ وَٱلْأَرْضِ وَكَانَ ٱللَّهُ عَزِيزًا حَكِيمًا",
    "ENGLISH": {
        "TRANSLATION_0": "The legions of the heavens and the earth belong to Allah. Allah is Almighty, All-Wise.",
        "TRANSLATION_1": "For God's are the armies of the heavens and the earth; and God is all-knowing and all-wise.\n",
        "TRANSLATION_2": "To Allah belong the legions of the heavens and the earth. Allah is Most Mighty, Most Wise.\n",
        "TRANSLATION_3": "To God belong the armies of the heavens and the earth. God is Majestic and All-wise.\n",
        "TRANSLATION_4": "And to Allah only belong the armies of the heavens and the earth; and Allah is Most Honourable, Wise.\n",
        "TRANSLATION_5": "And to Allah belong the armies of the heavens and the earth. And Allah is Ever All-Powerful, All-Wise.\n",
        "TRANSLATION_6": "And Allah's are the hosts of the heavens and the earth; and Allah is Mighty, Wise.\n",
        "TRANSLATION_7": "To God belong the hosts of the heavens and the earth; God is All-mighty, All-wise.\n",
        "TRANSLATION_8": "Allah's are the hosts of the heavens and the earth, and Allah is ever Mighty, Wise.\n",
        "TRANSLATION_9": "The forces of heavens and earth belong to God; He is almighty and all wise.\n",
        "TRANSLATION_10": "And Allah's are the hosts of the heavens and the earth, and Allah is ever Mighty, Wise.\n",
        "TRANSLATION_11": "To Allah belong the hosts of the heavens and the earth, and Allah is all-mighty, all-wise.\n",
        "TRANSLATION_12": "For to Allah belong the Forces of the heavens and the earth; and Allah is Exalted in Power, Full of Wisdom.\n",
        "TRANSLATION_13": "And to Allah belong the hosts of the heavens and the earth. And Allah is Ever All-Knower, All-Wise.\n",
        "TRANSLATION_14": "To Allah belong the armies of the heavens and the earth. Allah is the Almighty and the Wise.\n",
        "TRANSLATION_15": "To God belong the troops of the heavens and the earth. God is Mighty and Wise.\n",
        "TRANSLATION_16": "And to Allah belong the soldiers of the heavens and the earth. And ever is Allah Exalted in Might and Wise.\n",
        "TRANSLATION_17": "[48:7] And to God belong the hosts of the heavens and the earth; and God is ever Mighty, in His kingdom, Wise, in His actions, in other words, He is ever possessed of such attributes.\n",
        "TRANSLATION_18": "(Allah's are the hosts of the heavens) the angels (and the earth) the believers; He gives help to whomever He will, (and Allah is ever Mighty) in retribution against the disbelievers and hypocrites, (Wise) in bestowing honour on true believers because of their faith; and it is also said that this means: Allah is ever Mighty in His 596 dominion and sovereignty, Wise in His command, decree and help of His Prophet against his enemies.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "48:7",
            "57:1",
            "59:1",
            "61:1",
            "59:24",
            "62:1",
            "48:4",
            "45:37",
            "43:84",
            "34:1"
        ],
        "BIBLE": [
            "writings:psalms:57:6",
            "writings:psalms:108:6",
            "writings:psalms:57:12",
            "torah:genesis:2:1",
            "prophets:jeremiah:10:12",
            "prophets:isaiah:37:16",
            "writings:psalms:46:11",
            "prophets:isaiah:5:16",
            "prophets:jeremiah:51:15",
            "torah:deuteronomy:10:14"
        ]
    }
}