{
    "VERSE": "48:8",
    "ARABIC": "إِنَّآ أَرْسَلْنَٰكَ شَٰهِدًا وَمُبَشِّرًا وَنَذِيرًا",
    "ENGLISH": {
        "TRANSLATION_0": "We have sent you bearing witness, bringing good news and giving warning",
        "TRANSLATION_1": "We have sent you as witness (of the truth) and harbinger of good news and a warner,\n",
        "TRANSLATION_2": "(O Prophet), We have sent you forth as a witness, as a bearer of good news, and as a warner\n",
        "TRANSLATION_3": "We have sent you as a witness, a bearer of glad news, and a warner,\n",
        "TRANSLATION_4": "We have indeed sent you (O dear Prophet Mohammed – peace and blessings be upon him) as a present witness and a Herald of glad tidings and warnings. (The Holy Prophet is a witness from Allah.)\n",
        "TRANSLATION_5": "Verily, We have sent you as a witness, as a bearer of glad tidings, and as a warner.\n",
        "TRANSLATION_6": "Surely We have sent you as a witness and as a bearer of good news and as a warner,\n",
        "TRANSLATION_7": "Surely We have sent thee as a witness, good tidings to bear, and warning,\n",
        "TRANSLATION_8": "Lo! We have sent thee (O Muhammad) as a witness and a bearer of good tidings and a warner,\n",
        "TRANSLATION_9": "We have sent you forth as a witness and a bearer of good tidings and a warner,\n",
        "TRANSLATION_10": "Verily We! We have sent thee as a witness and a bearer of glad tidings and a warner.\n",
        "TRANSLATION_11": "Indeed We have sent you as a witness, and as a bearer of good news and warner,\n",
        "TRANSLATION_12": "We have truly sent thee as a witness, as a bringer of Glad Tidings, and as a Warner:\n",
        "TRANSLATION_13": "Verily, We have sent you (O Muhammad SAW) as a witness, as a bearer of glad tidings, and as a warner.\n",
        "TRANSLATION_14": "We have sent you (Prophet Muhammad) as a witness and as a bearer of glad tidings and warning,\n",
        "TRANSLATION_15": "We sent you as a witness, and a bearer of good news, and a warner.\n",
        "TRANSLATION_16": "Indeed, We have sent you as a witness and a bringer of good tidings and a warner\n",
        "TRANSLATION_17": "[48:8] Indeed We have sent you as a witness, against your community at the Resurrection, and a bearer of good tidings, to them in this world, and a warner, to threaten those in it who do evil with [the punishment of] the Fire;\n",
        "TRANSLATION_18": "(Lo! We have sent thee) Muhammad (as a witness) over your community that you had delivered the message to them (and a bearer of good tidings) the Garden for the believers (and a warner) to the disbelievers from the Fire,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "48:8",
            "15:89",
            "25:56",
            "33:45",
            "11:122",
            "34:34",
            "11:25",
            "17:105",
            "54:39",
            "35:23"
        ],
        "BIBLE": [
            "torah:genesis:26:29",
            "prophets:isaiah:52:7",
            "prophets:nahum:2:1",
            "prophets:jeremiah:28:9",
            "prophets:isaiah:41:27",
            "writings:esther:9:30",
            "prophets:jeremiah:14:13",
            "prophets:ii%20kings:7:9",
            "writings:psalms:71:22",
            "torah:genesis:24:12"
        ]
    }
}