{
    "VERSE": "96:15",
    "ARABIC": "كَلَّا لَئِن لَّمْ يَنتَهِ لَنَسْفَعًۢا بِٱلنَّاصِيَةِ",
    "ENGLISH": {
        "TRANSLATION_0": "No indeed! If he does not desist, We will grab him by the forelock,",
        "TRANSLATION_1": "And yet indeed if he does not desist We shall drag him by the forelock,\n",
        "TRANSLATION_2": "No indeed; if he does not desist, We shall drag him by the forelock;\n",
        "TRANSLATION_3": "Let him know that if he does not desist, We shall certainly drag him by his forelocks,\n",
        "TRANSLATION_4": "Yes certainly, if he does not desist, We will seize him by the forelock.\n",
        "TRANSLATION_5": "Nay! If he ceases not, We will scorch his forehead --\n",
        "TRANSLATION_6": "Nay! if he desist not, We would certainly smite his forehead,\n",
        "TRANSLATION_7": "No indeed; surely, if he gives not over, We shall seize him by the forelock,\n",
        "TRANSLATION_8": "Nay, but if he cease not We will seize him by the forelock -\n",
        "TRANSLATION_9": "Let him beware! If he does not desist, We will drag him by the forelock --\n",
        "TRANSLATION_10": "By no means! If he desist not We shall seize and deal him by the forelock -\n",
        "TRANSLATION_11": "No indeed! If he does not cease, We shall seize him by the forelock,\n",
        "TRANSLATION_12": "Let him beware! If he desist not, We will drag him by the forelock,-\n",
        "TRANSLATION_13": "Nay! If he (Abu Jahl) ceases not, We will catch him by the forelock,\n",
        "TRANSLATION_14": "Indeed, if he does not desist, We will seize him by the forelock,\n",
        "TRANSLATION_15": "No. If he does not desist, We will drag him by the forelock.\n",
        "TRANSLATION_16": "No! If he does not desist, We will surely drag him by the forelock -\n",
        "TRANSLATION_17": "[96:15] No indeed! — a repudiation of him — Assuredly if (la-in: the lām is for oaths) he does not desist, from the disbelief that he is upon, We shall seize him by the forelock, We shall drag him to the Fire by his forelock,\n",
        "TRANSLATION_18": "(Nay) truly, Muhammad, (but if he cease not) if Abu Jahl does not repent of harming the Prophet (pbuh). (We will seize him by the forelock\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "96:15",
            "26:167",
            "26:116",
            "96:16",
            "104:4",
            "7:23",
            "69:45",
            "82:9",
            "26:31",
            "74:43"
        ],
        "BIBLE": [
            "torah:deuteronomy:3:19",
            "prophets:ezekiel:18:13",
            "prophets:isaiah:47:8",
            "prophets:jeremiah:11:18",
            "torah:deuteronomy:29:3",
            "prophets:ezekiel:35:12",
            "writings:psalms:124:6",
            "prophets:malachi:2:15",
            "torah:leviticus:19:24",
            "prophets:joshua:23:13"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:4:12"
        ]
    }
}