{
    "VERSE": "111:1",
    "ARABIC": "بِسْمِ ٱللَّهِ ٱلرَّحْمَٰنِ ٱلرَّحِيمِ تَبَّتْ يَدَآ أَبِى لَهَبٍ وَتَبَّ",
    "ENGLISH": {
        "TRANSLATION_0": "Ruin to the hands of Abu Lahab and ruin to him!",
        "TRANSLATION_1": "DESTROYED WILL BE the hands of Abu Lahab, and he himself will perish.\n",
        "TRANSLATION_2": "Destroyed were the hands of Abu Lahab, and he lay utterly doomed.\n",
        "TRANSLATION_3": "May the hands of Abu Lahab perish!\n",
        "TRANSLATION_4": "May both the hands of Abu Lahab be destroyed – and they are destroyed!\n",
        "TRANSLATION_5": "Perish the two hands of Abu Lahab and perish he!\n",
        "TRANSLATION_6": "Perdition overtake both hands of Abu Lahab, and he will perish.\n",
        "TRANSLATION_7": "Perish the hands of Abu Lahab, and perish he!\n",
        "TRANSLATION_8": "The power of Abu Lahab will perish, and he will perish.\n",
        "TRANSLATION_9": "May the hands of Abu Lahab perish, may he be ruined.\n",
        "TRANSLATION_10": "Perish the two hands of Abu Lahab, and perish he!\n",
        "TRANSLATION_11": "Perish the hands of Abu Lahab, and perish he!\n",
        "TRANSLATION_12": "Perish the hands of the Father of Flame! Perish he!\n",
        "TRANSLATION_13": "Perish the two hands of Abu Lahab (an uncle of the Prophet), and perish he!\n",
        "TRANSLATION_14": "Perish the hands of AbiLahab, and perish he!\n",
        "TRANSLATION_15": "Condemned are the hands of Abee Lahab, and he is condemned.\n",
        "TRANSLATION_16": "May the hands of Abu Lahab be ruined, and ruined is he.\n",
        "TRANSLATION_17": "[111:1] Perish, ruined be, the hands of Abū Lahab, in other words, all of him — the use of ‘hands’ here to denote [all of] him is figurative, and is because most actions are performed by them; the statement is an invocation — and perish he!, may he be ruined! (this [tabba] is a predicate, as where one says, ahlakahu’Llāhu wa-qad halak, ‘God destroyed him and he indeed is destroyed’. When the Prophet threatened him with the chastisement, he said, ‘If what my brother’s son says is true, then I shall ransom [myself] from it with my wealth and sons!’; so the following was revealed:\n",
        "TRANSLATION_18": "And from his narration on the authority of Ibn 'Abbas that he said regarding the interpretation of Allah's saying (The power of Abu Lahab will perish): '(The power of Abu Lahab will perish) this is because when Allah said to His Prophet (pbuh) (And warn your tribe of near kindred [26: 214]) he called them and said: \"Say: there is no god but Allah\" and his uncle-the brother of his father from their mother's side-'Abd al-'Uzza whose agnomen was Abu Lahab said: \"May you perish! Is this why you summoned us?\" Allah then revealed His saying (The power of Abu Lahab will perish) He says: the hand of Abu Lahab is deprived of all good (and he will perish) he lost himself by rejecting belief in Allah's divine Oneness.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "111:1",
            "9:67",
            "26:86",
            "9:14",
            "80:35",
            "2:195",
            "38:45",
            "111:3",
            "77:31",
            "12:61"
        ],
        "BIBLE": [
            "writings:ii%20chronicles:32:14",
            "writings:ii%20chronicles:32:13",
            "writings:job:9:33",
            "writings:ii%20chronicles:20:6",
            "writings:psalms:37:33",
            "prophets:isaiah:64:7",
            "writings:job:10:7",
            "torah:deuteronomy:28:20",
            "torah:genesis:31:29",
            "torah:genesis:37:22"
        ]
    }
}