{
    "VERSE": "111:2",
    "ARABIC": "مَآ أَغْنَىٰ عَنْهُ مَالُهُۥ وَمَا كَسَبَ",
    "ENGLISH": {
        "TRANSLATION_0": "His wealth has not helped him nor anything he has earned.",
        "TRANSLATION_1": "Of no avail shall be his wealth, nor what he has acquired.\n",
        "TRANSLATION_2": "His wealth did not avail him, nor his acquisitions.\n",
        "TRANSLATION_3": "May he too perish!\n",
        "TRANSLATION_4": "His wealth did not benefit him in the least, nor did whatever he earned.\n",
        "TRANSLATION_5": "His wealth and his children will not benefit him!\n",
        "TRANSLATION_6": "His wealth and what he earns will not avail him.\n",
        "TRANSLATION_7": "His wealth avails him not, neither what he has earned;\n",
        "TRANSLATION_8": "His wealth and gains will not exempt him.\n",
        "TRANSLATION_9": "Neither his wealth nor his gains will avail him.\n",
        "TRANSLATION_10": "His substance availed him not, nor that which he earned.\n",
        "TRANSLATION_11": "Neither his wealth availed him, nor what he had earned.\n",
        "TRANSLATION_12": "No profit to him from all his wealth, and all his gains!\n",
        "TRANSLATION_13": "His wealth and his children (etc.) will not benefit him!\n",
        "TRANSLATION_14": "His wealth will not suffice him, neither what he has gained;\n",
        "TRANSLATION_15": "His wealth did not avail him, nor did what he acquired.\n",
        "TRANSLATION_16": "His wealth will not avail him or that which he gained.\n",
        "TRANSLATION_17": "[111:2] His wealth will not avail him, nor what he has earned (wa-kasab means wa-kasbihi, that is to say, his sons; mā aghnā means [mā] yughnī).\n",
        "TRANSLATION_18": "(His wealth) his abundant wealth (and gains) many children (will not exempt him) in the Hereafter.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "111:2",
            "104:2",
            "69:28",
            "92:11",
            "92:18",
            "74:12",
            "104:3",
            "34:35",
            "23:55",
            "21:23"
        ],
        "BIBLE": [
            "prophets:joshua:19:9",
            "torah:leviticus:15:31",
            "prophets:judges:3:2",
            "torah:numbers:35:34",
            "prophets:joshua:16:9",
            "prophets:joshua:22:27",
            "torah:deuteronomy:24:16",
            "torah:deuteronomy:32:51",
            "writings:proverbs:22:6",
            "writings:psalms:115:14"
        ]
    }
}