{
    "VERSE": "111:4",
    "ARABIC": "وَٱمْرَأَتُهُۥ حَمَّالَةَ ٱلْحَطَبِ",
    "ENGLISH": {
        "TRANSLATION_0": "And so will his wife, the firewood-carrier,",
        "TRANSLATION_1": "And his wife, the portress of fire wood,\n",
        "TRANSLATION_2": "along with his wife, that carrier of slanderous tales;\n",
        "TRANSLATION_3": "He will suffer in a blazing fire\n",
        "TRANSLATION_4": "And so will his wife; carrying a bundle of firewood on her head.\n",
        "TRANSLATION_5": "And his wife too, who carries wood.\n",
        "TRANSLATION_6": "And his wife, the bearer of fuel,\n",
        "TRANSLATION_7": "and his wife, the carrier of the firewood,\n",
        "TRANSLATION_8": "And his wife, the wood-carrier,\n",
        "TRANSLATION_9": "and also his wife who carries the fuel,\n",
        "TRANSLATION_10": "And his wife also: the firewood carrier;\n",
        "TRANSLATION_11": "and his wife [too], the firewood carrier,\n",
        "TRANSLATION_12": "His wife shall carry the (crackling) wood - As fuel!-\n",
        "TRANSLATION_13": "And his wife too, who carries wood (thorns of Sadan which she used to put on the way of the Prophet (Peace be upon him), or use to slander him).\n",
        "TRANSLATION_14": "and his wife, laden with firewood\n",
        "TRANSLATION_15": "And his wife—the firewood carrier.\n",
        "TRANSLATION_16": "And his wife [as well] - the carrier of firewood.\n",
        "TRANSLATION_17": "[111:4] and his wife (wa’mra’atuhu is a supplement to the person [of the verb] yaslā, ‘he will enter’, separated by the clause of the direct object and its qualification) — and this was Umm Jamīl — the carrier (read hammālatu or hammālata) of firewood, cactus and thorns which she used to fling into the path of the Prophet (s).\n",
        "TRANSLATION_18": "(And his wife) Umm Jamilah Bint Harth Ibn Umayyah with him, (the wood carrier) the talebearer who used to go between the Muslims and disbelievers and spread lies among them about each other; it is also said that she used to throw thorns in the way of the mosque whenever she saw the Prophet (pbuh) heading that way.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "111:4",
            "7:83",
            "27:57",
            "15:60",
            "21:27",
            "104:5",
            "26:151",
            "72:15",
            "79:5",
            "51:4"
        ],
        "BIBLE": [
            "writings:i%20chronicles:8:6",
            "writings:i%20chronicles:10:9",
            "torah:leviticus:1:8",
            "torah:deuteronomy:28:44",
            "prophets:ezekiel:44:20",
            "writings:proverbs:25:22",
            "prophets:i%20kings:2:33",
            "writings:psalms:110:7",
            "prophets:nahum:3:10",
            "torah:leviticus:1:15"
        ]
    }
}