{
    "VERSE": "34:11",
    "ARABIC": "أَنِ ٱعْمَلْ سَٰبِغَٰتٍ وَقَدِّرْ فِى ٱلسَّرْدِ وَٱعْمَلُوا۟ صَٰلِحًا إِنِّى بِمَا تَعْمَلُونَ بَصِيرٌ",
    "ENGLISH": {
        "TRANSLATION_0": "'Make full-length coats of mail, measuring the links with care. And act rightly, all of you, for I see what you do.'",
        "TRANSLATION_1": "Make long coats of mail,\" (We said), \"and fix their links, and do the right. I surely see whatsoever you do.\"\n",
        "TRANSLATION_2": "“Fashion coats of mail and measure their links with care and act righteously. I am watching over whatever you do.”\n",
        "TRANSLATION_3": "so that he could make coats of mail and properly measure their rings. We told him and his people to act righteously. We are Well-Aware of what you do.\n",
        "TRANSLATION_4": "“Make large coats of armour and keep proper measure while making; and all of you perform good deeds; I am indeed seeing your deeds.”\n",
        "TRANSLATION_5": "Saying: \"Make you perfect coats of mail, and balance well the rings of chain armor [Sard], and work you (men) righteousness. Truly, I am All-Seer of what you do.\"\n",
        "TRANSLATION_6": "Saying: Make ample (coats of mail), and assign a time to the making of coats of mail and do good; surely I am Seeing what you do.\n",
        "TRANSLATION_7": "Fashion wide coats of mail, and measure well the links. ' -- And do ye righteousness, for surely I see the things you do.\n",
        "TRANSLATION_8": "Saying: Make thou long coats of mail and measure the links (thereof). And do ye right. Lo! I am Seer of what ye do.\n",
        "TRANSLATION_9": "Make full-length coats of mail, measuring the links well. And do righteous deeds. Surely, I see all that you do.\"\n",
        "TRANSLATION_10": "Saying: make thou complete coats of mail, and rightly dispose the links, and work ye, righteously; verily I am of that which Ye work a Beholder.\n",
        "TRANSLATION_11": "saying, ‘Make easy coats of mail, and keep the measure in arranging [the links], and act righteously. Indeed I watch what you do.’\n",
        "TRANSLATION_12": "(Commanding), \"Make thou coast of mail, balancing well the rings of chain armour, and work ye righteousness; for be sure I see (clearly) all that ye do.\"\n",
        "TRANSLATION_13": "Saying: \"Make you perfect coats of mail, balancing well the rings of chain armour, and work you (men) righteousness. Truly, I am AllSeer of what you do.\"\n",
        "TRANSLATION_14": "(saying): 'Make large coats of mail and measure their links well. Do good deeds, for surely I see the things you do'\n",
        "TRANSLATION_15": "“Make coats of armor, and measure the links well; and work righteousness. I am Observant of everything you do.”\n",
        "TRANSLATION_16": "[Commanding him], \"Make full coats of mail and calculate [precisely] the links, and work [all of you] righteousness. Indeed I, of what you do, am Seeing.\"\n",
        "TRANSLATION_17": "[34:11] And We said: ‘Fashion, from it, long coats of mail — complete suits of armour which the person wearing it drags behind him along the ground — and measure [well] the links’, that is, in the weaving of the coats (the maker of these is called sarrād). In other words, make them so that the rings thereof are arranged properly. And act, O family of David, together with him, righteously. Indeed I am Seer of what you do, and will requite you for it accordingly.\n",
        "TRANSLATION_18": "(Saying: Make thou long coats of mail and measure the links (thereof)) the measure of a nail such that it is neither bigger nor smaller than it. (And do ye right) sincerely to Him. (Lo! I am Seer) Aware (of what ye do) of good or evil.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "34:11",
            "11:112",
            "20:35",
            "44:20",
            "53:17",
            "40:44",
            "49:18",
            "68:51",
            "100:10",
            "36:27"
        ],
        "BIBLE": [
            "torah:exodus:34:10",
            "prophets:ii%20kings:7:19",
            "prophets:ii%20kings:10:5",
            "prophets:ii%20kings:7:2",
            "torah:exodus:32:1",
            "torah:genesis:2:18",
            "torah:exodus:36:5",
            "writings:daniel:2:26",
            "torah:exodus:36:6",
            "torah:exodus:23:13"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:1:13",
            "Sefer%20Yetzirah:4:4"
        ]
    }
}