{
    "VERSE": "34:12",
    "ARABIC": "وَلِسُلَيْمَٰنَ ٱلرِّيحَ غُدُوُّهَا شَهْرٌ وَرَوَاحُهَا شَهْرٌ وَأَسَلْنَا لَهُۥ عَيْنَ ٱلْقِطْرِ وَمِنَ ٱلْجِنِّ مَن يَعْمَلُ بَيْنَ يَدَيْهِ بِإِذْنِ رَبِّهِۦ وَمَن يَزِغْ مِنْهُمْ عَنْ أَمْرِنَا نُذِقْهُ مِنْ عَذَابِ ٱلسَّعِيرِ",
    "ENGLISH": {
        "TRANSLATION_0": "And We gave Sulayman power over the wind - a month's journey in the morning and a month in the afternoon. And We made a fount of molten brass flow out for him. And some of the jinn worked in front of him by his Lord's permission. And if a single one of them deviates at all from Our command, We let him taste the punishment of the Searing Blaze.",
        "TRANSLATION_1": "We (subjugated) the wind to Solomon. Its morning's journey took one month, and the evening's one month. We made a spring of molten brass to flow for him; and many jinns laboured for him by the will of his Lord. Anyone of them who turned from Our command was made to taste the torment of blazing fire.\n",
        "TRANSLATION_2": "And We subdued the wind to Solomon: its morning course was a month's journey and its evening course was a month's journey. We gave him a spring flowing with molten brass, and We subdued for him jinn who, by his Lord's permission, worked before him. Such of them as swerved from Our commandment, We let them taste the chastisement of the Blazing Fire.\n",
        "TRANSLATION_3": "(We made subservient to) Solomon the wind that travelled a month's journey in the morning and a month's journey in the evening. We made a stream of brass flow for him and some of the jinn worked for him by his Lord's command. We would make whichever of them (jinn) who turned away from Our command to suffer a burning torment.\n",
        "TRANSLATION_4": "And We gave the wind in Sulaiman’s control – its morning journey equal to a month’s course and the evening journey equal to a month’s course; and We sprung a stream of molten copper for him; and from the jinns, who worked before him by the command of his Lord; and those among them who turned away from Our command – We shall make them taste the punishment of the blazing fire.\n",
        "TRANSLATION_5": "And to Sulayman (We subjected) the wind, its morning was a month's (journey), and its afternoon was a month's (journey). And We caused a fount of Qitr to flow for him, and there were Jinn that worked in front of him, by the leave of his Lord. And whosoever of them turned aside from Our command, We shall cause him to taste of the torment of the blazing Fire.\n",
        "TRANSLATION_6": "And (We made) the wind (subservient) to Sulaiman, which made a month's journey in the morning and a month's journey in the evening, and We made a fountain of molten copper to flow out for him, and of the jinn there were those who worked before him by the command of his Lord; and whoever turned aside from Our command from among them, We made him taste of the punishment of burning.\n",
        "TRANSLATION_7": "And to Solomon the wind; its morning course was a month's journey, and its evening course was a month's journey. And We made the Fount of Molten Brass to flow for him. And of the jinn, some worked before him by the leave of his Lord; and such of them as swerved away from Our commandment, We would let them taste the chastisement of the Blaze;\n",
        "TRANSLATION_8": "And unto Solomon (We gave) the wind, whereof the morning course was a month's journey and the evening course a month's journey, and We caused the fount of copper to gush forth for him, and (We gave him) certain of the jinn who worked before him by permission of his Lord. And such of them as deviated from Our command, them We caused to taste the punishment of flaming Fire.\n",
        "TRANSLATION_9": "We subjected the wind to Solomon; its morning course was a month and its evening course a month; and We caused a fount of molten copper to flow for him. And of the jinn there were some who worked under him, by the command of his Lord. If any one of them turned away from Our command, We would make him taste the punishment of the burning fire.\n",
        "TRANSLATION_10": "And Unto Sulaiman We subjected the wind, whereof the morning journeying was a month and the evening journeying a month. And We made a fount of brass to flow for him. And of the Jinn were some who worked before him by the Will Of his Lord. And whosoever of them swerved from Our command, him We shall cause to taste the torment of the Blaze.\n",
        "TRANSLATION_11": "And for Solomon [We subjected] the wind: its morning course was a month’s journey and its evening course was a month’s journey. We made a fount of [molten] copper flow for him, and [We placed at his service] some of the jinn who would work for him by the permission of his Lord, and if any of them swerved from Our command, We would make him taste the punishment of the Blaze.\n",
        "TRANSLATION_12": "And to Solomon (We made) the Wind (obedient): Its early morning (stride) was a month's (journey), and its evening (stride) was a month's (journey); and We made a Font of molten brass to flow for him; and there were Jinns that worked in front of him, by the leave of his Lord, and if any of them turned aside from our command, We made him taste of the Penalty of the Blazing Fire.\n",
        "TRANSLATION_13": "And to Solomon (We subjected) the wind, its morning (stride from sunrise till midnoon) was a month's (journey), and its afternoon (stride from the midday decline of the sun to sunset) was a month's (journey i.e. in one day he could travel two months' journey). And We caused a fount of (molten) brass to flow for him, and there were jinns that worked in front of him, by the Leave of his Lord, and whosoever of them turned aside from Our Command, We shall cause him to taste of the torment of the blazing Fire.\n",
        "TRANSLATION_14": "To Solomon the morning course of the wind was a month's journey, and its evening course was also a month's journey. We caused copper to be (as a) molten spring for him. And the jinn, some served him by the permission of his Lord. But as for those amongst them that swerved away from Our Command, We shall let them taste the punishment of the Blaze (the Fire).\n",
        "TRANSLATION_15": "And for Solomon the wind—its outward journey was one month, and its return journey was one month. And We made a spring of tar flow for him. And there were sprites that worked under him, by the leave of his Lord. But whoever of them swerved from Our command, We make him taste of the punishment of the Inferno.\n",
        "TRANSLATION_16": "And to Solomon [We subjected] the wind - its morning [journey was that of] a month - and its afternoon [journey was that of] a month, and We made flow for him a spring of [liquid] copper. And among the jinn were those who worked for him by the permission of his Lord. And whoever deviated among them from Our command - We will make him taste of the punishment of the Blaze.\n",
        "TRANSLATION_17": "[34:12] And, We disposed, for Solomon the wind (the nominative reading of al-rīhu would be based on an implicit [missing verb] sakhkharnā, ‘We disposed’) its morning course, meaning its journey from the morning to the noon, was a month’s journey and its evening course, that is, its journey from the noon to sunset, was a month’s journey. And We caused a fount of [molten] copper to flow for him, in other words, We caused the   copper to melt for him, and so the fount flowed for three days and nights like water, and to this day people have been using of that [copper] which was given to Solomon [at that time]. And of the jinn [there] were those who worked before him by the leave, by the command, of his Lord. And such of them as deviated from Our command, to him to obey him [Solomon], We would make them taste the chastisement of the Blaze, the Fire in the Hereafter — but it is also said, [that their chastisement was] in this world, in which case an angel would smite one of them with a lash thereof that would scorch him.\n",
        "TRANSLATION_18": "(And unto Solomon (We gave) the wind) and We made the wind subservient to Solomon, (whereof the morning course was a month's journey) He would go in the morning from Jerusalem to Istakhr, which was a month's journey (and the evening course a month's journey) and come back in the evening from Istakhr to Jerusalem which was another month's journey, (and We caused the fount of copper to gush forth for him) to make of it what whatever he pleased, (and (We gave him) certain of the jinn) and made the jinn subservient to him (who worked before him) by means of magic buildings and other things (by permission of his Lord) by command of his Lord. (And such of them as deviated from) as disobey or rebel against (Our command) with which We commanded them; it is also said that this means: the command of Solomon, (them We caused to taste the punishment of flaming fire) it is also said that an angel hit with a pillar of fire whoever disobeyed among the jinn.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "34:12",
            "42:38",
            "97:4",
            "25:48",
            "18:28",
            "14:23",
            "2:97",
            "19:64",
            "22:76",
            "25:74"
        ],
        "BIBLE": [
            "torah:genesis:21:14",
            "torah:exodus:36:6",
            "torah:genesis:3:6",
            "prophets:i%20samuel:21:7",
            "torah:numbers:8:19",
            "torah:numbers:18:6",
            "prophets:judges:3:6",
            "prophets:nahum:1:14",
            "torah:leviticus:4:35",
            "writings:ii%20chronicles:24:12"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:1:12",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:3:3"
        ]
    }
}