{
    "VERSE": "34:14",
    "ARABIC": "فَلَمَّا قَضَيْنَا عَلَيْهِ ٱلْمَوْتَ مَا دَلَّهُمْ عَلَىٰ مَوْتِهِۦٓ إِلَّا دَآبَّةُ ٱلْأَرْضِ تَأْكُلُ مِنسَأَتَهُۥ فَلَمَّا خَرَّ تَبَيَّنَتِ ٱلْجِنُّ أَن لَّوْ كَانُوا۟ يَعْلَمُونَ ٱلْغَيْبَ مَا لَبِثُوا۟ فِى ٱلْعَذَابِ ٱلْمُهِينِ",
    "ENGLISH": {
        "TRANSLATION_0": "Then when We decreed that he should die, nothing divulged his death to them except the worm which ate his staff; so that when he fell down it was made clear to the jinn that if they had truly had knowledge of the Unseen they need not have stayed there suffering humiliating punishment.",
        "TRANSLATION_1": "When We ordained (Solomon's) death, none but the weevil, that was eating away his staff (on which he rested), pointed out to them that he was dead. When he fell down (dead) the jinns realised that if they had knowledge of the Unknown they would never have suffered demeaning labour.\n",
        "TRANSLATION_2": "When We executed Our decree of death on Solomon, nothing indicated to the jinn that he was dead except a worm eating away his staff. So when Solomon fell down, the jinn realised that had they known what lies in the realm beyond perception, they would not have continued to be in this humiliating chastisement.\n",
        "TRANSLATION_3": "When We decreed that Solomon should die, no one knew of his death except for a creeping creature of the earth who ate-up his staff. When he fell down, the jinn realized that if they had known about the unseen, they would not have remained in such a humiliating torment for so long.\n",
        "TRANSLATION_4": "So when We sent the command of death towards him, no one revealed his death to the jinns except the termite of the earth which ate his staff; and when he came to the ground, the truth about the jinns was exposed – if they had known the hidden, they would not have remained in the disgraceful toil.\n",
        "TRANSLATION_5": "Then when We decreed death for him, nothing informed them (Jinn) of his death except a little worm of the earth which kept (slowly) gnawing away at his stick. So when he fell down, the Jinn saw clearly that if they had known the Unseen, they would not have stayed in the humiliating torment.\n",
        "TRANSLATION_6": "But when We decreed death for him, naught showed them his death but a creature of the earth that ate away his staff; and when it fell down, the jinn came to know plainly that if they had known the unseen, they would not have tarried in abasing torment.\n",
        "TRANSLATION_7": "And when We decreed that he should die, naught indicated to them that he was dead but the Beast of the Earth devouring his staff; and when he fell down, the jinn saw clearly that, had they only known the Unseen, they would not have continued in the humbling chastisement.\n",
        "TRANSLATION_8": "And when We decreed death for him, nothing showed his death to them save a creeping creature of the earth which gnawed away his staff. And when he fell the jinn saw clearly how, if they had known the Unseen, they would not have continued in despised toil.\n",
        "TRANSLATION_9": "When We decreed Solomon's death, nothing indicated his death to them except a worm from the earth, which was eating away at his cane. When he fell down, the jinn plainly realized that if they had known what was unseen, they would not have had to continue with such humiliating labour.\n",
        "TRANSLATION_10": "Then when We decreed death for him, naught discovered his death to them' save a moving creature of the earth which gnawed away his staff. Then when he fell, the Jinn clearly perceived that, if they had known the unseen they would not have tarried in the ignominious torment.\n",
        "TRANSLATION_11": "When We decreed death for him, nothing apprised them of his death except a worm which gnawed away at his staff. And when he fell down, [the humans] realized that had the jinn known the Unseen, they would not have remained in a humiliating torment.\n",
        "TRANSLATION_12": "Then, when We decreed (Solomon's) death, nothing showed them his death except a little worm of the earth, which kept (slowly) gnawing away at his staff: so when he fell down, the Jinns saw plainly that if they had known the unseen, they would not have tarried in the humiliating Penalty (of their Task).\n",
        "TRANSLATION_13": "Then when We decreed death for him [Sulaiman (Solomon)], nothing informed them (jinns) of his death except a little worm of the earth, which kept (slowly) gnawing away at his stick, so when he fell down, the jinns saw clearly that if they had known the unseen, they would not have stayed in the humiliating torment.\n",
        "TRANSLATION_14": "And when We decreed (Solomon's) death, they had no indication that he was dead until (they saw a termite), a crawler of the earth eating away his staff. And when he fell down, the jinn realized that had they known the unseen, they would not have continued in their humiliating punishment.\n",
        "TRANSLATION_15": "Then, when We decreed death for him, nothing indicated his death to them except an earthworm eating at his staff. Then, when he fell down, it became clear to the sprites that, had they known the unseen, they would not have remained in the demeaning torment.\n",
        "TRANSLATION_16": "And when We decreed for Solomon death, nothing indicated to the jinn his death except a creature of the earth eating his staff. But when he fell, it became clear to the jinn that if they had known the unseen, they would not have remained in humiliating punishment.\n",
        "TRANSLATION_17": "[34:14] And when We decreed for him, for Solomon, death, in other words, [when] he died — he remained supported against his staff an entire year, while the jinn continued to toil in hard labour as was customary, unaware of his death, until [finally] when a termite ate through his staff, he fell to the ground [and was seen to be] dead — nothing indicated to them that he had died except a termite (al-ard is the verbal noun from uridat al-khashaba, passive verbal form, in other words, ‘it [the piece of wood] was eaten away by a termite [al-arada]’) that gnawed away at his staff (read minsa’atahu or minsātahu, replacing the hamza with an alif, meaning a ‘staff’, so called because [when describing it one would say] yunsa’u bihā, to mean it is used to repel or drive away [creatures]’). And when he fell down, dead, the jinn realised, it became apparent to them, that (an, is softened, in other words, annahum) had they known the Unseen — comprising what was hidden from them in the way of Solomon being dead — they would not have continued in the humiliating chastisement, [in] that hard labour of theirs, [in which they continued] as they supposed him to be alive, which is in contrast to what they would have supposed had they known the Unseen and the fact that he had been there an entire year, judging by how much of the staff the termite had eaten through after his death; in other words, [they would not have continued in the humiliating chastisement] for a single day or even a single night [longer].\n",
        "TRANSLATION_18": "(And when We decreed death for him) for Solomon, Solomon died and remained standing in his retreat for a year (nothing showed his death) the death of Solomon (to them save a creeping creature of the earth) a woodworm (which gnawed away his staff) and it is said: his short spear. (And when he fell) when Solomon fell to the ground (the jinn saw clearly how) the jinn and human beings saw clearly that they do not know the unseen, (if they had known the unseen, they would not have continued in despised toil) they would not have continued in their subservience. People thought before this that the jinn knew the unseen but when 484 they saw this they realised that they did not.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "34:14",
            "11:108",
            "27:65",
            "2:33",
            "27:82",
            "44:56",
            "3:191",
            "43:50",
            "42:29",
            "55:33"
        ],
        "BIBLE": [
            "writings:ruth:2:10",
            "torah:leviticus:9:24",
            "prophets:i%20samuel:31:5",
            "writings:i%20chronicles:10:5",
            "prophets:ezekiel:13:14",
            "prophets:ezekiel:43:3",
            "prophets:i%20samuel:25:23",
            "torah:genesis:19:1",
            "writings:daniel:10:7",
            "prophets:judges:18:7"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:1:7"
        ]
    }
}