{
    "VERSE": "34:16",
    "ARABIC": "فَأَعْرَضُوا۟ فَأَرْسَلْنَا عَلَيْهِمْ سَيْلَ ٱلْعَرِمِ وَبَدَّلْنَٰهُم بِجَنَّتَيْهِمْ جَنَّتَيْنِ ذَوَاتَىْ أُكُلٍ خَمْطٍ وَأَثْلٍ وَشَىْءٍ مِّن سِدْرٍ قَلِيلٍ",
    "ENGLISH": {
        "TRANSLATION_0": "But they turned away so We unleashed against them the flood from the great dam and exchanged their two gardens for two others containing bitter-tasting plants and tamarisk and a few lote trees.",
        "TRANSLATION_1": "But they turned away. So We let loose on them the inundation of (the dyke of) al-'Arim, replacing their gardens with two other gardens which bore only bitter gourd, and tamarisks and a few sparse lote-trees.\n",
        "TRANSLATION_2": "But they turned away and so We let loose upon them a devastating flood that swept away the dams and replaced their gardens by two others bearing bitter fruits, tamarisks, and a few lote trees.\n",
        "TRANSLATION_3": "They ignored (the evidence) and We sent to them a flood, arising from a broken dam. Nothing was left in their gardens but bitter fruits, some tamarisk and a few lotus trees.\n",
        "TRANSLATION_4": "In response they turned away – We therefore sent upon them a tremendous flood, and in exchange of their two gardens gave them two gardens bearing bitter fruit, and tamarisk, and some berries.\n",
        "TRANSLATION_5": "But they turned away, so We sent against them flood released from the dam, and We converted their two gardens into gardens producing bitter bad fruit, and Athl, and some few lote trees.\n",
        "TRANSLATION_6": "But they turned aside, so We sent upon them a torrent of which the rush could not be withstood, and in place of their two gardens We gave to them two gardens yielding bitter fruit and (growing) tamarisk and a few lote-trees.\n",
        "TRANSLATION_7": "But they turned away; so We loosed on them the Flood of Arim, and We gave them, in exchange for their two gardens, two gardens bearing bitter produce and tamarisk-bushes, and here and there a few lote-trees.\n",
        "TRANSLATION_8": "But they were froward, so We sent on them the flood of 'Iram, and in exchange for their two gardens gave them two gardens bearing bitter fruit, the tamarisk and here and there a lote-tree.\n",
        "TRANSLATION_9": "Yet they turned away [from the truth]. So We let loose on them a flood from the dam and replaced their two gardens by two others bearing bitter fruits, tamarisks, and a few lote trees.\n",
        "TRANSLATION_10": "But they turned away. Wherefore We sent upon them the inundation of the dam and We exchanged their two gardens for two gardens bearing bitter fruit, and tamarisk. And some few lote-trees.\n",
        "TRANSLATION_11": "But they disregarded [the path of Allah], so We unleashed upon them a violent flood and replaced their two gardens with two gardens bearing bitter fruit, tamarisk, and sparse lote trees.\n",
        "TRANSLATION_12": "But they turned away (from Allah), and We sent against them the Flood (released) from the dams, and We converted their two garden (rows) into \"gardens\" producing bitter fruit, and tamarisks, and some few (stunted) Lote-trees.\n",
        "TRANSLATION_13": "But they turned away (from the obedience of Allah), so We sent against them Sail Al'Arim (flood released from the dam), and We converted their two gardens into gardens producing bitter bad fruit, and tamarisks, and some few lotetrees.\n",
        "TRANSLATION_14": "But they turned away. So We sent against them the Flood (at the city) of Arim, and exchanged their gardens with two others bearing bitter fruit andTamarisks, and here and there a few Lotus trees.\n",
        "TRANSLATION_15": "But they turned away, so We unleashed against them the flood of the dam; and We substituted their two gardens with two gardens of bitter fruits, thorny shrubs, and meager harvest.\n",
        "TRANSLATION_16": "But they turned away [refusing], so We sent upon them the flood of the dam, and We replaced their two [fields of] gardens with gardens of bitter fruit, tamarisks and something of sparse lote trees.\n",
        "TRANSLATION_17": "[34:16] But they were disregardful, of giving thanks to Him and became disbelievers, so We unleashed upon them the flood of the Dam (al-‘arim is the plural of ‘arima, which is a structure or something similar that holds water back [to be stored] for when it is needed), in other words, [We unleashed upon them] the floodwaters of their valley which had been held back by the mentioned [structure] so that they engulfed their two gardens together with all their property. And We gave them in place of their two gardens two gardens bearing (dhawātay, a dual form of [feminine plural] dhawāt; usually [the form dhātay from] the singular   [would have been used]) bitter fruit, bitter and vile (ukul may be read as a genitive annexation [ukulin khamtin] in the sense of ‘that which is eaten [thereof being bitter]; or it may be read without [as ukuli khamtin]; and this [phrase] is supplemented [by the following, wa-athlin wa-shay’in min sidrin qalīl) and tamarisk and sparse lote trees.\n",
        "TRANSLATION_18": "(But they were froward) they turned away from faith and acceptance of the messengers and failed to give thanks, (so We sent on them the flood of 'Iram) the flood of a river which destroyed their gardens, houses and all their bounties. 'Iram was the name of a river in Yemen within which they built a dam. This dam had three superimposed openings, Allah destroyed the dam and destroyed them by means of its water, (and in exchange for their two gardens) which were destroyed (gave them two gardens bearing bitter fruit, the tamarisk and here and there a lote tree.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "34:16",
            "18:33",
            "19:60",
            "67:1",
            "42:9",
            "26:57",
            "15:19",
            "3:128",
            "54:49",
            "17:74"
        ],
        "BIBLE": [
            "writings:i%20chronicles:6:41",
            "prophets:joshua:22:4",
            "prophets:joshua:21:12",
            "prophets:jeremiah:23:39",
            "writings:nehemiah:13:10",
            "writings:song%20of%20songs:5:6",
            "prophets:i%20samuel:10:9",
            "prophets:jeremiah:32:25",
            "torah:genesis:1:29",
            "prophets:hosea:2:14"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:3:2",
            
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:6:1"
        ]
    }
}