{
    "VERSE": "34:17",
    "ARABIC": "ذَٰلِكَ جَزَيْنَٰهُم بِمَا كَفَرُوا۟ وَهَلْ نُجَٰزِىٓ إِلَّا ٱلْكَفُورَ",
    "ENGLISH": {
        "TRANSLATION_0": "That is how We repaid them for their ingratitude. Are any but the ungrateful repaid like this?",
        "TRANSLATION_1": "That is how We requited them for their ingratitude. We only punish those who are ungrateful.\n",
        "TRANSLATION_2": "Thus did We retribute them for their ingratitude. And none do We retribute in this manner except the utterly ungrateful.\n",
        "TRANSLATION_3": "This was how We recompensed them for their ungratefulness and thus do We recompense the ungrateful ones.\n",
        "TRANSLATION_4": "We gave them this reward – the recompense of their ingratitude; and whom do We punish, except the ungrateful?\n",
        "TRANSLATION_5": "Like this We requited them because they were ungrateful disbelievers. And never do We requite in such a way except those who are ungrateful (disbelievers).\n",
        "TRANSLATION_6": "This We requited them with because they disbelieved; and We do not punish any but the ungrateful.\n",
        "TRANSLATION_7": "Thus We recompensed them for their unbelief; and do 'We ever recompense any hut the unbeliever?\n",
        "TRANSLATION_8": "This We awarded them because of their ingratitude. Punish We ever any save the ingrates?\n",
        "TRANSLATION_9": "We requited them in that way because of their ingratitude. We requite no one in that way but the ungrateful.\n",
        "TRANSLATION_10": "In this wise We requited them for they were ungrateful. And We requite not thus any save the ungrateful infidels.\n",
        "TRANSLATION_11": "We requited them with that for their ingratitude. Do We not requite ingrates?\n",
        "TRANSLATION_12": "That was the Requital We gave them because they ungratefully rejected Faith: and never do We give (such) requital except to such as are ungrateful rejecters.\n",
        "TRANSLATION_13": "Like this We requited them because they were ungrateful disbelievers. And never do We requit in such a way except those who are ungrateful, (disbelievers).\n",
        "TRANSLATION_14": "As such We recompensed them for their disbelief; do We recompense any except the unbelievers?\n",
        "TRANSLATION_15": "We thus penalized them for their ingratitude. Would We penalize any but the ungrateful?\n",
        "TRANSLATION_16": "[By] that We repaid them because they disbelieved. And do We [thus] repay except the ungrateful?\n",
        "TRANSLATION_17": "[34:17] That, replacement [of what they had], is what We requited them with for their ingratitude: and is anyone but the ingrate ever [so] requited? (read hal yujāzā illā’l-kafūru; or read as hal nujāzī illā’l-kafūra, ‘Would We requite anyone but the ingrate?’), in other words, it is only the like of such who is called to account.\n",
        "TRANSLATION_18": "This We awarded them) What befell them was a punishment (because of their ingratitude) for the blessings of Allah. (Punish We ever any save the ingrates) those who are ungrateful towards Allah and towards His blessings?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "34:17",
            "83:36",
            "85:7",
            "6:129",
            "26:99",
            "27:85",
            "80:42",
            "24:3",
            "5:61",
            "76:3"
        ],
        "BIBLE": [
            "prophets:isaiah:42:24",
            "prophets:ezekiel:16:34",
            "prophets:jeremiah:25:5",
            "writings:proverbs:31:3",
            "torah:genesis:45:21",
            "writings:psalms:106:15",
            "writings:job:41:3",
            "prophets:hosea:13:10",
            "prophets:judges:21:14",
            "prophets:jeremiah:8:13"
        ]
    }
}