{
    "VERSE": "34:18",
    "ARABIC": "وَجَعَلْنَا بَيْنَهُمْ وَبَيْنَ ٱلْقُرَى ٱلَّتِى بَٰرَكْنَا فِيهَا قُرًى ظَٰهِرَةً وَقَدَّرْنَا فِيهَا ٱلسَّيْرَ سِيرُوا۟ فِيهَا لَيَالِىَ وَأَيَّامًا ءَامِنِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "We placed between them and the cities We had blessed other clearly conspicuous cities, making them",
        "TRANSLATION_1": "Between them and the cities We had blessed We placed towns along the highway, and made them stages on their journey, (saying): \"Travel between them in safety by day or by night.\"\n",
        "TRANSLATION_2": "We placed other prominent towns between them, the towns that We had blessed and had set well-measured stages between them. Move back and forth between them, night and day, in perfect security.\n",
        "TRANSLATION_3": "We established between them and the town that We had blessed, other towns nearby, and thus made it easier to travel. We told them, \"Travel there safely day and night\".\n",
        "TRANSLATION_4": "And We had made several towns upon the road between them and the towns which We had blessed – and kept them according to the length of the journey; “Travel safely in them, by night and by day.”\n",
        "TRANSLATION_5": "And We placed, between them and the towns which We had blessed, towns easy to be seen, and We made the stages (of journey) between them easy (saying): \"Travel in them safely both by night and day.\"\n",
        "TRANSLATION_6": "And We made between them and the towns which We had blessed (other) towns to be easily seen, and We apportioned the journey therein: Travel through them nights and days, secure.\n",
        "TRANSLATION_7": "And We set, between them and the cities that We have blessed, cities apparent and well We measured the journey between them: 'Journey among them by night and day in security!'\n",
        "TRANSLATION_8": "And We set, between them and the towns which We had blessed, towns easy to be seen, and We made the stage between them easy, (saying): Travel in them safely both by night and day.\n",
        "TRANSLATION_9": "We had placed between them and the towns that We had blessed, other towns situated close to each other, and We fixed the stages [of journey] between them, saying, \"Travel between them in safety by night and day,\"\n",
        "TRANSLATION_10": "And We had placed between them and the cities\" which We had blest cities easy to be seen, and We had made the stages of journey between them easy:\" travel in them nights and days secure.\n",
        "TRANSLATION_11": "We had placed between them and the towns which We had blessed hamlets prominent [from the main route], and We had ordained the course through them: ‘Travel through them in safety, night and day.’\n",
        "TRANSLATION_12": "Between them and the Cities on which We had poured our blessings, We had placed Cities in prominent positions, and between them We had appointed stages of journey in due proportion: \"Travel therein, secure, by night and by day.\"\n",
        "TRANSLATION_13": "And We placed between them and the towns which We had blessed, towns easy to be seen, and We made the stages (of journey) between them easy (saying): \"Travel in them safely both by night and day.\"\n",
        "TRANSLATION_14": "Between them and the villages which We had blessed, We placed easily visible villages, and We spaced the journey between them exactly. (We said):'Travel through them by day and night in safety'\n",
        "TRANSLATION_15": "Between them and the towns We had blessed, We placed prominent towns, and We made the travel between them easy. “Travel between them by night and day, in safety.”\n",
        "TRANSLATION_16": "And We placed between them and the cities which We had blessed [many] visible cities. And We determined between them the [distances of] journey, [saying], \"Travel between them by night or day in safety.\"\n",
        "TRANSLATION_17": "[34:18] And We set between them, between Sheba, who were in Yemen, and the towns which We had blessed, with [abundance of] water and trees — these being the towns of Syria, to which they used to travel for commerce — prominent towns, continuous [along the route] from Yemen to Syria, and We facilitated [for travellers] the journeying through them, such that they would rest for the afternoon in one and spend the night in the next, [and so on] until the end of their travel, having no need of any supplies or water along the way; and We said, ‘Travel through them night and day safely’, having no fear by night or by day.\n",
        "TRANSLATION_18": "(And We set, between them) between the people of Sheba (and the towns which We had blessed) with water and trees, i.e. Jordan and Palestine, (towns easy to be seen) and close to each other, (and We made the stage between them) between these towns (easy) the march to them is a few hours or one night march, ((saying): Travel in them safely both by night and day) safe from hunger, thirst and thieves.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "34:18",
            "18:52",
            "32:25",
            "22:69",
            "16:124",
            "57:13",
            "70:26",
            "12:82",
            "56:60",
            "36:64"
        ],
        "BIBLE": [
            "prophets:i%20samuel:9:24",
            "prophets:i%20kings:2:24",
            "torah:numbers:14:14",
            "torah:genesis:22:14",
            "writings:i%20chronicles:29:3",
            "writings:ii%20chronicles:32:6",
            "writings:nehemiah:13:11",
            "prophets:i%20samuel:24:11",
            "torah:numbers:10:33",
            "prophets:i%20samuel:10:19"
        ]
    }
}