{
    "VERSE": "34:20",
    "ARABIC": "وَلَقَدْ صَدَّقَ عَلَيْهِمْ إِبْلِيسُ ظَنَّهُۥ فَٱتَّبَعُوهُ إِلَّا فَرِيقًا مِّنَ ٱلْمُؤْمِنِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Iblis was correct in his assessment of them and they followed him, except for a group of the muminun.",
        "TRANSLATION_1": "Thus Iblis found his supposition about them to be true; and except for a section of believers they follow him.\n",
        "TRANSLATION_2": "Iblis found his estimate of them to be true, and they followed him, except a party of the believers.\n",
        "TRANSLATION_3": "Iblis (satan) made his judgment about them to come true. They all followed them except a believing group among them.\n",
        "TRANSLATION_4": "And indeed Iblis made his assumptions regarding them seem true, so they all followed him except the group of Muslims.\n",
        "TRANSLATION_5": "And indeed Iblis did prove true his thought about them, and they followed him, all except a group of true believers.\n",
        "TRANSLATION_6": "And certainly the Shaitan found true his conjecture concerning them, so they follow him, except a party of the believers.\n",
        "TRANSLATION_7": "Iblis proved true his opinion of them, and they followed him, except a party of the believers.\n",
        "TRANSLATION_8": "And Satan indeed found his calculation true concerning them, for they follow him, all save a group of true believers.\n",
        "TRANSLATION_9": "Satan was correct in his assessment of them and they all followed him, except for a band of true believers,\n",
        "TRANSLATION_10": "And assuredly Iblis found his conjecture true concerning them; and they followed him all save a party of the believers.\n",
        "TRANSLATION_11": "Certainly Iblis had his conjecture come true about them. So they followed him—all except a part of the faithful.\n",
        "TRANSLATION_12": "And on them did Satan prove true his idea, and they followed him, all but a party that believed.\n",
        "TRANSLATION_13": "And indeed Iblis (Satan) did prove true his thought about them, and they followed him, all except a group of true believers (in the Oneness of Allah).\n",
        "TRANSLATION_14": "iblis' made his guess true to them; and all except for a party of believers followed him.\n",
        "TRANSLATION_15": "Satan was correct in his assessment of them. They followed him, except for a group of believers.\n",
        "TRANSLATION_16": "And Iblees had already confirmed through them his assumption, so they followed him, except for a party of believers.\n",
        "TRANSLATION_17": "[34:20] And verily Iblīs proved true (read sadaqa or saddaqa) his opinion of them, that is, of the disbelievers among them — [the folk of] Sheba — which was that by his tempting them to go astray, they would follow him. So they followed him ([if the verb above is read] sadaqa, this would mean that ‘he was right in his opinion’, and [if read] saddaqa, it would mean that ‘he found this [opinion of his] to be true’) — [all] except a group of the believers (mina’l-mu’minīna, [the min, ‘of’] is explicative [not partitive], in other words, [all except that group] who were the believers: they did not follow him).\n",
        "TRANSLATION_18": "(And Satan indeed found his calculation true concerning them, for they follow him) in their disbelief, (all save a group of true believers) it is also said that this means: they followed him by engaging in transgressions except for a group of believers who will enter Paradise without reckoning or punishment.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "34:20",
            "38:74",
            "54:17",
            "54:22",
            "54:32",
            "54:40",
            "17:41",
            "21:48",
            "15:24",
            "7:11"
        ],
        "BIBLE": [
            "prophets:i%20kings:18:21",
            "prophets:i%20kings:12:20",
            "writings:daniel:11:30",
            "torah:numbers:32:11",
            "prophets:joshua:20:6",
            "prophets:joshua:14:9",
            "prophets:i%20samuel:10:5",
            "prophets:jeremiah:51:52",
            "torah:deuteronomy:17:9",
            "torah:deuteronomy:1:36"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:5",
            
            "Sefer%20Yetzirah:1:6"
        ]
    }
}