{
    "VERSE": "34:23",
    "ARABIC": "وَلَا تَنفَعُ ٱلشَّفَٰعَةُ عِندَهُۥٓ إِلَّا لِمَنْ أَذِنَ لَهُۥ حَتَّىٰٓ إِذَا فُزِّعَ عَن قُلُوبِهِمْ قَالُوا۟ مَاذَا قَالَ رَبُّكُمْ قَالُوا۟ ٱلْحَقَّ وَهُوَ ٱلْعَلِىُّ ٱلْكَبِيرُ",
    "ENGLISH": {
        "TRANSLATION_0": "Intercession with Him will be of no benefit except from someone who has His permission. So that when the terror has left their hearts they will say, 'What did your Lord say?' They will say, 'The truth. He is the All- High, the Most Great.'",
        "TRANSLATION_1": "No intercession avails with Him except his He allows, so that when their hearts are freed of fear, they ask (one another): \"What did your Lord say?\" They will answer: \"What is expedient. He is the all-mighty and supreme.\"\n",
        "TRANSLATION_2": "No intercession can avail with Allah except for him whom Allah permits (to intercede). When their hearts are relieved of fright they will ask the intercessors: “What did your Lord say?” They will reply: “(He said) what is right, and He is the High, the Great.”\n",
        "TRANSLATION_3": "No intercession with Him will be of any benefit except that of those whom He has granted permission. The angels cannot intercede. They are always submissive to their Lord. Fear vanishes from their heart when (they receive a message from their Lord). They ask each other, \"What did your Lord say?\" Others answer, \"He spoke the Truth. He is the Most High and the Most Great.\"\n",
        "TRANSLATION_4": "And intercession does not benefit before Him, except for one whom He permits; to the extent that when the fear is removed from their hearts by giving permission, they say to each other, “How splendidly has your Lord spoken!” They say, “All that He has proclaimed is the Truth; and He is the Supreme, the Great.”\n",
        "TRANSLATION_5": "Intercession with Him profits not except for him whom He permits. So much so that when fear is banished from their hearts, they say: \"What is it that your Lord has said\" They say the truth. And He is the Most High, the Most Great.\n",
        "TRANSLATION_6": "And intercession will not avail aught with Him save of him whom He permits. Until when fear shall be removed from their hearts, They shall say: What is it that your Lord said? They shall say: The truth. And He is the Most High, the Great.\n",
        "TRANSLATION_7": "Intercession will not avail with Him save for him to whom He gives leave; till, when terror is lifted from their hearts, they will say, \"What said your Lord?' They will say, 'The truth; and He is the All-high; the All-great.'\n",
        "TRANSLATION_8": "No intercession availeth with Him save for him whom He permitteth. Yet, when fear is banished from their hearts, they say: What was it that your Lord said? They say: The Truth. And He is the Sublime, the Great.\n",
        "TRANSLATION_9": "No intercession avails with Him, except on the part of one to whom He grants permission. When their hearts are relieved of fear, they will enquire from those to whom permission is granted, \"What has your Lord said?\" They will answer, \"The truth. He is the Most High, the Supreme One.\"\n",
        "TRANSLATION_10": "lntercession with Him profiteth not save the intercession of him whom He giveth leave. They hold their peace until when fright is taken off from their hearts, they say: What is it that your Lord hath said? They say: the very truth. And He is the Exalted, the Great.\n",
        "TRANSLATION_11": "Intercession is of no avail with Him, except for those whom He permits. When fear is lifted from their hearts, they say, ‘What did your Lord say?’ They say, ‘The truth, and He is the All-exalted, the All-great.’\n",
        "TRANSLATION_12": "No intercession can avail in His Presence, except for those for whom He has granted permission. So far (is this the case) that, when terror is removed from their hearts (at the Day of Judgment, then) will they say, 'what is it that your Lord commanded?' they will say, 'That which is true and just; and He is the Most High Most Great'.\"\n",
        "TRANSLATION_13": "Intercession with Him profits not, except for him whom He permits. Until when fear is banished from their (angels') hearts, they (angels) say: \"What is it that your Lord has said?\" They say: \"The truth. And He is the Most High, the Most Great.\"\n",
        "TRANSLATION_14": "Intercession with Him will not help, except for him to whom He gives permission. When terror is lifted from their hearts, they shall say: 'What did your Lord say' 'The truth' they shall answer. 'He is the Most High, the Great'\n",
        "TRANSLATION_15": "Intercession with Him is of no value, except for someone He has permitted. Until, when fear has subsided from their hearts, they will say, “What did your Lord say?” They will say, “The truth, and He is the High, the Great.”\n",
        "TRANSLATION_16": "And intercession does not benefit with Him except for one whom He permits. [And those wait] until, when terror is removed from their hearts, they will say [to one another], \"What has your Lord said?\" They will say, \"The truth.\" And He is the Most High, the Grand.\n",
        "TRANSLATION_17": "[34:23] And intercession will not avail with Him, exalted be He — this was in response to their saying that their gods   would intercede [for them] with Him — except for him to whom leave is given, in this respect (read adhina, ‘[to whom] He gives leave’; or udhina, ‘[to whom] leave is given’). Yet, when fear is banished from their hearts (read active fazza‘a, or passive fuzzi‘a), [when fear] is removed from them, upon leave being given for this [intercession], they will say — some will say to others in anticipation of a favourable outcome — ‘What has your Lord said?’, concerning this. They will say: [He has said] the saying that is, ‘The truth’, in other words, leave has been given for it. And He is the Exalted, above His creation, by [His] subjugation [of them], the Great, the Tremendous.\n",
        "TRANSLATION_18": "(No intercession availeth) the angels will not intercede (with Him) on the Day of Judgement (save for him whom He permitteth) to intercede. Allah then mentions the weakness of the angels, for when the angels heard Allah uttering the revelation to Gabriel in order to take it to Muhammad (pbuh) they passed out due to the awe they sensed from Allah's speech. And they remained in this state. (Yet, when fear is banished from their hearts) and Gabriel came down to them, and they lifted their heads, (they say) the angels said to Gabriel and the angels who were with him: (What was it that your Lord said) Gabriel? (They say) Gabriel and the angels with him say: (The Truth) the Qur'an. (And He is the Sublime) more sublime than anyone and anything, (the Great) greater than everyone and everything.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "34:23",
            "43:86",
            "22:62",
            "31:30",
            "42:22",
            "19:87",
            "17:23",
            "20:109",
            "47:16",
            "7:206"
        ],
        "BIBLE": [
            "prophets:ii%20kings:10:15",
            "prophets:ezekiel:18:13",
            "prophets:judges:15:6",
            "prophets:jeremiah:20:9",
            "writings:ii%20chronicles:17:6",
            "writings:job:1:21",
            "torah:leviticus:10:3",
            "prophets:i%20kings:13:3",
            "writings:daniel:5:20",
            "writings:nehemiah:2:1"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:2:5"
        ]
    }
}