{
    "VERSE": "34:26",
    "ARABIC": "قُلْ يَجْمَعُ بَيْنَنَا رَبُّنَا ثُمَّ يَفْتَحُ بَيْنَنَا بِٱلْحَقِّ وَهُوَ ٱلْفَتَّاحُ ٱلْعَلِيمُ",
    "ENGLISH": {
        "TRANSLATION_0": "Say: 'Our Lord will bring us all together and then will judge between us with the truth. He is the Just Decider, the All-Knowing.'",
        "TRANSLATION_1": "Say: \"Our Lord will gather us together and judge between us equitably, for He is the Judge all-knowing.\"\n",
        "TRANSLATION_2": "Say: “Our Lord will bring us together and then He will rightly judge between us. He is the Great Judge, the All-Knowing.”\n",
        "TRANSLATION_3": "Say, \"Our Lord will gather us all together and issue the true Judgment about our differences. He is the Best Judge and All-knowing.\"\n",
        "TRANSLATION_4": "Say, “Our Lord will bring us all together, and then judge truthfully between us; and He is the Best Judge, the All Knowing.”\n",
        "TRANSLATION_5": "Say: \"Our Lord will assemble us all together, then He will judge between us with truth. And He is the Just Judge, the All-Knower of the true state of affairs.\"\n",
        "TRANSLATION_6": "Say: Our Lord will gather us together, then will He judge between us with the truth; and He is the greatest Judge, the All-knowing.\n",
        "TRANSLATION_7": "Say: 'Our Lord will bring us together, then make deliverance between us by the truth. He is the Deliverer, the All-knowing.'\n",
        "TRANSLATION_8": "Say: Our Lord will bring us all together, then He will judge between us with truth. He is the All-knowing Judge.\n",
        "TRANSLATION_9": "Tell them, \"Our Lord will gather us together; then He will judge between us with truth and justice. He is the Just Decider, the All Knowing.\"\n",
        "TRANSLATION_10": "Say thou: our Lord shall assemble us together, then He shall judge between us with truth; and He is the Great Judge, the Knower.\n",
        "TRANSLATION_11": "Say, ‘Our Lord will bring us together, then He will judge between us with justice, and He is the All-knowing Judge.’\n",
        "TRANSLATION_12": "Say: \"Our Lord will gather us together and will in the end decide the matter between us (and you) in truth and justice: and He is the one to decide, the One Who knows all.\"\n",
        "TRANSLATION_13": "Say: \"Our Lord will assemble us all together (on the Day of Resurrection), then He will judge between us with truth. And He is the (Most Trustworthy) AllKnowing Judge.\"\n",
        "TRANSLATION_14": "Say: 'Our Lord will bring us all together, then, with truth, He will rightly judge between us. He is the Opener, the Knower.\n",
        "TRANSLATION_15": "Say, “Our Lord will bring us together; then He will judge between us equitably. He is the All-Knowing Judge.”\n",
        "TRANSLATION_16": "Say, \"Our Lord will bring us together; then He will judge between us in truth. And He is the Knowing Judge.\"\n",
        "TRANSLATION_17": "[34:26] Say: ‘Our Lord will bring us together, on the Day of Resurrection, then He will judge between us with truth, and He will admit the truthful into Paradise and the liars into the Fire. And He is the Judge, the Knowing’, in what He judges.\n",
        "TRANSLATION_18": "(Say: Our Lord will bring us all together) on the Day of Judgement, (then He will judge between us with truth) with justice. (He is the All-Knowing Judge) He is the Judge and He knows the judgement.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "34:26",
            "27:78",
            "34:48",
            "7:121",
            "26:47",
            "39:75",
            "21:112",
            "10:40",
            "18:13",
            "26:98"
        ],
        "BIBLE": [
            "torah:deuteronomy:16:18",
            "torah:leviticus:23:28",
            "prophets:ezekiel:39:7",
            "writings:daniel:10:14",
            "prophets:isaiah:38:19",
            "torah:deuteronomy:13:15",
            "prophets:hosea:5:9",
            "prophets:ezekiel:35:11",
            "torah:exodus:18:16",
            "prophets:zechariah:12:3"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:3:2"
        ]
    }
}