{
    "VERSE": "34:27",
    "ARABIC": "قُلْ أَرُونِىَ ٱلَّذِينَ أَلْحَقْتُم بِهِۦ شُرَكَآءَ كَلَّا بَلْ هُوَ ٱللَّهُ ٱلْعَزِيزُ ٱلْحَكِيمُ",
    "ENGLISH": {
        "TRANSLATION_0": "Say: 'Show me those you have joined to Him as associates. No indeed! He is Allah, the Almighty, the All- Wise.'",
        "TRANSLATION_1": "Say: \"Just show me those you associate with Him as compeers.\" No, (you cannot), for He is God, the all-mighty and all-wise.\"\n",
        "TRANSLATION_2": "Say: “Show me those whom you have attached to Him as His associates (in Divinity).” Nay, Allah alone is Most Mighty, Most Wise.\n",
        "TRANSLATION_3": "Say, \"Show me those whom you have related to God as His partner. He is too Exalted to have any partners. He is the Majestic and All-wise God.\"\n",
        "TRANSLATION_4": "Say, “(Dare you) Show me those whom you have matched with Him – never! Rather only He is Allah, the Most Honourable, the Wise.”\n",
        "TRANSLATION_5": "Say: \"Show me those whom you have joined with Him as partners. Nay! But He is Allah, the Almighty, the All-Wise.\"\n",
        "TRANSLATION_6": "Say: Show me those whom you have joined with Him as associates; by no means (can you do it). Nay! He is Allah, the Mighty, the Wise.\n",
        "TRANSLATION_7": "Say: 'Show me those you have joined to Him as associates. No indeed; rather He is God, the All-mighty, the All-wise.'\n",
        "TRANSLATION_8": "Say: Show me those whom ye have joined unto Him as partners. Nay (ye dare not)! For He is Allah, the Mighty, the Wise.\n",
        "TRANSLATION_9": "Say to them, \"Show me those whom you have joined with Him as partners. No indeed! For He alone is God, the Mighty One, the Wise One.\"\n",
        "TRANSLATION_10": "Say thou: show me those whom ye have joined with Him as associates. By no means! Aye! He is Allah, the Mighty, the Wise.\n",
        "TRANSLATION_11": "Say, ‘Show me those whom you associate with Him as partners.’ No! [They can never show any such partner]. Indeed, He is Allah, the All-mighty, the All-wise.\n",
        "TRANSLATION_12": "Say: \"Show me those whom ye have joined with Him as partners: by no means (can ye). Nay, He is Allah, the Exalted in Power, the Wise.\"\n",
        "TRANSLATION_13": "Say (O Muhammad SAW to these polytheists and pagans): \"Show me those whom you have joined to Him as partners. Nay (there are not at all any partners with Him)! But He is Allah (Alone), the AllMighty, the AllWise.\"\n",
        "TRANSLATION_14": "Say: 'Show me those whom you joined with Him as associates; no, indeed; rather He is Allah, the Almighty, the Wise.\n",
        "TRANSLATION_15": "Say, “Show me those you have attached to Him as associates. No indeed! But He is God, the Powerful, the Wise.”\n",
        "TRANSLATION_16": "Say, \"Show me those whom you have attached to Him as partners. No! Rather, He [alone] is Allah, the Exalted in Might, the Wise.\"\n",
        "TRANSLATION_17": "[34:27] Say: ‘Show me, apprise me of, those whom you have joined to Him as associates, in worship. No indeed! — [this is] meant to deter them from [even] supposing that He has an associate. Rather He is God, the Mighty, Whose way will prevail, the Wise’, in the way in which He manages [the affairs of] His creation and so He could not have any associate in His kingdom.\n",
        "TRANSLATION_18": "(Say) Muhammad, to the people of Mecca: (Show me those whom ye have joined) ascribe (unto Him as partners) from among the idols; what have they created? Allah then said to them: (Nay (ye dare not)) because, they truly have not created anything! (For He is Allah) He created all that, (the Mighty) in retribution against the disbelievers, (the Wise) in His command and judgement; He commanded that none should be worshipped save Him.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "34:27",
            "4:158",
            "45:2",
            "39:1",
            "46:2",
            "42:3",
            "27:9",
            "57:1",
            "3:6",
            "59:1"
        ],
        "BIBLE": [
            "writings:ii%20chronicles:20:6",
            "prophets:hosea:2:25",
            "writings:ezra:9:15",
            "prophets:joshua:22:24",
            "torah:deuteronomy:8:18",
            "prophets:jeremiah:14:9",
            "torah:genesis:41:39",
            "writings:psalms:21:14",
            "torah:deuteronomy:4:35",
            "writings:psalms:102:25"
        ]
    }
}