{
    "VERSE": "34:29",
    "ARABIC": "وَيَقُولُونَ مَتَىٰ هَٰذَا ٱلْوَعْدُ إِن كُنتُمْ صَٰدِقِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "They say, 'When will this promise come about if you are telling the truth?'",
        "TRANSLATION_1": "Instead they say: \"When is this promise going to be, if you speak the truth?\"\n",
        "TRANSLATION_2": "They ask you: “When will this promise (of Resurrection) be fulfilled, if what you say is true?”\n",
        "TRANSLATION_3": "They say, \"When will the Day of Judgment be if what you say is true?\"\n",
        "TRANSLATION_4": "And they say, “When will this promise come, if you are truthful?\n",
        "TRANSLATION_5": "And they say: \"When is this promise if you are truthful\"\n",
        "TRANSLATION_6": "And they say: When will this promise be (fulfilled) if you are truthful?\n",
        "TRANSLATION_7": "They say, 'When shall this promise come to pass, if you speak the truth?'\n",
        "TRANSLATION_8": "And they say: When is this promise (to be fulfilled) if ye are truthful?\n",
        "TRANSLATION_9": "They ask, \"When will this promise be fulfilled, if you are truthful?\"\n",
        "TRANSLATION_10": "And they say: when is this promise to be fulfilled if ye say sooth?\n",
        "TRANSLATION_11": "They say, ‘When will this promise be fulfilled, if you are truthful?’\n",
        "TRANSLATION_12": "They say: \"When will this promise (come to pass) if ye are telling the truth?\"\n",
        "TRANSLATION_13": "And they say: \"When is this promise (i.e. the Day of Resurrection will be fulfilled) if you are truthful?\"\n",
        "TRANSLATION_14": "They ask: 'When, if what you say is true, will this promise come'\n",
        "TRANSLATION_15": "And they say, “When is this promise due, if you are truthful?”\n",
        "TRANSLATION_16": "And they say, \"When is this promise, if you should be truthful?\"\n",
        "TRANSLATION_17": "[34:29] And they say, ‘When shall this promise, of chastisement, be [fulfilled], if you are being truthful?’, concerning it.\n",
        "TRANSLATION_18": "(And they) the disbelievers of Mecca (say: When is this promise) Muhammad ((to be fulfilled) if ye are 486 truthful) if you are truthful that we will be raised after we die?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "10:48",
            "34:29",
            "36:48",
            "27:71",
            "21:38",
            "67:25",
            "21:9",
            "32:28",
            "50:28",
            "17:108"
        ],
        "BIBLE": [
            "torah:genesis:46:33",
            "prophets:jeremiah:3:16",
            "prophets:isaiah:65:24",
            "writings:i%20chronicles:17:11",
            "prophets:jeremiah:49:39",
            "prophets:zechariah:8:23",
            "prophets:judges:21:3",
            "prophets:nahum:3:7",
            "prophets:jeremiah:15:2",
            "prophets:hosea:2:23"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:8"
        ]
    }
}