{
    "VERSE": "34:30",
    "ARABIC": "قُل لَّكُم مِّيعَادُ يَوْمٍ لَّا تَسْتَـْٔخِرُونَ عَنْهُ سَاعَةً وَلَا تَسْتَقْدِمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Say: 'You have a promised appointment on a Day which you cannot delay or advance a single hour.'",
        "TRANSLATION_1": "Say: \"Determined is the day of the promise, which you can neither put back nor advance an hour.''\n",
        "TRANSLATION_2": "Say: “Your day is appointed, you can neither hold back its coming by an hour, nor hasten it by an hour.”\n",
        "TRANSLATION_3": "Say, \"That day has already been decreed for you and you cannot change the time of its coming even by a single hour.\"\n",
        "TRANSLATION_4": "Proclaim “For you is the promise of a Day which you cannot postpone by one moment nor can you advance it.”\n",
        "TRANSLATION_5": "Say: \"The appointment to you is for a Day, which you cannot put back for an hour nor put forward.\"\n",
        "TRANSLATION_6": "Say: You have the appointment of a day from which you cannot hold back any while, nor can you bring it on.\n",
        "TRANSLATION_7": "Say: 'You have the tryst of a day that you shall not put back by a single hour nor put it forward.'\n",
        "TRANSLATION_8": "Say (O Muhammad): Yours is the promise of a Day which ye cannot postpone nor hasten by an hour.\n",
        "TRANSLATION_9": "Say, \"A Day has already been appointed for you which you can neither delay nor advance by a single moment.\"\n",
        "TRANSLATION_10": "Say thou: the appointment to you is for a Day which ye cannot put back for one hour nor can ye anticipate.\n",
        "TRANSLATION_11": "Say, ‘Your promised hour is a day that you shall neither defer nor advance by an hour.’\n",
        "TRANSLATION_12": "Say: \"The appointment to you is for a Day, which ye cannot put back for an hour nor put forward.\"\n",
        "TRANSLATION_13": "Say (O Muhammad SAW): \"The appointment to you is for a Day, which you cannot put back for an hour (or a moment) nor put forward.\"\n",
        "TRANSLATION_14": "Say: 'You are promised a Day. You can neither hold it back, nor can you hasten it by a single hour'\n",
        "TRANSLATION_15": "Say, “You are promised a Day, which you cannot postpone by one hour, nor bring forward.”\n",
        "TRANSLATION_16": "Say, \"For you is the appointment of a Day [when] you will not remain thereafter an hour, nor will you precede [it].\"\n",
        "TRANSLATION_17": "[34:30] Say: ‘Yours is the tryst of a Day which you can neither defer nor advance by a single hour’, and this is the Day of Resurrection.\n",
        "TRANSLATION_18": "(Say) Muhammad: (Yours is the promise of a Day which) the tryst of the Day of Judgement (ye cannot postpone nor hasten by an hour) the appointed time.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "34:30",
            "30:12",
            "30:14",
            "26:87",
            "30:55",
            "36:59",
            "68:42",
            "3:194",
            "77:12",
            "2:123"
        ],
        "BIBLE": [
            "prophets:jeremiah:50:31",
            "prophets:isaiah:62:6",
            "prophets:i%20kings:2:9",
            "prophets:i%20kings:8:65",
            "writings:psalms:32:9",
            "prophets:ezekiel:21:30",
            "writings:job:14:5",
            "prophets:jeremiah:6:11",
            "writings:ii%20chronicles:7:8",
            "prophets:i%20kings:18:36"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:3:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:3"
        ]
    }
}