{
    "VERSE": "34:31",
    "ARABIC": "وَقَالَ ٱلَّذِينَ كَفَرُوا۟ لَن نُّؤْمِنَ بِهَٰذَا ٱلْقُرْءَانِ وَلَا بِٱلَّذِى بَيْنَ يَدَيْهِ وَلَوْ تَرَىٰٓ إِذِ ٱلظَّٰلِمُونَ مَوْقُوفُونَ عِندَ رَبِّهِمْ يَرْجِعُ بَعْضُهُمْ إِلَىٰ بَعْضٍ ٱلْقَوْلَ يَقُولُ ٱلَّذِينَ ٱسْتُضْعِفُوا۟ لِلَّذِينَ ٱسْتَكْبَرُوا۟ لَوْلَآ أَنتُمْ لَكُنَّا مُؤْمِنِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Those who are kafir say, 'We will never have iman in this Qur'an, nor in what came before it.' If only you could see when the wrongdoers, standing in the presence of their Lord, cast accusations back and forth at one another! Those deemed weak will say to those deemed great, 'Were it not for you, we would have been",
        "TRANSLATION_1": "The unbelievers say: \"We do not believe in this Qur'an, nor in what was (sent) before it.\" If only you could see the sinners when they are made to stand before their Lord, blaming one another! Those who were weak will say to those who were arrogant: \"But for you we would have certainly been believers.\"\n",
        "TRANSLATION_2": "The unbelievers say: “We shall never believe in this Qur'an, nor in any Scripture before it.” If you could only see the wrong-doers arrayed before their Lord, each bandying charges against the other. Those who were suppressed will say to those who waxed arrogant: “Had it not been for you, we would have been believers.”\n",
        "TRANSLATION_3": "The unbelievers have said, \"We shall never believe in this Quran nor in the Bible.\" Would that you could see the unjust having been halted in the presence of their Lord, exchanging words among themselves. The oppressed among them will say to their oppressors, \"Had it not been for you, we would certainly have been believers.\"\n",
        "TRANSLATION_4": "And the disbelievers said, “We shall never believe in this Qur’an nor in the Books that were before it”; and if only you see, when the unjust will be brought before their Lord; they will hurl allegations on one another; those who were subdued will say to those who were conceited, “If it were not for you, we would have certainly accepted faith.”\n",
        "TRANSLATION_5": "And those who disbelieve say: \"We believe not in this Qur'an nor in that which was before it.\" But if you could see when the wrongdoers are made to stand before their Lord, how they will cast the (blaming) word one to another! Those who were deemed weak will say to those who were arrogant: \"Had it not been for you, we should certainly have been believers!\"\n",
        "TRANSLATION_6": "And those who disbelieve say: By no means will we believe in this Quran, nor in that which is before it; and could you see when the unjust shall be made to stand before their Lord, bandying words one with another! Those who were reckoned weak shall say to those who were proud: Had it not been for you we would certainly have been believers.\n",
        "TRANSLATION_7": "The unbelievers say, 'We will not believe in this Koran, nor in that before it.' Ah, if thou couldst see when the evildoers are stationed before their Lord, bandying argument the one against the other! Those that were abased will say to those that waxed proud, 'Had it not been for you, we would have been believers.\n",
        "TRANSLATION_8": "And those who disbelieve say: We believe not in this Qur'an nor in that which was before it; but oh, if thou couldst see, when the wrong-doers are brought up before their Lord, how they cast the blame one to another; how those who were despised (in the earth) say unto those who were proud: But for you, we should have been believers.\n",
        "TRANSLATION_9": "Those who deny the truth say, \"We shall believe neither in this scripture nor in [any] that [came] before it.\" Could you but see when the wrongdoers will be made to stand before their Lord, casting blame on one another! Those who had been weak will say to the arrogant ones, \"Had it not been for you, we should certainly have been believers!\"\n",
        "TRANSLATION_10": "And those who disbelieve say: we shall by no means believe in this Qur'an nor in that which hath been before it. Would that thou couldst see when the wrong-doers shall be made to stand before their Lord! They shall cast back the word one to another; those who were deemed weak will say Unto those who were stiff-necked: had it not been for you, surely we should have been believers.\n",
        "TRANSLATION_11": "The faithless say, ‘We will never believe in this Quran, nor in what was [revealed] before it.’ But if you were to see when the wrongdoers will be made to stop before their Lord casting the blame on one another. Those who were abased will say to those who were arrogant, ‘Had it not been for you, we would surely have been faithful.’\n",
        "TRANSLATION_12": "The Unbelievers say: \"We shall neither believe in this scripture nor in (any) that (came) before it.\" Couldst thou but see when the wrong-doers will be made to stand before their Lord, throwing back the word (of blame) on one another! Those who had been despised will say to the arrogant ones: \"Had it not been for you, we should certainly have been believers!\"\n",
        "TRANSLATION_13": "And those who disbelieve say: \"We believe not in this Quran nor in that which was before it,\" but if you could see when the Zalimun (polytheists and wrongdoers, etc.) will be made to stand before their Lord, how they will cast the (blaming) word one to another! Those who were deemed weak will say to those who were arrogant: \"Had it not been for you, we should certainly have been believers!\"\n",
        "TRANSLATION_14": "The unbelievers say: 'We will not believe in this Koran, nor in (the Books) that were before it' If you could only see the harmdoers when they are brought before their Lord! They will argue against each other. Those who had been abased will say to those who were proud: 'But for you, we would have been believers'\n",
        "TRANSLATION_15": "Those who disbelieve say, “We will never believe in this Quran, nor in what came before it.” If you could only see the wrongdoers, captive before their Lord, throwing back allegations at one another. Those who were oppressed will say to those who were arrogant, “Were it not for you, we would have been believers.”\n",
        "TRANSLATION_16": "And those who disbelieve say, \"We will never believe in this Qur'an nor in that before it.\" But if you could see when the wrongdoers are made to stand before their Lord, refuting each other's words... Those who were oppressed will say to those who were arrogant, \"If not for you, we would have been believers.\"\n",
        "TRANSLATION_17": "[34:31] And those who disbelieve, from among the people of Mecca, say, ‘We will not believe in this Qur’ān, nor in that which was [revealed] before it’ — in other words, what preceded it, such as the Torah and the Gospel, both of which contain proofs of the Resurrection — because they reject the truth of this [last]. God, exalted   be He, says of them: But if you were to see, O Muhammad (s), when the evildoers, the disbelievers, are brought to stand before their Lord, bandying arguments against one another. Those who were oppressed — the followers — will say to those who were arrogant — the leaders: ‘Had it not been for you, barring us from faith, we would have been believers’, in the Prophet.\n",
        "TRANSLATION_18": "(And those who disbelieve) the disbelievers of Mecca: Abu Jahl Ibn Hisham and his host (say: We believe not in this Qur'an) which Muhammad (pbuh) recite unto us (nor in that which was before it) nor do we believe in the Scriptures revealed before him: the Torah and the Gospel and all the other Scriptures; (but oh, if thou couldst see) Muhammad, (when the wrong-doers) the idolaters: Abu Jahl and his host (are brought up before their Lord) restrained on the Day of Judgement, (how they cast the blame one to another) they argue with each other and curse one another; (how those who were despised (in the earth)) how those who were oppressed in the earth, these are the lowly among people (say unto those who were proud) too proud to accept faith: i.e. the leaders: (But for you, we should have been believers) in Muhammad (pbuh) and in the Qur'an.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "34:31",
            "3:50",
            "2:76",
            "43:49",
            "17:45",
            "32:12",
            "10:37",
            "41:38",
            "41:14",
            "17:88"
        ],
        "BIBLE": [
            "torah:genesis:39:17",
            "prophets:judges:21:5",
            "prophets:i%20kings:2:30",
            "torah:exodus:19:9",
            "prophets:jeremiah:2:31",
            "writings:daniel:10:11",
            "prophets:ii%20kings:9:26",
            "writings:ii%20chronicles:12:7",
            "writings:daniel:5:10",
            "prophets:i%20kings:19:9"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:1:7"
        ]
    }
}