{
    "VERSE": "34:36",
    "ARABIC": "قُلْ إِنَّ رَبِّى يَبْسُطُ ٱلرِّزْقَ لِمَن يَشَآءُ وَيَقْدِرُ وَلَٰكِنَّ أَكْثَرَ ٱلنَّاسِ لَا يَعْلَمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Say: 'My Lord expands the provision of anyone He wills or restricts it. But the majority of mankind do not know it.'",
        "TRANSLATION_1": "Say: \"Verily my Lord increases or restricts the provision of whosoever He will;\" but most men do not understand.\n",
        "TRANSLATION_2": "(O Prophet), say to them: “My Lord grants provision abundantly to whomsoever He pleases and straitens it for whomsoever He pleases. But most people do not know this.\n",
        "TRANSLATION_3": "Say, \"My Lord increases and determines the sustenance of whomever He wants, but most people do not know.\"\n",
        "TRANSLATION_4": "Proclaim “Indeed my Lord eases the sustenance for whomever He wills and restricts it for whomever He wills, but most people do not know.”\n",
        "TRANSLATION_5": "Say: \"Verily, my Lord expands the provision to whom He wills and restricts, but most men know not.\"\n",
        "TRANSLATION_6": "Say: Surely my Lord amplifies the means of subsistence for whom He pleases and straitens (for whom He pleases), but most men do not know.\n",
        "TRANSLATION_7": "Say: 'My Lord outspreads and straitens His provision to whomsoever He will, but most men do not know it.'\n",
        "TRANSLATION_8": "Say (O Muhammad): Lo! my Lord enlargeth the provision for whom He will and narroweth it (for whom He will). But most of mankind know not.\n",
        "TRANSLATION_9": "Say to them, \"My Lord increases the provision for whoever He pleases and decreases it for whoever He pleases; but most people do not know it.\"\n",
        "TRANSLATION_10": "Say thou: verily my Lord expandeth the provision for whomsoever He will and stinteth it; but most of mankind know not.\n",
        "TRANSLATION_11": "Say, ‘Indeed my Lord expands the provision for whomever He wishes and He tightens it, but most people do not know.’\n",
        "TRANSLATION_12": "Say: \"Verily my Lord enlarges and restricts the Provision to whom He pleases, but most men understand not.\"\n",
        "TRANSLATION_13": "Say (O Muhammad SAW): \"Verily, my Lord enlarges and restricts the provision to whom He pleases, but most men know not.\"\n",
        "TRANSLATION_14": "Say: 'My Lord outspreads and withholds His provision to whomsoever He will. But most people do not know'\n",
        "TRANSLATION_15": "Say, “My Lord spreads out His bounty to whomever He wills, or restricts it; but most people do not know.”\n",
        "TRANSLATION_16": "Say, \"Indeed, my Lord extends provision for whom He wills and restricts [it], but most of the people do not know.\"\n",
        "TRANSLATION_17": "[34:36] Say: ‘Truly my Lord extends provision, He makes it abundant, for whomever He will, as a test, and restricts [it], for whomever He will, to try [them], but most people, such as the disbelievers of Mecca, do not know’, this [truth].\n",
        "TRANSLATION_18": "(Say) Muhammad: (Lo! my Lord enlargeth the provision for whom He will) as a lure to perdition (and narroweth it (for whom He will) out of care for him. (But most of mankind) the people of Mecca (know not) this nor believe it.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "34:36",
            "27:73",
            "13:1",
            "40:59",
            "12:103",
            "14:36",
            "114:1",
            "34:28",
            "30:6",
            "2:21"
        ],
        "BIBLE": [
            "prophets:jeremiah:23:34",
            "torah:genesis:44:15",
            "prophets:ezekiel:38:14",
            "prophets:jonah:1:10",
            "prophets:jonah:1:14",
            "torah:numbers:11:16",
            "prophets:i%20kings:18:22",
            "torah:exodus:9:29",
            "prophets:ii%20kings:5:8",
            "torah:exodus:33:12"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:9",
            
            "Sefer%20Yetzirah:3:2"
        ]
    }
}