{
    "VERSE": "34:40",
    "ARABIC": "وَيَوْمَ يَحْشُرُهُمْ جَمِيعًا ثُمَّ يَقُولُ لِلْمَلَٰٓئِكَةِ أَهَٰٓؤُلَآءِ إِيَّاكُمْ كَانُوا۟ يَعْبُدُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "On the Day We gather them all together and then say to the angels, 'Was it you whom these people were worshipping?'",
        "TRANSLATION_1": "The day He will gather all of them together, He will ask the angels: \"Did they worship you?\"\n",
        "TRANSLATION_2": "And on the Day when He will muster them all and will ask the angels: “Are they the ones who worshipped you?”\n",
        "TRANSLATION_3": "On the day when God will rise them all together and ask the angels, \"Had these people been worshipping you?\"\n",
        "TRANSLATION_4": "And on the day when He will raise them all, and then say to the angels, “Did they worship you?”\n",
        "TRANSLATION_5": "And (remember) the Day when He will gather them all together, then He will say to the angels: \"Was it you that these people used to worship\"\n",
        "TRANSLATION_6": "And on the day when He will gather them all together, then will He say to the angels: Did these worship you?\n",
        "TRANSLATION_7": "Upon the day when He shall muster them all together, then He shall say to the angels, 'Was it you these were serving?\n",
        "TRANSLATION_8": "And on the day when He will gather them all together, He will say unto the angels: Did these worship you?\n",
        "TRANSLATION_9": "On the Day when He gathers them all together, He will ask the angels, \"Was it you that these people worshipped?\"\n",
        "TRANSLATION_10": "And on the Day whereon He gathereth them together, then He will say Unto the angels: was it ye that these were wont to worship?\n",
        "TRANSLATION_11": "On the day He will muster them all together, He will say to the angels, ‘Was it you that these used to worship?’\n",
        "TRANSLATION_12": "One Day He will gather them all together, and say to the angels, \"Was it you that these men used to worship?\"\n",
        "TRANSLATION_13": "And (remember) the Day when He will gather them all together, and then will say to the angels: \"Was it you that these people used to worship?\"\n",
        "TRANSLATION_14": "On the Day when He gathers them all together, He will say to the angels: 'Was it you that these worshipped'\n",
        "TRANSLATION_15": "On the Day when He gathers them all together, then say to the angels, “Was it you these used to worship?”\n",
        "TRANSLATION_16": "And [mention] the Day when He will gather them all and then say to the angels, \"Did these [people] used to worship you?\"\n",
        "TRANSLATION_17": "[34:40] And, mention, on the Day when He will gather them all together, namely, [all] the idolaters, He will say to the angels, ‘Was it these who used to worship you?’ (read a-hā’ūlā’i iyyākum, pronouncing both hamzas, or by replacing the first with a yā’ or dropping it altogether).\n",
        "TRANSLATION_18": "(And on the day when He will gather them) i.e. Banu Malih and the angels (all together, He will say Unto the angels: Did these worship you) by your command?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "34:40",
            "6:22",
            "25:22",
            "21:103",
            "28:65",
            "38:53",
            "38:73",
            "15:30",
            "25:25",
            "58:18"
        ],
        "BIBLE": [
            "prophets:ii%20kings:10:18",
            "prophets:i%20kings:12:7",
            "prophets:ii%20samuel:23:1",
            "writings:ii%20chronicles:18:5",
            "torah:exodus:3:12",
            "prophets:ezekiel:38:14",
            "torah:deuteronomy:8:19",
            "torah:exodus:32:1",
            "torah:exodus:10:7",
            "prophets:ii%20kings:17:12"
        ]
    }
}