{
    "VERSE": "34:45",
    "ARABIC": "وَكَذَّبَ ٱلَّذِينَ مِن قَبْلِهِمْ وَمَا بَلَغُوا۟ مِعْشَارَ مَآ ءَاتَيْنَٰهُمْ فَكَذَّبُوا۟ رُسُلِى فَكَيْفَ كَانَ نَكِيرِ",
    "ENGLISH": {
        "TRANSLATION_0": "Those before them also denied the truth but these people do not have even a tenth of what We gave to them. They denied My Messengers. And how complete was My denial!",
        "TRANSLATION_1": "Those before them had also denied, and they could not reach a tenth of (the possibilities) We had given them, and still they called My apostles liars. How great was the change that I wrought in their condition then!\n",
        "TRANSLATION_2": "Those who went before them also denounced (Allah's Messengers) as liars. They have not attained even a tenth of what We had given them. But when they rejected My Messengers, calling them liars, how terrible was My chastisement!\n",
        "TRANSLATION_3": "These people have not one tenth of power or wealth that we had given to those who lived before them. They called Our Messengers liars. Thus, how terrible was My vengeance.\n",
        "TRANSLATION_4": "And those before them had denied – and these have not reached even a tenth of what We had given them – so they denied My Noble Messengers; so how did My rejection turn out?\n",
        "TRANSLATION_5": "And those before them denied; these have not received even a tenth of what We had granted to those (of old); yet they denied My Messengers. Then how (terrible) was My denial!\n",
        "TRANSLATION_6": "And those before them rejected (the truth), and these have not yet attained a tenth of what We gave them, but they gave the lie to My apostles, then how was the manifestation of My disapproval?\n",
        "TRANSLATION_7": "Those that were before them also cried lies, yet they reached not a tenth of what We gave them; they cried lies to My Messengers, and how was My horror!\n",
        "TRANSLATION_8": "Those before them denied, and these have not attained a tithe of that which We bestowed on them (of old); yet they denied My messengers. How intense then was My abhorrence (of them)!\n",
        "TRANSLATION_9": "Their predecessors also rejected the truth. These have not attained to one tenth of the power that We had bestowed upon the earlier people. But they rejected My messengers. Then how terrible, was My chastisement!\n",
        "TRANSLATION_10": "And those before them belied; and these have not arrived Unto a tithe of that which We vouchsafed Unto them. But they belied My apostles. So how terrible was My disapproval\n",
        "TRANSLATION_11": "Those who were before them had also denied—and these have not attained one-tenth of what We had given them—they impugned My apostles, so how was My rebuttal!\n",
        "TRANSLATION_12": "And their predecessors rejected (the Truth); these have not received a tenth of what We had granted to those: yet when they rejected My messengers, how (terrible) was My rejection (of them)!\n",
        "TRANSLATION_13": "And those before them belied; these have not received one tenth (1/10th) of what We had granted to those (of old), yet they belied My Messengers, then how (terrible) was My denial (punishment)!\n",
        "TRANSLATION_14": "Those who have gone before them belied, yet they did not reach a tenth of what We gave them; yet they belied My Messengers. And how was (My) rejection (their destruction)!\n",
        "TRANSLATION_15": "Those before them also denied the Truth, yet they have not attained one-tenth of what We had given them. They rejected My messengers, so how was My disapproval?\n",
        "TRANSLATION_16": "And those before them denied, and the people of Makkah have not attained a tenth of what We had given them. But the former peoples denied My messengers, so how [terrible] was My reproach.\n",
        "TRANSLATION_17": "[34:45] And those who were before them [also] denied, and they, these ones [the Meccans], have not received [even] a tenth of what We gave those [others], in the way of might, long life and abundance of wealth. Yet they denied My messengers, [who were sent] to them, so how was My abhorrence! [so how was] My rebuttal against them through punishment and destruction, in other words, it was appropriate.\n",
        "TRANSLATION_18": "(Those before them denied) before your people, the Quraysh, denied the messengers, (and these have not attained a tithe of that which We bestowed on them (of old)) i.e. on the disbelievers of old; it is also said 488 that this means: their wealth and children have not reached even a tithe of the wealth and children that which We bestowed upon the disbelievers of old; (yet they denied My messengers. How intense then was My abhorrence (of them)) how intense was My chastisement when they disbelieved!\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "34:45",
            "67:18",
            "13:32",
            "21:41",
            "35:26",
            "51:52",
            "10:39",
            "22:44",
            "16:118",
            "43:25"
        ],
        "BIBLE": [
            "writings:song%20of%20songs:5:6",
            "prophets:isaiah:65:1",
            "torah:genesis:41:45",
            "prophets:i%20kings:9:13",
            "prophets:judges:15:18",
            "writings:daniel:10:1",
            "writings:daniel:8:12",
            "writings:nehemiah:12:38",
            "writings:nehemiah:12:31",
            "prophets:jeremiah:7:14"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:13",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:1:6"
        ]
    }
}