{
    "VERSE": "34:48",
    "ARABIC": "قُلْ إِنَّ رَبِّى يَقْذِفُ بِٱلْحَقِّ عَلَّٰمُ ٱلْغُيُوبِ",
    "ENGLISH": {
        "TRANSLATION_0": "Say: 'My Lord hurls forth the Truth - the Knower of all unseen things.'",
        "TRANSLATION_1": "Say: \"My Lord casts the truth: He is the knower of things unknown.\"\n",
        "TRANSLATION_2": "Say to them: “My Lord hurls down the Truth (upon me). He knows fully all that lies beyond the range of perception.”\n",
        "TRANSLATION_3": "Say, \"My Lord speaks the Truth. He has the knowledge of the unseen\".\n",
        "TRANSLATION_4": "Proclaim, “Indeed my Lord sends down the truth; the All Knowing of all the hidden.”\n",
        "TRANSLATION_5": "Say: \"Verily, my Lord sends down the truth, the All-Knower of the Unseen.\"\n",
        "TRANSLATION_6": "Say: Surely my Lord utters the truth, the great Knower of the unseen.\n",
        "TRANSLATION_7": "Say: 'My Lord hurls the truth -- the Knower of the Unseen.'\n",
        "TRANSLATION_8": "Say: Lo! my Lord hurleth the truth. (He is) the Knower of Things Hidden.\n",
        "TRANSLATION_9": "Say to them, \"My Lord hurls forth the Truth [at falsehood] and He is the knower of hidden things.\"\n",
        "TRANSLATION_10": "Say thou: verily my Lord hurleth the truth: the Knower of things hidden.\n",
        "TRANSLATION_11": "Say, ‘Indeed my Lord hurls the truth. [He is] the knower of all that is Unseen.’\n",
        "TRANSLATION_12": "Say: \"Verily my Lord doth cast the (mantle of) Truth (over His servants),- He that has full knowledge of (all) that is hidden.\"\n",
        "TRANSLATION_13": "Say (O Muhammad SAW): \"Verily! My Lord sends down Inspiration and makes apparent the truth (i.e. this Revelation that had come to me), the AllKnower of the Ghaib (unseen).\n",
        "TRANSLATION_14": "Say: 'My Lord hurls the truth the Knower of the Unseen'\n",
        "TRANSLATION_15": "Say, “My Lord projects the truth. He is the Knower of the Unseen.”\n",
        "TRANSLATION_16": "Say, \"Indeed, my Lord projects the truth. Knower of the unseen.\"\n",
        "TRANSLATION_17": "[34:48] Say: ‘Indeed my Lord hurls the truth, He casts it onto His prophets — [He is] the Knower of the Unseen’, [of] all that is hidden from His creatures throughout the heavens and the earth.\n",
        "TRANSLATION_18": "(Say) to them, Muhammad: (Lo! my Lord hurleth the Truth) He explains the Truth and commands the Truth. ((He is) the Knower of Things Hidden) He knows whatever is hidden from the servants.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "34:48",
            "34:26",
            "7:121",
            "26:47",
            "26:98",
            "26:188",
            "2:131",
            "15:86",
            "21:112",
            "51:30"
        ],
        "BIBLE": [
            "writings:i%20chronicles:17:19",
            "prophets:ii%20samuel:7:21",
            "prophets:nahum:3:6",
            "prophets:isaiah:38:16",
            "writings:daniel:6:13",
            "prophets:i%20samuel:28:2",
            "prophets:jeremiah:46:28",
            "prophets:i%20kings:14:13",
            "prophets:isaiah:43:19",
            "torah:deuteronomy:8:3"
        ]
    }
}