{
    "VERSE": "34:5",
    "ARABIC": "وَٱلَّذِينَ سَعَوْ فِىٓ ءَايَٰتِنَا مُعَٰجِزِينَ أُو۟لَٰٓئِكَ لَهُمْ عَذَابٌ مِّن رِّجْزٍ أَلِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "But those who strive against Our Signs, trying to nullify them, will have a punishment of agonising pain.",
        "TRANSLATION_1": "As for those who try to subvert Our signs, there is a punishment of painful torment.\n",
        "TRANSLATION_2": "As for those who worked against Our Signs in order to frustrate them, they shall suffer a painful chastisement.\n",
        "TRANSLATION_3": "However, those who try to challenge Our revelations will face the most painful torment.\n",
        "TRANSLATION_4": "And those who strove in Our signs in order to defeat – for them is a punishment from the severe painful punishments.\n",
        "TRANSLATION_5": "But those who strive against Our Ayat to frustrate them -- those, for them will be a severe painful torment.\n",
        "TRANSLATION_6": "And (as for) those who strive hard in opposing Our communications, these it is for whom is a painful chastisement of an evil kind.\n",
        "TRANSLATION_7": "And those who strive against Our signs to void them -- theirs shall be a chastisement of painful wrath.'\n",
        "TRANSLATION_8": "But those who strive against Our revelations, challenging (Us), theirs will be a painful doom of wrath.\n",
        "TRANSLATION_9": "But those who strive against Our signs, trying to defeat them, will suffer a painful torment.\n",
        "TRANSLATION_10": "And those who endeavoured to frustrate Our signs - those! theirs shall be a torment of afflictive calamity.\n",
        "TRANSLATION_11": "But those who contend with Our signs seeking to frustrate [their purpose], for such is a painful punishment due to defilement.\n",
        "TRANSLATION_12": "But those who strive against Our Signs, to frustrate them,- for such will be a Penalty,- a Punishment most humiliating.\n",
        "TRANSLATION_13": "But those who strive against Our Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) to frustrate them, those, for them will be a severe painful torment.\n",
        "TRANSLATION_14": "But those who labor against Our verses (thinking they are) frustrating (Our Messengers), theirs shall be the painful punishment of anger'\n",
        "TRANSLATION_15": "As for those who strive against Our revelations, seeking to undermine them—for them is a punishment of a painful plague.\n",
        "TRANSLATION_16": "But those who strive against Our verses [seeking] to cause failure - for them will be a painful punishment of foul nature.\n",
        "TRANSLATION_17": "[34:5] And those who strive against, [who strive] to invalidate, Our signs, namely, the Qur’ān, deeming Us inomnipotent (mu‘ajjizīna, a variant reading [of this] here and later on [in verse 38, below] is mu‘ājizīna: [so that respectively these mean] ‘deeming that We are incapable’ [mu‘ajjizīna], or [if read mu‘ājizīna] ‘vying   with Us, in order to elude Us’) for they suppose that there is no [such thing as] resurrection or punishment — for such there will be a chastisement of an awful punishment’ (read either alīmin or alīmun [respectively] as an adjectival qualification of rijzin, ‘punishment’ or ‘adhābun, ‘chastisement’).\n",
        "TRANSLATION_18": "(But those who strive against) those who deny (Our revelations) Muhammad (pbuh) and the Qur'an, (challenging (Us)) those will not escape Our punishment, (theirs will be a painful doom of wrath) they will have a severe chastisement.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "34:5",
            "45:11",
            "51:37",
            "29:23",
            "34:38",
            "22:57",
            "16:104",
            "10:97",
            "6:49",
            "2:104"
        ],
        "BIBLE": [
            "prophets:isaiah:66:19",
            "torah:numbers:14:11",
            "writings:daniel:3:32",
            "torah:exodus:34:10",
            "writings:proverbs:19:19",
            "torah:deuteronomy:17:4",
            "prophets:ezekiel:36:15",
            "prophets:ii%20kings:21:6",
            "writings:ii%20chronicles:33:6",
            "torah:leviticus:23:3"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:7"
        ]
    }
}