{
    "VERSE": "34:50",
    "ARABIC": "قُلْ إِن ضَلَلْتُ فَإِنَّمَآ أَضِلُّ عَلَىٰ نَفْسِى وَإِنِ ٱهْتَدَيْتُ فَبِمَا يُوحِىٓ إِلَىَّ رَبِّىٓ إِنَّهُۥ سَمِيعٌ قَرِيبٌ",
    "ENGLISH": {
        "TRANSLATION_0": "Say: 'If I am misguided, it is only to my detriment. But if I am guided, it is by what my Lord reveals to me. He is All-Hearing, Close-at-hand.'",
        "TRANSLATION_1": "Say: \"If I am in error it is to my own loss; if I am on guidance that is so because of what my Lord reveals to me. He is all-hearing and all-too-near.\"\n",
        "TRANSLATION_2": "Say: “If I go astray then the hurt of straying will come only upon me. But if I am rightly-guided, that is only because of the revelation that my Lord makes to me. He is All-Hearing, Ever Nigh.”\n",
        "TRANSLATION_3": "Say, \"If I go astray it will only be against my own soul, but if I receive guidance, it will be through my Lord's revelations.\" He is All-hearing and Omnipresent.\n",
        "TRANSLATION_4": "Proclaim, “If I stray, I stray only for my own harm; and if I attain guidance, it is because of what my Lord has sent down to me; indeed He is All Hearing, Close.”\n",
        "TRANSLATION_5": "Say: \"If (even) I go astray, I shall stray only to my own loss. But if I remain guided, it is because of the Revelation of my Lord to me. Truly, He is All-Hearer, Ever Near.\"\n",
        "TRANSLATION_6": "Say: If I err, I err only against my own soul, and if I follow a right direction, it is because of what my Lord reveals to me; surely He is Hearing, Nigh.\n",
        "TRANSLATION_7": "Say: 'If I go astray, I go astray only to my own loss; if I am guided, it is by what my Lord reveals to me. He is All-hearing, Ever-nigh.'\n",
        "TRANSLATION_8": "Say: If I err, I err only to my own loss, and if I am rightly guided it is because of that which my Lord hath revealed unto me. Lo! He is Hearer, Nigh.\n",
        "TRANSLATION_9": "Affirm, \"If I am in error, I shall carry the burden thereof; and if I am rightly guided, it is because of what my Lord has revealed to me. Truly, He is all-hearing and near at hand.\"\n",
        "TRANSLATION_10": "Say thou: if ever I go astray, I shall stray only against myself, and if I remain guided it is because of that which my Lord hath revealed Unto me. Verily He is Hearing, Nigh.\n",
        "TRANSLATION_11": "Say, ‘If I go astray, my going astray is only to my own harm, and if I am rightly guided that is because of what my Lord has revealed to me. Indeed He is all-hearing and nearmost.’\n",
        "TRANSLATION_12": "Say: \"If I am astray, I only stray to the loss of my own soul: but if I receive guidance, it is because of the inspiration of my Lord to me: it is He Who hears all things, and is (ever) near.\"\n",
        "TRANSLATION_13": "Say: \"If (even) I go astray, I shall stray only to my own loss. But if I remain guided, it is because of the Inspiration of my Lord to me. Truly, He is AllHearer, Ever Near (to all things).\"\n",
        "TRANSLATION_14": "Say: 'If I go astray, then I go astray only against myself; if I am guided it is because of that which my Lord has revealed to me. He is the Hearer, and theNear'\n",
        "TRANSLATION_15": "Say, “If I err, I err only to my own loss; but if I am guided, it is by what my Lord inspires me. He is Hearing and Near.”\n",
        "TRANSLATION_16": "Say, \"If I should err, I would only err against myself. But if I am guided, it is by what my Lord reveals to me. Indeed, He is Hearing and near.\"\n",
        "TRANSLATION_17": "[34:50] Say: ‘If I go astray, from the truth, I will be going astray only to my own loss, that is to say, the sin of my going astray shall be held against me; and if I am rightly guided, it will have been by what my Lord reveals to me, of the Qur’ān and wisdom. Truly He is Hearer, of supplications, Nigh’.\n",
        "TRANSLATION_18": "(Say) to them, Muhammad: (If I err) from the Truth and guidance, (I err only to my own loss) he says: the punishment of that is against my soul, (and if I am rightly guided) to the Truth and guidance (it is because of that which my Lord hath revealed unto me) that I am guided. (Lo! He is Hearer) of he who calls Him, (Nigh) in responding to whoever calls Him.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "34:50",
            "45:15",
            "17:25",
            "41:46",
            "28:33",
            "28:16",
            "6:104",
            "27:92",
            "10:108",
            "36:25"
        ],
        "BIBLE": [
            "torah:numbers:17:11",
            "prophets:isaiah:55:3",
            "torah:numbers:15:28",
            "prophets:i%20kings:18:12",
            "prophets:hosea:12:2",
            "prophets:jeremiah:20:4",
            "torah:numbers:30:9",
            "prophets:ii%20samuel:7:23",
            "prophets:ii%20kings:9:2",
            "prophets:ezekiel:6:9"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:4",
            
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:13",
            "Sefer%20Yetzirah:4:2",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:8"
        ]
    }
}