{
    "VERSE": "34:52",
    "ARABIC": "وَقَالُوٓا۟ ءَامَنَّا بِهِۦ وَأَنَّىٰ لَهُمُ ٱلتَّنَاوُشُ مِن مَّكَانٍۭ بَعِيدٍ",
    "ENGLISH": {
        "TRANSLATION_0": "They will say, 'We have iman in it,' but how can they reach out for it from a distant place -",
        "TRANSLATION_1": "They will say: \"We believe in it.\" How could they reach it from a place of no return?\n",
        "TRANSLATION_2": "They will then say: “We believe in it”; but whence can they attain it from so far-off a place?\n",
        "TRANSLATION_3": "and then they will say, \"We have faith in the Quran.\" How can they have any faith when they are far away from this world.\n",
        "TRANSLATION_4": "And they will say, “We accept faith in it”; and how can they attain it from so far away? (After they have crossed the limit of life allotted to them.)\n",
        "TRANSLATION_5": "And they will say: \"We do believe (now);\" but how could they receive (Tanawush) from a place so far off.\n",
        "TRANSLATION_6": "And they shall say: We believe in it. And how shall the attaining (of faith) be possible to them from a distant place?\n",
        "TRANSLATION_7": "and they say, 'We believe in it'; but how can they reach from a place far away,\n",
        "TRANSLATION_8": "And say: We (now) believe therein. But how can they reach (faith) from afar off,\n",
        "TRANSLATION_9": "then they will say, \"We now believe in Him.\" But how will they attain to faith, having gone so far away from it?\n",
        "TRANSLATION_10": "And then they will say: we believe therein. But whence can there be the attainment of faith from a place so afar.\n",
        "TRANSLATION_11": "They will say, ‘We believe in it [now]!’ But how can they attain it from a far-off place,\n",
        "TRANSLATION_12": "And they will say, \"We do believe (now) in the (Truth)\"; but how could they receive (Faith) from a position (so far off,-\n",
        "TRANSLATION_13": "And they will say (in the Hereafter): \"We do believe (now);\" but how could they receive (Faith and the acceptance of their repentance by Allah) from a place so far off (i.e. to return to the worldly life again).\n",
        "TRANSLATION_14": "and say: 'We believe in it' But how can they reach from a place that is distant,\n",
        "TRANSLATION_15": "And they say, “We have believed in it.” But how can they attain it from a distant place?\n",
        "TRANSLATION_16": "And they will [then] say, \"We believe in it!\" But how for them will be the taking [of faith] from a place far away?\n",
        "TRANSLATION_17": "[34:52] And they will say, ‘We believe in him [now]’, in other words, [in] Muhammad (s) — or [if read ‘We believe in it’, then] in the Qur’ān. But how can they attain [it] (read tanāwush or tanā’ush), that is, attain faith, from a place that is far away, from the place for [attaining] it — as they are [now] in the Hereafter, and the [proper] place for [attaining] it was in this world —\n",
        "TRANSLATION_18": "(And say) when the earth swallows them: (We (now) believe therein) in Muhammad (pbuh) and in the Qur'an. Allah says: (But how can they reach (faith)) and repent (from afar off) after death,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "34:52",
            "34:53",
            "25:12",
            "50:41",
            "22:26",
            "44:13",
            "89:23",
            "50:31",
            "19:57",
            "26:120"
        ],
        "BIBLE": [
            "prophets:judges:18:24",
            "prophets:judges:19:28",
            "prophets:i%20samuel:26:25",
            "prophets:ii%20kings:18:22",
            "prophets:isaiah:36:7",
            "prophets:ii%20samuel:3:16",
            "prophets:i%20kings:21:19",
            "prophets:jeremiah:13:7",
            "torah:genesis:32:1",
            "torah:genesis:38:22"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:2:1"
        ]
    }
}