{
    "VERSE": "34:53",
    "ARABIC": "وَقَدْ كَفَرُوا۟ بِهِۦ مِن قَبْلُ وَيَقْذِفُونَ بِٱلْغَيْبِ مِن مَّكَانٍۭ بَعِيدٍ",
    "ENGLISH": {
        "TRANSLATION_0": "when beforehand they had rejected it, shooting forth about the Unseen from a distant place?",
        "TRANSLATION_1": "They had surely denied it before and aimed without seeing from so far away.\n",
        "TRANSLATION_2": "They disbelieved in it before and indulged in conjectures from far away.\n",
        "TRANSLATION_3": "They had rejected it in their worldly life and expressed disbelief at the unseen (Day of Judgment), considering it less than a remote possibility.\n",
        "TRANSLATION_4": "For they had disbelieved in it before; and they hurl allegations without seeing, from far away.\n",
        "TRANSLATION_5": "Indeed they did disbelieve before (in this world), and they (used to) conjecture about the Unseen, from a far place.\n",
        "TRANSLATION_6": "And they disbelieved in it before, and they utter conjectures with regard to the unseen from a distant place.\n",
        "TRANSLATION_7": "seeing they disbelieved in it before, guessing at the Unseen from a place far away?\n",
        "TRANSLATION_8": "When they disbelieved in it of yore. They aim at the unseen from afar off.\n",
        "TRANSLATION_9": "They had rejected it before, while they indulged in conjectures from far away.\n",
        "TRANSLATION_10": "Whereas they disbelieved therein afore, and conjectured about the unseen from a place so afar.\n",
        "TRANSLATION_11": "when they denied it in the past—shooting at something invisible from a far-off place—\n",
        "TRANSLATION_12": "Seeing that they did reject Faith (entirely) before, and that they (continually) cast (slanders) on the unseen from a position far off?\n",
        "TRANSLATION_13": "Indeed they did disbelieve (in the Oneness of Allah, Islam, the Quran and Muhammad SAW) before (in this world), and they (used to) conjecture about the unseen [i.e. the Hereafter, Hell, Paradise, Resurrection and the Promise of Allah, etc. (by saying) all that is untrue], from a far place.\n",
        "TRANSLATION_14": "since they disbelieved in it before, guessing at the Unseen from a distant place?\n",
        "TRANSLATION_15": "They have rejected it in the past, and made allegations from a far-off place.\n",
        "TRANSLATION_16": "And they had already disbelieved in it before and would assault the unseen from a place far away.\n",
        "TRANSLATION_17": "[34:53] when they disbelieved in it before?, in this world. And they throw guesses at the Unseen from a far-off place, in other words, [they make guesses] about something the knowledge of which was hidden far away from them, as when they would say that the Prophet was a sorcerer, or a poet, or a soothsayer, or that the Qur’ān was sorcery, poetry or soothsaying.\n",
        "TRANSLATION_18": "(When they disbelieved in it) in Muhammad (pbuh) and in the Qur'an (of yore) before they were swallowed by the earth. (They aim at the unseen) they did but surmise in the life of the world when they said there is no Paradise or hell (from afar off) after death; it is also said that this means: after death, they ask to be returned to the life of this world by surmise.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "34:53",
            "34:52",
            "4:60",
            "25:12",
            "10:91",
            "2:3",
            "21:49",
            "5:102",
            "50:41",
            "15:10"
        ],
        "BIBLE": [
            "torah:genesis:32:31",
            "torah:genesis:22:14",
            "prophets:ii%20kings:9:26",
            "prophets:joshua:3:3",
            "prophets:judges:19:17",
            "prophets:judges:6:22",
            "writings:job:8:18",
            "torah:deuteronomy:1:31",
            "prophets:hosea:9:13",
            "torah:leviticus:10:17"
        ]
    }
}