{
    "VERSE": "34:54",
    "ARABIC": "وَحِيلَ بَيْنَهُمْ وَبَيْنَ مَا يَشْتَهُونَ كَمَا فُعِلَ بِأَشْيَاعِهِم مِّن قَبْلُ إِنَّهُمْ كَانُوا۟ فِى شَكٍّ مُّرِيبٍۭ",
    "ENGLISH": {
        "TRANSLATION_0": "A barrier will be set up between them and the thing that they desire, just as was done with their kind before. They too were in a state of crippling doubt.",
        "TRANSLATION_1": "A barrier shall be raised between them and what they desired, as was done with their partisans before. They too were filled with disquieting doubt.\n",
        "TRANSLATION_2": "A barrier will be placed between them and what they desire, as was done with the likes of them before. Surely they were in a disquieting doubt.\n",
        "TRANSLATION_3": "A gulf will exist between them and their desires on the Day of Judgment like the similar people who lived before. They, too, had lived in doubt and uncertainty (about the life hereafter).\n",
        "TRANSLATION_4": "And a barrier is set between them and what they desire*, as was done for their earlier groups; indeed they are in a doubt that deceives. (To accept faith or return to earth)\n",
        "TRANSLATION_5": "And a barrier will be set between them and that which they desire, as was done in the past with the people of their kind. Verily, they have been in grave doubt.\n",
        "TRANSLATION_6": "And a barrier shall be placed between them and that which they desire, as was done with the likes of them before: surely they are in a disquieting doubt.\n",
        "TRANSLATION_7": "And a barrier is set between them and that they desire, as was done with the likes of them aforetime; they were in doubt disquieting.\n",
        "TRANSLATION_8": "And a gulf is set between them and that which they desire, as was done for people of their kind of old. Lo! they were in hopeless doubt.\n",
        "TRANSLATION_9": "And between them and their desires a barrier shall be placed as was done in the past with people of their ilk; for they were indeed in disquieting doubt.\n",
        "TRANSLATION_10": "And they will be shut off from that which they will eagerly desire, as shall be done with the likes of them of yore. Verily they have been in doubt perplexing.\n",
        "TRANSLATION_11": "and a barrier is set between them and what they desire, as was done aforetime with their likes, who had remained in grave doubt?\n",
        "TRANSLATION_12": "And between them and their desires, is placed a barrier, as was done in the past with their partisans: for they were indeed in suspicious (disquieting) doubt.\n",
        "TRANSLATION_13": "And a barrier will be set between them and that which they desire [i.e. At-Taubah (turning to Allah in repentance) and the accepting of Faith etc.], as was done in the past with the people of their kind. Verily, they have been in grave doubt.\n",
        "TRANSLATION_14": "And a barrier is set between them and that which they desire, as it was done before with their like; they were in suspicious doubt'\n",
        "TRANSLATION_15": "A barrier will be placed between them and what they desire, as was done formerly with their counterparts. They were in disturbing doubt.\n",
        "TRANSLATION_16": "And prevention will be placed between them and what they desire, as was done with their kind before. Indeed, they were in disquieting denial.\n",
        "TRANSLATION_17": "[34:54] And a barrier is set between them and what they crave, in the way of faith — in other words, [their craving] to embrace it — just as was done with their counterparts, in [respect to] disbelief, formerly, in other words, before them. Indeed they used to be in grave doubt, [doubt] causing them to have misgivings about that in which they now believe, but the proofs for which they never considered in this world. Meccan: it consists of 45 or 46 verses, revealed after [sūrat] al-Furqān.\n",
        "TRANSLATION_18": "(And a gulf is set between them and that which they desire) of returning to the life of this world, (as was 489 done for people of their kind of old) and the adherents of their religion from among the disbelievers. (Lo! they were in hopeless doubt) they were in manifest doubt about the Creator of the heavens and the earth. And Allah knows best the secrets of His Book'. And of the surah in which the angels are mentioned, which is all Meccan and consists of 45 verses, 197 words and 3,130 letters: Surah 35: The Creator of Angels (Fatir) And of the surah in which the angels are mentioned, which is all Meccan and consists of 45 verses, 197 words and 3,130 letters:\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "34:54",
            "41:48",
            "15:10",
            "40:34",
            "38:8",
            "30:32",
            "58:5",
            "11:110",
            "41:45",
            "11:62"
        ],
        "BIBLE": [
            "prophets:ezekiel:18:30",
            "prophets:jeremiah:21:8",
            "torah:genesis:3:24",
            "prophets:i%20samuel:18:11",
            "torah:deuteronomy:30:19",
            "prophets:jeremiah:38:22",
            "prophets:joshua:7:26",
            "prophets:i%20samuel:2:8",
            "torah:exodus:32:12",
            "torah:exodus:10:6"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:8",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:4:10"
        ]
    }
}