{
    "VERSE": "34:8",
    "ARABIC": "أَفْتَرَىٰ عَلَى ٱللَّهِ كَذِبًا أَم بِهِۦ جِنَّةٌۢ بَلِ ٱلَّذِينَ لَا يُؤْمِنُونَ بِٱلْءَاخِرَةِ فِى ٱلْعَذَابِ وَٱلضَّلَٰلِ ٱلْبَعِيدِ",
    "ENGLISH": {
        "TRANSLATION_0": "Has he invented a lie against Allah or is he possessed?' No indeed! Those who do not believe in the Next World are in punishment and deeply misguided.",
        "TRANSLATION_1": "Has he fabricated a lie about God, or is he possessed?\" Not so; but those who believe not in the Hereafter are themselves afflicted and far astray.\n",
        "TRANSLATION_2": "Has he forged a lie against Allah, or is he afflicted with madness?” Nay, but those who do not believe in the Hereafter are doomed to be chastised and are far gone in error.\n",
        "TRANSLATION_3": "Has he invented this falsehood against God or is he possessed by jinn?\" However, those who do not have any faith in the life to come will suffer torment for their serious error.\n",
        "TRANSLATION_4": "“Has he fabricated a lie against Allah, or is he insane?” Rather those who disbelieve in the Hereafter are in the punishment and extreme error.\n",
        "TRANSLATION_5": "Has he invented a lie against Allah, or is there a madness in him Nay, but those who disbelieve in the Hereafter are (themselves) in a torment, and in far error.\n",
        "TRANSLATION_6": "He has forged a lie against Allah or there is madness in him. Nay! those who do not believe in the hereafter are in torment and in great error.\n",
        "TRANSLATION_7": "What, has he forged against God a lie, or is he possessed? Not so; but those who believe not in the Hereafter are in chastisement and far error.\n",
        "TRANSLATION_8": "Hath he invented a lie concerning Allah, or is there in him a madness? Nay, but those who disbelieve in the Hereafter are in torment and far error.\n",
        "TRANSLATION_9": "Has he invented a lie about God, or is he afflicted with madness?\" Indeed no. It is those who do not believe in the Hereafter who will suffer torment, for they have strayed far into error.\n",
        "TRANSLATION_10": "Hath he fabricated a lie against Allah, or is therein him a madness? Nay, but those who disbelieve in the Hereafter are themselves in a torment and error far-reaching:\n",
        "TRANSLATION_11": "Has he fabricated a lie against Allah, or is there a madness in him?’ Indeed, those who do not believe in the Hereafter languish in punishment and extreme error.\n",
        "TRANSLATION_12": "Has he invented a falsehood against Allah, or has a spirit (seized) him?\"- Nay, it is those who believe not in the Hereafter, that are in (real) Penalty, and in farthest error.\n",
        "TRANSLATION_13": "Has he (Muhammad SAW) invented a lie against Allah, or is there a madness in him? Nay, but those who disbelieve in the Hereafter are (themselves) in a torment, and in far error.\n",
        "TRANSLATION_14": "What, has he forged a lie about Allah, or is he mad' No, those who do not believe in the Everlasting Life are in the punishment and in far error.\n",
        "TRANSLATION_15": "Did he invent a lie about God, or is there madness in him?” Indeed, those who do not believe in the Hereafter are in torment, and far astray.\n",
        "TRANSLATION_16": "Has he invented about Allah a lie or is there in him madness?\" Rather, they who do not believe in the Hereafter will be in the punishment and [are in] extreme error.\n",
        "TRANSLATION_17": "[34:8] Has he invented (read a’ftarā; the hamza, read with a fatha vowelling, is for the interrogative and suffices in place of the conjunctive hamza) a lie against God, in this [respect], or is there a madness in him, [does he suffer] a dementia on account of which he has imagined that? God, exalted be He, says: Nay, but those who do not believe in the Hereafter, that comprises resurrection and chastisement, will be in the chastisement, thereat, and in error that is far, from the truth, in this world.\n",
        "TRANSLATION_18": "(Hath he) Muhammad (invented a lie concerning Allah, or is there in him a madness?) Allah said: (Nay, but those who disbelieve in the Hereafter) those who disbelieve in resurrection after death (are in torment) in the Hereafter (and far error) from the Truth and guidance in the life of this world.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "34:8",
            "14:3",
            "22:12",
            "10:69",
            "33:57",
            "17:10",
            "41:52",
            "24:19",
            "4:167",
            "50:26"
        ],
        "BIBLE": [
            "prophets:i%20samuel:19:23",
            "prophets:jeremiah:15:9",
            "prophets:i%20kings:18:12",
            "prophets:hosea:4:12",
            "prophets:ii%20kings:2:9",
            "torah:numbers:14:24",
            "prophets:isaiah:41:23",
            "prophets:i%20kings:19:3",
            "prophets:i%20kings:19:4",
            "prophets:judges:14:19"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:14",
            "Sefer%20Yetzirah:1:10",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:1:8"
        ]
    }
}