{
    "VERSE": "8:1",
    "ARABIC": "بِسْمِ ٱللَّهِ ٱلرَّحْمَٰنِ ٱلرَّحِيمِ يَسْـَٔلُونَكَ عَنِ ٱلْأَنفَالِ قُلِ ٱلْأَنفَالُ لِلَّهِ وَٱلرَّسُولِ فَٱتَّقُوا۟ ٱللَّهَ وَأَصْلِحُوا۟ ذَاتَ بَيْنِكُمْ وَأَطِيعُوا۟ ٱللَّهَ وَرَسُولَهُۥٓ إِن كُنتُم مُّؤْمِنِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "They will ask you about booty. Say: 'Booty belongs to Allah and the Messenger. So have taqwa of Allah and put things right between you. Obey Allah and His Messenger if you are muminun.'",
        "TRANSLATION_1": "THEY ASK YOU of (benefits accruing as) spoils of war. Tell them: \"The benefits belong to God and His Messenger.\" So fulfil your duty to God and keep peace among yourselves. Obey God and the Prophet, If you really believe.\n",
        "TRANSLATION_2": "They ask you concerning the spoils of war? Tell them: 'The spoils of war belong to Allah and the Messenger. So fear Allah, and set things right between you, and obey Allah and His Messenger if you are true believers.\n",
        "TRANSLATION_3": "They (the believers) ask you (Muhammad) about the booty captured (from the enemies) during a war. Tell them, \"It belongs to God and the Messengers. If you have faith, have fear of God. Settle the disputes among yourselves and obey God and His Messengers.\"\n",
        "TRANSLATION_4": "They ask you O dear Prophet (Mohammed – peace and blessings be upon him) concerning the war booty; say, “Allah and the Noble Messenger are the owners of the war booty; so fear Allah and maintain friendship among yourselves; and obey Allah and His Noble Messenger, if you have faith.\"\n",
        "TRANSLATION_5": "They ask you about Al-Anfal (the spoils of war). Say: \"Al-Anfal are for Allah and the Messenger.\" So have Taqwa of Allah and settle all matters of difference among you, and obey Allah and His Messenger, if you are believers.\n",
        "TRANSLATION_6": "They ask you about the windfalls. Say: The windfalls are for Allah and the Apostle. So be careful of (your duty to) Allah and set aright matters of your difference, and obey Allah and His Apostle if you are believers.\n",
        "TRANSLATION_7": "They will question thee concerning the spoils. Say: 'The spoils belong to God and the Messenger; so fear you God, and set things right between you, and obey you God and His Messenger, if you are believers.'\n",
        "TRANSLATION_8": "They ask thee (O Muhammad) of the spoils of war. Say: The spoils of war belong to Allah and the messenger, so keep your duty to Allah, and adjust the matter of your difference, and obey Allah and His messenger, if ye are (true) believers.\n",
        "TRANSLATION_9": "They ask you about the spoils of war. Say, \"They belong to God and His Messenger. So fear God, and set things right among yourselves, and obey God and His Messenger, if you are true believers:\n",
        "TRANSLATION_10": "They ask thee concerning the spoils of war. Say thou: the spoils of war are Allah's and the apostle's. So fear Allah, and set right the matter among you, and obey Allah and His apostle if ye are believers.\n",
        "TRANSLATION_11": "They ask you concerning the anfaal. Say, ‘The anfaal belong to Allah and the Apostle.’ So be wary of Allah and settle your differences, and obey Allah and His Apostle, should you be faithful.\n",
        "TRANSLATION_12": "They ask thee concerning (things taken as) spoils of war. Say: \"(such) spoils are at the disposal of Allah and the Messenger: So fear Allah, and keep straight the relations between yourselves: Obey Allah and His Messenger, if ye do believe.\"\n",
        "TRANSLATION_13": "They ask you (O Muhammad SAW) about the spoils of war. Say: \"The spoils are for Allah and the Messenger.\" So fear Allah and adjust all matters of difference among you, and obey Allah and His Messenger (Muhammad SAW), if you are believers.\n",
        "TRANSLATION_14": "They ask you about the spoils (of war). Say: 'The spoils belong to Allah and the Messenger. Therefore, have fear of Allah and set things right between you. Obey Allah and His Messenger, if you are believers'\n",
        "TRANSLATION_15": "They ask you about the bounties. Say, “The bounties are for God and the Messenger.” So be mindful of God, and settle your differences, and obey God and His Messenger, if you are believers.\n",
        "TRANSLATION_16": "They ask you, [O Muhammad], about the bounties [of war]. Say, \"The [decision concerning] bounties is for Allah and the Messenger.\" So fear Allah and amend that which is between you and obey Allah and His Messenger, if you should be believers.\n",
        "TRANSLATION_17": "[8:1] ‘They question you, O Muhammad (s), concerning the spoils of war — the booty — to whom do they belong? Say, to them: ‘The spoils of war belong to God, Who places them where He will, and the Messenger, who divides them according to God’s command. The Prophet (s) divided these [spoils] between them equally, as reported by al-Hākim in his al-Mustadrak. So fear God and set things right between you, that is, [set right] the reality of that [state of affairs] which is between you, through mutual affection and the refraining from quarrelling; and obey God and His Messenger, if you are, truly, believers’.\n",
        "TRANSLATION_18": "And from his narration on the authority of Ibn 'Abbas who said concerning the saying of Allah, Exalted is He, ((They ask thee (O Muhammad) of the spoils of war): 'He says: your Companions ask you about the spoils 182 of war on the Day of Badr and also about the officers for weapons and horses. (Say) Muhammad: (The spoils of war belong to Allah and the messenger) the spoils of war at Badr belong to Allah and His Messenger, and none of it is yours; it is also said: they all belong to Allah and the command of the Messenger regarding what is allowed, (so keep your duty to Allah) fear Allah concerning taking the spoils of war, (and adjust the matter of your difference) solve the differences among you: let the rich give to the poor and the strong to the weak and the young to the elderly, (and obey Allah and His messenger) in the matter of reconciliation, (if ye are (true) believers) in Allah and His Messenger.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "8:1",
            "4:61",
            "3:32",
            "24:48",
            "24:51",
            "24:52",
            "3:132",
            "40:14",
            "8:24",
            "24:54"
        ],
        "BIBLE": [
            "torah:genesis:4:15",
            "prophets:ii%20kings:2:10",
            "writings:ecclesiastes:3:14",
            "torah:genesis:22:2",
            "prophets:amos:6:13",
            "prophets:jeremiah:38:14",
            "torah:deuteronomy:30:1",
            "torah:genesis:30:15",
            "prophets:i%20samuel:10:19",
            "writings:daniel:6:13"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:6:1",
            
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:5:1"
        ]
    }
}