{
    "VERSE": "8:11",
    "ARABIC": "إِذْ يُغَشِّيكُمُ ٱلنُّعَاسَ أَمَنَةً مِّنْهُ وَيُنَزِّلُ عَلَيْكُم مِّنَ ٱلسَّمَآءِ مَآءً لِّيُطَهِّرَكُم بِهِۦ وَيُذْهِبَ عَنكُمْ رِجْزَ ٱلشَّيْطَٰنِ وَلِيَرْبِطَ عَلَىٰ قُلُوبِكُمْ وَيُثَبِّتَ بِهِ ٱلْأَقْدَامَ",
    "ENGLISH": {
        "TRANSLATION_0": "And when He overcame you with sleep, making you feel secure, and sent you down water from heaven to purify you and remove the taint of Shaytan from you, and to fortify your hearts and make your feet firm.",
        "TRANSLATION_1": "A blanketing sleep came over you as a (measure of) security from Him, and He sent down rain from the skies to cleanse you, and to remove the plague of Satan, and to strengthen your hearts and steady your steps.\n",
        "TRANSLATION_2": "And recall when Allah brought on you drowsiness, giving you a feeling of peace and security from Him, and He sent down rain upon you from the sky that He might cleanse you through it and take away from you the pollution of Satan and strengthen your hearts, and steady your feet through it.\n",
        "TRANSLATION_3": "The slumber that overcame you was from God that brought you peace. He showered water from the sky over you to clean you, remove satanic wickedness from you, strengthen your hearts, and grant you steadfastness.\n",
        "TRANSLATION_4": "When He made the slumber overcome you, so it was as a peacefulness from Him, and sent down water from the sky upon you to purify you with it, and to remove the impurity of Satan from you, and to give your hearts fortitude and firmly establish your feet with it.\n",
        "TRANSLATION_5": "(Remember) when He covered you with a slumber as a security from Him, and He caused water (rain) to descend on you from the sky, to clean you thereby and to remove from you the Rijz (whispering or dirt) of Shaytan, and to strengthen your hearts, and make your feet firm thereby.\n",
        "TRANSLATION_6": "When He caused calm to fall on you as a security from Him and sent down upon you water from the cloud that He might thereby purify you, and take away from you the uncleanness of the Shaitan, and that He might fortify your hearts and steady (your) footsteps thereby.\n",
        "TRANSLATION_7": "When He was causing slumber to overcome you as a security from Him, and sending down on you water from heaven, to purify you thereby, and to put away from you the defilement of Satan, and to strengthen your hearts, and to confirm your feet.\n",
        "TRANSLATION_8": "When He made the slumber fall upon you as a reassurance from him and sent down water from the sky upon you, that thereby He might purify you, and remove from you the fear of Satan, and make strong your hearts and firm (your) feet thereby.\n",
        "TRANSLATION_9": "He brought drowsiness upon you to give you His reassurance and sent down water from the sky upon you, so that He might thereby purify you and remove Satan's pollution from you, and make your hearts strong and your feet firm.\n",
        "TRANSLATION_10": "Recall what time He caused slumber to cover you as a security from Himself, and He sent down rain upon you from heaven that he might cleanse you thereby and take away from you the pollution of the Satan, and that he might gird up your hearts and make your feet firm thereby.\n",
        "TRANSLATION_11": "When He covered you with a trance as a [sense of] security from Him, and He sent down water from the sky to purify you with it, and to repel from you the defilement of Satan, and to fortify your hearts, and to make [your] feet steady with it.\n",
        "TRANSLATION_12": "Remember He covered you with a sort of drowsiness, to give you calm as from Himself, and he caused rain to descend on you from heaven, to clean you therewith, to remove from you the stain of Satan, to strengthen your hearts, and to plant your feet firmly therewith.\n",
        "TRANSLATION_13": "(Remember) when He covered you with a slumber as a security from Him, and He caused water (rain) to descend on you from the sky, to clean you thereby and to remove from you the Rijz (whispering, evil-suggestions, etc.) of Shaitan (Satan), and to strengthen your hearts, and make your feet firm thereby.\n",
        "TRANSLATION_14": "When you were overcome by sleep, as security from Him, He sent down water from the sky to cleanse you and to purify you of satan's filth, to strengthen your hearts and to steady your footsteps.\n",
        "TRANSLATION_15": "He made drowsiness overcome you, as a security from Him. And He sent down upon you water from the sky, to cleanse you with it, and to rid you of Satan’s pollution, and to fortify your hearts, and to strengthen your foothold.\n",
        "TRANSLATION_16": "[Remember] when He overwhelmed you with drowsiness [giving] security from Him and sent down upon you from the sky, rain by which to purify you and remove from you the evil [suggestions] of Satan and to make steadfast your hearts and plant firmly thereby your feet.\n",
        "TRANSLATION_17": "[8:11] Remember, when He caused slumber to overcome you as security, against the fear that had befallen you, from Him, from God, and sent down upon you water from the heaven, to purify you thereby, from minor and major ritual impurities; and to remove from you the evil of Satan, his whisperings to you that, had you been on the right path, you would not have been thirsty and impure, while the idolaters enjoyed [access to] water; and to strengthen, to seal, your hearts, with certainty and endurance; and to make firm your feet, lest they sink in the sand.\n",
        "TRANSLATION_18": "(When He made the slumber fall upon you) when He cast sleepiness upon you (as a reassurance) to you (from Him) from Allah against the enemy; and this is a favour from Allah towards you (and sent down water) rain (from the sky upon you, that thereby He might purify you) with rain from physical and minor and major ritual impurities, (and remove from you the fear of Satan) the whispering of Satan, (and make strong your hearts) and preserve your hearts with steadfastness (and firm) by means of the rain ((your) feet thereby) on the sand, i.e. He gathers the sand such that feet become firm on it.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "8:11",
            "18:14",
            "23:18",
            "16:10",
            "6:43",
            "15:22",
            "29:34",
            "23:97",
            "43:11",
            "6:121"
        ],
        "BIBLE": [
            "prophets:ezekiel:32:7",
            "torah:numbers:8:19",
            "prophets:jeremiah:51:16",
            "prophets:ezekiel:26:19",
            "torah:genesis:24:32",
            "prophets:jeremiah:10:13",
            "torah:deuteronomy:32:35",
            "prophets:ezekiel:24:17",
            "prophets:i%20kings:5:23",
            "writings:proverbs:11:5"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:2:1"
        ]
    }
}