{
    "VERSE": "8:13",
    "ARABIC": "ذَٰلِكَ بِأَنَّهُمْ شَآقُّوا۟ ٱللَّهَ وَرَسُولَهُۥ وَمَن يُشَاقِقِ ٱللَّهَ وَرَسُولَهُۥ فَإِنَّ ٱللَّهَ شَدِيدُ ٱلْعِقَابِ",
    "ENGLISH": {
        "TRANSLATION_0": "This was because they were hostile to Allah and His Messenger. If anyone is hostile to Allah and His",
        "TRANSLATION_1": "For they had opposed God and His Apostle; but whosoever opposes God and his Apostle (should know) that God is severe in retribution.\n",
        "TRANSLATION_2": "This is because they defied Allah and His Messenger. Whoever defies Allah and His Messenger must know that Allah is severe in punishment.\n",
        "TRANSLATION_3": "they have opposed God and His Messengers.\" For those who oppose God and His Messengers, God has prepared a severe retribution.\n",
        "TRANSLATION_4": "This is because they opposed Allah and His Noble Messenger; and whoever opposes Allah and His Noble Messenger – then indeed Allah’s punishment is severe.\n",
        "TRANSLATION_5": "This is because they defied and disobeyed Allah and His Messenger. And whoever defies and disobeys Allah and His Messenger, then verily, Allah is severe in punishment.\n",
        "TRANSLATION_6": "This is because they acted adversely to Allah and His Apostle; and whoever acts adversely to Allah and His Apostle-- then surely Allah is severe in requiting (evil).\n",
        "TRANSLATION_7": "That, because they had made a breach with God and with His Messenger; and whosoever makes a breach with God and with His Messenger, surely God is terrible in retribution.\n",
        "TRANSLATION_8": "That is because they opposed Allah and His messenger. Whoso opposeth Allah and His messenger, (for him) lo! Allah is severe in punishment.\n",
        "TRANSLATION_9": "That was because they defied God and His Messenger. He who defies God and His Messenger shall be severely punished by God.\n",
        "TRANSLATION_10": "This, because they have resisted Allah and His apostle; and whosoever resisteth Allah and His apostle, then verily Allah severe in retribution.\n",
        "TRANSLATION_11": "That, because they defied Allah and His Apostle. And whoever defies Allah and His Apostle, Allah is indeed severe in retribution.\n",
        "TRANSLATION_12": "This because they contended against Allah and His Messenger: If any contend against Allah and His Messenger, Allah is strict in punishment.\n",
        "TRANSLATION_13": "This is because they defied and disobeyed Allah and His Messenger. And whoever defies and disobeys Allah and His Messenger, then verily, Allah is Severe in punishment.\n",
        "TRANSLATION_14": "This is because they had made a breach with Allah and His Messenger. He who makes a breach with Allah and His Messenger indeed, Allah is stern in retribution.\n",
        "TRANSLATION_15": "That is because they opposed God and His Messenger. Whoever opposes God and His Messenger—God is severe in retribution.\n",
        "TRANSLATION_16": "That is because they opposed Allah and His Messenger. And whoever opposes Allah and His Messenger - indeed, Allah is severe in penalty.\n",
        "TRANSLATION_17": "[8:13] That, chastisement befalling them is, because they had contended with, they had opposed, God and His Messenger: whoever contends with God and with His Messenger, surely God is severe in retribution, against him.\n",
        "TRANSLATION_18": "(That) fighting (is because they opposed Allah and His messenger) in relation to Religion. (Whoso opposeth Allah and His messenger) in Religion, ((for him) lo! Allah is severe in punishment) when He punishes.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "8:13",
            "59:4",
            "40:22",
            "5:56",
            "3:32",
            "63:1",
            "24:52",
            "8:25",
            "48:13",
            "4:80"
        ],
        "BIBLE": [
            "prophets:ezekiel:15:8",
            "writings:job:10:2",
            "prophets:i%20samuel:28:15",
            "torah:leviticus:5:26",
            "writings:daniel:5:15",
            "prophets:ezekiel:35:11",
            "writings:daniel:8:19",
            "prophets:i%20samuel:28:2",
            "torah:exodus:22:11",
            "writings:daniel:6:8"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:6",
            
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:2:4"
        ]
    }
}