{
    "VERSE": "8:15",
    "ARABIC": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓا۟ إِذَا لَقِيتُمُ ٱلَّذِينَ كَفَرُوا۟ زَحْفًا فَلَا تُوَلُّوهُمُ ٱلْأَدْبَارَ",
    "ENGLISH": {
        "TRANSLATION_0": "You who have iman! when you encounter those who are kafir advancing in massed ranks into battle, do not turn your backs on them.",
        "TRANSLATION_1": "O believers, when you meet unbelievers on the field of battle, do not turn your backs to them.\n",
        "TRANSLATION_2": "Believers, whenever you encounter a hostile force of unbelievers, do not turn your backs to them in flight.\n",
        "TRANSLATION_3": "Believers, do not retreat when facing the marching army of the unbelievers, for no believer will turn back at that time except for strategic reasons or to join another band.\n",
        "TRANSLATION_4": "O People who Believe! When you confront a large army of disbelievers in battle, do not turn your backs to them.\n",
        "TRANSLATION_5": "O you who believe! When you meet those who disbelieve, in a battlefield, never turn your backs to them.\n",
        "TRANSLATION_6": "O you who believe! when you meet those who disbelieve marching for war, then turn not your backs to them.\n",
        "TRANSLATION_7": "O believers, when you encounter the unbelievers marching to battle, turn not your backs to them.\n",
        "TRANSLATION_8": "O ye who believe! When ye meet those who disbelieve in battle, turn not your backs to them.\n",
        "TRANSLATION_9": "Believers, when you meet in battle those who deny the truth, never turn your backs on them:\n",
        "TRANSLATION_10": "O Ye who believe! whenever ye those who disbelieve matching meet slowly turn to them not your backs.\n",
        "TRANSLATION_11": "O you who have faith! When you encounter the faithless advancing [for battle], do not turn your backs [to flee] from them.\n",
        "TRANSLATION_12": "O ye who believe! when ye meet the Unbelievers in hostile array, never turn your backs to them.\n",
        "TRANSLATION_13": "O you who believe! When you meet those who disbelieve, in a battle-field, never turn your backs to them.\n",
        "TRANSLATION_14": "Believers, when you encounter unbelievers on the march do not turn your backs to them in flight.\n",
        "TRANSLATION_15": "O you who believe! When you meet those who disbelieve on the march, never turn your backs on them.\n",
        "TRANSLATION_16": "O you who have believed, when you meet those who disbelieve advancing [for battle], do not turn to them your backs [in flight].\n",
        "TRANSLATION_17": "[8:15] O you who believe, when you encounter the disbelievers inching forward, that is, amassed, advancing slowly because of their large numbers, do not turn your backs to them, fleeing.\n",
        "TRANSLATION_18": "(0 ye who believe, When ye meet those who disbelieve) at Badr (in battle, turn not your backs to them) in defeat.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "8:15",
            "66:7",
            "59:12",
            "3:100",
            "3:130",
            "48:22",
            "61:2",
            "5:21",
            "54:45",
            "3:111"
        ],
        "BIBLE": [
            "prophets:judges:20:42",
            "writings:daniel:9:13",
            "prophets:joshua:7:12",
            "writings:ii%20chronicles:29:6",
            "prophets:ii%20samuel:22:41",
            "torah:numbers:21:33",
            "torah:exodus:23:27",
            "writings:ezra:10:14",
            "prophets:jeremiah:50:16",
            "prophets:hosea:6:11"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:3:4",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:4:1"
        ]
    }
}