{
    "VERSE": "8:16",
    "ARABIC": "وَمَن يُوَلِّهِمْ يَوْمَئِذٍ دُبُرَهُۥٓ إِلَّا مُتَحَرِّفًا لِّقِتَالٍ أَوْ مُتَحَيِّزًا إِلَىٰ فِئَةٍ فَقَدْ بَآءَ بِغَضَبٍ مِّنَ ٱللَّهِ وَمَأْوَىٰهُ جَهَنَّمُ وَبِئْسَ ٱلْمَصِيرُ",
    "ENGLISH": {
        "TRANSLATION_0": "Anyone who turns his back on them that day, unless he is withdrawing to rejoin the fight or withdrawing to support another group, brings Allah's anger down upon himself. His refuge is Hell. What an evil destination!",
        "TRANSLATION_1": "For any one who turns his back on that day, except to manoeuvre or rally to his side, will bring the wrath of God on himself, and have Hell as abode; and what an evil destination!\n",
        "TRANSLATION_2": "For he who turns his back on them on such ar occasion - except that it be for tactical reasons, or turning to join another company - he shall incur the wrath of Allah and Hell shall be his abode. It is an evil destination.\n",
        "TRANSLATION_3": "(Whoever deserts the believers) will incur the wrath of God and will dwell in hell, a terrible dwelling.\n",
        "TRANSLATION_4": "And on that day whoever turns his back to them, except for a battle strategy or to join one’s own company, has then turned towards Allah’s wrath, and his destination is hell; and what an evil place of return!\n",
        "TRANSLATION_5": "And whoever turns his back to them on such a day -- unless it be a stratagem of war, or to retreat to a troop (of his own) -- he indeed has drawn upon himself wrath from Allah. And his abode is Hell, and worst indeed is that destination!\n",
        "TRANSLATION_6": "And whoever shall turn his back to them on that day-- unless he turn aside for the sake of fighting or withdraws to a company-- then he, indeed, becomes deserving of Allah's wrath, and his abode is hell; and an evil destination shall it be.\n",
        "TRANSLATION_7": "Whoso turns his back that day to them, unless withdrawing to fight again or removing to join another host, he is laden with the burden of God's anger, and his refuge is Gehenna -- an evil homecoming!\n",
        "TRANSLATION_8": "Whoso on that day turneth his back to them, unless manoeuvring for battle or intent to join a company, he truly hath incurred wrath from Allah, and his habitation will be hell, a hapless journey's end.\n",
        "TRANSLATION_9": "whoever turns his back on such an occasion, unless it be as a stratagem of war, or in an endeavour to join another group [of the believers] will indeed draw down upon himself the wrath of God, and Hell shall be his abode and the worst indeed is that destination.\n",
        "TRANSLATION_10": "And whosoever turneth his back to them on such a day, unless it be swerving to a fight or wriggling round to anot her company, hath surely drawn upon himself indignation from Allah, and his resort is Hell--an evil destination!\n",
        "TRANSLATION_11": "Whoever turns his back [to flee] from them that day—unless [he is] diverting to fight or retiring towards another troop—shall certainly earn Allah’s wrath, and his refuge shall be hell, an evil destination.\n",
        "TRANSLATION_12": "If any do turn his back to them on such a day - unless it be in a stratagem of war, or to retreat to a troop (of his own)- he draws on himself the wrath of Allah, and his abode is Hell,- an evil refuge (indeed)!\n",
        "TRANSLATION_13": "And whoever turns his back to them on such a day - unless it be a stratagem of war, or to retreat to a troop (of his own), - he indeed has drawn upon himself wrath from Allah. And his abode is Hell, and worst indeed is that destination!\n",
        "TRANSLATION_14": "If anyone on that day turns his back to them in flight, except when maneuvering to fight, or to join another party, he shall be laden with the Anger of Allah and Gehenna shall be his refuge an evil arrival.\n",
        "TRANSLATION_15": "Anyone who turns his back on them on that Day, except while maneuvering for battle, or to join another group, has incurred wrath from God, and his abode is Hell—what a miserable destination!\n",
        "TRANSLATION_16": "And whoever turns his back to them on such a day, unless swerving [as a strategy] for war or joining [another] company, has certainly returned with anger [upon him] from Allah, and his refuge is Hell - and wretched is the destination.\n",
        "TRANSLATION_17": "[8:16] Whoever turns his back to them on that day, the day of the encounter with them, unless manœuvring, turning around, for battle — by pretending to be in flight, as a trick, while actually intending to relaunch an attack — or joining another detachment, a company of Muslims, calling on it for assistance, he has truly incurred the wrath of God, and his abode will be Hell — an evil journey’s end!, [an evil] return it is. This [threat] applies so long as the [numbers of] disbelievers do not surpass twice [that of the believers].\n",
        "TRANSLATION_18": "(Whoso on that day) the Day of Badr (turneth his back to them) and flees from them in defeat, (unless manoeuvring for battle) to re-continue fighting or to regroup to charge again (or intent to join a company) to assist and defend him, (he truly has incurred wrath from Allah) he has turned back and deserves Allah's wrath, (and his habitation) his abode (will be hell, a hapless journey's end) with which he will end up.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "8:16",
            "3:162",
            "3:28",
            "28:81",
            "4:88",
            "18:43",
            "2:271",
            "33:15",
            "16:106",
            "7:186"
        ],
        "BIBLE": [
            "prophets:malachi:3:7",
            "writings:nehemiah:1:9",
            "prophets:judges:19:9",
            "torah:genesis:18:10",
            "prophets:isaiah:13:13",
            "writings:lamentations:2:3",
            "prophets:jeremiah:30:18",
            "writings:esther:9:1",
            "prophets:jeremiah:31:23",
            "prophets:ezekiel:28:7"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:4:12"
        ]
    }
}