{
    "VERSE": "8:18",
    "ARABIC": "ذَٰلِكُمْ وَأَنَّ ٱللَّهَ مُوهِنُ كَيْدِ ٱلْكَٰفِرِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "That is your reward. Allah always confounds the schemes of the kuffar.",
        "TRANSLATION_1": "That was that, but remember God will make the plots of the unbelievers contemptible.\n",
        "TRANSLATION_2": "This is His manner of dealing with you. As for the unbelievers, Allah will surely undermine their designs.\n",
        "TRANSLATION_3": "This is how God causes the (evil) plans of the unbelievers to fail.\n",
        "TRANSLATION_4": "Therefore take this, and (know that) Allah will weaken the scheme of the disbelievers.\n",
        "TRANSLATION_5": "This (is the fact) and surely Allah weakens the deceitful plots of the disbelievers.\n",
        "TRANSLATION_6": "This, and that Allah is the weakener of the struggle of the unbelievers.\n",
        "TRANSLATION_7": "That for you; and that God weakens the unbelievers' guile.\n",
        "TRANSLATION_8": "That (is the case); and (know) that Allah (it is) Who maketh weak the plan of disbelievers.\n",
        "TRANSLATION_9": "that is what happened, and God will surely undermine the design of those who deny the truth.\n",
        "TRANSLATION_10": "Thus! And know that Allah weakenoth the contrivance of infidels.\n",
        "TRANSLATION_11": "Such is the case, and [know] that Allah undermines the stratagems of the faithless.\n",
        "TRANSLATION_12": "That, and also because Allah is He Who makes feeble the plans and stratagem of the Unbelievers.\n",
        "TRANSLATION_13": "This (is the fact) and surely, Allah weakens the deceitful plots of the disbelievers.\n",
        "TRANSLATION_14": "Allah will surely weaken the guile of the unbelievers.\n",
        "TRANSLATION_15": "Such is the case. God will undermine the strategy of the disbelievers.\n",
        "TRANSLATION_16": "That [is so], and [also] that Allah will weaken the plot of the disbelievers.\n",
        "TRANSLATION_17": "[8:18] That is, the true gift, for you, and [know] that God weakens the plan of the disbelievers.\n",
        "TRANSLATION_18": "(That) victory and spoils of war are for you; (and (know) that Allah (it is) Who maketh weak the plan of disbelievers) He weakens the disbelievers's plans.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "8:18",
            "12:52",
            "47:11",
            "7:178",
            "22:10",
            "3:182",
            "8:51",
            "86:16",
            "9:67",
            "24:25"
        ],
        "BIBLE": [
            "writings:job:10:2",
            "writings:psalms:45:18",
            "prophets:ezekiel:35:11",
            "prophets:ezekiel:24:9",
            "writings:job:13:23",
            "writings:psalms:51:8",
            "prophets:i%20samuel:28:2",
            "prophets:ezekiel:35:14",
            "writings:psalms:89:2",
            "writings:psalms:77:12"
        ]
    }
}