{
    "VERSE": "8:20",
    "ARABIC": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓا۟ أَطِيعُوا۟ ٱللَّهَ وَرَسُولَهُۥ وَلَا تَوَلَّوْا۟ عَنْهُ وَأَنتُمْ تَسْمَعُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "You who have iman! obey Allah and His Messenger. And do not turn away from him when you are able to hear.",
        "TRANSLATION_1": "O believers, obey God and His Messenger, and do not turn away from him when you hear (him speak);\n",
        "TRANSLATION_2": "Believers! Obey Allah and His Messenger and do not turn away from him after you hear his command.\n",
        "TRANSLATION_3": "Believers, obey God and His Messengers and do not turn away from Him when you hear (His commands).\n",
        "TRANSLATION_4": "O People who Believe! Obey Allah and His Noble Messenger, and do not turn away from him after you have heard him speak.\n",
        "TRANSLATION_5": "O you who believe! Obey Allah and His Messenger, and turn not away from him while you are hearing.\n",
        "TRANSLATION_6": "O you who believe! obey Allah and His Apostle and do not turn back from Him while you hear.\n",
        "TRANSLATION_7": "O believers, obey God and His Messenger, and do not turn away from Him, even as you are listening;\n",
        "TRANSLATION_8": "O ye who believe! Obey Allah and His messenger, and turn not away from him when ye hear (him speak).\n",
        "TRANSLATION_9": "Believers, obey God and His Messenger, and do not turn away from him now that you have heard all.\n",
        "TRANSLATION_10": "O Ye who believe! obey Allah and His apostle and turn not away therefrom while ye hearken.\n",
        "TRANSLATION_11": "O you who have faith! Obey Allah and His Apostle, and do not turn away from him while you hear [him].\n",
        "TRANSLATION_12": "O ye who believe! Obey Allah and His Messenger, and turn not away from him when ye hear (him speak).\n",
        "TRANSLATION_13": "O you who believe! Obey Allah and His Messenger, and turn not away from him (i.e. Messenger Muhammad SAW) while you are hearing.\n",
        "TRANSLATION_14": "Believers, obey Allah and His Messenger, and do not turn away from him when you are hearing.\n",
        "TRANSLATION_15": "O you who believe! Obey God and His Messenger, and do not turn away from him when you hear.\n",
        "TRANSLATION_16": "O you who have believed, obey Allah and His Messenger and do not turn from him while you hear [his order].\n",
        "TRANSLATION_17": "[8:20] O you who believe, obey God and His Messenger, and do not turn away from Him, by contravening His command, while you are listening, to the Qur’ān and the admonitions.\n",
        "TRANSLATION_18": "(0 ye who believe! Obey Allah and His messenger) in the matter of reconciliation, (and turn not away from him) do not turn away from the command of Allah and His Messenger (when ye hear) the admonition of the Qur'an and the matter of reconciliation.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "8:20",
            "8:27",
            "47:33",
            "3:200",
            "63:5",
            "9:1",
            "4:61",
            "9:119",
            "3:132",
            "33:70"
        ],
        "BIBLE": [
            "prophets:i%20kings:18:37",
            "prophets:jeremiah:31:18",
            "prophets:ezekiel:33:11",
            "torah:deuteronomy:11:28",
            "writings:psalms:85:9",
            "prophets:jonah:3:9",
            "writings:lamentations:5:22",
            "prophets:jeremiah:23:22",
            "writings:lamentations:5:21",
            "torah:deuteronomy:5:29"
        ]
    }
}