{
    "VERSE": "8:21",
    "ARABIC": "وَلَا تَكُونُوا۟ كَٱلَّذِينَ قَالُوا۟ سَمِعْنَا وَهُمْ لَا يَسْمَعُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Do not be like those who say, 'We hear,' when they do not hear.",
        "TRANSLATION_1": "And do not be like those who say: \"We have heard,\" but do not hear.\n",
        "TRANSLATION_2": "And do not be like those who say: 'We hear', though they do not hearken.\n",
        "TRANSLATION_3": "Do not be like those who said that they have heard (the Messenger's commands) but do not pay any attention to them.\n",
        "TRANSLATION_4": "And do not be like those who said, “We have heard”, whereas they do not hear.\n",
        "TRANSLATION_5": "And be not like those who say: \"We have heard,\" but they hear not.\n",
        "TRANSLATION_6": "And be not like those who said, We hear, and they did not obey.\n",
        "TRANSLATION_7": "and be not as those who say, 'We hear,' and they hear not.\n",
        "TRANSLATION_8": "Be not as those who say, we hear, and they hear not.\n",
        "TRANSLATION_9": "Do not be like those who say, \"We hear,\" but pay no heed to what they hear --\n",
        "TRANSLATION_10": "And be not like unto those who say: we hear, whereas they hearken not.\n",
        "TRANSLATION_11": "Do not be like those who say, ‘We hear,’ though they do not hear.\n",
        "TRANSLATION_12": "Nor be like those who say, \"We hear,\" but listen not:\n",
        "TRANSLATION_13": "And be not like those who say: \"We have heard,\" but they hear not.\n",
        "TRANSLATION_14": "Do not be like those who say: 'We hear' but they do not listen.\n",
        "TRANSLATION_15": "And be not like those who say, “We hear,” when they do not hear.\n",
        "TRANSLATION_16": "And do not be like those who say, \"We have heard,\" while they do not hear.\n",
        "TRANSLATION_17": "[8:21] And do not be as those who say, ‘We hear,’ and they hear not, in such a way as to reflect and heed admonition — these are either the hypocrites or the idolaters.\n",
        "TRANSLATION_18": "(Be not) in transgression; it is also said that this means: be not in obedience, (as those who say, We hear) we obey, the reference here being to the Banu 'Abd al-Dar, al-Nadr Ibn al-Harith and his host, (and they hear not) they obey not.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "8:21",
            "34:25",
            "41:18",
            "27:53",
            "21:23",
            "69:39",
            "53:60",
            "68:18",
            "10:63",
            "77:36"
        ],
        "BIBLE": [
            "prophets:ii%20kings:4:28",
            "writings:i%20chronicles:17:2",
            "torah:genesis:50:16",
            "torah:genesis:37:6",
            "torah:numbers:9:8",
            "torah:genesis:41:15",
            "torah:deuteronomy:3:26",
            "prophets:i%20kings:20:8",
            "torah:exodus:11:9",
            "torah:exodus:4:1"
        ]
    }
}