{
    "VERSE": "8:22",
    "ARABIC": "إِنَّ شَرَّ ٱلدَّوَآبِّ عِندَ ٱللَّهِ ٱلصُّمُّ ٱلْبُكْمُ ٱلَّذِينَ لَا يَعْقِلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "The worst of beasts in Allah's sight are the deaf and dumb who have no intellect.",
        "TRANSLATION_1": "The worst of creatures in the eyes of God are those who are deaf and dumb and devoid of sense.\n",
        "TRANSLATION_2": "Indeed the worst kind of all beasts in the sight of Allah are the people that are deaf and dumb, and do not understand.\n",
        "TRANSLATION_3": "The most wicked beasts in the sight of God are the deaf and the dumb who have no understanding.\n",
        "TRANSLATION_4": "Indeed the worst beasts in the sight of Allah are those (people) who are deaf, dumb – who do not have any sense.\n",
        "TRANSLATION_5": "Verily, the worst of living creatures with Allah are the deaf and the dumb (the disbelievers), who understand not.\n",
        "TRANSLATION_6": "Surely the vilest of animals, in Allah's sight, are the deaf, the dumb, who do not understand.\n",
        "TRANSLATION_7": "Surely the worst of beasts in God's sight are those that are deaf and dumb and do not understand.\n",
        "TRANSLATION_8": "Lo! the worst of beasts in Allah's sight are the deaf, the dumb, who have no sense.\n",
        "TRANSLATION_9": "the worst creatures in God's eyes are those who are deaf and dumb, and who possess no understanding.\n",
        "TRANSLATION_10": "Verily the vilest of beasts with Allah are the deaf and dumb who understand not.\n",
        "TRANSLATION_11": "Indeed the worst of beasts in Allah’s sight are the deaf and dumb who do not exercise their reason.\n",
        "TRANSLATION_12": "For the worst of beasts in the sight of Allah are the deaf and the dumb,- those who understand not.\n",
        "TRANSLATION_13": "Verily! The worst of (moving) living creatures with Allah are the deaf and the dumb, those who understand not (i.e. the disbelievers).\n",
        "TRANSLATION_14": "The worst beasts before Allah are those who are deaf, dumb, and do not understand.\n",
        "TRANSLATION_15": "The worst of animals to God are the deaf and dumb—those who do not reason.\n",
        "TRANSLATION_16": "Indeed, the worst of living creatures in the sight of Allah are the deaf and dumb who do not use reason.\n",
        "TRANSLATION_17": "[8:22] Surely the worst of beasts in God’s sight are those who are deaf, to hearing the truth, and dumb, [unable] to utter it, those who do not understand.\n",
        "TRANSLATION_18": "It was also revealed about these: (Lo! the worst of beasts) created beings and creatures (in Allah's sight are the deaf) to the Truth, (the dumb) about the Truth, (who have no sense) who do not understand Allah's command and His divine Oneness.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "8:22",
            "8:55",
            "13:39",
            "10:69",
            "61:3",
            "67:26",
            "3:163",
            "2:62",
            "6:39",
            "23:117"
        ],
        "BIBLE": [
            "prophets:jeremiah:5:21",
            "torah:deuteronomy:4:6",
            "prophets:isaiah:5:21",
            "prophets:jeremiah:4:22",
            "torah:numbers:11:11",
            "writings:proverbs:28:11",
            "prophets:isaiah:43:8",
            "torah:exodus:33:16",
            "writings:job:13:3",
            "writings:esther:8:5"
        ]
    }
}