{
    "VERSE": "8:24",
    "ARABIC": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ ٱسْتَجِيبُوا۟ لِلَّهِ وَلِلرَّسُولِ إِذَا دَعَاكُمْ لِمَا يُحْيِيكُمْ وَٱعْلَمُوٓا۟ أَنَّ ٱللَّهَ يَحُولُ بَيْنَ ٱلْمَرْءِ وَقَلْبِهِۦ وَأَنَّهُۥٓ إِلَيْهِ تُحْشَرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "You who have iman! respond to Allah and to the Messenger when He calls you to what will bring you to life! Know that Allah intervenes between a man and his heart and that you will be gathered to Him.",
        "TRANSLATION_1": "O believers, respond to the call of God and His Prophet when he calls you to what will give you life (and preservation). Remember that God intervenes between man and his heart, and that you will be gathered before Him.\n",
        "TRANSLATION_2": "Believers! Respond to Allah, and respond to the Messenger when he calls you to that which gives you life. Know well that Allah stands between a man and his heart, and it is to Him that all of you shall be mustered.\n",
        "TRANSLATION_3": "Believers, listen to God and the Messengers when they call you to that which gives you life. Know that God is between a man and his heart and that before Him you will all be brought together.\n",
        "TRANSLATION_4": "O People who Believe! Present yourselves upon the command of Allah and His Noble Messenger, when the Noble Messenger calls you towards the matter that will bestow you life; and know that the command of Allah becomes a barrier between a man and his heart’s intentions, and that you will all be raised towards Him.\n",
        "TRANSLATION_5": "O you who believe! Answer Allah and (His) Messenger when he (the Messenger) calls you to that which will give you life, and know that Allah comes between a person and his heart. And verily to Him you shall (all) be gathered.\n",
        "TRANSLATION_6": "O you who believe! answer (the call of) Allah and His Apostle when he calls you to that which gives you life; and know that Allah intervenes between man and his heart, and that to Him you shall be gathered.\n",
        "TRANSLATION_7": "O believers, respond to God and the Messenger when He calls you unto that which will give you life; and know that God stands between a man and his heart, and that to Him you shall be mustered.\n",
        "TRANSLATION_8": "O ye who believe! Obey Allah, and the messenger when He calleth you to that which quickeneth you, and know that Allah cometh in between the man and his own heart, and that He it is unto Whom ye will be gathered.\n",
        "TRANSLATION_9": "Believers, obey God and the Messenger when he calls you to that which gives you life. Know that God stands between man and his heart, and you shall all be gathered in His presence.\n",
        "TRANSLATION_10": "O Ye who believe! answer Allah and the apostle when he calleth you to that which quickeneth you, and know that verily Allah interposeth between a man and his heart, and that verily unto Him ye all shall be gathered.\n",
        "TRANSLATION_11": "O you who have faith! Answer Allah and the Apostle when he summons you to that which will give you life. Know that Allah intervenes between a man and his heart and that toward Him you will be mustered.\n",
        "TRANSLATION_12": "O ye who believe! give your response to Allah and His Messenger, when He calleth you to that which will give you life; and know that Allah cometh in between a man and his heart, and that it is He to Whom ye shall (all) be gathered.\n",
        "TRANSLATION_13": "O you who believe! Answer Allah (by obeying Him) and (His) Messenger when he (SAW) calls you to that which will give you life, and know that Allah comes in between a person and his heart (i.e. He prevents an evil person to decide anything). And verily to Him you shall (all) be gathered.\n",
        "TRANSLATION_14": "Believers, respond to Allah and the Messenger when he calls you to that which revives you. Know that Allah is between the person and his heart, and that toHim you shall all be gathered.\n",
        "TRANSLATION_15": "O you who believe! Respond to God and to the Messenger when He calls you to what will revive you. And know that God stands between a man and his heart, and that to Him you will be gathered.\n",
        "TRANSLATION_16": "O you who have believed, respond to Allah and to the Messenger when he calls you to that which gives you life. And know that Allah intervenes between a man and his heart and that to Him you will be gathered.\n",
        "TRANSLATION_17": "[8:24] O you who believe, respond to God and the Messenger, with obedience, when He calls you to that which will give you life, in the matter of religion, for it will be the source of everlasting life [for you]; and know that God comes in between a man and his heart, so that he cannot believe or disbelieve except by His will; and that it is to Him that you shall be gathered, and He will requite you for your deeds.\n",
        "TRANSLATION_18": "(0 ye who believe) i.e. the Companions of Muhammad (pbuh); (Obey Allah, and the messenger when He calleth you to that which quickeneth you) to that which honours you, makes you triumphant and reforms you, such as when you are called to fighting, etc., (and know) believers (that Allah cometh in between) protects (the man and his own heart) He protects the believer and his heart, such that He preserves the heart of the believer by making it firm on faith so that it does not reject faith; and he preserves the heart of the disbeliever by making it firm on disbelief so that it does not accept faith, (and that He it is unto Whom) unto Allah in the Hereafter (ye will be gathered) and thus rewarded you for your works.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "8:24",
            "24:51",
            "24:48",
            "4:61",
            "9:1",
            "33:12",
            "61:5",
            "49:1",
            "8:1",
            "8:20"
        ],
        "BIBLE": [
            "writings:daniel:2:23",
            "torah:exodus:32:1",
            "prophets:jeremiah:35:15",
            "prophets:ii%20samuel:18:28",
            "torah:genesis:19:5",
            "prophets:judges:16:18",
            "writings:daniel:7:4",
            "writings:esther:4:11",
            "prophets:ii%20samuel:9:9",
            "writings:ecclesiastes:1:13"
        ]
    }
}