{
    "VERSE": "8:25",
    "ARABIC": "وَٱتَّقُوا۟ فِتْنَةً لَّا تُصِيبَنَّ ٱلَّذِينَ ظَلَمُوا۟ مِنكُمْ خَآصَّةً وَٱعْلَمُوٓا۟ أَنَّ ٱللَّهَ شَدِيدُ ٱلْعِقَابِ",
    "ENGLISH": {
        "TRANSLATION_0": "Be fearful of trials which will not afflict solely those among you who do wrong. Know that Allah is severe in retribution.",
        "TRANSLATION_1": "Beware of sedition, which does not affect the oppressors alone among you, and know that the punishment of God is severe.\n",
        "TRANSLATION_2": "And guard against the mischief that will not only bring punishment to the wrong-doers among you. Know well that Allah is severe in punishment.\n",
        "TRANSLATION_3": "Guard yourselves against discord among yourselves so that it will not mislead anyone of you, especially the unjust, and know that God's retribution is most severe.\n",
        "TRANSLATION_4": "And fear the turmoil which will certainly not fall only upon a few selected unjust people among you; and know that Allah’s punishment is severe.\n",
        "TRANSLATION_5": "And fear the Fitnah (affliction and trial) which affects not in particular (only) those of you who do wrong, and know that Allah is severe in punishment.\n",
        "TRANSLATION_6": "And fear an affliction which may not smite those of you in particular who are unjust; and know that Allah is severe in requiting (evil).\n",
        "TRANSLATION_7": "And fear a trial which shall surely not smite in particular the evildoers among you; and know that God is terrible in retribution.\n",
        "TRANSLATION_8": "And guard yourselves against a chastisement which cannot fall exclusively on those of you who are wrong-doers, and know that Allah is severe in punishment.\n",
        "TRANSLATION_9": "And beware of an affliction that will not smite exclusively those among you who have done wrong. Know that God is severe in exacting retribution.\n",
        "TRANSLATION_10": "And fear the trial that shall not afflict those alone who among you do Wrong; and know that verily Allah severe in chastising.\n",
        "TRANSLATION_11": "And beware of a punishment, which shall not visit the wrongdoers among you exclusively, and know that Allah is severe in retribution.\n",
        "TRANSLATION_12": "And fear tumult or oppression, which affecteth not in particular (only) those of you who do wrong: and know that Allah is strict in punishment.\n",
        "TRANSLATION_13": "And fear the Fitnah (affliction and trial, etc.) which affects not in particular (only) those of you who do wrong (but it may afflict all the good and the bad people), and know that Allah is Severe in punishment.\n",
        "TRANSLATION_14": "And be cautious against a sedition that will not smite the harmdoers alone. Know that the punishment of Allah is Stern.\n",
        "TRANSLATION_15": "And beware of discord which does not afflict the wrongdoers among you exclusively; and know that God is severe in retribution.\n",
        "TRANSLATION_16": "And fear a trial which will not strike those who have wronged among you exclusively, and know that Allah is severe in penalty.\n",
        "TRANSLATION_17": "[8:25] And be afraid of a trial which, if it were to fall upon you, would certainly not fall exclusively upon the evildoers among you, but would encompass them and others, and the way to guard against it is to repudiate that evil which necessarily results in [precipitating] it; and know that God is severe in retribution, against those who oppose Him.\n",
        "TRANSLATION_18": "185 (And guard yourselves against a sedition) any sedition that happens (which cannot fall exclusively on those of you who are wrong-doers) but rather befalls on both the wrong-doers and the wronged, (and know that Allah is severe in punishment) when He punishes.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "8:25",
            "5:98",
            "59:4",
            "8:13",
            "29:11",
            "29:3",
            "3:11",
            "8:52",
            "10:95",
            "16:56"
        ],
        "BIBLE": [
            "prophets:ezekiel:13:14",
            "prophets:jeremiah:6:15",
            "prophets:jeremiah:8:12",
            "torah:exodus:3:7",
            "prophets:jeremiah:39:9",
            "prophets:ezekiel:33:27",
            "torah:numbers:14:3",
            "prophets:ezekiel:7:9",
            "prophets:jeremiah:4:22",
            "prophets:jeremiah:46:16"
        ]
    }
}