{
    "VERSE": "8:36",
    "ARABIC": "إِنَّ ٱلَّذِينَ كَفَرُوا۟ يُنفِقُونَ أَمْوَٰلَهُمْ لِيَصُدُّوا۟ عَن سَبِيلِ ٱللَّهِ فَسَيُنفِقُونَهَا ثُمَّ تَكُونُ عَلَيْهِمْ حَسْرَةً ثُمَّ يُغْلَبُونَ وَٱلَّذِينَ كَفَرُوٓا۟ إِلَىٰ جَهَنَّمَ يُحْشَرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Those who are kafir spend their wealth barring access to the Way of Allah. They will spend it; then they will regret it; then they will be overthrown. Those who are kafir will be gathered into Hell,",
        "TRANSLATION_1": "Those who disbelieve spend their possessions on turning men away from God. They will go on spending and rue it in the end, and will be subdued. But those who remain disbelievers shall be gathered into Hell\n",
        "TRANSLATION_2": "Surely those who deny the truth spend their wealth to hinder people from the way of Allah, and will continue to so spend until their efforts become a source of intense regret for them, and then they will be vanquished, and then these deniers of the truth will be driven to Hell,\n",
        "TRANSLATION_3": "The disbelievers spend their wealth to turn men away from the way of God. They will continue to spend but it will become a source of regret for them and they will be defeated (because of their evil plans). The disbelievers will be gathered all togdher in Hell.\n",
        "TRANSLATION_4": "Indeed the disbelievers spend their wealth in order to prevent people from the way of Allah; so they will spend it now, and then regret over it, then they will be defeated; and the disbelievers will be gathered towards hell.\n",
        "TRANSLATION_5": "Verily, those who disbelieve spend their wealth to hinder (men) from the path of Allah, and so will they continue to spend it; but in the end it will become an anguish for them. Then they will be overcome. And those who disbelieve will be gathered unto Hell.\n",
        "TRANSLATION_6": "Surely those who disbelieve spend their wealth to hinder (people) from the way of Allah; so they shall spend it, then it shall be to them an intense regret, then they shall be overcome; and those who disbelieve shall be driven together to hell.\n",
        "TRANSLATION_7": "The unbelievers expend their wealth to bar from God's way, and still they will expend it, till it is an anguish for them, then be overthrown, and the unbelievers will be mustered into Gehenna,\n",
        "TRANSLATION_8": "Lo! those who disbelieve spend their wealth in order that they may debar (men) from the way of Allah. They will spend it, then it will become an anguish for them, then they will be conquered. And those who disbelieve will be gathered unto hell,\n",
        "TRANSLATION_9": "Those who are bent on denying the truth are spending their wealth in debarring others from the path of God. They will continue to spend it in this way till, in the end, this spending will become a source of intense regret for them, and then they will be overcome. And those who denied the truth will be gathered together in Hell.\n",
        "TRANSLATION_10": "Verily those who disbelieve are expending their riches in order to hinder People from the way of Allah; so they will go on expending them; thereafter they shall become an anguish unto them; then they shall be overcome. And those who disbelieve shall be gathered for Hell.\n",
        "TRANSLATION_11": "Indeed the faithless spend their wealth to bar from the way of Allah. Soon they will have spent it, then it will be a cause of regret to them, then they will be overcome, and the faithless will be gathered toward Hell,\n",
        "TRANSLATION_12": "The Unbelievers spend their wealth to hinder (man) from the path of Allah, and so will they continue to spend; but in the end they will have (only) regrets and sighs; at length they will be overcome: and the Unbelievers will be gathered together to Hell;-\n",
        "TRANSLATION_13": "Verily, those who disbelieve spend their wealth to hinder (men) from the Path of Allah, and so will they continue to spend it; but in the end it will become an anguish for them. Then they will be overcomed. And those who disbelieve will be gathered unto Hell.\n",
        "TRANSLATION_14": "Those who disbelieve spend their wealth to bar (others) from the Path of Allah. They will spend it; but it will become a regret for them, then they will be overcome. The unbelievers shall be gathered in Gehenna,\n",
        "TRANSLATION_15": "Those who disbelieve spend their wealth to repel from God’s path. They will spend it, then it will become a source of sorrow for them, and then they will be defeated. Those who disbelieve will be herded into Hell.\n",
        "TRANSLATION_16": "Indeed, those who disbelieve spend their wealth to avert [people] from the way of Allah. So they will spend it; then it will be for them a [source of] regret; then they will be overcome. And those who have disbelieved - unto Hell they will be gathered.\n",
        "TRANSLATION_17": "[8:36] The disbelievers expend their wealth, in waging war against the Prophet (s), in order to bar from God’s way, and they will expend it until, in the end, it will be a source of anguish for them, a regret, for having lost it and lost what they had intended [by expending it]; then they will be defeated, in this world, and the disbelievers, among them, will be gathered, driven, into Hell, in the Hereafter,\n",
        "TRANSLATION_18": "(Lo! those who disbelieve) the disbelievers who fed the army of the Quraysh on the Day of Badr: Abu Jahl and his host which consisted of 13 men (spend their wealth in order that they may debar (men) from the way of Allah) from religion and obedience of Allah. (They will spend it) on the life of this world, (then it will become an anguish for them) a regret for them in the Hereafter, (then they will be conquered) they will be defeated and killed on the Day of Badr. (And those who disbelieve) Abu Jahl and his host (will be gathered unto hell) in the Hereafter,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "8:36",
            "47:34",
            "4:137",
            "47:1",
            "49:15",
            "2:218",
            "14:30",
            "6:36",
            "7:45",
            "3:116"
        ],
        "BIBLE": [
            "torah:genesis:3:24",
            "prophets:jeremiah:26:3",
            "prophets:jeremiah:29:14",
            "torah:deuteronomy:31:29",
            "prophets:jonah:3:8",
            "prophets:isaiah:5:25",
            "writings:ezra:10:1",
            "prophets:jeremiah:23:22",
            "writings:daniel:9:13",
            "torah:deuteronomy:11:28"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:3:6",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:5:2"
        ]
    }
}