{
    "VERSE": "8:4",
    "ARABIC": "أُو۟لَٰٓئِكَ هُمُ ٱلْمُؤْمِنُونَ حَقًّا لَّهُمْ دَرَجَٰتٌ عِندَ رَبِّهِمْ وَمَغْفِرَةٌ وَرِزْقٌ كَرِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "They are in truth the muminun. They have high ranks with their Lord and forgiveness and generous provision.",
        "TRANSLATION_1": "Are true believers. There are for them (high) ranks with their Lord, and pardon and noble provision.\n",
        "TRANSLATION_2": "Such people are indeed true believers. They have high ranks with their Lord, and forgiveness for their sins and an honourable sustenance.\n",
        "TRANSLATION_3": "Such are the true believers. Their reward from their Lord will be high ranks, forgiveness, and a generous provision.\n",
        "TRANSLATION_4": "These are the true Muslims; for them are ranks before their Lord, and forgiveness and an honourable sustenance.\n",
        "TRANSLATION_5": "It is they who are the believers in truth. For them are grades of dignity with their Lord, and forgiveness and a generous provision (Paradise).\n",
        "TRANSLATION_6": "These are the believers in truth; they shall have from their Lord exalted grades and forgiveness and an honorable sustenance.\n",
        "TRANSLATION_7": "those in truth are the believers; they have degrees with their Lord, and forgiveness, and generous provision.\n",
        "TRANSLATION_8": "Those are they who are in truth believers. For them are grades (of honour) with their Lord, and pardon, and a bountiful provision.\n",
        "TRANSLATION_9": "Such are the true believers. They have a high standing with their Lord, His forgiveness and an honourable provision made for them.\n",
        "TRANSLATION_10": "Those: it is they who are the true believers. For them are degrees with their Lord and forgiveness and a provision honourable.\n",
        "TRANSLATION_11": "It is they who are truly the faithful. They shall have ranks near their Lord, forgiveness and a noble provision.\n",
        "TRANSLATION_12": "Such in truth are the believers: they have grades of dignity with their Lord, and forgiveness, and generous sustenance:\n",
        "TRANSLATION_13": "It is they who are the believers in truth. For them are grades of dignity with their Lord, and Forgiveness and a generous provision (Paradise).\n",
        "TRANSLATION_14": "those are, in truth, the believers. They shall have degrees with their Lord and forgiveness, and a generous provision.\n",
        "TRANSLATION_15": "These are the true believers. They have high standing with their Lord, and forgiveness, and a generous provision.\n",
        "TRANSLATION_16": "Those are the believers, truly. For them are degrees [of high position] with their Lord and forgiveness and noble provision.\n",
        "TRANSLATION_17": "[8:4] Those, described in the way mentioned, are the true, the real, believers, without doubt. For them are ranks, stations in Paradise, with their Lord, and forgiveness, and generous provision, in Paradise.\n",
        "TRANSLATION_18": "(Those are they who are in truth believers) they are truly and certainly believers. (For them are grades (of honour)) ranks of merit (with their Lord) in the Hereafter, (and pardon) for the sins they committed in the life of this world, (and a bountiful provision) a fair reward in Paradise.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "8:4",
            "34:4",
            "22:50",
            "8:74",
            "24:26",
            "51:34",
            "39:34",
            "68:34",
            "52:37",
            "34:23"
        ],
        "BIBLE": [
            "prophets:isaiah:12:4",
            "prophets:jeremiah:44:29",
            "prophets:i%20kings:16:2",
            "prophets:isaiah:25:1",
            "prophets:i%20kings:14:7",
            "prophets:isaiah:30:18",
            "writings:ezra:10:13",
            "torah:numbers:14:19",
            "prophets:joshua:24:19",
            "prophets:jeremiah:14:10"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:6:4"
        ]
    }
}