{
    "VERSE": "8:40",
    "ARABIC": "وَإِن تَوَلَّوْا۟ فَٱعْلَمُوٓا۟ أَنَّ ٱللَّهَ مَوْلَىٰكُمْ نِعْمَ ٱلْمَوْلَىٰ وَنِعْمَ ٱلنَّصِيرُ",
    "ENGLISH": {
        "TRANSLATION_0": "but if they turn away, know that Allah is your Master, the Best of Masters, and the Best of Helpers!",
        "TRANSLATION_1": "But if they are obstinate, know that God is your helper and protector: How excellent a helper, and how excellent a protector is He!\n",
        "TRANSLATION_2": "But if they turn away, then know well that Allah is your Protector - an excellent Protector and an excellent Helper.\n",
        "TRANSLATION_3": "If the (unbelievers) turn away from the faith, God is you (believers) best Guardian and best Helper.\n",
        "TRANSLATION_4": "And if they turn away, then know that Allah is your Master; so what an Excellent Master and what an Excellent Supporter!\n",
        "TRANSLATION_5": "And if they turn away, then know that Allah is your protector -- (what) an excellent protector and (what) an excellent helper!\n",
        "TRANSLATION_6": "And if they turn back, then know that Allah is your Patron; most excellent is the Patron and most excellent the Helper.\n",
        "TRANSLATION_7": "but if they turn away, know that God is your Protector -- an excellent Protector, an excellent Helper!\n",
        "TRANSLATION_8": "And if they turn away, then know that Allah is your Befriender - a Transcendent Patron, a Transcendent Helper!\n",
        "TRANSLATION_9": "but if they turn away, know that God is your Protector; the Best of Protectors and the Best of Helpers!\n",
        "TRANSLATION_10": "And if they turn away, then know that Allah is your Patron: excellent Patron! and excellent helper!\n",
        "TRANSLATION_11": "But if they turn away, then know that Allah is your master: an excellent master and an excellent helper!\n",
        "TRANSLATION_12": "If they refuse, be sure that Allah is your Protector - the best to protect and the best to help.\n",
        "TRANSLATION_13": "And if they turn away, then know that Allah is your Maula (Patron, Lord, Protector and Supporter, etc.), (what) an Excellent Maula, and (what) an Excellent Helper!\n",
        "TRANSLATION_14": "but if they turn away, know that Allah is your guardian, (He is) the best Guardian and the best Giver of victory.\n",
        "TRANSLATION_15": "And if they turn away, know that God is your Protector. The Best Protector, and the Best Supporter.\n",
        "TRANSLATION_16": "But if they turn away - then know that Allah is your protector. Excellent is the protector, and Excellent is the helper.\n",
        "TRANSLATION_17": "[8:40] But if they turn away, from belief, know that God is your Protector, your Helper and the One Who takes charge of your affairs — an excellent Protector, is He, and an excellent Helper!, [He is] for you.\n",
        "TRANSLATION_18": "(And if they turn away) from faith, (then know) believers, (that Allah is your Befriender) your Protector and Helper against them, (a transcendent Patron) Who protects and gives victory, (a transcendent Helper!) 187 Who defends you.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "8:40",
            "47:11",
            "8:62",
            "4:45",
            "3:32",
            "5:51",
            "7:178",
            "4:89",
            "42:31",
            "4:52"
        ],
        "BIBLE": [
            "writings:psalms:56:10",
            "prophets:isaiah:43:10",
            "writings:job:9:2",
            "prophets:ezekiel:34:30",
            "prophets:isaiah:50:7",
            "prophets:jeremiah:9:5",
            "prophets:i%20kings:8:60",
            "prophets:joshua:22:22",
            "writings:psalms:135:5",
            "writings:ii%20chronicles:30:8"
        ]
    }
}