{
    "VERSE": "8:45",
    "ARABIC": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓا۟ إِذَا لَقِيتُمْ فِئَةً فَٱثْبُتُوا۟ وَٱذْكُرُوا۟ ٱللَّهَ كَثِيرًا لَّعَلَّكُمْ تُفْلِحُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "You who have iman! when you meet a troop, stand firm and remember Allah repeatedly so that hopefully you will be successful.",
        "TRANSLATION_1": "O believers, when you meet an army, stand firm, and think of God a great deal that you may be blessed with success.\n",
        "TRANSLATION_2": "Believers! When you encounter a host in battle, stand firm and remember Allah much that you may triumph.\n",
        "TRANSLATION_3": "Believers, stand firm when you meet a band of your enemy and remember God often so that you may have everlasting happiness.\n",
        "TRANSLATION_4": "O People who Believe! When you meet an army, hold firm and remember Allah profusely, in order that you succeed.\n",
        "TRANSLATION_5": "O you who believe! When you meet (an enemy) force, take a firm stand against them and remember Allah much, so that you may be successful.\n",
        "TRANSLATION_6": "O you who believe! when you meet a party, then be firm, and remember Allah much, that you may be successful.\n",
        "TRANSLATION_7": "O believers, whensoever you encounter a host, then stand firm, and remember God frequently; haply so you will prosper.\n",
        "TRANSLATION_8": "O ye who believe! When ye meet an army, hold firm and think of Allah much, that ye may be successful.\n",
        "TRANSLATION_9": "Believers! When you encounter a party, remain firm and remember God much, so that you may succeed.\n",
        "TRANSLATION_10": "O Ye who believe! when ye meet a party, stand firm and remember Allah much, that haply ye may fare well.\n",
        "TRANSLATION_11": "O you who have faith! When you meet a host [in battle], then stand firm, and remember Allah greatly so that you may be felicitous.\n",
        "TRANSLATION_12": "O ye who believe! When ye meet a force, be firm, and call Allah in remembrance much (and often); that ye may prosper:\n",
        "TRANSLATION_13": "O you who believe! When you meet (an enemy) force, take a firm stand against them and remember the Name of Allah much (both with tongue and mind), so that you may be successful.\n",
        "TRANSLATION_14": "Believers, when you meet an army stand firm and remember Allah abundantly, in order that you are prosperous.\n",
        "TRANSLATION_15": "O you who believe! When you meet a force, stand firm, and remember God much, so that you may prevail.\n",
        "TRANSLATION_16": "O you who have believed, when you encounter a company [from the enemy forces], stand firm and remember Allah much that you may be successful.\n",
        "TRANSLATION_17": "[8:45] O you who believe, when you meet a host, a group of disbelievers, then stand firm, to fight them and do not [flee in] retreat, and remember God much, call upon Him for victory, that you may succeed, [that you may] triumph.\n",
        "TRANSLATION_18": "(0 ye who believe!) He means the Companions of Muhammad (pbuh) (When you meet an army) a group of the disbelievers on the Day of Badr, (hold firm) along with your prophet in war (and think of Allah much) in your hearts and with your tongues, saying: \"there is no deity except Allah\", and \"Allah is the greatest\", (that ye may be successful) that you may be safe from Allah's wrath and punishment and be assisted.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "8:45",
            "33:41",
            "3:200",
            "9:119",
            "62:10",
            "33:70",
            "3:130",
            "16:128",
            "2:156",
            "47:7"
        ],
        "BIBLE": [
            "torah:numbers:10:9",
            "writings:psalms:25:2",
            "prophets:joshua:7:13",
            "prophets:isaiah:28:22",
            "writings:nehemiah:5:19",
            "prophets:zechariah:13:2",
            "writings:nehemiah:9:5",
            "prophets:jeremiah:29:8",
            "prophets:ezekiel:36:23",
            "prophets:zechariah:8:23"
        ]
    }
}