{
    "VERSE": "8:48",
    "ARABIC": "وَإِذْ زَيَّنَ لَهُمُ ٱلشَّيْطَٰنُ أَعْمَٰلَهُمْ وَقَالَ لَا غَالِبَ لَكُمُ ٱلْيَوْمَ مِنَ ٱلنَّاسِ وَإِنِّى جَارٌ لَّكُمْ فَلَمَّا تَرَآءَتِ ٱلْفِئَتَانِ نَكَصَ عَلَىٰ عَقِبَيْهِ وَقَالَ إِنِّى بَرِىٓءٌ مِّنكُمْ إِنِّىٓ أَرَىٰ مَا لَا تَرَوْنَ إِنِّىٓ أَخَافُ ٱللَّهَ وَٱللَّهُ شَدِيدُ ٱلْعِقَابِ",
    "ENGLISH": {
        "TRANSLATION_0": "when Shaytan made their actions appear good to them, saying, 'No one will overcome you today for I am at your side.' But when the two parties came in sight of one another, he turned right round on his heels saying, 'I wash my hands of you. I see what you do not see. I fear Allah. Allah is severe in retribution.'",
        "TRANSLATION_1": "Satan made their deeds look alluring to them, and said: \"None will prevail over you this day, for I shall be near at hand.\" Yet when the two armies appeared face to face, he turned back and fled, saying: \"I am not with you, for I can see what you cannot perceive. I fear God, for His punishment is severe.\"\n",
        "TRANSLATION_2": "And recall when Satan made their works seem fair to them and said: 'None shall overcome you today. and I am your supporter.' But when the two armies faced each other, he turned on his heels, and said: 'Surely I am quit of you for I behold that which you do not. Indeed I fear Allah, and Allah is stern in punishment.'\n",
        "TRANSLATION_3": "Satan made their (pagans') deeds seem attractive to them and said to them, \"No one today is more powerful than you and I am your supporter.\" But when the two armies confronted one another and the pagans were defeated, then satan betrayed his friends saying, \"I am not with you any more; I see what you do not see and I am afraid of God.\" God is severe in His retribution.\n",
        "TRANSLATION_4": "And when Satan made their deeds seem good in their sight and said, “This day no one can overpower you, and you are under my protection”; so when the two armies came face to face, he scrambled back and said, “I am unconcerned with you – I can see what is not visible to you – I fear Allah”; and Allah’s punishment is severe.\n",
        "TRANSLATION_5": "And (remember) when Shaytan made their (evil) deeds seem fair to them and said, \"No one of mankind can overcome you this day (of the battle of Badr) and verily, I am your neighbor (for each and every help).\" But when the two forces came in sight of each other, he ran away and said \"Verily, I have nothing to do with you. Verily, I see what you see not. Verily, I fear Allah for Allah is severe in punishment.\"\n",
        "TRANSLATION_6": "And when the Shaitan made their works fair seeming to them, and said: No one can overcome you this day, and surely I am your protector: but when the two parties came in sight of each other he turned upon his heels, and said: Surely I am clear of you, surely I see what you do not see, surely I fear Allah; and Allah is severe in requiting (evil).\n",
        "TRANSLATION_7": "And when Satan decked out their deeds fair to them, and said, 'Today no man shall overcome you, for I shall be your neighbour.' But when the two hosts sighted each other, he withdrew upon his heels, saying, 'I am quit of you; for I see what you do not see. I fear God; and God is terrible in retribution.'\n",
        "TRANSLATION_8": "And when Satan made their deeds seem fair to them and said: No-one of mankind can conquer you this day, for I am your protector. But when the armies came in sight of one another, he took flight, saying: Lo! I am guiltless of you. Lo! I see that which ye see not. Lo! I fear Allah. And Allah is severe in punishment.\n",
        "TRANSLATION_9": "Satan made their deeds seem fair to them and said, \"None of the people shall prevail against you this day; I shall be your protector!\" But when the two forces came in sight of each other, he turned on his heels, saying, \"This is where I leave you: I see what you do not, and I fear God -- God is severe in His punishment.\"\n",
        "TRANSLATION_10": "And recall what time the Satan made their works fair- seeming unto them and said: there is none of mankind to overcome you to- day, and verily I am your neighbour. Then when the two parties faced each other, he turned on his heels, and said: verily I am quit of you, verily I behold that which ye behold not; verily I fear Allah: and Allah severe in retribution.\n",
        "TRANSLATION_11": "When Satan made their deeds seem decorous to them, and said [to the faithless], ‘No one shall overcome you today from among all mankind, and I will stand by you.’ But when the two hosts sighted each other, he took to his heels, saying, ‘Indeed I am quit of you. I see what you do not see. Indeed I fear Allah, and Allah is severe in retribution.’\n",
        "TRANSLATION_12": "Remember Satan made their (sinful) acts seem alluring to them, and said: \"No one among men can overcome you this day, while I am near to you\": But when the two forces came in sight of each other, he turned on his heels, and said: \"Lo! I am clear of you; lo! I see what ye see not; Lo! I fear Allah: for Allah is strict in punishment.\"\n",
        "TRANSLATION_13": "And (remember) when Shaitan (Satan) made their (evil) deeds seem fair to them and said, \"No one of mankind can overcome you this Day (of the battle of Badr) and verily, I am your neighbour (for each and every help).\" But when the two forces came in sight of each other, he ran away and said \"Verily, I have nothing to do with you. Verily! I see what you see not. Verily! I fear Allah for Allah is Severe in punishment.\"\n",
        "TRANSLATION_14": "And when satan made their foul deeds seem fair to them. He said: 'No one shall conquer you this day. I shall be your savior' But when the two armies came within sight of each other, he took to his heels, saying: 'I reject you, for I can see what you cannot. I fear Allah, Allah is Stern in retribution'\n",
        "TRANSLATION_15": "Satan made their deeds appear good to them, and said, “You cannot be defeated by any people today, and I am at your side.” But when the two armies came in sight of one another, he turned on his heels, and said, “I am innocent of you; I see what you do not see; I fear God; God is severe in punishment.”\n",
        "TRANSLATION_16": "And [remember] when Satan made their deeds pleasing to them and said, \"No one can overcome you today from among the people, and indeed, I am your protector.\" But when the two armies sighted each other, he turned on his heels and said, \"Indeed, I am disassociated from you. Indeed, I see what you do not see; indeed I fear Allah. And Allah is severe in penalty.\"\n",
        "TRANSLATION_17": "[8:48] And, mention, that Satan, Iblīs, adorned their deeds for them, by encouraging them [to go] to meet the Muslims, when they had feared to set out on account of their enemy, the Banū Bakr, and said, to them: ‘Today no person shall overcome you, for I shall be your protector’, from among the [Banū] Kināna — he appeared to them in the form of Surāqa b. Mālik, the chieftain of that region. But when the two armies, the Muslims and the disbelievers, sighted each other, [when] they met and he [Satan] saw the angels, his hand clasping that of al-Hārith b. Hishām, he turned his back, he withdrew, in flight, saying — when they had said to him, ‘Are you abandoning us in such a predicament?’, ‘I am quit of you, of being your protector, for I see what you do not see, in the way of angels. I fear God, lest He destroy me; and God is severe in retribution’.\n",
        "TRANSLATION_18": "(And when Satan made their deeds seem fair to them) and when Iblis made their marching against the Muslims seem fair to them (and said: No one of mankind can conquer you this day) he meant Muhammad (pbuh) and his Companions, (for I am your protector) I will help you. (But when the armies came in sight of one another) the army of the believers and the army of the disbelievers and Iblis saw Gabriel with the angels (he took flight) he retreated, (saying) to the disbelievers: (Lo! I am guiltless of you) and of your fighting. (Lo! I see that which ye see not) I see Gabriel while you do not see him. (Lo! I fear Allah. And Allah is severe in punishment) when He punishes; Iblis was scared of being captured by Gabriel and of being shown to the disbelievers, for then they would never obey him.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "8:48",
            "27:24",
            "4:38",
            "8:25",
            "4:108",
            "40:33",
            "6:121",
            "8:13",
            "59:4",
            "14:42"
        ],
        "BIBLE": [
            "prophets:judges:13:10",
            "prophets:isaiah:57:1",
            "prophets:i%20samuel:17:20",
            "torah:deuteronomy:31:29",
            "prophets:zechariah:8:23",
            "prophets:judges:20:42",
            "prophets:i%20samuel:9:24",
            "torah:genesis:20:3",
            "prophets:judges:6:27",
            "prophets:i%20samuel:29:6"
        ]
    }
}