{
    "VERSE": "8:50",
    "ARABIC": "وَلَوْ تَرَىٰٓ إِذْ يَتَوَفَّى ٱلَّذِينَ كَفَرُوا۟ ٱلْمَلَٰٓئِكَةُ يَضْرِبُونَ وُجُوهَهُمْ وَأَدْبَٰرَهُمْ وَذُوقُوا۟ عَذَابَ ٱلْحَرِيقِ",
    "ENGLISH": {
        "TRANSLATION_0": "If only you could see when the angels take back those who were kafir at their death, beating their faces and their backs: 'Taste the punishment of the Burning!",
        "TRANSLATION_1": "If you could only see the infidels as the angels draw away their souls and strike their faces and their backs, (saying): \"Taste the torment of burning\n",
        "TRANSLATION_2": "And if you could only see when the angels took away the souls of the unbelievers, striking them on their faces and backs, saying: 'Taste the torment of burning.\n",
        "TRANSLATION_3": "Would that you could have seen the angels taking the souls of the unbelievers away from their bodies and smiting their faces and their backs saying, \"Suffer the burning torment.\n",
        "TRANSLATION_4": "And if you see the angels when they are removing the souls of the disbelievers, hitting them on their faces and their backs; “Taste more of the punishment of the fire!” (Punishment in the grave is proven by this verse.)\n",
        "TRANSLATION_5": "And if you could see when the angels take away the souls of those who disbelieve (at death); they smite their faces and their backs, (saying): \"Taste the punishment of the blazing Fire. \"\n",
        "TRANSLATION_6": "And had you seen when the angels will cause to die those who disbelieve, smiting their faces and their backs, and (saying): Taste the punishment of burning.\n",
        "TRANSLATION_7": "If thou couldst only see when the angels take the unbelievers, beating their faces and their backs: 'Taste the chastisement of the burning --\n",
        "TRANSLATION_8": "If thou couldst see how the angels receive those who disbelieve, smiting faces and their backs and (saying): Taste the punishment of burning!\n",
        "TRANSLATION_9": "If you could see, when the angels take the souls of those who are bent on denying the truth [at death], how they strike their faces and backs: saying \"Taste the punishment of the Burning!\n",
        "TRANSLATION_10": "And couldst thou behold when the angels take away the life of those who disbelive striking their faces and their backs: taste the torment of burning.\n",
        "TRANSLATION_11": "Were you to see when the angels take away the faithless, striking their faces and their backs, [saying], ‘Taste the punishment of the burning.\n",
        "TRANSLATION_12": "If thou couldst see, when the angels take the souls of the Unbelievers (at death), (How) they smite their faces and their backs, (saying): \"Taste the penalty of the blazing Fire-\n",
        "TRANSLATION_13": "And if you could see when the angels take away the souls of those who disbelieve (at death), they smite their faces and their backs, (saying): \"Taste the punishment of the blazing Fire.\"\n",
        "TRANSLATION_14": "If you could see the angels when they carry off the souls of the unbelievers, beating their faces and their backs, saying: 'Taste the punishment of Burning!\n",
        "TRANSLATION_15": "If only you could see, as the angels take away those who disbelieve, striking their faces and their backs: “Taste the agony of the Burning.”\n",
        "TRANSLATION_16": "And if you could but see when the angels take the souls of those who disbelieved... They are striking their faces and their backs and [saying], \"Taste the punishment of the Burning Fire.\n",
        "TRANSLATION_17": "[8:50] And if you could only see, O Muhammad (s), when the angels take (read either as yatawaffā or tatawaffā) the disbelievers, beating (yadribūna is a circumstantial qualifier) their faces and their backs, with hooked iron rods, and, they say to them: ‘Taste the chastisement of burning, that is, the Fire (the response to the [clause beginning with] law, ‘if’, would be la-ra’ayta amran ‘azīman, ‘you would truly have seen an terrible sight’).\n",
        "TRANSLATION_18": "(If thou couldst see) Muhammad (how the angels) on the Day of Badr (receive those who disbelieve) how they take away their souls, (smiting their faces and their backs and (saying): Taste the punishment of burning!) the severe punishment of burning.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "8:50",
            "47:27",
            "3:106",
            "85:10",
            "22:22",
            "16:85",
            "54:45",
            "2:104",
            "28:64",
            "4:47"
        ],
        "BIBLE": [
            "torah:exodus:14:11",
            "prophets:i%20samuel:28:21",
            "writings:psalms:31:8",
            "writings:psalms:31:14",
            "torah:genesis:30:15",
            "prophets:judges:17:2",
            "torah:numbers:17:4",
            "prophets:judges:11:36",
            "prophets:judges:12:3",
            "prophets:ezekiel:33:15"
        ]
    }
}