{
    "VERSE": "8:53",
    "ARABIC": "ذَٰلِكَ بِأَنَّ ٱللَّهَ لَمْ يَكُ مُغَيِّرًا نِّعْمَةً أَنْعَمَهَا عَلَىٰ قَوْمٍ حَتَّىٰ يُغَيِّرُوا۟ مَا بِأَنفُسِهِمْ وَأَنَّ ٱللَّهَ سَمِيعٌ عَلِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "That is because Allah would never change a blessing He has conferred on a people until they had changed what was in themselves. Allah is All-Hearing, All-Knowing.",
        "TRANSLATION_1": "God does not withdraw a favour bestowed upon a people unless they change themselves, for God hears all and knows everything.\n",
        "TRANSLATION_2": "This happened because Allah is not one to change the favour which He has bestowed upon a people until they have changed their attitude., Surely Allah is All-Hearing, All-Knowing.\n",
        "TRANSLATION_3": "God does not change the favor that He has bestowed on a nation unless that nation changes what is in its soul. God is All-hearing and All-knowing.\n",
        "TRANSLATION_4": "This is because Allah does not change the favour He has bestowed upon any people until they first change themselves, and indeed Allah is All Hearing, All Knowing.\n",
        "TRANSLATION_5": "That is so because Allah will never change a grace which He has bestowed on a people until they change what is in themselves. And verily, Allah is All-Hearer, All-Knower.\n",
        "TRANSLATION_6": "This is because Allah has never changed a favor which He has conferred upon a people until they change their own condition; and because Allah is Hearing, Knowing;\n",
        "TRANSLATION_7": "That is because God would never change His favour that He conferred on a people until they changed what was within themselves; and that God is All-hearing, All-knowing.\n",
        "TRANSLATION_8": "That is because Allah never changeth the grace He hath bestowed on any people until they first change that which is in their hearts, and (that is) because Allah is Hearer, Knower.\n",
        "TRANSLATION_9": "God would never withdraw a favour that He had conferred upon a people unless they change what is in their hearts. God is all hearing and all-knowing.\n",
        "TRANSLATION_10": "This, because Allah is not one to change His favour wherewith He hath favoured a people until they have changed that which is in themselves; and verily Allah is Hearing, Knowing.\n",
        "TRANSLATION_11": "That is because Allah never changes a blessing that He has bestowed on a people unless they change what is in their own souls, and Allah is all-hearing, all-knowing:\n",
        "TRANSLATION_12": "Because Allah will never change the grace which He hath bestowed on a people until they change what is in their (own) souls: and verily Allah is He Who heareth and knoweth (all things).\"\n",
        "TRANSLATION_13": "That is so because Allah will never change a grace which He has bestowed on a people until they change what is in their ownselves. And verily, Allah is All-Hearer, All-Knower.\n",
        "TRANSLATION_14": "This is because Allah would never change His favor that He bestowed upon a nation until they change what is in their hearts. Allah is Hearing, Knowing.\n",
        "TRANSLATION_15": "That is because God would never change a blessing He has bestowed on a people unless they change what is within themselves, and because God is Hearing and Knowing.\n",
        "TRANSLATION_16": "That is because Allah would not change a favor which He had bestowed upon a people until they change what is within themselves. And indeed, Allah is Hearing and Knowing.\n",
        "TRANSLATION_17": "[8:53] That, chastisement of the disbelievers, is because God would never change a grace that He had conferred on a people, substituting it with affliction, until they have changed that which is in themselves, [until] they have exchanged the grace conferred upon them for unbelief, in the way that the Meccan disbelievers exchanged their being ‘fed against hunger’, their being made ‘safe from fear’ [cf. Q. 106:4] and the sending of the Prophet (s) to them, for unbelief, [for] barring against the way of God and [for] fighting Muslims; and [know] that God is Hearing, Knowing.\n",
        "TRANSLATION_18": "(That is because Allah never changeth the grace He hath bestowed on any people) by sending them a Scripture, messenger and security (until they first change that which is in their hearts) by abstaining from giving thanks to Him, (and (that is) because Allah is Hearer) of your supplications, (Knower) of your answer.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "8:53",
            "2:244",
            "27:43",
            "2:227",
            "35:8",
            "9:44",
            "46:23",
            "9:115",
            "9:56",
            "8:61"
        ],
        "BIBLE": [
            "writings:i%20chronicles:29:17",
            "prophets:ezekiel:32:9",
            "torah:exodus:33:16",
            "writings:psalms:101:4",
            "torah:deuteronomy:15:10",
            "writings:psalms:95:10",
            "prophets:jeremiah:17:9",
            "torah:exodus:33:13",
            "prophets:jeremiah:5:9",
            "prophets:jeremiah:5:29"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:8"
        ]
    }
}