{
    "VERSE": "8:59",
    "ARABIC": "وَلَا يَحْسَبَنَّ ٱلَّذِينَ كَفَرُوا۟ سَبَقُوٓا۟ إِنَّهُمْ لَا يُعْجِزُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Do not imagine that those who are kafir have got ahead. They are quite powerless.",
        "TRANSLATION_1": "The infidels should not think that they can bypass (the law of God). Surely they cannot get away.\n",
        "TRANSLATION_2": "Let not the deniers of the truth be deluded that they will gain any advantage. Surely, they, can never overcome Us!\n",
        "TRANSLATION_3": "The unbelievers should not think that they can really escape Us or that they can never be defeated.\n",
        "TRANSLATION_4": "And never may the disbelievers pride that they have escaped; indeed they can never defeat.\n",
        "TRANSLATION_5": "And let not those who disbelieve think that they can outstrip (escape from the punishment). Verily, they will never be able to save themselves (from Allah's punishment).\n",
        "TRANSLATION_6": "And let not those who disbelieve think that they shall come in first; surely they will not escape.\n",
        "TRANSLATION_7": "And thou art not to suppose that they who disbelieve have outstripped Me; they cannot frustrate My will.\n",
        "TRANSLATION_8": "And let not those who disbelieve suppose that they can outstrip (Allah's Purpose). Lo! they cannot escape.\n",
        "TRANSLATION_9": "Let not the deniers think that they will ever get away. They cannot frustrate [God's purpose]. They have not the power to do so.\n",
        "TRANSLATION_10": "Let not those who disbelieve deem that they have escaped, verily they cannot frustrate.\n",
        "TRANSLATION_11": "Let the faithless not suppose that they have outmanoeuvred [Allah]. Indeed, they cannot frustrate [His power].\n",
        "TRANSLATION_12": "Let not the unbelievers think that they can get the better (of the godly): they will never frustrate (them).\n",
        "TRANSLATION_13": "And let not those who disbelieve think that they can outstrip (escape from the punishment). Verily, they will never be able to save themselves (from Allah's Punishment).\n",
        "TRANSLATION_14": "Do not suppose that the unbelievers have outstripped (Allah). They cannot frustrate Me.\n",
        "TRANSLATION_15": "Let not the disbelievers assume that they are ahead. They will not escape.\n",
        "TRANSLATION_16": "And let not those who disbelieve think they will escape. Indeed, they will not cause failure [to Allah].\n",
        "TRANSLATION_17": "[8:59] The following was revealed regarding those who escaped capture on the day of Badr: And do not, O Muhammad (s), let those who disbelieve suppose that they have outstripped, God, that is, [that] they have eluded Him: indeed they cannot escape, they cannot elude Him (a variant reading has wa-lā yahsabanna, ‘and do not let them suppose’, so that the first direct object is omitted, actually being [an implied] anfusahum, ‘themselves’ [sc. ‘and do not let them suppose themselves to have outstripped’]; and according to another [variant reading] anna is read [instead of inna] with an implicit lām [sc. ‘because they cannot escape’]).\n",
        "TRANSLATION_18": "(And) Muhammad (let not those who disbelieve) whether from the Banu Qurayzah or somewhere else (suppose that they can outstrip) Our punishment due to the things they have done and said. (Lo! they cannot escape) Our punishment.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "8:59",
            "78:27",
            "43:42",
            "83:29",
            "6:134",
            "107:6",
            "44:59",
            "37:127",
            "26:226",
            "77:48"
        ],
        "BIBLE": [
            "prophets:hosea:2:25",
            "writings:psalms:69:2",
            "writings:psalms:57:4",
            "torah:deuteronomy:26:1",
            "writings:ii%20chronicles:25:8",
            "prophets:isaiah:25:1",
            "writings:esther:1:19",
            "prophets:jeremiah:14:22",
            "writings:ezra:7:26",
            "prophets:jonah:1:6"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:3:3"
        ]
    }
}