{
    "VERSE": "8:6",
    "ARABIC": "يُجَٰدِلُونَكَ فِى ٱلْحَقِّ بَعْدَمَا تَبَيَّنَ كَأَنَّمَا يُسَاقُونَ إِلَى ٱلْمَوْتِ وَهُمْ يَنظُرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "arguing with you about the Truth after it had been made clear as though they were being driven to their death with open eyes.*",
        "TRANSLATION_1": "Who argued with you about the matter even after it had become quite clear, as if they were being pushed into (the arms of) death as they waited.\n",
        "TRANSLATION_2": "They disputed with you about the truth after that had become evident, as if they were being driven to death with their eyes wide open.\n",
        "TRANSLATION_3": "Knowing it well (that a fight in which they are to take part is about to take place), they act as though they are being driven to death which they can see before their very eyes. Despite their knowledge of the truth, they still argue with you.\n",
        "TRANSLATION_4": "Disputing with you regarding the truth after it had been made clear, as if they were being herded towards a visible death.\n",
        "TRANSLATION_5": "Disputing with you concerning the truth after it was made manifest, as if they were being driven to death, while they were looking (at it).\n",
        "TRANSLATION_6": "They disputed with you about the truth after it had become clear, (and they went forth) as if they were being driven to death while they saw (it).\n",
        "TRANSLATION_7": "disputing with thee concerning the truth after it had become clear, as though they were being driven into death with their eyes wide open.\n",
        "TRANSLATION_8": "Disputing with thee of the Truth after it had been made manifest, as if they were being driven to death visible.\n",
        "TRANSLATION_9": "and they disputed with you concerning the truth after it had become manifest, as though they were being driven to their death with open eyes.\n",
        "TRANSLATION_10": "Disputing with thee respecting the right cause after it had become manifest, as though they were led forth unto death while they looked on.\n",
        "TRANSLATION_11": "They disputed with you concerning the truth after it had become clear, as if they were being driven towards death as they looked on.\n",
        "TRANSLATION_12": "Disputing with thee concerning the truth after it was made manifest, as if they were being driven to death and they (actually) saw it.\n",
        "TRANSLATION_13": "Disputing with you concerning the truth after it was made manifest, as if they were being driven to death, while they were looking (at it).\n",
        "TRANSLATION_14": "They argued with you about the truth after it had been made clear, as though they were being led to certain death while looking.\n",
        "TRANSLATION_15": "Arguing with you about the truth after it was made clear, as if they were being driven to death as they looked on.\n",
        "TRANSLATION_16": "Arguing with you concerning the truth after it had become clear, as if they were being driven toward death while they were looking on.\n",
        "TRANSLATION_17": "[8:6] They dispute with you concerning the truth, [the order] to fight, after it had become clear, [after it had] become evident to them, as though they were being driven to death while they looked, at it [death] with their very eyes, utterly averse to it.\n",
        "TRANSLATION_18": "(Disputing with thee of) arguing with you about (the Truth) the war (after it had been made manifest) that you do not act upon or command anything except that with which your Lord has commanded you, (as if they were being driven to death visible) driven to death while looking straight at it.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "8:6",
            "2:56",
            "50:19",
            "46:30",
            "30:19",
            "51:19",
            "23:15",
            "2:176",
            "7:118",
            "42:18"
        ],
        "BIBLE": [
            "torah:genesis:16:4",
            "writings:ecclesiastes:8:10",
            "torah:genesis:38:2",
            "torah:genesis:24:63",
            "prophets:isaiah:59:15",
            "torah:genesis:21:19",
            "prophets:hosea:6:3",
            "prophets:ii%20samuel:24:20",
            "prophets:ezekiel:10:22",
            "writings:i%20chronicles:12:18"
        ]
    }
}