{
    "VERSE": "8:61",
    "ARABIC": "وَإِن جَنَحُوا۟ لِلسَّلْمِ فَٱجْنَحْ لَهَا وَتَوَكَّلْ عَلَى ٱللَّهِ إِنَّهُۥ هُوَ ٱلسَّمِيعُ ٱلْعَلِيمُ",
    "ENGLISH": {
        "TRANSLATION_0": "If they incline to peace, you too incline to it, and put your trust in Allah. He is the All-Hearing, the All- Knowing.",
        "TRANSLATION_1": "But if they are inclined to peace, make peace with them, and have trust in God, for He hears all and knows everything.\n",
        "TRANSLATION_2": "If they incline to peace, incline you as well to it, and trust in Allah. Surely He is All-Hearing. All-Knowing.\n",
        "TRANSLATION_3": "If they (the unbelievers) propose peace, accept it and trust in God. God is All-hearing and All-knowing.\n",
        "TRANSLATION_4": "And if they incline towards peace, you too lean towards it, and trust Allah; indeed He only is the All Hearing, the All Knowing.\n",
        "TRANSLATION_5": "But if they incline to peace, you also incline to it, and trust in Allah. Verily, He is the All-Hearer, the All-Knower.\n",
        "TRANSLATION_6": "And if they incline to peace, then incline to it and trust in Allah; surely He is the Hearing, the Knowing.\n",
        "TRANSLATION_7": "And if they incline to peace, do thou incline to it; and put thy trust in God; He is the All-hearing, the All-knowing.\n",
        "TRANSLATION_8": "And if they incline to peace, incline thou also to it, and trust in Allah. Lo! He, even He, is the Hearer, the Knower.\n",
        "TRANSLATION_9": "Then if they should be inclined to make peace, make peace with them, and put your trust in God. Surely, it is He who is All Hearing and All Knowing.\n",
        "TRANSLATION_10": "And if they incline unto peace, then thou mayest incline thereunto, and rely thou on Allah; verily He is the Hearer, the Knower.\n",
        "TRANSLATION_11": "If they incline toward peace, then you [too] incline toward it, and put your trust in Allah. Indeed He is the All-hearing, the All-knowing.\n",
        "TRANSLATION_12": "But if the enemy incline towards peace, do thou (also) incline towards peace, and trust in Allah: for He is One that heareth and knoweth (all things).\n",
        "TRANSLATION_13": "But if they incline to peace, you also incline to it, and (put your) trust in Allah. Verily, He is the All-Hearer, the All-Knower.\n",
        "TRANSLATION_14": "If they incline to peace, incline to it also, and put your trust in Allah. Surely, He is the Hearing, the Knowing.\n",
        "TRANSLATION_15": "But if they incline towards peace, then incline towards it, and put your trust in God. He is the Hearer, the Knower.\n",
        "TRANSLATION_16": "And if they incline to peace, then incline to it [also] and rely upon Allah. Indeed, it is He who is the Hearing, the Knowing.\n",
        "TRANSLATION_17": "[8:61] And if they incline to peace (read silm or salm, meaning, ‘settlement’), then incline to it, and conclude a pact with them: Ibn ‘Abbās said, ‘This has been abrogated by the “sword verse” [Q. 9:5]’; Mujāhid said, ‘This [stipulation] applies exclusively in the context of the People of the Scripture, for it was revealed regarding the Banū Qurayza; and rely on God, put your trust in Him; truly He is the Hearer, of words, the Knower, of actions.\n",
        "TRANSLATION_18": "(And if they incline to peace) if the Banu Qurayzah incline to and desire peace, (incline you also to it) and desire it, (and trust in Allah) in relation to their breaking or honouring of treaties. (Lo! He is the Hearer) of what they say, (the Knower) of their breaking and honouring of treaties.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "8:61",
            "2:227",
            "3:63",
            "2:137",
            "10:65",
            "29:5",
            "7:200",
            "2:181",
            "2:244",
            "26:220"
        ],
        "BIBLE": [
            "writings:i%20chronicles:29:17",
            "prophets:i%20samuel:20:7",
            "prophets:joshua:1:17",
            "torah:exodus:18:23",
            "prophets:isaiah:48:6",
            "writings:ecclesiastes:3:14",
            "writings:psalms:71:19",
            "writings:psalms:40:6",
            "writings:job:42:2",
            "torah:deuteronomy:15:10"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:2",
            "Sefer%20Yetzirah:1:2",
            "Sefer%20Yetzirah:1:5"
        ]
    }
}