{
    "VERSE": "8:7",
    "ARABIC": "وَإِذْ يَعِدُكُمُ ٱللَّهُ إِحْدَى ٱلطَّآئِفَتَيْنِ أَنَّهَا لَكُمْ وَتَوَدُّونَ أَنَّ غَيْرَ ذَاتِ ٱلشَّوْكَةِ تَكُونُ لَكُمْ وَيُرِيدُ ٱللَّهُ أَن يُحِقَّ ٱلْحَقَّ بِكَلِمَٰتِهِۦ وَيَقْطَعَ دَابِرَ ٱلْكَٰفِرِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "When Allah promised you that one of the two parties would be yours and you would have liked it to have been the unarmed one, whereas Allah desired to verify the Truth by His words and to cut off the last remnant of the kafirun.",
        "TRANSLATION_1": "Though God promised that one of two columns (would fall to you), you desired the one that was not armed. But God wished to confirm the truth by His words, and wipe the unbelievers out to the last,\n",
        "TRANSLATION_2": "And recall when Allah promised you that one of the two hosts would fall to you, and you wished that the one without arms should fall into your hands. But Allah sought to prove by His words the truth to be true and to annihilate the unbelievers to the last remnant\n",
        "TRANSLATION_3": "When God promised to grant you (believers) victory over either one of the two groups, you wished to have control over the unarmed one. God decided to prove (to you) the truth of His promises and to destroy the unbelievers\n",
        "TRANSLATION_4": "And remember when Allah promised you that one of the two groups (of enemies) is for you, and you wished to get the one that posed no danger, and Allah willed to prove the truth with His Words, and to cut the origins of the disbelievers.\n",
        "TRANSLATION_5": "And (remember) when Allah promised you (Muslims) one of the two parties, that it should be yours; you wished that the one not armed should be yours, but Allah willed to justify the truth by His Words and to cut off the roots of the disbelievers.\n",
        "TRANSLATION_6": "And when Allah promised you one of the two parties that it shall be yours and you loved that the one not armed should he yours and Allah desired to manifest the truth of what was true by His words and to cut off the root of the unbelievers.\n",
        "TRANSLATION_7": "And when God promised you one of the two parties should be yours, and you were wishing that the one not accoutred should be yours; but God was desiring to verify the truth by His words, and to cut off the unbelievers to the last remnant,\n",
        "TRANSLATION_8": "And when Allah promised you one of the two bands (of the enemy) that it should be yours, and ye longed that other than the armed one might be yours. And Allah willed that He should cause the Truth to triumph by His words, and cut the root of the disbelievers;\n",
        "TRANSLATION_9": "God promised you that one of the two parties would fall to you, and you wished that the one without sting should be yours, but God wanted to establish the truth by His words and cut off the root of those who denied the truth --\n",
        "TRANSLATION_10": "And recall what time Allah was promising you one of the two parties that it should be yours, and ye would fain to have that the one without; Whilst Allah besought arms were yours to justify the truth by His words and to cut off the root of the infidels.\n",
        "TRANSLATION_11": "When Allah promised you [victory over] one of the two companies, [saying], ‘It is for you,’ you were eager that it should be the one that was unarmed. But Allah desires to confirm the truth with His words, and to root out the faithless,\n",
        "TRANSLATION_12": "Behold! Allah promised you one of the two (enemy) parties, that it should be yours: Ye wished that the one unarmed should be yours, but Allah willed to justify the Truth according to His words and to cut off the roots of the Unbelievers;-\n",
        "TRANSLATION_13": "And (remember) when Allah promised you (Muslims) one of the two parties (of the enemy i.e. either the army or the caravan) that it should be yours, you wished that the one not armed (the caravan) should be yours, but Allah willed to justify the truth by His Words and to cut off the roots of the disbelievers (i.e. in the battle of Badr).\n",
        "TRANSLATION_14": "(Remember) when Allah promised to grant you one of the two parties (at Badr), and you wished for the one that was not strong. Allah wanted to establish the truth by His Words and to sever the unbelievers to the last,\n",
        "TRANSLATION_15": "God has promised you one of the two groups—that it would be yours—but you wanted the unarmed group to be yours. God intends to prove the truth with His words, and to uproot the disbelievers.\n",
        "TRANSLATION_16": "[Remember, O believers], when Allah promised you one of the two groups - that it would be yours - and you wished that the unarmed one would be yours. But Allah intended to establish the truth by His words and to eliminate the disbelievers\n",
        "TRANSLATION_17": "[8:7] And, remember, when God promised you one of the two parties, either the caravan or the band [of Meccan fighters], that it should be yours, and you longed, you were wishing, that other than the armed one, that is, [other than] the fighting one with the weapons, in other words, [you longed that] the caravan, should be yours, because it had fewer men and less reinforcements than the band [of Mecca fighters]; but God willed that the truth be realised, [He willed] to manifest it, by His, preceding, words, that Islam should triumph; and to cut the root of the disbelievers, to the very last man, by extirpating them, and so He commanded you to fight against the band.\n",
        "TRANSLATION_18": "(And when Allah promised you one of the two bands (of the enemy)) one of two things: the caravan or the belongings of the army (that it should be yours) as spoils of war, (and you longed) you wished (that other than the armed one) hardship and war (might be yours) as spoils of war, i.e. the booty of camels. (And Allah willed that He should cause the Truth to triumph by His words) He willed to manifest His religion by means of His assistance and strengthening, (and cut the root of the disbelievers) the root and traces of the disbelievers;\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "8:7",
            "10:82",
            "5:84",
            "22:6",
            "7:33",
            "42:24",
            "3:153",
            "6:114",
            "4:81",
            "28:75"
        ],
        "BIBLE": [
            "prophets:i%20samuel:11:7",
            "prophets:ezekiel:25:7",
            "writings:ii%20chronicles:12:7",
            "prophets:jeremiah:34:18",
            "prophets:ezekiel:25:13",
            "prophets:zechariah:8:9",
            "prophets:jeremiah:44:25",
            "writings:lamentations:1:7",
            "prophets:malachi:1:13",
            "writings:ii%20chronicles:16:7"
        ]
    }
}