{
    "VERSE": "8:72",
    "ARABIC": "إِنَّ ٱلَّذِينَ ءَامَنُوا۟ وَهَاجَرُوا۟ وَجَٰهَدُوا۟ بِأَمْوَٰلِهِمْ وَأَنفُسِهِمْ فِى سَبِيلِ ٱللَّهِ وَٱلَّذِينَ ءَاوَوا۟ وَّنَصَرُوٓا۟ أُو۟لَٰٓئِكَ بَعْضُهُمْ أَوْلِيَآءُ بَعْضٍ وَٱلَّذِينَ ءَامَنُوا۟ وَلَمْ يُهَاجِرُوا۟ مَا لَكُم مِّن وَلَٰيَتِهِم مِّن شَىْءٍ حَتَّىٰ يُهَاجِرُوا۟ وَإِنِ ٱسْتَنصَرُوكُمْ فِى ٱلدِّينِ فَعَلَيْكُمُ ٱلنَّصْرُ إِلَّا عَلَىٰ قَوْمٍۭ بَيْنَكُمْ وَبَيْنَهُم مِّيثَٰقٌ وَٱللَّهُ بِمَا تَعْمَلُونَ بَصِيرٌ",
    "ENGLISH": {
        "TRANSLATION_0": "Those who have iman and have made hiira and done jihad with their wealth and themselves in the Way of Allah, and those who have given refuge and help, they are the friends and protectors of one another. But as for those who have iman but have not made hijra, you are not in any way responsible for their protection until they make hijra. But if they ask you for help in respect of the deen, it is your duty to help them, except against people you have a treaty with. Allah sees what you do.",
        "TRANSLATION_1": "Those who accepted the faith and set out of their homes, and fought in the way of God wealth and soul, and those who gave them shelter and helped them, are friends of one another. You are not responsible for protecting those who embraced the faith but did not leave their homes, until they do so. In ease they ask for your help in the name of faith, you are duty bound to help them, except against a people with whom you have a treaty; for God sees all that you do.\n",
        "TRANSLATION_2": "Surely those who believed and migrated and strove hard in the way of Allah with their possessions and their lives, and those that sheltered and helped them - they alone are the true allies of one another. And those who believed but did not migrate (to Dar-al-Islam), you are under no obligation of alliance unless they migrate. And should they seek help from you in the matter of religion, it is incumbent on you to provide help unless it be against a people with whom you have a pact. Allah is cognizant of all that you do.\n",
        "TRANSLATION_3": "The believers who left their homes and strove for the cause of God, through their property and in person and those who gave refuge to them and helped them will be each other's guardians. The believers who did not leave their homes are not your guardians until they too leave their homes. If they ask you for help in a religious cause, you must help them against their enemies unless their enemies have a peace treaty with you. God is Well Aware of what you do.\n",
        "TRANSLATION_4": "Indeed those who accepted faith and left their homes and belongings for Allah, and fought with their wealth and their lives in Allah's cause, and those who gave shelter and provided help, are the heirs of one another; and those who believed but did not leave their homes – you have no right in their estates until they migrate; and if they seek help from you in the matter of religion then it is your duty to provide help, except against the people between whom and you is a treaty; and Allah sees your deeds.\n",
        "TRANSLATION_5": "Verily, those who believed, and emigrated and strove hard and fought with their property and their lives in the cause of Allah as well as those who gave (them) asylum and help, -- these are (all) allies to one another. And as to those who believed but did not emigrate, you owe no duty of protection to them until they emigrate, but if they seek your help in religion, it is your duty to help them except against a people with whom you have a treaty of mutual alliance; and Allah is the All-Seer of what you do.\n",
        "TRANSLATION_6": "Surely those who believed and fled (their homes) and struggled hard in Allah's way with their property and their souls, and those who gave shelter and helped-- these are guardians of each other; and (as for) those who believed and did not fly, not yours is their guardianship until they fly; and if they seek aid from you in the matter of religion, aid is incumbent on you except against a people between whom and you there is a treaty, and Allah sees what you do.\n",
        "TRANSLATION_7": "Those who believe, and have emigrated and struggled with their possessions and their selves in the way of God, and those who have given refuge and help -- those are friends one of another. And those who believe, but have not emigrated -- you have no duty of friendship towards them till they emigrate; yet if they ask you for help, for religion's sake, it is your duty to help them, except against a people between whom and you there is a compact; and God sees the things you do.\n",
        "TRANSLATION_8": "Lo! those who believed and left their homes and strove with their wealth and their lives for the cause of Allah, and those who took them in and helped them: these are protecting friends one of another. And those who believed but did not leave their homes, ye have no duty to protect them till they leave their homes; but if they seek help from you in the matter of religion then it is your duty to help (them) except against a folk between whom and you there is a treaty. Allah is Seer of what ye do.\n",
        "TRANSLATION_9": "Those who have believed and migrated and struggled for God's cause with their possessions and persons, and those who have given refuge and help, are the friends and protectors of one another. But as for those who have come to believe without having migrated -- you are in no way responsible for their protection until they migrate. If they seek your help in the matter of religion, it is incumbent on you to help them, except against a people with whom you have a pact. God sees what you do.\n",
        "TRANSLATION_10": "Verily those who believed and emigrated and strave hard in the way of Allah with their riches and lives'and those who sheltered and succoured: those shall be heirs unto one anot her. And those who believed but emigrated not, ye have naught of inheritance to do with them, unless they emigrate. And should they seek succour from you in the matter of religion, then incumbent on you is the succour, except against a people between whom and you there is a compact. And Allah is the Beholder of that which ye work.\n",
        "TRANSLATION_11": "Indeed those who have believed and migrated and waged jihad with their possessions and persons in the way of Allah, and those who gave [them] shelter and help—they are heirs of one another. As for those who have believed but did not migrate, you have no heirdom in relation to them whatsoever until they migrate. Yet if they ask your help for the sake of religion, it is incumbent on you to help them, excepting against a people with whom you have a treaty; and Allah watches what you do.\n",
        "TRANSLATION_12": "Those who believed, and adopted exile, and fought for the Faith, with their property and their persons, in the cause of Allah, as well as those who gave (them) asylum and aid,- these are (all) friends and protectors, one of another. As to those who believed but came not into exile, ye owe no duty of protection to them until they come into exile; but if they seek your aid in religion, it is your duty to help them, except against a people with whom ye have a treaty of mutual alliance. And (remember) Allah seeth all that ye do.\n",
        "TRANSLATION_13": "Verily, those who believed, and emigrated and strove hard and fought with their property and their lives in the Cause of Allah as well as those who gave (them) asylum and help, - these are (all) allies to one another. And as to those who believed but did not emigrate (to you O Muhammad SAW), you owe no duty of protection to them until they emigrate, but if they seek your help in religion, it is your duty to help them except against a people with whom you have a treaty of mutual alliance, and Allah is the All-Seer of what you do.\n",
        "TRANSLATION_14": "Those who believe and migrated, and fought for the Cause of Allah with their wealth and their persons; and those who sheltered them and helped them shall be guides to each other. And those who believe, but have not emigrated you have no guidance towards them till they emigrate. But if they seek your help in the cause of your religion, it is your duty to help them, except against a nation with whom you have a treaty. Allah sees the things you do.\n",
        "TRANSLATION_15": "Those who believed, and emigrated, and struggled in God’s cause with their possessions and their persons, and those who provided shelter and support—these are allies of one another. As for those who believed, but did not emigrate, you owe them no protection, until they have emigrated. But if they ask you for help in religion, you must come to their aid, except against a people with whom you have a treaty. God is Seeing of what you do.\n",
        "TRANSLATION_16": "Indeed, those who have believed and emigrated and fought with their wealth and lives in the cause of Allah and those who gave shelter and aided - they are allies of one another. But those who believed and did not emigrate - for you there is no guardianship of them until they emigrate. And if they seek help of you for the religion, then you must help, except against a people between yourselves and whom is a treaty. And Allah is Seeing of what you do.\n",
        "TRANSLATION_17": "[8:72] Truly those who believed and emigrated and strove with their wealth and their lives in the way of God, these being the Emigrants, and those who provided refuge, for the Prophet (s), and assisted, these being the Helpers, those are allies of one another, in terms of [mutual] support and inheritance. And those who believed but did not emigrate — you have no duty to make an alliance (read wilāya or walāya) with them, and so there is no inheriting between you and them and no share of the spoils for them, until they emigrate, this was abrogated by the end of this sūra; but if they ask you for assistance in the matter of religion then it is your duty to assist, them against the disbelievers, except against a folk between whom and you there is a covenant, a pact: in which case, do not assist them against these others and so break your pact; and God sees what you do.\n",
        "TRANSLATION_18": "(Lo! those who believed) in Muhammad and in the Qur'an (and left their homes) in Mecca and headed towards Medina (and strove with their wealth and their lives for the cause of Allah) in obedience of Allah, (and those who took them in) those who hosted Muhammad (pbuh) and his Companions in Medina (in and helped them) on the Day of Badr; (these are protecting friends one of another) in inheritance. (And those who believed) in Muhammad (pbuh) and in the Qur'an (but did not leave their homes) in Mecca to migrate to Medina, (ye have no duty to protect them) you do not inherit them, nor do they inherit you (till they leave their homes) and migrate to Medina; (but if they seek help from you in the matter of religion) if they seek your help against their enemies in religion (then it is your duty to help (them)) against their enemies (except against a folk between whom and you there is a treaty) in which case you should not help them, but rather try to make peace between them. (Allah is Seer of what ye do) regarding peace and other things.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "8:72",
            "4:90",
            "5:51",
            "49:15",
            "4:141",
            "8:39",
            "4:34",
            "45:19",
            "5:14",
            "22:17"
        ],
        "BIBLE": [
            "prophets:ezekiel:18:13",
            "writings:psalms:105:44",
            "prophets:ii%20kings:10:15",
            "torah:genesis:30:9",
            "torah:deuteronomy:25:19",
            "writings:i%20chronicles:29:14",
            "prophets:judges:14:9",
            "prophets:judges:18:10",
            "prophets:joshua:11:23",
            "torah:genesis:3:6"
        ]
    }
}