{
    "VERSE": "8:73",
    "ARABIC": "وَٱلَّذِينَ كَفَرُوا۟ بَعْضُهُمْ أَوْلِيَآءُ بَعْضٍ إِلَّا تَفْعَلُوهُ تَكُن فِتْنَةٌ فِى ٱلْأَرْضِ وَفَسَادٌ كَبِيرٌ",
    "ENGLISH": {
        "TRANSLATION_0": "Those who are kafir are the friends and protectors of one another. If you do not act in this way there will be turmoil in the land and great corruption.",
        "TRANSLATION_1": "Those who are infidels aid one another. Unless you do the same there will be discord in the land and anarchy.\n",
        "TRANSLATION_2": "And those who disbelieve. they are allies of one another; and unless you act likewise. there will be oppression in the world and great corruption.\n",
        "TRANSLATION_3": "The unbelievers are each other's friends. If you (the believers) do not keep the same among yourselves in the land, there will come into being widespread idolatry and great evil.\n",
        "TRANSLATION_4": "And the disbelievers are the heirs of one another – if you do not do so, there will be turmoil in the land and a great chaos.\n",
        "TRANSLATION_5": "And those who disbelieve are allies of one another, (and) if you (Muslims) do not do so (protect one another), there will be Fitnah on the earth, and great corruption.\n",
        "TRANSLATION_6": "And (as for) those who disbelieve, some of them are the guardians of others; if you will not do it, there will be in the land persecution and great mischief.\n",
        "TRANSLATION_7": "As for the unbelievers, they are friends one of another. Unless you do this, there will be persecution in the land and great corruption.\n",
        "TRANSLATION_8": "And those who disbelieve are protectors one of another - If ye do not so, there will be confusion in the land, and great corruption.\n",
        "TRANSLATION_9": "Those who deny the truth support one another. If you fail to do likewise, there will be great disorder and corruption in the land.\n",
        "TRANSLATION_10": "And those who disbelieve: they shall be heirs unto one anot her. if ye do this not, a sedition there will be in the land and a great corruption.\n",
        "TRANSLATION_11": "As for the faithless, they are heirs of one another. Unless you do the same, there will be strife in the land and great corruption.\n",
        "TRANSLATION_12": "The Unbelievers are protectors, one of another: Unless ye do this, (protect each other), there would be tumult and oppression on earth, and great mischief.\n",
        "TRANSLATION_13": "And those who disbelieve are allies to one another, (and) if you (Muslims of the whole world collectively) do not do so (i.e. become allies, as one united block with one Khalifah - chief Muslim ruler for the whole Muslim world to make victorious Allah's Religion of Islamic Monotheism), there will be Fitnah (wars, battles, polytheism, etc.) and oppression on earth, and a great mischief and corruption (appearance of polytheism).\n",
        "TRANSLATION_14": "The unbelievers, they are guides of one another. Unless you do this, there will be persecution in the land and great corruption.\n",
        "TRANSLATION_15": "As for those who disbelieve, they are allies of one another. Unless you do this, there will be turmoil in the land, and much corruption.\n",
        "TRANSLATION_16": "And those who disbelieved are allies of one another. If you do not do so, there will be fitnah on earth and great corruption.\n",
        "TRANSLATION_17": "[8:73] And those who disbelieve are allies of one another, in terms of [mutual] support and inheritance, and so there is no inheriting between you and them. Unless you do this, [unless] you ally yourselves with the believers and sever relations with the disbelievers, there will be sedition in the land and great corruption, with disbelief gaining power and Islam becoming weak.\n",
        "TRANSLATION_18": "(And those who disbelieve are protectors one of another-) in the matter of inheritance (If ye do not so) divide estate between relatives as has been explained to you, (there will be confusion in the land) through idolatry and apostasy, (and great corruption) by means of killings and transgression.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "8:73",
            "26:152",
            "5:51",
            "67:24",
            "23:79",
            "28:83",
            "11:116",
            "30:41",
            "18:26",
            "7:24"
        ],
        "BIBLE": [
            "prophets:ezekiel:29:12",
            "prophets:jeremiah:4:27",
            "prophets:ezekiel:15:8",
            "torah:exodus:30:37",
            "prophets:isaiah:10:23",
            "prophets:jeremiah:3:16",
            "writings:psalms:45:17",
            "torah:deuteronomy:28:24",
            "torah:exodus:34:10",
            "torah:leviticus:19:29"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:3:6"
        ]
    }
}