{
    "VERSE": "52:13",
    "ARABIC": "يَوْمَ يُدَعُّونَ إِلَىٰ نَارِ جَهَنَّمَ دَعًّا",
    "ENGLISH": {
        "TRANSLATION_0": "the Day they are shoved roughly into the Fire of Hell:",
        "TRANSLATION_1": "The day they are dragged and pushed into Hell,\n",
        "TRANSLATION_2": "On the Day when they shall be thrust into Hell with a violent thrust (and shall be told):\n",
        "TRANSLATION_3": "On that day they will be violently pushed into the fire\n",
        "TRANSLATION_4": "A day when they will be pushed, forcibly shoved towards the fire of hell.\n",
        "TRANSLATION_5": "The Day when they will be pushed down by force to the fire of Hell, with a horrible, forceful pushing.\n",
        "TRANSLATION_6": "The day on which they shall be driven away to the fire of hell with violence.\n",
        "TRANSLATION_7": "the day when they shall be pitched into the fire of Gehenna:\n",
        "TRANSLATION_8": "The day when they are thrust with a (disdainful) thrust, into the fire of hell\n",
        "TRANSLATION_9": "on that Day they shall be ruthlessly thrust into the Fire of Hell.\n",
        "TRANSLATION_10": "On the Day whereon they will be pushed into Hell-Fire with a dreadful push.\n",
        "TRANSLATION_11": "the day when they will be shoved forcibly toward the fire of hell, [and told:]\n",
        "TRANSLATION_12": "That Day shall they be thrust down to the Fire of Hell, irresistibly.\n",
        "TRANSLATION_13": "The Day when they will be pushed down by force to the Fire of Hell, with a horrible, forceful pushing.\n",
        "TRANSLATION_14": "On that Day when they shall be pitched into the Fire of Gehenna (Hell),\n",
        "TRANSLATION_15": "The Day when they are shoved into the Fire of Hell forcefully.\n",
        "TRANSLATION_16": "The Day they are thrust toward the fire of Hell with a [violent] thrust, [its angels will say],\n",
        "TRANSLATION_17": "[52:13] the day when they will be thrust with a violent thrust into Hell, [when] they will be pushed violently (this [last clause, yawma yuda‘‘ūna ilā nāri jahannama da‘‘an] is a substitution for yawma tamūru, ‘the day when [the heaven] will heave’) and it will be said to them in reproach:\n",
        "TRANSLATION_18": "(The day when they are thrust with a (disdainful) thrust into the Fire of hell) the angels drag them on their faces and thrust them in Gehenna.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "52:13",
            "51:13",
            "7:14",
            "28:41",
            "54:48",
            "41:19",
            "11:98",
            "38:79",
            "15:36",
            "50:30"
        ],
        "BIBLE": [
            "prophets:micah:4:6",
            "prophets:judges:2:3",
            "writings:proverbs:21:7",
            "prophets:hosea:13:3",
            "prophets:joshua:14:12",
            "prophets:ezekiel:4:13",
            "writings:psalms:68:3",
            "torah:deuteronomy:9:4",
            "torah:genesis:4:14",
            "prophets:isaiah:19:7"
        ]
    }
}