{
    "VERSE": "52:16",
    "ARABIC": "ٱصْلَوْهَا فَٱصْبِرُوٓا۟ أَوْ لَا تَصْبِرُوا۟ سَوَآءٌ عَلَيْكُمْ إِنَّمَا تُجْزَوْنَ مَا كُنتُمْ تَعْمَلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Roast in it! And bear it patiently or do not bear it patiently. It makes no difference either way. You are simply being repaid for what you did.'",
        "TRANSLATION_1": "Roast in it. Bear it with patience or impatience, it will be the same for you. You will be requited for what you had done.\"\n",
        "TRANSLATION_2": "Go now and burn in it. It is all the same whether you bear it patiently or do not bear it with patience. You are only being recompensed for your deeds.”\n",
        "TRANSLATION_3": "Burn in its heat. It is all the same for you whether you exercise patience or not; This is the recompense for your deeds\".\n",
        "TRANSLATION_4": "“Enter it – now whether you patiently bear it or are impatient – it is the same for you; for you is a recompense only for what you used to do.”\n",
        "TRANSLATION_5": "Enter therein and whether you are patient of it or impatient of it, it is all the same. You are only being requited for what you used to do.\n",
        "TRANSLATION_6": "Enter into it, then bear (it) patiently, or do not bear (it) patiently, it is the same to you; you shall be requited only (for) what you did.\n",
        "TRANSLATION_7": "Roast in it! And bear you patiently, or bear not patiently, equal it is to you; you are only being recompensed for that you were working.'\n",
        "TRANSLATION_8": "Endure the heat thereof, and whether ye are patient of it or impatient of it is all one for you. Ye are only being paid for what ye used to do.\n",
        "TRANSLATION_9": "Now enter it. Whether you behave patiently or impatiently will make no difference: you are only being repaid for what you have done.\n",
        "TRANSLATION_10": "Roast therein; endure it or endure it not, thereof it is equal Unto you. Ye are only being requited for that which ye have been working.\n",
        "TRANSLATION_11": "Enter it, and it will be the same for you whether you are patient or impatient. You are only being requited for what you used to do.’\n",
        "TRANSLATION_12": "Burn ye therein: the same is it to you whether ye bear it with patience, or not: Ye but receive the recompense of your (own) deeds.\"\n",
        "TRANSLATION_13": "Taste you therein its heat, and whether you are patient of it or impatient of it, it is all the same. You are only being requited for what you used to do.\n",
        "TRANSLATION_14": "Roast in it, bear it with or without patience, it is the same, you are only being recompensed for that which you used to do'\n",
        "TRANSLATION_15": "Burn in it. Whether you are patient, or impatient, it is the same for you. You are only being repaid for what you used to do.”\n",
        "TRANSLATION_16": "[Enter to] burn therein; then be patient or impatient - it is all the same for you. You are only being recompensed [for] what you used to do.\"\n",
        "TRANSLATION_17": "[52:16] Burn in it! And whether you endure, it, or do not endure, your endurance and your anguish, will be the same for you, because your endurance will be of no use to you. You are only being requited for what you used to do’, that is to say, [only] the requital for it.\n",
        "TRANSLATION_18": "Allah will say: (Endure the heat thereof) enter the Fire, (and whether ye are patient of it) of its torment (or impatient of it is all one for you) anxiety or patience is all one for you. (Ye are only being paid for what ye used to do) and say in the life of the world.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "52:16",
            "2:6",
            "37:161",
            "36:76",
            "88:21",
            "36:10",
            "21:109",
            "79:45",
            "19:84",
            "43:42"
        ],
        "BIBLE": [
            "torah:genesis:35:3",
            "torah:exodus:34:10",
            "torah:leviticus:23:28",
            "writings:daniel:10:14",
            "prophets:i%20samuel:9:27",
            "prophets:jeremiah:25:14",
            "prophets:isaiah:44:19",
            "prophets:jeremiah:15:14",
            "prophets:ezekiel:39:7",
            "torah:leviticus:6:23"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:3:6",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:3:8",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:4:7"
        ]
    }
}