{
    "VERSE": "52:17",
    "ARABIC": "إِنَّ ٱلْمُتَّقِينَ فِى جَنَّٰتٍ وَنَعِيمٍ",
    "ENGLISH": {
        "TRANSLATION_0": "The people who have taqwa will be in Gardens of Delight,",
        "TRANSLATION_1": "Those who fear God and follow the straight path will surely be in gardens and in bliss,\n",
        "TRANSLATION_2": "Surely the God-fearing shall be in Gardens and bliss,\n",
        "TRANSLATION_3": "The pious will live in bountiful Paradise,\n",
        "TRANSLATION_4": "Indeed the pious are in Gardens and peace.\n",
        "TRANSLATION_5": "Verily, those who have Taqwa will be in Gardens and Delight.\n",
        "TRANSLATION_6": "Surely those who guard (against evil) shall be in gardens and bliss\n",
        "TRANSLATION_7": "Surely the godfearing shall be in gardens and bliss,\n",
        "TRANSLATION_8": "Lo! those who kept their duty dwell in gardens and delight,\n",
        "TRANSLATION_9": "Truly, the God-fearing will dwell [on that Day] in gardens and in bliss,\n",
        "TRANSLATION_10": "Verily the God-fearing will bein Gardens and Delight.\n",
        "TRANSLATION_11": "Indeed the Godwary will be amid gardens and bliss,\n",
        "TRANSLATION_12": "As to the Righteous, they will be in Gardens, and in Happiness,-\n",
        "TRANSLATION_13": "Verily, the Muttaqun (pious - see V. 2:2) will be in Gardens (Paradise), and Delight.\n",
        "TRANSLATION_14": "But in the Gardens the righteous shall live in bliss,\n",
        "TRANSLATION_15": "But the righteous will be amid gardens and bliss.\n",
        "TRANSLATION_16": "Indeed, the righteous will be in gardens and pleasure,\n",
        "TRANSLATION_17": "[52:17] Truly the God-fearing will be amid gardens and bliss,\n",
        "TRANSLATION_18": "Allah then showed the abode of the believers, Abu Bakr and his fellow believers, saying: (Lo! those who kept their duty) those who ward off disbelief, idolatry and indecencies (dwell in Gardens and delight) eternally,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "52:17",
            "56:12",
            "37:43",
            "31:8",
            "26:85",
            "51:15",
            "15:45",
            "54:54",
            "68:34",
            "10:9"
        ],
        "BIBLE": [
            "writings:psalms:23:6",
            "prophets:ezekiel:18:9",
            "prophets:joshua:14:9",
            "prophets:ii%20kings:18:6",
            "prophets:joshua:22:16",
            "writings:psalms:5:5",
            "writings:psalms:18:22",
            "prophets:ii%20samuel:22:22",
            "prophets:ezekiel:18:19",
            "torah:deuteronomy:8:11"
        ]
    }
}