{
    "VERSE": "52:18",
    "ARABIC": "فَٰكِهِينَ بِمَآ ءَاتَىٰهُمْ رَبُّهُمْ وَوَقَىٰهُمْ رَبُّهُمْ عَذَابَ ٱلْجَحِيمِ",
    "ENGLISH": {
        "TRANSLATION_0": "savouring what their Lord has given them. Their Lord will safeguard them from the punishment of the Blazing Fire:",
        "TRANSLATION_1": "Rejoicing at what their Lord has given them; and their Lord will preserve them from the torment of Hell.\n",
        "TRANSLATION_2": "enjoying what Allah will have endowed them with; and their Lord will have saved them from the torment of the Blazing Fire.\n",
        "TRANSLATION_3": "talking of what they have received from their Lord and of how their Lord has saved them from the torment of hell.\n",
        "TRANSLATION_4": "Delighted at the bestowal of their Lord; and their Lord has saved them from the fire.\n",
        "TRANSLATION_5": "Enjoying in that which their Lord has bestowed on them, and (the fact that) their Lord saved them from the torment of the blazing Fire.\n",
        "TRANSLATION_6": "Rejoicing because of what their Lord gave them, and their Lord saved them from the punishment of the burning fire.\n",
        "TRANSLATION_7": "rejoicing in that their Lord has given them; and their Lord shall guard them against the chastisement of Hell.\n",
        "TRANSLATION_8": "Happy because of what their Lord hath given them, and (because) their Lord hath warded off from them the torment of hell-fire.\n",
        "TRANSLATION_9": "rejoicing in whatever their Lord has given them. Their Lord has saved them from the torment of the Fire,\n",
        "TRANSLATION_10": "Rejoicing in that which their Lord hath vouchsafed Unto them; and their Lord will protect them from the torment of the Flame.\n",
        "TRANSLATION_11": "rejoicing because of what their Lord has given them, and that their Lord has saved them from the punishment of hell.\n",
        "TRANSLATION_12": "Enjoying the (Bliss) which their Lord hath bestowed on them, and their Lord shall deliver them from the Penalty of the Fire.\n",
        "TRANSLATION_13": "Enjoying in that which their Lord has bestowed on them, and (the fact that) their Lord saved them from the torment of the blazing Fire.\n",
        "TRANSLATION_14": "rejoicing in all their Lord has given them, and their Lord will guard them against the punishment of Hell.\n",
        "TRANSLATION_15": "Enjoying what their Lord has given them, and their Lord has spared them the suffering of Hell.\n",
        "TRANSLATION_16": "Enjoying what their Lord has given them, and their Lord protected them from the punishment of Hellfire.\n",
        "TRANSLATION_17": "[52:18] rejoicing, delighting, in what (bi-mā relates to the verbal action) their Lord has given them, and [that] their Lord has shielded them from the chastisement of Hell-fire (wa-waqāhum rabbuhum ‘adhāba’l-jahīmi is a supplement to ātāhum, ‘[what He] has given them’, in other words, [rejoicing] in their having been given [this reward] and shielded [from Hell-fire]).\n",
        "TRANSLATION_18": "(Happy because of what your Lord hath given them) in the Garden, (and (because) their Lord hath warded off from them the torment of hellfire).\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "52:18",
            "70:27",
            "23:76",
            "44:12",
            "36:27",
            "6:30",
            "6:49",
            "67:6",
            "79:36",
            "23:26"
        ],
        "BIBLE": [
            "prophets:i%20samuel:30:23",
            "torah:deuteronomy:32:30",
            "writings:psalms:118:18",
            "prophets:joshua:13:8",
            "prophets:i%20kings:13:3",
            "writings:psalms:124:6",
            "writings:psalms:16:7",
            "prophets:joshua:18:7",
            "torah:numbers:18:8",
            "torah:leviticus:6:10"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:14",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:1:12",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:5:1"
        ]
    }
}