{
    "VERSE": "52:19",
    "ARABIC": "كُلُوا۟ وَٱشْرَبُوا۟ هَنِيٓـًٔۢا بِمَا كُنتُمْ تَعْمَلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "'Eat and drink with relish for what you did.'",
        "TRANSLATION_1": "Eat and drink with relish,\" (they will be told), (as recompense) for what you had done.\"\n",
        "TRANSLATION_2": "(They will be told): “Eat and drink to your hearts' content as a reward for your deeds.”\n",
        "TRANSLATION_3": "They will be told, \"Eat and drink to your heart's delight for what you have done\".\n",
        "TRANSLATION_4": "“Eat and drink with pleasure, a reward for what you used to do.”\n",
        "TRANSLATION_5": "Eat and drink with happiness because of what you used to do.\"\n",
        "TRANSLATION_6": "Eat and drink pleasantly for what you did,\n",
        "TRANSLATION_7": "Eat and drink, with wholesome appetite, for that you were working.\n",
        "TRANSLATION_8": "(And it is said unto them): Eat and drink in health (as a reward) for what ye used to do,\n",
        "TRANSLATION_9": "Eat and drink with good cheer as a reward for your good deeds,\"\n",
        "TRANSLATION_10": "Eat and drink with relish for that which ye have been working.\n",
        "TRANSLATION_11": "[They will be told:] ‘Enjoy your food and drink, [as a reward] for what you used to do.’\n",
        "TRANSLATION_12": "(To them will be said:) \"Eat and drink ye, with profit and health, because of your (good) deeds.\"\n",
        "TRANSLATION_13": "Eat and drink with happiness because of what you used to do.\"\n",
        "TRANSLATION_14": "(It will be said): 'Eat and drink with a good appetite because of that which you did'\n",
        "TRANSLATION_15": "Eat and drink happily, for what you used to do.\n",
        "TRANSLATION_16": "[They will be told], \"Eat and drink in satisfaction for what you used to do.\"\n",
        "TRANSLATION_17": "[52:19]   And it will said to them: ‘Eat and drink in full enjoyment (hanī’an is a circumstantial qualifier, that is to say, muhanna’īna) [as a reward] for what (bi-mā: the bi- is causative) you used to do’.\n",
        "TRANSLATION_18": "Allah will then say to them: (Eat) of the fruits of the Garden (and drink) of its rivers (in health) suffering no illness, sin or death ((as reward) for what ye used to do) and say in the life of the world,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "52:19",
            "77:43",
            "69:24",
            "26:132",
            "69:42",
            "109:4",
            "85:7",
            "26:138",
            "77:29",
            "26:92"
        ],
        "BIBLE": [
            "writings:ecclesiastes:2:1",
            "prophets:judges:19:6",
            "writings:psalms:14:1",
            "writings:psalms:53:2",
            "writings:proverbs:23:7",
            "prophets:isaiah:38:3",
            "writings:ecclesiastes:5:17",
            "writings:ecclesiastes:2:15",
            "writings:psalms:141:4",
            "writings:esther:6:6"
        ]
    }
}