{
    "VERSE": "52:20",
    "ARABIC": "مُتَّكِـِٔينَ عَلَىٰ سُرُرٍ مَّصْفُوفَةٍ وَزَوَّجْنَٰهُم بِحُورٍ عِينٍ",
    "ENGLISH": {
        "TRANSLATION_0": "They will recline on couches ranged in rows and We will marry them to dark-eyed maidens.",
        "TRANSLATION_1": "They would recline on couches set in rows, paired with fair companions (clean of thought and) bright of eye.\n",
        "TRANSLATION_2": "The God-fearing shall be reclining on couches facing each other, and We shall wed them to maidens with large, beautiful eyes.\n",
        "TRANSLATION_3": "They will recline on couches arranged in rows and We shall couple them with maidens with large, lovely eyes.\n",
        "TRANSLATION_4": "Reclining on thrones, in rows; and We have wedded them to maidens with gorgeous eyes.\n",
        "TRANSLATION_5": "They will recline on thrones Masfufah. And We shall marry them to Hur (fair females) with wide lovely eyes.\n",
        "TRANSLATION_6": "Reclining on thrones set in lines, and We will unite them to large-eyed beautiful ones.\n",
        "TRANSLATION_7": "Reclining upon couches ranged in rows; and We shall espouse them to wide-eyed houris.\n",
        "TRANSLATION_8": "Reclining on ranged couches. And we wed them unto fair ones with wide, lovely eyes.\n",
        "TRANSLATION_9": "reclining on couches arranged in rows. And We shall wed them to fair maidens with large beautiful eyes.\n",
        "TRANSLATION_10": "Reclining on couches ranged. And We shall couple them with maidens wide eyed.\n",
        "TRANSLATION_11": "They will be reclining on arrayed couches, and We will wed them to big-eyed houris.\n",
        "TRANSLATION_12": "They will recline (with ease) on Thrones (of dignity) arranged in ranks; and We shall join them to Companions, with beautiful big and lustrous eyes.\n",
        "TRANSLATION_13": "They will recline (with ease) on thrones arranged in ranks. And We shall marry them to Houris (female, fair ones) with wide lovely eyes.\n",
        "TRANSLATION_14": "(They shall be) reclining on couches ranged in rows and We shall wed them to houris (virgins of Paradise) with large wide eyes.\n",
        "TRANSLATION_15": "Relaxing on luxurious furnishings; and We will couple them with gorgeous spouses.\n",
        "TRANSLATION_16": "They will be reclining on thrones lined up, and We will marry them to fair women with large, [beautiful] eyes.\n",
        "TRANSLATION_17": "[52:20] [They will be] reclining (muttaki’īna is a circumstantial qualifier referring to the concealed subject of God’s words fī jannātin, ‘amid gardens’) on ranged couches, [arranged] one next to the other, and We will wed them (zawwajnāhum is a supplement to jannātin, ‘gardens’, meaning ‘We will couple them’) to beautiful houris, of wide and beautiful eyes.\n",
        "TRANSLATION_18": "(Reclining) sitting (on ranged couches) ranged close to each other. (And We wed them) in the Garden (unto fair ones with wide, lovely eyes.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "52:20",
            "44:54",
            "56:22",
            "43:34",
            "37:44",
            "37:45",
            "83:28",
            "26:57",
            "21:61",
            "56:15"
        ],
        "BIBLE": [
            "prophets:i%20kings:7:15",
            "prophets:amos:7:17",
            "prophets:zechariah:1:16",
            "prophets:micah:2:5",
            "prophets:isaiah:44:13",
            "prophets:jeremiah:31:39",
            "torah:numbers:34:10",
            "writings:lamentations:2:8",
            "prophets:isaiah:34:17",
            "prophets:ezekiel:40:3"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:3:8",
            "Sefer%20Yetzirah:3:6",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:3:2"
        ]
    }
}