{
    "VERSE": "52:22",
    "ARABIC": "وَأَمْدَدْنَٰهُم بِفَٰكِهَةٍ وَلَحْمٍ مِّمَّا يَشْتَهُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "We will supply them with any kind of fruit and meat that they desire.",
        "TRANSLATION_1": "We shall give them fruits and meats, and what they desire.\n",
        "TRANSLATION_2": "We shall provide them in abundance with all kinds of fruit and meat, whatever they may desire.\n",
        "TRANSLATION_3": "We shall provide them with fruits and the meat of the kind which they desire.\n",
        "TRANSLATION_4": "And We aided them with fruit and meat, whatever they desire.\n",
        "TRANSLATION_5": "And We shall provide them with fruit and meat such as they desire.\n",
        "TRANSLATION_6": "And We will aid them with fruit and flesh such as they desire.\n",
        "TRANSLATION_7": "And We shall succour them with fruits and flesh such as they desire\n",
        "TRANSLATION_8": "And We provide them with fruit and meat such as they desire.\n",
        "TRANSLATION_9": "We shall provide them in abundance with such fruit and meat as they desire.\n",
        "TRANSLATION_10": "And We shall increasingly give them fruit and meat such as they desire.\n",
        "TRANSLATION_11": "We will provide them with fruits and meat, such as they desire.\n",
        "TRANSLATION_12": "And We shall bestow on them, of fruit and meat, anything they shall desire.\n",
        "TRANSLATION_13": "And We shall provide them with fruit and meat, such as they desire.\n",
        "TRANSLATION_14": "We shall give them fruits and meat as they desire.\n",
        "TRANSLATION_15": "And We will supply them with fruit, and meat; such as they desire.\n",
        "TRANSLATION_16": "And We will provide them with fruit and meat from whatever they desire.\n",
        "TRANSLATION_17": "[52:22] And We will supply them, We will enhance for them [their provision], from time to time, with fruits and meat, such as they desire, even if they do not request it openly.\n",
        "TRANSLATION_18": "(And We provide them) i.e. We provided the inhabitants of the Garden in the Garden (with fruit) with different kinds of fruit (and meat) i.e. birds' meat (such as they desire.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "52:22",
            "56:20",
            "77:42",
            "56:21",
            "36:57",
            "44:55",
            "37:42",
            "83:31",
            "36:42",
            "26:112"
        ],
        "BIBLE": [
            "prophets:jeremiah:21:14",
            "torah:deuteronomy:28:4",
            "prophets:zechariah:8:12",
            "writings:psalms:132:15",
            "writings:psalms:78:20",
            "torah:deuteronomy:28:18",
            "torah:deuteronomy:12:20",
            "torah:genesis:30:30",
            "writings:ecclesiastes:5:9",
            "writings:ii%20chronicles:32:29"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:3:1",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:6:1"
        ]
    }
}