{
    "VERSE": "52:24",
    "ARABIC": "وَيَطُوفُ عَلَيْهِمْ غِلْمَانٌ لَّهُمْ كَأَنَّهُمْ لُؤْلُؤٌ مَّكْنُونٌ",
    "ENGLISH": {
        "TRANSLATION_0": "Circulating among them there will be youths like hidden pearls.",
        "TRANSLATION_1": "And young attendants like pearls within their shells, will go round.\n",
        "TRANSLATION_2": "Youths as fair as hidden pearls will be set apart to wait upon them; they will be running to and fro to serve them.\n",
        "TRANSLATION_3": "They will be served by youths who will be as beautiful as pearls.\n",
        "TRANSLATION_4": "And their boy servants shall go around them, as if they were pearls, safely hidden.\n",
        "TRANSLATION_5": "And there will go round boy-servants of theirs, to serve them as if they were preserved pearls.\n",
        "TRANSLATION_6": "And round them shall go boys of theirs as if they were hidden pearls.\n",
        "TRANSLATION_7": "and there go round them youths, their own, as if they were hidden pearls.\n",
        "TRANSLATION_8": "And there go round, waiting on them menservants of their own, as they were hidden pearls.\n",
        "TRANSLATION_9": "They will be waited upon by immortal youths, like pearls hidden in their shells.\n",
        "TRANSLATION_10": "And there will go round on them youths appointed to attend them as though they were pearls hidden.\n",
        "TRANSLATION_11": "They will be waited upon by their youths, as if they were guarded pearls.\n",
        "TRANSLATION_12": "Round about them will serve, (devoted) to them, young male servants (handsome) as Pearls well-guarded.\n",
        "TRANSLATION_13": "And there will go round boy-servants of theirs, to serve them as if they were preserved pearls.\n",
        "TRANSLATION_14": "and youths, of their own, shall pass among them as if they were hidden pearls.\n",
        "TRANSLATION_15": "Serving them will be youths like hidden pearls.\n",
        "TRANSLATION_16": "There will circulate among them [servant] boys [especially] for them, as if they were pearls well-protected.\n",
        "TRANSLATION_17": "[52:24] And there will circulate from all around them, for service, youths, delicate [in demeanour], of their own, as if, in terms of their beauty and immaculateness, they were hidden pearls, preserved inside shells, because when it [a pearl] is inside it, it is better than one that is not.\n",
        "TRANSLATION_18": "(And there go round) to serve them, (waiting on them menservants of their own), in their limpidity they (as they were hidden pearls) hidden from heat and cold.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "52:24",
            "76:19",
            "55:22",
            "15:53",
            "83:33",
            "19:20",
            "37:137",
            "74:14",
            "51:28",
            "2:15"
        ],
        "BIBLE": [
            "prophets:i%20kings:18:35",
            "prophets:amos:8:12",
            "prophets:i%20kings:2:39",
            "prophets:zechariah:4:10",
            "prophets:judges:7:21",
            "writings:daniel:12:4",
            "prophets:i%20samuel:8:11",
            "prophets:jeremiah:49:3",
            "prophets:ii%20samuel:15:1",
            "writings:ii%20chronicles:16:9"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:3:6",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:2:6",
            "Sefer%20Yetzirah:4:7"
        ]
    }
}