{
    "VERSE": "52:27",
    "ARABIC": "فَمَنَّ ٱللَّهُ عَلَيْنَا وَوَقَىٰنَا عَذَابَ ٱلسَّمُومِ",
    "ENGLISH": {
        "TRANSLATION_0": "But Allah was gracious to us and safeguarded us from the punishment of the searing wind.",
        "TRANSLATION_1": "But God has been gracious to us, and has saved us from the torment of scorching wind.\n",
        "TRANSLATION_2": "Then Allah graced us with His favour and saved us from the chastisement of the scorching wind.\n",
        "TRANSLATION_3": "But God has granted us favors and saved us from the scorching heat of the torment.\n",
        "TRANSLATION_4": "“So Allah did us a great favour, and saved us from the punishment of the flame.”\n",
        "TRANSLATION_5": "So Allah has been gracious to us, and has saved us from the torment of the Fire.\"\n",
        "TRANSLATION_6": "But Allah has been gracious to us and He has saved us from the punishment of the hot wind:\n",
        "TRANSLATION_7": "and God was gracious to us, and guarded us against the chastisement of the burning wind;\n",
        "TRANSLATION_8": "But Allah hath been gracious unto us and hath preserved us from the torment of the breath of Fire.\n",
        "TRANSLATION_9": "God has been gracious to us and has saved us from the torment of Hell's intense heat --\n",
        "TRANSLATION_10": "Wherefore Allah hath obliged us, and hath protected us from the torment of the Scorch.\n",
        "TRANSLATION_11": "But Allah showed us favour and He saved us from the punishment of the [infernal] miasma.\n",
        "TRANSLATION_12": "But Allah has been good to us, and has delivered us from the Penalty of the Scorching Wind.\n",
        "TRANSLATION_13": "But Allah has been gracious to us, and has saved us from the torment of the Fire.\n",
        "TRANSLATION_14": "but Allah has been gracious to us and has protected us from the punishment of the burning wind.\n",
        "TRANSLATION_15": "But God blessed us, and spared us the agony of the Fiery Winds.\n",
        "TRANSLATION_16": "So Allah conferred favor upon us and protected us from the punishment of the Scorching Fire.\n",
        "TRANSLATION_17": "[52:27] but God showed us favour, through [His] forgiveness, and shielded us from the piercing chastisement (al-   samūm), the Fire, so called because it penetrates the pores (al-masāmm); and they say, also by way of intimation:\n",
        "TRANSLATION_18": "(But Allah hath been gracious unto us) with forgiveness, mercy and entry into the Garden (and hath preserved us from) and has driven away from us (the torment of the breath of Fire) the chastisement of the Fire.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "52:27",
            "88:24",
            "40:45",
            "4:147",
            "16:88",
            "67:28",
            "39:66",
            "45:8",
            "53:62",
            "9:90"
        ],
        "BIBLE": [
            "writings:daniel:3:15",
            "writings:job:10:12",
            "prophets:malachi:1:9",
            "prophets:ezekiel:37:9",
            "torah:genesis:14:20",
            "writings:nehemiah:9:27",
            "torah:genesis:26:29",
            "writings:ii%20chronicles:30:7",
            "writings:daniel:3:17",
            "torah:genesis:45:7"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:14",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:3:8",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:3:4"
        ]
    }
}