{
    "VERSE": "52:29",
    "ARABIC": "فَذَكِّرْ فَمَآ أَنتَ بِنِعْمَتِ رَبِّكَ بِكَاهِنٍ وَلَا مَجْنُونٍ",
    "ENGLISH": {
        "TRANSLATION_0": "Remind them then! For, by the blessing of your Lord, you are neither a soothsayer nor a madman.",
        "TRANSLATION_1": "Remind them, therefore, that by the grace of your Lord you are neither a soothsayer nor possessed.\n",
        "TRANSLATION_2": "So exhort (them, O Prophet), for by your Lord's Grace, you are neither a soothsayer nor a madman.\n",
        "TRANSLATION_3": "(Muhammad), remind them, by the Grace of your Lord, that you are neither a soothsayer or an insane person.\n",
        "TRANSLATION_4": "Therefore (O dear Prophet Mohammed – peace and blessings be upon him), enlighten, for by the munificence of your Lord, you are neither a soothsayer nor a madman.\n",
        "TRANSLATION_5": "Therefore, remind. By the grace of Allah, you are neither a Kahin nor a madman.\n",
        "TRANSLATION_6": "Therefore continue to remind, for by the grace of your Lord, you are not a soothsayer, or a madman.\n",
        "TRANSLATION_7": "Therefore remind! by thy Lord's blessing thou art not a soothsayer neither possessed.\n",
        "TRANSLATION_8": "Therefor warn (men, O Muhammad). By the grace of Allah thou art neither soothsayer nor madman.\n",
        "TRANSLATION_9": "Therefore continue to give warning, for by the grace of your Lord, you are not a soothsayer or a madman.\n",
        "TRANSLATION_10": "Wherefore admonish thou! thou art not, by the grace of thy Lord, a soothsayer or a madman.\n",
        "TRANSLATION_11": "So admonish. By your Lord’s blessing, you are not a soothsayer, nor mad.\n",
        "TRANSLATION_12": "Therefore proclaim thou the praises (of thy Lord): for by the Grace of thy Lord, thou art no (vulgar) soothsayer, nor art thou one possessed.\n",
        "TRANSLATION_13": "Therefore, remind and preach (mankind, O Muhammad SAW of Islamic Monotheism). By the Grace of Allah, you are neither a soothsayer, nor a madman.\n",
        "TRANSLATION_14": "Therefore, remind. By the Favor of Allah, you are neither a soothsayer, nor mad.\n",
        "TRANSLATION_15": "So remind. By the grace of your Lord, you are neither a soothsayer, nor a madman.\n",
        "TRANSLATION_16": "So remind [O Muhammad], for you are not, by the favor of your Lord, a soothsayer or a madman.\n",
        "TRANSLATION_17": "[52:29] So remind, persist in reminding the idolaters and do not desist [from this] even if they say to you that you are a soothsayer or a madman. For by the grace of your Lord, by His bestowal of grace on you, you are neither soothsayer (bi-kāhinin is the predicate of mā) nor madman (wa-lā majnūnin, a supplement to it).\n",
        "TRANSLATION_18": "(Therefore warn) therefore, admonish by means of the Qur'an, Muhammad. (By the grace of Allah) prophethood and Islam (thou art neither soothsayer) foretelling the future (nor madman) bewitched.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "52:29",
            "93:11",
            "68:2",
            "108:2",
            "93:3",
            "37:57",
            "23:59",
            "79:19",
            "94:8",
            "74:7"
        ],
        "BIBLE": [
            "writings:psalms:45:3",
            "prophets:ezekiel:11:4",
            "prophets:ii%20samuel:7:29",
            "prophets:jeremiah:11:21",
            "writings:daniel:10:19",
            "prophets:ezekiel:21:33",
            "writings:proverbs:3:4",
            "prophets:ezekiel:39:1",
            "torah:deuteronomy:33:23",
            "writings:i%20chronicles:17:27"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:4:9"
        ]
    }
}