{
    "VERSE": "52:30",
    "ARABIC": "أَمْ يَقُولُونَ شَاعِرٌ نَّتَرَبَّصُ بِهِۦ رَيْبَ ٱلْمَنُونِ",
    "ENGLISH": {
        "TRANSLATION_0": "Or do they say, 'He is a poet and We are waiting for something bad to happen to him'?",
        "TRANSLATION_1": "Do they say: \"He is a poet for whom we expect an adverse turn of fortune?\"\n",
        "TRANSLATION_2": "Or do they say: “He is a poet for whom we await an adverse turn of fortune.”\n",
        "TRANSLATION_3": "Do they say, \"He is only a poet and we are waiting to see him die!?\"\n",
        "TRANSLATION_4": "Or they allege, “He is a poet – we await a calamity of the times to befall him.”\n",
        "TRANSLATION_5": "Or do they say: \"A poet! We await for him some calamity by time!\"\n",
        "TRANSLATION_6": "Or do they say: A poet, we wait for him the evil accidents of time.\n",
        "TRANSLATION_7": "Or do they say, 'He is a poet for whom we await Fate's uncertainty'?\n",
        "TRANSLATION_8": "Or say they: (he is) a poet, (one) for whom we may expect the accident of time?\n",
        "TRANSLATION_9": "If they say, \"He is but a poet; we are waiting for some misfortune to befall him,\"\n",
        "TRANSLATION_10": "Or say they: a poet for whom we wait some adverse turn of fortune!\n",
        "TRANSLATION_11": "Do they say, ‘[He is] a poet, for whom we await a fatal accident’?\n",
        "TRANSLATION_12": "Or do they say:- \"A Poet! we await for him some calamity (hatched) by Time!\"\n",
        "TRANSLATION_13": "Or do they say: \"(Muhammad SAW is) a poet! We await for him some calamity by time!\n",
        "TRANSLATION_14": "Or do they say: 'He is a poet, we are waiting for some misfortune to befall him'\n",
        "TRANSLATION_15": "Or do they say, “A poet—we await for him a calamity of time”?\n",
        "TRANSLATION_16": "Or do they say [of you], \"A poet for whom we await a misfortune of time?\"\n",
        "TRANSLATION_17": "[52:30] Or (am means bal) do they say, that he is: ‘A poet, for whom we may await the accidents of fate?’, the vicissitudes of time, so that he will just die like other poets.\n",
        "TRANSLATION_18": "(Or say they) in fact, the disbelievers of Mecca-Abu Jahl, al-Walid Ibn al-Mughirah and their hosts-say: ((he is) a poet) who invents things, ((one) for whom we may expect the accident of time) we wait to see him suffer the pangs of death?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "52:30",
            "26:224",
            "37:93",
            "52:35",
            "21:27",
            "83:28",
            "68:47",
            "52:41",
            "37:36",
            "40:59"
        ],
        "BIBLE": [
            "prophets:i%20samuel:14:7",
            "prophets:ii%20kings:17:13",
            "prophets:ii%20kings:9:19",
            "prophets:judges:9:54",
            "writings:psalms:119:132",
            "prophets:i%20kings:2:42",
            "torah:leviticus:16:2",
            "prophets:amos:9:10",
            "prophets:ii%20kings:9:18",
            "torah:deuteronomy:3:23"
        ]
    }
}