{
    "VERSE": "52:31",
    "ARABIC": "قُلْ تَرَبَّصُوا۟ فَإِنِّى مَعَكُم مِّنَ ٱلْمُتَرَبِّصِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Say: 'Wait then! I am waiting with you.'",
        "TRANSLATION_1": "Tell them: \"Keep on expecting, I am expecting with you.\"\n",
        "TRANSLATION_2": "Tell them: “Wait; I too am waiting with you.”\n",
        "TRANSLATION_3": "Say, \"Wait, I too am waiting with you\".\n",
        "TRANSLATION_4": "Proclaim, “Go on waiting – I too am waiting along with you.”\n",
        "TRANSLATION_5": "Say: \"Wait! I am with you among those who wait!\"\n",
        "TRANSLATION_6": "Say: Wait, for surely I too with you am of those who wait.\n",
        "TRANSLATION_7": "Say: 'Await! I shall be awaiting with you.'\n",
        "TRANSLATION_8": "Say (unto them): Except (your fill)! Lo! I am with you among the expectant.\n",
        "TRANSLATION_9": "say [to them], \"Wait then: I too am waiting along with you!\" --\n",
        "TRANSLATION_10": "Say thou: waits verily I am, with you, among the waiters.\n",
        "TRANSLATION_11": "Say, ‘Wait! I too am waiting along with you.’\n",
        "TRANSLATION_12": "Say thou: \"Await ye!- I too will wait along with you!\"\n",
        "TRANSLATION_13": "Say (O Muhammad SAW to them): \"Wait! I am with you, among the waiters!\"\n",
        "TRANSLATION_14": "Say: 'Wait if you will; I shall be waiting with you'\n",
        "TRANSLATION_15": "Say, “Go on waiting; I will be waiting with you.”\n",
        "TRANSLATION_16": "Say, \"Wait, for indeed I am, with you, among the waiters.\"\n",
        "TRANSLATION_17": "[52:31] Say: ‘Await!, my death. For I too will be with you awaiting’, your death. They were then chastised with [death by] the sword on the day of Badr.\n",
        "TRANSLATION_18": "(Say) Muhammad, to Abu Jahl, al-Walid Ibn al-Mughirah and their hosts: (Expect (your fill)) wait for my death! (Lo! I am with you among the expectant) I will also wait for your chastisement; and they were indeed punished on the Day of Badr.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "52:31",
            "38:80",
            "15:37",
            "7:15",
            "37:32",
            "26:185",
            "26:153",
            "44:31",
            "37:141",
            "26:168"
        ],
        "BIBLE": [
            "prophets:judges:6:16",
            "prophets:zechariah:1:9",
            "writings:ezra:9:10",
            "prophets:isaiah:49:3",
            "prophets:ezekiel:37:18",
            "writings:ruth:4:4",
            "writings:i%20chronicles:19:12",
            "prophets:jeremiah:21:13",
            "torah:genesis:21:30",
            "writings:ruth:3:5"
        ]
    }
}