{
    "VERSE": "52:32",
    "ARABIC": "أَمْ تَأْمُرُهُمْ أَحْلَٰمُهُم بِهَٰذَآ أَمْ هُمْ قَوْمٌ طَاغُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Is it their intellects that direct them to say this or is it that they are an unbridled people?",
        "TRANSLATION_1": "Does their reasoning prompt them to this, or they are a people rebellious?\n",
        "TRANSLATION_2": "Do their minds prompt them to say such things, or are they a people immersed in transgression?”\n",
        "TRANSLATION_3": "Does their reason tell them to say this or is it because they are a rebellious people?\n",
        "TRANSLATION_4": "Is this what their senses tell them, or are they a rebellious people?\n",
        "TRANSLATION_5": "Or do their minds command them this or are they people transgressing all bounds\n",
        "TRANSLATION_6": "Nay! do their understandings bid them this? Or are they an inordinate people?\n",
        "TRANSLATION_7": "Or do their intellects bid them do this? Or are they an insolent people?\n",
        "TRANSLATION_8": "Do their minds command them to do this, or are they an outrageous folk?\n",
        "TRANSLATION_9": "is it their minds that prompt them [to say] this, or are they merely insolent people?\n",
        "TRANSLATION_10": "Enjoin them their understandings to this? or are they a people conumacious?\n",
        "TRANSLATION_11": "Is it their intellect which prompts them to [say] this, or are they a rebellious lot?\n",
        "TRANSLATION_12": "Is it that their faculties of understanding urge them to this, or are they but a people transgressing beyond bounds?\n",
        "TRANSLATION_13": "Do their minds command them this [i.e. to tell a lie against you (Muhammad SAW)] or are they people exceeding the bounds (i.e. from Belief in Allah to disbelief).\n",
        "TRANSLATION_14": "Or, do their intellects order them to do this? Or, are they an insolent people?\n",
        "TRANSLATION_15": "Or is it that their dreams compel them to this? Or are they aggressive people?\n",
        "TRANSLATION_16": "Or do their minds command them to [say] this, or are they a transgressing people?\n",
        "TRANSLATION_17": "[52:32] Or do their faculties of understanding prompt them to [say] this?, their saying to him: [you are either] a sorcerer, a poet, a soothsayer or a madman, in other words, they do not [in reality] prompt them to [say] this. Or (am, [in effect] means bal, ‘rather’) are they a rebellious lot?, because of their obstinacy.\n",
        "TRANSLATION_18": "(Do their minds command them to do this) denial, abuse and harm of Muhammad (pbuh). This was said as an attack against them, (or are they) they are indeed (an outrageous folk) disbelievers and arrogant folk with regard to transgressing against Allah?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "52:32",
            "51:53",
            "15:58",
            "51:25",
            "51:32",
            "43:54",
            "10:86",
            "5:102",
            "51:46",
            "23:46"
        ],
        "BIBLE": [
            "prophets:ezekiel:24:19",
            "prophets:jeremiah:23:32",
            "writings:proverbs:28:2",
            "writings:job:37:19",
            "torah:leviticus:8:5",
            "torah:leviticus:4:2",
            "prophets:jeremiah:2:8",
            "prophets:i%20samuel:2:23",
            "torah:deuteronomy:4:6",
            "prophets:isaiah:6:9"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:1:2"
        ]
    }
}