{
    "VERSE": "52:34",
    "ARABIC": "فَلْيَأْتُوا۟ بِحَدِيثٍ مِّثْلِهِۦٓ إِن كَانُوا۟ صَٰدِقِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Let them produce a discourse like it if they are telling the truth.",
        "TRANSLATION_1": "So let them bring a discourse like it, if they are truthful\n",
        "TRANSLATION_2": "(If they are truthful in this), then let them produce a discourse of similar splendour.\n",
        "TRANSLATION_3": "Let them produce a discourse like it if they are true in their claim.\n",
        "TRANSLATION_4": "So let them bring a single discourse like it, if they are truthful.\n",
        "TRANSLATION_5": "Let them then produce a recitation like unto it if they are truthful.\n",
        "TRANSLATION_6": "Then let them bring an announcement like it if they are truthful.\n",
        "TRANSLATION_7": "Then let them bring a discourse like it, if they speak truly.\n",
        "TRANSLATION_8": "Then let them produce speech the like thereof, if they are truthful.\n",
        "TRANSLATION_9": "Let them produce a scripture like it, if what they say is true.\n",
        "TRANSLATION_10": "Let them bring a discourse like thereUnto, if they say sooth.\n",
        "TRANSLATION_11": "Let them bring a discourse like it, if they are truthful.\n",
        "TRANSLATION_12": "Let them then produce a recital like unto it,- If (it be) they speak the truth!\n",
        "TRANSLATION_13": "Let them then produce a recital like unto it (the Quran) if they are truthful.\n",
        "TRANSLATION_14": "Let them produce a phrase like it, if what they say is true!\n",
        "TRANSLATION_15": "So let them produce a discourse like it, if they are truthful.\n",
        "TRANSLATION_16": "Then let them produce a statement like it, if they should be truthful.\n",
        "TRANSLATION_17": "[52:34] Then let them bring a, concocted, discourse like it, if they are truthful, in what they say.\n",
        "TRANSLATION_18": "(Then let them produce speech the like thereof) let them produce a Qur'an like the Qur'an of Muhammad (pbuh) (if they are truthful) that Muhammad has invented the Qur'an:\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "52:34",
            "37:61",
            "77:50",
            "41:13",
            "36:42",
            "10:38",
            "96:17",
            "16:126",
            "51:59",
            "7:194"
        ],
        "BIBLE": [
            "prophets:isaiah:43:9",
            "torah:numbers:15:18",
            "torah:leviticus:23:10",
            "torah:numbers:22:8",
            "writings:job:21:2",
            "prophets:ii%20samuel:19:12",
            "torah:genesis:18:32",
            "prophets:jeremiah:38:4",
            "torah:genesis:44:7",
            "prophets:i%20samuel:9:6"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:10",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:1"
        ]
    }
}