{
    "VERSE": "52:35",
    "ARABIC": "أَمْ خُلِقُوا۟ مِنْ غَيْرِ شَىْءٍ أَمْ هُمُ ٱلْخَٰلِقُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Or were they created out of nothing, or are they the creators?",
        "TRANSLATION_1": "Or were they created of themselves? Or are they the creators?\n",
        "TRANSLATION_2": "Did they come into being without any creator? Or were they their own creators?\n",
        "TRANSLATION_3": "Have they been created from nothing or are they themselves their own creators?\n",
        "TRANSLATION_4": "Have they not been created from some source, or are they themselves the creators?\n",
        "TRANSLATION_5": "Or were they created by nothing Or were they themselves the creators\n",
        "TRANSLATION_6": "Or were they created without there being anything, or are they the creators?\n",
        "TRANSLATION_7": "Or were they created out of nothing? Or are they the creators?\n",
        "TRANSLATION_8": "Or were they created out of naught? Or are they the creators?\n",
        "TRANSLATION_9": "Were they created out of nothing, or are they their own creators?\n",
        "TRANSLATION_10": "Have they not been created by aught, or are they the creators?\n",
        "TRANSLATION_11": "Were they created from nothing? Or are they [their own] creators?\n",
        "TRANSLATION_12": "Were they created of nothing, or were they themselves the creators?\n",
        "TRANSLATION_13": "Were they created by nothing, or were they themselves the creators?\n",
        "TRANSLATION_14": "Or, were they created out of nothing? Or, were they their own creators?\n",
        "TRANSLATION_15": "Or were they created out of nothing? Or are they the creators?\n",
        "TRANSLATION_16": "Or were they created by nothing, or were they the creators [of themselves]?\n",
        "TRANSLATION_17": "[52:35] Or were they created out of nothing?, [that is] without a Creator. Or are they the creators?, of themselves. It makes no sense for a created thing to have no creator, nor can a thing that will cease to existent [have the power to] create. There must be a Creator of them, and that is God, the One, so why do they not affirm His Oneness and believe in His Messenger and His Book?\n",
        "TRANSLATION_18": "(Or were they created out of naught) without a father; and it is also said: without a Lord? (Or are they the creators) rather than being the created?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "52:35",
            "3:128",
            "80:18",
            "41:8",
            "84:25",
            "95:6",
            "51:42",
            "15:19",
            "54:52",
            "1:7"
        ],
        "BIBLE": [
            "torah:genesis:1:1",
            "prophets:jeremiah:2:17",
            "prophets:joshua:22:24",
            "writings:psalms:142:4",
            "prophets:judges:11:7",
            "prophets:isaiah:26:18",
            "prophets:malachi:2:10",
            "prophets:isaiah:44:8",
            "torah:deuteronomy:11:28",
            "writings:daniel:9:13"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:2:2",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:3:3"
        ]
    }
}