{
    "VERSE": "52:37",
    "ARABIC": "أَمْ عِندَهُمْ خَزَآئِنُ رَبِّكَ أَمْ هُمُ ٱلْمُصَۣيْطِرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Or do they possess the treasuries of your Lord or do they have control of them?",
        "TRANSLATION_1": "Do they possess the treasures of your Lord? Or are they the treasurers?\n",
        "TRANSLATION_2": "Or do they have your Lord's treasures in their keeping? Or have absolute authority over them?\n",
        "TRANSLATION_3": "Do they own the treasures of your Lord? Have they any authority over God?\n",
        "TRANSLATION_4": "Or do they have the treasures of your Lord, or are they the authority?\n",
        "TRANSLATION_5": "Or are with them the treasures of your Lord Or are they the tyrants with the authority to do as they like\n",
        "TRANSLATION_6": "Or have they the treasures of your Lord with them? Or have they been set in absolute authority?\n",
        "TRANSLATION_7": "Or are thy Lord's treasuries in their keeping? Or are they the registrars?\n",
        "TRANSLATION_8": "Or do they own the treasures of thy Lord? Or have they been given charge (thereof)?\n",
        "TRANSLATION_9": "Do they own the treasures of your Lord, or have they been given charge of them?\n",
        "TRANSLATION_10": "Are with them the treasures of thy Lord! or are they the dispensers?\n",
        "TRANSLATION_11": "Do they possess the treasuries of your Lord? Or do they control [them]?\n",
        "TRANSLATION_12": "Or are the Treasures of thy Lord with them, or are they the managers (of affairs)?\n",
        "TRANSLATION_13": "Or are with them the treasures of your Lord? Or are they the tyrants with the authority to do as they like?\n",
        "TRANSLATION_14": "Or, are the treasures of your Lord in their keeping? Or, are they the controllers?\n",
        "TRANSLATION_15": "Or do they possess the treasuries of your Lord? Or are they the controllers?\n",
        "TRANSLATION_16": "Or have they the depositories [containing the provision] of your Lord? Or are they the controllers [of them]?\n",
        "TRANSLATION_17": "[52:37]   Or do they possess the treasuries of your Lord?, in the way of prophethood, provision and other matters, so that they are able to assign what they will exclusively to whom they will? Or are they the ones in control?, [or] are they the mighty ones who hold sway? (the verb [from musaytirūna] is saytara, similar [in root form] to baytara, ‘to practice veterinary medicine’, or bayqara, ‘to corrupt’, ‘to ruin’).\n",
        "TRANSLATION_18": "(Or do they own the treasures of thy Lord) or do they possess the stores of your Lord through rain, provision, vegetation and prophethood? (Or have they been given charge (thereof)?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "52:37",
            "38:9",
            "51:34",
            "11:83",
            "43:49",
            "39:34",
            "38:52",
            "68:34",
            "32:12",
            "39:31"
        ],
        "BIBLE": [
            "prophets:jeremiah:47:7",
            "torah:numbers:27:23",
            "torah:numbers:18:8",
            "torah:numbers:31:47",
            "writings:job:34:13",
            "torah:deuteronomy:12:1",
            "prophets:malachi:3:14",
            "torah:deuteronomy:16:17",
            "prophets:judges:11:24",
            "torah:exodus:6:13"
        ]
    }
}