{
    "VERSE": "52:40",
    "ARABIC": "أَمْ تَسْـَٔلُهُمْ أَجْرًا فَهُم مِّن مَّغْرَمٍ مُّثْقَلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Or do you ask them for a wage so they are weighed down with debt?",
        "TRANSLATION_1": "Or do you demand any wages from them so that they are burdened with expense?\n",
        "TRANSLATION_2": "Or is it that you ask of them any recompense so that they should fear to be weighed down under the burden of debt?\n",
        "TRANSLATION_3": "Do you (Muhammad) ask them for any payment (for your preaching) which they cannot afford?\n",
        "TRANSLATION_4": "Or do you (O dear Prophet Mohammed – peace and blessings be upon him) ask any fee from them, so they are burdened with the penalty?\n",
        "TRANSLATION_5": "Or is it that you ask a wage from them so that they are burdened with a load of debt\n",
        "TRANSLATION_6": "Or do you ask them for a reward, so that they are overburdened by a debt?\n",
        "TRANSLATION_7": "Or askest thou them for a wage, and so they are weighed down with debt?\n",
        "TRANSLATION_8": "Or askest thou (Muhammad) a fee from them so that they are plunged in debt?\n",
        "TRANSLATION_9": "Or do you ask them for a reward, so that they are over-burdened by debt?\n",
        "TRANSLATION_10": "Or askest thou a hire from them so that they are with debt laden?\n",
        "TRANSLATION_11": "Do you ask them for a reward, so that they are [wary of] being weighed down with debt?\n",
        "TRANSLATION_12": "Or is it that thou dost ask for a reward, so that they are burdened with a load of debt?-\n",
        "TRANSLATION_13": "Or is it that you (O Muhammad SAW) ask a wage from them (for your preaching of Islamic Monotheism) so that they are burdened with a load of debt?\n",
        "TRANSLATION_14": "Or, do you ask them for a wage, so that they become weighed down in debt?\n",
        "TRANSLATION_15": "Or do you demand a payment from them, and they are burdened by debt?\n",
        "TRANSLATION_16": "Or do you, [O Muhammad], ask of them a payment, so they are by debt burdened down?\n",
        "TRANSLATION_17": "[52:40] Or are you asking them for a fee, a wage in return for what you have brought them in the way of religion, so that they are weighed down with debt?, [with] the liability for this, so that they are unable to submit [to God].\n",
        "TRANSLATION_18": "(Or askest thou) Muhammad (a fee from them) in exchange for their faith (so that they are plunged in debt) so that they are drowned in debt if they accept to give you a fee?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "52:40",
            "68:46",
            "95:6",
            "38:86",
            "41:8",
            "36:21",
            "12:104",
            "84:25",
            "51:45",
            "43:79"
        ],
        "BIBLE": [
            "prophets:jeremiah:23:33",
            "writings:daniel:10:19",
            "prophets:judges:6:23",
            "writings:psalms:40:6",
            "prophets:jeremiah:14:9",
            "writings:psalms:28:1",
            "prophets:isaiah:46:1",
            "writings:lamentations:2:20",
            "writings:ruth:2:12",
            "prophets:ii%20samuel:19:37"
        ]
    }
}