{
    "VERSE": "52:42",
    "ARABIC": "أَمْ يُرِيدُونَ كَيْدًا فَٱلَّذِينَ كَفَرُوا۟ هُمُ ٱلْمَكِيدُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Or do they desire to dupe you? But the duped ones are those who are kafir.",
        "TRANSLATION_1": "Or do they want to stage a deception? -- Then only those who do not believe will be the ones who will be tricked.\n",
        "TRANSLATION_2": "Or are they contriving a stratagem against you? If so, that stratagem will rebound against the unbelievers.\n",
        "TRANSLATION_3": "Do they design evil plans? The disbelievers themselves will be snared by their evil plots.\n",
        "TRANSLATION_4": "Or are they planning a conspiracy? So the conspiracy will befall only upon the disbelievers.\n",
        "TRANSLATION_5": "Or do they intend a plot But those who disbelieve are themselves plotted against!\n",
        "TRANSLATION_6": "Or do they desire a war? But those who disbelieve shall be the vanquished ones in war.\n",
        "TRANSLATION_7": "Or desire they to outwit? The unbelievers, they are the outwitted.\n",
        "TRANSLATION_8": "Or seek they to ensnare (the messenger)? But those who disbelieve, they are the ensnared!\n",
        "TRANSLATION_9": "Do they want to hatch some plot? Those who deny the truth will be the victims of the plot.\n",
        "TRANSLATION_10": "Seek they to lay a plot? Then those who disbelieve it is they who shall be plotted against.\n",
        "TRANSLATION_11": "Do they seek to outmaneuver [Allah]? But it is the faithless who are the outmaneuvered ones!\n",
        "TRANSLATION_12": "Or do they intend a plot (against thee)? But those who defy Allah are themselves involved in a Plot!\n",
        "TRANSLATION_13": "Or do they intend a plot (against you O Muhammad SAW)? But those who disbelieve (in the Oneness of Allah Islamic Monotheism) are themselves in a plot!\n",
        "TRANSLATION_14": "Or, do they desire to outwit? The unbelievers are the outwitted.\n",
        "TRANSLATION_15": "Or are they planning a conspiracy? The conspiracy will befall the disbelievers.\n",
        "TRANSLATION_16": "Or do they intend a plan? But those who disbelieve - they are the object of a plan.\n",
        "TRANSLATION_17": "[52:42] Or do they desire to outmanoeuvre?, you and have you killed, at the Assembly Council. But those who disbelieve, they are the outmanoeuvred ones!, the vanquished and the ones destroyed. God preserved him from them and then destroyed them at Badr.\n",
        "TRANSLATION_18": "(Or seek they) indeed they seek (to ensnare (the messenger)) to kill you, Muhammad? (But those who disbelieve) the disbelievers of Mecca: Abu Jahl and his host who planned to kill the Prophet (pbuh) (they are the ensnared!) they are the ones who will be killed on the Day of Badr!\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "52:42",
            "37:98",
            "21:70",
            "20:60",
            "86:15",
            "86:16",
            "20:64",
            "37:116",
            "77:39",
            "105:2"
        ],
        "BIBLE": [
            "writings:daniel:6:13",
            "prophets:ezekiel:3:20",
            "prophets:ii%20kings:4:28",
            "prophets:isaiah:41:12",
            "prophets:ezekiel:42:13",
            "prophets:jeremiah:5:3",
            "prophets:ii%20kings:17:4",
            "writings:psalms:140:9",
            "writings:ii%20chronicles:20:20",
            "prophets:nahum:3:7"
        ]
    }
}