{
    "VERSE": "52:7",
    "ARABIC": "إِنَّ عَذَابَ رَبِّكَ لَوَٰقِعٌ",
    "ENGLISH": {
        "TRANSLATION_0": "your Lord's punishment will certainly take place.",
        "TRANSLATION_1": "The punishment of your Lord is certain to come.\n",
        "TRANSLATION_2": "verily your Lord's chastisement shall come to pass,\n",
        "TRANSLATION_3": "the torment of your Lord will inevitably take place\n",
        "TRANSLATION_4": "Indeed your Lord’s punishment will surely take place.\n",
        "TRANSLATION_5": "Verily, the torment of your Lord will surely come to pass.\n",
        "TRANSLATION_6": "Most surely the punishment of your Lord will come to pass;\n",
        "TRANSLATION_7": "surely thy Lord's chastisement is about to fall;\n",
        "TRANSLATION_8": "Lo! the doom of thy Lord will surely come to pass;\n",
        "TRANSLATION_9": "the punishment of your Lord shall certainly come to pass,\n",
        "TRANSLATION_10": "Verily the torment of thine Lord is sure to befalls\n",
        "TRANSLATION_11": "indeed your Lord’s punishment will surely befall.\n",
        "TRANSLATION_12": "Verily, the Doom of thy Lord will indeed come to pass;-\n",
        "TRANSLATION_13": "Verily, the Torment of your Lord will surely come to pass,\n",
        "TRANSLATION_14": "surely, the punishment of your Lord is about to come,\n",
        "TRANSLATION_15": "The punishment of your Lord is coming.\n",
        "TRANSLATION_16": "Indeed, the punishment of your Lord will occur.\n",
        "TRANSLATION_17": "[52:7] lo! your Lord’s chastisement will assuredly take place, it will assuredly come down on those who deserve it;\n",
        "TRANSLATION_18": "(Lo! the doom of thy Lord) on the Day of Judgement (will surely come to pass) will surely take place in relation to Quraysh;\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "52:7",
            "44:12",
            "70:28",
            "14:7",
            "70:27",
            "21:46",
            "85:12",
            "89:14",
            "43:14",
            "29:54"
        ],
        "BIBLE": [
            "prophets:zechariah:8:20",
            "prophets:ezekiel:38:18",
            "prophets:zechariah:12:9",
            "prophets:zechariah:6:15",
            "torah:numbers:33:56",
            "prophets:isaiah:7:7",
            "prophets:isaiah:66:23",
            "prophets:hosea:2:23",
            "prophets:isaiah:44:7",
            "torah:exodus:12:25"
        ]
    }
}