{
    "VERSE": "52:9",
    "ARABIC": "يَوْمَ تَمُورُ ٱلسَّمَآءُ مَوْرًا",
    "ENGLISH": {
        "TRANSLATION_0": "On the Day when heaven sways to and fro",
        "TRANSLATION_1": "The day the sky will tremble,\n",
        "TRANSLATION_2": "(It shall come to pass) on the Day when the heaven will convulse in a great convulsion,\n",
        "TRANSLATION_3": "On the day when the heavens will swiftly fly\n",
        "TRANSLATION_4": "A day on which the heavens will shake with a visible shaking.\n",
        "TRANSLATION_5": "On the Day when Tamur the heaven Mawr,\n",
        "TRANSLATION_6": "On the day when the heaven shall move from side to side\n",
        "TRANSLATION_7": "Upon the day when heaven spins dizzily\n",
        "TRANSLATION_8": "On the day when the heaven will heave with (awful) heaving,\n",
        "TRANSLATION_9": "on the Day when the skies are convulsed,\n",
        "TRANSLATION_10": "On the Day whereon the heaven will shake with an awful shaking.\n",
        "TRANSLATION_11": "On the day when the sky whirls violently,\n",
        "TRANSLATION_12": "On the Day when the firmament will be in dreadful commotion.\n",
        "TRANSLATION_13": "On the Day when the heaven will shake with a dreadful shaking,\n",
        "TRANSLATION_14": "Upon the Day when the heaven spins dizzily\n",
        "TRANSLATION_15": "On the Day when the heaven sways in agitation.\n",
        "TRANSLATION_16": "On the Day the heaven will sway with circular motion\n",
        "TRANSLATION_17": "[52:9] On the day (yawma is operated by la-wāqi‘un, ‘will assuredly take place’) when the heaven will heave with a great heaving, [when it will] move and spin,\n",
        "TRANSLATION_18": "(On the day when the heaven will heave) will rotate (with (awful) heaving) with its inhabitants on like the rotation of a millstone, and created beings will surge on each other because of the terror they see.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "52:9",
            "70:8",
            "79:6",
            "44:10",
            "86:9",
            "82:1",
            "84:1",
            "25:25",
            "81:11",
            "77:9"
        ],
        "BIBLE": [
            "prophets:hosea:2:23",
            "prophets:isaiah:22:20",
            "prophets:isaiah:65:24",
            "prophets:zechariah:13:4",
            "prophets:zechariah:12:9",
            "prophets:isaiah:24:21",
            "torah:exodus:22:26",
            "prophets:isaiah:17:4",
            "prophets:zechariah:14:6",
            "torah:numbers:33:56"
        ]
    }
}