{
    "VERSE": "80:2",
    "ARABIC": "أَن جَآءَهُ ٱلْأَعْمَىٰ",
    "ENGLISH": {
        "TRANSLATION_0": "because the blind man came to him.",
        "TRANSLATION_1": "Because a blind man came to him.\n",
        "TRANSLATION_2": "that the blind man came to him.\n",
        "TRANSLATION_3": "from a blind man who had come up to him.\n",
        "TRANSLATION_4": "Because the blind man had come in his august presence.\n",
        "TRANSLATION_5": "Because there came to him the blind man.\n",
        "TRANSLATION_6": "Because there came to him the blind man.\n",
        "TRANSLATION_7": "that the blind man came to him.\n",
        "TRANSLATION_8": "Because the blind man came unto him.\n",
        "TRANSLATION_9": "when the blind man approached him,\n",
        "TRANSLATION_10": "Because there came Unto him a blind man.\n",
        "TRANSLATION_11": "when the blind man approached him.\n",
        "TRANSLATION_12": "Because there came to him the blind man (interrupting).\n",
        "TRANSLATION_13": "Because there came to him the blind man (i.e. 'Abdullah bin Umm-Maktum, who came to the Prophet (Peace be upon him) while he was preaching to one or some of the Quraish chiefs).\n",
        "TRANSLATION_14": "when the blind came to him.\n",
        "TRANSLATION_15": "When the blind man approached him.\n",
        "TRANSLATION_16": "Because there came to him the blind man, [interrupting].\n",
        "TRANSLATION_17": "[80:2] because the blind man came to him: ‘Abd Allāh son of Umm Maktūm, who interrupted him while he was busy with those notables of Quryash whose submission [to God] he was very eager for. The blind man was not aware that he was busy with these and so he called out to him, ‘Teach me of what God has taught you’. However, the Prophet (s) went off to his house. He was then reproached for this with what was revealed in this sūra. Afterwards, whenever he came to him, the Prophet would say to him, ‘Greetings to him on whose account God reproached me!’, and would lay down his cloak for him.\n",
        "TRANSLATION_18": "(Because the blind man came unto him) when 'Abdullah Ibn Umm Maktum came to him. His real name is 'Abdullah Ibn Shurayh. Umm Maktum was his father's mother. What happened is that the Prophet (pbuh) was sitting with a group of men among the nobles of Quraysh, among whom were his uncle al-'Abbas Ibn 'Abd al-Muttalib, Umayyah Ibn Khalaf al-Jumahi and Safwan Ibn Umayyah, who were at that time disbelievers. The Prophet (pbuh) was admonishing and inviting them to Islam when Ibn Maktum came to him and said: \"O Messenger of Allah! Teach me of that which Allah has taught you\". The Prophet (pbuh) turned his face from him because he was busy with these people. When this happened Allah revealed: he frowned and turned away because the blind man came unto him.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "80:2",
            "83:21",
            "35:19",
            "96:7",
            "10:43",
            "43:40",
            "79:7",
            "102:1",
            "68:49",
            "40:58"
        ],
        "BIBLE": [
            "prophets:i%20kings:12:22",
            "prophets:isaiah:39:3",
            "prophets:ii%20kings:20:14",
            "torah:leviticus:21:18",
            "prophets:ezekiel:1:5",
            "prophets:ii%20kings:1:7",
            "torah:exodus:21:13",
            "prophets:judges:8:9",
            "prophets:i%20kings:13:25",
            "prophets:ii%20kings:6:20"
        ]
    }
}