{
    "VERSE": "80:23",
    "ARABIC": "كَلَّا لَمَّا يَقْضِ مَآ أَمَرَهُۥ",
    "ENGLISH": {
        "TRANSLATION_0": "No indeed! He has not done what He ordered him.",
        "TRANSLATION_1": "But no. He has not fulfilled what was enjoined on him.\n",
        "TRANSLATION_2": "Nay, but man did not fulfil what Allah had enjoined upon him.\n",
        "TRANSLATION_3": "Certainly, he has not duly fulfilled His commands.\n",
        "TRANSLATION_4": "Not one – he has not yet completed what he was commanded.\n",
        "TRANSLATION_5": "Nay, but has not done what He commanded him.\n",
        "TRANSLATION_6": "Nay; but he has not done what He bade him.\n",
        "TRANSLATION_7": "No indeed! Man has not accomplished His bidding.\n",
        "TRANSLATION_8": "Nay, but (man) hath not done what He commanded him.\n",
        "TRANSLATION_9": "Yet man declines to do His bidding.\n",
        "TRANSLATION_10": "By no means He performed not that which He had commanded him.\n",
        "TRANSLATION_11": "No indeed! He has not yet carried out what He has commanded him.\n",
        "TRANSLATION_12": "By no means hath he fulfilled what Allah hath commanded him.\n",
        "TRANSLATION_13": "Nay, but (man) has not done what He commanded him.\n",
        "TRANSLATION_14": "Indeed, he has not fulfilled that which He has ordered him.\n",
        "TRANSLATION_15": "But no, he did not fulfill what He has commanded him.\n",
        "TRANSLATION_16": "No! Man has not yet accomplished what He commanded him.\n",
        "TRANSLATION_17": "[80:23] No indeed! Verily, he has not accomplished, he has not done, what He, his Lord, commanded him, to [do].\n",
        "TRANSLATION_18": "(Nay) truly, O Muhammad, (but (man) hath not done what He commanded him) of profession of Allah's divine Oneness and other things.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "80:23",
            "69:26",
            "109:2",
            "26:207",
            "70:39",
            "109:5",
            "96:19",
            "69:39",
            "109:3",
            "5:79"
        ],
        "BIBLE": [
            "prophets:ezekiel:37:1",
            "torah:genesis:44:1",
            "writings:psalms:106:46",
            "writings:job:10:19",
            "prophets:ezekiel:12:7",
            "prophets:jeremiah:40:7",
            "prophets:amos:4:10",
            "writings:job:5:13",
            "writings:lamentations:4:22",
            "prophets:i%20kings:8:46"
        ]
    }
}