{
    "VERSE": "71:12",
    "ARABIC": "وَيُمْدِدْكُم بِأَمْوَٰلٍ وَبَنِينَ وَيَجْعَل لَّكُمْ جَنَّٰتٍ وَيَجْعَل لَّكُمْ أَنْهَٰرًا",
    "ENGLISH": {
        "TRANSLATION_0": "and reinforce you with more wealth and sons, and grant you gardens and grant you waterways.",
        "TRANSLATION_1": "And will give you increase of wealth and sons, and give you gardens and springs of water.\n",
        "TRANSLATION_2": "and will provide you with wealth and children, and will bestow upon you gardens and rivers.\n",
        "TRANSLATION_3": "rain from the sky,\n",
        "TRANSLATION_4": "‘And will aid you with wealth and sons, and will create gardens for you and cause rivers to flow for you.’\n",
        "TRANSLATION_5": "And give you increase in wealth and children, and bestow on you gardens and bestow on you rivers.\n",
        "TRANSLATION_6": "And help you with wealth and sons, and make for you gardens, and make for you rivers.\n",
        "TRANSLATION_7": "and will succour you with wealth and sons, and will appoint for you gardens, and will appoint for you rivers.\n",
        "TRANSLATION_8": "And will help you with wealth and sons, and will assign unto you Gardens and will assign unto you rivers.\n",
        "TRANSLATION_9": "increase your wealth and sons; and grant you gardens and waterways.\n",
        "TRANSLATION_10": "And He will add Unto you riches and children and will appoint Unto you gardens and will appoint Unto you rivers.\n",
        "TRANSLATION_11": "and aid you with wealth and sons, and provide you with gardens and provide you with streams.\n",
        "TRANSLATION_12": "Give you increase in wealth and sons; and bestow on you gardens and bestow on you rivers (of flowing water).\n",
        "TRANSLATION_13": "And give you increase in wealth and children, and bestow on you gardens and bestow on you rivers.\"\n",
        "TRANSLATION_14": "and give to you wealth and sons, and provide you with gardens and rivers.\n",
        "TRANSLATION_15": "And provide you with wealth and children, and allot for you gardens, and allot for you rivers.\n",
        "TRANSLATION_16": "And give you increase in wealth and children and provide for you gardens and provide for you rivers.\n",
        "TRANSLATION_17": "[71:12] and furnish you with wealth and sons, and assign to you gardens, orchards, and assign to you, running, rivers.\n",
        "TRANSLATION_18": "(And will help you with wealth) camels, bovines, sheep (and sons) and daughters; this is because Allah had stopped their wives and beasts from conceiving for 40 years, (and will assign unto you Gardens and will assign unto you rivers) flowing rivers for your own benefits. This is because Allah had, before this, destroyed their fields and made their rivers dry for 40 years.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "71:12",
            "68:14",
            "23:55",
            "26:88",
            "17:6",
            "74:12",
            "54:54",
            "26:133",
            "17:91",
            "43:16"
        ],
        "BIBLE": [
            "writings:psalms:108:13",
            "writings:psalms:60:13",
            "torah:numbers:3:9",
            "torah:exodus:17:2",
            "prophets:jeremiah:10:13",
            "torah:numbers:18:19",
            "torah:genesis:33:13",
            "prophets:jeremiah:51:16",
            "torah:numbers:18:8",
            "prophets:joshua:15:19"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:3:7",
            
            "Sefer%20Yetzirah:3:4",
            "Sefer%20Yetzirah:1:12",
            "Sefer%20Yetzirah:2:5"
        ]
    }
}