{
    "VERSE": "71:16",
    "ARABIC": "وَجَعَلَ ٱلْقَمَرَ فِيهِنَّ نُورًا وَجَعَلَ ٱلشَّمْسَ سِرَاجًا",
    "ENGLISH": {
        "TRANSLATION_0": "and placed the moon as a light in them and made the sun a blazing lamp?",
        "TRANSLATION_1": "And has placed the moon therein, an illumination, and has placed the sun, a lighted lamp?\n",
        "TRANSLATION_2": "and has placed the moon in them as a light, and the sun as a radiant lamp?\n",
        "TRANSLATION_3": "and placed therein the moon as a light\n",
        "TRANSLATION_4": "‘And in them, has illuminated the moon, and made the sun a lamp?’\n",
        "TRANSLATION_5": "And has made the moon a light therein, and made the sun a lamp\n",
        "TRANSLATION_6": "And made the moon therein a light, and made the sun a lamp?\n",
        "TRANSLATION_7": "and set the moon therein for a light and the sun for a lamp?\n",
        "TRANSLATION_8": "And hath made the moon a light therein, and made the sun a lamp?\n",
        "TRANSLATION_9": "and made the moon therein a light, and made the sun a lamp,\n",
        "TRANSLATION_10": "And hath placed the moon therein for a light, and hath made the sun a lamp?\n",
        "TRANSLATION_11": "and has made therein the moon for a light and the sun for a lamp?\n",
        "TRANSLATION_12": "And made the moon a light in their midst, and made the sun as a (Glorious) Lamp?\n",
        "TRANSLATION_13": "And has made the moon a light therein, and made the sun a lamp?\n",
        "TRANSLATION_14": "setting in them the moon as a light and the sun as a lantern?\n",
        "TRANSLATION_15": "And He set the moon in their midst for light, and He made the sun a lamp.\n",
        "TRANSLATION_16": "And made the moon therein a [reflected] light and made the sun a burning lamp?\n",
        "TRANSLATION_17": "[71:16] and made the moon therein — that is to say, within their totality, [but] which is [effectively] true in the case of the heaven of this world — as a light and made the sun as a lamp?, as an illuminating lantern, more powerful than the light of the moon.\n",
        "TRANSLATION_18": "(And hath made the moon) along with them (a light therein) a shining light therein, (and made the sun a lamp) a radiance for the children of Adam?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "71:16",
            "75:9",
            "25:61",
            "14:33",
            "55:5",
            "75:8",
            "91:2",
            "84:18",
            "55:15",
            "21:33"
        ],
        "BIBLE": [
            "writings:psalms:90:8",
            "writings:psalms:148:3",
            "prophets:habakkuk:3:11",
            "writings:ecclesiastes:12:2",
            "writings:psalms:36:10",
            "prophets:isaiah:60:20",
            "prophets:isaiah:13:10",
            "prophets:ezekiel:32:8",
            "prophets:isaiah:60:19",
            "prophets:isaiah:42:6"
        ]
    }
}