{
    "VERSE": "71:18",
    "ARABIC": "ثُمَّ يُعِيدُكُمْ فِيهَا وَيُخْرِجُكُمْ إِخْرَاجًا",
    "ENGLISH": {
        "TRANSLATION_0": "then will return you to it and bring you out again.",
        "TRANSLATION_1": "He will then return you back to it, and bring you out again.\n",
        "TRANSLATION_2": "and He will later cause you to return to it and will then again bring you out of it.\n",
        "TRANSLATION_3": "God made you grow from the earth. He will make you return to it and then take you out of it again.\n",
        "TRANSLATION_4": "‘And He will then take you back to it, and again remove you from it.”\n",
        "TRANSLATION_5": "Afterwards He will return you into it (the earth), and bring you forth.\n",
        "TRANSLATION_6": "Then He returns you to it, then will He bring you forth a (new) bringing forth:\n",
        "TRANSLATION_7": "then He shall return you into it, and bring you forth.\n",
        "TRANSLATION_8": "And afterward He maketh you return thereto, and He will bring you forth again, a (new) forthbringing.\n",
        "TRANSLATION_9": "how He will then return you to it and bring you forth again,\n",
        "TRANSLATION_10": "And thereafter He will cause you to return thereinto, and He will bring you forth a forthbringing.\n",
        "TRANSLATION_11": "Then He makes you return to it, and He will bring you forth [without fail].\n",
        "TRANSLATION_12": "And in the End He will return you into the (earth), and raise you forth (again at the Resurrection)?\n",
        "TRANSLATION_13": "Afterwards He will return you into it (the earth), and bring you forth (again on the Day of Resurrection)?\n",
        "TRANSLATION_14": "and to it He will return you. Then, He will bring you forth.\n",
        "TRANSLATION_15": "Then He will return you into it, and will bring you out again.\n",
        "TRANSLATION_16": "Then He will return you into it and extract you [another] extraction.\n",
        "TRANSLATION_17": "[71:18] Then He will make you return into it, entombed [in your graves], and bring you forth, for the resurrection, [with a veritable bringing forth].\n",
        "TRANSLATION_18": "(And afterward He maketh you return thereto) He will burry you in the earth, (and He will bring you forth again) from the graves on the Day of Judgement, (a (new) forthbringing.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "71:18",
            "25:76",
            "7:25",
            "87:13",
            "23:108",
            "19:72",
            "84:4",
            "26:94",
            "44:14",
            "88:11"
        ],
        "BIBLE": [
            "prophets:i%20samuel:2:7",
            "prophets:isaiah:10:23",
            "prophets:ii%20samuel:15:20",
            "prophets:isaiah:49:11",
            "torah:leviticus:23:28",
            "prophets:isaiah:66:22",
            "torah:genesis:35:3",
            "writings:daniel:10:14",
            "prophets:ezekiel:35:14",
            "prophets:isaiah:55:11"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:3:6",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:1:11"
        ]
    }
}