{
    "VERSE": "71:23",
    "ARABIC": "وَقَالُوا۟ لَا تَذَرُنَّ ءَالِهَتَكُمْ وَلَا تَذَرُنَّ وَدًّا وَلَا سُوَاعًا وَلَا يَغُوثَ وَيَعُوقَ وَنَسْرًا",
    "ENGLISH": {
        "TRANSLATION_0": "saying, \"Do not abandon your gods. Do not abandon Wadd or Suwa' or Yaghuth or Ya'uq or Nasr.\"*",
        "TRANSLATION_1": "And said: 'Do not abandon your gods, and do not abandon Wadda or Suwa', or Yaghuth, Ya'uq or Nasr.'\n",
        "TRANSLATION_2": "They said: “Do not abandon your deities; do not abandon Wadd, nor Suwa, nor Yaghuth, nor Yauq, nor Nasr.\n",
        "TRANSLATION_3": "and have said to each other, 'Do not give-up your idols. Do not renounce Wadd, Suwa`, Yaghuth, Ya`uq and Nasr (names of certain idols).\n",
        "TRANSLATION_4": "“And they said, ‘Do not ever abandon your Gods – and never abandon Wadd, or Suwa – or Yaghuth or Yauq or Nasr.’”\n",
        "TRANSLATION_5": "And they have said: `You shall not leave your gods, nor shall you leave Wadd, nor Suwa`, nor Yaghuth, and Ya`uq and Nasr.' \"\n",
        "TRANSLATION_6": "And they say: By no means leave your gods, nor leave Wadd, nor Suwa; nor Yaghus, and Yauq and Nasr.\n",
        "TRANSLATION_7": "and have said, \"Do not leave your gods, and do not leave Wadd, nor Suwa', Yaghuth, Ya'uq, neither Nasr.\"\n",
        "TRANSLATION_8": "And they have said: Forsake not your gods. Forsake not Wadd, nor Suwa', nor Yaghuth and Ya'uq and Nasr.\n",
        "TRANSLATION_9": "and they said [to their followers], \"Do not ever abandon your deities: abandon neither Wadd, nor Suwa', and neither Yaghuth, nor Yauq nor Nasr!\"\n",
        "TRANSLATION_10": "And who have said: ye shall not leave your gods; nor Shall ye leave Wadd nor Suwa', nor Yaghuth, nor Ya'uq nor Nasr.\n",
        "TRANSLATION_11": "They say, ‘‘Do not abandon your gods. Do not abandon Wadd, nor Suwa, nor Yaghuth, Ya‘uq and Nasr,’’\n",
        "TRANSLATION_12": "And they have said (to each other), 'Abandon not your gods: Abandon neither Wadd nor Suwa', neither Yaguth nor Ya'uq, nor Nasr';-\n",
        "TRANSLATION_13": "And they have said: 'You shall not leave your gods, nor shall you leave Wadd, nor Suwa', nor Yaghuth, nor Ya'uq, nor Nasr (names of the idols);\n",
        "TRANSLATION_14": "and said: 'Do not renounce your gods, do not leave waddan or suwa'an or yaghutha, or ya'uqa, or nasra'\n",
        "TRANSLATION_15": "And they said, “Do not give up your gods; do not give up Wadd, nor Souwa, nor Yaghoos, and Yaooq, and Nassr.\n",
        "TRANSLATION_16": "And said, 'Never leave your gods and never leave Wadd or Suwa' or Yaghuth and Ya'uq and Nasr.\n",
        "TRANSLATION_17": "[71:23] and have said, to the riffraff: “Do not abandon your gods, and do not abandon Wadd (read Wadd or Wudd) nor Suwā‘, nor Yaghūth and Ya‘ūq and Nasr” — these being the names of their idols.\n",
        "TRANSLATION_18": "(And they have said) i.e. the chieftains said to the communality of the people: (Forsake not your gods) forsake not the worship of your Lord. (Forsake not Wadd) forsake not the worship of Wadd, (nor Suwa') nor the worship of Suwa', (nor Yaghuth and Ya'uq and Nasr) nor the worship of Yaghuth and Ya'uq and Nasr. These were idols which Noah's folk worshipped.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "71:23",
            "30:6",
            "30:60",
            "21:68",
            "36:74",
            "37:152",
            "29:11",
            "33:70",
            "15:69",
            "16:56"
        ],
        "BIBLE": [
            "prophets:jeremiah:10:11",
            "torah:genesis:42:38",
            "writings:i%20chronicles:17:2",
            "prophets:isaiah:43:6",
            "writings:ezra:9:10",
            "prophets:ii%20kings:17:12",
            "writings:daniel:3:25",
            "writings:ruth:1:16",
            "prophets:joshua:24:16",
            "torah:genesis:24:27"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:1:13",
            "Sefer%20Yetzirah:3:6"
        ]
    }
}