{
    "VERSE": "71:24",
    "ARABIC": "وَقَدْ أَضَلُّوا۟ كَثِيرًا وَلَا تَزِدِ ٱلظَّٰلِمِينَ إِلَّا ضَلَٰلًا",
    "ENGLISH": {
        "TRANSLATION_0": "They have misguided many people. Do not increase the wrongdoers in anything but misguidance!'",
        "TRANSLATION_1": "And they misled many. So do not give the evil-doers increase but in error.\n",
        "TRANSLATION_2": "They have misled many. So do not enable these evildoers to increase in anything except straying (from the Right Way).”\n",
        "TRANSLATION_3": "They have misled many and the unjust will achieve nothing but more error\".\n",
        "TRANSLATION_4": "“And they have misled a large number; and (I pray that) You increase nothing for the unjust except error.”\n",
        "TRANSLATION_5": "And indeed they have led many astray. And (O Allah): `Grant no increase to the wrongdoers save error.\"'\n",
        "TRANSLATION_6": "And indeed they have led astray many, and do not increase the unjust in aught but error.\n",
        "TRANSLATION_7": "And they have led many astray. Increase Thou not the evildoers save in error!'\n",
        "TRANSLATION_8": "And they have led many astray, and Thou increasest the wrong-doers in naught save error.\n",
        "TRANSLATION_9": "They have led many astray; so lead the wrongdoers to further error.\"\n",
        "TRANSLATION_10": "And surely they have misled many. And increase Thou these wrong-doers in naught save error.\n",
        "TRANSLATION_11": "and already they have led many astray. Do not increase the wrongdoers in anything but error.’\n",
        "TRANSLATION_12": "They have already misled many; and grant Thou no increase to the wrong-doers but in straying (from their mark).\"\n",
        "TRANSLATION_13": "And indeed they have led many astray. And (O Allah): 'Grant no increase to the Zalimun (polytheists, wrong-doers, and disbelievers, etc.) save error.\"\n",
        "TRANSLATION_14": "And they have led many astray. (Noah supplicated saying): 'Allah, do not increase the harmdoers except in error'\n",
        "TRANSLATION_15": "They have misled many, so do not increase the wrongdoers except in confusion.”\n",
        "TRANSLATION_16": "And already they have misled many. And, [my Lord], do not increase the wrongdoers except in error.\"\n",
        "TRANSLATION_17": "[71:24] And they have certainly led astray, by these [gods], many, people, by commanding them to worship them. And do not [O God] increase the evildoers except in error!’ (wa-lā tazidi’l-zālimīna illā dalālan is a supplement to qad adallū, ‘they have certainly led astray’): He [Noah] invoked God against them when it was revealed to him that, ‘None of your people will believe except he who has already believed’ [Q. 11:36].\n",
        "TRANSLATION_18": "698 (And they have led many astray) he says: they have misled through them many people; and it is also said: many people went astray because of them, (and Thou increasest the wrong-doers) the disbelievers and idolaters in their worship of these idols (in naught save error) loss and destruction.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "71:24",
            "12:106",
            "36:7",
            "20:34",
            "44:39",
            "26:223",
            "25:44",
            "37:71",
            "42:34",
            "26:227"
        ],
        "BIBLE": [
            "torah:numbers:22:34",
            "prophets:i%20samuel:3:17",
            "prophets:i%20samuel:12:23",
            "prophets:jeremiah:2:17",
            "torah:leviticus:4:2",
            "prophets:jeremiah:14:9",
            "torah:exodus:24:12",
            "prophets:joshua:22:24",
            "writings:psalms:27:11",
            "torah:genesis:38:16"
        ]
    }
}