{
    "VERSE": "71:26",
    "ARABIC": "وَقَالَ نُوحٌ رَّبِّ لَا تَذَرْ عَلَى ٱلْأَرْضِ مِنَ ٱلْكَٰفِرِينَ دَيَّارًا",
    "ENGLISH": {
        "TRANSLATION_0": "Nuh said, 'My Lord! do not leave a single one of the kafirun on earth!",
        "TRANSLATION_1": "Noah said: \"O Lord, do not leave a single habitation of unbelievers on the earth.\n",
        "TRANSLATION_2": "Noah said: “My Lord, do not leave out of these unbelievers even a single dweller on earth,\n",
        "TRANSLATION_3": "Noah said, \"Lord, do not leave a single disbeliever on earth;\n",
        "TRANSLATION_4": "And prayed Nooh, “O my Lord! Do not leave any of the disbelievers dwelling in the land.”\n",
        "TRANSLATION_5": "And Nuh said: \"My Lord! Leave not one of the disbelievers on the earth Dayyar!\"\n",
        "TRANSLATION_6": "And Nuh said: My Lord! leave not upon the land any dweller from among the unbelievers:\n",
        "TRANSLATION_7": "And Noah said, 'My Lord, leave not upon the earth of the unbelievers even one.\n",
        "TRANSLATION_8": "And Noah said: My Lord! Leave not one of the disbelievers in the land.\n",
        "TRANSLATION_9": "Noah prayed, \"O my Lord! Do not leave on earth a single one of those who deny the truth --\n",
        "TRANSLATION_10": "And Nuh said: my Lord! leave not upon the earth of the infidels one inhabitant.\n",
        "TRANSLATION_11": "And Noah said, ‘My Lord! ‘Do not leave on the earth any inhabitant from among the faithless.\n",
        "TRANSLATION_12": "And Noah, said: \"O my Lord! Leave not of the Unbelievers, a single one on earth!\n",
        "TRANSLATION_13": "And Nuh (Noah) said: \"My Lord! Leave not one of the disbelievers on the earth!\n",
        "TRANSLATION_14": "And Noah (supplicated) saying: 'My Lord, do not leave a single unbeliever upon the earth.\n",
        "TRANSLATION_15": "Noah said, “My Lord, do not leave of the unbelievers a single dweller on earth.\n",
        "TRANSLATION_16": "And Noah said, \"My Lord, do not leave upon the earth from among the disbelievers an inhabitant.\n",
        "TRANSLATION_17": "[71:26] And Noah said, ‘My Lord, do not leave from among the disbelievers a single dweller upon the earth (dayyār means ‘one who inhabits a dwelling [dār]’), in other words, not one.\n",
        "TRANSLATION_18": "(And Noah said) after Allah told him that none of his people will believe in him, apart from those who had already believed: (My Lord!) my Lord! (Leave not one of the disbelievers in the land.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "71:26",
            "21:56",
            "37:100",
            "36:27",
            "19:6",
            "21:4",
            "14:38",
            "26:152",
            "11:107",
            "15:39"
        ],
        "BIBLE": [
            "writings:psalms:142:6",
            "prophets:ii%20kings:19:15",
            "prophets:isaiah:38:11",
            "torah:genesis:26:2",
            "torah:exodus:11:9",
            "torah:deuteronomy:3:2",
            "prophets:joshua:2:24",
            "torah:numbers:22:13",
            "prophets:judges:6:10",
            "prophets:jeremiah:42:2"
        ]
    }
}