{
    "VERSE": "71:27",
    "ARABIC": "إِنَّكَ إِن تَذَرْهُمْ يُضِلُّوا۟ عِبَادَكَ وَلَا يَلِدُوٓا۟ إِلَّا فَاجِرًا كَفَّارًا",
    "ENGLISH": {
        "TRANSLATION_0": "If You leave any they will misguide Your slaves and spawn nothing but more dissolute kafirun.",
        "TRANSLATION_1": "If you leave them, they will lead Your creatures astray, and beget but iniquitous and ungrateful offspring.\n",
        "TRANSLATION_2": "for certainly if You should leave them (alive), they will mislead Your servants, and will beget none but sinners and utter unbelievers.\n",
        "TRANSLATION_3": "if You do, they will mislead Your servants and will only give birth to ungrateful sinners.\n",
        "TRANSLATION_4": "“Indeed, if You spare them, they will mislead your bondmen – and their descendants, if any, will be none except the wicked, very ungrateful.”\n",
        "TRANSLATION_5": "If You leave them, they will mislead Your servants, and they will beget none but wicked disbelievers.\"\n",
        "TRANSLATION_6": "For surely if Thou leave them they will lead astray Thy servants, and will not beget any but immoral, ungrateful (children)\n",
        "TRANSLATION_7": "Surely, if Thou leavest them, they will lead Thy servants astray, and will beget none but unbelieving libertines.\n",
        "TRANSLATION_8": "If Thou shouldst leave them, they will mislead Thy slaves and will beget none save lewd ingrates.\n",
        "TRANSLATION_9": "if You leave any, they will misguide Your servants, and they will beget none but sinners and deniers of truth --\n",
        "TRANSLATION_10": "Verily if Thou shouldst leave them, they Will mislead Thine bondmen and will beget not save sinning infidels,\n",
        "TRANSLATION_11": "If You leave them, they will lead astray Your servants, and will beget none except vicious ingrates.\n",
        "TRANSLATION_12": "For, if Thou dost leave (any of) them, they will but mislead Thy devotees, and they will breed none but wicked ungrateful ones.\n",
        "TRANSLATION_13": "If You leave them, they will mislead Your slaves, and they will beget none but wicked disbelievers.\"\n",
        "TRANSLATION_14": "Surely, if You leave them they will mislead Your worshipers and father none but the immoral, and unbelievers.\n",
        "TRANSLATION_15": "If You leave them, they will mislead your servants, and will breed only wicked unbelievers.\n",
        "TRANSLATION_16": "Indeed, if You leave them, they will mislead Your servants and not beget except [every] wicked one and [confirmed] disbeliever.\n",
        "TRANSLATION_17": "[71:27] Assuredly if You leave them, they will lead Your servants astray, and will beget only disbelieving profligates (fājir and kaffār derive [respectively] from yafjuru and yakfuru): he said this on account of the mentioned revelation that had been given to him.\n",
        "TRANSLATION_18": "If Thou shouldst leave them, they will mislead Thy slaves) they will mislead from Your religion those who believe in You and those who wish to believe in You, (and will beget none save lewd ingrates) and will not beget save offspring who are sinful and disbelievers when they reach the age of reason; and it is also said this means: save those upon whom You have decreed disbelief and lewdness when they reach the age of reason; and it is also said that they did not have among them any children because Allah stopped their women from conceiving, and thus they had only adults amongst them, and the latter were all lewd disbelievers.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "71:27",
            "15:40",
            "38:83",
            "5:118",
            "43:15",
            "7:206",
            "17:65",
            "26:52",
            "42:48",
            "15:42"
        ],
        "BIBLE": [
            "writings:i%20chronicles:19:3",
            "writings:psalms:106:6",
            "writings:nehemiah:1:6",
            "prophets:i%20samuel:20:8",
            "torah:deuteronomy:5:9",
            "torah:exodus:20:5",
            "prophets:i%20kings:8:26",
            "torah:genesis:44:22",
            "writings:nehemiah:9:23",
            "prophets:ii%20samuel:10:3"
        ]
    }
}