{
    "VERSE": "71:28",
    "ARABIC": "رَّبِّ ٱغْفِرْ لِى وَلِوَٰلِدَىَّ وَلِمَن دَخَلَ بَيْتِىَ مُؤْمِنًا وَلِلْمُؤْمِنِينَ وَٱلْمُؤْمِنَٰتِ وَلَا تَزِدِ ٱلظَّٰلِمِينَ إِلَّا تَبَارًۢا",
    "ENGLISH": {
        "TRANSLATION_0": "My Lord! forgive me and my parents and all who enter my house as muminun, and all the men and women of the muminun. But do not increase the wrongdoers except in ruin!'",
        "TRANSLATION_1": "O Lord, forgive me, my parents, and any one who enters my house as a believer, and all believing men and women, and do not give the evil-doers increase save in ruin.\n",
        "TRANSLATION_2": "My Lord, forgive me and my parents, and whoever enters my house as a believer, and forgive all believers, both men and women, and do not increase the wrong-doers in anything except perdition.”\n",
        "TRANSLATION_3": "Lord, forgive me, my parents, the believers who have entered my home and all believing men and women. Give nothing to the unjust but destruction.\n",
        "TRANSLATION_4": "“O my Lord! Forgive me, and my parents, and the believers who are in my house, and all other Muslim men and Muslim women; and do not increase anything for the unjust except ruin.”\n",
        "TRANSLATION_5": "My Lord! Forgive me, and my parents, and him who enters my home as a believer, and all the believing men and women. And to the wrongdoers grant You no increase but destruction!\") Allah says,\n",
        "TRANSLATION_6": "My Lord! forgive me and my parents and him who enters my house believing, and the believing men and the believing women; and do not increase the unjust in aught but destruction!\n",
        "TRANSLATION_7": "My Lord, forgive me and my parents and whosoever enters my house as a believer, and the believers, men and women alike; and do Thou not increase the evildoers save in ruin!'\n",
        "TRANSLATION_8": "My Lord! Forgive me and my parents and him who entereth my house believing, and believing men and believing women, and increase not the wrong-doers in aught save ruin.\n",
        "TRANSLATION_9": "Lord! Forgive me and my parents and every true believer who enters my house, forgive all the believing men and believing women; and bestow no increase upon the wrongdoers except in ruin?\n",
        "TRANSLATION_10": "My Lord! forgive me and my parents and him who entereth my house as a believer, and believing men and believing women, and increase not the wrong-doers in aught save ruin!\n",
        "TRANSLATION_11": "My Lord! Forgive me and my parents, and whoever enters my house in faith, and the faithful men and women, and do not increase the wrongdoers in anything but ruin.’\n",
        "TRANSLATION_12": "O my Lord! Forgive me, my parents, all who enter my house in Faith, and (all) believing men and believing women: and to the wrong-doers grant Thou no increase but in perdition!\"\n",
        "TRANSLATION_13": "My Lord! Forgive me, and my parents, and him who enters my home as a believer, and all the believing men and women. And to the Zalimun (polytheists, wrong-doers, and disbelievers, etc.) grant You no increase but destruction!\"\n",
        "TRANSLATION_14": "Forgive me, My Lord, and my parents, and whosoever seeks refuge in my house as a believer, and the believers men and women alike, and do not increase the harmdoers except in ruin'\n",
        "TRANSLATION_15": "My Lord! Forgive me and my parents, and anyone who enters my home in faith, and all the believing men and believing women; and do not increase the wrongdoers except in perdition.”\n",
        "TRANSLATION_16": "My Lord, forgive me and my parents and whoever enters my house a believer and the believing men and believing women. And do not increase the wrongdoers except in destruction.\"\n",
        "TRANSLATION_17": "[71:28] My Lord, forgive me and my parents — both of whom were believers — and whoever enters my house, my dwelling or my place of worship, as a believer, and believing men and believing women, to the Day of Resurrection, and do not increase the evildoers except in ruin’, in destruction — and thus they were destroyed.\n",
        "TRANSLATION_18": "(My Lord!) my Lord! (Forgive me and my parents) and forgive my believing parents (and him who entereth my house) my religion; and it is also said: my mosque; and it is also said: my ship (believing, and believing men and believing women) who are true in their faith and who will come after me, (and increase not the wrong-doers) the disbelieving idolaters (in aught save ruin) loss and destruction, like the destruction of those people whose Prophet received the revelation but refused to believe in him'. And of the surah in which the jinn are mentioned, which is all Meccan and consists of 28 verses, 285 words and 870 letters: Surah 72: The Jinn (al- Jinn) And of the surah in which the jinn are mentioned, which is all Meccan and consists of 28 verses, 285 words and 870 letters:\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "71:28",
            "14:41",
            "36:27",
            "106:3",
            "37:100",
            "15:56",
            "84:2",
            "84:5",
            "52:4",
            "71:21"
        ],
        "BIBLE": [
            "torah:genesis:15:3",
            "prophets:ezekiel:11:15",
            "prophets:i%20kings:21:20",
            "prophets:jeremiah:44:20",
            "torah:deuteronomy:26:13",
            "torah:genesis:3:12",
            "prophets:i%20samuel:22:14",
            "writings:ii%20chronicles:35:21",
            "torah:genesis:20:16",
            "torah:numbers:20:12"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:8"
        ]
    }
}