{
    "VERSE": "71:6",
    "ARABIC": "فَلَمْ يَزِدْهُمْ دُعَآءِىٓ إِلَّا فِرَارًا",
    "ENGLISH": {
        "TRANSLATION_0": "but my calling has only made them more evasive.",
        "TRANSLATION_1": "But the more I called, they only ran the farther away.\n",
        "TRANSLATION_2": "but the more I called, the farther they fled.\n",
        "TRANSLATION_3": "but it has had no effect on them except to make them run away.\n",
        "TRANSLATION_4": "“So for them, my calling them increased their fleeing away.”\n",
        "TRANSLATION_5": "But all my calling added nothing but to (their) flight.\n",
        "TRANSLATION_6": "But my call has only made them flee the more:\n",
        "TRANSLATION_7": "but my calling has only increased them in flight.\n",
        "TRANSLATION_8": "But all my calling doth but add to their repugnance;\n",
        "TRANSLATION_9": "but my pleas have only increased their aversion.\n",
        "TRANSLATION_10": "And my calling hath only increased them in fleeing.\n",
        "TRANSLATION_11": "but my summons only increases their evasion.\n",
        "TRANSLATION_12": "But my call only increases (their) flight (from the Right).\n",
        "TRANSLATION_13": "But all my calling added nothing but to (their) flight (from the truth).\n",
        "TRANSLATION_14": "but my call has only increased them in running away.\n",
        "TRANSLATION_15": "But my call added only to their flight.\n",
        "TRANSLATION_16": "But my invitation increased them not except in flight.\n",
        "TRANSLATION_17": "[71:6] but my summon has only increased their evasion, of faith.\n",
        "TRANSLATION_18": "(But all my calling) to them to repent and believe in Allah's divine Oneness (doth but add to their repugnance) does but increase their remoteness from faith and repentance;\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "71:6",
            "21:15",
            "40:50",
            "25:77",
            "26:60",
            "68:21",
            "30:52",
            "7:5",
            "86:17",
            "10:89"
        ],
        "BIBLE": [
            "prophets:isaiah:48:15",
            "writings:proverbs:1:16",
            "writings:psalms:141:1",
            "prophets:isaiah:59:7",
            "prophets:isaiah:48:1",
            "prophets:isaiah:42:1",
            "prophets:i%20samuel:3:5",
            "prophets:ezekiel:32:14",
            "torah:numbers:10:2",
            "prophets:ii%20kings:4:22"
        ]
    }
}