{
    "VERSE": "71:9",
    "ARABIC": "ثُمَّ إِنِّىٓ أَعْلَنتُ لَهُمْ وَأَسْرَرْتُ لَهُمْ إِسْرَارًا",
    "ENGLISH": {
        "TRANSLATION_0": "Then I addressed them publicly and addressed them privately.",
        "TRANSLATION_1": "And declared to them in public and in private,\n",
        "TRANSLATION_2": "and preached to them in public, and also addressed them in secret.\n",
        "TRANSLATION_3": "Then I conveyed the message to them, again, both in public and in private,\n",
        "TRANSLATION_4": "“Then I also told them publicly and also spoke to them softly in private.”\n",
        "TRANSLATION_5": "Then verily, I proclaimed to them in public, and I have appealed to them in private.\n",
        "TRANSLATION_6": "Then surely I spoke to them in public and I spoke to them in secret:\n",
        "TRANSLATION_7": "then indeed I spoke publicly unto them, and I spoke unto them secretly,\n",
        "TRANSLATION_8": "And lo! I have made public proclamation unto them, and I have appealed to them in private.\n",
        "TRANSLATION_9": "and spoke to them in public and in private.\"\n",
        "TRANSLATION_10": "Then verily spake Unto them openly, and secretly also I addressed them.\n",
        "TRANSLATION_11": "and again appealed to them publicly and confided with them privately,\n",
        "TRANSLATION_12": "Further I have spoken to them in public and secretly in private,\n",
        "TRANSLATION_13": "Then verily, I proclaimed to them in public, and I have appealed to them in private,\n",
        "TRANSLATION_14": "and indeed, I spoke to them both publicly and in secret:\n",
        "TRANSLATION_15": "Then I appealed to them publicly, and I spoke to them privately.\n",
        "TRANSLATION_16": "Then I announced to them and [also] confided to them secretly\n",
        "TRANSLATION_17": "[71:9] then assuredly I proclaimed to them, with my voice, and I confided, my words, to them secretly,\n",
        "TRANSLATION_18": "(And lo! I have made public proclamation unto them) I called them openly to the message and explained to them, (and I have appealed to them in private) and I called them secretly to the message.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "71:9",
            "74:14",
            "7:21",
            "25:66",
            "26:55",
            "15:9",
            "94:4",
            "37:24",
            "11:122",
            "32:30"
        ],
        "BIBLE": [
            "writings:job:40:5",
            "writings:daniel:2:4",
            "prophets:isaiah:44:8",
            "prophets:isaiah:43:12",
            "prophets:jeremiah:38:15",
            "prophets:isaiah:48:5",
            "prophets:isaiah:45:21",
            "prophets:isaiah:45:19",
            "writings:esther:4:10",
            "prophets:i%20samuel:19:21"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:3:1"
        ]
    }
}