{
    "VERSE": "1:2",
    "ARABIC": "ٱلْحَمْدُ لِلَّهِ رَبِّ ٱلْعَٰلَمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Praise be to Allah, the Lord of all the worlds,",
        "TRANSLATION_1": "ALL PRAISE BE to Allah, Lord of all the worlds,\n",
        "TRANSLATION_2": "Praise be to Allah, the Lord of the entire universe.\n",
        "TRANSLATION_3": "All praise belongs to God, Lord of the Universe,\n",
        "TRANSLATION_4": "All praise is to Allah, the Lord Of The Creation.\n",
        "TRANSLATION_5": "Al-Hamd be to Allah, the Lord of all that exists.\n",
        "TRANSLATION_6": "All praise is due to Allah, the Lord of the Worlds.\n",
        "TRANSLATION_7": "Praise belongs to God, the Lord of all Being,\n",
        "TRANSLATION_8": "Praise be to Allah, Lord of the Worlds,\n",
        "TRANSLATION_9": "All praise is due to God, the Lord of the Universe;\n",
        "TRANSLATION_10": "All praise unto Allah, the Lord of all the worlds.\n",
        "TRANSLATION_11": "All praise belongs to Allah, Lord of all the worlds,\n",
        "TRANSLATION_12": "Praise be to Allah, the Cherisher and Sustainer of the worlds;\n",
        "TRANSLATION_13": "All the praises and thanks be to Allah, the Lord of the 'Alamin (mankind, jinns and all that exists).\n",
        "TRANSLATION_14": "Praise be to Allah, Lord of the Worlds,\n",
        "TRANSLATION_15": "Praise be to God, Lord of the Worlds.\n",
        "TRANSLATION_16": "[All] praise is [due] to Allah, Lord of the worlds -\n",
        "TRANSLATION_17": "[1:2] Praise be to God, is a predicate of a nominal clause, the content of which is intended to extol God [by stating that]: He possesses the praise of all creatures, or that He [alone] deserves their praise. God is a proper noun for the One truly worthy of worship; Lord of all Worlds, that is, [He is] the One Who owns all of creation: humans, jinn, angels, animals and others as well, each of which may be referred to as a ‘world’; one says ‘the world of men’, or ‘world of the jinn’ etc. This plural form with the yā’ and the nūn [sc. ‘ālamīn] is used to denote, predominantly, cognizant beings (ūlū ‘ilm). The expression [‘ālamīn] relates to [the term] ‘sign’ (‘alāma), since it is an indication of the One that created it.\n",
        "TRANSLATION_18": "And on his authority it is related that Ibn 'Abbas said, regarding the saying of Allah, Exalted is He, (Praise be to Allah): 'He says: laudation is Allah's in that He is kind towards His created beings and, hence, they praise Him. It is also said that laudation is Allah's because of His excessive blessings upon His servants whom He has guided to believe in Him. It is also said: laudation, absolute unity and godhood all belong to Allah Who has neither progeny, partner, helper nor an assistant. (Lord of the worlds): Lord of any that has a spirit and walks about on the face of the earth and also of the dwellers of heaven. It is also said that this means: the Master of the jinn and human beings. It is also said that (Lord of the worlds) means the Creator of all created beings, their Provider and the One Who changes them from one state into another.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "1:2",
            "37:182",
            "45:36",
            "6:45",
            "40:65",
            "56:80",
            "69:43",
            "10:10",
            "81:29",
            "39:75"
        ],
        "BIBLE": [
            "writings:psalms:146:2",
            "writings:psalms:30:13",
            "writings:psalms:68:33",
            "writings:psalms:104:33",
            "writings:psalms:106:47",
            "writings:psalms:18:50",
            "torah:deuteronomy:29:28",
            "writings:psalms:147:7",
            "writings:psalms:108:4",
            "writings:psalms:57:10"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:3:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:3:6"
        ]
    }
}