{
    "VERSE": "1:7",
    "ARABIC": "صِرَٰطَ ٱلَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ ٱلْمَغْضُوبِ عَلَيْهِمْ وَلَا ٱلضَّآلِّينَ",
    "ENGLISH": {
        "TRANSLATION_0": "the Path of those You have blessed, not of those with anger on them, nor of the misguided,",
        "TRANSLATION_1": "The path of those You have blessed, Not of those who have earned Your anger, nor those who have gone astray.\n",
        "TRANSLATION_2": "The way of those whom You have favoured, who did not incur Your wrath, who are not astray.\n",
        "TRANSLATION_3": "the path of those to whom You have granted blessings, those who are neither subject to Your anger nor have gone astray.\n",
        "TRANSLATION_4": "The path of those whom You have favoured – Not the path of those who earned Your anger – nor of those who are astray.\n",
        "TRANSLATION_5": "The way of those upon whom You have bestowed Your grace, not (that) of those who earned Your anger, nor of those who went astray.\n",
        "TRANSLATION_6": "The path of those upon whom Thou hast bestowed favors. Not (the path) of those upon whom Thy wrath is brought down, nor of those who go astray.\n",
        "TRANSLATION_7": "the path of those whom Thou hast blessed, not of those against whom Thou art wrathful, nor of those who are astray.\n",
        "TRANSLATION_8": "The path of those whom Thou hast favoured; Not the (path) of those who earn Thine anger nor of those who go astray.\n",
        "TRANSLATION_9": "the path of those You have blessed; not of those who have incurred Your wrath, nor of those who have gone astray.\n",
        "TRANSLATION_10": "The path of those whom Thou hast favoured. Not of those on whom is indignation brought down, nor of the astray.\n",
        "TRANSLATION_11": "the path of those whom You have blessed — such as have not incurred Your wrath, nor are astray.\n",
        "TRANSLATION_12": "The way of those on whom Thou hast bestowed Thy Grace, those whose (portion) is not wrath, and who go not astray.\n",
        "TRANSLATION_13": "The Way of those on whom You have bestowed Your Grace, not (the way) of those who earned Your Anger, nor of those who went astray.\n",
        "TRANSLATION_14": "the Path of those upon whom You have favored, not those upon whom is the anger, nor the astray. (Amen please answer)\n",
        "TRANSLATION_15": "The path of those You have blessed, not of those against whom there is anger, nor of those who are misguided.\n",
        "TRANSLATION_16": "The path of those upon whom You have bestowed favor, not of those who have evoked [Your] anger or of those who are astray.\n",
        "TRANSLATION_17": "[1:7] the path of those whom You have favoured, with guidance (from alladhīna together with its relative clause is substituted by [ghayri l-maghdūbi ‘alayhim]) not [the path] of those against whom there is wrath, namely, the Jews, and nor of those who are astray, namely, the Christians. The subtle meaning implied by this substitution is that the guided ones are neither the Jews nor the Christians. But God knows best what is right, and to Him is the Return and the [final] Resort. May God bless our master   Muhammad (s), his Family and Companions and grant them everlasting peace. Sufficient is God for us; an excellent Guardian is He. There is no power and no strength save in God, the High, the Tremendous.\n",
        "TRANSLATION_18": "(The path of those whom Thou hast favoured), the Religion of those whom You have blessed with the Religion and who are the followers of Moses, before the blessings of Allah deserted them, in that He shaded them with a white cloud and sent down on them honey and quails when they were in the wilderness. It is also said that (the path of those whom Thou hast favoured) refers to the prophets. (Not of those who earn Thine anger), not the religion of the Jews who earned Your anger, whom You forsook and whose hearts You did not protect until they became complaisant. (Nor of those who go astray), nor the religion of the Christians who erred from Islam. Amen: thus shall be its custodians; it is also said that Amen means let it be so. It is also said that it means: our Lord! Do with us as we have requested You. And Allah knows best'. And of the surah in which the Cow (al-Baqarah) is mentioned, which is Medinan in its entirety- although it is also said to be Meccan -and consists of 280 verses, 3,100 words and 25,500 letters. Surah 2: The Cow (al-Baqarah) And of the surah in which the Cow (al-Baqarah) is mentioned, which is Medinan in its entirety — although it is also said to be Meccan — and consists of 280 verses, 3,100 words and 25,500 letters.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "1:7",
            "23:74",
            "41:8",
            "84:25",
            "37:118",
            "23:73",
            "95:6",
            "43:43",
            "27:85",
            "1:6"
        ],
        "BIBLE": [
            "prophets:ezekiel:23:30",
            "writings:psalms:139:3",
            "prophets:i%20samuel:26:25",
            "prophets:jeremiah:2:23",
            "prophets:i%20samuel:1:18",
            "prophets:ezekiel:22:31",
            "prophets:judges:19:14",
            "writings:nehemiah:8:10",
            "writings:psalms:45:3",
            "torah:genesis:32:2"
        ]
    }
}