{
    "VERSE": "70:17",
    "ARABIC": "تَدْعُوا۟ مَنْ أَدْبَرَ وَتَوَلَّىٰ",
    "ENGLISH": {
        "TRANSLATION_0": "which calls for all who drew back and turned away,",
        "TRANSLATION_1": "It will summon whoever turns his back and flees,\n",
        "TRANSLATION_2": "It shall insistently summon him who turned his back and retreated,\n",
        "TRANSLATION_3": "and drag into it anyone who has turned away (from obeying God),\n",
        "TRANSLATION_4": "It calls out to him who reverted and turned away.\n",
        "TRANSLATION_5": "Calling (all) such as turn their backs and turn away their faces.\n",
        "TRANSLATION_6": "It shall claim him who turned and fled (from truth),\n",
        "TRANSLATION_7": "calling him who drew back and turned away,\n",
        "TRANSLATION_8": "It calleth him who turned and fled (from truth),\n",
        "TRANSLATION_9": "and it will claim all those who turned their backs [on the true faith] and turned away [from the truth],\n",
        "TRANSLATION_10": "It shall calll him who turneth back and backslideth.\n",
        "TRANSLATION_11": "It invites him, who has turned back [from the truth] and forsaken [it],\n",
        "TRANSLATION_12": "Inviting (all) such as turn their backs and turn away their faces (from the Right).\n",
        "TRANSLATION_13": "Calling: \"[O Kafir (O disbeliever in Allah, His angels, His Book, His Messengers, Day of Resurrection and in Al-Qadar (Divine Preordainments), O Mushrik (O polytheist, disbeliever in the Oneness of Allah)] (all) such as turn their backs and turn away their faces (from Faith) [picking and swallowing them up from that great gathering of mankind (on the Day of Resurrection) just as a bird picks up a food-grain from the earth with its beak and swallows it up] [Tafsir Al-Qurtubi, Vol. 18, Page 289]\n",
        "TRANSLATION_14": "and it shall call him who withdrew and turned his back\n",
        "TRANSLATION_15": "It invites him who once turned his back and fled.\n",
        "TRANSLATION_16": "It invites he who turned his back [on truth] and went away [from obedience]\n",
        "TRANSLATION_17": "[70:17] it will call him who turned his back and ignored, faith, saying [to him]: ‘To me ! to me [come hither]!’,\n",
        "TRANSLATION_18": "693 (It calleth) to itself: \"come to me, disbeliever!\", \"come to me, hypocrite\" (him who turned) from Allah's divine Oneness (and fled) from faith and did not repent of disbelief,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "70:17",
            "88:23",
            "92:16",
            "80:1",
            "91:10",
            "75:27",
            "87:3",
            "29:21",
            "26:79",
            "10:63"
        ],
        "BIBLE": [
            "torah:numbers:22:23",
            "writings:ii%20chronicles:29:6",
            "writings:psalms:50:1",
            "prophets:joshua:7:26",
            "writings:song%20of%20songs:5:6",
            "torah:exodus:10:6",
            "writings:esther:9:1",
            "prophets:judges:2:17",
            "prophets:isaiah:12:1",
            "prophets:joshua:8:16"
        ]
    }
}