{
    "VERSE": "70:3",
    "ARABIC": "مِّنَ ٱللَّهِ ذِى ٱلْمَعَارِجِ",
    "ENGLISH": {
        "TRANSLATION_0": "from Allah - the Lord of the Ascending Steps.",
        "TRANSLATION_1": "From God, the Lord of the steps (of progression),\n",
        "TRANSLATION_2": "a chastisement from Allah, the Lord of the ascending steps,\n",
        "TRANSLATION_3": "No one can defend him against God, the Lord of the exalted positions.\n",
        "TRANSLATION_4": "From Allah, the Lord of all pinnacles.\n",
        "TRANSLATION_5": "From Allah, the Lord of the ways of ascent.\n",
        "TRANSLATION_6": "From Allah, the Lord of the ways of Ascent.\n",
        "TRANSLATION_7": "from God, the Lord of the Stairways.\n",
        "TRANSLATION_8": "From Allah, Lord of the Ascending Stairways\n",
        "TRANSLATION_9": "from punishing them. He is the Lord of the Ascending Stairways,\n",
        "TRANSLATION_10": "From Allah, Owner of the ascending steps.\n",
        "TRANSLATION_11": "from Allah, Lord of the lofty stations.\n",
        "TRANSLATION_12": "(A Penalty) from Allah, Lord of the Ways of Ascent.\n",
        "TRANSLATION_13": "From Allah, the Lord of the ways of ascent.\n",
        "TRANSLATION_14": "(A punishment) from Allah, the Owner of the Elevated Passages.\n",
        "TRANSLATION_15": "From God, Lord of the Ways of Ascent.\n",
        "TRANSLATION_16": "[It is] from Allah, owner of the ways of ascent.\n",
        "TRANSLATION_17": "[70:3] from God (mina’Llāhi is semantically connected to wāqi‘in, ‘impending’), Lord of the Ascensions, the   ascension routes of the angels, which are the heavens.\n",
        "TRANSLATION_18": "(From Allah) this punishment of the disbelievers comes from Allah, (Lord of the Ascending Stairways) the Creator of the heavens\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "70:3",
            "33:64",
            "39:66",
            "104:6",
            "39:57",
            "12:85",
            "37:128",
            "37:40",
            "37:74",
            "37:160"
        ],
        "BIBLE": [
            "writings:job:31:4",
            "writings:psalms:128:1",
            "prophets:ezekiel:40:49",
            "writings:psalms:119:33",
            "writings:proverbs:16:9",
            "prophets:jeremiah:7:3",
            "prophets:jeremiah:10:23",
            "writings:psalms:138:5",
            "prophets:i%20kings:10:19",
            "prophets:jeremiah:26:13"
        ]
    }
}