{
    "VERSE": "70:36",
    "ARABIC": "فَمَالِ ٱلَّذِينَ كَفَرُوا۟ قِبَلَكَ مُهْطِعِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "What is the matter with those who are kafir? They run about in front of you, with outstretched necks and staring eyes,",
        "TRANSLATION_1": "What is the matter with unbelievers that they stare at you with fixed gazes and hasten towards you\n",
        "TRANSLATION_2": "But what is the matter with the unbelievers who are hurrying towards you\n",
        "TRANSLATION_3": "What is wrong with the disbelievers who roam around you (Muhammad),\n",
        "TRANSLATION_4": "So what is the matter with these disbelievers, that they stare at you (O dear Prophet Mohammed – peace and blessings be upon him)?\n",
        "TRANSLATION_5": "So, what is the matter with those disbelievers, before you Muhti`in\n",
        "TRANSLATION_6": "But what is the matter with those who disbelieve that they hasten on around you,\n",
        "TRANSLATION_7": "What ails the unbelievers, running with outstretched necks\n",
        "TRANSLATION_8": "What aileth those who disbelieve, that they keep staring toward thee (O Muhammad), open-eyed,\n",
        "TRANSLATION_9": "But what is the matter with those who deny the truth, that they come hastening towards you\n",
        "TRANSLATION_10": "What aileth those who disbelieve, toward thee hastening.\n",
        "TRANSLATION_11": "What is the matter with the faithless that they scramble toward you,\n",
        "TRANSLATION_12": "Now what is the matter with the Unbelievers that they rush madly before thee-\n",
        "TRANSLATION_13": "So what is the matter with those who disbelieve that they hasten to listen from you (O Muhammad SAW), in order to belie you and to mock at you, and at Allah's Book (this Quran).\n",
        "TRANSLATION_14": "But what is the matter with the unbelievers, that they strain their glances continuously towards them,\n",
        "TRANSLATION_15": "What is with those who disbelieve, stretching their necks towards you.\n",
        "TRANSLATION_16": "So what is [the matter] with those who disbelieve, hastening [from] before you, [O Muhammad],\n",
        "TRANSLATION_17": "[70:36] So what is wrong with those who disbelieve that they keep staring towards you (muhti‘īna is a circumstantial qualifier),\n",
        "TRANSLATION_18": "(What aileth those who disbelieve) the disbelievers of Mecca who mock the believers as well as the other disbelievers, (that they keep staring towards thee (O Muhammad)) around you, (open eyed) looking at you without coming close to you,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "70:36",
            "39:50",
            "41:48",
            "21:41",
            "6:28",
            "6:10",
            "2:4",
            "84:20",
            "16:118",
            "10:102"
        ],
        "BIBLE": [
            "prophets:joshua:8:19",
            "writings:daniel:12:4",
            "writings:ii%20chronicles:23:12",
            "writings:psalms:19:6",
            "prophets:nahum:2:5",
            "torah:exodus:9:23",
            "writings:daniel:8:6",
            "prophets:jeremiah:23:21",
            "prophets:judges:13:10",
            "writings:proverbs:5:15"
        ]
    }
}