{
    "VERSE": "70:38",
    "ARABIC": "أَيَطْمَعُ كُلُّ ٱمْرِئٍ مِّنْهُمْ أَن يُدْخَلَ جَنَّةَ نَعِيمٍ",
    "ENGLISH": {
        "TRANSLATION_0": "Does each one of them aspire to be admitted into a Garden of Delight?",
        "TRANSLATION_1": "Does every one of them wish to enter the garden of tranquility?\n",
        "TRANSLATION_2": "Does everyone of them wish to enter the Garden of Bliss?\n",
        "TRANSLATION_3": "Does every one of them desire to enter the bountiful Paradise?\n",
        "TRANSLATION_4": "Does every man among them aspire to be admitted into the Garden of serenity?\n",
        "TRANSLATION_5": "Does every man of them hope to enter the Paradise of Delight\n",
        "TRANSLATION_6": "Does every man of them desire that he should be made to enter the garden of bliss?\n",
        "TRANSLATION_7": "What, is every man of them eager to be admitted to a Garden of Bliss?\n",
        "TRANSLATION_8": "Doth every man among them hope to enter the Garden of Delight?\n",
        "TRANSLATION_9": "Does every one of them aspire to be admitted into a Garden of Delight?\n",
        "TRANSLATION_10": "Coveteth every man of them, that he shall enter the Garden of Delight?\n",
        "TRANSLATION_11": "Does each man among them hope to enter the garden of bliss?\n",
        "TRANSLATION_12": "Does every man of them long to enter the Garden of Bliss?\n",
        "TRANSLATION_13": "Does every man of them hope to enter the Paradise of delight?\n",
        "TRANSLATION_14": "What, is every one of them eager to be admitted to the Garden of Bliss?\n",
        "TRANSLATION_15": "Is every one of them aspiring to be admitted into a Garden of Bliss?\n",
        "TRANSLATION_16": "Does every person among them aspire to enter a garden of pleasure?\n",
        "TRANSLATION_17": "[70:38]   Does each one of them hope to be admitted into a Garden of Bliss?\n",
        "TRANSLATION_18": "Doth every man among them hope to enter the Garden of Delight?) This is an answer from Allah to the disbelievers that He will not let them enter the Garden.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "70:38",
            "74:52",
            "80:37",
            "26:85",
            "37:43",
            "56:12",
            "31:8",
            "74:40",
            "52:21",
            "52:17"
        ],
        "BIBLE": [
            "writings:proverbs:21:17",
            "writings:psalms:143:2",
            "writings:ecclesiastes:3:13",
            "writings:esther:6:6",
            "writings:psalms:147:10",
            "writings:job:37:20",
            "writings:proverbs:24:8",
            "prophets:jeremiah:22:28",
            "prophets:judges:4:20",
            "writings:esther:1:8"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:3:5",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:11",
            "Sefer%20Yetzirah:1:11"
        ]
    }
}