{
    "VERSE": "70:39",
    "ARABIC": "كَلَّآ إِنَّا خَلَقْنَٰهُم مِّمَّا يَعْلَمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Certainly not! We created them from what they know full well.",
        "TRANSLATION_1": "Never so. We have created them from what they know.\n",
        "TRANSLATION_2": "By no means! They know that which We have created them from.\n",
        "TRANSLATION_3": "By no means! For they know very well out of what We have created them (The human being's naturally growing from a living germ, without discipline and good deeds will not result in virtue).\n",
        "TRANSLATION_4": "Never! We have indeed created them from a thing they know.\n",
        "TRANSLATION_5": "But no! Verily, We have created them out of that which they know!\n",
        "TRANSLATION_6": "By no means! Surely We have created them of what they know.\n",
        "TRANSLATION_7": "Not so; for We have created them of what they know.\n",
        "TRANSLATION_8": "Nay, verily. Lo! We created them from what they know.\n",
        "TRANSLATION_9": "Certainly not! They know quite well out of what We created them.\n",
        "TRANSLATION_10": "By no means! veriiy We! We have created them from that which they know.\n",
        "TRANSLATION_11": "Never! Indeed, We created them from what they know.\n",
        "TRANSLATION_12": "By no means! For We have created them out of the (base matter) they know!\n",
        "TRANSLATION_13": "No, that is not like that! Verily, We have created them out of that which they know!\n",
        "TRANSLATION_14": "Not at all, for We have created them of what they know.\n",
        "TRANSLATION_15": "No indeed! We created them from what they know.\n",
        "TRANSLATION_16": "No! Indeed, We have created them from that which they know.\n",
        "TRANSLATION_17": "[70:39] Nay! — meant to thwart their hopes of [entering] Paradise. Indeed We created them, as others, from what they know, from drops of sperm, and so one cannot hope for Paradise [merely] on account of this: one hopes for it by being God-fearing.\n",
        "TRANSLATION_18": "(Nay, verily. Lo! We created them) i.e. the disbelievers of Mecca (from what they know) i.e. a sperm drop.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "70:39",
            "83:29",
            "26:185",
            "26:153",
            "7:76",
            "15:93",
            "23:95",
            "26:207",
            "44:50",
            "7:139"
        ],
        "BIBLE": [
            "writings:ecclesiastes:9:5",
            "prophets:judges:19:24",
            "writings:ruth:3:18",
            "prophets:i%20samuel:20:39",
            "writings:proverbs:30:18",
            "prophets:ii%20samuel:2:6",
            "prophets:ii%20samuel:14:20",
            "torah:genesis:44:15",
            "writings:job:42:3",
            "writings:psalms:101:4"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:2:2",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:3:3"
        ]
    }
}