{
    "VERSE": "70:40",
    "ARABIC": "فَلَآ أُقْسِمُ بِرَبِّ ٱلْمَشَٰرِقِ وَٱلْمَغَٰرِبِ إِنَّا لَقَٰدِرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "No! I swear by the Lord of the Easts and Wests that We have the power",
        "TRANSLATION_1": "So I swear by the Lord of the Easts and the Wests that We are certainly able\n",
        "TRANSLATION_2": "I swear by the Lord of the easts and the wests that We have the power\n",
        "TRANSLATION_3": "I do not need to swear by the Lord of the eastern and western regions that We have certainly all the power\n",
        "TRANSLATION_4": "So I swear by the Lord of every East and every West, that We are indeed Able.\n",
        "TRANSLATION_5": "But no! I swear by the Lord of the easts and the wests that surely We are Able\n",
        "TRANSLATION_6": "But nay! I swear by the Lord of the Easts and the Wests that We are certainly able\n",
        "TRANSLATION_7": "No! I swear by the Lord of the Easts and Wests, surely We are able\n",
        "TRANSLATION_8": "But nay! I swear by the Lord of the rising-places and the setting-places of the planets that We verily are Able\n",
        "TRANSLATION_9": "But nay! I call to witness the Lord of the Easts and the Wests, that We have the power\n",
        "TRANSLATION_10": "I swear by the Lord of the easts and the wests, that, vierly We are Able.\n",
        "TRANSLATION_11": "So I swear by the Lord of the easts and the wests that We are able\n",
        "TRANSLATION_12": "Now I do call to witness the Lord of all points in the East and the West that We can certainly-\n",
        "TRANSLATION_13": "So I swear by the Lord of all [the three hundred and sixty (360)] points of sunrise and sunset in the east and the west that surely We are Able\n",
        "TRANSLATION_14": "No, I swear by the Lord of the Easts and the Wests that We have the ability\n",
        "TRANSLATION_15": "I swear by the Lord of the Easts and the Wests, that We are Able.\n",
        "TRANSLATION_16": "So I swear by the Lord of [all] risings and settings that indeed We are able\n",
        "TRANSLATION_17": "[70:40] For verily (fa-lā: lā is extra) I swear by the Lord of the rising-places and the setting-places, of the sun, the moon and all the stars, that We are able\n",
        "TRANSLATION_18": "(But nay! I swear by the Lord of the rising places) the rising places of winter and summer (and the setting 695 places of the planets) the setting places of winter and summer. There are two rising places and two setting places. The rising place of winter and summer has 177 phases and so do the setting places of winter and summer. The sun rises, in a year, two days in the same phase, and it also sets, in a year, two days in the same phase (that We are Able) this is the reason of the above oath\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "70:40",
            "55:17",
            "37:31",
            "43:14",
            "26:28",
            "73:9",
            "20:70",
            "23:76",
            "36:25",
            "2:258"
        ],
        "BIBLE": [
            "writings:job:20:25",
            "writings:ecclesiastes:5:15",
            "writings:psalms:88:16",
            "prophets:i%20samuel:14:5",
            "prophets:ezekiel:21:20",
            "prophets:isaiah:45:6",
            "torah:genesis:25:32",
            "prophets:hosea:10:3",
            "prophets:jeremiah:14:22",
            "prophets:isaiah:59:19"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:2",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:14",
            "Sefer%20Yetzirah:6:1"
        ]
    }
}