{
    "VERSE": "70:41",
    "ARABIC": "عَلَىٰٓ أَن نُّبَدِّلَ خَيْرًا مِّنْهُمْ وَمَا نَحْنُ بِمَسْبُوقِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "to replace them with something better than them. We will not be outstripped.",
        "TRANSLATION_1": "To bring better people than they in their place; and they will not be able to thwart Us.\n",
        "TRANSLATION_2": "to replace them by others who would be better than they; and We shall certainly not be overpowered.\n",
        "TRANSLATION_3": "to replace them by a better people and none can challenge Our power.\n",
        "TRANSLATION_4": "To replace them by those better than them; and none can escape from Us.\n",
        "TRANSLATION_5": "To replace them by (others) better than them; and We are not to be outrun.\n",
        "TRANSLATION_6": "To bring instead (others) better than them, and We shall not be overcome.\n",
        "TRANSLATION_7": "to substitute a better than they; We shall not be outstripped.\n",
        "TRANSLATION_8": "To replace them by (others) better than them. And we are not to be outrun.\n",
        "TRANSLATION_9": "to replace them with others better than them: nothing can prevent Us from doing this,\n",
        "TRANSLATION_10": "To replace them by others better than they; and We are not to be outrun.\n",
        "TRANSLATION_11": "to replace them with [others] better than them and We are not to be outmaneuvered.\n",
        "TRANSLATION_12": "Substitute for them better (men) than they; And We are not to be defeated (in Our Plan).\n",
        "TRANSLATION_13": "To replace them by (others) better than them; and We are not to be outrun.\n",
        "TRANSLATION_14": "to exchange them with others better than they; nothing can outstrip Us!\n",
        "TRANSLATION_15": "To replace them with better than they, and We are not to be outdone.\n",
        "TRANSLATION_16": "To replace them with better than them; and We are not to be outdone.\n",
        "TRANSLATION_17": "[70:41] to replace [them], to bring in their place, with [others] better than them, and We are not to be outmanoeuvred, [We will not be] frustrated in this.\n",
        "TRANSLATION_18": "(To replace them by (others) better than them) He says: We are Able to destroy them and replace them with others who are better and more obedient than them. (And We are not to be outrun) We are unable to replace them with others who are better than them.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "70:41",
            "80:7",
            "3:115",
            "68:32",
            "7:12",
            "3:104",
            "51:54",
            "23:56",
            "75:25",
            "3:54"
        ],
        "BIBLE": [
            "torah:exodus:18:21",
            "torah:genesis:19:12",
            "prophets:ii%20samuel:17:12",
            "torah:exodus:21:13",
            "writings:nehemiah:8:1",
            "torah:genesis:29:22",
            "prophets:i%20samuel:30:31",
            "prophets:judges:7:7",
            "prophets:jeremiah:50:30",
            "prophets:ezekiel:46:20"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:3:5"
        ]
    }
}