{
    "VERSE": "70:42",
    "ARABIC": "فَذَرْهُمْ يَخُوضُوا۟ وَيَلْعَبُوا۟ حَتَّىٰ يُلَٰقُوا۟ يَوْمَهُمُ ٱلَّذِى يُوعَدُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "So leave them to plunge and play around until they meet their Day which they are promised.",
        "TRANSLATION_1": "So leave them to their vain disputes and amusement till they meet their day (of reckoning) promised them,\n",
        "TRANSLATION_2": "So leave them to engage in vain talk and to amuse themselves until they come face to face with the Day which they are promised,\n",
        "TRANSLATION_3": "(Muhammad), leave them alone to dispute and play until they face the Day with which they have been threatened:\n",
        "TRANSLATION_4": "Therefore leave them, involved in their indecencies and play, till they confront their day which they are promised.\n",
        "TRANSLATION_5": "So, leave them to plunge in vain talk and play about, until they meet their Day which they are promised.\n",
        "TRANSLATION_6": "Therefore leave them alone to go on with the false discourses and to sport until they come face to face with that day of theirs with which they are threatened;\n",
        "TRANSLATION_7": "Then leave them alone to plunge and play until they encounter that day of theirs which they are promised,\n",
        "TRANSLATION_8": "So let them chat and play until they meet their Day which they are promised,\n",
        "TRANSLATION_9": "so leave them to indulge in vain idle talk and amuse themselves, until they face the Day which they have been promised,\n",
        "TRANSLATION_10": "Wherefore let thou them alone plunging in vanity and sporting until they meet their Day which they are promised.\n",
        "TRANSLATION_11": "So leave them to gossip and play till they encounter the day they are promised:\n",
        "TRANSLATION_12": "So leave them to plunge in vain talk and play about, until they encounter that Day of theirs which they have been promised!-\n",
        "TRANSLATION_13": "So leave them to plunge in vain talk and play about, until they meet their Day which they are promised.\n",
        "TRANSLATION_14": "So leave them alone to plunge and play, until they encounter the Day which they are promised;\n",
        "TRANSLATION_15": "So leave them to blunder and play, until they meet their Day which they are promised.\n",
        "TRANSLATION_16": "So leave them to converse vainly and amuse themselves until they meet their Day which they are promised -\n",
        "TRANSLATION_17": "[70:42] So leave them to indulge, in their falsehoods, and to play, in this world of theirs, until they encounter that day of theirs, in, which they are promised, chastisement;\n",
        "TRANSLATION_18": "(So let them) Muhammad, i.e. let those who mock you and the other disbelievers (chat) about falsehood (and play) and mock you while continuing to be disbelievers (until they meet) until they behold (their Day which they are promised) in which they are promised chastisement,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "70:42",
            "43:83",
            "52:45",
            "51:60",
            "26:87",
            "7:14",
            "70:26",
            "83:34",
            "36:59",
            "23:113"
        ],
        "BIBLE": [
            "prophets:hosea:4:15",
            "prophets:i%20samuel:18:10",
            "prophets:jeremiah:51:47",
            "prophets:ezekiel:16:16",
            "prophets:ii%20samuel:19:21",
            "prophets:isaiah:10:3",
            "prophets:ezekiel:23:39",
            "writings:psalms:73:14",
            "writings:ecclesiastes:2:21",
            "prophets:i%20samuel:26:21"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:4:5"
        ]
    }
}