{
    "VERSE": "70:43",
    "ARABIC": "يَوْمَ يَخْرُجُونَ مِنَ ٱلْأَجْدَاثِ سِرَاعًا كَأَنَّهُمْ إِلَىٰ نُصُبٍ يُوفِضُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "The Day they will emerge swiftly from their graves as if rushing to rally to the flag,",
        "TRANSLATION_1": "The day when they will come out of their graves in all haste as though rushing to their altars,\n",
        "TRANSLATION_2": "the Day on which they will hastily come forth from their graves, as though they were hurrying on to the altars of their deities.\n",
        "TRANSLATION_3": "the Day when they rush out of their graves as if racing towards a signpost,\n",
        "TRANSLATION_4": "A day when they will come out of the graves in haste, as if rushing towards their goals.\n",
        "TRANSLATION_5": "The Day when they will come out of the graves quickly as racing to a Nusub,\n",
        "TRANSLATION_6": "The day on which they shall come forth from their graves in haste, as if they were hastening on to a goal,\n",
        "TRANSLATION_7": "the day they shall come forth from the tombs hastily, as if they were hurrying unto a waymark,\n",
        "TRANSLATION_8": "The day when they come forth from the graves in haste, as racing to a goal,\n",
        "TRANSLATION_9": "the Day when they shall come out of their graves in haste, as if they were racing to a goal,\n",
        "TRANSLATION_10": "The Day whereon they shall come forth from the sepulchres hastily, as though they were to an altar hurrying.\n",
        "TRANSLATION_11": "the day when they emerge from graves, hastening, as if racing toward a target,\n",
        "TRANSLATION_12": "The Day whereon they will issue from their sepulchres in sudden haste as if they were rushing to a goal-post (fixed for them),-\n",
        "TRANSLATION_13": "The Day when they will come out of the graves quickly as racing to a goal,\n",
        "TRANSLATION_14": "the Day when they shall rush from their graves, as if they were hurrying to a raised flag,\n",
        "TRANSLATION_15": "The Day when they will emerge from the tombs in a rush, as though they were hurrying towards a target.\n",
        "TRANSLATION_16": "The Day they will emerge from the graves rapidly as if they were, toward an erected idol, hastening.\n",
        "TRANSLATION_17": "[70:43] the day when they will come forth from the graves hastening, to the site of the Gathering, as if racing to a [standing] target (nasbin: a variant reading has nusubin, meaning something that has been erected [mansūb], such as a flag or a banner),\n",
        "TRANSLATION_18": "Allah then explained when this chastisement will take place, saying: (The day when they come forth from the graves in haste) in response to the sound (as racing to a goal) or a banner,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "70:43",
            "54:7",
            "7:14",
            "83:11",
            "82:15",
            "51:12",
            "23:65",
            "51:13",
            "23:111",
            "36:51"
        ],
        "BIBLE": [
            "prophets:hosea:6:2",
            "prophets:i%20kings:14:14",
            "prophets:judges:2:18",
            "prophets:jeremiah:23:5",
            "writings:psalms:41:11",
            "writings:ii%20chronicles:8:8",
            "writings:psalms:107:25",
            "prophets:i%20samuel:2:35",
            "writings:psalms:30:2",
            "prophets:isaiah:49:11"
        ]
    }
}