{
    "VERSE": "70:8",
    "ARABIC": "يَوْمَ تَكُونُ ٱلسَّمَآءُ كَٱلْمُهْلِ",
    "ENGLISH": {
        "TRANSLATION_0": "On the Day the sky is like molten brass",
        "TRANSLATION_1": "The day the sky becomes like molten brass,\n",
        "TRANSLATION_2": "It shall befall on a Day whereon the sky will become like molten brass,\n",
        "TRANSLATION_3": "On the day when the heavens become like molten metal.\n",
        "TRANSLATION_4": "The day when the sky will be like molten silver.\n",
        "TRANSLATION_5": "The Day that the sky will be like the Al-Muhl.\n",
        "TRANSLATION_6": "On the day when the heaven shall be as molten copper\n",
        "TRANSLATION_7": "Upon the day when heaven shall be as molten copper\n",
        "TRANSLATION_8": "The day when the sky will become as molten copper,\n",
        "TRANSLATION_9": "On that Day the heavens shall become like molten brass,\n",
        "TRANSLATION_10": "It shall befall on a Day whereon the heaven shall become like Unto dregs of oil.\n",
        "TRANSLATION_11": "The day when the sky will be like molten copper,\n",
        "TRANSLATION_12": "The Day that the sky will be like molten brass,\n",
        "TRANSLATION_13": "The Day that the sky will be like the boiling filth of oil, (or molten copper or silver or lead, etc.).\n",
        "TRANSLATION_14": "On that Day the heaven shall become like molten copper,\n",
        "TRANSLATION_15": "On the Day when the sky will be like molten brass.\n",
        "TRANSLATION_16": "On the Day the sky will be like murky oil,\n",
        "TRANSLATION_17": "[70:8] The day when the heaven will be (yawma takūnu’l-samā’u is semantically connected to an omitted clause, implicitly taken to be yaqa‘u, ‘it will take place’) as molten silver,\n",
        "TRANSLATION_18": "Allah then explained when they will be chastised, saying: (The day when the sky will become as molten copper) and it is said: like the sediments of olive oil,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "70:8",
            "52:9",
            "79:6",
            "84:1",
            "82:1",
            "44:10",
            "25:25",
            "81:11",
            "77:9",
            "86:9"
        ],
        "BIBLE": [
            "torah:numbers:31:22",
            "prophets:ezekiel:22:20",
            "prophets:ezekiel:22:18",
            "torah:exodus:25:3",
            "prophets:ezekiel:27:12",
            "prophets:joshua:6:19",
            "torah:exodus:27:10",
            "writings:ecclesiastes:4:16",
            "prophets:hosea:2:23",
            "writings:ezra:7:22"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:4:11",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:3:8",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:4:6"
        ]
    }
}