{
    "VERSE": "7:10",
    "ARABIC": "وَلَقَدْ مَكَّنَّٰكُمْ فِى ٱلْأَرْضِ وَجَعَلْنَا لَكُمْ فِيهَا مَعَٰيِشَ قَلِيلًا مَّا تَشْكُرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "We have established you firmly on the earth and granted you your livelihood in it. What little thanks you show!",
        "TRANSLATION_1": "We settled you on the earth, and provided means of livelihood for you in it; but little are the thanks you give.\n",
        "TRANSLATION_2": "We assuredly established you in the earth and arranged for your livelihood in it. Little do you give thanks.\n",
        "TRANSLATION_3": "We have made you inhabit the land and provided you with the means of sustenance. Only a few of you give thanks.\n",
        "TRANSLATION_4": "And indeed We established you in the earth and in it created for you the means of livelihood; very little thanks do you offer!\n",
        "TRANSLATION_5": "And surely, We gave you authority on the earth and appointed for you therein livelihoods. Little thanks do you give.\n",
        "TRANSLATION_6": "And certainly We have established you in the earth and made in it means of livelihood for you; little it is that you give thanks.\n",
        "TRANSLATION_7": "We have established you in the earth and there appointed for you livelihood; little thanks you show.\n",
        "TRANSLATION_8": "And We have given you (mankind) power in the earth, and appointed for you therein livelihoods. Little give ye thanks!\n",
        "TRANSLATION_9": "We established you in the land and provided you with a means of livelihood there: yet you are seldom thankful.\n",
        "TRANSLATION_10": "And assuredly We established you in the earth and appointed for you livelihoods therein; yet little thanks ye return.\n",
        "TRANSLATION_11": "Certainly We have established you on the earth, and made in it [various] means of livelihood for you. Little do you thank.\n",
        "TRANSLATION_12": "It is We Who have placed you with authority on earth, and provided you therein with means for the fulfilment of your life: small are the thanks that ye give!\n",
        "TRANSLATION_13": "And surely, We gave you authority on the earth and appointed for you therein provisions (for your life). Little thanks do you give.\n",
        "TRANSLATION_14": "We established you in the earth and made for you a livelihood but little is it that you give thanks.\n",
        "TRANSLATION_15": "We have established you firmly on earth, and made for you in it livelihood—but rarely do you give thanks.\n",
        "TRANSLATION_16": "And We have certainly established you upon the earth and made for you therein ways of livelihood. Little are you grateful.\n",
        "TRANSLATION_17": "[7:10] And We have given you power, O Children of Adam, in the earth, and have appointed for you therein livelihoods (ma‘āyish is the plural of ma‘īsha), that is, the means by which you [are able to] subsist; little (qalīlan mā: mā is to emphasise the ‘littleness’) thanks you show, for this.\n",
        "TRANSLATION_18": "(And We have given you (mankind) power in the earth, and appointed for you therein) in the earth (a livelihood) that from which you eat, drink and clothe yourselves. (Little give you thanks!) you do not give thanks for what is great nor for the small; it is also said that this means: you give little thanks for all that is done for you.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:10",
            "12:73",
            "51:48",
            "23:84",
            "15:19",
            "15:20",
            "91:6",
            "99:2",
            "43:60",
            "29:39"
        ],
        "BIBLE": [
            "torah:numbers:33:53",
            "prophets:jeremiah:25:5",
            "prophets:joshua:1:15",
            "writings:ii%20chronicles:6:27",
            "torah:deuteronomy:12:1",
            "prophets:i%20kings:8:36",
            "torah:genesis:45:21",
            "writings:proverbs:8:29",
            "prophets:ezekiel:33:24",
            "prophets:jeremiah:35:15"
        ]
    }
}