{
    "VERSE": "7:101",
    "ARABIC": "تِلْكَ ٱلْقُرَىٰ نَقُصُّ عَلَيْكَ مِنْ أَنۢبَآئِهَا وَلَقَدْ جَآءَتْهُمْ رُسُلُهُم بِٱلْبَيِّنَٰتِ فَمَا كَانُوا۟ لِيُؤْمِنُوا۟ بِمَا كَذَّبُوا۟ مِن قَبْلُ كَذَٰلِكَ يَطْبَعُ ٱللَّهُ عَلَىٰ قُلُوبِ ٱلْكَٰفِرِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "These cities - We have given you news of them. Their Messengers came to them with Clear Signs, but they were never going to have iman in what they had previously rejected. That is how Allah seals up the hearts of the kuffar.",
        "TRANSLATION_1": "These were the (earlier) habitations whose accounts We have given to you. Their apostles came with clear proofs, but they did not believe what they once denied. That is how God seals the hearts of those who do not believe.\n",
        "TRANSLATION_2": "To those [earlier] communities - some of whose stories We relate to you - there had indeed come Messengers with clear proofs, but they would not believe what they had once rejected as false. Thus it is that Allah seals the hearts of those who deny the truth.\n",
        "TRANSLATION_3": "(Muhammad), such were the stories of the people who lived in (different) towns in the past. We had sent Our Messengers to them with (certain) miracles but the people still did not believe in what they had rejected before. Such is how God seals the hearts of the unbelievers.\n",
        "TRANSLATION_4": "These are the dwellings – the affairs of which We relate to you (Prophet Mohammed – peace and blessings be upon him); and indeed their (respective) Noble Messengers came to them with clear proofs; so they were not able to believe in what they had denied before; this is how Allah sets seals upon the hearts of disbelievers.\n",
        "TRANSLATION_5": "Those were the towns whose story We relate unto you. And there came indeed to them their Messengers with clear proofs, but they were not such who would believe in what they rejected before. Thus Allah does seal up the hearts of the disbelievers.\n",
        "TRANSLATION_6": "These towns-- We relate to you some of their stories, and certainly their apostles came to them with clear arguments, but they would not believe in what they rejected at first; thus does Allah set a seal over the hearts of the unbelievers\n",
        "TRANSLATION_7": "Those cities We relate to thee tidings of; their Messengers came to them with the clear signs, but they were not the ones to believe in that they had cried lies before; so God seals the hearts of the unbelievers.\n",
        "TRANSLATION_8": "Such were the townships. We relate some tidings of them unto thee (Muhammad). Their messengers verily came unto them with clear proofs (of Allah's Sovereignty), but they could not believe because they had before denied. Thus doth Allah print upon the hearts of disbelievers (that they hear not).\n",
        "TRANSLATION_9": "We have told you the stories of those towns: their messengers came to them with clear signs, but they were never going to believe in something they had already rejected. Thus God seals up the hearts of those who deny the truth.\n",
        "TRANSLATION_10": "Those townships! We recount unto thee some tidings thereof. Assuredly there came unto them their apostles with evidences, but they were not such as to believe that which they had erst belied. Thus doth Allah put a seal upon the hearts of the infidels.\n",
        "TRANSLATION_11": "These are the towns some of whose accounts We recount to you. Their apostles certainly brought them manifest proofs, but they were not the ones to believe in what they had denied earlier. Thus does Allah put a seal on the hearts of the faithless.\n",
        "TRANSLATION_12": "Such were the towns whose story We (thus) relate unto thee: There came indeed to them their messengers with clear (signs): But they would not believe what they had rejected before. Thus doth Allah seal up the hearts of those who reject faith.\n",
        "TRANSLATION_13": "Those were the towns whose story We relate unto you (O Muhammad SAW). And there came indeed to them their Messengers with clear proofs, but they were not such as to believe in that which they had rejected before. Thus Allah does seal up the hearts of the disbelievers (from each and every kind of religious guidance).\n",
        "TRANSLATION_14": "Those villages We narrate their news to you. Their Messengers came to them with clear proofs, yet they would not believe what they had belied before; as such Allah seals the hearts of the unbelievers.\n",
        "TRANSLATION_15": "These towns—We narrate to you some of their tales. Their messengers came to them with the clear signs, but they would not believe in what they had rejected previously. Thus God seals the hearts of the disbelievers.\n",
        "TRANSLATION_16": "Those cities - We relate to you, [O Muhammad], some of their news. And certainly did their messengers come to them with clear proofs, but they were not to believe in that which they had denied before. Thus does Allah seal over the hearts of the disbelievers.\n",
        "TRANSLATION_17": "[7:101] Those towns, which have been mentioned, We relate to you, O Muhammad (s), some of their tidings, [some of] the stories of their peoples. Verily their messengers brought them clear proofs, manifest miracles, but they would not believe, when these [signs]came to them, in what they had denied, disbelieved in, before, before these [signs] came to them; nay, they persisted in disbelief. Thus does God seal up the hearts of the disbelievers.\n",
        "TRANSLATION_18": "(Such were the townships) whose people We had destroyed. (We relate) We send you Gabriel with (some tidings of them) with the story of their destruction (unto thee (Muhammad). Their messengers verily came unto them with clear proofs) with commands, prohibitions and signs, (but they could not believe) in the Scriptures or messengers (because they had before denied) i.e. on the Day of the Covenant; it is also said the last of nations did not believe in that which the first of nations disbelieved. (Thus doth Allah print upon) seal (the hearts of disbelievers) in Allah as it is in the knowledge of Allah.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:101",
            "6:34",
            "40:34",
            "10:74",
            "4:164",
            "10:13",
            "3:183",
            "6:10",
            "21:41",
            "58:5"
        ],
        "BIBLE": [
            "torah:deuteronomy:26:10",
            "writings:ezra:8:17",
            "writings:i%20chronicles:29:14",
            "writings:daniel:10:12",
            "writings:ii%20chronicles:35:21",
            "prophets:joshua:15:19",
            "writings:lamentations:1:11",
            "prophets:i%20samuel:10:9",
            "writings:ecclesiastes:1:13",
            "writings:job:42:11"
        ]
    }
}