{
    "VERSE": "7:102",
    "ARABIC": "وَمَا وَجَدْنَا لِأَكْثَرِهِم مِّنْ عَهْدٍ وَإِن وَجَدْنَآ أَكْثَرَهُمْ لَفَٰسِقِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "We did not find many of them worthy of their contract. We found most of them deviators.",
        "TRANSLATION_1": "We did not find many of them faithful to their promises, and found many of them disobedient.\n",
        "TRANSLATION_2": "We did not find most of them true to their covenants; indeed We found most of them to he transgressors.\n",
        "TRANSLATION_3": "We did not find many among them keeping their promises. However, We did find many evil-doers among them.\n",
        "TRANSLATION_4": "And We found most of them not true to their words; and indeed We found most of them disobedient.\n",
        "TRANSLATION_5": "And most of them We found not true to their covenant, but most of them We found indeed rebellious.\n",
        "TRANSLATION_6": "And We did not find in most of them any (faithfulness to) covenant, and We found most of them to be certainly transgressors.\n",
        "TRANSLATION_7": "We found no covenant in the most part of them; indeed, We found the most part of them ungodly.\n",
        "TRANSLATION_8": "We found no (loyalty to any) covenant in most of them. Nay, most of them We found wrong-doers.\n",
        "TRANSLATION_9": "We found most of them untrue to their covenants, indeed We found most of them to be defiant.\n",
        "TRANSLATION_10": "And We found no covenant in most of them; and most of them We found ungodly.\n",
        "TRANSLATION_11": "We did not find in most of them any [loyalty to] covenants. Indeed, We found most of them to be transgressors.\n",
        "TRANSLATION_12": "Most of them We found not men (true) to their covenant: but most of them We found rebellious and disobedient.\n",
        "TRANSLATION_13": "And most of them We found not (true) to their covenant, but most of them We found indeed Fasiqun (rebellious, disobedient to Allah).\n",
        "TRANSLATION_14": "We did not find the covenant upheld by the majority of them, but We found most of them evildoers.\n",
        "TRANSLATION_15": "We found most of them untrue to their covenants; We found most of them corrupt.\n",
        "TRANSLATION_16": "And We did not find for most of them any covenant; but indeed, We found most of them defiantly disobedient.\n",
        "TRANSLATION_17": "[7:102] And We did not find in most of them, that is, people, any covenant, that is, any loyalty to a covenant from the day the pledge was made. Nay (wa-in: in is softened) We found that most of them were indeed wicked.\n",
        "TRANSLATION_18": "(We found no (loyalty to any) covenant) the first covenant (in most of them. Nay, most of them) all of them (We found wrong-doers) breakers of covenants.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:102",
            "36:7",
            "2:100",
            "26:139",
            "26:8",
            "26:190",
            "26:174",
            "26:121",
            "26:103",
            "26:67"
        ],
        "BIBLE": [
            "prophets:jeremiah:11:3",
            "prophets:i%20kings:13:21",
            "prophets:ezekiel:2:6",
            "writings:psalms:17:4",
            "prophets:jeremiah:11:2",
            "writings:i%20chronicles:10:13",
            "prophets:isaiah:29:11",
            "writings:proverbs:30:6",
            "prophets:jeremiah:34:18",
            "writings:proverbs:29:20"
        ]
    }
}