{
    "VERSE": "7:104",
    "ARABIC": "وَقَالَ مُوسَىٰ يَٰفِرْعَوْنُ إِنِّى رَسُولٌ مِّن رَّبِّ ٱلْعَٰلَمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Musa said, 'Pharaoh! I am truly a Messenger from the Lord of all the worlds,",
        "TRANSLATION_1": "Moses said: \"O Pharaoh, I have been sent by the Lord of all the worlds;\n",
        "TRANSLATION_2": "And Moses said: 'O Pharaoh! I am a Messenger from the Lord of the universe.\n",
        "TRANSLATION_3": "Moses told the Pharaoh, \"I am a Messengers from the Lord of the Universe.\n",
        "TRANSLATION_4": "And Moosa said, “O Firaun! Indeed I am a Noble Messenger from the Lord Of The Creation.”\n",
        "TRANSLATION_5": "And Musa said: \"O Fir`awn! Verily, I am a Messenger from the Lord of all that exists.\"\n",
        "TRANSLATION_6": "And Musa said: O Firon! surely I am an apostle from the Lord of the worlds:\n",
        "TRANSLATION_7": "Moses said, 'Pharaoh, I am a Messenger from the Lord of all Being,\n",
        "TRANSLATION_8": "Moses said: O Pharaoh! Lo! I am a messenger from the Lord of the Worlds,\n",
        "TRANSLATION_9": "Moses said, \"Pharaoh, I am a messenger from the Lord of the Universe,\n",
        "TRANSLATION_10": "And Musa said: O Fir'awn! I am an apostle from the Lord of the worlds;\n",
        "TRANSLATION_11": "And Moses said, ‘O Pharaoh, I am indeed an apostle from the Lord of all the worlds.\n",
        "TRANSLATION_12": "Moses said: \"O Pharaoh! I am a messenger from the Lord of the worlds,-\n",
        "TRANSLATION_13": "And Musa (Moses) said: \"O Fir'aun (Pharaoh)! I am a Messenger from the Lord of the 'Alamin (mankind, jinns and all that exists).\n",
        "TRANSLATION_14": "Moses said: 'Pharaoh, I am a Messenger from the Lord of the Worlds,\n",
        "TRANSLATION_15": "Moses said, “O Pharaoh, I am a messenger from the Lord of the Worlds.”\n",
        "TRANSLATION_16": "And Moses said, \"O Pharaoh, I am a messenger from the Lord of the worlds\n",
        "TRANSLATION_17": "[7:104] And Moses said, ‘O Pharaoh, I am a messenger from the Lord of the Worlds, to you, but he denied him. So he [Moses] said:\n",
        "TRANSLATION_18": "(Moses said: Pharaoh! Lo! I am a messenger from the Lord of the Worlds) to you, but Pharaoh said: \"You are lying!\"\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:104",
            "26:16",
            "23:51",
            "43:46",
            "26:23",
            "7:61",
            "7:67",
            "26:192",
            "69:43",
            "56:80"
        ],
        "BIBLE": [
            "torah:exodus:11:9",
            "torah:leviticus:8:5",
            "prophets:isaiah:38:11",
            "torah:exodus:6:30",
            "torah:numbers:12:11",
            "writings:psalms:142:6",
            "torah:numbers:16:28",
            "torah:exodus:6:2",
            "torah:numbers:12:2",
            "torah:numbers:12:13"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:3:5",
            "Sefer%20Yetzirah:3:7"
        ]
    }
}