{
    "VERSE": "7:106",
    "ARABIC": "قَالَ إِن كُنتَ جِئْتَ بِـَٔايَةٍ فَأْتِ بِهَآ إِن كُنتَ مِنَ ٱلصَّٰدِقِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "He said, 'If you have come with a Clear Sign produce it if you are telling the truth.'",
        "TRANSLATION_1": "He said: \"If you have brought a sign then display it, if what you say is true.\"\n",
        "TRANSLATION_2": "Pharaoh said: if you have brought a sign, then bring it forth if you are truthful.'\n",
        "TRANSLATION_3": "The Pharaoh asked Moses to show his miracles if he was telling the truth.\n",
        "TRANSLATION_4": "Said Firaun, “If you have come with a sign, then present it if you are truthful!”\n",
        "TRANSLATION_5": "[Fir`awn] said: \"If you have come with a sign, show it forth, if you are one of those who tell the truth.\"\n",
        "TRANSLATION_6": "He said: If you have come with a sign, then bring it, if you are of the truthful ones.\n",
        "TRANSLATION_7": "Said he, 'If thou hast brought a sign, produce it, if thou speakest truly.'\n",
        "TRANSLATION_8": "(Pharaoh) said: If thou comest with a token, then produce it, if thou art of those who speak the truth.\n",
        "TRANSLATION_9": "[Pharaoh] said, \"If you come with a sign, then produce it, if you are telling the truth.\"\n",
        "TRANSLATION_10": "He said: if thou hast brought a sign, forth with it then, if thou art of the truth-tellers.\n",
        "TRANSLATION_11": "He said, ‘If you have brought a sign, produce it, should you be truthful.’\n",
        "TRANSLATION_12": "(Pharaoh) said: \"If indeed thou hast come with a Sign, show it forth,- if thou tellest the truth.\"\n",
        "TRANSLATION_13": "[Fir'aun (Pharaoh)] said: \"If you have come with a sign, show it forth, - if you are one of those who tell the truth.\"\n",
        "TRANSLATION_14": "He answered: 'If you have come with a sign, show it to us if you are of the truthful'\n",
        "TRANSLATION_15": "He said, “If you brought a miracle, then present it, if you are truthful.”\n",
        "TRANSLATION_16": "[Pharaoh] said, \"If you have come with a sign, then bring it forth, if you should be of the truthful.\"\n",
        "TRANSLATION_17": "[7:106] Said he, Pharaoh, to him: ‘If you have come with a sign, as you claim, then produce it, if you are of those who speak the truth’, in this.\n",
        "TRANSLATION_18": "((Pharaoh) said: If thou comest with a token) with a sign, (then produce it, if you are of those who speak the Truth) and if you are indeed a messenger.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:106",
            "39:59",
            "26:31",
            "7:132",
            "78:28",
            "20:23",
            "26:154",
            "43:47",
            "7:174",
            "43:69"
        ],
        "BIBLE": [
            "torah:deuteronomy:1:14",
            "prophets:i%20kings:11:22",
            "prophets:zechariah:4:5",
            "prophets:ii%20kings:4:13",
            "prophets:ii%20samuel:1:8",
            "prophets:judges:6:17",
            "prophets:zechariah:6:5",
            "writings:job:33:32",
            "prophets:judges:6:13",
            "prophets:zechariah:4:13"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:4:5"
        ]
    }
}