{
    "VERSE": "7:108",
    "ARABIC": "وَنَزَعَ يَدَهُۥ فَإِذَا هِىَ بَيْضَآءُ لِلنَّٰظِرِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "And he drew out his hand and there it was, pure white to those who looked.",
        "TRANSLATION_1": "And he drew forth his hand, and behold, it looked white to those who beheld it.\n",
        "TRANSLATION_2": "Then he drew out his hand, and it appeared luminous to all beholders.\n",
        "TRANSLATION_3": "Then he uncovered his hand and it appeared sheer white to the onlookers.\n",
        "TRANSLATION_4": "And putting his hand in his bosom, withdrew it – so it shone brightly before the beholders.\n",
        "TRANSLATION_5": "And he drew out his hand, and behold! it was white (with radiance) for the beholders.\n",
        "TRANSLATION_6": "And he drew forth his hand, and lo! it was white to the beholders.\n",
        "TRANSLATION_7": "And he drew forth his hand, and lo, it was white to the beholders.\n",
        "TRANSLATION_8": "And he drew forth his hand (from his bosom), and lo! it was white for the beholders.\n",
        "TRANSLATION_9": "and he drew forth his hand, and it appeared [shining] white to the beholders.\n",
        "TRANSLATION_10": "And he drew forth his hand, when lo: it was white unto the beholders.\n",
        "TRANSLATION_11": "Then he drew out his hand, and behold, it was white to the onlookers.\n",
        "TRANSLATION_12": "And he drew out his hand, and behold! it was white to all beholders!\n",
        "TRANSLATION_13": "And he drew out his hand, and behold! it was white (with radiance) for the beholders.\n",
        "TRANSLATION_14": "Then he drew out his hand and it was luminous to the onlookers.\n",
        "TRANSLATION_15": "And He pulled out his hand, and it was white to the onlookers.\n",
        "TRANSLATION_16": "And he drew out his hand; thereupon it was white [with radiance] for the observers.\n",
        "TRANSLATION_17": "[7:108] And he drew forth his hand, he took it out from his bosom, and lo! it was white, radiant, for the beholders, and not its usual skin colour.\n",
        "TRANSLATION_18": "(And he drew forth his hand) from his armpit: (and lo! it was white) shining (for the beholders) who looked at it.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:108",
            "26:33",
            "9:67",
            "37:46",
            "7:149",
            "70:2",
            "38:44",
            "3:50",
            "38:75",
            "68:50"
        ],
        "BIBLE": [
            "writings:psalms:74:11",
            "torah:exodus:4:6",
            "prophets:ezekiel:2:9",
            "torah:exodus:4:7",
            "torah:exodus:2:19",
            "prophets:joshua:5:13",
            "prophets:joshua:8:26",
            "torah:genesis:38:29",
            "prophets:i%20samuel:17:40",
            "torah:exodus:15:9"
        ]
    }
}