{
    "VERSE": "7:109",
    "ARABIC": "قَالَ ٱلْمَلَأُ مِن قَوْمِ فِرْعَوْنَ إِنَّ هَٰذَا لَسَٰحِرٌ عَلِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "The ruling circle of Pharaoh's people said, 'This is certainly a skilled magician",
        "TRANSLATION_1": "The nobles of Pharaoh said: \"He surely is a clever magician.\n",
        "TRANSLATION_2": "The elders of Pharaoh's people said: 'Surely this man is a skilful magician\n",
        "TRANSLATION_3": "Some of the Pharaoh's nobles considered him to be no more than a skillful magician\n",
        "TRANSLATION_4": "Said the chieftains of Firaun’s people, “He is really an expert magician.”\n",
        "TRANSLATION_5": "The chiefs of the people of Fir`awn said: \"This is indeed a well-versed sorcerer.\"\n",
        "TRANSLATION_6": "The chiefs of Firon's people said: most surely this is an enchanter possessed of knowledge:\n",
        "TRANSLATION_7": "Said the Council of the people of Pharaoh, 'Surely this man is a cunning sorcerer\n",
        "TRANSLATION_8": "The chiefs of Pharaoh's people said: Lo! this is some knowing wizard,\n",
        "TRANSLATION_9": "The chiefs of Pharaoh's people said, \"This is most surely a skillful magician,\n",
        "TRANSLATION_10": "The chiefs of the people of Fir'awn said: verily this is a magician knowing.\n",
        "TRANSLATION_11": "The elite of Pharaoh’s people said, ‘This is indeed an expert magician;\n",
        "TRANSLATION_12": "Said the Chiefs of the people of Pharaoh: \"This is indeed a sorcerer well-versed.\n",
        "TRANSLATION_13": "The chiefs of the people of Fir'aun (Pharaoh) said: \"This is indeed a well-versed sorcerer;\n",
        "TRANSLATION_14": "The assembly of Pharaoh's nation said: 'This man is a wellversed sorcerer\n",
        "TRANSLATION_15": "The notables among Pharaoh’s people said, “This is really a skilled magician.”\n",
        "TRANSLATION_16": "Said the eminent among the people of Pharaoh, \"Indeed, this is a learned magician\n",
        "TRANSLATION_17": "[7:109] The council of Pharaoh’s folk said, ‘Surely this man is a cunning sorcerer, outstanding in the art of magic, in [sūrat] al-Shu‘arā’ [Q. 26:34], these are actually Pharaoh’s words, and so it is as if they said it in consultation with him,\n",
        "TRANSLATION_18": "(The chiefs of Pharaoh's people said: Lo! this is some knowing wizard) who is proficient in wizardry, 169\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:109",
            "26:34",
            "7:60",
            "7:90",
            "23:46",
            "7:66",
            "29:28",
            "21:106",
            "26:160",
            "26:105"
        ],
        "BIBLE": [
            "torah:genesis:44:15",
            "torah:numbers:11:16",
            "prophets:jeremiah:31:34",
            "prophets:isaiah:61:9",
            "prophets:jeremiah:26:17",
            "writings:daniel:2:10",
            "prophets:i%20kings:20:8",
            "prophets:ezekiel:38:14",
            "writings:ruth:4:4",
            "torah:exodus:3:7"
        ]
    }
}