{
    "VERSE": "7:110",
    "ARABIC": "يُرِيدُ أَن يُخْرِجَكُم مِّنْ أَرْضِكُمْ فَمَاذَا تَأْمُرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "who desires to expel you from your land, so what do you recommend?'",
        "TRANSLATION_1": "He wishes to drive you away from the land. So what do you advise?\"\n",
        "TRANSLATION_2": "who seeks to drive you out from your land. What would you have us do?'\n",
        "TRANSLATION_3": "and said, \"He wants to expel you from your land.\" They asked (others), \" what is your opinion in the matter?\n",
        "TRANSLATION_4": "“He wishes to expel you all from your kingdom; so what do you advise?”\n",
        "TRANSLATION_5": "He wants to get you out of your land, so what do you advise\"\n",
        "TRANSLATION_6": "He intends to turn you out of your land. What counsel do you then give?\n",
        "TRANSLATION_7": "who desires to expel you from your land; what do you command?'\n",
        "TRANSLATION_8": "Who would expel you from your land. Now what do ye advise?\n",
        "TRANSLATION_9": "who seeks to drive you from your land!\" Pharaoh said, \"What then do you advise?\"\n",
        "TRANSLATION_10": "He would drive you forth from your land; so what is it that ye enjoin?\n",
        "TRANSLATION_11": "he seeks to expel you from your land.’ ‘So what do you advise?’\n",
        "TRANSLATION_12": "His plan is to get you out of your land: then what is it ye counsel?\"\n",
        "TRANSLATION_13": "He wants to get you out of your land, so what do you advise?\"\n",
        "TRANSLATION_14": "who seeks to drive you from your land what do you command'\n",
        "TRANSLATION_15": "“He wants to evict you from your land, so what do you recommend?”\n",
        "TRANSLATION_16": "Who wants to expel you from your land [through magic], so what do you instruct?\"\n",
        "TRANSLATION_17": "[7:110] who would expel you from your land. So what do you command?’\n",
        "TRANSLATION_18": "(Who would expel you from your land) the land of Egypt. (Now what do ye advise?) Pharaoh said to them: \"What do you advise that we should do concerning this matter?\"\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:110",
            "26:35",
            "47:22",
            "67:16",
            "67:24",
            "51:48",
            "17:103",
            "23:79",
            "77:25",
            "69:8"
        ],
        "BIBLE": [
            "torah:exodus:6:1",
            "torah:exodus:32:8",
            "torah:deuteronomy:9:12",
            "prophets:i%20kings:2:15",
            "prophets:i%20samuel:15:30",
            "prophets:jeremiah:29:14",
            "prophets:ezekiel:11:17",
            "torah:exodus:14:5",
            "prophets:isaiah:12:1",
            "prophets:ii%20samuel:15:31"
        ]
    }
}