{
    "VERSE": "7:115",
    "ARABIC": "قَالُوا۟ يَٰمُوسَىٰٓ إِمَّآ أَن تُلْقِىَ وَإِمَّآ أَن نَّكُونَ نَحْنُ ٱلْمُلْقِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "They said, 'Musa, will you throw first or shall we be the ones to throw?'",
        "TRANSLATION_1": "So they said: \"O Moses, you may cast your spell first, or we shall cast ours.\"\n",
        "TRANSLATION_2": "Then they said: 'O Moses, will you [first] throw your rod, or shall we throw?'\n",
        "TRANSLATION_3": "The magicians asked Moses, \"Will you throw your staff first or shall we?\"\n",
        "TRANSLATION_4": "They said, “O Moosa! You may throw first – or shall we be the first to throw?”\n",
        "TRANSLATION_5": "They said: \"O Musa! Either you throw (first), or shall we have the (first) throw\"\n",
        "TRANSLATION_6": "They said: O Musa! will you cast, or shall we be the first to cast?\n",
        "TRANSLATION_7": "They said, 'Moses, wilt thou cast, or shall we be the casters?'\n",
        "TRANSLATION_8": "They said: O Moses! Either throw (first) or let us be the first throwers?\n",
        "TRANSLATION_9": "They said, \"Moses, will you first throw, or shall we?\"\n",
        "TRANSLATION_10": "They said: O Musa! either thou cast down, or we shall be the ones to cast down.\n",
        "TRANSLATION_11": "They said, ‘O Moses, will you throw [first], or shall we throw?’\n",
        "TRANSLATION_12": "They said: \"O Moses! wilt thou throw (first), or shall we have the (first) throw?\"\n",
        "TRANSLATION_13": "They said: \"O Musa (Moses)! Either you throw (first), or shall we have the (first) throw?\"\n",
        "TRANSLATION_14": "They said: 'Moses, will you throw first or shall we be the throwers'\n",
        "TRANSLATION_15": "They said, “O Moses! Either you throw, or we are the ones to throw.”\n",
        "TRANSLATION_16": "They said, \"O Moses, either you throw [your staff], or we will be the ones to throw [first].\"\n",
        "TRANSLATION_17": "[7:115] They said, ‘O Moses, either you cast, your staff, or we shall be the casters!’, of what we have.\n",
        "TRANSLATION_18": "(They said: Moses! Either throw) first (or let us be the first throwers)?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:115",
            "20:65",
            "53:53",
            "7:120",
            "37:116",
            "28:31",
            "37:104",
            "15:32",
            "109:1",
            "20:19"
        ],
        "BIBLE": [
            "prophets:jeremiah:23:33",
            "prophets:isaiah:66:5",
            "prophets:ii%20kings:9:33",
            "writings:esther:5:3",
            "torah:exodus:20:16",
            "torah:genesis:33:9",
            "prophets:zephaniah:3:16",
            "prophets:zechariah:1:9",
            "torah:genesis:37:20",
            "torah:genesis:43:5"
        ]
    }
}