{
    "VERSE": "7:117",
    "ARABIC": "وَأَوْحَيْنَآ إِلَىٰ مُوسَىٰٓ أَنْ أَلْقِ عَصَاكَ فَإِذَا هِىَ تَلْقَفُ مَا يَأْفِكُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "We revealed to Musa, 'Throw down your staff.' And it immediately swallowed up what they had forged.",
        "TRANSLATION_1": "We said to Moses: \"Throw down your staff;\" and it swallowed up their conjurations in no time.\n",
        "TRANSLATION_2": "Then We directed Moses: 'Now you throw your rod.' And lo! it swallowed up all their false devices.\n",
        "TRANSLATION_3": "We inspired Moses to throw his staff, and suddenly it began to swallow-up all that the magicians had (falsely) invented.\n",
        "TRANSLATION_4": "And We inspired Moosa that, “Put forth your staff”; it immediately began swallowing up their fabrications.\n",
        "TRANSLATION_5": "And We revealed to Musa (saying): \"Throw your stick,\" and behold! It swallowed up straight away all the falsehood which they showed.\n",
        "TRANSLATION_6": "And We revealed to Musa, saying: Cast your rod; then lo! it devoured the lies they told.\n",
        "TRANSLATION_7": "And We revealed to Moses: 'Cast thy staff!' And lo, it forthwith swallowed up their lying invention.\n",
        "TRANSLATION_8": "And We inspired Moses (saying): Throw thy staff! And lo! it swallowed up their lying show.\n",
        "TRANSLATION_9": "Then We inspired Moses, saying, \"Throw down your staff.\" And it immediately swallowed up their false devices.\n",
        "TRANSLATION_10": "And we revealed unto Musa: cast down thy rod. And lo! it Was swallowing up that which they had feigned.\n",
        "TRANSLATION_11": "And We signalled to Moses: ‘Throw down your staff.’ And behold, it was swallowing what they had faked.\n",
        "TRANSLATION_12": "We put it into Moses's mind by inspiration: \"Throw (now) thy rod\": and behold! it swallows up straight away all the falsehoods which they fake!\n",
        "TRANSLATION_13": "And We inspired Musa (Moses) (saying): \"Throw your stick,\" and behold! It swallowed up straight away all the falsehoods which they showed.\n",
        "TRANSLATION_14": "Then We revealed to Moses: 'Now, throw down your staff' And thereupon it swallowed up their false invention.\n",
        "TRANSLATION_15": "And We inspired Moses: “Throw your staff.” And at once, it swallowed what they were faking.\n",
        "TRANSLATION_16": "And We inspired to Moses, \"Throw your staff,\" and at once it devoured what they were falsifying.\n",
        "TRANSLATION_17": "[7:117] And We revealed to Moses [saying]: ‘Cast your staff.’ And lo! it swallowed up (read talaqqafu, with one of the original tā’ letters [of tatalaqqafu] omitted) the illusion they were creating, that which they were transforming by delusion.\n",
        "TRANSLATION_18": "(And We inspired Moses (saying): Throw thy staff!) and he threw it. (And lo! it swallowed up their lying show) their staffs and ropes.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:117",
            "26:45",
            "28:31",
            "7:107",
            "36:76",
            "27:10",
            "20:13",
            "51:45",
            "20:66",
            "26:63"
        ],
        "BIBLE": [
            "prophets:ii%20kings:6:6",
            "prophets:ezekiel:37:19",
            "prophets:jeremiah:15:1",
            "torah:exodus:7:9",
            "writings:ii%20chronicles:23:3",
            "torah:exodus:4:4",
            "prophets:ii%20kings:9:33",
            "torah:numbers:15:35",
            "torah:genesis:41:24",
            "prophets:ii%20kings:2:21"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:13",
            "Sefer%20Yetzirah:2:1"
        ]
    }
}