{
    "VERSE": "7:118",
    "ARABIC": "فَوَقَعَ ٱلْحَقُّ وَبَطَلَ مَا كَانُوا۟ يَعْمَلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "So the Truth took place and what they did was shown to be false.",
        "TRANSLATION_1": "Thus the truth was upheld, and the falsehood that they practised was exposed.\n",
        "TRANSLATION_2": "Thus was the truth established, and their doings proved in vain.\n",
        "TRANSLATION_3": "Thus the Truth prevailed and their false art was banished.\n",
        "TRANSLATION_4": "So the truth was proved and their works were disproved.\n",
        "TRANSLATION_5": "Thus truth was confirmed, and all that they did was made of no effect.\n",
        "TRANSLATION_6": "So the truth was established, and what they did became null.\n",
        "TRANSLATION_7": "So the truth came to pass, and false was proved what they were doing.\n",
        "TRANSLATION_8": "Thus was the Truth vindicated and that which they were doing was made vain.\n",
        "TRANSLATION_9": "Thus the truth prevailed and what they had produced came to nothing:\n",
        "TRANSLATION_10": "Thus the truth prevailed, and that which they had brought vanished.\n",
        "TRANSLATION_11": "So the truth came out, and what they had wrought was reduced to naught.\n",
        "TRANSLATION_12": "Thus truth was confirmed, and all that they did was made of no effect.\n",
        "TRANSLATION_13": "Thus truth was confirmed, and all that they did was made of no effect.\n",
        "TRANSLATION_14": "So, the truth prevailed and what they were doing was annulled;\n",
        "TRANSLATION_15": "So the truth came to pass, and what they were producing came to nothing.\n",
        "TRANSLATION_16": "So the truth was established, and abolished was what they were doing.\n",
        "TRANSLATION_17": "[7:118] Thus did the truth come to pass, [thus was it] confirmed and made manifest; and that which they were doing, in the way of sorcery, was proved false.\n",
        "TRANSLATION_18": "(Thus was the Truth vindicated) it became clear that Moses was right (and that which they were doing) of sorcery (was made vain) fizzled away.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:118",
            "38:84",
            "34:49",
            "24:49",
            "21:18",
            "15:55",
            "7:181",
            "37:116",
            "37:37",
            "23:90"
        ],
        "BIBLE": [
            "writings:nehemiah:6:16",
            "writings:nehemiah:4:10",
            "prophets:isaiah:26:12",
            "torah:genesis:22:1",
            "writings:nehemiah:4:9",
            "prophets:i%20kings:13:20",
            "prophets:i%20kings:7:14",
            "torah:exodus:36:4",
            "writings:ii%20chronicles:12:1",
            "prophets:joshua:21:45"
        ]
    }
}