{
    "VERSE": "7:119",
    "ARABIC": "فَغُلِبُوا۟ هُنَالِكَ وَٱنقَلَبُوا۟ صَٰغِرِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "They were defeated then and there, transformed into humbled men.",
        "TRANSLATION_1": "Thus there and then they were vanquished and overthrown, humiliated.\n",
        "TRANSLATION_2": "Pharaoh and his men were defeated and put to shame,\n",
        "TRANSLATION_3": "The magicians who were defeated on the spot and were proved to be worthless,\n",
        "TRANSLATION_4": "They were therefore defeated here and they turned back humiliated.\n",
        "TRANSLATION_5": "So they were defeated there and returned disgraced.\n",
        "TRANSLATION_6": "Thus they were vanquished there, and they went back abased.\n",
        "TRANSLATION_7": "So they were vanquished there, and they turned about, humbled.\n",
        "TRANSLATION_8": "Thus were they there defeated and brought low.\n",
        "TRANSLATION_9": "Pharaoh and his men were defeated and utterly humiliated.\n",
        "TRANSLATION_10": "Thus they were overcome and made to look abiect.\n",
        "TRANSLATION_11": "Thereat they were vanquished, and they retreated, humiliated.\n",
        "TRANSLATION_12": "So the (great ones) were vanquished there and then, and were made to look small.\n",
        "TRANSLATION_13": "So they were defeated there and then, and were returned disgraced.\n",
        "TRANSLATION_14": "they were defeated and turned belittled,\n",
        "TRANSLATION_15": "There they were defeated, and utterly reduced.\n",
        "TRANSLATION_16": "And Pharaoh and his people were overcome right there and became debased.\n",
        "TRANSLATION_17": "[7:119] Thus were they, that is, Pharaoh and his folk, there defeated, becoming humiliated — they ended up abased.\n",
        "TRANSLATION_18": "(Thus were they there defeated) upon which Moses was victorious against them (and brought low) and they were humiliated.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:119",
            "68:21",
            "26:60",
            "37:116",
            "37:175",
            "37:179",
            "26:80",
            "68:5",
            "32:30",
            "51:45"
        ],
        "BIBLE": [
            "torah:numbers:21:33",
            "torah:genesis:18:16",
            "writings:nehemiah:2:15",
            "prophets:judges:20:42",
            "prophets:i%20kings:20:39",
            "torah:genesis:18:22",
            "prophets:jeremiah:34:16",
            "writings:lamentations:3:35",
            "torah:deuteronomy:3:1",
            "torah:exodus:7:23"
        ]
    }
}