{
    "VERSE": "7:131",
    "ARABIC": "فَإِذَا جَآءَتْهُمُ ٱلْحَسَنَةُ قَالُوا۟ لَنَا هَٰذِهِۦ وَإِن تُصِبْهُمْ سَيِّئَةٌ يَطَّيَّرُوا۟ بِمُوسَىٰ وَمَن مَّعَهُۥٓ أَلَآ إِنَّمَا طَٰٓئِرُهُمْ عِندَ ٱللَّهِ وَلَٰكِنَّ أَكْثَرَهُمْ لَا يَعْلَمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Whenever a good thing came to them, they said, 'This is our due.' But if anything bad happened to them, they would blame their ill fortune on Musa and those with him. No indeed! Their ill fortune will be with Allah. But most of them did not know.",
        "TRANSLATION_1": "Yet when good came their way they said: \"It is our due;\" but when misfortune befell them they put the omen down to Moses and those who were with him. But surely the omen was with God, yet most of them did not understand.\n",
        "TRANSLATION_2": "But whenever prosperity came their way, they said: 'This is our due.' And whatever hardship befell them, they attributed it to the misfortune of Moses and those who followed him. Surely, their misfortune had been decreed by Allah - but most of them do not know that.\n",
        "TRANSLATION_3": "But they would always ascribe their well-being to themselves and the misfortunes that they would experience to Moses and his people. Their fate is certainly in the hands of God but many of them do not know.\n",
        "TRANSLATION_4": "So when good would reach them they would say, “This is for us”; and when misfortune reached them, they would infer it as ill omens of Moosa and his companions; pay heed! The misfortune of their ill luck lies with Allah, but most of them are unaware.\n",
        "TRANSLATION_5": "But whenever good came to them, they said: \"This is for us.\" And if evil afflicted them, they considered it an omen about Musa and those with him. Be informed! Verily, their omens are with Allah but most of them know not.\n",
        "TRANSLATION_6": "But when good befell them they said: This is due to us; and when evil afflicted them, they attributed it to the ill-luck of Musa and those with him; surely their evil fortune is only from Allah but most of them do not know.\n",
        "TRANSLATION_7": "So, when good came to them, they said, 'This belongs to us'; but if any evil smote them, they would augur ill by Moses and those with him. Why, surely their ill augury was with God; but the most of them knew not.\n",
        "TRANSLATION_8": "But whenever good befell them, they said: This is ours; and whenever evil smote them they ascribed it to the evil auspices of Moses and those with him. Surely their evil auspice was only with Allah. But most of them knew not.\n",
        "TRANSLATION_9": "then when something good came to them, they said, \"It is our due!\" -- but when something bad came, they ascribed it as an ill-omen to Moses and those with him. Surely their [evil] fortune had been decreed by God, but most of them did not know this.\n",
        "TRANSLATION_10": "So whenever good-hap came unto them, they would say: ours is this. And if a mishap afflicted them, they would lay it to the evil augury of Musa and these with him. Behold! their evil augury was only with Allah, but most of them knew not.\n",
        "TRANSLATION_11": "But whenever any good came to them, they would say, ‘This is our due.’ And if any ill visited them, they took it for ill omens attending Moses and those who were with him. (Look! Indeed the cause of their ill omens is from Allah, but most of them do not know.)\n",
        "TRANSLATION_12": "But when good (times) came, they said, \"This is due to us;\" When gripped by calamity, they ascribed it to evil omens connected with Moses and those with him! Behold! in truth the omens of evil are theirs in Allah's sight, but most of them do not understand!\n",
        "TRANSLATION_13": "But whenever good came to them, they said: \"Ours is this.\" And if evil afflicted them, they ascribed it to evil omens connected with Musa (Moses) and those with him. Be informed! Verily, their evil omens are with Allah but most of them know not.\n",
        "TRANSLATION_14": "When good things came their way, they said: 'It is our due' but when evil befell them they blamed their ill fortune on Moses and those with him. Indeed their ill fortune was with Allah, though most of them did not know.\n",
        "TRANSLATION_15": "When something good came their way, they said, “This is ours.” And when something bad happened to them, they ascribed the evil omen to Moses and those with him. In fact, their omen is with God, but most of them do not know.\n",
        "TRANSLATION_16": "But when good came to them, they said, \"This is ours [by right].\" And if a bad [condition] struck them, they saw an evil omen in Moses and those with him. Unquestionably, their fortune is with Allah, but most of them do not know.\n",
        "TRANSLATION_17": "[7:131] But whenever a good thing, [such as] fertility and abundance, befell them, they said, ‘This belongs to us’, that is, we deserve it, and they did not give thanks for it; and whenever an evil thing, [such as] drought or hardship, smote them, they would augur ill of Moses and those, believers, with him. Surely their ill augury is with God, Who brings it upon them, but most of them do not know, that whatever befalls them is from Him.\n",
        "TRANSLATION_18": "(But whenever good) land fertility, abundance and comfort (befell them, they said: This is ours) this is our right; (and whenever evil) drought, lack of fruits and hardship (smote them they ascribed it to the evil auspices of Moses and those with him). Allah said: (Surely their evil auspice) their hardship and abundance (was only with Allah. But most of them) all of them (knew not) this nor believed in it.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:131",
            "3:120",
            "4:78",
            "23:117",
            "30:6",
            "6:109",
            "10:55",
            "29:17",
            "5:81",
            "16:38"
        ],
        "BIBLE": [
            "prophets:i%20samuel:28:21",
            "writings:ii%20chronicles:24:11",
            "prophets:jeremiah:36:14",
            "prophets:i%20kings:20:13",
            "torah:genesis:22:12",
            "writings:i%20chronicles:12:18",
            "prophets:i%20samuel:10:11",
            "prophets:judges:12:3",
            "prophets:judges:9:43",
            "torah:exodus:18:14"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:2:5",
            
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:13",
            "Sefer%20Yetzirah:6:2"
        ]
    }
}