{
    "VERSE": "7:133",
    "ARABIC": "فَأَرْسَلْنَا عَلَيْهِمُ ٱلطُّوفَانَ وَٱلْجَرَادَ وَٱلْقُمَّلَ وَٱلضَّفَادِعَ وَٱلدَّمَ ءَايَٰتٍ مُّفَصَّلَٰتٍ فَٱسْتَكْبَرُوا۟ وَكَانُوا۟ قَوْمًا مُّجْرِمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "So We sent down on them floods, locusts, lice, frogs and blood, Signs, clear and distinct, but they proved arrogant and were an evildoing people.",
        "TRANSLATION_1": "So We let loose on them floods and locusts, and vermin, frogs and blood -- how many different signs. But they still remained arrogant, for they were a people full of sin.\n",
        "TRANSLATION_2": "Then We afflicted them with a great flood and locusts, and the lice, and the frogs, and the blood. All these were distinct signs and yet they remained haughty. They were a wicked people.\n",
        "TRANSLATION_3": "We sent upon them widespread calamities: floods of locusts, lice, frogs, and blood. All were distinct miracles but these criminals all the time remained proud.\n",
        "TRANSLATION_4": "We therefore sent against them the flood and the locusts and the vermin (or insects) and the frogs and the blood – separate signs; in response they were proud and were a guilty people.\n",
        "TRANSLATION_5": "So We sent on them: the Tuwfan, the locusts, the Qummal, the frogs, and the blood (as a succession of) manifest signs, yet they remained arrogant, and they were of those people who were criminals.\n",
        "TRANSLATION_6": "Therefore We sent upon them widespread death, and the locusts and the lice and the frog and the blood, clear signs; but they behaved haughtily and they were a guilty people.\n",
        "TRANSLATION_7": "So We let loose upon them the flood and the locusts, the lice and the frogs, the blood, distinct signs; but they waxed proud and were a sinful people.\n",
        "TRANSLATION_8": "So We sent against them the flood and the locusts and the vermin and the frogs and the blood - a succession of clear signs. But they were arrogant and became a guilty folk.\n",
        "TRANSLATION_9": "Then We afflicted them with storms, and locusts, and lice, and frogs, and blood: so many clear signs. But they were steeped in arrogance, for they were a people given to sin.\n",
        "TRANSLATION_10": "Thereafter We sent upon them the flood, and the locusts, and the lice, and the frogs, and the blood: signs detailed; yet they remained stiff-necked and they, were a people sinful.\n",
        "TRANSLATION_11": "So We sent against them a flood and locusts, lice, frogs and blood, as distinct signs. But they acted arrogantly, and they were a guilty lot.\n",
        "TRANSLATION_12": "So We sent (plagues) on them: Wholesale death, Locusts, Lice, Frogs, And Blood: Signs openly self-explained: but they were steeped in arrogance,- a people given to sin.\n",
        "TRANSLATION_13": "So We sent on them: the flood, the locusts, the lice, the frogs, and the blood: (as a succession of) manifest signs, yet they remained arrogant, and they were of those people who were Mujrimun (criminals, polytheists, sinners, etc.).\n",
        "TRANSLATION_14": "So We sent upon them floods, locusts, lice, frogs, and blood. (All these were) clear signs, yet they were proud against them, for they were wicked people.\n",
        "TRANSLATION_15": "So We let loose upon them the flood, and the locusts, and the lice, and the frogs, and blood—all explicit signs—but they were too arrogant. They were a sinful people.\n",
        "TRANSLATION_16": "So We sent upon them the flood and locusts and lice and frogs and blood as distinct signs, but they were arrogant and were a criminal people.\n",
        "TRANSLATION_17": "[7:133] So We unleashed upon them the flood, of water, which penetrated their houses and which for seven days would come up to people’s necks as they sat; and the locusts, which consumed their crops and fruits,   likewise [engulfing them for seven days]; and the lice (al-qummal is like al-sūs, ‘woodworm’, or al-qurād, ‘ticks’), which would follow [and consume] what the locusts left behind; and the frogs, such that they infested their houses and food supplies; and the blood, [flowing] in their water, distinct, clear, signs: but they were too scornful, to believe in them, and were a sinful folk.\n",
        "TRANSLATION_18": "(So We sent them) Allah inflicted upon them (the flood) continuous, uninterrupted rain: day and night, from Saturday to Saturday (and the locusts) He sent on the locust which ate everything that the earth produced: vegetation and fruits (and the vermin) and He also inflicted them with the vermin-crawling creatures without wings-which devoured whatever the locusts left uneaten (and the frogs) and after this He set on them frogs so much so that they harmed them (and the blood) after which He inflicted on them blood such that their wells and rivers filled with blood (a succession of clear signs) of one month interval. (But they were arrogant) and refused to believe (and became guilty) idolaters.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:133",
            "25:36",
            "7:64",
            "10:75",
            "6:98",
            "21:77",
            "6:105",
            "7:177",
            "45:31",
            "6:126"
        ],
        "BIBLE": [
            "prophets:ezekiel:18:13",
            "writings:i%20chronicles:6:46",
            "writings:i%20chronicles:21:22",
            "prophets:i%20kings:8:36",
            "writings:psalms:118:18",
            "writings:ii%20chronicles:6:27",
            "prophets:i%20kings:3:9",
            "writings:ecclesiastes:8:8",
            "torah:deuteronomy:12:21",
            "torah:leviticus:19:20"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:5:2"
        ]
    }
}