{
    "VERSE": "7:134",
    "ARABIC": "وَلَمَّا وَقَعَ عَلَيْهِمُ ٱلرِّجْزُ قَالُوا۟ يَٰمُوسَى ٱدْعُ لَنَا رَبَّكَ بِمَا عَهِدَ عِندَكَ لَئِن كَشَفْتَ عَنَّا ٱلرِّجْزَ لَنُؤْمِنَنَّ لَكَ وَلَنُرْسِلَنَّ مَعَكَ بَنِىٓ إِسْرَٰٓءِيلَ",
    "ENGLISH": {
        "TRANSLATION_0": "Whenever the plague came down on them they said, 'Musa, pray to your Lord for us by the contract He has with you. If you remove the plague from us, we will definitely have iman in you and send the tribe of Israel away with you.'",
        "TRANSLATION_1": "Yet when punishment overtook them, they said: \"O Moses, invoke your Lord for us as you have been enjoined. If the torment is removed, we shall certainly believe in you and let the people of Israel go with you.\"\n",
        "TRANSLATION_2": "Each time a scourge struck them they, said: 'O Moses! Pray for us to your Lord on the strength of the prophethood He has bestowed upon you. Surely, if you remove this scourge from us, we will truly believe in you, and will let the Children of Israel go with you.'\n",
        "TRANSLATION_3": "When the torment would strike them, they would ask Moses, \"Pray for us to your Lord through your covenant with Him. If He saves us from the torment, we shall certainly believe in you and permit you and the children of Israel to leave\".\n",
        "TRANSLATION_4": "And whenever the punishment came upon them they said, “O Moosa! Pray to your Lord for us, by means of His covenant which you have; indeed if you lift the punishment from us we will surely accept faith in you and let the Descendants of Israel go with you.”\n",
        "TRANSLATION_5": "And when the punishment struck them, they said: \"O Musa! Invoke your Lord for us because of His promise to you. If you remove the punishment from us, we indeed shall believe in you, and we shall let the Children of Israel go with you.\"\n",
        "TRANSLATION_6": "And when the plague fell upon them, they said: O Musa! pray for us to your Lord as He has promised with you, if you remove the plague from us, we will certainly believe in you and we will certainly send away with you the children of Israel.\n",
        "TRANSLATION_7": "And when the wrath fell upon them, they said, 'Moses, pray to thy Lord for us by the covenant He has made with thee. If thou removest from us the wrath, surely we will believe thee, and send forth with thee the Children of Israel.'\n",
        "TRANSLATION_8": "And when the terror fell on them they cried: O Moses! Pray for us unto thy Lord, because He hath a covenant with thee. If thou removest the terror from us we verily will trust thee and will let the Children of Israel go with thee.\n",
        "TRANSLATION_9": "Whenever a plague struck them, they would say, \"Moses, pray to your Lord for us by virtue of the promise He has made to you: if you remove this plague from us, we will surely believe in you and let the Children of Israel go with you,\"\n",
        "TRANSLATION_10": "And whensoever a plague fell on them, they said: O Musa! supplicate thy Lord for us, by that which He hath covenanted with thee; surely if thou remove the plague from us we will surely believe in thee, and we will send away with thee the Children of Israi'l.\n",
        "TRANSLATION_11": "Whenever a plague fell upon them, they would say, ‘O Moses, invoke your Lord for us by the covenant He has made with you. If you remove the plague from us, we will certainly believe in you and let the Children of Israel go along with you.’\n",
        "TRANSLATION_12": "Every time the penalty fell on them, they said: \"O Moses! on your behalf call on thy Lord in virtue of his promise to thee: If thou wilt remove the penalty from us, we shall truly believe in thee, and we shall send away the Children of Israel with thee.\"\n",
        "TRANSLATION_13": "And when the punishment fell on them they said: \"O Musa (Moses)! Invoke your Lord for us because of His Promise to you. If you will remove the punishment from us, we indeed shall believe in you, and we shall let the Children of Israel go with you.\"\n",
        "TRANSLATION_14": "And when the plague smote them, they said: 'Moses, pray to your Lord for us invoking the promise He has made with you. If you lift the plague from us, we will believe in you and let the Children of Israel go with you'\n",
        "TRANSLATION_15": "Whenever a plague befell them, they would say, “O Moses, pray to your Lord for us, according to the covenant He made with you. If you lift the plague from us, we will believe in you, and let the Children of Israel go with you.”\n",
        "TRANSLATION_16": "And when the punishment descended upon them, they said, \"O Moses, invoke for us your Lord by what He has promised you. If you [can] remove the punishment from us, we will surely believe you, and we will send with you the Children of Israel.\"\n",
        "TRANSLATION_17": "[7:134] And when the terror, the chastisement, fell upon them, they said, ‘O Moses, pray to your Lord for our sake by the covenant which He has made with you, to remove the chastisement from us if we believe. Indeed if (la-in: the lām is for oaths) you remove from us the terror, verily we will believe in you and let the Children of Israel go with you’.\n",
        "TRANSLATION_18": "(And when the terror fell on them) whenever a torment fell on them such as the flood, locusts, vermin, frogs and blood (they cried: Moses! Pray for us unto your Lord) ask your Lord for us, (because He hath a covenant with thee) because of that with which He has commanded you. (If thou removest the terror from us) if you remove the punishment from us (we verily will trust thee) we will believe in you (and will let the Children of Israel go with thee) with all their property.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:134",
            "43:49",
            "39:34",
            "51:34",
            "41:38",
            "7:149",
            "11:83",
            "7:206",
            "32:12",
            "3:43"
        ],
        "BIBLE": [
            "prophets:ezekiel:9:8",
            "writings:ii%20chronicles:14:10",
            "prophets:ezekiel:11:13",
            "prophets:ii%20kings:6:18",
            "torah:exodus:3:13",
            "writings:daniel:8:17",
            "writings:ii%20chronicles:25:7",
            "prophets:i%20samuel:11:7",
            "prophets:judges:13:8",
            "prophets:ii%20kings:2:4"
        ]
    }
}