{
    "VERSE": "7:137",
    "ARABIC": "وَأَوْرَثْنَا ٱلْقَوْمَ ٱلَّذِينَ كَانُوا۟ يُسْتَضْعَفُونَ مَشَٰرِقَ ٱلْأَرْضِ وَمَغَٰرِبَهَا ٱلَّتِى بَٰرَكْنَا فِيهَا وَتَمَّتْ كَلِمَتُ رَبِّكَ ٱلْحُسْنَىٰ عَلَىٰ بَنِىٓ إِسْرَٰٓءِيلَ بِمَا صَبَرُوا۟ وَدَمَّرْنَا مَا كَانَ يَصْنَعُ فِرْعَوْنُ وَقَوْمُهُۥ وَمَا كَانُوا۟ يَعْرِشُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "And We bequeathed to the people who had been oppressed the easternmost part of the land We had blessed, and its westernmost part as well. The most excellent Word of your Lord was fulfilled for the tribe of Israel on account of their steadfastness. And We utterly destroyed what Pharaoh and his people made and the buildings they constructed.",
        "TRANSLATION_1": "We then made the people who were weak (and oppressed) successors of the land to the East and the West which We had blessed. Thus the fair promise of your Lord to the children of Israel was fulfilled, for they were patient in adversity; and whatsoever the Pharaoh and his people had fashioned, and the structures they had raised, were destroyed.\n",
        "TRANSLATION_2": "And We made those who had been persecuted inherit the eastern and western lands which We had blessed. Thus your Lord's gracious promise was fulfilled to the Children of Israel, for they had endured with patience; and We destroyed all that Pharaoh and his people had wrought, and all that they had built.\n",
        "TRANSLATION_3": "We gave the suppressed people the blessed eastern and western regions as their inheritance. Thus, the promises of your Lord to the children of Israel all came true because of the patience which they exercised. He destroyed all the establishments of the Pharaoh and his people.\n",
        "TRANSLATION_4": "And We made the people who were oppressed, the inheritors of the eastern and western parts of the land in which We placed blessings; and the good promise of your Lord was fulfilled for the Descendants of Israel – the reward of their patience; and We destroyed whatever Firaun and his people built and whatever they had contrived.\n",
        "TRANSLATION_5": "And We made the people who were considered weak to inherit the eastern parts of the land and the western parts thereof which We have blessed. And the fair Word of your Lord was fulfilled for the Children of Israel, because of their endurance. And We destroyed what Fir`awn and his people produced, and what they erected.\n",
        "TRANSLATION_6": "And We made the people who were deemed weak to inherit the eastern lands and the western ones which We had blessed; and the good word of your Lord was fulfilled in the children of Israel because they bore up (sufferings) patiently; and We utterly destroyed what Firon and his people had wrought and what they built.\n",
        "TRANSLATION_7": "And We bequeathed upon the people that were abased all the east and the west of the land We had blessed; and perfectly was fulfilled the most fair word of thy Lord upon the Children of Israel, for that they endured patiently; and We destroyed utterly the works of Pharaoh and his people, and what they had been building.\n",
        "TRANSLATION_8": "And We caused the folk who were despised to inherit the eastern parts of the land and the western parts thereof which We had blessed. And the fair word of thy Lord was fulfilled for the Children of Israel because of their endurance; and We annihilated (all) that Pharaoh and his folk had done and that they had contrived.\n",
        "TRANSLATION_9": "We made the people who were considered weak inheritors of the eastern parts and western parts of the land which We had blessed. Thus your Lord's good promise to the Children of Israel was fulfilled, because of their patience, and We destroyed all that Pharaoh and his people had built and all that they had raised high.\n",
        "TRANSLATION_10": "And We caused the people who had been oppressed to inherit the eastern parts of the land, and the western parts thereof, which We had blest. And fulfilled was the good word of thy Lord unto the Children of Isra'il' for they were long-suffering, and We destroyed that which Fir'awn and his people had builded and that which they had raised.\n",
        "TRANSLATION_11": "We made the people who were abased the heirs to the east and west of the land which We had blessed, and your Lord’s best word [of promise] was fulfilled for the Children of Israel because of their patience, and We destroyed what Pharaoh and his people had built and what they used to erect.\n",
        "TRANSLATION_12": "And We made a people, considered weak (and of no account), inheritors of lands in both east and west, - lands whereon We sent down Our blessings. The fair promise of thy Lord was fulfilled for the Children of Israel, because they had patience and constancy, and We levelled to the ground the great works and fine buildings which Pharaoh and his people erected (with such pride).\n",
        "TRANSLATION_13": "And We made the people who were considered weak to inherit the eastern parts of the land and the western parts thereof which We have blessed. And the fair Word of your Lord was fulfilled for the Children of Israel, because of their endurance. And We destroyed completely all the great works and buildings which Fir'aun (Pharaoh) and his people erected.\n",
        "TRANSLATION_14": "We gave the persecuted nation dominion over the eastern and western lands which We had blessed. So the Word of your Lord, the finest, was fulfilled for the Children of Israel because of their patience; and We destroyed the edifices, and towers of Pharaoh and whatsoever they manufactured.\n",
        "TRANSLATION_15": "And We made the oppressed people inherit the eastern and western parts of the land, which We had blessed. Thus the fair promise of your Lord to the Children of Israel was fulfilled, because of their endurance. And We destroyed what Pharaoh and his people had built, and what they had harvested.\n",
        "TRANSLATION_16": "And We caused the people who had been oppressed to inherit the eastern regions of the land and the western ones, which We had blessed. And the good word of your Lord was fulfilled for the Children of Israel because of what they had patiently endured. And We destroyed [all] that Pharaoh and his people were producing and what they had been building.\n",
        "TRANSLATION_17": "[7:137] And We bequeathed upon the people who were oppressed, through bondage, namely, the Children of Israel, the eastern parts of the land and the western parts thereof which We had blessed, with water and trees (allatī bāraknā fīhā, ‘which We had blessed’, is an adjectival qualification of al-ard, ‘the land’), and this was Syria, and the fair word of your Lord was fulfilled, which was His saying, exalted be He: Yet We desired to be gracious to those who were oppressed in the land ... to the end [of the verse, Q. 28:5], for the Children of Israel because they endured patiently, persecution at the hands of their enemy; and We destroyed utterly what Pharaoh and his folk had been creating, by way of architecture, and what they had been erecting (read ya‘rishūn or ya‘rushūn), [what they had been] raising of edifices.\n",
        "TRANSLATION_18": "(And We caused the folk who were despised) who were humiliated (to inherit the eastern parts of the land) the land of Jerusalem, Palestine, Jordan and Egypt (and the western parts thereof which We had blessed) part of it with water and trees. (And the fair word of the Lord) to reward them with Paradise or victory (was fulfilled) became incumbent (for the Children of Israel because of their endurance) in the face of affliction; it is also said: for their endurance upon their religion; (and We annihilated) destroyed ((all) that Pharaoh and his folk had done) of castles and townships (and that they had contrived) and that which they had planted of trees and vines; it is also said that this means: that which they had built.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:137",
            "2:258",
            "37:5",
            "53:31",
            "40:6",
            "66:12",
            "14:38",
            "23:106",
            "11:88",
            "10:93"
        ],
        "BIBLE": [
            "writings:ii%20chronicles:7:3",
            "prophets:i%20kings:8:56",
            "writings:ii%20chronicles:6:27",
            "torah:numbers:20:24",
            "prophets:joshua:19:49",
            "torah:deuteronomy:2:12",
            "prophets:joshua:17:14",
            "prophets:joshua:21:3",
            "prophets:i%20kings:8:36",
            "torah:deuteronomy:32:8"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:12",
            
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:1:9"
        ]
    }
}