{
    "VERSE": "7:139",
    "ARABIC": "إِنَّ هَٰٓؤُلَآءِ مُتَبَّرٌ مَّا هُمْ فِيهِ وَبَٰطِلٌ مَّا كَانُوا۟ يَعْمَلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "What these people are doing is destined for destruction. What they are doing is purposeless.'",
        "TRANSLATION_1": "These people and their ways will surely be destroyed, for false is what they practise.\n",
        "TRANSLATION_2": "The way these people follow is bound to lead to destruction; and all their works are vain.\n",
        "TRANSLATION_3": "What these people worship is doomed to be destroyed and their deeds are based on falsehood.\n",
        "TRANSLATION_4": "“The condition they are in is, in fact, one of destruction – and all what they do is utter falsehood.”\n",
        "TRANSLATION_5": "[Musa added:] \"Verily, these people will be destroyed for that which they are engaged in (idols' worship). And all that they are doing is in vain.\"\n",
        "TRANSLATION_6": "(As to) these, surely that about which they are shall be brought to naught and that which they do is vain.\n",
        "TRANSLATION_7": "Surely this they are engaged upon shall be shattered, and void is what they have been doing.'\n",
        "TRANSLATION_8": "Lo! as for these, their way will be destroyed and all that they are doing is in vain.\n",
        "TRANSLATION_9": "what they are engaged in is doomed to destruction and all their works are in vain.\"\n",
        "TRANSLATION_10": "Verily these! destroyed is that wherein they are engaged and vain is that which they have been doing.\n",
        "TRANSLATION_11": "What they are engaged in is indeed bound to perish, and what they have been doing shall come to naught.’\n",
        "TRANSLATION_12": "As to these folk,- the cult they are in is (but) a fragment of a ruin, and vain is the (worship) which they practise.\"\n",
        "TRANSLATION_13": "[Musa (Moses) added:] \"Verily, these people will be destroyed for that which they are engaged in (idols-worship). And all that they are doing is in vain.\"\n",
        "TRANSLATION_14": "That which they are engaged upon shall be shattered and all their works are vain.\n",
        "TRANSLATION_15": "“What these people are concerned with is perdition, and their deeds are based on falsehoods.”\n",
        "TRANSLATION_16": "Indeed, those [worshippers] - destroyed is that in which they are [engaged], and worthless is whatever they were doing.\"\n",
        "TRANSLATION_17": "[7:139] Truly as for these, their way will be destroyed and what they have been doing is in vain’.\n",
        "TRANSLATION_18": "(Lo! as for these, their way) their idolatry (will be destroyed and all that they are doing) of idolatry (is in vain) is error.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:139",
            "16:39",
            "44:50",
            "83:32",
            "84:4",
            "37:24",
            "85:13",
            "74:18",
            "43:75",
            "32:30"
        ],
        "BIBLE": [
            "prophets:ii%20kings:6:19",
            "prophets:ezekiel:14:22",
            "prophets:ii%20samuel:17:9",
            "prophets:jeremiah:12:16",
            "prophets:isaiah:3:12",
            "prophets:joshua:14:9",
            "prophets:judges:2:12",
            "writings:ruth:1:16",
            "torah:genesis:24:5",
            "writings:psalms:78:71"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:4:12",
            
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:2:1"
        ]
    }
}