{
    "VERSE": "7:14",
    "ARABIC": "قَالَ أَنظِرْنِىٓ إِلَىٰ يَوْمِ يُبْعَثُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "He said, 'Grant me a reprieve until the day they are raised up.'",
        "TRANSLATION_1": "Grant me respite,\" said he, \"till the raising of the dead.\"\n",
        "TRANSLATION_2": "Satan replied: 'Give me respite till the Day they shall be raised.'\n",
        "TRANSLATION_3": "Satan asked the Lord to give him respite (keep him alive) until the Day of Resurrection.\n",
        "TRANSLATION_4": "He said, “Give me respite till the day when people will be resurrected.”\n",
        "TRANSLATION_5": "(Iblis) said: \"Allow me respite till the Day they are raised up (the Day of Resurrection).\"\n",
        "TRANSLATION_6": "He said: Respite me until the day when they are raised up.\n",
        "TRANSLATION_7": "Said he, 'Respite me till the day they shall be raised.'\n",
        "TRANSLATION_8": "He said: Reprieve me till the day when they are raised (from the dead).\n",
        "TRANSLATION_9": "Satan said, \"Give me respite until the Day of Resurrection,\"\n",
        "TRANSLATION_10": "He said: respite me till the Day they shall be raised up.\n",
        "TRANSLATION_11": "He said, ‘Respite me till the day they will be resurrected.’\n",
        "TRANSLATION_12": "He said: \"Give me respite till the day they are raised up.\"\n",
        "TRANSLATION_13": "(Iblis) said: \"Allow me respite till the Day they are raised up (i.e. the Day of Resurrection).\"\n",
        "TRANSLATION_14": "he replied: 'Respite me till the Day of Resurrection'\n",
        "TRANSLATION_15": "He said, “Give me respite, until the Day they are resurrected.”\n",
        "TRANSLATION_16": "[Satan] said, \"Reprieve me until the Day they are resurrected.\"\n",
        "TRANSLATION_17": "[7:14] Said he, ‘Reprieve me, postpone my affair, until the day when they, people, are resurrected’.\n",
        "TRANSLATION_18": "(He said: Reprieve me) give me respite (till the day when they are raised) from the graves-accursed not wanting to die.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:14",
            "26:87",
            "15:36",
            "38:79",
            "77:12",
            "77:35",
            "52:13",
            "23:111",
            "70:42",
            "52:45"
        ],
        "BIBLE": [
            "prophets:i%20samuel:11:3",
            "writings:i%20chronicles:23:25",
            "torah:genesis:29:21",
            "prophets:ii%20kings:6:29",
            "prophets:i%20kings:13:3",
            "prophets:i%20samuel:1:27",
            "prophets:i%20kings:5:21",
            "prophets:i%20kings:9:13",
            "writings:daniel:5:19",
            "torah:exodus:17:2"
        ]
    }
}