{
    "VERSE": "7:142",
    "ARABIC": "وَوَٰعَدْنَا مُوسَىٰ ثَلَٰثِينَ لَيْلَةً وَأَتْمَمْنَٰهَا بِعَشْرٍ فَتَمَّ مِيقَٰتُ رَبِّهِۦٓ أَرْبَعِينَ لَيْلَةً وَقَالَ مُوسَىٰ لِأَخِيهِ هَٰرُونَ ٱخْلُفْنِى فِى قَوْمِى وَأَصْلِحْ وَلَا تَتَّبِعْ سَبِيلَ ٱلْمُفْسِدِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "We set aside thirty nights for Musa and then completed them with ten, so the appointed time of his Lord was forty nights in all. Musa said to his brother Harun, 'Be my khalif among my people. Keep order and do not follow the way of the corrupters.'",
        "TRANSLATION_1": "We made an appointment of thirty nights with Moses (On Mount Sinai) to which We added ten more; so the term set by the Lord was completed in forty nights. Moses said to Aaron, his brother: \"Deputise for me among my people. Dispose rightly, and do not follow the way of the authors of evil.\"\n",
        "TRANSLATION_2": "And We appointed for Moses thirty nights, to which We added ten, whereby the term of forty nights set by his Lord was fulfilled. And Moses said to Aaron, his brother: 'Take my place among my people, act righteously, and do not follow the path of those who create mischief.'\n",
        "TRANSLATION_3": "We told Moses to stay with Us for thirty nights (in the mountains) but added ten nights more so his appointment with his Lord came to an end after forty nights. Moses had appointed his brother Aaron as his deputy among his people during his absence saying, \"Try to reform them and do not follow the way of the evil-doers.\"\n",
        "TRANSLATION_4": "And We agreed with Moosa a covenant for thirty nights (of solitude) and completed it by adding ten to them, so the covenant of His Lord amounted to forty nights in full; and Moosa said to his brother Haroon, “Be my deputy over my people and make reform and do not allow the ways of the mischievous to enter.”\n",
        "TRANSLATION_5": "And We appointed for Musa thirty nights and added ten, and he completed the term, appointed by his Lord, of forty nights. And Musa said to his brother Harun: \"Replace me among my people, act in the right way and follow not the way of the mischief-makers.\"\n",
        "TRANSLATION_6": "And We appointed with Musa a time of thirty nights and completed them with ten (more), so the appointed time of his Lord was complete forty nights, and Musa said to his brother Haroun: Take my place among my people, and act well and do not follow the way of the mischief-makers.\n",
        "TRANSLATION_7": "And We appointed with Moses thirty nights and We completed them with ten, so the appointed time of his Lord was forty nights; and Moses said to his brother Aaron, 'Be my successor among my people, and put things right, and do not follow the way of the workers of corruption.'\n",
        "TRANSLATION_8": "And when We did appoint for Moses thirty nights (of solitude), and added to them ten, and he completed the whole time appointed by his Lord of forty nights; and Moses said unto his brother, Aaron: Take my place among the people. Do right, and follow not the way of mischief-makers.\n",
        "TRANSLATION_9": "We appointed thirty nights for Moses, then added ten more: the term set by his Lord was fulfilled in forty nights. Moses said to his brother Aaron, \"Take my place among my people: act rightly and do not follow the way of those who spread corruption.\"\n",
        "TRANSLATION_10": "And We treated with Musa thirty nights, and We completed them with ten; so the appointment of his Lord was completed by forty nights. And Musa said unto his brother Harun: act thou in my place among my people, and rectify, and follow not the way of the corrupters.\n",
        "TRANSLATION_11": "We made an appointment with Moses for thirty nights, and completed them with ten [more]; thus the tryst of his Lord was completed in forty nights. And Moses said to Aaron, his brother, ‘Be my successor among my people, and set things right and do not follow the way of the agents of corruption.’\n",
        "TRANSLATION_12": "We appointed for Moses thirty nights, and completed (the period) with ten (more): thus was completed the term (of communion) with his Lord, forty nights. And Moses had charged his brother Aaron (before he went up): \"Act for me amongst my people: Do right, and follow not the way of those who do mischief.\"\n",
        "TRANSLATION_13": "And We appointed for Musa (Moses) thirty nights and added (to the period) ten (more), and he completed the term, appointed by his Lord, of forty nights. And Musa (Moses) said to his brother Harun (Aaron): \"Replace me among my people, act in the Right Way (by ordering the people to obey Allah and to worship Him Alone) and follow not the way of the Mufsidun (mischief-makers).\"\n",
        "TRANSLATION_14": "We appointed for Moses thirty nights, and We completed them with ten more; so that the appointment with his Lord took forty nights. Moses said to Aaron, his brother: 'Take my place among my nation. Do what is right and do not follow the path of the corrupt doers'\n",
        "TRANSLATION_15": "And We appointed to Moses thirty nights, and completed them with ten; and thus the time appointed by his Lord was forty nights. And Moses said to his brother Aaron: “Take my place among my people, and be upright, and do not follow the way of the mischief-makers.”\n",
        "TRANSLATION_16": "And We made an appointment with Moses for thirty nights and perfected them by [the addition of] ten; so the term of his Lord was completed as forty nights. And Moses said to his brother Aaron, \"Take my place among my people, do right [by them], and do not follow the way of the corrupters.\"\n",
        "TRANSLATION_17": "[7:142] And We appointed (read wa-wā‘adnā or wa-wa‘adnā) for Moses thirty nights, at the end of which We would speak to him, after he has fasted [during that period]; that was the month of Dhū’l-Qa‘da. He completed the fast. But when it came to an end, he disliked the [bad] odour of his mouth and so cleaned his teeth. God then commanded him [to fast for] another ten nights so that He may speak to him despite the odour in his mouth: as God says, and completed them with ten, nights of Dhū’l-Hijja. Thus was the time appointed by his Lord concluded, the time at which God had promised him to speak to him, as forty (arba‘īna is a circumstantial qualifier) nights (laylatan is for specification); and Moses said to his brother Aaron, when he was departing to the Mount for the communion [with his Lord]: ‘Succeed me, be my deputy, over my people, and be righteous, [among them] with regard to their affair, and do not follow the way of the agents of corruption’, by consenting with them to acts of disobedience.\n",
        "TRANSLATION_18": "(And when We did appoint for Moses) to spend in the mountain (thirty nights (of solitude)) the month of the Dhu'l-Qa'dah, (and added to them ten) days from the month of Dhu'l-Hijjah, (and he completed the whole time appointed by his Lord of forty nights) as he promised; (and Moses said unto his brother: Take my place) be my deputy (among the people. Do right) enjoin them to do right, (and follow not the way of mischief-makers) by committing transgressions.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:142",
            "23:94",
            "28:21",
            "7:155",
            "7:151",
            "17:79",
            "10:87",
            "10:85",
            "5:25",
            "20:70"
        ],
        "BIBLE": [
            "prophets:ezekiel:26:20",
            "torah:numbers:17:11",
            "prophets:ii%20kings:17:15",
            "torah:exodus:34:10",
            "writings:daniel:8:19",
            "prophets:i%20samuel:9:12",
            "prophets:judges:9:48",
            "prophets:joshua:9:6",
            "writings:ii%20chronicles:24:11",
            "prophets:i%20samuel:9:24"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:1:3"
        ]
    }
}