{
    "VERSE": "7:144",
    "ARABIC": "قَالَ يَٰمُوسَىٰٓ إِنِّى ٱصْطَفَيْتُكَ عَلَى ٱلنَّاسِ بِرِسَٰلَٰتِى وَبِكَلَٰمِى فَخُذْ مَآ ءَاتَيْتُكَ وَكُن مِّنَ ٱلشَّٰكِرِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "He said, 'Musa, I have chosen you over all mankind for My Message and My Word. Take what I have given you and be among the thankful.'",
        "TRANSLATION_1": "Said (the Lord): \"O Moses, I raised you above all men by sending My messages and speaking to you; so receive what I give you, and be grateful.\"\n",
        "TRANSLATION_2": "He said: 'O Moses! I have indeed preferred you to all others by virtue of the Message I have entrusted to you and by virtue of My speaking to you. Hold fast therefore, to whatever I have granted you, and give thanks.'\n",
        "TRANSLATION_3": "The Lord said to Moses, \"I have given you distinction above the people by speaking to you and giving you My Message. Receive what I have given to you and give Us thanks.\"\n",
        "TRANSLATION_4": "Said Allah, “O Moosa! I have chosen you from mankind by (bestowing) My messages and by My speech; so accept what I have bestowed upon you and be among the thankful.”\n",
        "TRANSLATION_5": "(Allah) said: \"O Musa I have chosen you above men by My Messages, and by My speaking (to you). So hold that which I have given you and be of the grateful.\"\n",
        "TRANSLATION_6": "He said: O Musa! surely I have chosen you above the people with My messages and with My words, therefore take hold of what I give to you and be of the grateful ones.\n",
        "TRANSLATION_7": "Said He, 'Moses, I have chosen thee above all men for My Messages and My Utterance; take what I have given thee, and be of the thankful.'\n",
        "TRANSLATION_8": "He said: O Moses! I have preferred thee above mankind by My messages and by My speaking (unto thee). So hold that which I have given thee, and be among the thankful.\n",
        "TRANSLATION_9": "He replied, \"Moses, I have chosen you of all mankind for My messages and My Words. Hold fast to what I have given you, and be among the grateful!\"\n",
        "TRANSLATION_10": "He said: O Musa! verily I have chosen thee above mankind by My messages and by My speaking; so hold fast thou that which I have given thee, and be of the thankful.\n",
        "TRANSLATION_11": "He said, ‘O Moses, I have chosen you over the people with My messages and My speech. So take what I give you, and be among the grateful.’\n",
        "TRANSLATION_12": "(Allah) said: \"O Moses! I have chosen thee above (other) men, by the mission I (have given thee) and the words I (have spoken to thee): take then the (revelation) which I give thee, and be of those who give thanks.\"\n",
        "TRANSLATION_13": "(Allah) said: \"O Musa (Moses) I have chosen you above men by My Messages, and by My speaking (to you). So hold that which I have given you and be of the grateful.\"\n",
        "TRANSLATION_14": "He said: 'Moses, I have chosen you from all mankind with My Messages and My Words. Therefore, take what I have given you, and be among the thankful.'\n",
        "TRANSLATION_15": "He said, “O Moses, I have chosen you over all people for My messages and for My Words. So take what I have given you, and be one of the thankful.”\n",
        "TRANSLATION_16": "[Allah] said, \"O Moses, I have chosen you over the people with My messages and My words [to you]. So take what I have given you and be among the grateful.\"\n",
        "TRANSLATION_17": "[7:144] He, God, said, to him: ‘O Moses, I have elected you, chosen you, from among mankind, the people of your time, for My Messages (read plural, bi-risālātī, or singular, bi-risālatī, ‘for My Message’) and My Speech, that is, [for] My having spoken to you. So take what I have given you, of bounty, and be of the thankful’, of My favours.\n",
        "TRANSLATION_18": "(He said : Moses! I have preferred thee above mankind) above the Children of Israel (by My messages and by My speaking (unto thee). So hold that which I have given thee) act upon that which I have given you, (and be among the thankful) that I chose to speak to you from among all people.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:144",
            "23:51",
            "7:104",
            "5:67",
            "10:108",
            "7:158",
            "12:103",
            "2:124",
            "3:53",
            "2:21"
        ],
        "BIBLE": [
            "writings:daniel:10:11",
            "torah:exodus:4:10",
            "prophets:ezekiel:3:10",
            "torah:genesis:20:16",
            "prophets:joshua:6:2",
            "prophets:jeremiah:44:20",
            "torah:leviticus:10:3",
            "torah:exodus:17:2",
            "prophets:ii%20kings:4:43",
            "prophets:joshua:17:14"
        ]
    }
}