{
    "VERSE": "7:147",
    "ARABIC": "وَٱلَّذِينَ كَذَّبُوا۟ بِـَٔايَٰتِنَا وَلِقَآءِ ٱلْءَاخِرَةِ حَبِطَتْ أَعْمَٰلُهُمْ هَلْ يُجْزَوْنَ إِلَّا مَا كَانُوا۟ يَعْمَلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "As for those who denied Our Signs and the encounter of the Next World, their actions will come to nothing. Will they be repaid except for what they did?",
        "TRANSLATION_1": "Vain are the acts of those who deny Our signs and the meeting in the Hereafter. Can they ever be rewarded for anything but what they did?\n",
        "TRANSLATION_2": "Vain are the deeds of those who reject Our signs as false and to the meeting of the Hereafter. Shall they be recompensed, except according to their deeds?'\n",
        "TRANSLATION_3": "The deeds of those who have called Our revelations and belief in the Day of Judgment mere lies, will be turned devoid of all virtue. Can they expect to receive a reward for their deeds other than that which is the result of their deeds?\n",
        "TRANSLATION_4": "And those who denied Our signs and the confronting of the Hereafter – all their deeds are wasted; what recompense will they get, except what they used to do?\n",
        "TRANSLATION_5": "Those who deny Our Ayat and the meeting in the Hereafter, vain are their deeds. Are they requited with anything except what they used to do\n",
        "TRANSLATION_6": "And (as to) those who reject Our communications and the meeting of the hereafter, their deeds are null. Shall they be rewarded except for what they have done?\n",
        "TRANSLATION_7": "Those who cry lies to Our signs, and the encounter in the world to come -- their works have failed; shall they be recompensed, except according to the things they have done?\n",
        "TRANSLATION_8": "Those who deny Our revelations and the meeting of the Hereafter, their works are fruitless. Are they requited aught save what they used to do?\n",
        "TRANSLATION_9": "The actions of those who denied Our signs and the Meeting of the Hereafter will come to nothing -- they shall be requited only, according to their deeds.\"\n",
        "TRANSLATION_10": "And those who belie Our signs and the meeting of the Hereafter- vain shall be their Work. They shall be requited not save for that which they wrought.\n",
        "TRANSLATION_11": "Those who deny Our signs and the encounter of the Hereafter, their works have failed. Shall they not be requited for what they used to do?\n",
        "TRANSLATION_12": "Those who reject Our signs and the meeting in the Hereafter,- vain are their deeds: Can they expect to be rewarded except as they have wrought?\n",
        "TRANSLATION_13": "Those who deny Our Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) and the Meeting in the Hereafter (Day of Resurrection,), vain are their deeds. Do they expect to be rewarded with anything except what they used to do?\n",
        "TRANSLATION_14": "Vain are the deeds of those who belie Our signs and the Everlasting Life. Shall they not be recompensed except for what they used to do?\n",
        "TRANSLATION_15": "Those who deny Our revelations and the meeting of the Hereafter—their deeds will come to nothing. Will they be repaid except according to what they used to do?\n",
        "TRANSLATION_16": "Those who denied Our signs and the meeting of the Hereafter - their deeds have become worthless. Are they recompensed except for what they used to do?\n",
        "TRANSLATION_17": "[7:147] Those who deny Our signs and the encounter in the Hereafter, the Resurrection and so on. their works, the good deeds they performed in the world, such as the maintenance of kinship ties or voluntary almsgivings, have failed, are invalid, and will not be rewarded, since they are not binding [in this case]. Shall they, they shall not, be requited anything but, the requital [for], what they used to do?’, in the way of denial and acts of disobedience?\n",
        "TRANSLATION_18": "(Those who deny Our revelations) those who disbelieve in Our Scripture and Messenger (and the meeting of the Hereafter) and disbelieve in resurrection after death, (their works are fruitless) their good deeds are nullified due to their idolatry. (Are they requited) that which they are requited of in the Hereafter (aught save what they used to do) and say of evil in the life of this world?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:147",
            "27:4",
            "3:22",
            "30:16",
            "43:69",
            "27:81",
            "30:53",
            "2:4",
            "6:49",
            "38:7"
        ],
        "BIBLE": [
            "prophets:i%20kings:15:5",
            "torah:deuteronomy:31:18",
            "torah:genesis:34:7",
            "writings:esther:4:11",
            "prophets:isaiah:41:4",
            "torah:genesis:19:22",
            "prophets:isaiah:4:3",
            "prophets:isaiah:50:2",
            "writings:song%20of%20songs:5:6",
            "prophets:i%20samuel:10:9"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:8",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:4:5"
        ]
    }
}