{
    "VERSE": "7:152",
    "ARABIC": "إِنَّ ٱلَّذِينَ ٱتَّخَذُوا۟ ٱلْعِجْلَ سَيَنَالُهُمْ غَضَبٌ مِّن رَّبِّهِمْ وَذِلَّةٌ فِى ٱلْحَيَوٰةِ ٱلدُّنْيَا وَكَذَٰلِكَ نَجْزِى ٱلْمُفْتَرِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "As for those who adopted the Calf, anger from their Lord will overtake them together with abasement in the life of the dunya. That is how we repay the purveyors of falsehood.",
        "TRANSLATION_1": "Surely those who have taken the calf (as a god) will suffer the anger of their Lord, and disgrace in the world. That is how We requite those who fabricate lies.\n",
        "TRANSLATION_2": "In reply they were told: 'Verily those who worshipped the calf will certainly incur indignation from their Lord, and will be abased in the life of this world. Thus do We reward those who fabricate lies.\n",
        "TRANSLATION_3": "(The Lord said), \"Those who worshipped the calf will be afflicted by the wrath of their Lord and disgraced in their worldly life. Thus, We will recompense those who invent falsehood.\n",
        "TRANSLATION_4": "Indeed those who took the calf – the punishment from their Lord, and humiliation will reach them in the life of this world; and this is the way We reward those who fabricate lies.\n",
        "TRANSLATION_5": "Certainly, those who took the calf (for worship), wrath from their Lord and humiliation will come upon them in the life of this world. Thus do We recompense those who invent lies.\n",
        "TRANSLATION_6": "(As for) those who took the calf (for a god), surely wrath from their Lord and disgrace in this world's life shall overtake them, and thus do We recompense the devisers of lies.\n",
        "TRANSLATION_7": "Surely those who took to themselves the Calf -- anger shall overtake them from their Lord, and abasement in this present life; so We recompense those who are forgers.\n",
        "TRANSLATION_8": "Lo! Those who chose the calf (for worship), terror from their Lord and humiliation will come upon them in the life of the world. Thus do We requite those who invent a lie.\n",
        "TRANSLATION_9": "Those who took to worshipping the calf will be afflicted by their Lord's wrath, and be disgraced in the life of this world. This is the way We requite those who invent falsehoods.\n",
        "TRANSLATION_10": "Verily those who took the calf, anon will overtake them indignation from their Lord and abasement in the life of the World. Thus We require the fabricators.\n",
        "TRANSLATION_11": "Indeed those who took up the calf [for worship] shall be overtaken by their Lord’s wrath and abasement in the life of the world.’ Thus do We requite the fabricators [of lies].\n",
        "TRANSLATION_12": "Those who took the calf (for worship) will indeed be overwhelmed with wrath from their Lord, and with shame in this life: thus do We recompense those who invent (falsehoods).\n",
        "TRANSLATION_13": "Certainly, those who took the calf (for worship), wrath from their Lord and humiliation will come upon them in the life of this world. Thus do We recompense those who invent lies.\n",
        "TRANSLATION_14": "Those who worshipped the calf incurred the Anger of their Lord and abasement in this life, and as such We recompense the forgers.\n",
        "TRANSLATION_15": "Those who idolized the calf have incurred wrath from their Lord, and humiliation in this life. We thus requite the innovators.\n",
        "TRANSLATION_16": "Indeed, those who took the calf [for worship] will obtain anger from their Lord and humiliation in the life of this world, and thus do We recompense the inventors [of falsehood].\n",
        "TRANSLATION_17": "[7:152] God, exalted be He, says, ‘Surely those who chose the calf, as a god. wrath, chastisement, and abasement shall come upon them from their Lord in the life of this world: and so they were punished [for this deed] by the command to slay themselves, and abasement was stamped upon them until the Day of Resurrection. Even, as We have requited them, so We requite those who invent lies, against God by way of idolatry and otherwise.\n",
        "TRANSLATION_18": "(Lo! those who chose) worshipped (the calf) and whoever emulates them, (terror) wrath (from their Lord and humiliation) through the imposition of the capitation tax (will come upon them in the life of the world. Thus do We requite those who invent a lie) against Allah.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:152",
            "20:72",
            "40:51",
            "2:86",
            "10:7",
            "79:38",
            "6:29",
            "30:7",
            "18:104",
            "14:27"
        ],
        "BIBLE": [
            "prophets:jeremiah:51:56",
            "writings:psalms:31:14",
            "torah:genesis:18:31",
            "prophets:ii%20kings:8:8",
            "torah:numbers:16:15",
            "prophets:ii%20kings:18:22",
            "prophets:amos:4:2",
            "prophets:isaiah:36:7",
            "prophets:i%20kings:18:10",
            "torah:genesis:30:23"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:1:1"
        ]
    }
}