{
    "VERSE": "7:153",
    "ARABIC": "وَٱلَّذِينَ عَمِلُوا۟ ٱلسَّيِّـَٔاتِ ثُمَّ تَابُوا۟ مِنۢ بَعْدِهَا وَءَامَنُوٓا۟ إِنَّ رَبَّكَ مِنۢ بَعْدِهَا لَغَفُورٌ رَّحِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "But as for those who do evil actions and then subsequently make tawba and have iman, in that case your Lord is Ever-Forgiving, Most Merciful.",
        "TRANSLATION_1": "Yet those who do wrong, then repent and believe, are forgiven, for your Lord is forgiving and kind.\n",
        "TRANSLATION_2": "As for those who do evil, and later repent and have faith, such shall find their Lord All-Forgiving, All-Compassionate after (they repent and believe)\n",
        "TRANSLATION_3": "To those who commit bad deeds, but, then, repent and believe (in God), Your Lord will certainly be All-forgiving and All-merciful.\"\n",
        "TRANSLATION_4": "And those who performed misdeeds and then repented and accepted faith – so after that, your Lord is Oft Forgiving, Most Merciful.\n",
        "TRANSLATION_5": "But those who committed evil deeds and then repented afterwards and believed, verily, your Lord after (all) that is indeed Oft-Forgiving, Most Merciful.\n",
        "TRANSLATION_6": "And (as to) those who do evil deeds, then repent after that and believe, your Lord after that is most surely Forgiving, Merciful.\n",
        "TRANSLATION_7": "And those who do evil deeds, then repent thereafter and believe, surely thereafter thy Lord is All-forgiving, All-compassionate.'\n",
        "TRANSLATION_8": "But those who do ill-deeds and afterward repent and believe - lo! for them, afterward, Allah is Forgiving, Merciful.\n",
        "TRANSLATION_9": "As for those who committed evils, and thereafter repented and believed, they shall find your Lord forgiving and merciful.\n",
        "TRANSLATION_10": "And those who committed evils, and repented thereafter and believed --verily thy Lord is thereafter Forgiving, Merciful.\n",
        "TRANSLATION_11": "Yet [to] those who commit misdeeds but repent after that, and believe—indeed, after that, your Lord shall surely be all-forgiving, all-merciful.\n",
        "TRANSLATION_12": "But those who do wrong but repent thereafter and (truly) believe,- verily thy Lord is thereafter Oft-Forgiving, Most Merciful.\n",
        "TRANSLATION_13": "But those who committed evil deeds and then repented afterwards and believed, verily, your Lord after (all) that is indeed Oft-Forgiving, Most Merciful.\n",
        "TRANSLATION_14": "As for those who do evil and later repent and believe, your Lord is Forgiving, the Most Merciful thereafter.\n",
        "TRANSLATION_15": "As for those who commit sins, and then repent afterwards and believe—your Lord, thereafter, is Forgiving and Merciful.\n",
        "TRANSLATION_16": "But those who committed misdeeds and then repented after them and believed - indeed your Lord, thereafter, is Forgiving and Merciful.\n",
        "TRANSLATION_17": "[7:153] But those who commit evil deeds and repent, desist from them, thereafter and believe, in God — indeed your Lord thereafter, that is, after repentance, is truly Forgiving, Merciful’, towards them.\n",
        "TRANSLATION_18": "174 (But those who do ill deeds) while ascribing partners to Allah (and afterward repent) after their idolatry; it is also said that this means: after committing transgressions (and believe) profess Allah's divine Oneness and believe in Allah (lo! for them, afterward) after repentance and accepting faith, (your Lord) Moses; and it is also said: Muhammad (is Forgiving) He overlooks sins, (Merciful).\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:153",
            "16:119",
            "16:110",
            "6:54",
            "27:11",
            "12:53",
            "3:89",
            "24:5",
            "7:167",
            "14:36"
        ],
        "BIBLE": [
            "torah:deuteronomy:20:18",
            "prophets:amos:7:6",
            "prophets:ezekiel:33:29",
            "prophets:isaiah:43:10",
            "prophets:jeremiah:16:10",
            "prophets:isaiah:30:18",
            "torah:exodus:28:38",
            "writings:daniel:9:9",
            "torah:deuteronomy:1:32",
            "writings:psalms:99:8"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:2:2",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:6:2"
        ]
    }
}