{
    "VERSE": "7:157",
    "ARABIC": "ٱلَّذِينَ يَتَّبِعُونَ ٱلرَّسُولَ ٱلنَّبِىَّ ٱلْأُمِّىَّ ٱلَّذِى يَجِدُونَهُۥ مَكْتُوبًا عِندَهُمْ فِى ٱلتَّوْرَىٰةِ وَٱلْإِنجِيلِ يَأْمُرُهُم بِٱلْمَعْرُوفِ وَيَنْهَىٰهُمْ عَنِ ٱلْمُنكَرِ وَيُحِلُّ لَهُمُ ٱلطَّيِّبَٰتِ وَيُحَرِّمُ عَلَيْهِمُ ٱلْخَبَٰٓئِثَ وَيَضَعُ عَنْهُمْ إِصْرَهُمْ وَٱلْأَغْلَٰلَ ٱلَّتِى كَانَتْ عَلَيْهِمْ فَٱلَّذِينَ ءَامَنُوا۟ بِهِۦ وَعَزَّرُوهُ وَنَصَرُوهُ وَٱتَّبَعُوا۟ ٱلنُّورَ ٱلَّذِىٓ أُنزِلَ مَعَهُۥٓ أُو۟لَٰٓئِكَ هُمُ ٱلْمُفْلِحُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "those who follow the Messenger, the Unlettered Prophet, whom they find written down with them in the Torah and the Gospel, commanding them to do right and forbidding them to do wrong, making good things halal for them and bad things haram for them, relieving them of their heavy loads and the chains which were around them. Those who have iman in him and honour him and help him, and follow the Light that has been sent down with him, they are the ones who are successful.'",
        "TRANSLATION_1": "Who follow the messenger, the gentile Prophet, described in the Torah and the Gospel, who bids things noble and forbids things vile, makes lawful what is clean, and prohibits what is foul, who relieves them of their burdens, and the yoke that lies upon them. Those who believe and honour and help him, and follow the light sent with him, are those who will attain their goal.\"\n",
        "TRANSLATION_2": "[To-day this mercy is for] those who follow the ummi Prophet, whom they find mentioned in the Torah and the Gospel with them. He enjoins upon them what is good and forbids them what is evil. He makes the clean things lawful to them and prohibits all corrupt things, and removes from them their burdens and the shackles that were upon them. So those who believe in him and assist him, and succour him and follow the Light which has been sent down with him, it is they who shall prosper.\n",
        "TRANSLATION_3": "There are those who follow the Messengers, the illiterate Prophet (not conventionally educated), whose description they find written in the Torah and the Gospel. [He (the Messengers) enjoins them to do good and forbids them to do all that is unlawful, makes lawful for them all that is pure and unlawful all that is filthy, removes their burdens and the entanglements in which they are involved]. Those who believe in him, honor and help him, and follow the light which is sent down to him, will have everlasting happiness.\n",
        "TRANSLATION_4": "“Those who will obey this Noble Messenger (Prophet Mohammed – peace and blessings be upon him), the Herald of the Hidden who is untutored* (except by Allah), whom they will find mentioned in the Taurat and the Injeel with them; he will command them to do good and forbid them from wrong, and he will make lawful for them the good clean things and prohibit the foul for them, and he will unburden the loads and the neck chains which were upon them; so those who believe in him, and revere** him, and help him, and follow the light which came down with him – it is they who have succeeded.\" (*The Holy Prophet was taught by Allah Himself – see Surah 55 Al-Rahman. **To honour the Holy Prophet – peace and blessings be upon him – is part of faith. To disrespect him is blasphemy.)\n",
        "TRANSLATION_5": "Those who follow the Messenger, the Prophet who can neither read nor write whom they find written of with them in the Tawrah and the Injil, -- he commands them to do good; and forbids them from evil; he makes lawful for them the good things, and forbids them from the evil things, he releases them from their heavy burdens and from the fetters that were upon them. So those who believe in him, honor him, help him, and follow the light which has been sent down with him, it is they who will be successful.\n",
        "TRANSLATION_6": "Those who follow the Apostle-Prophet, the Ummi, whom they find written down with them in the Taurat and the Injeel (who) enjoins them good and forbids them evil, and makes lawful to them the good things and makes unlawful to them impure things, and removes from them their burden and the shackles which were upon them; so (as for) those who believe in him and honor him and help him, and follow the light which has been sent down with him, these it is that are the successful.\n",
        "TRANSLATION_7": "those who follow the Messenger, 'the Prophet of the common folk, whom they find written down with them in the Torah and the Gospel, bidding them to honour, and forbidding them dishonour, making lawful for them the good things and making unlawful for them the corrupt things, and relieving them of their loads, and the fetters that were upon them. Those who believe in him and succour him and help him, and follow the light that has been sent down with him -- they are the prosperers.'\n",
        "TRANSLATION_8": "Those who follow the messenger, the Prophet who can neither read nor write, whom they will find described in the Torah and the Gospel (which are) with them. He will enjoin on them that which is right and forbid them that which is wrong. He will make lawful for them all good things and prohibit for them only the foul; and he will relieve them of their burden and the fetters that they used to wear. Then those who believe in him, and honour him, and help him, and follow the light which is sent down with him: they are the successful.\n",
        "TRANSLATION_9": "Also for those who follow the Messenger, the unlettered prophet they find described in the Torah that is with them, and in the Gospel, who commands them to do right and forbids them to do wrong, who makes good things lawful to them and bad things unlawful, who will relieve them of their burdens and of the shackles that weigh upon them. Those that believe in him and honour him, those that aid him and follow the light sent down with him, shall surely triumph.\"\n",
        "TRANSLATION_10": "Those who follow the apostle, the unlettered prophet. Whom they find written down with them in the Taurat and the Injil; he biddeth them to the seemly and prohibiteth unto them the unseemly, alloweth unto them things clean and forbiddeth unto them things unclean and relieveth them of their burthen and the shackles which have been upon them. Those who believe in him and side with him and succour him and follow the light which hath been sent down with him; those: they shall fare well.\n",
        "TRANSLATION_11": "—those who follow the Apostle, the untaught prophet, whose mention they find written with them in the Torah and the Evangel, who bids them to do what is right and forbids them from what is wrong, makes lawful to them all the good things and forbids them from all vicious things, and relieves them of their burdens and the shackles that were upon them—those who believe in him, honour him, and help him and follow the light that has been sent down with him, they are the felicitous.’\n",
        "TRANSLATION_12": "Those who follow the messenger, the unlettered Prophet, whom they find mentioned in their own (scriptures),- in the law and the Gospel;- for he commands them what is just and forbids them what is evil; he allows them as lawful what is good (and pure) and prohibits them from what is bad (and impure); He releases them from their heavy burdens and from the yokes that are upon them. So it is those who believe in him, honour him, help him, and follow the light which is sent down with him,- it is they who will prosper.\"\n",
        "TRANSLATION_13": "Those who follow the Messenger, the Prophet who can neither read nor write (i.e. Muhammad SAW) whom they find written with them in the Taurat (Torah) (Deut, xviii, 15) and the Injeel (Gospel) (John xiv, 16), - he commands them for Al-Ma'ruf (i.e. Islamic Monotheism and all that Islam has ordained); and forbids them from Al-Munkar (i.e. disbelief, polytheism of all kinds, and all that Islam has forbidden); he allows them as lawful At-Taiyibat [(i.e. all good and lawful) as regards things, deeds, beliefs, persons, foods, etc.], and prohibits them as unlawful Al-Khaba'ith (i.e. all evil and unlawful as regards things, deeds, beliefs, persons, foods, etc.), he releases them from their heavy burdens (of Allah's Covenant), and from the fetters (bindings) that were upon them. So those who believe in him (Muhammad SAW), honour him, help him, and follow the light (the Quran) which has been sent down with him, it is they who will be successful.\n",
        "TRANSLATION_14": "and to those who shall follow the Messenger the Unlettered Prophet (Muhammad) whom they shall find written with them in the Torah and the Gospel. He will order kindness upon them and forbid them to do evil. He will make good things lawful to them and prohibit all that is foul. He will relieve them of their burdens and of the shackles that weigh upon them. Those who believe in him and honor him, those who aid him and follow the light sent forth with him, shall surely prosper'\n",
        "TRANSLATION_15": "Those who follow the Messenger, the Unlettered Prophet, whom they find mentioned in the Torah and the Gospel in their possession. He directs them to righteousness, and deters them from evil, and allows for them all good things, and prohibits for them wickedness, and unloads the burdens and the shackles that are upon them. Those who believe in him, and respect him, and support him, and follow the light that came down with him—these are the successful.\n",
        "TRANSLATION_16": "Those who follow the Messenger, the unlettered prophet, whom they find written in what they have of the Torah and the Gospel, who enjoins upon them what is right and forbids them what is wrong and makes lawful for them the good things and prohibits for them the evil and relieves them of their burden and the shackles which were upon them. So they who have believed in him, honored him, supported him and followed the light which was sent down with him - it is those who will be the successful.\n",
        "TRANSLATION_17": "[7:157] those who follow the Messenger, the uninstructed Prophet, Muhammad (s) whom they will find inscribed in their Torah and Gospel, in name and description, enjoining them to decency and forbidding them indecency, making lawful for them the good things, which were forbidden [to them] by their Law, and making unlawful for them the vile things, such as carrion and the like, and relieving them of their burden, their onus, and the shackles, the hardships, that they used to bear, such as [the requirement] to kill oneself as a repentance and the severing of that part that had come into contact with any impurity. Then those who believe in him, from among them, and honour, revere, him, and help him, and follow the light that has been revealed with him, namely, the Qur’ān, they are the ones who will prosper’.\n",
        "TRANSLATION_18": "(Those who follow the messenger) the religion of the Messenger, (the Prophet who can neither read nor write) i.e. Muhammad (pbuh) (whom they will find) with his traits and description (described in the Torah and the Gospel (which are) with them. He will enjoin on them that which is right) Allah's divine Oneness and moral excellence (and forbid them that which is wrong) disbelief and hurting others. (He will make lawful for them all good things) he explains to them the lawfulness of that which is in the Scripture such as the meat and milk of camels, sheep and others (and prohibit for them only the foul) he explains to them the unlawfulness of what is in the Scripture such as carrion, the meat of swine and other things; (and he will relieve them of their burden) their pledges the breaking of which made good things unlawful for them (and the fetters) the hardships (that they used to wear) such as tearing up their clothes and other things. (Then those who believe in him) in Muhammad (pbuh) i.e. 'Abdullah Ibn Salam and his followers, (and honour him) and assist him (and help him) with the sword, (and follow the light) the Qur'an (which is sent down with him) which was sent with Gabriel: that which is lawful, they declared lawful, and that which unlawful, they declared unlawful: (they are the successful) who are saved from Allah's wrath and torment.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:157",
            "3:81",
            "64:8",
            "57:19",
            "40:83",
            "9:63",
            "9:88",
            "33:57",
            "7:36",
            "49:3"
        ],
        "BIBLE": [
            "prophets:ii%20samuel:23:5",
            "prophets:joshua:1:8",
            "writings:ii%20chronicles:5:13",
            "writings:daniel:6:13",
            "prophets:isaiah:55:3",
            "prophets:amos:6:10",
            "writings:psalms:37:6",
            "writings:ii%20chronicles:10:10",
            "prophets:i%20kings:12:10",
            "prophets:jeremiah:32:40"
        ]
    }
}