{
    "VERSE": "7:158",
    "ARABIC": "قُلْ يَٰٓأَيُّهَا ٱلنَّاسُ إِنِّى رَسُولُ ٱللَّهِ إِلَيْكُمْ جَمِيعًا ٱلَّذِى لَهُۥ مُلْكُ ٱلسَّمَٰوَٰتِ وَٱلْأَرْضِ لَآ إِلَٰهَ إِلَّا هُوَ يُحْىِۦ وَيُمِيتُ فَـَٔامِنُوا۟ بِٱللَّهِ وَرَسُولِهِ ٱلنَّبِىِّ ٱلْأُمِّىِّ ٱلَّذِى يُؤْمِنُ بِٱللَّهِ وَكَلِمَٰتِهِۦ وَٱتَّبِعُوهُ لَعَلَّكُمْ تَهْتَدُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Say: 'Mankind! I am the Messenger of Allah to you all, of Him to whom the kingdom of the heavens and earth belongs. There is no god but Him. He gives life and causes to die.' So have iman in Allah and His you will be guided.'",
        "TRANSLATION_1": "Say: \"O men, I am verily the apostle of God to you all. His whose kingdom extends over the heavens and the earth. There is no god but He, the giver of life and death. So believe in God and the messenger, the gentile Prophet, sent by Him, who believes in God and His messages. Obey him; you may haply be guided aright.\"\n",
        "TRANSLATION_2": "[Say, O Muhammad]: 'O men! I am Allah's Messenger to you all - of Him to Whom belongs the dominion of the heavens and the earth. There is no god but He. He grants life and deals death. Have faith then, in Allah and in His Messenger, the ummi Prophet who believes in Allah and His words; and follow him so that you may be guided aright.'\n",
        "TRANSLATION_3": "(Muhammad), tell them, \"People, I have come to you all as the Messengers of God, to whom the Kingdom of the heavens and the earth belongs. There is no God but He. In His hands are life and death. Have faith in God and His Messengers, the unlettered Prophet who believes in God and His words. Follow him so that you will perhaps have guidance.\"\n",
        "TRANSLATION_4": "Say (O dear Prophet Mohammed – peace and blessings be upon him), “O people! Indeed I am, towards you all, the Noble Messenger of Allah – for Whom (Allah) only is the kingship of the heavens and the earth; there is none worthy of worship, except Him – giving life and giving death; therefore believe in Allah and His Noble Messenger, the Prophet who is untutored (except by Allah), who believes in Allah and His Words, and obey him (the Prophet) to attain guidance.” (Prophet Mohammed – peace and blessings be upon him – is the Prophet towards all mankind.)\n",
        "TRANSLATION_5": "Say: \"O mankind! Verily, I am sent to you all as the Messenger of Allah -- to Whom belongs the dominion of the heavens and the earth. None has the right to be worshipped but He. It is He Who gives life and causes death. So believe in Allah and His Messenger, the Prophet who can neither read nor write, who believes in Allah and His Words, and follow him so that you may be guided.\"\n",
        "TRANSLATION_6": "Say: O people! surely I am the Apostle of Allah to you all, of Him Whose is the kingdom of the heavens and the earth there is no god but He; He brings to life and causes to die therefore believe in Allah and His apostle, the Ummi Prophet who believes in Allah and His words, and follow him so that you may walk in the right way.\n",
        "TRANSLATION_7": "Say: 'O mankind, I am the Messenger of God to you all, of Him to whom belongs the kingdom of the heavens and of the earth. There is no god but He. He gives life, and makes to die. Believe then in God, and in His Messenger, the Prophet of the common folk, who believes in God and His words, and follow him; haply so you will be guided.'\n",
        "TRANSLATION_8": "Say (O Muhammad): O mankind! Lo! I am the messenger of Allah to you all - (the messenger of) Him unto Whom belongeth the Sovereignty of the heavens and the earth. There is no Allah save Him. He quickeneth and He giveth death. So believe in Allah and His messenger, the Prophet who can neither read nor write, who believeth in Allah and in His Words, and follow him that haply ye may be led aright.\n",
        "TRANSLATION_9": "Say, \"People, I am God's Messenger to you all, He has sovereignty over the heavens and the earth. There is no god but Him. He ordains life and death, so believe in God and His Messenger, the unlettered prophet who believes in God and His words. Follow him so that you may be rightly guided.\"\n",
        "TRANSLATION_10": "Say thou: O mankind! verily I am the apostle of Allah unto you all- of Him whose is the dominion of the heavens and the earth. No god is there but he; He giveth life and causeth to die. Believe then in Allah and His prophet, the unlettered prcphet, who believeth in Allah and His words, and follow him that haply ye may be guided.\n",
        "TRANSLATION_11": "Say, ‘O mankind! I am the Apostle of Allah to you all, [of Him] to whom belongs the kingdom of the heavens and the earth. There is no god except Him. He gives life and brings death.’ So have faith in Allah and His Apostle, the untaught prophet, who has faith in Allah and His words, and follow him so that you may be guided.\n",
        "TRANSLATION_12": "Say: \"O men! I am sent unto you all, as the Messenger of Allah, to Whom belongeth the dominion of the heavens and the earth: there is no god but He: it is He That giveth both life and death. So believe in Allah and His Messenger, the Unlettered Prophet, who believeth in Allah and His words: follow him that (so) ye may be guided.\"\n",
        "TRANSLATION_13": "Say (O Muhammad SAW): \"O mankind! Verily, I am sent to you all as the Messenger of Allah - to Whom belongs the dominion of the heavens and the earth. La ilaha illa Huwa (none has the right to be worshipped but He); It is He Who gives life and causes death. So believe in Allah and His Messenger (Muhammad SAW), the Prophet who can neither read nor write (i.e. Muhammad SAW) who believes in Allah and His Words [(this Quran), the Taurat (Torah) and the Injeel (Gospel) and also Allah's Word: \"Be!\" - and he was, i.e. 'Iesa (Jesus) son of Maryam (Mary)], and follow him so that you may be guided.\"\n",
        "TRANSLATION_14": "Say: 'O mankind, I am the Messenger of Allah to you all. His is the kingdom in the heavens and the earth. There is no god except He. He revives and causes to die. Therefore, believe in Allah and His Messenger, the Unlettered Prophet, who believes in Allah and His Words. Follow him in order that you are guided.'\n",
        "TRANSLATION_15": "Say, “O people, I am the Messenger of God to you all—He to whom belongs the kingdom of the heavens and the earth. There is no god but He. He gives life and causes death.” So believe in God and His Messenger, the Unlettered Prophet, who believes in God and His words. And follow him, that you may be guided.\n",
        "TRANSLATION_16": "Say, [O Muhammad], \"O mankind, indeed I am the Messenger of Allah to you all, [from Him] to whom belongs the dominion of the heavens and the earth. There is no deity except Him; He gives life and causes death.\" So believe in Allah and His Messenger, the unlettered prophet, who believes in Allah and His words, and follow him that you may be guided.\n",
        "TRANSLATION_17": "[7:158] Say, addressing the Prophet (s) here: ‘O mankind, I am the Messenger of God to you all, [the Messenger] of Him to Whom belongs the kingdom of the heavens and of the earth. There is no god but Him. He gives life and makes to die. Believe, then, in God and His Messenger, the uninstructed Prophet, who believes in God and His words, the Qur’ān, and follow him, so that you might be guided, led aright.\n",
        "TRANSLATION_18": "(Say) Muhammad: (0 mankind! Lo! I am the Messenger of Allah to you all (the Messenger of) Him unto whom belongeth the Sovereignty) the stores (of the heavens and the earth. There is no God save Him) 175 there is no Provider save Him. (He quickeneth) for the resurrection (and He giveth death) in the life of this world. (So believe in Allah and His messenger, the Prophet who can neither read nor write, who believeth in Allah and in His words) in the Qur'an; or, according to another Qur'anic variant: in Jesus, who became a created being with a word, Be, and he was (and follow him) follow the religion of Muhammad (pbuh) (that haply ye may be led aright) in order that you be guided from error to faith.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:158",
            "39:44",
            "57:5",
            "4:170",
            "33:56",
            "22:75",
            "35:3",
            "16:49",
            "63:7",
            "27:25"
        ],
        "BIBLE": [
            "prophets:judges:18:10",
            "torah:exodus:36:6",
            "prophets:ezekiel:3:20",
            "prophets:ezekiel:3:18",
            "prophets:i%20kings:19:2",
            "prophets:jeremiah:38:4",
            "prophets:isaiah:37:20",
            "writings:ii%20chronicles:14:6",
            "prophets:ii%20kings:10:15",
            "torah:leviticus:17:11"
        ]
    }
}