{
    "VERSE": "7:159",
    "ARABIC": "وَمِن قَوْمِ مُوسَىٰٓ أُمَّةٌ يَهْدُونَ بِٱلْحَقِّ وَبِهِۦ يَعْدِلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Among the people of Musa there is a group who guide by the truth and act justly in accordance with it.",
        "TRANSLATION_1": "Among the people of Moses is a section that shows the way to the truth, and deals justly in accordance with it.\n",
        "TRANSLATION_2": "Among the people of Moses' there was a party who guided others in the way of the truth and established justice in its light.\n",
        "TRANSLATION_3": "Among the people of Moses are some whose guidance and Judgment are based on the Truth.\n",
        "TRANSLATION_4": "And among the people of Moosa is a group that shows the true path, and establishes justice with it.\n",
        "TRANSLATION_5": "And of the people of Musa there is a community who lead (the men) with truth and establish justice therewith.\n",
        "TRANSLATION_6": "And of Musa's people was a party who guided (people) with the truth, and thereby did they do justice.\n",
        "TRANSLATION_7": "Of the people of Moses there is a nation who guide by the truth, and by it act with justice.\n",
        "TRANSLATION_8": "And of Moses' folk there is a community who lead with truth and establish justice therewith.\n",
        "TRANSLATION_9": "Yet there is a group among the people of Moses who guide with truth and act justly in accordance with it.\n",
        "TRANSLATION_10": "And of the people of Musa there is a community guiding others by the truth and judging thereby.\n",
        "TRANSLATION_11": "Among the people of Moses is a nation who guide [the people] by the truth and do justice thereby.\n",
        "TRANSLATION_12": "Of the people of Moses there is a section who guide and do justice in the light of truth.\n",
        "TRANSLATION_13": "And of the people of Musa (Moses) there is a community who lead (the men) with truth and establish justice therewith (i.e. judge men with truth and justice).\n",
        "TRANSLATION_14": "Yet among the people of Moses there was a nation who preached the truth and acted justly.\n",
        "TRANSLATION_15": "Among the people of Moses is a community that guides by truth, and thereby does justice.\n",
        "TRANSLATION_16": "And among the people of Moses is a community which guides by truth and by it establishes justice.\n",
        "TRANSLATION_17": "[7:159] And among the people of Moses there is a community, a group, who guide, people, by the truth and act   justly according to it, when passing judgements.\n",
        "TRANSLATION_18": "(And of Moses' folk there is a community) a group (who lead with) enjoin (truth and establish justice therewith) they act upon the Truth. These are those beyond the river al-Raml.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:159",
            "7:181",
            "28:3",
            "6:66",
            "5:84",
            "7:118",
            "10:86",
            "37:37",
            "21:55",
            "15:55"
        ],
        "BIBLE": [
            "writings:psalms:139:24",
            "writings:psalms:37:23",
            "writings:psalms:27:11",
            "writings:nehemiah:9:19",
            "writings:job:24:13",
            "writings:proverbs:8:20",
            "writings:proverbs:4:18",
            "writings:job:38:19",
            "writings:psalms:43:3",
            "writings:psalms:25:9"
        ]
    }
}