{
    "VERSE": "7:16",
    "ARABIC": "قَالَ فَبِمَآ أَغْوَيْتَنِى لَأَقْعُدَنَّ لَهُمْ صِرَٰطَكَ ٱلْمُسْتَقِيمَ",
    "ENGLISH": {
        "TRANSLATION_0": "He said, 'By Your misguidance of me, I will lie in ambush for them on your straight path.",
        "TRANSLATION_1": "Since You led me into error,\" said Iblis, \"I shall lie in wait for them along Your straight path.\n",
        "TRANSLATION_2": "Satan said: 'Since You have led me astray, I shall surely sit in ambush for them on Your Straight Path.\n",
        "TRANSLATION_3": "Then Satan said, \"Because you have made me go astray, I shall certainly try to seduce people into straying from the right path.\n",
        "TRANSLATION_4": "He said, “Hence I swear by the fact that You sent me astray, I will certainly lay in wait for them on Your Straight Path.”\n",
        "TRANSLATION_5": "(Iblis) said: \"Because You have `Aghwaytni', surely, I will sit in wait against them (human beings) on Your straight path.\n",
        "TRANSLATION_6": "He said: As Thou hast caused me to remain disappointed I will certainly lie in wait for them in Thy straight path.\n",
        "TRANSLATION_7": "Said he, 'Now, for Thy perverting me, I shall surely sit in ambush for them on Thy straight path;\n",
        "TRANSLATION_8": "He said: Now, because Thou hast sent me astray, verily I shall lurk in ambush for them on Thy Right Path.\n",
        "TRANSLATION_9": "Then Satan said, \"Because You have put me in the wrong, I will lie in ambush for them on Your straight path:\n",
        "TRANSLATION_10": "He said: because Thou hast seduced me, I will beset for them Thy straight path.\n",
        "TRANSLATION_11": "‘As You have consigned me to perversity,’ he said, ‘I will surely lie in wait for them on Your straight path.\n",
        "TRANSLATION_12": "He said: \"Because thou hast thrown me out of the way, lo! I will lie in wait for them on thy straight way:\n",
        "TRANSLATION_13": "(Iblis) said: \"Because You have sent me astray, surely I will sit in wait against them (human beings) on Your Straight Path.\n",
        "TRANSLATION_14": "he answered: 'Because You have caused me to go astray, I will waylay them as they walk on Your Straight Path,\n",
        "TRANSLATION_15": "He said, “Because you have lured me, I will waylay them on Your straight path.\n",
        "TRANSLATION_16": "[Satan] said, \"Because You have put me in error, I will surely sit in wait for them on Your straight path.\n",
        "TRANSLATION_17": "[7:16]   Said he, ‘Now, because You have sent me astray (fa-bi-mā aghwaytanī means bi-ighwā’ik, ‘for Your sending me astray’: the bā’ is for oaths, and the response of the oath is [the following]) verily I shall sit in ambush for them, that is, for the Children of Adam, on Your straight path, that is, on the path that leads to You.\n",
        "TRANSLATION_18": "(He) Iblis (said: Now, because Thou hast sent me astray) just as You made me err from guidance, (verily I shall lurk in ambush for them) for the children of Adam (on Thy Right Path) the religion of Islam.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:16",
            "43:43",
            "1:6",
            "43:61",
            "37:118",
            "4:68",
            "23:73",
            "15:41",
            "23:74",
            "7:6"
        ],
        "BIBLE": [
            "writings:psalms:5:9",
            "writings:daniel:3:25",
            "writings:job:1:7",
            "torah:exodus:3:12",
            "writings:job:2:2",
            "prophets:jeremiah:7:23",
            "torah:deuteronomy:9:12",
            "prophets:zechariah:1:10",
            "writings:psalms:27:11",
            "prophets:isaiah:30:21"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:3:6",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:5:2"
        ]
    }
}