{
    "VERSE": "7:174",
    "ARABIC": "وَكَذَٰلِكَ نُفَصِّلُ ٱلْءَايَٰتِ وَلَعَلَّهُمْ يَرْجِعُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "That is how We make the Signs clear so that hopefully they will return.",
        "TRANSLATION_1": "That is how We explain Our signs distinctly so that they may come back (to the right path).\n",
        "TRANSLATION_2": "And thus do We expound the signs that they may turn back (to the right path).\n",
        "TRANSLATION_3": "Thus do We explain Our revelations so that they might return to (the right path).\n",
        "TRANSLATION_4": "And this is how We explain the verses in different ways, and so that they may return.\n",
        "TRANSLATION_5": "Thus do We explain the Ayat in detail, so that they may turn (unto the truth).\n",
        "TRANSLATION_6": "And thus do We make clear the communications, and that haply they might return.\n",
        "TRANSLATION_7": "So We distinguish the signs; and haply they will return.\n",
        "TRANSLATION_8": "Thus we detail the revelations, that haply they may return.\n",
        "TRANSLATION_9": "We explain Our signs in detail thus, so that perhaps they may return to Us.\n",
        "TRANSLATION_10": "And Thus We detail the revelations, that haply they may return.\n",
        "TRANSLATION_11": "Thus do We elaborate the signs, so that they may come back.\n",
        "TRANSLATION_12": "Thus do We explain the signs in detail; and perchance they may turn (unto Us).\n",
        "TRANSLATION_13": "Thus do We explain the Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) in detail, so that they may turn (unto the truth).\n",
        "TRANSLATION_14": "As such We make plain Our verses in order that they return.\n",
        "TRANSLATION_15": "We thus elaborate the revelations, so that they may return.\n",
        "TRANSLATION_16": "And thus do We [explain in] detail the verses, and perhaps they will return.\n",
        "TRANSLATION_17": "[7:174] Thus We detail the signs, We explain them even as We have explained the covenant, that they might reflect on them, and that they might revert, from their disbelief.\n",
        "TRANSLATION_18": "(Thus We detail Our revelations) We explain in the Qur'an the story of the Covenant, (that haply they may return) from disbelief and idolatry to the initial Covenant.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:174",
            "6:55",
            "15:75",
            "15:77",
            "2:242",
            "20:126",
            "6:105",
            "37:80",
            "37:121",
            "37:131"
        ],
        "BIBLE": [
            "prophets:isaiah:40:3",
            "writings:psalms:21:13",
            "prophets:ezekiel:35:9",
            "writings:psalms:85:14",
            "prophets:isaiah:10:2",
            "prophets:isaiah:55:11",
            "prophets:i%20kings:8:33",
            "prophets:isaiah:29:21",
            "writings:job:41:20",
            "writings:ezra:5:5"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:6:5"
        ]
    }
}