{
    "VERSE": "7:175",
    "ARABIC": "وَٱتْلُ عَلَيْهِمْ نَبَأَ ٱلَّذِىٓ ءَاتَيْنَٰهُ ءَايَٰتِنَا فَٱنسَلَخَ مِنْهَا فَأَتْبَعَهُ ٱلشَّيْطَٰنُ فَكَانَ مِنَ ٱلْغَاوِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Recite to them the tale of him to whom We gave Our Signs, but who then cast them to one side and Shaytan caught up with him. He was one of those lured into error.",
        "TRANSLATION_1": "Relate to them the plight of the man whom We gave Our signs, but he passed them by, so that Satan came after him, and he went astray.\n",
        "TRANSLATION_2": "And recite to them [O Muhammad] the story of the man to whom We gave Our signs and who turned away from them; then ultimately Satan caught up with him and he was led astray.\n",
        "TRANSLATION_3": "(Muhammad), tell them the story of the person whom We inspired with Our guidance, but who detached himself from it and who was then pursued by Satan until he turned into a rebel.\n",
        "TRANSLATION_4": "And O dear Prophet (Mohammed – peace and blessings be upon him) recite to them the case of the one to whom We gave Our revelations, and in response he departed from them completely – so Satan went after him – he therefore became of the astray.\n",
        "TRANSLATION_5": "And recite to them the story of him to whom We gave Our Ayat, but he threw them away; so Shaytan followed him up, and he became of those who went astray.\n",
        "TRANSLATION_6": "And recite to them the narrative of him to whom We give Our communications, but he withdraws himself from them, so the Shaitan overtakes him, so he is of those who go astray.\n",
        "TRANSLATION_7": "And recite to them the tiding of him to whom We gave Our signs, but he cast them off; and Satan followed after him, and he became one of the perverts.\n",
        "TRANSLATION_8": "Recite unto them the tale of him to whom We gave Our revelations, but he sloughed them off, so Satan overtook him and he became of those who lead astray.\n",
        "TRANSLATION_9": "Recite to them the tale of the man to whom We gave Our signs, but who then cast them to one side and Satan overtook him. And he became one of those who went astray,\n",
        "TRANSLATION_10": "And recite thou unto them the story of him Unto whom We vouchsafed Our signs, but he sloughed them off, wherefore the Satan followed him, and he became of the perverted.\n",
        "TRANSLATION_11": "Relate to them an account of him to whom We gave Our signs, but he cast them off. Thereupon Satan pursued him, and he became one of the perverse.\n",
        "TRANSLATION_12": "Relate to them the story of the man to whom We sent Our signs, but he passed them by: so Satan followed him up, and he went astray.\n",
        "TRANSLATION_13": "And recite (O Muhammad SAW) to them the story of him to whom We gave Our Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.), but he threw them away, so Shaitan (Satan) followed him up, and he became of those who went astray.\n",
        "TRANSLATION_14": "Recite to them the news of he to whom We gave Our verses and who turned away from them; how satan overtook him so he was led astray.\n",
        "TRANSLATION_15": "And relate to them the story of him to whom We delivered Our signs, but he detached himself from them, so Satan went after him, and he became one of the perverts.\n",
        "TRANSLATION_16": "And recite to them, [O Muhammad], the news of him to whom we gave [knowledge of] Our signs, but he detached himself from them; so Satan pursued him, and he became of the deviators.\n",
        "TRANSLATION_17": "[7:175] And recite, O Muhammad (s), to them, that is, the Jews, the tidings, the tale, of him to whom We gave Our signs, but he cast them off, emerging in his disbelief in the same way that a snake emerges from its [shed] skin, he rebelled in disbelief, this was Bal‘am b. Bā‘ūrā’, a scholar from among the Children of Israel, who had been given some knowledge [of the Scriptures], and who was asked [by them] to invoke God against Moses. And when he did, the invocation turned against him and his tongue fell out onto his chest, and Satan pursued him, catching up with him and so he became his comrade, and he became of the perverse.\n",
        "TRANSLATION_18": "(Recite unto them) Muhammad (the tale of him to whom We gave Our revelations) the greatest divine name, (but he sloughed them off) the reference here is to Bal'am Ibn Ba'ura' whom Allah honoured with His greatest name but he used to pray against Moses and so Allah took it away from him. It is also said that the reference here is to Umayyah Ibn al-Salt whom Allah honoured with knowledge and good speech but when he did not believe, Allah took this away from him, (so Satan overtook him) Satan deluded him (and he became of those who lead astray) he became of the erring disbelievers.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:175",
            "15:81",
            "7:201",
            "37:112",
            "26:69",
            "43:69",
            "54:4",
            "44:33",
            "90:19",
            "42:35"
        ],
        "BIBLE": [
            "prophets:i%20samuel:10:9",
            "writings:song%20of%20songs:5:6",
            "prophets:i%20kings:19:21",
            "writings:ii%20chronicles:9:12",
            "prophets:judges:8:33",
            "prophets:ezekiel:3:20",
            "prophets:joshua:2:5",
            "writings:ii%20chronicles:13:15",
            "prophets:i%20samuel:4:19",
            "prophets:i%20kings:20:39"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:5:1"
        ]
    }
}