{
    "VERSE": "7:177",
    "ARABIC": "سَآءَ مَثَلًا ٱلْقَوْمُ ٱلَّذِينَ كَذَّبُوا۟ بِـَٔايَٰتِنَا وَأَنفُسَهُمْ كَانُوا۟ يَظْلِمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "How evil is the metaphor of those who deny Our Signs. It is themselves that they have badly wronged.",
        "TRANSLATION_1": "Evil is the case of those who deny Our signs and wrong themselves.\n",
        "TRANSLATION_2": "Evil is the example of the people who reject Our signs as false and perpetrate wrong against their own selves.\n",
        "TRANSLATION_3": "How terrible is the example of those who have rejected Our revelations and have done injustice only to themselves!\n",
        "TRANSLATION_4": "What an evil example is of those who denied Our signs and used to wrong only their own souls.\n",
        "TRANSLATION_5": "Evil is the parable of the people who rejected Our Ayat, and used to wrong themselves.\n",
        "TRANSLATION_6": "Evil is the likeness of the people who reject Our communications and are unjust to their own souls.\n",
        "TRANSLATION_7": "An evil likeness is the likeness of the people who cried lies to Our signs, and themselves were wronging.\n",
        "TRANSLATION_8": "Evil as an example are the folk who denied Our revelations, and were wont to wrong themselves.\n",
        "TRANSLATION_9": "How evil is the case of those who deny Our signs. They only wrong themselves:\n",
        "TRANSLATION_10": "Vile is the likeness of the people who belie Our signs, and their own souls they are wont to wrong.\n",
        "TRANSLATION_11": "Evil is the parable of the people who deny Our signs and wrong themselves.\n",
        "TRANSLATION_12": "Evil as an example are people who reject Our signs and wrong their own souls.\n",
        "TRANSLATION_13": "Evil is the likeness of the people who reject Our Ayat (proofs, evidences, verses and signs, etc.), and used to wrong their ownselves.\n",
        "TRANSLATION_14": "Evil is the example of those who belied Our verses; they wronged themselves.\n",
        "TRANSLATION_15": "Evil is the metaphor of the people who reject Our signs and wrong themselves.\n",
        "TRANSLATION_16": "How evil an example [is that of] the people who denied Our signs and used to wrong themselves.\n",
        "TRANSLATION_17": "[7:177] Evil as an example are the people, evil is the example of the people, who denied Our signs, and were wont to wrong themselves, through denial.\n",
        "TRANSLATION_18": "(Evil as an example are the folk who denied Our revelations) Muhammad (pbuh) and the Qur'an, if their example is as that of a dog, (and were wont to wrong themselves) to harm themselves by being tortured.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:177",
            "6:98",
            "25:36",
            "14:45",
            "30:28",
            "62:5",
            "43:69",
            "21:77",
            "7:64",
            "7:9"
        ],
        "BIBLE": [
            "writings:psalms:144:15",
            "torah:numbers:14:11",
            "torah:leviticus:26:43",
            "torah:leviticus:18:29",
            "prophets:jeremiah:6:19",
            "writings:nehemiah:2:17",
            "prophets:jeremiah:4:22",
            "prophets:ezekiel:13:19",
            "torah:deuteronomy:19:4",
            "torah:exodus:4:30"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:2:2",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:2:3"
        ]
    }
}