{
    "VERSE": "7:178",
    "ARABIC": "مَن يَهْدِ ٱللَّهُ فَهُوَ ٱلْمُهْتَدِى وَمَن يُضْلِلْ فَأُو۟لَٰٓئِكَ هُمُ ٱلْخَٰسِرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Whoever Allah guides is truly guided; but those He misguides are the lost.",
        "TRANSLATION_1": "He alone is guided whom God shows the way; and whom He leads astray is surely lost.\n",
        "TRANSLATION_2": "He whom Allah guides, he alone is rightly guided; and he whom Allah lets go astray - it is they who are the loser.'\n",
        "TRANSLATION_3": "Those whom God has guided have the true guidance, but those whom He has caused to go astray are certainly lost.\n",
        "TRANSLATION_4": "Whomever Allah guides – only he is on the right path; and whomever He sends astray – it is they who are the losers.\n",
        "TRANSLATION_5": "Whomsoever Allah guides, he is the guided one, and whomsoever He sends astray, -- then those! They are the losers.\n",
        "TRANSLATION_6": "Whomsoever Allah guides, he is the one who follows the right way; and whomsoever He causes to err, these are the losers.\n",
        "TRANSLATION_7": "Whomsoever God guides, he is rightly guided; and whom He leads astray -- they are the losers.\n",
        "TRANSLATION_8": "He whom Allah leadeth, he indeed is led aright, while he whom Allah sendeth astray - they indeed are losers.\n",
        "TRANSLATION_9": "anyone whom God guides has been rightly guided; while those He lets go astray will surely be the losers.\n",
        "TRANSLATION_10": "Whomsoever Allah guideth, he is the rightly guided: and whomsoever He sendeth astray - those! they are the losers.\n",
        "TRANSLATION_11": "Whomever Allah guides is rightly guided, and whomever He leads astray—it is they who are the losers.\n",
        "TRANSLATION_12": "Whom Allah doth guide,- he is on the right path: whom He rejects from His guidance,- such are the persons who perish.\n",
        "TRANSLATION_13": "Whomsoever Allah guides, he is the guided one, and whomsoever He sends astray, those! They are the losers.\n",
        "TRANSLATION_14": "He whom Allah guides is one that is guided, but he whom Allah leaves in error shall surely be the lost.\n",
        "TRANSLATION_15": "Whomever God guides is the guided one. And whomever He sends astray—these are the losers.\n",
        "TRANSLATION_16": "Whoever Allah guides - he is the [rightly] guided; and whoever He sends astray - it is those who are the losers.\n",
        "TRANSLATION_17": "[7:178] He whom God guides, he is guided, and he whom He sends astray — truly they are the losers.\n",
        "TRANSLATION_18": "(He who Allah leadeth) guides to His religion, (he indeed is led aright) to His religion, (while he whom Allah sendeth astray) from His religion (they indeed are losers) because of being punished.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:178",
            "5:47",
            "24:52",
            "3:76",
            "3:141",
            "29:11",
            "4:80",
            "3:57",
            "2:15",
            "3:32"
        ],
        "BIBLE": [
            "writings:psalms:139:24",
            "prophets:ii%20kings:6:19",
            "prophets:jeremiah:2:17",
            "writings:psalms:27:11",
            "writings:ruth:1:16",
            "writings:proverbs:12:26",
            "prophets:joshua:14:9",
            "writings:proverbs:4:11",
            "writings:ruth:3:10",
            "prophets:ezekiel:14:22"
        ]
    }
}