{
    "VERSE": "7:18",
    "ARABIC": "قَالَ ٱخْرُجْ مِنْهَا مَذْءُومًا مَّدْحُورًا لَّمَن تَبِعَكَ مِنْهُمْ لَأَمْلَأَنَّ جَهَنَّمَ مِنكُمْ أَجْمَعِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "He said, 'Get out of it, reviled and driven out. As for those of them who follow you, I will fill up Hell with every one of you.'",
        "TRANSLATION_1": "Begone,\" said (God), \"contemptible and rejected! As for those who follow you, I shall fill up Hell with all of you.\n",
        "TRANSLATION_2": "Allah said: 'Go away from here - disgraced and expelled. I shall fill the Hell with all those that follow you.\n",
        "TRANSLATION_3": "The Lord told Satan, \"Get out of this garden, for you are banished and despised. Hell will be filled with all of those who follow you.\"\n",
        "TRANSLATION_4": "He said, “Exit from here, rejected, outcast; indeed whoever among them follows your bidding, I will fill hell with all of you.”\n",
        "TRANSLATION_5": "(Allah) said (to Iblis): \"Get out from this (Paradise), Madh'uman Madhura. Whoever of them (mankind) will follow you, then surely, I will fill Hell with you all.\"\n",
        "TRANSLATION_6": "He said: Get out of this (state), despised, driven away; whoever of them will follow you, I will certainly fill hell with you all.\n",
        "TRANSLATION_7": "Said He, 'Go thou forth from it, despised and banished. Those of them that follow thee -- I shall assuredly fill Gehenna with all of you.'\n",
        "TRANSLATION_8": "He said: Go forth from hence, degraded, banished. As for such of them as follow thee, surely I will fill hell with all of you.\n",
        "TRANSLATION_9": "He said, \"Get out of here, despised, and rejected! I shall fill Hell with all of those who follow you.\"\n",
        "TRANSLATION_10": "Allah said: go thou forth from hence, scorned, driven away. Whosoever of them followeth thee, I will of a surety fill Hell with you all.\n",
        "TRANSLATION_11": "Said He, ‘Begone hence, blameful and banished! Whoever of them follows you, I will surely fill hell with you all.’\n",
        "TRANSLATION_12": "(Allah) said: \"Get out from this, disgraced and expelled. If any of them follow thee,- Hell will I fill with you all.\n",
        "TRANSLATION_13": "(Allah) said (to Iblis) \"Get out from this (Paradise) disgraced and expelled. Whoever of them (mankind) will follow you, then surely I will fill Hell with you all.\"\n",
        "TRANSLATION_14": "Begone' said He, 'despised and outcast. (As for) those of them that follow you, I shall fill Gehenna (Hell) with all of you'\n",
        "TRANSLATION_15": "He said, “Get out of it, despised and vanquished. Whoever among them follows you—I will fill up Hell with you all.\n",
        "TRANSLATION_16": "[Allah] said, \"Get out of Paradise, reproached and expelled. Whoever follows you among them - I will surely fill Hell with you, all together.\"\n",
        "TRANSLATION_17": "[7:18] Said He, ‘Go forth from it, degraded (read madh’ūman) disgraced or despised, and banished, removed from mercy. As for those of them, of people, who follow you (la-man, ‘as for those who’: the lām is for inceptiveness; or it is for introducing the oath, which is [the following]) I shall assuredly fill Hell with all of you’, that is, with you, through your seed, and with people — herein [in this address] those present have predominance over those absent (this [last] sentence [of the verse] expresses the sense of ‘the requital’ [suggested] in the conditional man, ‘who’: in other words, ‘whoever follows you, then I shall punish him’).\n",
        "TRANSLATION_18": "(He said: Go forth from hence, degraded) rebuked, (banished) far from good. (As for such of them) from the jinn and humans (as follow thee) obey you, (surely I will fill hell with all of you) of the disbelievers among the jinn and humans.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:18",
            "38:85",
            "38:82",
            "15:92",
            "43:55",
            "15:43",
            "54:44",
            "11:119",
            "16:9",
            "2:38"
        ],
        "BIBLE": [
            "prophets:joshua:14:9",
            "prophets:jeremiah:49:5",
            "writings:ruth:1:16",
            "torah:exodus:6:1",
            "torah:genesis:24:5",
            "prophets:ii%20samuel:2:27",
            "prophets:jeremiah:3:19",
            "torah:deuteronomy:12:30",
            "torah:deuteronomy:16:20",
            "prophets:ezekiel:4:13"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:1:9"
        ]
    }
}