{
    "VERSE": "7:181",
    "ARABIC": "وَمِمَّنْ خَلَقْنَآ أُمَّةٌ يَهْدُونَ بِٱلْحَقِّ وَبِهِۦ يَعْدِلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Among those We have created there is a community who guide by the Truth and act justly according to it.",
        "TRANSLATION_1": "Yet there are among those We have created people who lead (others) to the truth, and act justly in its light\n",
        "TRANSLATION_2": "And of those whom We have created there is a party who guide men through the truth and act justly according to it.\n",
        "TRANSLATION_3": "Among Our creatures are a group who guide and judge with the Truth.\n",
        "TRANSLATION_4": "And from Our creation is a group that shows the truth and establishes justice with it.\n",
        "TRANSLATION_5": "And of those whom We have created, there is a community who guides (others) with the truth, and establishes justice therewith.\n",
        "TRANSLATION_6": "And of those whom We have created are a people who guide with the truth and thereby they do justice.\n",
        "TRANSLATION_7": "Of those We created are a nation who guide by the truth, and by it act with justice.\n",
        "TRANSLATION_8": "And of those whom We created there is a nation who guide with the Truth and establish justice therewith.\n",
        "TRANSLATION_9": "Of those We have created there are some who give true guidance and act justly.\n",
        "TRANSLATION_10": "And of those whom We have created there is a community guiding others with truth and acting justly according thereto.\n",
        "TRANSLATION_11": "Among those We have created are a nation who guide by the truth and do justice thereby.\n",
        "TRANSLATION_12": "Of those We have created are people who direct (others) with truth. And dispense justice therewith.\n",
        "TRANSLATION_13": "And of those whom We have created, there is a community who guides (others) with the truth, and establishes justice therewith.\n",
        "TRANSLATION_14": "Among those whom We created there is a nation who guide with the truth and with it they are just.\n",
        "TRANSLATION_15": "Among those We created is a community—they guide by truth, and do justice thereby.\n",
        "TRANSLATION_16": "And among those We created is a community which guides by truth and thereby establishes justice.\n",
        "TRANSLATION_17": "[7:181] And of those whom We created there is a community who guide by the truth, and act justly therewith: this is the community of Muhammad (s), as stated in a hadīth.\n",
        "TRANSLATION_18": "(And of those whom We created there is a nation) a group (who guide with the Truth) bid to the Truth (and establish justice therewith) and act upon the Truth. This group is the Community of Muhammad (pbuh).\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:181",
            "7:159",
            "7:118",
            "15:55",
            "21:55",
            "23:90",
            "37:37",
            "15:64",
            "38:84",
            "35:24"
        ],
        "BIBLE": [
            "prophets:isaiah:51:4",
            "prophets:i%20samuel:25:22",
            "writings:psalms:43:3",
            "torah:deuteronomy:32:8",
            "writings:job:37:21",
            "writings:proverbs:29:13",
            "writings:job:12:25",
            "writings:psalms:67:5",
            "writings:lamentations:3:2",
            "writings:psalms:96:10"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:3:5",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:3:3"
        ]
    }
}