{
    "VERSE": "7:182",
    "ARABIC": "وَٱلَّذِينَ كَذَّبُوا۟ بِـَٔايَٰتِنَا سَنَسْتَدْرِجُهُم مِّنْ حَيْثُ لَا يَعْلَمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "But as for those who deny Our Signs, We will lead them, step by step, into destruction from where they do not know.",
        "TRANSLATION_1": "We shall punish those who deny Our revelations slowly in a way that they will not know.\n",
        "TRANSLATION_2": "As for those who reject Our signs as false, We shall lead them, step by step, to their ruin without their even perceiving it.\n",
        "TRANSLATION_3": "We gradually lead those who have called Our revelations mere lies, to destruction. Their destruction will be such that they will not even notice how it seized them.\n",
        "TRANSLATION_4": "And those who denied Our signs – We shall soon steadily lead them towards the punishment, from the place they will not know.\n",
        "TRANSLATION_5": "Those who reject Our Ayat, We shall gradually seize them with punishment in ways they perceive not.\n",
        "TRANSLATION_6": "And (as to) those who reject Our communications, We draw them near (to destruction) by degrees from whence they know not.\n",
        "TRANSLATION_7": "And those who cry lies to Our signs We will draw them on little by little whence they know not;\n",
        "TRANSLATION_8": "And those who deny Our revelations - step by step We lead them on from whence they know not.\n",
        "TRANSLATION_9": "We shall gradually seize those who reject Our signs from a place they do not recognize.\n",
        "TRANSLATION_10": "And those who belie Our signs, step by step We lead them on in a way they know not.\n",
        "TRANSLATION_11": "As for those who deny Our signs, We will draw them imperceptibly [into ruin], whence they do not know.\n",
        "TRANSLATION_12": "Those who reject Our signs, We shall gradually visit with punishment, in ways they perceive not;\n",
        "TRANSLATION_13": "Those who reject Our Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.), We shall gradually seize them with punishment in ways they perceive not.\n",
        "TRANSLATION_14": "As for those who belie Our verses, We will draw them on little by little, from where they cannot tell;\n",
        "TRANSLATION_15": "As for those who reject Our messages, We will gradually lead them from where they do not know.\n",
        "TRANSLATION_16": "But those who deny Our signs - We will progressively lead them [to destruction] from where they do not know.\n",
        "TRANSLATION_17": "[7:182] And those who deny Our signs — the Qur’ān — from among the people of Mecca, We will draw them on by degrees, We will lead them on gradually, whence they do not know.\n",
        "TRANSLATION_18": "(And those who deny Our revelations) Muhammad (pbuh) and the Qur'an. These are Abu Jahl and his followers as well as all those who make a mockery of any punishment inflicted on them (step by step We lead them on) We will punish them (from whence they know not) that the punishment is being sent to them. And indeed Allah destroyed them in one day, each of which with a different type of destruction.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:182",
            "43:69",
            "42:35",
            "68:44",
            "78:28",
            "43:47",
            "7:72",
            "10:7",
            "5:10",
            "5:86"
        ],
        "BIBLE": [
            "prophets:i%20samuel:6:2",
            "torah:genesis:32:31",
            "torah:genesis:22:14",
            "torah:genesis:21:31",
            "writings:esther:4:11",
            "prophets:jeremiah:44:29",
            "prophets:isaiah:66:19",
            "torah:genesis:35:15",
            "prophets:jeremiah:7:14",
            "writings:job:8:18"
        ]
    }
}