{
    "VERSE": "7:184",
    "ARABIC": "أَوَلَمْ يَتَفَكَّرُوا۟ مَا بِصَاحِبِهِم مِّن جِنَّةٍ إِنْ هُوَ إِلَّا نَذِيرٌ مُّبِينٌ",
    "ENGLISH": {
        "TRANSLATION_0": "Have they not reflected? Their companion is not mad. He is only a clear warner.",
        "TRANSLATION_1": "Have they not bethought themselves their companion is not mad? He is only a plain admonisher.\n",
        "TRANSLATION_2": "Have they not pondered that their companion [i.e. the Prophet Muhammad] is not afflicted with insanity? He is only a plain warner.\n",
        "TRANSLATION_3": "Why will they not understand that their companion (Muhammad) is not possessed by jinn. (Muhammad) is only a (Divinely) authorized preacher.\n",
        "TRANSLATION_4": "Do they not ponder that their companion is far removed from insanity? In fact he is clearly a Herald of Warning.\n",
        "TRANSLATION_5": "Do they not reflect There is no madness in their companion. He is but a plain warner.\n",
        "TRANSLATION_6": "Do they not reflect that their companion has not unsoundness in mind; he is only a plain warner.\n",
        "TRANSLATION_7": "Have they not reflected? No madness is in their comrade; he is naught but a plain warner.\n",
        "TRANSLATION_8": "Have they not bethought them (that) there is no madness in their comrade? He is but a plain warner.\n",
        "TRANSLATION_9": "Have they not reflected that their companion is not mad? He is only a plain warner.\n",
        "TRANSLATION_10": "Reflect they not that in their companions there is no madness! he is naught but a manifest warner.\n",
        "TRANSLATION_11": "Have they not reflected that there is no madness in their companion, [and that] he is just a manifest warner?\n",
        "TRANSLATION_12": "Do they not reflect? Their companion is not seized with madness: he is but a perspicuous warner.\n",
        "TRANSLATION_13": "Do they not reflect? There is no madness in their companion (Muhammad SAW). He is but a plain warner.\n",
        "TRANSLATION_14": "Have they not reflected? There is no madness in their companion, he is but a plain warner.\n",
        "TRANSLATION_15": "Do they not think? There is no madness in their friend. He is but a plain warner.\n",
        "TRANSLATION_16": "Then do they not give thought? There is in their companion [Muhammad] no madness. He is not but a clear warner.\n",
        "TRANSLATION_17": "[7:184] Have they not considered, and so realised that, that there is no madness in their comrade, Muhammad (s)? He is but a clear warner, one whose warning is evident.\n",
        "TRANSLATION_18": "(Have they not bethought them) among themselves that Muhammad (pbuh) was not a sorcerer, soothsayer or a madman. Then Allah, Exalted is He, said: ((that) there is no madness) there is no touch of madness whatsoever (in their comrade) in their Prophet? (He is but a plain warner) and Messenger who explains to them in a language they understand.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:184",
            "26:115",
            "35:23",
            "38:70",
            "34:46",
            "25:56",
            "81:22",
            "17:105",
            "53:2",
            "46:14"
        ],
        "BIBLE": [
            "writings:ii%20chronicles:25:16",
            "prophets:malachi:2:10",
            "writings:psalms:88:19",
            "writings:i%20chronicles:28:9",
            "prophets:zechariah:10:2",
            "torah:deuteronomy:8:3",
            "writings:proverbs:19:25",
            "prophets:judges:15:2",
            "writings:ezra:9:11",
            "prophets:isaiah:40:21"
        ]
    }
}