{
    "VERSE": "7:186",
    "ARABIC": "مَن يُضْلِلِ ٱللَّهُ فَلَا هَادِىَ لَهُۥ وَيَذَرُهُمْ فِى طُغْيَٰنِهِمْ يَعْمَهُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "If Allah misguides people, no one can guide them. We will abandon them to wander blindly in their excessive insolence.",
        "TRANSLATION_1": "Whosoever God allows to go astray has none to show him the way, for He leaves them to wander perplexed in their wickedness.\n",
        "TRANSLATION_2": "For those whom Allah lets go astray, there is no guide; and He will leave them in their transgression to stumble blindly.\n",
        "TRANSLATION_3": "No one can guide those whom God has caused to go astray and has left to continue blindly in their rebellion.\n",
        "TRANSLATION_4": "For one whom Allah sends astray, there is none to guide him; and He leaves them to wander in their rebellion.\n",
        "TRANSLATION_5": "Whomsoever Allah sends astray, none can guide him; and He lets them wander blindly in their transgressions.\n",
        "TRANSLATION_6": "Whomsoever Allah causes to err, there is no guide for him; and He leaves them alone in their inordinacy, blindly wandering on.\n",
        "TRANSLATION_7": "Whomsoever God leads astray, no guide he has; He leaves them in their insolence blindly wandering.\n",
        "TRANSLATION_8": "Those whom Allah sendeth astray, there is no guide for them. He leaveth them to wander blindly on in their contumacy.\n",
        "TRANSLATION_9": "No one can guide those whom God lets go astray: He leaves them blundering about in their arrogance.\n",
        "TRANSLATION_10": "Whomsoever Allah sendeth astray, no guide is then for him, and He letteth them wander perplexed in their exorbitance.\n",
        "TRANSLATION_11": "Whomever Allah leads astray has no guide, and He leaves them bewildered in their rebellion.\n",
        "TRANSLATION_12": "To such as Allah rejects from His guidance, there can be no guide: He will leave them in their trespasses, wandering in distraction.\n",
        "TRANSLATION_13": "Whomsoever Allah sends astray, none can guide him; and He lets them wander blindly in their transgressions.\n",
        "TRANSLATION_14": "None can guide those whom Allah leaves in error. He leaves them in their insolence, wandering blindly.\n",
        "TRANSLATION_15": "Whomever God misguides has no guide. And He leaves them blundering in their transgression.\n",
        "TRANSLATION_16": "Whoever Allah sends astray - there is no guide for him. And He leaves them in their transgression, wandering blindly.\n",
        "TRANSLATION_17": "[7:186] Whomever God sends astray, he has no guide. And He leaves them (read in the imperfect indicative wayadharuhum or wa-nadharuhum, ‘and We leave them’, as the beginning of a new sentence; or [the same verbs] in the imperfect jussive [apocopated form] wa-yadharhum, or wa-nadharhum, as a supplement to what comes after fā’ [of fa-lā hādiya lahu, ‘so he has no guide’]) in their insolence to wander on blindly,   hesitating, out of perplexity.\n",
        "TRANSLATION_18": "(Those whom Allah sendeth astray) from His religion, (there is no guide for them) to His religion. (He leaveth them to wander blindly on in their contumacy) in their disbelief and error.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:186",
            "4:52",
            "8:33",
            "2:15",
            "3:57",
            "37:35",
            "4:143",
            "7:178",
            "16:37",
            "64:13"
        ],
        "BIBLE": [
            "writings:psalms:107:40",
            "prophets:ezekiel:18:30",
            "prophets:hosea:14:10",
            "writings:proverbs:12:26",
            "prophets:jeremiah:31:9",
            "prophets:ii%20samuel:7:29",
            "prophets:ezekiel:33:12",
            "prophets:isaiah:55:7",
            "writings:psalms:139:24",
            "prophets:ezekiel:14:22"
        ],
        "KABBALAH": [
            
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:6:2"
        ]
    }
}