{
    "VERSE": "7:187",
    "ARABIC": "يَسْـَٔلُونَكَ عَنِ ٱلسَّاعَةِ أَيَّانَ مُرْسَىٰهَا قُلْ إِنَّمَا عِلْمُهَا عِندَ رَبِّى لَا يُجَلِّيهَا لِوَقْتِهَآ إِلَّا هُوَ ثَقُلَتْ فِى ٱلسَّمَٰوَٰتِ وَٱلْأَرْضِ لَا تَأْتِيكُمْ إِلَّا بَغْتَةً يَسْـَٔلُونَكَ كَأَنَّكَ حَفِىٌّ عَنْهَا قُلْ إِنَّمَا عِلْمُهَا عِندَ ٱللَّهِ وَلَٰكِنَّ أَكْثَرَ ٱلنَّاسِ لَا يَعْلَمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "They will ask you about the Hour: when is it due? Say: 'Knowledge of it rests with my Lord alone. He alone will reveal it at its proper time. It hangs heavy in the heavens and the earth. It will not come upon you except suddenly.' They will ask you as if you had full knowledge of it. Say: 'Knowledge of it rests with Allah alone. But most people do not know that.'",
        "TRANSLATION_1": "They ask you about the Hour: \"When is its determined time?\" Say: \"Only my Lord has the knowledge. No one can reveal it except He. Oppressive will it be for the heavens and the earth. When it comes, it will come unawares.\" They ask you about it as if you were in the know. You tell them: \"Only God has the knowledge.\" But most people do not know.\n",
        "TRANSLATION_2": "They ask you concerning the Hour, when will its coming be? Say: 'The knowledge of it is with my Lord alone: none but He will disclose it at its time. That will weigh heavily on the heavens and the earth; and it shall not come to you other than all of a sudden.' They ask you - as if you are eagerly inquisitive about it - concerning it. Say to them: 'The knowledge of it is with none except Allah. But most people are unaware of this reality.'\n",
        "TRANSLATION_3": "They ask you (Muhammad), \"When will the Day of Judgment be?\" Tell them, \"My Lord knows best. It is He who has appointed its time. It will be a grave hour both in the heavens and the earth. It will only approach you suddenly.\" They say, \"It seems that you know about the coming of the Day of Judgment.\" Tell them, \"Only God knows about it and most people do not know.\"\n",
        "TRANSLATION_4": "They ask you about the Resurrection, as to when it is destined; say, “Indeed its knowledge is with my Lord; only He will manifest it at its time; it is proving cumbersome in the heavens and the earth; it will not come to you except suddenly”; they question you as if you have researched it deeply; say, “Indeed its knowledge is with Allah only but most people do not know.”\n",
        "TRANSLATION_5": "They ask you about the Hour (Day of Resurrection): \"When will be its appointed time\" Say: \"The knowledge thereof is with my Lord (Alone). None can reveal its time but He. Heavy is its burden through the heavens and the earth. It shall not come upon you except all of a sudden.\" They ask you as if you have a good knowledge of it. Say: \"The knowledge thereof is with Allah (Alone), but most of mankind know not.\"\n",
        "TRANSLATION_6": "They ask you about the hour, when will be its taking place? Say: The knowledge of it is only with my Lord; none but He shall manifest it at its time; it will be momentous in the heavens and the earth; it will not come on you but of a sudden. They ask you as if you were solicitous about it. Say: Its knowledge is only with Allah, but most people do not know.\n",
        "TRANSLATION_7": "They will question thee concerning the Hour, when it shall berth. Say: 'The knowledge of it is only with my Lord; none shall reveal it at its proper time, but He. Heavy is it in the heavens and the earth; it will not come on you but suddenly!' They will question thee, as though thou art well-informed of it. Say: 'The knowledge of it is only with God, but most men know not.'\n",
        "TRANSLATION_8": "They ask thee of the (destined) Hour, when will it come to port. Say: Knowledge thereof is with my Lord only. He alone will manifest it at its proper time. It is heavy in the heavens and the earth. It cometh not to you save unawares. They question thee as if thou couldst be well informed thereof. Say: Knowledge thereof is with Allah only, but most of mankind know not.\n",
        "TRANSLATION_9": "They ask you [Prophet] about the Last Hour, \"When will it come?\" Say, \"Knowledge about it rests only with my Lord; He alone will reveal when its time will come, it lies heavy on the heavens and the earth: it will suddenly overtake you.\" They will put questions to you as though you had full knowledge of it. Say, \"Knowledge about it rests only with God, though most people do not realize it.\"\n",
        "TRANSLATION_10": "They ask thee concerning the Hour, when will its coming be? Say thou: knowledge thereof is with my Lord only: none shall disclose it at its time buthe; heavy it is in the heavens and the earth; it shall not come upon you except on a sudden. They ask thee as though thou wert familiar therewith. Say thou: knowledge thereof is with Allah only; but most of men know not.\n",
        "TRANSLATION_11": "They question you concerning the Hour, when will it set in? Say, ‘Its knowledge is only with my Lord: none except Him shall manifest it at its time. It will weigh heavy on the heavens and the earth. It will not overtake you but suddenly.’ They ask you as if you were in the know of it. Say, ‘Its knowledge is only with Allah, but most people do not know.’\n",
        "TRANSLATION_12": "They ask thee about the (final) Hour - when will be its appointed time? Say: \"The knowledge thereof is with my Lord (alone): None but He can reveal as to when it will occur. Heavy were its burden through the heavens and the earth. Only, all of a sudden will it come to you.\" They ask thee as if thou Wert eager in search thereof: Say: \"The knowledge thereof is with Allah (alone), but most men know not.\"\n",
        "TRANSLATION_13": "They ask you about the Hour (Day of Resurrection): \"When will be its appointed time?\" Say: \"The knowledge thereof is with my Lord (Alone). None can reveal its time but He. Heavy is its burden through the heavens and the earth. It shall not come upon you except all of a sudden.\" They ask you as if you have a good knowledge of it. Say: \"The knowledge thereof is with Allah (Alone) but most of mankind know not.\"\n",
        "TRANSLATION_14": "They ask you about the Hour and when it is to come. Say: 'None knows except my Lord. He alone will reveal it at the appointed time. It is heavy in the heavens and earth. It will not come to you but suddenly' They will question you, as though you had full knowledge of it. Say: 'Its knowledge is with Allah, though most people are unaware'\n",
        "TRANSLATION_15": "They ask you about the Hour, “When will it come?” Say, “Knowledge of it rests with my Lord. None can reveal its coming except He. It weighs heavily on the heavens and the earth. It will not come upon you except suddenly.” They ask you as if you are responsible for it. Say, “Knowledge of it rests with God,” but most people do not know.\n",
        "TRANSLATION_16": "They ask you, [O Muhammad], about the Hour: when is its arrival? Say, \"Its knowledge is only with my Lord. None will reveal its time except Him. It lays heavily upon the heavens and the earth. It will not come upon you except unexpectedly.\" They ask you as if you are familiar with it. Say, \"Its knowledge is only with Allah, but most of the people do not know.\"\n",
        "TRANSLATION_17": "[7:187] They, that is the people of Mecca, will question you about the Hour, the Resurrection, when it shall come to pass. Say, to them: ‘The knowledge of, when, it, shall be, is only with my Lord. He alone shall reveal it, manifest it, at its proper time (li-waqtihā: the lām here functions as fī, ‘at’). It weighs heavily, tremendously, in the heavens and the earth, upon their inhabitants, because of its awesomeness. It will not come on you save all of a sudden’. They will question you, as if you were preoccupied with, obsessed with inquiring about, it, such that you have come to acquire knowledge of it. Say: ‘Knowledge of it is only with God (innamā ‘ilmuhā ‘inda’Llāhi is for emphasis), but most people do not know’, that knowledge of it lies with God, exalted be He.\n",
        "TRANSLATION_18": "(They) the people of Mecca (ask thee) Muhammad (of the (destined) Hour) about the timing and occurrence of the Last Hour, (when will it come to port. Say: Knowledge thereof) the knowledge of its timing and occurrence (is with my Lord only) is from my Lord. (He alone will manifest it at its proper time) none but He manifests its occurrence and timing. (It is heavy in the heavens and the earth) the knowledge of its occurrence and timing is heavy on the dwellers of the heavens and earth. (It cometh not to you save unawares) except all of a sudden. (They question thee) Muhammad about the Hour (as if thou couldst be well informed thereof) as if you have knowledge of its timing; it is also said that this means: as if you are ignorant of it; as it is said that this means: as if you are oblivious to it. (Say) Muhammad: (Knowledge thereof) knowledge of its occurrence and timing (is with Allah only) from Allah only, (but most of mankind) the people of Mecca (know not) nor believe in it.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:187",
            "33:63",
            "10:55",
            "30:8",
            "11:107",
            "45:36",
            "31:20",
            "6:119",
            "63:7",
            "27:65"
        ],
        "BIBLE": [
            "torah:numbers:10:29",
            "writings:daniel:6:13",
            "prophets:i%20kings:18:36",
            "writings:esther:4:11",
            "prophets:jeremiah:51:62",
            "torah:exodus:21:13",
            "prophets:ii%20kings:5:8",
            "torah:deuteronomy:1:31",
            "prophets:ezekiel:22:3",
            "prophets:i%20kings:21:19"
        ]
    }
}