{
    "VERSE": "7:189",
    "ARABIC": "هُوَ ٱلَّذِى خَلَقَكُم مِّن نَّفْسٍ وَٰحِدَةٍ وَجَعَلَ مِنْهَا زَوْجَهَا لِيَسْكُنَ إِلَيْهَا فَلَمَّا تَغَشَّىٰهَا حَمَلَتْ حَمْلًا خَفِيفًا فَمَرَّتْ بِهِۦ فَلَمَّآ أَثْقَلَت دَّعَوَا ٱللَّهَ رَبَّهُمَا لَئِنْ ءَاتَيْتَنَا صَٰلِحًا لَّنَكُونَنَّ مِنَ ٱلشَّٰكِرِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "It is He who created you from a single self and made from him his spouse so that he might find repose in her. Then when he covered her she bore a light load and carried it around. Then when it became heavy they called on Allah, their Lord, 'If You grant us a healthy child, we will be among the thankful!'",
        "TRANSLATION_1": "It is He who created you from a single cell, and from it created its mate, that you may live as companions. When the man covered the woman she conceived a light burden and carried it about. And when she was heavy (with child) they prayed together to their Lord: \"If You bestow a healthy son on us we shall truly be grateful.\"\n",
        "TRANSLATION_2": "It is He - Allah -Who created you from a single being, and out of it He made its mate, that he may find comfort in her. And when he covers her, she bears a light burden and goes about with it. Then, when she grows heavy, they pray to their Lord: 'If You bestow upon us a healthy child, we will surely give thanks.'\n",
        "TRANSLATION_3": "It is God Who created you from a single soul and out of it made its spouse to bring it comfort. When he (man) engaged in carnal relations with her, she conceived a light burden which she had to carry. When the baby grew in her womb, they (husband and wife) both prayed to their Lord, \"If You grant us a healthy son we shall certainly give you thanks.\"\n",
        "TRANSLATION_4": "It is He Who created you from a single soul, and from him made its mate for him to gain comfort with her; so when the male covered her, she was burdened lightly in her womb, and she therefore moved easily carrying it; and when she felt the burden heavy, they both cried to their Lord Allah, “Indeed You may give to us a child as You will, so we will surely be thankful.”\n",
        "TRANSLATION_5": "It is He Who has created you from a single person, and (then) He has created from him his wife, in order that he might enjoy the pleasure of living with her. When he covered [had sexual relation with] her, she became pregnant and she carried it about (lightly). Then when it became heavy, they both invoked Allah, their Lord (saying): \"If You give us a Salih (good in every aspect) child, we shall indeed be among the grateful.\"\n",
        "TRANSLATION_6": "He it is Who created you from a single being, and of the same (kind) did He make his mate, that he might incline to her; so when he covers her she bears a light burden, then moves about with it; but when it grows heavy, they both call upon Allah, their Lord: If Thou givest us a good one, we shall certainly be of the grateful ones.\n",
        "TRANSLATION_7": "It is He who created you out of one living soul, and made of him his spouse that he might rest in her. Then, when he covered her, she bore a light burden and passed by with it; but when it became heavy they cried to God their Lord, 'If Thou givest us a righteous son, we indeed shall be of the thankful.'\n",
        "TRANSLATION_8": "He it is Who did create you from a single soul, and therefrom did make his mate that he might take rest in her. And when he covered her she bore a light burden, and she passed (unnoticed) with it, but when it became heavy they cried unto Allah, their Lord, saying: If thou givest unto us aright we shall be of the thankful.\n",
        "TRANSLATION_9": "It was He who created you from a single soul, and from it made its mate so that he may find comfort in her. Once he has covered her, she conceives and goes about with a light burden. When it grows  heavy, they both call to God, their Lord, \"If You bestow on us a healthy child, we will surely be grateful,\"\n",
        "TRANSLATION_10": "He it is who created you from a single soul, and He created therefrom his spouse that he might find repose in her. Then when he covereth her she beareth a light burthen and fareth about there with; then when she groweth heavy the twain call upon Allah their Lord: if Thou vouchsafest us a goodly Child, we shall surely be of the thankful.\n",
        "TRANSLATION_11": "It is He who created you from a single soul, and made from it its mate, that he might find comfort with her. So when he had covered her, she bore a light burden and passed [some time] with it. When she had grown heavy, they both invoked Allah, their Lord: ‘If You give us a healthy [child], we will be surely grateful.’\n",
        "TRANSLATION_12": "It is He Who created you from a single person, and made his mate of like nature, in order that he might dwell with her (in love). When they are united, she bears a light burden and carries it about (unnoticed). When she grows heavy, they both pray to Allah their Lord, (saying): \"If Thou givest us a goodly child, we vow we shall (ever) be grateful.\"\n",
        "TRANSLATION_13": "It is He Who has created you from a single person (Adam), and (then) He has created from him his wife [Hawwa (Eve)], in order that he might enjoy the pleasure of living with her. When he had sexual relation with her, she became pregnant and she carried it about lightly. Then when it became heavy, they both invoked Allah, their Lord (saying): \"If You give us a Salih (good in every aspect) child, we shall indeed be among the grateful.\"\n",
        "TRANSLATION_14": "It is He who created you from a soul. From it He created its mate, so that he might reside with her. And when he had covered her, she conceived, and for a time her burden was light. She carried it with ease, but when it grew heavy, they both supplicated to Allah, their Lord: 'Grant us a goodly child and we will be among the thankful'\n",
        "TRANSLATION_15": "It is He who created you from a single person, and made from it its mate, that he may find comfort with her. Then, when he has covered her, she conceives a light load, and she carries it around. But when she has grown heavy, they pray to God their Lord, “if You give us a good child, we will be among the thankful.”\n",
        "TRANSLATION_16": "It is He who created you from one soul and created from it its mate that he might dwell in security with her. And when he covers her, she carries a light burden and continues therein. And when it becomes heavy, they both invoke Allah, their Lord, \"If You should give us a good [child], we will surely be among the grateful.\"\n",
        "TRANSLATION_17": "[7:189] He, that is, God, it is Who created you from a single soul, namely, Adam, and made, created, from him his spouse, Eve, that he might take rest in her, and become intimate with her. Then, when he covered her, when he had sexual intercourse with her, she bore a light burden, namely, the sperm-drop, and moved to and fro with it, that is, she came and went [easily] on account of its lightness; but when she became heavy, because of the child growing inside her, and they became anxious that it should be a dumb child, they cried to God their Lord, ‘If You give us one, a child, that is sound, unimpaired, we indeed shall be of the thankful’, to You for it.\n",
        "TRANSLATION_18": "(He it is who did create you from a single soul) the soul of Adam alone, (and therefrom did make his mate) and from the soul of Adam he created his wife Eve (that he might take rest in her) with her. (And when he covered her) and when he made love to her (she bore a light burden, and she passed (unnoticed) with it) she stood up and sat down because of pain, (but when it became heavy) when the child became heavy in her womb, they thought, because of Satan's whispering, that it was a beast (they cried unto Allah, their Lord, saying: If thou givest unto us aright) if you give us a sound human being (we shall be of the thankful) for it.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:189",
            "4:1",
            "24:6",
            "7:23",
            "4:64",
            "40:10",
            "35:18",
            "4:16",
            "2:234",
            "11:101"
        ],
        "BIBLE": [
            "torah:numbers:17:11",
            "prophets:ii%20kings:10:5",
            "prophets:ezekiel:16:8",
            "torah:genesis:2:18",
            "prophets:i%20kings:8:47",
            "writings:ii%20chronicles:10:10",
            "writings:ii%20chronicles:6:37",
            "prophets:i%20kings:12:10",
            "prophets:ii%20kings:7:2",
            "prophets:i%20kings:2:42"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:1:8"
        ]
    }
}