{
    "VERSE": "7:19",
    "ARABIC": "وَيَٰٓـَٔادَمُ ٱسْكُنْ أَنتَ وَزَوْجُكَ ٱلْجَنَّةَ فَكُلَا مِنْ حَيْثُ شِئْتُمَا وَلَا تَقْرَبَا هَٰذِهِ ٱلشَّجَرَةَ فَتَكُونَا مِنَ ٱلظَّٰلِمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "'Adam, live in the Garden, you and your wife, and eat of it wherever you like. But do not go near this tree lest you become wrongdoers.'",
        "TRANSLATION_1": "And you, O Adam, and your spouse, live in the Garden and eat your fill wheresoever you like, but do not approach this tree, or you will become iniquitous.\"\n",
        "TRANSLATION_2": "O Adam! Live you and your spouse in the Garden and both of you eat from it wherever you will, but never approach the tree or you shall become wrongdoers.'\n",
        "TRANSLATION_3": "Then the Lord said, \"Adam, stay in the garden with your spouse and eat whatever you want therein, but do not go near this tree lest you transgress\".\n",
        "TRANSLATION_4": "And said, “O Adam! You and your wife dwell in Paradise – therefore eat from it from wherever you wish, and do not approach this tree for you will become of those who transgress.”\n",
        "TRANSLATION_5": "And O Adam! Dwell you and your wife in Paradise, and eat thereof as you both wish, but approach not this tree otherwise you both will be of the wrongdoers.\n",
        "TRANSLATION_6": "And (We said): O Adam! Dwell you and your wife in the garden; so eat from where you desire, but do not go near this tree, for then you will be of the unjust.\n",
        "TRANSLATION_7": "O Adam, inherit, thou and thy wife, the Garden, and eat of where you will, but come not nigh this tree, lest you be of the evildoers.'\n",
        "TRANSLATION_8": "And (unto man): O Adam! Dwell thou and thy wife in the Garden and eat from whence ye will, but come not nigh this tree lest ye become wrong-doers.\n",
        "TRANSLATION_9": "To Adam He said, \"You and your wife, dwell in the Garden and eat and drink there from wherever you wish, but do not approach this tree, lest you become wrongdoers.\"\n",
        "TRANSLATION_10": "And: O Adam: dwell thou and thy spouse in the Garden and eat ye twain thereof Whence ye will, and approach not yonder tree lest ye twain become of the wrong-doers.\n",
        "TRANSLATION_11": "[Then He said to Adam,] ‘O Adam, dwell with your mate in paradise, and eat thereof whence you wish; but do not approach this tree, lest you should be among the wrongdoers.’\n",
        "TRANSLATION_12": "O Adam! dwell thou and thy wife in the Garden, and enjoy (its good things) as ye wish: but approach not this tree, or ye run into harm and transgression.\"\n",
        "TRANSLATION_13": "And O Adam! Dwell you and your wife in Paradise, and eat thereof as you both wish, but approach not this tree otherwise you both will be of the Zalimun (unjust and wrong-doers).\"\n",
        "TRANSLATION_14": "O Adam dwell with your wife in Paradise, and eat from whatever you please; but never approach this tree or you shall both become harmdoers'\n",
        "TRANSLATION_15": "And you, Adam, inhabit the Garden, you and your wife, and eat whatever you wish; but do not approach this tree, lest you become sinners.”\n",
        "TRANSLATION_16": "And \"O Adam, dwell, you and your wife, in Paradise and eat from wherever you will but do not approach this tree, lest you be among the wrongdoers.\"\n",
        "TRANSLATION_17": "[7:19] And, He said, ‘O Adam, dwell, you (anta: this is reiterated in order to emphasise the subject of the verb uskun, ‘dwell’, and to supplement to it [what follows]) and your wife, Eve (read Hawwā’), in the Garden, and eat from whence you will, but do not come near this tree, to eat of it — and this was wheat — lest you become evildoers’.\n",
        "TRANSLATION_18": "(And (unto man): Adam! Dwell thou and thy wife) Eve (in the Garden and eat from whence) in Paradise (ye will) and whenever you will, (but come not nigh this tree) do not eat from this tree: the tree of knowledge (lest ye become wrong-doers) lest you become of those who harm themselves.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:19",
            "2:35",
            "20:117",
            "43:70",
            "26:90",
            "15:88",
            "75:39",
            "59:20",
            "47:6",
            "39:74"
        ],
        "BIBLE": [
            "prophets:ii%20samuel:23:17",
            "prophets:judges:13:8",
            "prophets:ii%20samuel:11:11",
            "prophets:ezekiel:37:9",
            "torah:genesis:3:22",
            "prophets:i%20kings:17:18",
            "torah:genesis:2:16",
            "writings:i%20chronicles:17:17",
            "prophets:jeremiah:16:19",
            "writings:i%20chronicles:11:19"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:3:5",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:2:5"
        ]
    }
}