{
    "VERSE": "7:191",
    "ARABIC": "أَيُشْرِكُونَ مَا لَا يَخْلُقُ شَيْـًٔا وَهُمْ يُخْلَقُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Do they make things into partner-gods which cannot create anything and are themselves created;",
        "TRANSLATION_1": "Do they associate those with Him who cannot create a thing, and are themselves created,\n",
        "TRANSLATION_2": "Do they associate (with Allah in His divinity) those who can create nothing; rather, they are themselves created?\n",
        "TRANSLATION_3": "Do they (the pagans) consider things that do not create anything but are themselves created equal to God?\n",
        "TRANSLATION_4": "Do they (the disbelievers) ascribe (false deities) that which do not create anything, but are themselves created?\n",
        "TRANSLATION_5": "Do they attribute as partners to Allah those who created nothing but they themselves are created\n",
        "TRANSLATION_6": "What! they associate (with Him) that which does not create any thing, while they are themselves created!\n",
        "TRANSLATION_7": "What, do they associate that which creates nothing and themselves are created,\n",
        "TRANSLATION_8": "Attribute they as partners to Allah those who created naught, but are themselves created,\n",
        "TRANSLATION_9": "Do they associate with Him those who create nothing and are themselves created?\n",
        "TRANSLATION_10": "Associate they those who cannot create aught and are created?\n",
        "TRANSLATION_11": "Do they ascribe [to Him] partners that create nothing and have been created themselves,\n",
        "TRANSLATION_12": "Do they indeed ascribe to Him as partners things that can create nothing, but are themselves created?\n",
        "TRANSLATION_13": "Do they attribute as partners to Allah those who created nothing but they themselves are created?\n",
        "TRANSLATION_14": "Will they associate that which cannot create a thing while they are created?\n",
        "TRANSLATION_15": "Do they idolize those who create nothing, and are themselves created?\n",
        "TRANSLATION_16": "Do they associate with Him those who create nothing and they are [themselves] created?\n",
        "TRANSLATION_17": "[7:191] Do they associate, with Him, in worship, those who cannot create anything, but are themselves created,\n",
        "TRANSLATION_18": "(Attribute they as partners to Allah those who created naught) or give life, (but are themselves) i.e. these gods (created) carved; created in that they are carved,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:191",
            "80:18",
            "26:30",
            "21:66",
            "19:42",
            "19:67",
            "6:69",
            "19:60",
            "44:41",
            "2:170"
        ],
        "BIBLE": [
            "prophets:isaiah:43:18",
            "prophets:jeremiah:2:10",
            "prophets:isaiah:40:17",
            "writings:nehemiah:13:26",
            "torah:deuteronomy:1:32",
            "writings:job:13:20",
            "prophets:jeremiah:14:22",
            "prophets:i%20samuel:12:24",
            "writings:psalms:119:128",
            "writings:job:23:14"
        ]
    }
}