{
    "VERSE": "7:192",
    "ARABIC": "وَلَا يَسْتَطِيعُونَ لَهُمْ نَصْرًا وَلَآ أَنفُسَهُمْ يَنصُرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "which are not capable of helping them and cannot even help themselves?",
        "TRANSLATION_1": "Who can neither help them, nor help themselves?\n",
        "TRANSLATION_2": "They have no power to help others. nor can they help themselves.\n",
        "TRANSLATION_3": "The idols are things that are not able to help others or even themselves.\n",
        "TRANSLATION_4": "And cannot provide any help to them, nor do they help themselves?\n",
        "TRANSLATION_5": "No help can they give them, nor can they help themselves.\n",
        "TRANSLATION_6": "And they have no power to give them help, nor can they help themselves.\n",
        "TRANSLATION_7": "and that have no power to help them, neither they help themselves?\n",
        "TRANSLATION_8": "And cannot give them help, nor can they help themselves?\n",
        "TRANSLATION_9": "They can give them no help, nor can they help themselves.\n",
        "TRANSLATION_10": "And who cannot succour them, nor can succour themselves.\n",
        "TRANSLATION_11": "and can neither help them, nor help themselves?\n",
        "TRANSLATION_12": "No aid can they give them, nor can they aid themselves!\n",
        "TRANSLATION_13": "No help can they give them, nor can they help themselves.\n",
        "TRANSLATION_14": "They cannot help them, nor can they help themselves.\n",
        "TRANSLATION_15": "And can neither help them, nor help their own selves?\n",
        "TRANSLATION_16": "And the false deities are unable to [give] them help, nor can they help themselves.\n",
        "TRANSLATION_17": "[7:192] and who are not able to give them, that is, those who worship them, any help, nor can they help themselves?, by defending themselves against someone intending to damage them, by breaking them or otherwise (the interrogative is meant as a rebuke).\n",
        "TRANSLATION_18": "180 (And cannot give them help) victory or prevent them from defeat, (nor can they) these gods (help themselves) stop what is wanted with them?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:192",
            "7:197",
            "21:43",
            "36:75",
            "20:41",
            "51:21",
            "21:102",
            "11:21",
            "91:7",
            "30:44"
        ],
        "BIBLE": [
            "prophets:jeremiah:14:22",
            "writings:job:30:24",
            "prophets:ezekiel:20:7",
            "torah:leviticus:18:24",
            "prophets:zechariah:8:17",
            "torah:deuteronomy:25:16",
            "writings:job:13:20",
            "prophets:ii%20kings:17:12",
            "writings:ii%20chronicles:25:8",
            "writings:job:16:2"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:2",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:2",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:3"
        ]
    }
}