{
    "VERSE": "7:193",
    "ARABIC": "وَإِن تَدْعُوهُمْ إِلَى ٱلْهُدَىٰ لَا يَتَّبِعُوكُمْ سَوَآءٌ عَلَيْكُمْ أَدَعَوْتُمُوهُمْ أَمْ أَنتُمْ صَٰمِتُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "If you call them to guidance they will not follow you. It makes no difference if you call them or stay silent.",
        "TRANSLATION_1": "If you call them to guidance they will not follow you. It is all the same if you call them or hold your tongue.\n",
        "TRANSLATION_2": "And if you call them to true guidance, they will not follow you. It is all the same for you whether you call them to true guidance or keep silent.\n",
        "TRANSLATION_3": "Believers, even if you invite them to true guidance, they will not follow you. It makes no difference whether you invite them or whether you keep quiet.\n",
        "TRANSLATION_4": "And if you call the disbelievers to guidance, they do not follow you; it is the same for you, whether you invite them or remain silent.\n",
        "TRANSLATION_5": "And if you call them to guidance, they follow you not. It is the same for you whether you call them or you keep silent.\n",
        "TRANSLATION_6": "And if you invite them to guidance, they will not follow you; it is the same to you whether you invite them or you are silent.\n",
        "TRANSLATION_7": "If you call them to guidance they will not follow you; equal it is to you whether you call them, or whether you are silent.\n",
        "TRANSLATION_8": "And if ye call them to the Guidance, they follow you not. Whether ye call them or are silent is all one for you.\n",
        "TRANSLATION_9": "It makes no difference whether you call on them or remain silent. If you call them to the right path, they will not follow you.\n",
        "TRANSLATION_10": "And if ye call them toward guidance they follow you not: it is the same to you whether ye call them or are silent.\n",
        "TRANSLATION_11": "If you call them to guidance, they will not follow you: it is the same to you whether you call them or whether you are silent.\n",
        "TRANSLATION_12": "If ye call them to guidance, they will not obey: For you it is the same whether ye call them or ye hold your peace!\n",
        "TRANSLATION_13": "And if you call them to guidance, they follow you not. It is the same for you whether you call them or you keep silent.\n",
        "TRANSLATION_14": "If you call them to guidance, they will not follow you. It is the same whether you call them or you are silent.\n",
        "TRANSLATION_15": "And if you invite them to guidance, they will not follow you. It is the same for you, whether you invite them, or remain silent.\n",
        "TRANSLATION_16": "And if you [believers] invite them to guidance, they will not follow you. It is all the same for you whether you invite them or you are silent.\n",
        "TRANSLATION_17": "[7:193] And if you call them, that is, the idols, to guidance, they will not follow you (read yatba‘ūkum or yattabi‘ūkum). It will be the same [response] for you, whether you call them, to it, or whether you are silent, [refraining] from calling them, they will not follow it, because they cannot hear.\n",
        "TRANSLATION_18": "(And if ye call them) Muhammad, i.e. the disbelievers (to the Guidance) to Allah's divine Oneness, (they follow you not) they will not answer you. (Whether you call them) to Allah's divine Oneness (or are silent is all one to them) the disbelievers will not follow you regarding Allah's divine Oneness; it is also said: group of disbelievers, if you call the idols to the Truth, they will not answer: it is the same whether you call them or not, because they are not living but dead.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:193",
            "7:198",
            "26:136",
            "36:10",
            "2:6",
            "96:11",
            "63:6",
            "21:109",
            "8:58",
            "16:37"
        ],
        "BIBLE": [
            "writings:job:11:3",
            "prophets:jeremiah:20:9",
            "torah:leviticus:25:46",
            "writings:psalms:12:5",
            "torah:genesis:21:18",
            "torah:leviticus:20:25",
            "torah:exodus:14:14",
            "torah:deuteronomy:20:12",
            "writings:job:13:19",
            "prophets:zephaniah:3:13"
        ]
    }
}