{
    "VERSE": "7:194",
    "ARABIC": "إِنَّ ٱلَّذِينَ تَدْعُونَ مِن دُونِ ٱللَّهِ عِبَادٌ أَمْثَالُكُمْ فَٱدْعُوهُمْ فَلْيَسْتَجِيبُوا۟ لَكُمْ إِن كُنتُمْ صَٰدِقِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Those you call on besides Allah are slaves just like yourselves. Call on them and let them respond to you if you are telling the truth.",
        "TRANSLATION_1": "Those whom you invoke besides God are created beings like you. So call on them and let them answer your call, if what you say is true.\n",
        "TRANSLATION_2": "Those whom you invoke other than Allah are creatures like you. So invoke them. and see if they answer your call, if what you claim is true.\n",
        "TRANSLATION_3": "Those whom you (pagans) worship besides God, are themselves servants just like yourselves. If your claim was true, they should answer your prayers.\n",
        "TRANSLATION_4": "Indeed those whom you (the disbelievers) worship besides Allah are slaves like you – so call them and they may answer you, if you are truthful!\n",
        "TRANSLATION_5": "Verily, those whom you call upon besides Allah are servants like you. So call upon them and let them answer you if you are truthful.\n",
        "TRANSLATION_6": "Surely those whom you call on besides Allah are in a state of subjugation like yourselves; therefore call on them, then let them answer you if you are truthful.\n",
        "TRANSLATION_7": "Those on whom you call apart from God, are servants the likes of you; call them and let them answer you, if you speak truly.\n",
        "TRANSLATION_8": "Lo! those on whom ye call beside Allah are slaves like unto you. Call on them now, and let them answer you, if ye are truthful!\n",
        "TRANSLATION_9": "Those whom you call on besides God are but creatures like yourselves. Call upon them, then, and let them respond to you, if what you say is true.\n",
        "TRANSLATION_10": "Verily those whom ye call upon beside Allah are creatures like unto you; so call on them, and let them answer you if ye say sooth.\n",
        "TRANSLATION_11": "Indeed those whom you invoke besides Allah are creatures like you. So invoke them: they should answer you, if you are truthful.\n",
        "TRANSLATION_12": "Verily those whom ye call upon besides Allah are servants like unto you: Call upon them, and let them listen to your prayer, if ye are (indeed) truthful!\n",
        "TRANSLATION_13": "Verily, those whom you call upon besides Allah are slaves like you. So call upon them and let them answer you if you are truthful.\n",
        "TRANSLATION_14": "Those whom you invoke, other than Allah, are worshipers like yourselves. Call them, and let them answer you, if what you say is true!\n",
        "TRANSLATION_15": "Those you call upon besides God are servants like you. So call upon them, and let them answer you, if you are truthful.\n",
        "TRANSLATION_16": "Indeed, those you [polytheists] call upon besides Allah are servants like you. So call upon them and let them respond to you, if you should be truthful.\n",
        "TRANSLATION_17": "[7:194] Truly those on whom you call, [whom] you worship, besides God are servants, owned, like you; call them then and let them answer you, your call, if you are truthful, in [claiming] that they are gods: God then illustrates their utter incapacity and the superiority which their worshippers possess over them, saying:\n",
        "TRANSLATION_18": "(Lo! those on whom ye call) worship (beside Allah) of idols (are slaves like unto you) are created like you. (Call on them) i.e. the idols (now, and let them answer you) let them hear your call and answer, (if ye are truthful!) that they can benefit you.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:194",
            "39:36",
            "10:38",
            "22:73",
            "11:13",
            "53:58",
            "2:23",
            "10:106",
            "21:98",
            "26:93"
        ],
        "BIBLE": [
            "torah:genesis:49:1",
            "prophets:i%20samuel:3:9",
            "prophets:jeremiah:7:13",
            "prophets:i%20samuel:3:10",
            "prophets:jeremiah:35:17",
            "prophets:i%20samuel:3:16",
            "prophets:i%20kings:18:24",
            "prophets:judges:16:28",
            "prophets:i%20samuel:28:15",
            "prophets:ii%20samuel:14:18"
        ]
    }
}