{
    "VERSE": "7:195",
    "ARABIC": "أَلَهُمْ أَرْجُلٌ يَمْشُونَ بِهَآ أَمْ لَهُمْ أَيْدٍ يَبْطِشُونَ بِهَآ أَمْ لَهُمْ أَعْيُنٌ يُبْصِرُونَ بِهَآ أَمْ لَهُمْ ءَاذَانٌ يَسْمَعُونَ بِهَا قُلِ ٱدْعُوا۟ شُرَكَآءَكُمْ ثُمَّ كِيدُونِ فَلَا تُنظِرُونِ",
    "ENGLISH": {
        "TRANSLATION_0": "Do they have legs they can walk with? Do they have hands they can grasp with? Do they have eyes they can see with? Do they have ears they can hear with? Say: 'Call on your partner-gods and try all your wiles against me and grant me no reprieve.",
        "TRANSLATION_1": "Do they have feet to walk on, or hands to hold with, or eyes to see and ears to hear with? Say to them: \"Call your compeers, and work out a plot against me, and do not give me time.\n",
        "TRANSLATION_2": "Have they feet on which they can walk? Have they hands with which they can grasp? Have they eyes with which they can see? Have they ears with which they can hear? Say [O Muhammad]: 'Invoke all those to whom you ascribe a share in Allah's divinity, then scheme against me and grant me no respite.\n",
        "TRANSLATION_3": "Do they (the idols) have feet to walk, hands to hold things, eyes to see, and ears to hear? (Muhammad), tell them (the pagans) to call on their idols for help and to plan against Me without delay.\n",
        "TRANSLATION_4": "Do they have feet to walk with? Or have they hands to hold with? Or have they eyes to see with? Or have they ears to hear with? Say, “Call upon your ascribed partners and conspire against me, and do not give me respite.”\n",
        "TRANSLATION_5": "Have they feet wherewith they walk Or have they hands wherewith they hold Or have they eyes wherewith they see Or have they ears wherewith they hear Say: \"Call your (so-called) partners (of Allah) and then plot against me, and give me no respite!\n",
        "TRANSLATION_6": "Have they feet with which they walk, or have they hands with which they hold, or have they eyes with which they see, or have they ears with which they hear? Say: Call your associates, then make a struggle (to prevail) against me and give me no respite.\n",
        "TRANSLATION_7": "What, have they feet wherewith they walk, or have they hands wherewith they lay hold, or have they eyes wherewith they see, or have they ears wherewith they give ear? Say: 'Call you then to your associates; then try your guile on me, and give me no respite.\n",
        "TRANSLATION_8": "Have they feet wherewith they walk, or have they hands wherewith they hold, or have they eyes wherewith they see, or have they ears wherewith they hear? Say: Call upon your (so-called) partners (of Allah), and then contrive against me, spare me not!\n",
        "TRANSLATION_9": "Have they feet to walk with? Have they hands to hold with? Have they eyes to see with? Have they ears to hear with? Say, \"Call upon those you associate with God as partners, then all of you contrive against me and give me no respite.\n",
        "TRANSLATION_10": "Have they feet wherewith they wend? Have they hands wherewith they grip? Have they eyes wherewith they see? Have they ears wherewith they hearken? Say thou: call upon your associate gods, and then plot against me and respite me not.\n",
        "TRANSLATION_11": "Do they have any feet to walk with? Do they have any hands to grasp with? Do they have any eyes to see with? Do they have any ears to hear with? Say, ‘Invoke your partners [that you ascribe to Allah] and try out your stratagems against me without granting me any respite.\n",
        "TRANSLATION_12": "Have they feet to walk with? Or hands to lay hold with? Or eyes to see with? Or ears to hear with? Say: \"Call your 'god-partners', scheme (your worst) against me, and give me no respite!\n",
        "TRANSLATION_13": "Have they feet wherewith they walk? Or have they hands wherewith they hold? Or have they eyes wherewith they see? Or have they ears wherewith they hear? Say (O Muhammad SAW): \"Call your (so-called) partners (of Allah) and then plot against me, and give me no respite!\n",
        "TRANSLATION_14": "Have they feet to walk with? Have they hands to punish with? Have they eyes to see with? Have they ears to hear with? Say: 'Call on your partners and then try to scheme against me. Give me no respite.\n",
        "TRANSLATION_15": "Do they have feet with which they walk? Or do they have hands with which they strike? Or do they have eyes with which they see? Or do they have ears with which they hear? Say, “Call upon your partners, then plot against me, and do not wait.”\n",
        "TRANSLATION_16": "Do they have feet by which they walk? Or do they have hands by which they strike? Or do they have eyes by which they see? Or do they have ears by which they hear? Say, [O Muhammad], \"Call your 'partners' and then conspire against me and give me no respite.\n",
        "TRANSLATION_17": "[7:195] Have they feet wherewith they walk or, indeed, have they hands (aydin is the plural of yad) wherewith they can grasp or, indeed, have they eyes wherewith they can see or, indeed, have they ears wherewith they give ear? (an interrogative of rejection), in other words, they have none of these things, which you have, so why do you worship them when you are more complete in being than they are? Say, to them, O Muhammad (s): ‘Call upon your associates, to destroy me; then scheme against me, and waste no time, [do not] give me any respite, for I am not concerned with you.\n",
        "TRANSLATION_18": "(Have they feet wherewith they walk) to goodness, (or have they hands wherewith they hold) with which they can give and take, (or have they eyes wherewith they see) your worship, (or have they ears wherewith they hear) your call? (Say) Muhammad to the idolaters of Mecca: (Call upon your (so- called) partners (of Allah)) seek the help of your gods, (and then contrive against me) scheme you all together to destroy me, (spare me not!) do not give me any respite.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:195",
            "68:41",
            "6:22",
            "90:8",
            "24:24",
            "7:124",
            "26:57",
            "12:60",
            "6:163",
            "10:28"
        ],
        "BIBLE": [
            "prophets:ii%20kings:7:2",
            "writings:job:17:3",
            "prophets:judges:15:18",
            "prophets:isaiah:50:2",
            "prophets:judges:18:10",
            "torah:genesis:21:18",
            "prophets:isaiah:1:15",
            "prophets:hosea:2:14",
            "torah:deuteronomy:32:35",
            "torah:leviticus:20:25"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:8"
        ]
    }
}