{
    "VERSE": "7:197",
    "ARABIC": "وَٱلَّذِينَ تَدْعُونَ مِن دُونِهِۦ لَا يَسْتَطِيعُونَ نَصْرَكُمْ وَلَآ أَنفُسَهُمْ يَنصُرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Those you call on besides Him are not capable of helping you. They cannot even help themselves.",
        "TRANSLATION_1": "While those you beseech apart from Him cannot help you or even help themselves.\n",
        "TRANSLATION_2": "And those whom you invoke other than Allah, they can neither help themselves nor you.\n",
        "TRANSLATION_3": "The idols which you (the pagans) worship besides God can neither help you nor themselves.\n",
        "TRANSLATION_4": "“And those whom you worship besides Him cannot help you nor do they help themselves.”\n",
        "TRANSLATION_5": "And those whom you call upon besides Him (Allah) cannot help you nor can they help themselves.\n",
        "TRANSLATION_6": "And those whom you call upon besides Him are not able to help you, nor can they help themselves.\n",
        "TRANSLATION_7": "And those on whom you call, apart from God, have no power to help you, neither they help themselves.'\n",
        "TRANSLATION_8": "They on whom ye call beside Him have no power to help you, nor can they help you, nor can they help themselves.\n",
        "TRANSLATION_9": "Those whom you call on besides Him have no power to help you, nor can they help themselves.\"\n",
        "TRANSLATION_10": "And those whom ye call upon be side Him cannot succour you nor them selves they can succour.\n",
        "TRANSLATION_11": "Those whom you invoke besides Him can neither help you, nor help themselves.\n",
        "TRANSLATION_12": "But those ye call upon besides Him, are unable to help you, and indeed to help themselves.\"\n",
        "TRANSLATION_13": "And those whom you call upon besides Him (Allah) cannot help you nor can they help themselves.\"\n",
        "TRANSLATION_14": "Those whom you invoke, other than Him, cannot help you, nor can they help themselves'\n",
        "TRANSLATION_15": "Those you call upon besides Him cannot help you, nor can they help themselves.\n",
        "TRANSLATION_16": "And those you call upon besides Him are unable to help you, nor can they help themselves.\"\n",
        "TRANSLATION_17": "[7:197] And as for those on whom you call besides God, they have no power to help you, nor can they help themselves’, so why should I be concerned with them?\n",
        "TRANSLATION_18": "(They on whom ye call) worship (beside Him) of idols (have no power to help you) to benefit or harm you, (nor can they help themselves) nor prevent what is wanted with them.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:197",
            "21:43",
            "7:192",
            "17:56",
            "6:26",
            "11:21",
            "36:75",
            "2:84",
            "51:21",
            "39:15"
        ],
        "BIBLE": [
            "torah:leviticus:26:37",
            "writings:psalms:46:6",
            "torah:deuteronomy:11:16",
            "prophets:ii%20kings:21:21",
            "writings:ezra:8:22",
            "prophets:jeremiah:25:6",
            "writings:psalms:49:16",
            "torah:deuteronomy:4:5",
            "writings:ii%20chronicles:25:8",
            "writings:ecclesiastes:4:1"
        ]
    }
}