{
    "VERSE": "7:199",
    "ARABIC": "خُذِ ٱلْعَفْوَ وَأْمُرْ بِٱلْعُرْفِ وَأَعْرِضْ عَنِ ٱلْجَٰهِلِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Make allowances for people, command what is right, and turn away from the ignorant.",
        "TRANSLATION_1": "Cultivate tolerance, enjoin justice, and avoid the fools.\n",
        "TRANSLATION_2": "[O Prophet!] Show forgiveness, enjoin equity, and avoid the ignorant.\n",
        "TRANSLATION_3": "Have forgiveness, preach the truth, and keep away from the ignorant ones.\n",
        "TRANSLATION_4": "And O dear Prophet (Mohammed – peace and blessings be upon him) adopt forgiveness, and enjoin virtue, and turn away from the ignorant.\n",
        "TRANSLATION_5": "Show forgiveness, enjoin Al-'Urf (the good), and turn away from the foolish (don't punish them).\n",
        "TRANSLATION_6": "Take to forgiveness and enjoin good and turn aside from the ignorant.\n",
        "TRANSLATION_7": "Take the abundance, and bid to what is honourable, and turn away from the ignorant.\n",
        "TRANSLATION_8": "Keep to forgiveness (O Muhammad), and enjoin kindness, and turn away from the ignorant.\n",
        "TRANSLATION_9": "Be tolerant; enjoin what is right; and avoid the ignorant.\n",
        "TRANSLATION_10": "Use thou indulgence and enjoin seemliness and turn away from the ignorant.\n",
        "TRANSLATION_11": "Adopt [a policy of] excusing [the faults of people], bid what is right, and turn away from the ignorant.\n",
        "TRANSLATION_12": "Hold to forgiveness; command what is right; But turn away from the ignorant.\n",
        "TRANSLATION_13": "Show forgiveness, enjoin what is good, and turn away from the foolish (i.e. don't punish them).\n",
        "TRANSLATION_14": "Accept the easing, order with fine jurisprudence, and avoid the ignorant.\n",
        "TRANSLATION_15": "Be tolerant, and command decency, and avoid the ignorant.\n",
        "TRANSLATION_16": "Take what is given freely, enjoin what is good, and turn away from the ignorant.\n",
        "TRANSLATION_17": "[7:199] Indulge [people] with forgiveness, [accepting] what issues spontaneously from people’s manners [of behaviour], and do not scrutinise them, and enjoin kindness, decency, and turn away from the ignorant, and do not counter their stupidity with the like.\n",
        "TRANSLATION_18": "(Keep to forgiveness (0 Muhammad)) take the surplus of your family and dependents. But this was abrogated. It is also said that this means: forgive the one who transgresses against you, and give to him who withholds from you and keep ties with him who severs his ties with you, (and enjoin kindness) and benevolence, (and turn away from the ignorant) Abu Jahl and his folk who mock you.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:199",
            "77:1",
            "7:48",
            "15:94",
            "7:120",
            "53:53",
            "52:1",
            "75:29",
            "55:15",
            "26:224"
        ],
        "BIBLE": [
            "prophets:ezekiel:18:8",
            "prophets:ezekiel:3:20",
            "prophets:ezekiel:18:13",
            "writings:job:23:11",
            "torah:numbers:31:47",
            "writings:ii%20chronicles:6:27",
            "prophets:i%20kings:8:36",
            "prophets:ii%20samuel:4:10",
            "prophets:i%20samuel:8:3",
            "prophets:i%20kings:14:8"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:4"
        ]
    }
}