{
    "VERSE": "7:201",
    "ARABIC": "إِنَّ ٱلَّذِينَ ٱتَّقَوْا۟ إِذَا مَسَّهُمْ طَٰٓئِفٌ مِّنَ ٱلشَّيْطَٰنِ تَذَكَّرُوا۟ فَإِذَا هُم مُّبْصِرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "As for those who have taqwa, when they are bothered by visitors from Shaytan, they remember and immediately see clearly.",
        "TRANSLATION_1": "Verily those who fear God think of Him when assailed by the instigations of Satan, and lo! they begin to understand,\n",
        "TRANSLATION_2": "If the God-fearing are instigated by any suggestion of Satan, they instantly become alert, whereafter they clearly perceive the right way.\n",
        "TRANSLATION_3": "When a satanic thought starts to bother the pious ones, they understand and see the light\n",
        "TRANSLATION_4": "Indeed those who fear get alerted whenever a temptation from the devil troubles them, and they perceive immediately.\n",
        "TRANSLATION_5": "Verily, those who have Taqwa, when an evil thought comes to them from Shaytan, they remember (Allah), and (indeed) they then see (aright).\n",
        "TRANSLATION_6": "Surely those who guard (against evil), when a visitation from the Shaitan afflicts them they become mindful, then lo! they see.\n",
        "TRANSLATION_7": "The godfearing, when a visitation of Satan troubles them, remember, and then see clearly;\n",
        "TRANSLATION_8": "Lo! those who ward off (evil), when a glamour from the devil troubleth them, they do but remember (Allah's Guidance) and behold them seers!\n",
        "TRANSLATION_9": "When any evil suggestion from Satan touches those who fear God, they are instantly alerted and become watchful;\n",
        "TRANSLATION_10": "Verily those who fear God when an instigation from the Satan toucheth them, they call to mind land lo! they are enlightened.\n",
        "TRANSLATION_11": "When those who are Godwary are touched by a visitation of Satan, they remember [Allah] and, behold, they perceive.\n",
        "TRANSLATION_12": "Those who fear Allah, when a thought of evil from Satan assaults them, bring Allah to remembrance, when lo! they see (aright)!\n",
        "TRANSLATION_13": "Verily, those who are Al-Muttaqun (the pious - see V. 2:2), when an evil thought comes to them from Shaitan (Satan), they remember (Allah), and (indeed) they then see (aright).\n",
        "TRANSLATION_14": "Indeed, when a visitation of satan touches the cautious (worshipers) they remember, and then see clearly.\n",
        "TRANSLATION_15": "Those who are righteous—when an impulse from Satan strikes them, they remind themselves, and immediately see clearly.\n",
        "TRANSLATION_16": "Indeed, those who fear Allah - when an impulse touches them from Satan, they remember [Him] and at once they have insight.\n",
        "TRANSLATION_17": "[7:201] Truly the God-fearing, when a visitation from Satan touches them, befalls them (tayfun: a variant reading has tā’ifun), that is, [when] something [of the sort] overcomes them, they remember, God’s punishment and His reward, and then see clearly, [distinguishing] the truth from what is other than it, and so they return [to God].\n",
        "TRANSLATION_18": "181 (Lo! those who ward off (evil)) those who ward off the whispering of the devil, (when a glamour) doubt and insinuation (from the devil troubles them) befalls them, (they do but remember) know ((Allah's guidance) and behold them seers) refraining from transgression!\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:201",
            "2:14",
            "7:175",
            "26:221",
            "38:80",
            "15:37",
            "58:19",
            "26:210",
            "47:25",
            "83:29"
        ],
        "BIBLE": [
            "prophets:i%20kings:17:18",
            "torah:deuteronomy:31:21",
            "prophets:ezekiel:46:9",
            "torah:deuteronomy:4:5",
            "torah:deuteronomy:13:6",
            "torah:deuteronomy:17:14",
            "torah:exodus:32:8",
            "torah:leviticus:26:45",
            "torah:deuteronomy:24:9",
            "prophets:jeremiah:8:16"
        ]
    }
}