{
    "VERSE": "7:202",
    "ARABIC": "وَإِخْوَٰنُهُمْ يَمُدُّونَهُمْ فِى ٱلْغَىِّ ثُمَّ لَا يُقْصِرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "But as for their brothers, the visitors lead them further into error. And they do not stop at that!",
        "TRANSLATION_1": "Even though their (devilish) brothers would like them to continue in error, and would not desist.\n",
        "TRANSLATION_2": "As for their brethren [the Satans], they draw them deeper into error and do not relax in their efforts.\n",
        "TRANSLATION_3": "while their brethren ceaselessly try to drag them into error.\n",
        "TRANSLATION_4": "And the devils pull those who their brothers into error, and then do not make any relaxation.\n",
        "TRANSLATION_5": "But (as for) their brothers (the devils' brothers) they (the devils) plunge them deeper into error, and they never stop short.\n",
        "TRANSLATION_6": "And their brethren increase them in error, then they cease not.\n",
        "TRANSLATION_7": "and their brothers they lead on into error, then they stop not short.\n",
        "TRANSLATION_8": "Their brethren plunge them further into error and cease not.\n",
        "TRANSLATION_9": "but the followers of devils are led relentlessly into error by them. They never desist.\n",
        "TRANSLATION_10": "And their brethren drag them on toward error, so they stop not short.\n",
        "TRANSLATION_11": "But their brethren, they draw them into error, and then they do not spare [any harm].\n",
        "TRANSLATION_12": "But their brethren (the evil ones) plunge them deeper into error, and never relax (their efforts).\n",
        "TRANSLATION_13": "But (as for) their brothers (the devils) they (i.e. the devils) plunge them deeper into error, and they never stop short.\n",
        "TRANSLATION_14": "And their brothers, they prolong them in error, and they will never stop.\n",
        "TRANSLATION_15": "But their brethren lead them relentlessly into error, and they never stop short.\n",
        "TRANSLATION_16": "But their brothers - the devils increase them in error; then they do not stop short.\n",
        "TRANSLATION_17": "[7:202] And their brothers, that is, the brothers of devils from among the disbelievers, they, the devils, lead them further into error, and, they, do not stop short, [do not] desist from it, by seeing clearly, in the way that those who are God-fearing come to see clearly.\n",
        "TRANSLATION_18": "(Their brethren) the brethren of the idolaters, i.e. the devils (plunge them further) drag them further by means of their insinuations (into error) into disbelief, error and sin (and cease not) and they refrain not from it.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:202",
            "7:111",
            "26:36",
            "20:42",
            "26:161",
            "26:106",
            "7:151",
            "28:35",
            "77:17",
            "78:35"
        ],
        "BIBLE": [
            "prophets:isaiah:28:9",
            "torah:leviticus:25:46",
            "prophets:ezekiel:20:17",
            "torah:deuteronomy:28:59",
            "writings:i%20chronicles:17:8",
            "prophets:jeremiah:7:16",
            "writings:job:40:28",
            "torah:numbers:15:28",
            "prophets:ii%20samuel:23:5",
            "torah:exodus:28:2"
        ]
    }
}