{
    "VERSE": "7:206",
    "ARABIC": "إِنَّ ٱلَّذِينَ عِندَ رَبِّكَ لَا يَسْتَكْبِرُونَ عَنْ عِبَادَتِهِۦ وَيُسَبِّحُونَهُۥ وَلَهُۥ يَسْجُدُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Those who are in the presence of your Lord do not consider themselves too great to worship Him. They glorify His praise and they prostrate to Him.",
        "TRANSLATION_1": "Verily those who are in the presence of your Lord are never too proud to worship and celebrate His praises, and bow in homage to Him'.\n",
        "TRANSLATION_2": "[The angels] who are near to Your Lord, never turn away from His service out of arrogance; they rather glorify Him and prostrate themselves before Him.\n",
        "TRANSLATION_3": "Those who are near to your Lord do not disdain from worshipping Him. They glorify Him and prostrate themselves (in obedience to Him).\n",
        "TRANSLATION_4": "Indeed those who are with your Lord are not conceited towards worshipping Him, and they proclaim His Purity and it is to Him they prostrate. (Command of Prostration # 1)\n",
        "TRANSLATION_5": "Surely, those who are with your Lord (angels) are never too proud to perform acts of worship to Him, but they glorify His praise and prostrate themselves before Him.\n",
        "TRANSLATION_6": "Surely those who are with your Lord are not too proud to serve Him, and they declare His glory and prostrate in humility before Him.\n",
        "TRANSLATION_7": "Surely those who are with thy Lord wax not too proud to serve Him; they chant His praise, and to Him they bow.\n",
        "TRANSLATION_8": "Lo! those who are with thy Lord are not too proud to do Him service, but they praise Him and prostrate before Him.\n",
        "TRANSLATION_9": "[even] the ones [angels] who live in the presence of your Lord are not too proud to worship Him: they glorify Him and prostrate themselves before Him.\n",
        "TRANSLATION_10": "Verily those who are with thy Lord are not stiff-necked against His woorship, and they hallow, and unto Him they prostrate themselves.\n",
        "TRANSLATION_11": "Indeed those who are [stationed] near your Lord do not disdain to worship Him. They glorify Him and prostrate to Him.\n",
        "TRANSLATION_12": "Those who are near to thy Lord, disdain not to do Him worship: They celebrate His praises, and prostrate before Him.\n",
        "TRANSLATION_13": "Surely, those who are with your Lord (angels) are never too proud to perform acts of worship to Him, but they glorify His Praise and prostrate before Him.\n",
        "TRANSLATION_14": "Those who are with your Lord are not too proud to worship Him. They exalt Him and to Him they prostrate.\n",
        "TRANSLATION_15": "Those who are in the presence of your Lord are not too proud to worship Him. They recite His praises, and to Him they bow down.\n",
        "TRANSLATION_16": "Indeed, those who are near your Lord are not prevented by arrogance from His worship, and they exalt Him, and to Him they prostrate.\n",
        "TRANSLATION_17": "[7:206] Surely those who are with your Lord, namely, the angels, are not too proud, they do [not] disdain, to worship Him; they glorify Him, exalting Him as being transcendent above what does not befit Him, and to Him they prostrate, that is, they devote their submission and worship exclusively to Him: so be like them! Medinese, except for verses 30 to 36 inclusive, which are Meccan; it consists of 75 or 77 verses, and was revealed after [sūrat] al-Baqara. The Muslims fell into dispute over the spoils of [the battle of] Badr. The young men said, ‘These [spoils] should be ours because we hastened to join the fighting’, while the old men said, ‘We were your support, holding up the banners behind you; had you been exposed, you would have come back to us, so do not claim it as yours exclusively.’ Thus the following was revealed:\n",
        "TRANSLATION_18": "(Lo! those who are with your Lord) i.e. the angels (are not too proud to do Him service) to obey Him and acknowledge their servitude to Him, (but they praise Him) they obey Him (and adore Him) and pray to Him, and Allah knows best'. And of the surah in which the spoils of war are mentioned, which is Medinan in its entirety-except for His saying: (O Prophet! Allah is sufficient for you and those who follow you of the believers) which was revealed in al-Bayda' at the Battle of Badr but before the fighting started-and consists of 75 verses, 1,130 words and 5,290 letters: Surah 8: The Spoils of War [al-Anfal) And of the surah in which the spoils of war are mentioned, which is Medinan in its entirety— except for His saying: (O Prophet! Allah is sufficient for you and those who follow you of the believers) which was revealed in al-Bayda' at the Battle of Badr but before the fighting started— and consists of 75 verses, 1,130 words and 5,290 letters:\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:206",
            "40:60",
            "43:49",
            "41:38",
            "51:34",
            "21:19",
            "23:59",
            "2:277",
            "2:46",
            "25:64"
        ],
        "BIBLE": [
            "torah:deuteronomy:8:19",
            "writings:ii%20chronicles:30:8",
            "writings:ii%20chronicles:7:19",
            "prophets:isaiah:14:3",
            "prophets:i%20kings:9:6",
            "torah:exodus:20:5",
            "torah:deuteronomy:5:9",
            "torah:deuteronomy:30:17",
            "prophets:joshua:23:16",
            "torah:numbers:18:7"
        ]
    }
}