{
    "VERSE": "7:24",
    "ARABIC": "قَالَ ٱهْبِطُوا۟ بَعْضُكُمْ لِبَعْضٍ عَدُوٌّ وَلَكُمْ فِى ٱلْأَرْضِ مُسْتَقَرٌّ وَمَتَٰعٌ إِلَىٰ حِينٍ",
    "ENGLISH": {
        "TRANSLATION_0": "He said, 'Go down from here as enemies to each other! You will have residence on the earth and enjoyment for a time.'",
        "TRANSLATION_1": "Go,\" said God, \"one the antagonist of the other, and live on the earth for a time ordained, and fend for yourselves.\n",
        "TRANSLATION_2": "Allah said: 'Go down; you are enemies one of the other. For you there is dwelling and provision on the earth for a while.'\n",
        "TRANSLATION_3": "The Lord told them to leave the garden as each other's enemies and go to earth to dwell and benefit from the means therein for an appointed time.\n",
        "TRANSLATION_4": "He said, “Go down, one of you is a foe unto the other; and for a fixed time you shall stay on earth and feed in it.”\n",
        "TRANSLATION_5": "(Allah) said: \"Get down, one of you an enemy to the other. On earth will be a dwelling place for you and an enjoyment for a time.\"\n",
        "TRANSLATION_6": "He said: Get forth, some of you, the enemies of others, and there is for you in the earth an abode and a provision for a time.\n",
        "TRANSLATION_7": "Said He, 'Get you down, each of you an enemy to each. In the earth a sojourn shall be yours, and enjoyment for a time.'\n",
        "TRANSLATION_8": "He said: Go down (from hence), one of you a foe unto the other. There will be for you on earth a habitation and provision for a while.\n",
        "TRANSLATION_9": "He said, \"Go down from here as enemies to each other. For a while, there is an abode for you and a provision on earth.\n",
        "TRANSLATION_10": "Allah said: get ye down, one of you an enemy unto anot her; and for you on the earth there shall be a habitation and provision for a season.\n",
        "TRANSLATION_11": "He said, ‘Get down, being enemies of one another! On the earth shall be your abode and sustenance for a time.’\n",
        "TRANSLATION_12": "(Allah) said: \"Get ye down. With enmity between yourselves. On earth will be your dwelling-place and your means of livelihood,- for a time.\"\n",
        "TRANSLATION_13": "(Allah) said: \"Get down, one of you an enemy to the other [i.e. Adam, Hawwa (Eve), and Shaitan (Satan), etc.]. On earth will be a dwelling-place for you and an enjoyment, - for a time.\"\n",
        "TRANSLATION_14": "He said: 'Descend, each of you an enemy to each other. The earth will be a dwelling place for you and an enjoyment for a time.\n",
        "TRANSLATION_15": "He said, “Fall, some of you enemies to one another. On earth you will have residence and livelihood for a while.”\n",
        "TRANSLATION_16": "[Allah] said, \"Descend, being to one another enemies. And for you on the earth is a place of settlement and enjoyment for a time.\"\n",
        "TRANSLATION_17": "[7:24] Said He, ‘Go down, that is, Adam and Eve, with all those you comprise of your seed, each of you, each seed, an enemy to the other, on account of the wrong each does to the another. There will be for you on earth an abode, a place of settlement, and enjoyment for a while’, [until] your terms [of life] are fulfilled.\n",
        "TRANSLATION_18": "(He said: Go down (from hence)) from Paradise, (one of you a foe unto the other) meaning: Adam, Eve, the serpent and the peacock. (There will be for you on earth a habitation) a dwelling and shelter (and provision for a while) until death.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:24",
            "2:36",
            "30:18",
            "30:19",
            "23:79",
            "36:44",
            "21:111",
            "79:30",
            "17:90",
            "56:73"
        ],
        "BIBLE": [
            "torah:numbers:14:40",
            "prophets:ezekiel:26:20",
            "prophets:ii%20samuel:14:11",
            "prophets:ezekiel:36:2",
            "prophets:jeremiah:23:12",
            "prophets:jeremiah:14:13",
            "prophets:ezekiel:38:12",
            "torah:genesis:27:39",
            "torah:genesis:19:27",
            "prophets:joshua:3:3"
        ]
    }
}