{
    "VERSE": "7:25",
    "ARABIC": "قَالَ فِيهَا تَحْيَوْنَ وَفِيهَا تَمُوتُونَ وَمِنْهَا تُخْرَجُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "He said, 'On it you will live and on it die and from it you will be brought forth.'",
        "TRANSLATION_1": "You will live there, and there will you die,\" He said, \"and be raised from there (On the Day of Doom).\"\n",
        "TRANSLATION_2": "He continued: 'You shall live there, and there shall you die, and from it you shall be raised to life.'\n",
        "TRANSLATION_3": "He told them that, on earth, they would live, die, and be resurrected.\n",
        "TRANSLATION_4": "He said, “You shall live there and there shall you die, and from there only you will be raised.”\n",
        "TRANSLATION_5": "He said: \"Therein you shall live, and therein you shall die, and from it you shall be brought out (resurrected).\"\n",
        "TRANSLATION_6": "He (also) said: Therein shall you live, and therein shall you die, and from it shall you be raised.\n",
        "TRANSLATION_7": "Said He, 'Therein you shall live, and therein you shall die, and from there you shall be brought forth.'\n",
        "TRANSLATION_8": "He said: There shall ye live, and there shall ye die, and thence shall ye be brought forth.\n",
        "TRANSLATION_9": "There you will live; there you will die; from there you will be raised up again.\"\n",
        "TRANSLATION_10": "Allah said: therein ye shall live and therein ye shall die, and therefrom ye shall be brought forth.\n",
        "TRANSLATION_11": "He said, ‘In it you will live, and in it you will die; and from it you will be raised [from the dead].’\n",
        "TRANSLATION_12": "He said: \"Therein shall ye live, and therein shall ye die; but from it shall ye be taken out (at last).\"\n",
        "TRANSLATION_13": "He said: \"Therein you shall live, and therein you shall die, and from it you shall be brought out (i.e. resurrected).\"\n",
        "TRANSLATION_14": "He said: 'There you shall live and there you shall die, and from there you shall emerge'\n",
        "TRANSLATION_15": "He said, “In it you will live, and in it you will die, and from it you will be brought out.”\n",
        "TRANSLATION_16": "He said, \"Therein you will live, and therein you will die, and from it you will be brought forth.\"\n",
        "TRANSLATION_17": "[7:25] Said He, ‘There, that is, [on] earth, you shall live, and there you shall die, and from there you shall be brought forth’, through the Resurrection (read active takhrujūn, ‘you shall come forth’, or passive tukhrajūn, ‘you shall be brought forth’).\n",
        "TRANSLATION_18": "(He said: There) in the earth (shall ye live, and there) in the earth (shall ye die, and thence) on earth (shall ye be brought forth) on the Day of Judgement.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:25",
            "71:18",
            "25:76",
            "23:108",
            "84:4",
            "87:13",
            "10:56",
            "20:119",
            "26:20",
            "26:94"
        ],
        "BIBLE": [
            "torah:exodus:14:11",
            "torah:genesis:27:33",
            "prophets:ezekiel:33:15",
            "prophets:ezekiel:12:13",
            "torah:deuteronomy:4:20",
            "prophets:ii%20samuel:13:11",
            "prophets:jonah:1:12",
            "torah:numbers:24:23",
            "prophets:i%20kings:18:40",
            "prophets:ii%20kings:4:20"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:8",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:11",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:2"
        ]
    }
}