{
    "VERSE": "7:30",
    "ARABIC": "فَرِيقًا هَدَىٰ وَفَرِيقًا حَقَّ عَلَيْهِمُ ٱلضَّلَٰلَةُ إِنَّهُمُ ٱتَّخَذُوا۟ ٱلشَّيَٰطِينَ أَوْلِيَآءَ مِن دُونِ ٱللَّهِ وَيَحْسَبُونَ أَنَّهُم مُّهْتَدُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Children of Adam! wear fine clothing in every mosque and eat and drink but do not be profligate. He does not love the profligate.",
        "TRANSLATION_1": "A Section (among them) were guided, a section were bound to go astray, (for) instead of God they took the devils as their friends; yet they think they are on the right path.\n",
        "TRANSLATION_2": "A party He has guided to the Right Way, and for another party straying is justly its due for they have taken satans, rather than Allah, as their guardians, even though they think that they are rightly-guided.\n",
        "TRANSLATION_3": "He has guided one group (of people) and the other group go is doomed to astray; the latter group took Satan as their guardian instead of God and thought that they were rightly guided.\n",
        "TRANSLATION_4": "He has guided one group, and one group’s error has been proved; instead of Allah, they have chosen the devil as their friend and they assume that they are on guidance!\n",
        "TRANSLATION_5": "A group He has guided, and a group deserved to be in error; (because) surely, they took the Shayatin as supporters instead of Allah, and think that they are guided.\n",
        "TRANSLATION_6": "A part has He guided aright and (as for another) part, error is justly their due, surely they took the Shaitans for guardians beside Allah, and they think that they are followers of the right\n",
        "TRANSLATION_7": "a part He guided, and a part justly disposed to error -- they have taken Satans for friends instead of God, and think them guided.'\n",
        "TRANSLATION_8": "A party hath He led aright, while error hath just hold over (another) party, for lo! they choose the devils for protecting supporters instead of Allah and deem that they are rightly guided.\n",
        "TRANSLATION_9": "Some He has guided and some have earned misguidance: they have taken devils rather than God as their patrons, thinking that they are rightly guided.\n",
        "TRANSLATION_10": "A part He hath guided, and upon a part the straying hath been justified. Verily they have taken the Satans as patrons instead of Allah and they imagine that they are guided ones.\n",
        "TRANSLATION_11": "A part [of mankind] He has guided and a part has deserved [to be consigned to] error, for they took devils for guardians instead of Allah, and supposed they were guided.\n",
        "TRANSLATION_12": "Some He hath guided: Others have (by their choice) deserved the loss of their way; in that they took the evil ones, in preference to Allah, for their friends and protectors, and think that they receive guidance.\n",
        "TRANSLATION_13": "A group He has guided, and a group deserved to be in error; (because) surely they took the Shayatin (devils) as Auliya' (protectors and helpers) instead of Allah, and consider that they are guided.\n",
        "TRANSLATION_14": "Some He has guided, and upon some justly is the straying; for they had chosen the satans for supporters instead of Allah and suppose themselves to be guided.\n",
        "TRANSLATION_15": "Some He has guided, and some have deserved misguidance. They have adopted the devils for patrons rather than God, and they assume that they are guided.\n",
        "TRANSLATION_16": "A group [of you] He guided, and a group deserved [to be in] error. Indeed, they had taken the devils as allies instead of Allah while they thought that they were guided.\n",
        "TRANSLATION_17": "[7:30] A party, of you, He has guided, while another party has deserved to go astray — they have taken devils as patrons instead of God, that is, other than Him, and think that they are guided’.\n",
        "TRANSLATION_18": "(A party hath He led aright) Allah honoured them with knowledge and felicity: these are the people of the right, (while error hath just hold) is prescribed (over (another) party) Allah humiliated them with denial and damnation: these are the people of the left, (for lo! they choose) He says: Allah knows that they take (the devils for protecting friends) gods (instead of Allah and deem) the misguided people think (that they are rightly guided) through Allah's religion.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:30",
            "46:32",
            "36:74",
            "4:76",
            "42:9",
            "42:31",
            "6:121",
            "42:6",
            "11:113",
            "9:116"
        ],
        "BIBLE": [
            "prophets:isaiah:40:14",
            "writings:job:27:2",
            "prophets:isaiah:57:1",
            "torah:genesis:12:19",
            "prophets:zephaniah:3:15",
            "writings:job:34:5",
            "writings:ezra:9:2",
            "prophets:ezekiel:18:13",
            "torah:genesis:39:20",
            "prophets:judges:16:29"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:5:2",
            
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:13",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:1"
        ]
    }
}