{
    "VERSE": "7:41",
    "ARABIC": "لَهُم مِّن جَهَنَّمَ مِهَادٌ وَمِن فَوْقِهِمْ غَوَاشٍ وَكَذَٰلِكَ نَجْزِى ٱلظَّٰلِمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "They will have Hell as a resting-place and covering layers on top of them. That is how We repay wrongdoers.",
        "TRANSLATION_1": "For them is a flooring of Hell and a covering (of fire). That is how We requite the iniquitous.\n",
        "TRANSLATION_2": "Hell shall be their bed, and also above them their covering. Thus do We reward the wrong-doers.\n",
        "TRANSLATION_3": "For them, hell will be both a cradle and a blanket. Thus do We punish the unjust.\n",
        "TRANSLATION_4": "Their beds and their coverings – both are fire; and this is the sort of reward We give the unjust.\n",
        "TRANSLATION_5": "Theirs will be Mihad from the Fire, and over them Ghawash. Thus do We recompense the wrongdoers.\n",
        "TRANSLATION_6": "They shall have a bed of hell-fire and from above them coverings (of it); and thus do We reward the unjust.\n",
        "TRANSLATION_7": "Gehenna shall be their cradle, above them coverings. Even so We recompense the evildoers.\n",
        "TRANSLATION_8": "Theirs will be a bed of hell, and over them coverings (of hell). Thus do We requite wrong-doers.\n",
        "TRANSLATION_9": "Hell shall be their bed, and over them will be coverings of fire, thus shall We reward the wrongdoers.\n",
        "TRANSLATION_10": "Their shall be a bed in Hell, and over them coverings; and Thus We requite the wrong-doers.\n",
        "TRANSLATION_11": "They shall have hell for their resting place, and over them shall be sheets [of fire], and thus do We requite the wrongdoers.\n",
        "TRANSLATION_12": "For them there is Hell, as a couch (below) and folds and folds of covering above: such is Our requital of those who do wrong.\n",
        "TRANSLATION_13": "Theirs will be a bed of Hell (Fire), and over them coverings (of Hell-fire). Thus do We recompense the Zalimun (polytheists and wrong-doers, etc.).\n",
        "TRANSLATION_14": "Gehenna (Hell) shall be their cradle, and layers of fire shall cover them. As such We recompense the harmdoers.\n",
        "TRANSLATION_15": "For them is a couch of hell, and above them are sheets of fire. Thus We repay the wrongdoers.\n",
        "TRANSLATION_16": "They will have from Hell a bed and over them coverings [of fire]. And thus do We recompense the wrongdoers.\n",
        "TRANSLATION_17": "[7:41] Hell shall be their bed, and over them coverings, of fire (ghawāshin is the plural of ghāshiya and its nunation compensates for the omitted yā’). Thus do We requite the evildoers.\n",
        "TRANSLATION_18": "(Theirs will be a bed of hell) a bed of fire, (and over them coverings (of hell). Thus do We requite wrong- doers) the idolaters.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:41",
            "3:12",
            "38:56",
            "3:197",
            "21:88",
            "16:50",
            "21:29",
            "39:16",
            "6:105",
            "2:212"
        ],
        "BIBLE": [
            "prophets:isaiah:26:21",
            "prophets:i%20kings:8:7",
            "writings:ii%20chronicles:5:8",
            "writings:psalms:44:20",
            "writings:nehemiah:3:37",
            "prophets:isaiah:28:20",
            "writings:esther:7:8",
            "prophets:isaiah:65:10",
            "prophets:hosea:6:8",
            "writings:psalms:91:4"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:1:12",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:14"
        ]
    }
}