{
    "VERSE": "7:44",
    "ARABIC": "وَنَادَىٰٓ أَصْحَٰبُ ٱلْجَنَّةِ أَصْحَٰبَ ٱلنَّارِ أَن قَدْ وَجَدْنَا مَا وَعَدَنَا رَبُّنَا حَقًّا فَهَلْ وَجَدتُّم مَّا وَعَدَ رَبُّكُمْ حَقًّا قَالُوا۟ نَعَمْ فَأَذَّنَ مُؤَذِّنٌۢ بَيْنَهُمْ أَن لَّعْنَةُ ٱللَّهِ عَلَى ٱلظَّٰلِمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "The Companions of the Garden will call out to the Companions of the Fire, 'We have found that what our Lord promised us is true. Have you found that what your Lord promised you is true?' They will say, 'Yes, we have!' Between them a herald will proclaim: 'May the curse of Allah be on the wrongdoers",
        "TRANSLATION_1": "And the inmates of Paradise will call to the residents of Hell: \"We have found that the promise made to us by our Lord was true. Have you also found the promise of your Lord to be true?\" They will answer: \"Yes (it is so).\" Then a crier will call from among them: \"The curse of God be on the vile,\n",
        "TRANSLATION_2": "And the people of Paradise shall cry to the people of Hell: 'Surely we have found our Lord's promise to us to be true. have you also found true what your Lord has promised you?' 'Yes', they shall answer; and a herald shall cry out among them: 'Allah's curse be upon the wrong-doers';\n",
        "TRANSLATION_3": "The people of Paradise will say to the dwellers of the fire, \"We have found whatever our Lord promised has come true. Have you found whatever the Lord promised you to be true?\" They will reply, \"Yes, we have also found it to be true.\" Thereupon, someone will cry out, \"God has condemned the unjust,\n",
        "TRANSLATION_4": "And the people of Paradise said to the people of hell, “We have surely received what our Lord had truly promised us – so have you also received what your Lord had truly promised?” They said, “Yes”; and an announcer between them proclaimed, “The curse of Allah is upon the unjust.” –\n",
        "TRANSLATION_5": "And the dwellers of Paradise will call out to the dwellers of the Fire (saying): \"We have indeed found true what our Lord had promised us; have you also found true what your Lord promised (warned)\" They shall say: \"Yes.\" Then a crier will proclaim between them: \"The curse of Allah is on the wrongdoers.\"\n",
        "TRANSLATION_6": "And the dwellers of the garden will call out to the inmates of the fire: Surely we have found what our Lord promised us to be true; have you too found what your Lord promised to be true? They will say: Yes. Then a crier will cry out among them that the curse of Allah is on the unjust.\n",
        "TRANSLATION_7": "The inhabitants of Paradise will call to the inhabitants of the Fire: 'We have found that. which our Lord promised us true; have you found what your Lord promised you true?' 'Yes,' they will say. And then a herald shall proclaim between them: 'God's curse is on the evildoers\n",
        "TRANSLATION_8": "And the dwellers of the Garden cry unto the dwellers of the Fire: We have found that which our Lord promised us (to be) the Truth. Have ye (too) found that which your Lord promised the Truth? They say: Yea, verily. And a crier in between them crieth: The curse of Allah is on evil-doers,\n",
        "TRANSLATION_9": "The people of the Garden will call out to the people of the Fire, \"We have found that what our Lord promised us is true. Have you, too, found that what your Lord promised you is true?\" They will say, \"Yes, we have!\" Then a crier shall call out among them saying, \"The curse of God is upon the wrongdoers --\n",
        "TRANSLATION_10": "And the fellows of the Garden shall cry unto the fellows of the Fire: surely we have found true that which our Lord had promised us; have ye found true that which your Lord had promised you? They shall say: Yea! Then a Crier in-between them shall cry: the curse of Allah be upon the wrong-doers.\n",
        "TRANSLATION_11": "The inhabitants of paradise will call out to the inmates of the Fire, ‘We found what our Lord promised us to be true; did you find what your Lord promised you to be true?’ ‘Yes,’ they will say. Then a caller will announce in their midst, ‘May Allah’s curse be on the wrongdoers!’\n",
        "TRANSLATION_12": "The Companions of the Garden will call out to the Companions of the Fire: \"We have indeed found the promises of our Lord to us true: Have you also found Your Lord's promises true?\" They shall say, \"Yes\"; but a crier shall proclaim between them: \"The curse of Allah is on the wrong-doers;-\n",
        "TRANSLATION_13": "And the dwellers of Paradise will call out to the dwellers of the Fire (saying): \"We have indeed found true what our Lord had promised us; have you also found true, what your Lord promised (warnings, etc.)?\" They shall say: \"Yes.\" Then a crier will proclaim between them: \"The Curse of Allah is on the Zalimun (polytheists and wrong-doers, etc.),\"\n",
        "TRANSLATION_14": "Then the companions of Paradise will call out to the companions of the Fire: 'What our Lord promised we have found to be true, have you too, found the promise of your Lord to be true' 'Yes' they shall answer, and a Caller will announce between them that the curse of Allah is upon the harmdoers,\n",
        "TRANSLATION_15": "And the inhabitants of the Garden will call out to the inmates of the Fire, “We found what our Lord promised us to be true; did you find what your Lord promised you to be true?” They will say, “Yes.” Thereupon a caller will announce in their midst, “The curse of God is upon the wrongdoers.”\n",
        "TRANSLATION_16": "And the companions of Paradise will call out to the companions of the Fire, \"We have already found what our Lord promised us to be true. Have you found what your Lord promised to be true?\" They will say, \"Yes.\" Then an announcer will announce among them, \"The curse of Allah shall be upon the wrongdoers.\"\n",
        "TRANSLATION_17": "[7:44] And the inhabitants of Paradise will call to the inhabitants of the Fire, either in affirmation or in reprimand: ‘We have found that which our Lord promised us, in the way of reward, to be true; have you found that, chastisement, which your Lord promised, you, to be true?’ They will say: ‘Yes!’ And then a crier, a caller, shall proclaim between them, between both parties, making them hear that: ‘God’s curse is on the evildoers,\n",
        "TRANSLATION_18": "(And the dwellers of the Garden cry unto the dwellers of the Fire: We have found that which our Lord promised us) of reward and favour ((to be) the Truth. Have ye (too)) people of the Fire (found that which your Lord promised) of torment and humiliation to be (the Truth? They say: Yea, verily. And a crier in between them) between the people of Paradise and the people of hell (crieth: The curse of Allah) the torment of Allah (is on evil-doers) on the disbelievers.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:44",
            "7:50",
            "46:34",
            "59:20",
            "5:84",
            "7:105",
            "6:57",
            "3:183",
            "41:30",
            "22:56"
        ],
        "BIBLE": [
            "prophets:i%20kings:18:24",
            "prophets:jeremiah:4:10",
            "prophets:zechariah:13:9",
            "prophets:i%20kings:18:21",
            "prophets:i%20kings:11:2",
            "prophets:ii%20kings:1:12",
            "writings:daniel:6:13",
            "prophets:ezekiel:12:19",
            "prophets:judges:21:5",
            "prophets:jeremiah:35:17"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:1:12",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:2:5"
        ]
    }
}