{
    "VERSE": "7:45",
    "ARABIC": "ٱلَّذِينَ يَصُدُّونَ عَن سَبِيلِ ٱللَّهِ وَيَبْغُونَهَا عِوَجًا وَهُم بِٱلْءَاخِرَةِ كَٰفِرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "those who bar access to the Way of Allah, desiring to make it crooked, and reject the next World.'",
        "TRANSLATION_1": "Who obstruct those who follow the path of God and try to make it oblique, who do not believe in the life to come.\"\n",
        "TRANSLATION_2": "upon those who hinder men from the path of Allah and seek to make it crooked; and disbelieve in the Hereafter.'\n",
        "TRANSLATION_3": "who prevented others from the way of God, sought to make (the path) appear crooked, and had no belief in the Day of Judgment.\"\n",
        "TRANSLATION_4": "“Those who prevent from the path of Allah and wish to distort it; and who disbelieve in the Hereafter.”\n",
        "TRANSLATION_5": "Those who hindered (men) from the path of Allah, and would seek to make it crooked, and they were disbelievers in the Hereafter.\n",
        "TRANSLATION_6": "Who hinder (people) from Allah's way and seek to make it crooked, and they are disbelievers in the hereafter.\n",
        "TRANSLATION_7": "who bar from God's way, desiring to make it crooked, disbelieving in the world to come.\n",
        "TRANSLATION_8": "Who debar (men) from the path of Allah and would have it crooked, and who are disbelievers in the Last Day.\n",
        "TRANSLATION_9": "who turned people away from the path of God and sought to make it appear crooked, and who denied the Hereafter.\"\n",
        "TRANSLATION_10": "Those who turned away from the way of Allah and would seek to render it crooked and in the Herafter they were disbelievers.\n",
        "TRANSLATION_11": "—Those who bar [others] from the way of Allah, and seek to make it crooked, and disbelieve in the Hereafter.\n",
        "TRANSLATION_12": "Those who would hinder (men) from the path of Allah and would seek in it something crooked: they were those who denied the Hereafter.\"\n",
        "TRANSLATION_13": "Those who hindered (men) from the Path of Allah, and would seek to make it crooked, and they were disbelievers in the Hereafter.\n",
        "TRANSLATION_14": "who have barred others from the Path of Allah and sought to make it crooked, and who had no belief in the Everlasting Life.\n",
        "TRANSLATION_15": "“Those who hinder from the path of God, and seek to distort it, and who deny the Hereafter.”\n",
        "TRANSLATION_16": "Who averted [people] from the way of Allah and sought to make it [seem] deviant while they were, concerning the Hereafter, disbelievers.\n",
        "TRANSLATION_17": "[7:45] who bar, people, from God’s way, [from] His religion, desiring it, that is, they seek the way that is, crooked, disbelieving in the Hereafter’.\n",
        "TRANSLATION_18": "(Who debar (men) from the path of Allah) who divert people from Allah's religion and obedience (and would have it crooked) would have it changed, (and who are disbelievers in the Last Day) in resurrection after death.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:45",
            "11:19",
            "14:3",
            "47:1",
            "16:88",
            "7:86",
            "2:190",
            "3:99",
            "29:69",
            "3:114"
        ],
        "BIBLE": [
            "torah:exodus:23:27",
            "prophets:isaiah:29:21",
            "writings:job:34:27",
            "torah:genesis:3:24",
            "writings:daniel:6:13",
            "prophets:zephaniah:1:6",
            "prophets:isaiah:10:2",
            "writings:ezra:6:8",
            "prophets:zephaniah:3:20",
            "torah:exodus:35:10"
        ]
    }
}