{
    "VERSE": "7:46",
    "ARABIC": "وَبَيْنَهُمَا حِجَابٌ وَعَلَى ٱلْأَعْرَافِ رِجَالٌ يَعْرِفُونَ كُلًّۢا بِسِيمَىٰهُمْ وَنَادَوْا۟ أَصْحَٰبَ ٱلْجَنَّةِ أَن سَلَٰمٌ عَلَيْكُمْ لَمْ يَدْخُلُوهَا وَهُمْ يَطْمَعُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "There will be a dividing wall between them and on the ramparts there will be men who recognise everyone by their mark. They will call out to the people of the Garden: 'Peace be upon you!' They will not enter it for all their ardent desire to do so.",
        "TRANSLATION_1": "There will be a veil between them, and on the wall will be the men (of al-A'raf) who will recognise everyone by their distinguishing marks, and will call to the inmates of Paradise: \"Peace on you,\" without having entered it themselves though hoping to do so.\n",
        "TRANSLATION_2": "And between the two there will be a barrier, and on the Heights will be men who will recognize each person by his mark and will cry, out to the people of Paradise: 'Peace be to you.'These will be the ones who had not yet joined them in Paradise, though they long to do so.\n",
        "TRANSLATION_3": "There will be a barrier between the people of Paradise and hell. There will be people on the heights who know everyone by their faces and who will say to the people of Paradise, \"Peace be upon you.\" They hope to enter Paradise but are not yet therein.\n",
        "TRANSLATION_4": "Between Paradise and Hell is a veil; and on the Heights will be some men who will recognise them all by their foreheads; and they call to the people of Paradise, “Peace be upon you”; they have not entered Paradise and they yearn for it.\n",
        "TRANSLATION_5": "And between them will be a (barrier) screen and on Al-A`raf will be men, who would recognize all, by their marks. And they will call out to the dwellers of Paradise, \"Peace be on you\" and at that time they will not yet have entered it (Paradise), but they will hope to enter (it).\n",
        "TRANSLATION_6": "And between the two there shall be a veil, and on the most elevated places there shall be men who know all by their marks, and they shall call out to the dwellers of the garden: Peace be on you; they shall not have yet entered it, though they hope.\n",
        "TRANSLATION_7": "And between them is a veil, and on the Ramparts are men knowing each by their mark, who shall call to the inhabitants of Paradise: 'Peace be upon you! They have not entered it, for all their eagerness.'\n",
        "TRANSLATION_8": "Between them is a veil. And on the Heights are men who know them all by their marks. And they call unto the dwellers of the Garden: Peace be unto you! They enter it not although they hope (to enter).\n",
        "TRANSLATION_9": "A barrier will divide the two groups, and on the heights there will be men who recognize each group by their marks. They will call out to the people of the Garden, \"Peace be with you.\" They will not have yet entered, but they will be hoping [to do so],\n",
        "TRANSLATION_10": "And betwixt the twain there will be a veil, and, on the heights will be men recognising them all by their mark, and they will cry unto the fellows of the Garden; peace be unto you! They will not have entered it yet, while they shall be longing.\n",
        "TRANSLATION_11": "There will be a veil between them. And on the Elevations will be certain men who recognize each of them by their mark. They will call out to the inhabitants of paradise, ‘Peace be to you!’ (They will not have entered it, though they would be eager to do so.\n",
        "TRANSLATION_12": "Between them shall be a veil, and on the heights will be men who would know every one by his marks: they will call out to the Companions of the Garden, \"peace on you\": they will not have entered, but they will have an assurance (thereof).\n",
        "TRANSLATION_13": "And between them will be a barrier screen and on Al-A'raf (a wall with elevated places) will be men (whose good and evil deeds would be equal in scale), who would recognise all (of the Paradise and Hell people), by their marks (the dwellers of Paradise by their white faces and the dwellers of Hell by their black faces), they will call out to the dwellers of Paradise, \"Salamun 'Alaikum\" (peace be on you), and at that time they (men on Al-A'raf) will not yet have entered it (Paradise), but they will hope to enter (it) with certainty.\n",
        "TRANSLATION_14": "And between them is a veil, and on the ramparts there shall stand men who will know each by their marks. To the companions of Paradise they shall call: 'Peace be upon you' Yet they did not enter it on account of their eagerness.\n",
        "TRANSLATION_15": "And between them is a partition, and on the Elevations are men who recognize everyone by their features. They will call to the inhabitants of the Garden, “Peace be upon you.” They have not entered it, but they are hoping.\n",
        "TRANSLATION_16": "And between them will be a partition, and on [its] elevations are men who recognize all by their mark. And they call out to the companions of Paradise, \"Peace be upon you.\" They have not [yet] entered it, but they long intensely.\n",
        "TRANSLATION_17": "[7:46]   And between them, that is, [between] the inhabitants of Paradise and those of the Fire, is a veil, a barrier, said to be the wall of the Heights, and on the Heights, which is, the wall of Paradise, are men, whose good deeds and evil deeds are equal, as [is stated] in the hadīth, who know each, of the inhabitants of Paradise and those of the Fire, by their mark — glowing faces in the case of the believers and blackened [ones] in the case of the disbelievers, for they are able to see them, their position being high — and they call to the inhabitants of Paradise: ‘Peace be upon you!’ God, exalted be He, says: They, that is, those men of the Heights, have not entered it, Paradise, although they aspire, to enter it. Al-Hasan [al-Basrī] said, ‘God causes them to have this aspiration only because He desires to be generous to them’. Al-Hākim reported that Hudhayfa [b. al-Yamān] said, ‘While they are in this situation, God appears to them and says “Get up and enter Paradise, for I have forgiven you”.’\n",
        "TRANSLATION_18": "(Between them) between Paradise and hell (is a veil) a wall. (And on the Heights are men) on the wall are men-whose good deeds are of the same amount as their evil deeds; it is also said these are men of knowledge and experts in law but who held doubts about provision (who know them all) all those who enter hell and those who enter Paradise (by their marks) they know those who enter hell by their darkened faces and blue eyes and those who enter Paradise by their lightened faces: at once handsome and radiant. (And they) the people on the wall (call unto the dwellers of the Garden: Peace be unto you) people of Paradise! (They enter it not) yet (although they hope (to enter)) i.e. the people on the wall.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:46",
            "7:48",
            "2:82",
            "7:44",
            "16:32",
            "59:20",
            "4:32",
            "7:50",
            "22:27",
            "7:42"
        ],
        "BIBLE": [
            "prophets:ezekiel:9:4",
            "prophets:jeremiah:33:10",
            "prophets:i%20samuel:29:4",
            "prophets:jeremiah:44:29",
            "prophets:ezekiel:44:5",
            "prophets:jeremiah:14:13",
            "prophets:i%20samuel:20:7",
            "torah:numbers:13:32",
            "torah:exodus:18:23",
            "prophets:jeremiah:51:62"
        ]
    }
}