{
    "VERSE": "7:47",
    "ARABIC": "وَإِذَا صُرِفَتْ أَبْصَٰرُهُمْ تِلْقَآءَ أَصْحَٰبِ ٱلنَّارِ قَالُوا۟ رَبَّنَا لَا تَجْعَلْنَا مَعَ ٱلْقَوْمِ ٱلظَّٰلِمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "When they turn their eyes towards the Companions of the Fire, they will say, 'Our Lord, do not place us with the people of the wrongdoers!'",
        "TRANSLATION_1": "When their eyes fall on the inmates of Hell they will say: \"O Lord, do not place us in the crowd of the vile.\"\n",
        "TRANSLATION_2": "And when the eyes of the people of the Heights will be turned towards the people of Hell they will say: 'Our Lord! Do not cast us among the wrongdoing people.'\n",
        "TRANSLATION_3": "When their eyes turn to the dwellers of hell, they will pray, \"Lord, do not place us among the unjust.\"\n",
        "TRANSLATION_4": "And when their eyes turn towards the people of hell, they will say, “Our Lord! Do not put us along with the unjust.”\n",
        "TRANSLATION_5": "And when their eyes will be turned towards the dwellers of the Fire, they will say: \"Our Lord! Place us not with the people who are wrongdoers.\"\n",
        "TRANSLATION_6": "And when their eyes shall be turned towards the inmates of the fire, they shall say: Our Lord! place us not with the unjust\n",
        "TRANSLATION_7": "And when their eyes are turned towards the inhabitants of the Fire they shall say, 'Our Lord, do not Thou assign us with the people of the evildoers.'\n",
        "TRANSLATION_8": "And when their eyes are turned toward the dwellers of the Fire, they say: Our Lord! Place us not with the wrong-doing folk.\n",
        "TRANSLATION_9": "and when they turn their eyes towards the inmates of the Fire, they will say, \"Our Lord, do not include us among the wrongdoers!\"\n",
        "TRANSLATION_10": "And when their eyes Will be turned toward the fellows of the Fire, they will say: our Lord! place us not with these wrong-doing people.\n",
        "TRANSLATION_11": "And when their look is turned toward the inmates of the Fire, they will say, ‘Our Lord, do not put us among the wrongdoing lot!’)\n",
        "TRANSLATION_12": "When their eyes shall be turned towards the Companions of the Fire, they will say: \"Our Lord! send us not to the company of the wrong-doers.\"\n",
        "TRANSLATION_13": "And when their eyes will be turned towards the dwellers of the Fire, they will say: \"Our Lord! Place us not with the people who are Zalimun (polytheists and wrong-doers).\"\n",
        "TRANSLATION_14": "And when they turn their eyes towards the companions of the Fire, they will say: 'Lord, do not cast us among the harmdoers'\n",
        "TRANSLATION_15": "And when their eyes are directed towards the inmates of the Fire, they will say, “Our Lord, do not place us among the wrongdoing people.”\n",
        "TRANSLATION_16": "And when their eyes are turned toward the companions of the Fire, they say, \"Our Lord, do not place us with the wrongdoing people.\"\n",
        "TRANSLATION_17": "[7:47] And when their eyes, those of the men of the Heights, are turned towards, in the direction of, the inhabitants of the Fire, they shall say, ‘Our Lord, do not assign us, to the Fire, with the evildoing folk’.\n",
        "TRANSLATION_18": "(And when their eyes are turned towards) when they look at (the dwellers of the Fire, they say: Our Lord!) our Lord (Place us not with the wrong-doing folk) with the disbelievers in hell.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:47",
            "23:94",
            "28:21",
            "10:85",
            "40:6",
            "29:30",
            "2:39",
            "26:117",
            "7:36",
            "50:12"
        ],
        "BIBLE": [
            "prophets:jonah:1:7",
            "prophets:jeremiah:30:18",
            "torah:genesis:13:14",
            "torah:numbers:14:43",
            "writings:daniel:11:19",
            "prophets:i%20kings:8:35",
            "prophets:judges:18:3",
            "torah:genesis:19:2",
            "writings:ii%20chronicles:6:26",
            "prophets:ii%20kings:6:6"
        ]
    }
}