{
    "VERSE": "7:52",
    "ARABIC": "وَلَقَدْ جِئْنَٰهُم بِكِتَٰبٍ فَصَّلْنَٰهُ عَلَىٰ عِلْمٍ هُدًى وَرَحْمَةً لِّقَوْمٍ يُؤْمِنُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "We have brought them a Book elucidating everything with knowledge, as guidance and a mercy for people who have iman.",
        "TRANSLATION_1": "Indeed We had brought to them a Book distinct, replete with knowledge, and guidance and grace for men who believe.\n",
        "TRANSLATION_2": "Surely We have brought them a Book which We expounded with knowledge; a guidance and a mercy to those who believe '\n",
        "TRANSLATION_3": "We have revealed the Book of guidance and mercy to the believers and We know all of its details.\n",
        "TRANSLATION_4": "And indeed We brought to them a Book, which We have explained in detail with a great knowledge – a guidance and a mercy for people who believe.\n",
        "TRANSLATION_5": "Certainly, We have brought to them a Book (the Qur'an) which We have explained in detail with knowledge, a guidance and a mercy to a people who believe.\n",
        "TRANSLATION_6": "And certainly We have brought them a Book which We have made clear with knowledge, a guidance and a mercy for a people who believe.\n",
        "TRANSLATION_7": "And We have brought to them a Book that We have well distinguished, resting on knowledge, a guidance and a mercy unto a people that believe.\n",
        "TRANSLATION_8": "Verily We have brought them a Scripture which We expounded with knowledge, a guidance and a mercy for a people who believe.\n",
        "TRANSLATION_9": "And surely We have brought them a Book which We have expounded with knowledge, a guide and a mercy for those who believe.\n",
        "TRANSLATION_10": "And assuredly We have brought unto them a book which We have detailed according to knowledge a guidance and, mercy unto a people who believe.\n",
        "TRANSLATION_11": "Certainly We have brought them a Book, which We have elaborated with knowledge, as a guidance and mercy for a people who have faith.\n",
        "TRANSLATION_12": "For We had certainly sent unto them a Book, based on knowledge, which We explained in detail,- a guide and a mercy to all who believe.\n",
        "TRANSLATION_13": "Certainly, We have brought to them a Book (the Quran) which We have explained in detail with knowledge, - a guidance and a mercy to a people who believe.\n",
        "TRANSLATION_14": "We have brought to them a Book which We have made plain based upon knowledge, a guidance and a mercy to believers.\n",
        "TRANSLATION_15": "We have given them a Scripture, which We detailed with knowledge—guidance and mercy for people who believe.\n",
        "TRANSLATION_16": "And We had certainly brought them a Book which We detailed by knowledge - as guidance and mercy to a people who believe.\n",
        "TRANSLATION_17": "[7:52] And indeed We have brought them, that is, the people of Mecca, a Book, the Qur’ān, which We have detailed, [which] We have made clear through tidings and the Promise [of reward] and the Threat [of punishment], with knowledge (‘alā ‘ilmin is a circumstantial qualifier, in other words, ‘knowing what has been detailed in it’), a guidance (hudan is [also] a circumstantial qualifier referring to the hā’ [the suffixed pronoun of fassālnā-hu, ‘which We have detailed’]) and a mercy for a people who believe, in it.\n",
        "TRANSLATION_18": "(Verily We have brought them a Scripture) Allah says: We have sent them Muhammad (pbuh) with the Qur'an (which We expound with knowledge) with knowledge from Us; it is also said that this means: We have taught it, (a guidance) from error (and a mercy) from torment (for a people who believe) in Muhammad (pbuh) and the Qur'an.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:52",
            "16:64",
            "28:43",
            "29:51",
            "27:77",
            "45:20",
            "32:23",
            "6:154",
            "44:32",
            "31:3"
        ],
        "BIBLE": [
            "torah:deuteronomy:16:17",
            "prophets:jeremiah:44:20",
            "prophets:i%20kings:13:5",
            "writings:ii%20chronicles:34:14",
            "torah:deuteronomy:32:8",
            "prophets:joshua:21:44",
            "writings:nehemiah:8:8",
            "writings:ii%20chronicles:1:10",
            "torah:genesis:12:20",
            "prophets:i%20kings:3:9"
        ]
    }
}