{
    "VERSE": "7:54",
    "ARABIC": "إِنَّ رَبَّكُمُ ٱللَّهُ ٱلَّذِى خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلْأَرْضَ فِى سِتَّةِ أَيَّامٍ ثُمَّ ٱسْتَوَىٰ عَلَى ٱلْعَرْشِ يُغْشِى ٱلَّيْلَ ٱلنَّهَارَ يَطْلُبُهُۥ حَثِيثًا وَٱلشَّمْسَ وَٱلْقَمَرَ وَٱلنُّجُومَ مُسَخَّرَٰتٍۭ بِأَمْرِهِۦٓ أَلَا لَهُ ٱلْخَلْقُ وَٱلْأَمْرُ تَبَارَكَ ٱللَّهُ رَبُّ ٱلْعَٰلَمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Your Lord is Allah, Who created the heavens and the earth in six days and then settled Himself firmly on the Throne. He covers the day with the night, each pursuing the other urgently; and the sun and moon and stars are subservient to His command. Both creation and command belong to Him. Blessed be Allah, the Lord of all the worlds.",
        "TRANSLATION_1": "Surely your Lord is God who created the heavens and the earth in six spans of time, then assumed all power. He covers up the day with night which comes chasing it fast; and the sun and moon and the stars are subject to His command. It is His to create and enjoin. Blessed be God, the Lord of all the worlds.\n",
        "TRANSLATION_2": "Surely your Lord is none other than Allah, Who created the heavens and the earth in six days, and then ascended His Throne; Who causes the night to cover the day and then the day swiftly pursues the night; Who created the sun and the moon and the stars making them all subservient to His command. Lo! His is the creation and His is the command. Blessed is Allah, the Lord of the universe.\n",
        "TRANSLATION_3": "Your Lord is God who established His dominion over the Throne (of the realm) after having created the heavens and the earth in six days. He made the night darken the day which it pursues at a (considerable) speed and He made the sun and the moon submissive to His command. Is it not He Who creates and governs all things? Blessed is God, the Cherisher of the Universe.\n",
        "TRANSLATION_4": "Indeed your Lord is Allah Who created the heavens and the earth in six days, then in the manner befitting His Majesty, ascended the Throne (of control); He covers the night with the day, which hastily follows it, and made the sun and the moon and the stars subservient to His command; pay heed! Only He has the power to create and command; Most Auspicious (Propitious) is Allah, the Lord Of The Creation.\n",
        "TRANSLATION_5": "Indeed, your Lord is Allah, Who created the heavens and the earth in Six Days, and then He rose over (Istawa) the Throne. He brings the night as a cover over the day, seeking it rapidly, and (He created) the sun, the moon, the stars subjected to His command. Surely, His is the creation and commandment. Blessed is Allah, the Lord of all that exists!\n",
        "TRANSLATION_6": "Surely your Lord is Allah, Who created the heavens and the earth in six periods of time, and He is firm in power; He throws the veil of night over the day, which it pursues incessantly; and (He created) the sun and the moon and the stars, made subservient by His command; surely His is the creation and the command; blessed is Allah, the Lord of the worlds.\n",
        "TRANSLATION_7": "Surely your Lord is God, who created the heavens and the earth in six days -- then sat Himself upon the Throne, covering the day with the night it pursues urgently -- and the sun, and the moon, and the stars subservient, by His command. Verily, His are the creation and the command. Blessed be God, the Lord of all Being.\n",
        "TRANSLATION_8": "Lo! your Lord is Allah Who created the heavens and the earth in six Days, then mounted He the Throne. He covereth the night with the day, which is in haste to follow it, and hath made the sun and the moon and the stars subservient by His command. His verily is all creation and commandment. Blessed be Allah, the Lord of the Worlds!\n",
        "TRANSLATION_9": "Your Lord is God, who created the heavens and the earth in six Days [periods] and then settled Himself firmly on the throne. He throws the veil of night over the day, each seeking the other in rapid succession. It was He who created the sun, the moon and the stars, and made them subservient to His will. His is the creation, His the command. Blessed be God, Lord of the universe!\n",
        "TRANSLATION_10": "Verily your Lord is Allah who created the heavens and the earth in six days, then established Himself on the Throne, making the night cover the day, seeking it swiftly, and created the sun and the moon and the stars subjected to service by His command. Lo! His is the creation and the command. Blessed is Allah, the Lord of the worlds.\n",
        "TRANSLATION_11": "Indeed your Lord is Allah, who created the heavens and the earth in six days, and then settled on the Throne. He draws the night’s cover over the day, which pursues it swiftly, and [He created] the sun, the moon, and the stars, [all of them] disposed by His command. Look! All creation and command belong to Him. Blessed is Allah, the Lord of all the worlds.\n",
        "TRANSLATION_12": "Your Guardian-Lord is Allah, Who created the heavens and the earth in six days, and is firmly established on the throne (of authority): He draweth the night as a veil o'er the day, each seeking the other in rapid succession: He created the sun, the moon, and the stars, (all) governed by laws under His command. Is it not His to create and to govern? Blessed be Allah, the Cherisher and Sustainer of the worlds!\n",
        "TRANSLATION_13": "Indeed your Lord is Allah, Who created the heavens and the earth in Six Days, and then He Istawa (rose over) the Throne (really in a manner that suits His Majesty). He brings the night as a cover over the day, seeking it rapidly, and (He created) the sun, the moon, the stars subjected to His Command. Surely, His is the Creation and Commandment. Blessed be Allah, the Lord of the 'Alamin (mankind, jinns and all that exists)!\n",
        "TRANSLATION_14": "Your Lord is Allah, who, in six days created the heavens and the earth, and then willed to the Throne. He throws the veil of night over the day. Swiftly they follow one another. The sun, the moon, and the stars are compelled to His order. His is the creation, His is the command. Blessed is Allah, the Lord of the Worlds.\n",
        "TRANSLATION_15": "Your Lord is God; He who created the heavens and the earth in six days, then established Himself on the Throne. The night overtakes the day, as it pursues it persistently; and the sun, and the moon, and the stars are subservient by His command. His is the creation, and His is the command. Blessed is God, Lord of all beings.\n",
        "TRANSLATION_16": "Indeed, your Lord is Allah, who created the heavens and earth in six days and then established Himself above the Throne. He covers the night with the day, [another night] chasing it rapidly; and [He created] the sun, the moon, and the stars, subjected by His command. Unquestionably, His is the creation and the command; blessed is Allah, Lord of the worlds.\n",
        "TRANSLATION_17": "[7:54] Surely your Lord is God, Who created the heavens and the earth in six days, of the days of this world, that is to say, in the equivalent thereof, since there was no sun then. Had He willed He could have created them in an instant; but the reason for His not having done so is that He wanted to teach His creatures to be circumspect; then presided upon the Throne, a presiding befitting of Him (al-‘arsh, ‘throne’, in the [classical] language is the elevated seat on which a king sits). He cloaks (read yughshī or yughashshī) the night with the day, that is, He covers each one with the other: each following the other in swift pursuit — and the sun and the moon and the stars (if all of these are read in the accusative, then they constitute a supplement to al-samāwāt, ‘the heavens’, and if in the nominative, then they constitute the subject of the sentence, the predicate of which follows) have been made subservient, [have been] subdued, by His command, by His power. Verily, His is, all, creation and the command, in its entirety. Blessed, Magnified, be God, the Lord, the Master, of the Worlds!\n",
        "TRANSLATION_18": "(Lo! your Lord is Allah Who created the heavens and the earth in six Days) of the beginning of the life of this world, each day the equivalent of a thousand years, (then mounted He the Throne) then He proceeded to create the Throne; it is also said that this means: He seated Himself on the Throne. (He covereth the night with the day) and the day with the night, (which is in haste to follow it) i.e. the day is in haste to follow the night and the night is in haste to follow the day, (and hath made the sun and the moon and the stars subservient by His command) by His leave. (His verily is all creation) the creation of the heavens and the earth (and commandment) i.e. the judgement of people on the Day of Judgement (Blessed be Allah) the Possessor of grace; it is also said that this means: elevated is Allah; as it is said that this means: far exalted is Allah, (the Lord of the Worlds!) the Master and Disposer of the Worlds.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:54",
            "57:4",
            "10:3",
            "16:12",
            "13:2",
            "32:4",
            "10:6",
            "24:64",
            "39:5",
            "25:59"
        ],
        "BIBLE": [
            "writings:daniel:6:13",
            "prophets:judges:19:9",
            "prophets:ezekiel:32:7",
            "writings:daniel:6:8",
            "torah:exodus:36:5",
            "prophets:joshua:1:8",
            "torah:deuteronomy:28:13",
            "prophets:isaiah:45:18",
            "prophets:ii%20samuel:23:5",
            "torah:deuteronomy:32:35"
        ]
    }
}