{
    "VERSE": "7:55",
    "ARABIC": "ٱدْعُوا۟ رَبَّكُمْ تَضَرُّعًا وَخُفْيَةً إِنَّهُۥ لَا يُحِبُّ ٱلْمُعْتَدِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Call on your Lord humbly and secretly. He does not love those who overstep the limits.",
        "TRANSLATION_1": "Pray to your Lord in humility and unseen. He does not love the iniquitous.\n",
        "TRANSLATION_2": "Call upon your Lord with humility and in secret. Surely He does not love transgressors.\n",
        "TRANSLATION_3": "Pray to your Lord humbly and privately. God does not love the transgressors.\n",
        "TRANSLATION_4": "Pray to your Lord crying humbly, and softly; indeed He does not love the transgressors.\n",
        "TRANSLATION_5": "Invoke your Lord Tadarru`an and Khufyah. He likes not the aggressors.\n",
        "TRANSLATION_6": "Call on your Lord humbly and secretly; surely He does not love those who exceed the limits.\n",
        "TRANSLATION_7": "Call on your Lord, humbly and secretly; He loves not transgressors.\n",
        "TRANSLATION_8": "(O mankind!) Call upon your Lord humbly and in secret. Lo! He loveth not aggressors.\n",
        "TRANSLATION_9": "Call on your Lord with humility and in secret, He does not love the transgressors:\n",
        "TRANSLATION_10": "Call on Your Lord in humility and in secrecy; verily He approveth not the trespassers.\n",
        "TRANSLATION_11": "Supplicate your Lord, beseechingly and secretly. Indeed, He does not like the transgressors.\n",
        "TRANSLATION_12": "Call on your Lord with humility and in private: for Allah loveth not those who trespass beyond bounds.\n",
        "TRANSLATION_13": "Invoke your Lord with humility and in secret. He likes not the aggressors.\n",
        "TRANSLATION_14": "Supplicate to your Lord with humility and in secret. He does not love the transgressors.\n",
        "TRANSLATION_15": "Call upon your Lord humbly and privately. He does not love the aggressors.\n",
        "TRANSLATION_16": "Call upon your Lord in humility and privately; indeed, He does not like transgressors.\n",
        "TRANSLATION_17": "[7:55] Call upon your Lord humbly (tadarru‘an is a circumstantial qualifier), in subservience, and quietly, in secret. Truly, He loves not the aggressors, who are braggarts and loud-mouthed in [their] supplications.\n",
        "TRANSLATION_18": "((0 mankind!) Call upon your Lord humbly) openly (and in secret) it is also said that this means: call upon your Lord humbly and out of fear. (Lo! He loveth not aggressors) in their supplications, by calling for that which is not permissible for them against the righteous.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:55",
            "19:3",
            "21:89",
            "43:62",
            "23:118",
            "23:29",
            "40:27",
            "5:87",
            "72:20",
            "26:192"
        ],
        "BIBLE": [
            "writings:psalms:116:4",
            "prophets:isaiah:55:6",
            "prophets:judges:16:28",
            "writings:daniel:9:19",
            "writings:psalms:130:1",
            "torah:genesis:3:9",
            "writings:lamentations:3:55",
            "torah:exodus:10:16",
            "writings:psalms:31:18",
            "writings:daniel:9:18"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:5",
            
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:4:12"
        ]
    }
}