{
    "VERSE": "7:56",
    "ARABIC": "وَلَا تُفْسِدُوا۟ فِى ٱلْأَرْضِ بَعْدَ إِصْلَٰحِهَا وَٱدْعُوهُ خَوْفًا وَطَمَعًا إِنَّ رَحْمَتَ ٱللَّهِ قَرِيبٌ مِّنَ ٱلْمُحْسِنِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Do not corrupt the earth after it has been put right. Call on Him fearfully and eagerly. Allah's mercy is close to the good-doers.",
        "TRANSLATION_1": "And do not corrupt the land after it has been reformed; and pray to Him in awe and expectation. The blessing of God is at hand for those who do good.\n",
        "TRANSLATION_2": "Anddo not make mischief in the earth after it has been set in order, and call upon Him with fear and longing. Surely Allah's mercy is close to those who do good.\n",
        "TRANSLATION_3": "Do not destroy the land after it has been well established but pray to God, have fear of Him, and hope to receive His mercy. God's mercy is close to the righteous people.\n",
        "TRANSLATION_4": "And do not spread turmoil in the earth after its reform, and pray to Him with fear and hope; indeed Allah’s mercy is close to the virtuous.\n",
        "TRANSLATION_5": "And do not do mischief on the earth, after it has been set in order, and invoke Him with fear and hope. Surely, Allah's mercy is (ever) near unto the good-doers.\n",
        "TRANSLATION_6": "And do not make mischief in the earth after its reformation, and call on Him fearing and hoping; surely the mercy of Allah is nigh to those who do good (to others).\n",
        "TRANSLATION_7": "Do not corruption in the land, after it has been set, right; and call on Him fearfully, eagerly -- surely the mercy of God is nigh to the good-doers;\n",
        "TRANSLATION_8": "Work not confusion in the earth after the fair ordering (thereof). and call on Him in fear and hope. Lo! the mercy of Allah is nigh unto the good.\n",
        "TRANSLATION_9": "do not spread corruption on the earth after it has been set in order, pray to Him with fear and hope, God's mercy is close to those who do good.\n",
        "TRANSLATION_10": "And act not corruptly in the earth after the good ordering thereof, and call on Him fearing and longing; verily the mercy of Allah is nigh unto the well-doers.\n",
        "TRANSLATION_11": "And do not cause corruption on the earth after its restoration, and supplicate Him with fear and hope: indeed Allah’s mercy is close to the virtuous.\n",
        "TRANSLATION_12": "Do no mischief on the earth, after it hath been set in order, but call on Him with fear and longing (in your hearts): for the Mercy of Allah is (always) near to those who do good.\n",
        "TRANSLATION_13": "And do not do mischief on the earth, after it has been set in order, and invoke Him with fear and hope; Surely, Allah's Mercy is (ever) near unto the good-doers.\n",
        "TRANSLATION_14": "Do not make mischief in the earth after it has been put right. Pray to Him with fear and hope; His Mercy is near to the righteous.\n",
        "TRANSLATION_15": "And do not corrupt on earth after its reformation, and pray to Him with fear and hope. God’s mercy is close to the doers of good.\n",
        "TRANSLATION_16": "And cause not corruption upon the earth after its reformation. And invoke Him in fear and aspiration. Indeed, the mercy of Allah is near to the doers of good.\n",
        "TRANSLATION_17": "[7:56] And work not corruption in the land, through idolatry and acts of disobedience, after it has been set right, as a result of the sending forth of messengers [to it], and call upon Him in fear, of His punishment, and in hope, of His mercy — surely the mercy of God is near to the virtuous, the obedient (qarīb, ‘near’, as the predicate of [the feminine noun] rahma, ‘mercy’, is in the masculine because it [rahma] is annexed to Allāh, ‘God’).\n",
        "TRANSLATION_18": "(Work not confusion) through sins and invitation to other than Allah (in the earth after the fair ordering (thereof)) through obedience and calling to Allah, Exalted is He, (and call on Him) worship Him (in fear) of Him and His torment (and hope) in Him that you shall enter His Paradise. (Lo! the mercy of Allah) the 163 Paradise of Allah (is nigh unto the good) the believers who are good in their words and works.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:56",
            "2:64",
            "30:24",
            "24:55",
            "11:61",
            "7:74",
            "2:27",
            "57:17",
            "35:41",
            "7:128"
        ],
        "BIBLE": [
            "prophets:jeremiah:32:40",
            "torah:deuteronomy:4:25",
            "prophets:ezekiel:26:20",
            "writings:ii%20chronicles:19:3",
            "torah:exodus:34:10",
            "writings:ecclesiastes:9:1",
            "prophets:ezekiel:32:8",
            "writings:ezra:10:11",
            "writings:psalms:74:8",
            "prophets:hosea:11:8"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:7"
        ]
    }
}