{
    "VERSE": "7:58",
    "ARABIC": "وَٱلْبَلَدُ ٱلطَّيِّبُ يَخْرُجُ نَبَاتُهُۥ بِإِذْنِ رَبِّهِۦ وَٱلَّذِى خَبُثَ لَا يَخْرُجُ إِلَّا نَكِدًا كَذَٰلِكَ نُصَرِّفُ ٱلْءَايَٰتِ لِقَوْمٍ يَشْكُرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Good land yields up its plants by its Lord's permission, but that which is bad only yields up scantily. In this way We vary the Signs for people who are thankful.",
        "TRANSLATION_1": "The soil that is good produces (rich) crops by the will of its Lord, and that which is had yields only what is poor. So do We explain Our signs in different ways to people who give thanks.\n",
        "TRANSLATION_2": "As for the good land, vegetation comes forth in abundance by the command of its Lord, whereas from the bad land, only poor vegetation comes forth. Thus do We expound Our signs in diverse ways for a people who are grateful.\n",
        "TRANSLATION_3": "A good land produces plants, by the permission of its Lord, but a wicked land produces only miserable, bitter plants. Thus do We show a variety of evidence for those who give thanks.\n",
        "TRANSLATION_4": "And from the good land comes forth its vegetation by the command of Allah; and from the infertile land, nothing comes forth except a little with difficulty; this is how We explain Our signs in different ways, for people who are thankful.\n",
        "TRANSLATION_5": "The vegetation of a good land comes forth (easily) by the permission of its Lord; and that which is bad, brings forth nothing but (a little) with difficulty. Thus do We explain variously the Ayat for a people who give thanks.\n",
        "TRANSLATION_6": "And as for the good land, its vegetation springs forth (abundantly) by the permission of its Lord, and (as for) that which is inferior (its herbage) comes forth but scantily; thus do We repeat the communications for a people who give thanks.\n",
        "TRANSLATION_7": "And the good land -- its vegetation comes forth by the leave of its Lord, and the corrupt -- it comes forth but scantily. Even so We turn about the signs for a people that are thankful.\n",
        "TRANSLATION_8": "As for the good land, its vegetation cometh forth by permission of its Lord; while as for that which is bad, only the useless cometh forth (from it). Thus do We recount the tokens for people who give thanks.\n",
        "TRANSLATION_9": "Vegetation comes out of good land in abundance by the will of its Lord, but out of bad land only scantily. Thus We explain Our signs in diverse ways for those who give thanks.\n",
        "TRANSLATION_10": "And a good land: its herbage cometh forth by the command of its Lord; and that which is vile, it cometh forth only scantily. In this wise We vary the signs for a people who return thanks.\n",
        "TRANSLATION_11": "The good land—its vegetation comes out by the permission of its Lord, and as for that which is bad, it does not come out except sparsely. Thus do We paraphrase the signs variously for a people who give thanks.\n",
        "TRANSLATION_12": "From the land that is clean and good, by the will of its Cherisher, springs up produce, (rich) after its kind: but from the land that is bad, springs up nothing but that which is niggardly: thus do we explain the signs by various (symbols) to those who are grateful.\n",
        "TRANSLATION_13": "The vegetation of a good land comes forth (easily) by the Permission of its Lord, and that which is bad, brings forth nothing but a little with difficulty. Thus do We explain variously the Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) for a people who give thanks.\n",
        "TRANSLATION_14": "Good land yields its vegetation by the permission of its Lord. While the corrupted yields only the scanty. So We make plain the verses to those who are thankful.\n",
        "TRANSLATION_15": "As for the good land, it yields its produce by the leave of its Lord. But as for the bad, it produces nothing but hardship and misery. Thus We explain the revelations in various ways for people who are thankful.\n",
        "TRANSLATION_16": "And the good land - its vegetation emerges by permission of its Lord; but that which is bad - nothing emerges except sparsely, with difficulty. Thus do We diversify the signs for a people who are grateful.\n",
        "TRANSLATION_17": "[7:58] As for the good land, the one of rich soil, its vegetation comes forth, wholesomely, by permission of its Lord — this is a similitude of the believer who, when he hears an admonition, he [heeds it and] benefits from it. While as for the, one whose soil is, bad — the vegetation in, it comes forth only miserably, laboriously and with difficulty — this is the similitude of the disbeliever. Even, as We have made clear what has been mentioned, so We dispense, We make clear, the signs for a people who are thankful, to God and so believe.\n",
        "TRANSLATION_18": "(As for the good land) which is not a swamp, (its vegetation cometh forth by permission of its Lord) by the will of its Lord without toil or effort, just as the sincere believer fulfils that which Allah commands him to do voluntarily and with the good disposition of his soul; (while as for that which is bad) the bad, swampy land, (only the useless cometh forth (from it)) its vegetation comes forth only with toil and great effort. The hypocrite does not perform that which Allah commands him to do except when compelled and without a good disposition of the soul. (Thus do We recount the tokens) We expound the Qur'an by giving the simile of the believer and the disbeliever (for people who give thanks) for people who believe.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:58",
            "18:105",
            "6:105",
            "3:147",
            "13:7",
            "46:25",
            "23:58",
            "6:126",
            "8:54",
            "25:36"
        ],
        "BIBLE": [
            "prophets:zephaniah:3:20",
            "torah:exodus:23:27",
            "prophets:jeremiah:24:8",
            "prophets:jeremiah:30:3",
            "prophets:i%20kings:8:33",
            "prophets:isaiah:55:11",
            "prophets:hosea:11:11",
            "prophets:amos:9:14",
            "prophets:ezekiel:21:24",
            "writings:ii%20chronicles:6:24"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:4"
        ]
    }
}