{
    "VERSE": "7:61",
    "ARABIC": "قَالَ يَٰقَوْمِ لَيْسَ بِى ضَلَٰلَةٌ وَلَٰكِنِّى رَسُولٌ مِّن رَّبِّ ٱلْعَٰلَمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "He said, 'My people, I am not in error at all but rather am a Messenger from the Lord of all the worlds,",
        "TRANSLATION_1": "I have not gone astray, O my people,\" he said, \"but have been sent by my Lord, the creator of all the worlds.\n",
        "TRANSLATION_2": "He said: 'O my people! There is no error in me, but I am a Messenger from the Lord of the universe.\n",
        "TRANSLATION_3": "(Noah) said, \"My people, I am not in any error, rather I am a Messenger from the Lord of the Universe,\n",
        "TRANSLATION_4": "He said, “O my people! There is no straying in me – I am in fact a Noble Messenger from the Lord Of The Creation.”\n",
        "TRANSLATION_5": "[Nuh] said: \"O my people! There is no error in me, but I am a Messenger from the Lord of all that exists!\n",
        "TRANSLATION_6": "He said: O my people! there is no error in me, but I am an apostle from the Lord of the worlds.\n",
        "TRANSLATION_7": "Said he, 'My people, there is no error in me; but I am a Messenger from the Lord of all Being.'\n",
        "TRANSLATION_8": "He said: O my people! There is no error in me, but I am a messenger from the Lord of the Worlds.\n",
        "TRANSLATION_9": "Said [Noah], \"O my people! I am not in error. Indeed, I am a messenger from the Lord of the Worlds,\n",
        "TRANSLATION_10": "He said: O my people! not with me is the error, but I am an apostle from the Lord of the worlds.\n",
        "TRANSLATION_11": "He said, ‘O my people, I am not in error. Rather, I am an apostle from the Lord of all the worlds.\n",
        "TRANSLATION_12": "He said: \"O my people! No wandering is there in my (mind): on the contrary I am a messenger from the Lord and Cherisher of the worlds!\n",
        "TRANSLATION_13": "[Nuh (Noah)] said: \"O my people! There is no error in me, but I am a Messenger from the Lord of the 'Alamin (mankind, jinns and all that exists)!\n",
        "TRANSLATION_14": "I am not in error, my nation' he replied. 'I am a Messenger from the Lord of the Worlds\n",
        "TRANSLATION_15": "He said, “O my people, I am not in error, but I am a messenger from the Lord of the Worlds.”\n",
        "TRANSLATION_16": "[Noah] said, \"O my people, there is not error in me, but I am a messenger from the Lord of the worlds.\"\n",
        "TRANSLATION_17": "[7:61] He said, ‘My people, there is no error in me (dalāla is more general than al-dalāl, ‘misguidance’, and so to deny it is more effective than to deny the latter), but I am a messenger from the Lord of the Worlds.\n",
        "TRANSLATION_18": "(He said: my people! There is no error) foolishness (in me, but I am a messenger from the Lord of the Worlds) to you.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:61",
            "7:67",
            "7:104",
            "7:79",
            "25:30",
            "28:21",
            "29:30",
            "26:16",
            "26:47",
            "7:121"
        ],
        "BIBLE": [
            "prophets:ezekiel:36:20",
            "torah:numbers:13:31",
            "torah:deuteronomy:27:18",
            "prophets:ii%20kings:3:7",
            "writings:i%20chronicles:17:16",
            "torah:deuteronomy:26:5",
            "prophets:ii%20kings:5:4",
            "prophets:haggai:1:13",
            "prophets:ii%20kings:2:6",
            "prophets:ezekiel:37:21"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:3:6",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:7"
        ]
    }
}