{
    "VERSE": "7:62",
    "ARABIC": "أُبَلِّغُكُمْ رِسَٰلَٰتِ رَبِّى وَأَنصَحُ لَكُمْ وَأَعْلَمُ مِنَ ٱللَّهِ مَا لَا تَعْلَمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "transmitting my Lord's Message to you and giving you good counsel, and I know from Allah what you do not know.",
        "TRANSLATION_1": "I bring to you the messages of my Lord, and give you sincere advice, for I know from God what you do not know.\n",
        "TRANSLATION_2": "I convey to you the messages of my Lord, give you sincere advice, and I know from Allah that which you do not know.\n",
        "TRANSLATION_3": "sent to preach to you the message of my Lord and to give you good advice. I know what you do not know about God.\n",
        "TRANSLATION_4": "“Conveying to you the messages of my Lord and wishing good for you, and I know from Allah what you do not know.”\n",
        "TRANSLATION_5": "I convey unto you the Messages of my Lord and give sincere advice to you. And I know from Allah what you know not.\"\n",
        "TRANSLATION_6": "I deliver to you the messages of my Lord, and I offer you good advice and I know from Allah what you do not know.\n",
        "TRANSLATION_7": "I deliver to you the Messages of my Lord, and I advise you sincerely; for I know from God that you know not.\n",
        "TRANSLATION_8": "I convey unto you the messages of my Lord and give good counsel unto you, and know from Allah that which ye know not.\n",
        "TRANSLATION_9": "I am conveying my Lord's messages to you and giving you sincere advice. I know things from God that you do not.\n",
        "TRANSLATION_10": "I preach unto you the messages of my Lord and I councel you good, and I know from Allah which ye know not.\n",
        "TRANSLATION_11": "I communicate to you the messages of my Lord, and I am your well-wisher, and I know from Allah what you do not know.\n",
        "TRANSLATION_12": "I but fulfil towards you the duties of my Lord's mission: Sincere is my advice to you, and I know from Allah something that ye know not.\n",
        "TRANSLATION_13": "I convey unto you the Messages of my Lord and give sincere advice to you. And I know from Allah what you know not.\n",
        "TRANSLATION_14": "(sent) to convey to you the messages of my Lord and to advise you, for I know from Allah what you do not know.\n",
        "TRANSLATION_15": "“I deliver to you the messages of my Lord, and I advise you, and I know from God what you do not know.”\n",
        "TRANSLATION_16": "I convey to you the messages of my Lord and advise you; and I know from Allah what you do not know.\n",
        "TRANSLATION_17": "[7:62] I convey to you (read ublighkum or uballighukum) the Messages of my Lord, and I am advising you, I desire good [for you], for I know from God what you know not.\n",
        "TRANSLATION_18": "(I convey unto you the messages of my Lord) by explaining commands and prohibition (and give good counsel unto you) I warn against the torment and call you to repentance and faith, (and know from Allah that which ye know not) of torment, if you do not believe.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:62",
            "4:61",
            "5:99",
            "11:34",
            "18:38",
            "57:8",
            "6:106",
            "33:2",
            "2:139",
            "7:68"
        ],
        "BIBLE": [
            "prophets:joshua:23:15",
            "writings:i%20chronicles:29:14",
            "torah:deuteronomy:26:11",
            "writings:ii%20chronicles:13:5",
            "prophets:joshua:23:16",
            "torah:deuteronomy:8:10",
            "prophets:jeremiah:11:18",
            "prophets:ii%20samuel:17:7",
            "prophets:i%20kings:5:18",
            "torah:numbers:18:19"
        ]
    }
}