{
    "VERSE": "7:65",
    "ARABIC": "وَإِلَىٰ عَادٍ أَخَاهُمْ هُودًا قَالَ يَٰقَوْمِ ٱعْبُدُوا۟ ٱللَّهَ مَا لَكُم مِّنْ إِلَٰهٍ غَيْرُهُۥٓ أَفَلَا تَتَّقُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "And to 'Ad We sent their brother Hud, who said, 'My people, worship Allah! You have no other god than Him. So will you not have taqwa?'",
        "TRANSLATION_1": "And We sent Hud, their brother, to the people of 'Ad. He said: \"O you people, worship God, for you have no other god but He. Will you not take heed for yourselves?\"\n",
        "TRANSLATION_2": "And to 'Ad We sent forth their brother Hud. He said: 'O my people! Serve Allah; you have no other god than Him. Will you, then, not avoid evil?'\n",
        "TRANSLATION_3": "We sent Hud to his brethren, the tribe of `Ad, who told them, \"Worship God for He is your only Lord. Will you not become pious?\"\n",
        "TRANSLATION_4": "And We sent Hud to the people of Aad from their own community; he said, “O my people! Worship Allah – you do not have any God except Him; so do you not fear?”\n",
        "TRANSLATION_5": "And to `Ad (the people, We sent) their brother Hud. He said: \"O my people! Worship Allah! You have no other god but Him. Will you then not have Taqwa\"\n",
        "TRANSLATION_6": "And to Ad (We sent) their brother Hud. He said: O my people! serve Allah, you have no god other than Him; will you not then guard (against evil)?\n",
        "TRANSLATION_7": "And to Ad their brother Hood; he said, 'O my people, serve God! You have no god other than He; will you not be godfearing?'\n",
        "TRANSLATION_8": "And unto (the tribe of) A'ad (We sent) their brother, Hud. He said: O my people! Serve Allah. Ye have no other Allah save Him. Will ye not ward off (evil)?\n",
        "TRANSLATION_9": "To the people of 'Ad We sent their brother, Hud. He said, \"O my people, worship God, you have no other god but He. Then will you not be God-fearing?\"\n",
        "TRANSLATION_10": "And unto 'Ad We sent their brothers Hud. He said: O my people! worship Allah, no god ye have but He; Fear ye not?\n",
        "TRANSLATION_11": "And to [the people of] ‘Ad [We sent] Hud, their brother. He said, ‘O my people, worship Allah! You have no other god besides Him. Will you not then be wary [of Him]?’\n",
        "TRANSLATION_12": "To the 'Ad people, (We sent) Hud, one of their (own) brethren: He said: O my people! worship Allah! ye have no other god but Him will ye not fear (Allah)?\"\n",
        "TRANSLATION_13": "And to 'Ad (people, We sent) their brother Hud. He said: \"O my people! Worship Allah! You have no other Ilah (God) but Him. (La ilaha ill-Allah: none has the right to be worshipped but Allah). Will you not fear (Allah)?\"\n",
        "TRANSLATION_14": "And to (the people of) Aad We sent their brother, Hood. He said: 'Worship Allah, my nation, for you have no god except He. Will you not then be cautious'\n",
        "TRANSLATION_15": "And to Aad, their brother Hud. He said, “O my people! Worship God; you have no god other than Him. Will you not take heed?”\n",
        "TRANSLATION_16": "And to the 'Aad [We sent] their brother Hud. He said, \"O my people, worship Allah; you have no deity other than Him. Then will you not fear Him?\"\n",
        "TRANSLATION_17": "[7:65] And, We sent, to, the earlier, ‘Ād their brother Hūd. He said, ‘O my people, worship God, affirm His Oneness! You have no god other than Him. Will you not fear?’, will you [not] fear Him, and so believe?\n",
        "TRANSLATION_18": "164 (And unto (the tribe of) 'Aad) and We sent to 'Aad (their brother) their prophet (Hud. He said: my people! Serve Allah) profess Allah's divine Oneness. (Ye have no other God save Him) save the One to whom I am calling you. (Will ye not ward off (evil)) the worship of other than Him?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:65",
            "11:50",
            "23:23",
            "11:30",
            "11:84",
            "11:61",
            "23:32",
            "11:63",
            "7:59",
            "26:124"
        ],
        "BIBLE": [
            "prophets:joshua:24:19",
            "torah:exodus:3:12",
            "prophets:joshua:24:21",
            "prophets:joshua:24:24",
            "prophets:jeremiah:5:19",
            "prophets:joshua:24:16",
            "torah:exodus:7:16",
            "prophets:joshua:24:22",
            "torah:exodus:9:1",
            "prophets:ii%20kings:17:12"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:13",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:2:5"
        ]
    }
}