{
    "VERSE": "7:66",
    "ARABIC": "قَالَ ٱلْمَلَأُ ٱلَّذِينَ كَفَرُوا۟ مِن قَوْمِهِۦٓ إِنَّا لَنَرَىٰكَ فِى سَفَاهَةٍ وَإِنَّا لَنَظُنُّكَ مِنَ ٱلْكَٰذِبِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "The ruling circle of those of his people who were kafir said, 'We consider you a fool and think you are a liar.'",
        "TRANSLATION_1": "The chiefs of his people who were infidels replied: \"We find you full of folly, and a liar to boot.\"\n",
        "TRANSLATION_2": "The unbelievers among the leading men of his people said: 'Indeed we see you in folly, and consider you to be liars.'\n",
        "TRANSLATION_3": "A group of the unbelievers among his people said, \"You look to us like a fool and we think that you are a liar\".\n",
        "TRANSLATION_4": "The disbelieving leaders of his people said, “Indeed we consider you foolish and think you are a liar.”\n",
        "TRANSLATION_5": "The leaders of those who disbelieved among his people said: \"Verily, we see you in foolishness, and verily, we think you are one of the liars.\"\n",
        "TRANSLATION_6": "The chiefs of those who disbelieved from among his people said: Most surely we see you in folly, and most surely we think you to be of the liars.\n",
        "TRANSLATION_7": "Said the Council of the unbelievers of his people, 'We see thee in folly, and we think that thou art one of the liars.'\n",
        "TRANSLATION_8": "The chieftains of his people, who were disbelieving, said: Lo! we surely see thee in foolishness, and lo! we deem thee of the liars.\n",
        "TRANSLATION_9": "The leading men of his people who refused to acknowledge the truth, said, \"We can see you are a foolish man, and we think you are lying.\"\n",
        "TRANSLATION_10": "The chiefs of those who disbelived among his people said: verily we see thee in folly, and verily we deem thee to be of the liars.\n",
        "TRANSLATION_11": "The elite of his people who were faithless said, ‘Indeed we see you to be in folly, and indeed we consider you to be a liar.’\n",
        "TRANSLATION_12": "The leaders of the Unbelievers among his people said: \"Ah! we see thou art an imbecile!\" and \"We think thou art a liar!\"\n",
        "TRANSLATION_13": "The leaders of those who disbelieved among his people said: \"Verily, we see you in foolishness, and verily, we think you are one of the liars.\"\n",
        "TRANSLATION_14": "The disbelieving assembly of his nation said: 'We see you in foolishness, and think that you are of the liars'\n",
        "TRANSLATION_15": "The elite of his people who disbelieved said, “We see foolishness in you, and we think that you are a liar.”\n",
        "TRANSLATION_16": "Said the eminent ones who disbelieved among his people, \"Indeed, we see you in foolishness, and indeed, we think you are of the liars.\"\n",
        "TRANSLATION_17": "[7:66] The council, those of his people who disbelieved, said: ‘We truly see you in folly, ignorance, and we truly deem you of the liars’, in your Message.\n",
        "TRANSLATION_18": "(The chieftains of his people, who were disbelieving, said: Lo! we surely see thee) Noah (in foolishness) in ignorance, (and lo! we deem thee of the liars) in what you say.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:66",
            "7:90",
            "7:60",
            "7:88",
            "11:38",
            "23:46",
            "10:83",
            "7:109",
            "43:44",
            "7:75"
        ],
        "BIBLE": [
            "prophets:jonah:1:8",
            "torah:numbers:14:15",
            "prophets:isaiah:43:9",
            "torah:numbers:11:16",
            "writings:ruth:4:4",
            "prophets:judges:6:16",
            "prophets:i%20kings:20:42",
            "prophets:i%20kings:20:8",
            "prophets:joshua:2:17",
            "torah:exodus:12:33"
        ]
    }
}