{
    "VERSE": "7:67",
    "ARABIC": "قَالَ يَٰقَوْمِ لَيْسَ بِى سَفَاهَةٌ وَلَٰكِنِّى رَسُولٌ مِّن رَّبِّ ٱلْعَٰلَمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "He said, 'My people, I am by no means a fool, but rather am a Messenger from the Lord of all the worlds,",
        "TRANSLATION_1": "I am not a fool, O people,\" he answered, \"but have been sent by the Lord of all the worlds.\n",
        "TRANSLATION_2": "He said: 'O my people! There is no folly in me; rather I am a Messenger from the Lord of the universe.\n",
        "TRANSLATION_3": "He replied, \"My people, I am not a fool but a Messenger of the Lord of the Universe.\n",
        "TRANSLATION_4": "He said, “O my people! I do not have any concern with foolishness and I am in fact a Noble Messenger from the Lord Of The Creation.”\n",
        "TRANSLATION_5": "(Hud) said: \"O my people! There is no foolishness in me, but (I am) a Messenger from the Lord of all that exists!\n",
        "TRANSLATION_6": "He said: O my people! there is no folly in me, but I am an apostle of the Lord of the worlds.\n",
        "TRANSLATION_7": "Said he, 'My people, there is no folly in me; but I am a Messenger from the Lord of all Being.'\n",
        "TRANSLATION_8": "He said: O my people! There is no foolishness in me, but I am a messenger from the Lord of the Worlds.\n",
        "TRANSLATION_9": "He said, \"My people, I am by no means a fool, but rather am a messenger from the Lord of the Universe,\n",
        "TRANSLATION_10": "He said: O my people! not with me is folly, but I am an apostle from the Lord of the worlds.\n",
        "TRANSLATION_11": "He said, ‘O my people, I am not in folly. Rather, I am an apostle from the Lord of all the worlds.\n",
        "TRANSLATION_12": "He said: \"O my people! I am no imbecile, but (I am) a messenger from the Lord and Cherisher of the worlds!\n",
        "TRANSLATION_13": "(Hud) said: \"O my people! There is no foolishness in me, but (I am) a Messenger from the Lord of the 'Alamin (mankind, jinns and all that exists)!\n",
        "TRANSLATION_14": "My nation, there is no foolishness in me' he replied. 'I am a Messenger of the Lord of the Worlds\n",
        "TRANSLATION_15": "He said, “O my people! There is no foolishness in me, but I am a messenger from the Lord of the Worlds.\n",
        "TRANSLATION_16": "[Hud] said, \"O my people, there is not foolishness in me, but I am a messenger from the Lord of the worlds.\"\n",
        "TRANSLATION_17": "[7:67] He said, ‘O my people, there is no folly in me, but I am a messenger from the Lord of the Worlds.\n",
        "TRANSLATION_18": "(He said: my people; There is no foolishness) ignorance (in me, but I am a messenger from the Lord of the Worlds) to you.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:67",
            "7:61",
            "7:104",
            "7:79",
            "25:30",
            "28:21",
            "29:30",
            "26:16",
            "7:121",
            "26:47"
        ],
        "BIBLE": [
            "prophets:i%20kings:20:4",
            "prophets:joel:2:19",
            "prophets:joshua:24:16",
            "prophets:haggai:2:14",
            "torah:exodus:19:8",
            "writings:esther:7:3",
            "prophets:i%20kings:18:24",
            "prophets:isaiah:14:32",
            "prophets:ezekiel:37:3",
            "writings:daniel:3:25"
        ]
    }
}