{
    "VERSE": "7:68",
    "ARABIC": "أُبَلِّغُكُمْ رِسَٰلَٰتِ رَبِّى وَأَنَا۠ لَكُمْ نَاصِحٌ أَمِينٌ",
    "ENGLISH": {
        "TRANSLATION_0": "transmitting my Lord's Message to you, and I am a faithful counsellor to you.",
        "TRANSLATION_1": "I bring to you the messages of my Lord. I am your sincere friend.\n",
        "TRANSLATION_2": "I convey to you the messages of my Lord, and I give you sincere advice.\n",
        "TRANSLATION_3": "I preach the message of my Lord to you and am a trustworthy advisor for you.\n",
        "TRANSLATION_4": "“I convey to you the messages of my Lord and am your trustworthy well-wisher.”\n",
        "TRANSLATION_5": "I convey unto you the Messages of my Lord, and I am a trustworthy adviser (or well-wisher) for you.\n",
        "TRANSLATION_6": "I deliver to you the messages of my Lord and I am a faithful adviser to you:\n",
        "TRANSLATION_7": "I deliver to you the Messages of my Lord; I am your adviser sincere, faithful.\n",
        "TRANSLATION_8": "I convey unto you the messages of my Lord and am for you a true adviser.\n",
        "TRANSLATION_9": "I am conveying my Lord's messages to you and I am your sincere and honest adviser.\n",
        "TRANSLATION_10": "I preach unto you the messages of my Lord, and I am unto you a counseller faithful.\n",
        "TRANSLATION_11": "I communicate to you the messages of my Lord and I am a trustworthy well-wisher for you.\n",
        "TRANSLATION_12": "I but fulfil towards you the duties of my Lord's mission: I am to you a sincere and trustworthy adviser.\n",
        "TRANSLATION_13": "I convey unto you the Messages of my Lord, and I am a trustworthy adviser (or well-wisher) for you.\n",
        "TRANSLATION_14": "I deliver to you the messages of my Lord and I am your honest adviser.\n",
        "TRANSLATION_15": "“I convey to you the messages of my Lord, and I am a trustworthy adviser to you.”\n",
        "TRANSLATION_16": "I convey to you the messages of my Lord, and I am to you a trustworthy adviser.\n",
        "TRANSLATION_17": "[7:68] I convey to you the Messages of my Lord, and I am your truthful adviser, trustworthy in the Message [I convey].\n",
        "TRANSLATION_18": "(I convey unto you the messages of my Lord) by explaining the commands and prohibitions (and am for you a true adviser) warning you of Allah's torment and calling you to repentance and faith, and I am trustworthy in conveying the message of my Lord. It is also said that this means: you used to consider me a trustworthy person, so how is it that you are now accusing me.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:68",
            "26:178",
            "26:143",
            "26:107",
            "26:125",
            "26:162",
            "7:62",
            "44:18",
            "69:10",
            "36:25"
        ],
        "BIBLE": [
            "prophets:jeremiah:1:8",
            "torah:deuteronomy:31:5",
            "prophets:jeremiah:1:19",
            "prophets:jeremiah:39:18",
            "prophets:jeremiah:32:16",
            "prophets:isaiah:36:20",
            "prophets:ii%20kings:18:35",
            "writings:psalms:143:9",
            "prophets:jeremiah:38:20",
            "writings:psalms:17:13"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:5:1"
        ]
    }
}