{
    "VERSE": "7:69",
    "ARABIC": "أَوَعَجِبْتُمْ أَن جَآءَكُمْ ذِكْرٌ مِّن رَّبِّكُمْ عَلَىٰ رَجُلٍ مِّنكُمْ لِيُنذِرَكُمْ وَٱذْكُرُوٓا۟ إِذْ جَعَلَكُمْ خُلَفَآءَ مِنۢ بَعْدِ قَوْمِ نُوحٍ وَزَادَكُمْ فِى ٱلْخَلْقِ بَصْۜطَةً فَٱذْكُرُوٓا۟ ءَالَآءَ ٱللَّهِ لَعَلَّكُمْ تُفْلِحُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Or are you astonished that a reminder should come to you from your Lord by way of a man among you in order to warn you? Remember when He appointed you successors to the people of Nuh, and increased you greatly in stature. Remember Allah's blessings, so that hopefully you will be successful.'",
        "TRANSLATION_1": "Do you wonder that a warning has come to you from your Lord through a man who is one of you and warns you? Remember, He made you leaders after the people of Noah, and gave you a greater increase in your stature. So think of the favours of God; you may haply be blessed.\"\n",
        "TRANSLATION_2": "Do you wonder that an exhortation should come to you from your Lord through a man from amongst yourselves that he may warn you? And do call to mind when He made you successors after the people of Noah and amply increased you in stature. Remember then the wondrous bounties of Allah, that you may prosper.'\n",
        "TRANSLATION_3": "Does it seem strange to you that a reminder from your Lord should be sent to a man among you so that He may warn you? Recall when God appointed you as successors of the people of Noah and increased your power over other people. Give thanks to God for His blessings so that perhaps you will have everlasting happiness.\"\n",
        "TRANSLATION_4": "“And are you surprised that an advice came to you from your Lord through a man amongst you, so that he may warn you? Remember when He made you the successors of Nooh’s people, and enlarged your bodies; therefore remember Allah’s favours, so that you may attain good.”\n",
        "TRANSLATION_5": "Do you wonder that there has come to you a Reminder (and an advice) from your Lord through a man from among you to warn you And remember that He made you successors (generations after generations) after the people of Nuh and increased you amply in stature. So remember the graces (bestowed upon you) from Allah so that you may be successful.\"\n",
        "TRANSLATION_6": "What! do you wonder that a reminder has come to you from your Lord through a man from among you that he might warn you? And remember when He made you successors after Nuh's people and increased you in excellence in respect of make; therefore remember the benefits of Allah, that you may be successful.\n",
        "TRANSLATION_7": "What, do you wonder that a reminder from your Lord should come to you by the lips of a man from among you? That he may warn you; and remember when He appointed you as successors after the people of Noah, and increased you in stature broadly; remember God's bounties; haply you will prosper.'\n",
        "TRANSLATION_8": "Marvel ye that there should come unto you a Reminder from your Lord by means of a man among you, that he may warn you? Remember how He made you viceroys after Noah's folk, and gave you growth of stature. Remember (all) the bounties of your Lord, that haply ye may be successful.\n",
        "TRANSLATION_9": "Do you find it strange that a Message should come from your Lord, through one of your own men, to warn you? Remember how He made you successors of Noah's people, and increased you greatly in stature. Remember the favours of God, so that you may prosper.\"\n",
        "TRANSLATION_10": "Marvel ye that an admonition from your Lord should come unto you upon a Man from amongst you in order that he may warn you? Remember what time He made you successors after the people, of Nuh, and increased you amply in stature Remember the benefits of Allah, that haply ye may fare well.\n",
        "TRANSLATION_11": "Do you consider it odd that there should come to you a reminder from your Lord through a man from among yourselves, so that he may warn you? Remember when He made you successors after the people of Noah, and increased you vastly in creation. So remember Allah’s bounties so that you may be felicitous.’\n",
        "TRANSLATION_12": "Do ye wonder that there hath come to you a message from your Lord through a man of your own people, to warn you? call in remembrance that He made you inheritors after the people of Noah, and gave you a stature tall among the nations. Call in remembrance the benefits (ye have received) from Allah: that so ye may prosper.\"\n",
        "TRANSLATION_13": "Do you wonder that there has come to you a Reminder (and an advice) from your Lord through a man from amongst you that he may warn you? And remember that He made you successors after the people of Nuh (Noah), and increased you amply in stature. So remember the graces (bestowed upon you) from Allah, so that you may be successful.\"\n",
        "TRANSLATION_14": "Do you wonder that a remembrance should come to you from your Lord to a man from yourselves in order that he may warn you? Remember, that He has made you the heirs of Noah's nation and increased you in broad stature, remember the favors of Allah in order that you prosper'\n",
        "TRANSLATION_15": "“Are you surprised that a reminder has come to you from your Lord, through a man from among you, to warn you? Remember how He made you successors after the people of Noah, and increased you greatly in stature. And remember God’s blessings, so that you may prosper.”\n",
        "TRANSLATION_16": "Then do you wonder that there has come to you a reminder from your Lord through a man from among you, that he may warn you? And remember when He made you successors after the people of Noah and increased you in stature extensively. So remember the favors of Allah that you might succeed.\n",
        "TRANSLATION_17": "[7:69] Or do you marvel that a reminder from your Lord should come to you through, the tongue of, a man from among you, that he may warn you? And remember when He made you vicegerents, on earth, after the people of Noah, and increased your stature in extension, in strength and in height — (the tallest of them   measured 100 feet, the shortest, 60). Remember then God’s bounties, His graces, so that you might prosper’, triumph.\n",
        "TRANSLATION_18": "(Marvel ye) indeed you find it a marvel (that there should come unto you a Reminder) prophethood (from your Lord by means of a man among you) a human being like you, (that he may warn you) of Allah's torment? (Remember how He made you vicegerents after Noah's folk) after the destruction of the people of Noah, (and gave you growth of stature) the virtue of heights and bodies. (Remember (all) the bounties of your Lord) and believe in Him, (that haply ye may be successful) that haply you may escape Allah's wrath and torment.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:69",
            "7:63",
            "7:74",
            "2:258",
            "7:164",
            "5:84",
            "2:67",
            "2:139",
            "29:29",
            "10:85"
        ],
        "BIBLE": [
            "writings:ii%20chronicles:7:3",
            "torah:deuteronomy:16:17",
            "writings:i%20chronicles:29:14",
            "writings:job:42:11",
            "prophets:ezekiel:18:13",
            "prophets:ezekiel:3:20",
            "writings:ezra:3:11",
            "torah:deuteronomy:26:11",
            "prophets:i%20kings:5:21",
            "writings:ecclesiastes:5:18"
        ]
    }
}