{
    "VERSE": "7:7",
    "ARABIC": "فَلَنَقُصَّنَّ عَلَيْهِم بِعِلْمٍ وَمَا كُنَّا غَآئِبِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "We will tell them about it with knowledge. We are never absent.",
        "TRANSLATION_1": "We shall recount (their deeds) to them with knowledge, for We were never absent (and saw all they did).\n",
        "TRANSLATION_2": "Then We shall narrate to them with knowledge the whole account. For surely, We were not away from them.\n",
        "TRANSLATION_3": "We will tell them with absolute certainty (what they had done) for We had never been absent from them (during their lifetime).\n",
        "TRANSLATION_4": "So indeed We shall inform them with Our knowledge and We were not absent.\n",
        "TRANSLATION_5": "Then surely, We shall narrate unto them (their whole story) with knowledge, and indeed We have not been absent.\n",
        "TRANSLATION_6": "Then most certainly We will relate to them with knowledge, and We were not absent.\n",
        "TRANSLATION_7": "and We shall relate to them with knowledge; assuredly We were not absent.\n",
        "TRANSLATION_8": "Then verily We shall narrate unto them (the event) with knowledge, for We were not absent (when it came to pass).\n",
        "TRANSLATION_9": "with full knowledge, We shall tell them what they did, for We have never been away from them.\n",
        "TRANSLATION_10": "Then surely We will recount unto them with knowledge, and We have not been absent.\n",
        "TRANSLATION_11": "Then We will surely recount to them with knowledge, for We had not been absent.\n",
        "TRANSLATION_12": "And verily, We shall recount their whole story with knowledge, for We were never absent (at any time or place).\n",
        "TRANSLATION_13": "Then surely, We shall narrate unto them (their whole story) with knowledge, and indeed We were not absent.\n",
        "TRANSLATION_14": "With knowledge We will narrate to them, for We are never absent.\n",
        "TRANSLATION_15": "We will narrate to them with knowledge, for We were never absent.\n",
        "TRANSLATION_16": "Then We will surely relate [their deeds] to them with knowledge, and We were not [at all] absent.\n",
        "TRANSLATION_17": "[7:7] And We shall narrate to them with knowledge, We shall inform them, with [previous] knowledge, of what they did; for verily We were not absent, when the messengers were conveying [the Message], nor [were We absent] during the time of bygone communities and what they did.\n",
        "TRANSLATION_18": "(Then verily We shall narrate unto them) inform them (with knowledge) with elucidation, (for verily We were not absent) from the conveyance of the messengers and the response of the people (when it came to pass).\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:7",
            "44:32",
            "26:112",
            "26:199",
            "84:23",
            "68:52",
            "43:20",
            "83:33",
            "6:134",
            "3:66"
        ],
        "BIBLE": [
            "prophets:isaiah:16:12",
            "writings:job:8:18",
            "writings:job:20:9",
            "prophets:i%20samuel:23:22",
            "prophets:i%20samuel:3:2",
            "prophets:i%20samuel:23:23",
            "torah:genesis:26:27",
            "prophets:ii%20kings:6:9",
            "torah:deuteronomy:1:31",
            "torah:deuteronomy:11:5"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:3:4"
        ]
    }
}