{
    "VERSE": "7:77",
    "ARABIC": "فَعَقَرُوا۟ ٱلنَّاقَةَ وَعَتَوْا۟ عَنْ أَمْرِ رَبِّهِمْ وَقَالُوا۟ يَٰصَٰلِحُ ٱئْتِنَا بِمَا تَعِدُنَآ إِن كُنتَ مِنَ ٱلْمُرْسَلِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "And they hamstrung the She-Camel, spurning their Lord's command, and said, 'Salih! Bring us what you have promised us if you are one of the Messengers.'",
        "TRANSLATION_1": "Then they hamstrung the she-camel and rebelled against the command of their Lord, and said: \"Bring, O Saleh, on us the affliction you promise, if you are one of the sent ones.\"\n",
        "TRANSLATION_2": "Then they hamstrung the she-camel, disdainfuliy disobeyed the commandment of their Lord, and said: 'O Salih! Bring upon us the scourge with which you threatened us if you are truly a Messenger [of Allah].'\n",
        "TRANSLATION_3": "They then slew the camel and rebelled against the orders of their Lord saying, \" Salih, if you are truly a Messenger, let that torment with which you have threatened us come to pass.\"\n",
        "TRANSLATION_4": "So they hamstrung the she-camel and rebelled against the command of their Lord and said, “O Saleh! Bring upon us what you promise us, if you are a Noble Messenger.”\n",
        "TRANSLATION_5": "So they killed the she-camel and insolently defied the commandment of their Lord, and said: \"O Salih! Bring about your threats if you are indeed one of the Messengers (of Allah).\"\n",
        "TRANSLATION_6": "So they slew the she-camel and revolted against their Lord's commandment, and they said: O Salih! bring us what you threatened us with, if you are one of the apostles.\n",
        "TRANSLATION_7": "So they hamstrung the She-camel and turned in disdain from the commandment of their Lord, saying, 'O Salih, bring us that thou promisest us, if thou art an Envoy.'\n",
        "TRANSLATION_8": "So they hamstrung the she-camel, and they flouted the commandment of their Lord, and they said: O Salih! Bring upon us that thou threatenest if thou art indeed of those sent (from Allah).\n",
        "TRANSLATION_9": "So they hamstrung the she-camel, and insolently defied the commandment of their Lord, saying, \"O Salih! Bring upon us what you threaten us with if you are indeed a messenger.\"\n",
        "TRANSLATION_10": "Then they hamstrung the she camel and disdained the commandment of their Lord, and said: Salih! bring upon us that wherewith thou hast threatened us if thou art in sooth of the sent ones.\n",
        "TRANSLATION_11": "So they hamstrung the She-camel and defied the command of their Lord, and they said, ‘O Salih, bring us what you threaten us with, if you are one of the apostles.’\n",
        "TRANSLATION_12": "Then they ham-strung the she-camel, and insolently defied the order of their Lord, saying: \"O Salih! bring about thy threats, if thou art a messenger (of Allah)!\"\n",
        "TRANSLATION_13": "So they killed the she-camel and insolently defied the Commandment of their Lord, and said: \"O Salih (Saleh)! Bring about your threats if you are indeed one of the Messengers (of Allah).\"\n",
        "TRANSLATION_14": "(Then) they hamstrung the shecamel and defied the order of their Lord, saying to Salih: 'Bring down that which you have promised us if you truly are one of the Messengers'\n",
        "TRANSLATION_15": "So they hamstrung the she-camel, and defied the command of their Lord, and said, “O Saleh, bring upon us what you threaten us with, if you are one of the messengers.”\n",
        "TRANSLATION_16": "So they hamstrung the she-camel and were insolent toward the command of their Lord and said, \"O Salih, bring us what you promise us, if you should be of the messengers.\"\n",
        "TRANSLATION_17": "[7:77] The she-camel was given the water one day and then, another; but they soon tired of this: So they   hamstrung the she-camel — Qudār hamstrung her by their command, killing her with a sword — and flouted the commandment of their Lord, and said, ‘O Sālih, bring upon us that which you promised us, in the way of chastisement for [our] killing it, if you are indeed a messenger’.\n",
        "TRANSLATION_18": "(So they hamstrung) killed (the she-camel, and they flouted the commandment of their Lord) they refused to accept the commands of their Lord with which Salih enjoined them, (and they said: Salih! Bring upon us that which thou threatenest) of torment (if thou art indeed of those sent (from Allah)) they said this out of mockery.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:77",
            "11:66",
            "51:44",
            "42:38",
            "7:75",
            "20:90",
            "17:85",
            "20:70",
            "31:17",
            "15:98"
        ],
        "BIBLE": [
            "prophets:judges:21:3",
            "torah:genesis:12:12",
            "prophets:jeremiah:5:19",
            "prophets:judges:13:12",
            "torah:deuteronomy:9:12",
            "prophets:jeremiah:16:10",
            "prophets:jeremiah:42:4",
            "torah:numbers:11:23",
            "prophets:isaiah:14:24",
            "prophets:zechariah:13:3"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:2:5",
            
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:5:2"
        ]
    }
}