{
    "VERSE": "7:79",
    "ARABIC": "فَتَوَلَّىٰ عَنْهُمْ وَقَالَ يَٰقَوْمِ لَقَدْ أَبْلَغْتُكُمْ رِسَالَةَ رَبِّى وَنَصَحْتُ لَكُمْ وَلَٰكِن لَّا تُحِبُّونَ ٱلنَّٰصِحِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "He turned away from them and said, 'My people, I transmitted my Lord's message to you and gave you good counsel. However, you do not like good counsellors!'",
        "TRANSLATION_1": "Saleh turned away from them and said: \"O my people, I conveyed to you the message of my Lord and warned you; but you do not like those who wish you well.\"\n",
        "TRANSLATION_2": "And Salih left them, saying: 'O my people! I conveyed to you the message of my Lord and gave you good advice; but you have no liking for your well-wishers.'\n",
        "TRANSLATION_3": "He turned away from them saying, \"My people, I preached the Message of my Lord to you and gave you good advice, but you do not love advisors.\"\n",
        "TRANSLATION_4": "Saleh therefore turned away from them and said, “O my people! Indeed I did deliver my Lord’s message to you and wished you good, but you do not want well-wishers.” (The people in the graves can hear the speech of those who are on earth.)\n",
        "TRANSLATION_5": "Then he [Salih] turned from them, and said: \"O my people! I have indeed conveyed to you the Message of my Lord, and have given you good advice, but you like not good advisers.\"\n",
        "TRANSLATION_6": "Then he turned away from them and said: O my people I did certainly deliver to you the message of my Lord, and I gave you good advice, but you do not love those who give good advice.\n",
        "TRANSLATION_7": "So he turned his back on them, and said, 'O my people, I have delivered to you the Message of my Lord, and advised you sincerely; but you do not love sincere advisers.'\n",
        "TRANSLATION_8": "And (Salih) turned from them and said: O my people! I delivered my Lord's message unto you and gave you good advice, but ye love not good advisers.\n",
        "TRANSLATION_9": "He left them, saying, \"My people, I delivered my Lord's messages to you and counselled you sincerely, but you do not like sincere advisors.\"\n",
        "TRANSLATION_10": "Then he turned from them, and said: O my people! assuredly delivered unto you the messages of my Lord, and counselled you good, but ye approve not the good counsellors.\n",
        "TRANSLATION_11": "So he abandoned them [to their fate], and said, ‘O my people! Certainly I communicated to you the message of my Lord, and I was your well-wisher, but you did not like well-wishers.’\n",
        "TRANSLATION_12": "So Salih left them, saying: \"O my people! I did indeed convey to you the message for which I was sent by my Lord: I gave you good counsel, but ye love not good counsellors!\"\n",
        "TRANSLATION_13": "Then he [Salih (Saleh)] turned from them, and said: \"O my people! I have indeed conveyed to you the Message of my Lord, and have given you good advice but you like not good advisers.\"\n",
        "TRANSLATION_14": "He turned from them, saying: 'I conveyed to you, my nation the Message of my Lord and gave you counsel; but you had no love for sincere advisers'\n",
        "TRANSLATION_15": "Then he turned away from them, and said, “O my people, I have delivered to you the message of my Lord, and I have advised you, but you do not like those who give advice.”\n",
        "TRANSLATION_16": "And he turned away from them and said, \"O my people, I had certainly conveyed to you the message of my Lord and advised you, but you do not like advisors.\"\n",
        "TRANSLATION_17": "[7:79] So he turned his back on them, Sālih left [them], and said, ‘O my people, I have conveyed to you the Message of my Lord and gave you sincere advice, but you do not love sincere advisers’.\n",
        "TRANSLATION_18": "(And Salih turned on them) Salih left them before they were destroyed (and said: my people! I delivered my Lord's message unto you) explaining the commands and prohibitions (and gave you good advice) I warned you of Allah's torment and called you to repent and believe, (but ye love not good advisers) you do not listen to those who advise you.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:79",
            "7:93",
            "25:30",
            "7:61",
            "23:94",
            "7:67",
            "20:90",
            "28:21",
            "29:30",
            "43:88"
        ],
        "BIBLE": [
            "writings:esther:3:11",
            "torah:deuteronomy:9:23",
            "torah:numbers:11:18",
            "prophets:i%20samuel:30:23",
            "prophets:ii%20samuel:17:7",
            "writings:i%20chronicles:23:25",
            "torah:exodus:17:2",
            "prophets:joshua:22:4",
            "writings:ii%20chronicles:19:6",
            "prophets:jeremiah:44:20"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:2"
        ]
    }
}