{
    "VERSE": "7:80",
    "ARABIC": "وَلُوطًا إِذْ قَالَ لِقَوْمِهِۦٓ أَتَأْتُونَ ٱلْفَٰحِشَةَ مَا سَبَقَكُم بِهَا مِنْ أَحَدٍ مِّنَ ٱلْعَٰلَمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "And Lut, when he said to his people, 'Do you commit an obscenity not perpetrated before you by anyone in all the worlds?",
        "TRANSLATION_1": "And We sent Lot, who said to his people: \"Why do you commit this lecherous act which none in the world has committed before?\n",
        "TRANSLATION_2": "And remember when We sent Lot [as a Messeng to his people and he said to them: 'Do you realize you practise an indecency of which no other people in the world were guilty of before you?\n",
        "TRANSLATION_3": "Lot told his people, \"Why do you commit such indecent acts that have never been committed by anyone before?\n",
        "TRANSLATION_4": "And We sent Lut – when he said to his people, “What! You commit the shameful acts which no one in the creation has ever done before you?”\n",
        "TRANSLATION_5": "And (remember) Lut, when he said to his people: \"Do you commit lewdness such as none preceding you has committed in all of the nations\n",
        "TRANSLATION_6": "And (We sent) Lut when he said to his people: What! do you commit an indecency which any one in the world has not done before you?\n",
        "TRANSLATION_7": "And Lot, when he said to his people, 'What, do you commit such indecency as never any being in all the world committed before you?\n",
        "TRANSLATION_8": "And Lot! (Remember) when he said unto his folk: Will ye commit abomination such as no creature ever did before you?\n",
        "TRANSLATION_9": "We sent Lot, who said to his people, \"How can you commit an abomination such as no one in the world has ever done before you?\n",
        "TRANSLATION_10": "And We sent Lut, when he said unto his people: commit ye an indecency wherewith none hath preceded you in the worlds?\n",
        "TRANSLATION_11": "And Lot, when he said to his people, ‘What! Do you commit an outrage none in the world ever committed before you?!\n",
        "TRANSLATION_12": "We also (sent) Lut: He said to his people: \"Do ye commit lewdness such as no people in creation (ever) committed before you?\n",
        "TRANSLATION_13": "And (remember) Lout (Lot), when he said to his people: \"Do you commit the worst sin such as none preceding you has committed in the 'Alamin (mankind and jinns)?\n",
        "TRANSLATION_14": "And Lot, who said to his nation: 'Do you commit such indecency (sodomy) in a way that no one has preceded you in the worlds?\n",
        "TRANSLATION_15": "And Lot, when he said to his people, “Do you commit lewdness no people anywhere have ever committed before you?”\n",
        "TRANSLATION_16": "And [We had sent] Lot when he said to his people, \"Do you commit such immorality as no one has preceded you with from among the worlds?\n",
        "TRANSLATION_17": "[7:80] And, mention, Lot (Lūtan is substituted by [the following, idh qāla]) when he said to his people, ‘Do you commit abomination, that is, [penetrating] the rears of men, such as no one in all the worlds ever committed before you, humans or jinn?\n",
        "TRANSLATION_18": "(And Lot!) and We sent Lot to his people. (When he said unto his folk: Will ye commit abomination) i.e. sodomy (such as no creature ever did) this act (before you?)\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:80",
            "29:28",
            "27:54",
            "5:20",
            "37:124",
            "9:127",
            "37:85",
            "26:70",
            "46:23",
            "20:79"
        ],
        "BIBLE": [
            "torah:leviticus:20:13",
            "prophets:ezekiel:18:24",
            "prophets:jeremiah:16:10",
            "torah:exodus:34:10",
            "prophets:ezekiel:16:43",
            "writings:ezra:9:11",
            "prophets:ezekiel:33:13",
            "prophets:ezekiel:8:6",
            "prophets:ezekiel:3:20",
            "prophets:jeremiah:31:34"
        ]
    }
}