{
    "VERSE": "7:81",
    "ARABIC": "إِنَّكُمْ لَتَأْتُونَ ٱلرِّجَالَ شَهْوَةً مِّن دُونِ ٱلنِّسَآءِ بَلْ أَنتُمْ قَوْمٌ مُّسْرِفُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "You come with lust to men instead of women. You are indeed a depraved people.'",
        "TRANSLATION_1": "In preference to women you satisfy your lust with men. Indeed you are a people who are guilty of excess.\"\n",
        "TRANSLATION_2": "You approach men lustfully in place of women. You are a people who exceed all bounds.'\n",
        "TRANSLATION_3": "You engage in lustful activities with people instead of women. You have become transgressing people.\n",
        "TRANSLATION_4": "“You lustfully go towards men, instead of women! In fact, you have transgressed the limits.”\n",
        "TRANSLATION_5": "Verily, you practice your lusts on men instead of women. Nay, but you are a people transgressing beyond bounds.\"\n",
        "TRANSLATION_6": "Most surely you come to males in lust besides females; nay you are an extravagant people.\n",
        "TRANSLATION_7": "See, you approach men lustfully instead of women; no, you are a people that do exceed.'\n",
        "TRANSLATION_8": "Lo! ye come with lust unto men instead of women. Nay, but ye are wanton folk.\n",
        "TRANSLATION_9": "You lust after men rather than women! You transgress all bounds!\"\n",
        "TRANSLATION_10": "Verily ye go in lustfully unto men instead of women! Aye! ye are a people extravagant.\n",
        "TRANSLATION_11": "Indeed you come to men with desire instead of women! Indeed, you are a profligate lot.’\n",
        "TRANSLATION_12": "For ye practise your lusts on men in preference to women: ye are indeed a people transgressing beyond bounds.\"\n",
        "TRANSLATION_13": "Verily, you practise your lusts on men instead of women. Nay, but you are a people transgressing beyond bounds (by committing great sins).\"\n",
        "TRANSLATION_14": "You approach men lustfully instead of women. Truly, you are a nation who exceed (in sin)'\n",
        "TRANSLATION_15": "“You lust after men rather than women. You are an excessive people.”\n",
        "TRANSLATION_16": "Indeed, you approach men with desire, instead of women. Rather, you are a transgressing people.\"\n",
        "TRANSLATION_17": "[7:81] Do you (read a-innakum, pronouncing both hamzas, or by not pronouncing the second one, but in both cases inserting an alif between the two; a variant reading has innakum, ‘indeed you … ’) come lustfully to men instead of women? Nay, you are a wanton folk’, transgressing [the bounds], [going] from what is lawful to what is unlawful.\n",
        "TRANSLATION_18": "(Lo! ye come with lust) you find more lust (unto men) in men's behinds (instead of women) instead of the vaginas of women. (Nay, but ye, are wanton folk) in idolatry; you transgress from the lawful to that which is prohibited.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:81",
            "27:55",
            "27:43",
            "36:20",
            "15:62",
            "4:7",
            "18:90",
            "39:15",
            "7:60",
            "29:29"
        ],
        "BIBLE": [
            "torah:genesis:18:18",
            "prophets:ezekiel:8:15",
            "torah:numbers:13:32",
            "prophets:hosea:7:13",
            "torah:numbers:5:6",
            "prophets:habakkuk:2:5",
            "prophets:jeremiah:23:14",
            "prophets:jeremiah:16:10",
            "torah:numbers:14:41",
            "writings:daniel:9:21"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:3:6",
            "Sefer%20Yetzirah:3:5"
        ]
    }
}