{
    "VERSE": "7:82",
    "ARABIC": "وَمَا كَانَ جَوَابَ قَوْمِهِۦٓ إِلَّآ أَن قَالُوٓا۟ أَخْرِجُوهُم مِّن قَرْيَتِكُمْ إِنَّهُمْ أُنَاسٌ يَتَطَهَّرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "The only answer of his people was to say, 'Expel them from your city! They are people who keep themselves pure!'",
        "TRANSLATION_1": "His people made no answer, and only said: \"Drive them out of the city. They profess to be pure.\"\n",
        "TRANSLATION_2": "Their only answer was: 'Banish them from your town. They are a people who pretend to be pure.'\n",
        "TRANSLATION_3": "His people had no answer to his remarks but to tell one another, \"Expel him from our town; he and his people want to purify themselves.\"\n",
        "TRANSLATION_4": "And his people had no answer except to say, “Turn them out of your dwellings; these are people who wish purity!”\n",
        "TRANSLATION_5": "And the answer of his people was only that they said: \"Drive them out of your town, these are indeed men who want to be pure (from sins)!\"\n",
        "TRANSLATION_6": "And the answer of his people was no other than that they said: Turn them out of your town, surely they are a people who seek to purify (themselves).\n",
        "TRANSLATION_7": "And the only answer of his people was that they said, 'Expel them from your city; surely they are folk that keep themselves clean!'\n",
        "TRANSLATION_8": "And the answer of his people was only that they said (one to another): Turn them out of your township. They are folk, forsooth, who keep pure.\n",
        "TRANSLATION_9": "The only answer given by his people was, \"Turn them out of your town. They are people who regard themselves to be pure.\"\n",
        "TRANSLATION_10": "And naught was the answer of his people save that they said: drive themforth from your city, verily they are a people who would be pure!\n",
        "TRANSLATION_11": "But the only answer of his people was that they said, ‘Expel them from your town! They are indeed a puritanical lot.’\n",
        "TRANSLATION_12": "And his people gave no answer but this: they said, \"Drive them out of your city: these are indeed men who want to be clean and pure!\"\n",
        "TRANSLATION_13": "And the answer of his people was only that they said: \"Drive them out of your town, these are indeed men who want to be pure (from sins)!\"\n",
        "TRANSLATION_14": "The only answer of his nation was: 'Expel them from your village. They are people who keep themselves purified'\n",
        "TRANSLATION_15": "And his people's only answer was to say, “Expel them from your town; they are purist people.”\n",
        "TRANSLATION_16": "But the answer of his people was only that they said, \"Evict them from your city! Indeed, they are men who keep themselves pure.\"\n",
        "TRANSLATION_17": "[7:82] And the response of his people was only that they said, ‘Expel them, that is, Lūt and his followers, from your city. Surely they are folk who would be pure!’, from [the abomination of penetrating] the rears of men.\n",
        "TRANSLATION_18": "(And the answer of his people was only that they said (one to another): Turn them out) i.e. Lot and his two daughters: Za'ura and Raytha (of your township. They are folk, forsooth, who keep pure) who avoid the behinds of men and women. 166\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:82",
            "27:56",
            "29:24",
            "29:29",
            "15:62",
            "26:208",
            "34:34",
            "51:32",
            "43:54",
            "15:58"
        ],
        "BIBLE": [
            "prophets:jeremiah:44:20",
            "prophets:ii%20kings:9:15",
            "prophets:ezekiel:3:20",
            "prophets:ii%20kings:4:43",
            "prophets:i%20samuel:11:3",
            "writings:song%20of%20songs:5:6",
            "writings:psalms:86:16",
            "torah:genesis:3:12",
            "prophets:isaiah:65:1",
            "writings:i%20chronicles:23:25"
        ]
    }
}