{
    "VERSE": "7:84",
    "ARABIC": "وَأَمْطَرْنَا عَلَيْهِم مَّطَرًا فَٱنظُرْ كَيْفَ كَانَ عَٰقِبَةُ ٱلْمُجْرِمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "We rained down a rain upon them. See the final fate of the evildoers!",
        "TRANSLATION_1": "And We rained down on them a shower (of Stones). So witness the end of sinners!\n",
        "TRANSLATION_2": "and We let loose a shower [of stones] upon them, Observe, then, the end of the evil-doers.\n",
        "TRANSLATION_3": "We sent a torrential rain unto the (unbelievers). Consider how disastrous the end of the criminals was!\n",
        "TRANSLATION_4": "And We rained a shower (of stones) upon them; therefore see what sort of fate befell the culprits!\n",
        "TRANSLATION_5": "And We rained down on them a rain (of stones). Then see what was the end of the criminals.\n",
        "TRANSLATION_6": "And We rained upon them a rain; consider then what was the end of the guilty.\n",
        "TRANSLATION_7": "And We rained down upon them a rain; so behold thou, how was the end of the sinners!\n",
        "TRANSLATION_8": "And We rained a rain upon them. See now the nature of the consequence of evil-doers!\n",
        "TRANSLATION_9": "We rained down on them a shower [of brimstone]. Then see what was the end of the evil-doers.\n",
        "TRANSLATION_10": "And We rained upon them a rain. So behold! what like was the end of the sinners.\n",
        "TRANSLATION_11": "Then We poured down upon them a rain [of stones]. So observe how was the fate of the guilty!\n",
        "TRANSLATION_12": "And we rained down on them a shower (of brimstone): Then see what was the end of those who indulged in sin and crime!\n",
        "TRANSLATION_13": "And We rained down on them a rain (of stones). Then see what was the end of the Mujrimun (criminals, polytheists, sinners, etc.).\n",
        "TRANSLATION_14": "and We rained down upon them a rain. So look how was the end of the evildoers.\n",
        "TRANSLATION_15": "And We rained down on them a rain; note the consequences for the sinners.\n",
        "TRANSLATION_16": "And We rained upon them a rain [of stones]. Then see how was the end of the criminals.\n",
        "TRANSLATION_17": "[7:84] And We rained upon them a rain, the stones of baked clay (hijārat al-sijjīl), and it destroyed them. So behold what was the end of the sinners!\n",
        "TRANSLATION_18": "(And We rained a rain upon them) We sent down upon their travellers and homosexuals stones from heaven. (See now) Muhammad (the nature of the consequence for evil-doers!) the end result of the idolaters is destruction.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:84",
            "43:25",
            "37:73",
            "28:40",
            "27:58",
            "26:173",
            "27:69",
            "6:11",
            "27:51",
            "27:14"
        ],
        "BIBLE": [
            "writings:psalms:119:96",
            "prophets:i%20kings:8:8",
            "prophets:jeremiah:51:63",
            "writings:ii%20chronicles:5:9",
            "torah:exodus:33:13",
            "torah:deuteronomy:28:64",
            "writings:psalms:35:22",
            "writings:nehemiah:3:34",
            "prophets:i%20kings:6:18",
            "torah:deuteronomy:29:16"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:4:4"
        ]
    }
}