{
    "VERSE": "7:85",
    "ARABIC": "وَإِلَىٰ مَدْيَنَ أَخَاهُمْ شُعَيْبًا قَالَ يَٰقَوْمِ ٱعْبُدُوا۟ ٱللَّهَ مَا لَكُم مِّنْ إِلَٰهٍ غَيْرُهُۥ قَدْ جَآءَتْكُم بَيِّنَةٌ مِّن رَّبِّكُمْ فَأَوْفُوا۟ ٱلْكَيْلَ وَٱلْمِيزَانَ وَلَا تَبْخَسُوا۟ ٱلنَّاسَ أَشْيَآءَهُمْ وَلَا تُفْسِدُوا۟ فِى ٱلْأَرْضِ بَعْدَ إِصْلَٰحِهَا ذَٰلِكُمْ خَيْرٌ لَّكُمْ إِن كُنتُم مُّؤْمِنِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "And to Madyan We sent their brother Shu'ayb who said, 'My people, worship Allah! You have no other god than Him. A Clear Sign has come to you from your Lord. Give full measure and full weight. Do not diminish people's goods. Do not cause corruption in the land after it has been put right. That is better for you if you are muminun.",
        "TRANSLATION_1": "Remember, We sent to Midian their brother Shu'aib. \"O you people,\" he said, \"worship God, for you have no other god but He. Clear proof has come to you from your Lord; so give in full measure and full weight; do not keep back from people what is theirs, and do not corrupt the land after it has been reformed. This is best for you if you believe.\n",
        "TRANSLATION_2": "And to Midian We sent forth their brother Shu'ayb He exhorted them: O my people! Serve Allah, you have no god but Him. Indeed a clear proof has come to you from your Lord. So give just weight and measure and diminish not to men their things ' and make no mischief on the earth after it has been set in good order. That is to your own good, if you truly believe.\n",
        "TRANSLATION_3": "We sent to the people of Midian their brother Shu'ayb who also told his people to worship God their only Lord. He said, \"A guidance has come to you from your Lord. Maintain proper measures and weights in trade. Do not cause any deficiency in people's property or destroy the land after it has been reformed. This is for your own good, if you have any faith.\n",
        "TRANSLATION_4": "And We sent Shuaib to Madyan from their community; he said, “O my people! Worship Allah – you do not have any God except Him; indeed a clear proof has come to you from your Lord, so measure and weigh in full and do not give the people their goods diminished, and do not spread turmoil in the earth after it is organised; this is for your good, if you believe.”\n",
        "TRANSLATION_5": "And to (the people of) Madyan, (We sent) their brother Shu`ayb. He said: \"O my people! Worship Allah! You have no other God but Him. Verily, a clear proof (sign) from your Lord has come unto you; so give full measure and full weight and wrong not men in their things, and do not do mischief on the earth after it has been set in order, that will be better for you, if you are believers.\n",
        "TRANSLATION_6": "And to Madyan (We sent) their brother Shu'aib. He said: O my people! serve Allah, you have no god other than Him; clear proof indeed has come to you from your Lord, therefore give full measure and weight and do not diminish to men their things, and do not make mischief in the land after its reform; this is better for you if you are believers:\n",
        "TRANSLATION_7": "And to Midian their brother Shuaib; he said, 'O my people, serve God! You have no god other than He; there has now come to you a clear sign from your Lord. So fill up the measure and the balance, and diminish not the goods of the people; and do not corruption in the land, after it has been set right; that is better for you, if you are believers.\n",
        "TRANSLATION_8": "And unto Midian (We sent) their brother, Shu'eyb. He said: O my people! Serve Allah. Ye have no other Allah save Him. Lo! a clear proof hath come unto you from your Lord; so give full measure and full weight and wrong not mankind in their goods, and work not confusion in the earth after the fair ordering thereof. That will be better for you, if ye are believers.\n",
        "TRANSLATION_9": "To Midian We sent their brother Shu'ayb. He said, \"O my people, worship God; you have no other god but Him. A clear Sign has indeed come to you from your Lord. So give full measure and full weight, and do not deliver short. Do not corrupt the land after it has been set in order. This is for your own good, if you are true believers.\n",
        "TRANSLATION_10": "And unto Madyan We sent their brother Shu'aib. He said: O my people! worship Allah, no god ye have buthe; surely there hath come unto you an evidence from your Lord. So give full measure and weight, and defraud not people of their things, and act not corruptly on the earth after the ordering thereof; thatis best for you if ye be believers.\n",
        "TRANSLATION_11": "And to [the people of] Midian [We sent] Shu‘ayb, their brother. He said, ‘O my people, worship Allah! You have no other god besides Him. There has certainly come to you a manifest proof from your Lord. Observe fully the measure and the balance, and do not cheat the people of their goods, and do not cause corruption on the earth after its restoration. That is better for you, if you are faithful.\n",
        "TRANSLATION_12": "To the Madyan people We sent Shu'aib, one of their own brethren: he said: \"O my people! worship Allah; Ye have no other god but Him. Now hath come unto you a clear (Sign) from your Lord! Give just measure and weight, nor withhold from the people the things that are their due; and do no mischief on the earth after it has been set in order: that will be best for you, if ye have Faith.\n",
        "TRANSLATION_13": "And to (the people of) Madyan (Midian), (We sent) their brother Shu'aib. He said: \"O my people! Worship Allah! You have no other Ilah (God) but Him. [La ilaha ill-Allah (none has the right to be worshipped but Allah)].\" Verily, a clear proof (sign) from your Lord has come unto you; so give full measure and full weight and wrong not men in their things, and do not mischief on the earth after it has been set in order, that will be better for you, if you are believers.\n",
        "TRANSLATION_14": "And to Midian, their brother Shu'aib. He said: 'Worship Allah, my nation, for you have no god except He. A clear sign has come to you from your Lord. Give just weight, and full measure; and do not diminish the goods of people. Do not corrupt the land after it has been set right, that is best for you, if you are believers.\n",
        "TRANSLATION_15": "And to Median, their brother Shuaib. He said, “O my people, worship God; you have no god other than Him. A clear proof has come to you from your Lord. Give full measure and weight, and do not cheat people out of their rights, and do not corrupt the land once it has been set right. This is better for you, if you are believers.”\n",
        "TRANSLATION_16": "And to [the people of] Madyan [We sent] their brother Shu'ayb. He said, \"O my people, worship Allah; you have no deity other than Him. There has come to you clear evidence from your Lord. So fulfill the measure and weight and do not deprive people of their due and cause not corruption upon the earth after its reformation. That is better for you, if you should be believers.\n",
        "TRANSLATION_17": "[7:85] And, We sent, to Midian their brother Shu‘ayb. He said, ‘O my people, worship God! You have no god other than Him. Verily there has come to you a clear proof, a miracle, from your Lord, to [prove] my truthfulness. So give full measure and weight and do not defraud, diminish [the value of], people’s goods, and do not work corruption in the earth, by way of unbelief and acts of disobedience, after it has been set right, through the sending of messengers [thereto]. That, mentioned, is better for you, if you are believers, [if you are] seekers of faith, so hasten to it.\n",
        "TRANSLATION_18": "(And unto Midian) and We sent to Midian (their brother) their prophet (Shu'ayb. He said: my people! Serve Allah) profess Allah's divine Oneness. (Ye have no other God save Him) save Him in whom I am enjoining you to believe. (Lo! a clear proof) an exposition (hath come unto you from your Lord) regarding Allah's message; (so give full measure and full weight and wrong not mankind in their goods, and work not confusion in the earth) by committing transgressions and calling to other than Allah and by not giving full measure and full weight (after the fair ordering thereof) through acts of obedience, calling to Allah and giving full measure and scale. (That) the profession of Allah's divine Oneness and giving full measure and weight (will be better for you) than that in which you are now, (if ye are believers) in what I say to you.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:85",
            "11:84",
            "7:73",
            "11:61",
            "11:85",
            "7:89",
            "11:63",
            "11:50",
            "29:36",
            "7:65"
        ],
        "BIBLE": [
            "prophets:ii%20kings:4:43",
            "writings:daniel:6:13",
            "prophets:joshua:23:7",
            "torah:exodus:36:6",
            "prophets:joshua:23:16",
            "torah:exodus:34:10",
            "prophets:jeremiah:35:15",
            "writings:ii%20chronicles:14:6",
            "writings:ezra:8:17",
            "prophets:joshua:23:15"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:3:6",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:5"
        ]
    }
}