{
    "VERSE": "7:88",
    "ARABIC": "قَالَ ٱلْمَلَأُ ٱلَّذِينَ ٱسْتَكْبَرُوا۟ مِن قَوْمِهِۦ لَنُخْرِجَنَّكَ يَٰشُعَيْبُ وَٱلَّذِينَ ءَامَنُوا۟ مَعَكَ مِن قَرْيَتِنَآ أَوْ لَتَعُودُنَّ فِى مِلَّتِنَا قَالَ أَوَلَوْ كُنَّا كَٰرِهِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "The ruling circle of those of his people who were arrogant said, 'We will drive you out of our city, Shu'ayb, you and those who have iman along with you, unless you return to our religion.' He said, 'What, even though we detest it?",
        "TRANSLATION_1": "The arrogant leaders of the people replied: \"We shall drive you away from our land, O Shu'aib, and those who are with you, unless you come back to your faith.\" But he remarked: \"Even if we are disgusted with it?\n",
        "TRANSLATION_2": "The haughty elders of his people said: 'O Shu'ayb! We shall certainly banish you and your companions-in-faith from our town, or else you shall return to our faith.' Shu'ayb said: 'What! Even though we abhor [your faith]?\n",
        "TRANSLATION_3": "A proud group among Shu'ayb's people said, \"We must expel you (Shu'ayb) and your followers from our town unless you give-up your faith and live as our own people.\" Shu'ayb asked them, \"Will you use force against us?\n",
        "TRANSLATION_4": "The proud leaders of his people said, “O Shuaib, we swear we will banish you and the Muslims who are with you, from our town or you must return to our religion”; he said, “Even though we detest it?”\n",
        "TRANSLATION_5": "The chiefs of those who were arrogant among his people said: \"We shall certainly drive you out, O Shu`ayb and those who have believed with you from our town, or else you (all) shall return to our religion.\" He said: \"Even though we hate it\"\n",
        "TRANSLATION_6": "The chiefs, those who were proud from among his people said: We will most certainly turn you out, O Shu'aib, and (also; those who believe with you, from our town, or you shall come back to our faith. He said: What! though we dislike (it)?\n",
        "TRANSLATION_7": "Said the Council of those of his people who waxed proud, 'We will surely expel thee, O Shuaib, and those who believe with thee, from our city, unless you return into our creed.' He said, 'What, even though we detest it?\n",
        "TRANSLATION_8": "The chieftains of his people, who were scornful, said: Surely we will drive thee out, O Shu'eyb, and those who believe with thee, from our township, unless ye return to our religion. He said: Even though we hate it?\n",
        "TRANSLATION_9": "The arrogant leaders of his people said, \"Shu'ayb, we will expel you and your fellow believers from our town unless you return to our faith.\" He said, \"Even though we detest it?\n",
        "TRANSLATION_10": "The chiefs of those who were stiff-necked amongst his people said: surely we shall drive you forth, Shu'aib! and those who have believed with thee from our city, or else ye shall return unto our faith. He said: what! even though we be averse!\n",
        "TRANSLATION_11": "The elite of his people who were arrogant said, ‘O Shu'ayb, we will surely expel you and the faithful who are with you from our town, or else you shall revert to our creed.’ He said, ‘What! Even if we should be unwilling?!\n",
        "TRANSLATION_12": "The leaders, the arrogant party among his people, said: \"O Shu'aib! we shall certainly drive thee out of our city - (thee) and those who believe with thee; or else ye (thou and they) shall have to return to our ways and religion.\" He said: \"What! even though we do detest (them)?\n",
        "TRANSLATION_13": "The chiefs of those who were arrogant among his people said: \"We shall certainly drive you out, O Shu'aib, and those who have believed with you from our town, or else you (all) shall return to our religion.\" He said: \"Even though we hate it!\n",
        "TRANSLATION_14": "The proud assembly of his nation said: 'We will expel you Shu'aib and those who believe with you from our village unless you return to our creed' He replied: 'Even though we hate it?\n",
        "TRANSLATION_15": "The arrogant elite among his people said, “O Shuaib, We will evict you from our town, along with those who believe with you, unless you return to our religion.” He said, “Even if we are unwilling?”\n",
        "TRANSLATION_16": "Said the eminent ones who were arrogant among his people, \"We will surely evict you, O Shu'ayb, and those who have believed with you from our city, or you must return to our religion.\" He said, \"Even if we were unwilling?\"\n",
        "TRANSLATION_17": "[7:88] Said the council of those of his people who were disdainful, of believing: ‘Surely we will expel you, O Shu‘ayb, and those who believe with you, from our city, unless you return to our creed’, our religion (the plural person predominates over the singular in their address [to Shu‘ayb] because Shu‘ayb was never part of their religious community; and so in the same [plural] way he responded:) He said, ‘What, should we return to it, even though we are averse, to it? (the interrogative is meant as a disavowal).\n",
        "TRANSLATION_18": "(The chieftains of his people, who were scornful) towards believing, (said: Surely we will drive you out, Shu'ayb, and those who believe with thee, from our township, unless ye return to) embrace (our religion. He) Jethro (said: Even though we hate it?) would you force us to do this even though we hate it?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:88",
            "7:90",
            "7:66",
            "7:60",
            "23:46",
            "7:75",
            "7:127",
            "21:74",
            "11:30",
            "29:13"
        ],
        "BIBLE": [
            "prophets:ezekiel:18:30",
            "prophets:jeremiah:43:5",
            "torah:deuteronomy:17:16",
            "prophets:jeremiah:25:5",
            "writings:ii%20chronicles:7:14",
            "prophets:hosea:2:25",
            "torah:numbers:22:6",
            "prophets:jeremiah:29:14",
            "prophets:isaiah:12:1",
            "prophets:ezekiel:14:6"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:13",
            "Sefer%20Yetzirah:3:2"
        ]
    }
}