{
    "VERSE": "7:89",
    "ARABIC": "قَدِ ٱفْتَرَيْنَا عَلَى ٱللَّهِ كَذِبًا إِنْ عُدْنَا فِى مِلَّتِكُم بَعْدَ إِذْ نَجَّىٰنَا ٱللَّهُ مِنْهَا وَمَا يَكُونُ لَنَآ أَن نَّعُودَ فِيهَآ إِلَّآ أَن يَشَآءَ ٱللَّهُ رَبُّنَا وَسِعَ رَبُّنَا كُلَّ شَىْءٍ عِلْمًا عَلَى ٱللَّهِ تَوَكَّلْنَا رَبَّنَا ٱفْتَحْ بَيْنَنَا وَبَيْنَ قَوْمِنَا بِٱلْحَقِّ وَأَنتَ خَيْرُ ٱلْفَٰتِحِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "We would be inventing lies against Allah if we returned to your religion after Allah has saved us from it. We could never return to it unless Allah our Lord so willed. Our Lord encompasses everything in His knowledge. We have put our trust in Allah. Our Lord, judge between us and our people with truth. You are the best of judges.'",
        "TRANSLATION_1": "We shall only be guilty of blaspheming God if we accept your way after the people of Noah, and gave you a greater increase in your stature. So think of the favours of God; you may haply be blessed.\"\n",
        "TRANSLATION_2": "If we return to your faith after Allah has delivered us from it we would be fabricating a lie against Allah. nor can we return to it again unless it be by, the will of Allah, our Lord. Our Lord has knowledge of all things, and in Allah we put our trust. Our Lord! Judge rightly between us and our people, for You are the best of those who judge.'\n",
        "TRANSLATION_3": "We would certainly be inventing falsehoods against God if we were to accept your way of life, when God has already saved us from it. We do not have to accept it unless God, our Lord, wills it. Our Lord's knowledge covers all things. We trust in Him and ask Him to judge among us and our people, for He is the best Judge.\"\n",
        "TRANSLATION_4": "“We shall then have fabricated a lie against Allah if we return to your religion after Allah has rescued us from it; and it is not for any of us Muslims to return to your religion except if Allah, Who is our Lord, wills; the knowledge of our Lord encompasses all things; in Allah only we have trusted; our Lord! Decide with justice between us and our people – and Yours is the best decision.”\n",
        "TRANSLATION_5": "We should have invented a lie against Allah if we returned to your religion, after Allah has rescued us from it. And it is not for us to return to it unless Allah, our Lord, should will. Our Lord comprehends all things in His knowledge. In Allah (Alone) we put our trust. Our Lord! Judge between us and our people in truth, for You are the best of those who give judgment.\"\n",
        "TRANSLATION_6": "Indeed we shall have forged a lie against Allah If we go back to your religion after Allah has delivered us from It, and it befits us not that we should go back to it, except if Allah our Lord please: Our Lord comprehends all things in His knowledge; in Allah do we trust: Our Lord! decide between us and our people with truth; and Thou art the best of deciders.\n",
        "TRANSLATION_7": "We should have forged against God a lie if we returned into your creed; after God delivered us from it. It is not for us to return into it, unless God our Lord so will. Our Lord embraces all things in His knowledge. In God we have put our trust. Our Lord, give true deliverance between us and our people; Thou art the best of deliverers.'\n",
        "TRANSLATION_8": "We should have invented a lie against Allah if we returned to your religion after Allah hath rescued us from it. It is not for us to return to it unless Allah our Lord should (so) will. Our Lord comprehendeth all things in knowledge. In Allah do we put our trust. Our Lord! Decide with truth between us and our folk, for Thou art the best of those who make decision.\n",
        "TRANSLATION_9": "We would be inventing lies against God if we returned to your faith after God has delivered us from it. It is not for us to return to it unless God our Lord so willed. Our Lord encompasses all things in His knowledge. We have put our trust in God. Our Lord, expose the truth [and judge] between us and our people, You are the best judge.\"\n",
        "TRANSLATION_10": "We must have been fabricating a lie against Allah if we returned to your faith after Allah hath delivered us therefrom. And it is not for us to return thereunto except that Allah our Lord so willed; everything our Lord comprehendeth in His knowledge; in Allah we place our trust. O our Lord! decide Thou between us and our people with truth, Thou art the Best of the deciders.\n",
        "TRANSLATION_11": "We would be fabricating a lie against Allah should we revert to your creed after Allah had delivered us from it. It does not behoove us to return to it, unless Allah, our Lord, should wish so. Our Lord embraces all things in [His] knowledge. In Allah we have put our trust.’ ‘Our Lord! Judge justly between us and our people, and You are the best of judges!’\n",
        "TRANSLATION_12": "We should indeed invent a lie against Allah, if we returned to your ways after Allah hath rescued us therefrom; nor could we by any manner of means return thereto unless it be as in the will and plan of Allah, Our Lord. Our Lord can reach out to the utmost recesses of things by His knowledge. In the Allah is our trust. our Lord! decide Thou between us and our people in truth, for Thou art the best to decide.\"\n",
        "TRANSLATION_13": "We should have invented a lie against Allah if we returned to your religion, after Allah has rescued us from it. And it is not for us to return to it unless Allah, our Lord, should will. Our Lord comprehends all things in His Knowledge. In Allah (Alone) we put our trust. Our Lord! Judge between us and our people in truth, for You are the Best of those who give judgment.\"\n",
        "TRANSLATION_14": "We would have invented lies about Allah if we returned to your creed from which Allah has saved us, it is not for us that we return into it again except if Allah, our Lord wills. For our Lord has embraced everything with knowledge, and in Allah we have put our trust. Our Lord, open between us and our nation with truth, You are the Best of openers'\n",
        "TRANSLATION_15": "“We would be fabricating falsehood against God, if we were to return to your religion, after God has saved us from it. It is not for us to return to it, unless God, our Lord, wills. Our Lord embraces all things in knowledge. In God we place our trust. Our Lord, decide between us and our people in truth, for You are the Best of Deciders.”\n",
        "TRANSLATION_16": "We would have invented against Allah a lie if we returned to your religion after Allah had saved us from it. And it is not for us to return to it except that Allah, our Lord, should will. Our Lord has encompassed all things in knowledge. Upon Allah we have relied. Our Lord, decide between us and our people in truth, and You are the best of those who give decision.\"\n",
        "TRANSLATION_17": "[7:89] We would be forging a lie against God if we were to return to your creed, after God has delivered us from it. It is not, right, for us to return to it, unless God our Lord wills, that [it be so] and forsakes us. Our Lord embraces all things through His knowledge, that is to say, His knowledge embraces all things, including my situation and yours. In God we have put our trust. Our Lord, decide, adjudicate, between us and our people, for You are the best of deciders’, adjudicators.\n",
        "TRANSLATION_18": "(We should have invented a lie) falsehood (against Allah if we returned to your religion after Allah hath rescued us from it) from your religion. (It is not for us) it is not permissible for us (to return to it) to embrace your religion: associating others with Allah (unless Allah should (so) will) unless Allah takes away the knowledge from our hearts. (Our Lord comprehendeth all things in knowledge) our Lord knows everything. (In Allah do we put our trust. Our Lord!) our Lord! (Decide with truth) with justice (between us and our folk, for Thou art the best of those who make decision) the best of judges.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:89",
            "6:80",
            "6:57",
            "9:115",
            "7:85",
            "5:84",
            "5:117",
            "39:75",
            "4:170",
            "11:57"
        ],
        "BIBLE": [
            "torah:deuteronomy:16:18",
            "prophets:isaiah:55:11",
            "torah:deuteronomy:13:15",
            "writings:ii%20chronicles:14:6",
            "writings:daniel:3:29",
            "prophets:nahum:1:14",
            "prophets:ezekiel:18:13",
            "torah:genesis:3:6",
            "torah:leviticus:10:17",
            "torah:exodus:34:10"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:5"
        ]
    }
}