{
    "VERSE": "7:91",
    "ARABIC": "فَأَخَذَتْهُمُ ٱلرَّجْفَةُ فَأَصْبَحُوا۟ فِى دَارِهِمْ جَٰثِمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "So the earthquake seized them and morning found them lying flattened in their homes.",
        "TRANSLATION_1": "Then they were seized by an earthquake, and lay overturned on the ground in their homes in the morning.\n",
        "TRANSLATION_2": "Thereupon a shocking catastrophe seized them, and they remained prostrate in their dwellings.\n",
        "TRANSLATION_3": "Suddenly, an earthquake struck them and left them motionless in their homes.\n",
        "TRANSLATION_4": "Therefore the earthquake seized them – so at morning they remained lying flattened in their homes.\n",
        "TRANSLATION_5": "So the earthquake seized them and they lay (dead), prostrate in their homes.\n",
        "TRANSLATION_6": "Then the earthquake overtook them, so they became motionless bodies in their abode.\n",
        "TRANSLATION_7": "So the earthquake seized them, and morning found them in their habitation fallen prostrate,\n",
        "TRANSLATION_8": "So the earthquake seized them and morning found them prostrate in their dwelling-place.\n",
        "TRANSLATION_9": "Thereupon an earthquake overtook them and morning found them lying flattened in their homes;\n",
        "TRANSLATION_10": "Whereupon an earthquake laid hold of them: so that they lay prone in their dwelling.\n",
        "TRANSLATION_11": "So the earthquake seized them, and they lay lifeless prostrate in their homes.\n",
        "TRANSLATION_12": "But the earthquake took them unawares, and they lay prostrate in their homes before the morning!\n",
        "TRANSLATION_13": "So the earthquake seized them and they lay (dead), prostrate in their homes.\n",
        "TRANSLATION_14": "So the earthquake seized them, at the morning they were crouched in their dwellings, dead.\n",
        "TRANSLATION_15": "Thereupon, the quake struck them; and they became lifeless bodies in their homes.\n",
        "TRANSLATION_16": "So the earthquake seized them, and they became within their home [corpses] fallen prone.\n",
        "TRANSLATION_17": "[7:91] So the Trembling, the violent earthquake, seized them, and they lay lifeless prostrate in their habitations, keeled over their knees, dead.\n",
        "TRANSLATION_18": "(So the earthquake) and the loud noise announcing their torment (seized them, and morning found them prostrate) dead (in their dwelling-place) in their town and encampments.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:91",
            "7:78",
            "29:37",
            "11:67",
            "38:46",
            "86:17",
            "26:94",
            "18:99",
            "30:15",
            "23:48"
        ],
        "BIBLE": [
            "prophets:i%20samuel:17:49",
            "prophets:ii%20samuel:17:12",
            "prophets:ii%20kings:4:37",
            "prophets:i%20samuel:5:4",
            "prophets:judges:3:25",
            "prophets:i%20samuel:5:3",
            "prophets:i%20samuel:31:4",
            "prophets:ii%20samuel:20:10",
            "prophets:joshua:10:39",
            "prophets:joshua:10:37"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:11"
        ]
    }
}