{
    "VERSE": "7:93",
    "ARABIC": "فَتَوَلَّىٰ عَنْهُمْ وَقَالَ يَٰقَوْمِ لَقَدْ أَبْلَغْتُكُمْ رِسَٰلَٰتِ رَبِّى وَنَصَحْتُ لَكُمْ فَكَيْفَ ءَاسَىٰ عَلَىٰ قَوْمٍ كَٰفِرِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "So he turned away from them and said, 'My people, I transmitted My Lord's message to you and gave you good counsel. Why should I grieve for a kafir people?'",
        "TRANSLATION_1": "So Shu'aib turned away from them and said: \"O people, I conveyed to you the message of my Lord, and warned you. (But you paid no heed). How can I grieve for a people who do not believe?\"\n",
        "TRANSLATION_2": "Shu'ayb then departed from his people, and said: 'O my people! Surely I conveyed to you the message of my Lord, and gave you sincere advice. How, then, can I mourn for a people who refuse to accept the truth?'\n",
        "TRANSLATION_3": "He turned away from them saying, \"My people, I preached the Message of my Lord to you and gave you good advice. How could I be sorry for the unbelievers?\"\n",
        "TRANSLATION_4": "So Shoaib turned away from them saying, “O my people! Indeed I did deliver my Lord’s message to you and gave you sound advice; so why should I grieve for the disbelievers?” (The people in the graves can hear the speech of those who are on earth.)\n",
        "TRANSLATION_5": "Then he (Shu`ayb) turned from them and said: \"O my people! I have indeed conveyed my Lord's Messages unto you and I have given you good advice. Then how can I grieve over people who are disbelievers.\"\n",
        "TRANSLATION_6": "So he turned away from them and said: O my people! certainly I delivered to you the messages of my Lord and I gave you good advice; how shall I then be sorry for an unbelieving people?\n",
        "TRANSLATION_7": "So he turned his back on them, and said, 'O my people, I have delivered to you the Messages of my Lord, and advised you sincerely; how should I grieve for a people of unbelievers?'\n",
        "TRANSLATION_8": "So he turned from them and said: O my people! I delivered my Lord's messages unto you and gave you good advice; then how can I sorrow for a people that rejected (truth)?\n",
        "TRANSLATION_9": "So he turned away from them, saying, \"My people, I delivered my Lord's messages to you and gave you sincere advice, so why should I grieve for people who refused to believe?\"\n",
        "TRANSLATION_10": "Then he turned from them, and said: my people! assuredly I delivered unto you the messages of my Lord, and counselled you good; how then should I lament over an unbelieving people?\n",
        "TRANSLATION_11": "So he abandoned them [to their fate] and said, ‘O my people! Certainly, I communicated to you the messages of my Lord, and I was your well-wisher. So how should I grieve for a faithless lot?’\n",
        "TRANSLATION_12": "So Shu'aib left them, saying: \"O my people! I did indeed convey to you the messages for which I was sent by my Lord: I gave you good counsel, but how shall I lament over a people who refuse to believe!\"\n",
        "TRANSLATION_13": "Then he (Shu'aib) turned from them and said: \"O my people! I have indeed conveyed my Lord's Messages unto you and I have given you good advice. Then how can I sorrow for the disbelieving people's (destruction).\"\n",
        "TRANSLATION_14": "He turned away from them saying: 'I conveyed to you, my nation, the messages of my Lord and advised you. How can I grieve for the unbelieving nation'\n",
        "TRANSLATION_15": "So he turned away from them, and said, “O my people, I have delivered to you the messages of my Lord, and I have advised you, so why should I grieve over a disbelieving people?”\n",
        "TRANSLATION_16": "And he turned away from them and said, \"O my people, I had certainly conveyed to you the messages of my Lord and advised you, so how could I grieve for a disbelieving people?\"\n",
        "TRANSLATION_17": "[7:93] So he turned back on them, and said, ‘O my people, I have conveyed to you the Messages of my Lord and advised you sincerely, but you believe not: so why should I grieve for a disbelieving people?’ (the interrogative is meant [rhetorically] as a negation).\n",
        "TRANSLATION_18": "(So he turned from them) he departed from them before they were destroyed (and said: my people! I delivered my Lord's messages unto you) by explaining the commands and prohibitions (and gave you good advice) I warned you of Allah's torment and invited you to repent and believe; (then how can I sorrow for a people that rejected) Allah and therefore were destroyed?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:93",
            "7:79",
            "13:32",
            "25:30",
            "29:30",
            "20:90",
            "23:106",
            "7:67",
            "26:117",
            "43:88"
        ],
        "BIBLE": [
            "torah:deuteronomy:9:23",
            "torah:numbers:11:18",
            "torah:numbers:20:12",
            "writings:lamentations:1:11",
            "prophets:i%20samuel:30:23",
            "prophets:ii%20kings:4:43",
            "prophets:jeremiah:30:3",
            "writings:esther:3:11",
            "prophets:ii%20samuel:17:7",
            "writings:ezra:3:11"
        ]
    }
}