{
    "VERSE": "7:94",
    "ARABIC": "وَمَآ أَرْسَلْنَا فِى قَرْيَةٍ مِّن نَّبِىٍّ إِلَّآ أَخَذْنَآ أَهْلَهَا بِٱلْبَأْسَآءِ وَٱلضَّرَّآءِ لَعَلَّهُمْ يَضَّرَّعُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "We have never sent a Prophet to any city without seizing its people with hardship and distress so that hopefully they would be humble.",
        "TRANSLATION_1": "There is not a region to which We sent a prophet and did not inflict upon its people adversity and hardship so that they may submit.\n",
        "TRANSLATION_2": "Never have We sent a Prophet to a place without trying its people with adversity and hardship that they may humble themselves.\n",
        "TRANSLATION_3": "To every town that We sent a Prophet, We tested its inhabitants through distress and adversity so that perhaps they would submit themselves to Us.\n",
        "TRANSLATION_4": "And never did We send any Prophet to a dwelling but We seized its people with hardship and adversity so that they may become humble.\n",
        "TRANSLATION_5": "And We sent no Prophet unto any town (and they denied him), but We seized its people with Ba'sa' and Darra', so that they might humble themselves (to Allah).\n",
        "TRANSLATION_6": "And We did not send a prophet in a town but We overtook its people with distress and affliction in order that they might humble themselves.\n",
        "TRANSLATION_7": "We have sent no Prophet to any city but that We seized its people with misery and hardship, that haply they might be humble;\n",
        "TRANSLATION_8": "And We sent no prophet unto any township but We did afflict its folk with tribulation and adversity that haply they might grow humble.\n",
        "TRANSLATION_9": "Whenever We sent a prophet to a town, We afflicted its people with suffering and adversity, so that they might humble themselves [before God],\n",
        "TRANSLATION_10": "And We sent not a prophet to any township but We laid hold of the people thereof with tribulation and distress that haply they may humble themselves.\n",
        "TRANSLATION_11": "We did not send a prophet to any town without visiting its people with stress and distress so that they might entreat [for Allah’s forgiveness].\n",
        "TRANSLATION_12": "Whenever We sent a prophet to a town, We took up its people in suffering and adversity, in order that they might learn humility.\n",
        "TRANSLATION_13": "And We sent no Prophet unto any town (and they denied him), but We seized its people with suffering from extreme poverty (or loss in wealth) and loss of health and calamities, so that they might humiliate themselves (and repent to Allah).\n",
        "TRANSLATION_14": "We sent no Prophet to a village but seized its inhabitants with misfortune and adversity in order that they might be humble in supplication.\n",
        "TRANSLATION_15": "We did not send any prophet to any town but We afflicted its people with misery and adversity, so that they may humble themselves.\n",
        "TRANSLATION_16": "And We sent to no city a prophet [who was denied] except that We seized its people with poverty and hardship that they might humble themselves [to Allah].\n",
        "TRANSLATION_17": "[7:94] And We did not send a prophet to any city but that, when they denied him, We seized, We punished, its people with misery, abject poverty, and hardship, illness, so that they might be humble, [so that they might   be] self-effaced, and so believe.\n",
        "TRANSLATION_18": "(And We sent no prophet) as messenger (unto any township) whose people We destroyed (but We did afflict its folk) before their destruction (with tribulation) with fear, affliction and hardships (and adversity) illness, pain and hunger (that haply they might grow humble) that haply they might believe, but they did not.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:94",
            "6:42",
            "43:7",
            "7:98",
            "29:31",
            "7:96",
            "33:13",
            "26:208",
            "34:34",
            "7:97"
        ],
        "BIBLE": [
            "writings:nehemiah:5:15",
            "writings:job:30:16",
            "prophets:jeremiah:13:7",
            "torah:exodus:15:14",
            "writings:ii%20chronicles:20:33",
            "prophets:jeremiah:49:24",
            "prophets:judges:19:29",
            "prophets:i%20kings:8:30",
            "writings:ii%20chronicles:6:21",
            "prophets:isaiah:21:3"
        ]
    }
}