{
    "VERSE": "7:96",
    "ARABIC": "وَلَوْ أَنَّ أَهْلَ ٱلْقُرَىٰٓ ءَامَنُوا۟ وَٱتَّقَوْا۟ لَفَتَحْنَا عَلَيْهِم بَرَكَٰتٍ مِّنَ ٱلسَّمَآءِ وَٱلْأَرْضِ وَلَٰكِن كَذَّبُوا۟ فَأَخَذْنَٰهُم بِمَا كَانُوا۟ يَكْسِبُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "If only the people of the cities had had iman and taqwa, We would have opened up to them blessings from heaven and earth. But they denied the truth so We seized them for what they earned.",
        "TRANSLATION_1": "But if the people of these regions had believed and feared God, We would surely have showered on them blessings of the heavens and the earth; but they only denied, and We punished them for their deeds.\n",
        "TRANSLATION_2": "Had the people of those towns believed and been God-fearing, We would certainly have opened up to them blessings from the heavens and the earth; but they gave the lie [to their Prophets] and so We seized them for their deeds. so.\n",
        "TRANSLATION_3": "Had the people of the towns believed (in Our revelations) and maintained piety, We would have certainly showered on them Our blessings from the sky and the earth. But they called Our revelations lies, thus Our torment struck them for their evil deeds.\n",
        "TRANSLATION_4": "And had the people of the dwellings believed and been pious, We would have surely opened for them the blessings from the sky and from the earth, but in fact they denied, and We therefore seized them on account of their deeds.\n",
        "TRANSLATION_5": "And if the people of the towns had believed and had Taqwa, certainly, We should have opened for them blessings from the heaven and the earth, but they belied (the Messengers). So We took them (with punishment) for what they used to earn.\n",
        "TRANSLATION_6": "And if the people of the towns had believed and guarded (against evil) We would certainly have opened up for them blessings from the heaven and the earth, but they rejected, so We overtook them for what they had earned.\n",
        "TRANSLATION_7": "Yet had the peoples of the cities believed and been godfearing, We would have opened upon them blessings from heaven and earth; but they cried lies, and so We seized them for what they earned.\n",
        "TRANSLATION_8": "And if the people of the townships had believed and kept from evil, surely We should have opened for them blessings from the sky and from the earth. But (unto every messenger) they gave the lie, and so We seized them on account of what they used to earn.\n",
        "TRANSLATION_9": "Had the people of those towns believed in and feared God, We would have showered upon them blessings from heaven and earth, but they rejected the truth. So We seized them on account of their misdeeds.\n",
        "TRANSLATION_10": "And had the people of those townships believed and feared, We would of a surety have opened up to them blessings from the heavens and the earth; but they belied, wherefore We laid hold of them for that which they had been earning.\n",
        "TRANSLATION_11": "If the people of the towns had been faithful and Godwary, We would have opened to them blessings from the heaven and the earth. But they denied; so We seized them because of what they used to earn.\n",
        "TRANSLATION_12": "If the people of the towns had but believed and feared Allah, We should indeed have opened out to them (All kinds of) blessings from heaven and earth; but they rejected (the truth), and We brought them to book for their misdeeds.\n",
        "TRANSLATION_13": "And if the people of the towns had believed and had the Taqwa (piety), certainly, We should have opened for them blessings from the heaven and the earth, but they belied (the Messengers). So We took them (with punishment) for what they used to earn (polytheism and crimes, etc.).\n",
        "TRANSLATION_14": "Had the people of the villages believed and been cautious, We would have opened upon them the blessings from heaven and earth. But they belied, and We seized them for what they earned.\n",
        "TRANSLATION_15": "Had the people of the towns believed and turned righteous, We would have opened for them the blessings of the heaven and the earth; but they rejected the truth, so We seized them by what they were doing.\n",
        "TRANSLATION_16": "And if only the people of the cities had believed and feared Allah, We would have opened upon them blessings from the heaven and the earth; but they denied [the messengers], so We seized them for what they were earning.\"\n",
        "TRANSLATION_17": "[7:96] Yet had the people of the towns, the deniers, believed, in God and the messengers [sent] to them, and been fearful, of unbelief and acts of disobedience, We would have indeed opened upon them (read la-fatahnā or la-fattahnā) blessings from the heaven, by way of rain, and earth, by way of vegetation; but they denied, the messengers, and so We seized them, We punished them, on account of what they used to earn.\n",
        "TRANSLATION_18": "(And if the people of the township) whose people We destroyed (had believed) in the Scripture and messengers (and kept from evil) disbelief, idolatry, indecencies and had further repented, (surely We should have opened for them, blessings from the sky) through rain (and from the earth) through vegetation and fruits. (But they gave the lie) to My messengers and Scriptures, (and so We seized them) by inflicting upon them drought, lack of fruits and punishment (on account of what they used to earn) i.e. because of giving the lie to the prophets and Scriptures.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:96",
            "29:34",
            "23:18",
            "44:29",
            "23:71",
            "17:95",
            "16:3",
            "7:94",
            "4:132",
            "43:60"
        ],
        "BIBLE": [
            "prophets:isaiah:42:6",
            "writings:song%20of%20songs:5:6",
            "prophets:ii%20samuel:4:10",
            "prophets:isaiah:41:9",
            "writings:psalms:105:44",
            "torah:deuteronomy:3:12",
            "prophets:jeremiah:7:14",
            "prophets:jeremiah:39:5",
            "writings:ruth:2:18",
            "prophets:i%20kings:18:26"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:6:1",
            
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:5:1"
        ]
    }
}