{
    "VERSE": "7:98",
    "ARABIC": "أَوَأَمِنَ أَهْلُ ٱلْقُرَىٰٓ أَن يَأْتِيَهُم بَأْسُنَا ضُحًى وَهُمْ يَلْعَبُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Or do the people of the cities feel secure against Our violent force coming down on them in the day while they are playing games?",
        "TRANSLATION_1": "Or, are the people of the towns so unafraid that (even when) Our retribution comes upon them in the hours of the morning they remain engrossed in sport and play?\n",
        "TRANSLATION_2": "Or, do the people of those towns feel secure that Our punishment will not come to them by daylight while they are at play?\n",
        "TRANSLATION_3": "or that which could seize them during their busy hours of the day?\n",
        "TRANSLATION_4": "Or do the people of the dwellings not fear that Our wrath may come upon them during the day, while they are playing?\n",
        "TRANSLATION_5": "Or, did the people of the towns then feel secure against the coming of Our punishment in the forenoon while they were playing\n",
        "TRANSLATION_6": "What! do the people of the towns feel secure from Our punishment coming to them in the morning while they play?\n",
        "TRANSLATION_7": "Do the people of the cities feel secure Our might shall not come upon them in daylight while they are playing?\n",
        "TRANSLATION_8": "Or are the people of the townships then secure from the coming of Our wrath upon them in the daytime while they play?\n",
        "TRANSLATION_9": "Or, do they feel secure against the coming of Our punishment upon them in the forenoon while they are at play?\n",
        "TRANSLATION_10": "Or, are the people of the township secure that Our wrath would not come upon them by daylight while they are disporting themselves?\n",
        "TRANSLATION_11": "Do the people of the towns feel secure from Our punishment overtaking them at midday while they are playing around?\n",
        "TRANSLATION_12": "Or else did they feel secure against its coming in broad daylight while they played about (care-free)?\n",
        "TRANSLATION_13": "Or, did the people of the towns then feel secure against the coming of Our Punishment in the forenoon while they play?\n",
        "TRANSLATION_14": "Or do the inhabitants of the villages feel secure from Our Might coming to them in the midmorning while they play?\n",
        "TRANSLATION_15": "Do the people of the towns feel secure that Our might will not come upon them by day, while they play?\n",
        "TRANSLATION_16": "Or did the people of the cities feel secure from Our punishment coming to them in the morning while they were at play?\n",
        "TRANSLATION_17": "[7:98] Or, do the people of the towns feel secure from the coming of Our might upon them in the daytime while they are playing?\n",
        "TRANSLATION_18": "(Or are the people of the townships then secure from the coming of Our wrath upon them in the daytime while they play) i.e. engaging in falsehood?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "7:98",
            "7:97",
            "7:94",
            "29:31",
            "6:131",
            "11:117",
            "17:16",
            "28:59",
            "7:96",
            "28:12"
        ],
        "BIBLE": [
            "prophets:joshua:20:6",
            "prophets:judges:16:2",
            "prophets:micah:7:12",
            "prophets:judges:9:33",
            "prophets:ezekiel:16:16",
            "prophets:i%20samuel:11:11",
            "prophets:zechariah:8:20",
            "prophets:ii%20kings:7:9",
            "prophets:i%20samuel:18:10",
            "prophets:ezekiel:7:7"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:4:11",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:1:7"
        ]
    }
}