{
    "VERSE": "64:10",
    "ARABIC": "وَٱلَّذِينَ كَفَرُوا۟ وَكَذَّبُوا۟ بِـَٔايَٰتِنَآ أُو۟لَٰٓئِكَ أَصْحَٰبُ ٱلنَّارِ خَٰلِدِينَ فِيهَا وَبِئْسَ ٱلْمَصِيرُ",
    "ENGLISH": {
        "TRANSLATION_0": "But as for those who are kafir and deny Our Signs they are the Companions of the Fire, remaining in it timelessly, for ever. What an evil destination!",
        "TRANSLATION_1": "Those who did not believe and denied Our revelations will be inmates of Hell, where they will abide for ever, and how evil a journey's end!\n",
        "TRANSLATION_2": "As for those who disbelieved and gave the lie to Our Signs: they shall be the inmates of the Fire, and will abide in it. That is a woeful resort!\n",
        "TRANSLATION_3": "As for those who have disbelieved and rejected Our revelations, they will dwell forever in hell fire, a terrible fate.\n",
        "TRANSLATION_4": "And those who disbelieved and denied Our signs, are the people of the fire – to remain in it forever; and what a wretched outcome!\n",
        "TRANSLATION_5": "But those who disbelieved and denied Our Ayat, they will be the dwellers of the Fire, to dwell therein forever. And worst indeed is that destination\n",
        "TRANSLATION_6": "And (as for) those who disbelieve and reject Our communications, they are the inmates of the fire, to abide therein and evil is the resort.\n",
        "TRANSLATION_7": "And those who disbelieved and cried lies to Our signs, those shall be the inhabitants of the Fire. therein to dwell forever -- an evil homecoming!\n",
        "TRANSLATION_8": "But those who disbelieve and deny Our revelations, such are owners of the Fire; they will abide therein - a hapless journey's end!\n",
        "TRANSLATION_9": "But those who denied the truth and rejected Our signs shall be the inmates of the Fire, there to remain -- what an evil destination!\n",
        "TRANSLATION_10": "And they who disbelieve and belie Our Signs! those shall be fellows of the Fire, as abiders therein; a hapless destination.\n",
        "TRANSLATION_11": "But as for those who are faithless and deny Our signs, they will be the inmates of the Fire, to remain in it [forever], and it is an evil destination.\n",
        "TRANSLATION_12": "But those who reject Faith and treat Our Signs as falsehoods, they will be Companions of the Fire, to dwell therein for aye: and evil is that Goal.\n",
        "TRANSLATION_13": "But those who disbelieved (in the Oneness of Allah - Islamic Monotheism) and denied Our Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.), they will be the dwellers of the Fire, to dwell therein forever. And worst indeed is that destination.\n",
        "TRANSLATION_14": "As for those who disbelieved and belied Our verses, they shall be the inhabitants of the Fire and shall live therein for ever. Evil shall be their arrival.\n",
        "TRANSLATION_15": "But as for those who disbelieve and denounce Our revelations—these are the inmates of the Fire, dwelling therein forever; and what a miserable fate!\n",
        "TRANSLATION_16": "But the ones who disbelieved and denied Our verses - those are the companions of the Fire, abiding eternally therein; and wretched is the destination.\n",
        "TRANSLATION_17": "[64:10] And [as for] those who disbelieved and denied Our signs — the Qur’ān — those, they will be the inhabitants of the Fire, wherein they will abide. And [what] an evil journey’s end!, it is.\n",
        "TRANSLATION_18": "(But those who disbelieve) in Allah: the disbelievers of Mecca (and deny Our revelations) Muhammad (pbuh) and the Qur'an, (such are owners of the Fire) they are inhabitants of the Fire; (they will abide therein) they will abide in the Fire, never to die or leave it (a hapless journey's end) in the Hereafter in which they have ended up!\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "64:10",
            "2:39",
            "7:36",
            "5:86",
            "5:10",
            "22:51",
            "90:19",
            "2:82",
            "22:72",
            "2:81"
        ],
        "BIBLE": [
            "torah:numbers:33:53",
            "prophets:ezekiel:36:28",
            "writings:lamentations:1:11",
            "prophets:ezekiel:28:25",
            "prophets:i%20kings:3:9",
            "torah:deuteronomy:26:12",
            "prophets:isaiah:8:18",
            "writings:i%20chronicles:22:18",
            "prophets:ezekiel:37:25",
            "writings:i%20chronicles:29:14"
        ]
    }
}