{
    "VERSE": "64:13",
    "ARABIC": "ٱللَّهُ لَآ إِلَٰهَ إِلَّا هُوَ وَعَلَى ٱللَّهِ فَلْيَتَوَكَّلِ ٱلْمُؤْمِنُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Allah - there is no god but Him. So let the muminun put their trust in Allah.",
        "TRANSLATION_1": "God: There is no god but He; and in God should believers place their trust.\n",
        "TRANSLATION_2": "Allah there is no god but He; in Allah should the believers put all their trust.\n",
        "TRANSLATION_3": "God is the only Lord and in Him the believers should trust.\n",
        "TRANSLATION_4": "Allah – there is none worthy of worship except Him; and only upon Allah must the Muslims rely.\n",
        "TRANSLATION_5": "Allah! La ilaha illa Huwa. And in Allah therefore let the believers put their trust.\n",
        "TRANSLATION_6": "Allah, there is no god but He; and upon Allah, then, let the believers rely.\n",
        "TRANSLATION_7": "God -- there is no god but He. And in God let the believers put their trust.\n",
        "TRANSLATION_8": "Allah! There is no Allah save Him. In Allah, therefore, let believers put their trust.\n",
        "TRANSLATION_9": "God! There is no god but He, so let the faithful put their trust in Him.\n",
        "TRANSLATION_10": "Allah! there is no God but He! In Allah, therefore, let the believers put their trust.\n",
        "TRANSLATION_11": "Allah—there is no god except Him—in Allah let all the faithful put their trust.\n",
        "TRANSLATION_12": "Allah! There is no god but He: and on Allah, therefore, let the Believers put their trust.\n",
        "TRANSLATION_13": "Allah! La ilaha illa Huwa (none has the right to be worshipped but He), and in Allah (Alone), therefore, let the believers put their trust.\n",
        "TRANSLATION_14": "Allah, there is no god except He. In Allah let the believers put their trust.\n",
        "TRANSLATION_15": "God, there is no god but He; and in God let the believers put their trust.\n",
        "TRANSLATION_16": "Allah - there is no deity except Him. And upon Allah let the believers rely.\n",
        "TRANSLATION_17": "[64:13] God — there is no god except Him. And in God let [all] believers put their trust.\n",
        "TRANSLATION_18": "(Allah! There is no God save Him) He has no son or partner. (In Allah, therefore, let believers put their trust) the believers should rely on Allah and not on anyone else.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "64:13",
            "9:51",
            "20:14",
            "39:66",
            "37:35",
            "7:186",
            "27:79",
            "3:122",
            "26:213",
            "3:160"
        ],
        "BIBLE": [
            "prophets:zephaniah:2:11",
            "writings:ii%20chronicles:31:20",
            "prophets:isaiah:37:20",
            "writings:psalms:55:17",
            "prophets:isaiah:49:4",
            "prophets:isaiah:36:7",
            "prophets:ii%20kings:18:22",
            "prophets:ezekiel:37:14",
            "torah:deuteronomy:20:4",
            "writings:job:35:2"
        ]
    }
}