{
    "VERSE": "64:2",
    "ARABIC": "هُوَ ٱلَّذِى خَلَقَكُمْ فَمِنكُمْ كَافِرٌ وَمِنكُم مُّؤْمِنٌ وَٱللَّهُ بِمَا تَعْمَلُونَ بَصِيرٌ",
    "ENGLISH": {
        "TRANSLATION_0": "It is He who created you. Yet among you are those who are kafir and those who have iman. Allah sees what you do.",
        "TRANSLATION_1": "It is He who created you, though one of you is an infidel and one of you a believer; yet God perceives what you do.\n",
        "TRANSLATION_2": "He it is Who has created you: and among you are those that deny the Truth and among you are those that believe in it. Allah observes all that you do.\n",
        "TRANSLATION_3": "It is He who has created you all but some of you have accepted the faith and some of you have not. God is Well Aware of what you do.\n",
        "TRANSLATION_4": "It is He Who has created you, so among you one is a disbeliever whereas another is a Muslim; and Allah is seeing your deeds.\n",
        "TRANSLATION_5": "He it is Who created you, then some of you are disbelievers and some of you are believers. And Allah is All-Seer of what you do.\n",
        "TRANSLATION_6": "He it is Who created you, but one of you is an unbeliever and another of you is a believer; and Allah sees what you do.\n",
        "TRANSLATION_7": "It is He who created you. One of you is an unbeliever, and one of you a believer; and God sees the things you do.\n",
        "TRANSLATION_8": "He it is Who created you, but one of you is a disbeliever and one of you is a believer, and Allah is Seer of what ye do.\n",
        "TRANSLATION_9": "It was He who created you; and some of you are those who deny this truth, and some who believe [in it]. God sees everything you do.\n",
        "TRANSLATION_10": "He it is Who hath created you; then of you some are Infidels and of you some are believers; and Allah is of that which ye Work Beholder.\n",
        "TRANSLATION_11": "It is He who created you. Then some of you are faithless and some of you are faithful, and Allah watches what you do.\n",
        "TRANSLATION_12": "It is He Who has created you; and of you are some that are Unbelievers, and some that are Believers: and Allah sees well all that ye do.\n",
        "TRANSLATION_13": "He it is Who created you, then some of you are disbelievers and some of you are believers. And Allah is All-Seer of what you do.\n",
        "TRANSLATION_14": "It is He who created you. Amongst you is an unbeliever and amongst you is a believer. Allah sees the things you do.\n",
        "TRANSLATION_15": "It is He who created you. Some of you are unbelievers, and some of you are believers. And God perceives what you do.\n",
        "TRANSLATION_16": "It is He who created you, and among you is the disbeliever, and among you is the believer. And Allah, of what you do, is Seeing.\n",
        "TRANSLATION_17": "[64:2] It is He Who created you. Then some of you are disbelievers and some of you are believers, in [terms of] your original disposition; then He makes you die and brings you back to life in that same [disposition]; and God is Seer of what you do.\n",
        "TRANSLATION_18": "(He it is Who created you) from Adam and Adam is from dust, (but one of you is a disbeliever) openly (and one of you is a believer) openly; it is also said that this means: one of you is a disbeliever who becomes a believer-this is said as an encouragement to accept faith-and one of you is a believer who becomes a disbeliever-this is a warning against disbelief-; it is also said that this means: one of you is a disbeliever both inwardly and outwardly-this is the real disbeliever-and one of you is a believer inwardly and outwardly and this is the real believer, and one of you is a disbeliever inwardly and a believer outwardly, and this is the hypocrite, (and Allah is Seer of what ye do) of good and evil.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "64:2",
            "47:23",
            "5:71",
            "5:88",
            "47:34",
            "5:61",
            "3:163",
            "53:62",
            "16:19",
            "8:39"
        ],
        "BIBLE": [
            "prophets:ezekiel:16:30",
            "torah:deuteronomy:10:21",
            "prophets:isaiah:42:20",
            "prophets:isaiah:64:3",
            "torah:numbers:18:32",
            "prophets:ezekiel:13:3",
            "torah:genesis:1:31",
            "writings:job:8:18",
            "torah:deuteronomy:11:7",
            "torah:deuteronomy:1:32"
        ]
    }
}