{
    "VERSE": "64:3",
    "ARABIC": "خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلْأَرْضَ بِٱلْحَقِّ وَصَوَّرَكُمْ فَأَحْسَنَ صُوَرَكُمْ وَإِلَيْهِ ٱلْمَصِيرُ",
    "ENGLISH": {
        "TRANSLATION_0": "He created the heavens and the earth with truth and formed you, giving you the best of forms. And He is your final destination.",
        "TRANSLATION_1": "He created the heavens and the earth with deliberation, and gave you form, and shaped you well; and to Him is your returning.\n",
        "TRANSLATION_2": "He created the heavens and the earth with Truth and shaped you, giving you excellent shapes. And to Him is your ultimate return.\n",
        "TRANSLATION_3": "He has created the heavens and the earth for a genuine purpose and has formed you in the best shape. To Him all things return.\n",
        "TRANSLATION_4": "He created the heavens and the earth with the truth, and fashioned you thereby making you in best shapes; and towards Him only is the return.\n",
        "TRANSLATION_5": "He has created the heavens and the earth with truth, and He shaped you and made good your shapes. And to Him is the return.\n",
        "TRANSLATION_6": "He created the heavens and the earth with truth, and He formed you, then made goodly your forms, and to Him is the ultimate resort.\n",
        "TRANSLATION_7": "He created the heavens and the earth with the truth, and He shaped you, and shaped you well; and unto Him is the homecoming.\n",
        "TRANSLATION_8": "He created the heavens and the earth with truth, and He shaped you and made good your shapes, and unto Him is the journeying.\n",
        "TRANSLATION_9": "He created the heavens and the earth for a purpose. He formed you and gave you the best of forms. To Him you shall all return.\n",
        "TRANSLATION_10": "He hath created the heavens and the earth with truth, and hath formed you, and hath made-your forms goodly; and Unto Him Is the return.\n",
        "TRANSLATION_11": "He created the heavens and the earth with consummate wisdom, and He formed you and perfected your forms, and toward Him is your destination.\n",
        "TRANSLATION_12": "He has created the heavens and the earth in just proportions, and has given you shape, and made your shapes beautiful: and to Him is the final Goal.\n",
        "TRANSLATION_13": "He has created the heavens and the earth with truth, and He shaped you and made good your shapes, and to Him is the final Return.\n",
        "TRANSLATION_14": "He created the heavens and the earth in truth and He shaped you and gave you good shapes. To Him is the arrival.\n",
        "TRANSLATION_15": "He created the heavens and the earth with truth, and He designed you, and designed you well, and to Him is the final return.\n",
        "TRANSLATION_16": "He created the heavens and earth in truth and formed you and perfected your forms; and to Him is the [final] destination.\n",
        "TRANSLATION_17": "[64:3] He created the heavens and the earth with the truth, and He shaped you and made your shapes excellent, for He made the human form to be the best of forms; and to Him is the journey’s end.\n",
        "TRANSLATION_18": "(He created the heavens and the earth with truth) in order to explain the Truth and falsehood; and it is also said this means: He created the heavens and the earth and they are both destined to vanish and be annihilated, (and He shaped you) in the wombs (and made good your shapes) better than the shapes of beasts; and it is also said this means: He made your shapes seemly by giving you two hands, two feet, two eyes, two ears and all the other members, (and unto Him is the journeying) and unto Him is the return after death.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "64:3",
            "16:3",
            "44:29",
            "23:71",
            "51:23",
            "40:75",
            "24:42",
            "6:73",
            "29:44",
            "46:3"
        ],
        "BIBLE": [
            "writings:ecclesiastes:1:13",
            "prophets:joshua:23:15",
            "torah:leviticus:17:11",
            "prophets:isaiah:55:11",
            "prophets:ii%20samuel:22:36",
            "torah:genesis:1:30",
            "torah:genesis:3:6",
            "prophets:hosea:2:14",
            "torah:exodus:20:4",
            "torah:deuteronomy:3:20"
        ]
    }
}