{
    "VERSE": "64:7",
    "ARABIC": "زَعَمَ ٱلَّذِينَ كَفَرُوٓا۟ أَن لَّن يُبْعَثُوا۟ قُلْ بَلَىٰ وَرَبِّى لَتُبْعَثُنَّ ثُمَّ لَتُنَبَّؤُنَّ بِمَا عَمِلْتُمْ وَذَٰلِكَ عَلَى ٱللَّهِ يَسِيرٌ",
    "ENGLISH": {
        "TRANSLATION_0": "Those who are kafir claim that they will never be raised again. Say: 'Oh yes, by my Lord, you certainly will be raised again! And then you will be informed about what you did. That is easy for Allah.'",
        "TRANSLATION_1": "The unbelievers claim that they will not be raised again. Tell them: \"Why not? By my Lord, you will certainly be raised again, and then informed of what you had done. That is how the law of God works inevitably.\"\n",
        "TRANSLATION_2": "The unbelievers have vehemently contended that they shall not be raised to life. Say to them: “Yes, by my Lord, you shall surely be raised to life, and you shall certainly be fully informed of all that you did. That is easy enough for Allah.”\n",
        "TRANSLATION_3": "The disbelievers have thought that they would never be resurrected (Muhammad). Say, \"I swear by my Lord that you will certainly be resurrected and will be told about all that you have done.\" All this is certainly very easy for God.\n",
        "TRANSLATION_4": "The disbelievers alleged that they will surely not be raised again; proclaim (O dear Prophet Mohammed – peace and blessings be upon him), “Surely yes, why not? By oath of Lord, you will surely be raised again and you will then be informed of your misdeeds; and this is easy for Allah.”\n",
        "TRANSLATION_5": "The disbelievers pretend that they will never be resurrected. Say: \"Yes! By my Lord, you will certainly be resurrected, then you will be informed of what you did; and that is easy for Allah.\"\n",
        "TRANSLATION_6": "Those who disbelieve think that they shall never be raised. Say: Aye! by my Lord! you shall most certainly be raised, then you shall most certainly be informed of what you did; and that is easy to Allah.\n",
        "TRANSLATION_7": "The unbelievers assert that they will never be raised up. Say: 'Yes indeed, by my Lord! You shall be raised up, then you shall be told the things you did. That is easy for God.'\n",
        "TRANSLATION_8": "Those who disbelieve assert that they will not be raised again. Say (unto them, O Muhammad): Yea, verily, by my Lord! ye will be raised again and then ye will be informed of what ye did; and that is easy for Allah.\n",
        "TRANSLATION_9": "Those who deny the truth claim that they will never be raised up again. Say, \"By my Lord, most surely you will be raised up again and then you will be told of all that you have done; and that is easy enough for God.\"\n",
        "TRANSLATION_10": "Those who dlsbelieve assert that they shall not be raised. Say thou 'Yea! by my Lord, ye shall surely be raised, and then Unto you shall be declared that which ye have worked; and that is for Allah easy.\n",
        "TRANSLATION_11": "The faithless claim that they will not be resurrected. Say, ‘Yes, by my Lord, you will surely be resurrected; then you will surely be informed of what you did, and that is easy for Allah.’\n",
        "TRANSLATION_12": "The Unbelievers think that they will not be raised up (for Judgment). Say: \"Yea, By my Lord, Ye shall surely be raised up: then shall ye be told (the truth) of all that ye did. And that is easy for Allah.\"\n",
        "TRANSLATION_13": "The disbelievers pretend that they will never be resurrected (for the Account). Say (O Muhammad SAW): \"Yes! By my Lord, you will certainly be resurrected, then you will be informed of (and recompensed for) what you did, and that is easy for Allah.\n",
        "TRANSLATION_14": "The unbelievers think that they will never be raised up. Say: 'By my Lord, yes indeed, you shall assuredly be raised up! Then you shall be told of all that you have done. That is easy for Allah'\n",
        "TRANSLATION_15": "Those who disbelieve claim that they will not be resurrected. Say, “Yes indeed, by my Lord, you will be resurrected; then you will be informed of everything you did; and that is easy for God.”\n",
        "TRANSLATION_16": "Those who disbelieve have claimed that they will never be resurrected. Say, \"Yes, by my Lord, you will surely be resurrected; then you will surely be informed of what you did. And that, for Allah, is easy.\"\n",
        "TRANSLATION_17": "[64:7] Those who disbelieve claim that (an is softened, its subject having been omitted, that is to say, annahum) they will never be resurrected. Say: ‘Yes indeed, by my Lord! You will be resurrected; then you will be informed of what you did. And that is easy for God’.\n",
        "TRANSLATION_18": "(Those who disbelieve) the disbelievers of Mecca (assert that they will not be raised again) after they die. (Say) to them, Muhammad: (Yea, verily, by my Lord! ye will be raised again) after you die (and then ye will be informed of what ye did) in the life of the world of good and evil; (and that) resurrection after death (is easy for Allah.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "64:7",
            "13:21",
            "7:62",
            "6:23",
            "2:76",
            "46:13",
            "41:30",
            "42:10",
            "81:29",
            "11:34"
        ],
        "BIBLE": [
            "writings:psalms:40:6",
            "prophets:jeremiah:42:4",
            "prophets:jeremiah:8:8",
            "prophets:jeremiah:14:13",
            "prophets:joshua:9:24",
            "prophets:isaiah:25:1",
            "prophets:jeremiah:5:19",
            "prophets:jeremiah:29:15",
            "prophets:ii%20samuel:23:17",
            "prophets:i%20kings:18:36"
        ]
    }
}