{
    "VERSE": "64:8",
    "ARABIC": "فَـَٔامِنُوا۟ بِٱللَّهِ وَرَسُولِهِۦ وَٱلنُّورِ ٱلَّذِىٓ أَنزَلْنَا وَٱللَّهُ بِمَا تَعْمَلُونَ خَبِيرٌ",
    "ENGLISH": {
        "TRANSLATION_0": "So have iman in Allah and His Messenger and in the Light We have sent down. Allah is aware of what you do.",
        "TRANSLATION_1": "So believe in God, His Apostle and the Light We have sent down. God is well aware of what you do.\n",
        "TRANSLATION_2": "So believe in Allah and in His Messenger and in the Light that We have sent down. Allah is fully aware of what you do.\n",
        "TRANSLATION_3": "Thus, have faith in God, His Messenger and the Light which We have revealed. God is Well-Aware of what you do.\n",
        "TRANSLATION_4": "Therefore accept faith in Allah and His Noble Messenger and the light which We have sent down; and Allah is Well Aware of what you do.\n",
        "TRANSLATION_5": "Therefore, believe in Allah and His Messenger and in the Light which We have sent down. And Allah is All-Aware of what you do.\n",
        "TRANSLATION_6": "Therefore believe in Allah and His Apostle and the Light which We have revealed; and Allah is Aware of what you do.\n",
        "TRANSLATION_7": "Therefore believe in God and His Messenger, and in the Light which We have sent down. And God is aware of the things you do.\n",
        "TRANSLATION_8": "So believe in Allah and His messenger and the light which We have revealed. And Allah is Informed of what ye do.\n",
        "TRANSLATION_9": "Believe then in God and His Messenger, and in the light which We have sent down. God is fully aware of all that you do.\n",
        "TRANSLATION_10": "Wherefore believe in Allah and His apostle and the Light which We have sent down: And Allah is of that which ye work Aware.\n",
        "TRANSLATION_11": "So have faith in Allah and His Apostle and the light, which We have sent down, and Allah is well aware of what you do.\n",
        "TRANSLATION_12": "Believe, therefore, in Allah and His Messenger, and in the Light which we have sent down. And Allah is well acquainted with all that ye do.\n",
        "TRANSLATION_13": "Therefore, believe in Allah and His Messenger (Muhammad SAW), and in the Light (this Quran) which We have sent down. And Allah is All-Aware of what you do.\n",
        "TRANSLATION_14": "Believe in Allah, and His Messenger, and in the Light which We have sent down. Allah is Aware of all that you do.\n",
        "TRANSLATION_15": "So believe in God and His Messenger, and the Light which We sent down. God is Aware of everything you do.\n",
        "TRANSLATION_16": "So believe in Allah and His Messenger and the Qur'an which We have sent down. And Allah is Acquainted with what you do.\n",
        "TRANSLATION_17": "[64:8] So believe in God and His Messenger and the Light, the Qur’ān, which We have revealed. And God is Aware of what you do.\n",
        "TRANSLATION_18": "So believe) people of Mecca (in Allah and His messenger) Muhammad (pbuh) and in resurrection after death (and the light) the Scripture (which We have revealed) with which We sent Gabriel to Muhammad 671 (pbuh). (And Allah is Aware of what ye do) of good and evil.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "64:8",
            "9:1",
            "9:16",
            "24:52",
            "4:61",
            "5:99",
            "3:153",
            "3:132",
            "48:13",
            "3:183"
        ],
        "BIBLE": [
            "prophets:isaiah:24:15",
            "torah:deuteronomy:1:32",
            "prophets:isaiah:45:7",
            "writings:job:28:11",
            "torah:deuteronomy:29:28",
            "writings:job:29:24",
            "writings:ecclesiastes:11:7",
            "writings:job:33:29",
            "torah:genesis:1:3",
            "writings:job:42:8"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:2",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:14",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:9"
        ]
    }
}