{
    "VERSE": "84:19",
    "ARABIC": "لَتَرْكَبُنَّ طَبَقًا عَن طَبَقٍ",
    "ENGLISH": {
        "TRANSLATION_0": "you will mount up stage by stage!",
        "TRANSLATION_1": "That you will climb from stage to stage.\n",
        "TRANSLATION_2": "you shall proceed onwards from stage to stage.\n",
        "TRANSLATION_3": "that you will certainly pass through one stage after another.\n",
        "TRANSLATION_4": "You will surely go up level by level.\n",
        "TRANSLATION_5": "You shall certainly travel from stage\n",
        "TRANSLATION_6": "That you shall most certainly enter one state after another.\n",
        "TRANSLATION_7": "you shall surely ride stage after stage.\n",
        "TRANSLATION_8": "That ye shall journey on from plane to plane.\n",
        "TRANSLATION_9": "you will progress from stage to stage.\n",
        "TRANSLATION_10": "Surely ye shall ride layer upon layer.\n",
        "TRANSLATION_11": "you will surely fare from stage to stage.\n",
        "TRANSLATION_12": "Ye shall surely travel from stage to stage.\n",
        "TRANSLATION_13": "You shall certainly travel from stage to stage (in this life and in the Hereafter).\n",
        "TRANSLATION_14": "that you shall surely ride from stage to stage.\n",
        "TRANSLATION_15": "You will mount stage by stage.\n",
        "TRANSLATION_16": "[That] you will surely experience state after state.\n",
        "TRANSLATION_17": "[84:19] you will surely journey (tarkabunna is actually tarkabūnanna, but the nūn of the indicative has been omitted because of two identical letters following one another, and the wāw [is omitted] because of two unvocalised consonants coming together), from stage to stage, state after state, namely, death, then life, then what comes afterwards of the states at the Resurrection.\n",
        "TRANSLATION_18": "(That ye shall journey) the whole creation shall be transformed (on from plane to plane) from one state to another; from the time He created them until the time they die, and from the time they die until they enter either Paradise or hell: in all these times Allah transforms them from one state to another; it is also said that this means: you shall journey, Muhammad, from one heaven to another on the day of the ascent; and it is also said that this means: this denier will go from one state to another, from the time he dies until he enters the Fire.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "84:19",
            "23:40",
            "5:79",
            "102:8",
            "29:9",
            "47:31",
            "6:28",
            "43:37",
            "12:61",
            "30:49"
        ],
        "BIBLE": [
            "prophets:ezekiel:33:28",
            "torah:deuteronomy:32:47",
            "prophets:jeremiah:21:9",
            "prophets:jeremiah:38:2",
            "prophets:jeremiah:39:18",
            "torah:genesis:9:4",
            "torah:deuteronomy:31:18",
            "prophets:amos:5:17",
            "torah:numbers:35:31",
            "prophets:jeremiah:22:4"
        ]
    }
}