{
    "VERSE": "84:20",
    "ARABIC": "فَمَا لَهُمْ لَا يُؤْمِنُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "What is the matter with them that they have no iman",
        "TRANSLATION_1": "So, wherefore do they not believe?\n",
        "TRANSLATION_2": "So, what is the matter with them that they do not believe,\n",
        "TRANSLATION_3": "What is the matter with them? Why do they not believe?\n",
        "TRANSLATION_4": "What is the matter with them that they do not accept faith?\n",
        "TRANSLATION_5": "What is the matter with them, that they believe not\n",
        "TRANSLATION_6": "But what is the matter with them that they do not believe,\n",
        "TRANSLATION_7": "Then what ails them, that they believe not,\n",
        "TRANSLATION_8": "What aileth them, then, that they believe not\n",
        "TRANSLATION_9": "What is wrong with them that they do not believe?\n",
        "TRANSLATION_10": "What aileth them then, that they believe not,\n",
        "TRANSLATION_11": "What is the matter with them that they will not believe,\n",
        "TRANSLATION_12": "What then is the matter with them, that they believe not?-\n",
        "TRANSLATION_13": "What is the matter with them, that they believe not?\n",
        "TRANSLATION_14": "What is the matter with them, that they do not believe\n",
        "TRANSLATION_15": "What is the matter with them that they do not believe?\n",
        "TRANSLATION_16": "So what is [the matter] with them [that] they do not believe,\n",
        "TRANSLATION_17": "[84:20] So what is wrong with them, that is, the disbelievers, that they do not have faith, that is to say, what is there to prevent them from [embracing] faith; or what argument do they have for neglecting it despite the existence of proofs for it,\n",
        "TRANSLATION_18": "(What aileth them) the disbelievers of Mecca; and it is said this refers to the three sons of 'Abd Yalayl al- Thaqafi: Mas'ud, Habib and Rabi'ah, the last two had later on accepted Islam (then, that they believe not) in Muhammad (pbuh) and the Qur'an.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "84:20",
            "37:92",
            "37:25",
            "51:54",
            "69:38",
            "26:100",
            "26:211",
            "51:45",
            "77:48",
            "78:1"
        ],
        "BIBLE": [
            "torah:leviticus:19:7",
            "prophets:jeremiah:14:10",
            "torah:deuteronomy:1:32",
            "writings:job:9:19",
            "writings:proverbs:11:13",
            "writings:ezra:10:4",
            "writings:daniel:1:14",
            "torah:deuteronomy:22:26",
            "writings:proverbs:26:25",
            "writings:job:42:8"
        ]
    }
}