{
    "VERSE": "84:21",
    "ARABIC": "وَإِذَا قُرِئَ عَلَيْهِمُ ٱلْقُرْءَانُ لَا يَسْجُدُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "and, when the Qur'an is recited to them, do not prostrate?",
        "TRANSLATION_1": "And when the Qur'an is recited to them do not bow in adoration?\n",
        "TRANSLATION_2": "and when the Qur'an is recited to them, they do not prostrate themselves?\n",
        "TRANSLATION_3": "Why, when the Quran is recited to them, do they not prostrate themselves?\n",
        "TRANSLATION_4": "And when the Qur’an is recited to them, they do not fall prostrate? (Command of Prostration # 13)\n",
        "TRANSLATION_5": "And when the Qur'an is recited to them, they fall not prostrate.\n",
        "TRANSLATION_6": "And when the Quran is recited to them they do not make obeisance?\n",
        "TRANSLATION_7": "and when the Koran is recited to them they do not bow?\n",
        "TRANSLATION_8": "And, when the Qur'an is recited unto them, worship not (Allah)?\n",
        "TRANSLATION_9": "When the Quran is read to them, why do they not fall to their knees?\n",
        "TRANSLATION_10": "And that, when the Qur'an is read Unto them, they prostrate not them-selves!\n",
        "TRANSLATION_11": "and will not prostrate when the Quran is recited to them?\n",
        "TRANSLATION_12": "And when the Qur'an is read to them, they fall not prostrate,\n",
        "TRANSLATION_13": "And when the Quran is recited to them, they fall not prostrate,\n",
        "TRANSLATION_14": "and when the Koran is recited to them that they do not prostrate!\n",
        "TRANSLATION_15": "And when the Quran is read to them, they do not bow down?\n",
        "TRANSLATION_16": "And when the Qur'an is recited to them, they do not prostrate [to Allah]?\n",
        "TRANSLATION_17": "[84:21] and, what is wrong with them, that when the Qur’ān is recited to them they do not prostrate?, they [do not] submit by believing in it, given its inimitability?\n",
        "TRANSLATION_18": "743 (And, when the Qur'an is recited unto them) and when Muhammad (pbuh) recites the Qur'an to them explaining the commands and prohibitions, (worship not (Allah)) do not submit to Allah by believing in Allah's divine Oneness?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "84:21",
            "73:4",
            "20:2",
            "55:2",
            "41:26",
            "76:23",
            "7:204",
            "47:24",
            "37:13",
            "17:45"
        ],
        "BIBLE": [
            "writings:proverbs:11:5",
            "torah:genesis:21:13",
            "writings:job:39:27",
            "writings:daniel:5:8",
            "writings:psalms:119:35",
            "torah:numbers:14:12",
            "prophets:zechariah:12:2",
            "writings:psalms:119:98",
            "prophets:ezekiel:11:13",
            "torah:genesis:46:3"
        ]
    }
}