{
    "VERSE": "84:23",
    "ARABIC": "وَٱللَّهُ أَعْلَمُ بِمَا يُوعُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "But Allah knows best what they are storing in their hearts.",
        "TRANSLATION_1": "But God knows what they harbour in their breasts.\n",
        "TRANSLATION_2": "Allah knows best what they are accumulating (in their Record).\n",
        "TRANSLATION_3": "but God knows best whatever they accumulate in their hearts.\n",
        "TRANSLATION_4": "And Allah well knows what they conceal in their hearts.\n",
        "TRANSLATION_5": "And Allah knows best what they gather,\n",
        "TRANSLATION_6": "And Allah knows best what they hide,\n",
        "TRANSLATION_7": "and God knows very well what they are secreting.\n",
        "TRANSLATION_8": "And Allah knoweth best what they are hiding.\n",
        "TRANSLATION_9": "God is quite aware of what they are storing in their hearts.\n",
        "TRANSLATION_10": "Whereas Allah knoweth best that which they cherish.\n",
        "TRANSLATION_11": "and Allah knows best what they keep to themselves.\n",
        "TRANSLATION_12": "But Allah has full knowledge of what they secrete (in their breasts)\n",
        "TRANSLATION_13": "And Allah knows best what they gather (of good and bad deeds),\n",
        "TRANSLATION_14": "and Allah knows very well what they gather.\n",
        "TRANSLATION_15": "But God knows what they hide inside.\n",
        "TRANSLATION_16": "And Allah is most knowing of what they keep within themselves.\n",
        "TRANSLATION_17": "[84:23] and God knows best what they are amassing, accumulating in their scrolls, in the way of disbelief, denial   and evil deeds.\n",
        "TRANSLATION_18": "(And Allah knoweth best what they are hiding) and Allah knows best what they say and do; and it is also said this means: Allah knows best what they hear and hide in their hearts.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "84:23",
            "22:68",
            "3:66",
            "5:61",
            "3:63",
            "28:56",
            "62:7",
            "2:95",
            "47:9",
            "4:147"
        ],
        "BIBLE": [
            "writings:psalms:44:22",
            "writings:proverbs:24:12",
            "writings:psalms:125:4",
            "prophets:isaiah:44:18",
            "writings:psalms:73:1",
            "prophets:jeremiah:3:15",
            "writings:psalms:139:23",
            "prophets:jeremiah:24:7",
            "writings:i%20chronicles:28:9",
            "writings:job:10:13"
        ]
    }
}