{
    "VERSE": "97:4",
    "ARABIC": "تَنَزَّلُ ٱلْمَلَٰٓئِكَةُ وَٱلرُّوحُ فِيهَا بِإِذْنِ رَبِّهِم مِّن كُلِّ أَمْرٍ",
    "ENGLISH": {
        "TRANSLATION_0": "In it the angels and the Ruh descend by their Lord's authority with every ordinance.",
        "TRANSLATION_1": "On (this night) the angels and grace descend by the dispensation of their Lord, for settling all affairs.\n",
        "TRANSLATION_2": "The angels along with the Spirit descend in it by the permission of their Lord with all kinds of decrees.\n",
        "TRANSLATION_3": "On this Night, the angels and the spirit descend by the permission of their Lord with His decree (to determine everyone's destiny).\n",
        "TRANSLATION_4": "In it descend the angels and Jibreel, by the command of their Lord – for all works.\n",
        "TRANSLATION_5": "Therein descend the angels and the Ruh by their Lord's permission with every matter.\n",
        "TRANSLATION_6": "The angels and Jibreel descend in it by the permission of their Lord for every affair,\n",
        "TRANSLATION_7": "in it the angels and the Spirit descend, by the leave of their Lord, upon every command.\n",
        "TRANSLATION_8": "The angels and the Spirit descend therein, by the permission of their Lord, with all decrees.\n",
        "TRANSLATION_9": "on that night, the angels and the Spirit come down by the permission of their Lord with His decrees for all matters;\n",
        "TRANSLATION_10": "The angels and the spirit descend therein by the command of their Lord with His decrees for every affair.\n",
        "TRANSLATION_11": "In it the angels and the Spirit descend, by the leave of their Lord, with every command.\n",
        "TRANSLATION_12": "Therein come down the angels and the Spirit by Allah's permission, on every errand:\n",
        "TRANSLATION_13": "Therein descend the angels and the Ruh [Jibrael (Gabriel)] by Allah's Permission with all Decrees,\n",
        "TRANSLATION_14": "in it the angels and the Spirit (Gabriel) descend by the permission of their Lord upon every command.\n",
        "TRANSLATION_15": "In it descend the angels and the Spirit, by the leave of their Lord, with every command.\n",
        "TRANSLATION_16": "The angels and the Spirit descend therein by permission of their Lord for every matter.\n",
        "TRANSLATION_17": "[97:4] The angels and the Spirit, namely, Gabriel, descend (tanazzalu: one of the two original tā’ letters [of tatanazzalu] has been omitted) in it, on that night, by the leave of their Lord, by His command, with every command, that God has decreed from that year to the following one (min is causative functioning as bi, ‘with’).\n",
        "TRANSLATION_18": "(The angels and the Spirit) Gabriel with them (descend therein) at the beginning of the Night of Power, (by the permission of their Lord) by the command of their Lord, (with all decrees.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "97:4",
            "17:85",
            "89:22",
            "14:25",
            "14:23",
            "21:93",
            "21:81",
            "44:4",
            "40:27",
            "54:3"
        ],
        "BIBLE": [
            "writings:psalms:111:2",
            "prophets:isaiah:45:11",
            "writings:i%20chronicles:28:19",
            "prophets:isaiah:19:14",
            "writings:psalms:46:9",
            "writings:psalms:78:4",
            "writings:psalms:86:8",
            "writings:psalms:77:7",
            "writings:psalms:111:4",
            "writings:psalms:40:6"
        ]
    }
}