{
    "VERSE": "97:5",
    "ARABIC": "سَلَٰمٌ هِىَ حَتَّىٰ مَطْلَعِ ٱلْفَجْرِ",
    "ENGLISH": {
        "TRANSLATION_0": "It is Peace - until the coming of the dawn.",
        "TRANSLATION_1": "It is peace till the dawning of the day.\n",
        "TRANSLATION_2": "All peace is that night until the rise of dawn.\n",
        "TRANSLATION_3": "This Night is all peace until the break of dawn.\n",
        "TRANSLATION_4": "It is peace until the rising of dawn.\n",
        "TRANSLATION_5": "There is peace until the appearance of dawn.\n",
        "TRANSLATION_6": "Peace! it is till the break of the morning.\n",
        "TRANSLATION_7": "Peace it is, till the rising of dawn.\n",
        "TRANSLATION_8": "(The night is) Peace until the rising of the dawn.\n",
        "TRANSLATION_9": "it is all peace till the break of dawn.\n",
        "TRANSLATION_10": "It is all peace, until the rising of the dawn.\n",
        "TRANSLATION_11": "It is peaceful until the rising of the dawn.\n",
        "TRANSLATION_12": "Peace!... This until the rise of morn!\n",
        "TRANSLATION_13": "Peace! (All that night, there is Peace and Goodness from Allah to His believing slaves) until the appearance of dawn.\n",
        "TRANSLATION_14": "Peace it is, till the break of dawn.\n",
        "TRANSLATION_15": "Peace it is; until the rise of dawn.\n",
        "TRANSLATION_16": "Peace it is until the emergence of dawn.\n",
        "TRANSLATION_17": "[97:5] It is peaceful (salāmun hiya: a predicate preceding the subject) until the rising of the dawn (read matla‘ or matli‘), until the time it rises: it is peaceful because of the numerous salutations [of peace] (salām) spoken in it by the angels, who, every time they come across a believing man or believing woman, bid him peace.\n",
        "TRANSLATION_18": "(That night is) Peace) He says: they greet the greeting of peace those who fast and those who pray, on that day, from among the nation of the Prophet Muhammad (pbuh) (until the rising of the dawn) He says: its merit and grace lasts until the rise of dawn'. And of the surah in which the Clear Proof is mentioned, which is all Meccan and consists of 9 verses, 35 words and 149 letters: Surah 98: The Clear Proof (al-Bayyinah) And of the surah in which the Clear Proof is mentioned, which is all Meccan and consists of 9 verses, 35 words and 149 letters:\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "97:5",
            "89:1",
            "37:181",
            "37:79",
            "15:46",
            "37:130",
            "37:109",
            "25:75",
            "13:24",
            "37:120"
        ],
        "BIBLE": [
            "prophets:isaiah:28:19",
            "torah:genesis:1:13",
            "torah:genesis:1:5",
            "writings:psalms:42:4",
            "writings:proverbs:7:9",
            "torah:genesis:1:23",
            "writings:psalms:72:7",
            "torah:genesis:1:19",
            "writings:psalms:22:3",
            "prophets:isaiah:38:13"
        ]
    }
}