{
    "VERSE": "15:1",
    "ARABIC": "بِسْمِ ٱللَّهِ ٱلرَّحْمَٰنِ ٱلرَّحِيمِ الٓر تِلْكَ ءَايَٰتُ ٱلْكِتَٰبِ وَقُرْءَانٍ مُّبِينٍ",
    "ENGLISH": {
        "TRANSLATION_0": "Alif Lam Ra. Those are the Signs of the Book and a clear Qur'an.",
        "TRANSLATION_1": "ALIF LAM RA. These are the verses of the Book and the perspicuous oration.\n",
        "TRANSLATION_2": "Alif. Lam. Ra'. These are the verses of the Book, and a Clear Qur'an.\n",
        "TRANSLATION_3": "Alif. Lam. Ra. These are the verses of the Book and the glorious Quran.\n",
        "TRANSLATION_4": "Alif-Lam-Ra; these are verses of the Book and the bright Qur’an.\n",
        "TRANSLATION_5": "Alif-Lam-Ra. These are Ayat of the Book and a plain Qur'an.\n",
        "TRANSLATION_6": "Alif Lam Ra. These are the verses of the Book and (of) a Quran that makes (things) clear.\n",
        "TRANSLATION_7": "Alif Lam Ra. Those are the signs of the Book and of a manifest Koran.\n",
        "TRANSLATION_8": "Alif. Lam. Ra. These are verses of the Scripture and a plain Reading.\n",
        "TRANSLATION_9": "Alif Lam Ra. These are the verses of a clear Book, the Quran.\n",
        "TRANSLATION_10": "Alif. Lam. Ra. These are the verses of the Book, and a Qur'an luminous.\n",
        "TRANSLATION_11": "Alif, Lam, Ra. These are the signs of the Book and a manifest Quran.\n",
        "TRANSLATION_12": "A. L. R. These are the Ayats of Revelation,- of a Qur'an that makes things clear.\n",
        "TRANSLATION_13": "Alif-Lam-Ra. [These letters are one of the miracles of the Quran, and none but Allah (Alone) knows their meanings]. These are the Verses of the Book, and a plain Quran.\n",
        "TRANSLATION_14": "AlifLaamRa. Those are the verses of the Book, the Clear Koran.\n",
        "TRANSLATION_15": "Alif, Lam, Ra. These are the Verses of the Book; a Quran that makes things clear.\n",
        "TRANSLATION_16": "Alif, Lam, Ra. These are the verses of the Book and a clear Qur'an.\n",
        "TRANSLATION_17": "[15:1] Alif lām rā’: God knows best what He means by these [letters]. Those — these verses — are the verses of the Book, the Qur’ān (āyātu’l-kitābi: this annexation functions in the sense of min, ‘from’) and of a manifest Qur’ān, one that makes evident what is truth and what is falsehood (wa-qur’ānin mubīnin is [made up of] a supplement with an added adjectival qualification).\n",
        "TRANSLATION_18": "And from his chain of transmitters on the authority of Ibn 'Abbas that he said in explanation of Allah's saying (Alif. Lam. Ra.): '(Alif. Lam. Ra.) He says: I am Allah, and I see; it is also said that this is an oath, Allah swore by the Alif and by the Lam and by the Ra. (These are verses of the Scripture) this surah consists of verses from the Scripture (and a plain Reading) He says: I swear by the Qur'an which makes plain the lawful and the prohibited, the commands and prohibitions.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "15:1",
            "27:1",
            "12:1",
            "28:2",
            "26:2",
            "10:1",
            "31:2",
            "41:3",
            "29:47",
            "52:2"
        ],
        "BIBLE": [
            "prophets:ii%20samuel:7:21",
            "writings:daniel:5:15",
            "writings:job:13:23",
            "writings:i%20chronicles:17:19",
            "prophets:isaiah:42:16",
            "writings:daniel:4:3",
            "prophets:nahum:3:6",
            "prophets:isaiah:42:21",
            "prophets:isaiah:40:3",
            "writings:psalms:25:14"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:2",
            "Sefer%20Yetzirah:1:2",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:1:10"
        ]
    }
}