{
    "VERSE": "15:11",
    "ARABIC": "وَمَا يَأْتِيهِم مِّن رَّسُولٍ إِلَّا كَانُوا۟ بِهِۦ يَسْتَهْزِءُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "No Messenger came to them without their mocking him.",
        "TRANSLATION_1": "But never once an apostle came to them at whom they did not scoff.\n",
        "TRANSLATION_2": "And whenever a Messenger came to them, they never failed to mock him.\n",
        "TRANSLATION_3": "No Messenger went to them whom they did not mock.\n",
        "TRANSLATION_4": "And never does a Noble Messenger come to them, but they mock at him.\n",
        "TRANSLATION_5": "And there never came a Messenger to them but that they mocked him.\n",
        "TRANSLATION_6": "And there never came an apostle to them but they mocked him.\n",
        "TRANSLATION_7": "and not a single Messenger came to them, but they mocked at him;\n",
        "TRANSLATION_8": "And never came there unto them a messenger but they did mock him.\n",
        "TRANSLATION_9": "but there was never a messenger who came to them but they mocked him:\n",
        "TRANSLATION_10": "And not an apostle came unto them but at him they were wont to mock.\n",
        "TRANSLATION_11": "and there did not come to them any apostle but that they used to deride him.\n",
        "TRANSLATION_12": "But never came a messenger to them but they mocked him.\n",
        "TRANSLATION_13": "And never came a Messenger to them but they did mock him.\n",
        "TRANSLATION_14": "But no Messenger came to them except he was mocked.\n",
        "TRANSLATION_15": "But no messenger came to them, but they ridiculed him.\n",
        "TRANSLATION_16": "And no messenger would come to them except that they ridiculed him.\n",
        "TRANSLATION_17": "[15:11] And never did a messenger come to them but that they mocked him, in the same way that your people have mocked you — this is meant to comfort the Prophet (s).\n",
        "TRANSLATION_18": "(And never came there unto them a messenger) who was sent to them (but they did mock him) but they did deride the messenger.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "15:11",
            "51:52",
            "23:69",
            "36:30",
            "46:9",
            "21:41",
            "43:7",
            "51:45",
            "83:33",
            "77:11"
        ],
        "BIBLE": [
            "prophets:ii%20samuel:11:22",
            "writings:ruth:1:19",
            "torah:numbers:22:39",
            "writings:psalms:51:2",
            "torah:numbers:22:36",
            "torah:exodus:40:32",
            "prophets:i%20samuel:30:21",
            "prophets:i%20samuel:19:23",
            "prophets:judges:11:18",
            "prophets:ii%20kings:2:23"
        ]
    }
}