{
    "VERSE": "15:13",
    "ARABIC": "لَا يُؤْمِنُونَ بِهِۦ وَقَدْ خَلَتْ سُنَّةُ ٱلْأَوَّلِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "They do not have iman in it, even though the example of the previous peoples has gone before.",
        "TRANSLATION_1": "So, they will not believe in it: The example of former people is there.\n",
        "TRANSLATION_2": "they do not believe in it. This has been the wont of people of this kind from ancient times.\n",
        "TRANSLATION_3": "They do not believe in the Truth and they exactly follow the tradition of the ancient (unbelievers)\n",
        "TRANSLATION_4": "They do not believe in him, and the tradition of earlier nations has passed.\n",
        "TRANSLATION_5": "They would not believe in it (the Qur'an); and already the example of the ancients has gone forth.\n",
        "TRANSLATION_6": "They do not believe in it, and indeed the example of the former people has already passed.\n",
        "TRANSLATION_7": "they believe not in it, though the wont of the ancients is already gone.\n",
        "TRANSLATION_8": "They believe not therein, though the example of the men of old hath gone before.\n",
        "TRANSLATION_9": "They will not believe in it, though they have before them the example of former peoples,\n",
        "TRANSLATION_10": "They believe not therein, and already the example of the ancients hath gone forth.\n",
        "TRANSLATION_11": "they do not believe in it, and the precedent of the ancients has already passed.\n",
        "TRANSLATION_12": "That they should not believe in the (Message); but the ways of the ancients have passed away.\n",
        "TRANSLATION_13": "They would not believe in it (the Quran), and already the example of (Allah's punishment of) the ancients (who disbelieved) has gone forth.\n",
        "TRANSLATION_14": "They do not believe in it even though the practice of the ancients has already gone.\n",
        "TRANSLATION_15": "They do not believe in it, though the ways of the ancients have passed away.\n",
        "TRANSLATION_16": "They will not believe in it, while there has already occurred the precedent of the former peoples.\n",
        "TRANSLATION_17": "[15:13] They do not believe in him, in the Prophet (s), even though the example of the men of old has already gone   before, that is, the way of God [in dealing] with them [those of old], by chastising them for denying [the truthfulness of] their prophets: those [Meccans] are like these former.\n",
        "TRANSLATION_18": "(They believe not therein) such that they do not believe in Muhammad (pbuh) or in the Qur'an, or that chastisement will descend upon them, (though the example of the men of old have gone before) when they denied the messengers, just as your people have denied you, and Allah's norm concerning them was to punish and destroy them because of their denial.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "15:13",
            "8:38",
            "39:12",
            "35:43",
            "56:62",
            "43:6",
            "37:59",
            "77:16",
            "20:21",
            "44:35"
        ],
        "BIBLE": [
            "prophets:joshua:2:5",
            "prophets:judges:19:14",
            "prophets:i%20samuel:30:21",
            "prophets:joshua:8:14",
            "prophets:i%20kings:18:6",
            "prophets:ezekiel:36:20",
            "prophets:ii%20kings:6:19",
            "prophets:joshua:2:7",
            "prophets:judges:2:19",
            "prophets:joshua:7:4"
        ]
    }
}