{
    "VERSE": "15:14",
    "ARABIC": "وَلَوْ فَتَحْنَا عَلَيْهِم بَابًا مِّنَ ٱلسَّمَآءِ فَظَلُّوا۟ فِيهِ يَعْرُجُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Even if We opened up to them a door into heaven, and they spent the day ascending through it,",
        "TRANSLATION_1": "Even if We open a door in the heavens and they ascend through it in broad daylight,\n",
        "TRANSLATION_2": "If We were even to open for them a way to the heavens, and they could continually climb up to it in broad daylight,\n",
        "TRANSLATION_3": "Had We opened a door for them in the sky through which they could easily pass,\n",
        "TRANSLATION_4": "And if We open for them a gate in the heavens, to ascend it through the day –\n",
        "TRANSLATION_5": "And even if We opened to them a gate to the heavens and they were to continue ascending through it (all day long).\n",
        "TRANSLATION_6": "And even if We open to them a gateway of heaven, so that they ascend into it all the while,\n",
        "TRANSLATION_7": "Though We opened to them a gate in heaven, and still they mounted through it,\n",
        "TRANSLATION_8": "And even if We opened unto them a gate of heaven and they kept mounting through it,\n",
        "TRANSLATION_9": "and even if We opened to them a door from heaven, and they began ascending through it,\n",
        "TRANSLATION_10": "And if We opened upon them a door of the heaven, and they passed the day mounting thereto.\n",
        "TRANSLATION_11": "Were We to open for them a gate of the sky, so that they could go on ascending through it,\n",
        "TRANSLATION_12": "Even if We opened out to them a gate from heaven, and they were to continue (all day) ascending therein,\n",
        "TRANSLATION_13": "And even if We opened to them a gate from the heaven and they were to continue ascending thereto,\n",
        "TRANSLATION_14": "If We opened a gate in the heaven and they kept ascending through it,\n",
        "TRANSLATION_15": "Even if We opened for them a gateway into the sky, and they began to ascend through it.\n",
        "TRANSLATION_16": "And [even] if We opened to them a gate from the heaven and they continued therein to ascend,\n",
        "TRANSLATION_17": "[15:14] And even if We were to open for them a gate from the heaven, and they were to continue ascending through it, the gate,\n",
        "TRANSLATION_18": "(And even if We opened unto them) unto the people of Mecca (a Gate of Heaven) from which to enter (and they kept mounting through it) and they kept ascending and descending through it, i.e. like the angels.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "15:14",
            "78:19",
            "54:11",
            "86:1",
            "44:29",
            "52:44",
            "91:5",
            "77:9",
            "81:11",
            "69:16"
        ],
        "BIBLE": [
            "writings:nehemiah:13:19",
            "writings:esther:2:21",
            "prophets:judges:19:14",
            "prophets:ezekiel:1:1",
            "torah:exodus:16:22",
            "writings:psalms:42:5",
            "torah:deuteronomy:2:8",
            "writings:psalms:32:3",
            "writings:psalms:37:5",
            "torah:deuteronomy:27:4"
        ]
    }
}