{
    "VERSE": "15:15",
    "ARABIC": "لَقَالُوٓا۟ إِنَّمَا سُكِّرَتْ أَبْصَٰرُنَا بَلْ نَحْنُ قَوْمٌ مَّسْحُورُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "they would only say, 'Our eyesight is befuddled! Or rather we have been put under a spell!'",
        "TRANSLATION_1": "They will say all the same: \"Our eyes were dazed (and clouded over). We were a people ensorcelled.\"\n",
        "TRANSLATION_2": "they would still have said: \"Surely our eyes have been dazzled; rather, we have been enchanted.\"\n",
        "TRANSLATION_3": "they would have said, \"Our eyes are bewildered and we have been affected by magic.\"\n",
        "TRANSLATION_4": "Even then they would say, “Our sights have been hypnotised – in fact, a magic spell has been cast upon us.”\n",
        "TRANSLATION_5": "They would surely say (in the evening): \"Our eyes have been (as if) dazzled (we have not seen any angel or heaven). Nay, we are a people bewitched.\"\n",
        "TRANSLATION_6": "They would certainly say: Only our eyes have been covered over, rather we are an enchanted people.\n",
        "TRANSLATION_7": "yet would they say, 'Our eyes have been dazzled; nay, we are a people bewitched!'\n",
        "TRANSLATION_8": "They would say: Our sight is wrong - nay, but we are folk bewitched.\n",
        "TRANSLATION_9": "they would still say, \"Our eyes have been dazzled. We are bewitched.\"\n",
        "TRANSLATION_10": "They would surely say: intoxicated have been our sights; aye! we are a people enchanted.\n",
        "TRANSLATION_11": "they would surely say, ‘Indeed a spell has been cast on our eyes; indeed, we are a bewitched lot.’\n",
        "TRANSLATION_12": "They would only say: \"Our eyes have been intoxicated: Nay, we have been bewitched by sorcery.\"\n",
        "TRANSLATION_13": "They would surely say: \"Our eyes have been (as if) dazzled. Nay, we are a people bewitched.\"\n",
        "TRANSLATION_14": "still they would say: 'Our eyes were dazzled; truly, we must have been a bewitched people'\n",
        "TRANSLATION_15": "They would still say, “Our eyes are hallucinating; in fact, we are people bewitched.”\n",
        "TRANSLATION_16": "They would say, \"Our eyes have only been dazzled. Rather, we are a people affected by magic.\"\n",
        "TRANSLATION_17": "[15:15] they would say, ‘It is merely that our eyes have been dazzled, they have been shut. Nay, we are a folk bewitched!’, imagining this.\n",
        "TRANSLATION_18": "(They) the disbeliever of Mecca (would say: Our sight is wrong) our sight is gone (nay, but we are folk bewitched) our minds have been seized; we have been bewitched.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "15:15",
            "51:32",
            "15:58",
            "26:117",
            "15:62",
            "51:53",
            "43:54",
            "43:44",
            "14:42",
            "79:9"
        ],
        "BIBLE": [
            "torah:numbers:14:14",
            "prophets:judges:6:22",
            "prophets:ii%20kings:9:26",
            "prophets:isaiah:6:5",
            "prophets:jeremiah:15:1",
            "prophets:ezekiel:38:16",
            "prophets:isaiah:60:2",
            "torah:deuteronomy:21:7",
            "prophets:ii%20kings:6:20",
            "prophets:joshua:24:7"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:7"
        ]
    }
}