{
    "VERSE": "15:16",
    "ARABIC": "وَلَقَدْ جَعَلْنَا فِى ٱلسَّمَآءِ بُرُوجًا وَزَيَّنَّٰهَا لِلنَّٰظِرِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "We have placed constellations in heaven and made them beautiful for those who look.",
        "TRANSLATION_1": "We have placed the signs of the Zodiac in the sky, and decked it out for those who can see;\n",
        "TRANSLATION_2": "We have indeed set constellations in the heavens and have beautified them for the beholders,\n",
        "TRANSLATION_3": "We have made constellations in the sky and decorated them for the onlookers.\n",
        "TRANSLATION_4": "And indeed We created towers in the skies, and beautified it for the beholders.\n",
        "TRANSLATION_5": "And indeed, We have put the big stars in the heaven and We beautified it for the beholders.\n",
        "TRANSLATION_6": "And certainly We have made strongholds in the heaven and We have made it fair seeming to the beholders.\n",
        "TRANSLATION_7": "We have set in heaven constellations and decked them out fair to the beholders,\n",
        "TRANSLATION_8": "And verily in the heaven we have set mansions of the stars, and We have beautified it for beholders.\n",
        "TRANSLATION_9": "We have placed constellations in heaven and have beautified it for beholders,\n",
        "TRANSLATION_10": "And assuredly We have set constellations in the heaven and made it fairseeming unto the beholders\n",
        "TRANSLATION_11": "Certainly We have appointed houses in the sky and adorned them for the onlookers,\n",
        "TRANSLATION_12": "It is We Who have set out the zodiacal signs in the heavens, and made them fair-seeming to (all) beholders;\n",
        "TRANSLATION_13": "And indeed, We have put the big stars in the heaven and We beautified it for the beholders.\n",
        "TRANSLATION_14": "We have set constellations in the heavens and made them pleasing to the beholders,\n",
        "TRANSLATION_15": "We placed constellations in the sky, and made them beautiful to the beholders.\n",
        "TRANSLATION_16": "And We have placed within the heaven great stars and have beautified it for the observers.\n",
        "TRANSLATION_17": "[15:16] And verily We have placed in the heaven constellations, twelve [of them]: Aries, Taurus, Gemini, Cancer, Leo, Virgo (al-sunbula), Libra, Scorpio, Sagittarius, Capricorn, Aquarius and Pisces, which are the mansions of the seven orbiting planets: Mars rules Aries and Scorpio, Venus: Taurus and Libra, Mercury: Gemini and Virgo, the Moon: Cancer, the Sun: Leo, Jupiter: Sagittarius and Pisces, and Saturn: Capricorn and Aquarius; and We have adorned it, with [these] planets, for beholders;\n",
        "TRANSLATION_18": "(And verily in the heaven We have set mansions of the stars) by means of which people are guided in the darkness of the sea or land; it is also said that this means: castles, (and We have beautified it) the sky by means of the stars (for beholders) who look at it.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "15:16",
            "25:61",
            "85:1",
            "91:5",
            "51:47",
            "86:1",
            "28:51",
            "15:24",
            "81:11",
            "77:9"
        ],
        "BIBLE": [
            "prophets:ezekiel:4:3",
            "prophets:jeremiah:32:34",
            "writings:ii%20chronicles:24:8",
            "writings:i%20chronicles:29:3",
            "prophets:ezekiel:12:6",
            "writings:psalms:78:43",
            "prophets:isaiah:14:1",
            "prophets:habakkuk:2:9",
            "writings:psalms:122:5",
            "prophets:i%20kings:8:27"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:3",
            
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:2:5"
        ]
    }
}