{
    "VERSE": "15:18",
    "ARABIC": "إِلَّا مَنِ ٱسْتَرَقَ ٱلسَّمْعَ فَأَتْبَعَهُۥ شِهَابٌ مُّبِينٌ",
    "ENGLISH": {
        "TRANSLATION_0": "except for the one who listens stealthily, and he is followed by an open flame.",
        "TRANSLATION_1": "Except the ones who listen on the sly, yet they are chased away by a shooting flame.\n",
        "TRANSLATION_2": "save him who may eavesdrop, and then a bright flame pursues him.\n",
        "TRANSLATION_3": "except for those who stealthily try to listen to the heavens, but who are chased away by a bright flame.\n",
        "TRANSLATION_4": "Except one who comes to eavesdrop – therefore a bright flame goes after him.\n",
        "TRANSLATION_5": "Except him (devil) who steals the hearing, then he is pursued by a clear flaming fire.\n",
        "TRANSLATION_6": "But he who steals a hearing, so there follows him a visible flame.\n",
        "TRANSLATION_7": "excepting such as listens by stealth -- and he is pursued by a manifest flame.\n",
        "TRANSLATION_8": "Save him who stealeth the hearing, and them doth a clear flame pursue.\n",
        "TRANSLATION_9": "but if anyone eavesdrops, he is pursued by a bright flaming fire.\n",
        "TRANSLATION_10": "Save him who stealeth the hearing, and him there followeth a flame gleaming.\n",
        "TRANSLATION_11": "except someone who may eavesdrop, whereat there pursues him a manifest flame.\n",
        "TRANSLATION_12": "But any that gains a hearing by stealth, is pursued by a flaming fire, bright (to see).\n",
        "TRANSLATION_13": "Except him (devil) that gains hearing by stealing, he is pursued by a clear flaming fire.\n",
        "TRANSLATION_14": "Except for he who steals the listening and is then pursued by a visible flame.\n",
        "TRANSLATION_15": "Except one who steals a hearing, and is followed by a visible projectile.\n",
        "TRANSLATION_16": "Except one who steals a hearing and is pursued by a clear burning flame.\n",
        "TRANSLATION_17": "[15:18] except the one who listens by stealth — he is pursued by a clear flame, a shining meteor that burns him, or pierces him or drives him insane.\n",
        "TRANSLATION_18": "(Save him who stealeth the hearing, and them doth a clear flame pursue) they are pursued by a bright, burning star.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "15:18",
            "37:10",
            "72:9",
            "50:37",
            "26:212",
            "26:223",
            "29:5",
            "69:37",
            "56:79",
            "26:220"
        ],
        "BIBLE": [
            "prophets:joshua:2:22",
            "torah:deuteronomy:1:31",
            "torah:genesis:23:10",
            "prophets:judges:20:26",
            "torah:deuteronomy:1:19",
            "prophets:i%20samuel:6:9",
            "prophets:ii%20samuel:2:27",
            "prophets:i%20samuel:23:25",
            "prophets:ii%20samuel:2:24",
            "prophets:i%20kings:13:10"
        ]
    }
}