{
    "VERSE": "15:19",
    "ARABIC": "وَٱلْأَرْضَ مَدَدْنَٰهَا وَأَلْقَيْنَا فِيهَا رَوَٰسِىَ وَأَنۢبَتْنَا فِيهَا مِن كُلِّ شَىْءٍ مَّوْزُونٍ",
    "ENGLISH": {
        "TRANSLATION_0": "As for the earth, We stretched it out and cast firmly embedded mountains in it and made everything grow in due proportion on it.",
        "TRANSLATION_1": "We stretched the earth and placed upon it firm stabilisers, and made all things grow upon it balanced evenly.\n",
        "TRANSLATION_2": "As for the earth, We have stretched it out and have cast on it firm mountains, and have caused to grow in it everything well-measured.\n",
        "TRANSLATION_3": "We have spread out the earth, fixed mountains thereupon and caused everything to grow to its proper weight\n",
        "TRANSLATION_4": "And We spread out the earth, and placed mountains as anchors in it, and in it grew all things by a proper measure.\n",
        "TRANSLATION_5": "And We have spread out the earth, and have placed firm mountains in it, and caused all kinds of things to grow in it, in due proportion.\n",
        "TRANSLATION_6": "And the earth-- We have spread it forth and made in it firm mountains and caused to grow in it of every suitable thing.\n",
        "TRANSLATION_7": "And the earth -- We stretched it forth, and cast on it firm mountains, and We caused to grow therein of every thing justly weighed,\n",
        "TRANSLATION_8": "And the earth have We spread out, and placed therein firm hills, and caused each seemly thing to grow therein.\n",
        "TRANSLATION_9": "We have spread out the earth, and set upon it firm mountains and caused everything to grow in due proportion.\n",
        "TRANSLATION_10": "And the earth! We have stretched it out and have cast thereon mountains firm, and We have caused to spring up thereon everything weighed.\n",
        "TRANSLATION_11": "And We spread out the earth, and cast in it firm mountains, and We grew in it every kind of balanced thing,\n",
        "TRANSLATION_12": "And the earth We have spread out (like a carpet); set thereon mountains firm and immovable; and produced therein all kinds of things in due balance.\n",
        "TRANSLATION_13": "And the earth We spread out, and placed therein firm mountains, and caused to grow therein all kinds of things in due proportion.\n",
        "TRANSLATION_14": "We have spread out the earth and set upon it firm mountains. Everything We have caused to grow therein is justly weighed;\n",
        "TRANSLATION_15": "We spread the earth, and placed stabilizers in it, and in it We grew all things in proper measure.\n",
        "TRANSLATION_16": "And the earth - We have spread it and cast therein firmly set mountains and caused to grow therein [something] of every well-balanced thing.\n",
        "TRANSLATION_17": "[15:19] And the earth We have stretched it out, spread it flat, and cast therein firm mountains, lest it should sway beneath its inhabitants, and caused to grow therein every kind of balanced thing, [every kind of thing] known and determined.\n",
        "TRANSLATION_18": "(And the earth have We spread out) on water, (and placed therein) on the earth (firm hills) firm mountains as poles, (and caused each seemly thing) of vegetation and fruits in measured and known quantities. It is said this means: from every thing measured such as gold, silver, ore, copper, etc., (to grow therein) on the mountains; and it is said: on the earth.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "15:19",
            "18:84",
            "54:52",
            "21:81",
            "50:7",
            "4:126",
            "57:2",
            "26:183",
            "25:2",
            "30:26"
        ],
        "BIBLE": [
            "prophets:isaiah:40:12",
            "prophets:isaiah:44:24",
            "writings:psalms:17:11",
            "prophets:ezekiel:7:20",
            "prophets:zechariah:5:8",
            "prophets:jeremiah:7:30",
            "writings:esther:3:1",
            "prophets:isaiah:42:5",
            "prophets:ezekiel:21:27",
            "prophets:i%20kings:6:27"
        ]
    }
}