{
    "VERSE": "15:21",
    "ARABIC": "وَإِن مِّن شَىْءٍ إِلَّا عِندَنَا خَزَآئِنُهُۥ وَمَا نُنَزِّلُهُۥٓ إِلَّا بِقَدَرٍ مَّعْلُومٍ",
    "ENGLISH": {
        "TRANSLATION_0": "There is nothing that does not have its stores with Us and We only send it down in a known measure.",
        "TRANSLATION_1": "Of all things there are We have the stores, and send them down in determined measure.\n",
        "TRANSLATION_2": "There is nothing except that its treasuries are with Us and We do not send it down except in a known measure.\n",
        "TRANSLATION_3": "With Us is the source of everything and We do not send it down except in a known quantity.\n",
        "TRANSLATION_4": "And there is not a thing the treasure* of which is not with Us; and We do not send it down except by a known measure. (* The power to create it.)\n",
        "TRANSLATION_5": "And there is not a thing, but the supplies for it are with Us, and We do not send it down but in a known measure.\n",
        "TRANSLATION_6": "And there is not a thing but with Us are the treasures of it, and We do not send it down but in a known measure.\n",
        "TRANSLATION_7": "Naught is there, but its treasuries are with Us, and We send it not down but in a known measure.\n",
        "TRANSLATION_8": "And there is not a thing but with Us are the stores thereof. And we send it not down save in appointed measure.\n",
        "TRANSLATION_9": "There is not a thing but its storehouses are with Us. But We only send down each thing in an appropriate measure:\n",
        "TRANSLATION_10": "And there is not of aught but with Us are the treasures thereof, and We send it not down save in a measure known\n",
        "TRANSLATION_11": "There is not a thing but that its sources are with Us, and We do not send it down except in a known measure.\n",
        "TRANSLATION_12": "And there is not a thing but its (sources and) treasures (inexhaustible) are with Us; but We only send down thereof in due and ascertainable measures.\n",
        "TRANSLATION_13": "And there is not a thing, but with Us are the stores thereof. And We send it not down except in a known measure.\n",
        "TRANSLATION_14": "And there is not a thing but with Us are its treasuries, and We do not send it down except in a known measure.\n",
        "TRANSLATION_15": "There is not a thing but with Us are its stores, and We send it down only in precise measure.\n",
        "TRANSLATION_16": "And there is not a thing but that with Us are its depositories, and We do not send it down except according to a known measure.\n",
        "TRANSLATION_17": "[15:21] And there is not a thing but that the stores thereof, the keys to its stores, are with Us, and We do not send it down except in a known measure, according to the benefits [of all creatures].\n",
        "TRANSLATION_18": "(And there is not a thing) of vegetation, fruits or rains (but with Us are the stores thereof) except that We have its keys; its keys are in Our Hand not in yours. (And We send it) i.e. rain (not down save in appointed measure) with a specific quantity and weight known to the One Who stores it.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "15:21",
            "54:49",
            "13:8",
            "92:19",
            "51:42",
            "52:37",
            "53:28",
            "80:18",
            "26:208",
            "6:50"
        ],
        "BIBLE": [
            "writings:daniel:11:43",
            "writings:i%20chronicles:26:20",
            "prophets:ezekiel:40:35",
            "writings:esther:2:22",
            "writings:psalms:90:11",
            "writings:psalms:106:8",
            "prophets:isaiah:40:17",
            "prophets:isaiah:37:20",
            "prophets:ezekiel:40:24",
            "writings:i%20chronicles:29:17"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:2",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:2",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:4"
        ]
    }
}