{
    "VERSE": "15:23",
    "ARABIC": "وَإِنَّا لَنَحْنُ نُحْىِۦ وَنُمِيتُ وَنَحْنُ ٱلْوَٰرِثُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "It is We who give life and cause to die and We are the Inheritor.",
        "TRANSLATION_1": "It is We who give life and We who give death, and We are the One who will abide.\n",
        "TRANSLATION_2": "It is indeed We Who grant life and cause death and it is We who shall be the sole Inheritors of all.\n",
        "TRANSLATION_3": "It is We who give life and cause things to die and We are the sole Heirs.\n",
        "TRANSLATION_4": "And indeed it is We Who give life and it is We Who cause death, and We are the Inheritors.\n",
        "TRANSLATION_5": "And certainly We! It is We Who give life, and cause death, and We are the Inheritors.\n",
        "TRANSLATION_6": "And most surely We bring to life and cause to die and We are the heirs.\n",
        "TRANSLATION_7": "It is We who give life, and make to die, and it is We who are the inheritors.\n",
        "TRANSLATION_8": "Lo! and it is We, even We, Who quicken and give death, and We are the Inheritor.\n",
        "TRANSLATION_9": "Truly, it is We who bring to life and We who cause death and We are the inheritor of all things.\n",
        "TRANSLATION_10": "And verily We! it is We who give life and death, and We shall be the survivors.\n",
        "TRANSLATION_11": "Indeed it is We who give life and bring death and We are the inheritors.\n",
        "TRANSLATION_12": "And verily, it is We Who give life, and Who give death: it is We Who remain inheritors (after all else passes away).\n",
        "TRANSLATION_13": "And certainly We! We it is Who give life, and cause death, and We are the Inheritors.\n",
        "TRANSLATION_14": "And surely, it is We who give life and make to die. We are the Inheritor.\n",
        "TRANSLATION_15": "It is We who give life and cause death, and We are the Inheritors.\n",
        "TRANSLATION_16": "And indeed, it is We who give life and cause death, and We are the Inheritor.\n",
        "TRANSLATION_17": "[15:23] Indeed it is We Who give life and bring death, and We are the heirs, Who shall endure, inheriting all   creation.\n",
        "TRANSLATION_18": "(Lo! and it is We, even We, Who quicken) We resurrect (and give death) in this worldly life, (and We are the Inheritor) We are the Owners of what is in the heavens and in the earth after the death of its inhabitant and also before their death.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "15:23",
            "37:165",
            "37:166",
            "15:9",
            "7:114",
            "7:21",
            "69:49",
            "28:51",
            "15:95",
            "11:122"
        ],
        "BIBLE": [
            "prophets:isaiah:38:16",
            "prophets:jeremiah:15:14",
            "prophets:nahum:3:6",
            "writings:daniel:9:27",
            "torah:leviticus:5:13",
            "torah:leviticus:5:16",
            "torah:genesis:27:7",
            "prophets:ii%20samuel:3:13",
            "torah:numbers:31:23",
            "prophets:ii%20samuel:23:5"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:2",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:9"
        ]
    }
}