{
    "VERSE": "15:26",
    "ARABIC": "وَلَقَدْ خَلَقْنَا ٱلْإِنسَٰنَ مِن صَلْصَٰلٍ مِّنْ حَمَإٍ مَّسْنُونٍ",
    "ENGLISH": {
        "TRANSLATION_0": "We created mankind out of dried clay formed from fetid black mud.",
        "TRANSLATION_1": "Man We fashioned from fermented clay dried tingling hard,\n",
        "TRANSLATION_2": "Surely We brought man into being out of dry ringing clay which was wrought from black mud,\n",
        "TRANSLATION_3": "We have created the human being out of pure mud-moulded clay\n",
        "TRANSLATION_4": "Indeed We created man from sounding clay made out of black smelly mud.\n",
        "TRANSLATION_5": "And indeed, We created man from dried (sounding) clay of altered mud.\n",
        "TRANSLATION_6": "And certainly We created man of clay that gives forth sound, of black mud fashioned in shape.\n",
        "TRANSLATION_7": "Surely We created man of a clay of mud moulded,\n",
        "TRANSLATION_8": "Verily We created man of potter's clay of black mud altered,\n",
        "TRANSLATION_9": "We created man out of dry clay, from moulded mud,\n",
        "TRANSLATION_10": "And assuredly We have created human being from ringing clay of loam moulded.\n",
        "TRANSLATION_11": "Certainly We created man out of a dry clay [drawn] from an aging mud,\n",
        "TRANSLATION_12": "We created man from sounding clay, from mud moulded into shape;\n",
        "TRANSLATION_13": "And indeed, We created man from sounding clay of altered black smooth mud.\n",
        "TRANSLATION_14": "We created mankind from clay, molded from mud,\n",
        "TRANSLATION_15": "We created the human being from clay, from molded mud.\n",
        "TRANSLATION_16": "And We did certainly create man out of clay from an altered black mud.\n",
        "TRANSLATION_17": "[15:26] And verily We created man, Adam, out of a dry [clinking] clay, that gives off a clinking sound when it is tapped, of malleable mud, black [mud].\n",
        "TRANSLATION_18": "(Verily We created man) Adam (of potter's clay) of dry clay (of black mud altered) clay that stinks; it is also 274 said that this means: shaped clay.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "15:26",
            "23:12",
            "95:4",
            "55:14",
            "15:24",
            "99:3",
            "90:4",
            "15:28",
            "55:3",
            "15:33"
        ],
        "BIBLE": [
            "torah:genesis:24:19",
            "writings:i%20chronicles:21:5",
            "torah:numbers:31:47",
            "writings:ruth:4:7",
            "torah:genesis:24:43",
            "torah:deuteronomy:21:3",
            "prophets:judges:5:25",
            "prophets:ezekiel:29:20",
            "writings:daniel:8:12",
            "writings:psalms:60:13"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:3:5",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:11",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:4:9"
        ]
    }
}