{
    "VERSE": "15:27",
    "ARABIC": "وَٱلْجَآنَّ خَلَقْنَٰهُ مِن قَبْلُ مِن نَّارِ ٱلسَّمُومِ",
    "ENGLISH": {
        "TRANSLATION_0": "We created the jinn before out of the fire of a searing wind.",
        "TRANSLATION_1": "As We fashioned jinns before from intense radiated heat.\n",
        "TRANSLATION_2": "while We had brought the jinn into being before out of blazing fire.\n",
        "TRANSLATION_3": "and the jinn before (the human being) of smokeless fire.\n",
        "TRANSLATION_4": "And created the jinn before him, from smokeless fire.\n",
        "TRANSLATION_5": "And the Jinn, We created earlier from the smokeless flame of fire.\n",
        "TRANSLATION_6": "And the jinn We created before, of intensely hot fire.\n",
        "TRANSLATION_7": "and the jinn created We before of fire flaming.\n",
        "TRANSLATION_8": "And the jinn did We create aforetime of essential fire.\n",
        "TRANSLATION_9": "and the jinn We had created before from flaming fire.\n",
        "TRANSLATION_10": "And the Jinn, We had created them afore of the fire of the scroching wind.\n",
        "TRANSLATION_11": "and We created the jinn earlier, out of a piercing fire.\n",
        "TRANSLATION_12": "And the Jinn race, We had created before, from the fire of a scorching wind.\n",
        "TRANSLATION_13": "And the jinn, We created aforetime from the smokeless flame of fire.\n",
        "TRANSLATION_14": "and before him We created the jinn from smokeless fire.\n",
        "TRANSLATION_15": "And the jinn We created before, from piercing fire.\n",
        "TRANSLATION_16": "And the jinn We created before from scorching fire.\n",
        "TRANSLATION_17": "[15:27] And the jānn, the father of the jinn, namely, Iblīs, We created beforehand — that is, before the creation of Adam — out of the permeative fire, a smokeless fire that can escape through openings.\n",
        "TRANSLATION_18": "(And the jinn) the first father of the jinn (did We create aforetime) before the creation of Adam (pbuh) (of essential fire) of smokeless fire.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "15:27",
            "55:15",
            "2:21",
            "3:131",
            "14:50",
            "10:91",
            "40:72",
            "52:28",
            "69:9",
            "28:41"
        ],
        "BIBLE": [
            "prophets:ezekiel:1:4",
            "writings:lamentations:5:10",
            "prophets:jeremiah:4:11",
            "torah:deuteronomy:8:15",
            "prophets:isaiah:26:18",
            "prophets:isaiah:4:5",
            "prophets:isaiah:11:15",
            "torah:deuteronomy:28:22",
            "torah:genesis:2:19",
            "torah:exodus:12:17"
        ]
    }
}