{
    "VERSE": "15:28",
    "ARABIC": "وَإِذْ قَالَ رَبُّكَ لِلْمَلَٰٓئِكَةِ إِنِّى خَٰلِقٌۢ بَشَرًا مِّن صَلْصَٰلٍ مِّنْ حَمَإٍ مَّسْنُونٍ",
    "ENGLISH": {
        "TRANSLATION_0": "When your Lord said to the angels, 'I am creating a human being out of dried clay formed from fetid black",
        "TRANSLATION_1": "But when your Lord said to the angels: \"I am verily going to create a human being from fermented clay dried tingling hard;\n",
        "TRANSLATION_2": "Recall when your Lord said to the angels: \"I will indeed bring into being a human being out of dry ringing clay wrought from black mud.\n",
        "TRANSLATION_3": "When your Lord said to the angels, \"I will create the human being out of pure mud-moulded clay.\n",
        "TRANSLATION_4": "And recall when your Lord said to the angels, “I will create man from sounding clay made out of black smelly mud.”\n",
        "TRANSLATION_5": "And (remember) when your Lord said to the angels: \"I am going to create a man (Adam) from dried (sounding) clay of altered mud. \"\n",
        "TRANSLATION_6": "And when your Lord said to the angels: Surely I am going to create a mortal of the essence of black mud fashioned in shape.\n",
        "TRANSLATION_7": "And when thy Lord said to the angels, 'See, I am creating a mortal of a clay of mud moulded.\n",
        "TRANSLATION_8": "And (remember) when thy Lord said unto the angels: Lo! I am creating a mortal out of potter's clay of black mud altered,\n",
        "TRANSLATION_9": "Your Lord said to the angels, \"I am about to bring into being a man wrought from mud.\n",
        "TRANSLATION_10": "And recall what time thy Lord said unto the angels: verily I am about to createa man from ringing clay of loam moulded.\n",
        "TRANSLATION_11": "When your Lord said to the angels, ‘Indeed I am going to create a human out of a dry clay [drawn] from an aging mud.\n",
        "TRANSLATION_12": "Behold! thy Lord said to the angels: \"I am about to create man, from sounding clay from mud moulded into shape;\n",
        "TRANSLATION_13": "And (remember) when your Lord said to the angels: \"I am going to create a man (Adam) from sounding clay of altered black smooth mud.\n",
        "TRANSLATION_14": "When your Lord said to the angels: 'See, I am creating a mortal from clay of molded mud.\n",
        "TRANSLATION_15": "Your Lord said to the angels, “I am creating a human being from clay, from molded mud.”\n",
        "TRANSLATION_16": "And [mention, O Muhammad], when your Lord said to the angels, \"I will create a human being out of clay from an altered black mud.\n",
        "TRANSLATION_17": "[15:28] And, mention, when your Lord said to the angels, ‘Indeed I am going to create a mortal out of a dry clay [drawn] from a malleable mud.\n",
        "TRANSLATION_18": "(And (remember) when thy Lord said unto the angels) who were on the earth, there were 10,000 of them: (Lo! I am creating a mortal out of potter's clay of black mud altered) of stinking mud.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "15:28",
            "38:71",
            "15:33",
            "89:22",
            "8:9",
            "38:35",
            "15:26",
            "26:21",
            "26:83",
            "37:100"
        ],
        "BIBLE": [
            "prophets:i%20samuel:11:13",
            "torah:numbers:22:23",
            "prophets:i%20samuel:9:11",
            "writings:nehemiah:9:18",
            "torah:deuteronomy:21:3",
            "prophets:i%20kings:13:4",
            "prophets:joshua:5:13",
            "writings:ecclesiastes:12:1",
            "prophets:i%20kings:20:39",
            "torah:genesis:24:44"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:8",
            "Sefer%20Yetzirah:3:6"
        ]
    }
}