{
    "VERSE": "15:29",
    "ARABIC": "فَإِذَا سَوَّيْتُهُۥ وَنَفَخْتُ فِيهِ مِن رُّوحِى فَقَعُوا۟ لَهُۥ سَٰجِدِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "When I have formed him and breathed My Ruh into him, fall down in prostration in front of him!'",
        "TRANSLATION_1": "And when I have fashioned him and breathed into him of My spirit, bow before him in homage;\"\n",
        "TRANSLATION_2": "When I have completed shaping him and have breathed into him of My Spirit, then fall you down before him in prostration.\"\n",
        "TRANSLATION_3": "When it is properly shaped and I have blown My Spirit into it, you should then bow down in prostration\".\n",
        "TRANSLATION_4": "“Therefore when I have properly fashioned him and breathed into him a chosen noble soul from Myself, fall down before him in prostration.”\n",
        "TRANSLATION_5": "So, when I have fashioned him completely and breathed into him (Adam) of My spirit (the soul which I created for him,) then fall down, prostrating yourselves before him.\"\n",
        "TRANSLATION_6": "So when I have made him complete and breathed into him of My spirit, fall down making obeisance to him.\n",
        "TRANSLATION_7": "When I have shaped him, and breathed My spirit in him, fall you down, bowing before him!'\n",
        "TRANSLATION_8": "So, when I have made him and have breathed into him of My Spirit, do ye fall down, prostrating yourselves unto him.\n",
        "TRANSLATION_9": "When I have formed him and breathed My spirit into him, fall down in prostration before him,\"\n",
        "TRANSLATION_10": "Then when I have formed him and breathed into him of My Spirit fall down unto him prostrate.\n",
        "TRANSLATION_11": "So when I have proportioned him and breathed into him of My spirit, then fall down in prostration before him.’\n",
        "TRANSLATION_12": "When I have fashioned him (in due proportion) and breathed into him of My spirit, fall ye down in obeisance unto him.\"\n",
        "TRANSLATION_13": "So, when I have fashioned him completely and breathed into him (Adam) the soul which I created for him, then fall (you) down prostrating yourselves unto him.\"\n",
        "TRANSLATION_14": "When I have shaped him and ran My created soul in him fall down prostrating towards him'.\n",
        "TRANSLATION_15": "“When I have formed him, and breathed into him of My spirit, fall down prostrating before him.”\n",
        "TRANSLATION_16": "And when I have proportioned him and breathed into him of My [created] soul, then fall down to him in prostration.\"\n",
        "TRANSLATION_17": "[15:29] So, when I have proportioned him, completed him, and breathed, caused to flow, of My Spirit in him, so that he becomes a living thing — the annexation of ‘the Spirit’ to him is a conferring of honour upon Adam — fall down in prostration before him!’, a prostration [meant as an act] of salutation by bowing.\n",
        "TRANSLATION_18": "(So, when I have made him) so when I created his hands, legs, eyes and the rest of him (and have breathed into him of My Spirit) and placed the spirit into him, (do ye fall down, prostrating yourselves unto him) as a greeting.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "15:29",
            "38:72",
            "26:80",
            "74:14",
            "26:21",
            "2:152",
            "21:18",
            "23:110",
            "44:21",
            "7:25"
        ],
        "BIBLE": [
            "writings:proverbs:1:16",
            "prophets:isaiah:59:7",
            "torah:exodus:30:37",
            "prophets:isaiah:42:1",
            "torah:leviticus:11:43",
            "prophets:ezekiel:32:14",
            "writings:proverbs:11:5",
            "torah:deuteronomy:22:8",
            "prophets:zechariah:12:2",
            "writings:i%20chronicles:10:4"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:2:2",
            "Sefer%20Yetzirah:1:10",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:3:7",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:12"
        ]
    }
}