{
    "VERSE": "15:31",
    "ARABIC": "إِلَّآ إِبْلِيسَ أَبَىٰٓ أَن يَكُونَ مَعَ ٱلسَّٰجِدِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "except Iblis. He disdained to be one of the prostrators.",
        "TRANSLATION_1": "Except Iblis. He refused to bow with the adorers.\n",
        "TRANSLATION_2": "except Iblis; he refused to join those who prostrated.\n",
        "TRANSLATION_3": "except Iblis who refused to join with the others in prostration.\n",
        "TRANSLATION_4": "Except Iblis (Satan); he refused to be among those who prostrated.\n",
        "TRANSLATION_5": "Except Iblis (Shaytan) - he refused to be among the prostrate.\n",
        "TRANSLATION_6": "But Iblis (did it not); he refused to be with those who made obeisance.\n",
        "TRANSLATION_7": "save Iblis; he refused to be among those bowing.\n",
        "TRANSLATION_8": "Save Iblis. He refused to be among the prostrate.\n",
        "TRANSLATION_9": "But Satan did not; he refused to join those who prostrated themselves.\n",
        "TRANSLATION_10": "But Iblis did not; he refused to be with the prostrates.\n",
        "TRANSLATION_11": "but not Iblis: he refused to be among those who prostrated.\n",
        "TRANSLATION_12": "Not so Iblis: he refused to be among those who prostrated themselves.\n",
        "TRANSLATION_13": "Except Iblis (Satan), - he refused to be among the prostrators.\n",
        "TRANSLATION_14": "except iblis (father of the jinn) who refused to be one of those who prostrated themselves.\n",
        "TRANSLATION_15": "Except for Satan. He refused to be among those who prostrated themselves.\n",
        "TRANSLATION_16": "Except Iblees, he refused to be with those who prostrated.\n",
        "TRANSLATION_17": "[15:31] except Iblīs, the father of the jinn — he was [standing] among the angels: he refused to be among those prostrating.\n",
        "TRANSLATION_18": "(Save Iblis), their chief. (He refused) he felt too proud (to be among the prostrate) to Adam (pbuh).\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "15:31",
            "38:74",
            "15:32",
            "26:141",
            "53:57",
            "56:79",
            "74:45",
            "69:37",
            "30:2",
            "70:22"
        ],
        "BIBLE": [
            "torah:genesis:43:28",
            "prophets:judges:9:56",
            "writings:lamentations:5:7",
            "prophets:ii%20samuel:16:19",
            "torah:genesis:48:19",
            "writings:proverbs:30:11",
            "prophets:zechariah:1:2",
            "torah:genesis:37:35",
            "writings:i%20chronicles:29:20",
            "prophets:judges:2:17"
        ]
    }
}