{
    "VERSE": "15:32",
    "ARABIC": "قَالَ يَٰٓإِبْلِيسُ مَا لَكَ أَلَّا تَكُونَ مَعَ ٱلسَّٰجِدِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "He said, 'Iblis, what is it that prevents you being among the prostrators?'",
        "TRANSLATION_1": "How is it, O Iblis,\" said (the Lord), \"you did not join those who bowed in homage?\"\n",
        "TRANSLATION_2": "The Lord inquired: \"Iblis! What is the matter with you that you did not join those who prostrated?\"\n",
        "TRANSLATION_3": "God asked Iblis, \"What made you not join the others in prostration?\"\n",
        "TRANSLATION_4": "Said Allah, “O Iblis! What happened to you that you stayed apart from those who prostrated?”\n",
        "TRANSLATION_5": "(Allah) said: \"O Iblis! What is your reason for not being among the prostrate\"\n",
        "TRANSLATION_6": "He said: O Iblis! what excuse have you that you are not with those who make obeisance?\n",
        "TRANSLATION_7": "Said He, 'What ails thee, Iblis, that thou art not among those bowing?'\n",
        "TRANSLATION_8": "He said: O Iblis! What aileth thee that thou art not among the prostrate?\n",
        "TRANSLATION_9": "God asked him, \"What is the matter with you, that you are not among those who have prostrated themselves?\"\n",
        "TRANSLATION_10": "Allah said: O Iblis! what aileth thou that thou art not with the prostrates?\n",
        "TRANSLATION_11": "He said, ‘O Iblis! What kept you from being among those who have prostrated?’\n",
        "TRANSLATION_12": "(Allah) said: \"O Iblis! what is your reason for not being among those who prostrated themselves?\"\n",
        "TRANSLATION_13": "(Allah) said: \"O Iblis (Satan)! What is your reason for not being among the prostrators?\"\n",
        "TRANSLATION_14": "He said: 'iblis, what is the matter with you, that you do you not prostrate yourself'\n",
        "TRANSLATION_15": "He said, “O Satan, what kept you from being among those who prostrated themselves?”\n",
        "TRANSLATION_16": "[Allah] said, O Iblees, what is [the matter] with you that you are not with those who prostrate?\"\n",
        "TRANSLATION_17": "[15:32] He, [God] exalted be He: ‘O Iblīs what is wrong with you, what prevents you, that you are not among those prostrating?’\n",
        "TRANSLATION_18": "(He) Allah, Exalted is He, (said: O Iblis!) O you who have despaired of My mercy, (What aileth you that thou art not among the prostrate?) why do you not prostrate to Adam?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "15:32",
            "15:31",
            "38:75",
            "61:2",
            "70:2",
            "7:92",
            "3:43",
            "26:43",
            "7:115",
            "27:85"
        ],
        "BIBLE": [
            "writings:nehemiah:2:4",
            "prophets:joshua:7:19",
            "prophets:isaiah:26:13",
            "writings:psalms:118:25",
            "writings:psalms:70:6",
            "writings:psalms:32:5",
            "prophets:ii%20samuel:5:23",
            "torah:exodus:23:13",
            "torah:exodus:34:10",
            "prophets:joel:2:17"
        ]
    }
}