{
    "VERSE": "15:33",
    "ARABIC": "قَالَ لَمْ أَكُن لِّأَسْجُدَ لِبَشَرٍ خَلَقْتَهُۥ مِن صَلْصَٰلٍ مِّنْ حَمَإٍ مَّسْنُونٍ",
    "ENGLISH": {
        "TRANSLATION_0": "He said, 'I will not prostrate to a human being whom You have created out of dried clay formed from fetid black mud.'",
        "TRANSLATION_1": "How could I bow,\" said he, \"before a mortal whom You created from fermented clay dried tingling hard?\"\n",
        "TRANSLATION_2": "He said: \"It does not behove of me to prostrate myself before a human being whom You have created out of dry ringing clay wrought from black mud.\"\n",
        "TRANSLATION_3": "Iblis replied, \"I did not want to prostrate before a human being whom You have created out of mud-moulded clay\".\n",
        "TRANSLATION_4": "He answered, “It does not befit me to prostrate myself to a human whom You have created from sounding clay made out of black smelly mud.”\n",
        "TRANSLATION_5": "[Iblis] said: \"I am not one to prostrate myself to a human, whom You created from dried (sounding) clay of altered mud.\"\n",
        "TRANSLATION_6": "He said: I am not such that I should make obeisance to a mortal whom Thou hast created of the essence of black mud fashioned in shape.\n",
        "TRANSLATION_7": "Said he, 'I would never bow myself before a mortal whom Thou hast created of a clay of mud moulded.'\n",
        "TRANSLATION_8": "He said: I am not one to prostrate myself unto a mortal whom Thou hast created out of potter's clay of black mud altered!\n",
        "TRANSLATION_9": "He replied, \"I am not one to prostrate myself to a man whom You have created out of a clay of moulded mud.\"\n",
        "TRANSLATION_10": "He said it was not for me that should prostrate myself unto a human being whom Thou hast created from ringing clay of loam moulded.\n",
        "TRANSLATION_11": "Said he, ‘I will not prostrate before a human whom You have created out of a dry clay [drawn] from an aging mud.’\n",
        "TRANSLATION_12": "(Iblis) said: \"I am not one to prostrate myself to man, whom Thou didst create from sounding clay, from mud moulded into shape.\"\n",
        "TRANSLATION_13": "[Iblis (Satan)] said: \"I am not the one to prostrate myself to a human being, whom You created from sounding clay of altered black smooth mud.\"\n",
        "TRANSLATION_14": "He replied: 'I will not prostrate to a mortal You have created of clay, from molded mud'\n",
        "TRANSLATION_15": "He said, “I am not about to prostrate myself before a human being, whom You created from clay, from molded mud.”\n",
        "TRANSLATION_16": "He said, \"Never would I prostrate to a human whom You created out of clay from an altered black mud.\"\n",
        "TRANSLATION_17": "[15:33] Said he, ‘I was not about to prostrate myself, I should not prostrate myself, before a mortal whom You have created out of a dry clay [drawn] from malleable mud’.\n",
        "TRANSLATION_18": "(He said: Why should I prostrate myself unto a mortal whom Thou hast created out of potter's clay of black mud altered?) he said: it is not becoming of me to prostrate to clay.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "15:33",
            "15:28",
            "15:26",
            "19:20",
            "26:186",
            "36:15",
            "26:154",
            "74:29",
            "38:71",
            "3:126"
        ],
        "BIBLE": [
            "torah:exodus:34:10",
            "prophets:ii%20kings:7:19",
            "torah:genesis:2:18",
            "torah:deuteronomy:21:3",
            "prophets:ii%20kings:7:2",
            "prophets:i%20samuel:11:13",
            "prophets:ii%20kings:10:5",
            "torah:deuteronomy:13:15",
            "writings:daniel:6:13",
            "prophets:joel:2:19"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:3"
        ]
    }
}