{
    "VERSE": "15:34",
    "ARABIC": "قَالَ فَٱخْرُجْ مِنْهَا فَإِنَّكَ رَجِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "He said, 'Get out from here, you are accursed.",
        "TRANSLATION_1": "Go hence, execrable,\" (said the Lord), \"from this place,\n",
        "TRANSLATION_2": "The Lord said: \"Then get out of here; you are rejected,\n",
        "TRANSLATION_3": "God told him, \"Get out of the garden; you are rejected\n",
        "TRANSLATION_4": "Said Allah, “Therefore exit from Paradise, for you are an outcast.”\n",
        "TRANSLATION_5": "(Allah) said: \"Then leave, for verily, you are an outcast. \"\n",
        "TRANSLATION_6": "He said: Then get out of it, for surely you are driven away:\n",
        "TRANSLATION_7": "Said He, 'Then go thou forth hence; thou art accursed.\n",
        "TRANSLATION_8": "He said: Then go thou forth from hence, for lo! thou art outcast.\n",
        "TRANSLATION_9": "God said, \"Then get out of here; for you are accursed,\n",
        "TRANSLATION_10": "Allah said: then get thee forth therefrom; verily thou art one damned.\n",
        "TRANSLATION_11": "He said, ‘Begone hence, for you are indeed an outcast,\n",
        "TRANSLATION_12": "(Allah) said: \"Then get thee out from here; for thou art rejected, accursed.\n",
        "TRANSLATION_13": "(Allah) said: \"Then, get out from here, for verily, you are Rajim (an outcast or a cursed one).\" [Tafsir At-Tabari]\n",
        "TRANSLATION_14": "(Allah) said: 'Begone, you are accursed!\n",
        "TRANSLATION_15": "He said, “Then get out of here, for you are an outcast”.\n",
        "TRANSLATION_16": "[Allah] said, \"Then get out of it, for indeed, you are expelled.\n",
        "TRANSLATION_17": "[15:34] Said He, ‘Then be gone from hence, that is, from the Garden — but it is also said, from the heavens — for you are indeed accursed, outcast.\n",
        "TRANSLATION_18": "(He said) Allah said to him: (Then go thou forth from hence) from the form of angels; it is also said that this means: go forth from My favour and mercy; and it is also said that this means: go forth from the earth, (for verily you are outcast) accursed and banished from My mercy.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "15:34",
            "38:77",
            "15:37",
            "38:80",
            "7:15",
            "23:107",
            "44:59",
            "7:13",
            "15:17",
            "37:32"
        ],
        "BIBLE": [
            "torah:numbers:23:27",
            "prophets:jeremiah:14:13",
            "torah:genesis:1:9",
            "torah:genesis:13:14",
            "torah:numbers:23:13",
            "torah:genesis:50:19",
            "torah:exodus:33:21",
            "prophets:i%20samuel:26:19",
            "torah:genesis:20:11",
            "prophets:ii%20kings:5:11"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:14",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:1:9"
        ]
    }
}