{
    "VERSE": "15:36",
    "ARABIC": "قَالَ رَبِّ فَأَنظِرْنِىٓ إِلَىٰ يَوْمِ يُبْعَثُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "He said, 'My Lord, grant me a reprieve until the Day they are raised again.'",
        "TRANSLATION_1": "O my Lord,\" said he, \"give me respite till the day the dead are raised.\"\n",
        "TRANSLATION_2": "Iblis said: \"My Lord! Grant me respite till the Day when they will be resurrected.\"\n",
        "TRANSLATION_3": "Iblis prayed, \"Lord, grant me respite until the Day of Judgment\".\n",
        "TRANSLATION_4": "He said, “My Lord! Grant me respite till the day when they will all be raised.”\n",
        "TRANSLATION_5": "[Iblis] said: \"O my Lord! Then give me respite until the Day they (the dead) will be resurrected.\"\n",
        "TRANSLATION_6": "He said: My Lord! then respite me till the time when they are raised.\n",
        "TRANSLATION_7": "Said he, 'My Lord, respite me till the day they shall be raised.'\n",
        "TRANSLATION_8": "He said: My Lord! Reprieve me till the day when they are raised.\n",
        "TRANSLATION_9": "Satan said, \"O my Lord! Grant me respite till the Day of Resurrection.\"\n",
        "TRANSLATION_10": "He said: my Lord! respite me then till the Day whereon they will be raised up.\n",
        "TRANSLATION_11": "He said, ‘My Lord! Respite me till the day they will be resurrected.’\n",
        "TRANSLATION_12": "(Iblis) said: \"O my Lord! give me then respite till the Day the (dead) are raised.\"\n",
        "TRANSLATION_13": "[Iblis (Satan)] said: \"O my Lord! Give me then respite till the Day they (the dead) will be resurrected.\"\n",
        "TRANSLATION_14": "He said: 'My Lord, reprieve me till the Day they are raised'\n",
        "TRANSLATION_15": "He said, “My Lord, reprieve me until the Day they are resurrected.”\n",
        "TRANSLATION_16": "He said, \"My Lord, then reprieve me until the Day they are resurrected.\"\n",
        "TRANSLATION_17": "[15:36] Said he, ‘My Lord! Reprieve me until the day when they, mankind, shall be resurrected’.\n",
        "TRANSLATION_18": "(He said) Iblis said: (My Lord!) O my Lord! (Reprieve me till the day when they are raised) from the grave; the accursed did not wish to taste death.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "15:36",
            "38:79",
            "7:14",
            "14:41",
            "78:39",
            "52:45",
            "51:60",
            "43:83",
            "70:42",
            "28:21"
        ],
        "BIBLE": [
            "prophets:i%20samuel:8:6",
            "prophets:i%20samuel:11:3",
            "prophets:i%20kings:13:3",
            "prophets:ii%20kings:6:29",
            "torah:genesis:15:18",
            "prophets:i%20samuel:22:13",
            "torah:genesis:29:21",
            "writings:ii%20chronicles:19:6",
            "writings:lamentations:2:18",
            "prophets:i%20kings:9:13"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:4:8",
            "Sefer%20Yetzirah:4:9"
        ]
    }
}