{
    "VERSE": "15:4",
    "ARABIC": "وَمَآ أَهْلَكْنَا مِن قَرْيَةٍ إِلَّا وَلَهَا كِتَابٌ مَّعْلُومٌ",
    "ENGLISH": {
        "TRANSLATION_0": "We did not destroy any city without it having a set time.",
        "TRANSLATION_1": "Not one habitation have We destroyed but at the time determined for it.\n",
        "TRANSLATION_2": "Whenever We destroyed a town, a definite term had previously been decreed for it.\n",
        "TRANSLATION_3": "We never destroyed any town without pre-ordaining the fate of its people.\n",
        "TRANSLATION_4": "And every dwelling that We destroyed, had a known decree for it.\n",
        "TRANSLATION_5": "And never did We destroy a township but there was a known decree for it.\n",
        "TRANSLATION_6": "And never did We destroy a town but it had a term made known.\n",
        "TRANSLATION_7": "Never a city have We destroyed, but it had a known decree,\n",
        "TRANSLATION_8": "And We destroyed no township but there was a known decree for it.\n",
        "TRANSLATION_9": "We have never destroyed a township without a definite decree having been issued;\n",
        "TRANSLATION_10": "And We have not destroyed a town but there was therefor a decree known.\n",
        "TRANSLATION_11": "We did not destroy any town but that it had a known term.\n",
        "TRANSLATION_12": "Never did We destroy a population that had not a term decreed and assigned beforehand.\n",
        "TRANSLATION_13": "And never did We destroy a township but there was a known decree for it.\n",
        "TRANSLATION_14": "We never destroyed a village whose term had not already been decreed.\n",
        "TRANSLATION_15": "We have never destroyed a town unless it had a set time.\n",
        "TRANSLATION_16": "And We did not destroy any city but that for it was a known decree.\n",
        "TRANSLATION_17": "[15:4] And We did not destroy any town (min qaryatin: min is extra), meaning, its inhabitants, but that it had a known decree, a [pre-]determined term, after which it would be destroyed.\n",
        "TRANSLATION_18": "(And We destroyed no township) We destroyed no people of a township (but there was a known decree for it) except that there is an appointed term for their destruction.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "15:4",
            "26:208",
            "34:34",
            "34:44",
            "52:2",
            "29:47",
            "68:37",
            "37:117",
            "16:64",
            "17:58"
        ],
        "BIBLE": [
            "writings:ezra:4:19",
            "writings:ezra:4:15",
            "writings:esther:3:6",
            "prophets:isaiah:48:6",
            "prophets:judges:14:4",
            "prophets:i%20samuel:20:7",
            "torah:exodus:9:14",
            "writings:job:5:24",
            "prophets:ii%20samuel:20:5",
            "prophets:ezekiel:13:23"
        ]
    }
}