{
    "VERSE": "15:44",
    "ARABIC": "لَهَا سَبْعَةُ أَبْوَٰبٍ لِّكُلِّ بَابٍ مِّنْهُمْ جُزْءٌ مَّقْسُومٌ",
    "ENGLISH": {
        "TRANSLATION_0": "It has seven gates and each gate has its allotted share.",
        "TRANSLATION_1": "Which has several gates, and each gate is marked for every section of them.\"\n",
        "TRANSLATION_2": "There are seven gates in it, and to each gate a portion of them has been allotted.\n",
        "TRANSLATION_3": "It has seven gates and each gate is assigned for a certain group of people.\n",
        "TRANSLATION_4": "It has seven gates; for each gate is a portion assigned from them.\n",
        "TRANSLATION_5": "It has seven gates, for each of those gates is a class assigned.\n",
        "TRANSLATION_6": "It has seven gates; for every gate there shall be a separate party of them.\n",
        "TRANSLATION_7": "Seven gates it has, and unto each gate a set portion of them belongs.'\n",
        "TRANSLATION_8": "It hath seven gates, and each gate hath an appointed portion.\n",
        "TRANSLATION_9": "it has seven gates: and each gate has a portion of them allotted to it.\n",
        "TRANSLATION_10": "Unto it are seven portals; unto each portal is a Portion of them assigned.\n",
        "TRANSLATION_11": "It has seven gates, and to each gate belongs a separate portion of them.’\n",
        "TRANSLATION_12": "To it are seven gates: for each of those gates is a (special) class (of sinners) assigned.\n",
        "TRANSLATION_13": "It (Hell) has seven gates, for each of those gates is a (special) class (of sinners) assigned.\n",
        "TRANSLATION_14": "It has seven gates, and through each gate a portion of them belong.\n",
        "TRANSLATION_15": "“It has seven doors; for each door is an assigned class.”\n",
        "TRANSLATION_16": "It has seven gates; for every gate is of them a portion designated.\"\n",
        "TRANSLATION_17": "[15:44] It has seven gates, [seven] layers — to each gate, therein, belongs an appointed portion, lot, of them.\n",
        "TRANSLATION_18": "(It hath seven gates) some higher than others: its highest is Gehenna and lowest al-Hawiyah, (and each gate hath an appointed portion) each gate has a specific number of disbelievers who will enter it.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "15:44",
            "50:32",
            "38:19",
            "13:23",
            "55:52",
            "43:15",
            "6:44",
            "23:91",
            "36:36",
            "7:34"
        ],
        "BIBLE": [
            "prophets:isaiah:44:7",
            "torah:leviticus:16:7",
            "writings:psalms:113:8",
            "torah:leviticus:14:11",
            "writings:ii%20chronicles:32:6",
            "writings:ii%20chronicles:23:19",
            "torah:leviticus:20:26",
            "prophets:hosea:4:8",
            "prophets:nahum:3:13",
            "prophets:ezekiel:21:20"
        ]
    }
}