{
    "VERSE": "15:45",
    "ARABIC": "إِنَّ ٱلْمُتَّقِينَ فِى جَنَّٰتٍ وَعُيُونٍ",
    "ENGLISH": {
        "TRANSLATION_0": "Those who have taqwa will be amid Gardens and Springs:",
        "TRANSLATION_1": "Verily those who keep away from evil and follow the straight path shall be in the midst of gardens and springs of water.\n",
        "TRANSLATION_2": "As for the God-fearing, they shall be amid gardens and springs.\n",
        "TRANSLATION_3": "The pious will live in gardens with streams\n",
        "TRANSLATION_4": "Indeed the pious are amidst Gardens and springs.\n",
        "TRANSLATION_5": "Truly, those who have Taqwa, will dwell in Gardens and water springs.\n",
        "TRANSLATION_6": "Surely those who guard (against evil) shall be in the midst of gardens and fountains:\n",
        "TRANSLATION_7": "But the godfearing shall be amidst gardens and fountains:\n",
        "TRANSLATION_8": "Lo! those who ward off (evil) are among gardens and watersprings.\n",
        "TRANSLATION_9": "Truly, the God-fearing shall dwell amid gardens and fountains --\n",
        "TRANSLATION_10": "Verily the God-fearing shall be amidst gardens and springs.\n",
        "TRANSLATION_11": "Indeed the Godwary will be amid gardens and springs.\n",
        "TRANSLATION_12": "The righteous (will be) amid gardens and fountains (of clear-flowing water).\n",
        "TRANSLATION_13": "Truly! The Muttaqun (pious and righteous persons - see V. 2:2) will be amidst Gardens and water-springs (Paradise).\n",
        "TRANSLATION_14": "But the cautious shall live amongst gardens and fountains:\n",
        "TRANSLATION_15": "But the righteous will be in gardens with springs.\n",
        "TRANSLATION_16": "Indeed, the righteous will be within gardens and springs.\n",
        "TRANSLATION_17": "[15:45] Truly the God-fearing shall be amidst gardens, orchards, and springs’, flowing through them.\n",
        "TRANSLATION_18": "(Lo! those who ward off (evil)) disbelief, idolatry, and indecencies, i.e. Abu Bakr, 'Umar and their fellow believers (are among Gardens and water springs) springs of pure water.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "51:15",
            "15:45",
            "44:52",
            "26:147",
            "26:134",
            "52:17",
            "44:25",
            "77:41",
            "26:57",
            "54:54"
        ],
        "BIBLE": [
            "writings:song%20of%20songs:4:15",
            "prophets:zechariah:8:8",
            "prophets:isaiah:41:18",
            "torah:genesis:16:7",
            "writings:psalms:68:26",
            "torah:deuteronomy:11:6",
            "prophets:ezekiel:7:4",
            "prophets:ezekiel:43:9",
            "prophets:zechariah:2:14",
            "prophets:zechariah:2:15"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:1:14",
            "Sefer%20Yetzirah:2:1"
        ]
    }
}