{
    "VERSE": "15:47",
    "ARABIC": "وَنَزَعْنَا مَا فِى صُدُورِهِم مِّنْ غِلٍّ إِخْوَٰنًا عَلَىٰ سُرُرٍ مُّتَقَٰبِلِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "We will strip away any rancour in their hearts - brothers, resting on couches face-to-face.",
        "TRANSLATION_1": "We shall cast out any grudge they may have in their hearts. (There) they will sit on couches face to face like brothers together.\n",
        "TRANSLATION_2": "And We shall purge their breasts of all traces of rancour; and they shall be seated on couches facing one another as brothers.\n",
        "TRANSLATION_3": "We shall remove all hatred from their breasts and make them as brothers reclining on thrones facing one another.\n",
        "TRANSLATION_4": "And We have removed any resentments which were in their breasts – they are brothers, sitting face to face on thrones.\n",
        "TRANSLATION_5": "And We shall remove any deep feeling of bitterness from their breasts. (So they will be like) brothers facing each other on thrones.\n",
        "TRANSLATION_6": "And We will root out whatever of rancor is in their breasts-- (they shall be) as brethren, on raised couches, face to face.\n",
        "TRANSLATION_7": "We shall strip away all rancour that is in their breasts; as brothers they shall be upon couches set face to face;\n",
        "TRANSLATION_8": "And We remove whatever rancour may be in their breasts. As brethren, face to face, (they rest) on couches raised.\n",
        "TRANSLATION_9": "We shall cleanse their hearts of all traces of ill-will; they will be like brethren seated on couches facing one another.\n",
        "TRANSLATION_10": "And We shall have removed whatsoever of grudge may be in their breasts: brethren they. sitting upon couches facing each other.\n",
        "TRANSLATION_11": "We will remove whatever rancour there is in their breasts; [intimate like] brothers, [they will be reclining] on couches, facing one another.\n",
        "TRANSLATION_12": "And We shall remove from their hearts any lurking sense of injury: (they will be) brothers (joyfully) facing each other on thrones (of dignity).\n",
        "TRANSLATION_13": "And We shall remove from their breasts any sense of injury (that they may have), (So they will be like) brothers facing each other on thrones.\n",
        "TRANSLATION_14": "We shall remove all rancor from their hearts, and as brethren they shall recline on couches face to face.\n",
        "TRANSLATION_15": "And We will remove all ill-feelings from their hearts—brothers and sisters, on couches facing one another.\n",
        "TRANSLATION_16": "And We will remove whatever is in their breasts of resentment, [so they will be] brothers, on thrones facing each other.\n",
        "TRANSLATION_17": "[15:47] And We remove whatever rancour, spite, may be in their breasts. As brethren (ikhwānan is a circumstantial qualifier referring to them), [they shall recline] upon couches, facing one another (mutaqābilīn is also a   circumstantial qualifier), in other words, they do not look upon each other’s backs, because the couches revolve with them in them.\n",
        "TRANSLATION_18": "(And We remove whatever rancour) treachery and enmity that was between them in this worldly life (may be in their breasts. As brethren) in the Hereafter, (face to face, (they rest) on couches raised) upon visiting one another.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "15:47",
            "100:10",
            "59:10",
            "28:69",
            "15:97",
            "6:87",
            "17:51",
            "7:111",
            "26:36",
            "12:58"
        ],
        "BIBLE": [
            "prophets:i%20samuel:2:8",
            "prophets:hosea:11:8",
            "prophets:isaiah:49:11",
            "prophets:ezekiel:37:26",
            "prophets:judges:16:25",
            "prophets:jeremiah:32:40",
            "torah:exodus:31:6",
            "prophets:hosea:2:5",
            "prophets:ezekiel:25:4",
            "prophets:ezekiel:30:14"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:1:12",
            "Sefer%20Yetzirah:3:6"
        ]
    }
}