{
    "VERSE": "15:5",
    "ARABIC": "مَّا تَسْبِقُ مِنْ أُمَّةٍ أَجَلَهَا وَمَا يَسْتَـْٔخِرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "No nation can advance its appointed time nor can they delay it.",
        "TRANSLATION_1": "No people can hasten or delay the term already fixed for them.\n",
        "TRANSLATION_2": "No people can outstrip the term for its destruction nor can it delay it.\n",
        "TRANSLATION_3": "Every nation can only live for the time appointed for it.\n",
        "TRANSLATION_4": "No group may advance its appointed promise nor postpone it.\n",
        "TRANSLATION_5": "No nation can advance its term, nor delay it.\n",
        "TRANSLATION_6": "No people can hasten on their doom nor can they postpone (it).\n",
        "TRANSLATION_7": "and no nation outstrips its term, nor do they put it back.\n",
        "TRANSLATION_8": "No nation can outstrip its term nor can they lag behind.\n",
        "TRANSLATION_9": "no people can forestall their doom, nor can they delay it.\n",
        "TRANSLATION_10": "No community precedeth the term thereof nor doth it fall behind.\n",
        "TRANSLATION_11": "No nation can advance its time nor can it defer it.\n",
        "TRANSLATION_12": "Neither can a people anticipate its term, nor delay it.\n",
        "TRANSLATION_13": "No nation can anticipate its term, nor delay it.\n",
        "TRANSLATION_14": "No nation can outstrip its term, nor do they put it back.\n",
        "TRANSLATION_15": "No nation can bring its time forward, nor can they delay it.\n",
        "TRANSLATION_16": "No nation will precede its term, nor will they remain thereafter.\n",
        "TRANSLATION_17": "[15:5] No community (min ummatin: min is extra) can outstrip its [predetermined] term nor can they [seek to] delay it, [nor can they] put it off.\n",
        "TRANSLATION_18": "(No nation can outstrip its term) He says: no nation perishes or is destroyed before the appointed time for its perishing or destruction (nor can they lag behind) no nation is given respite when its appointed time comes.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "15:5",
            "23:43",
            "11:104",
            "7:34",
            "2:134",
            "2:141",
            "51:45",
            "83:33",
            "15:79",
            "26:211"
        ],
        "BIBLE": [
            "prophets:ezekiel:32:9",
            "writings:daniel:12:1",
            "prophets:isaiah:60:22",
            "prophets:isaiah:18:7",
            "prophets:habakkuk:2:3",
            "prophets:isaiah:43:9",
            "prophets:isaiah:49:8",
            "writings:daniel:11:27",
            "prophets:zephaniah:3:20",
            "prophets:ezekiel:37:12"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:13",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:6:4"
        ]
    }
}