{
    "VERSE": "15:52",
    "ARABIC": "إِذْ دَخَلُوا۟ عَلَيْهِ فَقَالُوا۟ سَلَٰمًا قَالَ إِنَّا مِنكُمْ وَجِلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "When they came in to him, they said, 'Peace!' He said, Truly we are afraid of you.'",
        "TRANSLATION_1": "When they came to him and said: \"Peace,\" he answered: \"Truly we are afraid of you.\"\n",
        "TRANSLATION_2": "When they came to Abraham they said: \"Peace be upon you!\" He replied: \"Indeed we feel afraid of you.\"\n",
        "TRANSLATION_3": "who came to him saying, \"Peace be with you.\" Abraham said, \"We are afraid of you\".\n",
        "TRANSLATION_4": "When the angels came to him and said, “Peace\"; he said, “We feel afraid of you.”\n",
        "TRANSLATION_5": "When they entered upon him, and said: \"Salaman (peace!).\" He said: \"Indeed we are frightened of you.\"\n",
        "TRANSLATION_6": "When they entered upon him, they said, Peace. He said: Surely we are afraid of you.\n",
        "TRANSLATION_7": "when they entered unto him, saying, 'Peace!' He said, 'Behold, we are afraid of you.'\n",
        "TRANSLATION_8": "(How) when they came in unto him, and said: Peace. He said: Lo! we are afraid of you.\n",
        "TRANSLATION_9": "when they came to him they greeted him with: \"Peace.\" He said,\"We feel afraid of you.\"\n",
        "TRANSLATION_10": "When they entered unto him, and said; peace! He said: verily we are afraid of you.\n",
        "TRANSLATION_11": "when they entered into his presence and said, ‘Peace!’ He said, ‘We are indeed afraid of you.’\n",
        "TRANSLATION_12": "When they entered his presence and said, \"Peace!\" He said, \"We feel afraid of you!\"\n",
        "TRANSLATION_13": "When they entered unto him, and said: Salaman (peace)! [Ibrahim (Abraham)] said: \"Indeed! We are afraid of you.\"\n",
        "TRANSLATION_14": "They entered to him and said: 'Peace' but he replied: 'We are afraid of you'\n",
        "TRANSLATION_15": "When they entered upon him, and said, “Peace.” He said, “We are wary of you.”\n",
        "TRANSLATION_16": "When they entered upon him and said, \"Peace.\" [Abraham] said, \"Indeed, we are fearful of you.\"\n",
        "TRANSLATION_17": "[15:52] [how] when they entered unto him, and said, ‘Peace!’, that is, [they said] this very word (salām). He, Abraham, said, after having offered them food which they did not eat: ‘Lo! we are afraid of you’.\n",
        "TRANSLATION_18": "((How) when they came in unto him) unto Abraham, (and said: Peace) they greeted him. (He said) Abraham said to them when they did not touch his food: (Lo! we are afraid of you) we are scared of you.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "15:52",
            "51:25",
            "15:46",
            "28:55",
            "19:15",
            "43:89",
            "37:181",
            "37:130",
            "37:109",
            "88:26"
        ],
        "BIBLE": [
            "torah:genesis:23:14",
            "torah:genesis:23:5",
            "prophets:zechariah:4:4",
            "prophets:i%20kings:1:28",
            "prophets:zechariah:6:4",
            "torah:genesis:41:16",
            "prophets:ii%20kings:9:22",
            "prophets:ii%20kings:9:19",
            "torah:genesis:45:3",
            "prophets:ezekiel:24:20"
        ]
    }
}