{
    "VERSE": "15:53",
    "ARABIC": "قَالُوا۟ لَا تَوْجَلْ إِنَّا نُبَشِّرُكَ بِغُلَٰمٍ عَلِيمٍ",
    "ENGLISH": {
        "TRANSLATION_0": "They said, 'Do not be afraid. We bring you the good news of a boy of great knowledge.'",
        "TRANSLATION_1": "Have no fear,\" they said. \"We bring you news of a son full of wisdom.\"\n",
        "TRANSLATION_2": "They said: \"Do not feel afraid, for we give you the good news of a wise boy.\"\n",
        "TRANSLATION_3": "They replied, \"Do not be afraid. We have brought you the glad news of (the birth) of a learned son\".\n",
        "TRANSLATION_4": "They said, “Do not fear – we convey to you the glad tidings of a knowledgeable boy.”\n",
        "TRANSLATION_5": "They said: \"Do not be afraid! We bring you the good news of a boy possessing much knowledge and wisdom.\"\n",
        "TRANSLATION_6": "They said: Be not afraid, surely we give you the good news of a boy, possessing knowledge.\n",
        "TRANSLATION_7": "They said, 'Be not afraid; behold, we give thee good tidings of a cunning boy.'\n",
        "TRANSLATION_8": "They said: Be not afraid! Lo! we bring thee good tidings of a boy possessing wisdom.\n",
        "TRANSLATION_9": "They said, \"Do not be afraid. We come to you with good news. You shall have a son who shall be endowed with great knowledge.\"\n",
        "TRANSLATION_10": "They said: be not afraid; verily we bear thou the glad tidings of a boy knowing.\n",
        "TRANSLATION_11": "They said, ‘Do not be afraid. Indeed we give you the good news of a wise son.’\n",
        "TRANSLATION_12": "They said: \"Fear not! We give thee glad tidings of a son endowed with wisdom.\"\n",
        "TRANSLATION_13": "They (the angels) said: \"Do not be afraid! We give you glad tidings of a boy (son) possessing much knowledge and wisdom.\"\n",
        "TRANSLATION_14": "Do not be afraid' they answered. 'We come to give you glad tidings of a knowledgeable child'\n",
        "TRANSLATION_15": "They said, “Do not fear; we bring you good news of a boy endowed with knowledge.”\n",
        "TRANSLATION_16": "[The angels] said, \"Fear not. Indeed, we give you good tidings of a learned boy.\"\n",
        "TRANSLATION_17": "[15:53] They said, ‘Do not be afraid; lo!, we, are the messengers of your Lord [sent to], give you good tidings of a knowledgeable boy’, one very knowledgeable [boy], namely, Isaac — as we mentioned in sūrat Hūd [Q. 11:69].\n",
        "TRANSLATION_18": "(They said: Be not afraid!) do not be scared of us, Abraham! (Lo! we bring you good tidings of a boy possessing wisdom) in his tender years, clement in his old age.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "15:53",
            "51:28",
            "7:112",
            "37:101",
            "26:37",
            "2:32",
            "26:112",
            "20:68",
            "7:121",
            "26:47"
        ],
        "BIBLE": [
            "torah:genesis:42:22",
            "torah:deuteronomy:1:39",
            "prophets:jeremiah:20:15",
            "prophets:i%20samuel:29:9",
            "prophets:ii%20kings:4:14",
            "prophets:judges:13:3",
            "torah:deuteronomy:1:14",
            "torah:genesis:27:37",
            "prophets:zechariah:4:5",
            "torah:genesis:16:11"
        ]
    }
}