{
    "VERSE": "15:56",
    "ARABIC": "قَالَ وَمَن يَقْنَطُ مِن رَّحْمَةِ رَبِّهِۦٓ إِلَّا ٱلضَّآلُّونَ",
    "ENGLISH": {
        "TRANSLATION_0": "He said, 'Who despairs of the mercy of his Lord except for misguided people?'",
        "TRANSLATION_1": "Who would despair of the mercy of his Lord,\" he answered, \"but those who go astray.\"\n",
        "TRANSLATION_2": "Abraham said: \"Who despairs of the Mercy of his Lord except the misguided?\"\n",
        "TRANSLATION_3": "He said, \"No one despairs of the mercy of his Lord except those who are in error.\n",
        "TRANSLATION_4": "He said, “Who is it that despairs from the mercy of his Lord, except those who are astray?”\n",
        "TRANSLATION_5": "He said: \"And who despairs of the mercy of his Lord except those who are astray\"\n",
        "TRANSLATION_6": "He said: And who despairs of the mercy of his Lord but the erring ones?\n",
        "TRANSLATION_7": "He said, 'And who despairs of the mercy of his Lord, excepting those that are astray?'\n",
        "TRANSLATION_8": "He said: And who despaireth of the mercy of his Lord save those who are astray?\n",
        "TRANSLATION_9": "He said, \"Who but the misguided despair of the mercy of their Lord?\"\n",
        "TRANSLATION_10": "He said: and who despondeth of the mercy of his Lord except the astray\n",
        "TRANSLATION_11": "He said, ‘Who despairs of his Lord’s mercy except the astray?!’\n",
        "TRANSLATION_12": "He said: \"And who despairs of the mercy of his Lord, but such as go astray?\"\n",
        "TRANSLATION_13": "[Ibrahim (Abraham)] said: \"And who despairs of the Mercy of his Lord except those who are astray?\"\n",
        "TRANSLATION_14": "He replied: 'And who despairs of the mercy of his Lord, except those that are astray?\n",
        "TRANSLATION_15": "He said, “And who despairs of his Lord’s mercy but the lost?”\n",
        "TRANSLATION_16": "He said, \"And who despairs of the mercy of his Lord except for those astray?\"\n",
        "TRANSLATION_17": "[15:56] He said, ‘And who — in other words, no one — despairs (read yaqnitu or yaqnatu) of the mercy of his Lord, save those who are astray?’, [save] disbelievers.\n",
        "TRANSLATION_18": "(He said) Abraham said: (And who despaireth not the mercy of his Lord save those who are astray) those who disbelieve in Allah or are ungrateful for His blessings?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "15:56",
            "2:157",
            "26:5",
            "21:75",
            "36:27",
            "68:50",
            "15:98",
            "21:86",
            "21:112",
            "17:28"
        ],
        "BIBLE": [
            "prophets:zechariah:4:13",
            "prophets:zechariah:4:4",
            "prophets:zechariah:6:4",
            "prophets:zechariah:4:5",
            "torah:deuteronomy:1:14",
            "writings:psalms:18:42",
            "torah:genesis:23:14",
            "torah:genesis:23:5",
            "prophets:joshua:7:20",
            "torah:numbers:23:26"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:1:12"
        ]
    }
}