{
    "VERSE": "15:58",
    "ARABIC": "قَالُوٓا۟ إِنَّآ أُرْسِلْنَآ إِلَىٰ قَوْمٍ مُّجْرِمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "They said, 'We have been sent to a people who are evildoers -",
        "TRANSLATION_1": "We have been sent,\" they said, \"to (punish) a sinful people,\n",
        "TRANSLATION_2": "They said: \"Verily we have been sent to a guilty people\n",
        "TRANSLATION_3": "They said, \"We are sent to a sinful people.\n",
        "TRANSLATION_4": "They said, “We have been sent towards a guilty nation.”\n",
        "TRANSLATION_5": "They said: \"We have been sent to a guilty people.\"\n",
        "TRANSLATION_6": "They said: Surely we are sent towards a guilty people,\n",
        "TRANSLATION_7": "They said, 'We have been sent unto a people of sinners,\n",
        "TRANSLATION_8": "They said: We have been sent unto a guilty folk,\n",
        "TRANSLATION_9": "They said, \"We have been sent forth to a guilty people.\"\n",
        "TRANSLATION_10": "They said: verily we have been sent unto a people guilty-\n",
        "TRANSLATION_11": "They said, ‘We have been sent toward a guilty people,\n",
        "TRANSLATION_12": "They said: \"We have been sent to a people (deep) in sin,\n",
        "TRANSLATION_13": "They (the angels) said: \"We have been sent to a people who are Mujrimun (criminals, disbelievers, polytheists, sinners).\n",
        "TRANSLATION_14": "They replied: 'We are sent to sinful nation.\n",
        "TRANSLATION_15": "They said, “We were sent to a sinful people.”\n",
        "TRANSLATION_16": "They said, \"Indeed, we have been sent to a people of criminals,\n",
        "TRANSLATION_17": "[15:58] They said, ‘We have been sent to a sinning folk, a disbelieving [folk], namely, the people of Lot, in order to destroy them;\n",
        "TRANSLATION_18": "(They said: We have been sent unto a guilty folk) to idolaters who brought destruction upon themselves because of their evil acts, meaning here the people of Lot.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "15:58",
            "51:32",
            "15:62",
            "43:54",
            "51:46",
            "51:53",
            "26:117",
            "71:2",
            "43:44",
            "15:15"
        ],
        "BIBLE": [
            "torah:exodus:32:31",
            "torah:exodus:20:17",
            "prophets:hosea:12:9",
            "prophets:i%20samuel:14:38",
            "torah:exodus:12:33",
            "torah:exodus:32:21",
            "prophets:isaiah:63:8",
            "torah:numbers:12:11",
            "torah:exodus:32:14",
            "prophets:joshua:24:19"
        ]
    }
}