{
    "VERSE": "15:59",
    "ARABIC": "إِلَّآ ءَالَ لُوطٍ إِنَّا لَمُنَجُّوهُمْ أَجْمَعِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "with the exception of the family of Lut, all of whom We will save,",
        "TRANSLATION_1": "Except the family of Lot whom we shall save\n",
        "TRANSLATION_2": "excepting the household of Lot. We shall deliver all of them,\n",
        "TRANSLATION_3": "Only the family of Lot will all be saved,\n",
        "TRANSLATION_4": "“Except the family of Lut; we shall rescue all of them.”\n",
        "TRANSLATION_5": "(All) except the family of Lut, all of whom we are to save (from the destruction).\"\n",
        "TRANSLATION_6": "Except Lut's followers: We will most surely deliver them all,\n",
        "TRANSLATION_7": "excepting the folk of Lot; them we shall deliver\n",
        "TRANSLATION_8": "(All) save the family of Lot. Them we shall deliver every one,\n",
        "TRANSLATION_9": "Except for Lot's household, all of whom we shall rescue,\n",
        "TRANSLATION_10": "All except the household of Lut; surely we are going to deliver all of them.\n",
        "TRANSLATION_11": "[who shall perish] except the family of Lot. We will indeed deliver all of them,\n",
        "TRANSLATION_12": "Excepting the adherents of Lut: them we are certainly (charged) to save (from harm),- All -\n",
        "TRANSLATION_13": "(All) except the family of Lout (Lot). Them all we are surely going to save (from destruction).\n",
        "TRANSLATION_14": "Except Lot's family, of whom we shall save all,\n",
        "TRANSLATION_15": "“Except for the family of Lot; we will save them all.”\n",
        "TRANSLATION_16": "Except the family of Lot; indeed, we will save them all\n",
        "TRANSLATION_17": "[15:59] [all] except the family of Lot; indeed we shall save them, all of them, because of their faith,\n",
        "TRANSLATION_18": "((All) save the family of Lot) his daughters Za'ura and Raytha and his righteous wife [who was one of his wives]. (Them we shall deliver everyone) from destruction, 277\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "15:59",
            "15:43",
            "26:56",
            "54:34",
            "26:61",
            "7:18",
            "38:85",
            "56:66",
            "27:56",
            "26:170"
        ],
        "BIBLE": [
            "prophets:joshua:18:8",
            "torah:exodus:1:22",
            "prophets:ii%20kings:17:15",
            "torah:exodus:5:18",
            "writings:job:33:24",
            "prophets:jeremiah:48:5",
            "torah:genesis:26:11",
            "prophets:isaiah:46:2",
            "prophets:jeremiah:44:14",
            "prophets:judges:6:15"
        ]
    }
}