{
    "VERSE": "15:60",
    "ARABIC": "إِلَّا ٱمْرَأَتَهُۥ قَدَّرْنَآ إِنَّهَا لَمِنَ ٱلْغَٰبِرِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "except for his wife. We have decreed her to be one of those who stay behind.'",
        "TRANSLATION_1": "Other than his wife who, it is decreed, will remain with those who will stay behind.\"\n",
        "TRANSLATION_2": "except his wife (about whom Allah says that) We have decreed that she shall be among those who stay behind.\"\n",
        "TRANSLATION_3": "except his wife who is doomed to be left behind.\"\n",
        "TRANSLATION_4": "“Except his wife – we have decided that she is of those who will stay behind.”\n",
        "TRANSLATION_5": "Except for his wife, of whom We have decreed that she shall be of those who remain behind.\"\n",
        "TRANSLATION_6": "Except his wife; We ordained that she shall surely be of those who remain behind.\n",
        "TRANSLATION_7": "all together, excepting his wife -- we have decreed, she shall surely be of those that tarry.'\n",
        "TRANSLATION_8": "Except his wife, of whom We had decreed that she should be of those who stay behind.\n",
        "TRANSLATION_9": "except his wife. We have decreed that she will be among those who remain behind [and will be lost].\n",
        "TRANSLATION_10": "But not his wife; we have decreed that she will be of those staying behind.\n",
        "TRANSLATION_11": "except his wife, [who], We have ordained, will indeed be among those who remain behind.’\n",
        "TRANSLATION_12": "Except his wife, who, We have ascertained, will be among those who will lag behind.\"\n",
        "TRANSLATION_13": "Except his wife, of whom We have decreed that she shall be of those who remain behind (i.e. she will be destroyed).\"\n",
        "TRANSLATION_14": "but his wife. We decreed that she should be amongst those who remain behind.\n",
        "TRANSLATION_15": "“Except for his wife.” We have determined that she will be of those who lag behind.\n",
        "TRANSLATION_16": "Except his wife.\" Allah decreed that she is of those who remain behind.\n",
        "TRANSLATION_17": "[15:60] except his wife — We have decreed that she indeed should be of those who will remain behind’, [of] those who will stay behind in the chastisement, because of her unbelief.\n",
        "TRANSLATION_18": "(Except his wife) his other wife, Wa'ilah the hypocrite, (of whom We had decreed that she should be of those who stay behind) and be destroyed.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "15:60",
            "27:57",
            "29:32",
            "7:83",
            "36:3",
            "15:9",
            "37:52",
            "44:31",
            "15:23",
            "7:15"
        ],
        "BIBLE": [
            "prophets:i%20samuel:20:7",
            "prophets:judges:21:16",
            "torah:numbers:26:65",
            "torah:genesis:18:32",
            "prophets:ii%20samuel:14:7",
            "prophets:i%20samuel:20:9",
            "writings:ii%20chronicles:25:16",
            "prophets:ii%20kings:2:2",
            "prophets:hosea:10:3",
            "prophets:ii%20kings:2:6"
        ]
    }
}