{
    "VERSE": "15:63",
    "ARABIC": "قَالُوا۟ بَلْ جِئْنَٰكَ بِمَا كَانُوا۟ فِيهِ يَمْتَرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "They said, 'We have come to you with what they had doubts about.",
        "TRANSLATION_1": "We have come to you with news,\" they said, \"of what your people doubt;\n",
        "TRANSLATION_2": "They said: \"Nay, we have brought to you that concerning which they have been in doubt.\n",
        "TRANSLATION_3": "They replied, \"We have come to you about the matter which the (unbelievers) have rejected.\n",
        "TRANSLATION_4": "They said, “In fact we have brought to you the matter which these people doubted.”\n",
        "TRANSLATION_5": "They said: \"Nay, we have come to you with that (torment) which they have been doubting.\"\n",
        "TRANSLATION_6": "They said: Nay, we have come to you with that about which they disputed.\n",
        "TRANSLATION_7": "They said, 'Nay, but we have brought thee that concerning which they were doubting.\n",
        "TRANSLATION_8": "They said: Nay, but we bring thee that concerning which they keep disputing,\n",
        "TRANSLATION_9": "They said, \"No, but we bring you news about what they disputed,\n",
        "TRANSLATION_10": "They said: nay! we have come to thee with that whereof they have been dubitating.\n",
        "TRANSLATION_11": "They said, ‘Indeed, we bring you what they used to doubt.\n",
        "TRANSLATION_12": "They said: \"Yea, we have come to thee to accomplish that of which they doubt.\n",
        "TRANSLATION_13": "They said: \"Nay, we have come to you with that (torment) which they have been doubting.\n",
        "TRANSLATION_14": "No' they replied: 'We bring you (news) of that concerning which they were doubting.\n",
        "TRANSLATION_15": "They said, “We bring you what they have doubts about.”\n",
        "TRANSLATION_16": "They said, \"But we have come to you with that about which they were disputing,\n",
        "TRANSLATION_17": "[15:63] They said, ‘Rather, we have come to you because of that which they, your people, used to doubt, namely, the chastisement.\n",
        "TRANSLATION_18": "(They said: Nay, but we bring thee that concerning which they keep disputing) the torment in which they are in doubt,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "15:63",
            "85:19",
            "84:22",
            "15:93",
            "88:22",
            "37:12",
            "52:12",
            "77:29",
            "26:207",
            "16:55"
        ],
        "BIBLE": [
            "torah:exodus:32:21",
            "torah:exodus:3:12",
            "prophets:ii%20kings:2:20",
            "prophets:i%20samuel:8:7",
            "prophets:isaiah:8:12",
            "torah:exodus:20:17",
            "prophets:judges:7:4",
            "prophets:ii%20samuel:14:15",
            "prophets:i%20samuel:14:34",
            "writings:ecclesiastes:2:2"
        ]
    }
}