{
    "VERSE": "15:66",
    "ARABIC": "وَقَضَيْنَآ إِلَيْهِ ذَٰلِكَ ٱلْأَمْرَ أَنَّ دَابِرَ هَٰٓؤُلَآءِ مَقْطُوعٌ مُّصْبِحِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "We revealed to him the command We had decreed: that on the following morning the last remnant of those people would be cut off.",
        "TRANSLATION_1": "We issued this command to him, for they were going to be destroyed in the morning.\n",
        "TRANSLATION_2": "And We communicated to him the decree that by the morning those people will be totally destroyed.\n",
        "TRANSLATION_3": "We informed him that the unbelievers would be utterly destroyed.\n",
        "TRANSLATION_4": "And We informed him the decision of this command, that at morning the root of the disbelievers would be cut off.\n",
        "TRANSLATION_5": "And We made this decree known to him that those (sinners) would be rooted out in the early morning.\n",
        "TRANSLATION_6": "And We revealed to him this decree, that the roots of these shall be cut off in the morning.\n",
        "TRANSLATION_7": "And We decreed for him that commandment, that the last remnant of those should be cut off in the morning.\n",
        "TRANSLATION_8": "And We made plain the case to him, that the root of them (who did wrong) was to be cut at early morn.\n",
        "TRANSLATION_9": "We communicated to him Our decree that the guilty ones would be destroyed by the morning.\n",
        "TRANSLATION_10": "And We decreed unto him this commandment because the last of those was to be cut off in the early morning.\n",
        "TRANSLATION_11": "We apprised him of the matter that these will be rooted out by dawn.\n",
        "TRANSLATION_12": "And We made known this decree to him, that the last remnants of those (sinners) should be cut off by the morning.\n",
        "TRANSLATION_13": "And We made known this decree to him, that the root of those (sinners) was to be cut off in the early morning.\n",
        "TRANSLATION_14": "And We made known to him this decree that the wrongdoers were to be utterly cut off in the morning.\n",
        "TRANSLATION_15": "And We informed him of Our decree: the last remnant of these will be uprooted by early morning.\n",
        "TRANSLATION_16": "And We conveyed to him [the decree] of that matter: that those [sinners] would be eliminated by early morning.\n",
        "TRANSLATION_17": "[15:66] And We conveyed, We revealed, to him the matter, which was, that these [sinners] was to be eradicated by morning (musbihīn is a circumstantial qualifier,), in other words, their annihilation will take place in the morning.\n",
        "TRANSLATION_18": "(And We made plain the case to him) We commanded him to go to Sa'ar, (that the root of them (who did wrong)) the people of Lot (was to be cut at early morn) in the morning.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "15:66",
            "21:27",
            "20:32",
            "26:151",
            "20:26",
            "47:26",
            "51:4",
            "79:5",
            "75:28",
            "42:43"
        ],
        "BIBLE": [
            "prophets:ezekiel:25:7",
            "prophets:hosea:6:3",
            "writings:psalms:88:17",
            "prophets:jeremiah:11:19",
            "writings:ii%20chronicles:2:7",
            "writings:psalms:69:5",
            "prophets:i%20kings:13:34",
            "prophets:jeremiah:34:18",
            "prophets:ezekiel:14:8",
            "prophets:joshua:17:18"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:3:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:6:5"
        ]
    }
}