{
    "VERSE": "15:67",
    "ARABIC": "وَجَآءَ أَهْلُ ٱلْمَدِينَةِ يَسْتَبْشِرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "The people of the city came, exulting at the news.",
        "TRANSLATION_1": "Then came the people of the city, exulting at the news.\n",
        "TRANSLATION_2": "In the meantime the people of the city came to Lot rejoicing.\n",
        "TRANSLATION_3": "The people of the town rejoicingly\n",
        "TRANSLATION_4": "And the people of the city came rejoicing. (* To the house of Prophet Lut.)\n",
        "TRANSLATION_5": "And the inhabitants of the city came rejoicing.\n",
        "TRANSLATION_6": "And the people of the town came rejoicing.\n",
        "TRANSLATION_7": "And the people of the city came rejoicing.\n",
        "TRANSLATION_8": "And the people of the city came, rejoicing at the news (of new arrivals).\n",
        "TRANSLATION_9": "The people of the town came along, revelling,\n",
        "TRANSLATION_10": "And there came the people of the city rejoicing\n",
        "TRANSLATION_11": "The people of the city came, rejoicing.\n",
        "TRANSLATION_12": "The inhabitants of the city came in (mad) joy (at news of the young men).\n",
        "TRANSLATION_13": "And the inhabitants of the city came rejoicing (at the news of the young men's arrival).\n",
        "TRANSLATION_14": "The people of the city came to him rejoicing.\n",
        "TRANSLATION_15": "And the people of the town came joyfully.\n",
        "TRANSLATION_16": "And the people of the city came rejoicing.\n",
        "TRANSLATION_17": "[15:67] And then came the people of the city, the city of Sodom, that is, the people of Lot, upon being told that there were handsome clean-shaven individuals — namely, the angels — in the house of Lot, rejoicing (yastabshirūn is a circumstantial qualifier), desiring to commit an abomination with them.\n",
        "TRANSLATION_18": "(And the people of the city came) to the house of Lot, (rejoicing at the news (of new arrivals)) and at the prospect of engaging in their evil acts.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "15:67",
            "84:9",
            "7:111",
            "26:36",
            "36:50",
            "75:33",
            "7:83",
            "27:57",
            "9:101",
            "27:48"
        ],
        "BIBLE": [
            "prophets:ezekiel:23:39",
            "prophets:ezekiel:43:4",
            "writings:i%20chronicles:17:1",
            "prophets:joshua:19:1",
            "prophets:jeremiah:28:1",
            "prophets:ii%20kings:11:13",
            "prophets:ezekiel:36:21",
            "torah:leviticus:14:35",
            "prophets:ii%20kings:11:20",
            "prophets:jeremiah:19:14"
        ]
    }
}