{
    "VERSE": "15:7",
    "ARABIC": "لَّوْ مَا تَأْتِينَا بِٱلْمَلَٰٓئِكَةِ إِن كُنتَ مِنَ ٱلصَّٰدِقِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Why do you not bring angels to us if you are telling the truth?'",
        "TRANSLATION_1": "If you are a man of truth, why can't you bring the angels to us?\"\n",
        "TRANSLATION_2": "Why do you not bring down angels upon us if you are indeed truthful?\"\n",
        "TRANSLATION_3": "Why do you not bring down the angels if what you say is true\".\n",
        "TRANSLATION_4": "“Why do you not bring angels to us, if you are truthful?”\n",
        "TRANSLATION_5": "Why do you not bring angels to us if you are of the truthful\"\n",
        "TRANSLATION_6": "Why do you not bring to us the angels if you are of the truthful ones?\n",
        "TRANSLATION_7": "Why dost thou not bring the angels unto us, if thou speakest truly?'\n",
        "TRANSLATION_8": "Why bringest thou not angels unto us, if thou art of the truthful?\n",
        "TRANSLATION_9": "Why do you not bring down the angels upon us, if you are truthful?\"\n",
        "TRANSLATION_10": "Why bringest thou not angels unto us if thou art of the truthtellers!\n",
        "TRANSLATION_11": "Why do you not bring us the angels should you be truthful?!’\n",
        "TRANSLATION_12": "Why bringest thou not angels to us if it be that thou hast the Truth?\"\n",
        "TRANSLATION_13": "Why do you not bring angels to us if you are of the truthful ones?\"\n",
        "TRANSLATION_14": "Why do you not bring down the angels, if what you say is true'\n",
        "TRANSLATION_15": "Why do you not bring us the angels, if you are truthful?”\n",
        "TRANSLATION_16": "Why do you not bring us the angels, if you should be among the truthful?\"\n",
        "TRANSLATION_17": "[15:7] Why do you not bring us the angels, if you are of the truthful?’, in saying that you are a prophet and that this Qur’ān is from God.\n",
        "TRANSLATION_18": "(Why bringest thou not angels unto Us) from heaven so that they bear witness that you are Allah's Messenger, (if thou art of the truthful?) in what you say.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "15:7",
            "43:60",
            "26:31",
            "15:8",
            "6:8",
            "89:22",
            "6:9",
            "7:11",
            "17:95",
            "43:20"
        ],
        "BIBLE": [
            "prophets:i%20samuel:9:7",
            "prophets:i%20kings:17:18",
            "prophets:ezekiel:22:24",
            "writings:job:34:9",
            "prophets:judges:6:12",
            "prophets:ezekiel:28:9",
            "prophets:ezekiel:31:2",
            "writings:psalms:8:5",
            "prophets:i%20kings:17:24",
            "prophets:i%20samuel:21:15"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:3:5",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:12",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:4:11",
            "Sefer%20Yetzirah:1:7"
        ]
    }
}