{
    "VERSE": "15:71",
    "ARABIC": "قَالَ هَٰٓؤُلَآءِ بَنَاتِىٓ إِن كُنتُمْ فَٰعِلِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "He said, 'Here are my daughters if you are determined to do something.'",
        "TRANSLATION_1": "Here are my daughters,\" said Lot, \"if you are so active.\"\n",
        "TRANSLATION_2": "Lot exclaimed in exasperation: \"If you are bent on doing something, then here are my daughters.\"\n",
        "TRANSLATION_3": "Lot said, \"These are my daughters if you want them.\"\n",
        "TRANSLATION_4": "He said, “These women of our tribe are my daughters, if you have to.”\n",
        "TRANSLATION_5": "[Lut] said: \"These are my daughters, if you must act (so).\"\n",
        "TRANSLATION_6": "He said: These are my daughters, if you will do (aught).\n",
        "TRANSLATION_7": "He said, 'These are my daughters, if you would be doing.'\n",
        "TRANSLATION_8": "He said: Here are my daughters, if ye must be doing (so).\n",
        "TRANSLATION_9": "He said, \"Here are my daughters, if you must act in this way.\"\n",
        "TRANSLATION_10": "He said: these are my daughters, if act ye must.\n",
        "TRANSLATION_11": "He said, ‘These are my daughters, [marry them] if you should do anything.’\n",
        "TRANSLATION_12": "He said: \"There are my daughters (to marry), if ye must act (so).\"\n",
        "TRANSLATION_13": "[Lout (Lot)] said: \"These (the girls of the nation) are my daughters (to marry lawfully), if you must act (so).\"\n",
        "TRANSLATION_14": "He said: 'Here are my daughters; take them (in marriage), if you would be doing'\n",
        "TRANSLATION_15": "He said, “These are my daughters, if you must.”\n",
        "TRANSLATION_16": "[Lot] said, \"These are my daughters - if you would be doers [of lawful marriage].\"\n",
        "TRANSLATION_17": "[15:71] He said, ‘These here are my daughters, if you must be doing’, what you desire [to do] in the way of satisfying your lust, then marry them. God, exalted be He, says:\n",
        "TRANSLATION_18": "278 He said: Here are my daughters) it is also said that this means: here are the daughters of my people, I will marry you to them, (if ye must be doing (so)) if you want to get married.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "15:71",
            "43:16",
            "56:87",
            "37:153",
            "26:59",
            "26:17",
            "26:133",
            "52:39",
            "80:36",
            "74:13"
        ],
        "BIBLE": [
            "torah:genesis:28:20",
            "writings:ruth:1:12",
            "prophets:i%20samuel:9:6",
            "torah:genesis:19:15",
            "prophets:judges:18:6",
            "torah:genesis:24:40",
            "torah:genesis:19:12",
            "prophets:jeremiah:2:33",
            "torah:exodus:1:16",
            "torah:genesis:19:14"
        ]
    }
}