{
    "VERSE": "15:72",
    "ARABIC": "لَعَمْرُكَ إِنَّهُمْ لَفِى سَكْرَتِهِمْ يَعْمَهُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "By your life! They were wandering blindly in their drunkenness!",
        "TRANSLATION_1": "Verily by your life they were utterly confused in their (lustful) drunkenness.\n",
        "TRANSLATION_2": "By your life, (O Prophet), they went about blindly stumbling in their intoxication.\n",
        "TRANSLATION_3": "By your life! In their drunkenness they were truly blind.\n",
        "TRANSLATION_4": "By your life O dear Prophet (Mohammed – peace and blessings be upon him) – they are indeed straying in their intoxication.\n",
        "TRANSLATION_5": "Verily, by your life, in their wild intoxication, they were wandering blindly.\n",
        "TRANSLATION_6": "By your life! they were blindly wandering on in their intoxication.\n",
        "TRANSLATION_7": "By thy life, they wandered blindly in their dazzlement,\n",
        "TRANSLATION_8": "By thy life (O Muhammad) they moved blindly in the frenzy of approaching death.\n",
        "TRANSLATION_9": "By your life, they wandered on in their wild intoxication\n",
        "TRANSLATION_10": "By thy life, in their intoxication they were wandering bewildered.\n",
        "TRANSLATION_11": "By your life, they were bewildered in their drunkenness.\n",
        "TRANSLATION_12": "Verily, by thy life (O Prophet), in their wild intoxication, they wander in distraction, to and fro.\n",
        "TRANSLATION_13": "Verily, by your life (O Muhammad SAW), in their wild intoxication, they were wandering blindly.\n",
        "TRANSLATION_14": "By your life, they wandered blindly in their dazzlement.\n",
        "TRANSLATION_15": "By your life, they were blundering in their drunkenness.\n",
        "TRANSLATION_16": "By your life, [O Muhammad], indeed they were, in their intoxication, wandering blindly.\n",
        "TRANSLATION_17": "[15:72] By your life — this is an address to the Prophet (s) — in their drunkenness they were bewildered, hesitant.\n",
        "TRANSLATION_18": "By thy life (0 Muhammad)) Allah swore by the life of Muhammad (pbuh) and it is also said that He swore by His religion (they) i.e. the people of Lot (moved blindly) they did not see (in the frenzy of approaching death) because of their ignorance that they were heading towards their death.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "15:72",
            "51:8",
            "26:212",
            "37:137",
            "23:73",
            "26:55",
            "37:127",
            "36:3",
            "37:52",
            "81:19"
        ],
        "BIBLE": [
            "torah:genesis:8:7",
            "torah:genesis:7:15",
            "writings:proverbs:12:28",
            "torah:numbers:35:31",
            "prophets:jeremiah:4:24",
            "writings:ii%20chronicles:34:22",
            "prophets:i%20kings:13:28",
            "torah:numbers:32:13",
            "torah:deuteronomy:30:19",
            "writings:job:2:2"
        ]
    }
}