{
    "VERSE": "15:74",
    "ARABIC": "فَجَعَلْنَا عَٰلِيَهَا سَافِلَهَا وَأَمْطَرْنَا عَلَيْهِمْ حِجَارَةً مِّن سِجِّيلٍ",
    "ENGLISH": {
        "TRANSLATION_0": "We turned the place completely upside down and rained down on them stones of hard-baked clay.",
        "TRANSLATION_1": "And We turned the city upside down, and rained on them stones of hardened lava.\n",
        "TRANSLATION_2": "and turned the land upside down, and rained down stones of baked clay.\n",
        "TRANSLATION_3": "We turned the town upside-down and showered on them lumps of baked clay.\n",
        "TRANSLATION_4": "And We turned the township upside down and rained upon them stones of heated clay.\n",
        "TRANSLATION_5": "And We turned them upside down and rained stones of baked clay upon them.\n",
        "TRANSLATION_6": "Thus did We turn it upside down, and rained down upon them stones of what had been decreed.\n",
        "TRANSLATION_7": "and We turned it uppermost nethermost and rained on it stones of baked clay.\n",
        "TRANSLATION_8": "And We utterly confounded them, and We rained upon them stones of heated clay.\n",
        "TRANSLATION_9": "We turned the town upside down and rained upon them stones of clay.\n",
        "TRANSLATION_10": "And We made the upside there of downwards, and We rained on them stones of baked clay.\n",
        "TRANSLATION_11": "and We made its topmost part its nethermost, and rained on them stones of shale.\n",
        "TRANSLATION_12": "And We turned (the cities) upside down, and rained down on them brimstones hard as baked clay.\n",
        "TRANSLATION_13": "And We turned (the towns of Sodom in Palestine) upside down and rained down on them stones of baked clay.\n",
        "TRANSLATION_14": "We laid it (the city) upside down and rained stones of baked clay upon them.\n",
        "TRANSLATION_15": "And We turned it upside down, and rained down upon them stones of baked clay.\n",
        "TRANSLATION_16": "And We made the highest part [of the city] its lowest and rained upon them stones of hard clay.\n",
        "TRANSLATION_17": "[15:74] And We made their, that is, their cities’, topmost part their nethermost, by Gabriel’s raising them [the cities] to the heaven and dropping them face down onto the earth, and We rained on them stones of baked clay, clay baked in fire.\n",
        "TRANSLATION_18": "And We utterly confounded them) We turned their location upside down, (and We rained upon them) upon heir sodomites and sinners (stones of heated clay) coming down from the first heaven; it is also said that hese stones were of manure and mud which were heated up like bricks.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "15:74",
            "105:4",
            "11:82",
            "51:33",
            "37:146",
            "15:52",
            "17:50",
            "68:25",
            "83:33",
            "44:53"
        ],
        "BIBLE": [
            "prophets:isaiah:34:9",
            "writings:psalms:85:2",
            "prophets:jeremiah:31:23",
            "writings:daniel:11:19",
            "torah:deuteronomy:2:27",
            "prophets:i%20samuel:13:17",
            "prophets:ezekiel:29:14",
            "torah:exodus:32:8",
            "prophets:malachi:3:24",
            "prophets:jeremiah:50:16"
        ]
    }
}