{
    "VERSE": "15:75",
    "ARABIC": "إِنَّ فِى ذَٰلِكَ لَءَايَٰتٍ لِّلْمُتَوَسِّمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "There are certainly Signs in that for the discerning.",
        "TRANSLATION_1": "Herein are really signs for those who discern.\n",
        "TRANSLATION_2": "There are great Signs in this for those endowed with intelligence.\n",
        "TRANSLATION_3": "In this there is evidence (of the Truth) for the prudent ones.\n",
        "TRANSLATION_4": "Indeed in this are signs for people who perceive.\n",
        "TRANSLATION_5": "Surely, in this are signs for those who see.\n",
        "TRANSLATION_6": "Surely in this are signs for those who examine.\n",
        "TRANSLATION_7": "Surely in that are signs for such as mark;\n",
        "TRANSLATION_8": "Lo! therein verily are portents for those who read the signs.\n",
        "TRANSLATION_9": "There are certainly signs in that for those who can learn a lesson --\n",
        "TRANSLATION_10": "Verily therein are signs for men of sagacity.\n",
        "TRANSLATION_11": "There are indeed signs in that for the percipient.\n",
        "TRANSLATION_12": "Behold! in this are Signs for those who by tokens do understand.\n",
        "TRANSLATION_13": "Surely! In this are signs, for those who see (or understand or learn the lessons from the Signs of Allah).\n",
        "TRANSLATION_14": "Surely, in that there are signs for those who contemplate.\n",
        "TRANSLATION_15": "Surely in that are lessons for those who read signs.\n",
        "TRANSLATION_16": "Indeed in that are signs for those who discern.\n",
        "TRANSLATION_17": "[15:75] Indeed in that, which is mentioned, there are signs, indications of God’s Oneness, for those who take note, [those who] observe and take heed.\n",
        "TRANSLATION_18": "Lo! Therein) in that which We did to them (verily are portents) signs and lessons (for those who read the signs) it is also said that this means: for those who meditate; and also: for those who can see; and: for hose who take admonition.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "15:77",
            "15:75",
            "23:30",
            "7:174",
            "45:3",
            "20:54",
            "26:103",
            "26:121",
            "26:190",
            "26:67"
        ],
        "BIBLE": [
            "prophets:isaiah:29:14",
            "writings:nehemiah:8:3",
            "writings:psalms:37:37",
            "writings:proverbs:12:8",
            "writings:ii%20chronicles:6:18",
            "prophets:ezekiel:44:5",
            "prophets:ezekiel:9:4",
            "prophets:isaiah:6:9",
            "torah:numbers:13:32",
            "prophets:jeremiah:29:32"
        ]
    }
}