{
    "VERSE": "15:79",
    "ARABIC": "فَٱنتَقَمْنَا مِنْهُمْ وَإِنَّهُمَا لَبِإِمَامٍ مُّبِينٍ",
    "ENGLISH": {
        "TRANSLATION_0": "We took revenge on them as well. They are both beside a well-beaten track.",
        "TRANSLATION_1": "So We punished them too. They are both situated by the highway, clearly visible.\n",
        "TRANSLATION_2": "So We chastised them. The desolate locations of both communities lie on a well-known highway.\n",
        "TRANSLATION_3": "We afflicted them with punishment. Both people had clear (divine) authority among them.\n",
        "TRANSLATION_4": "We therefore took revenge from them; and indeed both these townships are situated on an open road.\n",
        "TRANSLATION_5": "So, We took vengeance on them. They are both on an open route, plain to see.\n",
        "TRANSLATION_6": "So We inflicted retribution on them, and they are both, indeed, on an open road (still) pursued.\n",
        "TRANSLATION_7": "and We took vengeance on them. The two of them were upon a roadway manifest.\n",
        "TRANSLATION_8": "So we took vengeance on them; and lo! they both are on a high-road plain to see.\n",
        "TRANSLATION_9": "So We took vengeance on them. Both are still there on the highway, plain for all to see.\n",
        "TRANSLATION_10": "So We took vengeance on them. And verily both are on a high-road open.\n",
        "TRANSLATION_11": "So We took vengeance on them, and indeed the two of them are on an open highway.\n",
        "TRANSLATION_12": "So We exacted retribution from them. They were both on an open highway, plain to see.\n",
        "TRANSLATION_13": "So, We took vengeance on them. They are both on an open highway, plain to see.\n",
        "TRANSLATION_14": "On them, too, We took vengeance, and they are both on a clear roadway.\n",
        "TRANSLATION_15": "So We took revenge upon them. Both are clearly documented.\n",
        "TRANSLATION_16": "So We took retribution from them, and indeed, both [cities] are on a clear highway.\n",
        "TRANSLATION_17": "[15:79] So We exacted retribution from them, by destroying them through extreme heat. And certainly both of them, that is, the cities of the people of Lot and those of [the dwellers in] the wood, are upon a open road, plain [to see]: so will you not take heed from their example, O people of Mecca?\n",
        "TRANSLATION_18": "So We took vengeance on them) in this worldly life by means of chastisement; (and lo! they both) the ownships of Lot and Shu'ayb (are on a high road plain to see) and which they do pass by.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "15:79",
            "43:41",
            "69:49",
            "32:30",
            "32:24",
            "43:79",
            "37:137",
            "7:181",
            "26:55",
            "37:127"
        ],
        "BIBLE": [
            "writings:ii%20chronicles:13:19",
            "prophets:jeremiah:32:11",
            "torah:numbers:21:25",
            "writings:i%20chronicles:2:23",
            "torah:exodus:14:6",
            "prophets:i%20kings:22:44",
            "prophets:ii%20kings:15:4",
            "prophets:ii%20kings:14:4",
            "prophets:ii%20kings:12:4",
            "torah:exodus:24:7"
        ]
    }
}