{
    "VERSE": "15:82",
    "ARABIC": "وَكَانُوا۟ يَنْحِتُونَ مِنَ ٱلْجِبَالِ بُيُوتًا ءَامِنِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "They carved out houses from the mountains, feeling safe,",
        "TRANSLATION_1": "They used to hew dwellings in the mountains to live in security.\n",
        "TRANSLATION_2": "They used to hew out houses from the mountains and lived in security.\n",
        "TRANSLATION_3": "They would carve secure houses out of the mountains.\n",
        "TRANSLATION_4": "And they used to carve dwellings in the hills, without fear.\n",
        "TRANSLATION_5": "And they used to hew out dwellings from the mountains, (feeling) secure.\n",
        "TRANSLATION_6": "And they hewed houses in the mountains in security.\n",
        "TRANSLATION_7": "They were hewing the mountains into houses, therein dwelling securely;\n",
        "TRANSLATION_8": "And they used to hew out dwellings from the hills, (wherein they dwelt) secure.\n",
        "TRANSLATION_9": "They carved out dwellings in the mountains, and lived in security --\n",
        "TRANSLATION_10": "And they were hewing out houses from mountains feeling secure.\n",
        "TRANSLATION_11": "They used to hew out dwellings from mountains feeling secure.\n",
        "TRANSLATION_12": "Out of the mountains did they hew (their) edifices, (feeling themselves) secure.\n",
        "TRANSLATION_13": "And they used to hew out dwellings from the mountains (feeling themselves) secure.\n",
        "TRANSLATION_14": "They hewed their dwellings out of the mountains in safety.\n",
        "TRANSLATION_15": "They used to carve homes in the mountains, feeling secure.\n",
        "TRANSLATION_16": "And they used to carve from the mountains, houses, feeling secure.\n",
        "TRANSLATION_17": "[15:82] And they used to hew out dwellings from the mountains, feeling secure.\n",
        "TRANSLATION_18": "And they used to hew out dwellings from the hills) from the mountains, (wherein they dwelt) secure) in the sense that they were safe from their collapse; it is also said that this means: safe from the torment. 279\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "15:82",
            "26:149",
            "79:32",
            "52:4",
            "16:68",
            "77:10",
            "81:3",
            "52:10",
            "88:19",
            "56:5"
        ],
        "BIBLE": [
            "torah:genesis:50:22",
            "torah:deuteronomy:8:12",
            "prophets:nahum:1:5",
            "writings:job:21:28",
            "writings:psalms:84:5",
            "writings:job:15:28",
            "prophets:judges:18:7",
            "prophets:amos:6:1",
            "prophets:jeremiah:20:6",
            "prophets:i%20kings:8:13"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:2:6",
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:3:6",
            "Sefer%20Yetzirah:5:1"
        ]
    }
}