{
    "VERSE": "15:86",
    "ARABIC": "إِنَّ رَبَّكَ هُوَ ٱلْخَلَّٰقُ ٱلْعَلِيمُ",
    "ENGLISH": {
        "TRANSLATION_0": "Your Lord, He is the Creator, the All-Knowing.",
        "TRANSLATION_1": "Surely your Lord is the Creator and knows (everything).\n",
        "TRANSLATION_2": "Your Lord is indeed the Creator of all, the All-Knowing.\n",
        "TRANSLATION_3": "Your Lord is certainly the All-knowing Creator.\n",
        "TRANSLATION_4": "Indeed your Lord only is the Great Creator, the All Knowing.\n",
        "TRANSLATION_5": "Verily, your Lord is the Knowing Creator.\n",
        "TRANSLATION_6": "Surely your Lord is the Creator of all things, the Knowing.\n",
        "TRANSLATION_7": "Surely thy Lord, He is the All-creator, the All-knowing.\n",
        "TRANSLATION_8": "Lo! Thy Lord! He is the All-Wise Creator.\n",
        "TRANSLATION_9": "Surely your Lord is the All Knowing Creator!\n",
        "TRANSLATION_10": "Verify thy Lord! He is the Great Creator, the Knower.\n",
        "TRANSLATION_11": "Indeed your Lord is the All-creator, the All-knowing.\n",
        "TRANSLATION_12": "For verily it is thy Lord who is the Master-Creator, knowing all things.\n",
        "TRANSLATION_13": "Verily, your Lord is the All-Knowing Creator.\n",
        "TRANSLATION_14": "Your Lord is the Creator, the Knower.\n",
        "TRANSLATION_15": "Your Lord is the All-Knowing Creator.\n",
        "TRANSLATION_16": "Indeed, your Lord - He is the Knowing Creator.\n",
        "TRANSLATION_17": "[15:86] Truly your Lord, He is the Creator, of everything, the Knowing, of everything.\n",
        "TRANSLATION_18": "(Lo! thy Lord! He is the All-Wise Creator) Who will resurrect those who believe in Him and those who do not believe in Him, and He also knows their reward and punishment.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "15:86",
            "26:192",
            "44:6",
            "56:80",
            "69:43",
            "15:25",
            "51:30",
            "7:121",
            "26:47",
            "26:98"
        ],
        "BIBLE": [
            "writings:proverbs:30:18",
            "writings:psalms:126:3",
            "torah:leviticus:5:17",
            "prophets:joshua:1:17",
            "writings:psalms:135:5",
            "torah:deuteronomy:12:26",
            "writings:job:10:13",
            "prophets:jeremiah:17:9",
            "prophets:ii%20samuel:14:20",
            "torah:deuteronomy:25:16"
        ]
    }
}