{
    "VERSE": "15:87",
    "ARABIC": "وَلَقَدْ ءَاتَيْنَٰكَ سَبْعًا مِّنَ ٱلْمَثَانِى وَٱلْقُرْءَانَ ٱلْعَظِيمَ",
    "ENGLISH": {
        "TRANSLATION_0": "We have given you the Seven Oft-repeated* and the Magnificent Qur'an.",
        "TRANSLATION_1": "We have indeed given you the seven oft-repeated (examples), and the majestic Qur'an.\n",
        "TRANSLATION_2": "We have indeed bestowed on you the seven oft-repeated verses and the Great Qur'an.\n",
        "TRANSLATION_3": "(Muhammad), We have given you the seven most repeated (verses) and the great Quran.\n",
        "TRANSLATION_4": "And indeed We have given you seven verses that are repeated, and the great Qur’an.\n",
        "TRANSLATION_5": "And indeed, We have bestowed upon you seven of the Mathani, and the Grand Qur'an.\n",
        "TRANSLATION_6": "And certainly We have given you seven of the oft-repeated (verses) and the grand Quran.\n",
        "TRANSLATION_7": "We have given thee seven of the oft-repeated, and the mighty Koran.\n",
        "TRANSLATION_8": "We have given thee seven of the oft-repeated (verses) and the great Qur'an.\n",
        "TRANSLATION_9": "We have given you the seven oft-recited verses and the great Quran.\n",
        "TRANSLATION_10": "And assuredly We have vouchsafed unto thee seven of the repetitions and the mighty Qur'an.\n",
        "TRANSLATION_11": "Certainly We have given you [the surah of] the seven oft-repeated verses and the great Quran.\n",
        "TRANSLATION_12": "And We have bestowed upon thee the Seven Oft-repeated (verses) and the Grand Qur'an.\n",
        "TRANSLATION_13": "And indeed, We have bestowed upon you seven of Al-Mathani (the seven repeatedly recited Verses), (i.e. Surat Al-Fatiha) and the Grand Quran.\n",
        "TRANSLATION_14": "We have given you the seven dual (verses, Al Fatihah) and the Mighty Holy Reading (Koran).\n",
        "TRANSLATION_15": "We have given you seven of the pairs, and the Grand Quran.\n",
        "TRANSLATION_16": "And We have certainly given you, [O Muhammad], seven of the often repeated [verses] and the great Qur'an.\n",
        "TRANSLATION_17": "[15:87] And verily We have given you seven of the oft-repeated [verses] — the Prophet (s) said that this meant [sūrat] al-Fātiha, as reported by the two Shaykhs [Bukhārī and Muslim], since it is repeated in every unit of prayer (rak‘a) — and the great Qur’ān.\n",
        "TRANSLATION_18": "(We have given thee seven of the oft repeated (verses)) He says: We honoured you with seven verses of the Qur'an which are read in every unit of the prayer, i.e. the opening chapter of the Book (al-Fatihah); it is also said that this means: We honoured you with the following of the Qur'an, for the whole Qur'an consists of pairs or couples: commands and prohibitions, promises and threats, the lawful and the unlawful, the abrogating and the abrogated, a literal meaning and an allegorical meaning, ambiguous verses and unambiguous verses, news of the past and events of the future, the praise of some people and the rebuke of others, (and the great Qur'an) He says: and We honoured you with the great, glorious and magnificent Qur'an just as We revealed the Torah and Gospel to the Jews and Christians.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "15:87",
            "54:32",
            "54:22",
            "54:17",
            "54:40",
            "43:31",
            "39:27",
            "44:30",
            "37:115",
            "27:6"
        ],
        "BIBLE": [
            "writings:daniel:2:23",
            "torah:genesis:35:12",
            "torah:numbers:21:29",
            "torah:genesis:15:18",
            "prophets:joshua:6:2",
            "writings:psalms:44:12",
            "torah:numbers:18:19",
            "writings:psalms:18:36",
            "torah:genesis:28:4",
            "prophets:i%20kings:21:20"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:13",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:5:4"
        ]
    }
}