{
    "VERSE": "15:92",
    "ARABIC": "فَوَرَبِّكَ لَنَسْـَٔلَنَّهُمْ أَجْمَعِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "By your Lord, We will question them all, every one of them,",
        "TRANSLATION_1": "By your Lord We shall question them one and all\n",
        "TRANSLATION_2": "By your Lord, We will question them all\n",
        "TRANSLATION_3": "By the Lord, We will hold them all responsible\n",
        "TRANSLATION_4": "Therefore, by your Lord, We shall question every one of them.\n",
        "TRANSLATION_5": "So, by your Lord, We shall certainly call all of them to account.\n",
        "TRANSLATION_6": "So, by your Lord, We would most certainly question them all,\n",
        "TRANSLATION_7": "Now by thy Lord, We shall surely question them all together\n",
        "TRANSLATION_8": "Them, by thy Lord, We shall question, every one,\n",
        "TRANSLATION_9": "by your Lord, We shall question them all\n",
        "TRANSLATION_10": "By thy Lord, We will question them all.\n",
        "TRANSLATION_11": "By your Lord, We will question them all\n",
        "TRANSLATION_12": "Therefore, by the Lord, We will, of a surety, call them to account,\n",
        "TRANSLATION_13": "So, by your Lord (O Muhammad SAW), We shall certainly call all of them to account.\n",
        "TRANSLATION_14": "so by your Lord, We will question them all\n",
        "TRANSLATION_15": "By your Lord, we will question them all.\n",
        "TRANSLATION_16": "So by your Lord, We will surely question them all\n",
        "TRANSLATION_17": "[15:92] By your Lord, We shall question them all — a questioning involving rebuke —\n",
        "TRANSLATION_18": "(Them, by thy Lord) Muhammad; Allah here swore by Himself, (We shall question) on the Day of Judgement, (every one),\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "15:92",
            "38:82",
            "15:39",
            "38:85",
            "7:18",
            "37:31",
            "108:2",
            "43:55",
            "17:28",
            "93:5"
        ],
        "BIBLE": [
            "torah:exodus:14:14",
            "torah:deuteronomy:5:11",
            "torah:exodus:20:7",
            "prophets:joel:4:21",
            "prophets:isaiah:64:11",
            "writings:job:13:19",
            "prophets:ii%20samuel:6:22",
            "torah:exodus:9:2",
            "prophets:i%20kings:2:9",
            "writings:job:13:5"
        ]
    }
}