{
    "VERSE": "15:94",
    "ARABIC": "فَٱصْدَعْ بِمَا تُؤْمَرُ وَأَعْرِضْ عَنِ ٱلْمُشْرِكِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Proclaim what you have been ordered to and turn away from the idolaters.",
        "TRANSLATION_1": "So declare to them what We have enjoined, and turn away from idolaters.\n",
        "TRANSLATION_2": "(O Prophet), proclaim what you are commanded, and pay no heed to those who associate others with Allah in His Divinity.\n",
        "TRANSLATION_3": "Preach what you have been commanded to and stay away from the pagans.\n",
        "TRANSLATION_4": "Therefore publicly announce what you are commanded, and turn away from the polytheists.\n",
        "TRANSLATION_5": "Therefore openly proclaim what you have been commanded, and turn away from the idolators.\n",
        "TRANSLATION_6": "Therefore declare openly what you are bidden and turn aside from the polytheists.\n",
        "TRANSLATION_7": "So shout that thou art commanded and turn thou away from the idolaters.\n",
        "TRANSLATION_8": "So proclaim that which thou art commanded, and withdraw from the idolaters.\n",
        "TRANSLATION_9": "Proclaim openly what you are commanded, and avoid the polytheists.\n",
        "TRANSLATION_10": "Promulgate thou that which thou art commanded, and turn away from the associaters.\n",
        "TRANSLATION_11": "So proclaim what you have been commanded, and turn away from the polytheists.\n",
        "TRANSLATION_12": "Therefore expound openly what thou art commanded, and turn away from those who join false gods with Allah.\n",
        "TRANSLATION_13": "Therefore proclaim openly (Allah's Message Islamic Monotheism) that which you are commanded, and turn away from Al-Mushrikun (polytheists, idolaters, and disbelievers, etc. - see V. 2:105).\n",
        "TRANSLATION_14": "Proclaim then, what you are commanded and turn away from the unbelievers.\n",
        "TRANSLATION_15": "So proclaim openly what you are commanded, and turn away from the polytheists.\n",
        "TRANSLATION_16": "Then declare what you are commanded and turn away from the polytheists.\n",
        "TRANSLATION_17": "[15:94] So proclaim, O Muhammad (s), what you have been commanded, to [proclaim], in other words, declare it openly and carry it out, and turn away from the idolaters — this was [revealed] before the command to struggle [against the idolaters].\n",
        "TRANSLATION_18": "(So proclaim that which thou art commanded) He says: reveal your matter in Mecca, (and withdraw from the idolaters).\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "15:94",
            "85:7",
            "37:141",
            "26:114",
            "27:85",
            "26:94",
            "53:53",
            "26:46",
            "7:120",
            "7:6"
        ],
        "BIBLE": [
            "torah:deuteronomy:5:29",
            "prophets:isaiah:48:5",
            "torah:deuteronomy:17:11",
            "writings:psalms:85:4",
            "prophets:isaiah:12:1",
            "torah:deuteronomy:9:12",
            "prophets:jeremiah:15:5",
            "prophets:jeremiah:31:18",
            "torah:exodus:32:8",
            "writings:psalms:119:157"
        ]
    }
}