{
    "VERSE": "15:97",
    "ARABIC": "وَلَقَدْ نَعْلَمُ أَنَّكَ يَضِيقُ صَدْرُكَ بِمَا يَقُولُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "We know that your breast is constricted by what they say.",
        "TRANSLATION_1": "We are well aware that you are disheartened by what they say.\n",
        "TRANSLATION_2": "We certainly know that their statements sorely grieve you.\n",
        "TRANSLATION_3": "We certainly know that you feel sad about what they say against you.\n",
        "TRANSLATION_4": "And indeed We know that you are disheartened by their speech.\n",
        "TRANSLATION_5": "Indeed, We know that your breast becomes tight because of what they say.\n",
        "TRANSLATION_6": "And surely We know that your breast straitens at what they say;\n",
        "TRANSLATION_7": "We know indeed thy breast is straitened by the things they say.\n",
        "TRANSLATION_8": "Well know We that thy bosom is oppressed by what they say,\n",
        "TRANSLATION_9": "We do indeed know how your heart is distressed at what they say.\n",
        "TRANSLATION_10": "And assuredly We know that thou straitenest thy breast by that which they say.\n",
        "TRANSLATION_11": "Certainly We know that you become upset because of what they say.\n",
        "TRANSLATION_12": "We do indeed know how thy heart is distressed at what they say.\n",
        "TRANSLATION_13": "Indeed, We know that your breast is straitened at what they say.\n",
        "TRANSLATION_14": "Indeed, We know your chest is straitened by that they say.\n",
        "TRANSLATION_15": "We are aware that your heart is strained by what they say.\n",
        "TRANSLATION_16": "And We already know that your breast is constrained by what they say.\n",
        "TRANSLATION_17": "[15:97] And verily (wa-laqad is for confirmation) We know that your breast is [at times] oppressed by what they say, in the way of mockery and denial.\n",
        "TRANSLATION_18": "(Well know We that thy bosom) Muhammad (is at times oppressed by what they say) in their denial of you, and that you are a poet, a magician, a liar and a diviner,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "15:97",
            "27:74",
            "28:69",
            "100:10",
            "23:95",
            "37:72",
            "28:51",
            "94:1",
            "23:73",
            "68:51"
        ],
        "BIBLE": [
            "writings:job:10:13",
            "writings:nehemiah:6:8",
            "torah:deuteronomy:18:21",
            "prophets:jeremiah:13:22",
            "writings:i%20chronicles:29:17",
            "prophets:i%20samuel:1:8",
            "prophets:jeremiah:17:9",
            "torah:genesis:21:26",
            "torah:deuteronomy:7:17",
            "writings:psalms:101:4"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:2",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:10",
            "Sefer%20Yetzirah:6:1",
            
            "Sefer%20Yetzirah:5:2"
        ]
    }
}