{
    "VERSE": "15:98",
    "ARABIC": "فَسَبِّحْ بِحَمْدِ رَبِّكَ وَكُن مِّنَ ٱلسَّٰجِدِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "So glorify your Lord with praise and be one of the prostrators.",
        "TRANSLATION_1": "But you should glorify your Lord with praises, and be among those who bow in submission;\n",
        "TRANSLATION_2": "When (you feel so) glorify your Lord with His praise and prostrate yourself before Him,\n",
        "TRANSLATION_3": "Glorify and praise your Lord and be with those who prostrate themselves before God.\n",
        "TRANSLATION_4": "Therefore proclaim the Purity of your Lord with praise, and be of those who prostrate.\n",
        "TRANSLATION_5": "So glorify the praises of your Lord and be of those who prostrate themselves (to Him).\n",
        "TRANSLATION_6": "Therefore celebrate the praise of your Lord, and be of those who make obeisance.\n",
        "TRANSLATION_7": "Proclaim thy Lord's praise, and be of those that bow,\n",
        "TRANSLATION_8": "But hymn the praise of thy Lord, and be of those who make prostration (unto Him).\n",
        "TRANSLATION_9": "But glorify your Lord with His praise, and prostrate yourself:\n",
        "TRANSLATION_10": "So hallow thou the praise of thy Lord, and be thou of the prostrate.\n",
        "TRANSLATION_11": "So celebrate the praise of your Lord and be among those who prostrate,\n",
        "TRANSLATION_12": "But celebrate the praises of thy Lord, and be of those who prostrate themselves in adoration.\n",
        "TRANSLATION_13": "So glorify the praises of your Lord and be of those who prostrate themselves (to Him).\n",
        "TRANSLATION_14": "Exalt with the praise of your Lord and be one of those who prostrate.\n",
        "TRANSLATION_15": "So glorify the praise of your Lord, and be among those who bow down.\n",
        "TRANSLATION_16": "So exalt [Allah] with praise of your Lord and be of those who prostrate [to Him].\n",
        "TRANSLATION_17": "[15:98] So glorify, intimately [repeating], the praise of your Lord, in other words, say subhāna’Llāhi wa-bi-hamdihi — and be of those who prostrate themselves, those who pray;\n",
        "TRANSLATION_18": "(But hymn the praise of thy Lord) pray by the command of your Lord, (and be of those who make prostration (unto Him)) of those who prostrate to Him; it is also said that this means: of those who are obedient to Him.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "15:98",
            "110:3",
            "68:50",
            "108:2",
            "36:27",
            "50:39",
            "52:48",
            "20:70",
            "15:56",
            "26:21"
        ],
        "BIBLE": [
            "torah:exodus:23:32",
            "torah:exodus:34:17",
            "torah:deuteronomy:26:19",
            "torah:deuteronomy:7:2",
            "writings:i%20chronicles:17:22",
            "torah:deuteronomy:16:21",
            "prophets:ezekiel:26:21",
            "prophets:ezekiel:35:11",
            "torah:deuteronomy:1:11",
            "writings:psalms:106:2"
        ]
    }
}