{
    "VERSE": "22:13",
    "ARABIC": "يَدْعُوا۟ لَمَن ضَرُّهُۥٓ أَقْرَبُ مِن نَّفْعِهِۦ لَبِئْسَ ٱلْمَوْلَىٰ وَلَبِئْسَ ٱلْعَشِيرُ",
    "ENGLISH": {
        "TRANSLATION_0": "He calls on what is far more likely to harm than help. What an evil protector! What an evil associate!",
        "TRANSLATION_1": "They pray to him whose bane is more imminent than his boon: How bad the protector and how bad the associate!\n",
        "TRANSLATION_2": "He invokes those that are more likely to cause him harm than benefit. Such is surely an evil patron, and an evil associate.\n",
        "TRANSLATION_3": "Their worship of such things, in which there is no hope for any benefit, can only harm them. How terrible is such a guardian and companion!\n",
        "TRANSLATION_4": "They worship one from whom harm is expected more than the benefit; indeed what an evil master and indeed what an evil friend!\n",
        "TRANSLATION_5": "He calls unto him whose harm is nearer than his profit; certainly an evil Mawla and certainly an evil `Ashir!\n",
        "TRANSLATION_6": "He calls upon him whose harm is nearer than his profit; evil certainly is the guardian and evil certainly is the associate.\n",
        "TRANSLATION_7": "He calls upon him who is likelier to hurt him, rather than to profit him -- an evil protector indeed, he, an evil friend!\n",
        "TRANSLATION_8": "He calleth unto him whose harm is nearer than his benefit; verily an evil patron and verily an evil friend!\n",
        "TRANSLATION_9": "he calls on that which would sooner harm than help. Such a patron is indeed evil and such a companion is indeed evil.\n",
        "TRANSLATION_10": "He calleth upon him whose hurt is nearer than his profit: surely ill the patron! ill the comrade!\n",
        "TRANSLATION_11": "He invokes someone whose harm is surely likelier than his benefit. An evil ally indeed, and an evil companion!\n",
        "TRANSLATION_12": "(Perhaps) they call on one whose hurt is nearer than his profit: evil, indeed, is the patron, and evil the companion (or help)!\n",
        "TRANSLATION_13": "He calls unto him whose harm is nearer than his profit; certainly, and evil Maula (patron) and certainly an evil friend!\n",
        "TRANSLATION_14": "He calls upon him whose harm is nearer than his benefit, an evil guide and an evil friend.\n",
        "TRANSLATION_15": "He invokes one whose harm is closer than his benefit. What a miserable master. What a miserable companion.\n",
        "TRANSLATION_16": "He invokes one whose harm is closer than his benefit - how wretched the protector and how wretched the associate.\n",
        "TRANSLATION_17": "[22:13] He calls on him (the lām [of la-man] is extra) whose harm, when worshipped, is likelier than his benefit, even if he were to have any benefit, as he imagines [him to have]. Truly an evil patron, is he, that is, [an evil] helper, and an evil friend, [an evil] companion is he. After the mention of ‘the doubter’ and [his being in manifest] ‘loss’ [above, verse 11] there follows [the mention of] the believers and [their] reward, as follows:\n",
        "TRANSLATION_18": "(He calleth unto) the Banu'l-Hallaf worship (him whose harm is nearer than his benefit) his harm is near while his benefit is far; (verily an evil patron) an evil lord (and verily an evil friend!) He says: it is truly an evil god him whose worship is harmful.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "22:13",
            "26:214",
            "34:42",
            "50:16",
            "48:11",
            "7:188",
            "20:89",
            "5:76",
            "4:7",
            "6:51"
        ],
        "BIBLE": [
            "prophets:jeremiah:7:30",
            "prophets:i%20samuel:19:7",
            "prophets:jeremiah:30:17",
            "torah:genesis:19:22",
            "prophets:jeremiah:33:3",
            "torah:genesis:20:8",
            "prophets:ii%20kings:5:18",
            "prophets:jeremiah:25:29",
            "writings:i%20chronicles:4:10",
            "writings:proverbs:18:24"
        ]
    }
}