{
    "VERSE": "22:14",
    "ARABIC": "إِنَّ ٱللَّهَ يُدْخِلُ ٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّٰلِحَٰتِ جَنَّٰتٍ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَٰرُ إِنَّ ٱللَّهَ يَفْعَلُ مَا يُرِيدُ",
    "ENGLISH": {
        "TRANSLATION_0": "Allah will admit those who have iman and do right actions into Gardens with rivers flowing under them. Allah does whatever He wishes.",
        "TRANSLATION_1": "God will admit those who believe and do the right to gardens full of rippling streams. Verily God does as He pleases.\n",
        "TRANSLATION_2": "(In contrast) Allah will assuredly cause those who believe and act righteously to enter Gardens beneath which rivers flow. For, most certainly, Allah does whatever He pleases.\n",
        "TRANSLATION_3": "God will admit the righteously striving believers to the gardens wherein streams flow. God has all the power to do whatever He wants.\n",
        "TRANSLATION_4": "Indeed Allah will admit those who believed and did good deeds, into Gardens beneath which rivers flow; indeed Allah does whatever He wills.\n",
        "TRANSLATION_5": "Truly, Allah will admit those who believe and do righteous good deeds to Gardens underneath which rivers flow. Verily, Allah does what He wills.\n",
        "TRANSLATION_6": "Surely Allah will cause those who believe and do good deeds to enter gardens beneath which rivers flow, surely Allah does what He pleases.\n",
        "TRANSLATION_7": "God shall surely admit those who believe and do righteous deeds into gardens underneath which rivers flow; surely God does that He desires.\n",
        "TRANSLATION_8": "Lo! Allah causeth those who believe and do good works to enter Gardens underneath which rivers flow. Lo! Allah doth what He intendeth.\n",
        "TRANSLATION_9": "God will admit those who believe and act righteously into Gardens watered by flowing rivers. God does whatever He wills.\n",
        "TRANSLATION_10": "Verily Allah shall cause those who believe and work righteous works to enter Gardens whereunder rivers flow; verily Allah doth whatsoever He intendeth.\n",
        "TRANSLATION_11": "Allah will indeed admit those who have faith and do righteous deeds into gardens with streams running in them. Indeed Allah does whatever He desires.\n",
        "TRANSLATION_12": "Verily Allah will admit those who believe and work righteous deeds, to Gardens, beneath which rivers flow: for Allah carries out all that He plans.\n",
        "TRANSLATION_13": "Truly, Allah will admit those who believe (in Islamic Monotheism) and do righteous good deeds (according to the Quran and the Sunnah) to Gardens underneath which rivers flow (in Paradise). Verily, Allah does what He wills.\n",
        "TRANSLATION_14": "As for those who believe and do good works Allah will admit them to gardens underneath which rivers flow. Allah indeed does what He will.\n",
        "TRANSLATION_15": "God will admit those who believe and do righteous deeds into Gardens beneath which rivers flow. God does whatever He wills.\n",
        "TRANSLATION_16": "Indeed, Allah will admit those who believe and do righteous deeds to gardens beneath which rivers flow. Indeed, Allah does what He intends.\n",
        "TRANSLATION_17": "[22:14] Truly God shall admit those who believe and perform righteous deeds, in the way of obligatory and supererogatory acts [of worship], into gardens underneath which rivers flow. Indeed God does whatever He   desires, in the way of showing beneficence to those who obey Him and degrading those who disobey Him.\n",
        "TRANSLATION_18": "364 (Lo! Allah causeth those who believe) in Muhammad (pbuh) and in the Qur'an (and do good works) acts of obedience between them and their Lord (to enter the Gardens beneath) beneath their trees and habitations (which rivers) rivers of wine, water, honey and milk (flow. Lo! Allah doth what He intendeth) whether it is bestowing bliss or inflicting damnation. This was also revealed about them when they said: we are afraid that Muhammad does not triumph in this world and, thus, we would loose the affinity existing between us and the Jews.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "22:14",
            "16:31",
            "47:12",
            "5:85",
            "22:23",
            "29:58",
            "10:9",
            "85:11",
            "14:23",
            "9:89"
        ],
        "BIBLE": [
            "prophets:isaiah:53:4",
            "prophets:ii%20kings:17:11",
            "prophets:jeremiah:29:14",
            "prophets:ii%20kings:5:20",
            "writings:ii%20chronicles:31:20",
            "writings:daniel:8:6",
            "torah:deuteronomy:14:24",
            "prophets:hosea:2:9",
            "prophets:obadiah:1:11",
            "prophets:isaiah:57:13"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:1:13",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:1"
        ]
    }
}