{
    "VERSE": "22:15",
    "ARABIC": "مَن كَانَ يَظُنُّ أَن لَّن يَنصُرَهُ ٱللَّهُ فِى ٱلدُّنْيَا وَٱلْءَاخِرَةِ فَلْيَمْدُدْ بِسَبَبٍ إِلَى ٱلسَّمَآءِ ثُمَّ لْيَقْطَعْ فَلْيَنظُرْ هَلْ يُذْهِبَنَّ كَيْدُهُۥ مَا يَغِيظُ",
    "ENGLISH": {
        "TRANSLATION_0": "Anyone who thinks that Allah will not help him in this world and the Next World should stretch a rope up to the ceiling and then hang himself. Let him see whether his stratagem gets rid of what enrages him!",
        "TRANSLATION_1": "He who thinks that God will not help him in this world and the next should stretch a rope to the sky then cut it off and see if his mind is relieved (of doubts) by this stratagem.\n",
        "TRANSLATION_2": "Anyone who fancies that Allah will not support him in this world and in the Hereafter, let him reach out to heaven through a rope, and then make a hole in the sky and see whether his device can avert that which enrages him.\n",
        "TRANSLATION_3": "Those who thought that God would never grant victory to (Muhammad), in this world nor in the life hereafter (and now that he is victorious) should hang themselves by the necks from the ceiling, then cut the rope and see if this can do away with what has enraged them.\n",
        "TRANSLATION_4": "Therefore whoever assumes that Allah will not assist His Prophet (Mohammed – peace and blessings be upon him) in this world and the Hereafter, should extend a rope upwards and hang himself, and then see whether his scheme has taken away what he envies.\n",
        "TRANSLATION_5": "Whoever thinks that Allah will not help him in this world and in the Hereafter, let him stretch out a rope to the ceiling and let him strangle himself. Then let him see whether his plan will remove that whereat he rages!\n",
        "TRANSLATION_6": "Whoever thinks that Allah will not assist him in this life and the hereafter, let him stretch a rope to the ceiling, then let him cut (it) off, then let him see if his struggle will take away that at which he is enraged.\n",
        "TRANSLATION_7": "Whosoever thinks God will not help him in the present world and the world to come; let him stretch up a rope to heaven, then let him sever it, and behold whether his guile does away with what enrages him.\n",
        "TRANSLATION_8": "Whoso is wont to think (through envy) that Allah will not give him (Muhammad) victory in the world and the Hereafter (and is enraged at the thought of his victory), let him stretch a rope up to the roof (of his dwelling), and let him hang himself. Then let him see whether his strategy dispelleth that whereat he rageth!.\n",
        "TRANSLATION_9": "Anyone who thinks that God will not help him [His messenger] in this world and the Hereafter, let him stretch a rope up to the sky; then let him cut it off and see if his plan can help to remove the cause of his anger.\n",
        "TRANSLATION_10": "Whosoever hath been imagining that Allah shall not make him victorious in the world and the Hereafter, let him stretch a cord up to the heaven and let him cut it, and let him look if his stratagem can do away that whereat he enrageth.\n",
        "TRANSLATION_11": "Whoever thinks that Allah will not help him in this world and the Hereafter, let him stretch a rope to the ceiling and hang himself, and see if his artifice would remove his rage.\n",
        "TRANSLATION_12": "If any think that Allah will not help him (His Messenger) in this world and the Hereafter, let him stretch out a rope to the ceiling and cut (himself) off: then let him see whether his plan will remove that which enrages (him)!\n",
        "TRANSLATION_13": "Whoever thinks that Allah will not help him (Muhammad SAW) in this world and in the Hereafter, let him stretch out a rope to the ceiling and let him strangle himself. Then let him see whether his plan will remove that whereat he rages!\n",
        "TRANSLATION_14": "If any one thinks that Allah will not give him (Prophet Muhammad) victory in this present world and in the Everlasting Life, let him stretch a rope to heaven, and let him sever it. Then, let him see if his guile does away with that which has enraged him.\n",
        "TRANSLATION_15": "Whoever thinks that God will not help him in this life and in the Hereafter—let him turn to heaven, then sever, and see if his cunning eliminates what enrages him.\n",
        "TRANSLATION_16": "Whoever should think that Allah will not support [Prophet Muhammad] in this world and the Hereafter - let him extend a rope to the ceiling, then cut off [his breath], and let him see: will his effort remove that which enrages [him]?\n",
        "TRANSLATION_17": "[22:15] Whoever supposes that God will not help him, namely, Muhammad (s) His Prophet, in this world and the Hereafter, let him extend a rope to the ceiling, [to] the roof of his house, fixing it there and [tying it] to his neck, and let him hang himself, that is, let him choke to death because of it, by severing his soul from [any existence on] the earth, as [reported] in the [various] Sahīh compilations. Then let him see whether his strategy, against the Prophet being helped, dispels that which enrages him, about it. In other words, let him choke to death with rage because of it, for it is inevitable.\n",
        "TRANSLATION_18": "(Whoso is wont to think that Allah will not give him) i.e. Muhammad (pbuh) (victory in the world and the Hereafter) through reason and proof, (let him stretch a rope up to the roof (of his dwelling), and let him hang himself. Then let him see) let him reflect upon (whether his strategy) hanging himself (dispelleth that whereat he rageth!) i.e. regarding Muhammad (pbuh). It is also said that there is another way of understanding this passage: whoever thinks that Allah will not help him in this worldly life with sustenance and in the Hereafter with reward, then let him tie a rope to the roof of his house, hang himself with it and see whether killing himself will dispel his rage regarding sustenance.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "22:15",
            "14:27",
            "2:114",
            "2:8",
            "4:74",
            "33:57",
            "39:68",
            "3:148",
            "13:26",
            "3:45"
        ],
        "BIBLE": [
            "torah:leviticus:4:35",
            "torah:leviticus:4:31",
            "prophets:i%20samuel:11:7",
            "writings:psalms:69:5",
            "prophets:isaiah:38:12",
            "prophets:ezekiel:15:3",
            "prophets:ezekiel:35:11",
            "torah:deuteronomy:20:19",
            "torah:leviticus:4:10",
            "prophets:jeremiah:16:6"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:7"
        ]
    }
}