{
    "VERSE": "22:16",
    "ARABIC": "وَكَذَٰلِكَ أَنزَلْنَٰهُ ءَايَٰتٍۭ بَيِّنَٰتٍ وَأَنَّ ٱللَّهَ يَهْدِى مَن يُرِيدُ",
    "ENGLISH": {
        "TRANSLATION_0": "In this way We have sent it down as Clear Signs. Allah guides anyone He wills.",
        "TRANSLATION_1": "That is why We have sent down these clear revelations, for God gives guidance whomsoever He please.\n",
        "TRANSLATION_2": "Even so We have revealed the Qur'an with Clear Signs. Verily Allah guides whomsoever He wills.\n",
        "TRANSLATION_3": "We have revealed the Quran which contains authoritative verses. God guides only those whom He wants.\n",
        "TRANSLATION_4": "And so it is, that We sent down this Qur’an – clear verses – and that Allah guides whomever He wills.\n",
        "TRANSLATION_5": "Thus have We sent it down as clear Ayat, and surely, Allah guides whom He wills.\n",
        "TRANSLATION_6": "And thus have We revealed it, being clear arguments, and because Allah guides whom He intends.\n",
        "TRANSLATION_7": "Even so We have sent it down as signs, clear signs, and for that God guides whom He desires.\n",
        "TRANSLATION_8": "Thus We reveal it as plain revelations, and verily Allah guideth whom He will.\n",
        "TRANSLATION_9": "We have sent down the Quran as clear evidence, and surely God guides whom He will.\n",
        "TRANSLATION_10": "And Thus We have sent it down as evidences, and verily Allah guideth whomsoever He intendeth.\n",
        "TRANSLATION_11": "Thus have We sent it down as manifest signs, and indeed Allah guides whomever He desires.\n",
        "TRANSLATION_12": "Thus have We sent down Clear Signs; and verily Allah doth guide whom He will!\n",
        "TRANSLATION_13": "Thus have We sent it (this Quran) down (to Muhammad SAW) as clear signs, evidences and proofs, and surely, Allah guides whom He wills.\n",
        "TRANSLATION_14": "As such We have sent it in clear verses. Indeed, Allah gives guidance to whom He will.\n",
        "TRANSLATION_15": "Thus We revealed it as clarifying signs, and God guides whomever He wills.\n",
        "TRANSLATION_16": "And thus have We sent the Qur'an down as verses of clear evidence and because Allah guides whom He intends.\n",
        "TRANSLATION_17": "[22:16] So, just as We revealed the previous verse, We revealed it, that is, the remainder of the Qur’ān, as clear signs, manifest [signs] (bayyināt, ‘clear signs’, is a circumstantial qualifier) and indeed God guides whomever He desires, that he be guided (wa-anna’Llāha yahdī man yurīdu, a supplement to the [suffixed pronoun] hā’, ‘it’, of anzalnāhu, ‘We revealed it’).\n",
        "TRANSLATION_18": "(Thus We reveal it as plain revelations) thus We send Gabriel with revelations, expositing the lawful and the unlawful (and verily Allah guideth) to His religion (whom He will) whoever deserves it.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "22:16",
            "2:242",
            "24:46",
            "40:63",
            "58:5",
            "2:73",
            "40:81",
            "13:27",
            "4:150",
            "24:1"
        ],
        "BIBLE": [
            "prophets:i%20kings:13:5",
            "prophets:i%20kings:5:18",
            "writings:psalms:119:73",
            "prophets:isaiah:43:28",
            "writings:i%20chronicles:23:25",
            "prophets:ezekiel:15:6",
            "writings:ii%20chronicles:35:21",
            "writings:psalms:111:5",
            "prophets:i%20kings:13:3",
            "prophets:amos:9:15"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:5:2",
            
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:9"
        ]
    }
}