{
    "VERSE": "22:18",
    "ARABIC": "أَلَمْ تَرَ أَنَّ ٱللَّهَ يَسْجُدُ لَهُۥ مَن فِى ٱلسَّمَٰوَٰتِ وَمَن فِى ٱلْأَرْضِ وَٱلشَّمْسُ وَٱلْقَمَرُ وَٱلنُّجُومُ وَٱلْجِبَالُ وَٱلشَّجَرُ وَٱلدَّوَآبُّ وَكَثِيرٌ مِّنَ ٱلنَّاسِ وَكَثِيرٌ حَقَّ عَلَيْهِ ٱلْعَذَابُ وَمَن يُهِنِ ٱللَّهُ فَمَا لَهُۥ مِن مُّكْرِمٍ إِنَّ ٱللَّهَ يَفْعَلُ مَا يَشَآءُ",
    "ENGLISH": {
        "TRANSLATION_0": "Do you not see that everyone in the heavens and everyone on the earth prostrates to Allah, and the sun and moon and stars and the mountains, trees and beasts and many of mankind? But many of them inevitably",
        "TRANSLATION_1": "Do you see how all things in heavens and the earth, the sun, the moon, the stars, the mountains, trees and beasts, and men in abundance, pay homage to God? Yet there are many who deserve the punishment. And whosoever God disgraces will have none to raise him up in honour. God does verily as He will.\n",
        "TRANSLATION_2": "Have you not seen that all those who are in the heavens and all those who are in the earth prostrate themselves before Allah; and so do the sun and the moon, and the stars and the mountains, and the trees, and the beasts, and so do many human beings, and even many of those who are condemned to chastisement? And he whom Allah humiliates, none can give him honour. Allah does whatever He wills.\n",
        "TRANSLATION_3": "Have you not considered that those in the heavens and the earth, the Sun, the Moon, the Stars, the mountains, the trees, the animals, and many people, all bow down to God? But many people deserve His torment. No one can give honor to whomever God has insulted. God has all the power to do what He wants.\n",
        "TRANSLATION_4": "Did you not see that for Allah prostrate those who are in the heavens and in the earth, and the sun, and the moon, and the stars, and the hills, and the trees, and the beasts, and many among mankind; and there are many upon whom the punishment has been decreed; and he whom Allah disgraces – there is none to give him honour; indeed Allah may do whatever He wills. (Command of Prostration # 6)\n",
        "TRANSLATION_5": "See you not that whoever is in the heavens and whoever is on the earth, and the sun, and the moon, and the stars, and the mountains, and the trees, and Ad-Dawabb, and many of mankind prostrate themselves to Allah. But there are many (men) on whom the punishment is justified. And whomsoever Allah disgraces, none can honor him. Verily, Allah does what He wills.\n",
        "TRANSLATION_6": "Do you not see that Allah is He, Whom obeys whoever is in the heavens and whoever is in the earth, and the sun and the moon and the stars, and the mountains and the trees, and the animals and many of the people; and many there are against whom chastisement has become necessary; and whomsoever Allah abases, there is none who can make him honorable; surely Allah does what He pleases.\n",
        "TRANSLATION_7": "Hast thou not seen how to God bow all who are in the and all who are in the earth, heavens the sun and the moon, the stars and the mountains, the trees and the beasts, and many of mankind? And many merit the chastisement; and whom God abases, there is none to honour him. God does whatsoever He will.\n",
        "TRANSLATION_8": "Hast thou not seen that unto Allah payeth adoration whosoever is in the heavens and whosoever is in the earth, and the sun, and the moon, and the stars, and the hills, and the trees, and the beasts, and many of mankind, while there are many unto whom the doom is justly due. He whom Allah scorneth, there is none to give him honour. Lo! Allah doeth what He will.\n",
        "TRANSLATION_9": "Do you not see that whoever is in the heavens and whoever is on the earth, as well as the sun and the moon, and the stars and the mountains, and the trees and the beasts and many human beings -- all submit to God? But there are many who have become deserving of punishment. Whoever God disgraces, will have no one to honour him. Surely, God does what He wills.\n",
        "TRANSLATION_10": "Beholdest thou not that Allah unto Him adore whosoever is in the heavens and on the earth, and the sun, and the moon, and the mountains, and the trees and the beasts, and many of mankind! And many are there on whom due is the torment. And whomsoever Allah despiseth, none can honour; verily Allah doth whatsoever He willeth.\n",
        "TRANSLATION_11": "Have you not regarded that whoever is in the heavens and whoever is on the earth prostrates to Allah, as well as the sun, the moon, and the stars, the mountains, the trees, and the animals and many humans? And many have come to deserve the punishment. Whomever Allah humiliates will find no one who may bring him honour. Indeed Allah does whatever He wishes.\n",
        "TRANSLATION_12": "Seest thou not that to Allah bow down in worship all things that are in the heavens and on earth,- the sun, the moon, the stars; the hills, the trees, the animals; and a great number among mankind? But a great number are (also) such as are fit for Punishment: and such as Allah shall disgrace,- None can raise to honour: for Allah carries out all that He wills.\n",
        "TRANSLATION_13": "See you not that to Allah prostrates whoever is in the heavens and whoever is on the earth, and the sun, and the moon, and the stars, and the mountains, and the trees, and Ad-Dawab (moving living creatures, beasts, etc.), and many of mankind? But there are many (men) on whom the punishment is justified. And whomsoever Allah disgraces, none can honour him. Verily! Allah does what He wills.\n",
        "TRANSLATION_14": "Have you not seen that to Allah prostrate all who are in the heavens and all who are in the earth, the sun and the moon, the stars and the mountains, the trees and the beasts, and many people? And many deserve the punishment. He who is abased by Allah has none to honor him. Allah does what He will.\n",
        "TRANSLATION_15": "Do you not realize that to God prostrates everyone in the heavens and everyone on earth, and the sun, and the moon, and the stars, and the mountains, and the trees, and the animals, and many of the people? But many are justly deserving of punishment. Whomever God shames, there is none to honor him. God does whatever He wills.\n",
        "TRANSLATION_16": "Do you not see that to Allah prostrates whoever is in the heavens and whoever is on the earth and the sun, the moon, the stars, the mountains, the trees, the moving creatures and many of the people? But upon many the punishment has been justified. And he whom Allah humiliates - for him there is no bestower of honor. Indeed, Allah does what He wills.\n",
        "TRANSLATION_17": "[22:18] Have you not seen, [have you not] realised, that to God prostrate whoever is in the heavens and whoever is in the earth, together with the sun and the moon, and the stars and the mountains, and the trees and the animals, that is, how they are submissive to Him in what He wills of them, as well as many of mankind?, namely, the believers, [who prostrate to Him] in addition to their submissiveness [to Him] when prostrating in prayer. And for many the chastisement has become due, and these are the disbelievers, for they refuse to prostrate, [an action] which is contingent on belief. And he whom God abases, [he whom] He makes unprosperous, there is none to give him honour, [none] to make him fortunate. Indeed God does whatever He will, in the way of abasing or giving honour.\n",
        "TRANSLATION_18": "(Hast thou not seen) have you not been informed, Muhammad, in the Qur'an (that unto Allah payeth adoration whosoever is in the heavens) of created beings (and whosoever is in the earth) of the believers, (and the sun, and the moon, and the stars, and the hills, and the trees, and the beasts) all of these prostrate to Allah, (and many of mankind) Paradise has been enjoined for them, these are the believers, (while there are many unto whom the doom is justly due) while the chastisement of the Fire has been enjoined upon many, these are the disbelievers. (He whom Allah scorneth) he whom Allah abases through damnation, (there is none to give him honour) through felicity; it is also said that this means: he whom Allah abases by means of ignorance, there is none to give him honour through knowledge. (Lo! Allah doeth what He will) with His created beings; He gives felicity and damnation, knowledge and ignorance.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "22:18",
            "16:49",
            "14:2",
            "31:20",
            "29:61",
            "30:8",
            "10:55",
            "14:38",
            "5:40",
            "22:70"
        ],
        "BIBLE": [
            "torah:exodus:32:1",
            "torah:genesis:13:16",
            "prophets:i%20samuel:17:25",
            "torah:exodus:34:10",
            "writings:i%20chronicles:17:21",
            "prophets:ii%20samuel:7:23",
            "prophets:ii%20kings:7:19",
            "prophets:isaiah:45:14",
            "prophets:ezekiel:26:20",
            "torah:deuteronomy:5:8"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:4",
            
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:9"
        ]
    }
}