{
    "VERSE": "22:19",
    "ARABIC": "هَٰذَانِ خَصْمَانِ ٱخْتَصَمُوا۟ فِى رَبِّهِمْ فَٱلَّذِينَ كَفَرُوا۟ قُطِّعَتْ لَهُمْ ثِيَابٌ مِّن نَّارٍ يُصَبُّ مِن فَوْقِ رُءُوسِهِمُ ٱلْحَمِيمُ",
    "ENGLISH": {
        "TRANSLATION_0": "Here are two rival groups who disputed concerning their Lord. Those who are kafir will have garments of fire cut out for them, and boiling water poured over their heads,",
        "TRANSLATION_1": "These two (believers and unbelievers) are disputants, who contend about their Lord. But they who disbelieve will be fitted out with garments of flames. Boiling water will be poured down over their heads\n",
        "TRANSLATION_2": "These two groups (the believers and unbelievers) are in dispute about their Lord. As for those that disbelieve, garments of fire have been cut out for them; boiling water shall be poured down over their heads,\n",
        "TRANSLATION_3": "(Those who prostrate themselves before God and those who do not) are two groups who dispute with each other about their Lord. For the unbelievers the garment of fire has already been prepared. Boiling water will be poured upon their heads.\n",
        "TRANSLATION_4": "These are the two groups who fought concerning their Lord; so those who disbelieved – garments of fire have been fashioned for them; and boiling water will be poured onto their heads.\n",
        "TRANSLATION_5": "These two opponents dispute with each other about their Lord; then as for those who disbelieved, garments of fire will be cut out for them, boiling water will be poured down over their heads.\n",
        "TRANSLATION_6": "These are two adversaries who dispute about their Lord; then (as to) those who disbelieve, for them are cut out garments of fire, boiling water shall be poured over their heads.\n",
        "TRANSLATION_7": "These are two disputants who have disputed concerning their Lord. As for the unbelievers, for them garments of fire shall, be cut, and there shall be poured over their heads boiling water\n",
        "TRANSLATION_8": "These twain (the believers and the disbelievers) are two opponents who contend concerning their Lord. But as for those who disbelieve, garments of fire will be cut out for them; boiling fluid will be poured down on their heads,\n",
        "TRANSLATION_9": "These two groups, [the believers and those who deny the truth], dispute concerning their Lord. Those who deny the truth will have garments of fire cut out for them; and boiling water will be poured down over their heads,\n",
        "TRANSLATION_10": "These twain are opponents who contended respecting their Lord; then as for those who disbelieved, cut out for them shall be raiments of frre: poured out over their head shall be hot water.\n",
        "TRANSLATION_11": "These two contending groups contend concerning their Lord. As for those who are faithless, cloaks of fire will be cut out for them, and boiling water will be poured over their heads,\n",
        "TRANSLATION_12": "These two antagonists dispute with each other about their Lord: But those who deny (their Lord),- for them will be cut out a garment of Fire: over their heads will be poured out boiling water.\n",
        "TRANSLATION_13": "These two opponents (believers and disbelievers) dispute with each other about their Lord; then as for those who disbelieve, garments of fire will be cut out for them, boiling water will be poured down over their heads.\n",
        "TRANSLATION_14": "Those are two who disputed concerning their Lord. Garments of fire have been prepared for the unbelievers. Boiling water shall be poured over their heads,\n",
        "TRANSLATION_15": "Here are two adversaries feuding regarding their Lord. As for those who disbelieve, garments of fire will be tailored for them, and scalding water will be poured over their heads.\n",
        "TRANSLATION_16": "These are two adversaries who have disputed over their Lord. But those who disbelieved will have cut out for them garments of fire. Poured upon their heads will be scalding water\n",
        "TRANSLATION_17": "[22:19] These twain are two contenders, that is, the believers constitute one contending party, and the five [categories of] disbelievers constitute the other contending party (the term [khasm, ‘contender’] may be used to refer to one or many) who contend concerning their Lord, that is to say, concerning His religion. As for those who disbelieve, garments of fire will be cut out for them, [garments] which they will wear — meaning that the Fire will encompass them — and boiling water will be poured over their heads, [hamīm is] water that has reached an extreme temperature,\n",
        "TRANSLATION_18": "(These twain) these are the adherents of two religions among the Muslims, Jews and Christians (are two opponents who contend concerning their Lord) concerning he religion of their Lord; one of them saying: I have a better right to Allah and His religion. And so Allah judged between the two. Allah said: (But as for those who disbelieve) in Muhammad (pbuh) and in the Qur'an, i.e. the Jews and Christians (garments of fire will be cut out for them; boiling fluid) boiling water (will be poured down on their heads.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "22:19",
            "44:48",
            "40:72",
            "38:61",
            "16:50",
            "45:30",
            "40:6",
            "3:16",
            "2:39",
            "28:21"
        ],
        "BIBLE": [
            "torah:leviticus:1:12",
            "torah:leviticus:21:10",
            "prophets:ezekiel:22:31",
            "torah:exodus:29:17",
            "writings:psalms:69:5",
            "prophets:ii%20samuel:14:26",
            "writings:ii%20chronicles:13:12",
            "writings:i%20chronicles:29:20",
            "torah:exodus:29:7",
            "prophets:jonah:4:6"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:3:8",
            "Sefer%20Yetzirah:3:4",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:1:12",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:1:14",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:5:4"
        ]
    }
}