{
    "VERSE": "22:24",
    "ARABIC": "وَهُدُوٓا۟ إِلَى ٱلطَّيِّبِ مِنَ ٱلْقَوْلِ وَهُدُوٓا۟ إِلَىٰ صِرَٰطِ ٱلْحَمِيدِ",
    "ENGLISH": {
        "TRANSLATION_0": "They have been guided to speak good words and guided to the praiseworthy path.",
        "TRANSLATION_1": "They will be guided with gentle words, and guided to the commended path.\n",
        "TRANSLATION_2": "They were guided (to accept) the pure word; they were guided to the Way of the Praiseworthy (Lord).\n",
        "TRANSLATION_3": "for they were guided to speak the noblest words and follow the praiseworthy path.\n",
        "TRANSLATION_4": "And they were guided to sacred speech; and they were shown the path of the Most Praiseworthy.\n",
        "TRANSLATION_5": "And they are guided unto goodly speech and they are guided to the path of Him, Who is Worthy of all praises.\n",
        "TRANSLATION_6": "And they are guided to goodly words and they are guided into the path of the Praised One.\n",
        "TRANSLATION_7": "and they; shall be guided unto goodly speech, and they shall be guided unto the path of the All-laudable.\n",
        "TRANSLATION_8": "They are guided unto gentle speech; they are guided unto the path of the Glorious One.\n",
        "TRANSLATION_9": "For they were guided to purity of speech. And they were guided to the path of the Glorious Lord.\n",
        "TRANSLATION_10": "And they have been guided unto goodly speech, and they have been guided to the path of the Praiseworthy.\n",
        "TRANSLATION_11": "They were guided to chaste belief, and guided to the path of the All-laudable.\n",
        "TRANSLATION_12": "For they have been guided (in this life) to the purest of speeches; they have been guided to the Path of Him Who is Worthy of (all) Praise.\n",
        "TRANSLATION_13": "And they are guided (in this world) unto goodly speech (i.e. La ilaha ill-Allah, Alhamdu lillah, recitation of the Quran, etc.) and they are guided to the Path of Him (i.e. Allah's Religion of Islamic Monotheism), Who is Worthy of all praises.\n",
        "TRANSLATION_14": "For they shall be guided to good speech and guided to the praised path.\n",
        "TRANSLATION_15": "They were guided to purity of speech. They were guided to the path of the Most Praised.\n",
        "TRANSLATION_16": "And they had been guided [in worldly life] to good speech, and they were guided to the path of the Praiseworthy.\n",
        "TRANSLATION_17": "[22:24] And they shall be guided, in this world, to wholesome words, namely, ‘There is no god except God’, and they shall be guided to the path of the Praised, that is, to the praiseworthy way of God and His religion.\n",
        "TRANSLATION_18": "(They are guided unto gentle speech) they were guided in this worldly life to say: there is no deity except Allah; (they are guided unto the path of the Glorious One) and they were guided to the praiseworthy religion. This is Allah's judgement regarding the dispute between the believers, the Jews and the Christians.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "22:24",
            "34:6",
            "37:118",
            "1:6",
            "4:68",
            "23:73",
            "15:98",
            "1:7",
            "42:28",
            "16:121"
        ],
        "BIBLE": [
            "prophets:ii%20kings:6:19",
            "torah:exodus:21:23",
            "prophets:joshua:1:18",
            "torah:exodus:4:10",
            "prophets:ezekiel:12:28",
            "writings:psalms:17:14",
            "writings:psalms:23:6",
            "prophets:ezekiel:2:7",
            "torah:deuteronomy:17:19",
            "prophets:jeremiah:38:21"
        ]
    }
}