{
    "VERSE": "22:25",
    "ARABIC": "إِنَّ ٱلَّذِينَ كَفَرُوا۟ وَيَصُدُّونَ عَن سَبِيلِ ٱللَّهِ وَٱلْمَسْجِدِ ٱلْحَرَامِ ٱلَّذِى جَعَلْنَٰهُ لِلنَّاسِ سَوَآءً ٱلْعَٰكِفُ فِيهِ وَٱلْبَادِ وَمَن يُرِدْ فِيهِ بِإِلْحَادٍۭ بِظُلْمٍ نُّذِقْهُ مِنْ عَذَابٍ أَلِيمٍ",
    "ENGLISH": {
        "TRANSLATION_0": "Those who are kafir and bar access to the Way of Allah and to the Masjid al-Haram which We have appointed for all mankind - equally for those who live near it and those who come from far away - those who desire to profane it with wrongdoing, We will let them taste a painful punishment.",
        "TRANSLATION_1": "As for those who disbelieve, and obstruct the way of God and the holy Mosque which We have set down for all men, the native and the visitor alike. Whoever puts obstructions in this mischievously will taste of painful punishment.\n",
        "TRANSLATION_2": "Indeed those who disbelieve and who (now) hinder people from the Way of Allah and hinder them from the Holy Mosque which We have set up (as a place of worship) for all people, equally for those who dwell therein and for those who come from outside, (they surely deserve punishment). Whosoever deviates therein from the Right Way and acts with iniquity, We shall cause him to taste a painful chastisement.\n",
        "TRANSLATION_3": "A painful torment awaits the pagans who create obstacles in the way that leads to God and the Sacred Mosque - which We have made for those who dwell nearby and foreigners alike - and those who commit evil and injustice therein.\n",
        "TRANSLATION_4": "Indeed those who have disbelieved and prevent from the way of Allah and from this Sacred Mosque, which We have appointed for all mankind – its resident and the foreigner have the same rights in it; and whoever wrongfully intends injustice in it – We shall make him taste a painful punishment.\n",
        "TRANSLATION_5": "Verily, those who disbelieved and hinder (men) from the path of Allah, and from Al-Masjid Al-Haram which We have made (open) to (all) men, the dweller in it and the visitor from the country are equal there, and whoever inclines to evil actions therein or to do wrong, him We shall cause to taste from a painful torment.\n",
        "TRANSLATION_6": "Surely (as for) those who disbelieve, and hinder (men) from Allah's way and from the Sacred Mosque which We have made equally for all men, (for) the dweller therein and (for) the visitor, and whoever shall incline therein to wrong unjustly, We will make him taste of a painful chastisement.\n",
        "TRANSLATION_7": "Those who disbelieve, and bar from God's way and the Holy Mosque that We have appointed equal unto men, alike him who cleaves to it and the tent-dweller, and whosoever purposes to violate it wrongly, We shall let him taste a painful chastisement.\n",
        "TRANSLATION_8": "Lo! those who disbelieve and bar (men) from the way of Allah and from the Inviolable Place of Worship, which We have appointed for mankind together, the dweller therein and the nomad: whosoever seeketh wrongful partiality therein, him We shall cause to taste a painful doom.\n",
        "TRANSLATION_9": "As for those who deny the truth and debar others from God's path and from the Sacred Mosque which We set up for all people, natives and strangers alike, and all who seek to profane it by evil-doing -- We shall make them taste a painful punishment.\n",
        "TRANSLATION_10": "Verily those who disbelieve and hinder others from the path of Allah and from the Sacred Mosque which We have appointed for mankind, equal in respect thereunto are the dweller therein and the stranger. And whosoever will seek profanity therein wrongfully, We shall make him taste of a torment afflictive.\n",
        "TRANSLATION_11": "Indeed those who are faithless and bar from the way of Allah and the Sacred Mosque, which We have made for all people, the native and the visitor being equal therein—whoever wrongfully tries to commit violation in it, We shall make him taste a painful punishment.\n",
        "TRANSLATION_12": "As to those who have rejected (Allah), and would keep back (men) from the Way of Allah, and from the Sacred Mosque, which We have made (open) to (all) men - equal is the dweller there and the visitor from the country - and any whose purpose therein is profanity or wrong-doing - them will We cause to taste of a most Grievous Penalty.\n",
        "TRANSLATION_13": "Verily! Those who disbelieve and hinder (men) from the Path of Allah, and from Al-Masjid-al-Haram (at Makkah) which We have made (open) to (all) men, the dweller in it and the visitor from the country are equal there [as regards its sanctity and pilgrimage (Hajj and 'Umrah)]. And whoever inclines to evil actions therein or to do wrong (i.e. practise polytheism and leave Islamic Monotheism), him We shall cause to taste a painful torment.\n",
        "TRANSLATION_14": "The unbelievers who bar from the Way of Allah and from the Holy Mosque which We made equal for all peoples, he who cleaves to it and the tentdweller alike, and whosoever seeks to violate it wrongfully, We shall let him taste a painful punishment.\n",
        "TRANSLATION_15": "As for those who disbelieve and repel from God’s path and from the Sacred Mosque—which We have designated for all mankind equally, whether residing therein or passing through—and seek to commit sacrilege therein—We will make him taste of a painful punishment.\n",
        "TRANSLATION_16": "Indeed, those who have disbelieved and avert [people] from the way of Allah and [from] al-Masjid al-Haram, which We made for the people - equal are the resident therein and one from outside; and [also] whoever intends [a deed] therein of deviation [in religion] or wrongdoing - We will make him taste of a painful punishment.\n",
        "TRANSLATION_17": "[22:25] Truly those who disbelieve, and who bar from the way of God, [from] obedience to Him, and, from, the Sacred Mosque, which We have assigned, as a [holy] rite and a place of devotion, for mankind, equally for the dweller, the one who resides, therein and the visitor, the passer-by; and whoever seeks [to commit] sacrilege therein (the bā’ [of bi-ilhādin, ‘sacrilege’] is extra) by doing wrong, in other words, for such a reason, committing what is forbidden, even if he should curse the [Mosque’s] attendant, We shall make him taste a painful chastisement, that is, some such [chastisement] (from this [last clause] one may derive the predicate of [the introductory particle] inna, ‘truly’, and it is this: ‘We shall make them taste a painful chastisement’.\n",
        "TRANSLATION_18": "(Lo! those who disbelieve) in Muhammad (pbuh) and in the Qur'an; the reference here is to Abu Sufyan-this happened before he embraced Islam-and his host (and bar (men) from the way of Allah) and drive people away from Allah's religion and obedience (and from the Inviolable Place of Worship) and bar Muhammad (pbuh) on the year of al-Hudaybiyyah from performing the lesser and greater pilgrimage in the Sacred Precinct (which We have appointed) as a Sacred Precinct and Qiblah (for mankind together, the dweller therein and the nomad) the dweller therein and the strangers are equal in it; (whosoever seeketh wrongful partiality therein) towards anyone, (him We shall cause to taste a painful doom) We hurt him badly so that he does not wrong anyone after that. It is also said that this was revealed concerning 'Abdullah Ibn Anas Ibn Hanzal who intentionally killed a Helper in Medina, left the religion of Islam and fled to Mecca. And so was revealed the passage: (whosoever seeketh wrongful partiality therein) towards anyone, (him We shall cause to taste a painful doom) such that he is not given food, drink or shelter until he leaves the Sacred Precinct and the legal punishment is applied on him.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "22:25",
            "42:42",
            "48:25",
            "31:6",
            "16:88",
            "4:160",
            "3:21",
            "16:104",
            "4:161",
            "9:34"
        ],
        "BIBLE": [
            "writings:daniel:6:8",
            "prophets:ezekiel:39:7",
            "torah:exodus:32:1",
            "writings:ii%20chronicles:14:6",
            "writings:daniel:6:13",
            "prophets:ezekiel:30:12",
            "prophets:jeremiah:50:3",
            "writings:ezra:6:8",
            "prophets:joel:2:17",
            "prophets:jeremiah:35:15"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:7"
        ]
    }
}