{
    "VERSE": "22:27",
    "ARABIC": "وَأَذِّن فِى ٱلنَّاسِ بِٱلْحَجِّ يَأْتُوكَ رِجَالًا وَعَلَىٰ كُلِّ ضَامِرٍ يَأْتِينَ مِن كُلِّ فَجٍّ عَمِيقٍ",
    "ENGLISH": {
        "TRANSLATION_0": "Announce the Hajj to mankind. They will come to you on foot and on every sort of lean animal, coming by every distant road",
        "TRANSLATION_1": "Announce the Pilgrimage to the people. They will come to you on foot and riding along distant roads on lean and slender beasts,\n",
        "TRANSLATION_2": "and publicly proclaim Pilgrimage for all mankind so that they come to you on foot and mounted on lean camels from every distant point\n",
        "TRANSLATION_3": "(We commanded Abraham), \"Call people for hajj - an act of worship accomplished by visiting the sacred sites in Mecca.\" They will come on foot and on lean camels from all the distant quarters\n",
        "TRANSLATION_4": "“And publicly announce the pilgrimage to all people – they will come to you, on foot and on every lean she-camel, coming from every far distant journey.” (The announcement by Prophet Ibrahim reached each and every soul.)\n",
        "TRANSLATION_5": "And proclaim to mankind the Hajj (pilgrimage). They will come to you on foot and on every lean camel, they will come from every Fajj `Amiq.\n",
        "TRANSLATION_6": "And proclaim among men the Pilgrimage: they will come to you on foot and on every lean camel, coming from every remote path,\n",
        "TRANSLATION_7": "and proclaim among men the Pilgrimage, and they shall come unto thee on foot and upon every lean beast, they shall come from every deep ravine\n",
        "TRANSLATION_8": "And proclaim unto mankind the pilgrimage. They will come unto thee on foot and on every lean camel; they will come from every deep ravine,\n",
        "TRANSLATION_9": "Call mankind to the Pilgrimage. They will come to you, on foot, and on every kind of lean camel, by every distant track\n",
        "TRANSLATION_10": "And proclaim thou among mankind the pilgrimage; they shall come unto thee on foot and on any lean mount, coming from every deep defile.\n",
        "TRANSLATION_11": "And proclaim the Hajj to all the people: they will come to you on foot and on lean camels, coming from distant places,\n",
        "TRANSLATION_12": "And proclaim the Pilgrimage among men: they will come to thee on foot and (mounted) on every kind of camel, lean on account of journeys through deep and distant mountain highways;\n",
        "TRANSLATION_13": "And proclaim to mankind the Hajj (pilgrimage). They will come to you on foot and on every lean camel, they will come from every deep and distant (wide) mountain highway (to perform Hajj).\n",
        "TRANSLATION_14": "Proclaim the pilgrimage to the people. They will come to you on foot and on every lean camel, they shall come from every deep ravine;\n",
        "TRANSLATION_15": "And announce the pilgrimage to humanity. They will come to you on foot, and on every transport. They will come from every distant point.\n",
        "TRANSLATION_16": "And proclaim to the people the Hajj [pilgrimage]; they will come to you on foot and on every lean camel; they will come from every distant pass -\n",
        "TRANSLATION_17": "[22:27] And announce, call out, among the people the [season for] Pilgrimage. Thus he cried out from [the top of] the mountain of Abū Qubays, ‘O people, your Lord has built a House and has made pilgrimage to it an obligation upon you, so respond to [the call of] your Lord’, turning his face to the right and to the left, to the east and to the west; and every one of those for whom the performance of the pilgrimage had been preordained [by God] from among the loins of men and the wombs of women, responded to him [thus]: ‘At Your service, our Lord, [we are] at Your service’ (labbayka’Llāhumma labbayk). The response to the command [clause] is [the following]: and they shall come to you on foot, walking (rijāl, plural of rājil, similar [in pattern] to qā’im, ‘standing’, and [its plural] qiyām) and, riding, on every lean camel, that is, [on] every emaciated camel (dāmir, [this term] may be used to refer to both male and female [camels]). They shall come, that is, the lean camels (by grammatical agreement with the [feminine verb] form) from every deep ravine, [from every] distant route,\n",
        "TRANSLATION_18": "(And proclaim unto mankind) call your offspring for (the Pilgrimage. They will come unto you) so that they come to you (on foot and on every lean camel; they will come from every deep ravine) from every road and remote land.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "22:27",
            "39:27",
            "10:99",
            "7:46",
            "30:58",
            "7:144",
            "26:37",
            "4:32",
            "12:103",
            "7:112"
        ],
        "BIBLE": [
            "prophets:i%20samuel:10:5",
            "prophets:ii%20kings:6:9",
            "prophets:ezekiel:38:15",
            "prophets:joshua:10:24",
            "prophets:isaiah:44:7",
            "prophets:jeremiah:19:6",
            "prophets:judges:15:17",
            "prophets:isaiah:35:8",
            "prophets:judges:17:8",
            "prophets:ii%20samuel:15:2"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:1:6"
        ]
    }
}