{
    "VERSE": "22:29",
    "ARABIC": "ثُمَّ لْيَقْضُوا۟ تَفَثَهُمْ وَلْيُوفُوا۟ نُذُورَهُمْ وَلْيَطَّوَّفُوا۟ بِٱلْبَيْتِ ٱلْعَتِيقِ",
    "ENGLISH": {
        "TRANSLATION_0": "Then they should end their state of self-neglect and fufil their vows and circle the Ancient House.'",
        "TRANSLATION_1": "Let them then attend to their persons and complete the rites of pilgrimage, fulfil their vows and circuit round the ancient House.\n",
        "TRANSLATION_2": "Thereafter, let them tidy up and fulfil their vows and circumambulate the Ancient House.\"\n",
        "TRANSLATION_3": "Let the pilgrims then neatly dress themselves, fulfil their vows, and walk seven times around the Kabah.\n",
        "TRANSLATION_4": "They must then remove their dirt and fulfil their pledges and go around the Free House.\n",
        "TRANSLATION_5": "Then let them complete their prescribed duties and perform their vows, and circumambulate the `Atiq House.\n",
        "TRANSLATION_6": "Then let them accomplish their needful acts of shaving and cleansing, and let them fulfil their vows and let them go round the Ancient House.\n",
        "TRANSLATION_7": "Let them then finish with their self-neglect and let them fulfil their vows, and go about the Ancient House.'\n",
        "TRANSLATION_8": "Then let them make an end of their unkemptness and pay their vows and go around the ancient House.\n",
        "TRANSLATION_9": "then let the pilgrims purify themselves and fulfil their vows and perform the circumambulation of the Ancient House.\n",
        "TRANSLATION_10": "Thereafter let them end their unkemptnesss and fulfil their vows and circumambulate the ancient House.\n",
        "TRANSLATION_11": "Then let them do away with their untidiness, fulfill their vows, and circle around the Ancient House.\n",
        "TRANSLATION_12": "Then let them complete the rites prescribed for them, perform their vows, and (again) circumambulate the Ancient House.\"\n",
        "TRANSLATION_13": "Then let them complete the prescribed duties (Manasik of Hajj) for them, and perform their vows, and circumambulate the Ancient House (the Ka'bah at Makkah).\n",
        "TRANSLATION_14": "Then, let the pilgrims accomplish their acts of cleansing, and let them fulfill their vows, and circumambulate the Ancient House.\n",
        "TRANSLATION_15": "Then let them perform their acts of cleansing, and fulfill their vows, and circle around the Ancient House.\n",
        "TRANSLATION_16": "Then let them end their untidiness and fulfill their vows and perform Tawaf around the ancient House.\"\n",
        "TRANSLATION_17": "[22:29] Then let them do away with their self-neglect, that is to say, [let them] remove any dirt or unkemptness, such as [any] long fingernails, and let them fulfil (read wa’l-yūfū or wa’l-yuwaffū) their vows, in the way of offerings and sacrifices, and perform the circumambulation, the circumambulation following the egress [from ‘Arafa], of the Ancient House’, that is, the Old one, because it was the first House founded for mankind.\n",
        "TRANSLATION_18": "(Then let them make an end of their unkemptness) and then let them complete the rites of their pilgrimage: shaving their heads, throwing pebbles, cutting their nails and other things (and pay their vows) and fulfil that which they made incumbent upon themselves (and go around) the obligated circumambulation (the ancient House) more ancient than any tyrant that has ever stepped on its soil; it is also said that this means: more ancient than the flood of Noah; it is also said that it is the first House ever built; and it is also said that whoever go round it will be delivered.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "22:29",
            "22:33",
            "106:3",
            "52:4",
            "15:82",
            "15:89",
            "26:149",
            "76:7",
            "54:23",
            "54:36"
        ],
        "BIBLE": [
            "writings:daniel:11:35",
            "prophets:nahum:1:9",
            "prophets:ezekiel:45:20",
            "prophets:ii%20samuel:7:11",
            "writings:daniel:8:19",
            "prophets:isaiah:63:7",
            "prophets:jeremiah:26:6",
            "torah:deuteronomy:15:1",
            "writings:daniel:11:6",
            "torah:genesis:40:14"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:3:4"
        ]
    }
}