{
    "VERSE": "22:32",
    "ARABIC": "ذَٰلِكَ وَمَن يُعَظِّمْ شَعَٰٓئِرَ ٱللَّهِ فَإِنَّهَا مِن تَقْوَى ٱلْقُلُوبِ",
    "ENGLISH": {
        "TRANSLATION_0": "That is it. As for those who honour Allah's sacred rites, that comes from the taqwa in their hearts.",
        "TRANSLATION_1": "All this, and honouring the offerings to God, comes from purity of heart.\n",
        "TRANSLATION_2": "Such is the fact. And whoso venerates the sanctity of all that have been ordained as symbols of Allah surely does so because it is part of the true piety of the hearts.\n",
        "TRANSLATION_3": "To respect the symbols of God is the sign of a pious heart.\n",
        "TRANSLATION_4": "So it is; and whoever reveres the symbols of Allah – this is then part of the piety of the hearts.\n",
        "TRANSLATION_5": "Thus it is, and whosoever honors the Sha`a'ir of Allah, then it is truly from the Taqwa of the hearts.\n",
        "TRANSLATION_6": "That (shall be so); and whoever respects the signs of Allah, this surely is (the outcome) of the piety of hearts.\n",
        "TRANSLATION_7": "All that; and whosoever venerates God's waymarks, that is of the godliness of the hearts.\n",
        "TRANSLATION_8": "That (is the command). And whoso magnifieth the offerings consecrated to Allah, it surely is from devotion of the hearts,\n",
        "TRANSLATION_9": "Thus it is. He who honours the symbols set up by God shows the piety of his heart.\n",
        "TRANSLATION_10": "Thus it is. And whosoever respecteth the rites of Allah, then verily it is from piety of the hearts.\n",
        "TRANSLATION_11": "That. And whoever venerates the sacraments of Allah—indeed that arises from the Godwariness of hearts.\n",
        "TRANSLATION_12": "Such (is his state): and whoever holds in honour the symbols of Allah, (in the sacrifice of animals), such (honour) should come truly from piety of heart.\n",
        "TRANSLATION_13": "Thus it is [what has been mentioned in the above said Verses (27, 28, 29, 30, 31) is an obligation that mankind owes to Allah]. And whosoever honours the Symbols of Allah, then it is truly from the piety of the heart.\n",
        "TRANSLATION_14": "All that; and, he who venerates the waymarks of Allah, surely it is from the piety of the hearts.\n",
        "TRANSLATION_15": "So it is. Whoever venerates the sacraments of God—it is from the piety of the hearts.\n",
        "TRANSLATION_16": "That [is so]. And whoever honors the symbols of Allah - indeed, it is from the piety of hearts.\n",
        "TRANSLATION_17": "[22:32] That (dhālika, an implied subject, al-amru, ‘the matter [is]’, is taken to precede this [predicate]). And whoever venerates the sacraments of God, then that, in other words, then that veneration of them — namely, [of] the beasts of sacrifice offered in the Sanctuary, after the best of them have been selected and fattened — derives from the piety of the hearts, of those individuals. These [sacraments] are called sha‘ā’ir because they are marked out [ish‘ār] with something to indicate that they are offerings, such as having a hump pierced with a piece of metal.\n",
        "TRANSLATION_18": "(That) i.e. being thrown away far off is the lot of he who associates partners with Allah. (And whoso magnifieth the offerings consecrated to Allah) and whoever magnifies the rites of pilgrimage, and thus immolates the fattest and biggest beast of cattle, (it) the immolation of the fattest and biggest beast of cattle (surely is from devotion of the hearts) is due to the limpidity of the person's heart and his sincerity.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "22:32",
            "13:28",
            "8:2",
            "9:77",
            "9:45",
            "33:64",
            "22:35",
            "21:29",
            "9:67",
            "25:71"
        ],
        "BIBLE": [
            "writings:esther:6:6",
            "writings:ii%20chronicles:29:31",
            "prophets:i%20kings:11:2",
            "prophets:jeremiah:20:9",
            "torah:exodus:5:1",
            "writings:nehemiah:5:8",
            "prophets:ii%20kings:6:32",
            "writings:daniel:10:12",
            "prophets:judges:16:17",
            "prophets:i%20samuel:25:36"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:2",
            
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:1:12"
        ]
    }
}