{
    "VERSE": "22:33",
    "ARABIC": "لَكُمْ فِيهَا مَنَٰفِعُ إِلَىٰٓ أَجَلٍ مُّسَمًّى ثُمَّ مَحِلُّهَآ إِلَى ٱلْبَيْتِ ٱلْعَتِيقِ",
    "ENGLISH": {
        "TRANSLATION_0": "You can make use of the sacrificial animals until a specified time, and then their place of sacrifice is by the Ancient House.",
        "TRANSLATION_1": ", There are advantages for you in these (cattle) up to a time, then their place is the ancient House for sacrifice.\n",
        "TRANSLATION_2": "You may derive benefit (from sacrificial animals) until an appointed time. Thereafter their place (of sacrifice) is near the Ancient House.\n",
        "TRANSLATION_3": "There are benefits for you in the (sacrificial offerings) of God until the appointed time when you slaughter them as your offering near the Ancient House.\n",
        "TRANSLATION_4": "In the cattle are benefits for you up to a fixed time and then they are to be brought to the Free House.\n",
        "TRANSLATION_5": "In them are benefits for you for an appointed term, and afterwards they are brought for sacrifice to the `Atiq House.\n",
        "TRANSLATION_6": "You have advantages in them till a fixed time, then their place of sacrifice is the Ancient House.\n",
        "TRANSLATION_7": "There are things therein profitable to you unto a stated term; thereafter their lawful place of sacrifice is by the Ancient House.\n",
        "TRANSLATION_8": "Therein are benefits for you for an appointed term; and afterward they are brought for sacrifice unto the ancient House.\n",
        "TRANSLATION_9": "You may benefit from the animals for an appointed time. Then they must be sacrificed at the Ancient House.\n",
        "TRANSLATION_10": "For you in them are benefits for a term appointed, and thereafter the destination is toward the ancient House.\n",
        "TRANSLATION_11": "You may benefit from them until a specified time. Then their place of sacrifice is by the Ancient House.\n",
        "TRANSLATION_12": "In them ye have benefits for a term appointed: in the end their place of sacrifice is near the Ancient House.\n",
        "TRANSLATION_13": "In them (cattle offered for sacrifice) are benefits for you for an appointed term, and afterwards they are brought for sacrifice unto the ancient House (the Haram - sacred territory of Makkah city).\n",
        "TRANSLATION_14": "In them, you have benefits until an appointed time. After their place of sacrifice is at the Ancient House.\n",
        "TRANSLATION_15": "In them are benefits for you until a certain time. Then their place is by the Ancient House.\n",
        "TRANSLATION_16": "For you the animals marked for sacrifice are benefits for a specified term; then their place of sacrifice is at the ancient House.\n",
        "TRANSLATION_17": "[22:33] You may benefit from them, such as riding on them and carrying your loads on them in a way that does not harm them, until a specified time, the time for its immolation. Thereafter its lawful sacrifice, that is, the site where its immolation becomes due, is by the Ancient House, meaning, the entire [Meccan] Sanctuary.\n",
        "TRANSLATION_18": "(Therein) in the cattle (are benefits for you) benefits in riding them and drinking their milk (for an appointed term) until they are garlanded and designated for immolation in the pilgrimage; (and afterward they are brought for sacrifice unto the ancient House) if this is a lesser pilgrimage, and they are brought for sacrifice to Mina during the greater pilgrimage.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "22:33",
            "22:29",
            "52:4",
            "26:149",
            "15:82",
            "16:5",
            "6:60",
            "40:80",
            "24:29",
            "6:2"
        ],
        "BIBLE": [
            "writings:ezra:6:3",
            "prophets:ii%20samuel:6:17",
            "prophets:i%20samuel:3:14",
            "prophets:ii%20kings:15:35",
            "prophets:ii%20kings:16:4",
            "writings:ii%20chronicles:28:4",
            "writings:ii%20chronicles:5:7",
            "prophets:i%20kings:8:6",
            "prophets:jeremiah:19:13",
            "torah:exodus:21:13"
        ]
    }
}