{
    "VERSE": "22:38",
    "ARABIC": "إِنَّ ٱللَّهَ يُدَٰفِعُ عَنِ ٱلَّذِينَ ءَامَنُوٓا۟ إِنَّ ٱللَّهَ لَا يُحِبُّ كُلَّ خَوَّانٍ كَفُورٍ",
    "ENGLISH": {
        "TRANSLATION_0": "Allah will defend those who have iman. Allah does not love any thankless traitor.",
        "TRANSLATION_1": "God will certainly defend the believers. Surely God does not like the traitors who deny the truth.\n",
        "TRANSLATION_2": "Surely Allah defends those who believe. Certainly Allah has no love for the perfidious, the thankless.\n",
        "TRANSLATION_3": "God defends the believers but He does not love any of the treacherous, ungrateful ones.\n",
        "TRANSLATION_4": "Indeed Allah repels the afflictions of the Muslims; indeed Allah does not like any extremely disloyal ingrate.\n",
        "TRANSLATION_5": "Truly, Allah defends those who believe. Verily, Allah likes not any treacherous ingrate.\n",
        "TRANSLATION_6": "Surely Allah will defend those who believe; surely Allah does not love any one who is unfaithful, ungrateful.\n",
        "TRANSLATION_7": "Assuredly God will defend those who believe; surely God loves not any ungrateful traitor.\n",
        "TRANSLATION_8": "Lo! Allah defendeth those who are true. Lo! Allah loveth not each treacherous ingrate.\n",
        "TRANSLATION_9": "God will surely defend the believers. God does not love the perfidious and the ungrateful.\n",
        "TRANSLATION_10": "Verily Allah will repel from those who believe: verily Allah loveth not any treacherous, ingrate.\n",
        "TRANSLATION_11": "Allah will indeed defend those who have faith. Indeed Allah does not like any ingrate traitor.\n",
        "TRANSLATION_12": "Verily Allah will defend (from ill) those who believe: verily, Allah loveth not any that is a traitor to faith, or show ingratitude.\n",
        "TRANSLATION_13": "Truly, Allah defends those who believe. Verily! Allah likes not any treacherous ingrate to Allah [those who disobey Allah but obey Shaitan (Satan)].\n",
        "TRANSLATION_14": "Allah will defend those who believe. Verily, Allah does not love the ungrateful cheat.\n",
        "TRANSLATION_15": "God defends those who believe. God does not love any ungrateful traitor.\n",
        "TRANSLATION_16": "Indeed, Allah defends those who have believed. Indeed, Allah does not like everyone treacherous and ungrateful.\n",
        "TRANSLATION_17": "[22:38] Indeed God protects those who believe, against the [ruinous] misguidance of idolaters. Indeed God does not love the treacherous, with regard to what is entrusted to him, the ungrateful, for His grace — these are the idolaters —in other words, He will punish them.\n",
        "TRANSLATION_18": "(Lo! Allah defendeth those who are true) Allah defends those who believe in Muhammad (pbuh) and in the Qur'an against the disbelievers of Mecca. (Lo! Allah loveth not each treacherous ingrate) who disbelieves in Allah.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "22:38",
            "4:107",
            "4:137",
            "47:34",
            "46:13",
            "25:55",
            "35:36",
            "4:168",
            "10:69",
            "57:23"
        ],
        "BIBLE": [
            "prophets:isaiah:25:1",
            "prophets:i%20kings:8:27",
            "writings:psalms:78:22",
            "prophets:jeremiah:42:5",
            "writings:ii%20chronicles:6:18",
            "prophets:joshua:22:22",
            "torah:deuteronomy:7:9",
            "prophets:ezekiel:5:11",
            "prophets:isaiah:43:10",
            "writings:psalms:57:4"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:1"
        ]
    }
}