{
    "VERSE": "22:49",
    "ARABIC": "قُلْ يَٰٓأَيُّهَا ٱلنَّاسُ إِنَّمَآ أَنَا۠ لَكُمْ نَذِيرٌ مُّبِينٌ",
    "ENGLISH": {
        "TRANSLATION_0": "Say: 'Mankind, I am only a clear warner to you.'",
        "TRANSLATION_1": "Tell them: \"O men, it's my duty to warn you clearly.\"\n",
        "TRANSLATION_2": "Say (O Muhammad): \"O people! I have been sent to you only as a plain warner (before the Doom strikes you).\"\n",
        "TRANSLATION_3": "(Muhammad), tell them, \"People, I am giving you a clear warning.\n",
        "TRANSLATION_4": "Proclaim, “O mankind, I am for you only a clear Herald of Warning.”\n",
        "TRANSLATION_5": "Say: \"O mankind! I am (sent) to you only as a plain warner.\"\n",
        "TRANSLATION_6": "Say: O people! I am only a plain warner to you.\n",
        "TRANSLATION_7": "Say: 'O men, I am only for you a plain warner.'\n",
        "TRANSLATION_8": "Say: O mankind! I am only a plain warner unto you.\n",
        "TRANSLATION_9": "Say, \"O people, I am sent only to give you clear warning.\"\n",
        "TRANSLATION_10": "Say thou: mankind! I am unto you only a warner manifest.\n",
        "TRANSLATION_11": "Say, ‘O mankind! I am only a manifest warner to you!’\n",
        "TRANSLATION_12": "Say: \"O men! I am (sent) to you only to give a Clear Warning:\n",
        "TRANSLATION_13": "Say (O Muhammad SAW): \"O mankind! I am (sent) to you only as a plain warner.\"\n",
        "TRANSLATION_14": "Say (Prophet Muhammad): 'O people, I have been sent to warn you plainly.\n",
        "TRANSLATION_15": "Say, “O people, I am only a plain warner to you.”\n",
        "TRANSLATION_16": "Say, \"O people, I am only to you a clear warner.\"\n",
        "TRANSLATION_17": "[22:49] Say: ‘O mankind, that is, [O] people of Mecca, I am only a manifest warner to you’, one whose warning is plain; but also I am a giver of good tidings to the believers.\n",
        "TRANSLATION_18": "(Say: mankind!) people of Mecca! (I am) from Allah (only a plain) addressing you in a language you know (warner unto you) a warning Messenger. 369\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "22:49",
            "71:2",
            "15:89",
            "26:39",
            "33:45",
            "34:28",
            "54:23",
            "48:8",
            "2:21",
            "83:2"
        ],
        "BIBLE": [
            "prophets:jeremiah:44:20",
            "torah:genesis:3:12",
            "prophets:ezekiel:4:15",
            "writings:proverbs:23:2",
            "writings:psalms:60:13",
            "writings:psalms:108:13",
            "prophets:ii%20kings:4:43",
            "writings:ii%20chronicles:19:6",
            "writings:proverbs:9:9",
            "prophets:ii%20samuel:18:11"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:3:6",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:4:11",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:6:1"
        ]
    }
}