{
    "VERSE": "22:5",
    "ARABIC": "يَٰٓأَيُّهَا ٱلنَّاسُ إِن كُنتُمْ فِى رَيْبٍ مِّنَ ٱلْبَعْثِ فَإِنَّا خَلَقْنَٰكُم مِّن تُرَابٍ ثُمَّ مِن نُّطْفَةٍ ثُمَّ مِنْ عَلَقَةٍ ثُمَّ مِن مُّضْغَةٍ مُّخَلَّقَةٍ وَغَيْرِ مُخَلَّقَةٍ لِّنُبَيِّنَ لَكُمْ وَنُقِرُّ فِى ٱلْأَرْحَامِ مَا نَشَآءُ إِلَىٰٓ أَجَلٍ مُّسَمًّى ثُمَّ نُخْرِجُكُمْ طِفْلًا ثُمَّ لِتَبْلُغُوٓا۟ أَشُدَّكُمْ وَمِنكُم مَّن يُتَوَفَّىٰ وَمِنكُم مَّن يُرَدُّ إِلَىٰٓ أَرْذَلِ ٱلْعُمُرِ لِكَيْلَا يَعْلَمَ مِنۢ بَعْدِ عِلْمٍ شَيْـًٔا وَتَرَى ٱلْأَرْضَ هَامِدَةً فَإِذَآ أَنزَلْنَا عَلَيْهَا ٱلْمَآءَ ٱهْتَزَّتْ وَرَبَتْ وَأَنۢبَتَتْ مِن كُلِّ زَوْجٍۭ بَهِيجٍ",
    "ENGLISH": {
        "TRANSLATION_0": "Mankind! if you are in any doubt about the Rising, know that We created you from dust then from a drop of sperm then from a clot of blood then from a lump of flesh, formed yet unformed, so We may make things clear to you. We make whatever We want stay in the womb until a specified time and then We bring you out as children so that you can reach your full maturity. Some of you die and some of you revert to the lowest form of life so that, after having knowledge, they then know nothing at all. And you see the earth dead and barren; then when We send down water onto it it quivers and swells and sprouts with luxuriant plants of every kind.",
        "TRANSLATION_1": "If you have any doubt, O men, about being raised to life again, (remember) that We created you from dust, then a drop of semen, then an embryo, then a chewed up lump of flesh shaped and shapeless, that We may reveal (the various steps) to you. We keep what We please in the womb for a certain time, then you come out as a child, then reach the prime of age. Some of you die, some reach the age of dotage when they forget what they knew, having known it once. You see the earth all withered, then We send down rain upon it, and it bestirs itself, swells, and brings forth every kind of beauteous verdure.\n",
        "TRANSLATION_2": "O mankind! If you have any doubt concerning Resurrection, then know that it is surely We Who created you from dust, then from a drop of sperm, then from a clot of blood, then from a little lump of flesh, some of it shapely and other shapeless. (We are rehearsing this) that We may make the reality clear to you. We cause (the drop of sperm) that We please to remain in the wombs till an appointed time. We bring you forth as infants (and nurture you) that you may come of age. Among you is he that dies (at a young age) and he who is kept back to the most abject age so that after once having known, he reaches a stage when he knows nothing. You see the earth dry and barren and then no sooner than We send down water upon it, it begins to quiver and swell and brings forth every kind of beauteous vegetation.\n",
        "TRANSLATION_3": "People, if you have doubts about the Resurrection, you must know that We created you from clay that was turned into a living germ. This was developed into a clot of blood, which was made into a well formed and partly shapeless lump of flesh. This is how We show you that resurrection is not more difficult for Us than your creation. We cause whatever We want to stay in the womb for an appointed time, We then take you out of the womb as a baby, so that you may grow up and receive strength. Some of you may then die and others may grow to a very old age and lose your memory. You may see the earth as a barren land, but when we send rain, it starts to stir and swell and produce various pairs of attractive herbs.\n",
        "TRANSLATION_4": "O people, if you doubt your revival on the Day of Resurrection, then ponder that We created you from dust, then from a drop of liquid, then from a clot, then from a piece of flesh formed and without form, so that We show you Our signs for you; and We keep whomever We want inside the mothers’ wombs up to an appointed time, then extract you as infants, then in order that you reach your puberty; and among you is one who dies earlier, and among you is one put to the most abject age, so after having knowledge, knows nothing; and you see the earth desolate, then when We sent down water upon it, it freshened up and developed and produced beautiful pairs of all kinds.\n",
        "TRANSLATION_5": "O mankind! If you are in doubt about the Resurrection, then verily, We have created you from dust, then from a Nutfah, then from a clot then from a little lump of flesh -- some formed and some unformed -- that We may make (it) clear to you. And We cause whom We will to remain in the wombs for an appointed term, then We bring you out as infants, then (give you growth) that you may reach your age of full strength. And among you there is he who dies (young), and among you there is he who is brought back to the miserable old age, so that he knows nothing after having known. And you see the earth Hamidatan, but when We send down water on it, it is stirred (to life), and it swells and puts forth every lovely kind (of growth).\n",
        "TRANSLATION_6": "O people! if you are in doubt about the raising, then surely We created you from dust, then from a small seed, then from a clot, then from a lump of flesh, complete in make and incomplete, that We may make clear to you; and We cause what We please to stay in the wombs till an appointed time, then We bring you forth as babies, then that you may attain your maturity; and of you is he who is caused to die, and of you is he who is brought back to the worst part of life, so that after having knowledge he does not know anything; and you see the earth sterile land, but when We send down on it the water, it stirs and swells and brings forth of every kind a beautiful herbage.\n",
        "TRANSLATION_7": "O men, if you are in doubt as to the Uprising, surely We created you of dust then of a sperm-drop, then of a blood clot, then of a lump of flesh, formed and unformed that We may make clear to you. And We establish in the wombs what We will, till a stated term, then We deliver you as infants, then that you may come of age; and some of you die, and some of you are kept back unto the vilest state of life, that after knowing somewhat, they may know nothing. And thou beholdest the earth blackened, then, when We send down water upon it, it quivers, and swells, and puts forth herbs of every joyous kind.\n",
        "TRANSLATION_8": "O mankind! if ye are in doubt concerning the Resurrection, then lo! We have created you from dust, then from a drop of seed, then from a clot, then from a little lump of flesh shapely and shapeless, that We may make (it) clear for you. And We cause what We will to remain in the wombs for an appointed time, and afterward We bring you forth as infants, then (give you growth) that ye attain your full strength. And among you there is he who dieth (young), and among you there is he who is brought back to the most abject time of life, so that, after knowledge, he knoweth naught. And thou (Muhammad) seest the earth barren, but when We send down water thereon, it doth thrill and swell and put forth every lovely kind (of growth).\n",
        "TRANSLATION_9": "O people! If you are in doubt about the Resurrection, remember that We first created you from dust, then from a sperm drop, then from clotted blood, then a lump of flesh, both shaped and unshaped, so that We might manifest to you [Our power]. We cause what We will to stay in the womb for an appointed time, then We bring you forth as infants and then We cause you to grow and reach full growth. Then, some of you will pass away early in life, while some of you will reach extreme old age in which they will know nothing of what they once knew. You see the earth, dead and barren, but no sooner do We send down rain upon it than it begins to stir and swell, and produce every kind of luxuriant vegetation:\n",
        "TRANSLATION_10": "O Mankind! if ye be in doubt respecting the Resurrection, then We have created you of the dust, then of a drop, then of clot, then of a piece of flesh, formed and unformed, that We might manifest unto you Our power. And We settle in the wombs that which We will until a term determined. Then We bring you forth as babes, then We let you reach your maturity. And of you is he who dieth, and of you is he who is brought back to the most abject age, so that after knowing he knoweth not aught. Andthou beholdest the earth withered up, and when We send down thereon water, it stirreth and swelleth, and it groweth every luxuriant kind of growth.\n",
        "TRANSLATION_11": "O people! If you are in doubt about the resurrection, [consider that] We created you from dust, then from a drop of [seminal] fluid, then from a clinging mass, then from a fleshy tissue, partly formed and partly unformed, so that We may manifest [Our power] to you. We lodge in the wombs whatever [fetus] We wish for a specified term, then We bring you forth as infants, then [We rear you] so that you may come of age. [Then] there are some of you who are taken away, and there are some of you who are relegated to the nethermost age, such that he knows nothing after [having possessed] some knowledge. And you see the earth torpid, yet when We send down water upon it, it stirs and swells, and grows every delightful kind [of plant].\n",
        "TRANSLATION_12": "O mankind! if ye have a doubt about the Resurrection, (consider) that We created you out of dust, then out of sperm, then out of a leech-like clot, then out of a morsel of flesh, partly formed and partly unformed, in order that We may manifest (our power) to you; and We cause whom We will to rest in the wombs for an appointed term, then do We bring you out as babes, then (foster you) that ye may reach your age of full strength; and some of you are called to die, and some are sent back to the feeblest old age, so that they know nothing after having known (much), and (further), thou seest the earth barren and lifeless, but when We pour down rain on it, it is stirred (to life), it swells, and it puts forth every kind of beautiful growth (in pairs).\n",
        "TRANSLATION_13": "O mankind! If you are in doubt about the Resurrection, then verily! We have created you (i.e. Adam) from dust, then from a Nutfah (mixed drops of male and female sexual discharge i.e. offspring of Adam), then from a clot (a piece of thick coagulated blood) then from a little lump of flesh, some formed and some unformed (miscarriage), that We may make (it) clear to you (i.e. to show you Our Power and Ability to do what We will). And We cause whom We will to remain in the wombs for an appointed term, then We bring you out as infants, then (give you growth) that you may reach your age of full strength. And among you there is he who dies (young), and among you there is he who is brought back to the miserable old age, so that he knows nothing after having known. And you see the earth barren, but when We send down water (rain) on it, it is stirred (to life), it swells and puts forth every lovely kind (of growth).\n",
        "TRANSLATION_14": "O people, if you are in doubt about the Resurrection, remember that We first created you from dust, then, from a sperm drop, then from a clot, and then from a bitesize tissue formed and unformed, so that We might clarify for you. We establish in the wombs whatever We will for an appointed term, and then We bring you forth as infants, then you come of age. Some of you die, and some of you are kept back to the vilest state of life, after knowing somewhat, they know nothing. And you see the earth dry; but no sooner do We send down rain upon it than it begins to quiver and swell, putting forth every fine variety (of herbage).\n",
        "TRANSLATION_15": "O people! If you are in doubt about the Resurrection—We created you from dust, then from a small drop, then from a clinging clot, then from a lump of flesh, partly developed and partly undeveloped. In order to clarify things for you. And We settle in the wombs whatever We will for a designated term, and then We bring you out as infants, until you reach your full strength. And some of you will pass away, and some of you will be returned to the vilest age, so that he may not know, after having known. And you see the earth still; but when We send down water on it, it vibrates, and swells, and grows all kinds of lovely pairs.\n",
        "TRANSLATION_16": "O People, if you should be in doubt about the Resurrection, then [consider that] indeed, We created you from dust, then from a sperm-drop, then from a clinging clot, and then from a lump of flesh, formed and unformed - that We may show you. And We settle in the wombs whom We will for a specified term, then We bring you out as a child, and then [We develop you] that you may reach your [time of] maturity. And among you is he who is taken in [early] death, and among you is he who is returned to the most decrepit [old] age so that he knows, after [once having] knowledge, nothing. And you see the earth barren, but when We send down upon it rain, it quivers and swells and grows [something] of every beautiful kind.\n",
        "TRANSLATION_17": "[22:5] O mankind, in other words, [O] people of Mecca, if you are in doubt about the Resurrection, then lo! [consider that] We have created you, that is, [We have created] your origin — Adam — from dust then, We created his progeny, from a drop, a sperm-drop, then from a clot, congealed blood, then from a [little] lump of flesh (mudgha), a piece of flesh, the size of what one would [be able to] chew (mā yumdagh), partly formed, shaped, complete in form, and partly unformed, that is, uncomplete in form, that We may make clear to you, the perfect nature of Our power, that you might [then] infer from this initial act of creation, the [reality of its future] restoration. And We establish (nuqirru, marks a new [grammatically independent] sentence) in the wombs whatever We will for a specified time, that is, until the time for it to come out, then We bring you forth, from the bellies of your mothers, as infants, and then, We extend your life, that you may come of age (ashuddakum), that is to say, [your] prime and strength, which is [that age] between thirty and forty years. And there are some of you who are taken away, by death, before coming of age, and there are some of you who are relegated to the most abject time of life, its most despicable [state] of decrepitude and senility, so that after [having had] some knowledge, he no longer knows anything — ‘Ikrima said, ‘Whoever recites the Qur’ān, such a state will not befall him’. And you see the earth torpid, barren, yet when We send down water upon it, it stirs, it moves, and swells, it rises and grows, and grows [plants of] (anbatat min, min is extra) every delightful, fair, kind, species.\n",
        "TRANSLATION_18": "(0 mankind!) i.e. people of Mecca (if ye are in doubt concerning the Resurrection) after death, then reflect upon your initial creation, for bringing you back to life is not more difficult than your initial creation, (then lo! We have created you from dust) We have created you from Adam and Adam is from dust, (then) We created you after that (from a drop of seed, then from a clot) of blood after the drop of semen, (then from a little lump of flesh) after the clot of blood (shapely) in a perfect shape (and shapeless) when miscarriage takes place, (that We may make (it) clean for you) in the Qur'an after you are created. (And We cause what We will) of unborn children (to remain in the wombs) preventing it from miscarriage; and it is also said that this means: We leave it in the wombs (for an appointed time) for a certain number of months, (and afterward We bring you forth) from the wombs (as infants, then (give you growth) that ye attain your full strength) from the age of 18 to the age of 30 years old. (And among you there is he who dieth (young)) before the age of puberty, (and among you there is he who is brought back to the most abject time of life) is brought back to his initial state after he reaches abject age, (so that, after knowledge) after his first initial knowledge, (he knoweth naught) such that he becomes undiscerning. (And thou (Muhammad) seest the earth barren) dead and cracked, (but when We send down water thereon, it doth thrill) with vegetation; it is also said that this means: it vibrates and cheers up (and swell) for the vegetation (and put forth) by means of water (ever lovely kind (of growth)) of every comely kind of plants. 363\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "22:5",
            "16:70",
            "40:67",
            "31:10",
            "50:7",
            "35:11",
            "30:50",
            "41:39",
            "7:85",
            "31:20"
        ],
        "BIBLE": [
            "prophets:isaiah:50:2",
            "prophets:ezekiel:26:20",
            "writings:esther:4:11",
            "prophets:i%20kings:20:39",
            "writings:daniel:3:29",
            "prophets:i%20kings:2:42",
            "prophets:ezekiel:3:20",
            "prophets:ezekiel:31:14",
            "torah:exodus:32:1",
            "writings:daniel:12:7"
        ]
    }
}