{
    "VERSE": "22:50",
    "ARABIC": "فَٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّٰلِحَٰتِ لَهُم مَّغْفِرَةٌ وَرِزْقٌ كَرِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "As for those who have iman and do right actions, they will have forgiveness and generous provision.",
        "TRANSLATION_1": "For those who believe and do the right is forgiveness and gracious provision.\n",
        "TRANSLATION_2": "So those who believe and act righteously shall be granted forgiveness and an honourable sustenance,\n",
        "TRANSLATION_3": "The righteously striving believers will receive forgiveness and honorable sustenance.\n",
        "TRANSLATION_4": "So those who believed and did good deeds, for them are forgiveness, and an excellent sustenance.\n",
        "TRANSLATION_5": "So those who believe and do righteous good deeds, for them is forgiveness and Rizq Karim.\n",
        "TRANSLATION_6": "Then (as for) those who believe and do good, they shall have forgiveness and an honorable sustenance.\n",
        "TRANSLATION_7": "Those who believe, and do deeds of righteousness -- theirs shall be forgiveness and generous provision.\n",
        "TRANSLATION_8": "Those who believe and do good works, for them is pardon and a rich provision;\n",
        "TRANSLATION_9": "Those who believe and do good deeds shall be forgiven and shall receive an honourable provision.\n",
        "TRANSLATION_10": "Then those who believe and work righteous works--for them is forgiveness and a provision honourable.\n",
        "TRANSLATION_11": "As for those who have faith and do righteous deeds, for them will be forgiveness and a noble provision.\n",
        "TRANSLATION_12": "Those who believe and work righteousness, for them is forgiveness and a sustenance most generous.\n",
        "TRANSLATION_13": "So those who believe (in the Oneness of Allah Islamic Monotheism) and do righteous good deeds, for them is forgiveness and Rizqun Karim (generous provision, i.e. Paradise).\n",
        "TRANSLATION_14": "Those who believe and do good works, theirs shall be forgiveness and a generous provision;\n",
        "TRANSLATION_15": "Those who believe and work righteousness—for them is forgiveness and a generous provision.\n",
        "TRANSLATION_16": "And those who have believed and done righteous deeds - for them is forgiveness and noble provision.\n",
        "TRANSLATION_17": "[22:50]   And so those who believe and perform righteous deeds — for them there shall be forgiveness, of their sins, and a glorious provision, namely, Paradise.\n",
        "TRANSLATION_18": "(Those who believe) in Muhammad (pbuh) and in the Qur'an (and do good works) good deeds between themselves and their Lord, (for them pardon) for the sins they committed in this worldly life (and a rich provision) a goodly reward in Paradise;\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "22:50",
            "34:4",
            "24:26",
            "8:74",
            "8:4",
            "36:11",
            "11:11",
            "25:72",
            "51:22",
            "5:9"
        ],
        "BIBLE": [
            "prophets:isaiah:57:12",
            "writings:ecclesiastes:2:11",
            "writings:ii%20chronicles:31:20",
            "prophets:habakkuk:1:5",
            "writings:ecclesiastes:2:17",
            "prophets:isaiah:26:12",
            "torah:exodus:34:10",
            "writings:psalms:24:5",
            "torah:leviticus:23:3",
            "writings:daniel:3:32"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:13",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:3"
        ]
    }
}