{
    "VERSE": "22:57",
    "ARABIC": "وَٱلَّذِينَ كَفَرُوا۟ وَكَذَّبُوا۟ بِـَٔايَٰتِنَا فَأُو۟لَٰٓئِكَ لَهُمْ عَذَابٌ مُّهِينٌ",
    "ENGLISH": {
        "TRANSLATION_0": "But those who are kafir and deny Our Signs will have a humiliating punishment.",
        "TRANSLATION_1": "But those who did not believe and called Our revelations lies, will be given disgraceful punishment.\n",
        "TRANSLATION_2": "A humiliating chastisement awaits those who disbelieved and denied Our Signs.\n",
        "TRANSLATION_3": "and the unbelievers who called Our revelations lies will suffer humiliating torment.\n",
        "TRANSLATION_4": "And those who disbelieved and denied Our signs – for them will be a disgraceful punishment.\n",
        "TRANSLATION_5": "And those who disbelieved and denied Our Ayat, for them will be a humiliating torment (in Hell).\n",
        "TRANSLATION_6": "And (as for) those who disbelieve in and reject Our communications, these it is who shall have a disgraceful chastisement.\n",
        "TRANSLATION_7": "But as for the unbelievers, who cried lies to Our signs; for them awaits a humbling chastisement.\n",
        "TRANSLATION_8": "While those who disbelieved and denied Our revelations, for them will be a shameful doom.\n",
        "TRANSLATION_9": "but those who deny the truth and deny Our signs will receive a humiliating punishment.\n",
        "TRANSLATION_10": "And those who disbelieved and belied Our signs--then these! for them will be a torment ignominous.\n",
        "TRANSLATION_11": "and those who are faithless and deny Our signs—for such there will be a humiliating punishment.\n",
        "TRANSLATION_12": "And for those who reject Faith and deny our Signs, there will be a humiliating Punishment.\n",
        "TRANSLATION_13": "And those who disbelieved and belied Our Verses (of this Quran), for them will be a humiliating torment (in Hell).\n",
        "TRANSLATION_14": "but for those who disbelieved Our verses and belied there awaits a humbling punishment.\n",
        "TRANSLATION_15": "But those who disbelieve and reject Our revelations—these will have a humiliating punishment.\n",
        "TRANSLATION_16": "And they who disbelieved and denied Our signs - for those there will be a humiliating punishment.\n",
        "TRANSLATION_17": "[22:57] while those who disbelieved and denied Our signs, for them will be a humiliating chastisement, a severe [one], because of their disbelief.\n",
        "TRANSLATION_18": "(While those who disbelieved and denied Our revelations) in Our Scripture and Messenger, (for them will be 370 a shameful doom) through which they will be humiliated; it is also said that a shameful doom means a severe chastisement.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "22:57",
            "34:38",
            "6:49",
            "30:16",
            "43:69",
            "51:37",
            "34:5",
            "78:28",
            "16:104",
            "29:23"
        ],
        "BIBLE": [
            "prophets:isaiah:54:6",
            "torah:genesis:17:5",
            "prophets:amos:9:12",
            "writings:job:9:16",
            "prophets:jeremiah:30:17",
            "prophets:isaiah:34:12",
            "writings:ii%20chronicles:7:14",
            "prophets:zechariah:8:3",
            "writings:psalms:31:18",
            "torah:genesis:35:10"
        ]
    }
}