{
    "VERSE": "22:59",
    "ARABIC": "لَيُدْخِلَنَّهُم مُّدْخَلًا يَرْضَوْنَهُۥ وَإِنَّ ٱللَّهَ لَعَلِيمٌ حَلِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "He will admit them by an entrance which is pleasing to them. Allah is All-Knowing, All-Forbearing.",
        "TRANSLATION_1": "God will surely lead them to a place with which they will be gratified. Verily God is all-knowing and forbearing.\n",
        "TRANSLATION_2": "He will surely admit them to a resort which will please them. Most certainly Allah is All-Knowing, Most Forbearing.\n",
        "TRANSLATION_3": "God will certainly admit them to a pleasant dwelling. God is All-knowing and Forbearing.\n",
        "TRANSLATION_4": "He will certainly admit them to a place they will love; and indeed Allah is All Knowing, Most Forbearing.\n",
        "TRANSLATION_5": "Truly, He will make them enter an entrance with which they shall be well-pleased, and verily, Allah indeed is All-Knowing, Most Forbearing.\n",
        "TRANSLATION_6": "He will certainly cause them to enter a place of entrance which they shall be well pleased with, and most surely Allah is Knowing, Forbearing.\n",
        "TRANSLATION_7": "He shall admit them by a gate that is well-pleasing to them; and surely God is All-knowing, All-clement.\n",
        "TRANSLATION_8": "Assuredly He will cause them to enter by an entry that they will love. Lo! Allah verily is Knower, Indulgent.\n",
        "TRANSLATION_9": "He will admit them to a place with which they shall be well-pleased. For God is all knowing and most forbearing.\n",
        "TRANSLATION_10": "Surely He will make them enter an entrance wherewith they will be well pleased and verily Allah is Knowing, Forbearing.\n",
        "TRANSLATION_11": "He will admit them into an abode they are pleased with. Indeed Allah is all-knowing, all-forbearing.\n",
        "TRANSLATION_12": "Verily He will admit them to a place with which they shall be well pleased: for Allah is All-Knowing, Most Forbearing.\n",
        "TRANSLATION_13": "Truly, He will make them enter an entrance with which they shall be well-pleased, and verily, Allah indeed is All-Knowing, Most Forbearing.\n",
        "TRANSLATION_14": "He will admit them by a gate that is pleasing to them, and surely, Allah is the Knower, the Clement.\n",
        "TRANSLATION_15": "He will admit them an admittance that will please them. God is Knowing and Clement.\n",
        "TRANSLATION_16": "He will surely cause them to enter an entrance with which they will be pleased, and indeed, Allah is Knowing and Forbearing.\n",
        "TRANSLATION_17": "[22:59] Assuredly He will admit them into a place (read mudkhalan or madkhalan, [respectively] signifying the means of entry, or the place [entered]) that is pleasing to them, and that is Paradise. And truly God is Knowing, of their intentions, Forbearing, in refraining from punishing them.\n",
        "TRANSLATION_18": "(Assuredly He will cause them to enter by an entry that they will love) for themselves; it is also said that this means: they will accept, i.e. Paradise. (Lo! Allah verily is knower) of their reward and honouring, (Indulgent) by deferring the punishment of those who killed them.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "22:59",
            "37:152",
            "29:5",
            "2:227",
            "29:11",
            "8:61",
            "3:63",
            "28:56",
            "16:128",
            "24:18"
        ],
        "BIBLE": [
            "prophets:ezekiel:34:26",
            "prophets:jeremiah:19:12",
            "prophets:ezekiel:26:14",
            "prophets:isaiah:42:16",
            "torah:leviticus:26:1",
            "torah:exodus:20:21",
            "prophets:nahum:1:8",
            "prophets:ezekiel:35:11",
            "writings:job:18:21",
            "prophets:isaiah:13:13"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:1:12",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:1"
        ]
    }
}