{
    "VERSE": "22:62",
    "ARABIC": "ذَٰلِكَ بِأَنَّ ٱللَّهَ هُوَ ٱلْحَقُّ وَأَنَّ مَا يَدْعُونَ مِن دُونِهِۦ هُوَ ٱلْبَٰطِلُ وَأَنَّ ٱللَّهَ هُوَ ٱلْعَلِىُّ ٱلْكَبِيرُ",
    "ENGLISH": {
        "TRANSLATION_0": "That is because Allah is the Real and what you call on apart from Him is false. Allah is the All-High, the",
        "TRANSLATION_1": "That is so for God is the undeniable truth, and what they invoke apart from Him is false; yet God is all-high and supreme.\n",
        "TRANSLATION_2": "So shall it be because Allah, He is the Truth, and all whom they invoke instead of Him are false. Allah is Most High, All-Great.\n",
        "TRANSLATION_3": "God is the Supreme Truth and whatever they worship instead of Him is falsehood. God is most Exalted and most Great.\n",
        "TRANSLATION_4": "This is because Allah only is the Truth, and what they worship other than Him, is itself falsehood, and because Allah only is the Supreme, the Great.\n",
        "TRANSLATION_5": "That is because Allah -- He is the Truth, and what they invoke besides Him, it is false. And verily, Allah -- He is the Most High, the Most Great.\n",
        "TRANSLATION_6": "That is because Allah is the Truth, and that what they call upon besides Him-- that is the falsehood, and because Allah is the High, the Great.\n",
        "TRANSLATION_7": "That is because God -- He is the Truth, and that they call upon apart from Him -- that is the false; and for that God is the All-high, the All-great.\n",
        "TRANSLATION_8": "That is because Allah, He is the True, and that whereon they call instead of Him, it is the false, and because Allah, He is the High, the Great.\n",
        "TRANSLATION_9": "That is because God is the Truth while anything they invoke besides God is sheer falsehood. God is the Sublime, the Great One.\n",
        "TRANSLATION_10": "That is because Allah! He is the Truth, and because that which they call upon beside Him--it is the false. And verily Allah! He is the High, the Great.\n",
        "TRANSLATION_11": "So will it be, because Allah is the Reality, and what they invoke besides Him is nullity, and because Allah is the All-exalted, the All-great.\n",
        "TRANSLATION_12": "That is because Allah - He is the Reality; and those besides Him whom they invoke,- they are but vain Falsehood: verily Allah is He, Most High, Most Great.\n",
        "TRANSLATION_13": "That is because Allah He is the Truth (the only True God of all that exists, Who has no partners or rivals with Him), and what they (the polytheists) invoke besides Him, it is Batil (falsehood) And verily, Allah He is the Most High, the Most Great.\n",
        "TRANSLATION_14": "That is because Allah is the Truth, and falsehood is all that they call upon, other than Him. Allah is the Most High, the Most Great.\n",
        "TRANSLATION_15": "That is because God is the Reality, and what they invoke besides Him is vanity, and because God is the Sublime, the Grand.\n",
        "TRANSLATION_16": "That is because Allah is the Truth, and that which they call upon other than Him is falsehood, and because Allah is the Most High, the Grand.\n",
        "TRANSLATION_17": "[22:62] That, help, also, is because God, He is the Truth, the Established [Truth], and what they call on (yad‘ūna; also read tad‘ūna, ‘you call on’), [what] they worship, besides Him, namely, idols, that is the False, the transient, and because God, He is the High, the One [supreme] above all things in His power, the Great, besides Whom all things are insignificant.\n",
        "TRANSLATION_18": "(That) the power that enables you to acknowledge and know (is because Allah, He is the True) is because the worship of Allah is the Truth, and that Allah is the Strong, (and that whereon they call) they worship (instead of Him) instead of Allah, (it is the false) it is flimsy, (and because Allah, He is the High) Higher than everything, (the Great) Greater than everything.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "22:62",
            "31:30",
            "40:12",
            "40:20",
            "22:12",
            "21:29",
            "33:47",
            "47:3",
            "36:74",
            "29:42"
        ],
        "BIBLE": [
            "torah:deuteronomy:4:7",
            "prophets:zephaniah:2:11",
            "prophets:isaiah:25:1",
            "writings:psalms:9:3",
            "writings:psalms:71:22",
            "writings:psalms:73:11",
            "writings:psalms:78:35",
            "torah:numbers:35:33",
            "prophets:jeremiah:14:22",
            "writings:psalms:81:10"
        ]
    }
}