{
    "VERSE": "22:63",
    "ARABIC": "أَلَمْ تَرَ أَنَّ ٱللَّهَ أَنزَلَ مِنَ ٱلسَّمَآءِ مَآءً فَتُصْبِحُ ٱلْأَرْضُ مُخْضَرَّةً إِنَّ ٱللَّهَ لَطِيفٌ خَبِيرٌ",
    "ENGLISH": {
        "TRANSLATION_0": "Do you not see that Allah sends down water from the sky and then in the morning the earth is covered in green? Allah is All-Subtle, All-Aware.",
        "TRANSLATION_1": "Do you not see how God sends down water from the sky and in the morning the earth turns green? Truly God is benign and well-informed.\n",
        "TRANSLATION_2": "Do you not see that Allah sends down water from the sky whereby the earth turns green? Verily Allah is Subtle, All-Aware.\n",
        "TRANSLATION_3": "Have you not seen that God has sent water from the sky and has made the earth green all over. He is Kind and All-aware.\n",
        "TRANSLATION_4": "Did you not see that Allah sent down water from the sky, so the earth became green at morn? Indeed Allah is Pure, Aware.\n",
        "TRANSLATION_5": "See you not that Allah sends down water from the sky, and then the earth becomes green Verily, Allah is the Most Kind and Courteous, Well-Acquainted with all things.\n",
        "TRANSLATION_6": "Do you not see that Allah sends down water from the cloud so the earth becomes green? Surely Allah is Benignant, Aware.\n",
        "TRANSLATION_7": "Hast thou not seen how that God has sent down out of heaven water, and in the morning the earth becomes green? God is All-subtle, All-aware.\n",
        "TRANSLATION_8": "Seest thou not how Allah sendeth down water from the sky and then the earth becometh green upon the morrow? Lo! Allah is Subtile, Aware.\n",
        "TRANSLATION_9": "Have you not seen how God sends down water from sky, whereupon the earth becomes green? God is unfathomable, and all aware;\n",
        "TRANSLATION_10": "Beholdest thou not that Allah sendeth down water from the heaven and the earth becometh green? Verily Allah is subtile, Aware.\n",
        "TRANSLATION_11": "Have you not regarded that Allah sends down water from the sky, whereupon the earth turns green? Indeed Allah is all-attentive, all-aware.\n",
        "TRANSLATION_12": "Seest thou not that Allah sends down rain from the sky, and forthwith the earth becomes clothed with green? for Allah is He Who understands the finest mysteries, and is well-acquainted (with them).\n",
        "TRANSLATION_13": "See you not that Allah sends down water (rain) from the sky, and then the earth becomes green? Verily, Allah is the Most Kind and Courteous, Well-Acquainted with all things.\n",
        "TRANSLATION_14": "Do you not see that Allah sends down water from the sky and in the morning the earth becomes green? Allah is Subtle, the Aware.\n",
        "TRANSLATION_15": "Do you not see that God sends down water from the sky, and the land becomes green? God is Kind and Aware.\n",
        "TRANSLATION_16": "Do you not see that Allah has sent down rain from the sky and the earth becomes green? Indeed, Allah is Subtle and Acquainted.\n",
        "TRANSLATION_17": "[22:63] Have you not seen, realised, that God sends down water, rain, from the heaven whereupon the earth turns green, with plants — and this [too] is a sign of His power. Indeed God is Subtle, in dealing with His servants, when He brings forth plants through water, Aware, of what is in their hearts when the rain is delayed.\n",
        "TRANSLATION_18": "(Seest thou not) have you not been informed, Muhammad, in the Qur'an (how Allah sendeth down water) rain (from the sky and then the earth becometh green) with vegetation (upon the morrow? Lo! Allah is Subtile) in making plants grow, (Aware) of their place.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "22:63",
            "22:70",
            "31:16",
            "14:19",
            "3:5",
            "27:25",
            "14:38",
            "6:14",
            "49:18",
            "3:109"
        ],
        "BIBLE": [
            "prophets:ii%20samuel:14:20",
            "torah:exodus:18:14",
            "writings:i%20chronicles:29:17",
            "torah:genesis:1:25",
            "torah:genesis:1:31",
            "writings:lamentations:1:8",
            "prophets:ezekiel:16:30",
            "prophets:isaiah:66:8",
            "torah:exodus:7:15",
            "torah:exodus:10:6"
        ]
    }
}