{
    "VERSE": "22:68",
    "ARABIC": "وَإِن جَٰدَلُوكَ فَقُلِ ٱللَّهُ أَعْلَمُ بِمَا تَعْمَلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "If they do argue with you, say: 'Allah knows best what you are doing.'",
        "TRANSLATION_1": "If they argue with you, tell them: \"God knows well what you are doing.\n",
        "TRANSLATION_2": "And if they dispute with you, say: \"Allah knows well what you do.\n",
        "TRANSLATION_3": "If they still dispute with you about your worship, tell them, \"God knows best what you do.\n",
        "TRANSLATION_4": "And if they quarrel with you, say, “Allah well knows your evil deeds.”\n",
        "TRANSLATION_5": "And if they argue with you, say: \"Allah knows best of what you do.\"\n",
        "TRANSLATION_6": "And if they contend with you, say: Allah best knows what you do.\n",
        "TRANSLATION_7": "And if they should dispute with thee, do thou say, 'God knows very well what you are doing.\n",
        "TRANSLATION_8": "And if they wrangle with thee, say: Allah is Best Aware of what ye do.\n",
        "TRANSLATION_9": "if they should dispute with you, then say, \"God is well aware of what you do.\"\n",
        "TRANSLATION_10": "And if they dispute with thee, say thou: Allah knoweth best that which ye Work.\n",
        "TRANSLATION_11": "But if they dispute with you, say, ‘Allah knows best what you are doing.\n",
        "TRANSLATION_12": "If they do wrangle with thee, say, \"Allah knows best what it is ye are doing.\"\n",
        "TRANSLATION_13": "And if they argue with you (as regards the slaughtering of the sacrifices), say; \"Allah knows best of what you do.\n",
        "TRANSLATION_14": "If they argue with you, say: 'Allah knows best all that you do.\n",
        "TRANSLATION_15": "But if they dispute with you, say, “God is fully aware of what you do.”\n",
        "TRANSLATION_16": "And if they dispute with you, then say, \"Allah is most knowing of what you do.\n",
        "TRANSLATION_17": "[22:68] And if they dispute with you, in the matter of religion, say, ‘God knows best what you do, and will requite you for it — this was [revealed] before the command to fight [them].\n",
        "TRANSLATION_18": "(And if they wrangle with thee) concerning sacrifices and Allah's divine Oneness, because of their saying: \"that which Allah immolates is more lawful than what you immolate with your own knives\", (say: Allah is best aware of what ye do) in the practice of your religion, whether it is a question of sacrifices or other things.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "22:68",
            "84:23",
            "4:147",
            "3:63",
            "3:66",
            "28:56",
            "2:137",
            "11:14",
            "53:62",
            "16:19"
        ],
        "BIBLE": [
            "prophets:i%20samuel:20:7",
            "writings:psalms:73:11",
            "torah:exodus:8:6",
            "torah:exodus:10:25",
            "writings:nehemiah:4:5",
            "prophets:jeremiah:13:12",
            "prophets:ii%20samuel:7:20",
            "torah:numbers:16:28",
            "prophets:i%20samuel:29:9",
            "writings:psalms:73:28"
        ]
    }
}