{
    "VERSE": "22:72",
    "ARABIC": "وَإِذَا تُتْلَىٰ عَلَيْهِمْ ءَايَٰتُنَا بَيِّنَٰتٍ تَعْرِفُ فِى وُجُوهِ ٱلَّذِينَ كَفَرُوا۟ ٱلْمُنكَرَ يَكَادُونَ يَسْطُونَ بِٱلَّذِينَ يَتْلُونَ عَلَيْهِمْ ءَايَٰتِنَا قُلْ أَفَأُنَبِّئُكُم بِشَرٍّ مِّن ذَٰلِكُمُ ٱلنَّارُ وَعَدَهَا ٱللَّهُ ٱلَّذِينَ كَفَرُوا۟ وَبِئْسَ ٱلْمَصِيرُ",
    "ENGLISH": {
        "TRANSLATION_0": "When Our Signs are recited to them - Clear Signs - you can detect denial in the faces of those who are kafir. They all but assault those who recite Our Signs to them! Say: 'Shall I inform you of something worse than that? The Fire which Allah has promised those who are kafir. What an evil destination!'",
        "TRANSLATION_1": "When Our clear messages are read out to them you can see denial on the faces of unbelievers. They can hardly restrain themselves from attacking those who recite Our revelations. Tell them: \"Should I give you news of something worse than this?\" -- Hell, which God has promised the infidels. How evil a destination!\n",
        "TRANSLATION_2": "When Our Signs are plainly recited to them, you will perceive utter repugnance on their faces and it all but seems as if they will soon pounce upon those who recite Our Signs to them. Say: \"Shall I tell you what is worse than that? The Fire with which Allah has threatened those who disbelieve. That is truly an evil end.\"\n",
        "TRANSLATION_3": "When Our authoritative revelations are recited to the unbelievers, you can clearly read the dislike on their faces. They almost attack those who read Our revelations to them. Say to them, \"Should I tell you about what is the worst thing for you than these revelations? It is the fire which God has prepared for the unbelievers. What a terrible destination!\n",
        "TRANSLATION_4": "And when Our clear verses are recited to them, you will see traces of anger in the faces of the disbelievers; possibly they may attack those who recite Our verses to them; say, “Shall I show you what is worse than your current state? That is the fire! Allah has promised it to the disbelievers; and what a wretched place to return!”\n",
        "TRANSLATION_5": "And when Our clear Ayat are recited to them, you will notice a denial on the faces of the disbelievers! They are nearly ready to attack with violence those who recite Our Ayat to them. Say: \"Shall I tell you of something worse than that The Fire which Allah has promised to those who disbelieved, and worst indeed is that destination!\"\n",
        "TRANSLATION_6": "And when Our clear communications are recited to them you will find denial on the faces of those who disbelieve; they almost spring upon those who recite to them Our communications. Say: Shall I inform you of what is worse than this? The fire; Allah has promised it to those who disbelieve; and how evil the resort!\n",
        "TRANSLATION_7": "And when Our signs are recited to them, clear signs, thou recognisest in the faces of the unbelievers denial; wellnigh they rush upon those who recite to them Our signs. Say: 'Shall I tell you of something worse than that? The Fire -- God has promised it to the unbelievers -- an evil homecoming!'\n",
        "TRANSLATION_8": "And when Our revelations are recited unto them, thou knowest the denial in the faces of those who disbelieve; they all but attack those who recite Our revelations unto them. Say: Shall I proclaim unto you worse than that? The Fire! Allah hath promised it for those who disbelieve. A hapless journey's end!\n",
        "TRANSLATION_9": "Whenever Our clear revelations are recited to them, you will recognize the disgust on the faces of those who deny the truth. It is almost as if they are going to attack those who recite Our message to them. Say, \"Shall I tell you of something worse than this? It is the Fire that God has promised to those who are bent on denying the truth. What an evil destination!\"\n",
        "TRANSLATION_10": "And when Our manifest signs are rehearsed unto them, thou recognizest repugnance on the countenaces of those who disbelieve; well- nigh they rush upon these who rehearse unto them Our Signs. Say thou: shall declare unto you something more grievous than that-the Fire--Allah hath promised it to those who disbelieve? An evil destination!\n",
        "TRANSLATION_11": "When Our manifest signs are recited to them, you perceive denial on the faces of the faithless: they would almost pounce upon those who recite Our signs to them. Say, ‘Shall I inform you about something worse than that? The Fire which Allah has promised the faithless, and it is an evil destination.’\n",
        "TRANSLATION_12": "When Our Clear Signs are rehearsed to them, thou wilt notice a denial on the faces of the Unbelievers! they nearly attack with violence those who rehearse Our Signs to them. Say, \"Shall I tell you of something (far) worse than these Signs? It is the Fire (of Hell)! Allah has promised it to the Unbelievers! and evil is that destination!\"\n",
        "TRANSLATION_13": "And when Our Clear Verses are recited to them, you will notice a denial on the faces of the disbelievers! They are nearly ready to attack with violence those who recite Our Verses to them. Say: \"Shall I tell you of something worse than that? The Fire (of Hell) which Allah has promised to those who disbelieve, and worst indeed is that destination!\"\n",
        "TRANSLATION_14": "When Our clear verses are recited to them, you will recognize denial upon the faces of the unbelievers. They nearly rush upon those who recite Our verses to them. Say: 'Shall I tell you what is worse than that' The Fire which Allah has promised those who disbelieve an evil arrival'\n",
        "TRANSLATION_15": "And when Our Clear Verses are recited to them, you will recognize disgust on the faces of those who disbelieve. They nearly assault those who recite to them Our Verses. Say, “Shall I inform you of something worse than that? The Fire! God has promised it to those who disbelieve. And what a wretched outcome!”\n",
        "TRANSLATION_16": "And when Our verses are recited to them as clear evidences, you recognize in the faces of those who disbelieve disapproval. They are almost on the verge of assaulting those who recite to them Our verses. Say, \"Then shall I inform you of [what is] worse than that? [It is] the Fire which Allah has promised those who disbelieve, and wretched is the destination.\"\n",
        "TRANSLATION_17": "[22:72] And when Our signs, in the Qur’ān, are recited to them, [though they are] clear, manifest, signs (bayyinātin, a circumstantial qualifier) you perceive on the faces of those who disbelieve denial, that is to say, denial of these [signs], in other words [you perceive] the effect of such [denial] in the way of aversion and frowning. They would almost pounce upon those who recite Our signs to them, that is, [they would almost] fall upon them in assault. Say: ‘Shall I inform you about something worse than that?, something more repulsive to you than the Qur’ān that is being recited to you? It is, The Fire! God has promised it to the disbelievers, in that their journey’s end shall be to it. And it is an evil journey’s end!’\n",
        "TRANSLATION_18": "(And when Our revelations) i.e. the Qur'an (are recited unto them) expositing to them the commands and prohibitions, (thou knowest) Muhammad (the denial) their hatred of the Qur'an (in the faces of those who disbelieve) in the Qur'an; (they all but attack) they are about to beat up and fall on (those who recite Our revelations) the Qur'an (unto them. Say) Muhammad, to the people of Mecca: (Shall I proclaim unto you worse than that) worse than what you told the Muslims in the life of this world? They said to them: \"We have seen no adherents of any religion who are less fortunate than you\". And so Allah said: Say, 372 Muhammad... Allah said: what is worse is (The Fire! Allah hath promised it for the ones who disbelieve) in Muhammad (pbuh) and in the Qur'an; and you are indeed disbelievers in Muhammad and the Qur'an. (A hapless journey's end) to which they will come!\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "22:72",
            "64:10",
            "2:39",
            "22:16",
            "7:36",
            "23:104",
            "41:28",
            "20:133",
            "33:66",
            "40:63"
        ],
        "BIBLE": [
            "prophets:i%20samuel:26:25",
            "prophets:ezekiel:42:13",
            "prophets:isaiah:46:10",
            "torah:genesis:32:1",
            "torah:numbers:23:27",
            "prophets:jeremiah:22:11",
            "prophets:isaiah:43:9",
            "prophets:ii%20samuel:2:26",
            "prophets:isaiah:41:22",
            "writings:esther:7:8"
        ]
    }
}