{
    "VERSE": "22:75",
    "ARABIC": "ٱللَّهُ يَصْطَفِى مِنَ ٱلْمَلَٰٓئِكَةِ رُسُلًا وَمِنَ ٱلنَّاسِ إِنَّ ٱللَّهَ سَمِيعٌۢ بَصِيرٌ",
    "ENGLISH": {
        "TRANSLATION_0": "Allah chooses Messengers from the angels and from mankind. Allah is All-Hearing, All-Seeing.",
        "TRANSLATION_1": "God chooses messengers from the angels and human beings. Verily God is all-hearing and all-seeing.\n",
        "TRANSLATION_2": "Allah chooses Messengers from among angels and from among human beings (to convey His command). Allah is All-Hearing, All-Seeing.\n",
        "TRANSLATION_3": "God chooses Messengers from both angels and human beings. God is All-hearing and All-aware.\n",
        "TRANSLATION_4": "Allah chooses the Noble Messengers from the angels, and from men; indeed Allah is All Hearing, All Seeing.\n",
        "TRANSLATION_5": "Allah chooses Messengers from angels and from men. Verily, Allah is All-Hearer, All-Seer.\n",
        "TRANSLATION_6": "Allah chooses apostles from among the angels and from among the men; surely Allah is Hearing, Seeing.\n",
        "TRANSLATION_7": "God chooses of the angels Messengers and of mankind; surely God is All-hearing, All-seeing.\n",
        "TRANSLATION_8": "Allah chooseth from the angels messengers, and (also) from mankind. Lo! Allah is Hearer, Seer.\n",
        "TRANSLATION_9": "God selects messengers from both angels and from mankind; God is all hearing and all seeing:\n",
        "TRANSLATION_10": "Allah chooseth from the angels messengers and also from mankind; verily Allah is Hearing, Beholding.\n",
        "TRANSLATION_11": "Allah chooses messengers from angels and from mankind. Indeed Allah is all-hearing, all-seeing.\n",
        "TRANSLATION_12": "Allah chooses messengers from angels and from men for Allah is He Who hears and sees (all things).\n",
        "TRANSLATION_13": "Allah chooses Messengers from angels and from men. Verily, Allah is All-Hearer, All-Seer.\n",
        "TRANSLATION_14": "Allah chooses Messengers from angels and from people. Allah is the Hearer, the Seer.\n",
        "TRANSLATION_15": "God chooses messengers from among the angels, and from among the people. God is Hearing and Seeing.\n",
        "TRANSLATION_16": "Allah chooses from the angels messengers and from the people. Indeed, Allah is Hearing and Seeing.\n",
        "TRANSLATION_17": "[22:75] God chooses from the angels messengers and [also chooses] from mankind, messengers — this was revealed after the idolaters said, Has the Remembrance been revealed to him out of [all of] us? [Q. 38:8]. Truly God is Hearer, of what they say, Seer, of those whom He chooses as messengers, such as Gabriel, Michael, Abraham, Muhammad (s) and others, may God bless them and grant them peace.\n",
        "TRANSLATION_18": "(Allah chooseth from the angels messengers) who are sent with messages, i.e. Gabriel, Michael, Seraphiel and the angel of death, (and (also) from mankind) Muhammad and all the prophets (pbut). (Lo! Allah is Hearer) of their saying: how come this messenger eats food and walks about in the marketplace, (Seer) of their chastisement.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "22:75",
            "22:61",
            "2:98",
            "58:1",
            "2:161",
            "40:20",
            "4:58",
            "3:132",
            "7:158",
            "3:87"
        ],
        "BIBLE": [
            "writings:ecclesiastes:1:8",
            "prophets:isaiah:7:13",
            "writings:psalms:96:5",
            "writings:i%20chronicles:16:26",
            "writings:ecclesiastes:12:13",
            "writings:job:33:29",
            "torah:deuteronomy:4:32",
            "torah:numbers:5:10",
            "writings:ecclesiastes:12:14",
            "writings:psalms:72:18"
        ]
    }
}