{
    "VERSE": "22:76",
    "ARABIC": "يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَإِلَى ٱللَّهِ تُرْجَعُ ٱلْأُمُورُ",
    "ENGLISH": {
        "TRANSLATION_0": "He knows what is before them and what is behind them. All matters return to Allah.",
        "TRANSLATION_1": "He knows what is before them and what lies behind them, and all things go back to God.\n",
        "TRANSLATION_2": "He knows all that is before them and that which is hidden from them. And it is to Allah that all affairs are returned.\n",
        "TRANSLATION_3": "God knows all that they have and all that is behind them, and to Him do all things return.\n",
        "TRANSLATION_4": "He knows all that is before them and all that is behind them; and towards Allah is the return of all matters.\n",
        "TRANSLATION_5": "He knows what is before them, and what is behind them. And to Allah return all matters.\n",
        "TRANSLATION_6": "He knows what is before them and what is behind them and to Allah are all affairs turned back.\n",
        "TRANSLATION_7": "He knows whatsoever is before them and behind them, and unto God all matters are returned.'\n",
        "TRANSLATION_8": "He knoweth all that is before them and all that is behind them, and unto Allah all things are returned. $$A\n",
        "TRANSLATION_9": "He knows what lies ahead of them and what is behind them. All things shall return to God.\n",
        "TRANSLATION_10": "He knoweth whatsoever is before them and whatsoever is behind them; and unto Allah are returned all affairs\n",
        "TRANSLATION_11": "He knows that which is before them and that which is behind them, and to Allah all matters are returned.\n",
        "TRANSLATION_12": "He knows what is before them and what is behind them: and to Allah go back all questions (for decision).\n",
        "TRANSLATION_13": "He knows what is before them, and what is behind them. And to Allah return all matters (for decision).\n",
        "TRANSLATION_14": "He knows what is before them and behind them. To Allah all things are returned.\n",
        "TRANSLATION_15": "He knows what is before them, and what is behind them. To God all matters are referred.\n",
        "TRANSLATION_16": "He knows what is [presently] before them and what will be after them. And to Allah will be returned [all] matters.\n",
        "TRANSLATION_17": "[22:76] He knows that which is before them and that which is behind them, in other words, what they have offered [in the way of deeds] and what they have left behind, and what they have done and what they will do next; and to God all matters are returned.\n",
        "TRANSLATION_18": "(He knoweth all that is before them) of the matter of the Hereafter (and all that is behind them) of the matter of the life of this world, (and unto Allah all things) the consequence of all things (are returned) in the Hereafter.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "22:76",
            "19:64",
            "36:45",
            "20:110",
            "13:11",
            "41:14",
            "6:58",
            "49:9",
            "21:28",
            "2:66"
        ],
        "BIBLE": [
            "prophets:ii%20samuel:14:20",
            "torah:deuteronomy:30:3",
            "prophets:jeremiah:5:25",
            "prophets:i%20samuel:12:21",
            "prophets:joel:2:14",
            "prophets:ezekiel:18:30",
            "prophets:isaiah:42:17",
            "prophets:ezekiel:14:6",
            "writings:ecclesiastes:7:25",
            "prophets:jeremiah:24:7"
        ]
    }
}