{
    "VERSE": "22:77",
    "ARABIC": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ ٱرْكَعُوا۟ وَٱسْجُدُوا۟ وَٱعْبُدُوا۟ رَبَّكُمْ وَٱفْعَلُوا۟ ٱلْخَيْرَ لَعَلَّكُمْ تُفْلِحُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "You who have iman! bow and prostrate and worship your Lord, and do good, so that hopefully you will be successful.",
        "TRANSLATION_1": "O you who believe, bow in adoration, Worship your Lord and do what is good that you may find success.\n",
        "TRANSLATION_2": "Believers, bow down and prostrate yourselves before Your Lord and serve Your Lord and do good that you may prosper.\n",
        "TRANSLATION_3": "Believers, worship your Lord, bow down and prostrate yourselves before Him and do virtuous deeds so that perhaps you will have everlasting happiness.\n",
        "TRANSLATION_4": "O People who Believe, bow and prostrate yourselves, and worship your Lord, and do good deeds in the hope of attaining salvation.\n",
        "TRANSLATION_5": "O you who believe! Bow down, and prostrate yourselves, and worship your Lord and do good that you may be successful.\n",
        "TRANSLATION_6": "O you who believe! bow down and prostrate yourselves and serve your Lord, and do good that you may succeed.\n",
        "TRANSLATION_7": "O men, bow you down and prostrate yourselves, and serve your Lord, and do good; haply so you shall prosper;\n",
        "TRANSLATION_8": "O ye who believe! Bow down and prostrate yourselves, and worship your Lord, and do good, that haply ye may prosper.\n",
        "TRANSLATION_9": "You who are true believers, kneel and prostrate yourselves, worship your Lord and do good works, so that you may succeed.\n",
        "TRANSLATION_10": "O Ye who believe! bow down and prostrate yourselves and worship your Lord, and do the good, that haply ye may thrive.\n",
        "TRANSLATION_11": "O you who have faith! Bow down and prostrate yourselves, and worship your Lord, and do good, so that you may be felicitous.\n",
        "TRANSLATION_12": "O ye who believe! bow down, prostrate yourselves, and adore your Lord; and do good; that ye may prosper.\n",
        "TRANSLATION_13": "O you who believe! Bow down, and prostrate yourselves, and worship your Lord and do good that you may be successful.\n",
        "TRANSLATION_14": "O you who believe, bow down and prostrate yourselves. Worship your Lord and do good, in order that you prosper.\n",
        "TRANSLATION_15": "O you who believe! Kneel, and prostrate, and worship your Lord, and do good deeds, so that you may succeed.\n",
        "TRANSLATION_16": "O you who have believed, bow and prostrate and worship your Lord and do good - that you may succeed.\n",
        "TRANSLATION_17": "[22:77] O you who believe, bow down and prostrate yourselves, in other words, perform prayer, and worship your Lord, affirm His Oneness, and do good, such as [showing] kindness to kin and [the adoption of] noble traits, that perhaps you may be prosperous, [that perhaps] you may secure everlasting life in Paradise.\n",
        "TRANSLATION_18": "(0 ye who believe! Bow down and prostrate yourselves) in the prayer, (and worship) obey (your Lord, and do good) righteous works, (that haply ye may prosper) that you may be safe from Allah's wrath and punishment.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "22:77",
            "23:118",
            "23:29",
            "98:7",
            "23:72",
            "2:21",
            "16:42",
            "29:59",
            "2:46",
            "25:64"
        ],
        "BIBLE": [
            "prophets:jeremiah:29:32",
            "prophets:isaiah:29:14",
            "writings:psalms:34:9",
            "writings:lamentations:3:26",
            "prophets:joshua:23:16",
            "writings:daniel:3:12",
            "prophets:joshua:24:22",
            "writings:psalms:145:9",
            "writings:daniel:7:27",
            "writings:psalms:75:2"
        ]
    }
}