{
    "VERSE": "50:11",
    "ARABIC": "رِّزْقًا لِّلْعِبَادِ وَأَحْيَيْنَا بِهِۦ بَلْدَةً مَّيْتًا كَذَٰلِكَ ٱلْخُرُوجُ",
    "ENGLISH": {
        "TRANSLATION_0": "as provision for Our slaves; by it We brought a dead land to life. That is how the Emergence will take place.",
        "TRANSLATION_1": "As a provision for men, and enlivened a region that was dead. Even thus will be the life after death.\n",
        "TRANSLATION_2": "all this as sustenance for Our servants. And thus We do bring the dead land back to life with water. Such shall be the coming forth (of human beings from the earth).\n",
        "TRANSLATION_3": "as sustenance for My servants. With this We have brought the dead land back to life. Thus, will also be your resurrection.\n",
        "TRANSLATION_4": "As sustenance for the bondmen; and with it We revived a dead city; this is how you will be raised.\n",
        "TRANSLATION_5": "A provision for the servants. And We give life therewith to a dead land. Thus will be the Resurrection.\n",
        "TRANSLATION_6": "A sustenance for the servants, and We give life thereby to a dead land; thus is the rising.\n",
        "TRANSLATION_7": "a provision for the servants, and thereby We revived a land that was dead. Even so is the coming forth.\n",
        "TRANSLATION_8": "Provision (made) for men; and therewith We quicken a dead land. Even so will be the resurrection of the dead.\n",
        "TRANSLATION_9": "as a provision for human beings; and by [all] this We bring dead land to life. Such shall be the Resurrection.\n",
        "TRANSLATION_10": "As a provision for our bondmen; and therewith We have quickened a dead land. Even so will be the coming forth.\n",
        "TRANSLATION_11": "as a provision for Our servants, and with it We revive a dead country. Likewise will be the rising [from the dead].\n",
        "TRANSLATION_12": "As sustenance for (Allah's) Servants;- and We give (new) life therewith to land that is dead: Thus will be the Resurrection.\n",
        "TRANSLATION_13": "A provision for (Allah's) slaves. And We give life therewith to a dead land. Thus will be the resurrection (of the dead).\n",
        "TRANSLATION_14": "as a provision for the worshipers; thereby We revived a land that was dead. Such shall be the emerging.\n",
        "TRANSLATION_15": "As sustenance for the servants. And We revive thereby a dead town. Likewise is the resurrection.\n",
        "TRANSLATION_16": "As provision for the servants, and We have given life thereby to a dead land. Thus is the resurrection.\n",
        "TRANSLATION_17": "[50:11] as provision for [Our] servants (rizqan li’l-‘ibādi, is a direct object denoting reason); and with it We revive a dead land (baldatan may be followed equally by the masculine [maytan] or the feminine [adjective, maytatan]). So, like that manner of reviving, shall be the rising, from the graves: so how can you deny it? (the interrogative is meant as an affirmative; the meaning then is that they have indeed observed [all of these things] and are aware of what has been mentioned [yet they disbelieve]).\n",
        "TRANSLATION_18": "Provision (made) for men) food for people, i.e. the grains; (and therewith) i.e. through water (We quicken a dead land) a land with no vegetation. (Even so will be the resurrection of the dead) this is how they will be brought back to life and raised forth from the graves through water on the Day of Judgement.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "50:11",
            "43:11",
            "17:30",
            "37:171",
            "29:62",
            "25:49",
            "28:82",
            "51:22",
            "50:29",
            "7:32"
        ],
        "BIBLE": [
            "torah:numbers:16:14",
            "prophets:i%20samuel:2:6",
            "torah:numbers:20:24",
            "prophets:jeremiah:16:15",
            "prophets:jeremiah:25:31",
            "prophets:jeremiah:35:15",
            "torah:genesis:24:32",
            "prophets:ezekiel:37:25",
            "prophets:i%20samuel:2:15",
            "writings:job:42:11"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:3:7",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:8",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:3:2"
        ]
    }
}