{
    "VERSE": "50:12",
    "ARABIC": "كَذَّبَتْ قَبْلَهُمْ قَوْمُ نُوحٍ وَأَصْحَٰبُ ٱلرَّسِّ وَثَمُودُ",
    "ENGLISH": {
        "TRANSLATION_0": "Before them the people of Nuh also denied the truth and the Companions of Rass and Thamud,",
        "TRANSLATION_1": "The people of Noah, Ar-Rass and Thamud denied before you,\n",
        "TRANSLATION_2": "In the past Noah's people, and the people of Rass and Thamud gave the lie (to Messengers),\n",
        "TRANSLATION_3": "The people of Noah, dwellers of the Ra's, Thamud,\n",
        "TRANSLATION_4": "Before these, the people of Nooh had denied, and so did the dwellers of Rass and the Thamud.\n",
        "TRANSLATION_5": "Denied before them the people of Nuh, and the Dwellers of Rass, and Thamud,\n",
        "TRANSLATION_6": "(Others) before them rejected (prophets): the people of Nuh and the dwellers of Ar-Rass and Samood,\n",
        "TRANSLATION_7": "Cried lies before them the people of Noah and the men of Er-Rass, and Thamood,\n",
        "TRANSLATION_8": "The folk of Noah denied (the truth) before them, and (so did) the dwellers at Ar-Rass and (the tribe of) Thamud,\n",
        "TRANSLATION_9": "Before them, the people of Noah and the people of Rass denied this truth; and so did the people of Thamud.\n",
        "TRANSLATION_10": "And before them the people of Nuh belied, and so did the dwellers Of Rass and the Thamud.\n",
        "TRANSLATION_11": "The people of Noah denied before them, and [so did] the people of Rass and Thamud,\n",
        "TRANSLATION_12": "Before them was denied (the Hereafter) by the People of Noah, the Companions of the Rass, the Thamud,\n",
        "TRANSLATION_13": "Denied before them (i.e. these pagans of Makkah who denied you, O Muhammad SAW) the people of Nuh (Noah), and the dwellers of Rass, and the Thamud,\n",
        "TRANSLATION_14": "Before them, the nation of Noah, the nation of ArRass belied and so did Thamood\n",
        "TRANSLATION_15": "Before them the people of Noah denied the truth, and so did the dwellers of Russ, and Thamood.\n",
        "TRANSLATION_16": "The people of Noah denied before them, and the companions of the well and Thamud\n",
        "TRANSLATION_17": "[50:12] The people of Noah denied before them (kadhdhabat has a feminine person inflection because of the [feminine gender of the] import of qawm, ‘people’) and [so did] the dwellers at al-Rass — this was the name of a well around which they dwelt together with their livestock; they worshipped idols, and it is said that their prophet was one Hanzala b. Safwān; but some say that he was some other [person] — and Thamūd, the people of Sālih,\n",
        "TRANSLATION_18": "605 (The folk of Noah denied) denied Noah (before them) before your folk, Muhammad, (and (so did) the dwellers at al-Rass) al-Rass is a well close to al-Yamamah; the dwellers of al-Rass are the people of Shu'ayb who denied Shu'ayb (and (the tribe of) Thamud) the people of Salih,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "50:12",
            "51:46",
            "54:9",
            "38:12",
            "44:17",
            "38:13",
            "22:42",
            "50:14",
            "9:70",
            "26:105"
        ],
        "BIBLE": [
            "torah:exodus:2:21",
            "prophets:jeremiah:44:20",
            "prophets:ezekiel:36:28",
            "torah:deuteronomy:32:8",
            "writings:psalms:78:62",
            "writings:ii%20chronicles:33:10",
            "writings:lamentations:1:11",
            "torah:genesis:3:12",
            "prophets:judges:14:20",
            "writings:psalms:106:41"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:3:5",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:5:1"
        ]
    }
}