{
    "VERSE": "50:14",
    "ARABIC": "وَأَصْحَٰبُ ٱلْأَيْكَةِ وَقَوْمُ تُبَّعٍ كُلٌّ كَذَّبَ ٱلرُّسُلَ فَحَقَّ وَعِيدِ",
    "ENGLISH": {
        "TRANSLATION_0": "and the Companions of the Thicket and the people of Tubba'. Each one denied the Messengers and My promise proved true.",
        "TRANSLATION_1": "And the dwellers of the Wood and people of Tubba'. Each of them denied the apostles. So My threat became a reality.\n",
        "TRANSLATION_2": "and the people of Aykah, and the people of Tubba'. They all gave the lie to the Messengers. Thereafter My threat of chastisement against them was fulfilled.\n",
        "TRANSLATION_3": "dwellers of the forest, and the people of Tubba had all rejected the Prophets. Thus, they became subject to Our torment.\n",
        "TRANSLATION_4": "And the Dwellers of the Woods, and the people of Tubb’a; each one of them one denied the Noble Messengers, so My promised punishment proved true.\n",
        "TRANSLATION_5": "And the Dwellers of Al-Aykah, and the people of Tubba`. Everyone of them denied (their) Messengers, so My threat took effect.\n",
        "TRANSLATION_6": "And the dwellers of the grove and the people of Tuba; all rejected the apostles, so My threat came to pass.\n",
        "TRANSLATION_7": "the men of the Thicket, the people of Tubba'. Every one cried lies to the Messengers, and My threat came true.\n",
        "TRANSLATION_8": "And the dwellers in the wood, and the folk of Tubb'a: every one denied their messengers, therefor My threat took effect.\n",
        "TRANSLATION_9": "and the dwellers of the Wood, and the people of Tubba': every one denied their messengers, and so My warning came true.\n",
        "TRANSLATION_10": "And the dwellers in the wood, and the people of Tubba. Each one belied the apostles, wherefore fulfilled was My judgement.\n",
        "TRANSLATION_11": "and the inhabitants of Aykah and the people of Tubbac. Each [of them] impugned the apostles, and so My threat became due [against them].\n",
        "TRANSLATION_12": "The Companions of the Wood, and the People of Tubba'; each one (of them) rejected the messengers, and My warning was duly fulfilled (in them).\n",
        "TRANSLATION_13": "And the dwellers of the Wood, and the people of Tubba'; everyone of them denied (their) Messengers, so My Threat took effect.\n",
        "TRANSLATION_14": "the dwellers of the Thicket and the nation of Tubba', all belied their Messengers, therefore My threat was realized.\n",
        "TRANSLATION_15": "And the Dwellers of the Woods, and the people of Tubba. They all rejected the messengers, so My threat came true.\n",
        "TRANSLATION_16": "And the companions of the thicket and the people of Tubba'. All denied the messengers, so My threat was justly fulfilled.\n",
        "TRANSLATION_17": "[50:14] and the dwellers in the wood, a small forest — the people of Shu‘ayb — and the people of Tubba‘ — a king [who ruled] in Yemen; he had submitted [to God] and had summoned his people to [the same] submission [to God], but they denied him. Each, of those mentioned, denied the messengers, as [your tribe] Quraysh have, and so My threat became due, the sending down of chastisement on all [of them] became incumbent, so do not be anguished by Quraysh’s disbelieving in you.\n",
        "TRANSLATION_18": "(And the dwellers in the wood) the people of Shu'ayb denied Shu'ayb, (and the folk of Tubba') Tubba' was the king of Himyar. His name was As'ad Ibn Malkikarb, and his agnomen was Abu Karb and he was called Tubba' because of the huge number of his followers (atba'); he was also a person who surrendered to Allah: (every one) of these folk (denied their messengers) just as your folk, the Quraysh, denied you, (therefore My threat took effect) and therefore My punishment and torment were enjoined upon them when they denied the messengers.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "50:14",
            "50:12",
            "23:44",
            "38:13",
            "40:5",
            "38:14",
            "20:135",
            "3:194",
            "3:86",
            "20:85"
        ],
        "BIBLE": [
            "writings:nehemiah:2:1",
            "writings:psalms:105:44",
            "prophets:judges:14:19",
            "writings:ii%20chronicles:13:15",
            "prophets:i%20kings:11:18",
            "prophets:jeremiah:52:9",
            "prophets:ii%20kings:25:6",
            "prophets:ii%20kings:10:15",
            "prophets:judges:14:9",
            "prophets:ezekiel:18:8"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:6"
        ]
    }
}