{
    "VERSE": "50:15",
    "ARABIC": "أَفَعَيِينَا بِٱلْخَلْقِ ٱلْأَوَّلِ بَلْ هُمْ فِى لَبْسٍ مِّنْ خَلْقٍ جَدِيدٍ",
    "ENGLISH": {
        "TRANSLATION_0": "Were We exhausted by the first creation? Yet they are dubious about the new creation.",
        "TRANSLATION_1": "Were We exhausted by the act of the first creation? And yet they are confused about a new creation.\n",
        "TRANSLATION_2": "Did We, then, become worn out by the first creation? Not at all; but they are in doubt about a fresh creation.\n",
        "TRANSLATION_3": "Did We fail to accomplish the first creation? Of course, We did not; We have all power over all things. Yet they are confused about a new creation.\n",
        "TRANSLATION_4": "So did We tire by creating the first time? Rather they doubt being created again.\n",
        "TRANSLATION_5": "Were We then tired with the first creation Nay, they are in confused doubt about a new creation.\n",
        "TRANSLATION_6": "Were We then fatigued with the first creation? Yet are they in doubt with regard to a new creation.\n",
        "TRANSLATION_7": "What, were We wearied by the first creation? No indeed; but they are in uncertainty as to the new creation.\n",
        "TRANSLATION_8": "Were We then worn out by the first creation? Yet they are in doubt about a new creation.\n",
        "TRANSLATION_9": "Were We then worn out by the first creation? Yet they are in doubt about a second creation.\n",
        "TRANSLATION_10": "Are We then wearied with the first creation? Aye! they are in dubiety regarding a new creation.\n",
        "TRANSLATION_11": "Have We been exhausted by the first creation? No, they are in doubt about a new creation.\n",
        "TRANSLATION_12": "Were We then weary with the first Creation, that they should be in confused doubt about a new Creation?\n",
        "TRANSLATION_13": "Were We then tired with the first creation? Nay, They are in confused doubt about a new creation (i.e. Resurrection)?\n",
        "TRANSLATION_14": "What, were We wearied by the first creation? No, indeed; yet they are in doubt about a new creation.\n",
        "TRANSLATION_15": "Were We fatigued by the first creation? But they are in doubt of a new creation.\n",
        "TRANSLATION_16": "Did We fail in the first creation? But they are in confusion over a new creation.\n",
        "TRANSLATION_17": "[50:15] Were We then wearied by the first creation?, that is to say, We were not wearied by it, and likewise We will not be wearied by restoring it. Nay, yet they are in doubt about a new creation, which will be [at] the Resurrection.\n",
        "TRANSLATION_18": "(Were We then worn out by the first creation) such that We will be worn out by their second creation when We create them for resurrection after death? (Yet they) i.e. the Quraysh (are in doubt about a new creation) after death.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "50:15",
            "32:10",
            "35:16",
            "37:17",
            "56:48",
            "43:6",
            "36:68",
            "14:19",
            "77:16",
            "23:68"
        ],
        "BIBLE": [
            "prophets:isaiah:48:6",
            "torah:deuteronomy:1:18",
            "prophets:isaiah:65:17",
            "writings:esther:9:27",
            "writings:nehemiah:13:26",
            "writings:daniel:2:8",
            "writings:proverbs:22:20",
            "torah:deuteronomy:32:35",
            "torah:leviticus:26:18",
            "torah:numbers:22:38"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:2",
            "Sefer%20Yetzirah:1:2",
            "Sefer%20Yetzirah:2:2",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:3:4"
        ]
    }
}