{
    "VERSE": "50:17",
    "ARABIC": "إِذْ يَتَلَقَّى ٱلْمُتَلَقِّيَانِ عَنِ ٱلْيَمِينِ وَعَنِ ٱلشِّمَالِ قَعِيدٌ",
    "ENGLISH": {
        "TRANSLATION_0": "And the two recording angels are recording, sitting on the right and on the left.",
        "TRANSLATION_1": "When the two (angels) who keep the account, one sitting on the right, one on the left, take it down,\n",
        "TRANSLATION_2": "Moreover, there are two scribes, one each sitting on the right and the left, recording everything.\n",
        "TRANSLATION_3": "Since the two scribes are sitting on each of his shoulders, he does not utter a word which is not recorded immediately by the watchful scribes.\n",
        "TRANSLATION_4": "When the two receiving angels receive from him, one seated on the right and one on the left.\n",
        "TRANSLATION_5": "(Remember) that the two receivers (recording angels) receive (each human being), one sitting on the right and one on the left.\n",
        "TRANSLATION_6": "When the two receivers receive, sitting on the right and on the left.\n",
        "TRANSLATION_7": "When the two angels meet together, sitting one on the right, and one on the left,\n",
        "TRANSLATION_8": "When the two Receivers receive (him), seated on the right hand and on the left,\n",
        "TRANSLATION_9": "and the two recording angels are recording, sitting on the right and the left:\n",
        "TRANSLATION_10": "Behold! when the two receivers receive-one on the right hand and one on the left a sitter.\n",
        "TRANSLATION_11": "When the twin recorders record [his deeds], seated on the right hand and on the left:\n",
        "TRANSLATION_12": "Behold, two (guardian angels) appointed to learn (his doings) learn (and noted them), one sitting on the right and one on the left.\n",
        "TRANSLATION_13": "(Remember!) that the two receivers (recording angels) receive (each human being after he or she has attained the age of puberty), one sitting on the right and one on the left (to note his or her actions).\n",
        "TRANSLATION_14": "When both receivers (the angels) receive, one on his right, the other on his left,\n",
        "TRANSLATION_15": "As the two receivers receive, seated to the right and to the left.\n",
        "TRANSLATION_16": "When the two receivers receive, seated on the right and on the left.\n",
        "TRANSLATION_17": "[50:17] When (idh is dependent because of an implied udhkur, ‘mention’) the two Receivers, the two angels charged with [recording] a person’s deeds, receive, [when they] observe and record, seated, that is, [while] both of them are sitting (qa‘īdun, ‘seated’, is the subject, the predicate of which is the preceding [clause]), on the right and on the left, [hand side] of him —\n",
        "TRANSLATION_18": "(When the two Receivers receive (him)) when the two angels write, (seated on) one sitting on one side and the other on another side (the right hand) the right hand of the child of Adam (and on the left) the left hand of the child of Adam,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "50:17",
            "70:37",
            "56:90",
            "37:28",
            "56:27",
            "56:41",
            "56:38",
            "69:45",
            "16:48",
            "18:18"
        ],
        "BIBLE": [
            "prophets:i%20kings:22:19",
            "writings:ii%20chronicles:18:18",
            "torah:numbers:36:5",
            "torah:deuteronomy:33:3",
            "prophets:ezekiel:3:10",
            "prophets:ezekiel:16:61",
            "prophets:isaiah:30:21",
            "prophets:jeremiah:32:8",
            "prophets:ii%20samuel:14:19",
            "torah:deuteronomy:28:14"
        ]
    }
}