{
    "VERSE": "50:18",
    "ARABIC": "مَّا يَلْفِظُ مِن قَوْلٍ إِلَّا لَدَيْهِ رَقِيبٌ عَتِيدٌ",
    "ENGLISH": {
        "TRANSLATION_0": "He does not utter a single word, without a watcher by him, pen in hand!",
        "TRANSLATION_1": "There is not a word he utters but an observer is ready (to make note of it).\n",
        "TRANSLATION_2": "He utters not a word, but there is a vigilant watcher at hand.\n",
        "TRANSLATION_3": "The human being will certainly experience the agony of death\n",
        "TRANSLATION_4": "He does not utter a single word, without a ready recorder seated next to him.\n",
        "TRANSLATION_5": "Not a word does he (or she) utter but there is a watcher by him ready (to record it).\n",
        "TRANSLATION_6": "He utters not a word but there is by him a watcher at hand.\n",
        "TRANSLATION_7": "not a word he utters, but by him is an observer ready.\n",
        "TRANSLATION_8": "He uttereth no word but there is with him an observer ready.\n",
        "TRANSLATION_9": "each word he utters shall be noted down by a vigilant guardian.\n",
        "TRANSLATION_10": "Not a word he uttereth but there is with him a watcher ready.\n",
        "TRANSLATION_11": "he says no word but that there is a ready observer beside him.\n",
        "TRANSLATION_12": "Not a word does he utter but there is a sentinel by him, ready (to note it).\n",
        "TRANSLATION_13": "Not a word does he (or she) utter, but there is a watcher by him ready (to record it).\n",
        "TRANSLATION_14": "whatever phrase he utters, an observer is present.\n",
        "TRANSLATION_15": "Not a word does he utter, but there is a watcher by him, ready.\n",
        "TRANSLATION_16": "Man does not utter any word except that with him is an observer prepared [to record].\n",
        "TRANSLATION_17": "[50:18] he does not utter a word but that there is beside him a watcher, a guardian, [who is] ready, present (both [raqībun, ‘watcher’, and ‘atīdun, ‘ready’] are meant to indicate the dual).\n",
        "TRANSLATION_18": "(He uttereth no word) the slave utters no good or evil word (but there is with him an observer ready) to record either that which is in his advantage or disadvantage.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "50:18",
            "50:23",
            "21:2",
            "15:4",
            "26:208",
            "51:52",
            "15:40",
            "38:83",
            "15:21",
            "26:5"
        ],
        "BIBLE": [
            "prophets:ezekiel:12:23",
            "torah:genesis:2:18",
            "prophets:jeremiah:16:20",
            "torah:exodus:30:32",
            "torah:exodus:32:23",
            "prophets:joshua:9:7",
            "writings:i%20chronicles:22:5",
            "writings:esther:5:5",
            "prophets:ii%20kings:10:5",
            "torah:deuteronomy:29:8"
        ]
    }
}