{
    "VERSE": "50:2",
    "ARABIC": "بَلْ عَجِبُوٓا۟ أَن جَآءَهُم مُّنذِرٌ مِّنْهُمْ فَقَالَ ٱلْكَٰفِرُونَ هَٰذَا شَىْءٌ عَجِيبٌ",
    "ENGLISH": {
        "TRANSLATION_0": "Nonetheless they are amazed that a warner should have come to them from among themselves and those who are kafir say, 'What an extraordinary thing!",
        "TRANSLATION_1": "They are rather surprised that a warner from among themselves has come to them. So the unbelievers say: \"This is astonishing:\n",
        "TRANSLATION_2": "Nay; they wondered that a warner should have come to them from among themselves. The unbelievers said: “This indeed is a strange thing.\n",
        "TRANSLATION_3": "In fact, it seems odd (to the pagans) that a warner from their own people has come to them. The disbelievers have said, \"It is very strange\n",
        "TRANSLATION_4": "Rather they were shocked that a Herald of Warning came to them from among themselves, so the disbelievers said, “This is something really strange.”\n",
        "TRANSLATION_5": "Nay, they wonder that there has come to them a warner from among themselves. So the disbelievers say: \"This is a strange thing!\"\n",
        "TRANSLATION_6": "Nay! they wonder that there has come to them a warner from among themselves, so the unbelievers say: This is a wonderful thing:\n",
        "TRANSLATION_7": "Nay, but they marvel that a warner has come to them from among them; and the unbelievers say, 'This is a marvellous thing!\n",
        "TRANSLATION_8": "Nay, but they marvel that a warner of their own hath come unto them; and the disbelievers say: This is a strange thing:\n",
        "TRANSLATION_9": "Indeed, they are astonished that a warner should have come to them from among themselves. So these deniers of the truth say, \"This is indeed a strange thing,\n",
        "TRANSLATION_10": "Aye! they marvel that there hath come Unto them a warner from among themselves; so the infidels Say: this is a thing wondrous!\n",
        "TRANSLATION_11": "Indeed they consider it odd that a warner from among themselves should have come to them. So the faithless say, ‘This is an odd thing.’\n",
        "TRANSLATION_12": "But they wonder that there has come to them a Warner from among themselves. So the Unbelievers say: \"This is a wonderful thing!\n",
        "TRANSLATION_13": "Nay, they wonder that there has come to them a warner (Muhammad SAW) from among themselves. So the disbelievers say: \"This is a strange thing!\n",
        "TRANSLATION_14": "No, but they marvel that from among themselves a warner has come to them. The unbelievers say (in mockery): 'This is a marvelous thing!\n",
        "TRANSLATION_15": "They marveled that a warner has come to them from among them. The disbelievers say, “This is something strange.\n",
        "TRANSLATION_16": "But they wonder that there has come to them a warner from among themselves, and the disbelievers say, \"This is an amazing thing.\n",
        "TRANSLATION_17": "[50:2] Nay, but they consider it odd that there should have come to them a warner from among themselves, a messenger who is one of them, to threaten them with [the punishment of] the Fire after resurrection. So the disbelievers say, ‘This, warning, is an odd thing!\n",
        "TRANSLATION_18": "(Nay, but they marvel) i.e. the Quraysh; and it is because they marvelled that Allah made this oath: they marvelled when they were told they will be resurrected after death; He said: in fact the Quraysh, among whom Ubayy and Umayyah the sons of Khalaf, Munbih and Nabih the son of Hajjaj, marvelled (that a warner) a warning messenger (of their own) from their own lineage (hath come unto them; and the disbelievers) the disbelievers of Mecca: Ubayy, Umayyah, Munbih and Nabih (say: This) which Muhammad (pbuh) says, i.e. that they will be resurrected after death, (is a strange thing) for he says: 604\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "50:2",
            "38:5",
            "3:128",
            "52:35",
            "80:18",
            "19:60",
            "38:4",
            "54:6",
            "38:6",
            "11:72"
        ],
        "BIBLE": [
            "torah:genesis:42:36",
            "torah:genesis:22:1",
            "torah:numbers:22:38",
            "prophets:ii%20kings:5:13",
            "torah:genesis:42:12",
            "torah:exodus:19:9",
            "torah:exodus:2:18",
            "prophets:ii%20samuel:14:15",
            "prophets:ii%20kings:6:18",
            "writings:ii%20chronicles:10:12"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:2"
        ]
    }
}