{
    "VERSE": "50:20",
    "ARABIC": "وَنُفِخَ فِى ٱلصُّورِ ذَٰلِكَ يَوْمُ ٱلْوَعِيدِ",
    "ENGLISH": {
        "TRANSLATION_0": "The Trumpet will be blown. That is the Day of the Threat.",
        "TRANSLATION_1": "And the trumpet blast will sound: It would be the Day of Doom.\n",
        "TRANSLATION_2": "And then the Trumpet was blown. This is the day of the promised chastisement.\n",
        "TRANSLATION_3": "The trumpet will certainly be sounded. This will be the day (about which you) were threatened.\n",
        "TRANSLATION_4": "And the Trumpet was blown; “This is the Day of the promised punishment.”\n",
        "TRANSLATION_5": "And the Trumpet will be blown -- that will be the Day of the threat.\n",
        "TRANSLATION_6": "And the trumpet shall be blown; that is the day of the threatening.\n",
        "TRANSLATION_7": "And the Trumpet shall be blown; that is the Day of the Threat.\n",
        "TRANSLATION_8": "And the trumpet is blown. This is the threatened Day.\n",
        "TRANSLATION_9": "The trumpet will be sounded. This is the Day [you were] warned of.\n",
        "TRANSLATION_10": "And the trumpet will be blown: this is the Day of the Threatening.\n",
        "TRANSLATION_11": "And the Trumpet will be blown: ‘This is the promised day.’\n",
        "TRANSLATION_12": "And the Trumpet shall be blown: that will be the Day whereof Warning (had been given).\n",
        "TRANSLATION_13": "And the Trumpet will be blown, that will be the Day whereof warning (had been given) (i.e. the Day of Resurrection).\n",
        "TRANSLATION_14": "And the Horn shall be blown; that is the Day of Threat!\n",
        "TRANSLATION_15": "And the Trumpet is blown: “This is the Promised Day.”\n",
        "TRANSLATION_16": "And the Horn will be blown. That is the Day of [carrying out] the threat.\n",
        "TRANSLATION_17": "[50:20] And the Trumpet will be blown, for resurrection. That, namely, the day of the blast, is the Day of the Promised Threat, of chastisement for the disbelievers.\n",
        "TRANSLATION_18": "(And the trumpet is blown) this is the blowing of the resurrection. (This is the threatened Day) the threatened Day of the first and latter nations.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "50:20",
            "20:102",
            "78:18",
            "30:12",
            "85:2",
            "30:55",
            "36:59",
            "79:6",
            "34:30",
            "30:14"
        ],
        "BIBLE": [
            "prophets:joshua:6:16",
            "prophets:i%20kings:13:3",
            "prophets:ii%20kings:6:29",
            "prophets:i%20kings:9:13",
            "torah:leviticus:19:24",
            "writings:psalms:118:18",
            "writings:psalms:112:9",
            "prophets:i%20kings:3:13",
            "torah:numbers:18:29",
            "writings:daniel:7:11"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:11",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:4:12",
            
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:2:1"
        ]
    }
}