{
    "VERSE": "50:22",
    "ARABIC": "لَّقَدْ كُنتَ فِى غَفْلَةٍ مِّنْ هَٰذَا فَكَشَفْنَا عَنكَ غِطَآءَكَ فَبَصَرُكَ ٱلْيَوْمَ حَدِيدٌ",
    "ENGLISH": {
        "TRANSLATION_0": "'You were heedless of this so We have stripped you of your covering and today your sight is sharp.'",
        "TRANSLATION_1": "(And the driver will say:) \"You were oblivious of this, so we have removed the veil, and how keen is your sight today!\"\n",
        "TRANSLATION_2": "You were heedless of this. Now We have removed your veil and so your vision today is sharp.\n",
        "TRANSLATION_3": "(He will be told), \"You were completely heedless of this day. We have removed the veil from your eyes and your vision will now be sharp and strong\".\n",
        "TRANSLATION_4": "“You were indeed neglectful of this, so We have removed the veil for you, and your eyesight is sharp this day.”\n",
        "TRANSLATION_5": "(It will be said to the sinners): \"Indeed you were heedless of this. Now We have removed from you, your covering, and sharp is your sight this Day!\"\n",
        "TRANSLATION_6": "Certainly you were heedless of it, but now We have removed from you your veil, so your sight today is sharp.\n",
        "TRANSLATION_7": "Thou wast heedless of this; therefore We have now removed from thee thy covering, and so thy sight today is piercing.'\n",
        "TRANSLATION_8": "(And unto the evil-doer it is said): Thou wast in heedlessness of this. Now We have removed from thee thy covering, and piercing is thy sight this day.\n",
        "TRANSLATION_9": "You were heedless of this, but now We have removed your veil, so your sight today is sharp.\n",
        "TRANSLATION_10": "Assuredly thou wast in neglect thereof; now We have removed from off thee thy veil, so thy sight Today is piercing.\n",
        "TRANSLATION_11": "[he will be told] ‘You were certainly oblivious of this. We have removed your veil from you, and so today your eyesight is acute.’\n",
        "TRANSLATION_12": "(It will be said:) \"Thou wast heedless of this; now have We removed thy veil, and sharp is thy sight this Day!\"\n",
        "TRANSLATION_13": "(It will be said to the sinners): \"Indeed you were heedless of this, now We have removed your covering, and sharp is your sight this Day!\"\n",
        "TRANSLATION_14": "(It will be said): 'Of this you have been heedless. Therefore, we have now removed your covering. Today your sight is sharp'\n",
        "TRANSLATION_15": "“You were in neglect of this, so We lifted your screen from you, and your vision today is keen.”\n",
        "TRANSLATION_16": "[It will be said], \"You were certainly in unmindfulness of this, and We have removed from you your cover, so your sight, this Day, is sharp.\"\n",
        "TRANSLATION_17": "[50:22] ‘Verily, in the world, you were oblivious of this, that has befallen you on this day; So [now] We have   removed from you your covering, We have done away with your oblivion by what you witness on this day, and so your sight on this day is acute’, [it is] sharp, able to perceive what you used to reject in the world.\n",
        "TRANSLATION_18": "(Thou wast) child of Adam (in heedlessness) in ignorance and oblivion (of this) Day. (Now We have removed from thee your covering) your works, that which was concealed from you in the life of the world, (and piercing is your sight this day) and it is also said that this means: your knowledge is thorough this day.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "50:22",
            "21:97",
            "70:44",
            "14:42",
            "19:39",
            "37:21",
            "83:34",
            "3:155",
            "38:53",
            "23:113"
        ],
        "BIBLE": [
            "writings:job:24:15",
            "prophets:ezekiel:38:16",
            "prophets:judges:19:17",
            "prophets:micah:7:10",
            "torah:deuteronomy:28:67",
            "prophets:i%20samuel:24:11",
            "writings:job:22:29",
            "prophets:joshua:3:7",
            "prophets:i%20samuel:26:21",
            "torah:genesis:20:16"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:3"
        ]
    }
}