{
    "VERSE": "50:23",
    "ARABIC": "وَقَالَ قَرِينُهُۥ هَٰذَا مَا لَدَىَّ عَتِيدٌ",
    "ENGLISH": {
        "TRANSLATION_0": "His inseparable comrade will say, 'This is what I have ready for you.'",
        "TRANSLATION_1": "His companion will say: \"Here is (the record) I have ready with me.\"\n",
        "TRANSLATION_2": "His companion said: “Here is he who was in my charge.”\n",
        "TRANSLATION_3": "His (angelic) companion will say, \"(Lord), the record of his deeds is with me and is all ready\".\n",
        "TRANSLATION_4": "And his accompanying angel said, “This is the record of your deeds, available with me.”\n",
        "TRANSLATION_5": "And his companion (angel) will say: \"Here is (his record) ready with me!\"\n",
        "TRANSLATION_6": "And his companions shall say: This is what is ready with me.\n",
        "TRANSLATION_7": "And his comrade shall say, 'This is what I have, made ready.'\n",
        "TRANSLATION_8": "And (unto the evil-doer) his comrade saith: This is that which I have ready (as testimony).\n",
        "TRANSLATION_9": "His companion attendant will say, \"I have here his record ready.\"\n",
        "TRANSLATION_10": "And his companion will say: this is that which with me is ready.\n",
        "TRANSLATION_11": "Then his companion [angel] will say, ‘This is what is ready with me [of his record of deeds].’\n",
        "TRANSLATION_12": "And his Companion will say: \"Here is (his Record) ready with me!\"\n",
        "TRANSLATION_13": "And his companion (angel) will say: \"Here is (this Record) ready with me!\"\n",
        "TRANSLATION_14": "And his companion will say: 'This is that which I have present'\n",
        "TRANSLATION_15": "And His escort will say, “This is what I have ready with me.”\n",
        "TRANSLATION_16": "And his companion, [the angel], will say, \"This [record] is what is with me, prepared.\"\n",
        "TRANSLATION_17": "[50:23] And his companion, the angel charged with him, will say, ‘This is what I have ready with me [as testimony]’, whereupon it will be said to Mālik [the Keeper of the Fire]:\n",
        "TRANSLATION_18": "(And (unto the evil-doer) his comrade) the angel who recorded his good deeds; and it is said: the angel who recorded his evil works (saith: This is that which I have) this is that which with you have entrusted me (ready (as testimony)).\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "50:23",
            "50:18",
            "50:27",
            "37:51",
            "7:139",
            "33:61",
            "69:26",
            "19:80",
            "70:7",
            "101:3"
        ],
        "BIBLE": [
            "prophets:jeremiah:27:4",
            "prophets:judges:13:15",
            "torah:deuteronomy:22:17",
            "prophets:zechariah:1:9",
            "prophets:jeremiah:23:38",
            "torah:exodus:19:23",
            "prophets:zechariah:6:5",
            "prophets:ii%20samuel:14:8",
            "torah:numbers:14:20",
            "prophets:malachi:3:14"
        ]
    }
}