{
    "VERSE": "50:27",
    "ARABIC": "قَالَ قَرِينُهُۥ رَبَّنَا مَآ أَطْغَيْتُهُۥ وَلَٰكِن كَانَ فِى ضَلَٰلٍۭ بَعِيدٍ",
    "ENGLISH": {
        "TRANSLATION_0": "His inseparable comrade will say, 'Our Lord, I did not make him overstep the limits. He was, in any case, far astray.'",
        "TRANSLATION_1": "His companion will say: \"O Lord, I did not lead him to wickedness, but he was himself far astray.\"\n",
        "TRANSLATION_2": "His companion said: “I did not incite him to rebel; he was far gone into error of his own accord.”\n",
        "TRANSLATION_3": "His satanic companion will say, \"Our Lord, I did not mislead him, but he himself went astray\".\n",
        "TRANSLATION_4": "His accompanying devil said, “Our Lord! I did not cause him to rebel, but he himself was in extreme error.”\n",
        "TRANSLATION_5": "His companion (devil) will say: \"Our Lord! I did not push him to transgression, but he was himself in error far astray.\"\n",
        "TRANSLATION_6": "His companion will say: Our Lord! I did not lead him into inordinacy but he himself was in a great error.\n",
        "TRANSLATION_7": "And his comrade shall say, 'Our Lord, I made him not insolent, but he was in far error.'\n",
        "TRANSLATION_8": "His comrade saith: Our Lord! I did not cause him to rebel, but he was (himself) far gone in error.\n",
        "TRANSLATION_9": "and his associate [Satan] will say, \"Lord, I did not make him transgress, he had already gone far astray himself.\"\n",
        "TRANSLATION_10": "His companion will say: O our Lord! caused him not to transgress but he was himself in error far off.\n",
        "TRANSLATION_11": "His companion [devil] will say, ‘Our Lord! I did not incite him to rebel [against You], but he was [himself] in extreme error.’\n",
        "TRANSLATION_12": "His Companion will say: \"Our Lord! I did not make him transgress, but he was (himself) far astray.\"\n",
        "TRANSLATION_13": "His companion (Satan devil)] will say: \"Our Lord! I did not push him to transgress, (in disbelief, oppression, and evil deeds) but he was himself in error far astray.\"\n",
        "TRANSLATION_14": "And his companion shall say: 'Our Lord, I did not make him insolent, he was far astray'\n",
        "TRANSLATION_15": "His escort will say, “Our Lord, I did not make him rebel, but he was far astray.”\n",
        "TRANSLATION_16": "His [devil] companion will say, \"Our Lord, I did not make him transgress, but he [himself] was in extreme error.\"\n",
        "TRANSLATION_17": "[50:27] And his companion, Satan, will say, ‘Our Lord! I did not make him a rebel, I did [not] lead him astray, but he [himself] was in extreme error’, and so when I invited him [to disobedience] he heeded my call — for this one had said, ‘he [Satan] made me a rebel’, by way of his [Satan’s] invitation to him.\n",
        "TRANSLATION_18": "(His comrade) the angel who recorded his evil deeds (saith: Our Lord! I did not cause him to rebel) \"I did not hasten to record his evil deeds nor did I record that which he has never said or done\"; this will be said when the disbeliever will claim that the angel hastened to write his evil deeds and recorded that which he never said or did. it is also said that his comrade is his devil who will plead with Allah that he did not cause him to rebel or err (but be was (himself) far gone in error) far from the Truth and guidance.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "50:27",
            "22:12",
            "11:83",
            "93:3",
            "23:42",
            "23:31",
            "17:17",
            "56:85",
            "50:23",
            "28:85"
        ],
        "BIBLE": [
            "writings:psalms:32:5",
            "torah:exodus:32:30",
            "prophets:ii%20samuel:3:21",
            "prophets:ii%20kings:9:21",
            "prophets:ii%20kings:3:16",
            "prophets:joshua:9:6",
            "writings:daniel:9:22",
            "torah:exodus:33:19",
            "prophets:isaiah:63:7",
            "torah:genesis:2:18"
        ]
    }
}