{
    "VERSE": "50:29",
    "ARABIC": "مَا يُبَدَّلُ ٱلْقَوْلُ لَدَىَّ وَمَآ أَنَا۠ بِظَلَّٰمٍ لِّلْعَبِيدِ",
    "ENGLISH": {
        "TRANSLATION_0": "My Word, once given, is not subject to change and I do not wrong My slaves.'",
        "TRANSLATION_1": "There is no changing of My word, nor am I unjust to My creatures.\"\n",
        "TRANSLATION_2": "My Word is not changed; and never do I inflict the least wrong upon My servants.”\n",
        "TRANSLATION_3": "No word is to be exchanged in My presence. I am not unjust to My servants\".\n",
        "TRANSLATION_4": "“With Me, the decree does not change, and nor do I oppress the bondmen.”\n",
        "TRANSLATION_5": "The sentence that comes from Me cannot be changed, and I am not unjust to the servants.\"\n",
        "TRANSLATION_6": "My word shall not be changed, nor am I in the least unjust to the servants.\n",
        "TRANSLATION_7": "The Word is not changed with Me; I wrong not My servants.'\n",
        "TRANSLATION_8": "The sentence that cometh from Me cannot be changed, and I am in no wise a tyrant unto the slaves.\n",
        "TRANSLATION_9": "and My word shall not be changed, nor am I unjust to My servants.\"\n",
        "TRANSLATION_10": "The Word will not be changed in My presence, nor am an oppressor at all Unto My bondmen.\n",
        "TRANSLATION_11": "The word [of judgement] is unalterable with Me, and I am not tyrannical to My servants.’\n",
        "TRANSLATION_12": "The Word changes not before Me, and I do not the least injustice to My Servants.\"\n",
        "TRANSLATION_13": "The Sentence that comes from Me cannot be changed, and I am not unjust (to the least) to the slaves.\"\n",
        "TRANSLATION_14": "The Word cannot be changed with Me; I do not wrong My worshipers'\n",
        "TRANSLATION_15": "The decree from Me will not be changed, and I am not unjust to the servants.”\n",
        "TRANSLATION_16": "The word will not be changed with Me, and never will I be unjust to the servants.\"\n",
        "TRANSLATION_17": "[50:29] The word [that comes] from Me, in this respect, cannot be altered, and I am not unjust to servants’, that I should chastise them without any guilt [on their part] (zallām means dhū zulm, ‘one of injustice’, because of His words, There will be no injustice today [Q. 40:17]);\n",
        "TRANSLATION_18": "(The sentence that cometh from Me cannot be changed) My words cannot be changed through lying; and it is also said that this means: My decree concerning My salves will not be changed this Day; and it is also said that this means: words cannot be twisted in My presence, (and I am in nowise a tyrant unto the slaves) such that I would punish them without them having committed a crime.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "50:29",
            "41:46",
            "3:182",
            "22:10",
            "8:51",
            "37:171",
            "89:29",
            "26:114",
            "6:82",
            "40:31"
        ],
        "BIBLE": [
            "torah:deuteronomy:17:9",
            "torah:numbers:24:14",
            "prophets:jeremiah:51:47",
            "prophets:haggai:2:20",
            "prophets:ezekiel:24:1",
            "prophets:i%20kings:20:40",
            "torah:numbers:22:38",
            "prophets:haggai:2:1",
            "prophets:jeremiah:49:34",
            "prophets:joshua:1:18"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:1"
        ]
    }
}