{
    "VERSE": "50:30",
    "ARABIC": "يَوْمَ نَقُولُ لِجَهَنَّمَ هَلِ ٱمْتَلَأْتِ وَتَقُولُ هَلْ مِن مَّزِيدٍ",
    "ENGLISH": {
        "TRANSLATION_0": "On the Day He says to Hell, 'Are you full?' it will ask, 'Are there no more to come?'",
        "TRANSLATION_1": "We shall ask Hell that day: \"Are you full?\" It will answer: \"Are there still more?\"\n",
        "TRANSLATION_2": "On that Day We shall ask Hell: “Are you full?” And it will reply: “Are there any more?”\n",
        "TRANSLATION_3": "On that day We shall ask hell, \"Are you full?\" It will say, \"Are there any more?\"\n",
        "TRANSLATION_4": "The day when We will ask hell, “Are you filled up?” and it will answer, “Are there some more?”\n",
        "TRANSLATION_5": "On the Day when We will say to Hell: \"Are you filled\" It will say: \"Are there any more\"\n",
        "TRANSLATION_6": "On the day that We will say to hell: Are you filled up? And it will say: Are there any more?\n",
        "TRANSLATION_7": "Upon the day We shall say unto Gehenna, 'Art thou filled?' And it shall say, 'Are there any more to come?'\n",
        "TRANSLATION_8": "On the day when We say unto hell: Art thou filled? and it saith: Can there be more to come?\n",
        "TRANSLATION_9": "On that Day, We shall ask Hell, \"Are you now full?\" Hell will answer, \"Are there any more?\"\n",
        "TRANSLATION_10": "Mention the Day whereon We shall say Unto the Hell: art thou filled? and it will say: is there yet any addition?\n",
        "TRANSLATION_11": "The day when We shall say to hell, ‘Are you full?’ It will say, ‘Is there any more?’\n",
        "TRANSLATION_12": "One Day We will ask Hell, \"Art thou filled to the full?\" It will say, \"Are there any more (to come)?\"\n",
        "TRANSLATION_13": "On the Day when We will say to Hell: \"Are you filled?\" It will say: \"Are there any more (to come)?\"\n",
        "TRANSLATION_14": "On that Day We shall ask Gehenna: 'Are you full' And it will answer: 'Are there any more'\n",
        "TRANSLATION_15": "On the Day when We will say to Hell, “Are you full?” And it will say, “Are there any more?”\n",
        "TRANSLATION_16": "On the Day We will say to Hell, \"Have you been filled?\" and it will say, \"Are there some more,\"\n",
        "TRANSLATION_17": "[50:30] on the day (yawma is in the accusative because of zallām, ‘unjust’) when We will say (naqūlu, may also be read yaqūlu, ‘He will say’) to Hell, ‘Are you [now] full?’ (this interrogative is for confirmation of His promise to fill it [with mankind and jinn]), and it will say, by way of an interrogative, such as a question: ‘Are there any more?’: that is to say, ‘I [Hell] only have capacity for what I have been filled with’, in other words, ‘I am full!’.\n",
        "TRANSLATION_18": "(On the day) this is the Day of Judgement (when We say unto hell: Art thou filled) as I have promised? (and it saith: Can there be more to come?) and it will have more; and it is also said that hell will say: I am quite full, I do not have room even for one extra man. 607\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "50:30",
            "77:12",
            "26:87",
            "36:59",
            "70:42",
            "51:60",
            "28:65",
            "43:83",
            "7:14",
            "40:33"
        ],
        "BIBLE": [
            "torah:numbers:24:14",
            "prophets:ii%20samuel:24:13",
            "prophets:isaiah:14:10",
            "prophets:jeremiah:3:16",
            "writings:psalms:118:21",
            "prophets:i%20kings:12:5",
            "writings:ruth:2:11",
            "prophets:jeremiah:13:12",
            "prophets:ii%20kings:9:19",
            "prophets:jeremiah:2:31"
        ]
    }
}