{
    "VERSE": "50:31",
    "ARABIC": "وَأُزْلِفَتِ ٱلْجَنَّةُ لِلْمُتَّقِينَ غَيْرَ بَعِيدٍ",
    "ENGLISH": {
        "TRANSLATION_0": "And the Garden will be brought up close to those with taqwa, not far away:",
        "TRANSLATION_1": "And Paradise will be brought near, not far from those who took heed for themselves and feared God.\n",
        "TRANSLATION_2": "And when Paradise shall be brought close to the God-fearing, and will no longer be far away,\n",
        "TRANSLATION_3": "Paradise will be brought near for the pious ones\n",
        "TRANSLATION_4": "And Paradise will be brought close to the pious, not far away from them.\n",
        "TRANSLATION_5": "And Paradise will be Uzlifat to those who had Taqwa, not far off.\n",
        "TRANSLATION_6": "And the garden shall be brought near to those who guard (against evil), not far off:\n",
        "TRANSLATION_7": "And Paradise shall be brought forward to the godfearing, not afar:\n",
        "TRANSLATION_8": "And the Garden is brought nigh for those who kept from evil, no longer distant.\n",
        "TRANSLATION_9": "Paradise will be brought near to the righteous and will no longer be far away.\n",
        "TRANSLATION_10": "And brought nigh will be the Garden Unto the God-fearing, not far-off.\n",
        "TRANSLATION_11": "And paradise will be brought near for the Godwary, it will not be distant [any more]:\n",
        "TRANSLATION_12": "And the Garden will be brought nigh to the Righteous,- no more a thing distant.\n",
        "TRANSLATION_13": "And Paradise will be brought near to the Muttaqun (pious - see V. 2:2) not far off.\n",
        "TRANSLATION_14": "And Paradise, which is not far away, shall be brought closer to those who were cautious.\n",
        "TRANSLATION_15": "And Paradise will be brought closer to the pious, not far away.\n",
        "TRANSLATION_16": "And Paradise will be brought near to the righteous, not far,\n",
        "TRANSLATION_17": "[50:31] And Paradise will be brought near for the God-fearing, to a place, not far [anymore], from them, and so they see it, whereupon it will be said to them:\n",
        "TRANSLATION_18": "(And the Garden is brought nigh for those who kept from evil) those who warded off disbelief, idolatry and indecencies, (no longer distant) from them.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "50:31",
            "26:90",
            "47:6",
            "27:22",
            "84:25",
            "81:13",
            "41:8",
            "15:45",
            "51:15",
            "4:115"
        ],
        "BIBLE": [
            "writings:ecclesiastes:3:14",
            "prophets:ii%20kings:2:10",
            "prophets:isaiah:8:10",
            "prophets:zephaniah:3:15",
            "torah:genesis:33:11",
            "writings:psalms:16:1",
            "prophets:ezekiel:17:13",
            "writings:ii%20chronicles:30:23",
            "writings:i%20chronicles:17:13",
            "prophets:i%20samuel:5:1"
        ]
    }
}