{
    "VERSE": "50:32",
    "ARABIC": "هَٰذَا مَا تُوعَدُونَ لِكُلِّ أَوَّابٍ حَفِيظٍ",
    "ENGLISH": {
        "TRANSLATION_0": "'This is what you were promised. It is for every careful penitent:",
        "TRANSLATION_1": "This is what you had been promised,\" (will be said) to every penitent who remembered (his duty),\n",
        "TRANSLATION_2": "it will be said: “This is what you were promised, a promise made to everyone who turned much (to Allah) and was watchful of his conduct,\n",
        "TRANSLATION_3": "(and they will be told), \"This is what you were promised. It is for everyone who turned in repentance to God, kept his promise,\n",
        "TRANSLATION_4": "This is what you are promised – for every repenting, careful person.\n",
        "TRANSLATION_5": "(It will be said): \"This is what you were promised -- (it is) for those returning in sincere repentance, and Hafiz.\"\n",
        "TRANSLATION_6": "This is what you were promised, (it is) for every one who turns frequently (to Allah), keeps (His limits);\n",
        "TRANSLATION_7": "This is that you were promised; it is for every mindful penitent.'\n",
        "TRANSLATION_8": "(And it is said): This is that which ye were promised. (It is) for every penitent and heedful one,\n",
        "TRANSLATION_9": "This is what you were promised -- this is for everyone who often turned to God and kept Him in mind,\n",
        "TRANSLATION_10": "This is that which ye were promised: for every oft- returning heedful one.\n",
        "TRANSLATION_11": "‘This is what you were promised. [It is] for every penitent and dutiful [servant]\n",
        "TRANSLATION_12": "(A voice will say:) \"This is what was promised for you,- for every one who turned (to Allah) in sincere repentance, who kept (His Law),\n",
        "TRANSLATION_13": "(It will be said): \"This is what you were promised, - (it is) for those oft-returning (to Allah) in sincere repentance, and those who preserve their covenant with Allah (by obeying Him in all what He has ordered, and worship none but Allah Alone, i.e. follow Allah's Religion, Islamic Monotheism).\n",
        "TRANSLATION_14": "(It shall be said to them): 'This is that you were promised. It is for every heeding penitent.\n",
        "TRANSLATION_15": "“This is what you were promised—for every careful penitent.\n",
        "TRANSLATION_16": "[It will be said], \"This is what you were promised - for every returner [to Allah] and keeper [of His covenant]\n",
        "TRANSLATION_17": "[50:32]   ‘This, that you see, is what you were promised (read tū‘adūna, or [third person plural] yū‘adūna, ‘they were promised’), in the world (and [what follows] substitutes for li’l-muttaqīna, ‘for the God-fearing’) — [it is] for every penitent one, [for every] person reverting [after sin] to obedience of God, who is mindful, mindful of the bounds [of God’s religion],\n",
        "TRANSLATION_18": "((And it is said): That) reward and honour (is that which ye were promised) in the life of the world. ((It is) for every penitent) who turns to Allah and His obedience (and heedful one) observant of Allah's command in his private moment; and it is also said: in his prayers,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "50:32",
            "38:19",
            "6:67",
            "17:20",
            "55:26",
            "21:99",
            "23:36",
            "45:28",
            "83:12",
            "78:22"
        ],
        "BIBLE": [
            "prophets:joshua:22:2",
            "prophets:i%20kings:11:11",
            "prophets:malachi:3:7",
            "writings:daniel:9:11",
            "writings:ruth:1:16",
            "torah:deuteronomy:30:10",
            "writings:psalms:78:10",
            "prophets:i%20samuel:24:2",
            "prophets:i%20samuel:12:20",
            "torah:numbers:14:43"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:5:2",
            
            "Sefer%20Yetzirah:2:5"
        ]
    }
}