{
    "VERSE": "50:34",
    "ARABIC": "ٱدْخُلُوهَا بِسَلَٰمٍ ذَٰلِكَ يَوْمُ ٱلْخُلُودِ",
    "ENGLISH": {
        "TRANSLATION_0": "Enter it in peace. This is the Day of Timeless Eternity.'",
        "TRANSLATION_1": "Enter it in peace. This is the day of life abiding.\"\n",
        "TRANSLATION_2": "Enter this Paradise in peace.” That will be the Day of Eternity.\n",
        "TRANSLATION_3": "(They will be told), \"Enter Paradise in peace and, therein, you will live forever\".\n",
        "TRANSLATION_4": "It will be said to him, “Enter it in peace; this is the day of eternity.”\n",
        "TRANSLATION_5": "Enter you therein in peace and security -- this is a Day of eternal life!\"\n",
        "TRANSLATION_6": "Enter it in peace, that is the day of abiding.\n",
        "TRANSLATION_7": "Enter it in peace! This is the Day of Eternity.'\n",
        "TRANSLATION_8": "Enter it in peace. This is the day of immortality.\n",
        "TRANSLATION_9": "so enter it in peace. This is the Day of everlasting life.\n",
        "TRANSLATION_10": "Enter it in peace. This is the Day of Abidence.\n",
        "TRANSLATION_11": "Enter it in peace! This is the day of immortality.’\n",
        "TRANSLATION_12": "Enter ye therein in Peace and Security; this is a Day of Eternal Life!\"\n",
        "TRANSLATION_13": "Enter you therein in peace and security; this is a Day of eternal life!\"\n",
        "TRANSLATION_14": "Enter it in peace. This is the Day of Eternity'\n",
        "TRANSLATION_15": "Enter it in peace. This is the Day of Eternity.”\n",
        "TRANSLATION_16": "Enter it in peace. This is the Day of Eternity.\"\n",
        "TRANSLATION_17": "[50:34] It will also be said to the God-fearing: ‘Enter it in peace!, that is to say, secure from every fear, or [it means enter it] with a greeting, that is to say, greet [yourselves] and enter. That, day in which this entry takes place, is the day of immortality’, [of] everlastingness in Paradise.\n",
        "TRANSLATION_18": "Allah will say to them: (Enter it) i.e. Paradise (in peace) in safety from Allah's chastisement. (This is the day of immortality) the day when the dwellers of Paradise will enter Paradise to abide therein for eternity.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "50:34",
            "36:64",
            "15:46",
            "19:33",
            "32:14",
            "38:53",
            "37:21",
            "19:15",
            "36:59",
            "79:6"
        ],
        "BIBLE": [
            "writings:proverbs:3:2",
            "writings:psalms:30:7",
            "torah:numbers:22:30",
            "prophets:ii%20samuel:15:21",
            "torah:genesis:47:8",
            "writings:psalms:2:7",
            "torah:genesis:6:3",
            "prophets:ii%20kings:7:9",
            "prophets:jonah:3:4",
            "prophets:ii%20kings:20:19"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:8",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:11"
        ]
    }
}