{
    "VERSE": "50:35",
    "ARABIC": "لَهُم مَّا يَشَآءُونَ فِيهَا وَلَدَيْنَا مَزِيدٌ",
    "ENGLISH": {
        "TRANSLATION_0": "They will have there everything they want and with Us there is still more.",
        "TRANSLATION_1": "Theirs will be whatsoever they wish: And with Us there is more.\n",
        "TRANSLATION_2": "Therein they shall get whatever they desire; and with Us there is even more.\n",
        "TRANSLATION_3": "They will have therein whatever they want and will receive from Us more rewards\n",
        "TRANSLATION_4": "In it for them is all that they may desire, and with Us is more than it.\n",
        "TRANSLATION_5": "There they will have all that they desire -- and We have more.\n",
        "TRANSLATION_6": "They have therein what they wish and with Us is more yet.\n",
        "TRANSLATION_7": "Therein they shall have whatever they will; and with Us there is yet more.\n",
        "TRANSLATION_8": "There they have all that they desire, and there is more with Us.\n",
        "TRANSLATION_9": "There they shall have all that they desire, and there is even more with Us.\n",
        "TRANSLATION_10": "Theirs therein will be whatsoever they list; and with Us will be yet more.\n",
        "TRANSLATION_11": "There they will have whatever they wish, and with Us there is yet more.\n",
        "TRANSLATION_12": "There will be for them therein all that they wish,- and more besides in Our Presence.\n",
        "TRANSLATION_13": "There they will have all that they desire, and We have more (for them, i.e. a glance at the All-Mighty, All-Majestic).\n",
        "TRANSLATION_14": "There they have all that they desire, and with Us is much more.\n",
        "TRANSLATION_15": "Therein they will have whatever they desire—and We have even more.\n",
        "TRANSLATION_16": "They will have whatever they wish therein, and with Us is more.\n",
        "TRANSLATION_17": "[50:35] Therein they will have whatever they wish; and with Us there is yet more, as extra for what they did and for what they will request.\n",
        "TRANSLATION_18": "(There) in Paradise (they have all that they desire, and there is more with Us) i.e. beholding Allah's Countenance; and it is said that this means: in every hour and in every day, they have with Us an increase in honour and reward.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "50:35",
            "84:4",
            "33:61",
            "25:76",
            "36:57",
            "19:72",
            "17:18",
            "26:211",
            "94:4",
            "42:35"
        ],
        "BIBLE": [
            "writings:daniel:2:6",
            "writings:ecclesiastes:8:3",
            "torah:exodus:33:14",
            "writings:proverbs:4:10",
            "writings:psalms:52:11",
            "torah:numbers:34:13",
            "writings:psalms:138:1",
            "torah:numbers:18:28",
            "writings:daniel:7:18",
            "writings:job:27:13"
        ]
    }
}