{
    "VERSE": "50:37",
    "ARABIC": "إِنَّ فِى ذَٰلِكَ لَذِكْرَىٰ لِمَن كَانَ لَهُۥ قَلْبٌ أَوْ أَلْقَى ٱلسَّمْعَ وَهُوَ شَهِيدٌ",
    "ENGLISH": {
        "TRANSLATION_0": "There is a reminder in that for anyone who has a heart, or who listens well, having seen the evidence.",
        "TRANSLATION_1": "Surely there is a reminder in this for whosoever has a heart (to feel), or takes heed.\n",
        "TRANSLATION_2": "Verily there is a lesson in this for everyone who has a (sound) heart and who listens with an attentive mind.\n",
        "TRANSLATION_3": "This is a reminder for everyone who understands, listens, and sees.\n",
        "TRANSLATION_4": "Indeed in this is an advice for anyone who keeps a heart, or listens attentively.\n",
        "TRANSLATION_5": "Verily, therein is indeed a reminder for him who has a heart or gives ear while he is heedful.\n",
        "TRANSLATION_6": "Most surely there is a reminder in this for him who has a heart or he gives ear and is a witness.\n",
        "TRANSLATION_7": "Surely in that there is a reminder to him who has a heart, or will give ear with a present mind.\n",
        "TRANSLATION_8": "Lo! therein verily is a reminder for him who hath a heart, or giveth ear with full intelligence.\n",
        "TRANSLATION_9": "There is truly a reminder in this for whoever has a heart, whoever listens attentively.\n",
        "TRANSLATION_10": "Verily herein is an admonition Unto him who hath a heart, or giveth ear while he is heedful.\n",
        "TRANSLATION_11": "There is indeed an admonition in that for one who has a heart, or gives ear, being attentive.\n",
        "TRANSLATION_12": "Verily in this is a Message for any that has a heart and understanding or who gives ear and earnestly witnesses (the truth).\n",
        "TRANSLATION_13": "Verily, therein is indeed a reminder for him who has a heart or gives ear while he is heedful.\n",
        "TRANSLATION_14": "Surely, in this there is a Reminder for he who has a heart or listens attentively while witnessing.\n",
        "TRANSLATION_15": "In that is a reminder for whoever possesses a heart, or cares to listen and witness.\n",
        "TRANSLATION_16": "Indeed in that is a reminder for whoever has a heart or who listens while he is present [in mind].\n",
        "TRANSLATION_17": "[50:37] Assuredly there is in that, which is mentioned, a reminder, an admonition, for him who has a heart, a mind, or gives ear, [or] listens to admonitions, in [full] witness, present in heart [and mind].\n",
        "TRANSLATION_18": "(Lo! Therein) in that which was done with them (verily is a reminder) for your folk (for him who hath a heart) a living heart, (or giveth ear) or listens to the Qur'an (with full intelligence) with focus and not absentmindedly.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "50:37",
            "16:108",
            "100:7",
            "26:212",
            "15:12",
            "26:200",
            "79:26",
            "22:32",
            "15:18",
            "22:53"
        ],
        "BIBLE": [
            "prophets:ezekiel:18:13",
            "writings:psalms:119:34",
            "prophets:i%20kings:3:12",
            "torah:genesis:31:9",
            "torah:deuteronomy:29:3",
            "writings:job:38:36",
            "prophets:i%20kings:5:9",
            "torah:numbers:8:16",
            "torah:deuteronomy:3:12",
            "writings:job:29:21"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:3:2"
        ]
    }
}