{
    "VERSE": "50:38",
    "ARABIC": "وَلَقَدْ خَلَقْنَا ٱلسَّمَٰوَٰتِ وَٱلْأَرْضَ وَمَا بَيْنَهُمَا فِى سِتَّةِ أَيَّامٍ وَمَا مَسَّنَا مِن لُّغُوبٍ",
    "ENGLISH": {
        "TRANSLATION_0": "We created the heavens and the earth, and everything between them, in six days and We were not affected by fatigue.",
        "TRANSLATION_1": "We created the heavens and the earth and all that lies between them, in six spans, and no weariness came upon Us.\n",
        "TRANSLATION_2": "We created the heavens and the earth and all that is between them in six days, and weariness did not even touch Us.\n",
        "TRANSLATION_3": "We created the heavens, the earth, and all that is between them in six days without experiencing any fatigue.\n",
        "TRANSLATION_4": "And We have indeed created the heavens and the earth, and all what is between them, in six days; and fatigue did not even approach Us.\n",
        "TRANSLATION_5": "And indeed We created the heavens and the earth and all between them in six Days and nothing of fatigue touched Us.\n",
        "TRANSLATION_6": "And certainly We created the heavens and the earth and what is between them in six periods and there touched Us not any fatigue.\n",
        "TRANSLATION_7": "We created the heavens and the earth, and what between them is, in six days, and no weariness touched Us.\n",
        "TRANSLATION_8": "And verily We created the heavens and the earth, and all that is between them, in six Days, and naught of weariness touched Us.\n",
        "TRANSLATION_9": "We created the heavens, the earth, and everything between them in six days [periods] nor were We ever wearied.\n",
        "TRANSLATION_10": "And assuredly We created the heavens and the earth and whatsoever is in between the twain in six days, and there touched Us naught of weariness.\n",
        "TRANSLATION_11": "Certainly We created the heavens and the earth, and whatever is between them, in six days, and any fatigue did not touch Us.\n",
        "TRANSLATION_12": "We created the heavens and the earth and all between them in Six Days, nor did any sense of weariness touch Us.\n",
        "TRANSLATION_13": "And indeed We created the heavens and the earth and all between them in six Days and nothing of fatigue touched Us.\n",
        "TRANSLATION_14": "In six days We created the heavens and the earth and all that is between them and no weariness touched Us!\n",
        "TRANSLATION_15": "We created the heavens and the earth and what is between them in six days, and no fatigue touched Us.\n",
        "TRANSLATION_16": "And We did certainly create the heavens and earth and what is between them in six days, and there touched Us no weariness.\n",
        "TRANSLATION_17": "[50:38] And verily We created the heavens and the earth, and all that is between them, in six days, the first of which was Sunday and the last of which was Friday, and no weariness, no fatigue, touched Us: this was revealed as a refutation of the Jews’ claim that God rested on the Saturday and lay down upon the Throne. The preclusion of weariness in His case is [absolute] on account of His transcending of the attributes of creatures and the non-existence of any contiguity between Him and other [beings]: His command, when He wills a thing, is just to say to it ‘Be’, and it is [Q. 36:82].\n",
        "TRANSLATION_18": "(And verily We created the heavens and the earth, and all that is between them) of created beings and marvels, (in six Days) of the days of the beginning of the life of the world, each day the equivalent of 1,000 years of present days, the first day being Sunday and the last Friday, (and naught of weariness touched Us) We were not tired as claimed by the Jews who said: when Allah finished the creation of the heavens and earth, he put one leg on the other and rested on Saturday. The enemies of Allah have lied against Allah.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "50:38",
            "21:16",
            "44:38",
            "25:59",
            "26:24",
            "44:7",
            "20:6",
            "32:4",
            "46:3",
            "38:27"
        ],
        "BIBLE": [
            "torah:deuteronomy:4:32",
            "prophets:jeremiah:16:19",
            "torah:genesis:7:10",
            "torah:genesis:2:4",
            "writings:daniel:8:5",
            "prophets:ezekiel:22:4",
            "torah:genesis:50:10",
            "writings:ezra:8:32",
            "prophets:isaiah:13:5",
            "prophets:jeremiah:33:25"
        ]
    }
}