{
    "VERSE": "50:39",
    "ARABIC": "فَٱصْبِرْ عَلَىٰ مَا يَقُولُونَ وَسَبِّحْ بِحَمْدِ رَبِّكَ قَبْلَ طُلُوعِ ٱلشَّمْسِ وَقَبْلَ ٱلْغُرُوبِ",
    "ENGLISH": {
        "TRANSLATION_0": "So be patient in the face of what they say and glorify your Lord with praise before the rising of the sun and before it sets.",
        "TRANSLATION_1": "So you bear with patience what they say, and sing the praises of your Lord before the rising of the sun and its setting,\n",
        "TRANSLATION_2": "Hence bear with patience whatever they say, and celebrate your Lord's glory before the rising of the sun and before its setting;\n",
        "TRANSLATION_3": "(Muhammad), exercise patience against what they say. Glorify your Lord with His praise before sunrise and sunset.\n",
        "TRANSLATION_4": "Therefore (O dear prophet Mohammed – peace and blessings be upon him) patiently bear upon what they say, and praising your Lord say His Purity before the sun rises and before the sun sets.\n",
        "TRANSLATION_5": "So bear with patience all that they say, and glorify the praises of your Lord, before the rising of the sun and before (its) setting.\n",
        "TRANSLATION_6": "Therefore be patient of what they say, and sing the praise of your Lord before the rising of the sun and before the setting.\n",
        "TRANSLATION_7": "So be thou patient under what they say, and proclaim thy Lord's praise before the rising of the sun, and before its setting,\n",
        "TRANSLATION_8": "Therefor (O Muhammad) bear with what they say, and hymn the praise of thy Lord before the rising and before the setting of the sun;\n",
        "TRANSLATION_9": "So bear with patience what they say, and glorify your Lord with His praise, before the rising and before the setting of the sun;\n",
        "TRANSLATION_10": "So bear thou patiently with that which they say, and hallow the praise of thine Lord before the rising of the sun and before its setting.\n",
        "TRANSLATION_11": "So be patient at what they say, and celebrate the praise of your Lord before the rising of the sun and before the sunset,\n",
        "TRANSLATION_12": "Bear, then, with patience, all that they say, and celebrate the praises of thy Lord, before the rising of the sun and before (its) setting.\n",
        "TRANSLATION_13": "So bear with patience (O Muhammad SAW) all that they say, and glorify the Praises of your Lord, before the rising of the sun and before (its) setting (i.e. the Fajr, Zuhr, and 'Asr prayers).\n",
        "TRANSLATION_14": "Bear then with patience what they say. Exalt with the praise of your Lord before sunrise and before sunset.\n",
        "TRANSLATION_15": "So endure what they say, and proclaim the praises of your Lord before the rising of the sun, and before sunset.\n",
        "TRANSLATION_16": "So be patient, [O Muhammad], over what they say and exalt [Allah] with praise of your Lord before the rising of the sun and before its setting,\n",
        "TRANSLATION_17": "[50:39] So endure [patiently], addressing the Prophet (s), what they, the Jews and others, say, in the way of [anthropomorphic] comparisons and denials, and glorify with praise of your Lord, perform prayers with praise [of Him], before the rising of the sun, in other words, [perform] the morning prayer, and before the sunset, that is to say, [perform] both the midday and the afternoon prayers;\n",
        "TRANSLATION_18": "(Therefore) O Muhammad (bear with what they say) bear with the lies of the Jews; it is also said this means: bear with what the deriders say; these are five people whom we have already mentioned somewhere else: (and hymn the praise of thy Lord) pray by the command of your Lord (before the rising) this is the morning prayer (and before the setting of the sun) these are the Zuhr and 'Asr prayers;\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "50:39",
            "20:130",
            "15:98",
            "28:53",
            "110:3",
            "3:53",
            "38:16",
            "51:16",
            "52:18",
            "32:15"
        ],
        "BIBLE": [
            "writings:psalms:21:14",
            "writings:psalms:30:13",
            "writings:nehemiah:9:5",
            "prophets:jeremiah:3:12",
            "prophets:jeremiah:14:13",
            "writings:daniel:10:19",
            "writings:i%20chronicles:29:10",
            "torah:deuteronomy:33:23",
            "prophets:judges:6:23",
            "prophets:ii%20samuel:22:50"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:10"
        ]
    }
}