{
    "VERSE": "50:4",
    "ARABIC": "قَدْ عَلِمْنَا مَا تَنقُصُ ٱلْأَرْضُ مِنْهُمْ وَعِندَنَا كِتَٰبٌ حَفِيظٌۢ",
    "ENGLISH": {
        "TRANSLATION_0": "We know exactly how the earth eats them away. We possess an all-preserving Book.",
        "TRANSLATION_1": "We know what the earth consumes of them, for We have the Book that preserves everything.\n",
        "TRANSLATION_2": "(Thus do they imagine, although) We know well what the earth takes away from them. With Us is a Record that preserves everything.\n",
        "TRANSLATION_3": "We already know how much of them (of their bodies) the earth will consume. With Us there is a Book that contains all records.\n",
        "TRANSLATION_4": "We know all what the earth decreases from them; and with Us is a Book that retains.\n",
        "TRANSLATION_5": "We know that which the earth takes of them, and with Us is a Book preserved.\n",
        "TRANSLATION_6": "We know indeed what the earth diminishes of them, and with Us is a writing that preserves.\n",
        "TRANSLATION_7": "We know what the earth diminishes of them; with Us is a book recording.\n",
        "TRANSLATION_8": "We know that which the earth taketh of them, and with Us is a recording Book.\n",
        "TRANSLATION_9": "We know very well what the earth takes away from them: We hold a book which records all things.\n",
        "TRANSLATION_10": "Surely We know that which the earth consumeth of them, and with Us is, Book preserved.\n",
        "TRANSLATION_11": "We know what the earth diminishes from them, and with Us is a preserving Book.\n",
        "TRANSLATION_12": "We already know how much of them the earth takes away: With Us is a record guarding (the full account).\n",
        "TRANSLATION_13": "We know that which the earth takes of them (their dead bodies), and with Us is a Book preserved (i.e. the Book of Decrees).\n",
        "TRANSLATION_14": "We know all that the earth takes away of them, and a Book of Records is with Us.\n",
        "TRANSLATION_15": "We know what the earth consumes of them, and with Us is a comprehensive book.\n",
        "TRANSLATION_16": "We know what the earth diminishes of them, and with Us is a retaining record.\n",
        "TRANSLATION_17": "[50:4] We know what the earth diminishes, consumes, of them, and with Us is a preserving Book, namely, the Preserved Tablet (al-lawh al-mahfūz), which contains everything that has been ordained [by God].\n",
        "TRANSLATION_18": "Allah, Exalted is He, said: (We know that which the earth taketh of them) We know that which the earth devours of their flesh after they die and that which it leaves, (and with Us is a recording Book) and with Us is a Book preserved from Satan. This is the Guarded Tablet wherein is recorded their death, stay in the grave and resurrection on the Day of Judgement.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "50:4",
            "13:39",
            "21:19",
            "2:89",
            "28:6",
            "98:4",
            "91:6",
            "37:117",
            "27:75",
            "17:90"
        ],
        "BIBLE": [
            "writings:proverbs:20:16",
            "writings:proverbs:27:13",
            "prophets:jeremiah:6:11",
            "writings:ecclesiastes:3:14",
            "prophets:isaiah:64:11",
            "writings:daniel:7:26",
            "prophets:jeremiah:50:33",
            "prophets:jeremiah:51:41",
            "writings:ii%20chronicles:15:8",
            "prophets:ii%20samuel:17:19"
        ]
    }
}