{
    "VERSE": "50:42",
    "ARABIC": "يَوْمَ يَسْمَعُونَ ٱلصَّيْحَةَ بِٱلْحَقِّ ذَٰلِكَ يَوْمُ ٱلْخُرُوجِ",
    "ENGLISH": {
        "TRANSLATION_0": "The Day they hear the Blast in truth, that is the Day of Emergence.",
        "TRANSLATION_1": "The day they actually hear the blast, will be the Day of rising of the dead.\n",
        "TRANSLATION_2": "the Day when they shall hear the Blast in truth. That will be the Day (for the dead) to come forth.\n",
        "TRANSLATION_3": "On that day they will certainly hear the sound of the trumpet and that will be the Day of Resurrection.\n",
        "TRANSLATION_4": "The day when all will hear the Scream with the truth; this is the day of coming out of the graves.\n",
        "TRANSLATION_5": "The Day when they will hear As-Sayhah in truth, that will be the Day of coming out.\n",
        "TRANSLATION_6": "The day when they shall hear the cry in truth; that is the day of coming forth.\n",
        "TRANSLATION_7": "On the day they hear the Cry in truth, that is the day of coming forth.\n",
        "TRANSLATION_8": "The day when they will hear the (Awful) Cry in truth. That is the day of coming forth (from the graves).\n",
        "TRANSLATION_9": "The Day when men will hear the fateful cry, they will rise up [from their graves].\n",
        "TRANSLATION_10": "The Day whereon they will surely hear the shout - that is the Day of coming forth.\n",
        "TRANSLATION_11": "the day when they hear the Cry in all truth. That is the day of rising [from the dead].\n",
        "TRANSLATION_12": "The Day when they will hear a (mighty) Blast in (very) truth: that will be the Day of Resurrection.\n",
        "TRANSLATION_13": "The Day when they will hear As-Saihah (shout, etc.) in truth, that will be the Day of coming out (from the graves i.e. the Day of Resurrection).\n",
        "TRANSLATION_14": "On the Day when they will hear the Shout, in truth that Day they will emerge.\n",
        "TRANSLATION_15": "The Day when they will hear the Shout in all truth. That is the Day of Emergence.\n",
        "TRANSLATION_16": "The Day they will hear the blast [of the Horn] in truth. That is the Day of Emergence [from the graves].\n",
        "TRANSLATION_17": "[50:42] On the day (yawma substitutes for the previous yawma) when they, that is, all creatures, hear the Call of truth, of the Resurrection — this will be Isrāfīl’s second blast, and it may precede or follow his [initial] call — that, day of the call and the hearing, is the day of coming forth, from the graves (yawma, ‘on the day, is in the accusative because of an implied yunādī, ‘[when] he will call’), that is to say, they will come to know the consequence of their denial.\n",
        "TRANSLATION_18": "(The day when they will hear the (Awful) Cry in truth) coming forth from the graves. (That is the day of coming forth (from the graves)) which is the Day of Judgement.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "50:42",
            "78:39",
            "23:41",
            "15:73",
            "15:83",
            "36:64",
            "23:111",
            "51:13",
            "19:85",
            "75:1"
        ],
        "BIBLE": [
            "prophets:joshua:6:5",
            "prophets:joel:1:15",
            "prophets:isaiah:13:6",
            "prophets:joshua:18:4",
            "prophets:jeremiah:49:22",
            "torah:numbers:22:20",
            "torah:numbers:9:6",
            "writings:daniel:3:10",
            "prophets:i%20samuel:4:14",
            "writings:psalms:98:6"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:4:11",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:4:6"
        ]
    }
}