{
    "VERSE": "50:6",
    "ARABIC": "أَفَلَمْ يَنظُرُوٓا۟ إِلَى ٱلسَّمَآءِ فَوْقَهُمْ كَيْفَ بَنَيْنَٰهَا وَزَيَّنَّٰهَا وَمَا لَهَا مِن فُرُوجٍ",
    "ENGLISH": {
        "TRANSLATION_0": "Have they not looked at the sky above them: how We structured it and made it beautiful and how there are no fissures in it?",
        "TRANSLATION_1": "Have they not looked at the sky above them, how We have fashioned and adorned it, and it has no flaw?\n",
        "TRANSLATION_2": "Did they never observe the sky above them: how We built it and beautified it; and it has no cracks;\n",
        "TRANSLATION_3": "Have they not seen how We have established the sky above them and decked it without gaps and cracks?\n",
        "TRANSLATION_4": "So did they not see the sky above them – how We have made it and beautified it, and there are no cracks in it?\n",
        "TRANSLATION_5": "Have they not looked at the heaven above them, how We have made it and adorned it, and there are no Furuj in it\n",
        "TRANSLATION_6": "Do they not then look up to heaven above them how We have made it and adorned it and it has no gaps?\n",
        "TRANSLATION_7": "What, have they not beheld heaven above them, how We have built it, and decked it out fair, and it has no cracks?\n",
        "TRANSLATION_8": "Have they not then observed the sky above them, how We have constructed it and beautified it, and how there are no rifts therein?\n",
        "TRANSLATION_9": "Have they not observed the sky above them and marked how We have built it and adorned it, leaving no flaws in it;\n",
        "TRANSLATION_10": "Have they not looked up to the heaven above them, in what wise We have constructed and bedecked it, and that therein is no rift?\n",
        "TRANSLATION_11": "Have they not, then, observed the heaven above them, how We have built it and adorned it, and that there are no cracks in it?\n",
        "TRANSLATION_12": "Do they not look at the sky above them?- How We have made it and adorned it, and there are no flaws in it?\n",
        "TRANSLATION_13": "Have they not looked at the heaven above them, how We have made it and adorned it, and there are no rifts in it?\n",
        "TRANSLATION_14": "What, have they never observed the heaven above them, (and seen) how We built and adorned it, leaving no crack?\n",
        "TRANSLATION_15": "Have they not observed the sky above them, how We constructed it, and decorated it, and it has no cracks?\n",
        "TRANSLATION_16": "Have they not looked at the heaven above them - how We structured it and adorned it and [how] it has no rifts?\n",
        "TRANSLATION_17": "[50:6] Have they not then looked, with their own eyes, at the heaven, being, above them, in order to take heed by their own minds [of the consequences for them] when they deny the Resurrection, how We have built it, without supports, and adorned it, with planets, and how there are no cracks in it?, no fissures blemishing it.\n",
        "TRANSLATION_18": "(Have they) i.e. the disbelievers of Mecca (not then observed the sky above them) above their heads, (how We have constructed it) without pillars (and beautified it) and beautified it with stars, (and how there are no rifts therein) and how there are no rifts, cracks or defects therein?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "50:6",
            "88:18",
            "91:5",
            "15:16",
            "14:24",
            "88:17",
            "44:29",
            "21:32",
            "7:162",
            "47:10"
        ],
        "BIBLE": [
            "prophets:haggai:2:3",
            "writings:ii%20chronicles:2:5",
            "prophets:isaiah:49:21",
            "writings:proverbs:24:32",
            "writings:job:38:17",
            "writings:ii%20chronicles:9:3",
            "prophets:i%20kings:10:4",
            "torah:deuteronomy:1:28",
            "prophets:joshua:8:20",
            "writings:i%20chronicles:15:29"
        ]
    }
}