{
    "VERSE": "50:8",
    "ARABIC": "تَبْصِرَةً وَذِكْرَىٰ لِكُلِّ عَبْدٍ مُّنِيبٍ",
    "ENGLISH": {
        "TRANSLATION_0": "an instruction and a reminder for every penitent human being.",
        "TRANSLATION_1": "As instruction and reminder to every penitent creature.\n",
        "TRANSLATION_2": "All these are to serve as eye openers and as a lesson to every being who is prone to turn (to the Truth).\n",
        "TRANSLATION_3": "This is a reminder and it sharpens the insight of every servant of God who turns to Him in repentance.\n",
        "TRANSLATION_4": "A perception and an understanding, for every bondman who inclines.\n",
        "TRANSLATION_5": "An insight and a Reminder for every servant who turns to Allah in repentance.\n",
        "TRANSLATION_6": "To give sight and as a reminder to every servant who turns frequently (to Allah).\n",
        "TRANSLATION_7": "for an insight and a reminder to every penitent servant.\n",
        "TRANSLATION_8": "A vision and a reminder for every penitent slave.\n",
        "TRANSLATION_9": "as a lesson and reminder for every human being who turns to God;\n",
        "TRANSLATION_10": "An insight and an admonition for every bondman penitent.\n",
        "TRANSLATION_11": "[In this there is] an insight and admonition for every penitent servant.\n",
        "TRANSLATION_12": "To be observed and commemorated by every devotee turning (to Allah).\n",
        "TRANSLATION_13": "An insight and a Reminder for every slave turning to Allah (i.e. the one who believes in Allah and performs deeds of His obedience, and always begs His pardon).\n",
        "TRANSLATION_14": "as a lesson and a reminder to every penitent worshiper.\n",
        "TRANSLATION_15": "A lesson and a reminder for every penitent worshiper.\n",
        "TRANSLATION_16": "Giving insight and a reminder for every servant who turns [to Allah].\n",
        "TRANSLATION_17": "[50:8] as an insight (tabsiratan is a direct object denoting reason, that is to say, We did this to give an insight from Us) and a reminder for every penitent servant, who returns to obedience of Us.\n",
        "TRANSLATION_18": "(A vision) so that you may see (and a reminder) a lesson so that you may learn from it; it is also said \"a vision\" means an admonition and \"reminder\" means reflection (for every penitent slave) who turns to Allah and His obedience.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "50:8",
            "37:171",
            "19:93",
            "40:54",
            "38:19",
            "26:209",
            "17:65",
            "29:62",
            "11:120",
            "14:15"
        ],
        "BIBLE": [
            "prophets:jeremiah:35:15",
            "prophets:joshua:23:16",
            "prophets:joshua:22:4",
            "prophets:ezekiel:3:20",
            "prophets:ezekiel:29:20",
            "writings:daniel:1:17",
            "writings:ezra:9:13",
            "prophets:judges:3:6",
            "writings:psalms:119:34",
            "prophets:ii%20kings:17:17"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:4:12"
        ]
    }
}