{
    "VERSE": "50:9",
    "ARABIC": "وَنَزَّلْنَا مِنَ ٱلسَّمَآءِ مَآءً مُّبَٰرَكًا فَأَنۢبَتْنَا بِهِۦ جَنَّٰتٍ وَحَبَّ ٱلْحَصِيدِ",
    "ENGLISH": {
        "TRANSLATION_0": "And We sent down blessed water from the sky and made gardens grow by it and grain for harvesting",
        "TRANSLATION_1": "And We send down water as a blessing from the sky, and grow gardens with it and the grain for harvest,\n",
        "TRANSLATION_2": "We also sent down blessed water from the heaven, wherewith We caused gardens and harvest-grain to grow,\n",
        "TRANSLATION_3": "We have sent blessed water down from the sky to grow gardens, harvestable crops\n",
        "TRANSLATION_4": "And We sent down the auspicious water from the sky, therefore producing gardens with it, and the grain that is harvested.\n",
        "TRANSLATION_5": "And We send down blessed water (rain) from the sky, then We produce therewith Jannat and grain that are reaped.\n",
        "TRANSLATION_6": "And We send down from the cloud water abounding in good, then We cause to grow thereby gardens and the grain that is reaped,\n",
        "TRANSLATION_7": "And We sent down out of heaven water blessed, and caused to grow thereby gardens and grain of harvest\n",
        "TRANSLATION_8": "And We send down from the sky blessed water whereby We give growth unto gardens and the grain of crops,\n",
        "TRANSLATION_9": "and We have sent down from the sky blessed water with which We have brought forth gardens and grain to be harvested,\n",
        "TRANSLATION_10": "And We have sent down from the heaven water brest wherewith We have caused gardens to grow and the grain reaped.\n",
        "TRANSLATION_11": "We send down from the sky salubrious water, with which We grow gardens and the grain which is harvested,\n",
        "TRANSLATION_12": "And We send down from the sky rain charted with blessing, and We produce therewith gardens and Grain for harvests;\n",
        "TRANSLATION_13": "And We send down blessed water (rain) from the sky, then We produce therewith gardens and grain (every kind of harvests) that are reaped.\n",
        "TRANSLATION_14": "We sent down blessed water from the sky with which We caused gardens and the grains of harvest to grow,\n",
        "TRANSLATION_15": "And We brought down from the sky blessed water, and produced with it gardens and grain to harvest.\n",
        "TRANSLATION_16": "And We have sent down blessed rain from the sky and made grow thereby gardens and grain from the harvest\n",
        "TRANSLATION_17": "[50:9] And We send down from the heaven blessed water, containing much blessing, with which We cause to grow gardens, orchards, and the grain that is harvested,\n",
        "TRANSLATION_18": "(And We send down from the sky blessed water) rain blessed with vegetation and benefit from which all things derive life (whereby We give growth unto gardens and the grain of crops) all kinds of grain that are harvested,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "50:9",
            "54:11",
            "18:40",
            "69:16",
            "23:18",
            "43:11",
            "7:50",
            "78:14",
            "15:22",
            "16:10"
        ],
        "BIBLE": [
            "writings:proverbs:8:24",
            "prophets:zechariah:9:11",
            "writings:psalms:78:16",
            "prophets:amos:4:7",
            "torah:deuteronomy:28:12",
            "prophets:isaiah:55:10",
            "prophets:judges:5:4",
            "torah:genesis:1:12",
            "torah:genesis:2:9",
            "torah:numbers:20:5"
        ]
    }
}