{
    "VERSE": "108:3",
    "ARABIC": "إِنَّ شَانِئَكَ هُوَ ٱلْأَبْتَرُ",
    "ENGLISH": {
        "TRANSLATION_0": "It is the one who hates you who is cut off without an heir.",
        "TRANSLATION_1": "It is surely your opponents whose line will come to end.\n",
        "TRANSLATION_2": "Verily your enemy alone has been cut off from the roots.\n",
        "TRANSLATION_3": "Whoever hates you will himself remain childless.\n",
        "TRANSLATION_4": "Indeed it is your enemy who is bereft of all goodness.\n",
        "TRANSLATION_5": "For he who hates you, he will be cut off.\n",
        "TRANSLATION_6": "Surely your enemy is the one who shall be without posterity,\n",
        "TRANSLATION_7": "Surely he that hates thee, he is the one cut off.\n",
        "TRANSLATION_8": "Lo! it is thy insulter (and not thou) who is without posterity.\n",
        "TRANSLATION_9": "It is the one who hates you who has been cut off.\n",
        "TRANSLATION_10": "Verily it is thy traducer who shall be tail-less.\n",
        "TRANSLATION_11": "Indeed it is your enemy who is without posterity.\n",
        "TRANSLATION_12": "For he who hateth thee, he will be cut off (from Future Hope).\n",
        "TRANSLATION_13": "For he who makes you angry (O Muhammad (Peace be upon him)), - he will be cut off (from every good thing in this world and in the Hereafter).\n",
        "TRANSLATION_14": "Surely, he who hates you, he is the most severed.\n",
        "TRANSLATION_15": "He who hates you is the loser.\n",
        "TRANSLATION_16": "Indeed, your enemy is the one cut off.\n",
        "TRANSLATION_17": "[108:3] Indeed it is your antagonist, your hater, who is the severed one, refraining from all [acts of] good, or the one whose line of offspring will be severed [by his not having any]: this was revealed regarding al-‘Āsī b. Wā’il, who called the Prophet (s) al-abtar, ‘the severed one’, when his son al-Qāsim died. Meccan or Medinese, consisting of 6 verses; this was revealed when a band of idolaters said to the Prophet (s), ‘What if you worship our gods for one year, and we worship your God the next?’\n",
        "TRANSLATION_18": "(Lo! It is thy insulter) the one who despises you ((and not thou) who is without posterity) he will be without family, children, wealth or any goodness; he will not be mentioned after his death, i.e. al-'As Ibn Wa'il al- Sahmi, while you will be mentioned with every good. This is because, when his son 'Abdullah died, they said: \"Muhammad (pbuh) is without posterity\".' And of the surah in which Disbelievers are mentioned, which is all Meccan and consists of 6 verses, 26 words and 74 letters: Surah 109: Disbelievers (al-Kafirun) And of the surah in which Disbelievers are mentioned, which is all Meccan and consists of 6 verses, 26 words and 74 letters:\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "108:3",
            "15:95",
            "7:15",
            "36:3",
            "15:37",
            "38:80",
            "108:1",
            "37:172",
            "96:8",
            "53:42"
        ],
        "BIBLE": [
            "writings:i%20chronicles:17:8",
            "torah:genesis:32:13",
            "prophets:i%20kings:14:13",
            "prophets:isaiah:28:17",
            "torah:deuteronomy:15:1",
            "torah:deuteronomy:20:12",
            "prophets:jeremiah:4:27",
            "torah:deuteronomy:5:8",
            "torah:exodus:20:4",
            "prophets:jeremiah:46:28"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:4:10"
        ]
    }
}