{
    "VERSE": "3:102",
    "ARABIC": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ ٱتَّقُوا۟ ٱللَّهَ حَقَّ تُقَاتِهِۦ وَلَا تَمُوتُنَّ إِلَّا وَأَنتُم مُّسْلِمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "You who have iman! have taqwa of Allah with the taqwa due to Him and do not die except as Muslims.",
        "TRANSLATION_1": "O believers, fear God as He should be feared, and do not die but submitting (to Him).\n",
        "TRANSLATION_2": "Believers! Fear Allah as He should be feared, and see that you do not die save in the state of submission to Allah.\n",
        "TRANSLATION_3": "Believers, have fear of God as you should and die only as Muslims (having submitted to the will of God).\n",
        "TRANSLATION_4": "O People who Believe! Fear Allah in the manner He should rightfully be feared, and do not die except as Muslims.\n",
        "TRANSLATION_5": "O you who believe! Have Taqwa of Allah as is His due, and die not except as (true) Muslims.\n",
        "TRANSLATION_6": "O you who believe! be careful of (your duty to) Allah with the care which is due to Him, and do not die unless you are Muslims.\n",
        "TRANSLATION_7": "O believers, fear God as He should be feared, and see you do not die, save in surrender.\n",
        "TRANSLATION_8": "O ye who believe! Observe your duty to Allah with right observance, and die not save as those who have surrendered (unto Him)\n",
        "TRANSLATION_9": "Believers, fear God as is His due, and when death comes, be in a state of complete submission to Him.\n",
        "TRANSLATION_10": "O Ye who believe! fear Allah with fear due to Him, and die not except ye be Muslims.\n",
        "TRANSLATION_11": "O you who have faith! Be wary of Allah with the wariness due to Him and do not die except as Muslims.\n",
        "TRANSLATION_12": "O ye who believe! Fear Allah as He should be feared, and die not except in a state of Islam.\n",
        "TRANSLATION_13": "O you who believe! Fear Allah (by doing all that He has ordered and by abstaining from all that He has forbidden) as He should be feared. [Obey Him, be thankful to Him, and remember Him always], and die not except in a state of Islam (as Muslims) with complete submission to Allah.\n",
        "TRANSLATION_14": "Believers, fear Allah as He should be feared, and do not die except as Muslims.\n",
        "TRANSLATION_15": "O you who believe! Revere God with due reverence, and do not die except as Muslims.\n",
        "TRANSLATION_16": "O you who have believed, fear Allah as He should be feared and do not die except as Muslims [in submission to Him].\n",
        "TRANSLATION_17": "[3:102] O you who believe, fear God as He should be feared, so that He is obeyed and not disobeyed, thanked and not shown ingratitude, remembered and not forgotten. They said, ‘Who, O Messenger of God, is strong enough for this [task]?’ But it was then abrogated by His statement: So fear God as much as you can [Q. 64:16]; and do not die, except as Muslims, professing the Oneness of God.\n",
        "TRANSLATION_18": "66 Thereafter, Allah spoke about a dispute between the Aws and the Khazraj, in which Tha'labah Ibn Ghanam and As'ad Ibn Zurarah boasted about their killings and raids on their rivals in the pre-Islamic days, saying: (0 ye who believe! Observe your duty to Allah) obey Allah (with right observance) such that one obeys Him and never contravenes against Him, thank Him and never be ungrateful to him, remember Him and never forget Him; it is also said this means: obey Allah as He ought to be obeyed, (and die not save as those who have surrendered (unto Him)) sincerely acknowledging that you worship Him and declare His divine Oneness;\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "3:102",
            "30:60",
            "3:200",
            "8:20",
            "9:119",
            "29:11",
            "47:7",
            "37:96",
            "33:70",
            "2:9"
        ],
        "BIBLE": [
            "prophets:ezekiel:33:13",
            "prophets:jeremiah:2:31",
            "prophets:isaiah:35:4",
            "prophets:ezekiel:18:23",
            "writings:nehemiah:13:22",
            "writings:ii%20chronicles:25:16",
            "prophets:ii%20kings:4:40",
            "prophets:ezekiel:3:20",
            "torah:deuteronomy:4:6",
            "writings:daniel:6:13"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:5"
        ]
    }
}