{
    "VERSE": "3:104",
    "ARABIC": "وَلْتَكُن مِّنكُمْ أُمَّةٌ يَدْعُونَ إِلَى ٱلْخَيْرِ وَيَأْمُرُونَ بِٱلْمَعْرُوفِ وَيَنْهَوْنَ عَنِ ٱلْمُنكَرِ وَأُو۟لَٰٓئِكَ هُمُ ٱلْمُفْلِحُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Let there be a community among you who call to the good, and enjoin the right, and forbid the wrong. They are the ones who have success.",
        "TRANSLATION_1": "So let there be a body among you who may call to the good, enjoin what is esteemed and forbid what is odious. They are those who will be successful.\n",
        "TRANSLATION_2": "And from among you there must be a party who invite people to all that is good and enjoin the doing of all that is right and forbid the doing of all that is wrong. It is they who will attain true success.\n",
        "TRANSLATION_3": "Let there be a group among you who will invite others to do good deeds, command them to obey the Law, and prohibit them from committing sins. These people will have eternal happiness.\n",
        "TRANSLATION_4": "And there should be a group among you that invites to goodness, and enjoins good deeds and forbids immorality; it is they who are the successful.\n",
        "TRANSLATION_5": "Let there arise out of you a group of people inviting to all that is good (Islam), enjoining Al-Ma`ruf (all that Islam orders) and forbidding Al-Munkar (all that Islam has forbidden). And it is they who are the successful.\n",
        "TRANSLATION_6": "And from among you there should be a party who invite to good and enjoin what is right and forbid the wrong, and these it is that shall be successful.\n",
        "TRANSLATION_7": "Let there be one nation of you, calling to good, and bidding to honour, and forbidding dishonour; those are the prosperers.\n",
        "TRANSLATION_8": "And there may spring from you a nation who invite to goodness, and enjoin right conduct and forbid indecency. Such are they who are successful.\n",
        "TRANSLATION_9": "Let there be a group among you who call others to good, and enjoin what is right, and forbid what is wrong: those who do this shall be successful.\n",
        "TRANSLATION_10": "And let there be of you a community calling others to good and commanding that which is reputable and prohibiting that which is disreputable. And these they are the blissful.\n",
        "TRANSLATION_11": "There has to be a nation among you summoning to the good, bidding what is right, and forbidding what is wrong. It is they who are the felicitous.\n",
        "TRANSLATION_12": "Let there arise out of you a band of people inviting to all that is good, enjoining what is right, and forbidding what is wrong: They are the ones to attain felicity.\n",
        "TRANSLATION_13": "Let there arise out of you a group of people inviting to all that is good (Islam), enjoining Al-Ma'ruf (i.e. Islamic Monotheism and all that Islam orders one to do) and forbidding Al-Munkar (polytheism and disbelief and all that Islam has forbidden). And it is they who are the successful.\n",
        "TRANSLATION_14": "Let there be one nation of you that shall call to righteousness, ordering honor, and forbidding dishonor. Those are the prosperous.\n",
        "TRANSLATION_15": "And let there be among you a community calling to virtue, and advocating righteousness, and deterring from evil. These are the successful.\n",
        "TRANSLATION_16": "And let there be [arising] from you a nation inviting to [all that is] good, enjoining what is right and forbidding what is wrong, and those will be the successful.\n",
        "TRANSLATION_17": "[3:104] Let there be one community of you calling to good, to Islam, and enjoining decency, and forbidding indecency; those, that call, bid and forbid, are the successful, the victorious (the particle min, ‘of’, [in minkum, ‘of you’] is partitive, since what is mentioned is a collective obligation [fard kifāya], and is not incumbent upon every individual of the community, for not every person, such as the ignorant, is up to it. However, it is also said that this particle is extra, and what is meant is, ‘so that you are a community [calling to good and so on]’).\n",
        "TRANSLATION_18": "Allah then commanded goodness and reconciliation, saying: (And there may spring from you) there still exists among you (a nation) a group (who invite to goodness) who invite to reconciliation and excellence, (and enjoin right conduct) they enjoin Allah's divine Oneness and the following of Muhammad (pbuh) (and forbid indecency) they forbid disbelief, idolatry and rejection, instead following the Messenger. (Such are they who are successful) who are saved from Allah's wrath and punishment.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "3:104",
            "23:61",
            "3:114",
            "3:54",
            "7:181",
            "2:141",
            "2:134",
            "3:110",
            "70:41",
            "98:7"
        ],
        "BIBLE": [
            "prophets:joshua:1:8",
            "prophets:joshua:1:7",
            "writings:esther:4:11",
            "torah:deuteronomy:31:7",
            "prophets:isaiah:62:12",
            "writings:ii%20chronicles:7:14",
            "writings:esther:3:12",
            "prophets:i%20samuel:29:6",
            "prophets:ezekiel:3:20",
            "prophets:ii%20samuel:2:26"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:5:2"
        ]
    }
}