{
    "VERSE": "3:107",
    "ARABIC": "وَأَمَّا ٱلَّذِينَ ٱبْيَضَّتْ وُجُوهُهُمْ فَفِى رَحْمَةِ ٱللَّهِ هُمْ فِيهَا خَٰلِدُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "As for those whose faces are whitened, they are in Allah's mercy, remaining in it timelessly, for ever.",
        "TRANSLATION_1": "And those with bright faces shall be under God's grace and enjoy it for ever.\n",
        "TRANSLATION_2": "And those whose faces have turned bright, they will be in the mercy of Allah, and therein they shall abide.\n",
        "TRANSLATION_3": "The people whose faces have become white will enjoy the mercy of God with which they will live forever.\n",
        "TRANSLATION_4": "And those whose faces will be shining, are in the mercy of Allah; they will abide in it forever.\n",
        "TRANSLATION_5": "And for those whose faces will become white, they will be in Allah's mercy (Paradise), therein they shall dwell forever.\n",
        "TRANSLATION_6": "And as to those whose faces turn white, they shall be in Allah's mercy; in it they shall-abide.\n",
        "TRANSLATION_7": "But as for those whose faces are whitened, they shall be in God's mercy, therein dwelling forever.\n",
        "TRANSLATION_8": "And as for those whose faces have been whitened, in the mercy of Allah they dwell for ever.\n",
        "TRANSLATION_9": "But as for those with shining faces, they shall abide forever in God's grace.\n",
        "TRANSLATION_10": "And as for those whose faces shall have become whitened-- they shall be in Allah's mercy; therein they shall be abiders.\n",
        "TRANSLATION_11": "But as for those whose faces become white, they shall dwell in Allah’s mercy, and they will remain in it [forever].\n",
        "TRANSLATION_12": "But those whose faces will be (lit with) white,- they will be in (the light of) Allah's mercy: therein to dwell (for ever).\n",
        "TRANSLATION_13": "And for those whose faces will become white, they will be in Allah's Mercy (Paradise), therein they shall dwell forever.\n",
        "TRANSLATION_14": "As for those whose faces will be whitened, they shall be in the Mercy of Allah for ever.\n",
        "TRANSLATION_15": "But as for those whose faces are whitened: they are in God’s mercy, remaining in it forever.\n",
        "TRANSLATION_16": "But as for those whose faces will turn white, [they will be] within the mercy of Allah. They will abide therein eternally.\n",
        "TRANSLATION_17": "[3:107] But as for those whose faces are whitened, and these are the believers, they shall be in God’s mercy, that is to say, in Paradise, abiding therein.\n",
        "TRANSLATION_18": "(As for those whose faces have been whitened, Lo! in the mercy of Allah) in Allah's Paradise (they dwell for ever) never to die or leave it.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "3:107",
            "4:175",
            "4:16",
            "3:57",
            "2:15",
            "7:49",
            "12:92",
            "2:192",
            "2:218",
            "7:186"
        ],
        "BIBLE": [
            "writings:psalms:66:20",
            "writings:daniel:12:3",
            "writings:psalms:136:7",
            "torah:deuteronomy:31:18",
            "torah:leviticus:13:16",
            "torah:deuteronomy:30:3",
            "writings:ii%20chronicles:29:6",
            "torah:leviticus:13:10",
            "prophets:isaiah:9:1",
            "writings:job:18:19"
        ]
    }
}