{
    "VERSE": "3:108",
    "ARABIC": "تِلْكَ ءَايَٰتُ ٱللَّهِ نَتْلُوهَا عَلَيْكَ بِٱلْحَقِّ وَمَا ٱللَّهُ يُرِيدُ ظُلْمًا لِّلْعَٰلَمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "These are Allah's Signs which We recite to you with truth. Allah desires no wrong for any being.",
        "TRANSLATION_1": "These are the commandments of God We recite to you verily; God does not wish injustice to the creatures of the world.\n",
        "TRANSLATION_2": "These are the mes sages of Allah which We recite to you in truth, and Allah desires no wrong to the people of the world.\n",
        "TRANSLATION_3": "Such are God's revelations which We explain to you, (Muhammad), for a genuine purpose. God does not want injustice for any of His creatures.\n",
        "TRANSLATION_4": "These are the verses of Allah, which We recite to you (O dear Prophet Mohammed – peace and blessings be upon him), with truth; and Allah does not wish any injustice to the creation.\n",
        "TRANSLATION_5": "These are the Ayat of Allah. We recite them to you in truth, and Allah wills no injustice to the `Alamin.\n",
        "TRANSLATION_6": "These are the communications of Allah which We recite to you with truth, and Allah does not desire any injustice to the creatures.\n",
        "TRANSLATION_7": "These are the signs of God We recite to thee in truth, and God desires not any injustice to living beings.\n",
        "TRANSLATION_8": "These are revelations of Allah. We recite them unto thee in truth. Allah willeth no injustice to (His) creatures.\n",
        "TRANSLATION_9": "These are God's revelations; We recite them to you in all truth. God desires no injustice to mankind.\n",
        "TRANSLATION_10": "These are revelations of Allah; We rehearse them unto thee with truth, and Allah intendeth not wrong unto the worlds.\n",
        "TRANSLATION_11": "These are the signs of Allah, which We recite to you in truth, and Allah does not desire any wrong for the creatures.\n",
        "TRANSLATION_12": "These are the Signs of Allah: We rehearse them to thee in Truth: And Allah means no injustice to any of His creatures.\n",
        "TRANSLATION_13": "These are the Verses of Allah: We recite them to you (O Muhammad SAW) in truth, and Allah wills no injustice to the 'Alamin (mankind and jinns).\n",
        "TRANSLATION_14": "Such are the verses of Allah, We recite them to you with truth. Allah does not want injustice for the worlds.\n",
        "TRANSLATION_15": "These are the revelations of God. We recite them to you in truth. God desires no injustice for mankind.\n",
        "TRANSLATION_16": "These are the verses of Allah. We recite them to you, [O Muhammad], in truth; and Allah wants no injustice to the worlds.\n",
        "TRANSLATION_17": "[3:108] Those, that is to say, these verses, are the verses of God which We recite to you, O Muhammad (s), in truth, and God desires not any injustice for the worlds, punishing them for no crime.\n",
        "TRANSLATION_18": "(These are revelations of Allah): the Qur'an. (We recite them unto thee) We send them with Gabriel to you (in truth) in order to show what is true and what is an error. (Allah willeth no injustice to (His) creatures) He does not will to be unjust to the jinn or human beings.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "3:108",
            "2:252",
            "45:6",
            "27:79",
            "24:18",
            "84:23",
            "6:21",
            "29:44",
            "4:70",
            "10:17"
        ],
        "BIBLE": [
            "prophets:jeremiah:14:13",
            "torah:deuteronomy:28:8",
            "writings:psalms:108:4",
            "writings:psalms:57:10",
            "torah:exodus:18:23",
            "writings:psalms:71:22",
            "torah:numbers:14:11",
            "writings:i%20chronicles:28:21",
            "writings:i%20chronicles:21:17",
            "torah:exodus:20:17"
        ]
    }
}