{
    "VERSE": "3:109",
    "ARABIC": "وَلِلَّهِ مَا فِى ٱلسَّمَٰوَٰتِ وَمَا فِى ٱلْأَرْضِ وَإِلَى ٱللَّهِ تُرْجَعُ ٱلْأُمُورُ",
    "ENGLISH": {
        "TRANSLATION_0": "Everything in the heavens and everything in the earth belongs to Allah. All matters return to Allah.",
        "TRANSLATION_1": "For to God belongs all that is in the heavens and the earth, and to God do all things return.\n",
        "TRANSLATION_2": "To Allah belongs all that is in the heavens and the earth, and to Allah are all matters referred for decision.\n",
        "TRANSLATION_3": "To God belongs all that is in the heavens and the earth and to Him do all things return.\n",
        "TRANSLATION_4": "And to Allah only belongs all whatever is in the heavens and all whatever is in the earth; and towards Allah only is the return of all matters.\n",
        "TRANSLATION_5": "And to Allah belongs all that is in the heavens and all that is in the earth. And all matters go back (for decision) to Allah.\n",
        "TRANSLATION_6": "And whatever is in the heavens and whatever is in the earth is Allah's; and to Allah all things return\n",
        "TRANSLATION_7": "To God belongs all that is in the heavens and in the earth, and unto Him all matters are returned.\n",
        "TRANSLATION_8": "Unto Allah belongeth whatsoever is in the heavens and whatsoever is in the earth; and unto Allah all things are returned.\n",
        "TRANSLATION_9": "His is all that the heavens and the earth contain. To God shall all things return.\n",
        "TRANSLATION_10": "Allah's is whatsoever is in the heavens and in the earth; and unto Allah shall be committed all affairs.\n",
        "TRANSLATION_11": "To Allah belongs whatever there is in the heavens and the earth, and to Allah all matters are returned.\n",
        "TRANSLATION_12": "To Allah belongs all that is in the heavens and on earth: To Him do all questions go back (for decision).\n",
        "TRANSLATION_13": "And to Allah belongs all that is in the heavens and all that is in the earth. And all matters go back (for decision) to Allah.\n",
        "TRANSLATION_14": "To Allah belongs all that is in the heavens and the earth. To Him all matters shall return.\n",
        "TRANSLATION_15": "To God belongs everything in the heavens and everything on earth, and to God all events are referred.\n",
        "TRANSLATION_16": "To Allah belongs whatever is in the heavens and whatever is on the earth. And to Allah will [all] matters be returned.\n",
        "TRANSLATION_17": "[3:109] To God belongs all that is in the heavens and in the earth, as possessions, creatures and servants, and to Him all matters are returned.\n",
        "TRANSLATION_18": "(Unto Allah belongeth whatsoever is in the heavens and whatsoever is in the earth) of created beings and marvellous things; (and unto Allah all things are returned) in the Hereafter. 67\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "3:109",
            "42:53",
            "57:5",
            "4:132",
            "4:126",
            "3:129",
            "59:1",
            "61:1",
            "53:31",
            "6:3"
        ],
        "BIBLE": [
            "torah:leviticus:11:42",
            "prophets:isaiah:65:17",
            "writings:daniel:11:28",
            "torah:deuteronomy:10:14",
            "prophets:joshua:1:17",
            "torah:deuteronomy:29:28",
            "prophets:ii%20samuel:14:20",
            "prophets:i%20kings:12:24",
            "torah:genesis:18:14",
            "prophets:isaiah:10:21"
        ]
    }
}