{
    "VERSE": "3:12",
    "ARABIC": "قُل لِّلَّذِينَ كَفَرُوا۟ سَتُغْلَبُونَ وَتُحْشَرُونَ إِلَىٰ جَهَنَّمَ وَبِئْسَ ٱلْمِهَادُ",
    "ENGLISH": {
        "TRANSLATION_0": "as was the case with the people of Pharaoh and those before them. They denied Our Signs so Allah seized them for their wrong actions. Allah is fierce in retribution.",
        "TRANSLATION_1": "So tell the disbelievers: \"You will surely be subdued and driven to Hell: How bad a preparation!\"\n",
        "TRANSLATION_2": "Tell those who disbelieved: 'You shall soon be overpowered and mustered to Hell - and that is an evil resting place!'\n",
        "TRANSLATION_3": "(Muhammad), tell the unbelievers that they will soon be defeated and driven into Hell, a terrible dwelling.\n",
        "TRANSLATION_4": "Say (O dear Prophet Mohammed – peace and blessings be upon him) to the disbelievers, “Very soon you shall be overcome and driven towards hell; and that is a wretched resting-place.”\n",
        "TRANSLATION_5": "Say to those who disbelieve: \"You will be defeated and gathered together to Hell, and worst indeed is that place of rest.\"\n",
        "TRANSLATION_6": "Say to those who disbelieve: You shall be vanquished, and driven together to hell; and evil is the resting-place.\n",
        "TRANSLATION_7": "Say to the unbelievers: 'You shall be overthrown, and mustered into Gehenna -- an evil cradling!'\n",
        "TRANSLATION_8": "Say (O Muhammad) unto those who disbelieve: Ye shall be overcome and gathered unto Hell, an evil resting-place.\n",
        "TRANSLATION_9": "Say to those who deny the truth, \"You shall be overcome and driven into Hell -- an evil resting place!\"\n",
        "TRANSLATION_10": "Say thou unto those who disbelieve: anon shall ye be overcome, and gathered unto Hell--an evil couch!\n",
        "TRANSLATION_11": "Say to the faithless, ‘You shall be overcome and mustered toward hell, and it is an evil resting place.’\n",
        "TRANSLATION_12": "Say to those who reject Faith: \"Soon will ye be vanquished and gathered together to Hell,-an evil bed indeed (to lie on)!\n",
        "TRANSLATION_13": "Say (O Muhammad SAW) to those who disbelieve: \"You will be defeated and gathered together to Hell, and worst indeed is that place to rest.\"\n",
        "TRANSLATION_14": "Say to those who disbelieve: 'You shall be overcome and gathered into Gehenna (Hell), an evil cradling'\n",
        "TRANSLATION_15": "Say to those who disbelieve, “You will be defeated, and rounded up into Hell—an awful resting-place.”\n",
        "TRANSLATION_16": "Say to those who disbelieve, \"You will be overcome and gathered together to Hell, and wretched is the resting place.\"\n",
        "TRANSLATION_17": "[3:12] When the Prophet (s) enjoined the Jews to enter into Islam, after his return from Badr, they said, ‘Do not fool yourself just because you killed a few men of Quraysh, inexperienced and knowing nothing about fighting’, whereupon the following was revealed: Say, O Muhammad (s), to the disbelievers, from among the Jews, ‘You shall be vanquished (sa-tughlabūn, or [read] sa-yughlabūn, ‘they shall be vanquished’), in this world, through being killed or taken captive and made to pay the jizya (which actually took place), and mustered, ([read] in both ways [wa-tuhsharūna, ‘you will be mustered’, or wa-yuhsharūna, ‘they will be mustered’]), in the Hereafter, to Hell, which you shall enter — an evil cradling!’, [an evil] resting place.\n",
        "TRANSLATION_18": "(Say) Muhammad! (unto those who disbelieve) the unbelievers of Mecca: (Ye shall be overcome) You shall be killed on the Day of Badr (and gathered unto hell) on the Day of Judgement, (an evil resting place) an evil place and outcome.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "3:12",
            "38:56",
            "7:41",
            "6:120",
            "7:6",
            "7:198",
            "7:180",
            "19:96",
            "43:10",
            "19:72"
        ],
        "BIBLE": [
            "prophets:jeremiah:32:37",
            "torah:genesis:1:9",
            "writings:ruth:3:4",
            "prophets:jeremiah:8:3",
            "prophets:jeremiah:14:13",
            "writings:ii%20chronicles:34:28",
            "prophets:jeremiah:29:14",
            "torah:genesis:27:39",
            "prophets:jeremiah:24:9",
            "prophets:zephaniah:2:11"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:2:5"
        ]
    }
}