{
    "VERSE": "3:124",
    "ARABIC": "إِذْ تَقُولُ لِلْمُؤْمِنِينَ أَلَن يَكْفِيَكُمْ أَن يُمِدَّكُمْ رَبُّكُم بِثَلَٰثَةِ ءَالَٰفٍ مِّنَ ٱلْمَلَٰٓئِكَةِ مُنزَلِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "And when you said to the muminun, 'Is it not enough for you that your Lord reinforced you with three thousand angels, sent down?'",
        "TRANSLATION_1": "Remember when you said to the faithful: \"Is it not sufficient that your Lord should send for your help three thousand angels from the heavens?\n",
        "TRANSLATION_2": "And recall when you said to the believers: 'Will it not suffice you that your Lord will aid you by sending down three thousand angels?\n",
        "TRANSLATION_3": "Also, remember when you said to the believers, \"Is it not enough that your Lord is helping you with a force of three thousand angels sent (from the heavens)?\"\n",
        "TRANSLATION_4": "When you O dear Prophet (Mohammed – peace and blessings be upon him) said to the believers, “Is it not sufficient for you that your Lord may support you by sending down three thousand angels?”\n",
        "TRANSLATION_5": "(Remember) when you said to the believers, \"Is it not enough for you that your Lord should help you with three thousand angels sent down\"\n",
        "TRANSLATION_6": "When you said to the believers: Does it not suffice you that your Lord should assist you with three thousand of the angels sent down?\n",
        "TRANSLATION_7": "When thou saidst to the believers, 'Is it not enough for you that your Lord should reinforce you with three thousand angels sent down upon you?\n",
        "TRANSLATION_8": "When thou didst say unto the believers: Is it not sufficient for you that your Lord should support you with three thousand angels sent down (to your help)?\n",
        "TRANSLATION_9": "[And remember] when you said to the believers, \"Does it not suffice that your Lord helps you by sending down three thousand angels?\n",
        "TRANSLATION_10": "And Recall what time thou saidst to the believers: sufficieth it not unto that your lord should reinforce you with three thousand angels sent down.\n",
        "TRANSLATION_11": "When you were saying to the faithful, ‘Is it not enough for you that your Lord should aid you with three thousand angels sent down?’\n",
        "TRANSLATION_12": "Remember thou saidst to the Faithful: \"Is it not enough for you that Allah should help you with three thousand angels (Specially) sent down?\n",
        "TRANSLATION_13": "(Remember) when you (Muhammad SAW) said to the believers, \"Is it not enough for you that your Lord (Allah) should help you with three thousand angels; sent down?\"\n",
        "TRANSLATION_14": "When you said to the believers: 'Is it not enough for you that your Lord should reinforce you with three thousand angels sent down upon you?\n",
        "TRANSLATION_15": "When you said to the believers, “Is it not enough for you that your Lord has reinforced you with three thousand angels, sent down?”\n",
        "TRANSLATION_16": "[Remember] when you said to the believers, \"Is it not sufficient for you that your Lord should reinforce you with three thousand angels sent down?\n",
        "TRANSLATION_17": "[3:124] When (idh, an adverbial qualifier of nasarakum, ‘He gave you victory’ [in the previous verse]) you were saying to the believers, promising them as reassurance [for them]: ‘Is it not sufficient for you that your Lord should reinforce you, [that] He should succour you, with three thousand angels sent down? (read munzalīn or munazzalīn, ‘sent down’).\n",
        "TRANSLATION_18": "(And when thou didst say unto the believers) on the Day of Uhud: (Is it not sufficient for you) regarding your enemy (that your Lord should support) that your Lord should help you (you with three thousand angels sent down?) from heaven to help you.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "3:124",
            "8:9",
            "3:80",
            "3:125",
            "89:22",
            "38:71",
            "26:98",
            "41:30",
            "32:11",
            "2:30"
        ],
        "BIBLE": [
            "prophets:ii%20kings:20:19",
            "prophets:i%20kings:18:36",
            "writings:daniel:10:19",
            "prophets:zechariah:1:9",
            "prophets:jeremiah:14:13",
            "torah:deuteronomy:33:23",
            "prophets:jeremiah:4:10",
            "prophets:jeremiah:23:33",
            "prophets:jeremiah:28:15",
            "prophets:ii%20kings:9:19"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:3:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:1"
        ]
    }
}