{
    "VERSE": "3:126",
    "ARABIC": "وَمَا جَعَلَهُ ٱللَّهُ إِلَّا بُشْرَىٰ لَكُمْ وَلِتَطْمَئِنَّ قُلُوبُكُم بِهِۦ وَمَا ٱلنَّصْرُ إِلَّا مِنْ عِندِ ٱللَّهِ ٱلْعَزِيزِ ٱلْحَكِيمِ",
    "ENGLISH": {
        "TRANSLATION_0": "Allah only did this for it to be good news for you and so that your hearts might be set at rest by it (help comes from no one but Allah, the Almighty, the All-Wise)",
        "TRANSLATION_1": "And God did not do so but as good tidings for you, and to reassure your hearts for victory comes from God alone, the all-mighty and all-wise --\n",
        "TRANSLATION_2": "Allah has reminded you of this only as a glad tiding to you and so as to let your hearts be at rest. Help can only come from Allah, the All-Mighty, the All-Wise.\n",
        "TRANSLATION_3": "The sending of the angels is a glad news from your Lord so that you would have more confidence in Him. No victory is real unless it is from God, the Majestic and All-wise.\n",
        "TRANSLATION_4": "And Allah did not bestow this victory except for your happiness, and only that your hearts may attain peace with it; and there is no help except from Allah, the Almighty, the Wise.\n",
        "TRANSLATION_5": "Allah made it not but as a message of good news for you and as an assurance to your hearts. And there is no victory except from Allah, the All-Mighty, the All-Wise.\n",
        "TRANSLATION_6": "And Allah did not make it but as good news for you, and that your hearts might be at ease thereby, and victory is only from Allah, the Mighty, the Wise.\n",
        "TRANSLATION_7": "God wrought this not, save as good tiding to you, and that your hearts might be at rest; help comes only from God the All-mighty, the All-wise;\n",
        "TRANSLATION_8": "Allah ordained this only as a message of good cheer for you, and that thereby your hearts might be at rest - Victory cometh only from Allah, the Mighty, the Wise -\n",
        "TRANSLATION_9": "and God ordained this only as good news for you so that your hearts might be comforted, help comes only from God, the Powerful, the Wise One,\n",
        "TRANSLATION_10": "And this Allah made not except as a joyful enunciation unto you, and that thereby your hearts might be set at rest--and no succour is there but from before Allah, the Mighty, the Wise.\n",
        "TRANSLATION_11": "Allah did not appoint it but as a good news for you and to reassure with it your hearts; and victory comes only from Allah, the All-mighty, the All-wise,\n",
        "TRANSLATION_12": "Allah made it but a message of hope for you, and an assurance to your hearts: (in any case) there is no help except from Allah. The Exalted, the Wise:\n",
        "TRANSLATION_13": "Allah made it not but as a message of good news for you and as an assurance to your hearts. And there is no victory except from Allah, the All-Mighty, the All-Wise.\n",
        "TRANSLATION_14": "Allah did not make this to be except as glad tidings for you, so that your hearts might be comforted. Victory comes only from Allah, the Mighty, the Wise.\n",
        "TRANSLATION_15": "God made it but a message of hope for you, and to reassure your hearts thereby. Victory comes only from God the Almighty, the Wise.\n",
        "TRANSLATION_16": "And Allah made it not except as [a sign of] good tidings for you and to reassure your hearts thereby. And victory is not except from Allah, the Exalted in Might, the Wise -\n",
        "TRANSLATION_17": "[3:126] What God ordained, that is, of reinforcement, was only as a good tiding to you, of victory, and that your hearts might be at peace, [that] they might be at rest, and not be terrified by the large number of the enemy as compared to your small number. Victory comes only from God, the Mighty, the Wise, He gives it to whomever He will, and [victory comes] not because of a large army.\n",
        "TRANSLATION_18": "(Allah ordained this) Allah mentioned this help (only as a message of good cheer for you) that you shall triumph, (and that thereby your hearts might be at rest. Victory) by means of the help of angels (cometh only from Allah, the Mighty) in His vengeance against those who do not believe in Him, (the Wise) in giving triumph and sovereignty to whomever He will; it is also said (the Wise) means: the Wise in that which befell you on the Day of Uhud.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "3:126",
            "8:10",
            "14:4",
            "35:2",
            "30:5",
            "8:63",
            "3:62",
            "4:158",
            "48:3",
            "6:57"
        ],
        "BIBLE": [
            "writings:i%20chronicles:17:19",
            "prophets:ezekiel:37:26",
            "prophets:judges:16:25",
            "torah:genesis:2:18",
            "prophets:jeremiah:32:40",
            "torah:exodus:34:10",
            "writings:proverbs:27:11",
            "writings:ii%20chronicles:29:10",
            "torah:exodus:31:6",
            "prophets:hosea:11:8"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:7",
            
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:12",
            "Sefer%20Yetzirah:4:10"
        ]
    }
}