{
    "VERSE": "3:131",
    "ARABIC": "وَٱتَّقُوا۟ ٱلنَّارَ ٱلَّتِىٓ أُعِدَّتْ لِلْكَٰفِرِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Have fear of the Fire which has been prepared for the kafirun.",
        "TRANSLATION_1": "Keep away from the Fire prepared for the infidels;\n",
        "TRANSLATION_2": "And have fear of the Fire which awaits those who deny the Truth.\n",
        "TRANSLATION_3": "Save yourselves from the fire which is prepared for the unbelievers.\n",
        "TRANSLATION_4": "And save yourselves from the fire which is prepared for disbelievers.\n",
        "TRANSLATION_5": "And fear the Fire, which is prepared for the disbelievers.\n",
        "TRANSLATION_6": "And guard yourselves against the fire which has been prepared for the unbelievers.\n",
        "TRANSLATION_7": "And fear the Fire prepared for the unbelievers,\n",
        "TRANSLATION_8": "And ward off (from yourselves) the Fire prepared for disbelievers.\n",
        "TRANSLATION_9": "guard yourself against the Fire prepared for those who deny the truth,\n",
        "TRANSLATION_10": "And beware of the Fire gotten ready for the infidels.\n",
        "TRANSLATION_11": "Beware of the Fire, which has been prepared for the faithless,\n",
        "TRANSLATION_12": "Fear the Fire, which is repaired for those who reject Faith:\n",
        "TRANSLATION_13": "And fear the Fire, which is prepared for the disbelievers.\n",
        "TRANSLATION_14": "Guard yourselves against the Fire prepared for unbelievers.\n",
        "TRANSLATION_15": "And guard yourselves against the Fire that is prepared for the disbelievers.\n",
        "TRANSLATION_16": "And fear the Fire, which has been prepared for the disbelievers.\n",
        "TRANSLATION_17": "[3:131] And fear the Fire that has been prepared for the disbelievers, lest you be chastised with it.\n",
        "TRANSLATION_18": "70 (And ward off (from yourselves) the Fire) fear the Fire regarding the consumption of usury which was (prepared) created (for disbelievers) in Allah and in the prohibition of usury.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "3:131",
            "52:14",
            "55:15",
            "56:71",
            "11:16",
            "23:104",
            "8:14",
            "36:80",
            "40:41",
            "92:14"
        ],
        "BIBLE": [
            "writings:proverbs:20:21",
            "writings:job:31:25",
            "prophets:isaiah:15:7",
            "prophets:isaiah:26:15",
            "prophets:ezekiel:28:4",
            "torah:exodus:15:16",
            "writings:job:20:18",
            "torah:deuteronomy:8:17",
            "writings:proverbs:13:11",
            "torah:genesis:42:2"
        ]
    }
}