{
    "VERSE": "3:132",
    "ARABIC": "وَأَطِيعُوا۟ ٱللَّهَ وَٱلرَّسُولَ لَعَلَّكُمْ تُرْحَمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Obey Allah and the Messenger so that hopefully you will gain mercy.",
        "TRANSLATION_1": "Obey God and the Prophet, that you may be treated with mercy.\n",
        "TRANSLATION_2": "And obey Allah and the Messenger, that you may be shown mercy. And hasten to the for-giveness of your Lord and to a Paradise as vast as the heavens and the earth, prepared for the God-fearing who spend in the way of Allah both in plenty and hardship, who restrain their anger, and forgive others. Allah loves such good-doers.\"\n",
        "TRANSLATION_3": "Obey God and the Messenger so that you may receive mercy.\n",
        "TRANSLATION_4": "And obey Allah and the Noble Messenger, hoping that you gain mercy. (Obeying the Prophet is in fact obeying Allah.)\n",
        "TRANSLATION_5": "And obey Allah and the Messenger that you may obtain mercy.\n",
        "TRANSLATION_6": "And obey Allah and the Apostle, that you may be shown mercy.\n",
        "TRANSLATION_7": "and obey God and the Messenger; haply so you will find mercy.\n",
        "TRANSLATION_8": "And obey Allah and the messenger, that ye may find mercy.\n",
        "TRANSLATION_9": "and obey God and the Messenger, so that you may be given mercy.\n",
        "TRANSLATION_10": "And obey Allah and the apostle, haply ye may be shewn mercy.\n",
        "TRANSLATION_11": "and obey Allah and the Apostle so that you may be granted [His] mercy.\n",
        "TRANSLATION_12": "And obey Allah and the Messenger; that ye may obtain mercy.\n",
        "TRANSLATION_13": "And obey Allah and the Messenger (Muhammad SAW) that you may obtain mercy.\n",
        "TRANSLATION_14": "Obey Allah and the Messenger in order to be subjected to mercy.\n",
        "TRANSLATION_15": "And obey God and the Messenger, that you may obtain mercy.\n",
        "TRANSLATION_16": "And obey Allah and the Messenger that you may obtain mercy.\n",
        "TRANSLATION_17": "[3:132] And obey God and the Messenger, so that you may find mercy.\n",
        "TRANSLATION_18": "(And obey Allah and the messenger) concerning the prohibition of usury and its avoidance, (that ye may find mercy) in order that mercy encompasses you such that you are saved and not punished.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "3:132",
            "3:32",
            "24:52",
            "63:1",
            "9:1",
            "8:46",
            "4:61",
            "47:33",
            "58:20",
            "5:99"
        ],
        "BIBLE": [
            "torah:deuteronomy:6:15",
            "torah:genesis:1:1",
            "torah:genesis:24:27",
            "torah:deuteronomy:10:14",
            "prophets:jeremiah:29:8",
            "prophets:ezekiel:31:18",
            "prophets:jeremiah:32:17",
            "writings:psalms:103:11",
            "prophets:jeremiah:23:20",
            "prophets:isaiah:45:18"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:5:1"
        ]
    }
}