{
    "VERSE": "3:134",
    "ARABIC": "ٱلَّذِينَ يُنفِقُونَ فِى ٱلسَّرَّآءِ وَٱلضَّرَّآءِ وَٱلْكَٰظِمِينَ ٱلْغَيْظَ وَٱلْعَافِينَ عَنِ ٱلنَّاسِ وَٱللَّهُ يُحِبُّ ٱلْمُحْسِنِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "those who give in times of both ease and hardship, those who control their rage and pardon other people - Allah loves the good-doers -",
        "TRANSLATION_1": "Who expend both in joy and tribulation, who suppress their anger and pardon their fellowmen; and God loves those who are upright and do good,\n",
        "TRANSLATION_2": "who spend in the way of Allah both in plenty and hardship, who restrain their anger, and forgive others. Allah loves such good-doers.\"\n",
        "TRANSLATION_3": "who spend their property for the cause of God in prosperity as well as in adversity and who also harness their anger and forgive the people. God loves the righteous ones.\n",
        "TRANSLATION_4": "Those who spend in Allah’s cause, in happiness and in grief, and who control their anger and are forgiving towards mankind; and the righteous are the beloved of Allah.\n",
        "TRANSLATION_5": "Those who spend (in Allah's cause) in prosperity and in adversity, who repress anger, and who pardon men; verily, Allah loves the Muhsinin (the good-doers).\n",
        "TRANSLATION_6": "Those who spend (benevolently) in ease as well as in straitness, and those who restrain (their) anger and pardon men; and Allah loves the doers of good (to others).\n",
        "TRANSLATION_7": "who expend in prosperity and adversity in almsgiving, and restrain their rage, and pardon the offences of their fellowmen; and God loves the good-doers;\n",
        "TRANSLATION_8": "Those who spend (of that which Allah hath given them) in ease and in adversity, those who control their wrath and are forgiving toward mankind; Allah loveth the good;\n",
        "TRANSLATION_9": "for those who spend, both in prosperity and adversity, who restrain their anger and are forgiving towards their fellow men -- God loves those who do good works.\n",
        "TRANSLATION_10": "Those who expend in weal and woe, and the repressors of rage and the pardoners of men; and Allah loveth the doers of good.\n",
        "TRANSLATION_11": "—those who spend in ease and adversity, and suppress their anger, and excuse [the faults of] the people, and Allah loves the virtuous;\n",
        "TRANSLATION_12": "Those who spend (freely), whether in prosperity, or in adversity; who restrain anger, and pardon (all) men;- for Allah loves those who do good;-\n",
        "TRANSLATION_13": "Those who spend [in Allah's Cause - deeds of charity, alms, etc.] in prosperity and in adversity, who repress anger, and who pardon men; verily, Allah loves Al-Muhsinun (the good-doers).\n",
        "TRANSLATION_14": "who spend in prosperity and in adversity, for those who curb their anger and those who forgive people. And Allah loves the charitable\n",
        "TRANSLATION_15": "Those who give in prosperity and adversity, and those who restrain anger, and those who forgive people. God loves the doers of good.\n",
        "TRANSLATION_16": "Who spend [in the cause of Allah] during ease and hardship and who restrain anger and who pardon the people - and Allah loves the doers of good;\n",
        "TRANSLATION_17": "[3:134] Who expend, in obedience to God, in prosperity and adversity, in [times of] ease and difficulty, and restrain their rage, [and] desist from following it up even though they are able to, and pardon their fellow-men, those who wrong them, waiving their punishment; and God loves those who are virtuous, through such actions, that is to say, He will reward them.\n",
        "TRANSLATION_18": "And then He showed who they were, saying: (Those who spend (of that which Allah hath given them) in ease and in adversity) He says: those who spend their wealth in the way of Allah is times of comfort and in times of hardship, (those who control their wrath) those who check their anger, keeping their hot- temperedness to themselves (and are forgiving towards mankind) towards slaves; (Allah loveth the good) He loves those who are kind towards slaves and freemen.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "3:134",
            "4:108",
            "110:2",
            "3:68",
            "10:11",
            "2:8",
            "8:47",
            "2:257",
            "3:173",
            "3:141"
        ],
        "BIBLE": [
            "torah:deuteronomy:26:11",
            "writings:psalms:111:6",
            "prophets:joshua:23:16",
            "writings:ecclesiastes:5:18",
            "torah:genesis:12:20",
            "torah:deuteronomy:16:17",
            "writings:proverbs:22:24",
            "torah:deuteronomy:3:20",
            "writings:proverbs:9:9",
            "torah:exodus:36:6"
        ]
    }
}