{
    "VERSE": "3:136",
    "ARABIC": "أُو۟لَٰٓئِكَ جَزَآؤُهُم مَّغْفِرَةٌ مِّن رَّبِّهِمْ وَجَنَّٰتٌ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَٰرُ خَٰلِدِينَ فِيهَا وَنِعْمَ أَجْرُ ٱلْعَٰمِلِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Their recompense is forgiveness from their Lord, and Gardens with rivers flowing under them, remaining in them timelessly, for ever. How excellent is the reward of those who act!",
        "TRANSLATION_1": "Their recompense is pardon by their Lord, and gardens with streams of running water where they will abide for ever. How fair is the recompense of those who act!\n",
        "TRANSLATION_2": "They shall be recompensed by forgiveness from their Lord and by gardens beneath which rivers flow; there they shall abide. How good is the reward of those who labour!\n",
        "TRANSLATION_3": "Their reward will be forgiveness from their Lord and gardens wherein streams flow and wherein they will live forever. How blessed is the reward of those who labor.\n",
        "TRANSLATION_4": "For such the reward is forgiveness from their Lord, and Gardens beneath which rivers flow – abiding in it forever; what an excellent reward for the performers (of good deeds)!\n",
        "TRANSLATION_5": "For such, the reward is forgiveness from their Lord, and Gardens with rivers flowing underneath (Paradise), wherein they shall abide forever. How excellent is this reward for the doers (of good).\n",
        "TRANSLATION_6": "(As for) these-- their reward is forgiveness from their Lord, and gardens beneath which rivers flow, to abide in them, and excellent is the reward of the laborers.\n",
        "TRANSLATION_7": "Those -- their recompense is forgiveness from their Lord, and gardens beneath which rivers flow, therein dwelling forever; and how excellent is the wage of those who labour!\n",
        "TRANSLATION_8": "The reward of such will be forgiveness from their Lord, and Gardens underneath which rivers flow, wherein they will abide for ever - a bountiful reward for workers!\n",
        "TRANSLATION_9": "their recompense is forgiveness from their Lord, and Gardens with rivers flowing through them, where they will abide forever. How excellent will be the reward of those who do good works.\n",
        "TRANSLATION_10": "Those! their meed is forgiveness from their Lord and Gardens whereunder rivers flow; they shall be abiders therein. Excellent is the hire of the workers!\n",
        "TRANSLATION_11": "Their reward is forgiveness from their Lord, and gardens with streams running in them, to remain in them [forever]. How excellent is the reward of the workers!\n",
        "TRANSLATION_12": "For such the reward is forgiveness from their Lord, and Gardens with rivers flowing underneath,- an eternal dwelling: How excellent a recompense for those who work (and strive)!\n",
        "TRANSLATION_13": "For such, the reward is Forgiveness from their Lord, and Gardens with rivers flowing underneath (Paradise), wherein they shall abide forever. How excellent is this reward for the doers (who do righteous deeds according to Allah's Orders).\n",
        "TRANSLATION_14": "Those, their recompense is forgiveness from their Lord and Gardens underneath which rivers flow, where they shall live for ever. How excellent is the wage of those who labor.\n",
        "TRANSLATION_15": "Those—their reward is forgiveness from their Lord, and gardens beneath which rivers flow, abiding therein forever. How excellent is the reward of the workers.\n",
        "TRANSLATION_16": "Those - their reward is forgiveness from their Lord and gardens beneath which rivers flow [in Paradise], wherein they will abide eternally; and excellent is the reward of the [righteous] workers.\n",
        "TRANSLATION_17": "[3:136] Those — their requital is forgiveness from their Lord, and Gardens beneath which rivers flow, abiding therein (khālidīna fīhā, an implied situation, that is, it is foreordained that they will abide in it once they enter it); excellent is the wage, this wage, of those workers, of obedience!\n",
        "TRANSLATION_18": "(The reward of such will be forgiveness) of their sins (from their Lord, and Gardens beneath) beneath its trees and habitations (which rivers) of wine, water, honey and milk (flow, wherein they will abide for ever) in Paradise, never to die or leave it, (a bountiful reward for workers!) the reward of those who repent is Paradise and all that which was mentioned.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "3:136",
            "20:76",
            "29:58",
            "5:85",
            "98:8",
            "10:9",
            "14:23",
            "22:14",
            "85:11",
            "16:31"
        ],
        "BIBLE": [
            "writings:song%20of%20songs:4:15",
            "writings:proverbs:5:15",
            "torah:numbers:19:17",
            "torah:leviticus:15:13",
            "prophets:ezekiel:32:14",
            "prophets:amos:6:12",
            "writings:ii%20chronicles:16:9",
            "writings:ecclesiastes:2:11",
            "torah:leviticus:23:3",
            "prophets:isaiah:26:12"
        ]
    }
}