{
    "VERSE": "3:14",
    "ARABIC": "زُيِّنَ لِلنَّاسِ حُبُّ ٱلشَّهَوَٰتِ مِنَ ٱلنِّسَآءِ وَٱلْبَنِينَ وَٱلْقَنَٰطِيرِ ٱلْمُقَنطَرَةِ مِنَ ٱلذَّهَبِ وَٱلْفِضَّةِ وَٱلْخَيْلِ ٱلْمُسَوَّمَةِ وَٱلْأَنْعَٰمِ وَٱلْحَرْثِ ذَٰلِكَ مَتَٰعُ ٱلْحَيَوٰةِ ٱلدُّنْيَا وَٱللَّهُ عِندَهُۥ حُسْنُ ٱلْمَـَٔابِ",
    "ENGLISH": {
        "TRANSLATION_0": "There was a sign for you in the two parties which met face to face, one party fighting in the Way of Allah and the other kafirun. You saw them as twice their number with your own eyes. Allah reinforces with His help whoever He wills. There is instruction in that for people of insight.",
        "TRANSLATION_1": "Enamoured are the people of the lust of (earthly) pleasures, of women and of children and hoarded heaps of gold and silver, well-bred horses, and tilled land and cattle, all (vain) goods and chattels of the life of this world, while the best of abodes is with God.\n",
        "TRANSLATION_2": "Men are naturally tempted by the lure of women, children, treasures of gold and silver, horses of mark, cattle and plantations. These are the enjoyments in the life of this world; but with Allah lies a goodly abode to return to.\n",
        "TRANSLATION_3": "Worldly desires, wives, children, accumulated treasures of gold and silver, horses of noble breed, cattle, and farms are all made to seem attractive to men. All these are the bounties of the worldly life but in the life to come God has the best place for people to dwell.\n",
        "TRANSLATION_4": "Beautified is for mankind the love of these desires – women, and sons, and heaps of gold and piled up silver, and branded horses, and cattle and fields; this is the wealth of the life of this world; and it is Allah, with Whom is the excellent abode.\n",
        "TRANSLATION_5": "Beautified for men is the love of things they covet; women, children, Qanatir Al-Muqantarah of gold and silver, branded beautiful horses (Musawwamah), cattle and fertile land. This is the pleasure of the present world's life; but Allah has the excellent return with Him.\n",
        "TRANSLATION_6": "The love of desires, of women and sons and hoarded treasures of gold and silver and well bred horses and cattle and tilth, is made to seem fair to men; this is the provision of the life of this world; and Allah is He with Whom is the good goal (of life).\n",
        "TRANSLATION_7": "Decked out fair to men is the love of lusts -- women, children, heaped-up heaps of gold and silver, horses of mark, cattle and tillage. That is the enjoyment of the present life; but God -- with Him is the fairest resort.\n",
        "TRANSLATION_8": "Beautified for mankind is love of the joys (that come) from women and offspring; and stored-up heaps of gold and silver, and horses branded (with their mark), and cattle and land. That is comfort of the life of the world. Allah! With Him is a more excellent abode.\n",
        "TRANSLATION_9": "The satisfaction of worldly desires through women, and children, and heaped-up treasures of gold and silver, and pedigreed horses, and cattle and lands is attractive to people. All this is the provision of the worldly life; but the most excellent abode is with God.\n",
        "TRANSLATION_10": "Fair-seeming is made unto men the love of pleasurable things from women and children and talents heaped-up of gold and silver and horses branded up and cattle and tilth. All that is the enjoyment of the life of the World, and Allah! with Him is the best resort.\n",
        "TRANSLATION_11": "The love of [worldly] allures, including women and children, accumulated piles of gold and silver, horses of mark, livestock, and farms has been made to seem decorous to mankind. Those are the wares of the life of this world, but the goodness of one’s ultimate destination lies near Allah.\n",
        "TRANSLATION_12": "Fair in the eyes of men is the love of things they covet: Women and sons; Heaped-up hoards of gold and silver; horses branded (for blood and excellence); and (wealth of) cattle and well-tilled land. Such are the possessions of this world's life; but in nearness to Allah is the best of the goals (To return to).\n",
        "TRANSLATION_13": "Beautified for men is the love of things they covet; women, children, much of gold and silver (wealth), branded beautiful horses, cattle and well-tilled land. This is the pleasure of the present world's life; but Allah has the excellent return (Paradise with flowing rivers, etc.) with Him.\n",
        "TRANSLATION_14": "Decorated for people are the desires of women, offspring, and of heaped up piles of gold and silver, of pedigree horses, cattle, and sown fields. These are the enjoyments of the worldly life, but with Allah is the best return.\n",
        "TRANSLATION_15": "Adorned for the people is the love of desires, such as women, and children, and piles upon piles of gold and silver, and branded horses, and livestock, and fields. These are the conveniences of the worldly life, but with God lies the finest resort.\n",
        "TRANSLATION_16": "Beautified for people is the love of that which they desire - of women and sons, heaped-up sums of gold and silver, fine branded horses, and cattle and tilled land. That is the enjoyment of worldly life, but Allah has with Him the best return.\n",
        "TRANSLATION_17": "[3:14] Beautified for mankind is love of lusts, that which the self lusts after and calls for, beautified by Satan, or by God as a test — of women, children, stored-up heaps of gold and silver, horses of mark, fine [horses], cattle, namely, camels, cows and sheep, and tillage, the cultivation of land. That, which is mentioned, is the comfort of the life of this world, enjoyed while it lasts, but then perishes; but God — with Him is the more excellent abode, place of return, which is Paradise, and for this reason one should desire none other than this [abode].\n",
        "TRANSLATION_18": "Allah then mentions the bounties of the life of this world that He has made attractive for the unbelievers, saying: (Beautified for mankind is) what people's hearts find desirable is (love of the joys (that come) from women) meaning slave women and wives (and offspring) slaves and children, (and stored up heaps) amassed wealth (of gold and silver) it is also said that this means: minted or engraved gold and silver, (and horses branded (with their mark)) beautiful branded horses and grazing in pastures, (and cattle) i.e. sheep, cows and camels (and land) cultivation and cultivated lands. (That) which is mentioned above (is comfort of the life of the world) is of benefit to people in the life of this world and then it vanishes; it is also said that this means: the joys of this world last only for as long as the stuff of any home, a bowl, a plate and the like. (Allah! With Him is a more excellent abode) in the Hereafter, i.e. Paradise, to whoever shun such joys.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "3:14",
            "42:36",
            "28:60",
            "2:204",
            "13:26",
            "43:35",
            "3:148",
            "22:30",
            "2:223",
            "13:34"
        ],
        "BIBLE": [
            "prophets:jeremiah:32:44",
            "prophets:i%20kings:20:7",
            "prophets:i%20kings:12:24",
            "torah:numbers:16:14",
            "prophets:i%20kings:13:33",
            "writings:ezra:1:4",
            "prophets:ezekiel:39:17",
            "prophets:ezekiel:38:20",
            "writings:daniel:11:28",
            "torah:exodus:18:21"
        ]
    }
}