{
    "VERSE": "3:141",
    "ARABIC": "وَلِيُمَحِّصَ ٱللَّهُ ٱلَّذِينَ ءَامَنُوا۟ وَيَمْحَقَ ٱلْكَٰفِرِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "and so that Allah can purge those who have iman and wipe out the kafirun.",
        "TRANSLATION_1": "This is so that God may try the faithful and destroy the unbelievers.\n",
        "TRANSLATION_2": "and makes men go through trials in order that He might purge the believers and blot out those who deny the Truth.\n",
        "TRANSLATION_3": "test the faith of the believers, and deprive the unbelievers of (His) blessings.\n",
        "TRANSLATION_4": "And so that Allah may purify* the believers, and destroy the disbelievers. (* Forgive them their sins, if any.)\n",
        "TRANSLATION_5": "And that Allah may test those who believe and destroy the disbelievers..\n",
        "TRANSLATION_6": "And that He may purge those who believe and deprive the unbelievers of blessings.\n",
        "TRANSLATION_7": "and that God may prove the believers, and blot out the unbelievers.\n",
        "TRANSLATION_8": "And that Allah may prove those who believe, and may blight the disbelievers.\n",
        "TRANSLATION_9": "so that God may purge those who believe and wipe out those who deny the truth.\n",
        "TRANSLATION_10": "And that Allah may purge those who believe and destroy the infidels.\n",
        "TRANSLATION_11": "And so that Allah may purge [the hearts of] those who have faith and that He may wipe out the faithless.\n",
        "TRANSLATION_12": "Allah's object also is to purge those that are true in Faith and to deprive of blessing Those that resist Faith.\n",
        "TRANSLATION_13": "And that Allah may test (or purify) the believers (from sins) and destroy the disbelievers.\n",
        "TRANSLATION_14": "and so that Allah will examine those who believe and efface the unbelievers.\n",
        "TRANSLATION_15": "So that God may prove those who believe, and eliminate the disbelievers.\n",
        "TRANSLATION_16": "And that Allah may purify the believers [through trials] and destroy the disbelievers.\n",
        "TRANSLATION_17": "[3:141] And that God may prove the believers, purifying them of sins through what befalls them, and efface, that is, destroy, the disbelievers.\n",
        "TRANSLATION_18": "(And that Allah may prove) may forgive (those who believe) for that which befalls them in jihad, (and may blight the disbelievers) and may destroy the unbelievers in war.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "3:141",
            "29:11",
            "9:119",
            "9:43",
            "16:128",
            "40:79",
            "18:4",
            "3:200",
            "13:28",
            "2:15"
        ],
        "BIBLE": [
            "writings:psalms:104:15",
            "prophets:jeremiah:16:20",
            "writings:i%20chronicles:12:39",
            "writings:ecclesiastes:9:1",
            "writings:ii%20chronicles:29:10",
            "prophets:jeremiah:32:40",
            "prophets:ezekiel:30:12",
            "writings:proverbs:27:11",
            "writings:psalms:74:8",
            "torah:genesis:12:2"
        ]
    }
}