{
    "VERSE": "3:142",
    "ARABIC": "أَمْ حَسِبْتُمْ أَن تَدْخُلُوا۟ ٱلْجَنَّةَ وَلَمَّا يَعْلَمِ ٱللَّهُ ٱلَّذِينَ جَٰهَدُوا۟ مِنكُمْ وَيَعْلَمَ ٱلصَّٰبِرِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Or did you imagine that you were going to enter the Garden without Allah knowing those among you who had struggled and knowing the steadfast?",
        "TRANSLATION_1": "Do you think you will go to Paradise while God does not know who among you strive and persist?\n",
        "TRANSLATION_2": "Did you think that you would enter Paradise even though Allah has not yet seen who among you strove hard in His way and remained steadfast?\n",
        "TRANSLATION_3": "Did you think that you could go to Paradise before God knew which of you fought for His cause and which of you bore patience?\n",
        "TRANSLATION_4": "What! You assume that you will enter Paradise while Allah has not yet tested your warriors, nor yet tested the steadfast?\n",
        "TRANSLATION_5": "Do you think that you will enter Paradise before Allah knows (tests) those of you who performed Jihad and knows (tests) those who are patient\n",
        "TRANSLATION_6": "Do you think that you will enter the garden while Allah has not yet known those who strive hard from among you, and (He has not) known the patient.\n",
        "TRANSLATION_7": "Or did you suppose you should enter Paradise without God know who of you have struggled and who are patient?\n",
        "TRANSLATION_8": "Or deemed ye that ye would enter paradise while yet Allah knoweth not those of you who really strive, nor knoweth those (of you) who are steadfast?\n",
        "TRANSLATION_9": "Do you suppose that you would enter the Garden, without God knowing those among you who would strive hard for His cause and endure with fortitude?\n",
        "TRANSLATION_10": "Or, deem ye that ye shall enter the Garden while yet Allah hath not known those of you who have striven hard nor yet known the steadfast!\n",
        "TRANSLATION_11": "Do you suppose that you would enter paradise, while Allah has not yet ascertained those of you who have waged jihad and He has not ascertained the steadfast?\n",
        "TRANSLATION_12": "Did ye think that ye would enter Heaven without Allah testing those of you who fought hard (In His Cause) and remained steadfast?\n",
        "TRANSLATION_13": "Do you think that you will enter Paradise before Allah tests those of you who fought (in His Cause) and (also) tests those who are As-Sabirin (the patient ones, etc.)?\n",
        "TRANSLATION_14": "Did you suppose that you would enter Paradise without Allah knowing those of you who struggled and who were patient?\n",
        "TRANSLATION_15": "Or do you expect to enter Paradise, before God has distinguished those among you who strive, and before He has distinguished the steadfast?\n",
        "TRANSLATION_16": "Or do you think that you will enter Paradise while Allah has not yet made evident those of you who fight in His cause and made evident those who are steadfast?\n",
        "TRANSLATION_17": "[3:142] Or, nay, did you suppose you should enter Paradise without God knowing, through knowledge manifested outwardly, who among you have struggled and who are patient, in [times of] hardship?\n",
        "TRANSLATION_18": "(Or deemed ye) do you think, group of believers (that you would enter Paradise) without fighting (while yet Allah knoweth not) has not seen (those of you who really strive) in the way of Allah on the Day of Uhud, (nor knoweth those (of you) who are steadfast?) has not see those who are steadfast in the fight against their enemies on the Day of Uhud.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "3:142",
            "22:14",
            "41:30",
            "3:141",
            "5:93",
            "29:11",
            "7:50",
            "9:119",
            "37:96",
            "7:49"
        ],
        "BIBLE": [
            "prophets:ezekiel:14:23",
            "writings:i%20chronicles:29:17",
            "prophets:jonah:3:10",
            "torah:leviticus:5:1",
            "torah:genesis:24:56",
            "prophets:isaiah:57:18",
            "prophets:joshua:23:3",
            "prophets:isaiah:43:19",
            "prophets:isaiah:58:2",
            "prophets:i%20samuel:3:13"
        ]
    }
}