{
    "VERSE": "3:143",
    "ARABIC": "وَلَقَدْ كُنتُمْ تَمَنَّوْنَ ٱلْمَوْتَ مِن قَبْلِ أَن تَلْقَوْهُ فَقَدْ رَأَيْتُمُوهُ وَأَنتُمْ تَنظُرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "You were longing for death before you met it. Now you have seen it with your own eyes.",
        "TRANSLATION_1": "You had wished to know death before you faced it (in battle); so now you have seen it before your own eyes.\n",
        "TRANSLATION_2": "You previously longed for death (in the way of Allah): now you have faced it, observing it with your own eyes.\n",
        "TRANSLATION_3": "You certainly wished to die (for the cause of God) before you actually faced death. Then you faced death (in the battlefield and only a few of you had the true desire to die).\n",
        "TRANSLATION_4": "And you used to wish for death before you met it; so now you see it before your eyes.\n",
        "TRANSLATION_5": "You did indeed wish for death before you met it. Now you have seen it openly with your own eyes.\n",
        "TRANSLATION_6": "And certainly you desired death before you met it, so indeed you have seen it and you look (at it)\n",
        "TRANSLATION_7": "You were longing for death before you met it; now you have seen it, while you were beholding.\n",
        "TRANSLATION_8": "And verily ye used to wish for death before ye met it (in the field). Now ye have seen it with your eyes!\n",
        "TRANSLATION_9": "You were longing for death, before you met it. Now you have seen it with your own eyes.\n",
        "TRANSLATION_10": "And assuredly ye were wont to long for death ere ye had met it. Now ye are beholding it even while ye are looking on.\n",
        "TRANSLATION_11": "Certainly you were longing for death before you had encountered it. Then certainly, you saw it, as you were looking on.\n",
        "TRANSLATION_12": "Ye did indeed wish for death before ye met him: Now ye have seen him with your own eyes, (And ye flinch!)\n",
        "TRANSLATION_13": "You did indeed wish for death (Ash-Shahadah - martyrdom) before you met it. Now you have seen it openly with your own eyes.\n",
        "TRANSLATION_14": "You used to wish for death before you met it, so you have seen it while you were looking.\n",
        "TRANSLATION_15": "You used to wish for death before you have faced it. Now you have seen it before your own eyes.\n",
        "TRANSLATION_16": "And you had certainly wished for martyrdom before you encountered it, and you have [now] seen it [before you] while you were looking on.\n",
        "TRANSLATION_17": "[3:143] You were longing for (tamannawna: one of the two letters tā’ has been omitted from the original [tatamannawna]) death before you met it, when you said, ‘Would that we had a day like the Day of Badr in order to attain what its martyrs attained.’ Now you have seen it, that is, the cause of it, war, looking on, that is, with your eyes [open] and contemplating the conditions, so why did you retreat?\n",
        "TRANSLATION_18": "(And verily ye used to wish for death) in war (before ye met it (in the field)) on the Day of Uhud. (Now ye have seen it) you have seen fighting and war on the Day of Uhud, (with your eyes!) you saw the swords of the unbelievers, ran away from them and did not remain unshaken with your Prophet!\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "3:143",
            "30:49",
            "63:10",
            "4:159",
            "39:50",
            "10:91",
            "5:102",
            "39:65",
            "69:9",
            "20:115"
        ],
        "BIBLE": [
            "torah:genesis:24:63",
            "prophets:ii%20kings:6:20",
            "prophets:judges:13:22",
            "prophets:judges:6:22",
            "writings:i%20chronicles:29:17",
            "torah:deuteronomy:22:25",
            "prophets:ii%20kings:9:27",
            "prophets:ezekiel:36:23",
            "torah:deuteronomy:11:7",
            "prophets:ii%20kings:9:26"
        ]
    }
}