{
    "VERSE": "3:147",
    "ARABIC": "وَمَا كَانَ قَوْلَهُمْ إِلَّآ أَن قَالُوا۟ رَبَّنَا ٱغْفِرْ لَنَا ذُنُوبَنَا وَإِسْرَافَنَا فِىٓ أَمْرِنَا وَثَبِّتْ أَقْدَامَنَا وَٱنصُرْنَا عَلَى ٱلْقَوْمِ ٱلْكَٰفِرِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "All they said was, 'Our Lord, forgive us our wrong actions and any excesses we went to in what we did and make our feet firm and help us against these kafir people.'",
        "TRANSLATION_1": "Nor did they say aught but: \"O our Lord, forgive us our sins and excesses in our acts, and steady our steps, and help us against unbelieving people.\"\n",
        "TRANSLATION_2": "And all they said was this: 'Our Lord! Forgive us our sins, and our excesses, and set our feet firm, and succour us against those who deny the Truth.'\n",
        "TRANSLATION_3": "The only words that they spoke were, \"Lord, forgive our sins and our excess in our dealings, make us steadfast (in the fight for Your cause), and grant us victory over the unbelievers.\"\n",
        "TRANSLATION_4": "And they never said anything except that they invoked, “Our Lord! Forgive us our sins and the excesses committed during our efforts, and keep our feet steady, and bestow us help over the disbelievers.”\n",
        "TRANSLATION_5": "And they said nothing but: \"Our Lord! Forgive us our sins and our transgressions, establish our feet firmly, and give us victory over the disbelieving folk.\"\n",
        "TRANSLATION_6": "And their saying was no other than that they said: Our Lord! forgive us our faults and our extravagance in our affair and make firm our feet and help us against the unbelieving people.\n",
        "TRANSLATION_7": "Nothing else they said but, 'Lord, forgive us our sins, and that we exceeded in our affair, and make firm our feet, and help us against the people of the unbelievers.'\n",
        "TRANSLATION_8": "Their cry was only that they said: Our Lord! forgive us for our sins and wasted efforts, make our foothold sure, and give us victory over the disbelieving folk.\n",
        "TRANSLATION_9": "All they said was, \"Our Lord, forgive us our sins and our excesses. Make our feet firm, and help us against those who deny the truth,\"\n",
        "TRANSLATION_10": "And their speech was naught but that they said: our Lord! forgive us our sins and our extravagance in our affairs, and make our foothold firm, and make us triumph over the disbelieving people.\n",
        "TRANSLATION_11": "All that they said was, ‘Our Lord, forgive us our sins and our excesses in our affairs, make our feet steady, and help us against the faithless lot.’\n",
        "TRANSLATION_12": "All that they said was: \"Our Lord! Forgive us our sins and anything We may have done that transgressed our duty: Establish our feet firmly, and help us against those that resist Faith.\"\n",
        "TRANSLATION_13": "And they said nothing but: \"Our Lord! Forgive us our sins and our transgressions (in keeping our duties to You), establish our feet firmly, and give us victory over the disbelieving folk.\"\n",
        "TRANSLATION_14": "Their only words were: 'Lord, forgive us our sins and that we exceeded in our affair, make us firm of foot and give us victory over the unbelievers'\n",
        "TRANSLATION_15": "Their only words were, “Our Lord, forgive us our offences, and our excesses in our conduct, and strengthen our foothold, and help us against the disbelieving people.”\n",
        "TRANSLATION_16": "And their words were not but that they said, \"Our Lord, forgive us our sins and the excess [committed] in our affairs and plant firmly our feet and give us victory over the disbelieving people.\"\n",
        "TRANSLATION_17": "[3:147] All that they said, when their prophet had been killed while they stood their ground and were steadfast, was, ‘Our Lord, forgive us our sins and our excesses, our overstepping the bounds, in our affairs, a declaration of the fact that what had befallen them was the result of their evil actions and a humbling of their selves, and make firm our feet, with strength for the struggle, and help us against the unbelieving folk’.\n",
        "TRANSLATION_18": "(Their cry) the cry of the believers after the killing of their prophet (was only that they said: Our Lord) our Lord! (Forgive us for our sins) sins other than the enormities (and wasted efforts) by committing grave sins, i.e. enormities, (make our foothold sure) in war, (and give us victory over the disbelieving folk).\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "3:147",
            "2:250",
            "23:106",
            "29:30",
            "23:94",
            "5:84",
            "7:58",
            "28:21",
            "46:25",
            "26:10"
        ],
        "BIBLE": [
            "writings:psalms:32:5",
            "torah:numbers:21:8",
            "torah:exodus:36:5",
            "prophets:isaiah:3:16",
            "torah:deuteronomy:4:10",
            "prophets:i%20kings:12:9",
            "writings:ii%20chronicles:10:9",
            "writings:psalms:140:5",
            "torah:genesis:41:9",
            "torah:exodus:34:10"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:3"
        ]
    }
}