{
    "VERSE": "3:15",
    "ARABIC": "قُلْ أَؤُنَبِّئُكُم بِخَيْرٍ مِّن ذَٰلِكُمْ لِلَّذِينَ ٱتَّقَوْا۟ عِندَ رَبِّهِمْ جَنَّٰتٌ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَٰرُ خَٰلِدِينَ فِيهَا وَأَزْوَٰجٌ مُّطَهَّرَةٌ وَرِضْوَٰنٌ مِّنَ ٱللَّهِ وَٱللَّهُ بَصِيرٌۢ بِٱلْعِبَادِ",
    "ENGLISH": {
        "TRANSLATION_0": "To mankind the love of worldly appetites is painted in glowing colours: women and children, and heaped- up mounds of gold and silver, and horses with fine markings, and livestock and fertile farmland. All that is",
        "TRANSLATION_1": "Say: \"Shall I tell you of (things) even better? With the Lord are gardens with running streams of water for those who keep from evil and follow the straight path, where they will live unchanged with the purest of companions and blessings of God.\" And under God's eyes are devotees\n",
        "TRANSLATION_2": "Say: 'Shall I tell you of things better than these? For the God-fearing there are, with their Lord, gardens beneath which rivers flow; there they will abide for ever, will have spouses of stainless purity as companions, and will enjoy the good pleasure of Allah.' Allah thoroughly observes His servants.\n",
        "TRANSLATION_3": "(Muhammad), ask them, \"Shall I tell you what is far superior to worldly pleasures? Those who have fear of God will have (as their reward) gardens wherein streams flow and wherein they will live forever with their purified spouses and with the consent of God. God knows all about His servants.\"\n",
        "TRANSLATION_4": "Say (O dear Prophet Mohammed – peace and blessings be upon him), “Shall I inform you of something better than that? For the pious, with their Lord, are Gardens beneath which rivers flow – they will abide in it forever – and pure wives, and Allah’s pleasure”; and Allah sees the bondmen.\n",
        "TRANSLATION_5": "Say: \"Shall I inform you of things far better than those For those who have Taqwa there are Gardens (Paradise) with their Lord, underneath which rivers flow. Therein (is their) eternal (home) and Azwajun Mutahharatun (purified mates or wives). And Allah will be pleased with them. And Allah is All-Seer of the servants.\"\n",
        "TRANSLATION_6": "Say: Shall I tell you what is better than these? For those who guard (against evil) are gardens with their Lord, beneath which rivers flow, to abide in them, and pure mates and Allah's pleasure; and Allah sees the servants.\n",
        "TRANSLATION_7": "Say: 'Shall I tell you of a better than that?' For those that are godfearing, with their Lord are gardens underneath which rivers flow, therein dwelling forever, and spouses purified, and God's good pleasure. And God sees His servants\n",
        "TRANSLATION_8": "Say: Shall I inform you of something better than that? For those who keep from evil, with their Lord, are Gardens underneath which rivers flow wherein they will abide, and pure companions, and contentment from Allah. Allah is Seer of His bondmen,\n",
        "TRANSLATION_9": "Say, \"Shall I tell you of something better than all of these? For the God-fearing, there are Gardens in nearness to their God with rivers flowing through them where they shall live forever with pure spouses and the goodwill of God. God is watching His servants --\n",
        "TRANSLATION_10": "Say thou! Shall I declare unto you that which is better than these For those who fear Allah are Gardens with their Lord, there under rivers flow, wherein they shall be abiders, and spouses purified, and pleasure from Allah. And Allah is Beholder of His bondsmen\n",
        "TRANSLATION_11": "Say, ‘Shall I inform you of something better than that? For those who are Godwary there will be gardens near their Lord, with streams running in them, to remain in them [forever], and chaste mates, and Allah’s pleasure.’ And Allah watches His servants.\n",
        "TRANSLATION_12": "Say: Shall I give you glad tidings of things Far better than those? For the righteous are Gardens in nearness to their Lord, with rivers flowing beneath; therein is their eternal home; with companions pure (and holy); and the good pleasure of Allah. For in Allah's sight are (all) His servants,-\n",
        "TRANSLATION_13": "Say: \"Shall I inform you of things far better than those? For Al-Muttaqun (the pious - see V. 2:2) there are Gardens (Paradise) with their Lord, underneath which rivers flow. Therein (is their) eternal (home) and Azwajun Mutahharatun (purified mates or wives) [i.e. they will have no menses, urine, or stool, etc.], And Allah will be pleased with them. And Allah is All-Seer of the (His) slaves\".\n",
        "TRANSLATION_14": "Say: 'Shall I tell you of a better thing than that? For the cautious with their Lord, theirs shall be Gardens underneath which rivers flow, where they shall live for ever, and purified spouses, and pleasure from Allah' Allah is watching over His worshipers.\n",
        "TRANSLATION_15": "Say, “Shall I inform you of something better than that? For those who are righteous, with their Lord are Gardens beneath which rivers flow, where they will remain forever, and purified spouses, and acceptance from God.” God is Observant of the servants.\n",
        "TRANSLATION_16": "Say, \"Shall I inform you of [something] better than that? For those who fear Allah will be gardens in the presence of their Lord beneath which rivers flow, wherein they abide eternally, and purified spouses and approval from Allah. And Allah is Seeing of [His] servants -\n",
        "TRANSLATION_17": "[3:15] Say, O Muhammad (s) to your people, ‘Shall I tell you, shall I inform you, of something better than that?, [that] which has been mentioned of lusts (this interrogative is meant as an affirmative). For those that are fearful, of idolatry, with their Lord (‘inda rabbihim is the predicate, the subject being [the following jannātun…]’) are Gardens underneath which rivers flow, abiding therein, decreed for them [therein] is eternal life, when they enter it, and spouses purified, of menstruation and other impurities, and beatitude (read ridwān or rudwān, meaning ‘much pleasure’) from God; and God is Seer, knower, of His servants, requiting each of them according to his deeds.\n",
        "TRANSLATION_18": "53 Then Allah elucidated the bliss of the Hereafter, its permanence and favour, just as He exposited the joys of the life of this world, by saying: (Say) Muhammad, to the unbelievers: (Shall I inform you of something better than that?) better than the embellishments of this world. (For those who keep from evil) keep from disbelief, ascribing partners to Allah and indecencies, in reference to Abu Bakr and his fellow believers, (with their Lord, are Gardens beneath which) beneath its trees and habitations (rivers) of wine, honey, milk and water (flow, wherein they will abide for ever) they will dwell in Paradise: they shall neither die nor leave it (and pure companions) they have therein spouses who are spared menses and filth, (and contentment from Allah) and the contentment of Allah is far greater than the bliss they enjoy. (Allah is Seer of His bondmen) He is Seer of the believers, their places in Paradise, as well as their works in the life of this world.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "3:15",
            "3:198",
            "98:8",
            "5:85",
            "16:31",
            "25:10",
            "9:100",
            "4:57",
            "48:5",
            "22:14"
        ],
        "BIBLE": [
            "writings:i%20chronicles:29:17",
            "prophets:ezekiel:13:3",
            "prophets:isaiah:55:5",
            "writings:proverbs:25:7",
            "writings:psalms:40:6",
            "prophets:zechariah:4:10",
            "prophets:ii%20kings:5:20",
            "prophets:i%20kings:18:36",
            "torah:exodus:33:17",
            "torah:deuteronomy:4:3"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:4:4"
        ]
    }
}