{
    "VERSE": "3:156",
    "ARABIC": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ لَا تَكُونُوا۟ كَٱلَّذِينَ كَفَرُوا۟ وَقَالُوا۟ لِإِخْوَٰنِهِمْ إِذَا ضَرَبُوا۟ فِى ٱلْأَرْضِ أَوْ كَانُوا۟ غُزًّى لَّوْ كَانُوا۟ عِندَنَا مَا مَاتُوا۟ وَمَا قُتِلُوا۟ لِيَجْعَلَ ٱللَّهُ ذَٰلِكَ حَسْرَةً فِى قُلُوبِهِمْ وَٱللَّهُ يُحْىِۦ وَيُمِيتُ وَٱللَّهُ بِمَا تَعْمَلُونَ بَصِيرٌ",
    "ENGLISH": {
        "TRANSLATION_0": "You who have iman! do not be like those who are kafir and say of their brothers, when they are going on journeys or military expeditions, 'If they had only been with us, they would not have died or been killed,' so that Allah can make that anguish for them in their hearts. It is Allah Who gives life and causes to die. Allah sees what you do.",
        "TRANSLATION_1": "O you who believe, do not be like those who deny, and say of their brethren (who died) travelling in the land or fighting: \"Had they stayed with us here they would not have died or been killed.\" This happened so that God may fill their hearts with grief. God is the giver of life and death and sees all that you do.\n",
        "TRANSLATION_2": "Believers, do not behave like those who disbelieved and say to their brothers (who meet some mishap) in the course of their journey for fighting: 'Had they remained with us, they would not have died nor been slain.' Allah makes such thoughts the cause of deep regrets in their hearts. For in truth it is Allah alone who grants life and deals death. Allah sees all that you do.\n",
        "TRANSLATION_3": "Believers, do not be like the unbelievers, who said of their brothers who travelled in the land or took part in a fight, \"Had they stayed with us, they would not have died or been killed.\" God will only cause regret to enter their hearts. It is God who gives life and causes people to die. God is Well Aware of what you do.\n",
        "TRANSLATION_4": "O People who Believe! Do not be like the disbelievers who said regarding their brothers who went on a journey or on holy war, “If they had been here with us they would not have died or been killed” – so that Allah may make it as despair in their hearts; and Allah gives life and causes death; and Allah is seeing your deeds.\n",
        "TRANSLATION_5": "O you who believe! Be not like those who disbelieve and who say to their brethren when they travel through the earth or go out to fight: \"If they had stayed with us, they would not have died or been killed,\" so that Allah may make it a cause of regret in their hearts. It is Allah that gives life and causes death. And Allah is All-Seer of what you do.\n",
        "TRANSLATION_6": "O you who believe! be not like those who disbelieve and say of their brethren when they travel in the earth or engage in fighting: Had they been with us, they would not have died and they would not have been slain; so Allah makes this to be an intense regret in their hearts; and Allah gives life and causes death and Allah sees what you do.\n",
        "TRANSLATION_7": "O believers, be not as the unbelievers who say to their brothers, when they journey in the land, or are upon expeditions, 'If they had been with us, they would not have died and not been slain' -- that God may make that an anguish in their hearts. For God gives life, and He makes to die; and God sees the things you do.\n",
        "TRANSLATION_8": "O ye who believe! Be not as those who disbelieved and said of their brethren who went abroad in the land or were fighting in the field: If they had been (here) with us they would not have died or been killed: that Allah may make it anguish in their hearts. Allah giveth life and causeth death; and Allah is Seer of what ye do.\n",
        "TRANSLATION_9": "Believers, do not be like those who are bent on denying the truth and who say of their brothers, when they travel about the land or go forth to war, \"Had they but remained with us, they would not have died, or been slain\" -- for God will cause such thoughts to become a source of bitter regret in their hearts, since it is God who gives life and causes death. And God sees all that you do.\n",
        "TRANSLATION_10": "O O Ye who believe! be not like unto those who disbelieve and say of their brethren when they journey in the land or go to religious war: had they been with, they had not died nor had they been slain; this is in order that Allah may cause an anguish in their hearts. And it is Allah who maketh alive and causeth to die, and Allah is of that which ye work Beholder.\n",
        "TRANSLATION_11": "O you who have faith! Do not be like the faithless who say of their brethren, when they travel in the land or go into battle, ‘Had they stayed with us they would not have died or been killed,’ so that Allah may make it a regret in their hearts. But Allah gives life and brings death, and Allah watches what you do.\n",
        "TRANSLATION_12": "O ye who believe! Be not like the Unbelievers, who say of their brethren, when they are travelling through the Earth or engaged in fighting: \"If they had stayed with us, they would not have died, or been slain.\" This that Allah may make it a cause of sighs and regrets in their hearts. It is Allah that gives Life and Death, and Allah sees well all that ye do.\n",
        "TRANSLATION_13": "O you who believe! Be not like those who disbelieve (hypocrites) and who say to their brethren when they travel through the earth or go out to fight: \"If they had stayed with us, they would not have died or been killed,\" so that Allah may make it a cause of regret in their hearts. It is Allah that gives life and causes death. And Allah is All-Seer of what you do.\n",
        "TRANSLATION_14": "Believers, do not be as those who disbelieve and say of their brothers when they journey in the land or go of to battle: 'Had they stayed with us, they would not have died, nor would they have been killed' In order that Allah will make that a regret in their hearts. Allah revives and causes to die. He has knowledge of what you do.\n",
        "TRANSLATION_15": "O you who believe! Do not be like those who disbelieved, and said of their brethren who marched in the land, or went on the offensive, “Had they stayed with us, they would not have died or been killed.” So that God may make it a cause of regret in their hearts. God gives life and causes death. God is Seeing of what you do.\n",
        "TRANSLATION_16": "O you who have believed, do not be like those who disbelieved and said about their brothers when they traveled through the land or went out to fight, \"If they had been with us, they would not have died or have been killed,\" so Allah makes that [misconception] a regret within their hearts. And it is Allah who gives life and causes death, and Allah is Seeing of what you do.\n",
        "TRANSLATION_17": "[3:156] O you who believe, be not as the disbelievers, that is, [as] the hypocrites, who say of their brothers, that is, regarding their affair, when they travel in the land, and then die, or are on raiding campaigns (ghuzzan, ‘a raiding party’, is the plural of ghāzin), and are then slain, ‘Had they been with us, they would not have died and would not have been slain’, in other words, do not say as they say — so that God may make that, saying [of theirs], as a conclusion of their affair, anguish in their hearts. For God gives life, and He gives death, and so no staying put can prevent death, and God sees what you do (ta‘malūna, or ya‘malūna, ‘they do’), and He will requite you for it.\n",
        "TRANSLATION_18": "Then Allah said to the Companions of Muhammad: (0 ye who believe!) in Muhammad and the Qur'an. (Be not) in war (as those who disbelieved) in secret, i.e. 'Abdullah Ibn Ubayy and his followers who returned to Medina (and said of their brethren) the hypocrites (who went abroad in the land) who journeyed with the Companions of Muhammad (or were fighting in the field) or went with their Prophet in a fighting expedition: (If they had been (here) with us) in Medina (they would not have died) on their journey (or been killed) during the fighting expedition; (that Allah may make it) make that doubt (anguish) grief (in their hearts. Allah giveth life) on the journey (and causeth death) settlement; (and Allah is Seer of what ye do) of what you say.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "3:156",
            "63:7",
            "2:76",
            "53:31",
            "3:163",
            "10:18",
            "2:110",
            "3:126",
            "33:69",
            "33:5"
        ],
        "BIBLE": [
            "torah:genesis:3:6",
            "prophets:judges:9:48",
            "torah:numbers:32:9",
            "torah:exodus:32:1",
            "torah:exodus:34:10",
            "prophets:ii%20kings:10:15",
            "prophets:hosea:2:14",
            "torah:leviticus:10:17",
            "prophets:i%20kings:12:28",
            "prophets:ii%20samuel:7:23"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:6:2"
        ]
    }
}