{
    "VERSE": "3:157",
    "ARABIC": "وَلَئِن قُتِلْتُمْ فِى سَبِيلِ ٱللَّهِ أَوْ مُتُّمْ لَمَغْفِرَةٌ مِّنَ ٱللَّهِ وَرَحْمَةٌ خَيْرٌ مِّمَّا يَجْمَعُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "If you are killed in the Way of Allah or if you die, forgiveness and mercy from Allah are better than anything you can acquire.",
        "TRANSLATION_1": "If you are killed in the cause of God or you die, the forgiveness and mercy of God are better than all that you amass.\n",
        "TRANSLATION_2": "And were you to be slain or to die in the way of Allah, then surely Allah's forgiveness and mercy are better than all the goods they amass.\n",
        "TRANSLATION_3": "If you were to die or to be killed for the cause of God, certainly His forgiveness and mercy is far better than your worldly gains.\n",
        "TRANSLATION_4": "And if you are killed in Allah’s way or die, then the pardon from Allah and mercy are better than all what they hoard.\n",
        "TRANSLATION_5": "And if you are killed or die in the way of Allah, forgiveness and mercy from Allah are far better than all that they amass.\n",
        "TRANSLATION_6": "And if you are slain in the way of Allah or you die, certainly forgiveness from Allah and mercy is better than what they amass.\n",
        "TRANSLATION_7": "If you are slain or die in God's way, forgiveness and mercy from God are a better thing than that you amass;\n",
        "TRANSLATION_8": "And what though ye be slain in Allah's way or die therein? Surely pardon from Allah and mercy are better than all that they amass.\n",
        "TRANSLATION_9": "If you are killed or die in God's cause, then surely forgiveness from God and His grace are better than all that one could amass.\n",
        "TRANSLATION_10": "Verily if ye be slain in the way of Allah or die, forgiveness from Allah and mercy are surely better than that which they amass.\n",
        "TRANSLATION_11": "If you are slain in the way of Allah, or die, forgiveness and mercy from Allah are surely better than what they amass.\n",
        "TRANSLATION_12": "And if ye are slain, or die, in the way of Allah, forgiveness and mercy from Allah are far better than all they could amass.\n",
        "TRANSLATION_13": "And if you are killed or die in the Way of Allah, forgiveness and mercy from Allah are far better than all that they amass (of worldly wealths, etc.).\n",
        "TRANSLATION_14": "If you should be killed in the way of Allah or die, the Forgiveness and Mercy from Allah would surely be better than all you amass.\n",
        "TRANSLATION_15": "If you are killed in the cause of God, or die—forgiveness and mercy from God are better than what they hoard.\n",
        "TRANSLATION_16": "And if you are killed in the cause of Allah or die - then forgiveness from Allah and mercy are better than whatever they accumulate [in this world].\n",
        "TRANSLATION_17": "[3:157] And if (wa-la-in, the lām is for oaths) you are slain in God’s way, in [holy] struggle, or die (read muttum or mittum, from [singular form] māta, yamūtu), that is, if death comes to you thereat, forgiveness, that is, from God, for your sins, and mercy, therefor from Him for you (the clause introduced by the lām [of lamaghfiratun, ‘forgiveness’] is the response to the oath [clause of la’in], and occupies the place of the verbal action as a subject, the predicate of which [is what follows]) are better than what they amass, in this world (read tajma‘ūn, ‘you amass’, or yajma‘ūn, ‘they amass’).\n",
        "TRANSLATION_18": "(And what though ye be slain in Allah's way) group of hypocrites (or die therein?) in your own homes while being sincere. (Surely pardon from Allah) of your sins (and mercy) by being spared punishment (are better than all that they amass) in this world of wealth. 74\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "3:157",
            "2:218",
            "49:5",
            "8:23",
            "10:58",
            "8:70",
            "4:96",
            "3:31",
            "8:69",
            "22:58"
        ],
        "BIBLE": [
            "writings:proverbs:13:15",
            "prophets:i%20samuel:25:15",
            "writings:psalms:139:24",
            "prophets:joshua:23:14",
            "prophets:joshua:5:4",
            "prophets:jeremiah:42:3",
            "writings:psalms:84:12",
            "torah:genesis:48:7",
            "writings:proverbs:2:20",
            "torah:leviticus:20:16"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:3:6",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:3:7",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:2:6"
        ]
    }
}