{
    "VERSE": "3:158",
    "ARABIC": "وَلَئِن مُّتُّمْ أَوْ قُتِلْتُمْ لَإِلَى ٱللَّهِ تُحْشَرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "If you die or you are killed, it is to Allah that you will be gathered.",
        "TRANSLATION_1": "And if you die or are killed, even so it is to God that you will return.\n",
        "TRANSLATION_2": "And were you to die or be slain, it is to Allah that you will all be mustered.\n",
        "TRANSLATION_3": "If you die or are slain, certainly you will all be brought before God.\n",
        "TRANSLATION_4": "And whether you are killed or you die, towards Allah you will be gathered.\n",
        "TRANSLATION_5": "And whether you die or are killed, verily, unto Allah you shall be gathered.\n",
        "TRANSLATION_6": "And if indeed you die or you are slain, certainly to Allah shall you be gathered together.\n",
        "TRANSLATION_7": "surely if you die or are slain, it is unto God you shall be mustered.\n",
        "TRANSLATION_8": "What though ye be slain or die, when unto Allah ye are gathered?\n",
        "TRANSLATION_9": "For, indeed, if you die or are killed, it is to God that you shall be gathered.\n",
        "TRANSLATION_10": "And whether ye die or be slain, assuredly unto Allah shall ye be gathered.\n",
        "TRANSLATION_11": "If you die or are slain, you will surely be mustered toward Allah.\n",
        "TRANSLATION_12": "And if ye die, or are slain, Lo! it is unto Allah that ye are brought together.\n",
        "TRANSLATION_13": "And whether you die, or are killed, verily, unto Allah you shall be gathered.\n",
        "TRANSLATION_14": "And if you die or are killed, before Allah you shall all be gathered.\n",
        "TRANSLATION_15": "If you die, or are killed—to God you will be gathered up.\n",
        "TRANSLATION_16": "And whether you die or are killed, unto Allah you will be gathered.\n",
        "TRANSLATION_17": "[3:158] And if (wa-la-in, the lām is for oaths) you die ([read] in both ways [muttum or mittum], or are slain, in the [holy] struggle or otherwise, it is to God, and to none other than Him that, you shall be mustered, in the Hereafter, and He will requite you.\n",
        "TRANSLATION_18": "(What though ye be slain) on a journey or in settlement (or die) in a fighting expedition, (when unto Allah you are gathered?) after you die.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "3:158",
            "37:56",
            "12:91",
            "53:62",
            "16:19",
            "11:33",
            "37:152",
            "39:57",
            "26:108",
            "26:126"
        ],
        "BIBLE": [
            "torah:numbers:14:35",
            "prophets:isaiah:10:21",
            "prophets:i%20samuel:14:44",
            "torah:exodus:3:12",
            "prophets:ezekiel:18:23",
            "torah:deuteronomy:30:3",
            "writings:job:34:15",
            "writings:psalms:9:18",
            "prophets:ii%20kings:1:6",
            "prophets:i%20samuel:5:8"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:1:9"
        ]
    }
}