{
    "VERSE": "3:162",
    "ARABIC": "أَفَمَنِ ٱتَّبَعَ رِضْوَٰنَ ٱللَّهِ كَمَنۢ بَآءَ بِسَخَطٍ مِّنَ ٱللَّهِ وَمَأْوَىٰهُ جَهَنَّمُ وَبِئْسَ ٱلْمَصِيرُ",
    "ENGLISH": {
        "TRANSLATION_0": "Is someone who pursues the pleasure of Allah the same as someone who incurs displeasure from Allah and whose refuge is Hell? What an evil destination!",
        "TRANSLATION_1": "Is a man who has followed the pleasure of God the same as he who has incurred His wrath, whose abode is surely Hell, a dreadful place?\n",
        "TRANSLATION_2": "Is he who follows the good pleasure of Allah like him who is laden with Allah's wrath and whose abode is Hell? How evil that is for a resting-place!\n",
        "TRANSLATION_3": "Are those who seek God's pleasure equal to those who incur His wrath and whose dwelling will be hell, the terrible destination?\n",
        "TRANSLATION_4": "So is one who follows the will of Allah equal to one who has incurred the wrath from Allah and whose home is the fire? And what a wretched place to return!\n",
        "TRANSLATION_5": "Is then one who follows (seeks) the pleasure of Allah like the one who draws on himself the wrath of Allah His abode is Hell, and worse indeed is that destination!\n",
        "TRANSLATION_6": "Is then he who follows the pleasure of Allah like him who has made himself deserving of displeasure from Allah, and his abode is hell; and it is an evil destination.\n",
        "TRANSLATION_7": "What, is he who follows God's good pleasure like him who is laden with the burden of God's anger, whose refuge is Gehenna? An evil homecoming!\n",
        "TRANSLATION_8": "Is one who followeth the pleasure of Allah as one who hath earned condemnation from Allah, whose habitation is the Fire, a hapless journey's end?\n",
        "TRANSLATION_9": "Can one who seeks the pleasure of God, be like one who incurs the wrath of God and whose abode shall be Hell -- an evil destination?\n",
        "TRANSLATION_10": "Is then one who followeth the pleasure of Allah like unto him who hath settled under the displeasure of Allah? His resort is Hell, and ill is that destination\n",
        "TRANSLATION_11": "Is he who follows [the course of] Allah’s pleasure like him who earns Allah’s displeasure and whose refuge is hell, an evil destination?\n",
        "TRANSLATION_12": "Is the man who follows the good pleasure of Allah Like the man who draws on himself the wrath of Allah, and whose abode is in Hell?- A woeful refuge!\n",
        "TRANSLATION_13": "Is then one who follows (seeks) the good Pleasure of Allah (by not taking illegally a part of the booty) like the one who draws on himself the Wrath of Allah (by taking a part of the booty illegally - Ghulul)? - his abode is Hell, - and worst, indeed is that destination!\n",
        "TRANSLATION_14": "Is he who follows the pleasure of Allah like he who is laden with the Anger of Allah, Gehenna (Hell) shall be his shelter. Evil shall be his return!\n",
        "TRANSLATION_15": "Is someone who pursues God's approval the same as someone who incurs God's wrath and his refuge is Hell—the miserable destination?\n",
        "TRANSLATION_16": "So is one who pursues the pleasure of Allah like one who brings upon himself the anger of Allah and whose refuge is Hell? And wretched is the destination.\n",
        "TRANSLATION_17": "[3:162] Is he who follows God’s beatitude, being obedient and not defrauding, like him who is laden, [one who] returns, with God’s anger, because of his disobedience and fraud, whose abode is Hell? An evil journey’s end, a resort, it is!\n",
        "TRANSLATION_18": "(Is one who followth the pleasure of Allah) in taking the fifth and shunning deceit (as one who hath earned condemnation from Allah) as one who deserves Allah's wrath due to his deception, (whose habitation) i.e. the dwelling of the deceiver (is the Fire, a hapless journey's end?) where he shall end up.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "3:162",
            "4:97",
            "3:54",
            "8:16",
            "9:109",
            "6:14",
            "39:32",
            "8:30",
            "47:28",
            "48:6"
        ],
        "BIBLE": [
            "torah:deuteronomy:20:7",
            "prophets:jeremiah:50:9",
            "prophets:ii%20kings:3:26",
            "writings:nehemiah:1:9",
            "torah:numbers:31:47",
            "prophets:ii%20kings:6:19",
            "torah:genesis:38:22",
            "prophets:ii%20samuel:2:26",
            "writings:ii%20chronicles:34:33",
            "writings:ecclesiastes:3:14"
        ]
    }
}