{
    "VERSE": "3:163",
    "ARABIC": "هُمْ دَرَجَٰتٌ عِندَ ٱللَّهِ وَٱللَّهُ بَصِيرٌۢ بِمَا يَعْمَلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "They have different ranks with Allah. Allah sees what they do.",
        "TRANSLATION_1": "There are different ranks with God, And God sees everything you do.\n",
        "TRANSLATION_2": "They vary greatly in rank in the sight of Allah, and Allah sees what they do.\n",
        "TRANSLATION_3": "People are of various grades in the sight of God. God is Well-Aware of all that they do.\n",
        "TRANSLATION_4": "They are in different ranks before Allah; and Allah sees their deeds.\n",
        "TRANSLATION_5": "They are in varying grades with Allah, and Allah is All-Seer of what they do.\n",
        "TRANSLATION_6": "There are (varying) grades with Allah, and Allah sees what they do.\n",
        "TRANSLATION_7": "They are in ranks with God; and God sees the things they do.\n",
        "TRANSLATION_8": "There are degrees (of grace and reprobation) with Allah, and Allah is Seer of what they do.\n",
        "TRANSLATION_9": "All have a different standing in the eyes of God, and God is observant of all their actions.\n",
        "TRANSLATION_10": "Of diverse degrees shall be they with Allah, and Allah is Beholder of that which they work.\n",
        "TRANSLATION_11": "They have ranks with Allah, and Allah watches what they do.\n",
        "TRANSLATION_12": "They are in varying gardens in the sight of Allah, and Allah sees well all that they do.\n",
        "TRANSLATION_13": "They are in varying grades with Allah, and Allah is All-Seer of what they do.\n",
        "TRANSLATION_14": "They are in ranks with Allah. Allah sees what they do.\n",
        "TRANSLATION_15": "They have different ranks with God, and God is Seeing of what they do.\n",
        "TRANSLATION_16": "They are [varying] degrees in the sight of Allah, and Allah is Seeing of whatever they do.\n",
        "TRANSLATION_17": "[3:163] No! They are of degrees, that is, individuals of [different] degrees, before God, that is, belonging to varying stations: for those that follow His beatitude, a reward, and for those that are laden with God’s anger, punishment; and God sees what they do, and will requite them for it.\n",
        "TRANSLATION_18": "(There are degrees (of grace and reprobation) with Allah) He says: those who leave deceit have different ranks with Allah in Paradise; but those who deceive will occupy different levels in hell, (and Allah is Seer of what ye do) whether it is deception or other things.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "3:163",
            "64:2",
            "16:96",
            "2:110",
            "2:76",
            "84:23",
            "9:20",
            "47:23",
            "33:69",
            "2:103"
        ],
        "BIBLE": [
            "torah:deuteronomy:10:21",
            "torah:exodus:14:13",
            "torah:deuteronomy:7:19",
            "prophets:ezekiel:16:30",
            "torah:deuteronomy:11:7",
            "writings:i%20chronicles:29:17",
            "torah:exodus:33:16",
            "prophets:isaiah:42:20",
            "writings:i%20chronicles:17:17",
            "torah:genesis:1:31"
        ]
    }
}