{
    "VERSE": "3:166",
    "ARABIC": "وَمَآ أَصَٰبَكُمْ يَوْمَ ٱلْتَقَى ٱلْجَمْعَانِ فَبِإِذْنِ ٱللَّهِ وَلِيَعْلَمَ ٱلْمُؤْمِنِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "What assailed you on the day the two armies met was by Allah's permission, so that He would know the",
        "TRANSLATION_1": "What you suffered on the day the two armies had met was by God's dispensation, so that He may distinguish the faithful,\n",
        "TRANSLATION_2": "What befell you on the day when the two hosts met was by the leave of Allah, and in order that He might mark out those who believe\n",
        "TRANSLATION_3": "What befell you, when the two armies confronted each other, was by the permission of God so that He would know who were the true believers\n",
        "TRANSLATION_4": "And the calamity that struck you on the day the two armies met, was by Allah’s command – and in order that He may make known the believers.\n",
        "TRANSLATION_5": "And what you suffered on the day the two armies met, was by the leave of Allah, in order that He might test the believers.\n",
        "TRANSLATION_6": "And what befell you on the day when the two armies met (at Ohud) was with Allah's knowledge, and that He might know the believers.\n",
        "TRANSLATION_7": "And what visited you, the day the two hosts encountered, was by God's leave, and that He might know the believers;\n",
        "TRANSLATION_8": "That which befell you, on the day when the two armies met, was by permission of Allah; that He might know the true believers;\n",
        "TRANSLATION_9": "the misfortune which befell you on the day when the two armies met happened by God's leave, so that He might mark out the [true] believers\n",
        "TRANSLATION_10": "And that which befell you on the day whereon the two hosts met was by Allah's leave, and that he might know the believers.\n",
        "TRANSLATION_11": "What befell you on the day when the two hosts met, was by Allah’s permission, so that He may ascertain the faithful,\n",
        "TRANSLATION_12": "What ye suffered on the day the two armies Met, was with the leave of Allah, in order that He might test the believers,-\n",
        "TRANSLATION_13": "And what you suffered (of the disaster) on the day (of the battle of Uhud when) the two armies met, was by the leave of Allah, in order that He might test the believers.\n",
        "TRANSLATION_14": "What hit you the day the two armies met was by the permission of Allah, so that He might know the believers\n",
        "TRANSLATION_15": "What befell you on the day the two armies clashed was with God’s permission; that He may know the believers.\n",
        "TRANSLATION_16": "And what struck you on the day the two armies met was by permission of Allah that He might make evident the [true] believers.\n",
        "TRANSLATION_17": "[3:166] And what afflicted you, the day the two hosts encountered, at Uhud, was by God’s leave, by His will, and that He might know, through knowledge manifested outwardly, the, true, believers.\n",
        "TRANSLATION_18": "(That which befell you) of deaths and injuries, (on the day when the two armies) the army of Muhammad and that of Abu Sufyan (met, was by permission of Allah) by His will and decree; (that He might know the true believers) that He might see the believers in jihad;\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "3:166",
            "3:155",
            "59:5",
            "40:33",
            "45:14",
            "22:69",
            "58:18",
            "36:64",
            "41:19",
            "6:149"
        ],
        "BIBLE": [
            "prophets:isaiah:10:23",
            "prophets:malachi:3:17",
            "prophets:haggai:2:23",
            "prophets:malachi:3:21",
            "prophets:ezekiel:43:27",
            "prophets:isaiah:38:19",
            "torah:exodus:18:16",
            "prophets:ezekiel:39:7",
            "torah:genesis:35:3",
            "writings:daniel:6:13"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:5:4",
            
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:4:12"
        ]
    }
}