{
    "VERSE": "3:168",
    "ARABIC": "ٱلَّذِينَ قَالُوا۟ لِإِخْوَٰنِهِمْ وَقَعَدُوا۟ لَوْ أَطَاعُونَا مَا قُتِلُوا۟ قُلْ فَٱدْرَءُوا۟ عَنْ أَنفُسِكُمُ ٱلْمَوْتَ إِن كُنتُمْ صَٰدِقِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "They are those who said of their brothers, when they themselves had stayed behind, 'If they had only obeyed us, they would not have been killed.' Say, 'Then ward off death from yourselves if you are telling the truth.'",
        "TRANSLATION_1": "To those who sit at home and say of their brothers: \"They would never have been killed had they listened to us, say: \"Drive away death from your midst if what you say is true.\"\n",
        "TRANSLATION_2": "These are the ones who stayed away, saying about their brothers: 'Had they followed us, they would not have been slain.' Say: 'If you speak the truth then avert death when it comes to you.'\n",
        "TRANSLATION_3": "There are those who themselves did not join the others in fighting for the cause of God and said about their brothers, \"Had they listened to us and stayed at home, they would not have been killed.\" (Muhammad), tell them to save themselves from death if they are true in their claim.\n",
        "TRANSLATION_4": "Those who spoke regarding their brothers while they themselves stayed back at home, “Had they listened to us, they would not have been slain”; say (to them, O dear Prophet Mohammed – peace and blessings be upon him), “Then avert your own death, if you are truthful!”\n",
        "TRANSLATION_5": "(They are) the ones who said about their killed brethren while they themselves sat (at home): \"If only they had listened to us, they would not have been killed.\" Say: \"Avert death from your own selves, if you speak the truth.\"\n",
        "TRANSLATION_6": "Those who said of their brethren whilst they (themselves) held back: Had they obeyed us, they would not have been killed. Say: Then avert death from yourselves if you speak the truth.\n",
        "TRANSLATION_7": "who said of their brothers (and they themselves held back), 'Had they obeyed us, they would not have been slain.' Say: 'Then avert death from yourselves, if you speak truly.'\n",
        "TRANSLATION_8": "Those who, while they sat at home, said of their brethren (who were fighting for the cause of Allah): If they had been guided by us they would not have been slain. Say (unto them, O Muhammad): Then avert death from yourselves if ye are truthful.\n",
        "TRANSLATION_9": "Those who stayed behind, said of their brothers, \"Had they listened to us, they would not have been killed.\" Say to them, \"Ward off death from yourselves, then, if what you say be true!\"\n",
        "TRANSLATION_10": "They say of their brethren, while they themselves staid: had they obeyed us they had not been slain. Say thou: then repel death from yourselves if ye say sooth.\n",
        "TRANSLATION_11": "Those who said of their brethren, while they themselves sat back: ‘Had they obeyed us, they would not have been killed.’ Say, ‘Then keep death off from yourselves, if you are truthful.’\n",
        "TRANSLATION_12": "(They are) the ones that say, (of their brethren slain), while they themselves sit (at ease): \"If only they had listened to us they would not have been slain.\" Say: \"Avert death from your own selves, if ye speak the truth.\"\n",
        "TRANSLATION_13": "(They are) the ones who said about their killed brethren while they themselves sat (at home): \"If only they had listened to us, they would not have been killed.\" Say: \"Avert death from your ownselves, if you speak the truth.\"\n",
        "TRANSLATION_14": "Who said to their brothers and they themselves had stayed behind 'Had they obeyed us, they would not have been killed' Say to them: 'Avert death from yourselves then, if what you say is true'\n",
        "TRANSLATION_15": "Those who said of their brethren, as they stayed behind, “Had they obeyed us, they would not have been killed.” Say, “Then avert death from yourselves, if you are truthful.”\n",
        "TRANSLATION_16": "Those who said about their brothers while sitting [at home], \"If they had obeyed us, they would not have been killed.\" Say, \"Then prevent death from yourselves, if you should be truthful.\"\n",
        "TRANSLATION_17": "[3:168] Those who (alladhīna substitutes for the previous alladhīna, or constitutes an adjectival qualification [of it]) said to their brothers, in religion, whilst they themselves, had, stayed put, [refraining] from [joining] the struggle, ‘Had they, the martyrs at Uhud or those who stayed put with us, obeyed us, they would not have been slain’. Say, to them: ‘Then avert, ward off, death from yourselves, if you speak the truth’, in that staying put delivers one from it [sc. from death].\n",
        "TRANSLATION_18": "They are (Those who, while they sat at home) and refrained from jihad, (said of their brethren) the hypocrites in Medina: (If they) i.e. Muhammad and his Companions by remaining in Medina (had been guided by us they would not have been slain) in their military expedition. (Say) Muhammad, to the hypocrites: (Then avert death from yourselves if ye are truthful) in your claim.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "3:168",
            "29:57",
            "5:30",
            "6:26",
            "11:21",
            "3:69",
            "56:60",
            "5:25",
            "21:35",
            "81:14"
        ],
        "BIBLE": [
            "writings:nehemiah:5:8",
            "torah:leviticus:10:3",
            "writings:ii%20chronicles:25:16",
            "prophets:ii%20samuel:2:27",
            "prophets:ii%20kings:7:9",
            "torah:genesis:27:35",
            "prophets:ii%20kings:2:3",
            "prophets:ii%20kings:2:5",
            "writings:daniel:6:13",
            "prophets:isaiah:36:21"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:5:1"
        ]
    }
}