{
    "VERSE": "3:17",
    "ARABIC": "ٱلصَّٰبِرِينَ وَٱلصَّٰدِقِينَ وَٱلْقَٰنِتِينَ وَٱلْمُنفِقِينَ وَٱلْمُسْتَغْفِرِينَ بِٱلْأَسْحَارِ",
    "ENGLISH": {
        "TRANSLATION_0": "those who say, 'Our Lord, we have iman, so forgive us our wrong actions and safeguard us from the punishment of the Fire.'",
        "TRANSLATION_1": "They are the patient, the sincere and devout, full of charity, who pray for forgiveness in the hours of dawn.\n",
        "TRANSLATION_2": "men who are steadfast, truthful, obedient, spend (in the way of Allah) and implore the forgiveness of Allah before daybreak.\n",
        "TRANSLATION_3": "who exercise patience, speak the truth, who are devoted in prayer, spend their property for the cause of God and seek forgiveness from God during the last part of the night.\n",
        "TRANSLATION_4": "The steadfast, and the truthful, and the reverent, and who spend in Allah's cause, and who seek forgiveness in the last hours of the night (before dawn).\n",
        "TRANSLATION_5": "(They are) the patient, the true believers, and obedient with sincere devotion in worship to Allah. Those who spend [in good] and those who pray and beg Allah's pardon in the last hours of the night.\n",
        "TRANSLATION_6": "The patient, and the truthful, and the obedient, and those who spend (benevolently) and those who ask forgiveness in the morning times.\n",
        "TRANSLATION_7": "men who are patient, truthful, obedient, expenders in alms, imploring God's pardon at the daybreak.\n",
        "TRANSLATION_8": "The steadfast, and the truthful, and the obedient, those who spend (and hoard not), those who pray for pardon in the watches of the night.\n",
        "TRANSLATION_9": "those who are steadfast, truthful, obedient, and those who spend [for God's cause] and who pray before dawn for forgiveness.\"\n",
        "TRANSLATION_10": "The patient ones and the truthful ones and the devout ones and the expanders and the praying ones at early dawn for forgiveness.\n",
        "TRANSLATION_11": "[They are] patient and truthful, obedient and charitable, and they plead for [Allah’s] forgiveness at dawns.\n",
        "TRANSLATION_12": "Those who show patience, Firmness and self-control; who are true (in word and deed); who worship devoutly; who spend (in the way of Allah); and who pray for forgiveness in the early hours of the morning.\n",
        "TRANSLATION_13": "(They are) those who are patient ones, those who are true (in Faith, words, and deeds), and obedient with sincere devotion in worship to Allah. Those who spend [give the Zakat and alms in the Way of Allah] and those who pray and beg Allah's Pardon in the last hours of the night.\n",
        "TRANSLATION_14": "who are patient, truthful, obedient, and charitable, and who ask forgiveness at dawn.\n",
        "TRANSLATION_15": "The patient, and the truthful, and the reverent, and the charitable, and the seekers of forgiveness at dawn.\n",
        "TRANSLATION_16": "The patient, the true, the obedient, those who spend [in the way of Allah], and those who seek forgiveness before dawn.\n",
        "TRANSLATION_17": "[3:17] The patient, in obedience and against disobedience (al-sābirīna, ‘the patient’, is an adjectival qualification [of alladhīna, ‘those’]), truthful, in their faith, obedient, compliant before God, expenders, of charity, imploring God’s pardon, by saying, ‘Lord, forgive us’ at daybreak’, in the last part of the night, singled out here for mention because it is the time of unawareness and of the joy of sleep.\n",
        "TRANSLATION_18": "(The steadfast) in performing the obligations enjoined by Allah and in shunning contraventions against Him; it is also said that this means: the steadfast when misfortunes befall them, (and the Truthful) in their faith, (and the obedient) vis-a-vis Allah and His Messenger, (those who spend) their wealth in the way of Allah, (those who pray for pardon in the watches of the night) supererogatory prayers.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "3:17",
            "51:18",
            "43:30",
            "92:6",
            "92:9",
            "52:6",
            "70:25",
            "56:10",
            "26:114",
            "10:77"
        ],
        "BIBLE": [
            "prophets:jeremiah:38:4",
            "torah:numbers:22:20",
            "prophets:i%20kings:8:59",
            "prophets:isaiah:29:11",
            "writings:proverbs:15:23",
            "writings:proverbs:2:20",
            "prophets:i%20kings:22:13",
            "writings:daniel:10:11",
            "torah:genesis:24:27",
            "writings:ii%20chronicles:18:12"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:5"
        ]
    }
}