{
    "VERSE": "3:182",
    "ARABIC": "ذَٰلِكَ بِمَا قَدَّمَتْ أَيْدِيكُمْ وَأَنَّ ٱللَّهَ لَيْسَ بِظَلَّامٍ لِّلْعَبِيدِ",
    "ENGLISH": {
        "TRANSLATION_0": "That is on account of what you did. Allah does not wrong His slaves.",
        "TRANSLATION_1": "This is (requital) for the deeds you had committed, for God is not unjust to any of His creatures.\n",
        "TRANSLATION_2": "That is in recompense for what you have done.' Allah does no wrong to His servants.\n",
        "TRANSLATION_3": "This is only the result of their deeds. God is not unjust to His servants.\n",
        "TRANSLATION_4": "“This is the recompense of what your hands have sent ahead and Allah does not oppress the bondmen.”\n",
        "TRANSLATION_5": "This is because of that which your hands have sent before you. And certainly, Allah is never unjust to (His) servants.\n",
        "TRANSLATION_6": "This is for what your own hands have sent before and because Allah is not in the least unjust to the servants.\n",
        "TRANSLATION_7": "that, for what your hands have forwarded, and for that God is never unjust unto His servants.'\n",
        "TRANSLATION_8": "This is on account of that which your own hands have sent before (you to the judgment). Allah is no oppressor of (His) bondmen.\n",
        "TRANSLATION_9": "In return for what your own hands have wrought -- for never does God do the least wrong to His creatures!\"\n",
        "TRANSLATION_10": "That is for that which your hands have sent on afore, for verily Allah is not a wronger of His bondmen.\n",
        "TRANSLATION_11": "That is because of what your hands have sent ahead, and because Allah is not tyrannical to His servants.’\n",
        "TRANSLATION_12": "This is because of the (unrighteous deeds) which your hands sent on before ye: For Allah never harms those who serve Him.\"\n",
        "TRANSLATION_13": "This is because of that (evil) which your hands have sent before you. And certainly, Allah is never unjust to (His) slaves.\n",
        "TRANSLATION_14": "That, is for what your hands have forwarded. And Allah is never unjust to His worshipers.\n",
        "TRANSLATION_15": "“This is on account of what your hands have forwarded, and because God is not unjust towards the creatures.”\n",
        "TRANSLATION_16": "That is for what your hands have put forth and because Allah is not ever unjust to [His] servants.\"\n",
        "TRANSLATION_17": "[3:182] When they are thrown into [the Fire], it will be said to them: That, punishment, is for what your hands have sent before: ‘hands’ are used to designate a human being because most actions are performed with them; for God is never unjust towards His servants’, punishing them without them having sinned.\n",
        "TRANSLATION_18": "(This) punishment (is on account of that which your own hands have sent before you) which your hands have earned. (Allah is no oppressor of (His) bondmen) such that He punishes them without them having committed a crime.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "8:51",
            "3:182",
            "22:10",
            "50:29",
            "9:67",
            "47:26",
            "40:44",
            "2:95",
            "62:7",
            "47:11"
        ],
        "BIBLE": [
            "prophets:jeremiah:25:6",
            "writings:job:12:9",
            "torah:deuteronomy:31:29",
            "prophets:jeremiah:1:16",
            "writings:psalms:18:21",
            "writings:psalms:18:25",
            "prophets:isaiah:25:11",
            "prophets:ii%20samuel:22:21",
            "torah:exodus:3:20",
            "writings:ecclesiastes:2:11"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:6",
            
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:1:1"
        ]
    }
}