{
    "VERSE": "3:183",
    "ARABIC": "ٱلَّذِينَ قَالُوٓا۟ إِنَّ ٱللَّهَ عَهِدَ إِلَيْنَآ أَلَّا نُؤْمِنَ لِرَسُولٍ حَتَّىٰ يَأْتِيَنَا بِقُرْبَانٍ تَأْكُلُهُ ٱلنَّارُ قُلْ قَدْ جَآءَكُمْ رُسُلٌ مِّن قَبْلِى بِٱلْبَيِّنَٰتِ وَبِٱلَّذِى قُلْتُمْ فَلِمَ قَتَلْتُمُوهُمْ إِن كُنتُمْ صَٰدِقِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Those who say, 'Allah has made a contract with us that we should not have iman in any Messenger until he brings us a sacrifice consumed by fire.' Say, 'Messengers came to you before me with the Clear Signs and with what you say. So why did you kill them if you are telling the truth?'",
        "TRANSLATION_1": "To those who say: \"God has ordained that we should not believe an apostle who does not bring burnt offerings,\" say: \"Many an apostle had come to you before me with manifest proofs, even with what you mention; then why did you kill them if you were men of truth?\"\n",
        "TRANSLATION_2": "To those who say: 'Allah has directed us that we accept none as Messenger until he makes an offering that the fire will consume', say: 'Other Messengers came to you before me with clear signs, and with the sign you have mentioned. So why did you slay them, if what you say is true?\n",
        "TRANSLATION_3": "(Muhammad), say to those who say, 'God has commanded us not to believe any Messenger unless he offers a burnt offering,' (Muhammad) say, \"Messengers came to you before me with certain miracles and with that which you had asked for (burnt offering). Why, then, did you slay them if you were true in your claim?\"\n",
        "TRANSLATION_4": "Those who say, “Allah has agreed with us that we should not believe in any Noble Messenger until he comes with the command to offer a sacrifice, which a fire (from heaven) shall devour”; say (O dear Prophet Mohammed – peace and blessings be upon him), “Many Noble Messengers did come to you before me, with clear signs and with this command which you state – why did you then martyr them, if you are truthful?”\n",
        "TRANSLATION_5": "Those who said: \"Verily, Allah has taken our promise not to believe in any Messenger unless he brings to us an offering which the fire (from heaven) shall devour. \" Say: \"Verily, there came to you Messengers before me, with Al-Bayinat and even with with what you speak of; why then did you kill them, if you are truthful\"\n",
        "TRANSLATION_6": "(Those are they) who said: Surely Allah has enjoined us that we should not believe in any apostle until he brings us an offering which the fire consumes. Say: Indeed, there came to you apostles before me with clear arguments and with that which you demand; why then did you kill them if you are truthful?\n",
        "TRANSLATION_7": "Those same men said, 'God has made covenant with us, that we believe not any Messenger until he brings to us a sacrifice devoured by fire.' Say: 'Messengers have come to you before me bearing clear signs, and that you spoke of; why therefore did you slay them, if you speak truly?'\n",
        "TRANSLATION_8": "(The same are) those who say: Lo! Allah hath charged us that we believe not in any messenger until he bring us an offering which fire (from heaven) shall devour. Say (unto them, O Muhammad): Messengers came unto you before me with miracles, and with that (very miracle) which ye describe. Why then did ye slay them? (Answer that) if ye are truthful!\n",
        "TRANSLATION_9": "To those who say, \"God has commanded us not to believe in any messenger unless he brings down to us an offering to be consumed by fire,\" say, \"Messengers before me have come to you with clear signs, including the one you demand. Why did you kill them, if you are telling the truth?\"\n",
        "TRANSLATION_10": "There are those who say. verily God hath covenanted with us that we should believe not in an apostle until he bring unto us a sacrifice which a fire shall devour. Say thou: surety there came unto you apostles before me with evidences and with that which ye speak of, wherefore then did ye slay them, if ye say sooth?\n",
        "TRANSLATION_11": "Tell those who say, ‘Allah has pledged us not to believe in any apostle unless he brings us an offering consumed by fire,’ ‘Apostles before me certainly did bring you manifest signs and what you speak of. Then why did you kill them, if you are truthful?’\n",
        "TRANSLATION_12": "They (also) said: \"Allah took our promise not to believe in an messenger unless He showed us a sacrifice consumed by Fire (From heaven).\" Say: \"There came to you messengers before me, with clear Signs and even with what ye ask for: why then did ye slay them, if ye speak the truth?\"\n",
        "TRANSLATION_13": "Those (Jews) who said: \"Verily, Allah has taken our promise not to believe in any Messenger unless he brings to us an offering which the fire (from heaven) shall devour.\" Say: \"Verily, there came to you Messengers before me, with clear signs and even with what you speak of; why then did you kill them, if you are truthful?\"\n",
        "TRANSLATION_14": "Those (the Jews) who say: 'Allah has promised us that we do not believe in a Messenger unless he brings to us an offering that fire consumes' Say: 'Indeed Messengers have come to you before me with clear proofs and with that of which you spoke. Why did you kill them, if what you say is true'\n",
        "TRANSLATION_15": "Those who said, “God has made a covenant with us, that we shall not believe in any messenger unless he brings us an offering to be consumed by fire.” Say, “Messengers have come to you before me with proofs, and with what you asked for; so why did you assassinate them, if you are truthful?”\n",
        "TRANSLATION_16": "[They are] those who said, \"Indeed, Allah has taken our promise not to believe any messenger until he brings us an offering which fire [from heaven] will consume.\" Say, \"There have already come to you messengers before me with clear proofs and [even] that of which you speak. So why did you kill them, if you should be truthful?\"\n",
        "TRANSLATION_17": "[3:183] Those (alladhīna, an adjectival qualification of the previous alladhīna, ‘those who’ [Q. 3:181]) same who said, to Muhammad (s), ‘God has already made covenant with us, in the Torah, that we should not believe in   any messenger, accepting his truthfulness, until he bring us an offering to be devoured by fire’, and so we will not believe in you until you bring us this [offering], namely, of grazing livestock or other [kind of animal] one offers [in sacrifice] to God. If it is accepted, a white fire will come down from the heaven and consume it, otherwise it will remain as it is. Such a covenant was made with the Children of Israel, but not in the case of Jesus and Muhammad. God, exalted be He, says, Say, to them in rebuke: ‘messengers have come to you before me with clear proofs, with miracles, and with that which you said, [messengers] such as Zachariah and John, but you slew them: the address here is for those living at the time of our Prophet Muhammad (s), even though the deed was their forefathers’, for they [their descendants] are content with it. Why did you slay them, then, if you are truthful?’, about [the fact] that you would believe if it [the offering] were brought [to you].\n",
        "TRANSLATION_18": "((The same are) those) i.e. the Jews (who say: Lo! Allah hath charged us) Allah has commanded us in the Scripture (that we believe not in any messenger) we will not accept that anyone is sent with a message (until he bring us an offering which fire (from heaven) shall devour) that is until Allah sends a fire which will devour this offering, as it happened in the time of the [Jewish] prophets. (Say) Muhammad: (Messengers came unto you before me with miracles) with commands and prohibitions as well as signs, (and with that (very miracle) which ye describe) of an offering [devoured by fire], Zachariah, John and Jesus. (Why then did ye slay them?) why did you kill John and Zachariah, when such an offering [devoured by fire] took place during their time. ((Answer that) if ye are truthful) in your claim.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "3:183",
            "58:5",
            "35:4",
            "21:25",
            "64:8",
            "24:51",
            "3:32",
            "40:28",
            "35:25",
            "8:1"
        ],
        "BIBLE": [
            "writings:daniel:6:13",
            "torah:leviticus:4:35",
            "prophets:i%20kings:20:34",
            "prophets:ii%20kings:5:7",
            "prophets:i%20samuel:28:15",
            "torah:exodus:20:21",
            "prophets:i%20kings:20:33",
            "prophets:i%20samuel:10:8",
            "prophets:amos:6:10",
            "prophets:joshua:9:11"
        ]
    }
}