{
    "VERSE": "3:185",
    "ARABIC": "كُلُّ نَفْسٍ ذَآئِقَةُ ٱلْمَوْتِ وَإِنَّمَا تُوَفَّوْنَ أُجُورَكُمْ يَوْمَ ٱلْقِيَٰمَةِ فَمَن زُحْزِحَ عَنِ ٱلنَّارِ وَأُدْخِلَ ٱلْجَنَّةَ فَقَدْ فَازَ وَمَا ٱلْحَيَوٰةُ ٱلدُّنْيَآ إِلَّا مَتَٰعُ ٱلْغُرُورِ",
    "ENGLISH": {
        "TRANSLATION_0": "Every self will taste death. You will be paid your wages in full on the Day of Rising. Anyone who is distanced from the Fire and admitted to the Garden has triumphed. The life of this world is just the enjoyment of delusion.",
        "TRANSLATION_1": "Every soul will know the taste of death. You will get your recompense in full on the Day of Resurrection; and he who is spared the Fire and finds his way to Paradise will meet his desire. As for the life of this world, it is nothing but a merchandise of vanity.\n",
        "TRANSLATION_2": "Everyone is bound to taste death and you shall receive your full reward on the Day of Resurrection. Then, whoever is spared the Fire and is admitted to Paradise has indeed been successful. The life of this world is merely an illusory enjoyment.\n",
        "TRANSLATION_3": "Every soul is destined to experience the agony of death. You (Muslims) will receive the recompense for your deeds on the Day of Judgment. To be saved from the fire and admitted to Paradise is certainly a great triumph. The worldly life is no more than a deceitful possession.\n",
        "TRANSLATION_4": "Every soul must taste death; and only on the Day of Resurrection will you be fully recompensed; so the one who is saved from the fire and is admitted into Paradise – he is undoubtedly successful; and the life of this world is just counterfeit wealth.\n",
        "TRANSLATION_5": "Everyone shall taste death. And only on the Day of Resurrection shall you be paid your wages in full. And whoever is moved away from the Fire and admitted to Paradise, he indeed is successful. The life of this world is only the enjoyment of deception.\n",
        "TRANSLATION_6": "Every soul shall taste of death, and you shall only be paid fully your reward on the resurrection day; then whoever is removed far away from the fire and is made to enter the garden he indeed has attained the object; and the life of this world is nothing but a provision of vanities.\n",
        "TRANSLATION_7": "Every soul shall taste of death; you shall surely be paid in full your wages on the Day of Resurrection. Whosoever is removed from the Fire and admitted to Paradise, shall win the triumph. The present life is but the joy of delusion.\n",
        "TRANSLATION_8": "Every soul will taste of death. And ye will be paid on the Day of Resurrection only that which ye have fairly earned. Whoso is removed from the Fire and is made to enter paradise, he indeed is triumphant. The life of this world is but comfort of illusion.\n",
        "TRANSLATION_9": "Every human being is bound to taste death: and you shall receive your rewards in full on the Day of Resurrection. He who is kept away from the Fire and is admitted to Paradise, will surely triumph; for the life of this world is nothing but an illusory enjoyment.\n",
        "TRANSLATION_10": "Every soul Shall taste of death and only on the Day of Resurrection ye will be repaid your hire in full. Then whosoever shall be removed far away from the Fire and made to enter into the Garden, he indeed hath achieved the goal; and the life of the world is naught but an illusory enjoyment.\n",
        "TRANSLATION_11": "Every soul shall taste death, and you will indeed be paid your full rewards on the Day of Resurrection. Whoever is delivered from the Fire and admitted to paradise has certainly succeeded. The life of this world is nothing but the wares of delusion.\n",
        "TRANSLATION_12": "Every soul shall have a taste of death: And only on the Day of Judgment shall you be paid your full recompense. Only he who is saved far from the Fire and admitted to the Garden will have attained the object (of Life): For the life of this world is but goods and chattels of deception.\n",
        "TRANSLATION_13": "Everyone shall taste death. And only on the Day of Resurrection shall you be paid your wages in full. And whoever is removed away from the Fire and admitted to Paradise, he indeed is successful. The life of this world is only the enjoyment of deception (a deceiving thing).\n",
        "TRANSLATION_14": "Every soul shall taste death. You shall be paid your wages in full on the Day of Resurrection. Whoever is removed from Hell and is admitted to Paradise shall prosper, for the worldly life is nothing but the enjoyment of delusion.\n",
        "TRANSLATION_15": "Every soul will have a taste of death, and you will receive your recompense on the Day of Resurrection. Whoever is swayed from the Fire, and admitted to Paradise, has won. The life of this world is merely enjoyment of delusion.\n",
        "TRANSLATION_16": "Every soul will taste death, and you will only be given your [full] compensation on the Day of Resurrection. So he who is drawn away from the Fire and admitted to Paradise has attained [his desire]. And what is the life of this world except the enjoyment of delusion.\n",
        "TRANSLATION_17": "[3:185] Every soul shall taste of death; you shall surely be paid in full your wages, the requital of your deeds, on the Day of Resurrection. Whoever is moved away, distanced, from the Fire and admitted to Paradise, will have triumphed, he will have attained his ultimate wish. Living in, the life of this world is but the comfort of delusion; of inanity, enjoyed for a little while, then perishing.\n",
        "TRANSLATION_18": "Allah then mentioned their deaths and what happens after their deaths, saying: (Every soul) that breathes (will taste of death. And ye will be paid on the Day of Resurrection only that which ye have fairly earned) the reward of your works. (Whoso is removed from the Fire) by means of declaring Allah's divine Oneness and doing righteous works (and is made to enter Paradise, he indeed is triumphant) in that he gains Paradise and that which it contains, and is further saved from hell and that which it contains. (The life of this world is but comfort of illusion) which is comparable to the relative duration of the stuff one has at home such as pottery, bottles, and the like.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "3:185",
            "4:109",
            "47:36",
            "3:161",
            "40:39",
            "2:85",
            "53:29",
            "9:55",
            "6:130",
            "29:25"
        ],
        "BIBLE": [
            "torah:numbers:3:38",
            "torah:deuteronomy:31:29",
            "prophets:judges:19:9",
            "prophets:joshua:22:31",
            "prophets:ezekiel:32:20",
            "prophets:ezekiel:7:9",
            "prophets:ezekiel:7:4",
            "writings:proverbs:24:11",
            "prophets:i%20samuel:20:3",
            "torah:exodus:21:36"
        ]
    }
}