{
    "VERSE": "3:189",
    "ARABIC": "وَلِلَّهِ مُلْكُ ٱلسَّمَٰوَٰتِ وَٱلْأَرْضِ وَٱللَّهُ عَلَىٰ كُلِّ شَىْءٍ قَدِيرٌ",
    "ENGLISH": {
        "TRANSLATION_0": "The kingdom of the heavens and earth belongs to Allah. Allah has power over all things.",
        "TRANSLATION_1": "For God's is the kingdom of the heavens and the earth, and God's is the power over all things.\n",
        "TRANSLATION_2": "To Allah belongs the dominion of the heavens and the earth; and Allah is All-Powerful. indeed been successful. The life of this world is merely an illusory enjoyment.\n",
        "TRANSLATION_3": "To God belongs all that is in the heavens and the earth and He has power over all things.\n",
        "TRANSLATION_4": "And for Allah only is the kingship of the heavens and the earth; and Allah is Able to do all things.\n",
        "TRANSLATION_5": "And to Allah belongs the dominion of the heavens and the earth, and Allah has power over all things.\n",
        "TRANSLATION_6": "And Allah's is the kingdom of the heavens and the earth, and Allah has power over all things.\n",
        "TRANSLATION_7": "To God belongs the Kingdom of the heavens and of the earth; and God is powerful over everything.\n",
        "TRANSLATION_8": "Unto Allah belongeth the Sovereignty of the heavens and the earth. Allah is Able to do all things.\n",
        "TRANSLATION_9": "The kingdom of the heavens and the earth belongs to God; God has power over all things.\n",
        "TRANSLATION_10": "Allah's is the dominion of the heavens and the earth. and Allah is over everything Potent.\n",
        "TRANSLATION_11": "To Allah belongs the kingdom of the heavens and the earth, and Allah has power over all things.\n",
        "TRANSLATION_12": "To Allah belongeth the dominion of the heavens and the earth; and Allah hath power over all things.\n",
        "TRANSLATION_13": "And to Allah belongs the dominion of the heavens and the earth, and Allah has power over all things.\n",
        "TRANSLATION_14": "To Allah belongs the Kingdom of the heavens and the earth. Allah has Power over all things.\n",
        "TRANSLATION_15": "To God belongs the sovereignty of the heavens and the earth. God has power over all things.\n",
        "TRANSLATION_16": "And to Allah belongs the dominion of the heavens and the earth, and Allah is over all things competent.\n",
        "TRANSLATION_17": "[3:189] To God belongs the kingdom of the heavens and of the earth, the storehouses of rain, sustenance, vegetation and so forth, and God has power over all things, including the punishing of disbelievers and the saving of believers.\n",
        "TRANSLATION_18": "(Unto Allah belongeth the Sovereignty of the heavens and the earth) to Allah belong the stores of the heavens (rain) and the earth (vegetation). (Allah is Able to do all things) in relation to the dwellers of the heavens and the earth and to their stores.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "3:189",
            "5:120",
            "5:40",
            "57:2",
            "64:1",
            "85:9",
            "4:126",
            "3:29",
            "2:284",
            "24:42"
        ],
        "BIBLE": [
            "prophets:jeremiah:10:12",
            "prophets:jeremiah:51:15",
            "torah:deuteronomy:10:14",
            "torah:genesis:6:17",
            "writings:nehemiah:9:6",
            "torah:deuteronomy:4:32",
            "prophets:habakkuk:3:3",
            "writings:psalms:89:12",
            "writings:i%20chronicles:29:11",
            "prophets:joshua:1:17"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:3:7",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:2",
            "Sefer%20Yetzirah:6:2"
        ]
    }
}