{
    "VERSE": "3:192",
    "ARABIC": "رَبَّنَآ إِنَّكَ مَن تُدْخِلِ ٱلنَّارَ فَقَدْ أَخْزَيْتَهُۥ وَمَا لِلظَّٰلِمِينَ مِنْ أَنصَارٍ",
    "ENGLISH": {
        "TRANSLATION_0": "Our Lord, those You cast into the Fire, You have indeed disgraced. The wrongdoers will have no helpers.",
        "TRANSLATION_1": "Whoever, O Lord, should be cast into Hell shall be verily disgraced; and the sinners shall have none to help (or save) them.\n",
        "TRANSLATION_2": "Our Lord! Whomever You cause to enter the Fire, him You indeed bring to disgrace, and there will be none to succour the wrong-doers.\n",
        "TRANSLATION_3": "Those whom You submit to the fire are certainly disgraced. There is no helper for the unjust.\n",
        "TRANSLATION_4": "“O our Lord! You have indeed given disgrace to whomever You put in the fire (of hell); and the unjust do not have any supporters.”\n",
        "TRANSLATION_5": "Our Lord! Verily, whom You admit to the Fire, indeed, You have disgraced him; and never will the wrongdoers find any helpers.\n",
        "TRANSLATION_6": "Our Lord! surely whomsoever Thou makest enter the fire, him Thou hast indeed brought to disgrace, and there shall be no helpers for the unjust:\n",
        "TRANSLATION_7": "Our Lord, whomsoever Thou admittest into the Fire, Thou wilt have abased; and the evildoers shall have no helpers.\n",
        "TRANSLATION_8": "Our Lord! Whom Thou causest to enter the Fire: him indeed Thou hast confounded. For evil-doers there will be no helpers.\n",
        "TRANSLATION_9": "Lord, those whom You condemn to enter the Fire You have surely brought to disgrace. Wrongdoers will have no supporters.\n",
        "TRANSLATION_10": "Our Lord verily whomsoever Thou makest to enter into the Fire, him Thou hast surely humiliated and for the wrong-doers there shall be no helpers.\n",
        "TRANSLATION_11": "Our Lord, whoever that You make enter the Fire will surely have been disgraced by You, and the wrongdoers will have no helpers.\n",
        "TRANSLATION_12": "Our Lord! any whom Thou dost admit to the Fire, Truly Thou coverest with shame, and never will wrong-doers Find any helpers!\n",
        "TRANSLATION_13": "Our Lord! Verily, whom You admit to the Fire, indeed, You have disgraced him, and never will the Zalimun (polytheists and wrong-doers) find any helpers.\n",
        "TRANSLATION_14": "Our Lord, whomsoever You admit into the Fire, You will have abased, and the harmdoers shall have no helpers.\n",
        "TRANSLATION_15": "“Our Lord, whomever You commit to the Fire, You have disgraced. The wrongdoers will have no helpers.”\n",
        "TRANSLATION_16": "Our Lord, indeed whoever You admit to the Fire - You have disgraced him, and for the wrongdoers there are no helpers.\n",
        "TRANSLATION_17": "[3:192] Our Lord, whomever You admit into the Fire, to abide therein, You will have abased, You will have humiliated, and the evildoers, the disbelievers therein, shall have no helpers, to protect them from God’s chastisement, exalted be He (the overt noun [‘the evildoers’] has replaced the pronominalisation [‘whomever’] in order to inform that the [punishment of] abasement is specifically theirs; the min of [min ansār, ‘helpers’] is extra).\n",
        "TRANSLATION_18": "(Our Lord) they say: our Lord! (Whom Thou causest to enter the Fire: him indeed Thou hast confounded) You have humiliated. (For evil-doers) for the idolaters (there will be no helpers) none will prevent what is going to happen to them in the Hereafter.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "3:192",
            "5:72",
            "6:104",
            "4:145",
            "38:61",
            "3:16",
            "23:107",
            "2:270",
            "35:37",
            "37:100"
        ],
        "BIBLE": [
            "prophets:ii%20samuel:22:36",
            "prophets:hosea:2:14",
            "prophets:nahum:1:14",
            "prophets:ezekiel:16:52",
            "writings:psalms:40:14",
            "prophets:i%20kings:5:23",
            "writings:psalms:70:2",
            "torah:leviticus:10:17",
            "prophets:ezekiel:29:5",
            "writings:psalms:118:25"
        ]
    }
}