{
    "VERSE": "3:194",
    "ARABIC": "رَبَّنَا وَءَاتِنَا مَا وَعَدتَّنَا عَلَىٰ رُسُلِكَ وَلَا تُخْزِنَا يَوْمَ ٱلْقِيَٰمَةِ إِنَّكَ لَا تُخْلِفُ ٱلْمِيعَادَ",
    "ENGLISH": {
        "TRANSLATION_0": "Our Lord, give us what You promised us through Your Messengers, and do not disgrace us on the Day of Rising. You do not break Your promise.'",
        "TRANSLATION_1": "Give us what You promised, O Lord, through Your prophets; and put us not to shame on the Day of Reckoning, for never do You go back on Your promise.\"\n",
        "TRANSLATION_2": "Our Lord, fulfil what You promised to us through Your Messengers, and disgrace us not on the Day of Resurrection; indeed You never go back on Your promise.\n",
        "TRANSLATION_3": "Lord, grant us the victory that You have promised your Messenger and do not disgrace us on the Day of Judgment; You are the One who never ignores His promise.\"\n",
        "TRANSLATION_4": "“O our Lord! And give us what You have promised us through Your Noble Messengers, and do not humiliate us on the Day of Resurrection; indeed You do not break the promise.”\n",
        "TRANSLATION_5": "Our Lord! Grant us what You promised us through Your Messengers and disgrace us not on the Day of Resurrection, for You never break (Your) Promise.\"\n",
        "TRANSLATION_6": "Our Lord! and grant us what Thou hast promised us by Thy apostles; and disgrace us not on the day of resurrection; surely Thou dost not fail to perform the promise.\n",
        "TRANSLATION_7": "Our Lord, give us what Thou hast promised us by Thy Messengers, and abase us not on the Day of Resurrection; Thou wilt not fail the tryst.'\n",
        "TRANSLATION_8": "Our Lord! And give us that which Thou hast promised to us by Thy messengers. Confound us not upon the Day of Resurrection. Lo! Thou breakest not the tryst.\n",
        "TRANSLATION_9": "Our Lord! Grant us what You have promised to us through Your messengers, and do not humiliate us on the Day of Resurrection. Surely, You never fail to fulfill Your promise.\"\n",
        "TRANSLATION_10": "Our Lord! vouchsafe unto us that which Thou hast promised us by Thine apostles, and humiliate us not on the Day of Resurrection. Verily Thou failest not the tryst.\n",
        "TRANSLATION_11": "Our Lord, give us what You have promised us through Your apostles, and do not disgrace us on the Day of Resurrection. Indeed You do not break Your promise.’\n",
        "TRANSLATION_12": "Our Lord! Grant us what Thou didst promise unto us through Thine messengers, and save us from shame on the Day of Judgment: For Thou never breakest Thy promise.\"\n",
        "TRANSLATION_13": "Our Lord! Grant us what You promised unto us through Your Messengers and disgrace us not on the Day of Resurrection, for You never break (Your) Promise.\"\n",
        "TRANSLATION_14": "Our Lord, give us what You promised us by Your Messengers, and do not abase us on the Day of Resurrection. You do not break Your promise'\n",
        "TRANSLATION_15": "“Our Lord, and give us what You have promised us through Your messengers, and do not disgrace us on the Day of Resurrection. Surely You never break a promise.”\n",
        "TRANSLATION_16": "Our Lord, and grant us what You promised us through Your messengers and do not disgrace us on the Day of Resurrection. Indeed, You do not fail in [Your] promise.\"\n",
        "TRANSLATION_17": "[3:194] Our Lord, grant us what You have promised us through, the tongues of, Your messengers, in the way of mercy and favour: they are asking Him that they be made among those that deserve such a promise, for, God’s promise is fufilled regardless, but they are not certain that they are among those who deserve it. The repetition of the phrase, our Lord, is out of extreme humility; and abase us not on the Day of Resurrection. You will not fail the tryst’, the promise of Resurrection and Requital.\n",
        "TRANSLATION_18": "(Our Lord!) and they say: our Lord. (And give us that which Thou hast promised to us by Thy messengers) on the tongue of Your Messenger, i.e. Muhammad. (Confound us not) torment us not (upon the Day of Resurrection) as You will torment the unbelievers. (Lo! Thou breakest not the tryst) resurrection after death and that which You have promised the believers.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "3:194",
            "32:25",
            "3:9",
            "39:31",
            "16:124",
            "3:53",
            "45:17",
            "14:41",
            "40:27",
            "25:30"
        ],
        "BIBLE": [
            "torah:exodus:32:24",
            "prophets:ezekiel:17:18",
            "writings:psalms:3:8",
            "prophets:ezekiel:16:59",
            "torah:exodus:19:24",
            "writings:psalms:60:3",
            "prophets:i%20kings:5:23",
            "prophets:jeremiah:33:20",
            "prophets:hosea:9:14",
            "prophets:jeremiah:48:12"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:4"
        ]
    }
}