{
    "VERSE": "3:197",
    "ARABIC": "مَتَٰعٌ قَلِيلٌ ثُمَّ مَأْوَىٰهُمْ جَهَنَّمُ وَبِئْسَ ٱلْمِهَادُ",
    "ENGLISH": {
        "TRANSLATION_0": "A brief enjoyment; then their shelter will be Hell. What an evil resting-place!",
        "TRANSLATION_1": "Their commerce is but short-lived, and then their abode shall be Hell: And what an evil abode!\n",
        "TRANSLATION_2": "This is but a little enjoyment, then their destination is Hell -what an evil resting place!\n",
        "TRANSLATION_3": "Their gains are only a means of enjoyment in this life. However, their destination is hell, the terrible dwelling.\n",
        "TRANSLATION_4": "It is a brief usage; their home is hell; and what an evil resting-place!\n",
        "TRANSLATION_5": "A brief enjoyment; then their ultimate abode is Hell; and worst indeed is that place for rest.\n",
        "TRANSLATION_6": "A brief enjoyment! then their abode is hell, and evil is the resting-place.\n",
        "TRANSLATION_7": "a little enjoyment, then their refuge is Gehenna -- an evil cradling!\n",
        "TRANSLATION_8": "It is but a brief comfort. And afterward their habitation will be hell, an ill abode.\n",
        "TRANSLATION_9": "this is only a brief enjoyment, after which Hell shall be their abode -- what an evil resting place!\n",
        "TRANSLATION_10": "A brief enjoyment, and then Hell shall be their abode; ill is the resort!\n",
        "TRANSLATION_11": "It is a trivial enjoyment; then their refuge is hell, and it is an evil resting place.\n",
        "TRANSLATION_12": "Little is it for enjoyment: Their ultimate abode is Hell: what an evil bed (To lie on)!\n",
        "TRANSLATION_13": "A brief enjoyment; then, their ultimate abode is Hell; and worst indeed is that place for rest.\n",
        "TRANSLATION_14": "a little enjoyment, then, their shelter is in Gehenna (Hell), an evil cradling.\n",
        "TRANSLATION_15": "A brief enjoyment, then their abode is Hell. What a miserable resort.\n",
        "TRANSLATION_16": "[It is but] a small enjoyment; then their [final] refuge is Hell, and wretched is the resting place.\n",
        "TRANSLATION_17": "[3:197] That is [but], a little enjoyment, which they enjoy for a short while in this world and then perishes; then their abode is Hell — an evil cradling, [an evil] resting place it is!\n",
        "TRANSLATION_18": "(It is but a brief comfort) it is but a paltry benefit in the life of this world. (And afterward their habitation will be hell, an ill abode) an ill spread and end result.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "3:197",
            "38:56",
            "7:41",
            "73:11",
            "3:12",
            "16:117",
            "4:121",
            "8:44",
            "56:73",
            "9:38"
        ],
        "BIBLE": [
            "prophets:zephaniah:2:11",
            "writings:ii%20chronicles:6:2",
            "prophets:ii%20samuel:15:21",
            "torah:deuteronomy:12:5",
            "prophets:i%20kings:8:13",
            "torah:numbers:32:17",
            "prophets:jeremiah:8:3",
            "prophets:isaiah:25:10",
            "prophets:jeremiah:45:5",
            "prophets:isaiah:18:7"
        ]
    }
}