{
    "VERSE": "3:2",
    "ARABIC": "ٱللَّهُ لَآ إِلَٰهَ إِلَّا هُوَ ٱلْحَىُّ ٱلْقَيُّومُ",
    "ENGLISH": {
        "TRANSLATION_0": "Allah, there is no god but Him, the Living, the Self-Sustaining.",
        "TRANSLATION_1": "God: there is no god but He, the living, eternal, self-subsisting, ever sustaining.\n",
        "TRANSLATION_2": "Allah, the Ever-Living, the Self-Subsisting, Who sustains the entire order of the universe - there is no God but He.\n",
        "TRANSLATION_3": "God exists. He is the only Lord, the Everlasting and the Guardian of life.\n",
        "TRANSLATION_4": "Allah – none is worthy of worship, except Him, He is Alive (eternally, on His own) and the Upholder (keeps others established).\n",
        "TRANSLATION_5": "Allah! None has the right to be worshipped but He, the Ever Living, the One Who sustains and protects all that exists.\n",
        "TRANSLATION_6": "Allah, (there is) no god but He, the Everliving, the Self-subsisting by Whom all things subsist\n",
        "TRANSLATION_7": "God, there is no god but He, the Living, the Everlasting.\n",
        "TRANSLATION_8": "Allah! There is no god save Him, the Alive, the Eternal.\n",
        "TRANSLATION_9": "God! There is no deity save Him, the Living, the Sustainer.\n",
        "TRANSLATION_10": "Allah There is no god but He, the Living, the Sustainer.\n",
        "TRANSLATION_11": "Allah—there is no god except Him—is the Living One, the All-sustainer.\n",
        "TRANSLATION_12": "Allah! There is no god but He,-the Living, the Self-Subsisting, Eternal.\n",
        "TRANSLATION_13": "Allah! La ilaha illa Huwa (none has the right to be worshipped but He), the Ever Living, the One Who sustains and protects all that exists.\n",
        "TRANSLATION_14": "Allah! There is no god except He, the Living, the Everlasting.\n",
        "TRANSLATION_15": "God, there is no god but He, the Living, the Eternal.\n",
        "TRANSLATION_16": "Allah - there is no deity except Him, the Ever-Living, the Sustainer of existence.\n",
        "TRANSLATION_17": "[3:2] God! There is no god except Him, the Living, the Eternal.\n",
        "TRANSLATION_18": "(Allah! There is no God save Him, the Alive) Who dies not and is not evanescent, (the Eternal) the Self- subsistent Who has no beginning.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "3:2",
            "16:107",
            "9:96",
            "20:8",
            "7:99",
            "35:22",
            "64:13",
            "63:6",
            "2:163",
            "45:14"
        ],
        "BIBLE": [
            "prophets:i%20kings:11:10",
            "prophets:i%20samuel:13:13",
            "prophets:habakkuk:1:12",
            "prophets:i%20kings:3:11",
            "prophets:i%20kings:15:5",
            "prophets:jeremiah:45:5",
            "writings:psalms:72:18",
            "prophets:i%20samuel:25:34",
            "writings:ii%20chronicles:30:5",
            "prophets:ezekiel:5:11"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:2",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:14",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:13",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:5:4"
        ]
    }
}