{
    "VERSE": "3:25",
    "ARABIC": "فَكَيْفَ إِذَا جَمَعْنَٰهُمْ لِيَوْمٍ لَّا رَيْبَ فِيهِ وَوُفِّيَتْ كُلُّ نَفْسٍ مَّا كَسَبَتْ وَهُمْ لَا يُظْلَمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "That is because they say, The Fire will only touch us for a number of days.' Their inventions have deluded them in their deen.",
        "TRANSLATION_1": "How shall it be when We gather them together on a day that is certain to come, when each will receive his reward without (favour or) wrong?\n",
        "TRANSLATION_2": "How, then, will they fare when We shall gather them all together to witness the Day about (the coming of) which there is no doubt, and when every human being shall be repaid in full for what he has done, and none shall be wronged?\n",
        "TRANSLATION_3": "What will happen to their belief when We bring them together on the Inevitable Day when every soul will be justly recompensed for its deeds?\n",
        "TRANSLATION_4": "So what will be (their state) when We bring all of them together for the Day (of Resurrection) about which there is no doubt; and every soul will be paid back in full for what it has earned, and they will not be wronged.\n",
        "TRANSLATION_5": "How (will it be) when We gather them together on the Day about which there is no doubt (i.e. the Day of Resurrection). And each person will be paid in full what he has earned And they will not be dealt with unjustly.\n",
        "TRANSLATION_6": "Then how will it be when We shall gather them together on a day about which there is no doubt, and every soul shall be fully paid what it has earned, and they shall not be dealt with unjustly?\n",
        "TRANSLATION_7": "But how will it be, when We gather them for a day whereon is no doubt, and every soul shall be paid in full what it has earned, and they shall not be wronged?\n",
        "TRANSLATION_8": "How (will it be with them) when We have brought them all together to a Day of which there is no doubt, when every soul will be paid in full what it hath earned, and they will not be wronged.\n",
        "TRANSLATION_9": "How will it be when We gather them all together upon a Day which is sure to come, when every human being shall be repaid in full for what he has done? They will not be wronged.\n",
        "TRANSLATION_10": "How shall it be then, when we shall gather them on the Day whereof there is no doubt, and every soul shall be repaid in full that which it hath earned, and they shall not be wronged.\n",
        "TRANSLATION_11": "But how will it be [with them] when We gather them on a day in which there is no doubt, and every soul shall be recompensed fully for what it has earned, and they will not be wronged?\n",
        "TRANSLATION_12": "But how (will they fare) when we gather them together against a day about which there is no doubt, and each soul will be paid out just what it has earned, without (favour or) injustice?\n",
        "TRANSLATION_13": "How (will it be) when We gather them together on the Day about which there is no doubt (i.e. the Day of Resurrection). And each person will be paid in full what he has earned? And they will not be dealt with unjustly.\n",
        "TRANSLATION_14": "How will it be when We gather them for a Day in which there is no doubt, when every soul will be given what it has earned and they will not be wronged?\n",
        "TRANSLATION_15": "How about when We gather them for a Day in which there is no doubt, and each soul will be paid in full for what it has earned, and they will not be wronged?\n",
        "TRANSLATION_16": "So how will it be when We assemble them for a Day about which there is no doubt? And each soul will be compensated [in full for] what it earned, and they will not be wronged.\n",
        "TRANSLATION_17": "[3:25] But how will it be, their predicament, when We gather them for a day, that is to say, on a day, of which there is no doubt, no uncertainty, that is, the Day of Resurrection; and every soul, from among the People of the Scripture and others, shall be paid in full, the requital of, what is has earned, [what] it has done of good or evil, and they, that is, people, shall not be wronged?, in that no good deed shall be diminished, and no evil deed shall be increased.\n",
        "TRANSLATION_18": "(How (will it be with them)) how shall they act, Muhammad, (when We have brought them all together) after they die (to a Day) on a day (of which there is no doubt, when every soul) righteous or sinner (will be paid in full what it has earned) of good or evil, (and they will not be wronged) their good works will not be decreased and their sins will not be increased.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "3:25",
            "16:111",
            "2:281",
            "3:161",
            "6:24",
            "6:12",
            "39:70",
            "14:45",
            "6:123",
            "36:54"
        ],
        "BIBLE": [
            "prophets:ezekiel:38:8",
            "prophets:malachi:3:2",
            "prophets:jeremiah:16:14",
            "prophets:isaiah:7:17",
            "writings:lamentations:1:12",
            "prophets:jeremiah:23:7",
            "prophets:i%20samuel:28:1",
            "writings:lamentations:1:21",
            "prophets:isaiah:43:9",
            "prophets:ezekiel:29:5"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:2:2",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:1"
        ]
    }
}