{
    "VERSE": "3:28",
    "ARABIC": "لَّا يَتَّخِذِ ٱلْمُؤْمِنُونَ ٱلْكَٰفِرِينَ أَوْلِيَآءَ مِن دُونِ ٱلْمُؤْمِنِينَ وَمَن يَفْعَلْ ذَٰلِكَ فَلَيْسَ مِنَ ٱللَّهِ فِى شَىْءٍ إِلَّآ أَن تَتَّقُوا۟ مِنْهُمْ تُقَىٰةً وَيُحَذِّرُكُمُ ٱللَّهُ نَفْسَهُۥ وَإِلَى ٱللَّهِ ٱلْمَصِيرُ",
    "ENGLISH": {
        "TRANSLATION_0": "You merge the night into the day. You merge the day into the night. You bring out the living from the dead. You bring out the dead from the living. You provide for whoever You will without any reckoning.'",
        "TRANSLATION_1": "Those who believe should not take unbelievers as their friends in preference to those who believe -- and whoever does so should have no (expectations) of God -- unless to safeguard yourselves against them. But God commands you to beware of Him, for to God you will journey in the end.\n",
        "TRANSLATION_2": "The believers may not take the unbelievers for their allies in preference to those who believe. Whoever does this has nothing to do with Allah unless he does so in order to protect himself from their wrong-doing. Allah warns you to beware of Him for it is to Allah that you will return.\n",
        "TRANSLATION_3": "The believers must not establish friendship with the unbelievers in preference to the faithful. Whoever does so has nothing to hope for from God unless he does it out of fear or taqiyah (pious dissimulation). God warns you about Himself. To God do all things return.\n",
        "TRANSLATION_4": "The Muslims must not befriend the disbelievers, in preference over the Muslims; whoever does that has no connection whatsoever with Allah, except if you fear them; Allah warns you of His wrath; and towards Allah only is the return.\n",
        "TRANSLATION_5": "Let not the believers take the disbelievers as friends instead of the believers, and whoever does that, will never be helped by Allah in any way, unless you indeed fear a danger from them. And Allah warns you against Himself, and to Allah is the final return.\n",
        "TRANSLATION_6": "Let not the believers take the unbelievers for friends rather than believers; and whoever does this, he shall have nothing of (the guardianship of) Allah, but you should guard yourselves against them, guarding carefully; and Allah makes you cautious of (retribution from) Himself; and to Allah is the eventual coming.\n",
        "TRANSLATION_7": "Let not the believers take the unbelievers for friends, rather than the believers -- for whoso does that belongs not to God in anything -- unless you have a fear of them. God warns you that You beware of Him, and unto God is the homecoming.\n",
        "TRANSLATION_8": "Let not the believers take disbelievers for their friends in preference to believers. Whoso doeth that hath no connection with Allah unless (it be) that ye but guard yourselves against them, taking (as it were) security. Allah biddeth you beware (only) of Himself. Unto Allah is the journeying.\n",
        "TRANSLATION_9": "Let not the believers take those who deny the truth for their allies in preference to the believers, anyone who does that will isolate himself completely from God, unless it be to protect yourselves against them in this way. God admonishes you to fear Him: for, to God shall all return.\n",
        "TRANSLATION_10": "Let not the believers take unto themselves the infidels as friends, beside the believers: and whosoever doth that, then he is not in respect of Allah in aught, unless indeed ye fear from them a danger. And Allah maketh ye beware of Himself; and unto Allah is the last wending.\n",
        "TRANSLATION_11": "The faithful should not take the faithless for allies instead of the faithful, and Allah will have nothing to do with those who do that, except when you are wary of them, out of caution. Allah warns you to beware of [disobeying] Him, and toward Allah is the return.\n",
        "TRANSLATION_12": "Let not the believers Take for friends or helpers Unbelievers rather than believers: if any do that, in nothing will there be help from Allah: except by way of precaution, that ye may Guard yourselves from them. But Allah cautions you (To remember) Himself; for the final goal is to Allah.\n",
        "TRANSLATION_13": "Let not the believers take the disbelievers as Auliya (supporters, helpers, etc.) instead of the believers, and whoever does that will never be helped by Allah in any way, except if you indeed fear a danger from them. And Allah warns you against Himself (His Punishment), and to Allah is the final return.\n",
        "TRANSLATION_14": "The believers should not take the unbelievers as guides in preference to the believers he who does this does not belong to Allah in anything, unless you have a fear of them. Allah warns you to be cautious of Him, the arrival is to Allah.\n",
        "TRANSLATION_15": "Believers are not to take disbelievers for friends instead of believers. Whoever does that has nothing to do with God, unless it is to protect your own selves against them. God warns you to beware of Him. To God is the destiny.\n",
        "TRANSLATION_16": "Let not believers take disbelievers as allies rather than believers. And whoever [of you] does that has nothing with Allah, except when taking precaution against them in prudence. And Allah warns you of Himself, and to Allah is the [final] destination.\n",
        "TRANSLATION_17": "[3:28] Let not the believers take the disbelievers as patrons, rather than, that is, instead of, the believers — for whoever does that, that is, [whoever] takes them as patrons, does not belong to, the religion of, God in anyway — unless you protect yourselves against them, as a safeguard (tuqātan, ‘as a safeguard’, is the verbal noun from taqiyyatan), that is to say, [unless] you fear something, in which case you may show patronage to them through words, but not in your hearts: this was before the hegemony of Islam and [the dispensation] applies to any individual residing in a land with no say in it. God warns you, He instills fear in you, of His Self, [warning] that He may be wrathful with you if you take them as patrons; and to God is the journey’s end, the return, and He will requite you.\n",
        "TRANSLATION_18": "(Let not the believers take) the believers ought not to take [the hypocrites:] 'Abdullah Ibn Ubayy and his companions [and] (disbelievers) the Jews (for their friends) so as to become mighty and honourable (in preference to believers) who are sincere. (Whoso doeth that) seeking might and honour [by taking the hypocrites and disbelievers as friends] (hath no connection with Allah) has no honour, mercy or protection from Allah (unless (it be) that ye but guard yourselves against them) save yourselves from them, (taking (as it were) security) saving yourselves from them by speaking in a friendly way towards them with, while your hearts dislikes this. (Allah bideth you beware (only) of Himself) regarding the shunning of unlawful killing, unlawful sex, unlawful property, consuming intoxicants, false testimony and associating partners with Allah. (Unto Allah is the journeying) the return after death.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "3:28",
            "64:16",
            "16:20",
            "4:144",
            "11:113",
            "42:9",
            "46:32",
            "40:74",
            "82:19",
            "16:35"
        ],
        "BIBLE": [
            "prophets:joshua:6:18",
            "writings:ecclesiastes:3:14",
            "prophets:isaiah:55:11",
            "torah:exodus:23:13",
            "torah:deuteronomy:13:15",
            "prophets:ii%20samuel:23:5",
            "writings:ezra:5:5",
            "prophets:ii%20samuel:15:20",
            "writings:ii%20chronicles:19:7",
            "writings:ii%20chronicles:30:5"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:4:12"
        ]
    }
}