{
    "VERSE": "3:3",
    "ARABIC": "نَزَّلَ عَلَيْكَ ٱلْكِتَٰبَ بِٱلْحَقِّ مُصَدِّقًا لِّمَا بَيْنَ يَدَيْهِ وَأَنزَلَ ٱلتَّوْرَىٰةَ وَٱلْإِنجِيلَ",
    "ENGLISH": {
        "TRANSLATION_0": "He has sent down the Book to you with truth, confirming what was there before it. And He sent down the Torah and the Gospel,",
        "TRANSLATION_1": "He has verily revealed to you this Book, in truth and confirmation of the Books revealed before, as indeed He had revealed the Torah and the Gospel\n",
        "TRANSLATION_2": "He has revealed this Book to you, setting forth the truth and confirming the earlier Books, and earlier He revealed the Torah and Gospel\n",
        "TRANSLATION_3": "He has sent the Book (Quran) to you (Muhammad) in all Truth. It confirms the original Bible. He revealed the Torah and the Gospel\n",
        "TRANSLATION_4": "He has sent down to you (O dear Prophet Mohammed – peace and blessings be upon him) this true Book (the Holy Qur’an), confirming the Books before it, and He sent down the Taurat (Torah) and the Injeel (Bible). –\n",
        "TRANSLATION_5": "It is He Who has sent down the Book to you with truth, confirming what came before it. And He sent down the Tawrah and the Injil,\n",
        "TRANSLATION_6": "He has revealed to you the Book with truth, verifying that which is before it, and He revealed the Tavrat and the Injeel aforetime, a guidance for the people, and He sent the Furqan.\n",
        "TRANSLATION_7": "He has sent down upon thee the Book with the truth, confirming what was before it, and He sent down the Torah and the Gospel\n",
        "TRANSLATION_8": "He hath revealed unto thee (Muhammad) the Scripture with truth, confirming that which was (revealed) before it, even as He revealed the Torah and the Gospel.\n",
        "TRANSLATION_9": "He has sent down the Book to you with truth, which fulfils [the predictions] in the Scriptures that preceded it: He sent down the Torah and the Gospel\n",
        "TRANSLATION_10": "He hath revealed unto thee the Book with truth confirming that which went before it; and He sent down the Taurat and Injil.\n",
        "TRANSLATION_11": "He has sent down to you the Book with the truth, confirming what was [revealed] before it, and He had sent down the Torah and the Evangel\n",
        "TRANSLATION_12": "It is He Who sent down to thee (step by step), in truth, the Book, confirming what went before it; and He sent down the Law (of Moses) and the Gospel (of Jesus) before this, as a guide to mankind, and He sent down the criterion (of judgment between right and wrong).\n",
        "TRANSLATION_13": "It is He Who has sent down the Book (the Quran) to you (Muhammad SAW) with truth, confirming what came before it. And he sent down the Taurat (Torah) and the Injeel (Gospel).\n",
        "TRANSLATION_14": "He has sent down to you the Book with the truth, confirming what preceded it; and He has sent down the Torah and the Gospel (of Prophet Jesus which has been lost)\n",
        "TRANSLATION_15": "He sent down to you the Book with the Truth, confirming what came before it; and He sent down the Torah and the Gospel.\n",
        "TRANSLATION_16": "He has sent down upon you, [O Muhammad], the Book in truth, confirming what was before it. And He revealed the Torah and the Gospel.\n",
        "TRANSLATION_17": "[3:3] He has revealed to you, O Muhammad (s), the Book, the Qur’ān, enveloped, by the truth, with veracity, in what it announces, confirming what was before it, of Books; and He revealed the Torah and the Gospel\n",
        "TRANSLATION_18": "(He hath revealed unto thee (Muhammad) the Scripture) He sent you Gabriel with the Scripture (with truth) in order to show truth from falsehood, (confirming) corroborating Allah's divine Oneness (that which was (revealed) before it) of scriptures, (even as He revealed the Torah) in one go to Moses the son of Amran (and the Gospel) in one go to the Jesus the son of Mary. 51\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "3:3",
            "46:30",
            "35:31",
            "45:29",
            "39:2",
            "4:105",
            "3:71",
            "39:41",
            "9:29",
            "6:92"
        ],
        "BIBLE": [
            "prophets:zechariah:8:10",
            "writings:ii%20chronicles:17:9",
            "writings:daniel:7:10",
            "prophets:i%20samuel:18:5",
            "prophets:joshua:8:13",
            "prophets:joshua:3:16",
            "torah:numbers:7:1",
            "prophets:i%20samuel:15:12",
            "prophets:ii%20samuel:15:24",
            "prophets:joshua:18:9"
        ]
    }
}