{
    "VERSE": "3:31",
    "ARABIC": "قُلْ إِن كُنتُمْ تُحِبُّونَ ٱللَّهَ فَٱتَّبِعُونِى يُحْبِبْكُمُ ٱللَّهُ وَيَغْفِرْ لَكُمْ ذُنُوبَكُمْ وَٱللَّهُ غَفُورٌ رَّحِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "On the Day that each self finds the good it did, and the evil it did, present there in front of it, it will wish there were an age between it and then. Allah advises you to beware of Him. Allah is Ever-Gentle with His slaves.",
        "TRANSLATION_1": "Say: \"If you love God then follow me that God may love you and forgive your faults; for God is forgiving and kind.\"\n",
        "TRANSLATION_2": "(O Messenger!) Tell people: 'If you indeed love Allah, follow me, and Allah will love you and will forgive you your sins. Allah is All-Forgiving, All-Compassionate.'\n",
        "TRANSLATION_3": "(Muhammad), tell them, \"If you love God, follow me. God will love you and forgive your sins. God is All-forgiving and All-merciful.\"\n",
        "TRANSLATION_4": "Proclaim, (O dear Prophet Mohammed – peace and blessings be upon him), “O mankind! If you love Allah, follow me – Allah will love you and forgive you your sins”; and Allah is Oft Forgiving, Most Merciful.\n",
        "TRANSLATION_5": "Say (O Muhammad to mankind): \"If you (really) love Allah, then follow me (i.e. Muhammad), Allah will love you and forgive you your sins. And Allah is Oft-Forgiving, Most Merciful.\"\n",
        "TRANSLATION_6": "Say: If you love Allah, then follow me, Allah will love you and forgive you your faults, and Allah is Forgiving, Merciful.\n",
        "TRANSLATION_7": "Say: 'If you love God, follow me, and God will love you, and forgive you your sins; God is All-forgiving, All-compassionate.'\n",
        "TRANSLATION_8": "Say, (O Muhammad, to mankind): If ye love Allah, follow me; Allah will love you and forgive you your sins. Allah is Forgiving, Merciful.\n",
        "TRANSLATION_9": "Say, \"If you love God, follow me and God will love you and forgive you your sins. God is most forgiving, and most merciful.\"\n",
        "TRANSLATION_10": "Say thou: if ye, are wont to love Allah, then follow me, and Allah shall rove you and forgive you your sins; and Allah is Forgiving, Merciful.\n",
        "TRANSLATION_11": "Say, ‘If you love Allah, then follow me; Allah will love you and forgive you your sins, and Allah is all-forgiving, all-merciful.’\n",
        "TRANSLATION_12": "Say: \"If ye do love Allah, Follow me: Allah will love you and forgive you your sins: For Allah is Oft-Forgiving, Most Merciful.\"\n",
        "TRANSLATION_13": "Say (O Muhammad SAW to mankind): \"If you (really) love Allah then follow me (i.e. accept Islamic Monotheism, follow the Quran and the Sunnah), Allah will love you and forgive you of your sins. And Allah is Oft-Forgiving, Most Merciful.\"\n",
        "TRANSLATION_14": "Say (Prophet Muhammad): 'If you love Allah, follow me and Allah will love you, and forgive your sins. Allah is Forgiving and Merciful'\n",
        "TRANSLATION_15": "Say, “If you love God, then follow me, and God will love you, and will forgive you your sins.” God is Forgiving and Merciful.\n",
        "TRANSLATION_16": "Say, [O Muhammad], \"If you should love Allah, then follow me, [so] Allah will love you and forgive you your sins. And Allah is Forgiving and Merciful.\"\n",
        "TRANSLATION_17": "[3:31] When they said, ‘We only worship idols out of our love for God, that they might bring us close to Him’, the following was revealed: Say, O Muhammad (s), ‘If you love God, follow me, and God will love you, meaning that He will reward you, and forgive you your sins; God is Forgiving, as regards the sins, committed previously, by one who [now] follows me; Merciful, to him.\n",
        "TRANSLATION_18": "(Say) Muhammad!: (If ye love Allah) and His religion, (follow me) follow my Religion; (Allah will love you) He will increase your love (and forgive you your sins) which were committed when you followed Judaism. (Allah is Forgiving) of whoever repents, (Merciful) towards whoever dies in a state of repentance. This verse was revealed about the Jews who claimed they were the children of Allah and His beloved ones. When this verse was revealed 'Abdullah Ibn Ubayy said: \"Muhammad is commanding us to love him as the Christians loved Jesus\", and the Jews said: \"Muhammad wants us to take him as a compassionate Lord, just as the Christians took Jesus as a compassionate Lord\".\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "3:31",
            "2:192",
            "4:106",
            "5:74",
            "33:73",
            "4:96",
            "16:18",
            "2:218",
            "5:39",
            "9:102"
        ],
        "BIBLE": [
            "prophets:jeremiah:4:10",
            "prophets:i%20kings:20:10",
            "prophets:jeremiah:14:13",
            "prophets:jeremiah:16:10",
            "writings:ruth:1:16",
            "torah:exodus:18:23",
            "prophets:hosea:2:25",
            "torah:exodus:20:17",
            "prophets:amos:4:5",
            "prophets:joshua:24:19"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:5:2"
        ]
    }
}