{
    "VERSE": "3:32",
    "ARABIC": "قُلْ أَطِيعُوا۟ ٱللَّهَ وَٱلرَّسُولَ فَإِن تَوَلَّوْا۟ فَإِنَّ ٱللَّهَ لَا يُحِبُّ ٱلْكَٰفِرِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Say, 'If you love Allah, then follow me and Allah will love you and forgive you for your wrong actions. Allah is Ever-Forgiving, Most Merciful.'",
        "TRANSLATION_1": "Say: \"Obey God and His Messenger;\" and if they refuse (then remember) God does not love disbelievers.\n",
        "TRANSLATION_2": "Say: 'Obey Allah and obey the Messenger.' If they turn away from this then know that Allah does not love those who refuse to obey Him and His Messenger.\n",
        "TRANSLATION_3": "Tell them, \"Obey God and the Messenger.\" If they turn away (let it be known) that God does not love the unbelievers.\n",
        "TRANSLATION_4": "Proclaim, “Obey Allah and the Noble Messenger”; so if they turn away – then Allah is not pleased with the disbelievers.\n",
        "TRANSLATION_5": "Say: \"Obey Allah and the Messenger.\" But if they turn away, then Allah does not like the disbelievers.\n",
        "TRANSLATION_6": "Say: Obey Allah and the Apostle; but if they turn back, then surely Allah does not love the unbelievers.\n",
        "TRANSLATION_7": "Say: 'Obey God, and the Messenger.' But if they turn their backs, God loves not the unbelievers.\n",
        "TRANSLATION_8": "Say: Obey Allah and the messenger. But if they turn away, lo! Allah loveth not the disbelievers (in His guidance).\n",
        "TRANSLATION_9": "Say, \"Obey God and the Messenger,\" and if they turn away, God does not love those who deny the truth.\n",
        "TRANSLATION_10": "Say thou: obey Allah and the apostle if thereafter they turn away. then verily Allah loveth not the infidels.\n",
        "TRANSLATION_11": "Say, ‘Obey Allah and the Apostle.’ But if they turn away, indeed Allah does not like the faithless.\n",
        "TRANSLATION_12": "Say: \"Obey Allah and His Messenger\": But if they turn back, Allah loveth not those who reject Faith.\n",
        "TRANSLATION_13": "Say (O Muhammad SAW): \"Obey Allah and the Messenger (Muhammad SAW).\" But if they turn away, then Allah does not like the disbelievers.\n",
        "TRANSLATION_14": "Say: 'Obey Allah and the Messenger' But if they turn away, then truly, Allah does not love the unbelievers.\n",
        "TRANSLATION_15": "Say, “Obey God and the Messenger.” But if they turn away—God does not love the faithless.\n",
        "TRANSLATION_16": "Say, \"Obey Allah and the Messenger.\" But if they turn away - then indeed, Allah does not like the disbelievers.\n",
        "TRANSLATION_17": "[3:32] Say, to them: ‘Obey God, and the Messenger’, as regards the [belief in the] Oneness of God which he enjoins upon you. But if they turn their backs, [if they] object to obedience, God loves not the disbelievers, meaning that He will chastise them (the [third person] pronominalisation [‘they’] is replaced by the overt noun [‘the disbelievers’]).\n",
        "TRANSLATION_18": "Consequently, Allah revealed about their comments: (Say: Obey Allah) regarding what He has obligated (and the Messenger) in his practices. (But if they turn away) from obeying them, (Lo! Allah loveth not the disbelievers) the Jews and the hypocrites.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "3:32",
            "3:132",
            "64:12",
            "5:92",
            "4:80",
            "5:56",
            "24:54",
            "63:1",
            "24:52",
            "48:13"
        ],
        "BIBLE": [
            "prophets:i%20kings:18:37",
            "prophets:jonah:3:9",
            "writings:ii%20chronicles:6:42",
            "prophets:ezekiel:29:16",
            "prophets:ii%20samuel:22:41",
            "torah:genesis:38:16",
            "writings:psalms:18:41",
            "prophets:joshua:7:8",
            "torah:deuteronomy:11:28",
            "torah:genesis:30:30"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:9"
        ]
    }
}