{
    "VERSE": "3:33",
    "ARABIC": "إِنَّ ٱللَّهَ ٱصْطَفَىٰٓ ءَادَمَ وَنُوحًا وَءَالَ إِبْرَٰهِيمَ وَءَالَ عِمْرَٰنَ عَلَى ٱلْعَٰلَمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Say, 'Obey Allah and the Messenger.' Then if they turn away, Allah does not love the kafirun.",
        "TRANSLATION_1": "God had chosen Adam and Noah and the families of Abraham and 'Imran in preference to others.\n",
        "TRANSLATION_2": "Truly Allah chose Adam and Noah and the descendants of Abraham and of 'Imran above all mankind.\n",
        "TRANSLATION_3": "God chose (and gave distinction to) Adam, Noah, the family of Abraham, and Imran over all the people of the world.\n",
        "TRANSLATION_4": "Indeed Allah chose Adam, and Nooh, and the Family of Ibrahim, and the Family of Imran over the creation.\n",
        "TRANSLATION_5": "Allah chose Adam, Nuh (Noah), the family of Ibrahim and the family of `Imran above the nations.\n",
        "TRANSLATION_6": "Surely Allah chose Adam and Nuh and the descendants of Ibrahim and the descendants of Imran above the nations.\n",
        "TRANSLATION_7": "God chose Adam and Noah and the House of Abraham and the House of Imran above all beings, the\n",
        "TRANSLATION_8": "Lo! Allah preferred Adam and Noah and the Family of Abraham and the Family of 'Imran above (all His) creatures.\n",
        "TRANSLATION_9": "God chose Adam and Noah and the family of Abraham and the family of 'Imran above all His creatures.\n",
        "TRANSLATION_10": "Verily did Allah choose Adam and Nuh and the house of lbrahim and the house of 'lmran out of the worlds\n",
        "TRANSLATION_11": "Indeed Allah chose Adam and Noah, and the progeny of Abraham and the progeny of Imran above all the nations;\n",
        "TRANSLATION_12": "Allah did choose Adam and Noah, the family of Abraham, and the family of 'Imran above all people,-\n",
        "TRANSLATION_13": "Allah chose Adam, Nuh (Noah), the family of Ibrahim (Abraham) and the family of 'Imran above the 'Alamin (mankind and jinns) (of their times).\n",
        "TRANSLATION_14": "Allah chose Adam and Noah, the House of Abraham and the House of Imran above all worlds.\n",
        "TRANSLATION_15": "God chose Adam, and Noah, and the family of Abraham, and the family of Imran, over all mankind.\n",
        "TRANSLATION_16": "Indeed, Allah chose Adam and Noah and the family of Abraham and the family of 'Imran over the worlds -\n",
        "TRANSLATION_17": "[3:33]   Lo! God preferred, He has chosen, Adam and Noah and the House of Abraham and the House of ‘Imrān, meaning [He preferred] their selves [sc. Abraham and ‘Imrān], above the worlds, by making prophethood reside in [them and] their progeny:\n",
        "TRANSLATION_18": "56 When the Jews heard this, they said: \"we follow the religion of Adam: we are Muslims\", and so Allah revealed the following: (Lo! Allah preferred Adam) with Islam (and Noah) with Islam (and the Family of Abraham) the children of Abraham with Islam (and the Family of 'Imran) Moses and Aaron with Islam (above (all His) creatures) above all the people of their times. It is also said that Amran is not the father of Moses and Aaron.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "3:33",
            "28:56",
            "3:42",
            "3:63",
            "33:64",
            "8:61",
            "37:182",
            "46:23",
            "2:227",
            "7:140"
        ],
        "BIBLE": [
            "prophets:ezekiel:28:25",
            "prophets:ii%20kings:12:15",
            "prophets:ezekiel:36:28",
            "prophets:joshua:13:24",
            "prophets:joshua:13:15",
            "prophets:joshua:13:29",
            "torah:genesis:15:3",
            "prophets:ii%20kings:18:15",
            "writings:ii%20chronicles:33:10",
            "torah:numbers:17:21"
        ]
    }
}