{
    "VERSE": "3:34",
    "ARABIC": "ذُرِّيَّةًۢ بَعْضُهَا مِنۢ بَعْضٍ وَٱللَّهُ سَمِيعٌ عَلِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "Allah chose Adam and Nuh and the family of Ibrahim and the family of 'Imran over all other beings -",
        "TRANSLATION_1": "They were descendants of one another; and God hears all and knows everything.\n",
        "TRANSLATION_2": "(for His messengership) - a people alike and the seed of one another. Allah is All-Hearing, All-Knowing.\n",
        "TRANSLATION_3": "They were the offspring of one another. God is All-hearing and All-seeing.\n",
        "TRANSLATION_4": "They are the descendants one of another; and Allah is the All Hearing, the All Knowing.\n",
        "TRANSLATION_5": "Offspring, one of the other, and Allah is All-Hearer, All-Knower.\n",
        "TRANSLATION_6": "Offspring one of the other; and Allah is Hearing, Knowing.\n",
        "TRANSLATION_7": "seed of one another; God hears, and knows.\n",
        "TRANSLATION_8": "They were descendants one of another. Allah is Hearer, Knower.\n",
        "TRANSLATION_9": "They are the offspring of one another. God hears all and knows all.\n",
        "TRANSLATION_10": "Progeny, one of the other, and Allah is Hearing, Knowing.\n",
        "TRANSLATION_11": "some of them are descendants of the others, and Allah is all-hearing, all-knowing.\n",
        "TRANSLATION_12": "Offspring, one of the other: And Allah heareth and knoweth all things.\n",
        "TRANSLATION_13": "Offspring, one of the other, and Allah is the All-Hearer, All-Knower.\n",
        "TRANSLATION_14": "They were the offspring of one another. Allah is Hearing, and Knowing.\n",
        "TRANSLATION_15": "Offspring one of the other. God is Hearer and Knower.\n",
        "TRANSLATION_16": "Descendants, some of them from others. And Allah is Hearing and Knowing.\n",
        "TRANSLATION_17": "[3:34] the seed of one, offspring from, another, of them; God is Hearer, Knower.\n",
        "TRANSLATION_18": "(They were descendants one of another) some follow the religion of others and the offspring of some are the descendents of others. (Allah is Hearer) of what the Jews say: that they are Allah's children and beloved ones and that they follow His religion, (Knower) of their punishment and of whom is following His religion.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "3:34",
            "2:244",
            "29:60",
            "5:76",
            "4:148",
            "8:61",
            "3:121",
            "4:147",
            "84:23",
            "6:53"
        ],
        "BIBLE": [
            "prophets:isaiah:61:9",
            "writings:i%20chronicles:16:26",
            "writings:psalms:96:5",
            "writings:i%20chronicles:29:17",
            "writings:proverbs:30:18",
            "prophets:i%20kings:8:60",
            "writings:ecclesiastes:1:8",
            "prophets:i%20samuel:2:23",
            "prophets:isaiah:44:9",
            "writings:psalms:101:4"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:2",
            "Sefer%20Yetzirah:4:2",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:1:14",
            "Sefer%20Yetzirah:1:7"
        ]
    }
}