{
    "VERSE": "3:35",
    "ARABIC": "إِذْ قَالَتِ ٱمْرَأَتُ عِمْرَٰنَ رَبِّ إِنِّى نَذَرْتُ لَكَ مَا فِى بَطْنِى مُحَرَّرًا فَتَقَبَّلْ مِنِّىٓ إِنَّكَ أَنتَ ٱلسَّمِيعُ ٱلْعَلِيمُ",
    "ENGLISH": {
        "TRANSLATION_0": "descendants one of the other. Allah is All-Hearing, All-Knowing.",
        "TRANSLATION_1": "Remember, when the wife of 'Imran prayed: \"O Lord, I offer what I carry in my womb in dedication to Your service, accept it, for You hear all and know everything.\"\n",
        "TRANSLATION_2": "(He also heard) when the woman of 'Imran said: 'O Lord! Behold, unto You do I vow that the child in my womb is to be devoted to Your exclusive service. Accept it, then, from me. Surely You alone are All-Hearing, All-Knowing.'\n",
        "TRANSLATION_3": "Remember when Imran's wife prayed to her Lord saying, \"I have made a vow to dedicate to Your service whatever is in my womb. Lord, accept it from me. You are All-hearing and All-knowing\".\n",
        "TRANSLATION_4": "(Remember) When the wife of Imran said, “My Lord! I pledge to you what is in my womb – that it shall be dedicated purely in Your service, so accept it from me; indeed You only are the All Hearing, the All Knowing.”\n",
        "TRANSLATION_5": "(Remember) when the wife of `Imran said: \"O my Lord! I have vowed to You what is in my womb to be dedicated for Your services, so accept this from me. Verily, You are the All-Hearer, the All-Knowing.\"\n",
        "TRANSLATION_6": "When a woman of Imran said: My Lord! surely I vow to Thee what is in my womb, to be devoted (to Thy service); accept therefore from me, surely Thou art the Hearing, the Knowing.\n",
        "TRANSLATION_7": "When the wife of Imran said, 'Lord, I have vowed to Thee, in dedication, what is within my womb. Receive Thou this from me; Thou hearest, and knowest.'\n",
        "TRANSLATION_8": "(Remember) when the wife of 'Imran said: My Lord! I have vowed unto Thee that which is in my belly as a consecrated (offering). Accept it from me. Lo! Thou, only Thou, art the Hearer, the Knower!\n",
        "TRANSLATION_9": "Remember when the wife of 'Imran said, \"My Lord, I have dedicated what is in my womb entirely to Your service. So accept this from me. You are the One who hears and knows all.\"\n",
        "TRANSLATION_10": "Recall what time the wife of 'lmran said my Lord verily have vowed unto Thee that which is in my belly to be dedicated; accept Thou then of me. Verily Thou! Thou art the Hearer, the Knower.\n",
        "TRANSLATION_11": "When the wife of Imran said, ‘My Lord, I dedicate to You in consecration what is in my belly. Accept it from me; indeed You are the All-hearing, the All-knowing.’\n",
        "TRANSLATION_12": "Behold! a woman of 'Imran said: \"O my Lord! I do dedicate unto Thee what is in my womb for Thy special service: So accept this of me: For Thou hearest and knowest all things.\"\n",
        "TRANSLATION_13": "(Remember) when the wife of 'Imran said: \"O my Lord! I have vowed to You what (the child that) is in my womb to be dedicated for Your services (free from all worldly work; to serve Your Place of worship), so accept this, from me. Verily, You are the All-Hearer, the All-Knowing.\"\n",
        "TRANSLATION_14": "(Remember) when the wife of 'Imran said: 'Lord, I have vowed to You in dedication that which is hidden inside me. Accept this from me. You are the Hearer, the Knower'\n",
        "TRANSLATION_15": "The wife of Imran said, “My Lord, I have vowed to You what is in my womb, dedicated, so accept from me; You are the Hearer and Knower.”\n",
        "TRANSLATION_16": "[Mention, O Muhammad], when the wife of 'Imran said, \"My Lord, indeed I have pledged to You what is in my womb, consecrated [for Your service], so accept this from me. Indeed, You are the Hearing, the Knowing.\"\n",
        "TRANSLATION_17": "[3:35] Mention, when the wife of ‘Imrān, Hanna, said, after she had reached old age and longed for a child, and supplicated to God and sensed that she was carrying child, ‘O, Lord, I have vowed to, offer, You what is within my womb as a consecration, [one] liberated and delivered from the distractions of this world for the service of Your Holy House [in Jerusalem]. Accept this from me. Lo! It is You Who are the Hearer, of petition, the Knower, of intentions. ‘Imrān died while she was still pregnant.\n",
        "TRANSLATION_18": "Remember, Muhammad (When the wife of Imran) Hannah, the mother of Mary (said: My Lord I have vowed unto Thee that which is in my belly as a consecrated (offering)) a servant at the Sanctuary of Jerusalem. (Accept it from me. Lo! Thou, only Thou, art the Hearer) of prayers, (the Knower!) of the answer and of that which is in my womb.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "3:35",
            "44:6",
            "12:34",
            "2:127",
            "59:16",
            "2:131",
            "21:4",
            "11:47",
            "26:220",
            "8:17"
        ],
        "BIBLE": [
            "torah:genesis:50:25",
            "prophets:i%20kings:18:36",
            "torah:exodus:13:19",
            "prophets:joshua:22:27",
            "writings:i%20chronicles:23:26",
            "prophets:ii%20kings:17:12",
            "prophets:isaiah:48:6",
            "prophets:jeremiah:5:19",
            "prophets:ii%20samuel:15:8",
            "torah:genesis:30:26"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:3:4",
            "Sefer%20Yetzirah:3:2"
        ]
    }
}