{
    "VERSE": "3:42",
    "ARABIC": "وَإِذْ قَالَتِ ٱلْمَلَٰٓئِكَةُ يَٰمَرْيَمُ إِنَّ ٱللَّهَ ٱصْطَفَىٰكِ وَطَهَّرَكِ وَٱصْطَفَىٰكِ عَلَىٰ نِسَآءِ ٱلْعَٰلَمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "He said, 'My Lord, appoint a Sign for me.' He said, 'Your Sign is that you will not speak to people for three days, except by gesture. Remember your Lord much and glorify Him in the evening and after dawn.'",
        "TRANSLATION_1": "The angels said: \"O Mary, indeed God has favoured you and made you immaculate, and chosen you from all the women of the world.\n",
        "TRANSLATION_2": "Then came the time when the angels said: 'O Mary! Behold, Allah has chosen you, and made you pure, and exalted you above all the women in the world.\n",
        "TRANSLATION_3": "Behold,\" the angels told Mary, \"God had chosen you, purified you, and given you distinction over all women.\n",
        "TRANSLATION_4": "And when the angels said, “O Maryam! Indeed Allah has chosen you and purified you, and has this day, chosen you among all the women of the world.”\n",
        "TRANSLATION_5": "And (remember) when the angels said: \"O Maryam! Verily, Allah has chosen you, purified you, and chosen you above the women of the nations.\"\n",
        "TRANSLATION_6": "And when the angels said: O Marium! surely Allah has chosen you and purified you and chosen you above the women of the world.\n",
        "TRANSLATION_7": "And when the angels said, 'Mary, God has chosen thee, and purified thee; He has chosen thee above all women.\n",
        "TRANSLATION_8": "And when the angels said: O Mary! Lo! Allah hath chosen thee and made thee pure, and hath preferred thee above (all) the women of creation.\n",
        "TRANSLATION_9": "The angels said, \"Mary, God has selected you and purified you. He has selected you over [all] the women of your time.\n",
        "TRANSLATION_10": "And recall what time the angels said: O Maryam! verily Allah chose thee and purified thee and chose thee above the women of the worlds.\n",
        "TRANSLATION_11": "And when the angels said, ‘O Mary, Allah has chosen you and purified you, and He has chosen you above the world’s women.\n",
        "TRANSLATION_12": "Behold! the angels said: \"O Mary! Allah hath chosen thee and purified thee- chosen thee above the women of all nations.\n",
        "TRANSLATION_13": "And (remember) when the angels said: \"O Maryam (Mary)! Verily, Allah has chosen you, purified you (from polytheism and disbelief), and chosen you above the women of the 'Alamin (mankind and jinns) (of her lifetime).\"\n",
        "TRANSLATION_14": "And when the angels said to Mary: 'Allah has chosen you and purified you. He has chosen you above all women of the worlds.\n",
        "TRANSLATION_15": "The angels said, “O Mary, God has chosen you, and has purified you. He has chosen you over all the women of the world.\n",
        "TRANSLATION_16": "And [mention] when the angels said, \"O Mary, indeed Allah has chosen you and purified you and chosen you above the women of the worlds.\n",
        "TRANSLATION_17": "[3:42] And, mention, when the angels, namely, Gabriel, said, ‘O Mary, God has preferred you, He has elected you, and made you pure, of the touch of men; He has preferred you above all women of the worlds, that is, the inhabitants of your time.\n",
        "TRANSLATION_18": "(And when the angels) i.e. Gabriel (said: Mary! Lo! Allah hath chosen thee) with Islam and worship (and made thee pure) from disbelief, the association of partners with Allah and blemishes; it is also said this means: He has saved you from being killed, (and hath preferred you above (all) the women of creation) of your time by the birth of Jesus.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "3:42",
            "33:56",
            "3:33",
            "5:20",
            "28:56",
            "3:45",
            "22:75",
            "2:98",
            "6:162",
            "5:7"
        ],
        "BIBLE": [
            "writings:ii%20chronicles:35:21",
            "prophets:i%20samuel:2:15",
            "writings:daniel:7:22",
            "writings:esther:2:13",
            "prophets:jeremiah:44:20",
            "prophets:i%20kings:5:21",
            "torah:deuteronomy:3:18",
            "prophets:ii%20kings:6:29",
            "prophets:joshua:6:16",
            "torah:genesis:15:3"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:3:7",
            "Sefer%20Yetzirah:2:5"
        ]
    }
}