{
    "VERSE": "3:43",
    "ARABIC": "يَٰمَرْيَمُ ٱقْنُتِى لِرَبِّكِ وَٱسْجُدِى وَٱرْكَعِى مَعَ ٱلرَّٰكِعِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "And when the angels said, 'Maryam, Allah has chosen you and purified you. He has chosen you over all other women.",
        "TRANSLATION_1": "So adore your Lord, O Mary, and pay homage and bow with those who bow in prayer.\"\n",
        "TRANSLATION_2": "O Mary! Remain devout to your Lord, and prostrate yourself in worship, and bow with those who bow (before Him).'\n",
        "TRANSLATION_3": "Mary, pray devotedly to your Lord, prostrate yourself before Him and bow down with those who bow down before Him.\"\n",
        "TRANSLATION_4": "“O Maryam! Stand in reverence before your Lord, prostrate yourself and bow along with those who bow.”\n",
        "TRANSLATION_5": "O Maryam! Submit yourself with obedience (Aqnuti) to your Lord and prostrate yourself, and bow down along with Ar-Raki`in.\"\n",
        "TRANSLATION_6": "O Marium! keep to obedience to your Lord and humble yourself, and bow down with those who bow.\n",
        "TRANSLATION_7": "Mary; be obedient to thy Lord, prostrating and bowing before Him.'\n",
        "TRANSLATION_8": "O Mary! Be obedient to thy Lord, prostrate thyself and bow with those who bow (in worship).\n",
        "TRANSLATION_9": "O Mary! Remain truly devout to your Sustainer, and prostrate yourself in worship, and bow down with those who bow down [before Him].\"\n",
        "TRANSLATION_10": "Maryam! be devout unto thy Lord, prostrate thyself, and bow down with them that bow down.\n",
        "TRANSLATION_11": "O Mary, be obedient to your Lord and prostrate and bow down with those who bow [in worship].’\n",
        "TRANSLATION_12": "O Mary! worship Thy Lord devoutly: Prostrate thyself, and bow down (in prayer) with those who bow down.\"\n",
        "TRANSLATION_13": "O Mary! \"Submit yourself with obedience to your Lord (Allah, by worshipping none but Him Alone) and prostrate yourself, and Irka'i (bow down etc.) along with Ar-Raki'un (those who bow down etc.).\"\n",
        "TRANSLATION_14": "Mary, be obedient to your Lord, prostrate and bow with those who bow'\n",
        "TRANSLATION_15": "“O Mary, be devoted to your Lord, and bow down, and kneel with those who kneel.”\n",
        "TRANSLATION_16": "O Mary, be devoutly obedient to your Lord and prostrate and bow with those who bow [in prayer].\"\n",
        "TRANSLATION_17": "[3:43] O Mary, be obedient to your Lord, be compliant before Him, prostrating and bowing with those who bow’, that is, pray with those who pray.\n",
        "TRANSLATION_18": "(0 Mary! Be obedient to thy Lord) as a token of gratitude to Him; it is also said this means: prolong your prayer as a token of gratitude to your Lord, (prostrate thyself and bow) meaning: and do also prostrate and bow (with those who bow (in worship)) with the people of worship.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "3:43",
            "84:5",
            "84:2",
            "74:7",
            "37:100",
            "36:27",
            "108:2",
            "89:28",
            "25:64",
            "53:42"
        ],
        "BIBLE": [
            "writings:psalms:144:5",
            "writings:psalms:39:13",
            "writings:psalms:95:6",
            "prophets:ii%20samuel:22:45",
            "writings:psalms:96:9",
            "writings:psalms:30:13",
            "prophets:jeremiah:7:2",
            "writings:psalms:88:14",
            "writings:psalms:89:47",
            "writings:psalms:102:2"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:5:1"
        ]
    }
}