{
    "VERSE": "3:48",
    "ARABIC": "وَيُعَلِّمُهُ ٱلْكِتَٰبَ وَٱلْحِكْمَةَ وَٱلتَّوْرَىٰةَ وَٱلْإِنجِيلَ",
    "ENGLISH": {
        "TRANSLATION_0": "she said, 'My Lord! How can I have a son when no man has ever touched me?' He said, 'It will be so.' Allah creates whatever He wills. When He decides on something, He just says to it, 'Be!' and it is.",
        "TRANSLATION_1": "He will teach him the Law and the judgement, and the Torah and the Gospel,\n",
        "TRANSLATION_2": "And He will teach him the Book, the Wisdom, the Torah, the Gospel,\n",
        "TRANSLATION_3": "God will give (Jesus) wisdom and teach him the Book, the Torah, and the Gospel.\n",
        "TRANSLATION_4": "“And Allah will teach him the Book and wisdom, and the Taurat (Torah) and the Injeel (Bible).”\n",
        "TRANSLATION_5": "And He will teach him the Book and Al-Hikmah, and the Tawrah and the Injil.\n",
        "TRANSLATION_6": "And He will teach him the Book and the wisdom and the Tavrat and the Injeel.\n",
        "TRANSLATION_7": "And He will teach him the Book, the Wisdom, the Torah, the Gospel,\n",
        "TRANSLATION_8": "And He will teach him the Scripture and wisdom, and the Torah and the Gospel,\n",
        "TRANSLATION_9": "God will instruct him in the Book and in wisdom and in the Torah and in the Gospel.\n",
        "TRANSLATION_10": "And He shall teach him the Book and wisdom and the Taurat and the Injil:\n",
        "TRANSLATION_11": "He will teach him the Book and wisdom, the Torah and the Evangel,\n",
        "TRANSLATION_12": "And Allah will teach him the Book and Wisdom, the Law and the Gospel,\n",
        "TRANSLATION_13": "And He (Allah) will teach him ['Iesa (Jesus)] the Book and Al-Hikmah (i.e. the Sunnah, the faultless speech of the Prophets, wisdom, etc.), (and) the Taurat (Torah) and the Injeel (Gospel).\n",
        "TRANSLATION_14": "He will teach him the Book, the Wisdom, the Torah and the Gospel,\n",
        "TRANSLATION_15": "And He will teach him the Scripture and wisdom, and the Torah and the Gospel.\n",
        "TRANSLATION_16": "And He will teach him writing and wisdom and the Torah and the Gospel\n",
        "TRANSLATION_17": "[3:48] And We will teach him (read nu‘allimuhu, or, yu‘allimuhu, ‘He will teach him’) the Book, that is, script, wisdom, and the Torah, and the Gospel.\n",
        "TRANSLATION_18": "(And He will teach him the Scripture) the Scriptures of [past] prophets; as it is said: writing (and wisdom) 58 the lawful and the prohibited; as it said this means: the wisdom of the prophets who preceded him, (and the Torah) in the womb of his mother (and the Gospel) after he came out of his mother's womb.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "3:48",
            "37:117",
            "19:12",
            "52:2",
            "6:155",
            "23:49",
            "31:2",
            "2:151",
            "10:1",
            "43:4"
        ],
        "BIBLE": [
            "torah:deuteronomy:17:18",
            "torah:deuteronomy:30:10",
            "torah:deuteronomy:29:20",
            "torah:deuteronomy:28:61",
            "prophets:jeremiah:30:2",
            "torah:deuteronomy:28:58",
            "prophets:i%20kings:11:41",
            "prophets:isaiah:28:26",
            "writings:ii%20chronicles:17:9",
            "prophets:joshua:8:34"
        ]
    }
}