{
    "VERSE": "3:50",
    "ARABIC": "وَمُصَدِّقًا لِّمَا بَيْنَ يَدَىَّ مِنَ ٱلتَّوْرَىٰةِ وَلِأُحِلَّ لَكُم بَعْضَ ٱلَّذِى حُرِّمَ عَلَيْكُمْ وَجِئْتُكُم بِـَٔايَةٍ مِّن رَّبِّكُمْ فَٱتَّقُوا۟ ٱللَّهَ وَأَطِيعُونِ",
    "ENGLISH": {
        "TRANSLATION_0": "I come confirming the Torah I find already there, and to make lawful for you some of what was previously forbidden to you. I have brought you a Sign from your Lord. So have taqwa of Allah and obey me.",
        "TRANSLATION_1": "I (have come to) confirm the truth of the Torah which was sent down before me, and make certain things lawful which have been forbidden until now; and I come to you with a sign from your Lord; so be fearful of God and follow me.\n",
        "TRANSLATION_2": "And I have come to confirm the truth of whatever there still remains of the Torah, and to make lawful to you some of the things which had been forbidden to you. have come to you with a sign from your Lord; so have fear of Allah and obey me.\n",
        "TRANSLATION_3": "I testify to what is true in the Torah and make lawful for you some of the things that were made unlawful. I have brought you a miracle from your Lord. Have fear of God and obey me.\n",
        "TRANSLATION_4": "‘And I come confirming the Taurat (Torah) – the Book before me – and to make lawful for you some of the things which were forbidden to you, and I have come to you with a sign from your Lord – therefore fear Allah and obey me.’\n",
        "TRANSLATION_5": "(And I have come) confirming that which was before me of the Tawrah, and to make lawful to you part of what was forbidden to you, and I have come to you with a proof from your Lord. So have Taqwa of Allah and obey me.\"\n",
        "TRANSLATION_6": "And a verifier of that which is before me of the Taurat and that I may allow you part of that which has been forbidden t you, and I have come to you with a sign from your Lord therefore be careful of (your duty to) Allah and obey me.\n",
        "TRANSLATION_7": "Likewise confirming the truth of the Torah that is before me, and to make lawful to you certain things that before were forbidden unto you. I have come to you with a sign from your Lord; so fear you God, and obey you me.\n",
        "TRANSLATION_8": "And (I come) confirming that which was before me of the Torah, and to make lawful some of that which was forbidden unto you. I come unto you with a sign from your Lord, so keep your duty to Allah and obey me.\n",
        "TRANSLATION_9": "I come to fulfill [the prediction] of the Torah which preceded me and to make lawful for you some of what was forbidden to you and I come to you with a sign from your Lord. So fear God and obey me.\n",
        "TRANSLATION_10": "And I come confessing to the Taurat that was before me, and to allow unto you some of that which was forbidden unto you. So And I have come unto you with a sign from your Lord wherefore fear Allah and obey me.\n",
        "TRANSLATION_11": "And [I come] to confirm [the truth of] that which is before me of the Torah, and to make lawful for you some of the things that were forbidden you. I have brought you a sign from your Lord; so be wary of Allah and obey me.\n",
        "TRANSLATION_12": "(I have come to you), to attest the Law which was before me. And to make lawful to you part of what was (Before) forbidden to you; I have come to you with a Sign from your Lord. So fear Allah, and obey me.\n",
        "TRANSLATION_13": "And I have come confirming that which was before me of the Taurat (Torah), and to make lawful to you part of what was forbidden to you, and I have come to you with a proof from your Lord. So fear Allah and obey me.\n",
        "TRANSLATION_14": "Likewise confirming the Torah that has been before me and to make lawful to you some of the things you have been forbidden. I bring you a sign from your Lord, therefore, fear Allah and obey me.\n",
        "TRANSLATION_15": "“And verifying what lies before me of the Torah, and to make lawful for you some of what was forbidden to you. I have come to you with a sign from your Lord; so fear God, and obey me.”\n",
        "TRANSLATION_16": "And [I have come] confirming what was before me of the Torah and to make lawful for you some of what was forbidden to you. And I have come to you with a sign from your Lord, so fear Allah and obey me.\n",
        "TRANSLATION_17": "[3:50] Likewise, I have come to you, confirming that which was before me of the Torah, and to make lawful for you some of that which was forbidden to you, in it. Thus he made lawful for them fish and birds which had no spikes; it is also said that he made it all lawful for them, so that ba‘d, ‘some’, means, kull, ‘all’). I have come to you with a sign from your Lord, He has repeated it for emphasis and to expand upon it: so fear God, and obey me, in what I command you of affirming God’s Oneness and being obedient to Him.\n",
        "TRANSLATION_18": "(And (I come) confirming) and I have come confirming Allah's divine Oneness in the Religion (that which was before me of the Torah) and all other Scriptures, (and to make lawful) to give you legal dispensation regarding (some of that which was forbidden unto you) such as the meat of camels, the fat of bovines and sheep, the Sabbath, and other things. (I come unto you with a sign) with a token (from your Lord, so keep your duty to Allah) so fear Allah in that which He has commanded you with and repent to Him (and obey me) and follow my command and Religion;\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "3:50",
            "9:67",
            "2:76",
            "43:63",
            "10:20",
            "3:84",
            "6:53",
            "8:2",
            "40:66",
            "6:57"
        ],
        "BIBLE": [
            "writings:daniel:6:13",
            "torah:deuteronomy:4:23",
            "writings:daniel:5:15",
            "prophets:ii%20samuel:23:5",
            "prophets:isaiah:55:11",
            "torah:exodus:23:13",
            "torah:deuteronomy:13:15",
            "prophets:ii%20samuel:3:13",
            "prophets:i%20kings:14:13",
            "torah:numbers:15:25"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:4:2",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:1:1"
        ]
    }
}