{
    "VERSE": "3:51",
    "ARABIC": "إِنَّ ٱللَّهَ رَبِّى وَرَبُّكُمْ فَٱعْبُدُوهُ هَٰذَا صِرَٰطٌ مُّسْتَقِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "Allah is my Lord and your Lord so worship Him. That is a straight path.'",
        "TRANSLATION_1": "Surely God is my Lord, and your Lord, so worship Him; and this is the right path.\n",
        "TRANSLATION_2": "Surely, Allah is my Lord and your Lord; so serve Him alone. This is the straight way.'\n",
        "TRANSLATION_3": "God is my Lord as well as yours. Worship Him for this is the right path.\"\n",
        "TRANSLATION_4": "‘Undoubtedly Allah is the Lord of all – mine and yours – so worship Him only; this is the Straight Path.’”\n",
        "TRANSLATION_5": "Truly, Allah is my Lord and your Lord, so worship Him (Alone). This is the straight path.\"\n",
        "TRANSLATION_6": "Surely Allah is my Lord and your Lord, therefore serve Him; this is the right path.\n",
        "TRANSLATION_7": "Surely God is my Lord and your Lord; so serve Him. This is a straight path\".'\n",
        "TRANSLATION_8": "Lo! Allah is my Lord and your Lord, so worship Him. That is a straight path.\n",
        "TRANSLATION_9": "God is my Lord and your Lord, so worship Him. That is the straight path.\"\n",
        "TRANSLATION_10": "Verily Allah is my Lord; and your Lord, wherefore worship Him; this is the straight path.\n",
        "TRANSLATION_11": "Indeed Allah is my Lord and your Lord; so worship Him. This is a straight path.” ’\n",
        "TRANSLATION_12": "It is Allah Who is my Lord and your Lord; then worship Him. This is a Way that is straight.'\"\n",
        "TRANSLATION_13": "Truly! Allah is my Lord and your Lord, so worship Him (Alone). This is the Straight Path.\n",
        "TRANSLATION_14": "Allah is my Lord and your Lord, therefore, worship Him. This is the Straight Path\"'\n",
        "TRANSLATION_15": "“God is my Lord and your Lord, so worship Him. That is a straight path.”\n",
        "TRANSLATION_16": "Indeed, Allah is my Lord and your Lord, so worship Him. That is the straight path.\"\n",
        "TRANSLATION_17": "[3:51] Surely God is my Lord and your Lord, so worship Him. This, that which I enjoin upon you, is a straight path’. But they rejected him and did not believe in him.\n",
        "TRANSLATION_18": "(Lo! Allah is my Lord and your Lord, so worship Him) declare his divine Oneness. (That) divine Oneness (is a straight path) an established religion, Islam, which He is pleased with.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "3:51",
            "43:64",
            "19:36",
            "11:56",
            "26:179",
            "26:163",
            "26:150",
            "26:144",
            "26:131",
            "26:126"
        ],
        "BIBLE": [
            "torah:deuteronomy:8:19",
            "torah:deuteronomy:10:12",
            "prophets:jeremiah:22:9",
            "writings:psalms:18:33",
            "prophets:joshua:22:5",
            "prophets:jeremiah:5:19",
            "writings:ii%20chronicles:7:22",
            "writings:ezra:8:21",
            "prophets:i%20kings:22:54",
            "prophets:i%20kings:9:9"
        ]
    }
}