{
    "VERSE": "3:56",
    "ARABIC": "فَأَمَّا ٱلَّذِينَ كَفَرُوا۟ فَأُعَذِّبُهُمْ عَذَابًا شَدِيدًا فِى ٱلدُّنْيَا وَٱلْءَاخِرَةِ وَمَا لَهُم مِّن نَّٰصِرِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "As for those who are kafir. I will punish them with a harsh punishment in this world and the Next World. They will have no helpers.'",
        "TRANSLATION_1": "Those who are infidels will surely receive severe punishment both in this world and the next; and none will they have to help (or save) them.\n",
        "TRANSLATION_2": "As for those who disbelieved, I shall punish them with a terrible chastisement in this world and in the Next; and they shall find none to help them.\n",
        "TRANSLATION_3": "I shall sternly punish the unbelievers in this life and in the life to come and no one will help them.\n",
        "TRANSLATION_4": "“So I shall mete a severe punishment to those who disbelieve, in this world and in the Hereafter; and they will not have any supporters.”\n",
        "TRANSLATION_5": "As to those who disbelieve, I will punish them with severe torment in this world and in the Hereafter, and they will have no helpers.\"\n",
        "TRANSLATION_6": "Then as to those who disbelieve, I will chastise them with severe chastisement in this world and the hereafter, and they shall have no helpers.\n",
        "TRANSLATION_7": "As for the unbelievers, I will chastise them with a terrible chastisement in this world and the next; they shall have no helpers.'\n",
        "TRANSLATION_8": "As for those who disbelieve I shall chastise them with a heavy chastisement in the world and the Hereafter; and they will have no helpers.\n",
        "TRANSLATION_9": "Those who deny the truth shall be sternly punished in this world and in the world to come: there shall be none to help them.\"\n",
        "TRANSLATION_10": "Then as for those who disbelieved I shall torment them with a severe torment in the world and the Hereafter, nor shall have they any helpers.\n",
        "TRANSLATION_11": "As for the faithless, I will punish them with a severe punishment in the world and the Hereafter; and they will have no helpers.’\n",
        "TRANSLATION_12": "As to those who reject faith, I will punish them with terrible agony in this world and in the Hereafter, nor will they have anyone to help.\"\n",
        "TRANSLATION_13": "As to those who disbelieve, I will punish them with a severe torment in this world and in the Hereafter, and they will have no helpers.\"\n",
        "TRANSLATION_14": "As for those who disbelieve, I will sternly punish them in this world and in the Everlasting Life, there shall be none to help them.\n",
        "TRANSLATION_15": "As for those who disbelieve, I will punish them with a severe punishment, in this world and the next, and they will have no helpers.\n",
        "TRANSLATION_16": "And as for those who disbelieved, I will punish them with a severe punishment in this world and the Hereafter, and they will have no helpers.\"\n",
        "TRANSLATION_17": "[3:56] As for the disbelievers, I will chastise them with a terrible chastisement in this world, through being killed, taken captive and made to pay the jizya, and the Hereafter, in the Fire; they shall have no helpers, none to protect them from it.\n",
        "TRANSLATION_18": "(As for those who disbelieve) in Allah and in His messengers Muhammad and Jesus (I shall chastise them with a heavy chastisement in the world) by exposing them to the sword and the capitation tax Qizyah) (and the Hereafter) by throwing them into the Fire; (and they will have no helpers) to save them from Allah's punishment in this world or in the Hereafter.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "3:56",
            "24:23",
            "2:86",
            "3:22",
            "30:16",
            "24:19",
            "13:34",
            "33:57",
            "2:201",
            "50:26"
        ],
        "BIBLE": [
            "writings:proverbs:4:10",
            "prophets:jeremiah:39:18",
            "prophets:i%20kings:1:12",
            "prophets:isaiah:45:17",
            "prophets:isaiah:35:4",
            "prophets:isaiah:28:15",
            "prophets:ezekiel:3:18",
            "prophets:ii%20samuel:19:6",
            "writings:daniel:12:2",
            "prophets:judges:13:6"
        ]
    }
}