{
    "VERSE": "3:58",
    "ARABIC": "ذَٰلِكَ نَتْلُوهُ عَلَيْكَ مِنَ ٱلْءَايَٰتِ وَٱلذِّكْرِ ٱلْحَكِيمِ",
    "ENGLISH": {
        "TRANSLATION_0": "That is what We recite to you of the Signs and the wise Reminder.",
        "TRANSLATION_1": "These verses that We read to you are signs and reminder full of wisdom.\n",
        "TRANSLATION_2": "What We recite to you consists of signs and wise admonition.\n",
        "TRANSLATION_3": "(Muhammad), what we recite to you are revelations and words of wisdom.\n",
        "TRANSLATION_4": "These are some verses that We recite to you, and advice full of wisdom.\n",
        "TRANSLATION_5": "This is what We recite to you of the verses and the Wise Reminder.\n",
        "TRANSLATION_6": "This We recite to you of the communications and the wise reminder.\n",
        "TRANSLATION_7": "This We recite to thee of signs and wise remembrance.\n",
        "TRANSLATION_8": "This (which) We recite unto thee is a revelation and a wise reminder.\n",
        "TRANSLATION_9": "This which We recite to you is a revelation and a wise reminder.\n",
        "TRANSLATION_10": "This which we recite unto thee is of the signs and of the wise admonition.\n",
        "TRANSLATION_11": "These that We recite to you are from the signs and the Wise Reminder.\n",
        "TRANSLATION_12": "This is what we rehearse unto thee of the Signs and the Message of Wisdom.\"\n",
        "TRANSLATION_13": "This is what We recite to you (O Muhammad SAW) of the Verses and the Wise Reminder (i.e. the Quran).\n",
        "TRANSLATION_14": "This, We recite to you of the verses and the Wise Remembrance.\n",
        "TRANSLATION_15": "This is what We recite to you of the Verses and the Wise Reminder.\n",
        "TRANSLATION_16": "This is what We recite to you, [O Muhammad], of [Our] verses and the precise [and wise] message.\n",
        "TRANSLATION_17": "[3:58] This, what is mentioned of the matter of Jesus, We recite to you, narrate to you, O Muhammad (s), of verses and wise, clear, remembrance, namely, the Qur’ān (min al-āyāt, ‘of verses’ is a circumstantial qualifier referring to the [suffixed pronoun] hā’ of natlūhu, and its operator is the demonstrative import of dhālika, ‘this’).\n",
        "TRANSLATION_18": "(This) that I have told you about, Muhammad, regarding the story of Jesus ((which) We recite unto thee) with which We send Gabriel to you (is a revelation) He says: they are revelations of the Qur'an, conveying commands and prohibitions (and a wise reminder) that enjoins what is lawful and what is unlawful; it is also said this means: it corroborates the Torah and the Gospel; and it is also said this means: it confirms that which is in the Guarded Tablet.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "3:58",
            "31:2",
            "10:1",
            "24:18",
            "6:105",
            "2:129",
            "20:126",
            "2:151",
            "39:59",
            "24:59"
        ],
        "BIBLE": [
            "writings:psalms:5:2",
            "writings:proverbs:1:2",
            "torah:exodus:4:30",
            "prophets:jeremiah:51:61",
            "writings:proverbs:23:9",
            "prophets:isaiah:29:11",
            "writings:proverbs:7:1",
            "torah:exodus:34:27",
            "writings:psalms:19:4",
            "writings:ecclesiastes:9:16"
        ]
    }
}