{
    "VERSE": "3:60",
    "ARABIC": "ٱلْحَقُّ مِن رَّبِّكَ فَلَا تَكُن مِّنَ ٱلْمُمْتَرِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "It is the truth from your Lord so do not be among the doubters.",
        "TRANSLATION_1": "This is the truth from your Lord, so do not be in doubt.\n",
        "TRANSLATION_2": "This is the truth from your Lord; be not, then, among those who doubt.\n",
        "TRANSLATION_3": "(Muhammad, the essence of) the Truth is from your Lord. Never have any doubt about it.\n",
        "TRANSLATION_4": "O listener! (followers of this Prophet) This is the Truth from your Lord, so never be of those who doubt.\n",
        "TRANSLATION_5": "(This is) the truth from your Lord, so be not of those who doubt.\n",
        "TRANSLATION_6": "(This is) the truth from your Lord, so be not of the disputers.\n",
        "TRANSLATION_7": "The truth is of God; be not of the doubters.\n",
        "TRANSLATION_8": "(This is) the truth from thy Lord (O Muhammad), so be not thou of those who waver.\n",
        "TRANSLATION_9": "This is the truth from your Lord, so do not be among the doubters.\n",
        "TRANSLATION_10": "This is the truth from thy Lord, wherefore be thou not of those who dubitate.\n",
        "TRANSLATION_11": "This is the truth from your Lord, so do not be among the skeptics.\n",
        "TRANSLATION_12": "The Truth (comes) from Allah alone; so be not of those who doubt.\n",
        "TRANSLATION_13": "(This is) the truth from your Lord, so be not of those who doubt.\n",
        "TRANSLATION_14": "The truth is from your Lord, therefore, do not be among the doubters.\n",
        "TRANSLATION_15": "The truth is from your Lord, so do not be of those who doubt.\n",
        "TRANSLATION_16": "The truth is from your Lord, so do not be among the doubters.\n",
        "TRANSLATION_17": "[3:60] The truth is from your Lord (al-haqqu min rabbik, the predicate of a missing subject, which is [implied to be] amr ‘Īsā [‘the matter concerning Jesus’]); be not of those who waver, those who are uncertain about it.\n",
        "TRANSLATION_18": "((This is) the Truth) this is the true fact (from your Lord) that Jesus was not Allah, His son or His partner, (so be not thou of those who waver) those who doubt what I have exposited to you regarding the creation of Jesus without a father.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "3:60",
            "2:147",
            "15:55",
            "68:50",
            "37:100",
            "23:94",
            "15:98",
            "108:2",
            "78:39",
            "28:53"
        ],
        "BIBLE": [
            "prophets:ezekiel:36:22",
            "writings:psalms:86:9",
            "prophets:ii%20samuel:7:28",
            "prophets:jeremiah:50:31",
            "writings:psalms:119:151",
            "prophets:jeremiah:49:4",
            "prophets:ii%20samuel:7:22",
            "torah:genesis:24:42",
            "writings:ii%20chronicles:14:10",
            "prophets:judges:13:8"
        ]
    }
}