{
    "VERSE": "3:63",
    "ARABIC": "فَإِن تَوَلَّوْا۟ فَإِنَّ ٱللَّهَ عَلِيمٌۢ بِٱلْمُفْسِدِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "And if they turn away, Allah knows the corrupters.",
        "TRANSLATION_1": "If they turn away (remember) God knows the mischief-mongers.\n",
        "TRANSLATION_2": "And if they turn their backs, truly Allah knows those who cause mischief.\n",
        "TRANSLATION_3": "If they turn away (from the Truth, let it be known that) God knows well the evil-doers.\n",
        "TRANSLATION_4": "So if they turn away, then indeed Allah knows those who cause turmoil.\n",
        "TRANSLATION_5": "And if they turn away, then surely, Allah is All-Aware of those who do mischief.\n",
        "TRANSLATION_6": "But if they turn back, then surely Allah knows the mischief-makers.\n",
        "TRANSLATION_7": "And if they turn their backs, assuredly God knows the workers of corruption.\n",
        "TRANSLATION_8": "And if they turn away, then lo! Allah is Aware of (who are) the corrupters.\n",
        "TRANSLATION_9": "And if they turn away, God knows well the evil-doers.\n",
        "TRANSLATION_10": "But if they turn away, then Allah is Knower of the corrupters.\n",
        "TRANSLATION_11": "But if they turn away, indeed Allah knows best the agents of corruption.\n",
        "TRANSLATION_12": "But if they turn back, Allah hath full knowledge of those who do mischief.\n",
        "TRANSLATION_13": "And if they turn away (and do not accept these true proofs and evidences), then surely, Allah is All-Aware of those who do mischief.\n",
        "TRANSLATION_14": "If they turn away, Allah knows the evildoers.\n",
        "TRANSLATION_15": "But if they turn away—God knows the corrupt.\n",
        "TRANSLATION_16": "But if they turn away, then indeed - Allah is Knowing of the corrupters.\n",
        "TRANSLATION_17": "[3:63] And if they turn their backs, rejecting faith, assuredly God knows the agents of corruption, and will requite them (here the [third person] pronominalisation has been replaced with the overt noun [al-mufsidūn, ‘the agents of corruption’]).\n",
        "TRANSLATION_18": "(And if they turn away) from joining the Prophet (pbuh) in invoking Allah's curse on those who lie about Him regarding Jesus (then Lo! Allah is Aware of (who are) the corrupters) i.e. the Christians of Najran.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "3:63",
            "2:227",
            "8:61",
            "3:115",
            "84:23",
            "2:137",
            "22:68",
            "28:56",
            "3:92",
            "33:54"
        ],
        "BIBLE": [
            "prophets:jonah:3:9",
            "writings:ii%20chronicles:6:42",
            "prophets:joshua:7:12",
            "prophets:joshua:24:20",
            "prophets:ezekiel:29:16",
            "writings:ii%20chronicles:29:6",
            "prophets:ii%20samuel:22:41",
            "prophets:ii%20samuel:14:20",
            "prophets:joshua:7:8",
            "prophets:zephaniah:2:7"
        ]
    }
}