{
    "VERSE": "3:67",
    "ARABIC": "مَا كَانَ إِبْرَٰهِيمُ يَهُودِيًّا وَلَا نَصْرَانِيًّا وَلَٰكِن كَانَ حَنِيفًا مُّسْلِمًا وَمَا كَانَ مِنَ ٱلْمُشْرِكِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Ibrahim was neither a Jew nor a Christian, but a man of pure natural belief - a Muslim. He was not one of the idolaters.",
        "TRANSLATION_1": "Neither was Abraham a Jew nor a Christian, but upright and obedient, and not an idolater.\n",
        "TRANSLATION_2": "Abraham was neither a Jew nor a Christian; he was a Muslim, wholly devoted to God. And he certainly was not amongst those who associate others with Allah in His divinity.\n",
        "TRANSLATION_3": "Abraham was not a Jew or a Christian. He was an upright person who had submitted himself to the will of God. Abraham was not a pagan.\n",
        "TRANSLATION_4": "Ibrahim was neither a Jew nor a Christian; but he was a Muslim, free from all falsehood; and was not of the polytheists.\n",
        "TRANSLATION_5": "Ibrahim was neither a Jew nor a Christian, but he was a true Muslim Hanifa and he was not of the Mushrikin\n",
        "TRANSLATION_6": "Ibrahim was not a Jew nor a Christian but he was (an) upright (man), a Muslim, and he was not one of the polytheists.\n",
        "TRANSLATION_7": "No; Abraham in truth was not a Jew, neither a Christian; but he was a Muslim and one pure of faith; certainly he was never of the idolaters.\n",
        "TRANSLATION_8": "Abraham was not a Jew, nor yet a Christian; but he was an upright man who had surrendered (to Allah), and he was not of the idolaters.\n",
        "TRANSLATION_9": "Abraham was neither a Jew nor a Christian. He was an upright man, one who had surrendered himself to God. He was not one of those who associate partners with God.\n",
        "TRANSLATION_10": "Ibrahim was not a Jew, nor a Nazarene, but he was an upright Muslim, nor was he of the associators.\n",
        "TRANSLATION_11": "Abraham was neither a Jew nor a Christian. Rather, he was a Hanif, a Muslim, and he was not one of the polytheists.\n",
        "TRANSLATION_12": "Abraham was not a Jew nor yet a Christian; but he was true in Faith, and bowed his will to Allah's (Which is Islam), and he joined not gods with Allah.\n",
        "TRANSLATION_13": "Ibrahim (Abraham) was neither a Jew nor a Christian, but he was a true Muslim Hanifa (Islamic Monotheism - to worship none but Allah Alone) and he was not of Al-Mushrikun (See V. 2:105).\n",
        "TRANSLATION_14": "No, Abraham was neither a Jew nor a Nazarene. He was of pure faith, a submitter (Muslim). He was never of the idolaters.\n",
        "TRANSLATION_15": "Abraham was neither a Jew nor a Christian, but he was a Monotheist, a Muslim. And he was not of the Polytheists.\n",
        "TRANSLATION_16": "Abraham was neither a Jew nor a Christian, but he was one inclining toward truth, a Muslim [submitting to Allah]. And he was not of the polytheists.\n",
        "TRANSLATION_17": "[3:67] God, in order to dissociate Abraham [from their claims], said: No; Abraham in truth was not a Jew, neither a Christian, but he was a Muslim, professing the Oneness of God, and a hanīf, who inclined away from all other religions towards the upright one; and he was never of the idolaters.\n",
        "TRANSLATION_18": "Allah then denied their claim, saying: (Abraham was not a Jew) following the religion of the Jews, (nor yet a Christian) following the religion of the Christians; (but he was an upright man who had surrendered (to Allah)) sincerely, (and he was not of the idolaters) who adhered to their religions.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "3:67",
            "2:135",
            "16:123",
            "7:192",
            "16:120",
            "3:95",
            "53:17",
            "6:161",
            "43:76",
            "110:1"
        ],
        "BIBLE": [
            "writings:job:1:1",
            "writings:job:9:2",
            "prophets:jeremiah:49:5",
            "writings:job:2:3",
            "writings:psalms:56:12",
            "writings:job:1:8",
            "writings:daniel:3:12",
            "writings:ecclesiastes:7:29",
            "writings:i%20chronicles:29:24",
            "writings:psalms:26:4"
        ]
    }
}