{
    "VERSE": "3:69",
    "ARABIC": "وَدَّت طَّآئِفَةٌ مِّنْ أَهْلِ ٱلْكِتَٰبِ لَوْ يُضِلُّونَكُمْ وَمَا يُضِلُّونَ إِلَّآ أَنفُسَهُمْ وَمَا يَشْعُرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "A group of the People of the Book would love to misguide you. They only misguide themselves but they are not aware of it.",
        "TRANSLATION_1": "Some among the people of the Book wish to lead you astray, yet they lead none astray but themselves, though they do not realise.\n",
        "TRANSLATION_2": "A party of the People of the Book would fain lead you astray, whereas in truth they lead none astray except themselves, but they do not realize it.\n",
        "TRANSLATION_3": "A group among the People of the Book would love to mislead you but they mislead no one but themselves. However, they do not realize it.\n",
        "TRANSLATION_4": "A group among the People given the Book(s) desire that if only they could lead you astray; and they only make themselves astray, and they do not have sense.\n",
        "TRANSLATION_5": "A party of the People of the Scripture wish to lead you astray. But they shall not lead astray anyone except themselves, and they perceive not.\n",
        "TRANSLATION_6": "A party of the followers of the Book desire that they should lead you astray, and they lead not astray but themselves, and they do not perceive.\n",
        "TRANSLATION_7": "There is a party of the People of the Book yearn to make you go astray; yet none they make to stray, except themselves, but they are not aware.\n",
        "TRANSLATION_8": "A party of the People of the Scripture long to make you go astray; and they make none to go astray except themselves, but they perceive not.\n",
        "TRANSLATION_9": "Some of the People of the Book wish to lead you astray but they only lead themselves astray, though they do not realise it.\n",
        "TRANSLATION_10": "Pain would a party of the people of the Book lead you astray, and none they lead astray save themselves, and they perceive not.\n",
        "TRANSLATION_11": "A group of the People of the Book were eager to lead you astray; yet they lead no one astray except themselves, but they are not aware.\n",
        "TRANSLATION_12": "It is the wish of a section of the People of the Book to lead you astray. But they shall lead astray (Not you), but themselves, and they do not perceive!\n",
        "TRANSLATION_13": "A party of the people of the Scripture (Jews and Christians) wish to lead you astray. But they shall not lead astray anyone except themselves, and they perceive not.\n",
        "TRANSLATION_14": "Some of the People of the Book wish to make you go astray, but they lead none astray except themselves, though they do not sense it.\n",
        "TRANSLATION_15": "A party of the People of the Book would love to lead you astray, but they only lead themselves astray, and they do not realize it.\n",
        "TRANSLATION_16": "A faction of the people of the Scripture wish they could mislead you. But they do not mislead except themselves, and they perceive [it] not.\n",
        "TRANSLATION_17": "[3:69] When the Jews called Mu‘ādh [b. Jabal], Hudhayfa [b. al-Yamān] and ‘Ammār [b. Yāsir] to [join] their religion, the following was revealed: There is a party of the People of the Scripture who yearn to make you go astray; yet they cause none to stray, except themselves, because the sin for their leading [others] astray falls upon them, while the believers do not heed them in this; but they are not aware, of this.\n",
        "TRANSLATION_18": "Allah mentions, then, how Ka'b al-Ashraf invited some of the companions of Allah's Messenger (pbuh)- Mu'adh [Ibn Jabal], Hudhayfa [Ibn al-Yaman] and 'Ammar [Ibn Yasir]-to join their religion (Judaism) and 61 leave Islam, after the Battle of Uhud, saying: (A party of the people of the Scripture long to make you go astray) from your Religion, Islam; (and they make none to go astray) from the religion of Allah (except themselves, but they perceive not) this; it is also said that this means: they perceive not that Allah informs His Prophet of this.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "3:69",
            "4:113",
            "98:1",
            "3:72",
            "6:26",
            "3:65",
            "2:9",
            "6:20",
            "3:71",
            "2:44"
        ],
        "BIBLE": [
            "prophets:hosea:2:14",
            "writings:esther:4:8",
            "torah:leviticus:17:11",
            "torah:leviticus:10:17",
            "prophets:ii%20samuel:22:36",
            "prophets:i%20kings:5:23",
            "prophets:isaiah:63:14",
            "torah:genesis:3:6",
            "torah:numbers:8:19",
            "prophets:nahum:1:14"
        ]
    }
}