{
    "VERSE": "3:70",
    "ARABIC": "يَٰٓأَهْلَ ٱلْكِتَٰبِ لِمَ تَكْفُرُونَ بِـَٔايَٰتِ ٱللَّهِ وَأَنتُمْ تَشْهَدُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "People of the Book! why do you reject Allah's Signs when you yourselves are there as witnesses?",
        "TRANSLATION_1": "O people of the Book, why do you disbelieve the signs of God having witnessed them yourselves?\n",
        "TRANSLATION_2": "O People of the Book! Why do you reject the signs of Allah even though you yourselves witness them?\n",
        "TRANSLATION_3": "(Muhammad), say, \"People of the Book, why do you deny the revelation of God (the Quran) even though you know very well that it is from God?.\n",
        "TRANSLATION_4": "O People given the Book(s)! Why do you disbelieve in the signs of Allah, whereas you yourselves are witnesses?\n",
        "TRANSLATION_5": "O People of the Scripture! Why do you disbelieve in the Ayat of Allah, while you bear witness.\"\n",
        "TRANSLATION_6": "O followers of the Book! Why do you disbelieve in the communications of Allah while you witness (them)?\n",
        "TRANSLATION_7": "People of the Book! Why do you disbelieve in God's signs, which you yourselves witness?\n",
        "TRANSLATION_8": "O People of the Scripture! Why disbelieve ye in the revelations of Allah, when ye (yourselves) bear witness (to their truth)?\n",
        "TRANSLATION_9": "People of the Book! Why do you deny God's signs, having been witnesses thereof?\n",
        "TRANSLATION_10": "O people of the Book! wherefore disbelieve ye in the revelations of Allah whereas ye bear witness?\n",
        "TRANSLATION_11": "O People of the Book! Why do you deny Allah’s signs while you testify [to their truth]?\n",
        "TRANSLATION_12": "Ye People of the Book! Why reject ye the Signs of Allah, of which ye are (Yourselves) witnesses?\n",
        "TRANSLATION_13": "O people of the Scripture! (Jews and Christians): \"Why do you disbelieve in the Ayat of Allah, [the Verses about Prophet Muhammad SAW present in the Taurat (Torah) and the Injeel (Gospel)] while you (yourselves) bear witness (to their truth).\"\n",
        "TRANSLATION_14": "People of the Book! Why do you disbelieve the verses of Allah while you are witness?\n",
        "TRANSLATION_15": "O People of the Book! Why do you reject the revelations of God, even as you witness?\n",
        "TRANSLATION_16": "O People of the Scripture, why do you disbelieve in the verses of Allah while you witness [to their truth]?\n",
        "TRANSLATION_17": "[3:70] O People of the Scripture! Why do you disbelieve in God’s verses, the Qur’ān, that includes all the descriptions of Muhammad (s), when you yourselves bear witness?, [when] you know that it is the truth.\n",
        "TRANSLATION_18": "(0 People of the Scripture! Why disbelieve you in the revelations of Allah) Muhammad and the Qur'an, (when you (yourselves) bear witness (to the Truth)?) you know from your Scripture that Muhammad is a prophet sent by Allah.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "3:70",
            "3:98",
            "3:71",
            "3:99",
            "3:113",
            "5:59",
            "3:65",
            "5:15",
            "2:242",
            "4:123"
        ],
        "BIBLE": [
            "prophets:jeremiah:32:25",
            "torah:numbers:11:18",
            "writings:i%20chronicles:23:25",
            "prophets:isaiah:55:4",
            "torah:exodus:17:2",
            "torah:deuteronomy:9:23",
            "prophets:jeremiah:44:20",
            "writings:esther:3:11",
            "writings:daniel:2:23",
            "writings:lamentations:1:11"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:2:5"
        ]
    }
}