{
    "VERSE": "3:72",
    "ARABIC": "وَقَالَت طَّآئِفَةٌ مِّنْ أَهْلِ ٱلْكِتَٰبِ ءَامِنُوا۟ بِٱلَّذِىٓ أُنزِلَ عَلَى ٱلَّذِينَ ءَامَنُوا۟ وَجْهَ ٱلنَّهَارِ وَٱكْفُرُوٓا۟ ءَاخِرَهُۥ لَعَلَّهُمْ يَرْجِعُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "A group of the People of the Book say, 'At the beginning of the day, you should claim to have iman in what was sent down to those who have iman, and then at the end of the day, you should reject it, so that hopefully they will revert.",
        "TRANSLATION_1": "A section of the people of the Book say: \"Believe in the morning what has been revealed to the faithful, and deny in the evening; they might perhaps turn back;\n",
        "TRANSLATION_2": "A party of the People of the Book said: 'Believe in the morning what has been revealed to those who believe, and then deny it in the evening that they may thus retract (from their faith).'\n",
        "TRANSLATION_3": "Some of the People of the Book say, \"Believe in what is revealed to the Muslims during the day only and abandon it in the evening. This will perhaps make them give up their religion\".\n",
        "TRANSLATION_4": "And a group among the People given the Book(s) said, “Believe in what has been sent down to the believers in the morning and deny it by evening – perhaps they (the Muslims) may turn back (disbelieve).”\n",
        "TRANSLATION_5": "And a party of the People of the Scripture say: \"Believe in the morning in that which is revealed to the believers, and reject it at the end of the day, so that they may turn back.\n",
        "TRANSLATION_6": "And a party of the followers of the Book say: Avow belief in that which has been revealed to those who believe, in the first part of the day, and disbelieve at the end of it, perhaps they go back on their religion.\n",
        "TRANSLATION_7": "There is a party of the People of the Book say, 'Believe in what has been sent down upon those who believe at the beginning of the day, and disbelieve at the end of it; haply they will then return;\n",
        "TRANSLATION_8": "And a party of the People of the Scripture say: Believe in that which hath been revealed unto those who believe at the opening of the day, and disbelieve at the end thereof, in order that they may return;\n",
        "TRANSLATION_9": "Some of the People of the Book say to one another, \"Believe in what is revealed to the faithful in the morning and deny it in the evening, so that they [the Muslims] may themselves abandon their faith [in confusion].\n",
        "TRANSLATION_10": "And a Party of the people of the Book say: believe in that which hath been sent down unto those who have believed, at the break of day, and disbelieve at the close thereof, haply they may turn away;\n",
        "TRANSLATION_11": "A group of the People of the Book say, ‘Believe in what has been sent down to the faithful at the beginning of the day, and disbelieve at its end, so that they may turn back [from their religion].’\n",
        "TRANSLATION_12": "A section of the People of the Book say: \"Believe in the morning what is revealed to the believers, but reject it at the end of the day; perchance they may (themselves) Turn back;\n",
        "TRANSLATION_13": "And a party of the people of the Scripture say: \"Believe in the morning in that which is revealed to the believers (Muslims), and reject it at the end of the day, so that they may turn back.\n",
        "TRANSLATION_14": "Some of the People of the Book say: 'Believe in that which is sent down to those who believe at the beginning of the day and disbelieve at the end of it, so that they will return.\n",
        "TRANSLATION_15": "Some of the People of the Book say, “Believe in what was revealed to the believers at the beginning of the day, and reject it at its end, so that they may return.”\n",
        "TRANSLATION_16": "And a faction of the People of the Scripture say [to each other], \"Believe in that which was revealed to the believers at the beginning of the day and reject it at its end that perhaps they will abandon their religion,\n",
        "TRANSLATION_17": "[3:72] A party of the People of the Scripture, the Jews, say, to some among them, ‘Believe in what has been revealed to those who believe, that is, the Qur’ān, at the beginning of the day, and disbelieve, in it, at the end of it, so that they, the believers, might then turn back, from his [Muhammad’s] religion, and that they [the believers] will then say: these [Jews] are knowledgeable and they could only have turned away from it after accepting it because they know it to be false.\n",
        "TRANSLATION_18": "Allah mentions then what Ka'b and his followers said about the change of the Qiblah, saying: (And a party of the People of the Scripture) Ka'b and his fellow leaders (say) to the lowly among people: (Believe in that which hath been revealed, unto those who believe) in Muhammad and the Qur'an (at the opening of the day) at the beginning of the Day, at the Dawn prayer, (and disbelieve at the end thereof) at the Zuhr prayer. In other words, they say: believe in the Qiblah towards which Muhammad and his Companions prayed at the Dawn prayer and disbelieve in the other Qiblah towards which they prayed at the Zuhr prayer, (in order that they may return) in order that their communality may return to your religion and Qiblah;\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "3:72",
            "3:69",
            "98:1",
            "7:170",
            "33:26",
            "2:4",
            "98:6",
            "59:11",
            "29:46",
            "7:45"
        ],
        "BIBLE": [
            "prophets:hosea:2:14",
            "prophets:isaiah:38:13",
            "prophets:jeremiah:5:18",
            "prophets:i%20kings:12:9",
            "writings:ii%20chronicles:10:9",
            "writings:ii%20chronicles:14:6",
            "torah:exodus:36:6",
            "prophets:joshua:19:49",
            "prophets:i%20samuel:9:27",
            "prophets:joshua:7:3"
        ]
    }
}