{
    "VERSE": "3:74",
    "ARABIC": "يَخْتَصُّ بِرَحْمَتِهِۦ مَن يَشَآءُ وَٱللَّهُ ذُو ٱلْفَضْلِ ٱلْعَظِيمِ",
    "ENGLISH": {
        "TRANSLATION_0": "He picks out for His mercy whoever He wills. Allah's favour is indeed immense.'",
        "TRANSLATION_1": "He may choose whom He likes for His favours, for great is His bounty.\n",
        "TRANSLATION_2": "He singles out for His mercy whomever He wills, Allah is possessed of abounding bounty.'\n",
        "TRANSLATION_3": "God grants priority in granting mercy to whomever He wants. God's favors are great.\n",
        "TRANSLATION_4": "“He chooses by His mercy, whomever He wills; and Allah is the Owner of Great Munificence.”\n",
        "TRANSLATION_5": "He selects for His Mercy whom He wills and Allah is the Owner of great bounty.\n",
        "TRANSLATION_6": "He specially chooses for His mercy whom He pleases; and Allah is the Lord of mighty grace.\n",
        "TRANSLATION_7": "He singles out for His mercy whom He will; God is of bounty abounding.'\n",
        "TRANSLATION_8": "He selecteth for His mercy whom He will. Allah is of Infinite Bounty.\n",
        "TRANSLATION_9": "He singles out for His mercy whoever He pleases. God is the Lord of exceeding bounty.\"\n",
        "TRANSLATION_10": "He singleth out for His mercy Whomsoever He will; And Allah is the Owner of mighty Grace.\n",
        "TRANSLATION_11": "He singles out for His mercy whomever He wishes, and Allah is dispenser of a great grace.’\n",
        "TRANSLATION_12": "For His Mercy He specially chooseth whom He pleaseth; for Allah is the Lord of bounties unbounded.\n",
        "TRANSLATION_13": "He selects for His Mercy (Islam and the Quran with Prophethood) whom He wills and Allah is the Owner of Great Bounty.\n",
        "TRANSLATION_14": "He singles out for His Mercy whom He will. And Allah is of abundant bounty.\n",
        "TRANSLATION_15": "He specifies His mercy for whomever He wills. God is Possessor of Sublime Grace.\n",
        "TRANSLATION_16": "He selects for His mercy whom He wills. And Allah is the possessor of great bounty.\n",
        "TRANSLATION_17": "[3:74] He singles out for His mercy whom He will; God is of bounty abounding’.\n",
        "TRANSLATION_18": "(He selecteth for His mercy) He chooses for His religion (whom He will) Muhammad and his Companions. (Allah is of Infinite Bounty) He is generous towards Muhammad by bestowing upon him prophethood and Islam.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "3:74",
            "62:4",
            "2:105",
            "24:14",
            "69:33",
            "10:58",
            "4:70",
            "2:64",
            "3:174",
            "8:29"
        ],
        "BIBLE": [
            "writings:psalms:147:5",
            "prophets:jeremiah:32:18",
            "prophets:malachi:1:9",
            "writings:psalms:117:2",
            "writings:nehemiah:9:32",
            "writings:nehemiah:1:5",
            "prophets:joel:2:13",
            "writings:daniel:9:4",
            "writings:ezra:7:28",
            "prophets:jonah:4:2"
        ]
    }
}