{
    "VERSE": "3:77",
    "ARABIC": "إِنَّ ٱلَّذِينَ يَشْتَرُونَ بِعَهْدِ ٱللَّهِ وَأَيْمَٰنِهِمْ ثَمَنًا قَلِيلًا أُو۟لَٰٓئِكَ لَا خَلَٰقَ لَهُمْ فِى ٱلْءَاخِرَةِ وَلَا يُكَلِّمُهُمُ ٱللَّهُ وَلَا يَنظُرُ إِلَيْهِمْ يَوْمَ ٱلْقِيَٰمَةِ وَلَا يُزَكِّيهِمْ وَلَهُمْ عَذَابٌ أَلِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "Those who sell Allah's contract and their own oaths for a paltry price, such people will have no portion in the Next World, and on the Day of Rising Allah will not speak to them or look at them or purify them. They will have a painful punishment.",
        "TRANSLATION_1": "Those who trade on the promises of God, and who purchase a little gain from their oaths, will have no share in the life to come. God will not address or even regard them on the Day of Resurrection, nor perfect them, and their suffering will be painful.\n",
        "TRANSLATION_2": "There shall be no share in the Life to Come for those who sell away the covenant of Allah and their oaths for a trivial gain. On the Day of Resurrection Allah will neither address them, look at them, nor will He purify them. A painful chastisement lies ahead of them.\n",
        "TRANSLATION_3": "Those who sell their covenant with God and their promises for a small price will have no share in the life hereafter. God will not speak to them nor will He look at them on the Day of Judgment nor will He purify them. They will face a painful torment.\n",
        "TRANSLATION_4": "Those who accept abject prices in exchange of Allah’s covenant and their oaths, do not have a portion in the Hereafter – Allah will neither speak to them nor look towards them on the Day of Resurrection, nor will He purify them; and for them is a painful punishment.\n",
        "TRANSLATION_5": "Verily, those who purchase a small gain at the cost of Allah's covenant and their oaths, they shall have no portion in the Hereafter (Paradise). Neither will Allah speak to them nor look at them on the Day of Resurrection, nor will He purify them, and they shall have a painful torment.\n",
        "TRANSLATION_6": "(As for) those who take a small price for the covenant of Allah and their own oaths-- surely they shall have no portion in the hereafter, and Allah will not speak to them, nor will He look upon them on the day of resurrection nor will He purify them, and they shall have a painful chastisement.\n",
        "TRANSLATION_7": "Those that sell God's covenant, and their oaths, for a little price, there shall be no share for them in the world to come; God shall not speak to them neither look on them on the Resurrection Day, neither will He purify them; and for them awaits a painful chastisement.\n",
        "TRANSLATION_8": "Lo! those who purchase a small gain at the cost of Allah's covenant and their oaths, they have no portion in the Hereafter. Allah will neither speak to them nor look upon them on the Day of Resurrection, nor will He make them grow. Theirs will be a painful doom.\n",
        "TRANSLATION_9": "Those who sell out God's covenant and their oaths for a paltry price will have no share in the life to come on the Day of Resurrection. God will neither speak to them nor cast a look upon them on the Day of Judgement, nor will He purify them. For them there shall be a grievous punishment.\n",
        "TRANSLATION_10": "Verily those who barter Allah's covenant and their oaths at a Small price- no portion is theirs in the Hereafter; nor shall Allah speak unto them or look at them on the Day of Resurrection, nor shall He cleanse them, and theirs shall be a torment afflictive.\n",
        "TRANSLATION_11": "There shall be no share in the Hereafter for those who sell Allah’s covenant and their oaths for a paltry gain, and on the Day of Resurrection Allah will not speak to them nor will He [so much as] look at them, nor will He purify them, and there is a painful punishment for them.\n",
        "TRANSLATION_12": "As for those who sell the faith they owe to Allah and their own plighted word for a small price, they shall have no portion in the Hereafter: Nor will Allah (Deign to) speak to them or look at them on the Day of Judgment, nor will He cleans them (of sin): They shall have a grievous penalty.\n",
        "TRANSLATION_13": "Verily, those who purchase a small gain at the cost of Allah's Covenant and their oaths, they shall have no portion in the Hereafter (Paradise). Neither will Allah speak to them, nor look at them on the Day of Resurrection, nor will He purify them, and they shall have a painful torment.\n",
        "TRANSLATION_14": "Those who sell the promise of Allah and their own oaths for a little price shall have no share in the Everlasting Life. Allah will neither speak to them, nor look at them, nor purify them on the Day of Resurrection. Theirs shall be a painful punishment.\n",
        "TRANSLATION_15": "Those who exchange the covenant of God, and their vows, for a small price, will have no share in the Hereafter, and God will not speak to them, nor will He look at them on the Day of Resurrection, nor will He purify them. They will have a painful punishment.\n",
        "TRANSLATION_16": "Indeed, those who exchange the covenant of Allah and their [own] oaths for a small price will have no share in the Hereafter, and Allah will not speak to them or look at them on the Day of Resurrection, nor will He purify them; and they will have a painful punishment.\n",
        "TRANSLATION_17": "[3:77] The following was revealed with regard to the Jews when they distorted the descriptions of the Prophet (s) and God’s covenant with them in the Torah, and [God’s covenant with them] regarding one that swears an oath to a falsehood when bearing witness or when selling merchandise: Those that sell, exchange, God’s covenant, with them that they believe in the Prophet and return faithfully what has been entrusted to them, and their own oaths, their invoking God’s name in mendacity, for a small price, of this world, there shall be no share, [no] lot, for them in the Hereafter; and God shall not speak to them, out of wrath against them, nor look upon them, [nor] have mercy upon them, on the Day of Resurrection, nor will He purify them, cleanse them, and theirs will be a painful chastisement.\n",
        "TRANSLATION_18": "Allah then mentioned their punishment, i.e. the punishment of the Jews, saying: (Lo! those who purchase a small gain) a small gain of in their living (at the cost of Allah's covenant) by breaking Allah's covenant (and their oaths) their pledges with their prophets, (they have no portion in the Hereafter) in Paradise. (Allah will neither speak to them) in a nice manner on the Day of Judgement (nor look upon them on the Day of Resurrection) He will have no mercy for them, (nor will He make them grow) He will neither exonerate them for being Jews nor put their minds at peace. (Theirs will be a painful doom) a severe pain which will spread to their hearts. It is also said that this was revealed about 'Abdan Ibn al-Ashu' and Imra' al-Qays because of a dispute between them, and it was also revealed about the Jews.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "3:77",
            "2:174",
            "17:10",
            "24:19",
            "16:104",
            "9:45",
            "2:126",
            "33:57",
            "16:95",
            "5:69"
        ],
        "BIBLE": [
            "prophets:ezekiel:43:27",
            "writings:daniel:6:13",
            "torah:leviticus:23:28",
            "prophets:isaiah:55:3",
            "writings:daniel:2:9",
            "writings:esther:9:19",
            "torah:exodus:22:10",
            "torah:genesis:35:3",
            "prophets:ii%20samuel:23:5",
            "torah:exodus:32:30"
        ]
    }
}