{
    "VERSE": "3:8",
    "ARABIC": "رَبَّنَا لَا تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا وَهَبْ لَنَا مِن لَّدُنكَ رَحْمَةً إِنَّكَ أَنتَ ٱلْوَهَّابُ",
    "ENGLISH": {
        "TRANSLATION_0": "It is He who sent down the Book to you from Him: ayats containing clear judgements - they are the core of the Book - and others which are open to interpretation. Those with deviation in their hearts follow what is open to interpretation in it, desiring conflict, seeking its inner meaning. No one knows its inner meaning but Allah. Those firmly rooted in knowledge say, 'We have iman in it. All of it is from our Lord.' But only people of intelligence pay heed.",
        "TRANSLATION_1": "Let us not go astray, O Lord, having guided us already. Bestow on us Your blessings for You are the benevolent.\n",
        "TRANSLATION_2": "They pray to Allah: 'Our Lord! Do not let our hearts swerve towards crookedness after You have guided us to the right way, and. bestow upon us Your mercy. Surely You, only You, are the Munificent Giver!\n",
        "TRANSLATION_3": "They say, \"Lord, do not cause our hearts to deviate from Your guidance, and grant us mercy. You are the Most Awarding One.\n",
        "TRANSLATION_4": "“Our Lord! Do not deviate our hearts after You have guided us, and bestow mercy on us from Yourself; indeed You only are the Great Bestower.”\n",
        "TRANSLATION_5": "(They say): \"Our Lord! Let not our hearts deviate (from the truth) after You have guided us, and grant us mercy from You. Truly, You are the Bestower.\"\n",
        "TRANSLATION_6": "Our Lord! make not our hearts to deviate after Thou hast guided us aright, and grant us from Thee mercy; surely Thou art the most liberal Giver.\n",
        "TRANSLATION_7": "Our Lord, make not our hearts to swerve after that Thou hast guided us; and give us mercy from Thee; Thou art the Giver.\n",
        "TRANSLATION_8": "Our Lord! Cause not our hearts to stray after Thou hast guided us, and bestow upon us mercy from Thy Presence. Lo! Thou, only Thou, art the Bestower.\n",
        "TRANSLATION_9": "Our Lord, do not let our hearts deviate after You have guided us. Bestow upon us Your mercy. Surely You are a Munificent Giver.\n",
        "TRANSLATION_10": "Our Lord Suffer not our hearts to deviate after that Thou hast guided US, and bestow from Thine presence mercy. Verily Thou! Thou art the Bestower!\n",
        "TRANSLATION_11": "[They say,] ‘Our Lord! Do not make our hearts swerve after You have guided us, and bestow Your mercy on us. Indeed, You are the All-munificent.\n",
        "TRANSLATION_12": "Our Lord!\" (they say), \"Let not our hearts deviate now after Thou hast guided us, but grant us mercy from Thine own Presence; for Thou art the Grantor of bounties without measure.\n",
        "TRANSLATION_13": "(They say): \"Our Lord! Let not our hearts deviate (from the truth) after You have guided us, and grant us mercy from You. Truly, You are the Bestower.\"\n",
        "TRANSLATION_14": "Lord, do not cause our hearts to swerve after You have guided us. Grant us Your Mercy. You are the Embracing Giver.\n",
        "TRANSLATION_15": "“Our Lord, do not cause our hearts to swerve after You have guided us, and bestow on us mercy from Your presence; You are the Giver.”\n",
        "TRANSLATION_16": "[Who say], \"Our Lord, let not our hearts deviate after You have guided us and grant us from Yourself mercy. Indeed, You are the Bestower.\n",
        "TRANSLATION_17": "[3:8] Our Lord, do not cause our hearts to deviate, do not cause them to incline away from the truth, in [their] desire to interpret it, such as is inappropriate for us — as You caused the hearts of those [others] to deviate — after You have guided us, [after] You have shown us the way to it; and give us mercy from You, as a strengthening; You are the Bestower.\n",
        "TRANSLATION_18": "(Our Lord!) these also say: our Lord! (Cause not our hearts to stray) do not make our hearts deviate from Your Religion (after Thou hast guided us) to Your Religion, (and bestow upon us mercy from Thy Presence) make us firm in holding to Your religion. (Lo! Thou, only Thou art the Bestower) to the believers before us; it is also said that this means: You are the Bestower of prophethood and Islam to Muhammad.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "3:8",
            "38:35",
            "59:10",
            "18:10",
            "7:56",
            "16:110",
            "16:119",
            "21:75",
            "21:86",
            "7:153"
        ],
        "BIBLE": [
            "writings:i%20chronicles:17:19",
            "prophets:ii%20samuel:7:21",
            "prophets:isaiah:63:17",
            "torah:exodus:23:13",
            "prophets:joshua:7:19",
            "prophets:ii%20samuel:3:21",
            "torah:exodus:33:19",
            "prophets:isaiah:63:7",
            "prophets:jeremiah:49:16",
            "prophets:ii%20samuel:21:3"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:4:3"
        ]
    }
}