{
    "VERSE": "3:81",
    "ARABIC": "وَإِذْ أَخَذَ ٱللَّهُ مِيثَٰقَ ٱلنَّبِيِّۦنَ لَمَآ ءَاتَيْتُكُم مِّن كِتَٰبٍ وَحِكْمَةٍ ثُمَّ جَآءَكُمْ رَسُولٌ مُّصَدِّقٌ لِّمَا مَعَكُمْ لَتُؤْمِنُنَّ بِهِۦ وَلَتَنصُرُنَّهُۥ قَالَ ءَأَقْرَرْتُمْ وَأَخَذْتُمْ عَلَىٰ ذَٰلِكُمْ إِصْرِى قَالُوٓا۟ أَقْرَرْنَا قَالَ فَٱشْهَدُوا۟ وَأَنَا۠ مَعَكُم مِّنَ ٱلشَّٰهِدِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Remember when Allah made a covenant with the Prophets: 'Now that We have given you a share of the Book and Wisdom, and then a Messenger comes to you confirming what is with you, you must have iman in him and help him.' He asked, 'Do you agree and undertake My commission on that condition?' They replied, 'We agree.' He said, 'Bear witness, then. I am with you as one of the witnesses.'",
        "TRANSLATION_1": "Remember when God covenanted the prophets (and said): \"If after I have given you the Law and the judgement there comes an apostle to you who confirms the truth already with you, you will surely believe him and help him;\" and asked: \"Do you accept and agree to the terms of My covenant?\" They said: \"We accept.\" \"Then you be witness,\" said God, \"and I shall be witness with you.\n",
        "TRANSLATION_2": "And recall when Allah took a covenant from the Prophets: 'This is the Book and the Wisdom which I have given you. But should a Prophet come to you confirming that which is already with you, you shall believe in him and shall help him. So saying, Allah asked: 'Do you agree and accept to take up the burden of the covenant?' They answered: 'We agree,' He said: 'Then bear wirness; and I will be with you among the witness.\n",
        "TRANSLATION_3": "When God made a covenant with the Prophets, saying, \"When I give you the Book and wisdom and a Messenger comes to you who will testify to the guidance which you have received from Me, you must believe in him and help him, then He asked them, \"Do you affirm and accept my covenant?\" They replied, \"Yes, we affirm it.\" The Lord said, \"Then bear witness to this and I shall bear witness with you\".\n",
        "TRANSLATION_4": "And remember when Allah took a covenant from the Prophets; “If I give you the Book and knowledge and the (promised) Noble Messenger (Prophet Mohammed – peace and blessings be upon him) comes to you, confirming the Books you possess, you shall positively, definitely believe in him and you shall positively, definitely help him”; He said, “Do you agree, and accept My binding responsibility in this matter?” They all answered, “We agree”; He said, “Then bear witness amongst yourselves, and I Myself am a witness with you.”\n",
        "TRANSLATION_5": "And (remember) when Allah took the covenant of the Prophets, saying: \"Take whatever I gave you from the Book and Hikmah, and afterwards there will come to you a Messenger confirming what is with you; you must, then, believe in him and help him.\" Allah said: \"Do you agree (to it) and will you take up Isri\" They said: \"We agree.\" He said: \"Then bear witness; and I am with you among the witnesses.\"\n",
        "TRANSLATION_6": "And when Allah made a covenant through the prophets: Certainly what I have given you of Book and wisdom-- then an apostle comes to you verifying that which is with you, you must believe in him, and you must aid him. He said: Do you affirm and accept My compact in this (matter)? They said: We do affirm. He said: Then bear witness, and I (too) am of the bearers of witness with you.\n",
        "TRANSLATION_7": "And when God took compact with the Prophets: 'That I have given you of Book and Wisdom; then there shall come to you a Messenger confirming what is with you -- you shall believe in him and you shall help him; do you agree?' He said. 'And do you take My load on you on that condition?' They said, 'We do agree.' God said, 'Bear witness so, and I shall be with you among the witnesses.'\n",
        "TRANSLATION_8": "When Allah made (His) covenant with the prophets, (He said): Behold that which I have given you of the Scripture and knowledge. And afterward there will come unto you a messenger, confirming that which ye possess. Ye shall believe in him and ye shall help him. He said: Do ye agree, and will ye take up My burden (which I lay upon you) in this (matter)? They answered: We agree. He said: Then bear ye witness. I will be a witness with you.\n",
        "TRANSLATION_9": "When God made a covenant with the prophets, He said, \"Here is the Book and the wisdom which I have given you. When there comes to you a messenger fulfilling that [predictions about him in their Scripture] which is with you, you must believe in him and help him. Do you then affirm this and accept the responsibility I have laid upon you in these terms?\" They said, \"We will affirm it.\" God said, \"Then bear witness, and I will bear witness with you.\"\n",
        "TRANSLATION_10": "And recall what time Allah took a bond from the prophets saying whatever I vouchsafed unto you of Book and Wisdom, end, thereafter there cometh unto you an apostle confessing to that which is with you, ye shall surely believe in him and succour him. He said: assent ye, and take ye My burthen thereunto They said: we assent. He said: then bear Witness, and I, with you among the witnesses.\n",
        "TRANSLATION_11": "When Allah took a compact concerning the prophets, [He said,] ‘Inasmuch as I have given you [the knowledge] of the Book and wisdom, should an apostle come to you thereafter confirming what is with you, you shall believe in him and help him.’ He said, ‘Do you pledge and accept My covenant on this condition?’ They said, ‘We pledge.’ He said, ‘Then be witnesses, and I, too, am among the witnesses along with you.’\n",
        "TRANSLATION_12": "Behold! Allah took the covenant of the prophets, saying: \"I give you a Book and Wisdom; then comes to you a messenger, confirming what is with you; do ye believe in him and render him help.\" Allah said: \"Do ye agree, and take this my Covenant as binding on you?\" They said: \"We agree.\" He said: \"Then bear witness, and I am with you among the witnesses.\"\n",
        "TRANSLATION_13": "And (remember) when Allah took the Covenant of the Prophets, saying: \"Take whatever I gave you from the Book and Hikmah (understanding of the Laws of Allah, etc.), and afterwards there will come to you a Messenger (Muhammad SAW) confirming what is with you; you must, then, believe in him and help him.\" Allah said: \"Do you agree (to it) and will you take up My Covenant (which I conclude with you)?\" They said: \"We agree.\" He said: \"Then bear witness; and I am with you among the witnesses (for this).\"\n",
        "TRANSLATION_14": "And when Allah took the covenant of the Prophets: 'That I have given you of the Book and Wisdom. Then there shall come to you a Messenger (Muhammad) confirming what is with you, you shall believe in him and you shall support him to be victorious, do you agree and take My load on this' They answered: 'We do agree' Allah said: 'Then bear witness, and I will be with you among the witnesses'\n",
        "TRANSLATION_15": "God received the covenant of the prophets, “Inasmuch as I have given you of scripture and wisdom; should a messenger come to you verifying what you have, you shall believe in him, and support him.” He said, “Do you affirm My covenant and take it upon yourselves?” They said, “We affirm it.” He said, “Then bear witness, and I am with you among the witnesses.”\n",
        "TRANSLATION_16": "And [recall, O People of the Scripture], when Allah took the covenant of the prophets, [saying], \"Whatever I give you of the Scripture and wisdom and then there comes to you a messenger confirming what is with you, you [must] believe in him and support him.\" [Allah] said, \"Have you acknowledged and taken upon that My commitment?\" They said, \"We have acknowledged it.\" He said, \"Then bear witness, and I am with you among the witnesses.\"\n",
        "TRANSLATION_17": "[3:81] And, mention, when God made a covenant with the prophets, ‘What (if read lamā, it would be introducing a subject clause, and emphasising the aspect of the oath in this ‘making of the covenant’; if it is read limā, it would then be connected to the verb akhadha, ‘He took’; the mā, ‘what’, is a relative particle in both cases, meaning la’lladhī [or li’lladhī respectively]) I have given you (ātaytukum, or in a variant reading, ātaynākum, ‘We have given you’) of the Book and wisdom; then there shall come to you a messenger confirming what is with you, of the Book and wisdom, and that is Muhammad (s) — you shall believe in him and you shall help him’ (this constitutes the response to the oath), if you reach his time and perceive him, and their communities [of descendants] follow them [in what is incumbent upon them]. He, God, exalted be He, said to them, ‘Do you affirm, this? And do you take, [do you] accept, My load, My covenant, on you on that condition?’ They said, ‘We affirm’. He said, ‘Then bear witness, to this before your own souls and [those of] your followers, and I shall be with you among the witnesses’, before you and them.\n",
        "TRANSLATION_18": "Allah then explained His covenant with the prophets on the day of \"Yes, indeed!\" regarding Muhammad's traits and description, saying: (When Allah made (His) covenant with the Prophets) He says: Allah made a covenant with the prophets that they will show to one another the traits, description and merit of Muhammad, ((He said): Behold that which I have given ye) when I did give you (of the Scripture and 63 knowledge) containing details of the lawful and the unlawful. (And) you also made a covenant with your nation that (afterward there will come unto you a messenger, confirming) by calling to Allah's divine Oneness (that which ye possess) of Scripture. (Ye shall believe in him) He says: you shall acknowledge him and his virtue (and ye shall help him) with the sword against his enemies and also by expositing his trait. (He said: Do ye agree?) Allah asked them whether they accepted (and will you take My burden) My covenant (in this) what I said? (They) the prophets (answered: We agree) we accept. (He) Allah (said: Then bear ye witness) of this. (I will be a witness with you) of this also. Allah thus made them witnesses of one another and He Himself is a witness. And so each prophet explained this to his nation, and each prophet made the members of his nation witnesses for each other, just as each prophet bore witness to it.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "3:81",
            "3:187",
            "3:164",
            "6:34",
            "2:89",
            "2:151",
            "5:15",
            "14:4",
            "6:114",
            "19:51"
        ],
        "BIBLE": [
            "prophets:judges:15:6",
            "prophets:ii%20kings:10:15",
            "prophets:i%20kings:18:26",
            "prophets:i%20samuel:4:19",
            "writings:job:1:21",
            "torah:deuteronomy:9:23",
            "torah:exodus:24:7",
            "writings:daniel:6:13",
            "prophets:jeremiah:26:8",
            "prophets:jeremiah:42:4"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:5"
        ]
    }
}