{
    "VERSE": "3:82",
    "ARABIC": "فَمَن تَوَلَّىٰ بَعْدَ ذَٰلِكَ فَأُو۟لَٰٓئِكَ هُمُ ٱلْفَٰسِقُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Any who turn away after that are deviators.",
        "TRANSLATION_1": "Then any one who turns away will be a transgressor.\"\n",
        "TRANSLATION_2": "Then whosoever shall turn away from this covenant they are the transgressors.\n",
        "TRANSLATION_3": "After this, whoever turns away will be of the evil-doers.\n",
        "TRANSLATION_4": "So those who turn away after this – it is they who are the sinners.\n",
        "TRANSLATION_5": "Then whoever turns away after this, they are the rebellious.\n",
        "TRANSLATION_6": "Whoever therefore turns back after this, these it is that are the transgressors.\n",
        "TRANSLATION_7": "Then whosoever turns his back after that -- they are the ungodly.\n",
        "TRANSLATION_8": "Then whosoever after this shall turn away: they will be miscreants.\n",
        "TRANSLATION_9": "Now whoever turns away after this, are surely transgressors.\n",
        "TRANSLATION_10": "Wherefore whosoever shall turn away thereafter -those then! they are the transgressors.\n",
        "TRANSLATION_11": "Then whoever turns away after that—it is they who are the transgressors.\n",
        "TRANSLATION_12": "If any turn back after this, they are perverted transgressors.\n",
        "TRANSLATION_13": "Then whoever turns away after this, they are the Fasiqun (rebellious: those who turn away from Allah's Obedience).\n",
        "TRANSLATION_14": "Whosoever turns back after that, they are the transgressors.\n",
        "TRANSLATION_15": "Whoever turns away after that—these are the deceitful.\n",
        "TRANSLATION_16": "And whoever turned away after that - they were the defiantly disobedient.\n",
        "TRANSLATION_17": "[3:82] Then whoever turns his back, in rejection, after that, covenant, they are the wicked.\n",
        "TRANSLATION_18": "(Then whosoever after this) the covenant (shall turn away) from among the nations: (they will be miscreants) who have broken the covenant and are unbelievers.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "3:82",
            "3:94",
            "26:120",
            "79:30",
            "70:31",
            "95:7",
            "3:160",
            "5:115",
            "2:52",
            "77:50"
        ],
        "BIBLE": [
            "prophets:isaiah:50:5",
            "prophets:isaiah:9:16",
            "prophets:hosea:14:5",
            "writings:psalms:78:57",
            "prophets:jonah:3:9",
            "prophets:jeremiah:2:35",
            "prophets:jeremiah:48:39",
            "prophets:isaiah:1:4",
            "prophets:i%20samuel:15:25",
            "writings:nehemiah:9:26"
        ]
    }
}