{
    "VERSE": "3:87",
    "ARABIC": "أُو۟لَٰٓئِكَ جَزَآؤُهُمْ أَنَّ عَلَيْهِمْ لَعْنَةَ ٱللَّهِ وَٱلْمَلَٰٓئِكَةِ وَٱلنَّاسِ أَجْمَعِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "The repayment of such people is that Allah's curse is on them and that of the angels and of all mankind.",
        "TRANSLATION_1": "For such the requital is the curse of God and the angels and of men.\n",
        "TRANSLATION_2": "The recom- pense for their wrong-doing is that the curse of Allah and of the angels and of all men shall upon them.\n",
        "TRANSLATION_3": "What they will gain will be the condemnation of God, the angels, and all people,\n",
        "TRANSLATION_4": "The recompense of such is that on them is the curse of Allah and of the angels and of men combined.\n",
        "TRANSLATION_5": "They are those whose recompense is that on them (rests) the curse of Allah, of the angels and of all mankind.\n",
        "TRANSLATION_6": "(As for) these, their reward is that upon them is the curse of Allah and the angels and of men, all together.\n",
        "TRANSLATION_7": "Those -- their recompense is that there shall rest on them the curse of God and of the angels and of men, altogether,\n",
        "TRANSLATION_8": "As for such, their guerdon is that on them rests the curse of Allah and of angels and of men combined.\n",
        "TRANSLATION_9": "such people will be rewarded with rejection by God, by the angels, by all mankind.\n",
        "TRANSLATION_10": "These! their meed is that on them shall be the curse of Allah and of angles and of mankind, all;\n",
        "TRANSLATION_11": "Their requital is that there shall be upon them the curse of Allah, the angels, and all mankind.\n",
        "TRANSLATION_12": "Of such the reward is that on them (rests) the curse of Allah, of His angels, and of all mankind;-\n",
        "TRANSLATION_13": "They are those whose recompense is that on them (rests) the Curse of Allah, of the angels, and of all mankind.\n",
        "TRANSLATION_14": "Those, their recompense shall be the curse of Allah, the angels, and all the people\n",
        "TRANSLATION_15": "Those—their penalty is that upon them falls the curse of God, and of the angels, and of all mankind.\n",
        "TRANSLATION_16": "Those - their recompense will be that upon them is the curse of Allah and the angels and the people, all together,\n",
        "TRANSLATION_17": "[3:87] Those — their requital is that there shall rest on them the curse of God and of the angels and of men altogether.\n",
        "TRANSLATION_18": "64 (As for such, their reward is that on them rests the curse of Allah) the punishment of Allah (and of angels) and the curse of the angels (and of men combined) and the curse of the believers.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "3:87",
            "2:161",
            "24:7",
            "22:75",
            "3:42",
            "110:2",
            "33:56",
            "58:18",
            "30:6",
            "34:40"
        ],
        "BIBLE": [
            "prophets:isaiah:3:25",
            "prophets:jeremiah:46:12",
            "writings:esther:9:2",
            "prophets:isaiah:31:3",
            "torah:numbers:16:22",
            "prophets:ii%20samuel:17:12",
            "torah:exodus:32:28",
            "prophets:ezekiel:25:13",
            "writings:ii%20chronicles:13:17",
            "prophets:ezekiel:30:5"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:11",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:3:6",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:3:5",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:3:8",
            "Sefer%20Yetzirah:6:2"
        ]
    }
}