{
    "VERSE": "3:88",
    "ARABIC": "خَٰلِدِينَ فِيهَا لَا يُخَفَّفُ عَنْهُمُ ٱلْعَذَابُ وَلَا هُمْ يُنظَرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "They will be under it for ever. Their punishment will not be lightened. They will be granted no reprieve.",
        "TRANSLATION_1": "They shall live under it, and none of their agony decrease nor be respite for them.\n",
        "TRANSLATION_2": "Thus shall they abide. Neither shall their chastisement be granted nor shall they be granted any respite.\n",
        "TRANSLATION_3": "with which they will live forever. Their torment will not be relieved and no attention will be paid to them.\n",
        "TRANSLATION_4": "Remaining in it forever; their punishment will not be lightened, nor will they get any respite.\n",
        "TRANSLATION_5": "They will abide therein. Neither will their torment be lightened nor will it be delayed or postponed.\n",
        "TRANSLATION_6": "Abiding in it; their chastisement shall not be lightened nor shall they be respited.\n",
        "TRANSLATION_7": "therein dwelling forever; the chastisement shall not be lightened for them; no respite shall be given them.\n",
        "TRANSLATION_8": "They will abide therein. Their doom will not be lightened, neither will they be reprieved;\n",
        "TRANSLATION_9": "In this state they shall abide forever; their punishment shall not be lightened nor shall they be granted respite.\n",
        "TRANSLATION_10": "Abiders therein, their torment shall not be lightened nor shall they be respited.\n",
        "TRANSLATION_11": "They will remain in it [forever], and their punishment will not be lightened, nor will they be granted any respite,\n",
        "TRANSLATION_12": "In that will they dwell; nor will their penalty be lightened, nor respite be (their lot);-\n",
        "TRANSLATION_13": "They will abide therein (Hell). Neither will their torment be lightened, nor will it be delayed or postponed (for a while).\n",
        "TRANSLATION_14": "there they shall live for ever. Their punishment shall not be lightened, nor shall they be given respite.\n",
        "TRANSLATION_15": "Remaining in it eternally, without their punishment being eased from them, and without being reprieved.\n",
        "TRANSLATION_16": "Abiding eternally therein. The punishment will not be lightened for them, nor will they be reprieved.\n",
        "TRANSLATION_17": "[3:88] Abiding therein, that is, in the curse, or in the Fire implied by it [the curse]; the chastisement shall not be lightened for them and they shall not be reprieved, they shall [not] be given any respite.\n",
        "TRANSLATION_18": "(They will abide therein) in the curse. (Their doom will not be lightened, neither will they be reprieved) their punishment will not be deferred;\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:162",
            "3:88",
            "16:85",
            "37:9",
            "43:50",
            "29:54",
            "34:38",
            "43:75",
            "56:19",
            "39:40"
        ],
        "BIBLE": [
            "prophets:ezekiel:18:13",
            "torah:numbers:33:55",
            "writings:psalms:37:29",
            "torah:leviticus:26:43",
            "torah:numbers:35:34",
            "torah:deuteronomy:21:8",
            "torah:numbers:35:25",
            "prophets:ezekiel:17:23",
            "prophets:zechariah:8:8",
            "prophets:zechariah:14:19"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:4:5"
        ]
    }
}