{
    "VERSE": "3:9",
    "ARABIC": "رَبَّنَآ إِنَّكَ جَامِعُ ٱلنَّاسِ لِيَوْمٍ لَّا رَيْبَ فِيهِ إِنَّ ٱللَّهَ لَا يُخْلِفُ ٱلْمِيعَادَ",
    "ENGLISH": {
        "TRANSLATION_0": "'Our Lord, do not make our hearts swerve aside after You have guided us. And give us mercy from You. You are the Ever-Giving.",
        "TRANSLATION_1": "You will gather mankind together, O Lord, on a day that is certain to come, and God does not fail in His promise.\n",
        "TRANSLATION_2": "Our Lord! You surely will gather mankind together one Day, a Day about (the coming of which) there is no doubt. Surely Allah never goes against His promise.'\n",
        "TRANSLATION_3": "Lord, it is certain that one day You will gather all the people together. God does not break His promise.\"\n",
        "TRANSLATION_4": "“Our Lord! Indeed You will gather all mankind for a Day about which there is no doubt\"; indeed Allah’s promise does not change.\n",
        "TRANSLATION_5": "Our Lord! Verily, it is You Who will gather mankind together on the Day about which there is no doubt. Verily, Allah never breaks His Promise.\"\n",
        "TRANSLATION_6": "Our Lord! surely Thou art the Gatherer of men on a day about which there is no doubt; surely Allah will not fail (His) promise.\n",
        "TRANSLATION_7": "Our Lord, it is Thou that shall gather mankind for a day whereon is no doubt; verily God will not fail the tryst.\n",
        "TRANSLATION_8": "Our Lord! Lo! it is Thou Who gatherest mankind together to a Day of which there is no doubt. Lo! Allah faileth not to keep the tryst.\n",
        "TRANSLATION_9": "Our Lord, You will surely gather all mankind on the Day of whose coming there is no doubt. God never fails to fulfill His promise.\"\n",
        "TRANSLATION_10": "Our Lord! verily Thou art the Assembler of mankind for a Day whereof there is no doubt. Verily Allah faileth not the tryst.\n",
        "TRANSLATION_11": "Our Lord! You will indeed gather mankind on a day in which there is no doubt. Indeed Allah does not break His promise.’\n",
        "TRANSLATION_12": "Our Lord! Thou art He that will gather mankind Together against a day about which there is no doubt; for Allah never fails in His promise.\"\n",
        "TRANSLATION_13": "Our Lord! Verily, it is You Who will gather mankind together on the Day about which there is no doubt. Verily, Allah never breaks His Promise\".\n",
        "TRANSLATION_14": "Lord, You will surely gather all the people for a Day that will come in which there is no doubt' Allah will not break His promise.\n",
        "TRANSLATION_15": "“Our Lord, You will gather the people for a Day in which there is no doubt.” God will never break His promise.\n",
        "TRANSLATION_16": "Our Lord, surely You will gather the people for a Day about which there is no doubt. Indeed, Allah does not fail in His promise.\"\n",
        "TRANSLATION_17": "[3:9] Our Lord, You shall gather mankind for a day, that is, on a day, of which there is no doubt, no uncertainty, that is, the Day of Resurrection, when You will requite them for their deeds as You had promised; verily God will not fail the tryst, His promise of the Upraising: there is a shift of address here from the second [to the third] person and these [last words] could constitute God’s speech. The purpose of their supplication in this way is to show that their concern is with the matter of the Hereafter, and for this reason they ask [God] for adherence to the path of guidance, in order to attain its reward. The two Shaykhs [Bukhārī and Muslim] reported that ‘Ā’isha, may God be pleased with her, said, ‘The Messenger of God (s) recited this verse: It is He Who revealed to you the Book, wherein are verses clear [to the end of] the verse, and said, “When you see those pursuing the allegorical parts, [know that] these are the ones God refers to [in this verse], so beware of them” ’. Al-Tabarānī reported in his al-Kabīr that Abū Mūsā al-Ash‘arī heard the Prophet (s) say, ‘I fear nothing for my community except three faults’, and he mentioned that one of these would be when the Book is opened in front of them, and the believer will desire to interpret it, and yet none knows its interpretation, save God; and those firmly rooted in knowledge say, ‘We believe in it, all is from our Lord; yet none remembers but people of pith’ [Q. 3:7] [end of the] hadīth.\n",
        "TRANSLATION_18": "(Our Lord!) they say: our Lord! (it is Thou Who gatherest mankind together) after they die (to a Day) on a day (of which there is no doubt. Lo! Allah faileth not to keep the tryst) resurrection after death, the reckoning, the Bridge over hell, the Scale, Paradise and hell. 52\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "3:9",
            "45:26",
            "22:47",
            "83:6",
            "3:194",
            "30:6",
            "31:33",
            "5:67",
            "9:45",
            "14:42"
        ],
        "BIBLE": [
            "prophets:jeremiah:48:12",
            "torah:exodus:19:24",
            "prophets:ezekiel:16:59",
            "writings:i%20chronicles:5:25",
            "torah:exodus:13:13",
            "prophets:isaiah:27:11",
            "torah:numbers:30:3",
            "writings:ecclesiastes:4:12",
            "torah:deuteronomy:31:16",
            "writings:psalms:60:3"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:4:11",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:6:1"
        ]
    }
}