{
    "VERSE": "3:92",
    "ARABIC": "لَن تَنَالُوا۟ ٱلْبِرَّ حَتَّىٰ تُنفِقُوا۟ مِمَّا تُحِبُّونَ وَمَا تُنفِقُوا۟ مِن شَىْءٍ فَإِنَّ ٱللَّهَ بِهِۦ عَلِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "You will not attain true goodness until you give of what you love. Whatever you give away, Allah knows it.",
        "TRANSLATION_1": "You will never come to piety unless you spend of things you love; and whatever you spend is known to God.\n",
        "TRANSLATION_2": "You shall not attain righteousness until you spend out of what you love (in the way of Allah). Allah knows whatever you spend.\n",
        "TRANSLATION_3": "You can never have extended virtue and righteousness unless you spend part of what you dearly love for the cause of God. God knows very well whatever you spend for His cause.\n",
        "TRANSLATION_4": "You can never attain virtue until you spend in Allah's cause the things you love; and Allah is Aware of whatever you spend.\n",
        "TRANSLATION_5": "By no means shall you attain Al-Birr, unless you spend of that which you love; and whatever of good you spend, Allah knows it well.\n",
        "TRANSLATION_6": "By no means shall you attain to righteousness until you spend (benevolently) out of what you love; and whatever thing you spend, Allah surely knows it.\n",
        "TRANSLATION_7": "You will not attain piety until you expend of what you love; and whatever thing you expend, God knows of it.\n",
        "TRANSLATION_8": "Ye will not attain unto piety until ye spend of that which ye love. And whatsoever ye spend, Allah is Aware thereof.\n",
        "TRANSLATION_9": "Never will you attain to righteousness unless you spend for the cause of God out of what you cherish; and whatever you spend is known to God.\n",
        "TRANSLATION_10": "O Ye shall not attain unto virtue until ye expend of that which ye love; and whatsoever ye expend, verily Allah Is thereof Knower.\n",
        "TRANSLATION_11": "You will never attain piety until you spend out of what you hold dear, and whatever you may spend of anything, Allah indeed knows it.\n",
        "TRANSLATION_12": "By no means shall ye attain righteousness unless ye give (freely) of that which ye love; and whatever ye give, of a truth Allah knoweth it well.\n",
        "TRANSLATION_13": "By no means shall you attain Al-Birr (piety, righteousness, etc., it means here Allah's Reward, i.e. Paradise), unless you spend (in Allah's Cause) of that which you love; and whatever of good you spend, Allah knows it well.\n",
        "TRANSLATION_14": "You shall not attain righteousness until you spend of what you love. Whatever you spend is known to Allah.\n",
        "TRANSLATION_15": "You will not attain virtuous conduct until you give of what you cherish. Whatever you give away, God is aware of it.\n",
        "TRANSLATION_16": "Never will you attain the good [reward] until you spend [in the way of Allah] from that which you love. And whatever you spend - indeed, Allah is Knowing of it.\n",
        "TRANSLATION_17": "[3:92] You will not attain piety, that is, the reward for it, which is Paradise, until you expend, [until] you give voluntary alms, of what you love, of your wealth; and whatever thing you expend, God knows of it, and He will requite it accordingly.\n",
        "TRANSLATION_18": "Allah then prompted the believers to spend in the cause of Allah, saying: (Ye will not attain unto piety) i.e. that which is with Allah of reward, honour and Paradise until you spend of that which you love of property; it is also said this means: you shall not attend to reliance in Allah and God-fearingness (until ye spend of that which ye love. And whatsoever ye spend) of property, (Allah is aware thereof) just as He is aware of your intentions, i.e. whether you intend with it His Countenance or other people's praise.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "3:92",
            "3:115",
            "3:63",
            "33:54",
            "3:177",
            "2:95",
            "84:23",
            "29:62",
            "64:11",
            "20:98"
        ],
        "BIBLE": [
            "writings:psalms:71:19",
            "prophets:jeremiah:2:17",
            "prophets:zechariah:8:8",
            "writings:i%20chronicles:29:17",
            "prophets:ezekiel:14:23",
            "prophets:jeremiah:14:22",
            "prophets:i%20samuel:20:12",
            "prophets:joshua:22:24",
            "writings:ecclesiastes:9:5",
            "prophets:isaiah:25:1"
        ]
    }
}