{
    "VERSE": "3:94",
    "ARABIC": "فَمَنِ ٱفْتَرَىٰ عَلَى ٱللَّهِ ٱلْكَذِبَ مِنۢ بَعْدِ ذَٰلِكَ فَأُو۟لَٰٓئِكَ هُمُ ٱلظَّٰلِمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "So any who, after this, invent a lie against Allah are indeed wrongdoers.",
        "TRANSLATION_1": "And anyone who fabricates lies about God even after this, is wicked indeed.\n",
        "TRANSLATION_2": "Those who falsely fix lies upon Allah despite this are the wrong-doers.\n",
        "TRANSLATION_3": "Whoever ascribes falsehood to God despite of all the evidence is unjust.\n",
        "TRANSLATION_4": "So henceforth whoever fabricates lies against Allah – it is they who are the unjust.\n",
        "TRANSLATION_5": "Then after that, whosoever shall invent a lie against Allah, then it is these that are the wrongdoers.\n",
        "TRANSLATION_6": "Then whoever fabricates a lie against Allah after this, these it is that are the unjust.\n",
        "TRANSLATION_7": "Whoso forges falsehood against God after that, those are the evildoers.\n",
        "TRANSLATION_8": "And whoever shall invent a falsehood after that concerning Allah, such will be wrong-doers.\n",
        "TRANSLATION_9": "Those who, after this, persist in making up lies and attributing them to God are transgressors.\"\n",
        "TRANSLATION_10": "Then whosoever fabricateth after this, lie against Allah - these! they are the wrong-doers.\n",
        "TRANSLATION_11": "So whoever fabricates a lie against Allah after that—it is they who are the wrongdoers.\n",
        "TRANSLATION_12": "If any, after this, invent a lie and attribute it to Allah, they are indeed unjust wrong-doers.\n",
        "TRANSLATION_13": "Then after that, whosoever shall invent a lie against Allah, \u0085 such shall indeed be the Zalimun (disbelievers).\n",
        "TRANSLATION_14": "Those who after this invent lies about Allah are harmdoers.\n",
        "TRANSLATION_15": "Whoever forges lies about God after that—these are the unjust.\n",
        "TRANSLATION_16": "And whoever invents about Allah untruth after that - then those are [truly] the wrongdoers.\n",
        "TRANSLATION_17": "[3:94] Whoever invents falsehood against God after that, that is, after the proof has become manifest that the prohibition was made by Jacob, and not during the time of Abraham, those are the evildoers, that transgress the truth into falsehood.\n",
        "TRANSLATION_18": "65 Therefore Allah said: (And whoever shall invent a falsehood after that) after the exposition in the Torah show them to be liars (concerning Allah, such will be wrong-doers) unbelievers who lie about Allah.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "3:94",
            "3:82",
            "3:160",
            "5:115",
            "7:178",
            "10:69",
            "2:64",
            "2:209",
            "10:17",
            "5:39"
        ],
        "BIBLE": [
            "torah:leviticus:5:26",
            "writings:psalms:115:8",
            "writings:psalms:135:18",
            "prophets:jeremiah:16:20",
            "writings:psalms:32:5",
            "prophets:ezekiel:35:14",
            "writings:ezra:7:21",
            "torah:leviticus:5:10",
            "torah:exodus:23:32",
            "torah:exodus:34:17"
        ]
    }
}