{
    "VERSE": "3:95",
    "ARABIC": "قُلْ صَدَقَ ٱللَّهُ فَٱتَّبِعُوا۟ مِلَّةَ إِبْرَٰهِيمَ حَنِيفًا وَمَا كَانَ مِنَ ٱلْمُشْرِكِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Say, 'Allah speaks the truth, so follow the religion of Ibrahim, a man of pure natural belief. He was not one of the idolaters.'",
        "TRANSLATION_1": "Say: \"God has veritably spoken the truth. So now follow the way of Abraham the upright, who was not of idolaters.\"\n",
        "TRANSLATION_2": "Say: 'Whatever Allah has said is true. Follow, then, the way of Abraham in total devotion to Allah. He was not one of those who associate others with Allah in His divinity.\n",
        "TRANSLATION_3": "(Muhammad), say, \"God has spoken the Truth. Follow the upright tradition of Abraham who was not an idolater.\"\n",
        "TRANSLATION_4": "Say (O dear Prophet Mohammed – peace and blessings be upon him), “Allah is truthful; so follow the religion of Ibrahim, who was free from all falsehood; and he was not of the polytheists.”\n",
        "TRANSLATION_5": "Say:\"Allah has spoken the truth; follow the religion of Ibrahim the Hanif (monotheist), and he was not of the Mushrikin (idolators).\"\n",
        "TRANSLATION_6": "Say: Allah has spoken the truth, therefore follow the religion of Ibrahim, the upright one; and he was not one of the polytheists.\n",
        "TRANSLATION_7": "Say: 'God has spoken the truth; therefore follow the creed of Abraham, a man of pure faith and no idolater.'\n",
        "TRANSLATION_8": "Say: Allah speaketh truth. So follow the religion of Abraham, the upright. He was not of the idolaters.\n",
        "TRANSLATION_9": "Say, \"God speaks the Truth, so follow the faith of Abraham. He was an upright man and he was not one of the polytheists.\"\n",
        "TRANSLATION_10": "Say thou: Allah hath spoken the truth; follow therefore the faith of Ibrahim the upright; and he was not of the associators.\n",
        "TRANSLATION_11": "Say, ‘Allah has spoken the truth; so follow the creed of Abraham, a Hanif, and he was not one of the polytheists.\n",
        "TRANSLATION_12": "Say: \"Allah speaketh the Truth: follow the religion of Abraham, the sane in faith; he was not of the Pagans.\"\n",
        "TRANSLATION_13": "Say (O Muhammad SAW): \"Allah has spoken the truth; follow the religion of Ibrahim (Abraham) Hanifa (Islamic Monotheism, i.e. he used to worship Allah Alone), and he was not of Al-Mushrikun.\" (See V. 2:105)\n",
        "TRANSLATION_14": "Say: 'Allah has said the truth. Follow the Creed of Abraham, he was of pure faith, and not an idolater'\n",
        "TRANSLATION_15": "Say, “God has spoken the truth, so follow the religion of Abraham the Monotheist; he was not a Pagan.”\n",
        "TRANSLATION_16": "Say, \"Allah has told the truth. So follow the religion of Abraham, inclining toward truth; and he was not of the polytheists.\"\n",
        "TRANSLATION_17": "[3:95] Say: ‘God has spoken the truth, in this matter, just as He has in all that He has related; therefore follow the creed of Abraham, the one which I follow, a hanīf, inclining away from all religions towards submission (islām), and he was not an idolater’.\n",
        "TRANSLATION_18": "(Say) Muhammad: (Allah speaketh truth) when He said Abraham was neither a Jew nor a Christian; it is also said this means: Say, Muhammad, Allah has said the Truth regarding what He stated concerning that which is lawful and that which is unlawful. (So follow the religion of Abraham, the upright) i.e. the Muslim. (He was not of the idolaters) who followed their Religion.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "3:95",
            "16:123",
            "2:135",
            "16:120",
            "4:125",
            "64:13",
            "39:66",
            "4:28",
            "40:33",
            "71:17"
        ],
        "BIBLE": [
            "prophets:i%20kings:13:26",
            "prophets:ii%20kings:6:19",
            "writings:daniel:10:19",
            "writings:ii%20chronicles:6:16",
            "prophets:i%20kings:8:25",
            "writings:daniel:10:11",
            "prophets:ii%20kings:23:17",
            "prophets:jeremiah:26:16",
            "prophets:judges:9:3",
            "torah:genesis:24:42"
        ]
    }
}