{
    "VERSE": "3:96",
    "ARABIC": "إِنَّ أَوَّلَ بَيْتٍ وُضِعَ لِلنَّاسِ لَلَّذِى بِبَكَّةَ مُبَارَكًا وَهُدًى لِّلْعَٰلَمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "The first House established for mankind was that at Bakka, a place of blessing and a guidance for all beings.",
        "TRANSLATION_1": "The first House of God to be set up for men was at Bakkah the blessed, a guidance for the people of the world.\n",
        "TRANSLATION_2": "Behold, the first House (of Prayer) established for mankind is the one at Bakkah: it is full of blessing and a centre of guidance for the whole world.\n",
        "TRANSLATION_3": "The first house (of worship) that God assigned to men was in Bakka (another name of Mecca). It is a blessed one and a guide for all people.\n",
        "TRANSLATION_4": "Indeed the first house that was appointed as a place of worship for mankind, is the one at Mecca (the Holy Ka’aba), blessed and a guidance to the whole world;\n",
        "TRANSLATION_5": "Verily, the first House (of worship) appointed for mankind was that at Bakkah (Makkah), full of blessing, and a guidance for Al-`Alamin (mankind and Jinn).\n",
        "TRANSLATION_6": "Most surely the first house appointed for men is the one at Bekka, blessed and a guidance for the nations.\n",
        "TRANSLATION_7": "The first House established for the people was that at Bekka, a place holy, and a guidance to all beings.\n",
        "TRANSLATION_8": "Lo! the first Sanctuary appointed for mankind was that at Becca, a blessed place, a guidance to the peoples;\n",
        "TRANSLATION_9": "The first House to be built for mankind was the one at Bakkah [Makkah]. It is a blessed place; a source of guidance for the whole world.\n",
        "TRANSLATION_10": "Verily the first House set apart unto mankind was that at Bakka, blest, and a guidance unto the worlds.\n",
        "TRANSLATION_11": "Indeed the first house to be set up for mankind is the one at Bakkah, blessed and a guidance for all nations.\n",
        "TRANSLATION_12": "The first House (of worship) appointed for men was that at Bakka: Full of blessing and of guidance for all kinds of beings:\n",
        "TRANSLATION_13": "Verily, the first House (of worship) appointed for mankind was that at Bakkah (Makkah), full of blessing, and a guidance for Al-'Alamin (the mankind and jinns).\n",
        "TRANSLATION_14": "The first House ever to be built for people was that at Bakkah (Mecca) blessed and a guidance for the worlds.\n",
        "TRANSLATION_15": "The first house established for mankind is the one at Bekka; blessed, and guidance for all people.\n",
        "TRANSLATION_16": "Indeed, the first House [of worship] established for mankind was that at Makkah - blessed and a guidance for the worlds.\n",
        "TRANSLATION_17": "[3:96] When they said, ‘Our direction of prayer (qibla) came before yours’, the following was revealed: The first house, for worship, established for the people, on earth, was that at Bakka (a variant of Makka [Mecca], so called because it ‘crushes’ [tabukku] the necks of tyrants); it was built by the angels before the creation of Adam, and after it the Aqsā [in Jerusalem] was built, a period of forty years separating them, as reported in the hadīth of the two Sahīhs [sc. of al-Bukhārī and Muslim], and in the hadīth [that states]: ‘The first thing to appear on the surface of the water, at the creation of the heavens and the earth, was a white foam, underneath which the earth was unrolled’; a blessed place (mubārakan, a circumstantial qualifier referring to la’lladhī, ‘that’) meaning a place of blessings, and a guidance to all worlds, because it is their qibla.\n",
        "TRANSLATION_18": "(Lo! the first Sanctuary) mosque (appointed for mankind) for the believers (was that at Becca) where the Ka'bah is, (a blessed place) that the spot where the Ka'bah is built contains forgiveness and mercy, (a guidance to the peoples) it is a Qiblah to every prophet, messenger, veracious one (siddiq) and believer;\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "3:96",
            "22:8",
            "28:43",
            "2:159",
            "3:138",
            "3:68",
            "28:85",
            "3:33",
            "31:20",
            "5:97"
        ],
        "BIBLE": [
            "writings:ii%20chronicles:33:19",
            "prophets:i%20kings:8:13",
            "prophets:i%20kings:3:2",
            "writings:i%20chronicles:22:19",
            "writings:ezra:6:3",
            "writings:ezra:6:7",
            "torah:exodus:21:13",
            "prophets:zechariah:6:12",
            "prophets:ezekiel:43:7",
            "writings:ii%20chronicles:6:2"
        ]
    }
}