{
    "VERSE": "3:97",
    "ARABIC": "فِيهِ ءَايَٰتٌۢ بَيِّنَٰتٌ مَّقَامُ إِبْرَٰهِيمَ وَمَن دَخَلَهُۥ كَانَ ءَامِنًا وَلِلَّهِ عَلَى ٱلنَّاسِ حِجُّ ٱلْبَيْتِ مَنِ ٱسْتَطَاعَ إِلَيْهِ سَبِيلًا وَمَن كَفَرَ فَإِنَّ ٱللَّهَ غَنِىٌّ عَنِ ٱلْعَٰلَمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "In it are Clear Signs - the Maqam of Ibrahim. All who enter it are safe. Hajj to the House is a duty owed to Allah by all mankind - those who can find a way to do it. But if anyone is kafir, Allah is Rich Beyond Need of any being.",
        "TRANSLATION_1": "It contains clear signs, and the spot where Abraham had stood. And anyone who enters it will find security. And whosoever can afford should visit the House on a pilgrimage as duty to God. Whosoever denies, should remember that God is independent of the peoples of the world.\n",
        "TRANSLATION_2": "In it there are clear signs and the station of Abraham; whoever enters it becomes secure. Pilgrimage to the House is a duty owed to Allah by all who can make their way to it. As for those who refuse to follow His command, surely Allah does not stand in need of anything.\n",
        "TRANSLATION_3": "In (Bakka), there are many clear signs (evidence of the existence of God). Among them is the spot where Abraham stood. Whoever seeks refuge therein will be protected by the laws of amnesty. Those who have the means and ability have a duty to God to visit the House and perform the hajj (pilgrimage) rituals. The unbelievers should know that God is Independent of all creatures.\n",
        "TRANSLATION_4": "In it are clear signs – the place where Ibrahim stood (is one of them); and whoever enters it shall be safe; and performing the Hajj (pilgrimage) of this house, for the sake of Allah, is a duty upon mankind, for those who can reach it; and whoever disbelieves – then Allah is Independent (Unwanting) of the entire creation!\n",
        "TRANSLATION_5": "In it are manifest signs (for example), the Maqam (station) of Ibrahim; whosoever enters it, he attains security. And Hajj to the House is a duty that mankind owes to Allah, for those who are able to undertake the journey; and whoever disbelieves, then Allah stands not in need of any of the `Alamin.\n",
        "TRANSLATION_6": "In it are clear signs, the standing place of Ibrahim, and whoever enters it shall be secure, and pilgrimage to the House is incumbent upon men for the sake of Allah, (upon) every one who is able to undertake the journey to it; and whoever disbelieves, then surely Allah is Self-sufficient, above any need of the worlds.\n",
        "TRANSLATION_7": "Therein are clear signs -- the station of Abraham, and whosoever enters it is in security. It is the duty of all men towards God to come to the House a pilgrim, if he is able to make his way there. As for the unbeliever, God is All-sufficient nor needs any being.\n",
        "TRANSLATION_8": "Wherein are plain memorials (of Allah's guidance); the place where Abraham stood up to pray; and whosoever entereth it is safe. And pilgrimage to the House is a duty unto Allah for mankind, for him who can find a way thither. As for him who disbelieveth, (let him know that) lo! Allah is Independent of (all) creatures.\n",
        "TRANSLATION_9": "There are clear signs in it; it is the place where Abraham stood. Anyone who enters it will be secure. Pilgrimage to the House is a duty to God for anyone who is able to undertake it. Anyone who disbelieves should remember that God is independent of all creatures.\n",
        "TRANSLATION_10": "Therein are signs manifest, the station of Ibrahim. And whosoever entereth it shall be secure. And incumbent on mankind is pilgrimage to the House for that good-will of Allah: on him who is able to find a way thereunto. And whosoever disbelieveth, then verily Allah is Independent of the worlds.\n",
        "TRANSLATION_11": "In it are manifest signs [and] Abraham’s Station, and whoever enters it shall be secure. And it is the duty of mankind toward Allah to make pilgrimage to the House—for those who can afford the journey to it—and should anyone renege [on his obligation], Allah is indeed without need of the creatures.\n",
        "TRANSLATION_12": "In it are Signs Manifest; (for example), the Station of Abraham; whoever enters it attains security; Pilgrimage thereto is a duty men owe to Allah,- those who can afford the journey; but if any deny faith, Allah stands not in need of any of His creatures.\n",
        "TRANSLATION_13": "In it are manifest signs (for example), the Maqam (place) of Ibrahim (Abraham); whosoever enters it, he attains security. And Hajj (pilgrimage to Makkah) to the House (Ka'bah) is a duty that mankind owes to Allah, those who can afford the expenses (for one's conveyance, provision and residence); and whoever disbelieves [i.e. denies Hajj (pilgrimage to Makkah), then he is a disbeliever of Allah], then Allah stands not in need of any of the 'Alamin (mankind and jinns).\n",
        "TRANSLATION_14": "In it, there are clear signs; the station where Abraham stood. Whoever enters it let him be safe. Pilgrimage to the House is a duty to Allah for all who can make the journey. And whosoever disbelieves, Allah is Rich, independent of all the worlds.\n",
        "TRANSLATION_15": "In it are evident signs; the Station of Abraham. Whoever enters it attains security. Pilgrimage to the House is a duty to God for all who can make the journey. But as for those who refuse—God is Independent of the worlds.\n",
        "TRANSLATION_16": "In it are clear signs [such as] the standing place of Abraham. And whoever enters it shall be safe. And [due] to Allah from the people is a pilgrimage to the House - for whoever is able to find thereto a way. But whoever disbelieves - then indeed, Allah is free from need of the worlds.\n",
        "TRANSLATION_17": "[3:97] Therein are clear signs, among which is, the station of Abraham, that is, the stone upon which he stood to build the House, and on which his footprints remain; and it [the House] has endured all this length of time and the constant passing of hands over it. Among these [signs] are the fact that the reward for good deeds is multiplied in it and that birds never fly over it; and whoever enters it is in security, not liable therein to be killed or oppressed or otherwise. It is the duty of people towards God to make the pilgrimage to the House (read either as hijj al-bayt or hajj al-bayt, as two variants of the verbal noun from hajj, meaning ‘the intention [to journey there]’), if he is able to make his way there (man istatā‘a ilayhi sabīlan substitutes for al-nās, ‘people’). The Prophet (s) explained this [ability] as having provisions and a ride, as reported by alHākim [al-Naysābūrī] and others. As for the one who disbelieves, in God or in what He has made obligatory with regard to the Pilgrimage, God is Independent of all worlds, the humans, the jinn and the angels, and [is Independent of] their devotions.\n",
        "TRANSLATION_18": "(Wherein are plain memorials) clear signs; and it contains (the place where Abraham stood up to pray) as well as the semi-circular wall of white marble (Hatim) of Ishmael and the black stone; (and whosoever entereth it is safe) from violence. (And to the House) going to the House (is a duty unto Allah for mankind) for the believers, (for him who can find a way thither) for the person who can walk and reach the House while at the same time being in possession of provisions, a mount and has left enough expenditure for his dependents until he returns. (As for him who disbelieveth) in Allah, Muhammad, the Qur'an and the obligation of pilgrimage, (Lo! Allah is Independent of (all) creatures) He is not in need of their belief or pilgrimage.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "3:97",
            "29:6",
            "2:273",
            "57:24",
            "4:143",
            "22:16",
            "4:104",
            "22:25",
            "8:61",
            "5:54"
        ],
        "BIBLE": [
            "torah:exodus:18:16",
            "writings:daniel:3:29",
            "prophets:amos:6:10",
            "writings:daniel:6:13",
            "prophets:ii%20kings:6:2",
            "prophets:jeremiah:31:33",
            "prophets:isaiah:45:14",
            "torah:genesis:40:14",
            "prophets:ii%20samuel:23:5",
            "prophets:i%20samuel:17:25"
        ]
    }
}