{
    "VERSE": "3:99",
    "ARABIC": "قُلْ يَٰٓأَهْلَ ٱلْكِتَٰبِ لِمَ تَصُدُّونَ عَن سَبِيلِ ٱللَّهِ مَنْ ءَامَنَ تَبْغُونَهَا عِوَجًا وَأَنتُمْ شُهَدَآءُ وَمَا ٱللَّهُ بِغَٰفِلٍ عَمَّا تَعْمَلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Say, 'People of the Book, why do you bar those who have iman from the Way of Allah, desiring to make it crooked, when you yourselves are witnesses to it? Allah is not unaware of what you do.'",
        "TRANSLATION_1": "Then say: \"O people of the Book, why do you turn the believers away from the path of God, looking for obliquities in the way when you are witness to it? And God is aware of all that you do.\"\n",
        "TRANSLATION_2": "Say: 'People of the Book! Why do you hinder one who believes from the way of Allah, seeking that he follow a crooked way, even though you yourselves are witness to its being the right way?' Allah is not heedless of what you do.\n",
        "TRANSLATION_3": "Ask them, \"Why do you create obstacles in the way of God for those who believe in Him, trying to make His way seem crooked when you know that it is straight? God is not unaware of what you do.\n",
        "TRANSLATION_4": "Say (O dear Prophet Mohammed – peace and blessings be upon him), “O People given the Book(s)! Why do you prevent those who have accepted faith from the way of Allah, seeking to cause deviation in it, whereas you yourselves are witnesses to it? And Allah is not unaware of your deeds!”\n",
        "TRANSLATION_5": "Say: \"O People of the Scripture (Jews and Christians)! Why do you stop those who have believed, from the path of Allah, seeking to make it seem crooked, while you (yourselves) are witnesses And Allah is not unaware of what you do.\"\n",
        "TRANSLATION_6": "Say: O followers of the Book! why do you hinder him who believes from the way of Allah? You seek (to make) it crooked, while you are witness, and Allah is not heedless of what you do.\n",
        "TRANSLATION_7": "Say: 'People of the Book, why do you bar from God's way the believer, desiring to make it crooked, yourselves being witnesses? God is not heedless of the things you do.'\n",
        "TRANSLATION_8": "Say: O People of the Scripture! Why drive ye back believers from the way of Allah, seeking to make it crooked, when ye are witnesses (to Allah's guidance)? Allah is not unaware of what ye do.\n",
        "TRANSLATION_9": "Say, \"People of the Book, why do you turn the believers away from the path of God, seeking to make it crooked, while you are witnesses thereof? God is not unaware of what you do.\"\n",
        "TRANSLATION_10": "Say thou: O people of the Book! wherefore turn ye aside from the way of Allah those who believe, seeking for it crookedness, while ye are witnesses! And Allah is not neglectful of that which ye work.\n",
        "TRANSLATION_11": "Say, ‘O People of the Book! why do you bar the faithful from the way of Allah, seeking to make it crooked, while you are witnesses [to its truthfulness]? And Allah is not oblivious of what you do.’\n",
        "TRANSLATION_12": "Say: \"O ye People of the Book! Why obstruct ye those who believe, from the path of Allah, Seeking to make it crooked, while ye were yourselves witnesses (to Allah's Covenant)? but Allah is not unmindful of all that ye do.\"\n",
        "TRANSLATION_13": "Say: \"O people of the Scripture (Jews and Christians)! Why do you stop those who have believed, from the Path of Allah, seeking to make it seem crooked, while you (yourselves) are witnesses [to Muhammad SAW as a Messenger of Allah and Islam (Allah's Religion, i.e. to worship none but Him Alone)]? And Allah is not unaware of what you do.\"\n",
        "TRANSLATION_14": "Say: 'People of the Book, why do you bar he who believes from the Path of Allah and seek to make it crooked, when you yourselves are witnesses? Allah is not inattentive of what you do'\n",
        "TRANSLATION_15": "Say, “O People of the Scripture, why do you hinder from God’s path those who believe, seeking to distort it, even though you are witnesses? God is not unaware of what you do.”\n",
        "TRANSLATION_16": "Say, \"O People of the Scripture, why do you avert from the way of Allah those who believe, seeking to make it [seem] deviant, while you are witnesses [to the truth]? And Allah is not unaware of what you do.\"\n",
        "TRANSLATION_17": "[3:99] Say: ‘O People of the Scripture, why do you bar believers, causing them to turn away, from God’s way, His religion, by denying the truth of the Prophet and concealing His graces, desiring to make it crooked (‘iwajan is the verbal noun, meaning mu‘awwajatan, ‘made crooked’), inclining away from the truth, while you yourselves are witnesses, [while] you know that the religion which is upright and pleasing [to God] is that of Islam, as stated in your Book? God is not heedless of what you do’, in the way of unbelief and mendacity; instead He gives you respite until your appointed time and then requites you.\n",
        "TRANSLATION_18": "(Say: People of the Scripture! Why drive ye back believers) in Allah, Muhammad and the Qur'an (from the way of Allah) from the Religion of Allah and His worship, (seeking to make it crooked, when you are witnesses?) when you know it to be in the Scripture. (Allah is not unaware of what ye do) Allah is not oblivious to your disbelief: concealing the Truth and committing transgressions. This verse was revealed about those who invited 'Ammar [Ibn Yasir] and his fellow Muslims to join their religion: Judaism.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "3:99",
            "3:98",
            "3:70",
            "7:45",
            "11:19",
            "3:71",
            "4:88",
            "18:1",
            "7:86",
            "5:15"
        ],
        "BIBLE": [
            "torah:exodus:34:10",
            "torah:exodus:36:6",
            "torah:deuteronomy:13:15",
            "torah:deuteronomy:26:13",
            "writings:ii%20chronicles:14:6",
            "torah:leviticus:10:17",
            "writings:i%20chronicles:21:3",
            "torah:deuteronomy:31:29",
            "prophets:joel:2:17",
            "torah:exodus:23:13"
        ]
    }
}