{
    "VERSE": "9:10",
    "ARABIC": "لَا يَرْقُبُونَ فِى مُؤْمِنٍ إِلًّا وَلَا ذِمَّةً وَأُو۟لَٰٓئِكَ هُمُ ٱلْمُعْتَدُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "They respect neither kinship nor treaty where a mumin is concerned. They are the people who overstep the limits.",
        "TRANSLATION_1": "They have no regard for kinship or treaties with believers, for they are transgressors.\n",
        "TRANSLATION_2": "They neither have any respect for kinship nor for agreement in respect of the believers. Such are indeed transgressors.\n",
        "TRANSLATION_3": "They do not respect their promises nor their family ties with the believers. They are transgressors.\n",
        "TRANSLATION_4": "In respect of the Muslims, they do not keep regard for any relations nor any pacts; it is they who are the rebels.\n",
        "TRANSLATION_5": "With regard to a believer, they respect not the ties, either of kinship or of covenant! It is they who are the transgressors.\n",
        "TRANSLATION_6": "They do not pay regard to ties of relationship nor those of covenant in the case of a believer; and these are they who go beyond the limits.\n",
        "TRANSLATION_7": "observing neither bond nor treaty towards a believer; they are the transgressors.\n",
        "TRANSLATION_8": "And they observe toward a believer neither pact nor honour. These are they who are transgressors.\n",
        "TRANSLATION_9": "Where believers are concerned, they respect no tie of kinship or treaty. They are people who overstep the limits.\n",
        "TRANSLATION_10": "They respect not either kinship or agreement in a believer: those! they are the transgressors!\n",
        "TRANSLATION_11": "They observe toward a believer neither kinship nor covenant, and it is they who are the transgressors.\n",
        "TRANSLATION_12": "In a Believer they respect not the ties either of kinship or of covenant! It is they who have transgressed all bounds.\n",
        "TRANSLATION_13": "With regard to a believer, they respect not the ties, either of kinship or of covenant! It is they who are the transgressors.\n",
        "TRANSLATION_14": "They honor with the believers neither bonds nor treaties. Such are the transgressors.\n",
        "TRANSLATION_15": "Towards a believer they respect neither kinship nor treaty. These are the transgressors.\n",
        "TRANSLATION_16": "They do not observe toward a believer any pact of kinship or covenant of protection. And it is they who are the transgressors.\n",
        "TRANSLATION_17": "[9:10] They respect neither bond [of kinship] nor treaty with regard to a believer; those, they are the transgressors.\n",
        "TRANSLATION_18": "(And they observe towards a believer neither pact) ties of kinship; it is also said that the reference here is to Allah (nor honour) because of the treaties they signed. (These are they who are transgressors) who shifted from that which is lawful to that which is prohibited, by breaking their treaties and committing other things.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "9:10",
            "2:190",
            "5:87",
            "9:8",
            "2:162",
            "3:88",
            "37:8",
            "22:12",
            "41:19",
            "3:22"
        ],
        "BIBLE": [
            "writings:psalms:144:15",
            "torah:deuteronomy:19:4",
            "writings:ezra:10:13",
            "prophets:malachi:2:9",
            "writings:proverbs:28:21",
            "torah:exodus:19:5",
            "prophets:judges:2:20",
            "torah:numbers:15:26",
            "torah:exodus:22:8",
            "prophets:hosea:6:7"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:3",
            
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:2:1"
        ]
    }
}