{
    "VERSE": "9:105",
    "ARABIC": "وَقُلِ ٱعْمَلُوا۟ فَسَيَرَى ٱللَّهُ عَمَلَكُمْ وَرَسُولُهُۥ وَٱلْمُؤْمِنُونَ وَسَتُرَدُّونَ إِلَىٰ عَٰلِمِ ٱلْغَيْبِ وَٱلشَّهَٰدَةِ فَيُنَبِّئُكُم بِمَا كُنتُمْ تَعْمَلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Say: 'Act, for Allah will see your actions, and so will His Messenger and the muminun. You will be returned to the Knower of the Unseen and the Visible and He will inform you regarding what you did.'",
        "TRANSLATION_1": "Say to them: \"Act. God will see your conduct, and so will His Apostle and the faithful; for you will in the end go back to Him, who knows the unknown and the known, who will tell you of what you were doing.\"\n",
        "TRANSLATION_2": "And tell them, (O Prophet): \"Keep working: Allah will behold your works and so will His Messenger and the believers; and you shall be brought back to Him Who knows that which is beyond the reach of perception and that which is within the reach of perception. He will then declare to you all that you have been doing.\"\n",
        "TRANSLATION_3": "(Muhammad), tell them, \"Act as you wish. God, His Messenger and the believers will see your deeds. You will be brought before the One who has absolute knowledge of the unseen and the seen. He will let you know about all that you have done.\n",
        "TRANSLATION_4": "And say “Keep on with your works – Allah will now see your deeds, and so will His Noble Messenger and the Muslims; and soon you will return to the One Who knows everything – the hidden and the visible – so He will inform you of what you used to do.”\n",
        "TRANSLATION_5": "And say \"Do deeds! Allah will see your deeds, and (so will) His Messenger and the believers. And you will be brought back to the All-Knower of the unseen and the seen. Then He will inform you of what you used to do.\"\n",
        "TRANSLATION_6": "And say: Work; so Allah will see your work and (so will) His Apostle and the believers; and you shall be brought back to the Knower of the unseen and the seen, then He will inform you of what you did.\n",
        "TRANSLATION_7": "Say: 'Work; and God will surely see your work, and His Messenger, and the believers, and you will be returned to Him who knows the unseen and the visible, and He will tell you what you were doing.'\n",
        "TRANSLATION_8": "And say (unto them): Act! Allah will behold your actions, and (so will) His messenger and the believers, and ye will be brought back to the Knower of the Invisible and the Visible, and He will tell you what ye used to do.\n",
        "TRANSLATION_9": "Say, \"Do as you will. God will watch your conduct and so will His Messenger and the believers. Soon you will be brought back to Him who knows what is hidden and what is manifest: then He will show you the truth of all that you have done.\"\n",
        "TRANSLATION_10": "And say thou: work on! Allah beholdeth your work and so do His apostle and the believers, and anon ye will be brought back to the Knower of the hidden and the manifest; He will then declare unto you that which ye have been working.\n",
        "TRANSLATION_11": "And say, ‘Go on working: Allah will see your conduct, and His Apostle and the faithful [as well], and you will be returned to the Knower of the sensible and the Unseen, and He will inform you concerning what you used to do.\n",
        "TRANSLATION_12": "And say: \"Work (righteousness): Soon will Allah observe your work, and His Messenger, and the Believers: Soon will ye be brought back to the knower of what is hidden and what is open: then will He show you the truth of all that ye did.\"\n",
        "TRANSLATION_13": "And say (O Muhammad SAW) \"Do deeds! Allah will see your deeds, and (so will) His Messenger and the believers. And you will be brought back to the All-Knower of the unseen and the seen. Then He will inform you of what you used to do.\"\n",
        "TRANSLATION_14": "Say: 'Allah will see your works and so will His Messenger and the believers; then you shall be returned to the Knower of the unseen and the visible, and He will inform you of what you were doing'\n",
        "TRANSLATION_15": "Say, “Work. God will see your work, and so will His Messenger, and the believers. Then you will be returned to the Knower of secrets and declarations, and He will inform you of what you used to do.”\n",
        "TRANSLATION_16": "And say, \"Do [as you will], for Allah will see your deeds, and [so, will] His Messenger and the believers. And you will be returned to the Knower of the unseen and the witnessed, and He will inform you of what you used to do.\"\n",
        "TRANSLATION_17": "[9:105] And say, to them, or to people [in general]: ‘Act, as you will, for God will surely see your actions, and [so will] His Messenger and the believers, and you will be returned, through resurrection, to the Knower of the unseen and the visible, that is, [to] God, and He will tell you what you used to do’, and so requite you for it.\n",
        "TRANSLATION_18": "(And say (unto them)) Muhammad: (Act!) do good deeds after your repentance (Allah will behold your actions, and (so will) His messenger and the believers, and ye will be brought back) after death (to the Knower of the invisible) that which is hidden from His servants; it is also said that this means: that which will happen in the future (and the visible) that which His servants know; it is also said that this means: that which has already happened, (and He will tell you what ye used to do) and say of good and evil.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "9:105",
            "9:94",
            "23:92",
            "47:33",
            "47:32",
            "62:8",
            "24:52",
            "9:1",
            "10:81",
            "4:61"
        ],
        "BIBLE": [
            "torah:exodus:34:10",
            "prophets:ezekiel:28:22",
            "prophets:judges:6:22",
            "prophets:ii%20samuel:15:20",
            "writings:psalms:40:6",
            "prophets:isaiah:49:21",
            "prophets:jeremiah:42:4",
            "prophets:i%20kings:20:39",
            "prophets:jeremiah:3:7",
            "writings:daniel:2:47"
        ]
    }
}