{
    "VERSE": "9:107",
    "ARABIC": "وَٱلَّذِينَ ٱتَّخَذُوا۟ مَسْجِدًا ضِرَارًا وَكُفْرًا وَتَفْرِيقًۢا بَيْنَ ٱلْمُؤْمِنِينَ وَإِرْصَادًا لِّمَنْ حَارَبَ ٱللَّهَ وَرَسُولَهُۥ مِن قَبْلُ وَلَيَحْلِفُنَّ إِنْ أَرَدْنَآ إِلَّا ٱلْحُسْنَىٰ وَٱللَّهُ يَشْهَدُ إِنَّهُمْ لَكَٰذِبُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "As for those who have set up a mosque, causing harm and out of kufr, to create division between the 'We only desired the best.' But Allah bears witness that they are truly liars.",
        "TRANSLATION_1": "There are those who built a mosque on opposition and disbelief, and to cause rifts among the faithful, and to serve as an outpost for those who have warred against God and His Apostle before this. Yet they will surely swear: \"We had only meant well.\" But God is witness that they are liars.\n",
        "TRANSLATION_2": "Then there are others who have set up a mosque to hurt the True Faith, to promote unbelief, and cause division among believers, and as an ambush for one who had earlier made war on Allah and His Messenger. They will surely swear: \"We intended nothing but good,\" whereas Allah bears witness that they are liars.\n",
        "TRANSLATION_3": "The mosque which some of the hypocrites have established is only to harm people, to spread disbelief, to create discord among the believers, to wait for the one who fought against God and His Messenger, and to make others believe that it has been established with their good intentions. But God testifies that they are liars.\n",
        "TRANSLATION_4": "And those (hypocrites) who built a mosque to cause harm, and due to disbelief, and in order to cause divisions among the Muslims, and to await the one who is at the outset an opponent of Allah and His Noble Messenger; and they will surely swear that “We wished only good”; and Allah is witness that they are indeed liars.\n",
        "TRANSLATION_5": "And as for those who put up a Masjid by way of harm and disbelief and to disunite the believers and as an outpost for those who warred against Allah and His Messenger aforetime, they will indeed swear that their intention is nothing but good. Allah bears witness that they are certainly liars.\n",
        "TRANSLATION_6": "And those who built a masjid to cause harm and for unbelief and to cause disunion among the believers and an ambush to him who made war against Allah and His Apostle before; and they will certainly swear: We did not desire aught but good; and Allah bears witness that they are most surely liars.\n",
        "TRANSLATION_7": "And those who have taken a mosque in opposition and unbelief, and to divide the believers, and as a place of ambush for those who fought God and His Messenger aforetime -- they will swear 'We desired nothing but good'; and God testifies they are truly liars.\n",
        "TRANSLATION_8": "And as for those who chose a place of worship out of opposition and disbelief, and in order to cause dissent among the believers, and as an outpost for those who warred against Allah and His messenger aforetime, they will surely swear: We purposed naught save good. Allah beareth witness that they verily are liars.\n",
        "TRANSLATION_9": "Then there are those who built a mosque to cause harm, to spread apostasy and disunity among the believers -- as an outpost for those who from the outset warred on God and His Messenger. They swear, \"Our intentions were nothing but good,\" but God bears witness that they are lying.\n",
        "TRANSLATION_10": "And as for those who have set up a mosque for hurting and blaspheming and the causing of division among the believers and as a lurking-place for one who hath warred against Allah and His apostle aforetime, and surely; they will swear: we intended only good, whereas Allah testifieth that they are liars.\n",
        "TRANSLATION_11": "As for those who took to a mosque for sabotage and for defiance, and to cause division among the faithful, and for the purpose of ambush [used] by those who have fought Allah and His Apostle before—they will surely swear, ‘We desired nothing but good,’ and Allah bears witness that they are indeed liars.\n",
        "TRANSLATION_12": "And there are those who put up a mosque by way of mischief and infidelity - to disunite the Believers - and in preparation for one who warred against Allah and His Messenger aforetime. They will indeed swear that their intention is nothing but good; But Allah doth declare that they are certainly liars.\n",
        "TRANSLATION_13": "And as for those who put up a mosque by way of harming and disbelief, and to disunite the believers, and as an outpost for those who warred against Allah and His Messenger (Muhammad SAW) aforetime, they will indeed swear that their intention is nothing but good. Allah bears witness that they are certainly liars.\n",
        "TRANSLATION_14": "And there are those who have taken a mosque to cause harm, disbelief, and to divide the believers, and as a place of ambush for those who fought Allah and His Messenger before. They swear: 'We desired nothing but good', but Allah bears witness that they are liars.\n",
        "TRANSLATION_15": "Then there are those who establish a mosque to cause harm, and disbelief, and disunity among the believers, and as an outpost for those who fight God and His Messenger. They will swear: “Our intentions are nothing but good.” But God bears witness that they are liars.\n",
        "TRANSLATION_16": "And [there are] those [hypocrites] who took for themselves a mosque for causing harm and disbelief and division among the believers and as a station for whoever had warred against Allah and His Messenger before. And they will surely swear, \"We intended only the best.\" And Allah testifies that indeed they are liars.\n",
        "TRANSLATION_17": "[9:107]   And, among them, those who have chosen a mosque — these were twelve men from among the hypocrites — by way of harm, to cause distress for those of the mosque of Qubā’, and disbelief, since they built it on the orders of the monk Abū ‘Āmir, as a sanctuary for him, so that whoever comes from his side may stay there: he had gone to the Byzantine Emperor (qaysar) to bring troops to fight against the Prophet (s), and to cause division among the believers, who pray in the mosque of Qubā’, by having some of these pray in their [the hypocrites’] mosque, and as an outpost, an observation post, for those who waged war against God and His Messenger before, that is, before it was built — meaning the above-mentioned Abū ‘Āmir — they will swear: ‘We desired nothing, by building it, but, to do, good’, by way of kindness towards the poor in times of [heavy] rain or [extreme] heat and in order to provide [a place of worship] for the Muslims; and God bears witness that they are truly liars, in this [claim of theirs]. They had asked the Prophet (s) to perform prayers in it, and so the following was revealed:\n",
        "TRANSLATION_18": "(And as for those who chose) built (a place of worship) the reference here is to 'Abdullah Ibn Ubayy, Jadd Ibn Qays, Mu'attib Ibn Qushayr and their friends, who were about 17 in number, (out of opposition) out of harm for the believers (and disbelief) in their hearts; standing firm in their disbelief, i.e. hypocrisy, (and in order to cause dissent among the believers) such that a party of the believers performed their prayers in their mosque and a party in the Mosque of the Messenger, (and as an outpost) waiting (for those who warred against Allah and His messenger) for those who disbelieved in Allah and his Messenger (aforetime) before them, referring here to Abu 'Amir, the monk, whom the Prophet (pbuh) called a sinner [fasiq], (they will surely swear: We purposed) by building the mosque (naught save good) save good for the believers so that those who miss the prayer in Quba' Mosque can pray therein. (Allah beareth witness) Allah knows (that they verily are liars) in their oaths.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "9:107",
            "58:5",
            "3:183",
            "9:7",
            "24:48",
            "29:3",
            "39:3",
            "24:51",
            "4:150",
            "8:1"
        ],
        "BIBLE": [
            "torah:genesis:3:6",
            "prophets:ezekiel:26:14",
            "writings:ezra:5:15",
            "prophets:ii%20kings:15:35",
            "prophets:joshua:1:8",
            "prophets:joshua:23:7",
            "torah:leviticus:10:17",
            "writings:i%20chronicles:28:4",
            "writings:i%20chronicles:22:5",
            "prophets:ii%20samuel:23:5"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:5:1"
        ]
    }
}