{
    "VERSE": "9:109",
    "ARABIC": "أَفَمَنْ أَسَّسَ بُنْيَٰنَهُۥ عَلَىٰ تَقْوَىٰ مِنَ ٱللَّهِ وَرِضْوَٰنٍ خَيْرٌ أَم مَّنْ أَسَّسَ بُنْيَٰنَهُۥ عَلَىٰ شَفَا جُرُفٍ هَارٍ فَٱنْهَارَ بِهِۦ فِى نَارِ جَهَنَّمَ وَٱللَّهُ لَا يَهْدِى ٱلْقَوْمَ ٱلظَّٰلِمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Who is better: someone who founds his building on taqwa of Allah and His good pleasure, or someone who founds his building on the brink of a crumbling precipice so that it collapses with him into the Fire of Hell? Allah does not love wrongdoers.",
        "TRANSLATION_1": "Is the man who lays the foundations of his sanctum on his allegiance to God and the wish to seek His favour, better, or he who lays the foundations of his building on the edge of a bank eroded by water, which will collapse with him into the fire of Hell? But God does not guide the people who are wilfully unjust.\n",
        "TRANSLATION_2": "Is he, then, who has erected his structure on the fear of Allah and His good pleasure better, or he who erects his structure on the brink of a crumbling bank, so that it crumbles down with him into the Hell-Fire? Allah does not bestow His Guidance on the wrong-doing folk.\n",
        "TRANSLATION_3": "Which is better, the mosque that is founded for pious purposes and for achieving God's pleasure or that which is based on the brink of a crumbling bank and which may crumble into hell at any moment? God does not guide the unjust.\n",
        "TRANSLATION_4": "So is one who established his foundation upon the fear of Allah and upon His pleasure better, or the one who laid his foundation upon the brink of a falling precipice, so it fell along with him into the fire of hell? And Allah does not guide the unjust.\n",
        "TRANSLATION_5": "Is it then he who laid the foundation of his building on Taqwa to Allah and His good pleasure better, or he who laid the foundation of his building on the brink of an undetermined precipice ready to crumble down, so that it crumbled to pieces with him into the fire of Hell. And Allah guides not the people who are the wrongdoers.\n",
        "TRANSLATION_6": "Is he, therefore, better who lays his foundation on fear of Allah and (His) good pleasure, or he who lays his foundation on the edge of a cracking hollowed bank, so it broke down with him into the fire of hell; and Allah does not guide the unjust people.\n",
        "TRANSLATION_7": "Why, is he better who founded his building upon the fear of God and His good pleasure, or he who founded his building upon the brink of a crumbling bank that has tumbled with him into the fire of Gehenna? And God guides not the people of the evildoers.\n",
        "TRANSLATION_8": "Is he who founded his building upon duty to Allah and His good pleasure better; or he who founded his building on the brink of a crumbling, overhanging precipice so that it toppled with him into the fire of hell? Allah guideth not wrongdoing folk.\n",
        "TRANSLATION_9": "Who is better, he who founds his building on the fear of God and His good pleasure, or he who builds on the brink of a crumbling precipice, so that his house is ready to fall with him into the Fire of Hell? God does not guide the wrongdoers:\n",
        "TRANSLATION_10": "Is he, then, who hath founded his building upon piety towards Allah and His good-will better, or he who hath founded his building on the brink of a crumbling bank, so that it crumbleth with him into the Hell-fire! And Allah guideth not the wrong-doing people.\n",
        "TRANSLATION_11": "Is he who founds his building on Godwariness and [the pursuit of Allah’s] pleasure better-off or he who founds his building on the brink of a collapsing bank which collapses with him into the fire of hell? Allah does not guide the wrongdoing lot.\n",
        "TRANSLATION_12": "Which then is best? - he that layeth his foundation on piety to Allah and His good pleasure? - or he that layeth his foundation on an undermined sand-cliff ready to crumble to pieces? and it doth crumble to pieces with him, into the fire of Hell. And Allah guideth not people that do wrong.\n",
        "TRANSLATION_13": "Is it then he, who laid the foundation of his building on piety to Allah and His Good Pleasure, better, or he who laid the foundation of his building on an undetermined brink of a precipice ready to crumble down, so that it crumbled to pieces with him into the Fire of Hell. And Allah guides not the people who are the Zalimun (cruel, violent, proud, polytheist and wrong-doer).\n",
        "TRANSLATION_14": "Is he who founds his building on the fear of Allah and His pleasure, better or he who founds his building on the brink of a crumbling edge so that it will tumble with him into the Fire of Gehenna? Allah does not guide the harmdoers.\n",
        "TRANSLATION_15": "Is he who founds his structure upon piety and acceptance from God better, or he who founds his structure on the brink of a cliff that is about to tumble, so it tumbles with him into the Fire of Hell? God does not guide the unjust people.\n",
        "TRANSLATION_16": "Then is one who laid the foundation of his building on righteousness [with fear] from Allah and [seeking] His approval better or one who laid the foundation of his building on the edge of a bank about to collapse, so it collapsed with him into the fire of Hell? And Allah does not guide the wrongdoing people.\n",
        "TRANSLATION_17": "[9:109] Is he who founded his building upon fear of God and, in hope of, beatitude, from Him, better, or he who founded his building upon the brink, the edge, of a bank, an overhang, that is crumbling, about to collapse (read juruf or jurf) so that it toppled with him, so that it collapsed [taking] with it the one who built it, into the fire of Hell?: [this is] an excellent similitude for building upon that which constitutes the opposite of fear of God and [for] what it leads to; the interrogative is meant as an affirmative: in other words, the former is the better, which is the likeness of the [building of the] mosque of Qubā’, while the latter is the likeness of the mosque of ‘harm’ (masjid al-dirār). And God guides not the evildoing folk.\n",
        "TRANSLATION_18": "(Is he who founded his building) is he who builds its foundation (upon duty to Allah) upon obedience and remembrance of Allah (and His good pleasure) they built the will of their Lord's good pleasure, i.e. the mosque of Quba' (better; or he who founded his building) or he who builds its foundation, i.e. the mosque of opposition (on the brink of a crumbling, overhanging precipice) without a base (so that it toppled with him) the one who build it (into the fire of hell? Allah guideth not wrong-doing folk) Allah neither forgives the hypocrites nor saves them.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "9:109",
            "41:40",
            "3:162",
            "46:10",
            "11:30",
            "11:78",
            "28:60",
            "22:72",
            "5:51",
            "7:127"
        ],
        "BIBLE": [
            "writings:daniel:12:7",
            "prophets:jeremiah:25:34",
            "prophets:ii%20kings:11:18",
            "writings:ii%20chronicles:23:17",
            "prophets:isaiah:30:14",
            "prophets:isaiah:24:19",
            "prophets:isaiah:66:3",
            "prophets:zechariah:11:16",
            "writings:ii%20chronicles:31:1",
            "prophets:ii%20kings:23:14"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:1:14",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:5:2"
        ]
    }
}