{
    "VERSE": "9:112",
    "ARABIC": "ٱلتَّٰٓئِبُونَ ٱلْعَٰبِدُونَ ٱلْحَٰمِدُونَ ٱلسَّٰٓئِحُونَ ٱلرَّٰكِعُونَ ٱلسَّٰجِدُونَ ٱلْءَامِرُونَ بِٱلْمَعْرُوفِ وَٱلنَّاهُونَ عَنِ ٱلْمُنكَرِ وَٱلْحَٰفِظُونَ لِحُدُودِ ٱللَّهِ وَبَشِّرِ ٱلْمُؤْمِنِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Those who make tawba, those who worship, those who praise, those who fast, those who bow, those who prostrate, those who command the right, those who forbid the wrong, those who preserve the limits of Allah: give good news to the muminun.",
        "TRANSLATION_1": "To those who repent and pay homage, give praise and are devout, who kneel in prayer and bow in supplication, who enjoin good deeds and prohibit the bad, and keep to the limits set by God, announce the news of rejoicing to the faithful.\n",
        "TRANSLATION_2": "Those who constantly turn to Allah in repentance, who constantly worship Him, who celebrate His praise, who go about the world to serve His cause, who bow down to Him, who prostrate themselves before Him, who enjoin what is good and forbid what is evil, and who keep the limits set by Allah. Announce glad tidings to such believers.\n",
        "TRANSLATION_3": "(The believers) who repent for their sins, worship God, praise Him, travel through the land (for pious purposes), kneel down and prostrate themselves in obedience to God, make others do good and prevent them from sins and abide by the laws of God, will receive a great reward. Let this be glad news for the believer.\n",
        "TRANSLATION_4": "Those who repent, those who worship, those who praise, those who fast, those who bow, those who prostrate, those who show right and forbid wrong and those who keep the limits of Allah in sight; and give glad tidings to the Muslims.\n",
        "TRANSLATION_5": "Those who repent, who worship (Him), who praise (Him), who fast, who bow down, who prostrate themselves, who enjoin good and forbid evil, and who observe the limits set by Allah. And give glad tidings to the believers.\n",
        "TRANSLATION_6": "They who turn (to Allah), who serve (Him), who praise (Him), who fast, who bow down, who prostrate themselves, who enjoin what is good and forbid what is evil, and who keep the limits of Allah; and give good news to the believers.\n",
        "TRANSLATION_7": "Those who repent, those who serve, those who pray, those whojourney, those who bow, those who prostrate themselves, those who bid to honour and forbid dishonour, those who keep God's hounds -- and give thou good tidings to the believers.\n",
        "TRANSLATION_8": "(Triumphant) are those who turn repentant (to Allah), those who serve (Him), those who praise (Him), those who fast, those who bow down, those who fall prostrate (in worship), those who enjoin the right and who forbid the wrong and those who keep the limits (ordained) of Allah - And give glad tidings to believers!\n",
        "TRANSLATION_9": "[The believers are] those who turn to God in repentance; who worship and praise Him; who go about in the land serving His cause, who bow down, who prostrate themselves, who enjoin good and forbid evil, and who observe the limits set by God. Give good news to the believers!\n",
        "TRANSLATION_10": "They are those who repent, who worship who praise, who fast constantly, woo bow down, who prostrate themselves, who command the reputable and restrain from the disreputable and who keep the ordinances of Allah; and bear thou glad tidings to the believers.\n",
        "TRANSLATION_11": "[The faithful are] penitent, devout, celebrators of Allah’s praise, wayfarers, who bow [and] prostrate [in prayer], bid what is right and forbid what is wrong, and keep Allah’s bounds—and give good news to the faithful.\n",
        "TRANSLATION_12": "Those that turn (to Allah) in repentance; that serve Him, and praise Him; that wander in devotion to the cause of Allah,: that bow down and prostrate themselves in prayer; that enjoin good and forbid evil; and observe the limit set by Allah;- (These do rejoice). So proclaim the glad tidings to the Believers.\n",
        "TRANSLATION_13": "(The believers whose lives Allah has purchased are) those who repent to Allah (from polytheism and hypocrisy, etc.), who worship Him, who praise Him, who fast (or go out in Allah's Cause), who bow down (in prayer), who prostrate themselves (in prayer), who enjoin (people) for Al-Ma'ruf (i.e. Islamic Monotheism and all what Islam has ordained) and forbid (people) from Al-Munkar (i.e. disbelief, polytheism of all kinds and all that Islam has forbidden), and who observe the limits set by Allah (do all that Allah has ordained and abstain from all kinds of sins and evil deeds which Allah has forbidden). And give glad tidings to the believers.\n",
        "TRANSLATION_14": "Those who repent, those who worship Allah and praise (Him); those who journey, those who bow, those who prostrate themselves; those who order righteousness and forbid evil, and those who observe the limits of Allah give glad tidings to the believers.\n",
        "TRANSLATION_15": "Those who repent, those who worship, those who praise, those who journey, those who kneel, those who bow down, those who advocate righteousness and forbid evil, and those who keep God’s limits—give good news to the believers.\n",
        "TRANSLATION_16": "[Such believers are] the repentant, the worshippers, the praisers [of Allah], the travelers [for His cause], those who bow and prostrate [in prayer], those who enjoin what is right and forbid what is wrong, and those who observe the limits [set by] Allah. And give good tidings to the believers.\n",
        "TRANSLATION_17": "[9:112] Those who repent (al-tā’ibūna is in the nominative as a laudative, the subject being implicit), from idolatry and hypocrisy, those who worship, who devote their worship sincerely to God, those who give praise, to Him in every state, those who fast, those who bow, those who prostrate themselves, that is, those who perform prayers, those who enjoin decency and forbid to indecency, those who maintain God’s bounds, His rulings, by implementing them, and give good tidings to the believers, of Paradise.\n",
        "TRANSLATION_18": "Allah then explained who they were, saying: ((Triumphant) are those who turn repentant (to Allah)) those who repent of sins, (those who serve (Him)) the obedient, (those who praise (Him)) the thankful, (those who fast, these who bow down, those who fall prostrate (in worship)) in the five daily prayers, (those who enjoin the right) the confession of Allah's divine Oneness and goodness (and who forbid the wrong) disbelief and all that which is not known in the Sacred Law or the Prophetic Practice (and those who keep the limits (ordained) of Allah) those who observe the obligations of Allah (And give glad tidings to believers) that they shall have Paradise!\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "9:112",
            "9:43",
            "2:15",
            "112:1",
            "39:66",
            "72:18",
            "40:14",
            "53:62",
            "33:64",
            "18:38"
        ],
        "BIBLE": [
            "prophets:joshua:23:16",
            "prophets:ii%20kings:21:8",
            "prophets:ezekiel:3:20",
            "prophets:i%20kings:8:33",
            "torah:deuteronomy:26:10",
            "writings:ii%20chronicles:6:27",
            "torah:exodus:36:6",
            "writings:ii%20chronicles:6:24",
            "writings:esther:4:8",
            "prophets:i%20kings:5:23"
        ]
    }
}