{
    "VERSE": "9:118",
    "ARABIC": "وَعَلَى ٱلثَّلَٰثَةِ ٱلَّذِينَ خُلِّفُوا۟ حَتَّىٰٓ إِذَا ضَاقَتْ عَلَيْهِمُ ٱلْأَرْضُ بِمَا رَحُبَتْ وَضَاقَتْ عَلَيْهِمْ أَنفُسُهُمْ وَظَنُّوٓا۟ أَن لَّا مَلْجَأَ مِنَ ٱللَّهِ إِلَّآ إِلَيْهِ ثُمَّ تَابَ عَلَيْهِمْ لِيَتُوبُوٓا۟ إِنَّ ٱللَّهَ هُوَ ٱلتَّوَّابُ ٱلرَّحِيمُ",
    "ENGLISH": {
        "TRANSLATION_0": "and also towards the three who were left behind,* so that when the earth became narrow for them, for all its great breadth, and their own selves became constricted for them and they realised that there was no refuge from Allah except in Him, He turned to them so that they might turn to Him. Allah is the Ever-Returning, the Most Merciful.",
        "TRANSLATION_1": "He has relented towards the three also (who had refused to go to the battle of the Ditch) whose case was left undecided, and even the earth with all its expanse had become narrow for them, and their lives were confined, and they came to realise there was no refuge for them except in God. So He softened towards them that they may repent; for God surely accepts repentance and is merciful.\n",
        "TRANSLATION_2": "And He also relented towards the three whose cases had been deferred. When the earth, for all its spaciousness, became constrained to them, and their own beings became a burden to them, and they realized that there was no refuge for them from Allah except in Him; He relented towards them that they may turn back to Him. Surely, it is Allah Who is Much Forgiving, Ever Merciful.\n",
        "TRANSLATION_3": "God also forgave the three people who lagged behind. Grief made them feel as though there was no place in the whole vast earth to hide them or in their souls to conceal their sorrow. They began to believe that no one could save them from (the wrath of God) except He Himself. God pardoned them so that they would also repent for their sins. God is All-forgiving and All-merciful.\n",
        "TRANSLATION_4": "And also upon the three who were kept in waiting; when the earth, vast as it is, was restricted for them, and they became weary of their own lives and became certain that there is no refuge from Allah except with Him; He then accepted their repentance in order that they remain repentant; indeed Allah is the Most Acceptor of Repentance, the Most Merciful.\n",
        "TRANSLATION_5": "And (Allah has forgiven) the three who stayed behind, until for them the earth, vast as it is, was straitened and their souls were straitened to them, and they perceived that there is no fleeing from Allah, and no refuge but with Him. Then, He forgave them, that they might beg for His pardon. Verily, Allah is the One Who forgives and accepts repentance, Most Merciful.\n",
        "TRANSLATION_6": "And to the three who were left behind, until the earth became strait to them notwithstanding its spaciousness and their souls were also straitened to them; and they knew it for certain that there was no refuge from Allah but in Him; then He turned to them (mercifully) that they might turn (to Him); surely Allah is the Oft-returning (to mercy), the Merciful.\n",
        "TRANSLATION_7": "And to the three who were left behind, until, when the earth became strait for them, for all its breadth, and their souls became strait for them, and they thought that there was no shelter from God except in Him, then He turned towards them, that they might also turn; surely God turns, and is All-compassionate.\n",
        "TRANSLATION_8": "And to the three also (did He turn in mercy) who were left behind, when the earth, vast as it is, was straitened for them, and their own souls were straitened for them till they bethought them that there is no refuge from Allah save toward Him. Then turned He unto them in mercy that they (too) might turn (repentant unto Him). Lo! Allah! He is the Relenting, the Merciful.\n",
        "TRANSLATION_9": "He has turned with mercy to the three whose case was deferred, when the earth, for all its spaciousness, closed in upon them, and their own souls seemed straitened to them and they realised that there was no refuge from God except in Him. He turned to them so that they might turn to Him. God is the Ever Forgiving, the Most Merciful.\n",
        "TRANSLATION_10": "And also He relented toward the three who were left behind until when the earth, vast as it is, became straitened unto them and their own lives became straitened unto them and they imagined that there was no refuge from Allah except unto Him. Thereafter He relented toward them, so that they might repent. Verily Allah! He is the Relenting, the Merciful.\n",
        "TRANSLATION_11": "—and to the three who were left behind. When the earth became narrow for them with [all] its expanse, and their own souls weighed heavily on them, and they knew that there was no refuge from Allah except in Him, then He turned clemently toward them so that they might be penitent. Indeed Allah is the All-clement, the All-merciful.\n",
        "TRANSLATION_12": "(He turned in mercy also) to the three who were left behind; (they felt guilty) to such a degree that the earth seemed constrained to them, for all its spaciousness, and their (very) souls seemed straitened to them,- and they perceived that there is no fleeing from Allah (and no refuge) but to Himself. Then He turned to them, that they might repent: for Allah is Oft-Returning, Most Merciful.\n",
        "TRANSLATION_13": "And (He did forgive also) the three [who did not join the Tabuk expedition (whom the Prophet SAW)] left (i.e. he did not give his judgement in their case, and their case was suspended for Allah's Decision) till for them the earth, vast as it is, was straitened and their ownselves were straitened to them, and they perceived that there is no fleeing from Allah, and no refuge but with Him. Then, He accepted their repentance, that they might repent (unto Him). Verily, Allah is the One Who accepts repentance, Most Merciful.\n",
        "TRANSLATION_14": "And to the three who were left behind (at the Battle of Tabuk), until the earth became narrow with all its vastness, and their souls became narrow for them, they knew there was no shelter from Allah except in Him. Then He turned to them (in mercy) so that they might also turn (in repentance). Allah is the Turner, the Most Merciful.\n",
        "TRANSLATION_15": "Also towards the three who were left behind. Then, when the earth, as vast as it is, closed in on them, and their very souls closed in on them, and they realized that there was no refuge from God, except in Him, He redeemed them, so that they may repent. God is the Redeemer, the Merciful.\n",
        "TRANSLATION_16": "And [He also forgave] the three who were left behind [and regretted their error] to the point that the earth closed in on them in spite of its vastness and their souls confined them and they were certain that there is no refuge from Allah except in Him. Then He turned to them so they could repent. Indeed, Allah is the Accepting of repentance, the Merciful.\n",
        "TRANSLATION_17": "[9:118] And, He relented, to the three who were left behind, [formerly denied] His relenting to them, for the same reason [as those mentioned above], when the earth was straitened for them, for all its breadth, that is, despite its vastness, so they could find no place wherein to feel secure, and their souls, that is, their hearts, were straitened for them, because of the anxiety and their [sense of] alienation resulting from the delay of God’s relenting to them [with mercy], such that they [their souls] could not find happiness or solace; until   they thought, they were certain, that (read the softened an) there is no refuge from God except in Him. Then He turned [relenting] to them, He made them successful in finding repentance, that they might also turn [in repentance]. Truly God is the Relenting, the Merciful.\n",
        "TRANSLATION_18": "(And to the three also (did He turn in mercy) who were left behind) He also turned in mercy to the three who stayed behind: Ka'b Ibn Malik and his two Companions: (when the earth, vast as it is, was straitened for them, and their own souls were straitened for them) their hearts became straitened because of the delay in the acceptance of their repentance (till they bethought) until they knew and became certain (them that there is no refuge from Allah) that there is no safety from Allah (save towards Him) save in repenting to Him for failing to join in the Battle of Tabuk. (Then turned He unto them in mercy) He pardoned and forgave them (that they (too) might turn (repentant unto Him)) for failing to join in the Battle of Tabuk. (Lo! Allah! He is the Relenting) the Forgiving, (the Merciful) towards he who repents.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "9:118",
            "10:100",
            "45:22",
            "4:29",
            "57:22",
            "4:64",
            "29:40",
            "6:12",
            "9:91",
            "4:42"
        ],
        "BIBLE": [
            "prophets:i%20samuel:25:34",
            "writings:ezra:10:14",
            "prophets:jonah:4:2",
            "prophets:joel:2:13",
            "prophets:ii%20samuel:2:23",
            "writings:ii%20chronicles:6:26",
            "prophets:i%20kings:20:39",
            "prophets:ezekiel:38:12",
            "prophets:i%20kings:8:35",
            "writings:ezra:6:22"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:1:6"
        ]
    }
}