{
    "VERSE": "9:119",
    "ARABIC": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ ٱتَّقُوا۟ ٱللَّهَ وَكُونُوا۟ مَعَ ٱلصَّٰدِقِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "You who have iman! have taqwa of Allah and be with the truly sincere.",
        "TRANSLATION_1": "O believers, do not stray from the path of God, and be with those who are truthful.\n",
        "TRANSLATION_2": "Believers! Have fear of Allah and stand with those that are truthful.\n",
        "TRANSLATION_3": "Believers, have fear of God and always be friends with the truthful ones.\n",
        "TRANSLATION_4": "O People who Believe! Fear Allah, and be with the truthful.\n",
        "TRANSLATION_5": "O you who believe! Have Taqwa of Allah, and be with those who are true (in words and deeds).\n",
        "TRANSLATION_6": "O you who believe! be careful of (your duty to) Allah and be with the true ones.\n",
        "TRANSLATION_7": "O believers, fear God, and be with the truthful ones.\n",
        "TRANSLATION_8": "O ye who believe! Be careful of your duty to Allah, and be with the truthful.\n",
        "TRANSLATION_9": "Believers, fear God and stand with the truthful.\n",
        "TRANSLATION_10": "O Ye who believe! fear Allah, and be with the truthful.\n",
        "TRANSLATION_11": "O you who have faith! Be wary of Allah, and be with the Truthful.\n",
        "TRANSLATION_12": "O ye who believe! Fear Allah and be with those who are true (in word and deed).\n",
        "TRANSLATION_13": "O you who believe! Be afraid of Allah, and be with those who are true (in words and deeds).\n",
        "TRANSLATION_14": "Believers, fear Allah and stand with the truthful.\n",
        "TRANSLATION_15": "O you who believe! Be conscious of God, and be with the sincere.\n",
        "TRANSLATION_16": "O you who have believed, fear Allah and be with those who are true.\n",
        "TRANSLATION_17": "[9:119] O you who believe, fear God, by refraining from [acts of] disobedience to Him, and be with those who are truthful, in [their] faith and covenants, by adhering to sincerity.\n",
        "TRANSLATION_18": "(0 ye who believe!) 'Abdullah Ibn Salam and his followers as well as all other believers (Be careful of your duty to Allah) obey Allah in that which He has commanded you, (and be with the Truthful) with Abu Bakr, 'Umar and their companions when they stay behind and when they participate in jihad.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "9:119",
            "3:200",
            "16:128",
            "3:141",
            "29:11",
            "33:70",
            "2:153",
            "2:278",
            "47:7",
            "47:33"
        ],
        "BIBLE": [
            "writings:job:19:21",
            "prophets:jeremiah:23:22",
            "prophets:ii%20samuel:7:28",
            "torah:deuteronomy:31:12",
            "prophets:isaiah:44:8",
            "prophets:jeremiah:42:5",
            "prophets:i%20samuel:15:24",
            "writings:ii%20chronicles:20:7",
            "prophets:isaiah:8:10",
            "writings:psalms:54:4"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:6:1"
        ]
    }
}