{
    "VERSE": "9:122",
    "ARABIC": "وَمَا كَانَ ٱلْمُؤْمِنُونَ لِيَنفِرُوا۟ كَآفَّةً فَلَوْلَا نَفَرَ مِن كُلِّ فِرْقَةٍ مِّنْهُمْ طَآئِفَةٌ لِّيَتَفَقَّهُوا۟ فِى ٱلدِّينِ وَلِيُنذِرُوا۟ قَوْمَهُمْ إِذَا رَجَعُوٓا۟ إِلَيْهِمْ لَعَلَّهُمْ يَحْذَرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "It is not necessary for the muminun to go out all together. If a party from each group of them were to go out so they could increase their knowledge of the deen they would be able to notify their people when they returned to them so that hopefully they would take warning!",
        "TRANSLATION_1": "It is not possible for all believers to go out (to fight). So a part of each section (of the population) should go (to fight) in order that the others may acquire understanding of law and divinity, and warn their companions on return so that they may take heed for themselves.\n",
        "TRANSLATION_2": "It was not necessary for the believers to go forth all together (to receive religious instruction), but why did not a party of them go forth that they may grow in religious understanding, and that they may warn their people when they return to them, so that they may avoid (erroneous attitudes)?\n",
        "TRANSLATION_3": "Not all believers have to become specialists in religious learning. Why do not some people from each group of believers seek to become specialists in religious learning and, after completing their studies, guide their group so that they will have fear of God.\n",
        "TRANSLATION_4": "And it is not possible for the Muslims that all of them go out; so it should be that a party from each group goes forth in order to gain knowledge in religion, and upon returning they warn their people in the hope that they may avoid.\n",
        "TRANSLATION_5": "And it is not (proper) for the believers to go out (to fight - Jihad) all together. Of every troop of them, a party only should go forth, that they may get instructions in religion, and that they may warn their people when they return to them, so that they may beware (of evil).\n",
        "TRANSLATION_6": "And it does not beseem the believers that they should go forth all together; why should not then a company from every party from among them go forth that they may apply themselves to obtain understanding in religion, and that they may warn their people when they come back to them that they may be cautious?\n",
        "TRANSLATION_7": "It is not for the believers to go forth totally; but why should not a party of every section of them go forth, to become learned in religion, and to warn their people when they return to them, that haply they may beware?\n",
        "TRANSLATION_8": "And the believers should not all go out to fight. Of every troop of them, a party only should go forth, that they (who are left behind) may gain sound knowledge in religion, and that they may warn their folk when they return to them, so that they may beware.\n",
        "TRANSLATION_9": "It is not right that all the believers should go out [in time of war] all together. Why, then, does not a party from every group come to [the Prophet] in order to acquire a deeper knowledge of religion and to warn their people, so that they can guard themselves against evil?\n",
        "TRANSLATION_10": "And it is not for the believers to march forth all together. So why should not a band from each party of them march forth so that they may gain understanding in religion and that when they come back unto them, haply they might warn their people when they come back unto them, haply they may beware!\n",
        "TRANSLATION_11": "Yet it is not for the faithful to go forth en masse. But why should not there a group from each of their sections go forth to become learned in religion, and to warn their people when they return to them, so that they may beware?\n",
        "TRANSLATION_12": "Nor should the Believers all go forth together: if a contingent from every expedition remained behind, they could devote themselves to studies in religion, and admonish the people when they return to them,- that thus they (may learn) to guard themselves (against evil).\n",
        "TRANSLATION_13": "And it is not (proper) for the believers to go out to fight (Jihad) all together. Of every troop of them, a party only should go forth, that they (who are left behind) may get instructions in (Islamic) religion, and that they may warn their people when they return to them, so that they may beware (of evil).\n",
        "TRANSLATION_14": "The believers should not go forth altogether, rather, a party from each section should go forth to become well versed in the religion, and when they return to their people warn them in order that they may beware.\n",
        "TRANSLATION_15": "It is not advisable for the believers to march out altogether. Of every division that marches out, let a group remain behind, to gain understanding of the religion, and to notify their people when they have returned to them, that they may beware.\n",
        "TRANSLATION_16": "And it is not for the believers to go forth [to battle] all at once. For there should separate from every division of them a group [remaining] to obtain understanding in the religion and warn their people when they return to them that they might be cautious.\n",
        "TRANSLATION_17": "[9:122] When the Prophet (s) was about to dispatch a raiding party — after they [certain Muslims] had been reproached for staying behind — all of them went forth, and so the following was revealed: It is not for the believers to go forth, on a raid, altogether: why should not a party, a group, of every section, of every tribe, of them go forth, while the others remain behind, so that they, those who remain behind, may become learned in religion and that they may warn their folk when they return to them, from the raid, by teaching them some of the rulings which they have come to learn, so that they may beware? of God’s punishment, by adhering to His commands and prohibitions. Ibn ‘Abbās said that this [verse] is specifically [intended] for raiding parties, while the previous one is [specifically] to prohibit any individual staying behind when the Prophet (s) sets out [on a campaign].\n",
        "TRANSLATION_18": "(And the believers should not all) it is not permissible for all the believers to (go out to fight) and leave the Prophet (pbuh) alone in Medina. (Of every troop of them, a party only should go forth) while another party should stay in Medina, (that they (who are left behind) may gain sound knowledge in religion) that they may learn the religion from the Prophet (pbuh) (and that they may warn) and that they may inform (their folk when they return to them) from their military expedition, (so that they may beware) in order to know that which they have been commanded to do and that which they have been prohibited from doing. It is also said that this verse was revealed about the Banu Asad who came to the Prophet (pbuh) in Medina after 210 being hit by drought. Their arrival caused prices in Medina to rise and all the streets became filthy with excrement. And so Allah prohibited them from this.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "9:122",
            "19:95",
            "11:38",
            "31:32",
            "11:70",
            "9:11",
            "9:12",
            "4:91",
            "13:7",
            "4:46"
        ],
        "BIBLE": [
            "writings:i%20chronicles:14:15",
            "torah:exodus:13:17",
            "prophets:i%20samuel:29:4",
            "prophets:jeremiah:37:12",
            "prophets:i%20kings:12:24",
            "prophets:jeremiah:15:19",
            "prophets:ii%20samuel:3:16",
            "prophets:ezekiel:46:9",
            "writings:nehemiah:6:10",
            "writings:ruth:1:16"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:1"
        ]
    }
}