{
    "VERSE": "9:125",
    "ARABIC": "وَأَمَّا ٱلَّذِينَ فِى قُلُوبِهِم مَّرَضٌ فَزَادَتْهُمْ رِجْسًا إِلَىٰ رِجْسِهِمْ وَمَاتُوا۟ وَهُمْ كَٰفِرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "But as for those with sickness in their hearts, it adds defilement to their defilement, and they die kuffar.",
        "TRANSLATION_1": "But it adds disbelief to disbelief for those whose hearts are filled with doubt, and they die disbelieving.\n",
        "TRANSLATION_2": "But those whose hearts are affected with the disease (of hypocrisy), every new surah added a fresh abomination to their abomination. They remained unbelievers till their death.\n",
        "TRANSLATION_3": "But to those whose hearts are sick, it adds more filth to their hearts and they die as disbelievers.\n",
        "TRANSLATION_4": "And for those in whose hearts is a disease, it has added filth to their filth, and they died as disbelievers.\n",
        "TRANSLATION_5": "But as for those in whose hearts is a disease, it will add Rijs (doubt) to their Rijs (doubt); and they die while they are disbelievers.\n",
        "TRANSLATION_6": "And as for those in whose hearts is a disease, it adds uncleanness to their uncleanness and they die while they are unbelievers.\n",
        "TRANSLATION_7": "But as for those in whose heart is sickness, them it has increased in abomination added to their abomination, and they have died while they were unbelievers.\n",
        "TRANSLATION_8": "But as for those in whose hearts is disease, it only addeth wickedness to their wickedness, and they die while they are disbelievers.\n",
        "TRANSLATION_9": "but as for those with sickness in their hearts, it adds defilement to their defilement and they die in a state of denial of truth.\n",
        "TRANSLATION_10": "And as for those in whose hearts is a disease, unto them it hath increased pollution to their pollution, and they die while they are infidels.\n",
        "TRANSLATION_11": "But as for those in whose heart is a sickness, it only adds defilement to their defilement, and they die while they are faithless.\n",
        "TRANSLATION_12": "But those in whose hearts is a disease,- it will add doubt to their doubt, and they will die in a state of Unbelief.\n",
        "TRANSLATION_13": "But as for those in whose hearts is a disease (of doubt, disbelief and hypocrisy), it will add suspicion and doubt to their suspicion, disbelief and doubt, and they die while they are disbelievers.\n",
        "TRANSLATION_14": "As for those whose hearts are diseased, they will be increased in filth added to their filth, so that they die as unbelievers.\n",
        "TRANSLATION_15": "But as for those in whose hearts is sickness: it adds disgrace to their disgrace, and they die as unbelievers.\n",
        "TRANSLATION_16": "But as for those in whose hearts is disease, it has [only] increased them in evil [in addition] to their evil. And they will have died while they are disbelievers.\n",
        "TRANSLATION_17": "[9:125] But as for those in whose hearts is sickness, a weakness of faith, it only adds abomination to their abomination, that is, [it only adds] disbelief to their disbelief, since they disbelieve in it, and they die while they were disbelievers.\n",
        "TRANSLATION_18": "(But as for those in whose hearts is disease) doubt and hypocrisy, (it only addeth wickedness to their wickedness) it only adds doubt to their doubt in what is revealed of the Qur'an, (and they die while they are disbelievers) inwardly in Muhammad (pbuh) and in the Qur'an.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "9:125",
            "33:32",
            "47:29",
            "23:60",
            "33:60",
            "33:12",
            "24:50",
            "47:20",
            "30:15",
            "2:10"
        ],
        "BIBLE": [
            "writings:proverbs:26:25",
            "writings:lamentations:1:22",
            "writings:proverbs:8:7",
            "writings:ezra:9:11",
            "writings:psalms:141:4",
            "writings:proverbs:21:27",
            "prophets:jeremiah:16:18",
            "prophets:jeremiah:4:18",
            "torah:genesis:6:5",
            "writings:proverbs:11:20"
        ]
    }
}