{
    "VERSE": "9:126",
    "ARABIC": "أَوَلَا يَرَوْنَ أَنَّهُمْ يُفْتَنُونَ فِى كُلِّ عَامٍ مَّرَّةً أَوْ مَرَّتَيْنِ ثُمَّ لَا يَتُوبُونَ وَلَا هُمْ يَذَّكَّرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Do they not see that they are tried once or twice in every year? But still they do not turn back. They do not pay heed.",
        "TRANSLATION_1": "Do they not know that they are tried every year once or twice? Even then they do not repent and take heed.\n",
        "TRANSLATION_2": "Do they not see that they are tried every year once or twice? Yet they neither repent nor take heed.\n",
        "TRANSLATION_3": "Do they not realize that God tests them once or twice a year but, nevertheless, they do not repent and give it proper thought?\n",
        "TRANSLATION_4": "Do they not observe that they are tested once or twice every year? Yet they do not repent, nor do they heed advice!\n",
        "TRANSLATION_5": "See they not that they are put in trial once or twice every year Yet, they turn not in repentance, nor do they learn a lesson (from it).\n",
        "TRANSLATION_6": "Do they not see that they are tried once or twice in every year, yet they do not turn (to Allah) nor do they mind.\n",
        "TRANSLATION_7": "Do they not see that they are tried every year once or twice? Yet still they do not repent, nor do they remember.\n",
        "TRANSLATION_8": "See they not that they are tested once or twice in every year? Still they turn not in repentance, neither pay they heed.\n",
        "TRANSLATION_9": "Do they not see that they are tried every year once or twice? Yet they do not repent, nor would they be admonished.\n",
        "TRANSLATION_10": "Behold they not that they are tried every year once or twice? Yet they repent not, nor are they admonished.\n",
        "TRANSLATION_11": "Do they not see that they are tried once or twice every year? Yet they neither repent, nor do they take admonition.\n",
        "TRANSLATION_12": "See they not that they are tried every year once or twice? Yet they turn not in repentance, and they take no heed.\n",
        "TRANSLATION_13": "See they not that they are tried once or twice every year (with different kinds of calamities, disease, famine, etc.)? Yet, they turn not in repentance, nor do they learn a lesson (from it).\n",
        "TRANSLATION_14": "Do they not see how once or twice every year they are tried? Yet still they neither repent nor remember.\n",
        "TRANSLATION_15": "Do they not see that they are tested once or twice every year? Yet they do not repent, and they do not learn.\n",
        "TRANSLATION_16": "Do they not see that they are tried every year once or twice but then they do not repent nor do they remember?\n",
        "TRANSLATION_17": "[9:126] Do they not see, that is, the hypocrites ([in which case] read a-wa-lā yarawna; or if read a-wa-lā tarawna, ‘do you, O believers, not see’) that they are tested, afflicted, every year once or twice?, with drought and diseases. Still they do not repent, of their hypocrisy, nor do they remember, [nor] do they heed admonition.\n",
        "TRANSLATION_18": "(See they not) i.e. the hypocrites (that they are tested) that they are tried by the revelation of their evil scheming and betrayal; it is also said that they are tried by the breaking of their covenants (once or twice in every year? Still they turn not in repentance) for their deeds and for the breaking of their treaties, (neither pay they heed) nor do they accept any admonition.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "9:126",
            "8:56",
            "26:225",
            "37:8",
            "36:79",
            "54:3",
            "16:111",
            "40:27",
            "20:89",
            "46:19"
        ],
        "BIBLE": [
            "prophets:jonah:3:10",
            "prophets:jeremiah:18:8",
            "torah:deuteronomy:23:6",
            "prophets:jonah:3:9",
            "prophets:joel:2:14",
            "prophets:zephaniah:2:7",
            "torah:deuteronomy:11:16",
            "torah:deuteronomy:5:29",
            "writings:i%20chronicles:29:17",
            "prophets:ezekiel:33:9"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:7"
        ]
    }
}