{
    "VERSE": "9:128",
    "ARABIC": "لَقَدْ جَآءَكُمْ رَسُولٌ مِّنْ أَنفُسِكُمْ عَزِيزٌ عَلَيْهِ مَا عَنِتُّمْ حَرِيصٌ عَلَيْكُم بِٱلْمُؤْمِنِينَ رَءُوفٌ رَّحِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "A Messenger has come to you from among yourselves. Your suffering is distressing to him; he is deeply concerned for you; he is gentle and merciful to the muminun.",
        "TRANSLATION_1": "To you has come an Apostle from among you. Any sorrow that befalls you weighs upon him; He is eager for your happiness, full of concern for the faithful, compassionate and kind.\n",
        "TRANSLATION_2": "There has come to you a Messenger of Allah from among yourselves, who is distressed by the losses you sustain, who is ardently desirous of your welfare and is tender and merciful to those that believe.\n",
        "TRANSLATION_3": "A Messenger from your own people has come to you. Your destruction and suffering is extremely grievous to him. He really cares about you and is very compassionate and merciful to the believers.\n",
        "TRANSLATION_4": "Indeed there has come to you a Noble Messenger from among you – your falling into hardship aggrieves him, most concerned for your well being, for the Muslims most compassionate, most merciful.\n",
        "TRANSLATION_5": "Verily, there has come unto you a Messenger from among yourselves. It grieves him that you should receive any injury or difficulty. He is eager for you; for the believers [he is] full of pity, kind, and merciful.\n",
        "TRANSLATION_6": "Certainly an Apostle has come to you from among yourselves; grievous to him is your falling into distress, excessively solicitous respecting you; to the believers (he is) compassionate,\n",
        "TRANSLATION_7": "Now there has come to you a Messenger from among yourselves; grievous to him is your suffering; anxious is he over you, gentle to the believers, compassionate.\n",
        "TRANSLATION_8": "There hath come unto you a messenger, (one) of yourselves, unto whom aught that ye are overburdened is grievous, full of concern for you, for the believers full of pity, merciful.\n",
        "TRANSLATION_9": "There has come to you a Messenger of your own. Your suffering distresses him: he is deeply concerned for your welfare and full of kindness and mercy towards the believers.\n",
        "TRANSLATION_10": "Assuredly there hath come unto you an apostle from amongst yourselves: heavy upon him is that which harasseth you, solicitous for you, and with the believers tender and merciful.\n",
        "TRANSLATION_11": "There has certainly come to you an apostle from among yourselves. Grievous to him is your distress; he has deep concern for you, and is most kind and merciful to the faithful.\n",
        "TRANSLATION_12": "Now hath come unto you a Messenger from amongst yourselves: it grieves him that ye should perish: ardently anxious is he over you: to the Believers is he most kind and merciful.\n",
        "TRANSLATION_13": "Verily, there has come unto you a Messenger (Muhammad SAW) from amongst yourselves (i.e. whom you know well). It grieves him that you should receive any injury or difficulty. He (Muhammad SAW) is anxious over you (to be rightly guided, to repent to Allah, and beg Him to pardon and forgive your sins, in order that you may enter Paradise and be saved from the punishment of the Hell-fire), for the believers (he SAW is) full of pity, kind, and merciful.\n",
        "TRANSLATION_14": "Indeed, there has come to you a Messenger from your own, he grieves for your suffering, and is anxious about you, and is gentle, merciful to the believers.\n",
        "TRANSLATION_15": "There has come to you a messenger from among yourselves, concerned over your suffering, anxious over you. Towards the believers, he is compassionate and merciful.\n",
        "TRANSLATION_16": "There has certainly come to you a Messenger from among yourselves. Grievous to him is what you suffer; [he is] concerned over you and to the believers is kind and merciful.\n",
        "TRANSLATION_17": "[9:128] Verily there has come to you a messenger from among yourselves, that is, one of you — Muhammad (s) — for whom it is grievous, hard, that you should suffer, that is, your suffering, your experiencing hardship and encountering harm [is hard on him]; who is full of concern for you, that you should be rightly guided; to the believers full of pity, profoundly compassionate, merciful, desiring good for them.\n",
        "TRANSLATION_18": "(There hath come unto you) people of Mecca (a messenger, (one) of yourselves) an Arab and Hashimite like yourselves, (and it grieves him) it is hard on him (unto whom aught) of sins (that ye are overburdened is grievous, full of concern for you) for your faith, (for the believers) for all the believers he is (full of pity, merciful).\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "9:128",
            "26:217",
            "30:5",
            "36:5",
            "16:7",
            "4:64",
            "44:42",
            "9:117",
            "2:143",
            "16:47"
        ],
        "BIBLE": [
            "prophets:ii%20kings:7:4",
            "prophets:jonah:4:2",
            "writings:lamentations:4:6",
            "writings:esther:8:6",
            "writings:ii%20chronicles:21:19",
            "prophets:ii%20samuel:24:14",
            "prophets:i%20samuel:11:7",
            "torah:leviticus:9:24",
            "writings:job:1:16",
            "prophets:isaiah:30:6"
        ]
    }
}