{
    "VERSE": "9:129",
    "ARABIC": "فَإِن تَوَلَّوْا۟ فَقُلْ حَسْبِىَ ٱللَّهُ لَآ إِلَٰهَ إِلَّا هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ ٱلْعَرْشِ ٱلْعَظِيمِ",
    "ENGLISH": {
        "TRANSLATION_0": "But if they turn away, say, 'Allah is enough for me. There is no god but Him. I have put my trust in Him. He is the Lord of the Mighty Throne.'",
        "TRANSLATION_1": "So, if they turn away, say to them: \"God is sufficient for me. There is no God but He; I depend on Him alone, the Lord of the glorious Throne.\"\n",
        "TRANSLATION_2": "Yet, if they should turn away, then tell them: \"Allah is sufficient for me; there is no god but He. In Him I have put my trust. He is the Lord of the Mighty Throne.\"\n",
        "TRANSLATION_3": "(Muhammad), if they turn away from you, say, \"God is Sufficient (support) for me. There is no God but He. In Him do I trust and He is the Owner of the Great Throne.\"\n",
        "TRANSLATION_4": "Then if they turn away, say (O dear Prophet Mohammed – peace and blessings be upon him), “Allah suffices me; there is no worship except for Him; only Him have I trusted, and He is the Lord Of The Great Throne.”\n",
        "TRANSLATION_5": "But if they turn away, say: \"Allah is sufficient for me. There is no God but He, in Him I put my trust and He is the Lord of the Mighty Throne.\"\n",
        "TRANSLATION_6": "But if they turn back, say: Allah is sufficient for me, there is no god but He; on Him do I rely, and He is the Lord of mighty power.\n",
        "TRANSLATION_7": "So if they turn their backs, say: 'God is enough for me. There is no god but He. In Him I have put my trust. He is the Lord of the Mighty Throne.'\n",
        "TRANSLATION_8": "Now, if they turn away (O Muhammad) say: Allah sufficeth me. There is no Allah save Him. In Him have I put my trust, and He is Lord of the Tremendous Throne.\n",
        "TRANSLATION_9": "But if they turn away, say, \"God suffices me: there is no deity but He: in Him I have put my trust. He is the Lord of the Glorious Throne.\"\n",
        "TRANSLATION_10": "If, then, they turn away, say thou: sufficing unto me is Allah, there is no god but he, on Him I rely and He is the Lord of Mighty Throne.\n",
        "TRANSLATION_11": "But if they turn their backs [on you], say, ‘Allah is sufficient for me. There is no god except Him. In Him I have put my trust and He is the Lord of the Great Throne.’\n",
        "TRANSLATION_12": "But if they turn away, Say: \"Allah sufficeth me: there is no god but He: On Him is my trust,- He the Lord of the Throne (of Glory) Supreme!\"\n",
        "TRANSLATION_13": "But if they turn away, say (O Muhammad SAW): \"Allah is sufficient for me. La ilaha illa Huwa (none has the right to be worshipped but He), in Him I put my trust and He is the Lord of the Mighty Throne.\n",
        "TRANSLATION_14": "Therefore, if they turn away, say: 'Allah is sufficient for me. There is no god except He. In Him I have put my trust. He is the Lord of the Mighty Throne'\n",
        "TRANSLATION_15": "If they turn away, say, “God is enough for me; there is no god except He; in Him I have put my trust; He is the Lord of the Sublime Throne.”\n",
        "TRANSLATION_16": "But if they turn away, [O Muhammad], say, \"Sufficient for me is Allah; there is no deity except Him. On Him I have relied, and He is the Lord of the Great Throne.\"\n",
        "TRANSLATION_17": "[9:129] So if they turn away, [refraining] from believing in you, say: ‘God suffices me. There is no god except Him. Upon Him I rely, in Him have I put my trust, and in none other, and He is the Lord of the Tremendous Throne’ (al-‘arsh al-azīm), the kursī, which is singled out for mention because it is the greatest of all things created. Al-Hākim reported in al-Mustadrak [by way of an isnād] from Ubayy b. Ka‘b that he [Ubayy] said: ‘The last verse to be revealed was [from], Verily there has come to you a messenger… to the end of the sūra’ [sc. Q. 9:128-129]. Meccan, except for verses 40, 94, 95 and 96, which are Medinese; it consists of 109 or 110 verses, and was revealed after [sūrat] al-Isrā’.\n",
        "TRANSLATION_18": "(Now, if they turn away) from faith, repentance and that which you have told them ((0 Muhammad) say: Allah sufficeth me) my trust is in Allah. (There is no God save Him) there is no protector or helper except Him. (In Him have I put my trust) I put my trust in and rely on Him, (and He is Lord of the Tremendous Throne)'. And of the surah in which Jonah is mentioned, which is Meccan in its entirety-except for the 40th verse (And of them is he who believes therein, and of them is he who believes not therein, and your Lord is best aware 211 of the corrupters) which is Medinan, being revealed about the Jews-and it consists of 109 verses, 1,802 words and 6,567 letters: Surah 10: Jonah (Yunus) And of the surah in which Jonah is mentioned, which is Meccan in its entirety— except for the 40 verse (And of them is he who believes therein, and of them is he who believes not therein, and your Lord is best aware of the corrupters) which is Medinan, being revealed about the Jews— and it consists of 109 verses, 1,802 words and 6,567 letters:\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "9:129",
            "27:26",
            "21:22",
            "23:116",
            "69:33",
            "11:34",
            "33:39",
            "23:86",
            "18:38",
            "10:72"
        ],
        "BIBLE": [
            "prophets:isaiah:42:17",
            "prophets:i%20samuel:15:30",
            "prophets:joshua:7:8",
            "prophets:judges:6:14",
            "prophets:jeremiah:4:10",
            "writings:psalms:41:4",
            "torah:exodus:32:8",
            "prophets:jeremiah:2:27",
            "prophets:joel:2:14",
            "writings:ii%20chronicles:29:6"
        ]
    }
}