{
    "VERSE": "9:19",
    "ARABIC": "أَجَعَلْتُمْ سِقَايَةَ ٱلْحَآجِّ وَعِمَارَةَ ٱلْمَسْجِدِ ٱلْحَرَامِ كَمَنْ ءَامَنَ بِٱللَّهِ وَٱلْيَوْمِ ٱلْءَاخِرِ وَجَٰهَدَ فِى سَبِيلِ ٱللَّهِ لَا يَسْتَوُۥنَ عِندَ ٱللَّهِ وَٱللَّهُ لَا يَهْدِى ٱلْقَوْمَ ٱلظَّٰلِمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Do you make the giving of water to the pilgrims and looking after the Masjid al-Haram the same as having iman in Allah and the Last Day and doing jihad in the Way of Allah? They are not equal in the sight of Allah. Allah does not guide wrongdoing people.",
        "TRANSLATION_1": "Do you think that giving a drink of water to the pilgrims and going on a visit to the Sacred Mosque, is the same as believing in God and the Last Day, and striving in the cause of God? In the eyes of God it is not the same; and God does not show the unrighteous the way.\n",
        "TRANSLATION_2": "Do you consider providing water to the Pilgrims and tending the Sacred Mosque equal in worth to believing in Allah and the Last Day and striving in the cause of Allah? The two are not equal with Allah. Allah does not direct the wrong-doing folk to the Right Way.\n",
        "TRANSLATION_3": "Do you (pagans), because you served water to the pilgrims and constructed the Sacred Mosque, consider yourselves equal to those who have believed in God, the Day of Judgment, and have fought for the cause of God? In the sight of God you (pagans) are not equal to the believers. God does not guide the unjust.\n",
        "TRANSLATION_4": "So have they taken the quenching of the pilgrims’ thirst and servicing of the Sacred Mosque as equal (in merit) to him who accepted faith in Allah and the Last Day, and fought in Allah’s way? They are not equal before Allah; and Allah does not guide the unjust.\n",
        "TRANSLATION_5": "Do you consider the providing of drinking water to the pilgrims and the maintenance of Al-Masjid Al-Haram as equal to the worth of those who believe in Allah and the Last Day, and strive hard and fight in the cause of Allah They are not equal before Allah. And Allah guides not those people who are the wrongdoers.\n",
        "TRANSLATION_6": "What! do you make (one who undertakes) the giving of drink to the pilgrims and the guarding of the Sacred Mosque like him who believes in Allah and the latter day and strives hard in Allah's way? They are not equal with Allah; and Allah does not guide the unjust people.\n",
        "TRANSLATION_7": "Do you reckon the giving of water to pilgrims and the inhabiting of the Holy Mosque as the same as one who believes in God and the Last Day and struggles in the way of God? Not equal are they in God's sight; and God guides not the people of the evildoers.\n",
        "TRANSLATION_8": "Count ye the slaking of a pilgrim's thirst and tendance of the Inviolable Place of Worship as (equal to the worth of) him who believeth in Allah and the Last Day, and striveth in the way of Allah? They are not equal in the sight of Allah. Allah guideth not wrongdoing folk.\n",
        "TRANSLATION_9": "Do you regard giving water to pilgrims and tending the Sacred Mosque as being equal to the deeds of those who believe in God and the Last Day and who strive in God's path? They are not equal in the sight of God. God does not guide such unjust people.\n",
        "TRANSLATION_10": "Make ye the giving of drinks unto the pilgrims and the tendance of the Sacred Mosque like unto the conduct of one who believeth in Allah and the Last Day and striveth hard in the way of Allah! Equal they are not with Allah, and Allah guideth not the wrong-doing people.\n",
        "TRANSLATION_11": "Do you regard the providing of water to Hajj pilgrims and the maintenance of the Holy Mosque as similar [in worth] to someone who has faith in Allah and [believes in] the Last Day and wages jihad in the way of Allah? They are not equal with Allah, and Allah does not guide the wrongdoing lot.\n",
        "TRANSLATION_12": "Do ye make the giving of drink to pilgrims, or the maintenance of the Sacred Mosque, equal to (the pious service of) those who believe in Allah and the Last Day, and strive with might and main in the cause of Allah? They are not comparable in the sight of Allah: and Allah guides not those who do wrong.\n",
        "TRANSLATION_13": "Do you consider the providing of drinking water to the pilgrims and the maintenance of Al-Masjid-al-Haram (at Makkah) as equal to the worth of those who believe in Allah and the Last Day, and strive hard and fight in the Cause of Allah? They are not equal before Allah. And Allah guides not those people who are the Zalimun (polytheists and wrong-doers).\n",
        "TRANSLATION_14": "Do you consider giving drink to the pilgrims and inhabiting the Sacred Mosque is the same as one who believes in Allah and the Last Day, and struggles in the Way of Allah? These are not held equal by Allah. Allah does not guide the harmdoers.\n",
        "TRANSLATION_15": "Do you consider giving water to pilgrims and maintaining the Sacred Mosque the same as believing in God and the Last Day and striving in God’s path? They are not equal in God’s sight. God does not guide the unjust people.\n",
        "TRANSLATION_16": "Have you made the providing of water for the pilgrim and the maintenance of al-Masjid al-Haram equal to [the deeds of] one who believes in Allah and the Last Day and strives in the cause of Allah? They are not equal in the sight of Allah. And Allah does not guide the wrongdoing people.\n",
        "TRANSLATION_17": "[9:19] Do you reckon the giving of water to pilgrims and the attendance of the Sacred Mosque, that is, [do you reckon] those who do such things, to be the same as he who believes in God and the Last Day and struggles in the way of God? They are not equal, in merit, in God’s sight; and God guides not the evildoing, the disbelieving, folk: this was revealed to refute those who claimed this, such as al-‘Abbās and others.\n",
        "TRANSLATION_18": "The following was revealed about a man among the idolaters who was taken prisoner on the Day of Badr. He boasted to 'AN or to another believer who took part in the battle of Badr, saying: \"we give water to the pilgrims and tend to the Sacred House, and do this and that, etc.\", so Allah, Exalted is He, said: (Count ye the slaking of a pilgrim's thirst) did you say that giving water to the pilgrim (and tendance of the Inviolable Place of Worship as (equal to the worth of him) who believeth in Allah) is like the faith of he who believes in Allah, i.e. the believer who took part in the battle of Badr (and the Last Day) and believes in resurrection after death, (and striveth in the way of Allah) and strives in obedience of Allah on the Day of Badr? (They are not equal in the sight of Allah) as far as obedience and reward are concerned. (Allah guideth not) leads not to His religion (wrong-doing folk) the idolaters, those who do not deserve it. 195\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "9:19",
            "2:62",
            "2:217",
            "27:47",
            "16:107",
            "22:25",
            "2:8",
            "11:19",
            "7:45",
            "9:99"
        ],
        "BIBLE": [
            "torah:numbers:8:19",
            "torah:numbers:18:6",
            "torah:genesis:3:6",
            "torah:leviticus:10:17",
            "prophets:judges:3:6",
            "writings:nehemiah:8:12",
            "prophets:judges:14:9",
            "prophets:ezekiel:18:13",
            "torah:genesis:35:3",
            "torah:genesis:21:19"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:8"
        ]
    }
}