{
    "VERSE": "9:21",
    "ARABIC": "يُبَشِّرُهُمْ رَبُّهُم بِرَحْمَةٍ مِّنْهُ وَرِضْوَٰنٍ وَجَنَّٰتٍ لَّهُمْ فِيهَا نَعِيمٌ مُّقِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "Their Lord gives them the good news of His mercy and good pleasure and Gardens where they will enjoy everlasting delight,",
        "TRANSLATION_1": "Their Lord announces to them news of His mercy, acceptance, and gardens of lasting bliss\n",
        "TRANSLATION_2": "Their Lord gives them glad tidings of mercy from Him and of His good pleasure. For them await Gardens of eternal bliss.\n",
        "TRANSLATION_3": "Their Lord will give the glad news of His granting mercy to them, His pleasure, and His admitting them to a Paradise full of everlasting bounties wherein they will live forever.\n",
        "TRANSLATION_4": "Their Lord gives them the glad tidings of His mercy and His pleasure, and the Gardens in which are everlasting favours for them.\n",
        "TRANSLATION_5": "Their Lord gives them glad tidings of mercy from Him, and His being pleased (with them), and of Gardens (Paradise) for them wherein are everlasting delights.\n",
        "TRANSLATION_6": "Their Lord gives them good news of mercy from Himself and (His) good pleasure and gardens, wherein lasting blessings shall be theirs;\n",
        "TRANSLATION_7": "their Lord gives them good tidings of mercy from Him and good pleasure; for them await gardens wherein is lasting bliss,\n",
        "TRANSLATION_8": "Their Lord giveth them good tidings of mercy from Him, and acceptance, and Gardens where enduring pleasure will be theirs;\n",
        "TRANSLATION_9": "their Lord gives them the good news of His mercy and His pleasure and gardens of eternal bliss.\n",
        "TRANSLATION_10": "Their Lord giveth them glad tidings of a mercy from Him and of goodwill and of the Gardens wherein theirs will be a delight lasting:\n",
        "TRANSLATION_11": "Their Lord gives them the good news of His mercy and [His] pleasure, and for them there will be gardens with lasting bliss,\n",
        "TRANSLATION_12": "Their Lord doth give them glad tidings of a Mercy from Himself, of His good pleasure, and of gardens for them, wherein are delights that endure:\n",
        "TRANSLATION_13": "Their Lord gives them glad tidings of a Mercy from Him, and that He is pleased (with them), and of Gardens (Paradise) for them wherein are everlasting delights.\n",
        "TRANSLATION_14": "Their Lord gives them glad tidings of mercy from Him, and pleasure; for them await gardens in which there is eternal bliss.\n",
        "TRANSLATION_15": "Their Lord announces to them good news of mercy from Him, and acceptance, and gardens wherein they will have lasting bliss.\n",
        "TRANSLATION_16": "Their Lord gives them good tidings of mercy from Him and approval and of gardens for them wherein is enduring pleasure.\n",
        "TRANSLATION_17": "[9:21] Their Lord gives them good tidings of mercy from Him and beatitude; for them shall be gardens wherein is enduring, everlasting, bliss,\n",
        "TRANSLATION_18": "(Their Lord giveth them good tidings of mercy) of safety (from Him) from His punishment, (and acceptance) their Lord's good pleasure with them, (and Gardens where enduring pleasure will be theirs) unending and continuous pleasure;\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "9:21",
            "10:9",
            "55:46",
            "26:85",
            "27:19",
            "17:28",
            "68:34",
            "31:8",
            "15:56",
            "93:11"
        ],
        "BIBLE": [
            "writings:ezra:3:11",
            "torah:deuteronomy:16:17",
            "writings:psalms:136:21",
            "prophets:ezekiel:20:25",
            "torah:numbers:18:29",
            "torah:deuteronomy:8:10",
            "writings:ii%20chronicles:7:3",
            "prophets:joshua:23:15",
            "torah:leviticus:19:24",
            "torah:genesis:9:3"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:1:9"
        ]
    }
}