{
    "VERSE": "9:22",
    "ARABIC": "خَٰلِدِينَ فِيهَآ أَبَدًا إِنَّ ٱللَّهَ عِندَهُۥٓ أَجْرٌ عَظِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "remaining in them timelessly, for ever and ever. Truly there is an immense reward with Allah.",
        "TRANSLATION_1": "Which they will enjoy for ever. Indeed God has greater rewards with Him.\n",
        "TRANSLATION_2": "Therein they shall abide forever. Surely with Allah a mighty reward awaits them.\n",
        "TRANSLATION_3": "The reward that God will bestow on His servants is the greatest.\n",
        "TRANSLATION_4": "They will abide in it for ever and ever; indeed with Allah is the great reward.\n",
        "TRANSLATION_5": "They will dwell therein forever. Verily, with Allah is a great reward.\n",
        "TRANSLATION_6": "Abiding therein for ever; surely Allah has a Mighty reward with Him.\n",
        "TRANSLATION_7": "therein to dwell forever and ever; surely with God is a mighty wage.\n",
        "TRANSLATION_8": "There they will abide for ever. Lo! with Allah there is immense reward.\n",
        "TRANSLATION_9": "There they will dwell for ever. Truly there is an immense reward with God.\n",
        "TRANSLATION_10": "As abiders therein for evermore. Verily Allah: with Him is a hire mighty.\n",
        "TRANSLATION_11": "to remain in them forever. With Allah indeed is a great reward.\n",
        "TRANSLATION_12": "They will dwell therein for ever. Verily in Allah's presence is a reward, the greatest (of all).\n",
        "TRANSLATION_13": "They will dwell therein forever. Verily, with Allah is a great reward.\n",
        "TRANSLATION_14": "where they shall live for ever. The wage with Allah is great indeed.\n",
        "TRANSLATION_15": "Abiding therein forever. With God is a great reward.\n",
        "TRANSLATION_16": "[They will be] abiding therein forever. Indeed, Allah has with Him a great reward.\n",
        "TRANSLATION_17": "[9:22] therein they shall abide forever (khālidīna is an implied circumstance). Surely with God is a tremendous reward.\n",
        "TRANSLATION_18": "(There they will abide for ever) never to die or leave. (Lo! with Allah there is immense reward) an abundant reward to the person who believes in Him.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "9:22",
            "64:15",
            "8:28",
            "49:3",
            "69:33",
            "5:9",
            "4:40",
            "33:29",
            "33:35",
            "4:146"
        ],
        "BIBLE": [
            "writings:psalms:69:37",
            "writings:psalms:140:14",
            "torah:deuteronomy:10:17",
            "prophets:ezekiel:35:6",
            "writings:psalms:19:12",
            "torah:genesis:9:27",
            "writings:psalms:52:11",
            "prophets:i%20kings:20:23",
            "prophets:isaiah:40:10",
            "torah:deuteronomy:26:1"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:1:14",
            "Sefer%20Yetzirah:1:12",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:4"
        ]
    }
}