{
    "VERSE": "9:27",
    "ARABIC": "ثُمَّ يَتُوبُ ٱللَّهُ مِنۢ بَعْدِ ذَٰلِكَ عَلَىٰ مَن يَشَآءُ وَٱللَّهُ غَفُورٌ رَّحِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "Then after that Allah will turn to anyone He wills. Allah is Ever-Forgiving, Most Merciful.",
        "TRANSLATION_1": "Yet God may turn (even) after this to whomsoever He please, for God is compassionate and kind.\n",
        "TRANSLATION_2": "Then (after so chastising the unbelievers), Allah enables, whomsoever He wills, to repent. Allah is All-Forgiving, All-Merciful.\n",
        "TRANSLATION_3": "After that occasion God forgave those whom He wanted. God is All-knowing and All-merciful.\n",
        "TRANSLATION_4": "Then afterwards Allah will give repentance to whomever He wills; and Allah is Oft Forgiving, Most Merciful.\n",
        "TRANSLATION_5": "Then after that Allah will accept the repentance of whom He wills. And Allah is Oft-Forgiving, Most Merciful.\n",
        "TRANSLATION_6": "Then will Allah after this turn (mercifully) to whom He pleases, and Allah is Forgiving, Merciful.\n",
        "TRANSLATION_7": "then God thereafter turns towards whom He will; God is All-forgiving, All-compassionate.\n",
        "TRANSLATION_8": "Then afterward Allah will relent toward whom He will; for Allah is Forgiving, Merciful.\n",
        "TRANSLATION_9": "then after that, God will turn in His mercy to whom He wills: God is forgiving and merciful.\n",
        "TRANSLATION_10": "Then Allah will, thereafter, relent toward whomsoever He liketh, and Allah is Forgiving, Merciful.\n",
        "TRANSLATION_11": "Then Allah shall turn clemently after that to whomever He wishes. Indeed Allah is all-forgiving, all-merciful.\n",
        "TRANSLATION_12": "Again will Allah, after this, turn (in mercy) to whom He will: for Allah is Oft-forgiving, Most Merciful.\n",
        "TRANSLATION_13": "Then after that Allah will accept the repentance of whom He will. And Allah is Oft-Forgiving, Most Merciful.\n",
        "TRANSLATION_14": "Yet thereafter, Allah turns to whom He will. He is the Forgiving, the Most Merciful.\n",
        "TRANSLATION_15": "Then, after that, God will relent towards whomever He wills. God is Forgiving and Merciful.\n",
        "TRANSLATION_16": "Then Allah will accept repentance after that for whom He wills; and Allah is Forgiving and Merciful.\n",
        "TRANSLATION_17": "[9:27] Then afterwards God will relent to whom He will, from among them, by [their acceptance of] Islam. And God is Forgiving, Merciful.\n",
        "TRANSLATION_18": "(Then afterward) after fighting and the defeat (Allah will relent towards whom He will) towards those who repent amongst them; (for Allah is Forgiving, Merciful) towards him who repents.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "9:27",
            "3:89",
            "24:5",
            "5:39",
            "33:73",
            "4:96",
            "2:64",
            "4:106",
            "8:69",
            "2:218"
        ],
        "BIBLE": [
            "prophets:joel:2:13",
            "prophets:jeremiah:31:18",
            "prophets:joel:2:14",
            "writings:psalms:66:20",
            "prophets:jonah:3:9",
            "torah:deuteronomy:30:3",
            "torah:deuteronomy:13:18",
            "writings:psalms:69:17",
            "prophets:ezekiel:33:11",
            "writings:lamentations:5:21"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:4",
            
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:5:2"
        ]
    }
}