{
    "VERSE": "9:29",
    "ARABIC": "قَٰتِلُوا۟ ٱلَّذِينَ لَا يُؤْمِنُونَ بِٱللَّهِ وَلَا بِٱلْيَوْمِ ٱلْءَاخِرِ وَلَا يُحَرِّمُونَ مَا حَرَّمَ ٱللَّهُ وَرَسُولُهُۥ وَلَا يَدِينُونَ دِينَ ٱلْحَقِّ مِنَ ٱلَّذِينَ أُوتُوا۟ ٱلْكِتَٰبَ حَتَّىٰ يُعْطُوا۟ ٱلْجِزْيَةَ عَن يَدٍ وَهُمْ صَٰغِرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Fight those of the people who were given the Book who do not have iman in Allah and the Last Day and who do not make haram what Allah and His Messenger have made haram and do not take as their deen the deen of Truth, until they pay the jizya with their own hands in a state of complete abasement.",
        "TRANSLATION_1": "Fight those people of the Book who do not believe in God and the Last Day, who do not prohibit what God and His Apostle have forbidden, nor accept divine law, until all of them pay protective tax in submission.\n",
        "TRANSLATION_2": "Those who do not believe in Allah and the Last Day - even though they were given the scriptures, and who do not hold as unlawful that which Allah and His Messenger have declared to be unlawful, and who do not follow the true religion - fight against them until they pay tribute out of their hand and are utterly subdued.\n",
        "TRANSLATION_3": "Fight against those People of the Book who have no faith in God or the Day of Judgment, who do not consider unlawful what God and His Messenger have made unlawful, and who do not believe in the true religion, until they humbly pay tax with their own hands.\n",
        "TRANSLATION_4": "Fight against the People given the Book(s) who do not accept faith in Allah and the Last Day, and who do not treat as forbidden what is forbidden by Allah and by His Noble Messenger, and who do not follow the true religion, until they pay the tariff with their own hands with humiliation.\n",
        "TRANSLATION_5": "Fight against those who believe not in Allah, nor in the Last Day, nor forbid that which has been forbidden by Allah and His Messenger, and those who acknowledge not the religion of truth among the People of the Scripture, until they pay the Jizyah with willing submission, and feel themselves subdued.\n",
        "TRANSLATION_6": "Fight those who do not believe in Allah, nor in the latter day, nor do they prohibit what Allah and His Apostle have prohibited, nor follow the religion of truth, out of those who have been given the Book, until they pay the tax in acknowledgment of superiority and they are in a state of subjection.\n",
        "TRANSLATION_7": "Fight those who believe not in God and the Last Day and do not forbid what God and His Messenger have forbidden -- such men as practise not the religion of truth, being of those who have been given the Book -- until they pay the tribute out of hand and have been humbled.\n",
        "TRANSLATION_8": "Fight against such of those who have been given the Scripture as believe not in Allah nor the Last Day, and forbid not that which Allah hath forbidden by His messenger, and follow not the Religion of Truth, until they pay the tribute readily, being brought low.\n",
        "TRANSLATION_9": "Fight those from among the People of the Book who believe neither in God, nor in the Last Day, nor hold as unlawful what God and His Messenger have declared to be unlawful, nor follow the true religion, until they pay the tax willingly and agree to submit.\n",
        "TRANSLATION_10": "Fight against those who believe not in Allah nor in the Last Day and hold not that forbidden which Allah and His apostle have forbidden and observe not the true religion, of those who have been vouchsafed the Book, until they pay the tribute out of hand and they are subdued.\n",
        "TRANSLATION_11": "Fight those who do not have faith in Allah nor [believe] in the Last Day, nor forbid what Allah and His Apostle have forbidden, nor practise the true religion, from among those who were given the Book, until they pay the tribute out of hand, degraded.\n",
        "TRANSLATION_12": "Fight those who believe not in Allah nor the Last Day, nor hold that forbidden which hath been forbidden by Allah and His Messenger, nor acknowledge the religion of Truth, (even if they are) of the People of the Book, until they pay the Jizya with willing submission, and feel themselves subdued.\n",
        "TRANSLATION_13": "Fight against those who (1) believe not in Allah, (2) nor in the Last Day, (3) nor forbid that which has been forbidden by Allah and His Messenger (4) and those who acknowledge not the religion of truth (i.e. Islam) among the people of the Scripture (Jews and Christians), until they pay the Jizyah with willing submission, and feel themselves subdued.\n",
        "TRANSLATION_14": "Fight those who neither believe in Allah nor the Last Day, who do not forbid what Allah and His Messenger have forbidden, and do not embrace the religion of the truth, being among those who have been given the Book (Bible and the Torah), until they pay tribute out of hand and have been humiliated.\n",
        "TRANSLATION_15": "Fight those who do not believe in God, nor in the Last Day, nor forbid what God and His Messenger have forbidden, nor abide by the religion of truth—from among those who received the Scripture—until they pay the due tax, willingly or unwillingly.\n",
        "TRANSLATION_16": "Fight those who do not believe in Allah or in the Last Day and who do not consider unlawful what Allah and His Messenger have made unlawful and who do not adopt the religion of truth from those who were given the Scripture - [fight] until they give the jizyah willingly while they are humbled.\n",
        "TRANSLATION_17": "[9:29] Fight those who do not believe in God, nor in the Last Day, for, otherwise, they would have believed in the Prophet (s), and who do not forbid what God and His Messenger have forbidden, such as wine, nor do they practise the religion of truth, the firm one, the one that abrogated other religions, namely, the religion of Islam — from among of those who (min, ‘from’, explains [the previous] alladhīna, ‘those who’) have been given the Scripture, namely, the Jews and the Christians, until they pay the jizya tribute, the annual tax imposed them, readily (‘an yadin is a circumstantial qualifier, meaning, ‘compliantly’, or ‘by their own hands’, not delegating it [to others to pay]), being subdued, [being made] submissive and compliant to the authority of Islam.\n",
        "TRANSLATION_18": "(Fight against such of those who have been given the Scripture) the Jews and Christians (as believe not in Allah nor the Last Day) nor in the bliss of Paradise, (and forbid not) in the Torah (that which Allah hath forbidden by His messenger, and follow not the religion of truth) do not submit themselves to Allah through confession of Allah's divine Oneness, (until they pay the tribute readily) standing: from hand to hand, (being brought low) abased.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "9:29",
            "4:136",
            "2:8",
            "48:28",
            "39:2",
            "35:31",
            "9:16",
            "9:45",
            "3:3",
            "9:26"
        ],
        "BIBLE": [
            "writings:i%20chronicles:22:18",
            "prophets:judges:18:10",
            "torah:genesis:31:42",
            "prophets:joshua:8:1",
            "prophets:joshua:6:2",
            "prophets:jeremiah:32:43",
            "torah:numbers:15:23",
            "prophets:ezekiel:18:8",
            "writings:ii%20chronicles:19:6",
            "writings:daniel:1:2"
        ]
    }
}