{
    "VERSE": "9:33",
    "ARABIC": "هُوَ ٱلَّذِىٓ أَرْسَلَ رَسُولَهُۥ بِٱلْهُدَىٰ وَدِينِ ٱلْحَقِّ لِيُظْهِرَهُۥ عَلَى ٱلدِّينِ كُلِّهِۦ وَلَوْ كَرِهَ ٱلْمُشْرِكُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "It is He who sent His Messenger with guidance and the Deen of Truth to exalt it over every other deen, even though the idolaters detest it.",
        "TRANSLATION_1": "It is He who sent His Messenger with guidance and the true faith in order to make it superior to other systems of belief, even though the idolaters may not like it.\n",
        "TRANSLATION_2": "He it is Who has sent His Messenger with the guidance and the True Religion that He may make it prevail over all religions, howsoever those who associate others with Allah in His Divinity might detest it.\n",
        "TRANSLATION_3": "It is God Who sent His Messenger with guidance and a true religion that will prevail over all other religions, even though the pagans may dislike it.\n",
        "TRANSLATION_4": "It is He Who has sent His Noble Messenger with guidance and the true religion, in order to prevail over all other religions – even if the polytheists get annoyed.\n",
        "TRANSLATION_5": "It is He Who has sent His Messenger with guidance and the religion of truth, to make it superior over all religions even though the idolators hate (it).\n",
        "TRANSLATION_6": "He it is Who sent His Apostle with guidance and the religion of truth, that He might cause it to prevail over all religions, though the polytheists may be averse.\n",
        "TRANSLATION_7": "It is He who has sent His Messenger with the guidance and the religion of truth, that He may uplift it above every religion, though the unbelievers be averse.\n",
        "TRANSLATION_8": "He it is Who hath sent His messenger with the guidance and the Religion of Truth, that He may cause it to prevail over all religion, however much the idolaters may be averse.\n",
        "TRANSLATION_9": "It is He who has sent His Messenger with guidance and the religion of Truth, so that He may make it prevail [ideologically] over every other religion, however much the polytheists may hate this.\n",
        "TRANSLATION_10": "He it is who hath sent His apostle with the guidance and the true religion that he may make it prevail over all religions, although the associators may detest.\n",
        "TRANSLATION_11": "It is He who has sent His Apostle with the guidance and the religion of truth that He may make it prevail over all religions, though the polytheists should be averse.\n",
        "TRANSLATION_12": "It is He Who hath sent His Messenger with guidance and the Religion of Truth, to proclaim it over all religion, even though the Pagans may detest (it).\n",
        "TRANSLATION_13": "It is He Who has sent His Messenger (Muhammad SAW) with guidance and the religion of truth (Islam), to make it superior over all religions even though the Mushrikun (polytheists, pagans, idolaters, disbelievers in the Oneness of Allah) hate (it).\n",
        "TRANSLATION_14": "It is He who has sent forth His Messenger with guidance and the religion of truth to uplift it above every religion, no matter how much the idolaters hate it.\n",
        "TRANSLATION_15": "It is He who sent His Messenger with the guidance and the religion of truth, in order to make it prevail over all religions, even though the idolaters dislike it.\n",
        "TRANSLATION_16": "It is He who has sent His Messenger with guidance and the religion of truth to manifest it over all religion, although they who associate others with Allah dislike it.\n",
        "TRANSLATION_17": "[9:33] He it is Who has sent His Messenger, Muhammad (s), with the guidance and the religion of truth, that He may manifest it, make it prevail, over every religion, all the religions which oppose it, even though the disbelievers be averse, to this.\n",
        "TRANSLATION_18": "(He it is Who hath sent His messenger) Muhammad (pbuh) (with the guidance) with the Qur'an and faith (and the Religion of Truth) the religion of Islam, and with it the confession that there is no deity except Allah, (that He may cause it to prevail over all religion) that He may Cause the religion of Islam to prevail over all religions which came before it until the Day of Judgement, (however much the idolaters may be averse) that this should be so. 197\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "9:33",
            "61:9",
            "48:28",
            "10:103",
            "16:102",
            "11:120",
            "9:29",
            "9:62",
            "10:82",
            "45:22"
        ],
        "BIBLE": [
            "writings:ezra:8:21",
            "torah:deuteronomy:24:4",
            "prophets:jeremiah:42:5",
            "torah:numbers:23:19",
            "writings:esther:6:9",
            "prophets:jeremiah:20:11",
            "prophets:ezekiel:36:3",
            "torah:genesis:24:27",
            "prophets:joshua:6:17",
            "prophets:amos:5:16"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:2:5"
        ]
    }
}