{
    "VERSE": "9:37",
    "ARABIC": "إِنَّمَا ٱلنَّسِىٓءُ زِيَادَةٌ فِى ٱلْكُفْرِ يُضَلُّ بِهِ ٱلَّذِينَ كَفَرُوا۟ يُحِلُّونَهُۥ عَامًا وَيُحَرِّمُونَهُۥ عَامًا لِّيُوَاطِـُٔوا۟ عِدَّةَ مَا حَرَّمَ ٱللَّهُ فَيُحِلُّوا۟ مَا حَرَّمَ ٱللَّهُ زُيِّنَ لَهُمْ سُوٓءُ أَعْمَٰلِهِمْ وَٱللَّهُ لَا يَهْدِى ٱلْقَوْمَ ٱلْكَٰفِرِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Deferring a sacred month is an increase in kufr by which the kuffar lead many people astray. One year they make it profane and another sacred to tally with the number Allah has made sacred. In that way they profane what Allah has made sacred. Their bad actions are made to seem good to them. Allah does not guide kafir people.",
        "TRANSLATION_1": "Intercalating a month is adding to unbelief. The unbelievers are misguided by this, for they take the same month to be sacred one year and sacrilegious the next, thus making the number of months sanctified by God accord with theirs in order to make what God has forbidden, lawful. Attractive seem to them their evil deeds; but God does not show the unbelievers the way.\n",
        "TRANSLATION_2": "The intercalation (of sacred months) is an act of gross infidelity which causes the unbelievers to be led further astray. They declare a month to be lawful in one year and forbidden in another year in order that they may conform to the number of months that Allah has declared as sacred, and at the same time make lawful what Allah has forbidden. Their foul acts seem fair to them. Allah does not direct those who deny the Truth to the Right Way.\n",
        "TRANSLATION_3": "To disregard the observation of the sacred months and to observe it during the non-sacred months is to add more to one's disbelief. This causes the unbelievers to go further astray. One year they (the pagans) consider a sacred month not sacred, (and observe it during a non-sacred month) but the next year they consider it sacred at the right time. By dealing with the sacred months in such a manner, they think that they have observed the laws of God, but, in fact, they have changed them. Their evil deeds seem attractive to them but God does not guide the unbelieving people.\n",
        "TRANSLATION_4": "Their postponing of the months is nothing but furtherance in disbelief – the disbelievers are misled by it – they decree it lawful in one year and regard it forbidden in another year, in order to equate to the number of the months which Allah has made sacred, and to make lawful what Allah has forbidden; their evil deeds seem good in their sight; and Allah does not guide the disbelievers.\n",
        "TRANSLATION_5": "The postponing (of a Sacred Month) is indeed an addition to disbelief: thereby the disbelievers are led astray, for they make it lawful one year and forbid it another year in order to adjust the number of months forbidden by Allah, and make such forbidden ones lawful. The evil of their deeds is made fair-seeming to them. And Allah guides not the people who disbelieve.\n",
        "TRANSLATION_6": "Postponing (of the sacred month) is only an addition in unbelief, wherewith those who disbelieve are led astray, violating it one year and keeping it sacred another, that they may agree in the number (of months) that Allah has made sacred, and thus violate what Allah has made sacred; the evil of their doings is made fairseeming to them; and Allah does not guide the unbelieving people.\n",
        "TRANSLATION_7": "The month postponed is an increase of unbelief whereby the unbelievers go astray; one year they make it profane, and hallow it another, to agree with the number that God has hallowed, and so profane what God has hallowed. Decked out fair to them are their evil deeds; and God guides not the people of the unbelievers.\n",
        "TRANSLATION_8": "Postponement (of a sacred month) is only an excess of disbelief whereby those who disbelieve are misled; they allow it one year and forbid it (another) year, that they may make up the number of the months which Allah hath hallowed, so that they allow that which Allah hath forbidden. The evil of their deeds is made fairseeming unto them. Allah guideth not the disbelieving folk.\n",
        "TRANSLATION_9": "The postponing of [sacred months] is but one more instance of [their] refusal to acknowledge the truth -- by which those who are bent on denying the truth are led astray. They declare this to be permissible in one year and forbidden in another year, so that they may adjust the months which God has sanctified, thus making lawful what God has forbidden. Their evil deed seems fair to them: God does not guide those who deny the truth.\n",
        "TRANSLATION_10": "The postponement is but an addition unto infidelity, whereby the infidels are led astray, allowing it one year and forbidding it anot her year, that they may make up the number which Allah hath sanctified; and then they allow that which Allah hath forbidden. Made fair-seeming unto them is the vileness of their works; and Allah guideth not an infidel people.\n",
        "TRANSLATION_11": "Indeed nasee is an increase in unfaith, whereby the faithless are led [further] astray. They allow it in one year and forbid it another year, so as to fit in with the number, which Allah has made inviolable, thus permitting what Allah has forbidden. Their evil deeds appear to them as decorous, and Allah does not guide the faithless lot.\n",
        "TRANSLATION_12": "Verily the transposing (of a prohibited month) is an addition to Unbelief: the Unbelievers are led to wrong thereby: for they make it lawful one year, and forbidden another year, in order to adjust the number of months forbidden by Allah and make such forbidden ones lawful. The evil of their course seems pleasing to them. But Allah guideth not those who reject Faith.\n",
        "TRANSLATION_13": "The postponing (of a Sacred Month) is indeed an addition to disbelief: thereby the disbelievers are led astray, for they make it lawful one year and forbid it another year in order to adjust the number of months forbidden by Allah, and make such forbidden ones lawful. The evil of their deeds seems pleasing to them. And Allah guides not the people, who disbelieve.\n",
        "TRANSLATION_14": "The postponement of sacred months is an increase in disbelief in which the unbelievers are misguided. They allow it one year and forbid it another year, so that they can make up for the months that Allah has sanctified so making lawful what Allah has forbidden. Their foul acts seem fair to them Allah does not guide the unbelievers.\n",
        "TRANSLATION_15": "Postponement is an increase in disbelief—by which those who disbelieve are led astray. They allow it one year, and forbid it another year, in order to conform to the number made sacred by God, thus permitting what God has forbidden. The evil of their deeds seems good to them. God does not guide the disbelieving people.\n",
        "TRANSLATION_16": "Indeed, the postponing [of restriction within sacred months] is an increase in disbelief by which those who have disbelieved are led [further] astray. They make it lawful one year and unlawful another year to correspond to the number made unlawful by Allah and [thus] make lawful what Allah has made unlawful. Made pleasing to them is the evil of their deeds; and Allah does not guide the disbelieving people.\n",
        "TRANSLATION_17": "[9:37] Postponement [of the sacred month] — that is, the deferment of the sacredness of a given month to another, as they used to do during paganism, such as postponing the sacredness of Muharram, if it arrives while they are at war, to Safar — is only an excess of unbelief, because of their rejection of God’s ruling thereof, whereby those who disbelieve are led astray (yudallu may also be read yadillu, ‘[they] go astray’), one year they make it, the month postponed, profane, and hallow it another, that they may make up, by profaning one month and hallowing another in its place, the number, of months, which God has hallowed, such that they do not hallow more, or less, than the four months, but without observing the individual months themselves; and so they profane what God has hallowed. Their evil deeds have been adorned for them, such that they deem them to be good [deeds]; and God does not guide the disbelieving folk.\n",
        "TRANSLATION_18": "(Postponement (of a sacred month) is only an excess of disbelief) He says: postponement of the month of Muharram to the month of Safar is an excess of disbelief (whereby those who disbelieve are misled) they are wrong to postpone Muharram to Safar, (they allow it) i.e. Muharram (one year) and thus fight in it (and forbid it) i.e. Muharram ((another) year) and thus abstain from fighting during it. And so when they used to do this, Muharram would not be considered sacred while Safar became sacred instead, (that they may make up) that they may match (the number of the months which Allah hath hallowed) four in number, (so that they allow that which Allah hath forbidden) i.e. Muharram. (The evil of their deeds is made fair-seeming unto them. Allah guideth not) leads not to His religion (the disbelieving folk) those who do not deserve it. The one who used to postpone the sacred months was a man called Nu'aym Ibn Tha'labah.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "9:37",
            "45:14",
            "14:28",
            "9:17",
            "39:61",
            "4:137",
            "9:96",
            "35:8",
            "63:6",
            "9:115"
        ],
        "BIBLE": [
            "writings:ii%20chronicles:30:5",
            "prophets:joshua:1:8",
            "writings:daniel:2:9",
            "prophets:micah:6:16",
            "torah:deuteronomy:4:25",
            "prophets:ezekiel:43:11",
            "prophets:ezekiel:39:7",
            "writings:daniel:3:29",
            "writings:ecclesiastes:7:13",
            "prophets:i%20kings:16:19"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:1:5"
        ]
    }
}