{
    "VERSE": "9:40",
    "ARABIC": "إِلَّا تَنصُرُوهُ فَقَدْ نَصَرَهُ ٱللَّهُ إِذْ أَخْرَجَهُ ٱلَّذِينَ كَفَرُوا۟ ثَانِىَ ٱثْنَيْنِ إِذْ هُمَا فِى ٱلْغَارِ إِذْ يَقُولُ لِصَٰحِبِهِۦ لَا تَحْزَنْ إِنَّ ٱللَّهَ مَعَنَا فَأَنزَلَ ٱللَّهُ سَكِينَتَهُۥ عَلَيْهِ وَأَيَّدَهُۥ بِجُنُودٍ لَّمْ تَرَوْهَا وَجَعَلَ كَلِمَةَ ٱلَّذِينَ كَفَرُوا۟ ٱلسُّفْلَىٰ وَكَلِمَةُ ٱللَّهِ هِىَ ٱلْعُلْيَا وَٱللَّهُ عَزِيزٌ حَكِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "If you do not help him, Allah did help him when the kuffar drove him out and there were two of them in the Cave.* He said to his companion, 'Do not be despondent, Allah is with us.' Then Allah sent down His serenity upon him and reinforced him with troops you could not see. He made the word of the kuffar undermost. It is the word of Allah which is uppermost. Allah is Almighty, All-Wise.",
        "TRANSLATION_1": "If you do not help (the Prophet, remember) God had helped him when the infidels had forced him to leave (and he was) one of two. When both of them were in the cave, he said to his companion: \"Do not grieve, for God is with us.\" Then God sent divine peace on him, and invisible armies for his help, and made the unbelievers' purpose abject. Most exalted is God's word, for God is all-mighty and all-wise.\n",
        "TRANSLATION_2": "It will matter little if you do not help the Prophet, for Allah surely helped him when the unbelievers drove him out of his home and he was but one of the two when they were in the cave, and when he said to his companion: \"Do not grieve. Allah is with us.\" Then Allah caused His tranquillity to descend upon him, and supported him with hosts you did not see, He humbled the word of the unbelievers. As for Allah's Word, it is inherently uppermost. Allah is All-Powerful, All-Wise.\n",
        "TRANSLATION_3": "If you do not help him, (Muhammad), God has already helped him. When the unbelievers expelled him and he was one of the two people in the cave telling his friend, \"Do not worry; God is with us,\" then God gave him confidence and supported him with an army which you did not see and He defeated the cause of the disbelievers and made His own cause stand supreme. God is Majestic and All-wise.\n",
        "TRANSLATION_4": "If you do not help him (Prophet Mohammed – peace and blessings be upon him), Allah has helped him – when he had to go forth due to the mischief of the disbelievers, just as two men* – when they were in the cave, when he was saying to his companion “Do not grieve; indeed Allah is with us”; then Allah caused His calm to descend upon him and helped him with armies you did not see, and disgraced the word of the disbelievers; and Allah’s Word is supreme; and Allah is the Almighty, the Wise. (* The Holy Prophet migrated only with S. Abu Bakr (who later became the first caliph) as his sole companion.)\n",
        "TRANSLATION_5": "If you help him (Muhammad) not (it does not matter), for Allah did indeed help him when the disbelievers drove him out, the second of the two; when they were both in the cave, he said to his companion: \"Be not sad (or afraid), surely, Allah is with us.\" Then Allah sent down His Sakinah (calmness, tranquillity, peace) upon him, and strengthened him with forces (angels) which you saw not, and made the word of those who disbelieved the lowermost, while the Word of Allah that became the uppermost; and Allah is All-Mighty, All-Wise.\n",
        "TRANSLATION_6": "If you will not aid him, Allah certainly aided him when those who disbelieved expelled him, he being the second of the two, when they were both in the cave, when he said to his companion: Grieve not, surely Allah is with us. So Allah sent down His tranquillity upon him and strengthened him with hosts which you did not see, and made lowest the word of those who disbelieved; and the word of Allah, that is the highest; and Allah is Mighty, Wise.\n",
        "TRANSLATION_7": "If you do not help him, yet God has helped him already, when the unbelievers drove him forth the second of two, when the two were in the Cave, when he said to his companion, 'Sorrow not; surely God is with us.' Then God sent down on him His Shechina, and confirmed him with legions you did not see; and He made the word of the unbelievers the lowest; and God's word is the uppermost; God is All-mighty, All-wise.\n",
        "TRANSLATION_8": "If ye help him not, still Allah helped him when those who disbelieve drove him forth, the second of two; when they two were in the cave, when he said unto his comrade: Grieve not. Lo! Allah is with us. Then Allah caused His peace of reassurance to descend upon him and supported him with hosts ye cannot see, and made the word of those who disbelieved the nethermost, while Allah's Word it was that became the uppermost. Allah is Mighty, Wise.\n",
        "TRANSLATION_9": "If you do not support him [Muhammad], know that God did support him when those who denied the truth expelled him when the two of them were in the cave, he [Muhammad] told his companion, \"Do not worry; for God is with us.\" So God sent His tranquillity down on him and aided him with forces invisible to you and placed the word of those who disbelieved lowest, while God's word remained supreme. God is powerful and wise.\n",
        "TRANSLATION_10": "If ye succour him not, then surely Allah hath succoured him when these who disbelieved drave him: the second of the two When the twain were in a cave, and when he Said unto his companion. grieve not, verily Allah is with Us. Then Allah sent down His calm upon him and aided him with hosts whom ye saw not, and made the word of those who disbelieved nethermost, and the word of Allah! that is the upper most. And Allah is Mighty, wise,\n",
        "TRANSLATION_11": "If you do not help him, then Allah certainly helped him when the faithless expelled him, as one of two [refugees], when the two of them were in the cave, he said to his companion, ‘Do not grieve; Allah is indeed with us.’ Then Allah sent down His composure upon him, and strengthened him with hosts you did not see, and He made the word of the faithless the lowest; and the word of Allah is the highest; and Allah is all-mighty, all-wise.\n",
        "TRANSLATION_12": "If ye help not (your leader), (it is no matter): for Allah did indeed help him, when the Unbelievers drove him out: he had no more than one companion; they two were in the cave, and he said to his companion, \"Have no fear, for Allah is with us\": then Allah sent down His peace upon him, and strengthened him with forces which ye saw not, and humbled to the depths the word of the Unbelievers. But the word of Allah is exalted to the heights: for Allah is Exalted in might, Wise.\n",
        "TRANSLATION_13": "If you help him (Muhammad SAW) not (it does not matter), for Allah did indeed help him when the disbelievers drove him out, the second of two, when they (Muhammad SAW and Abu Bakr) were in the cave, and he (SAW) said to his companion (Abu Bakr): \"Be not sad (or afraid), surely Allah is with us.\" Then Allah sent down His Sakinah (calmness, tranquillity, peace, etc.) upon him, and strengthened him with forces (angels) which you saw not, and made the word of those who disbelieved the lowermost, while it was the Word of Allah that became the uppermost, and Allah is All-Mighty, All-Wise.\n",
        "TRANSLATION_14": "If you do not help him, Allah will help him as He helped him when he was driven out with one other (Abu Bakr) by the unbelievers. When the two were in the cave, he said to his companion: 'Do not sorrow, Allah is with us' Then Allah caused His tranquility (shechina) to descend upon him and supported him with legions (of angels) you did not see, and He made the word of the unbelievers the lowest, and the Word of Allah is the highest. Allah is Mighty, Wise.\n",
        "TRANSLATION_15": "If you do not help him, God has already helped him, when those who disbelieved expelled him, and he was the second of two in the cave. He said to his friend, “Do not worry, God is with us.” And God made His tranquility descend upon him, and supported him with forces you did not see, and made the word of those who disbelieved the lowest, while the Word of God is the Highest. God is Mighty and Wise.\n",
        "TRANSLATION_16": "If you do not aid the Prophet - Allah has already aided him when those who disbelieved had driven him out [of Makkah] as one of two, when they were in the cave and he said to his companion, \"Do not grieve; indeed Allah is with us.\" And Allah sent down his tranquillity upon him and supported him with angels you did not see and made the word of those who disbelieved the lowest, while the word of Allah - that is the highest. And Allah is Exalted in Might and Wise.\n",
        "TRANSLATION_17": "[9:40] If you do not help him, that is, the Prophet (s), [know that] God has already helped him, when the disbelievers drove him forth, from Mecca, that is, they made him resort to leaving, when they desired to kill him or imprison him or banish him at the council assembly — the second of two (thāniya ithnayn: this is a circumstantial qualifier), that is, one of two, the other being Abū Bakr: in other words, just as God helped him in such a situation, He will not forsake him in another; when (idh substitutes for the previous idh) the two were in the cave — a breach in the mountain called Thawr — when (idh substituting again), he said to his companion, Abū Bakr — who, upon perceiving the [sound of the] feet of the idolaters [nearby], had said to him, ‘If one of them should merely look below his feet, he will definitely see us!’ — ‘Do not despair; verily God is with us’, assisting [us]. Then God sent down His Spirit of Peace upon him, His reassurance — some say this means upon the Prophet, others, that it means upon Abū Bakr — and supported him, that is, the Prophet (s), with legions, of angels, you did not see, [both] in the cave and in the locations in which he fought battles; and He made the word of those who disbelieved, that is, the call to idolatry, the nethermost, the one vanquished, and the Word of God, that is, the profession of His Oneness (shahāda), was the uppermost, the one prevailing and triumphant. And God is Mighty, in His Kingdom, Wise, in His actions.\n",
        "TRANSLATION_18": "198 (If ye help him not) if you do not help Muhammad (pbuh) by going forth with him to the battle of Tabuk, (still Allah helped him when those who disbelieve) the disbelievers of Mecca (drove him forth, the second of two) i.e. the Messenger of Allah and Abu Bakr; (when they two) Allah's Messenger (pbuh) and Abu Bakr, may Allah be well pleased with him, (were in the cave, when he) the Prophet (pbuh) (said unto his comrade) Abu Bakr: (Grieve not) Abu Bakr. (Lo! Allah is with us) and He will help us. (Then Allah caused His peace of reassurance) His tranquillity (to descend upon him) upon His Prophet (and supported him) helped him on the Day of Badr, at the battle of the troops and also on the Day of Hunayn (with hosts ye cannot see) i.e. with angels, (and made the word) the religion (of those who disbelieved the nethermost) blameworthy and defeated, (while Allah's word it was that became the uppermost) triumphant and praiseworthy. (Allah is Mighty) in retribution against his enemies, (Wise) in helping His friends.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "9:40",
            "48:4",
            "16:60",
            "48:7",
            "35:2",
            "9:26",
            "14:4",
            "4:56",
            "8:49",
            "29:42"
        ],
        "BIBLE": [
            "writings:ii%20chronicles:10:16",
            "torah:genesis:31:42",
            "torah:exodus:16:15",
            "prophets:joshua:17:14",
            "prophets:i%20samuel:26:19",
            "prophets:jeremiah:35:15",
            "torah:leviticus:10:17",
            "writings:ii%20chronicles:35:21",
            "prophets:ezekiel:13:6",
            "writings:ecclesiastes:3:10"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:12"
        ]
    }
}