{
    "VERSE": "9:47",
    "ARABIC": "لَوْ خَرَجُوا۟ فِيكُم مَّا زَادُوكُمْ إِلَّا خَبَالًا وَلَأَوْضَعُوا۟ خِلَٰلَكُمْ يَبْغُونَكُمُ ٱلْفِتْنَةَ وَفِيكُمْ سَمَّٰعُونَ لَهُمْ وَٱللَّهُ عَلِيمٌۢ بِٱلظَّٰلِمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "If they had gone out among you, they would have added nothing to you but confusion. They would have scurried about amongst you seeking to cause conflict between you, and among you there are some who would have listened to them. Allah knows the wrongdoers.",
        "TRANSLATION_1": "Had they gone out with you, they would only have been a hindrance and let loose confusion among you to create discord; for there are some in your midst who spy for them. But God knows who are the wicked.\n",
        "TRANSLATION_2": "Had they gone forth with you, they would have only added to your trouble, and would have run about in your midst seeking to stir up sedition among you, whereas there are among you some who are prone to lend ears to them. Allah knows well the wrong-doers.\n",
        "TRANSLATION_3": "Had they joined you, they would have been of no help to you but would have just caused confusion and trouble among you by sneaking through the ranks where some of you would be ready to listen to them. God knows best the unjust.\n",
        "TRANSLATION_4": "If they had gone forth among you, you would then not gain any increase from them except trouble, and seeking to cause turmoil they would run rumours among you; and their spies are among you; and Allah well knows the unjust.\n",
        "TRANSLATION_5": "Had they marched out with you, they would have added to you nothing except disorder, and they would have hurried about in your midst (spreading corruption) and sowing sedition among you -- and there are some among you who would have listened to them. And Allah is the All-Knower of the wrongdoers.\n",
        "TRANSLATION_6": "Had they gone forth with you, they would not have added to you aught save corruption, and they would certainly have hurried about among you seeking (to sow) dissension among you, and among you there are those who hearken for their sake; and Allah knows the unjust.\n",
        "TRANSLATION_7": "Had they gone forth among you, they would only have increased you in trouble, and run to and fro in your midst, seeking to stir up sedition between you; and some of you would listen to them; and God knows the evildoers.\n",
        "TRANSLATION_8": "Had they gone forth among you they had added to you naught save trouble and had hurried to and fro among you, seeking to cause sedition among you; and among you there are some who would have listened to them. Allah is Aware of evil-doers.\n",
        "TRANSLATION_9": "Had they gone forth with you, they would only have proved a source of evil for you, and would have run back and forth among you, seeking to sow discord among you: and among you there were some who would have willingly listened to them. God knows the evil-doers.\n",
        "TRANSLATION_10": "Had they gene forth with you, they would have added unto you naught save unsoundness, and they would surely have hurried about in Your midst seeking sedition unto you; and amongst you there are listeners to them; and Allah is Knower of the wrong-doers.\n",
        "TRANSLATION_11": "Had they gone forth with you, they would have only added to your troubles, and they would have surely spread rumours in your midst, seeking to cause sedition among you. They have some spies among you, and Allah knows best the wrongdoers.\n",
        "TRANSLATION_12": "If they had come out with you, they would not have added to your (strength) but only (made for) disorder, hurrying to and fro in your midst and sowing sedition among you, and there would have been some among you who would have listened to them. But Allah knoweth well those who do wrong.\n",
        "TRANSLATION_13": "Had they marched out with you, they would have added to you nothing except disorder, and they would have hurried about in your midst (spreading corruption) and sowing sedition among you, and there are some among you who would have listened to them. And Allah is the All-Knower of the Zalimun (polytheists and wrong-doers, etc.).\n",
        "TRANSLATION_14": "Had they gone forth among you, they would only have increased your burden, and run to and fro in your midst, seeking to stir up sedition between you; and some of you would listen to them; and Allah knows the harmdoers.\n",
        "TRANSLATION_15": "Had they mobilized with you, they would have added only to your difficulties, and they would have spread rumors in your midst, trying to sow discord among you. Some of you are avid listeners to them. God is Aware of the wrongdoers.\n",
        "TRANSLATION_16": "Had they gone forth with you, they would not have increased you except in confusion, and they would have been active among you, seeking [to cause] you fitnah. And among you are avid listeners to them. And Allah is Knowing of the wrongdoers.\n",
        "TRANSLATION_17": "[9:47] Had they gone forth among you, they would only have caused you more trouble, [more] corruption, by abandoning the believers, and would have hurried to and fro among you, that is, they would have hastened to spread slander among you, seeking, desiring, to stir up sedition, by casting enmity, between you; and among you there are some who would listen to them, to what they say, listening in readiness to accept it; and God knows the evildoers.\n",
        "TRANSLATION_18": "(Had they gone forth among you) with you (they had added to you naught save trouble) evil and corruption (and had hurried to and fro among you) they would have marched riding their camels in the middle of you, (seeking to cause sedition among you) seeking to cause evil, corruption, humiliation and damage; (and among you there are some who would have listened to them) among you there are spies for the disbelievers. (Allah is Aware of evil-doers) i.e. the hypocrites: 'Abdullah Ibn Ubayy and his hosts.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "9:47",
            "2:244",
            "2:227",
            "8:61",
            "10:65",
            "2:137",
            "8:17",
            "29:5",
            "4:147",
            "2:193"
        ],
        "BIBLE": [
            "writings:ii%20chronicles:16:9",
            "prophets:amos:8:12",
            "torah:exodus:9:29",
            "prophets:jeremiah:49:3",
            "prophets:isaiah:55:5",
            "prophets:hosea:2:9",
            "writings:daniel:12:4",
            "prophets:isaiah:40:31",
            "prophets:zechariah:4:10",
            "prophets:nahum:2:5"
        ]
    }
}