{
    "VERSE": "9:51",
    "ARABIC": "قُل لَّن يُصِيبَنَآ إِلَّا مَا كَتَبَ ٱللَّهُ لَنَا هُوَ مَوْلَىٰنَا وَعَلَى ٱللَّهِ فَلْيَتَوَكَّلِ ٱلْمُؤْمِنُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Say: 'Nothing can happen to us except what Allah has ordained for us. He is Our Master. It is in Allah that the muminun should put their trust.'",
        "TRANSLATION_1": "Tell them: \"Nothing can befall us except what God decrees. Our protector is He, and in God should the faithful place their trust.\"\n",
        "TRANSLATION_2": "Say: \"Nothing will befall us except what Allah has decreed for us; He is our Protector.\" Let the believers, then, put all their trust in Allah.\n",
        "TRANSLATION_3": "(Muhammad), say, \"Nothing will happen to us besides what God has decreed for us. He is our Guardian. In God alone do the believers trust.\"\n",
        "TRANSLATION_4": "Say, O dear Prophet “Nothing shall befall us except what Allah has destined for us; He is our Master; and the Muslims must rely only on Allah.”\n",
        "TRANSLATION_5": "Say: \"Nothing shall ever happen to us except what Allah has ordained for us. He is our Mawla (protector).\" And in Allah let the believers put their trust.\n",
        "TRANSLATION_6": "Say: Nothing will afflict us save what Allah has ordained for us; He is our Patron; and on Allah let the believers rely.\n",
        "TRANSLATION_7": "Say: 'Naught shall visit us but what God has prescribed for us; He is our Protector; in God let the believers put all their trust.'\n",
        "TRANSLATION_8": "Say: Naught befalleth us save that which Allah hath decreed for us. He is our Protecting Friend. In Allah let believers put their trust!\n",
        "TRANSLATION_9": "Say, \"Nothing can befall us, except what God has ordained for us. He is our Supreme Lord. In God let the faithful put their trust.\"\n",
        "TRANSLATION_10": "Say thou: naught shall ever befall us save that which Allah hath ordained for us; He is our patron, and on Allah let the believers rely.\n",
        "TRANSLATION_11": "Say, ‘Nothing will befall us except what Allah has ordained for us. He is our master, and in Allah let all the faithful put their trust.’\n",
        "TRANSLATION_12": "Say: \"Nothing will happen to us except what Allah has decreed for us: He is our protector\": and on Allah let the Believers put their trust.\n",
        "TRANSLATION_13": "Say: \"Nothing shall ever happen to us except what Allah has ordained for us. He is our Maula (Lord, Helper and Protector).\" And in Allah let the believers put their trust.\n",
        "TRANSLATION_14": "Say: 'Nothing will befall us except what Allah has ordained. He is our Guardian. In Allah, let the believers put their trust'\n",
        "TRANSLATION_15": "Say, “Nothing will happen to us except what God has ordained for us; He is our Protector.” In God let the faithful put their trust.\n",
        "TRANSLATION_16": "Say, \"Never will we be struck except by what Allah has decreed for us; He is our protector.\" And upon Allah let the believers rely.\n",
        "TRANSLATION_17": "[9:51] Say, to them: ‘Nothing shall afflict us but that which God has decreed for us, that we be afflicted thereby; He is our Protector, our Helper and the One in charge of our affairs; in God let the believers put their trust’.\n",
        "TRANSLATION_18": "(Say) Muhammad, to the hypocrites: (Naught befalleth us save that which Allah hath decreed for us. He is our protecting Friend) He has better right to protect us. (In Allah let believers put their trust!) the believers ought to put their trust in Allah.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "9:51",
            "47:11",
            "64:13",
            "40:33",
            "20:14",
            "3:122",
            "14:12",
            "42:46",
            "53:62",
            "10:72"
        ],
        "BIBLE": [
            "prophets:jeremiah:14:13",
            "prophets:isaiah:36:7",
            "prophets:jeremiah:51:62",
            "prophets:ii%20kings:18:22",
            "torah:genesis:20:11",
            "torah:genesis:1:9",
            "writings:psalms:31:15",
            "prophets:judges:7:7",
            "torah:exodus:33:21",
            "writings:ii%20chronicles:14:10"
        ]
    }
}