{
    "VERSE": "9:55",
    "ARABIC": "فَلَا تُعْجِبْكَ أَمْوَٰلُهُمْ وَلَآ أَوْلَٰدُهُمْ إِنَّمَا يُرِيدُ ٱللَّهُ لِيُعَذِّبَهُم بِهَا فِى ٱلْحَيَوٰةِ ٱلدُّنْيَا وَتَزْهَقَ أَنفُسُهُمْ وَهُمْ كَٰفِرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Do not let their wealth and children impress you. Allah merely wants to punish them by them during their life in this world and for them to expire while they are kuffar.",
        "TRANSLATION_1": "Do not marvel at their wealth and children. God intends to punish them through these in the world; and their souls will depart in a state of disbelief.\n",
        "TRANSLATION_2": "Let neither their riches nor their children excite your admiration. Allah only wants to chastise them through these things in the present life, and to cause them to die while they are unbelievers.\n",
        "TRANSLATION_3": "Let not their property and children tempt you; God wants to punish them through their things in this life so that their souls will depart while they are unbelievers.\n",
        "TRANSLATION_4": "So let not their riches or their children surprise you; Allah only intends to punish them in the life of this world with these things and that they die only as disbelievers.\n",
        "TRANSLATION_5": "So let not their wealth nor their children amaze you; in reality Allah's plan is to punish them with these things in the life of this world, and that their souls shall depart (die) while they are disbelievers.\n",
        "TRANSLATION_6": "Let not then their property and their children excite your admiration; Allah only wishes to chastise them with these in this world's life and (that) their souls may depart while they are unbelievers.\n",
        "TRANSLATION_7": "So let not their possessions or their children please thee; God only desires thereby to chastise them in this present life, and that their souls should depart while they are unbelievers.\n",
        "TRANSLATION_8": "So let not their riches nor their children please thee (O Muhammad). Allah thereby intendeth but to punish them in the life of the world and that their souls shall pass away while they are disbelievers.\n",
        "TRANSLATION_9": "Do not let their wealth and children impress you. For God seeks to punish them through these things in the life of this world, so that their souls shall depart while they are still denying the truth.\n",
        "TRANSLATION_10": "Let not wherefore their riches and their children amaze thee. Allah intendeth only to torment them therewith in the life of the world and that their souls pass away while they are infidels.\n",
        "TRANSLATION_11": "So let not their wealth and children impress you: Allah only desires to punish them with these in the life of this world, and that their souls may depart while they are faithless.\n",
        "TRANSLATION_12": "Let not their wealth nor their (following in) sons dazzle thee: in reality Allah's plan is to punish them with these things in this life, and that their souls may perish in their (very) denial of Allah.\n",
        "TRANSLATION_13": "So let not their wealth or their children amaze you (O Muhammad SAW); in reality Allah's Plan is to punish them with these things in the life of the this world, and that their souls shall depart (die) while they are disbelievers.\n",
        "TRANSLATION_14": "Let neither their wealth nor their children please you. Through these Allah seeks to punish them in this life, and that their souls depart while they are unbelievers.\n",
        "TRANSLATION_15": "Let neither their possessions nor their children impress you. God intends to torment them through them in this worldly life, and that their souls depart while they are disbelievers.\n",
        "TRANSLATION_16": "So let not their wealth or their children impress you. Allah only intends to punish them through them in worldly life and that their souls should depart [at death] while they are disbelievers.\n",
        "TRANSLATION_17": "[9:55] So do not let their wealth or their children please you, that is, do not deem fair Our graces to them, for this is a [way of] drawing [them] on by degrees [to punish them]: God only desires thereby to chastise them in the life of this world, by way of the hardship that they encounter in amassing such [wealth and children] and the calamities [they suffer] as a result thereof; and that their souls should depart while they are disbelievers, so He punishes them in the Hereafter with the worst punishment.\n",
        "TRANSLATION_18": "200 (So let not) Muhammad (their riches) the abundance of their riches (nor their children) the abundance of their children (please thee. Allah thereby intendeth but to punish them) in the Hereafter (and that their souls shall pass away) shall expire (in the life of the world while they are disbelievers).\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "9:55",
            "9:85",
            "14:27",
            "16:107",
            "49:15",
            "45:35",
            "47:36",
            "41:31",
            "3:116",
            "9:44"
        ],
        "BIBLE": [
            "prophets:jeremiah:3:19",
            "prophets:joshua:14:9",
            "prophets:isaiah:25:1",
            "writings:ii%20chronicles:34:33",
            "writings:ecclesiastes:6:2",
            "writings:psalms:17:14",
            "prophets:jeremiah:38:16",
            "prophets:jeremiah:14:22",
            "writings:proverbs:30:7",
            "prophets:jeremiah:40:15"
        ]
    }
}