{
    "VERSE": "9:60",
    "ARABIC": "إِنَّمَا ٱلصَّدَقَٰتُ لِلْفُقَرَآءِ وَٱلْمَسَٰكِينِ وَٱلْعَٰمِلِينَ عَلَيْهَا وَٱلْمُؤَلَّفَةِ قُلُوبُهُمْ وَفِى ٱلرِّقَابِ وَٱلْغَٰرِمِينَ وَفِى سَبِيلِ ٱللَّهِ وَٱبْنِ ٱلسَّبِيلِ فَرِيضَةً مِّنَ ٱللَّهِ وَٱللَّهُ عَلِيمٌ حَكِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "Zakat is for: the poor, the destitute, those who collect it, reconciling people's hearts, freeing slaves, those in debt, spending in the Way of Allah, and travellers. It is a legal obligation from Allah. Allah is All-Knowing, All-Wise.",
        "TRANSLATION_1": "Charities are meant for the indigent and needy, and those who collect and distribute them, and those whom you wish to win over, and for redeeming slaves (and captives) and those who are burdened with debt, and in the cause of God, and the wayfarers: So does God ordain. God is all-knowing and all-wise.\n",
        "TRANSLATION_2": "The alms are meant only for the poor and the needy and those who are in charge thereof, those whose hearts are to be reconciled, and to free those in bondage, and to help those burdened with debt, and for expenditure in the Way of Allah and for the wayfarer. This is an obligation from Allah. Allah is All-Knowing, All-Wise.\n",
        "TRANSLATION_3": "Welfare funds (zakat) are only for the poor, the destitute, the tax collectors, those whose hearts are inclined (towards Islam), the slaves, those who cannot pay their debts, for the cause of God, and for those who have become needy on a journey. Paying zakat is an obligation that God has decreed. God is All-knowing and All-wise.\n",
        "TRANSLATION_4": "The obligatory charity* is only for the destitute and the really needy, and those who collect it, and for those in whose hearts the love of Islam needs to be instilled**, and to free slaves, and to debtors, and in Allah's cause***, and to the traveller; this is decreed by Allah; and Allah is All Knowing, Wise. (* This applies only to Zakat. ** The new convert to Islam. *** To the fighter having no provisions for holy war.)\n",
        "TRANSLATION_5": "As-Sadaqat (i.e., Zakah) are only for the Fuqara', and Al-Masakin and those employed to collect (the funds); and to attract the hearts of those who have been inclined (towards Islam); and to free the captives; and for those in debt; and for Allah's cause, and for Ibn As-Sabil; a duty imposed by Allah. And Allah is All-Knower, All-Wise.\n",
        "TRANSLATION_6": "Alms are only for the poor and the needy, and the officials (appointed) over them, and those whose hearts are made to incline (to truth) and the (ransoming of) captives and those in debts and in the way of Allah and the wayfarer; an ordinance from Allah; and Allah is knowing, Wise.\n",
        "TRANSLATION_7": "The freewill offerings are for the poor and needy, those who work to collect them, those whose hearts are brought together, the ransoming of slaves, debtors, in God's way, and the traveller; so God ordains; God is All-knowing, All-wise.\n",
        "TRANSLATION_8": "The alms are only for the poor and the needy, and those who collect them, and those whose hearts are to be reconciled, and to free the captives and the debtors, and for the cause of Allah, and (for) the wayfarer; a duty imposed by Allah. Allah is Knower, Wise.\n",
        "TRANSLATION_9": "Alms are only for: the poor and the destitute, for those who collect zakat, for conciliating people's hearts, for freeing slaves, for those in debt, for spending for God's cause, and for travellers in need. It is a legal obligation enjoined by God. God is all-knowing and wise.\n",
        "TRANSLATION_10": "The compulsory alms are only for the poor and the needy and the agents employed therein and those whose hearts are to be conciliated and those in bondage and debtors and for expenditure in the way of Allah and for the wayfarer: an ordinance from Allah: and Allah is Knowing, Wise.\n",
        "TRANSLATION_11": "The charities are only for the poor and the needy, and those employed to collect them, and those whose hearts are to be reconciled, and for [the freedom of] the slaves and the debtors, and in the way of Allah, and for the traveller. [This is] an ordinance from Allah, and Allah is all-knowing, all-wise.\n",
        "TRANSLATION_12": "Alms are for the poor and the needy, and those employed to administer the (funds); for those whose hearts have been (recently) reconciled (to Truth); for those in bondage and in debt; in the cause of Allah; and for the wayfarer: (thus is it) ordained by Allah, and Allah is full of knowledge and wisdom.\n",
        "TRANSLATION_13": "As-Sadaqat (here it means Zakat) are only for the Fuqara' (poor), and Al-Masakin (the poor) and those employed to collect (the funds); and for to attract the hearts of those who have been inclined (towards Islam); and to free the captives; and for those in debt; and for Allah's Cause (i.e. for Mujahidun - those fighting in the holy wars), and for the wayfarer (a traveller who is cut off from everything); a duty imposed by Allah. And Allah is All-Knower, All-Wise.\n",
        "TRANSLATION_14": "The obligatory charity shall be only for the poor and the needy, and for those who work to collect it, and to influence hearts (to belief), for ransoming captives, and debtors in the Way of Allah and the destitute traveler. It is an obligation from Allah. Allah is Knowing, Wise.\n",
        "TRANSLATION_15": "Charities are for the poor, and the destitute, and those who administer them, and for reconciling hearts, and for freeing slaves, and for those in debt, and in the path of God, and for the traveler in need—an obligation from God. God is All-Knowing, Most Wise.\n",
        "TRANSLATION_16": "Zakah expenditures are only for the poor and for the needy and for those employed to collect [zakah] and for bringing hearts together [for Islam] and for freeing captives [or slaves] and for those in debt and for the cause of Allah and for the [stranded] traveler - an obligation [imposed] by Allah. And Allah is Knowing and Wise.\n",
        "TRANSLATION_17": "[9:60]   The voluntary almsgivings, the alms to be dispensed, are only for the poor, who cannot find anything to suffice them in the least, and the needy, who cannot find anything to suffice them, and those who work with them, that is, [with] these alms, in other words, the one who collects [them], the one who takes the oaths [from those who claim them], the slave to be manumitted by contract, as well as the tax-summoner; and those whose hearts are to be reconciled, so that they might become Muslims, or that Islam might be firmly established, or that their peers might become Muslims, or that they might defend Muslims, all of whom are [classed according to different] categories. According to al-Shāfi‘ī, may God be pleased with him, the first and the last [of these categories] are no longer given [of the alms-tax] today, because of the [established] power of Islam; in contrast, the other two [categories] are given [of the alms-tax], according to the sounder [opinion]; and for, the manumission of, slaves, that is, [for] slaves to be manumitted by contract, and for the debtors, those in debt, if they have taken out a debt without intending thereby an act of disobedience, or those who have repented but have nothing with which to fulfil [the penalty of expiation], or to set things right between people, even if they be wealthy; and, for the way of God, that is, [for] those who are engaged in the struggle, of those for whom there is no [share of the] booty (fay’), even if they be wealthy; and for the traveller, the one cut off [from resources] during his journey — a duty imposed by God (farīdatan, ‘a duty’, is in the accusative because of an implied verb [sc. faradahā, ‘which He has imposed’]). And God is Knower, of His creatures, Wise, in His actions. Thus, it is impermissible to dispense these [alms-proceeds] other than to these [categories], or to deny [these proceeds to] any one of these [categories] if they exist. The Imam must divide these [proceeds] among them equally, but he is permitted to give priority to certain individuals over others within any one category. The lām [of li’l-fuqarā’, ‘for the poor’] indicates that it is obligatory to include every individual [of these categories in the distribution of the proceeds]; it is not, however, obligatory [to do so] when the person in charge of the monies has to apportion it but [finds that] it is insufficient. Indeed [in such a situation] it suffices to give three individuals from each category, but anything less than that is not sufficient, as is indicated by the plural form. The Sunna shows that the prerequisite condition for receiving [a share] of such [monies] is that the person be a Muslim, but not a Hashimī or a Muttālibī.\n",
        "TRANSLATION_18": "Allah then explained who is entitled to these alms, saying: (The alms are only for the poor) for the folk of the Platform (and the needy) among the pilgrims, (and those who collect them) i.e. the collectors of alms, (and those whose hearts are to be reconciled) by giving them gifts such as Abu Sufyan and his companions. These were 15 men, (and to free the captives) the captives who want to ransom themselves (and the debtors) those who incurred debts to fulfil works which are for the obedience of Allah, (and for the cause of Allah) and for the fighters for the cause of Allah, (and (for) the wayfarers) guests, the passer-by; (a duty imposed by Allah) an allotment from Allah for these. (Allah is Knower) of these, (Wise) regarding that which He has ordained for these categories of people.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "9:60",
            "48:4",
            "2:215",
            "9:110",
            "9:15",
            "9:103",
            "24:18",
            "8:49",
            "4:26",
            "2:273"
        ],
        "BIBLE": [
            "prophets:i%20kings:2:3",
            "prophets:ezekiel:7:4",
            "prophets:ezekiel:7:9",
            "writings:ii%20chronicles:8:14",
            "torah:numbers:9:13",
            "prophets:ezekiel:32:9",
            "writings:i%20chronicles:29:17",
            "prophets:ezekiel:20:44",
            "prophets:i%20kings:8:58",
            "writings:ezra:6:12"
        ]
    }
}