{
    "VERSE": "9:62",
    "ARABIC": "يَحْلِفُونَ بِٱللَّهِ لَكُمْ لِيُرْضُوكُمْ وَٱللَّهُ وَرَسُولُهُۥٓ أَحَقُّ أَن يُرْضُوهُ إِن كَانُوا۟ مُؤْمِنِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "They swear to you by Allah in order to please you, but it would be more fitting for them to please Allah and His Messenger if they are muminun.",
        "TRANSLATION_1": "They swear by God to please you; but if they are believers it would have been worthier to have pleased God and His Apostle.\n",
        "TRANSLATION_2": "They swear by Allah to please you, while it is Allah and His Messenger whose pleasure they should seek if they truly believe.\n",
        "TRANSLATION_3": "They (hypocrites) swear by God in their effort to please you, but if they were true believers (they would know) that God and His Messenger deserve more to be pleased than anyone else.\n",
        "TRANSLATION_4": "They swear by Allah in your presence in order to please you; whereas Allah – and His Noble Messenger – had more right that they should have pleased Him if they had faith.\n",
        "TRANSLATION_5": "They swear by Allah to you (Muslims) in order to please you, but it is more fitting that they should please Allah and His Messenger, if they are believers.\n",
        "TRANSLATION_6": "They swear to you by Allah that they might please you and, Allah, as well as His Apostle, has a greater right that they should please Him, if they are believers.\n",
        "TRANSLATION_7": "They swear to you by God, to please you; but God and His Messenger -- more right is it they should please Him, if they are believers.\n",
        "TRANSLATION_8": "They swear by Allah to you (Muslims) to please you, but Allah, with His messenger, hath more right that they should please Him if they are believers.\n",
        "TRANSLATION_9": "They swear by God in order to please you [believers]: but it would be more fitting for them to please God and His Messenger, if they are believers.\n",
        "TRANSLATION_10": "They swear unto you by Allah that ye be pleased, whereas wortheir are Allah and His apostle that they should please Him, if they be believers indeed.\n",
        "TRANSLATION_11": "They swear to you by Allah, to please you; but Allah and His Apostle are worthier that they should please Him, should they be faithful.\n",
        "TRANSLATION_12": "To you they swear by Allah. In order to please you: But it is more fitting that they should please Allah and His Messenger, if they are Believers.\n",
        "TRANSLATION_13": "They swear by Allah to you (Muslims) in order to please you, but it is more fitting that they should please Allah and His Messenger (Muhammad SAW), if they are believers.\n",
        "TRANSLATION_14": "They swear in the Name of Allah in order to please you. But it is more just that they should please Allah and His Messenger if they are believers.\n",
        "TRANSLATION_15": "They swear to you by God to please you. But it is more proper for them to please God and His Messenger, if they are believers.\n",
        "TRANSLATION_16": "They swear by Allah to you [Muslims] to satisfy you. But Allah and His Messenger are more worthy for them to satisfy, if they should be believers.\n",
        "TRANSLATION_17": "[9:62] They swear by God to you, O believers, that what has reached you of the Messenger being injured they did not do, so that they might please you, but God and His Messenger are more deserving that they should please them, through obedience, if they are, true, believers (the merging of the pronouns into one [in yurdūhu, ‘their pleasing them’] is because the ‘pleasure’ of both [God and His Messenger] are mutually dependent; [either that] or it is because the predicate of Allāhu wa-rasūluhu, ‘God and His Messenger’, has been omitted).\n",
        "TRANSLATION_18": "201 (They swear by Allah to you (Muslims) to please you) about not joining you in the military expedition, (but Allah, with His messenger, hath more right that they should please Him if they are believers) if they were sincere in their faith.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "9:62",
            "9:13",
            "48:9",
            "3:132",
            "63:5",
            "48:28",
            "9:65",
            "3:32",
            "8:20",
            "57:8"
        ],
        "BIBLE": [
            "prophets:ezekiel:36:23",
            "writings:i%20chronicles:29:17",
            "prophets:isaiah:43:10",
            "writings:psalms:16:11",
            "prophets:isaiah:59:8",
            "prophets:ezekiel:14:23",
            "torah:deuteronomy:2:7",
            "prophets:joel:2:27",
            "prophets:malachi:1:10",
            "torah:deuteronomy:4:35"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:13",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:14"
        ]
    }
}