{
    "VERSE": "9:65",
    "ARABIC": "وَلَئِن سَأَلْتَهُمْ لَيَقُولُنَّ إِنَّمَا كُنَّا نَخُوضُ وَنَلْعَبُ قُلْ أَبِٱللَّهِ وَءَايَٰتِهِۦ وَرَسُولِهِۦ كُنتُمْ تَسْتَهْزِءُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "If you ask them they will say, 'We were only joking and playing around.' Say: 'Would you make a mockery of Allah and of His Signs and of His Messenger?",
        "TRANSLATION_1": "But if you ask them, they will say: \"We were only gossiping and jesting.\" You ask them: \"Were you jesting with God, His revelations and His messengers?\"\n",
        "TRANSLATION_2": "Should you question them what they were talking about, they would certainly say: \"We were merely jesting and being playful.\" Tell them: \"Was it Allah and His revelation and His Messenger that you were mocking?\"\n",
        "TRANSLATION_3": "If you question them about their manners, they say, \"We were only arguing for the sake of amusement.\" Ask them, \"Were you mocking God, His revelations, and His Messenger?\"\n",
        "TRANSLATION_4": "And if you ask them, they will say, “We were just having fun and pastime”; say, “What! You mock at Allah and His verses and His Noble Messenger?”\n",
        "TRANSLATION_5": "If you ask them (about this), they declare: \"We were only talking idly and joking.\" Say: \"Was it at Allah, and His Ayat and His Messenger that you were mocking\"\n",
        "TRANSLATION_6": "And if you should question them, they would certainly say: We were only idly discoursing and sporting. Say: Was it at Allah and His communications and His Apostle that you mocked?\n",
        "TRANSLATION_7": "And if thou questionest them, then assuredly they will say, 'We were only plunging and playing.' Say: 'What, then were you mocking God, and His signs, and His Messenger?\n",
        "TRANSLATION_8": "And if thou ask them (O Muhammad) they will say: We did but talk and jest. Say: Was it at Allah and His revelations and His messenger that ye did scoff?\n",
        "TRANSLATION_9": "If you ask them, they will say, \"We were only joking and playing with words.\" Say, \"Would you make a mockery of God and of His Revelations and of His Messenger?\n",
        "TRANSLATION_10": "Shouldst thou question them, they will surely say:: we were only plunging about and playing. Say thou: was it Allah and His signs and His apostle that ye have been mocking?\n",
        "TRANSLATION_11": "If you question them [regarding their conduct], they will surely say, ‘We were just gossiping and amusing ourselves.’ Say, ‘Were you deriding Allah, His signs, and His apostles?\n",
        "TRANSLATION_12": "If thou dost question them, they declare (with emphasis): \"We were only talking idly and in play.\" Say: \"Was it at Allah, and His Signs, and His Messenger, that ye were mocking?\"\n",
        "TRANSLATION_13": "If you ask them (about this), they declare: \"We were only talking idly and joking.\" Say: \"Was it at Allah, and His Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) and His Messenger (SAW) that you were mocking?\"\n",
        "TRANSLATION_14": "If you question them, they will say: 'We were only plunging and playing' Say: 'Were you mocking Allah, His verses, and His Messenger?\n",
        "TRANSLATION_15": "If you ask them, they will say, “We were just joking and playing.” Say, “Were you making jokes about God, His revelations, and His Messenger?”\n",
        "TRANSLATION_16": "And if you ask them, they will surely say, \"We were only conversing and playing.\" Say, \"Is it Allah and His verses and His Messenger that you were mocking?\"\n",
        "TRANSLATION_17": "[9:65] And if (la-in: the lām is for oaths) you question them, about their mockery of you and of the Qur’ān while they were journeying with you towards Tabūk, assuredly they will say, making excuses: ‘We were only engaging [in idle talk] and jesting’, in conversation, in order to pass [the time of] the road, and we did not mean it. Say, to them: ‘Were you then mocking God, and His signs, and His Messenger?\n",
        "TRANSLATION_18": "(And if thou ask them) Muhammad, about what they are laughing about (they will say: We did but talk) about the troop (and jest) and joke with each other. (Say) to them, Muhammad: (was it at Allah and His revelations) the Qur'an (and His Messenger that ye did scoff?)\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "9:65",
            "63:1",
            "11:33",
            "3:32",
            "6:109",
            "4:80",
            "3:132",
            "64:12",
            "24:54",
            "37:152"
        ],
        "BIBLE": [
            "writings:daniel:2:9",
            "prophets:ezekiel:12:23",
            "prophets:joshua:7:19",
            "writings:daniel:6:13",
            "writings:nehemiah:2:4",
            "torah:deuteronomy:4:10",
            "prophets:i%20kings:19:2",
            "prophets:joel:2:17",
            "writings:daniel:9:22",
            "writings:job:40:27"
        ]
    }
}