{
    "VERSE": "9:67",
    "ARABIC": "ٱلْمُنَٰفِقُونَ وَٱلْمُنَٰفِقَٰتُ بَعْضُهُم مِّنۢ بَعْضٍ يَأْمُرُونَ بِٱلْمُنكَرِ وَيَنْهَوْنَ عَنِ ٱلْمَعْرُوفِ وَيَقْبِضُونَ أَيْدِيَهُمْ نَسُوا۟ ٱللَّهَ فَنَسِيَهُمْ إِنَّ ٱلْمُنَٰفِقِينَ هُمُ ٱلْفَٰسِقُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "The men and women of the hypocrites are as bad as one another. They command what is wrong and forbid what is right and keep their fists tightly closed. They have forgotten Allah, so He has forgotten them. The hypocrites are deviators.",
        "TRANSLATION_1": "The hypocrites (are the same) whether men or women, the one of them being of the other. They encourage what is bad and dissuade from the good, and tighten their purses (when it comes to spending in the way of God). Of God they are oblivious; so He is oblivious of them. The hypocrites are indeed transgressors.\n",
        "TRANSLATION_2": "The hypocrites, be they men or women, are all alike. They enjoin what is evil, and forbid what is good, and withhold their hands from doing good. They forgot Allah, so Allah also forgot them. Surely the hypocrites are wicked.\n",
        "TRANSLATION_3": "Be they male or female hypocrites, they are the same. They make others commit sins, prevent them from doing good deeds, and restrain their hands (from spending for the cause of God). They have forgotten all about God who also has ignored them. The hypocrites indeed are evil-doers.\n",
        "TRANSLATION_4": "The hypocrite men and women are all the same; enjoining wrong and forbidding right, and being tight-fisted*; they have forgotten Allah, so Allah has forsaken them; indeed the hypocrites – it is they who are really disobedient. (* Not spending in Allah's cause)\n",
        "TRANSLATION_5": "The hypocrites, men and women, are one from another; they enjoin evil, and forbid the good, and they close their hands. They have forgotten Allah, so He has forgotten them. Verily, the hypocrites are the rebellious.\n",
        "TRANSLATION_6": "The hypocritical men and the hypocritical women are all alike; they enjoin evil and forbid good and withhold their hands; they have forsaken Allah, so He has forsaken them; surely the hypocrites are the transgressors.\n",
        "TRANSLATION_7": "The hypocrites, the men and the women, are as one another; they bid to dishonour, and forbid honour; they keep their hands shut; they have forgotten God, and He has forgotten them. The hypocrites -- they are the ungodly.\n",
        "TRANSLATION_8": "The hypocrites, both men and women, proceed one from another. They enjoin the wrong, and they forbid the right, and they withhold their hands (from spending for the cause of Allah). They forget Allah, so He hath forgotten them. Lo! the hypocrites, they are the transgressors.\n",
        "TRANSLATION_9": "The hypocrites, both men and women, are all alike. They enjoin what is evil, forbid what is right and they are niggardly when it comes to spending for the cause of God. They have forgotten God, so He has forgotten them. The hypocrites are the disobedient ones.\n",
        "TRANSLATION_10": "The hypocritical men and the hypocritical women are all of a piece; they command that which is disreputable and restrain from that which is reputable, and they tighten their hands. They neglected Allah, so He had neglected them. Verily the hypocrites! they are the ungodly ones.\n",
        "TRANSLATION_11": "The hypocrites, men and women, are all alike: they bid what is wrong and forbid what is right; and are tight-fisted. They have forgotten Allah, so He has forgotten them. The hypocrites are indeed the transgressors.\n",
        "TRANSLATION_12": "The Hypocrites, men and women, (have an understanding) with each other: They enjoin evil, and forbid what is just, and are close with their hands. They have forgotten Allah; so He hath forgotten them. Verily the Hypocrites are rebellious and perverse.\n",
        "TRANSLATION_13": "The hypocrites, men and women, are from one another, they enjoin (on the people) Al-Munkar (i.e. disbelief and polytheism of all kinds and all that Islam has forbidden), and forbid (people) from Al-Ma'ruf (i.e. Islamic Monotheism and all that Islam orders one to do), and they close their hands [from giving (spending in Allah's Cause) alms, etc.]. They have forgotten Allah, so He has forgotten them. Verily, the hypocrites are the Fasiqun (rebellious, disobedient to Allah).\n",
        "TRANSLATION_14": "Be they men or women, the hypocrites are all alike. They order what is evil, forbid what is just, and tighten their purse strings. They forsook Allah, so Allah forsook them. Surely, the hypocrites are evildoers.\n",
        "TRANSLATION_15": "The hypocrite men and hypocrite women are of one another. They advocate evil, and prohibit righteousness, and withhold their hands. They forgot God, so He forgot them. The hypocrites are the sinners.\n",
        "TRANSLATION_16": "The hypocrite men and hypocrite women are of one another. They enjoin what is wrong and forbid what is right and close their hands. They have forgotten Allah, so He has forgotten them [accordingly]. Indeed, the hypocrites - it is they who are the defiantly disobedient.\n",
        "TRANSLATION_17": "[9:67] The hypocrites, both men and women, are of one another, that is, they resemble one another in religion, as pieces of an individual entity, they enjoin indecency, unbelief and acts of disobedience, and forbid decency, faith and obedience; and they withhold their hands shut, from expending in obedience [of God]; they have forgotten God, they have abandoned obedience of Him, so He has forgotten them, He has deprived them of His grace. Truly the hypocrites, they are the wicked.\n",
        "TRANSLATION_18": "(The hypocrites, both men and women, proceed one from another) they follow inwardly each other's religion. (They enjoin the wrong) disbelief and opposition of the Messenger, (and they forbid the right) faith and compliance with the Messenger, (and they withhold their hands) from spending in works of goodness. (They forget Allah) they have left Allah's obedience inwardly, (so He hath forgotten them) He has forsaken them in the life of this world and left them in the Hereafter in hell. (Lo! the hypocrites, they are the transgressors) the disbelievers inwardly.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "9:67",
            "45:19",
            "3:50",
            "2:195",
            "39:66",
            "47:26",
            "22:10",
            "8:51",
            "3:182",
            "62:7"
        ],
        "BIBLE": [
            "prophets:ezekiel:3:20",
            "torah:exodus:36:6",
            "prophets:i%20kings:8:56",
            "writings:psalms:119:73",
            "writings:job:42:11",
            "torah:deuteronomy:26:13",
            "prophets:ezekiel:30:12",
            "writings:psalms:28:4",
            "prophets:ii%20samuel:13:6",
            "writings:i%20chronicles:24:19"
        ]
    }
}