{
    "VERSE": "9:69",
    "ARABIC": "كَٱلَّذِينَ مِن قَبْلِكُمْ كَانُوٓا۟ أَشَدَّ مِنكُمْ قُوَّةً وَأَكْثَرَ أَمْوَٰلًا وَأَوْلَٰدًا فَٱسْتَمْتَعُوا۟ بِخَلَٰقِهِمْ فَٱسْتَمْتَعْتُم بِخَلَٰقِكُمْ كَمَا ٱسْتَمْتَعَ ٱلَّذِينَ مِن قَبْلِكُم بِخَلَٰقِهِمْ وَخُضْتُمْ كَٱلَّذِى خَاضُوٓا۟ أُو۟لَٰٓئِكَ حَبِطَتْ أَعْمَٰلُهُمْ فِى ٱلدُّنْيَا وَٱلْءَاخِرَةِ وَأُو۟لَٰٓئِكَ هُمُ ٱلْخَٰسِرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Like those before you who had greater strength than you and more wealth and children. They enjoyed their portion; so enjoy your portion as those before you enjoyed theirs. You have plunged into defamation as they plunged into it. The actions of such people come to nothing in this world or the Next World. They are the lost.",
        "TRANSLATION_1": "Like those before you who were greater in strength, had more wealth and children than you, who enjoyed their lot in this world, as you have enjoyed your share like them. You indulge in idle talk, as they had indulged in vain discourse. Yet nothing of what they did remains in this world or will in the next, and they are the losers.\n",
        "TRANSLATION_2": "Your ways are like the ways of those who have gone before you. They were mightier than you in power, and more abundant in riches and children. They enjoyed their lot for a while as you have enjoyed your lot, and you also engaged in idle talk as they did. Their works have come to naught in this world, and in the Hereafter they are surely the losers.\n",
        "TRANSLATION_3": "like that of those who lived before you, whose power, wealth, and children were much greater than yours. They enjoyed their share of the worldly gains and you, also, like them, have enjoyed yours. You have been sneaking among the people to cause trouble, just as they had been doing before you. Such people's deeds are devoid of all virtue both in this life and in the life hereafter. They indeed are lost.\n",
        "TRANSLATION_4": "Like those who were before you – they were mightier than you in strength, and had more wealth and children than you; so they spent their portion – you spent your portion just as those before you spent their portion and you fell into shame (sin) like they had fallen into shame; their deeds have been wasted in the world and in the Hereafter; it is they who are the losers.\n",
        "TRANSLATION_5": "Like those before you: they were mightier than you in power, and more abundant in wealth and children. They had enjoyed their portion (a while), so enjoy your portion (a while) as those before you enjoyed their portion (a while); and you indulged in play and pastime as they indulged in play and pastime. Such are they whose deeds are in vain in this world and in the Hereafter. Such are they who are the losers.\n",
        "TRANSLATION_6": "Like those before you; they were stronger than you in power and more abundant in wealth and children, so they enjoyed their portion; thus have you enjoyed your portion as those before you enjoyed their portion; and you entered into vain discourses like the vain discourses in which entered those before you. These are they whose works are null in this world and the hereafter, and these are they who are the losers.\n",
        "TRANSLATION_7": "those before you, who were stronger than you in might, and more abundant in wealth and children; they took enjoyment in their share; so do you take enjoyment in your share, as those before you took enjoyment in their share. You have plunged as they plunged. Those -- their works have failed in this world and in the world to come; those -- they are the losers.\n",
        "TRANSLATION_8": "Even as those before you who were mightier than you in strength, and more affluent than you in wealth and children. They enjoyed their lot awhile, so ye enjoy your lot awhile even as those before you did enjoy their lot awhile. And ye prate even as they prated. Such are they whose works have perished in the world and the Hereafter. Such are they who are the losers.\n",
        "TRANSLATION_9": "Like those before you who were stronger than you, possessed more wealth and children; they enjoyed their share in this life as you have enjoyed yours; like them, you have indulged in idle talk. It is they whose works shall come to nothing in this world and in the life to come -- and it is they who shall be the losers.\n",
        "TRANSLATION_10": "Like ye are unto those before you: mightier were they than you in prowess and more abundant in riches and children. They enjoyed their portion awhile, so enjoy your portion awhile even as those before you enjoyed their portion awhile, and ye plunged about even as they plunged about. Those! their works have come to naught in the world and the Hereafter, and those! they are the losers.\n",
        "TRANSLATION_11": "[Hypocrites! Your case is] similar to those who were before you, who were more powerful than you and more abounding in wealth and children: they enjoyed their share [of worldly existence]; you too enjoy your share, just like those who were before you enjoyed their share, and you have gossiped [impiously] as they gossiped. They are the ones whose works have failed in this world and the Hereafter; and it is they who are the losers.\n",
        "TRANSLATION_12": "As in the case of those before you: they were mightier than you in power, and more flourishing in wealth and children. They had their enjoyment of their portion: and ye have of yours, as did those before you; and ye indulge in idle talk as they did. They!- their work are fruitless in this world and in the Hereafter, and they will lose (all spiritual good).\n",
        "TRANSLATION_13": "Like those before you, they were mightier than you in power, and more abundant in wealth and children. They had enjoyed their portion awhile, so enjoy your portion awhile as those before you enjoyed their portion awhile; and you indulged in play and pastime (and in telling lies against Allah and His Messenger Muhammad SAW) as they indulged in play and pastime. Such are they whose deeds are in vain in this world and in the Hereafter. Such are they who are the losers.\n",
        "TRANSLATION_14": "You are like those before you. They were stronger than you in might, and had greater riches and more children. They took enjoyment in their share, so do you take enjoyment in your share as those before you took enjoyment in their share. You have plunged as they plunged. Those, their works are annulled, failed in this world and in the Everlasting Life, those, they are the losers.\n",
        "TRANSLATION_15": "Like those before you. They were more powerful than you, and had more wealth and children. They enjoyed their share, and you enjoyed your share, as those before you enjoyed their share. And you indulged, as they indulged. It is they whose works will fail in this world and in the Hereafter. It is they who are the losers.\n",
        "TRANSLATION_16": "[You disbelievers are] like those before you; they were stronger than you in power and more abundant in wealth and children. They enjoyed their portion [of worldly enjoyment], and you have enjoyed your portion as those before you enjoyed their portion, and you have engaged [in vanities] like that in which they engaged. [It is] those whose deeds have become worthless in this world and in the Hereafter, and it is they who are the losers.\n",
        "TRANSLATION_17": "[9:69] You, O hypocrites, are, like those before you, who were far mightier than you, and more abundant in wealth and children. They enjoyed their share, their lot in this world. So you enjoy, O hypocrites, your share, just as those before you enjoyed their share, and you indulge [in vain talk], in falsehood and defamation of the Prophet (s), just as they indulged [in vain talk]. Those, their works have become invalid in this world and in the Hereafter; and those, they indeed are the losers.\n",
        "TRANSLATION_18": "(Even as those) even as the punishment of those (before you) of hypocrites who (were mightier than you in strength) physically, (and more affluent than you in wealth and children. They enjoyed their lot awhile) they expend their share of the Hereafter in the life of this world, (so ye enjoy your lot awhile) you expended your share of the Hereafter in the life of this world (even as those before you) of hypocrites (did enjoy) expend (their lot awhile) their share of the Hereafter in the life of this world. (And ye prate) speak falsehood (even as they prated) and inwardly gave the lie to Muhammad (pbuh) just as those before them indulged in falsehood and gave the lie to the prophets of Allah. (Such are they whose works have perished) their good works have been thwarted (in the world and the Hereafter. Such are they who are the losers) in that they will face punishment. 202\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "9:69",
            "3:22",
            "40:82",
            "2:4",
            "34:35",
            "40:21",
            "30:9",
            "3:56",
            "2:200",
            "23:33"
        ],
        "BIBLE": [
            "prophets:i%20samuel:11:7",
            "prophets:joshua:6:20",
            "prophets:ii%20kings:2:9",
            "prophets:ii%20kings:2:14",
            "writings:nehemiah:9:25",
            "writings:psalms:78:4",
            "writings:ii%20chronicles:20:25",
            "torah:exodus:34:34",
            "prophets:judges:14:9",
            "prophets:i%20kings:16:31"
        ]
    }
}