{
    "VERSE": "9:7",
    "ARABIC": "كَيْفَ يَكُونُ لِلْمُشْرِكِينَ عَهْدٌ عِندَ ٱللَّهِ وَعِندَ رَسُولِهِۦٓ إِلَّا ٱلَّذِينَ عَٰهَدتُّمْ عِندَ ٱلْمَسْجِدِ ٱلْحَرَامِ فَمَا ٱسْتَقَٰمُوا۟ لَكُمْ فَٱسْتَقِيمُوا۟ لَهُمْ إِنَّ ٱللَّهَ يُحِبُّ ٱلْمُتَّقِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "How could any of the idolaters possibly have a treaty with Allah and with His Messenger, except for those you made a treaty with at the Masjid al-Haram? As long as they are straight with you, be straight with them. Allah loves those who have taqwa.",
        "TRANSLATION_1": "How could there be a treaty between idolaters and God and His Apostle, except those you covenanted by the Sacred Mosque? Therefore as long as they are honest with you be correct with them, for God loves those who are godly.\n",
        "TRANSLATION_2": "How can there be a covenant with those who associate others with Allah in His Divinity be binding upon Allah and His Messenger, excepting those with whom you made a covenant near the Sacred Mosque? Behave in a straight manner with them so long as they behave with you in a straight manner for Allah loves the Godfearing.\n",
        "TRANSLATION_3": "How can the pagans, except those with whom you have established a peace treaty in the precinct of the Sacred Mosque, have a covenant with God and His Messenger? If they respect the pact, you too should also follow its terms. God loves the pious ones.\n",
        "TRANSLATION_4": "How can there be a treaty with Allah and with His Noble Messenger for the polytheists, except for those with whom you made a treaty near the Sacred Mosque? So as long as they remain firm on the treaty for you, you too remain firm for them; indeed Allah is pleased with the pious.\n",
        "TRANSLATION_5": "How can there be a covenant with Allah and with His Messenger for the Mushrikin except those with whom you made a covenant near Al-Masjid Al-Haram (at Makkah) So long as they are true to you, stand you true to them. Verily, Allah loves those who have Taqwa.\n",
        "TRANSLATION_6": "How can there be an agreement for the idolaters with Allah and with His Apostle; except those with whom you made an agreement at the Sacred Mosque? So as long as they are true to you, be true to them; surely Allah loves those who are careful (of their duty).\n",
        "TRANSLATION_7": "How should the idolaters have a covenant with God and His Messenger? -- excepting those with whom you made covenant at the Holy Mosque; so long as they go straight with you, do you go straight with them; surely God loves the godfearing.\n",
        "TRANSLATION_8": "How can there be a treaty with Allah and with His messenger for the idolaters save those with whom ye made a treaty at the Inviolable Place of Worship? So long as they are true to you, be true to them. Lo! Allah loveth those who keep their duty.\n",
        "TRANSLATION_9": "How can there be a treaty with the polytheists on the part of God and His Messenger, except for those with whom you entered into a treaty at the Sacred Mosque? As long as they act straight with you, act straight with them. God loves those who are righteous.\n",
        "TRANSLATION_10": "How can there be for the associators covenant with Allah. and His apostle save for those with whom ye covenanted near the Sacred Mosque? Act straight with them so long as they act straight with you. Verily Allah loveth the God-fearing.\n",
        "TRANSLATION_11": "How shall the polytheists have any [valid] treaty with Allah and His Apostle?! (Barring those with whom you made a treaty at the Holy Mosque; so long as they are steadfast with you, be steadfast with them. Indeed Allah loves the Godwary.)\n",
        "TRANSLATION_12": "How can there be a league, before Allah and His Messenger, with the Pagans, except those with whom ye made a treaty near the sacred Mosque? As long as these stand true to you, stand ye true to them: for Allah doth love the righteous.\n",
        "TRANSLATION_13": "How can there be a covenant with Allah and with His Messenger for the Mushrikun (polytheists, idolaters, pagans, disbelievers in the Oneness of Allah) except those with whom you made a covenant near Al-Masjid-al-Haram (at Makkah)? So long, as they are true to you, stand you true to them. Verily, Allah loves Al-Muttaqun (the pious - see V. 2:2).\n",
        "TRANSLATION_14": "How can the idolaters have any treaty with Allah and His Messenger, except those with whom you have made treaties by the Sacred Mosque? So long as they are straight with you, so be straight with them. Allah loves the righteous.\n",
        "TRANSLATION_15": "How can there be a treaty with the polytheists on the part of God and His Messenger, except for those with whom you made a treaty at the Sacred Mosque? As long as they are upright with you, be upright with them. God loves the pious.\n",
        "TRANSLATION_16": "How can there be for the polytheists a treaty in the sight of Allah and with His Messenger, except for those with whom you made a treaty at al-Masjid al-Haram? So as long as they are upright toward you, be upright toward them. Indeed, Allah loves the righteous [who fear Him].\n",
        "TRANSLATION_17": "[9:7] How can the idolaters have a pact with God and His Messenger — they cannot —while they disbelieve in God and His Messenger, acting treacherously; except for those with whom you made a pact at the Sacred   Mosque?, the day of al-Hudaybiyya — these were Quraysh, for whom an exception was made earlier [Q. 9:4]. So long as they are true to you, keeping to the pact and not breaking it, be true to them, by fulfilling it (fa-mā, ‘so long as’: the mā is a conditional particle). Truly God loves the God-fearing: the Prophet (s) had kept to the pact made with them until they broke it by supporting the Banū Bakr against Khuzā‘a.\n",
        "TRANSLATION_18": "(How) this is said by way of astonishment (can there be a treaty with Allah and with His messenger for the idolaters save those with whom ye made a treaty at the Inviolable Place of Worship?) after the year of al- Hudaybiyyah, the reference here is to the Banu Kinanah. (So long as they are true to you) in that they honour their treaty, (be true to them) completely. (Lo! Allah loveth those who keep their duty) and abstain from breaking their treaties.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "9:7",
            "9:107",
            "2:80",
            "8:34",
            "72:18",
            "9:4",
            "24:54",
            "63:7",
            "48:13",
            "4:61"
        ],
        "BIBLE": [
            "writings:ii%20chronicles:30:5",
            "writings:ezra:9:15",
            "torah:deuteronomy:17:2",
            "prophets:ezekiel:5:8",
            "torah:numbers:10:9",
            "prophets:isaiah:28:18",
            "prophets:joshua:14:9",
            "prophets:ezekiel:46:2",
            "prophets:joshua:3:3",
            "prophets:ezekiel:46:9"
        ]
    }
}