{
    "VERSE": "9:8",
    "ARABIC": "كَيْفَ وَإِن يَظْهَرُوا۟ عَلَيْكُمْ لَا يَرْقُبُوا۟ فِيكُمْ إِلًّا وَلَا ذِمَّةً يُرْضُونَكُم بِأَفْوَٰهِهِمْ وَتَأْبَىٰ قُلُوبُهُمْ وَأَكْثَرُهُمْ فَٰسِقُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "How indeed! For if they get the upper hand over you, they will respect neither kinship nor treaty. They please you with their mouths but their hearts belie their words. Most of them are deviators.",
        "TRANSLATION_1": "How (can they be trusted)? If they prevail against you they will neither observe pacts nor good faith with you. They flatter you with their tongues, but their hearts are averse to you, for most of them are iniquitous.\n",
        "TRANSLATION_2": "How can there be any covenant with the other polytheists for were they to prevail against you, they will respect neither kinship nor agreement. They seek to please you with their tongues while their hearts are averse to you, and most of them are wicked.\n",
        "TRANSLATION_3": "How could God and His Messenger grant them (pagans) peace when if they were to acquire superiority over you, they would respect none of the peace treaties nor their kindred relations with you! They only try to please you by paying lip-service to you but their hearts are against you and most of them are evil-doers.\n",
        "TRANSLATION_4": "Therefore how – when they are such that if they gain control over you, they would not have regard for any relations nor for any treaty? They please you with their mouths whereas their hearts contain rejection; and most of them are disobedient.\n",
        "TRANSLATION_5": "How When if you are overpowered by them, they regard not the ties, either of kinship, (Ill) or of covenant (Dhimmah) With their mouths they please you, but their hearts are averse to you, and most of them are rebellious.\n",
        "TRANSLATION_6": "How (can it be)! while if they prevail against you, they would not pay regard in your case to ties of relationship, nor those of covenant; they please you with their mouths while their hearts do not consent; and most of them are transgressors.\n",
        "TRANSLATION_7": "How? If they get the better of you, they will not observe towards you any bond or treaty, giving you satisfaction with their mouths but in their hearts refusing; and the most of them are ungodly.\n",
        "TRANSLATION_8": "How (can there be any treaty for the others) when, if they have the upper hand of you, they regard not pact nor honour in respect of you? They satisfy you with their mouths the while their hearts refuse. And most of them are wrongdoers.\n",
        "TRANSLATION_9": "How [can there be a treaty] for, if they get the upper hand over you, they will respect neither kinship nor covenant. They [try to] please you with their tongues but their hearts reject you; most of them are perfidious.\n",
        "TRANSLATION_10": "How indeed! whereas if they get the better of you they respect not regarding you either kinship or agreement. They please you with their mouth, the while their hearts refuse; and most of them are Ungodly.\n",
        "TRANSLATION_11": "How? For if, they get the better of you, they will observe toward you neither kinship nor covenant. They please you with their mouths while their hearts spurn you; and most of them are transgressors.\n",
        "TRANSLATION_12": "How (can there be such a league), seeing that if they get an advantage over you, they respect not in you the ties either of kinship or of covenant? With (fair words from) their mouths they entice you, but their hearts are averse from you; and most of them are rebellious and wicked.\n",
        "TRANSLATION_13": "How (can there be such a covenant with them) that when you are overpowered by them, they regard not the ties, either of kinship or of covenant with you? With (good words from) their mouths they please you, but their hearts are averse to you, and most of them are Fasiqun (rebellious, disobedient to Allah).\n",
        "TRANSLATION_14": "How? If they prevail against you they will respect neither agreements nor ties of kindred. They satisfy you with their tongues, but their hearts are averse; and most of them are wicked.\n",
        "TRANSLATION_15": "How? Whenever they overcome you, they respect neither kinship nor treaty with you. They satisfy you with lip service, but their hearts refuse, and most of them are immoral.\n",
        "TRANSLATION_16": "How [can there be a treaty] while, if they gain dominance over you, they do not observe concerning you any pact of kinship or covenant of protection? They satisfy you with their mouths, but their hearts refuse [compliance], and most of them are defiantly disobedient.\n",
        "TRANSLATION_17": "[9:8] How, can they have a pact, when, if they get the better of you, [if] they have the upper hand over you, they do not respect, [they do not] take into consideration, any bond, kinship, or treaty, pact, with regard to you, but will instead harm you as much as they can (the conditional sentence [‘if they …’] is [also] a circumstantial qualifier), pleasing you with their tongues, with charming words, while their hearts refuse, to be true to these [words]; and most of them are wicked, violators of pacts.\n",
        "TRANSLATION_18": "(How) this is also said by way of astonishment: how can there be any treaty between you and them (when, if they have the upper hand of you) they were to conquer you, (they regard no pact) they would have no regard for the ties of kinship relating you ; it is also said: they would have no regard for you in respect of Allah (nor honour about you?) because of the treaty between you. (They satisfy you with their mouths) with their tongues (the while their hearts refuse) while their hearts are averse to it. (And most of them) all of them (are wrong-doers) breakers of treaties.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "9:8",
            "12:106",
            "6:46",
            "9:10",
            "30:42",
            "2:28",
            "9:77",
            "18:68",
            "45:26",
            "4:50"
        ],
        "BIBLE": [
            "writings:ezra:9:13",
            "prophets:isaiah:50:4",
            "torah:leviticus:10:17",
            "prophets:i%20kings:3:12",
            "writings:ecclesiastes:1:13",
            "prophets:joshua:23:16",
            "torah:genesis:38:14",
            "prophets:i%20kings:3:9",
            "writings:psalms:119:34",
            "torah:numbers:32:9"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:4:4"
        ]
    }
}