{
    "VERSE": "9:84",
    "ARABIC": "وَلَا تُصَلِّ عَلَىٰٓ أَحَدٍ مِّنْهُم مَّاتَ أَبَدًا وَلَا تَقُمْ عَلَىٰ قَبْرِهِۦٓ إِنَّهُمْ كَفَرُوا۟ بِٱللَّهِ وَرَسُولِهِۦ وَمَاتُوا۟ وَهُمْ فَٰسِقُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Never pray over any of them who die or stand at their graves. They rejected Allah and His Messenger and died as deviators.",
        "TRANSLATION_1": "Do not invoke blessings on any of them who die, nor stand to pray at their graves, for they disbelieved in God and His Prophet, and died transgressors.\n",
        "TRANSLATION_2": "Do not ever pray over any of them who dies, nor stand over his grave. They disbelieved in Allah and His Messenger and died in iniquity.\n",
        "TRANSLATION_3": "Should any of them die, never pray for him or stand on his grave. They have disbelieved in God and His Messenger and have died while committing evil.\n",
        "TRANSLATION_4": "And never offer funeral prayers for any of them* who dies, nor stand by his grave**; indeed they disbelieved in Allah and His Noble Messenger, and they died as sinners. (* It is forbidden to offer funeral prayers for the hypocrites. ** To ask forgiveness for them).\n",
        "TRANSLATION_5": "And never (O Muhammad) pray (funeral prayer) for any of them (hypocrites) who dies, nor stand at his grave. Certainly they disbelieved in Allah and His Messenger, and died while they were Fasiqun.\n",
        "TRANSLATION_6": "And never offer prayer for any one of them who dies and do not stand by his grave; surely they disbelieve in Allah and His Apostle and they shall die in transgression.\n",
        "TRANSLATION_7": "And pray thou never over any one of them when he is dead, nor stand over his grave; they disbelieved in God and His Messenger, and died while they were ungodly.\n",
        "TRANSLATION_8": "And never (O Muhammad) pray for one of them who dieth, nor stand by his grave. Lo! they disbelieved in Allah and His messenger, and they died while they were evil-doers.\n",
        "TRANSLATION_9": "And never [O Muhammad] pray for one of them who dies, nor stand by his grave. For they denied God and His Messenger, and died rebellious.\n",
        "TRANSLATION_10": "And pray thou not ever over any of them that may die nor stand thou over his grave. Verily they have disbelieved in Allah and His apostle and died while they were ungodly.\n",
        "TRANSLATION_11": "And never pray over any of them when he dies, nor stand at his graveside. They indeed defied Allah and His Apostle and died as transgressors.\n",
        "TRANSLATION_12": "Nor do thou ever pray for any of them that dies, nor stand at his grave; for they rejected Allah and His Messenger, and died in a state of perverse rebellion.\n",
        "TRANSLATION_13": "And never (O Muhammad SAW) pray (funeral prayer) for any of them (hypocrites) who dies, nor stand at his grave. Certainly they disbelieved in Allah and His Messenger, and died while they were Fasiqun (rebellious, - disobedient to Allah and His Messenger SAW).\n",
        "TRANSLATION_14": "You shall never pray over any one of them when he is dead, nor stand over his tomb. For they disbelieved in Allah and His Messenger and died whilst they were sinners.\n",
        "TRANSLATION_15": "You are never to pray over anyone of them who dies, nor are you to stand at his graveside. They rejected God and His Messenger, and died while they were sinners.\n",
        "TRANSLATION_16": "And do not pray [the funeral prayer, O Muhammad], over any of them who has died - ever - or stand at his grave. Indeed, they disbelieved in Allah and His Messenger and died while they were defiantly disobedient.\n",
        "TRANSLATION_17": "[9:84] When the Prophet (s) prayed over [the dead body of ‘Abd Allāh] Ibn Ubayy, the following was revealed: And never pray over any one of them when he is dead, nor stand over his grave, at a burial or as a visit; lo! they disbelieved in God and His Messenger, and died while they were wicked, [they died] disbelieving.\n",
        "TRANSLATION_18": "(And never (0 Muhammad) pray for one of them who dieth) i.e. any of the hypocrites after the death of 'Abdullah Ibn Ubayy, (nor stand by his grave. Lo! they disbelieved in Allah and His messenger) in secret, (and they died while they were evil-doers) hypocrites.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "9:84",
            "33:39",
            "18:38",
            "8:20",
            "3:153",
            "4:164",
            "72:22",
            "63:1",
            "63:5",
            "4:42"
        ],
        "BIBLE": [
            "prophets:ezekiel:33:13",
            "prophets:jonah:4:2",
            "torah:genesis:50:17",
            "prophets:ezekiel:18:28",
            "writings:i%20chronicles:10:13",
            "prophets:ezekiel:3:20",
            "prophets:jeremiah:16:10",
            "prophets:micah:7:18",
            "prophets:ezekiel:33:8",
            "torah:genesis:20:7"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:4:1"
        ]
    }
}