{
    "VERSE": "9:87",
    "ARABIC": "رَضُوا۟ بِأَن يَكُونُوا۟ مَعَ ٱلْخَوَالِفِ وَطُبِعَ عَلَىٰ قُلُوبِهِمْ فَهُمْ لَا يَفْقَهُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "They are pleased to be with those who stay behind. Their hearts have been stamped so they do not understand.",
        "TRANSLATION_1": "They prefer to be with women who (are allowed to) stay at home during war, and their hearts are sealed; so they fail to understand.\n",
        "TRANSLATION_2": "They were content to stay behind with the womenfolk. Their hearts were sealed, leaving them bereft of understanding.\n",
        "TRANSLATION_3": "They are happy to stay home with those who are of no help in the battle, thus, their hearts were sealed and they were left with no understanding.\n",
        "TRANSLATION_4": "They preferred to be with the women who stay behind, and their hearts have been sealed, so they do not understand.\n",
        "TRANSLATION_5": "They are content to be with those who sit behind. Their hearts are sealed up, so they understand not.\n",
        "TRANSLATION_6": "They preferred to be with those who remained behind, and a seal is set on their hearts so they do not understand.\n",
        "TRANSLATION_7": "They are well-pleased to be with those behind, and a seal has been set upon their hearts, so the they understand not.\n",
        "TRANSLATION_8": "They are content that they should be with the useless and their hearts are sealed, so that they apprehend not.\n",
        "TRANSLATION_9": "They preferred to be with [the women], who remained behind [at home]: their hearts are sealed and so they do not understand.\n",
        "TRANSLATION_10": "Pleased are they that they should be with the women sitters-at-home, and their hearts are sealed up, so they understand not.\n",
        "TRANSLATION_11": "They are pleased to be with those who stay back, and their hearts have been sealed. So they do not understand.\n",
        "TRANSLATION_12": "They prefer to be with (the women), who remain behind (at home): their hearts are sealed and so they understand not.\n",
        "TRANSLATION_13": "They are content to be with those (the women) who sit behind (at home). Their hearts are sealed up (from all kinds of goodness and right guidance), so they understand not.\n",
        "TRANSLATION_14": "They were content to be with those who stayed behind, a seal was set upon their hearts, so they do not understand.\n",
        "TRANSLATION_15": "They prefer to be with those who stay behind. Their hearts were sealed, so they do not understand.\n",
        "TRANSLATION_16": "They were satisfied to be with those who stay behind, and their hearts were sealed over, so they do not understand.\n",
        "TRANSLATION_17": "[9:87] They are content to be with those who stay behind (khawālif is the plural of khālifa, meaning the women who ‘stay behind’ [takhallafna] at home) and a seal has been set upon their hearts, so they do not understand, [what is] good.\n",
        "TRANSLATION_18": "(They are content that they should be with the useless) with the women and children (and their hearts are sealed, so that they apprehend not) the command of Allah.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "9:87",
            "9:93",
            "5:113",
            "63:3",
            "16:22",
            "26:194",
            "27:85",
            "13:28",
            "47:24",
            "7:100"
        ],
        "BIBLE": [
            "writings:proverbs:8:5",
            "prophets:isaiah:44:18",
            "writings:ii%20chronicles:32:31",
            "writings:job:34:10",
            "prophets:ii%20kings:10:30",
            "writings:psalms:27:3",
            "writings:proverbs:3:5",
            "writings:proverbs:18:2",
            "writings:proverbs:14:14",
            "prophets:jeremiah:3:15"
        ]
    }
}