{
    "VERSE": "9:9",
    "ARABIC": "ٱشْتَرَوْا۟ بِـَٔايَٰتِ ٱللَّهِ ثَمَنًا قَلِيلًا فَصَدُّوا۟ عَن سَبِيلِهِۦٓ إِنَّهُمْ سَآءَ مَا كَانُوا۟ يَعْمَلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "They have sold Allah's Signs for a paltry price, and they have barred access to His Way. What they have done is truly evil.",
        "TRANSLATION_1": "They barter away the words of God for a petty price, and obstruct (others) from His path. How evil indeed are the things they do!\n",
        "TRANSLATION_2": "They have sold the revelations of Allah for a paltry price and have firmly hindered people from His Path. Evil indeed is what they have done.\n",
        "TRANSLATION_3": "They have sold God's revelations for a paltry price and have created obstacles in the way of God. What they have done is evil.\n",
        "TRANSLATION_4": "They exchanged the verses of Allah for an abject price, therefore prevented from His way; indeed what they do is extremely evil.\n",
        "TRANSLATION_5": "They have purchased with the Ayat of Allah a little gain, and they hindered men from His way; evil indeed is that which they used to do.\n",
        "TRANSLATION_6": "They have taken a small price for the communications of Allah, so they turn away from His way; surely evil is it that they do.\n",
        "TRANSLATION_7": "They have sold the signs of God for a small price, and have barred from His way; truly evil is that they have been doing,\n",
        "TRANSLATION_8": "They have purchased with the revelations of Allah a little gain, so they debar (men) from His way. Lo! evil is that which they are wont to do.\n",
        "TRANSLATION_9": "They have sold God's revelations for a paltry price, and barred others from His path. How evil is what they have been doing!\n",
        "TRANSLATION_10": "They have bartered the revelations of Allah for a small price, so they keep back from His path. Verily vile is that which they have been working.\n",
        "TRANSLATION_11": "They have sold the signs of Allah for a paltry gain, and have barred [the people] from His way. Evil indeed is what they have been doing.\n",
        "TRANSLATION_12": "The Signs of Allah have they sold for a miserable price, and (many) have they hindered from His way: evil indeed are the deeds they have done.\n",
        "TRANSLATION_13": "They have purchased with the Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) of Allah a little gain, and they hindered men from His Way; evil indeed is that which they used to do.\n",
        "TRANSLATION_14": "They sell the verses of Allah for a small price and bar others from His Path. Evil is what they have been doing.\n",
        "TRANSLATION_15": "They traded away God's revelations for a cheap price, so they barred others from His path. How evil is what they did.\n",
        "TRANSLATION_16": "They have exchanged the signs of Allah for a small price and averted [people] from His way. Indeed, it was evil that they were doing.\n",
        "TRANSLATION_17": "[9:9] They have purchased with the signs of God, the Qur’ān, a small price, of this world, that is, they have refrained from following them in favour of passions and whims, and have barred [people] from His way, His religion. Truly evil is that, deed of theirs, which they are wont to do.\n",
        "TRANSLATION_18": "(They have purchased with the revelations of Allah) i.e. Muhammad (pbuh) and the Qur'an (a little gain) a small profit, (so they debar (men) from His way) from His religion and obedience. (Lo! evil is that which they are wont to do) evil is that which they used to do of concealment and other things. It is also said that this verse was revealed about the Jews.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "9:9",
            "63:2",
            "61:4",
            "3:199",
            "47:1",
            "2:41",
            "16:95",
            "16:104",
            "4:167",
            "4:160"
        ],
        "BIBLE": [
            "prophets:ii%20kings:23:16",
            "writings:ii%20chronicles:15:8",
            "writings:ecclesiastes:3:14",
            "prophets:jeremiah:23:2",
            "torah:deuteronomy:1:23",
            "writings:psalms:119:9",
            "prophets:i%20samuel:30:19",
            "prophets:zephaniah:3:15",
            "prophets:isaiah:57:1",
            "prophets:jeremiah:51:56"
        ]
    }
}