{
    "VERSE": "9:90",
    "ARABIC": "وَجَآءَ ٱلْمُعَذِّرُونَ مِنَ ٱلْأَعْرَابِ لِيُؤْذَنَ لَهُمْ وَقَعَدَ ٱلَّذِينَ كَذَبُوا۟ ٱللَّهَ وَرَسُولَهُۥ سَيُصِيبُ ٱلَّذِينَ كَفَرُوا۟ مِنْهُمْ عَذَابٌ أَلِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "The desert arabs came with their excuses asking for permission to stay, and those who lied to Allah and His Messenger stayed behind. A painful punishment will afflict those among them who are kafir.",
        "TRANSLATION_1": "Some Arabs of the desert came with ready excuses, asking for leave to stay behind. But those who had lied to God and His Prophet stayed at home doing nothing. So the punishment for those who disbelieve among them will be painful.\n",
        "TRANSLATION_2": "Many of the bedouin Arabs came with excuses, seeking leave to stay behind. Thus those who were false to Allah and His Messenger in their covenant remained behind. A painful chastisement shall befall those of them that disbelieved.\n",
        "TRANSLATION_3": "Some of the dwellers of the desert (who were not able to join the army) came to the Prophet seeking exemption from taking part in the battle. Those who called God and His Messengers liars also stayed home (with those who were truly exempt). The disbelievers will soon receive a painful punishment.\n",
        "TRANSLATION_4": "And came the ignorant* who make excuses seeking exemption, and those who lied to Allah and His Noble Messenger remained seated; a painful punishment will soon reach the disbelievers among them. (* of faith)\n",
        "TRANSLATION_5": "And those who made excuses from the bedouins came asking your permission to exempt them (from the battle), and those who had lied to Allah and His Messenger sat at home (without asking the permission for it); a painful torment will seize those of them who disbelieve.\n",
        "TRANSLATION_6": "And the defaulters from among the dwellers of the desert came that permission may be given to them and they sat (at home) who lied to Allah and His Apostle; a painful chastisement shall afflict those of them who disbelieved.\n",
        "TRANSLATION_7": "And the Bedouins came with their excuses, asking for leave; those who lied to God and His Messenger tarried; there shall befall the unbelievers of them a painful chastisement.\n",
        "TRANSLATION_8": "And those among the wandering Arabs who had an excuse came in order that permission might be granted them. And those who lied to Allah and His messenger sat at home. A painful doom will fall on those of them who disbelieve.\n",
        "TRANSLATION_9": "Some of the desert Arabs, too, came to make excuses, asking to be granted exemption. Those who lied to God and His Messenger stayed behind at home. Those who denied the truth among them will be afflicted with a painful chastisement,\n",
        "TRANSLATION_10": "And there came the apologists from among dwellers of the desert men praying that leave may be given them and those Who had lied unto Allah and His apostle sat at home. An afflictive torment shall afflict those of them who disbelieve.\n",
        "TRANSLATION_11": "Some of the Bedouins who sought to be excused came, so that they may be granted leave [to stay back]; while those who lied to Allah and His Apostle sat back. Soon there shall visit the faithless among them a painful punishment.\n",
        "TRANSLATION_12": "And there were, among the desert Arabs (also), men who made excuses and came to claim exemption; and those who were false to Allah and His Messenger (merely) sat inactive. Soon will a grievous penalty seize the Unbelievers among them.\n",
        "TRANSLATION_13": "And those who made excuses from the bedouins came (to you, O Prophet SAW) asking your permission to exempt them (from the battle), and those who had lied to Allah and His Messenger sat at home (without asking the permission for it); a painful torment will seize those of them who disbelieve.\n",
        "TRANSLATION_14": "Some Arabs of the desert who had an excuse came asking permission to stay behind; whilst those who belied Allah and His Messenger remained behind. A painful punishment shall fall on those of them that disbelieved.\n",
        "TRANSLATION_15": "Some of the Desert-Arabs came to make excuses, asking to be granted exemption, while those who were untrue to God and His Messenger stayed behind. A painful punishment will afflict those among them who disbelieved.\n",
        "TRANSLATION_16": "And those with excuses among the bedouins came to be permitted [to remain], and they who had lied to Allah and His Messenger sat [at home]. There will strike those who disbelieved among them a painful punishment.\n",
        "TRANSLATION_17": "[9:90] And those Bedouins who had an excuse (al-mu‘adhdhirūn: the original tā’ has been assimilated with the dāl, in other words [it would usually be read as] al-mu‘tadhirūn, which [itself] is a variant reading), those [of them who were] excused, [came] to the Prophet (s), asking for leave, to stay behind on account of their excuses, and so he gave them leave to do so. And those who lied to God and His Messenger, by feigning belief, [those] hypocrites among the Bedouin, stayed behind, [refraining] from coming to give [their] excuses — a painful chastisement shall befall those of them who disbelieve.\n",
        "TRANSLATION_18": "(And those among the wandering Arabs) from the Banu Ghifar (who had an excuse came) to you, Muhammad (in order that permission might be granted them) so that Allah's Messenger gives them permission not to take part in the Battle of Tabuk. (And those who lied to Allah and His messenger) in secret; it is also said this means: those who opposed Allah's Messenger in secret regarding jihad without having a permission from him (sat at home. A painful doom will fall on those of them who disbelieve) of the hypocrites: 'Abdullah Ibn Ubayy and his host. 205\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "9:90",
            "9:61",
            "33:57",
            "29:23",
            "16:104",
            "9:1",
            "58:5",
            "76:31",
            "9:79",
            "67:28"
        ],
        "BIBLE": [
            "prophets:isaiah:48:1",
            "prophets:isaiah:50:2",
            "writings:daniel:6:13",
            "prophets:ii%20kings:5:7",
            "prophets:i%20samuel:28:15",
            "prophets:i%20kings:20:34",
            "prophets:judges:16:25",
            "writings:ii%20chronicles:25:13",
            "writings:i%20chronicles:10:4",
            "prophets:joshua:9:11"
        ]
    }
}