{
    "VERSE": "9:91",
    "ARABIC": "لَّيْسَ عَلَى ٱلضُّعَفَآءِ وَلَا عَلَى ٱلْمَرْضَىٰ وَلَا عَلَى ٱلَّذِينَ لَا يَجِدُونَ مَا يُنفِقُونَ حَرَجٌ إِذَا نَصَحُوا۟ لِلَّهِ وَرَسُولِهِۦ مَا عَلَى ٱلْمُحْسِنِينَ مِن سَبِيلٍ وَٱللَّهُ غَفُورٌ رَّحِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "Nothing is held against the weak and sick nor against those who find nothing to spend, provided they are true to Allah and His Messenger - there is no way open against good-doers, Allah is Ever-Forgiving, Most",
        "TRANSLATION_1": "No blame will attach to the old and the sick, or those without means to spend on good acts, if they stay behind provided they are sincere to God and His Apostle; There is no way to blame those who are doers of good, for God is forgiving and kind.\n",
        "TRANSLATION_2": "There is no blame on the weak nor on the sick nor on those who have nothing to enable them to join (the struggle in the Way of Allah) if they stay behind provided that they are sincere to Allah and to His Messenger. There is no cause for reproach against those who do good. Allah is All-Forgiving, Ever Merciful.\n",
        "TRANSLATION_3": "People who are weak or sick and those who do not have the means to take part in the fighting are exempt from this duty if their intention remains sincere about God and His Messenger. Righteous people shall not be blamed. God is All-forgiving and All-merciful.\n",
        "TRANSLATION_4": "There is no reproach upon the old nor upon the sick nor upon those who do not have the means to spend, provided they remain faithful to Allah and His Noble Messenger; and there is no way of reproach against the virtuous; and Allah is Oft Forgiving, Most Merciful.\n",
        "TRANSLATION_5": "There is no blame on those who are weak or ill or who find no resources to spend, if they are sincere and true (in duty) to Allah and His Messenger. No means (of complaint) can there be against the doers of good. And Allah is Oft-Forgiving, Most Merciful.\n",
        "TRANSLATION_6": "It shall be no crime in the weak, nor in the sick, nor in those who do not find what they should spend (to stay behind), so long as they are sincere to Allah and His Apostle; there is no way (to blame) against the doers of good; and Allah is Forgiving, Merciful;\n",
        "TRANSLATION_7": "There is no fault in the weak and the sick and those who find nothing to expend, if they are true to God and to His Messenger. There is no way against the good-doers -- God is All-forgiving, All-compassionate --\n",
        "TRANSLATION_8": "Not unto the weak nor unto the sick nor unto those who can find naught to spend is any fault (to be imputed though they stay at home) if they are true to Allah and His messenger. Not unto the good is there any road (of blame). Allah is Forgiving, Merciful.\n",
        "TRANSLATION_9": "but no blame shall attach to the weak, the sick, and those who have no means to spend, provided they are sincere to God and His Messenger. There is no reason to reproach those who do good deeds; God is most forgiving and merciful.\n",
        "TRANSLATION_10": "Not on the feeble and the ailing nor on those who find not the where withal to expend there is any blame, when they wish well to Allah and His apostle. No way is there against the well-doers; and Allah is Forgiving, Merciful.\n",
        "TRANSLATION_11": "There is no blame on the weak, nor on the sick, nor on those who do not find anything to spend, so long as they are sincere to Allah and His Apostle. There is no [cause for] blaming the virtuous, and Allah is all-forgiving, all-merciful.\n",
        "TRANSLATION_12": "There is no blame on those who are infirm, or ill, or who find no resources to spend (on the cause), if they are sincere (in duty) to Allah and His Messenger: no ground (of complaint) can there be against such as do right: and Allah is Oft-forgiving, Most Merciful.\n",
        "TRANSLATION_13": "There is no blame on those who are weak or ill or who find no resources to spend [in holy fighting (Jihad)], if they are sincere and true (in duty) to Allah and His Messenger. No ground (of complaint) can there be against the Muhsinun (good-doers - see the footnote of V. 9:120). And Allah is Oft-Forgiving, Most Merciful.\n",
        "TRANSLATION_14": "There is no fault for the weak, the sick, and those lacking the means to spend (to stay behind), if they are true to Allah and His Messenger. There is no way against the righteous; Allah is Forgiving, the Most Merciful.\n",
        "TRANSLATION_15": "There is no blame on the weak, nor on the sick, nor on those who have nothing to give, provided they are true to God and His Messenger. In no way can the righteous be blamed. God is Forgiving and Merciful.\n",
        "TRANSLATION_16": "There is not upon the weak or upon the ill or upon those who do not find anything to spend any discomfort when they are sincere to Allah and His Messenger. There is not upon the doers of good any cause [for blame]. And Allah is Forgiving and Merciful.\n",
        "TRANSLATION_17": "[9:91] As for the weak, such as the old, and the sick, the blind and the chronically ill, and those who find nothing to expend, for the struggle, no blame, no sin, falls upon them, should they stay away from it, if they remain true to God and to His Messenger, when they stay behind, by not spreading false rumours or impeding [others from joining the struggle], but by [adhering to] obedience. There is no way [of blame], no way of reproach, against those who are virtuous, through such [behaviour]. And God is Forgiving, Merciful, to them, by granting them such leeway [in this matter].\n",
        "TRANSLATION_18": "(Not unto the weak) among the elderly or the chronically ill (nor unto the sick) among the youth (nor unto those who can find naught to spend) in jihad (is any fault (to be imputed though they stay at home) if they are true to Allah) in relation to His religion (and His messenger) regarding his practice. (Not unto the good) in their works and words (is there any road (of blame). Allah is Forgiving) of those who repent, (Merciful) towards he who dies in a state of repentance.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "9:91",
            "24:62",
            "2:218",
            "33:73",
            "57:28",
            "4:152",
            "5:74",
            "3:129",
            "4:100",
            "4:96"
        ],
        "BIBLE": [
            "prophets:ezekiel:14:23",
            "prophets:jeremiah:12:16",
            "prophets:jeremiah:12:1",
            "torah:deuteronomy:26:2",
            "torah:deuteronomy:4:5",
            "torah:numbers:21:4",
            "writings:job:27:6",
            "prophets:jeremiah:29:32",
            "prophets:zechariah:8:8",
            "writings:psalms:139:24"
        ]
    }
}