{
    "VERSE": "9:94",
    "ARABIC": "يَعْتَذِرُونَ إِلَيْكُمْ إِذَا رَجَعْتُمْ إِلَيْهِمْ قُل لَّا تَعْتَذِرُوا۟ لَن نُّؤْمِنَ لَكُمْ قَدْ نَبَّأَنَا ٱللَّهُ مِنْ أَخْبَارِكُمْ وَسَيَرَى ٱللَّهُ عَمَلَكُمْ وَرَسُولُهُۥ ثُمَّ تُرَدُّونَ إِلَىٰ عَٰلِمِ ٱلْغَيْبِ وَٱلشَّهَٰدَةِ فَيُنَبِّئُكُم بِمَا كُنتُمْ تَعْمَلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "They will make excuses to you when you return to them. Say: 'Do not make excuses, we will not believe you. Allah has already informed us about you. Allah will see your actions, as will His Messenger. Then you will be returned to the Knower of the Unseen and the Visible, and He will inform you regarding what you did.'",
        "TRANSLATION_1": "When you come back they will offer excuses to you. Tell them: \"Make no excuses; we do not believe you. God has informed us about you; and God and His Apostle shall watch your conduct. Then you will be brought to Him who knows what is hidden and what is manifest. He will tell you of what you did.\"\n",
        "TRANSLATION_2": "They will put up excuses before you when you return to them. Tell them: \"Make no excuses. We will not believe you. Allah has already informed us of the truth about you. Allah will observe your conduct, and so will His Messenger; then you will be brought back to Him Who knows alike what lies beyond perception and what lies in the range of perception and will let you know what you have done.\"\n",
        "TRANSLATION_3": "They will apologize to you on your return. Tell them, \"Do not ask for pardon. We will never believe you. God has already told us everything about you. God and His Messenger will soon make your deeds public, then you will return to Him who has absolute knowledge of the unseen and the seen and He will inform you of what you have done.\n",
        "TRANSLATION_4": "They will make excuses to you when you return to them; say, “Do not make excuses – we shall never believe you – Allah has given us your tidings; and Allah and His Noble Messenger will now see your deeds, and then you will return to Him Who knows everything, the hidden and the visible – He will inform you of all what you used to do.”\n",
        "TRANSLATION_5": "They (the hypocrites) will present their excuses to you (Muslims), when you return to them. Say \"Present no excuses, we shall not believe you. Allah has already informed us of the news concerning you. Allah and His Messenger will observe your deeds. In the end you will be brought back to the All-Knower of the unseen and the seen, then He (Allah) will inform you of what you used to do.\"\n",
        "TRANSLATION_6": "They will excuse themselves to you when you go back to them. Say: Urge no excuse, by no means will we believe you; indeed Allah has informed us of matters relating to you; and now Allah and His Apostle will see your doings, then you shall be brought back to the Knower of the unseen and the seen, then He will inform you of what you did.\n",
        "TRANSLATION_7": "They will excuse themselves to you, when you return to them. Say: 'Do not excuse yourselves; we will not believe you. God has already told us tidings of you. God will surely see your work, and His Messenger, then you will be returned to Him who knows the unseen and the visible, and He will tell you what you were doing.'\n",
        "TRANSLATION_8": "They will make excuse to you (Muslims) when ye return unto them. Say: Make no excuse, for we shall not believe you. Allah hath told us tidings of you. Allah and His messenger will see your conduct, and then ye will be brought back unto Him Who knoweth the Invisible as well as the Visible, and He will tell you what ye used to do.\n",
        "TRANSLATION_9": "They will make excuses to you when you return to them. Say, \"Do not make excuses, we will not believe you. God has already informed us about you. God will see your actions, as will His Messenger. Then you will be returned to the One who knows the seen and the unseen and He will tell you all that you used to do.\"\n",
        "TRANSLATION_10": "They will excuse themselves unto you when ye return to them. Say thou: excuse not yourselves, we shall by no means believe you: Allah hath already declared unto us some tidings of you, and Allah will behold your work and so will His apostle; and thereafter ye will be brought back unto Him who knoweth the hidden and the manifest, who will then declare unto you that which ye have been working.\n",
        "TRANSLATION_11": "They will offer you excuses when you return to them. Say, ‘Do not make excuses; we will never believe you. Allah has informed us of your state of affairs. Allah and His Apostle will observe your conduct, then you will be returned to the Knower of the sensible and the Unseen, and He will inform you concerning what you used to do.’\n",
        "TRANSLATION_12": "They will present their excuses to you when ye return to them. Say thou: \"Present no excuses: we shall not believe you: Allah hath already informed us of the true state of matters concerning you: It is your actions that Allah and His Messenger will observe: in the end will ye be brought back to Him Who knoweth what is hidden and what is open: then will He show you the truth of all that ye did.\"\n",
        "TRANSLATION_13": "They (the hypocrites) will present their excuses to you (Muslims), when you return to them. Say (O Muhammad SAW) \"Present no excuses, we shall not believe you. Allah has already informed us of the news concerning you. Allah and His Messenger will observe your deeds. In the end you will be brought back to the All-Knower of the unseen and the seen, then He (Allah) will inform you of what you used to do.\" [Tafsir At-Tabari]\n",
        "TRANSLATION_14": "When you return, they will apologize to you. Say: 'Make no excuses; we will not believe you. Allah has already told us of your news. Surely, Allah and His Messenger will see your work; then you will be returned to the Knower of the unseen and the visible, and He will inform you of what you were doing'\n",
        "TRANSLATION_15": "They present excuses to you when you return to them. Say, “Do not offer excuses; we do not trust you; God has informed us of you. And God will watch your actions, and so will the Messenger; then you will be returned to the Knower of the Invisible and the Visible, and He will inform you of what you used to do.”\n",
        "TRANSLATION_16": "They will make excuses to you when you have returned to them. Say, \"Make no excuse - never will we believe you. Allah has already informed us of your news. And Allah will observe your deeds, and [so will] His Messenger; then you will be taken back to the Knower of the unseen and the witnessed, and He will inform you of what you used to do.\"\n",
        "TRANSLATION_17": "[9:94] They will make excuses to you, for having stayed behind, when you return to them, from the campaign. Say, to them: ‘Do not make excuses; we will never believe you! God has already told us tidings of you, that is, He has already informed us of your [true] status. And God will see your work, and [so will] His Messenger, then you will be returned, through resurrection, to the Knower of the unseen and the visible, meaning [to] God, and He will tell you what you used to do’, and requite you for it.\n",
        "TRANSLATION_18": "(They will make excuse to you (Muslims) when ye return) from the Battle of Tabuk (unto them) in Medina, saying: we were not able to go forth with you. (Say) Muhammad, to them: (Make no excuse) for staying behind, (for we shall not believe you) we will not believe your excuses. (Allah hath told us tidings of you) of your secrets and hypocrisy. (Allah and His messenger will see your conduct) after this, if you repent, (and then ye will be brought back) in the Hereafter (unto Him Who knoweth the invisible) Who knows that which is hidden from His servants; it is also said that the invisible is that which the servants do not know; it is also said that this means: that which will happen (as well as the visible) that which the servants do know; it is also said that this means: that which has already happened, (and He will tell you what ye used to do) and say whether it is good or bad.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "9:94",
            "9:105",
            "47:32",
            "47:33",
            "4:61",
            "10:81",
            "64:8",
            "33:36",
            "3:153",
            "3:179"
        ],
        "BIBLE": [
            "torah:genesis:3:6",
            "torah:exodus:34:10",
            "writings:ezra:5:5",
            "prophets:ezekiel:18:13",
            "prophets:ii%20samuel:15:20",
            "torah:exodus:32:1",
            "writings:daniel:5:15",
            "torah:leviticus:10:17",
            "writings:job:10:2",
            "prophets:hosea:2:14"
        ]
    }
}