{
    "VERSE": "9:97",
    "ARABIC": "ٱلْأَعْرَابُ أَشَدُّ كُفْرًا وَنِفَاقًا وَأَجْدَرُ أَلَّا يَعْلَمُوا۟ حُدُودَ مَآ أَنزَلَ ٱللَّهُ عَلَىٰ رَسُولِهِۦ وَٱللَّهُ عَلِيمٌ حَكِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "The desert arabs are more obdurate in kufr and hypocrisy and more likely not to know the limits which Allah has sent down to His Messenger. Allah is All-Knowing, All-Wise.",
        "TRANSLATION_1": "The village Arabs are more obstinate in disbelief and hypocrisy, and impervious to ordinances revealed to His Apostle by God; yet God is aware of everything and is wise.\n",
        "TRANSLATION_2": "The bedouin Arabs surpass all in unbelief and hypocrisy and are most likely to be unaware of the limits prescribed by Allah in what He has revealed to His Messenger. Allah is All-Knowing, All-Wise.\n",
        "TRANSLATION_3": "The desert dwelling Arabs are far worse than the others in their disbelief and hypocrisy and have more reason to be ignorant of the revelations that God revealed to His Messenger. God is All-knowing and All-wise.\n",
        "TRANSLATION_4": "The ignorant are more severe in disbelief and hypocrisy, and deserve to remain ignorant of the commands which Allah has revealed to His Noble Messenger; and Allah is All Knowing, Wise.\n",
        "TRANSLATION_5": "The bedouins are the worst in disbelief and hypocrisy, and more likely to not know the limits which Allah has revealed to His Messenger. And Allah is All-Knower, All-Wise.\n",
        "TRANSLATION_6": "The dwellers of the desert are very hard in unbelief and hypocrisy, and more disposed not to know the limits of what Allah has revealed to His Apostle; and Allah is Knowing, Wise.\n",
        "TRANSLATION_7": "The Bedouins are more stubborn in unbelief and hypocrisy, and apter not to know the bounds of what God has sent down on His Messenger; and God is All-knowing, All-wise.\n",
        "TRANSLATION_8": "The wandering Arabs are more hard in disbelief and hypocrisy, and more likely to be ignorant of the limits which Allah hath revealed unto His messenger. And Allah is Knower, Wise.\n",
        "TRANSLATION_9": "The desert Arabs are more stubborn in their denial of truth and hypocrisy, and are the least likely to be aware of the limits which God has revealed to His Messenger. God is all knowing and wise.\n",
        "TRANSLATION_10": "The dwellers of the desert are the hardest in infidelity and hypocrisy and likeliest not to know the ordinances of that which Allah hath sent down unto His apostle. And Allah is Knowing, Wise.\n",
        "TRANSLATION_11": "The Bedouins are more obdurate in unfaith and hypocrisy, and more apt to be ignorant of the precepts that Allah has sent down to His Apostle, and Allah is all-knowing, all-wise.\n",
        "TRANSLATION_12": "The Arabs of the desert are the worst in Unbelief and hypocrisy, and most fitted to be in ignorance of the command which Allah hath sent down to His Messenger: But Allah is All-knowing, All-Wise.\n",
        "TRANSLATION_13": "The bedouins are the worst in disbelief and hypocrisy, and more likely to be in ignorance of the limits (Allah's Commandments and His Legal Laws, etc.) which Allah has revealed to His Messenger. And Allah is All-Knower, All-Wise.\n",
        "TRANSLATION_14": "The Bedouin Arabs surpass (the city dwellers) in disbelief and hypocrisy, and are more likely not to know the bounds that Allah has sent down to His Messenger. But Allah is Knowing, Wise.\n",
        "TRANSLATION_15": "The Desert-Arabs are the most steeped in disbelief and hypocrisy, and the most likely to ignore the limits that God revealed to His Messenger. God is Knowing and Wise.\n",
        "TRANSLATION_16": "The bedouins are stronger in disbelief and hypocrisy and more likely not to know the limits of what [laws] Allah has revealed to His Messenger. And Allah is Knowing and Wise.\n",
        "TRANSLATION_17": "[9:97] The Bedouins, the [Arab] nomads, are more intense in unbelief and hypocrisy, than the city-dwellers, on account of their harshness and crude nature and their being too remote to hear the Qur’ān, and are more likely not to know the bounds of what God has revealed to His Messenger, in the way of rulings and [legal] prescriptions; and God is Knower, of His creatures, Wise, in what He does with them.\n",
        "TRANSLATION_18": "(The wandering Arabs) the tribes of Asad and Ghatafan (are more hard in disbelief and hypocrisy) they are harder in disbelief and hypocrisy than others, (and more likely to be ignorant of the limits which Allah hath revealed) the obligations that Allah has revealed (unto His messenger) in the Scripture. (And Allah is Knower) of the hypocrites, (Wise) regarding the punishment He has decreed upon them; it is also said this means: Allah is Knower of he who abstains from learning, Wise in that He decreed that whoever does not learn remains ignorant. 206\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "9:97",
            "31:23",
            "9:90",
            "24:18",
            "22:52",
            "9:110",
            "4:104",
            "13:37",
            "5:61",
            "25:55"
        ],
        "BIBLE": [
            "prophets:ii%20kings:17:37",
            "writings:nehemiah:9:29",
            "writings:nehemiah:9:13",
            "writings:nehemiah:1:7",
            "writings:ii%20chronicles:19:10",
            "prophets:isaiah:58:2",
            "prophets:joshua:1:7",
            "writings:nehemiah:10:30",
            "writings:nehemiah:9:14",
            "writings:ii%20chronicles:33:8"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:5:1"
        ]
    }
}