{
    "VERSE": "9:99",
    "ARABIC": "وَمِنَ ٱلْأَعْرَابِ مَن يُؤْمِنُ بِٱللَّهِ وَٱلْيَوْمِ ٱلْءَاخِرِ وَيَتَّخِذُ مَا يُنفِقُ قُرُبَٰتٍ عِندَ ٱللَّهِ وَصَلَوَٰتِ ٱلرَّسُولِ أَلَآ إِنَّهَا قُرْبَةٌ لَّهُمْ سَيُدْخِلُهُمُ ٱللَّهُ فِى رَحْمَتِهِۦٓ إِنَّ ٱللَّهَ غَفُورٌ رَّحِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "And among the desert arabs there are some who have iman in Allah and the Last Day and regard what they give as something which will bring them nearer to Allah and to the prayers of the Messenger. It does indeed bring them near. Allah will admit them into His mercy. Allah is Ever-Forgiving, Most Merciful.",
        "TRANSLATION_1": "Yet some Arabs of the desert believe in God and the Last Day, and consider what they spend to be a means of bringing them nearer to God and the blessings of the Prophet. This is certainly a means of achieving nearness (to God), and God will admit them to His mercy, for God is forgiving and kind.\n",
        "TRANSLATION_2": "And among the bedouin Arabs are those who believe in Allah and the Last Day, and regard their spending (in the Way of Allah) as a means of drawing near to Allah and of deserving the prayers of the Messenger. Indeed, this shall be a means of drawing near to Allah. Allah will surely admit them to His mercy. Allah is All-Forgiving, Ever Merciful.\n",
        "TRANSLATION_3": "Some of the desert dwelling Arabs believe in God and the Day of Judgment. Whatever they spend for the cause of God they consider it as a means of getting nearer to God and have the prayers of the Messenger in their favor. This, certainly is a means to get nearer to God. God will admit them into His mercy. God is All-forgiving and All-merciful.\n",
        "TRANSLATION_4": "And some villagers are those who believe in Allah and the Last Day, and consider the spending as the means of obtaining proximity to Allah and obtaining the prayers of the Noble Messenger; pay heed! Yes indeed it is the means of proximity for them; Allah will soon admit them into His mercy; indeed Allah is Oft Forgiving, Most Merciful.\n",
        "TRANSLATION_5": "And of the bedouins there are some who believe in Allah and the Last Day, and look upon what they spend (in Allah's cause) as means of nearness to Allah, and a cause of receiving the Messenger's invocations. Indeed these (expenditures) are a means of nearness for them. Allah will admit them to His mercy. Certainly Allah is Oft-Forgiving, Most Merciful.\n",
        "TRANSLATION_6": "And of the dwellers of the desert are those who believe in Allah and the latter day and take what they spend to be (means of) the nearness of Allah and the Apostle's prayers; surely it shall be means of nearness for them; Allah will make them enter into His mercy; surely Allah is Forgiving, Merciful.\n",
        "TRANSLATION_7": "And some of the Bedouins believe in God and the Last Day, and take what they expend for offerings bringing them near to God, and the prayers of the Messenger. Surely they are an offering for them, and God will admit them into His mercy; God is All-forgiving, All-compassionate.\n",
        "TRANSLATION_8": "And of the wandering Arabs there is he who believeth in Allah and the Last Day, and taketh that which he expendeth and also the prayers of the messenger as acceptable offerings in the sight of Allah. Lo! verily it is an acceptable offering for them. Allah will bring them into His mercy. Lo! Allah is Forgiving, Merciful.\n",
        "TRANSLATION_9": "There are also those among them who believe in God and the Last Day and regard what they spend for the cause of God as a means of bringing them nearer to God and of deserving the prayers of the Messenger. This shall certainly be for them a means of drawing near to God. God will admit them into His mercy; God is indeed most forgiving and merciful.\n",
        "TRANSLATION_10": "And of the dwellers of the desert is one who believeth in Allah and the Last Day, and taketh that which he expendeth as approaches unto Allah and the blessings of His apostle. Lo! verily these are an approach for them; anon Allah will enter them into His mercy. Verily Allah is Forgiving, Merciful.\n",
        "TRANSLATION_11": "Yet among the Bedouins are [also] those who believe in Allah and the Last Day, and regard what they spend as [a means of attaining] nearness to Allah and the blessings of the Apostle. Now, it shall indeed bring them nearness, and Allah will admit them into His mercy. Indeed Allah is all-forgiving, all-merciful.\n",
        "TRANSLATION_12": "But some of the desert Arabs believe in Allah and the Last Day, and look on their payments as pious gifts bringing them nearer to Allah and obtaining the prayers of the Messenger. Aye, indeed they bring them nearer (to Him): soon will Allah admit them to His Mercy: for Allah is Oft-forgiving, Most Merciful.\n",
        "TRANSLATION_13": "And of the bedouins there are some who believe in Allah and the Last Day, and look upon what they spend in Allah's Cause as approaches to Allah, and a cause of receiving the Messenger's invocations. Indeed these (spendings in Allah's Cause) are an approach for them. Allah will admit them to His Mercy. Certainly Allah is Oft-Forgiving, Most Merciful.\n",
        "TRANSLATION_14": "Yet there are some Arabs (Juhaina and Muszaina tribes) who believe in Allah and the Last Day, and regard what they spend as a means of bringing them close to Allah and to the prayers of the Messenger. Indeed, they are an offering for them; Allah will admit them to His Mercy. He is Forgiving, Merciful.\n",
        "TRANSLATION_15": "Yet among the Desert-Arabs are those who believe in God and the Last Day, and consider their contribution to be a means towards God, and the prayers of the Messenger. Surely it will draw them closer, and God will admit them into His mercy. God is Forgiving and Compassionate.\n",
        "TRANSLATION_16": "But among the bedouins are some who believe in Allah and the Last Day and consider what they spend as means of nearness to Allah and of [obtaining] invocations of the Messenger. Unquestionably, it is a means of nearness for them. Allah will admit them to His mercy. Indeed, Allah is Forgiving and Merciful.\n",
        "TRANSLATION_17": "[9:99] And of the Bedouins there is he who believes in God and the Last Day, such as [men from among the tribes of] Juhayna and Muzayna, and takes what he expends, in the way of God, as [pious] offerings to bring [him] nearer to God, and, as a means, to [secure] the prayers, the supplications, of the Messenger, for him. Surely these, the expenditure of such [men], will bring them nearer (read qurubatun or qurbatun), to Him. God will admit them into His mercy, His Paradise. Truly God is Forgiving, to those who obey Him, Merciful, to them.\n",
        "TRANSLATION_18": "(And of the wandering Arabs) the tribes of Muzaynah, Juhaynah and Aslam (there is he who believeth in Allah and the Last Day) in secret and in the open, (and taketh that which he expandeth) in jihad (and also the prayers of the messenger as acceptable offering for in the sight of Allah) as means of drawing near to Allah in degrees. (Lo! verily it) i.e. the expenditure (is an acceptable offering for them) to Allah which raises them in degrees. (Allah will bring them into His mercy) into His Paradise. (Lo! Allah is Forgiving, Merciful) towards he who repents.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "9:99",
            "2:62",
            "49:14",
            "24:62",
            "57:28",
            "4:152",
            "33:57",
            "42:5",
            "49:3",
            "9:18"
        ],
        "BIBLE": [
            "writings:esther:9:19",
            "writings:daniel:10:14",
            "torah:leviticus:23:28",
            "prophets:ezekiel:43:27",
            "torah:numbers:31:50",
            "torah:numbers:15:25",
            "torah:leviticus:23:21",
            "prophets:hosea:5:9",
            "prophets:isaiah:28:9",
            "prophets:ezekiel:29:12"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:4:12"
        ]
    }
}