{
    "VERSE": "60:7",
    "ARABIC": "عَسَى ٱللَّهُ أَن يَجْعَلَ بَيْنَكُمْ وَبَيْنَ ٱلَّذِينَ عَادَيْتُم مِّنْهُم مَّوَدَّةً وَٱللَّهُ قَدِيرٌ وَٱللَّهُ غَفُورٌ رَّحِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "It may well be that Allah will restore the love between you and those of them who are now your enemies. Allah is Ail-Powerful. Allah is Ever-Forgiving, Most Merciful.",
        "TRANSLATION_1": "It maybe that God will create love between you and your enemies. God is all-powerful, and God is forgiving, ever-merciful.\n",
        "TRANSLATION_2": "It may well be that Allah will implant love between you and those with whom you have had enmity. Allah is Most Powerful; and Allah is Most Forgiving, Most Compassionate.\n",
        "TRANSLATION_3": "God will perhaps bring about love between you and those of the disbelievers with whom you were enemies. God is All-powerful, All-merciful, and All-forgiving.\n",
        "TRANSLATION_4": "It is likely that Allah may create friendship between you and those among them who are now your enemies; and Allah is All Able; and Allah is Oft Forgiving, Most Merciful.\n",
        "TRANSLATION_5": "Perhaps Allah will make friendship between you and those whom you hold as enemies. And Allah has power (over all things), and Allah is Oft-Forgiving, Most Merciful.\n",
        "TRANSLATION_6": "It may be that Allah will bring about friendship between you and those whom you hold to be your enemies among them; and Allah is Powerful; and Allah is Forgiving, Merciful.\n",
        "TRANSLATION_7": "It may be God will yet establish between you and those of them with whom you are at enmity love. God is All-powerful; God is All-forgiving, All-compassionate.\n",
        "TRANSLATION_8": "It may be that Allah will ordain love between you and those of them with whom ye are at enmity. Allah is Mighty, and Allah is Forgiving, Merciful.\n",
        "TRANSLATION_9": "It may well be that God will create goodwill between you and those of them with whom you are now at enmity -- for God is all powerful, most forgiving and merciful.\n",
        "TRANSLATION_10": "Belike Allah may appoint between you and those of them whom ye hold as enemies affection. And Allah is Potent, and Allah is Forgiving, Merciful.\n",
        "TRANSLATION_11": "It may be that Allah will bring about affection between you and those with whom you are at enmity, and Allah is all-powerful, and Allah is all-forgiving, all-merciful.\n",
        "TRANSLATION_12": "It may be that Allah will grant love (and friendship) between you and those whom ye (now) hold as enemies. For Allah has power (over all things); And Allah is Oft-Forgiving, Most Merciful.\n",
        "TRANSLATION_13": "Perhaps Allah will make friendship between you and those whom you hold as enemies. And Allah has power (over all things), and Allah is Oft-Forgiving, Most Merciful.\n",
        "TRANSLATION_14": "It may be that Allah establishes love between you and those with whom you are at enmity. Allah is the Powerful, Allah is the Forgiving and the Most Merciful.\n",
        "TRANSLATION_15": "Perhaps God will plant affection between you and those of them you consider enemies. God is Capable. God is Forgiving and Merciful.\n",
        "TRANSLATION_16": "Perhaps Allah will put, between you and those to whom you have been enemies among them, affection. And Allah is competent, and Allah is Forgiving and Merciful.\n",
        "TRANSLATION_17": "[60:7] It may be that God will bring about between you and those of them with whom you are at enmity, from among the disbelievers of Mecca out of [your] obedience to God, exalted be He, affection, by His guiding them to faith, so that they then become your friends. For God is Powerful, [able] to do that — and He did do this after the conquest of Mecca — and God is Forgiving, to them of their past [deeds], Merciful, to them [also].\n",
        "TRANSLATION_18": "(It may be) \"may be\" when used in connection with Allah denotes a requisite (that Allah will ordain love) a bond and marriage relationships; and it so happened that the Prophet (pbuh) married, upon the conquest of Mecca, Umm Habibah, the daughter of Abu Sufyan, and this became a bond between them and the Prophet (pbuh) (between you and those of them with whom ye are at enmity) those of the people of Mecca whom you oppose with regard to religion. (Allah is Mighty) He is able to give His Prophet the upper hand over the disbelievers of Quraysh, (and Allah is Forgiving) He forgives whoever amongt them repents of disbelief and accepts faith in Allah, (Merciful) towards whoever amongst them dies in a state of faith and repentance.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "60:7",
            "4:152",
            "5:34",
            "4:96",
            "3:89",
            "24:5",
            "2:218",
            "46:8",
            "3:31",
            "8:69"
        ],
        "BIBLE": [
            "torah:leviticus:20:25",
            "torah:genesis:21:18",
            "prophets:ii%20samuel:23:5",
            "torah:leviticus:25:46",
            "writings:job:11:3",
            "torah:exodus:23:13",
            "prophets:nahum:3:6",
            "writings:i%20chronicles:17:8",
            "torah:deuteronomy:4:23",
            "writings:i%20chronicles:11:10"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:2",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:6:3"
        ]
    }
}