{
    "VERSE": "76:1",
    "ARABIC": "بِسْمِ ٱللَّهِ ٱلرَّحْمَٰنِ ٱلرَّحِيمِ هَلْ أَتَىٰ عَلَى ٱلْإِنسَٰنِ حِينٌ مِّنَ ٱلدَّهْرِ لَمْ يَكُن شَيْـًٔا مَّذْكُورًا",
    "ENGLISH": {
        "TRANSLATION_0": "Has man ever known a point of time when he was not something remembered?",
        "TRANSLATION_1": "WAS THERE NOT a time in the life of man when he was not even a mentionable thing?\n",
        "TRANSLATION_2": "Was there a period of time when man was not even worthy of a mention?\n",
        "TRANSLATION_3": "There was certainly a time when there was no mention of the human being.\n",
        "TRANSLATION_4": "Indeed there has been a time for man, when even his name did not exist anywhere.\n",
        "TRANSLATION_5": "Has there not been over man a period of time, when he was not a thing worth mentioning\n",
        "TRANSLATION_6": "There surely came over man a period of time when he was a thing not worth mentioning.\n",
        "TRANSLATION_7": "Has there come on man a while of time when he was a thing unremembered?\n",
        "TRANSLATION_8": "Hath there come upon man (ever) any period of time in which he was a thing unremembered?\n",
        "TRANSLATION_9": "Was there not a period of time when man was nothing worth mentioning?\n",
        "TRANSLATION_10": "Surely there hath come upon man a space of time when he was not a thing worth mentioning.\n",
        "TRANSLATION_11": "Has there been a period of time for man when he was not anything worthy of mention?\n",
        "TRANSLATION_12": "Has there not been over Man a long period of Time, when he was nothing - (not even) mentioned?\n",
        "TRANSLATION_13": "Has there not been over man a period of time, when he was nothing to be mentioned?\n",
        "TRANSLATION_14": "Indeed, there came upon the human a period of time when he was an unremembered thing.\n",
        "TRANSLATION_15": "Has there come upon man a period of time when he was nothing to be mentioned?\n",
        "TRANSLATION_16": "Has there [not] come upon man a period of time when he was not a thing [even] mentioned?\n",
        "TRANSLATION_17": "[76:1] Has there [ever] been — there has indeed [been] — for man, Adam, a period of time, forty years, in which he was a thing unmentioned? — he was during this [period] a fashioned in clay and not mentioned; alternatively what is meant by insān, ‘man’, is the generic noun and by hīn, ‘a period of time’, the period of gestation.\n",
        "TRANSLATION_18": "And from his narration on the authority of Ibn 'Abbas that he said regarding the interpretation of Allah's saying (Hath there come upon man (ever)): '(Hath there come upon man (ever)) there has come upon Adam (any period of time) a period of 40 years when he was created and fashioned (in which he was a thing unremembered?) not knowing who he was, what his name was or what Allah wanted from him.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "76:1",
            "19:67",
            "96:5",
            "55:3",
            "32:7",
            "80:17",
            "80:18",
            "51:42",
            "99:3",
            "75:36"
        ],
        "BIBLE": [
            "writings:ezra:5:16",
            "prophets:i%20kings:12:22",
            "prophets:isaiah:66:2",
            "torah:leviticus:21:18",
            "prophets:i%20samuel:25:15",
            "prophets:haggai:2:20",
            "torah:genesis:34:7",
            "torah:deuteronomy:1:31",
            "prophets:joshua:5:4",
            "writings:daniel:8:17"
        ]
    }
}