{
    "VERSE": "76:10",
    "ARABIC": "إِنَّا نَخَافُ مِن رَّبِّنَا يَوْمًا عَبُوسًا قَمْطَرِيرًا",
    "ENGLISH": {
        "TRANSLATION_0": "Truly We fear from our Lord a glowering, calamitous Day.'",
        "TRANSLATION_1": "We fear the dismal day calamitous from our Lord.\"\n",
        "TRANSLATION_2": "we fear from our Lord a Day that shall be long and distressful.”\n",
        "TRANSLATION_3": "We are afraid of our Lord and the bitterly distressful day\".\n",
        "TRANSLATION_4": "“Indeed we fear from our Lord a day which is extremely bitter, most severe.”\n",
        "TRANSLATION_5": "Verily, We fear from our Lord a Day that is `Abus and Qamtarir.\"\n",
        "TRANSLATION_6": "Surely we fear from our Lord a stern, distressful day.\n",
        "TRANSLATION_7": "for we fear from our Lord a frowning day, inauspicious.\n",
        "TRANSLATION_8": "Lo! we fear from our Lord a day of frowning and of fate.\n",
        "TRANSLATION_9": "Truly, we fear from our Lord a woefully grim Day.\"\n",
        "TRANSLATION_10": "Verily we dread from our Lord a Day grim and distressful.\n",
        "TRANSLATION_11": "Indeed we fear a frowning and fateful day from our Lord.’\n",
        "TRANSLATION_12": "We only fear a Day of distressful Wrath from the side of our Lord.\"\n",
        "TRANSLATION_13": "Verily, We fear from our Lord a Day, hard and distressful, that will make the faces look horrible (from extreme dislikeness to it).\"\n",
        "TRANSLATION_14": "for we fear from our Lord a stern, frownful Day'\n",
        "TRANSLATION_15": "We dread from our Lord a frowning grim Day.”\n",
        "TRANSLATION_16": "Indeed, We fear from our Lord a Day austere and distressful.\"\n",
        "TRANSLATION_17": "[76:10] Indeed we fear from our Lord a day of frowning, one in which faces scowl, in other words, a horrid day to observe on account of its severity, calamitous’, severe in that respect.\n",
        "TRANSLATION_18": "(Lo! we fear from our Lord) from the punishment of our Lord (a day of frowning) when faces are frowning (and of fate) a hard day whose torment and horrors are severe.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "76:10",
            "15:36",
            "38:79",
            "38:16",
            "6:15",
            "39:13",
            "39:31",
            "7:125",
            "26:117",
            "3:194"
        ],
        "BIBLE": [
            "prophets:jeremiah:5:18",
            "prophets:isaiah:13:13",
            "torah:leviticus:8:34",
            "prophets:zephaniah:1:18",
            "torah:deuteronomy:21:16",
            "prophets:malachi:3:17",
            "prophets:isaiah:13:9",
            "torah:numbers:30:9",
            "torah:exodus:29:37",
            "prophets:ezekiel:32:10"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:11",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:1:12",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:6:4"
        ]
    }
}