{
    "VERSE": "76:12",
    "ARABIC": "وَجَزَىٰهُم بِمَا صَبَرُوا۟ جَنَّةً وَحَرِيرًا",
    "ENGLISH": {
        "TRANSLATION_0": "and will reward them for their steadfastness with a Garden and with silk.",
        "TRANSLATION_1": "And reward them for their perseverence Paradise and silken robes,\n",
        "TRANSLATION_2": "and will reward them for their steadfastness with Paradise and robes of silk.\n",
        "TRANSLATION_3": "For their patience, He will reward them with Paradise and silk.\n",
        "TRANSLATION_4": "And gave them Paradise and silk clothes, as a reward for their patience.\n",
        "TRANSLATION_5": "And their recompense shall be Paradise, and silken garments, because they were patient.\n",
        "TRANSLATION_6": "And reward them, because they were patient, with garden and silk,\n",
        "TRANSLATION_7": "and recompensed them for their patience with a Garden, and silk;\n",
        "TRANSLATION_8": "And hath awarded them for all that they endured, a Garden and silk attire;\n",
        "TRANSLATION_9": "and their reward for being patient will be a Garden and silk [clothing].\n",
        "TRANSLATION_10": "And shall recompense them for that which they patiently bare with a Garden and silken garment.\n",
        "TRANSLATION_11": "He rewarded them for their patience with a garden and [garments of] silk,\n",
        "TRANSLATION_12": "And because they were patient and constant, He will reward them with a Garden and (garments of) silk.\n",
        "TRANSLATION_13": "And their recompense shall be Paradise, and silken garments, because they were patient.\n",
        "TRANSLATION_14": "and recompense them for their patience with a Garden, and robes of silk.\n",
        "TRANSLATION_15": "And will reward them for their patience with a Garden and silk.\n",
        "TRANSLATION_16": "And will reward them for what they patiently endured [with] a garden [in Paradise] and silk [garments].\n",
        "TRANSLATION_17": "[76:12] And He has rewarded them for their patience, for their steadfastness in refraining from disobedience, with a   Garden, into which they are admitted, and silk, which they are given to wear;\n",
        "TRANSLATION_18": "(And hath awarded them for all that they endured) in the life of the world of poverty and misfortunes, (a 715 Garden and silk attire;\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "76:12",
            "74:40",
            "89:30",
            "43:72",
            "47:6",
            "2:82",
            "26:90",
            "11:23",
            "85:7",
            "44:25"
        ],
        "BIBLE": [
            "writings:psalms:111:5",
            "prophets:i%20kings:13:3",
            "prophets:i%20samuel:18:4",
            "torah:leviticus:19:24",
            "writings:job:38:36",
            "prophets:ezekiel:36:28",
            "writings:job:41:3",
            "writings:psalms:124:6",
            "writings:psalms:106:15",
            "writings:psalms:112:9"
        ]
    }
}