{
    "VERSE": "76:14",
    "ARABIC": "وَدَانِيَةً عَلَيْهِمْ ظِلَٰلُهَا وَذُلِّلَتْ قُطُوفُهَا تَذْلِيلًا",
    "ENGLISH": {
        "TRANSLATION_0": "Its shading branches will droop down over them, its ripe fruit hanging ready to be picked.",
        "TRANSLATION_1": "The shadows will bend over them, and low will hang the clusters of grapes.\n",
        "TRANSLATION_2": "The shades of Paradise will bend over them, and its fruits will be brought within their easy reach;\n",
        "TRANSLATION_3": "The shades of the garden will be closely spread over them and it will be easy for them to reach the fruits.\n",
        "TRANSLATION_4": "And its shade will cover them, and its fruit clusters brought down low for them.\n",
        "TRANSLATION_5": "And the shade thereof is close upon them, and the bunches of fruit thereof will hang low within their reach.\n",
        "TRANSLATION_6": "And close down upon them (shall be) its shadows, and its fruits shall be made near (to them), being easy to reach.\n",
        "TRANSLATION_7": "near them shall be its shades, and its clusters hung meekly down,\n",
        "TRANSLATION_8": "The shade thereof is close upon them and the clustered fruits thereof bow down.\n",
        "TRANSLATION_9": "the shading branches of trees will come down low over them, and their clusters of fruit, will hang down where they are the easiest to reach.\n",
        "TRANSLATION_10": "And close upon them will be the shades thereof, and low will hang the clusters thereof greatly.\n",
        "TRANSLATION_11": "Its shades will be close over them and its clusters [of fruits] will be hanging low.\n",
        "TRANSLATION_12": "And the shades of the (Garden) will come low over them, and the bunches (of fruit), there, will hang low in humility.\n",
        "TRANSLATION_13": "And the shade thereof is close upon them, and the bunches of fruit thereof will hang low within their reach.\n",
        "TRANSLATION_14": "Near them shall be its shades with its clusters hung gently down,\n",
        "TRANSLATION_15": "Its shade hovering over them, and its fruit brought low within reach.\n",
        "TRANSLATION_16": "And near above them are its shades, and its [fruit] to be picked will be lowered in compliance.\n",
        "TRANSLATION_17": "[76:14] And close (dāniyatan is a supplement to the [syntactical] locus of the clause lā yarawna, in other words, [it is a supplement to the import] ghayra rā’īna) over them will be its shades, its trees, and its clusters [of fruits] will hang low, its fruits will brought close, so that they are reached by the one standing, the one sitting or the one lying down.\n",
        "TRANSLATION_18": "(The shade) of trees (thereof is close upon them and the clustered fruits thereof bow down) are made close and available to them.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "76:14",
            "69:23",
            "56:30",
            "83:33",
            "25:76",
            "26:96",
            "56:43",
            "36:56",
            "23:22",
            "37:27"
        ],
        "BIBLE": [
            "writings:psalms:80:11",
            "torah:genesis:40:10",
            "prophets:ezekiel:17:23",
            "prophets:isaiah:60:6",
            "prophets:isaiah:14:11",
            "writings:psalms:44:20",
            "prophets:ezekiel:17:6",
            "torah:exodus:26:13",
            "torah:numbers:4:20",
            "torah:exodus:8:2"
        ]
    }
}