{
    "VERSE": "76:15",
    "ARABIC": "وَيُطَافُ عَلَيْهِم بِـَٔانِيَةٍ مِّن فِضَّةٍ وَأَكْوَابٍ كَانَتْ قَوَارِيرَا۠",
    "ENGLISH": {
        "TRANSLATION_0": "Vessels of silver and goblets of pure crystal will be passed round among them,",
        "TRANSLATION_1": "Passed round will be silver flagons and goblets made of glass,\n",
        "TRANSLATION_2": "and there shall be passed around them vessels of silver and goblets of crystal,\n",
        "TRANSLATION_3": "They will be served with silver dishes and crystal clear goblets.\n",
        "TRANSLATION_4": "Rounds of silver cups and silver beakers, looking like glass, will be presented upon them.\n",
        "TRANSLATION_5": "And among them will be passed round vessels of silver and cups of crystal --\n",
        "TRANSLATION_6": "And there shall be made to go round about them vessels of silver and goblets which are of glass,\n",
        "TRANSLATION_7": "and there shall be passed around them vessels of silver, and goblets of crystal,\n",
        "TRANSLATION_8": "Goblets of silver are brought round for them, and beakers (as) of glass\n",
        "TRANSLATION_9": "Vessels of silver and goblets of pure crystal will be passed round among them\n",
        "TRANSLATION_10": "And brought round amongst them will be vessels of silver and also goblets of glass.\n",
        "TRANSLATION_11": "They will be served around with vessels of silver and goblets of crystal\n",
        "TRANSLATION_12": "And amongst them will be passed round vessels of silver and goblets of crystal,-\n",
        "TRANSLATION_13": "And amongst them will be passed round vessels of silver and cups of crystal,\n",
        "TRANSLATION_14": "and passed around them shall be silver vessels, and crystal goblets,\n",
        "TRANSLATION_15": "Passing around them are vessels of silver, and cups of crystal.\n",
        "TRANSLATION_16": "And there will be circulated among them vessels of silver and cups having been [created] clear [as glass],\n",
        "TRANSLATION_17": "[76:15] And they will be waited upon from all around them, in it, with vessels of silver, and goblets (akwāb are cups without handles) of crystal —\n",
        "TRANSLATION_18": "(Goblets of silver are brought round for them) by servants, (and beakers (as) of glass) without handles or covers\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "76:15",
            "76:16",
            "88:14",
            "37:27",
            "52:25",
            "43:71",
            "16:50",
            "14:29",
            "76:21",
            "34:51"
        ],
        "BIBLE": [
            "prophets:ii%20kings:12:14",
            "torah:exodus:27:17",
            "prophets:i%20samuel:5:8",
            "torah:numbers:4:26",
            "prophets:ii%20samuel:8:10",
            "torah:genesis:37:28",
            "prophets:i%20kings:20:39",
            "torah:leviticus:1:5",
            "prophets:ezekiel:40:17",
            "torah:exodus:16:13"
        ]
    }
}