{
    "VERSE": "76:16",
    "ARABIC": "قَوَارِيرَا۟ مِن فِضَّةٍ قَدَّرُوهَا تَقْدِيرًا",
    "ENGLISH": {
        "TRANSLATION_0": "crystalline silver - they have measured them very exactly.",
        "TRANSLATION_1": "And crystal clear bottles of silver, of which they will determine the measure themselves.\n",
        "TRANSLATION_2": "goblets bright as crystal but made of silver, filled to exact measure.\n",
        "TRANSLATION_3": "Also there will be crystal clear goblets of silver containing the exact measure of drink which they desire.\n",
        "TRANSLATION_4": "Glass made from silver, which the servers have filled up to the measure.\n",
        "TRANSLATION_5": "(Qawarir) Crystal-clear, made of silver. They will determine the measure thereof.\n",
        "TRANSLATION_6": "(Transparent as) glass, made of silver; they have measured them according to a measure.\n",
        "TRANSLATION_7": "crystal of silver that they have measured -- very exactly.\n",
        "TRANSLATION_8": "(Bright as) glass but (made) of silver, which they (themselves) have measured to the measure (of their deeds).\n",
        "TRANSLATION_9": "and gleaming silver goblets which have been filled to the exact measure,\n",
        "TRANSLATION_10": "Godblets of silver, they shall have filled them to exact measure.\n",
        "TRANSLATION_11": "—crystal of silver— [from] which they will dispense in a precise measure.\n",
        "TRANSLATION_12": "Crystal-clear, made of silver: they will determine the measure thereof (according to their wishes).\n",
        "TRANSLATION_13": "Crystal-clear, made of silver. They will determine the measure thereof according to their wishes.\n",
        "TRANSLATION_14": "goblets of silver that they have precisely measured.\n",
        "TRANSLATION_15": "Crystal of silver—they measured them exactly.\n",
        "TRANSLATION_16": "Clear glasses [made] from silver of which they have determined the measure.\n",
        "TRANSLATION_17": "[76:16] crystal of silver, that is, they are made of silver which is transparent like crystal — which they, that is, the ones passing around them [in service], have measured in a precise measure, according to the measure required by the one drinking it, neither more nor less, which makes for a most delightful drink.\n",
        "TRANSLATION_18": "((Bright as) glass but (made) of silver, which they (themselves) have measured) in the hands of slave youths (to the measure (of their deeds)) it is also said that the drink is so measured that it is neither more nor less than what is required.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "76:16",
            "76:15",
            "14:29",
            "37:51",
            "83:25",
            "16:54",
            "3:127",
            "32:17",
            "76:21",
            "44:53"
        ],
        "BIBLE": [
            "writings:i%20chronicles:28:15",
            "writings:job:28:17",
            "prophets:habakkuk:2:16",
            "writings:ezra:7:22",
            "prophets:ezekiel:45:11",
            "prophets:ezekiel:40:35",
            "writings:daniel:11:36",
            "prophets:i%20samuel:25:18",
            "prophets:ezekiel:40:24",
            "torah:numbers:7:19"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:11",
            
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:1:12",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:1:7"
        ]
    }
}