{
    "VERSE": "76:17",
    "ARABIC": "وَيُسْقَوْنَ فِيهَا كَأْسًا كَانَ مِزَاجُهَا زَنجَبِيلًا",
    "ENGLISH": {
        "TRANSLATION_0": "They will be given there a cup to drink mixed with the warmth of ginger.",
        "TRANSLATION_1": "There will they drink a cup flavoured with ginger\n",
        "TRANSLATION_2": "Therein they shall be served a cup flavoured with ginger,\n",
        "TRANSLATION_3": "They will drink cups containing (soft flowing) sparkling water\n",
        "TRANSLATION_4": "And in Paradise they will be given to drink cups, filled with a mixture of ginger.\n",
        "TRANSLATION_5": "And they will be given to drink there of a cup (of wine) mixed with Zanjabil (ginger),\n",
        "TRANSLATION_6": "And they shall be made to drink therein a cup the admixture of which shall be ginger,\n",
        "TRANSLATION_7": "And therein they shall be given to drink a cup whose mixture is ginger,\n",
        "TRANSLATION_8": "There are they watered with a cup whereof the mixture is of Zanjabil,\n",
        "TRANSLATION_9": "and they will be given a cup to drink flavoured with ginger,\n",
        "TRANSLATION_10": "And therein they shall be given to drink of a cup whereof the admixture will be ginger.\n",
        "TRANSLATION_11": "They will be served therein with a cup of a drink seasoned with Zanjabeel,\n",
        "TRANSLATION_12": "And they will be given to drink there of a Cup (of Wine) mixed with Zanjabil,-\n",
        "TRANSLATION_13": "And they will be given to drink there a cup (of wine) mixed with Zanjabil (ginger, etc.),\n",
        "TRANSLATION_14": "And they shall be given to drink from a cup whose mixture is ginger,\n",
        "TRANSLATION_15": "They will be served therein with a cup whose flavor is Zanjabeel.\n",
        "TRANSLATION_16": "And they will be given to drink a cup [of wine] whose mixture is of ginger\n",
        "TRANSLATION_17": "[76:17] And they will be given to drink therein a cup, wine, whose mixture, that with which it is mixed, is ginger,\n",
        "TRANSLATION_18": "(There) in the Garden (are they watered with a cup) of wine (whereof the mixture is of Zanjabil,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "76:17",
            "76:5",
            "52:23",
            "83:27",
            "25:76",
            "37:45",
            "71:18",
            "44:27",
            "26:94",
            "19:72"
        ],
        "BIBLE": [
            "writings:psalms:75:9",
            "prophets:habakkuk:2:16",
            "prophets:ezekiel:23:33",
            "prophets:jeremiah:16:7",
            "prophets:ii%20kings:3:17",
            "prophets:jeremiah:49:12",
            "prophets:zechariah:9:15",
            "writings:proverbs:23:31",
            "prophets:micah:6:15",
            "prophets:jeremiah:25:15"
        ]
    }
}