{
    "VERSE": "76:2",
    "ARABIC": "إِنَّا خَلَقْنَا ٱلْإِنسَٰنَ مِن نُّطْفَةٍ أَمْشَاجٍ نَّبْتَلِيهِ فَجَعَلْنَٰهُ سَمِيعًۢا بَصِيرًا",
    "ENGLISH": {
        "TRANSLATION_0": "We created man from a mingled drop to test him, and We made him hearing and seeing.",
        "TRANSLATION_1": "Verily We created man from a sperm yoked (to the ovum) to bring out his real substance, then gave him hearing and sight.\n",
        "TRANSLATION_2": "Verily We created man out of a drop of intermingled sperm so that We might try him, and We therefore endowed him with hearing and sight.\n",
        "TRANSLATION_3": "We created the human being from the union of sperm and egg to test him. We gave him hearing and vision.\n",
        "TRANSLATION_4": "Indeed We have created man from mixed semen; in order to test him – We therefore made him hearing, knowing.\n",
        "TRANSLATION_5": "Verily, We have created man from Nutfah Amshaj, in order to try him, so, We made him hearer and seer.\n",
        "TRANSLATION_6": "Surely We have created man from a small life-germ uniting (itself): We mean to try him, so We have made him hearing, seeing.\n",
        "TRANSLATION_7": "We created man of a sperm-drop, a mingling, and We made him hearing, seeing.\n",
        "TRANSLATION_8": "Lo! We create man from a drop of thickened fluid to test him; so We make him hearing, knowing.\n",
        "TRANSLATION_9": "We created man from a drop of mingled fluid so that We might try him; We gave him hearing and sight;\n",
        "TRANSLATION_10": "Verily We! We created man from a sperm of mixtures, that We might prove him, wherefore We made him hearing, seeing.\n",
        "TRANSLATION_11": "Indeed We created man from the drop of a mixed fluid so that We may put him to test, so We endowed with hearing and sight.\n",
        "TRANSLATION_12": "Verily We created Man from a drop of mingled sperm, in order to try him: So We gave him (the gifts), of Hearing and Sight.\n",
        "TRANSLATION_13": "Verily, We have created man from Nutfah drops of mixed semen (discharge of man and woman), in order to try him, so We made him hearer, seer.\n",
        "TRANSLATION_14": "We have created the human from a (sperm) drop, a mixture, testing him; We made him to hear and see.\n",
        "TRANSLATION_15": "We created man from a liquid mixture, to test him; and We made him hearing and seeing.\n",
        "TRANSLATION_16": "Indeed, We created man from a sperm-drop mixture that We may try him; and We made him hearing and seeing.\n",
        "TRANSLATION_17": "[76:2] Verily We created man, the species, from a drop of mixed fluid, [from] a mixture, that is from the [seminal] fluid of the man and the [ovarian] fluid of the woman that have mixed and blended, so that We may test him, trying him with the moral obligations [of religion] (nabtalīhi is either a new sentence [‘We will test him’], or an implied circumstantial qualifier, meaning ‘intending to test him when he is ready’). So We made him, for that [very] reason, hearing, seeing.\n",
        "TRANSLATION_18": "(Lo! We create man) i.e. the progeny of Adam (from a drop of thickened fluid) from Adam and Eve's drops of two different kinds of fluid: that of man being white and thick and that of the woman being yellow and thin; thus progeny comes from both of them (to test him) with hardship and comfort; it is also said this means: to test him with good and evil; (so We make him hearing, knowing) We gave him the faculty of hearing so that he could hear the Truth and guidance and the faculty of sight so that he could see the Truth and guidance. It is also said that We make him hearing, knowing in order to test him with good and evil, 714 faith and disbelief.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "76:2",
            "36:77",
            "16:4",
            "80:19",
            "75:14",
            "22:75",
            "40:20",
            "42:11",
            "22:61",
            "43:15"
        ],
        "BIBLE": [
            "torah:leviticus:10:17",
            "torah:genesis:3:6",
            "torah:exodus:36:6",
            "torah:leviticus:17:11",
            "writings:ecclesiastes:3:10",
            "writings:ruth:3:3",
            "writings:daniel:4:3",
            "writings:daniel:2:26",
            "prophets:hosea:2:14",
            "prophets:i%20kings:11:28"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:3:5",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:3:8",
            "Sefer%20Yetzirah:6:1"
        ]
    }
}