{
    "VERSE": "76:20",
    "ARABIC": "وَإِذَا رَأَيْتَ ثَمَّ رَأَيْتَ نَعِيمًا وَمُلْكًا كَبِيرًا",
    "ENGLISH": {
        "TRANSLATION_0": "Seeing them, you see delight and a great kingdom.",
        "TRANSLATION_1": "When you look around, you will see delights and great dominion.\n",
        "TRANSLATION_2": "Whitherto you look around, you will see an abundance of bliss and the glories of a great kingdom.\n",
        "TRANSLATION_3": "If you were to see it, you would find it to be a great kingdom with great bounty.\n",
        "TRANSLATION_4": "And when you look towards it, you will see serenity and a great kingdom.\n",
        "TRANSLATION_5": "And when you look there (in Paradise), you will see a delight (that cannot be imagined), and a great dominion.\n",
        "TRANSLATION_6": "And when you see there, you shall see blessings and a great kingdom.\n",
        "TRANSLATION_7": "when thou seest them then thou seest bliss and a great kingdom.\n",
        "TRANSLATION_8": "When thou seest, thou wilt see there bliss and high estate.\n",
        "TRANSLATION_9": "wherever you look, you will see bliss and a great kingdom:\n",
        "TRANSLATION_10": "And when thou lookest them thou shalt behold delight and a dominion magnificent.\n",
        "TRANSLATION_11": "As you look on, you will see there bliss and a great kingdom.\n",
        "TRANSLATION_12": "And when thou lookest, it is there thou wilt see a Bliss and a Realm Magnificent.\n",
        "TRANSLATION_13": "And when you look there (in Paradise), you will see a delight (that cannot be imagined), and a great dominion.\n",
        "TRANSLATION_14": "When you see them, you see bliss, and a great Kingdom.\n",
        "TRANSLATION_15": "Wherever you look, you see bliss, and a vast kingdom.\n",
        "TRANSLATION_16": "And when you look there [in Paradise], you will see pleasure and great dominion.\n",
        "TRANSLATION_17": "[76:20] And when you look there, that is to say, when you begin to look about in Paradise, you will see (ra’ayta is the response to idhā, ‘when’) bliss, that is indescribable, and a great kingdom, vast, without limit.\n",
        "TRANSLATION_18": "(When thou seest) Muhammad, (thou wilt see there) in the Garden (bliss) lasting bliss for its dwellers (and high estate) none enters in on them except with greetings of peace and permission.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "76:20",
            "89:22",
            "22:56",
            "71:22",
            "93:11",
            "21:103",
            "79:34",
            "44:27",
            "25:21",
            "33:68"
        ],
        "BIBLE": [
            "writings:job:35:5",
            "writings:psalms:51:18",
            "writings:daniel:7:27",
            "writings:daniel:7:14",
            "torah:deuteronomy:21:14",
            "torah:genesis:28:15",
            "writings:daniel:3:33",
            "prophets:i%20samuel:20:31",
            "torah:leviticus:14:44",
            "torah:genesis:13:9"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:13",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:2"
        ]
    }
}