{
    "VERSE": "76:21",
    "ARABIC": "عَٰلِيَهُمْ ثِيَابُ سُندُسٍ خُضْرٌ وَإِسْتَبْرَقٌ وَحُلُّوٓا۟ أَسَاوِرَ مِن فِضَّةٍ وَسَقَىٰهُمْ رَبُّهُمْ شَرَابًا طَهُورًا",
    "ENGLISH": {
        "TRANSLATION_0": "They will wear green garments of fine silk and rich brocade. They will be adorned with silver bracelets. And their Lord will give them a pure draught to drink.",
        "TRANSLATION_1": "On their bodies will be garments of the finest green silk and brocade, and they will be adorned with bracelets of silver; and their Lord will give them a purest draught to drink.\n",
        "TRANSLATION_2": "They [i.e., the virtuous] shall be attired in garments of fine green silk and rich brocade and will be adorned with bracelets of silver. Their Lord will give them a pure wine to drink.\n",
        "TRANSLATION_3": "They will have fine green silk and brocade, and they will be decked with bracelets of silver. Their Lord will provide them with a drink of pure wine.\n",
        "TRANSLATION_4": "In it they adorn clothes of fine green silk and gold embroidery; and they are given silver bracelets to wear; and their Lord gave them pure wine to drink.\n",
        "TRANSLATION_5": "Their garments will be of fine green silk, and Istabraq. They will be adorned with bracelets of silver, and their Lord will give them a purifying drink.\n",
        "TRANSLATION_6": "Upon them shall be garments of fine green silk and thick silk interwoven with gold, and they shall be adorned with bracelets of silver, and their Lord shall make them drink a pure drink.\n",
        "TRANSLATION_7": "Upon them shall be green garments of silk and brocade; they are adorned with bracelets of silver, and their Lord shall give them to drink a pure draught.\n",
        "TRANSLATION_8": "Their raiment will be fine green silk and gold embroidery. Bracelets of silver will they wear. Their Lord will slake their thirst with a pure drink.\n",
        "TRANSLATION_9": "they will wear green garments of fine silk and rich brocade. They will be adorned with silver bracelets. And their Lord will give them a pure drink.\n",
        "TRANSLATION_10": "Upon them shall be garments of fine green silk and of brocades. And adorned they shall be with bracelets of silver: and their Lord shall give them drink a beverage pure.\n",
        "TRANSLATION_11": "Upon them will be cloaks of green silk and brocade and they will be adorned with bracelets of silver. Their Lord will give them to drink a pure drink.\n",
        "TRANSLATION_12": "Upon them will be green Garments of fine silk and heavy brocade, and they will be adorned with Bracelets of silver; and their Lord will give to them to drink of a Wine Pure and Holy.\n",
        "TRANSLATION_13": "Their garments will be of fine green silk, and gold embroidery. They will be adorned with bracelets of silver, and their Lord will give them a pure drink.\n",
        "TRANSLATION_14": "Upon them there will be garments of green silk, rich brocade, and they will be adorned with bracelets of silver. Their Lord will give them a pure beverage to drink.\n",
        "TRANSLATION_15": "Upon them are garments of green silk, and satin. And they will be adorned with bracelets of silver. And their Lord will offer them a pure drink.\n",
        "TRANSLATION_16": "Upon the inhabitants will be green garments of fine silk and brocade. And they will be adorned with bracelets of silver, and their Lord will give them a purifying drink.\n",
        "TRANSLATION_17": "[76:21] Upon them (‘āliyahum is in the accusative as an adverbial clause, and constitutes the predicate of a subject that will follow; a variant reading has ‘ālīhim as a subject, with what follows as its predicate; the suffixed pronoun [-hum] denotes those persons to whom the supplement refers) will be garments of fine green silk and [heavy] silk brocade (sundus is fine silk and constitutes the outer cushion, while istabraq is coarse silk and constitutes the inner lining; either read thiyābu sundusin khudrun wa’stabraqin or thiyābu sundusin   khudrin wa’stabraqun, or thiyābu sundusin khudrun wa’stabraqun, or wa-thiyābu sundusin khudrin wa’stabraqin). And they will be adorned with bracelets of silver — elsewhere it is stated, ‘of gold’, in order to show that they will be adorned with both types at the same time or separately — and their Lord will give them a pure drink to drink (tahūran, ‘pure’, is intended as a hyperbolic qualification of its purity and cleanness, in contrast to the wine of this world).\n",
        "TRANSLATION_18": "(Their raiment will be fine green silk and gold embroidery. Bracelets of silver will they wear. Their Lord will slake their thirst with a pure drink) pure from filth; it is also said this means: Allah purifies them from hatred, cheating and enmity.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "76:21",
            "18:31",
            "25:64",
            "76:15",
            "16:50",
            "38:51",
            "16:42",
            "29:59",
            "74:4",
            "84:5"
        ],
        "BIBLE": [
            "prophets:hosea:2:14",
            "torah:leviticus:10:17",
            "prophets:ii%20samuel:22:36",
            "torah:leviticus:17:11",
            "prophets:nahum:1:14",
            "writings:song%20of%20songs:1:11",
            "torah:leviticus:15:15",
            "torah:exodus:20:20",
            "torah:leviticus:15:30",
            "torah:genesis:24:35"
        ]
    }
}