{
    "VERSE": "76:22",
    "ARABIC": "إِنَّ هَٰذَا كَانَ لَكُمْ جَزَآءً وَكَانَ سَعْيُكُم مَّشْكُورًا",
    "ENGLISH": {
        "TRANSLATION_0": "'This is your reward. Your striving is fully acknowledged.'",
        "TRANSLATION_1": "This in truth is your recompense, and acceptance of your endeavours.\"\n",
        "TRANSLATION_2": "Behold, this is your recompense and your endeavour has been appreciated.\n",
        "TRANSLATION_3": "This will be their reward and their efforts will be appreciated.\n",
        "TRANSLATION_4": "It will be said to them, “This is your reward – indeed your efforts have been appreciated.”\n",
        "TRANSLATION_5": "(And it will be said to them): \"Verily, this is a reward for you, and your endeavor has been accepted.\"\n",
        "TRANSLATION_6": "Surely this is a reward for you, and your striving shall be recompensed.\n",
        "TRANSLATION_7": "Behold, this is a recompense for you, and your striving is thanked.'\n",
        "TRANSLATION_8": "(And it will be said unto them): Lo! this is a reward for you. Your endeavour (upon earth) hath found acceptance.\n",
        "TRANSLATION_9": "This is your reward. Your endeavour is fully acknowledged.\n",
        "TRANSLATION_10": "Verily this is for you by way of recompense, and your endeavour hath been accepted.\n",
        "TRANSLATION_11": "[They will be told]: ‘This is your reward, and your efforts have been well-appreciated.’\n",
        "TRANSLATION_12": "Verily this is a Reward for you, and your Endeavour is accepted and recognised.\"\n",
        "TRANSLATION_13": "(And it will be said to them): \"Verily, this is a reward for you, and your endeavour has been accepted.\"\n",
        "TRANSLATION_14": "See, this is your recompense, your striving is thanked'\n",
        "TRANSLATION_15": "“This is a reward for you. Your efforts are well appreciated.”\n",
        "TRANSLATION_16": "[And it will be said], \"Indeed, this is for you a reward, and your effort has been appreciated.\"\n",
        "TRANSLATION_17": "[76:22] ‘Verily this, bliss, is a reward for you, and your endeavour has been appreciated’.\n",
        "TRANSLATION_18": "(Lo! This) which I have described to you of food, drink and raiment (is a reward for you) is a reward from Allah. (Your endeavour (upon earth) hath found acceptance) your works were accepted and made to grow.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "76:22",
            "88:9",
            "53:40",
            "17:63",
            "54:14",
            "56:24",
            "71:9",
            "92:4",
            "21:94",
            "37:24"
        ],
        "BIBLE": [
            "torah:genesis:6:12",
            "torah:genesis:24:56",
            "writings:job:20:7",
            "torah:exodus:32:9",
            "writings:job:19:28",
            "torah:deuteronomy:9:13",
            "prophets:judges:13:22",
            "prophets:jeremiah:5:4",
            "writings:psalms:58:12",
            "prophets:isaiah:62:11"
        ]
    }
}