{
    "VERSE": "76:23",
    "ARABIC": "إِنَّا نَحْنُ نَزَّلْنَا عَلَيْكَ ٱلْقُرْءَانَ تَنزِيلًا",
    "ENGLISH": {
        "TRANSLATION_0": "It is We who have sent the Qur'an down to you little by little.",
        "TRANSLATION_1": "We have revealed the Qur'an to you gradually;\n",
        "TRANSLATION_2": "(O Prophet), indeed We have revealed the Qur'an to you in portions.\n",
        "TRANSLATION_3": "(Muhammad), We have revealed the Quran to you in gradual steps.\n",
        "TRANSLATION_4": "Indeed We have sent down the Qur’an upon you, in stages.\n",
        "TRANSLATION_5": "Verily, it is We Who have sent down the Qur'an to you by stages.\n",
        "TRANSLATION_6": "Surely We Ourselves have revealed the Quran to you revealing (it) in portions.\n",
        "TRANSLATION_7": "Surely We have sent down the Koran on thee, a sending down;\n",
        "TRANSLATION_8": "Lo! We, even We, have revealed unto thee the Qur'an, a revelation;\n",
        "TRANSLATION_9": "Truly, it is We who have revealed to you the Quran, a gradual revelation.\n",
        "TRANSLATION_10": "Verily We! it is We Who have revealed Unto thee the Qur'an, a gradual revelation.\n",
        "TRANSLATION_11": "Indeed We have sent down to you the Quran in a gradual descent.\n",
        "TRANSLATION_12": "It is We Who have sent down the Qur'an to thee by stages.\n",
        "TRANSLATION_13": "Verily! It is We Who have sent down the Quran to you (O Muhammad SAW) by stages.\n",
        "TRANSLATION_14": "We have indeed, sent down to you the Koran, a (clear) sending,\n",
        "TRANSLATION_15": "It is We who sent down the Quran upon you—a gradual revelation.\n",
        "TRANSLATION_16": "Indeed, it is We who have sent down to you, [O Muhammad], the Qur'an progressively.\n",
        "TRANSLATION_17": "[76:23] Assuredly We (nahnu reiterates the subject of innā, ‘assuredly, for the purpose of emphasis; alternatively it is a separating pronoun) have revealed the Qur’ān to you as a gradual revelation (tanzīlan is the predicate of inna, ‘assuredly’), in other words, We have divided it into parts instead of not revealing it all at once.\n",
        "TRANSLATION_18": "716 (Lo! We, even We, have revealed unto thee the Qur'an) We have sent you Gabriel with the Qur'an, (a revelation) in instalments: one, two and three verses at a time;\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "76:23",
            "20:2",
            "73:4",
            "55:2",
            "84:21",
            "15:95",
            "38:1",
            "15:91",
            "54:22",
            "54:17"
        ],
        "BIBLE": [
            "writings:psalms:142:6",
            "prophets:jeremiah:10:23",
            "writings:psalms:119:33",
            "prophets:ii%20kings:5:22",
            "prophets:jeremiah:26:5",
            "prophets:jeremiah:20:12",
            "prophets:jeremiah:11:20",
            "prophets:jeremiah:28:9",
            "writings:job:14:16",
            "writings:ii%20chronicles:10:16"
        ]
    }
}