{
    "VERSE": "76:24",
    "ARABIC": "فَٱصْبِرْ لِحُكْمِ رَبِّكَ وَلَا تُطِعْ مِنْهُمْ ءَاثِمًا أَوْ كَفُورًا",
    "ENGLISH": {
        "TRANSLATION_0": "Therefore wait patiently for the judgement of your Lord. Do not obey any evildoer or thankless man among them.",
        "TRANSLATION_1": "So wait for your Lord's command, and do not follow any sinner or disbeliever among them.\n",
        "TRANSLATION_2": "So persevere with the command of your Lord and do not pay any heed to the wicked and the unbelieving,\n",
        "TRANSLATION_3": "So wait patiently for the command of your Lord and do not yield to any sinful or disbelieving person among them (people).\n",
        "TRANSLATION_4": "Therefore stay patient upon your Lord’s command, and do not listen to any of the sinners or ingrates among them.\n",
        "TRANSLATION_5": "Therefore be patient with constancy to the command of your Lord, and obey neither a sinner nor a disbeliever among them.\n",
        "TRANSLATION_6": "Therefore wait patiently for the command of your Lord, and obey not from among them a sinner or an ungrateful one.\n",
        "TRANSLATION_7": "so be thou patient under the judgment of thy Lord, and obey not one of them, sinner or unbeliever.\n",
        "TRANSLATION_8": "So submit patiently to thy Lord's command, and obey not of them any guilty one or disbeliever.\n",
        "TRANSLATION_9": "So wait patiently for the command of your Lord, and do not yield to anyone among them who is sinful or ungrateful;\n",
        "TRANSLATION_10": "Wherefore persevere thou with the commandment of thy Lord, and obey not thou of them, any sinner or ingrate.\n",
        "TRANSLATION_11": "So submit patiently to the judgement of your Lord and do not obey any sinner or ingrate from among them,\n",
        "TRANSLATION_12": "Therefore be patient with constancy to the Command of thy Lord, and hearken not to the sinner or the ingrate among them.\n",
        "TRANSLATION_13": "Therefore be patient (O Muhammad SAW) and submit to the Command of your Lord (Allah, by doing your duty to Him and by conveying His Message to mankind), and obey neither a sinner nor a disbeliever among them.\n",
        "TRANSLATION_14": "therefore be patient under the Judgement of your Lord, and do not obey either the sinner or the unbeliever.\n",
        "TRANSLATION_15": "So be patient for the decision of your Lord, and do not obey the sinner or the blasphemer among them.\n",
        "TRANSLATION_16": "So be patient for the decision of your Lord and do not obey from among them a sinner or ungrateful [disbeliever].\n",
        "TRANSLATION_17": "[76:24] So submit patiently to your Lord’s decree, to you to deliver His Message, and do not obey of them, that is, [of] the disbelievers, any sinner or disbeliever, namely, ‘Utba b. Rabī‘a and al-Walīd b. al-Mughīra — both of whom said to the Prophet (s), ‘Abandon this affair of yours!’; it is also possible that what is meant is every sinner or disbeliever, in other words, ‘Do not obey any of these, whichever of the two he may be, in what he may summon you to of sin or disbelief’.\n",
        "TRANSLATION_18": "(So submit patiently to thy Lord's command) to your Lord's decree; and it is also said this means: be patient in conveying the message of your Lord, (and obey not of them) of the disbelievers of Quraysh (any guilty one) any lewd and liar one, i.e. al-Walid Ibn al-Mughirah (or disbeliever) in Allah, i.e. 'Utbah Ibn Rabi'ah.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "76:24",
            "26:21",
            "26:83",
            "108:2",
            "68:48",
            "17:28",
            "74:7",
            "52:48",
            "15:98",
            "84:5"
        ],
        "BIBLE": [
            "prophets:i%20kings:18:18",
            "writings:psalms:1:5",
            "prophets:i%20kings:18:21",
            "writings:ruth:1:16",
            "prophets:ii%20samuel:7:8",
            "torah:deuteronomy:27:10",
            "prophets:i%20samuel:12:14",
            "writings:i%20chronicles:17:7",
            "writings:psalms:7:7",
            "writings:ii%20chronicles:19:6"
        ]
    }
}