{
    "VERSE": "76:26",
    "ARABIC": "وَمِنَ ٱلَّيْلِ فَٱسْجُدْ لَهُۥ وَسَبِّحْهُ لَيْلًا طَوِيلًا",
    "ENGLISH": {
        "TRANSLATION_0": "Prostrate to Him during the night and glorify Him throughout the long night.",
        "TRANSLATION_1": "And bow in homage part of the night, and glorify Him far into the night.\n",
        "TRANSLATION_2": "and prostrate yourself before Him at night, and extol His Glory during the long watches of the night.\n",
        "TRANSLATION_3": "Prostrate before Him and glorify Him extensively during the night.\n",
        "TRANSLATION_4": "And prostrate for Him in a part of the night, and proclaim His purity into the long night.\n",
        "TRANSLATION_5": "And during the night, prostrate yourself to Him, and glorify Him a long night through.\n",
        "TRANSLATION_6": "And during part of the night adore Him, and give glory to Him (a) long (part of the) night.\n",
        "TRANSLATION_7": "and part of the night; bow down before Him and magnify Him through the long night.\n",
        "TRANSLATION_8": "And worship Him (a portion) of the night. And glorify Him through the livelong night.\n",
        "TRANSLATION_9": "and during the night prostrate ourself before Him, and extol His glory for a long part of the night.\n",
        "TRANSLATION_10": "And during the night - worship Him; and hallow Him the livelong night.\n",
        "TRANSLATION_11": "and worship Him for a watch of the night and glorify Him the night long.\n",
        "TRANSLATION_12": "And part of the night, prostrate thyself to Him; and glorify Him a long night through.\n",
        "TRANSLATION_13": "And during night, prostrate yourself to Him (i.e. the offering of Maghrib and 'Isha' prayers), and glorify Him a long night through (i.e. Tahajjud prayer).\n",
        "TRANSLATION_14": "and in the night prostrate to Him; and exalt Him for a long night.\n",
        "TRANSLATION_15": "And for part of the night, prostrate yourself to Him, and glorify Him long into the night.\n",
        "TRANSLATION_16": "And during the night prostrate to Him and exalt Him a long [part of the] night.\n",
        "TRANSLATION_17": "[76:26] and prostrate to Him for a portion of the night, that is, at after sunset (maghrib) and at night (‘ishā’), and glorify Him the length of the night: perform supererogatory prayers during it, as mentioned above, for either two thirds, a half or a third of it.\n",
        "TRANSLATION_18": "(And worship Him (a portion) of the night) pray the prayer of Maghrib and 'Isha'. (And glorify Him through the livelong night) pray to Him at night, this refers to supererogatory prayers; it is also said that the night prayer was made compulsory on him but not on his Companions.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "76:26",
            "52:49",
            "91:4",
            "36:37",
            "81:17",
            "89:4",
            "74:33",
            "93:2",
            "50:40",
            "92:1"
        ],
        "BIBLE": [
            "writings:nehemiah:4:3",
            "writings:i%20chronicles:16:29",
            "prophets:ezekiel:48:12",
            "writings:ii%20chronicles:35:14",
            "writings:proverbs:31:15",
            "writings:psalms:90:4",
            "torah:leviticus:23:37",
            "torah:exodus:15:2",
            "torah:deuteronomy:18:1",
            "writings:ii%20chronicles:29:29"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:12",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:1:1"
        ]
    }
}