{
    "VERSE": "76:27",
    "ARABIC": "إِنَّ هَٰٓؤُلَآءِ يُحِبُّونَ ٱلْعَاجِلَةَ وَيَذَرُونَ وَرَآءَهُمْ يَوْمًا ثَقِيلًا",
    "ENGLISH": {
        "TRANSLATION_0": "These people love this fleeting world and have put the thought of a Momentous Day behind their backs.",
        "TRANSLATION_1": "Surely men love what hastes away and forget the grievous day (ahead).\n",
        "TRANSLATION_2": "Verily they love (the good of this world) that is hastily obtainable and are oblivious of the burdensome Day ahead of them.\n",
        "TRANSLATION_3": "These people (disbelievers) love the worldly life and neglect the terrifying day which will come.\n",
        "TRANSLATION_4": "Indeed these people love what they have, the fleeting one, and have forsaken the immensely important day behind them.\n",
        "TRANSLATION_5": "Verily, these love the present life of this world, and put behind them a heavy Day.\n",
        "TRANSLATION_6": "Surely these love the transitory and neglect a grievous day before them.\n",
        "TRANSLATION_7": "Surely these men love the hasty world, and leave be behind them a heavy day.\n",
        "TRANSLATION_8": "Lo! these love fleeting life, and put behind them (the remembrance of) a grievous day.\n",
        "TRANSLATION_9": "Those people [who are unmindful of God] aspire for immediate gains, and put behind them a Heavy Day.\n",
        "TRANSLATION_10": "Verily those love the Herein, and leave in front of them a heavy day.\n",
        "TRANSLATION_11": "Indeed they love this transitory life, and disregard a heavy day that is ahead of them.\n",
        "TRANSLATION_12": "As to these, they love the fleeting life, and put away behind them a Day (that will be) hard.\n",
        "TRANSLATION_13": "Verily! These (disbelievers) love the present life of this world, and put behind them a heavy Day (that will be hard).\n",
        "TRANSLATION_14": "Indeed, these love the hasty life, and are heedless and leave behind them a heavy Day.\n",
        "TRANSLATION_15": "As for these: they love the fleeting life, and leave behind a Heavy Day.\n",
        "TRANSLATION_16": "Indeed, these [disbelievers] love the immediate and leave behind them a grave Day.\n",
        "TRANSLATION_17": "[76:27] Assuredly these love the transitory [life], this world, and leave behind them a burdensome day, an awful [one], namely, the Day of Resurrection, not working towards it.\n",
        "TRANSLATION_18": "(Lo! These) the people of Mecca (love fleeting life) love striving for the life of the world, (and put behind them (the remembrance of)) and refrain from striving for the day which is ahead of them (a grievous day) whose torment and horrors are severe.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "76:27",
            "29:13",
            "85:2",
            "36:59",
            "23:16",
            "28:65",
            "23:100",
            "77:35",
            "40:32",
            "11:99"
        ],
        "BIBLE": [
            "writings:psalms:17:14",
            "prophets:isaiah:43:4",
            "prophets:isaiah:10:3",
            "writings:psalms:34:13",
            "prophets:jeremiah:9:1",
            "prophets:ezekiel:12:16",
            "prophets:joshua:1:5",
            "prophets:i%20kings:17:18",
            "writings:ecclesiastes:2:16",
            "prophets:isaiah:24:6"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:4:8",
            "Sefer%20Yetzirah:4:11",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:3:5",
            "Sefer%20Yetzirah:1:9"
        ]
    }
}