{
    "VERSE": "76:29",
    "ARABIC": "إِنَّ هَٰذِهِۦ تَذْكِرَةٌ فَمَن شَآءَ ٱتَّخَذَ إِلَىٰ رَبِّهِۦ سَبِيلًا",
    "ENGLISH": {
        "TRANSLATION_0": "This truly is a Reminder, so whoever wills should take the Way towards his Lord.",
        "TRANSLATION_1": "This surely is a reminder: Therefore whosoever desires may take the way to his Lord.\n",
        "TRANSLATION_2": "Verily this is an Exhortation; so let him who so will take a way to his Lord.\n",
        "TRANSLATION_3": "This chapter is a reminder. Let those who want, seek guidance from their Lord.\n",
        "TRANSLATION_4": "This is indeed an advice; so whoever wishes may take the path towards his Lord.\n",
        "TRANSLATION_5": "Verily, this is an admonition, so whosoever wills, let him take a path to his Lord.\n",
        "TRANSLATION_6": "Surely this is a reminder, so whoever pleases takes to his Lord a way.\n",
        "TRANSLATION_7": "Surely this is a Reminder; so he who will, takes unto his Lord a way.\n",
        "TRANSLATION_8": "Lo! this is an Admonishment, that whosoever will may choose a way unto his Lord.\n",
        "TRANSLATION_9": "This is a reminder. Let whoever wishes, take the right path to his Lord.\n",
        "TRANSLATION_10": "Verily this is an admonition; then whosoever Will, may choose a way Unto his Lord.\n",
        "TRANSLATION_11": "This is indeed a reminder. So let anyone who wishes take the way toward his Lord.\n",
        "TRANSLATION_12": "This is an admonition: Whosoever will, let him take a (straight) Path to his Lord.\n",
        "TRANSLATION_13": "Verily! This (Verses of the Quran) is an admonition, so whosoever wills, let him take a Path to his Lord (Allah).\n",
        "TRANSLATION_14": "This is indeed a Reminder, so that he who will, takes a path to his Lord.\n",
        "TRANSLATION_15": "This is a reminder; so whoever wills, let him take a path to his Lord.\n",
        "TRANSLATION_16": "Indeed, this is a reminder, so he who wills may take to his Lord a way.\n",
        "TRANSLATION_17": "[76:29] This, sūra, is indeed a reminder, an admonition for [all] creatures. Let him who will, then, choose a way to his Lord, a path, through obedience.\n",
        "TRANSLATION_18": "(Lo! this is an Admonishment) from Allah, (that whosoever will may choose a way unto his Lord) that whoever will may believe in Allah's divine Oneness and return to his Lord.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "76:29",
            "73:19",
            "68:7",
            "23:107",
            "6:117",
            "36:25",
            "7:125",
            "54:10",
            "20:74",
            "37:31"
        ],
        "BIBLE": [
            "torah:genesis:12:19",
            "prophets:jeremiah:49:20",
            "prophets:jeremiah:50:45",
            "writings:psalms:71:1",
            "prophets:isaiah:40:14",
            "writings:psalms:31:2",
            "writings:ii%20chronicles:19:7",
            "writings:psalms:119:9",
            "prophets:i%20kings:18:10",
            "prophets:joshua:23:11"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:4:9"
        ]
    }
}