{
    "VERSE": "76:3",
    "ARABIC": "إِنَّا هَدَيْنَٰهُ ٱلسَّبِيلَ إِمَّا شَاكِرًا وَإِمَّا كَفُورًا",
    "ENGLISH": {
        "TRANSLATION_0": "We guided him on the Way, whether he is thankful or unthankful.",
        "TRANSLATION_1": "We surely showed him the way that he may either be grateful or deny.\n",
        "TRANSLATION_2": "Surely We showed him the Right Path, regardless of whether he chooses to be thankful or unthankful (to his Lord).\n",
        "TRANSLATION_3": "We showed him the right path whether he would be grateful or ungrateful.\n",
        "TRANSLATION_4": "We have indeed shown him the way – whether he is grateful or ingrate.\n",
        "TRANSLATION_5": "Verily, We guided him to the way, whether he be grateful or ungrateful.\n",
        "TRANSLATION_6": "Surely We have shown him the way: he may be thankful or unthankful.\n",
        "TRANSLATION_7": "Surely We guided him upon the way whether he be thankful or unthankful.\n",
        "TRANSLATION_8": "Lo! We have shown him the way, whether he be grateful or disbelieving.\n",
        "TRANSLATION_9": "We showed him the way, whether he be grateful or ungrateful.\n",
        "TRANSLATION_10": "Verily We! We shewed him the way; then he becometh either thankful or ingrate.\n",
        "TRANSLATION_11": "Indeed We have guided him to the way, be he grateful or ungrateful.\n",
        "TRANSLATION_12": "We showed him the Way: whether he be grateful or ungrateful (rests on his will).\n",
        "TRANSLATION_13": "Verily, We showed him the way, whether he be grateful or ungrateful.\n",
        "TRANSLATION_14": "Indeed, We have guided him to the path, he is either grateful or ungrateful.\n",
        "TRANSLATION_15": "We guided him to the way, be he appreciative or unappreciative.\n",
        "TRANSLATION_16": "Indeed, We guided him to the way, be he grateful or be he ungrateful.\n",
        "TRANSLATION_17": "[76:3] Verily We have guided him to the way, We have pointed out to him the path of guidance by sending messengers [to mankind], whether he be grateful, that is to say, [whether he be] a believer, or ungrateful (both [shākiran and kafūran] are circumstantial qualifiers referring to the direct object; in other words, We have pointed out to him in both presupposed states, whether his gratefulness or his unthankfulness; immā is used to list the ‘states’).\n",
        "TRANSLATION_18": "(Lo! We have shown him the way) of faith and disbelief, good and evil, (whether he be grateful) accepting faith (or disbelieving) it is also said this means: We have shown him the way to be either grateful or ungrateful.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "76:3",
            "80:20",
            "17:32",
            "43:37",
            "33:67",
            "4:137",
            "22:66",
            "47:34",
            "6:117",
            "15:76"
        ],
        "BIBLE": [
            "writings:psalms:25:4",
            "prophets:isaiah:59:8",
            "writings:psalms:1:6",
            "writings:proverbs:21:2",
            "prophets:isaiah:40:27",
            "writings:proverbs:12:26",
            "writings:proverbs:15:9",
            "prophets:isaiah:49:4",
            "prophets:jeremiah:36:7",
            "prophets:jeremiah:6:16"
        ]
    }
}