{
    "VERSE": "76:4",
    "ARABIC": "إِنَّآ أَعْتَدْنَا لِلْكَٰفِرِينَ سَلَٰسِلَا۟ وَأَغْلَٰلًا وَسَعِيرًا",
    "ENGLISH": {
        "TRANSLATION_0": "We have made ready for the kafirun shackles and chains and a Searing Blaze.",
        "TRANSLATION_1": "We have prepared for unbelievers chains and collars and a blazing fire.\n",
        "TRANSLATION_2": "For the unbelievers, We have kept ready chains and fetters and a Blazing Fire.\n",
        "TRANSLATION_3": "We have prepared chains, shackles, and flaming fire (for the disbelievers).\n",
        "TRANSLATION_4": "We have indeed kept prepared chains, and shackles and a blazing fire for the disbelievers.\n",
        "TRANSLATION_5": "Verily, We have prepared for the disbelievers iron chains, iron collars, and Sa`ir.\n",
        "TRANSLATION_6": "Surely We have prepared for the unbelievers chains and shackles and a burning fire.\n",
        "TRANSLATION_7": "Surely We have prepared for the unbelievers chains, fetters, and a Blaze.\n",
        "TRANSLATION_8": "Lo! We have prepared for disbelievers manacles and carcans and a raging fire.\n",
        "TRANSLATION_9": "[Now,] behold, for those who deny the truth, We have prepared chains, iron collars and a blazing fire, but\n",
        "TRANSLATION_10": "Verily We! We have gotten ready for the infidels chains and collars and a Blaze.\n",
        "TRANSLATION_11": "Indeed for the faithless We have prepared chains, iron collars, and a blaze.\n",
        "TRANSLATION_12": "For the Rejecters we have prepared chains, yokes, and a blazing Fire.\n",
        "TRANSLATION_13": "Verily, We have prepared for the disbelievers iron chains, iron collars, and a blazing Fire.\n",
        "TRANSLATION_14": "Indeed, for the unbelievers We have prepared chains, fetters and a Blazing (Fire).\n",
        "TRANSLATION_15": "We have prepared for the faithless chains, and yokes, and a Searing Fire.\n",
        "TRANSLATION_16": "Indeed, We have prepared for the disbelievers chains and shackles and a blaze.\n",
        "TRANSLATION_17": "[76:4] We have assuredly prepared for the disbelievers chains, with which they are dragged through the Fire, and fetters, around their necks to which the chains will be attached, and a hell-fire, a fire set ablaze, burning fiercely, in which they shall be chastised.\n",
        "TRANSLATION_18": "(Lo! We have prepared for disbelievers) Abu Jahl and his followers (manacles and carcans) in the Fire (and a raging fire.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "76:4",
            "40:71",
            "33:64",
            "54:47",
            "48:13",
            "84:12",
            "25:11",
            "15:9",
            "67:10",
            "22:4"
        ],
        "BIBLE": [
            "torah:leviticus:6:6",
            "writings:proverbs:20:21",
            "torah:genesis:42:2",
            "writings:job:20:18",
            "prophets:i%20samuel:21:6",
            "torah:exodus:14:18",
            "prophets:ezekiel:28:4",
            "prophets:isaiah:15:7",
            "writings:job:28:15",
            "writings:ecclesiastes:2:8"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:12",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:3:8",
            "Sefer%20Yetzirah:1:4"
        ]
    }
}