{
    "VERSE": "76:8",
    "ARABIC": "وَيُطْعِمُونَ ٱلطَّعَامَ عَلَىٰ حُبِّهِۦ مِسْكِينًا وَيَتِيمًا وَأَسِيرًا",
    "ENGLISH": {
        "TRANSLATION_0": "They give food, despite their love for it, to the poor and orphans and captives:",
        "TRANSLATION_1": "And feed the needy for the love of Him, and the orphans and the captives,\n",
        "TRANSLATION_2": "those who, for the love of Him, feed the needy, and the orphan, and the captive,\n",
        "TRANSLATION_3": "They feed the destitute, orphans, and captives for the love of God, saying,\n",
        "TRANSLATION_4": "And out of His love, they give food to the needy, the orphan and the prisoner.\n",
        "TRANSLATION_5": "And they give food, inspite of their love for it, to the poor, the orphan and the captive,\n",
        "TRANSLATION_6": "And they give food out of love for Him to the poor and the orphan and the captive:\n",
        "TRANSLATION_7": "they give food, for the love of Him, to the needy, the orphan, the captive:\n",
        "TRANSLATION_8": "And feed with food the needy wretch, the orphan and the prisoner, for love of Him,\n",
        "TRANSLATION_9": "they give food, despite their love for it, to the poor and orphans and captives,\n",
        "TRANSLATION_10": "And they feed with food, for love of Him, the needy, and the orphan and the captive.\n",
        "TRANSLATION_11": "For the love of Him, they feed the needy, the orphan and the prisoner,\n",
        "TRANSLATION_12": "And they feed, for the love of Allah, the indigent, the orphan, and the captive,-\n",
        "TRANSLATION_13": "And they give food, inspite of their love for it (or for the love of Him), to Miskin (poor), the orphan, and the captive,\n",
        "TRANSLATION_14": "who give food, for the love of Him to the needy, the orphan, and the captive,\n",
        "TRANSLATION_15": "And they feed, for the love of Him, the poor, and the orphan, and the captive.\n",
        "TRANSLATION_16": "And they give food in spite of love for it to the needy, the orphan, and the captive,\n",
        "TRANSLATION_17": "[76:8] And they give food, despite [their] love of it, that is to say, [despite their love] of food and their craving for it, to the needy, the poor, and the orphan, who does not have a father, and the prisoner, meaning the one who has been rightly imprisoned.\n",
        "TRANSLATION_18": "And feed with food the needy wretch, the orphan) among the Muslims (and the prisoner) and the Muslim prisoner in the captivity of the idolaters; and it is also said: any kind of prisoner, (for love of Him) despite their desire for food and its scarcity,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "76:8",
            "89:18",
            "107:3",
            "69:34",
            "4:8",
            "74:44",
            "36:33",
            "2:215",
            "12:33",
            "17:26"
        ],
        "BIBLE": [
            "torah:genesis:8:15",
            "torah:genesis:9:8",
            "prophets:zechariah:11:4",
            "torah:genesis:41:16",
            "prophets:joshua:22:24",
            "torah:exodus:20:1",
            "writings:ii%20chronicles:32:17",
            "prophets:ezekiel:34:2",
            "writings:psalms:94:7",
            "prophets:ii%20samuel:19:34"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:1:12",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:14",
            "Sefer%20Yetzirah:6:5"
        ]
    }
}