{
    "VERSE": "90:17",
    "ARABIC": "ثُمَّ كَانَ مِنَ ٱلَّذِينَ ءَامَنُوا۟ وَتَوَاصَوْا۟ بِٱلصَّبْرِ وَتَوَاصَوْا۟ بِٱلْمَرْحَمَةِ",
    "ENGLISH": {
        "TRANSLATION_0": "then to be one of those who have iman and urge each other to steadfastness and urge each other to compassion.",
        "TRANSLATION_1": "And to be of those who believe, and urge upon one another to persevere, and urge upon each other to be kind.\n",
        "TRANSLATION_2": "and, then besides this, he be one of those who believed, and enjoined upon one another steadfastness and enjoined upon one another compassion.\n",
        "TRANSLATION_3": "the believers who cooperate with others in patience (steadfastness) and kindness.\n",
        "TRANSLATION_4": "And moreover to be of those who accepted faith, and who urged patience to one another and who urged graciousness to one another.\n",
        "TRANSLATION_5": "Then he became one of those who believed and recommended one another to patience, and recommended one another to compassion.\n",
        "TRANSLATION_6": "Then he is of those who believe and charge one another to show patience, and charge one another to show compassion.\n",
        "TRANSLATION_7": "then that he become of those who believe and counsel each other to be steadfast, and counsel each other to be merciful.\n",
        "TRANSLATION_8": "And to be of those who believe and exhort one another to perseverance and exhort one another to pity.\n",
        "TRANSLATION_9": "and to be one of those who believe and urge one another to steadfastness and compassion.\n",
        "TRANSLATION_10": "Then he became of those who believed and enjoined on each other steadfastness and enjoined on each other compassion.\n",
        "TRANSLATION_11": "while being one of those who have faith and enjoin one another to patience, and enjoin one another to compassion.\n",
        "TRANSLATION_12": "Then will he be of those who believe, and enjoin patience, (constancy, and self-restraint), and enjoin deeds of kindness and compassion.\n",
        "TRANSLATION_13": "Then he became one of those who believed, and recommended one another to perseverance and patience, and (also) recommended one another to pity and compassion.\n",
        "TRANSLATION_14": "so that he becomes one of those who believe, charge each other to be patient, and charge each other to be merciful.\n",
        "TRANSLATION_15": "Then he becomes of those who believe, and advise one another to patience, and advise one another to kindness.\n",
        "TRANSLATION_16": "And then being among those who believed and advised one another to patience and advised one another to compassion.\n",
        "TRANSLATION_17": "[90:17] while being (thumma kāna is a supplement to iqtahama, ‘he assaulted’; thumma is for the ordering of things to be mentioned) in other words, [what is meant is that] at the point of the assault he was: one of those who believe and enjoin one another to steadfastness, in [pursuing] obedience and in refraining from disobedience, and enjoin one another to compassion (marhama means rahma), towards creatures.\n",
        "TRANSLATION_18": "(And to be) in addition to this (of those who believe) in private between themselves and their Lord, in Muhammad (pbuh) and the Qur'an (and exhort one another to perseverance) in fulfilling the obligations (and export one another to pity) towards the poor and needy.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "90:17",
            "103:3",
            "21:86",
            "26:5",
            "15:56",
            "21:75",
            "2:160",
            "19:72",
            "26:19",
            "19:96"
        ],
        "BIBLE": [
            "prophets:ii%20kings:17:15",
            "prophets:i%20kings:2:43",
            "writings:i%20chronicles:22:13",
            "writings:ii%20chronicles:8:14",
            "writings:esther:2:20",
            "writings:esther:2:10",
            "prophets:hosea:2:21",
            "prophets:isaiah:54:8",
            "torah:numbers:18:4",
            "prophets:ii%20samuel:11:19"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:6:1"
        ]
    }
}