{
    "VERSE": "90:19",
    "ARABIC": "وَٱلَّذِينَ كَفَرُوا۟ بِـَٔايَٰتِنَا هُمْ أَصْحَٰبُ ٱلْمَشْـَٔمَةِ",
    "ENGLISH": {
        "TRANSLATION_0": "Those who reject Our signs, they are the Companions of the Left.",
        "TRANSLATION_1": "But those who deny Our revelations are the people of the left hand:\n",
        "TRANSLATION_2": "As for those who rejected Our Signs, they are the People of the Left Hand.\n",
        "TRANSLATION_3": "As for those who disbelieve in Our revelations, they are the people of the left\n",
        "TRANSLATION_4": "And those who denied Our signs, are the people of the left.\n",
        "TRANSLATION_5": "But those who disbelieved in Our Ayat, they are those on the Left.\n",
        "TRANSLATION_6": "And (as for) those who disbelieve in our communications, they are the people of the left hand.\n",
        "TRANSLATION_7": "And those who disbelieve in Our signs, they are the Companions of the Left Hand;\n",
        "TRANSLATION_8": "But those who disbelieve Our revelations, their place will be on the left hand.\n",
        "TRANSLATION_9": "and [as for] those who are bent on denying the truth of Our revelations, they are the people of the left hand,\n",
        "TRANSLATION_10": "And those who disbelieve Our signs - they are the fellows of the lefthand.\n",
        "TRANSLATION_11": "But those who defy Our signs, they are the People of the Left Hand.\n",
        "TRANSLATION_12": "But those who reject Our Signs, they are the (unhappy) Companions of the Left Hand.\n",
        "TRANSLATION_13": "But those who disbelieved in Our Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.), they are those on the Left Hand (the dwellers of Hell).\n",
        "TRANSLATION_14": "But those who disbelieve in Our verses, they are the Companions of the Left,\n",
        "TRANSLATION_15": "But as for those who defy Our revelations—these are the people of misery.\n",
        "TRANSLATION_16": "But they who disbelieved in Our signs - those are the companions of the left.\n",
        "TRANSLATION_17": "[90:19]   But those who disbelieve in Our signs, they are the ones of the left [side] (al-mash’ama means al-shimāl).\n",
        "TRANSLATION_18": "(But those who disbelieve Our revelations) in Muhammad (pbuh) and the Qur'an, i.e. Kildah and his host, (their place will be on the left hand) those who are given their register in their left hand are the inhabitants of the Fire.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "90:19",
            "5:86",
            "5:10",
            "22:51",
            "2:39",
            "56:9",
            "43:69",
            "7:36",
            "64:10",
            "78:28"
        ],
        "BIBLE": [
            "writings:ii%20chronicles:6:21",
            "prophets:i%20kings:8:30",
            "torah:exodus:18:21",
            "writings:psalms:26:12",
            "prophets:jeremiah:44:29",
            "torah:exodus:18:23",
            "writings:ii%20chronicles:33:17",
            "prophets:i%20kings:12:31",
            "writings:job:28:20",
            "prophets:judges:7:7"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:13",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:5:2"
        ]
    }
}