{
    "VERSE": "90:5",
    "ARABIC": "أَيَحْسَبُ أَن لَّن يَقْدِرَ عَلَيْهِ أَحَدٌ",
    "ENGLISH": {
        "TRANSLATION_0": "Does he imagine that no one has power over him?",
        "TRANSLATION_1": "Does he think that no one has power over him?\n",
        "TRANSLATION_2": "Does he think that no one can overpower him?\n",
        "TRANSLATION_3": "Does He think that no one will ever have control over him?\n",
        "TRANSLATION_4": "Does man think that no one will ever have power over him?\n",
        "TRANSLATION_5": "Does he think that none can overcome him\n",
        "TRANSLATION_6": "Does he think that no one has power over him?\n",
        "TRANSLATION_7": "What, does he think none has power over him,\n",
        "TRANSLATION_8": "Thinketh he that none hath power over him?\n",
        "TRANSLATION_9": "Does he think then that no one has power over him?\n",
        "TRANSLATION_10": "Deemest he that none will overpower him?\n",
        "TRANSLATION_11": "Does he suppose that no one will ever have power over him?\n",
        "TRANSLATION_12": "Thinketh he, that none hath power over him?\n",
        "TRANSLATION_13": "Thinks he that none can overcome him?\n",
        "TRANSLATION_14": "Does he think that none has power over him!\n",
        "TRANSLATION_15": "Does he think that no one has power over him?\n",
        "TRANSLATION_16": "Does he think that never will anyone overcome him?\n",
        "TRANSLATION_17": "[90:5] Does he suppose, does the strong man of Quraysh, namely, Abū’l-Ashadd b. Kalada, presume, on account of his strength, that (an: softened in place of the hardened form, its subject omitted, that is to say, annahu) no one will have power over him? Yet God has power over him.\n",
        "TRANSLATION_18": "(Thinketh he) does the disbelieving man think (that) because of his strength and force (none hath power over him?) i.e. Allah cannot seize and punish him.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "90:5",
            "90:7",
            "69:47",
            "72:26",
            "72:7",
            "89:26",
            "112:4",
            "89:25",
            "72:22",
            "112:1"
        ],
        "BIBLE": [
            "writings:psalms:89:49",
            "writings:ecclesiastes:8:9",
            "writings:job:11:11",
            "writings:proverbs:24:29",
            "writings:proverbs:3:30",
            "prophets:isaiah:50:2",
            "writings:psalms:118:6",
            "writings:ii%20chronicles:25:8",
            "writings:ecclesiastes:6:2",
            "writings:job:35:12"
        ]
    }
}