{
    "VERSE": "58:12",
    "ARABIC": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓا۟ إِذَا نَٰجَيْتُمُ ٱلرَّسُولَ فَقَدِّمُوا۟ بَيْنَ يَدَىْ نَجْوَىٰكُمْ صَدَقَةً ذَٰلِكَ خَيْرٌ لَّكُمْ وَأَطْهَرُ فَإِن لَّمْ تَجِدُوا۟ فَإِنَّ ٱللَّهَ غَفُورٌ رَّحِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "You who have iman! when you consult the Messenger privately precede your private consultation by giving sadaqa - that is better for you and purer. But if you cannot find the means, Allah is Ever-Forgiving,",
        "TRANSLATION_1": "O you who believe, if you confer with the Prophet in private, give alms in the name of God before you go to confer. This is better for you and becoming. If you do not have the means, then surely God is forgiving and kind.\n",
        "TRANSLATION_2": "Believers, when you come to the Messenger for private consultation, offer some charity before your consultation with him. That is better for you and more conducive to purity. But if you find nothing to offer in charity, then know that Allah is Most Merciful, Most Compassionate.\n",
        "TRANSLATION_3": "Believers, whenever you consult the Prophet, offer charity before your consultation. This will be better for you and more pure. However, if you do not find anything to give in charity, then God is All-forgiving and All-merciful.\n",
        "TRANSLATION_4": "O People who Believe! When you wish to humbly consult with the Noble Messenger, give some charity before you consult; that is much better and much purer for you; so if you do not have the means, then (know that) Allah is Oft Forgiving, Most Merciful.\n",
        "TRANSLATION_5": "O you who believe! When you (want to) consult the Messenger in private, spend something in charity before your private consultation. That will be better and purer for you. But if you find not (the means for it), then verily, Allah is Oft-Forgiving, Most Merciful.\n",
        "TRANSLATION_6": "O you who believe! when you consult the Apostle, then offer something in charity before your consultation; that is better for you and purer; but if you do not find, then surely Allah is Forgiving, Merciful.\n",
        "TRANSLATION_7": "O believers, when you conspire with the Messenger, before your conspiring advance a freewill offering; that is better for you and purer. Yet if you find not means, God is All-forgiving, All-compassionate.\n",
        "TRANSLATION_8": "O ye who believe! When ye hold conference with the messenger, offer an alms before your conference. That is better and purer for you. But if ye cannot find (the wherewithal) then lo! Allah is Forgiving, Merciful.\n",
        "TRANSLATION_9": "Believers, when you come to consult the Messenger privately, give something in charity beforehand. That is best for you and most conducive to purity. But if you cannot find anything to give, know that God is Forgiving and Merciful.\n",
        "TRANSLATION_10": "O ye who believe! when ye go to whisper with the apostle, offer alms before your whispering; that is better for you and purer. Then if ye find not the wherewith, then verily Allah is Forgiving, Merciful.\n",
        "TRANSLATION_11": "O you who have faith! When you converse privately with the Apostle, offer a charity before your private talk. That is better for you and purer. But if you cannot afford [to make the offering], then Allah is indeed all-forgiving, all-merciful.\n",
        "TRANSLATION_12": "O ye who believe! When ye consult the Messenger in private, spend something in charity before your private consultation. That will be best for you, and most conducive to purity (of conduct). But if ye find not (the wherewithal), Allah is Oft-Forgiving, Most Merciful.\n",
        "TRANSLATION_13": "O you who believe! When you (want to) consult the Messenger (Muhammad SAW) in private, spend something in charity before your private consultation. That will be better and purer for you. But if you find not (the means for it), then verily, Allah is Oft-Forgiving, Most Merciful.\n",
        "TRANSLATION_14": "Believers, when you consult with the Messenger, present before your consultation a free will offering. That is best and purest for you. But if you lack themeans, Allah is the Forgiver and the Most Merciful.\n",
        "TRANSLATION_15": "O you who believe! When you converse privately with the Messenger, offer something in charity before your conversation. That is better for you, and purer. But if you do not find the means—God is Forgiving and Merciful.\n",
        "TRANSLATION_16": "O you who have believed, when you [wish to] privately consult the Messenger, present before your consultation a charity. That is better for you and purer. But if you find not [the means] - then indeed, Allah is Forgiving and Merciful.\n",
        "TRANSLATION_17": "[58:12] O you who believe, when you converse in secret with the Messenger, when you wish to converse with him privately, offer some voluntary alms before your secret talk. That is better for you and purer, for your sins. But if you find nothing, to offer as alms, then God is indeed Forgiving, of your secret conversation, Merciful, to you. In other words: nothing will be held against you for holding a secret conversation without having offered some voluntary alms [beforehand]. However, He [God] abrogated this later by saying:\n",
        "TRANSLATION_18": "(0 ye who believe) in Muhammad (pbuh) and the Qur'an! (When ye hold conference) when you speak (with the messenger, offer an alms before your conference). This was revealed about those believers who were well off and used to speak to the Prophet (pbuh) more than the poor believers, so much so that they vexed both the Prophet (pbuh) and the poor believers. Allah, therefore, forbade them from doing so and commanded them to give alms to the poor, one silver coin for each word they would say to him, before they even spoke with the Prophet (pbuh). (That) almsgiving (is better) than holding back money (and purer for you) and purer for your hearts from sins; and it is also said this means: it is purer for the hearts of the poor in that it prevents their hearts from becoming hard. (But if ye cannot find (the wherewithal)) to give alms, poor believers, then you can speak with the Prophet (pbuh) as much as you wish without being required to give alms (then lo! Allah is Forgiving) He forgives your sins, (Merciful) towards the one among you who dies repentant.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "58:12",
            "8:70",
            "4:152",
            "58:13",
            "33:24",
            "24:62",
            "60:7",
            "49:1",
            "8:24",
            "60:12"
        ],
        "BIBLE": [
            "prophets:ezekiel:20:31",
            "torah:leviticus:20:25",
            "prophets:ezekiel:39:7",
            "prophets:joel:2:17",
            "prophets:jeremiah:20:9",
            "torah:leviticus:9:7",
            "prophets:i%20samuel:2:29",
            "torah:leviticus:25:46",
            "prophets:isaiah:64:1",
            "prophets:isaiah:26:13"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:5:1"
        ]
    }
}