{
    "VERSE": "58:14",
    "ARABIC": "أَلَمْ تَرَ إِلَى ٱلَّذِينَ تَوَلَّوْا۟ قَوْمًا غَضِبَ ٱللَّهُ عَلَيْهِم مَّا هُم مِّنكُمْ وَلَا مِنْهُمْ وَيَحْلِفُونَ عَلَى ٱلْكَذِبِ وَهُمْ يَعْلَمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Do you not see those who have turned to people with whom Allah is angry? They belong neither to you nor to them. And they swear to falsehood and do so knowingly.",
        "TRANSLATION_1": "Have you not seen those who have taken a people who have roused the wrath of God, as friends? They are neither of you nor of them, and swear to a lie, and knowingly.\n",
        "TRANSLATION_2": "Do you not see those who took for friends a people whom Allah is wroth with? They neither belong to you nor you to them. They swear to a falsehood, and they do so knowingly.\n",
        "TRANSLATION_3": "Have you not seen those who have established friendship with the people who are subject to the wrath of God? They do not belong to you nor you to them, yet they knowingly try to prove their point by using false oaths.\n",
        "TRANSLATION_4": "Did you not see those who befriended those upon whom is Allah’s wrath? They are neither of you nor of these – and they swear a false oath, whereas they know.\n",
        "TRANSLATION_5": "Have you not seen those who take as friends a people upon whom is the wrath of Allah They are neither of you nor of them, and they swear to a lie while they know.\n",
        "TRANSLATION_6": "Have you not seen those who befriend a people with whom Allah is wroth? They are neither of you nor of them, and they swear falsely while they know.\n",
        "TRANSLATION_7": "Hast thou not regarded those who have taken for friends a people against whom God is wrathful? They belong neither to you nor to them; and they swear upon falsehood, and that wittingly.\n",
        "TRANSLATION_8": "Hast thou not seen those who take for friends a folk with whom Allah is wroth? They are neither of you nor of them, and they swear a false oath knowingly.\n",
        "TRANSLATION_9": "Do you not see those who have befriended a people who have brought down upon themselves the wrath of God? They are neither with you nor with them and they wittingly swear to falsehood.\n",
        "TRANSLATION_10": "Beholdest thou not those who take for friends a people with whom Allah is angered? They are neither of you nor of them, and they swear to a lie while they know.\n",
        "TRANSLATION_11": "Have you not regarded those who befriend a people at whom Allah is wrathful? They neither belong to you, nor to them, and they swear false oaths [that they are with you] and they know.\n",
        "TRANSLATION_12": "Turnest thou not thy attention to those who turn (in friendship) to such as have the Wrath of Allah upon them? They are neither of you nor of them, and they swear to falsehood knowingly.\n",
        "TRANSLATION_13": "Have you (O Muhammad SAW) not seen those (hypocrites) who take for friends a people upon whom is the Wrath of Allah (i.e. Jews)? They are neither of you (Muslims) nor of them (Jews), and they swear to a lie while they know.\n",
        "TRANSLATION_14": "Do you see those who have been guided by a nation that incurred the Wrath of Allah? They belong neither to you, nor to them, and knowingly they swear to lies.\n",
        "TRANSLATION_15": "Have you considered those who befriended a people with whom God has become angry? They are not of you, nor of them. And they swear to a lie while they know.\n",
        "TRANSLATION_16": "Have you not considered those who make allies of a people with whom Allah has become angry? They are neither of you nor of them, and they swear to untruth while they know [they are lying].\n",
        "TRANSLATION_17": "[58:14] Have you not regarded, [have you not] seen, those who — these being the hypocrites — fraternise with a folk — these being the Jews — at whom God is wrathful? They, the hypocrites, neither belong with you, the believers, nor with them, the Jews, but are suspended in between, and they swear falsely, in other words, saying that they are believers, while they know, that they are lying in this.\n",
        "TRANSLATION_18": "Allah then said about 'Abdullah Ibn Ubayy and his host, because of their alliance with the Jews: (Hast thou not seen) Muhammad (those who take for friends) for assistance and help (a folk) i.e. the Jews (with whom Allah is wroth? They) i.e. the hypocrites (are neither of you) in private such that what is due to you is due to them (nor of them) i.e. the Jews, openly such that whatever is due to the Jews is due to them, (and they swear a false oath) they falsely swear that they are believers and true in their faith (knowingly) while they know they are lying in their oath.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "58:14",
            "61:7",
            "10:69",
            "9:56",
            "11:30",
            "5:103",
            "16:105",
            "14:28",
            "7:99",
            "5:84"
        ],
        "BIBLE": [
            "torah:exodus:32:1",
            "torah:exodus:34:10",
            "prophets:judges:9:48",
            "writings:daniel:4:15",
            "writings:job:10:2",
            "torah:genesis:3:6",
            "prophets:joshua:9:11",
            "torah:exodus:23:27",
            "torah:exodus:32:23",
            "writings:daniel:5:15"
        ]
    }
}