{
    "VERSE": "58:15",
    "ARABIC": "أَعَدَّ ٱللَّهُ لَهُمْ عَذَابًا شَدِيدًا إِنَّهُمْ سَآءَ مَا كَانُوا۟ يَعْمَلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Allah has prepared a terrible punishment for them. How evil is what they have been doing!",
        "TRANSLATION_1": "God has reserved a severe punishment for them. Evil indeed are the things they do!\n",
        "TRANSLATION_2": "Allah has prepared for them a grievous chastisement. Indeed, evil are the acts in which they are engaged.\n",
        "TRANSLATION_3": "God has prepared a severe torment for them. What an evil deed they have committed!\n",
        "TRANSLATION_4": "Allah has kept prepared a severe punishment for them; indeed they commit extremely evil deeds.\n",
        "TRANSLATION_5": "Allah has prepared for them a severe torment. Evil indeed is that which they used to do.\n",
        "TRANSLATION_6": "Allah has prepared for them a severe punishment; surely what they do is evil.\n",
        "TRANSLATION_7": "God has made ready for them a chastisement terrible; surely they -- evil are the things they have been doing.\n",
        "TRANSLATION_8": "Allah hath prepared for them a dreadful doom. Evil indeed is that which they are wont to do.\n",
        "TRANSLATION_9": "God has prepared a severe punishment for them; surely what they have done is evil.\n",
        "TRANSLATION_10": "Allah hath gotten ready for them a torment grievous; verily vile is that which they have been working.\n",
        "TRANSLATION_11": "Allah has prepared a severe punishment for them. Evil indeed is what they used to do.\n",
        "TRANSLATION_12": "Allah has prepared for them a severe Penalty: evil indeed are their deeds.\n",
        "TRANSLATION_13": "Allah has prepared for them a severe torment. Evil indeed is that which they used to do.\n",
        "TRANSLATION_14": "Allah has prepared for them a grievous punishment. Evil indeed is that which they have done.\n",
        "TRANSLATION_15": "God has prepared for them a terrible punishment. Evil is what they used to do.\n",
        "TRANSLATION_16": "Allah has prepared for them a severe punishment. Indeed, it was evil that they were doing.\n",
        "TRANSLATION_17": "[58:15] God has prepared for them a severe chastisement. Evil indeed is that which they [are wont to] do, in the way of acts of disobedience.\n",
        "TRANSLATION_18": "655 (Allah hath prepared for them) for the hypocrites: 'Abdullah Ibn Ubayy and his host (a dreadful doom) in the life of the world and in the Hereafter. (Evil indeed is that which they are wont to do) evil is that which they do in their state of hypocrisy.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "58:15",
            "65:10",
            "50:26",
            "14:2",
            "16:104",
            "7:164",
            "42:16",
            "42:26",
            "3:177",
            "3:4"
        ],
        "BIBLE": [
            "torah:leviticus:5:23",
            "writings:ii%20chronicles:29:36",
            "writings:proverbs:20:21",
            "prophets:i%20kings:11:10",
            "prophets:joshua:7:15",
            "writings:ecclesiastes:5:12",
            "torah:genesis:39:9",
            "torah:genesis:34:7",
            "writings:psalms:141:4",
            "torah:exodus:15:16"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:2:4"
        ]
    }
}