{
    "VERSE": "58:2",
    "ARABIC": "ٱلَّذِينَ يُظَٰهِرُونَ مِنكُم مِّن نِّسَآئِهِم مَّا هُنَّ أُمَّهَٰتِهِمْ إِنْ أُمَّهَٰتُهُمْ إِلَّا ٱلَّٰٓـِٔى وَلَدْنَهُمْ وَإِنَّهُمْ لَيَقُولُونَ مُنكَرًا مِّنَ ٱلْقَوْلِ وَزُورًا وَإِنَّ ٱللَّهَ لَعَفُوٌّ غَفُورٌ",
    "ENGLISH": {
        "TRANSLATION_0": "Those of you who divorce your wives by equating them with your mothers, they are not your mothers. Your Ever-Pardoning, Ever-Forgiving.",
        "TRANSLATION_1": "Those of you who divorce your wives by calling them 'mothers,' cannot (make them) their mothers. Their mothers are only those who gave birth to them. They surely utter what is unseemly and a lie. But God is forbearing and forgiving.\n",
        "TRANSLATION_2": "Those among you who divorce their wives by declaring them to be their mothers, such are not their mothers; none are their mothers except those who gave birth to them. Indeed what they say is highly contemptible and false. Verily Allah is Most Pardoning, Most Forgiving.\n",
        "TRANSLATION_3": "Those who renounce their wives by calling them mothers should know that their wives could never become their mothers. Their mothers are those who have given birth to them. The words that they speak are certainly detestable and sinful. But God is Pardoning and All-forgiving.\n",
        "TRANSLATION_4": "Those among you who have proclaimed their wives as their mothers – so their wives are not their mothers; their mothers are only those that gave them birth; and undoubtedly they utter evil and a blatant lie; and indeed Allah is Most Pardoning, Oft Forgiving.\n",
        "TRANSLATION_5": "Those among you who make their wives unlawful to them by Zihar they cannot be their mothers. None can be their mothers except those who gave them birth. And verily, they utter an ill word and a lie. And verily, Allah is Oft-Pardoning, Oft-Forgiving.\n",
        "TRANSLATION_6": "(As for) those of you who put away their wives by likening their backs to the backs of their mothers, they are not their mothers; their mothers are no others than those who gave them birth; and most surely they utter a hateful word and a falsehood and most surely Allah is Pardoning, Forgiving.\n",
        "TRANSLATION_7": "Those of you who say, regarding their wives, 'Be as my mother's back,' they are not truly their mothers; their mothers are only those who gave them birth, and they are surely saying a dishonourable saying, and a falsehood. Yet surely God is All-pardoning, All-forgiving.\n",
        "TRANSLATION_8": "Such of you as put away your wives (by saying they are as their mothers) - They are not their mothers; none are their mothers except those who gave them birth - they indeed utter an ill word and a lie. And lo! Allah is Forgiving, Merciful.\n",
        "TRANSLATION_9": "Those who separate themselves from their wives by pronouncing, \"To me you are like my mother's back,\" must concede that they are not their mothers; none are their mothers except those who gave birth to them -- surely they utter an evil word and a lie. God is pardoning, forgiving.\n",
        "TRANSLATION_10": "As to those among you who put away their wives by pronouncing zihar their mothers they are not. Their mothers are but those who gave them birth; and verily they utter a saying disputable and false. And verily Allah is Pardoning, Forgiving.\n",
        "TRANSLATION_11": "As for those of you who repudiate their wives by zihar, they are not their mothers; their mothers are only those who bore them, and indeed they utter an outrage and a lie. Indeed Allah is all-excusing, all-forgiving.\n",
        "TRANSLATION_12": "If any men among you divorce their wives by Zihar (calling them mothers), they cannot be their mothers: None can be their mothers except those who gave them birth. And in fact they use words (both) iniquitous and false: but truly Allah is one that blots out (sins), and forgives (again and again).\n",
        "TRANSLATION_13": "Those among you who make their wives unlawful (Az-Zihar) to them by saying to them \"You are like my mother's back.\" They cannot be their mothers. None can be their mothers except those who gave them birth. And verily, they utter an ill word and a lie. And verily, Allah is Oft-Pardoning, Oft-Forgiving.\n",
        "TRANSLATION_14": "Those of you who say to their wives, 'Be as my mother's back' indeed, they are not their mothers. Their mothers are only those who gave birth to them. Indeed they speak dishonorably and falsely. But Allah is the Pardoning, the Forgiving.\n",
        "TRANSLATION_15": "Those of you who estrange their wives by equating them with their mothers—they are not their mothers. Their mothers are none else but those who gave birth to them. What they say is evil, and a blatant lie. But God is Pardoning and Forgiving.\n",
        "TRANSLATION_16": "Those who pronounce thihar among you [to separate] from their wives - they are not [consequently] their mothers. Their mothers are none but those who gave birth to them. And indeed, they are saying an objectionable statement and a falsehood. But indeed, Allah is Pardoning and Forgiving.\n",
        "TRANSLATION_17": "[58:2]   Those of you who repudiate their wives by zihār (yazzahharūna is actually yatazahharūna, in which the tā’ has been assimilated with the zā’; a variant reading has yazzāharūna, and still another has yuzāhirūna, similar [in form] to yuqātilūna; the same applies for the second instance [of this verb below]), they are not their mothers; their mothers are only those who (read allā’ī, or without the [final long] yā’, allā’i) gave birth to them, and indeed they, [in repudiating them] by zihār, utter indecent words and a calumny, a lie. Yet assuredly God is Pardoning, Forgiving, to the one who repudiates by zihār through an atonement [which he must offer].\n",
        "TRANSLATION_18": "(Such of you as put away your wives (by saying they are as their mothers)-They are not their mothers) they are not like their mothers; (none are their mothers) in terms of unmarriageability (except those who gave them birth) or those whose milk they drank in their infancy (they indeed utter an ill word) when they declare their wives unlawful to them, like the unlawfulness of their mothers (and a lie. And lo! Allah is Forgiving) since He did not punish him for declaring unlawful that which Allah made lawful, (Merciful) after he has repented and shown remorse.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "58:2",
            "22:60",
            "4:99",
            "2:226",
            "24:5",
            "2:199",
            "16:18",
            "3:89",
            "4:23",
            "35:34"
        ],
        "BIBLE": [
            "torah:exodus:36:6",
            "writings:ezra:10:3",
            "torah:leviticus:10:17",
            "writings:daniel:2:9",
            "writings:esther:4:8",
            "prophets:nahum:1:14",
            "torah:genesis:29:33",
            "prophets:isaiah:50:4",
            "writings:ruth:4:17",
            "torah:genesis:30:18"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:4:12"
        ]
    }
}