{
    "VERSE": "58:20",
    "ARABIC": "إِنَّ ٱلَّذِينَ يُحَآدُّونَ ٱللَّهَ وَرَسُولَهُۥٓ أُو۟لَٰٓئِكَ فِى ٱلْأَذَلِّينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Those who oppose Allah and His Messenger, such people will be among the most abased.",
        "TRANSLATION_1": "Surely those who oppose God and His Prophet will be among the vilest.\n",
        "TRANSLATION_2": "Verily those who oppose Allah and His Messenger will be among the most abject beings.\n",
        "TRANSLATION_3": "Disgrace will strike those who oppose God and His Messenger.\n",
        "TRANSLATION_4": "Indeed those who oppose Allah and His Noble Messenger, are among the most despicable.\n",
        "TRANSLATION_5": "Those who oppose Allah and His Messenger, they will be among those most humiliated.\n",
        "TRANSLATION_6": "Surely (as for) those who are in opposition to Allah and His Apostle; they shall be among the most abased.\n",
        "TRANSLATION_7": "Surely those who oppose God and His Messenger, those are among the most abject.\n",
        "TRANSLATION_8": "Lo! those who oppose Allah and His messenger, they will be among the lowest.\n",
        "TRANSLATION_9": "those who oppose God and His Messenger will [on Judgement Day] be among the most abased.\n",
        "TRANSLATION_10": "Verily those; who oppose Allah and His apostle - they are among the lowest.\n",
        "TRANSLATION_11": "Indeed those who oppose Allah and His Apostle—they will be among the most abased.\n",
        "TRANSLATION_12": "Those who resist Allah and His Messenger will be among those most humiliated.\n",
        "TRANSLATION_13": "Those who oppose Allah and His Messenger (Muhammad SAW), they will be among the lowest (most humiliated).\n",
        "TRANSLATION_14": "Those who oppose Allah and His Messenger shall be among the humiliated.\n",
        "TRANSLATION_15": "Those who oppose God and His Messenger are among the lowliest.\n",
        "TRANSLATION_16": "Indeed, the ones who oppose Allah and His Messenger - those will be among the most humbled.\n",
        "TRANSLATION_17": "[58:20] Indeed those who oppose God and His Messenger — they will be among the most abased, the vanquished.\n",
        "TRANSLATION_18": "(Lo! those who oppose) contravene (Allah and His messenger) in the matter of religion, (they will be among the lowest) in the Fire. The reference here is to the Jews and hypocrites.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "58:20",
            "24:52",
            "3:132",
            "63:1",
            "9:1",
            "33:57",
            "5:56",
            "49:15",
            "3:32",
            "8:20"
        ],
        "BIBLE": [
            "prophets:i%20samuel:26:8",
            "writings:job:20:24",
            "writings:proverbs:17:26",
            "writings:ii%20chronicles:36:16",
            "torah:deuteronomy:15:4",
            "prophets:hosea:4:6",
            "torah:numbers:34:11",
            "torah:exodus:12:22",
            "writings:job:17:3",
            "prophets:isaiah:22:14"
        ]
    }
}