{
    "VERSE": "58:21",
    "ARABIC": "كَتَبَ ٱللَّهُ لَأَغْلِبَنَّ أَنَا۠ وَرُسُلِىٓ إِنَّ ٱللَّهَ قَوِىٌّ عَزِيزٌ",
    "ENGLISH": {
        "TRANSLATION_0": "Allah has written, 'I will be victorious, I and and My Messengers.' Allah is Most Strong, Almighty.",
        "TRANSLATION_1": "God has decreed: \"I will prevail, I and My apostles.\" Verily God is powerful and all-mighty.\n",
        "TRANSLATION_2": "Allah has written: “Surely I will prevail; I and My Messengers.” Verily Allah is Most Strong, Most Mighty.\n",
        "TRANSLATION_3": "God has decreed, \"I and My Messenger shall certainly triumph.\" God is All-powerful and Majestic.\n",
        "TRANSLATION_4": "Allah has already decreed that, “I will indeed be victorious, and My Noble Messengers”; indeed Allah is Almighty, the Most Honourable.\n",
        "TRANSLATION_5": "Allah has decreed: \"Verily, I and My Messengers shall be the victorious.\" Verily, Allah is All-Powerful, Almighty.\n",
        "TRANSLATION_6": "Allah has written down: I will most certainly prevail, I and My apostles; surely Allah is Strong, Mighty.\n",
        "TRANSLATION_7": "God has written, 'I shall assuredly be the victor, I and My Messengers.' Surely God is All-strong, All-mighty.\n",
        "TRANSLATION_8": "Allah hath decreed: Lo! I verily shall conquer, I and My messengers. Lo! Allah is Strong, Almighty.\n",
        "TRANSLATION_9": "God has decreed, \"I and My messengers shall most certainly prevail.\" Truly God is Powerful and Almighty.\n",
        "TRANSLATION_10": "Allah hath prescribed: surely shall overcome, and My apostles. Verily Allah is strong, Mighty.\n",
        "TRANSLATION_11": "Allah has ordained: ‘I shall surely prevail, I and My apostles.’ Indeed Allah is all-strong, all-mighty.\n",
        "TRANSLATION_12": "Allah has decreed: \"It is I and My messengers who must prevail\": For Allah is One full of strength, able to enforce His Will.\n",
        "TRANSLATION_13": "Allah has decreed: \"Verily! It is I and My Messengers who shall be the victorious.\" Verily, Allah is All-Powerful, All-Mighty.\n",
        "TRANSLATION_14": "Allah has written: 'I will surely be the Victor, I and My Messengers' Surely, Allah is the Strong, the Almighty.\n",
        "TRANSLATION_15": "God has written: “I will certainly prevail, I and My messengers.” God is Strong and Mighty.\n",
        "TRANSLATION_16": "Allah has written, \"I will surely overcome, I and My messengers.\" Indeed, Allah is Powerful and Exalted in Might.\n",
        "TRANSLATION_17": "[58:21] God has inscribed, in the Preserved Tablet, or [it means] He has decreed: ‘I shall assuredly prevail, I and My messengers’, by means of definitive proof or the sword. Truly God is Strong, Mighty.\n",
        "TRANSLATION_18": "(Allah hath decreed: Lo! I verily shall conquer, I and My messengers) i.e. Muhammad (pbuh) they shall conquer Persia, Byzantium, the hypocrites and the Jews. (Lo! Allah is Strong) through giving help to his prophets, (Almighty) in retribution against His enemies. This was revealed about 'Abdullah Ibn Ubayy Ibn Salul who said to the true believers: \"Do you really think that you shall conquer Persia and Byzantium?\".\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "58:21",
            "14:47",
            "22:74",
            "3:132",
            "63:1",
            "37:152",
            "42:19",
            "48:3",
            "9:65",
            "33:25"
        ],
        "BIBLE": [
            "torah:exodus:15:2",
            "writings:psalms:21:14",
            "writings:ii%20chronicles:14:10",
            "writings:psalms:68:35",
            "writings:daniel:11:32",
            "prophets:isaiah:12:2",
            "writings:psalms:59:10",
            "writings:job:36:5",
            "writings:psalms:68:29",
            "prophets:jeremiah:20:11"
        ]
    }
}