{
    "VERSE": "58:4",
    "ARABIC": "فَمَن لَّمْ يَجِدْ فَصِيَامُ شَهْرَيْنِ مُتَتَابِعَيْنِ مِن قَبْلِ أَن يَتَمَآسَّا فَمَن لَّمْ يَسْتَطِعْ فَإِطْعَامُ سِتِّينَ مِسْكِينًا ذَٰلِكَ لِتُؤْمِنُوا۟ بِٱللَّهِ وَرَسُولِهِۦ وَتِلْكَ حُدُودُ ٱللَّهِ وَلِلْكَٰفِرِينَ عَذَابٌ أَلِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "Anyone who cannot find the means must fast for two consecutive months before the two of them may touch one another again. And anyone who is unable to do that must feed sixty poor people. That is to affirm your iman in Allah and His Messenger. These are Allah's limits. The kafirun will have a painful punishment.",
        "TRANSLATION_1": "If one does not have the means (of doing so) then he should fast for two months continuously before he has physical contact; but any one who is unable to do so, should feed sixty needy persons. This (is enjoined) so that you may be faithful to God and His Apostle. These are the limits set by God. As for the unbelievers, there is painful punishment for them.\n",
        "TRANSLATION_2": "And he who does not find a slave (to free), shall fast for two months consecutively before they may touch each other; and he who is unable to do so shall feed sixty needy people. All this is in order that you may truly believe in Allah and His Messenger. These are the bounds set by Allah; and a grievous chastisement awaits the unbelievers.\n",
        "TRANSLATION_3": "If one cannot set free a slave, he must fast for two consecutive months, and only then can he have lawful carnal relations. If this is also not possible, he must feed sixty destitute people. This is the command of God, so that perhaps you will have faith in God and His Messenger. Such are the Laws of God, and those who disbelieve them will suffer a painful torment.\n",
        "TRANSLATION_4": "So one who cannot find a slave, must then fast for two successive months before they touch one another; and one who cannot even fast, must then feed sixty needy ones; this is in order that you keep faith in Allah and His Noble Messenger; and these are the limits of Allah; and for the disbelievers is a painful punishment.\n",
        "TRANSLATION_5": "And he who finds not, must fast two successive months before they both touch each other. And he who is unable to do so, should feed sixty of the poor. That is in order that you may have perfect faith in Allah and His Messenger. These are the limits set by Allah. And for disbelievers, there is a painful torment.\n",
        "TRANSLATION_6": "But whoever has not the means, let him fast for two months successively before they touch each other; then as for him who is not able, let him feed sixty needy ones; that is in order that you may have faith in Allah and His Apostle, and these are Allah's limits, and the unbelievers shall have a painful punishment.\n",
        "TRANSLATION_7": "But whosoever finds not the means, then let him fast two successive months, before the two of them touch one another. And if any man is not able to, then let him feed sixty poor persons -- that, that you may believe in God and His Messenger. Those are God's bounds; and for the unbelievers there awaits yet a painful chastisement.\n",
        "TRANSLATION_8": "And he who findeth not (the wherewithal), let him fast for two successive months before they touch one another; and for him who is unable to do so (the penance is) the feeding of sixty needy ones. This, that ye may put trust in Allah and His messenger. Such are the limits (imposed by Allah); and for disbelievers is a painful doom.\n",
        "TRANSLATION_9": "and anyone who does not have the means must fast for two consecutive months before they touch each other, and who is not able to do that must feed sixty needy people. That is to affirm your faith in God and His messenger. These are the limits set by God. Those who deny the truth shall have a painful punishment.\n",
        "TRANSLATION_10": "And whosoever findeth not a slave to free on him is the fasting for two months in succession before the twain touch each other, and on him who is not able to do so is the feeding of sixty needy ones. That is in order that ye may believe in Allah and His apostle; and these are the ordinances of Allah. And for the infidels is a torment afflictive.\n",
        "TRANSLATION_11": "He who cannot afford [to free a slave] shall fast for two successive months before they may touch each other. If he cannot [do so], he shall feed sixty needy persons. This, that you may have faith in Allah and His Apostle. These are Allah’s bounds, and there is a painful punishment for the faithless.\n",
        "TRANSLATION_12": "And if any has not (the wherewithal), he should fast for two months consecutively before they touch each other. But if any is unable to do so, he should feed sixty indigent ones, this, that ye may show your faith in Allah and His Messenger. Those are limits (set by) Allah. For those who reject (Him), there is a grievous Penalty.\n",
        "TRANSLATION_13": "And he who finds not (the money for freeing a slave) must fast two successive months before they both touch each other. And for him who is unable to do so, he should feed sixty of Miskin (poor). That is in order that you may have perfect Faith in Allah and His Messenger. These are the limits set by Allah. And for disbelievers, there is a painful torment.\n",
        "TRANSLATION_14": "He who is unable shall fast for two successive months before they touch one another. If he is unable to do this, let him feed sixty needy people that, so that you believe in Allah and His Messenger. Such are the bounds of Allah. There is a painful punishment awaiting the unbelievers.\n",
        "TRANSLATION_15": "But whoever cannot find the means must fast for two consecutive months before they may touch one another. And if he is unable, then the feeding of sixty needy people. This, in order that you affirm your faith in God and His Messenger. These are the ordinances of God. The unbelievers will have a painful punishment.\n",
        "TRANSLATION_16": "And he who does not find [a slave] - then a fast for two months consecutively before they touch one another; and he who is unable - then the feeding of sixty poor persons. That is for you to believe [completely] in Allah and His Messenger; and those are the limits [set by] Allah. And for the disbelievers is a painful punishment.\n",
        "TRANSLATION_17": "[58:4] And he who cannot find [the wherewithal], [to set free] a slave, then [his redemption shall be] the fasting of two successive months before they touch one another. And if he is unable, to fast, then [the redemption shall be] the feeding of sixty needy persons, as an obligation upon him, that is, before they touch one another: understanding the unrestricted [prescription] as [having the same restriction as] the restricted one. For every needy person [he should give] one mudd measure of the principal food of the town. This, namely, lightening of the atonement is, so that you may believe in God and His Messenger. And these, namely, the rulings mentioned, are God’s bounds; and for the rejecters, of them, there is a painful chastisement.\n",
        "TRANSLATION_18": "(And he who findeth not (the wherewithal)) the means to free a slave, (let him fast for two successive months before they touch one another) before they have sexual intercourse with one another; (and for him who is unable to do so) i.e. to fast because he is weak ((the penance is) the feeding of sixty needy ones) giving each needy person half a measure (half a sa') of wheat or one measure (sa') of barley or dates. (This) which I have explained regarding the expiation of the Zihar, (that ye may put trust in Allah and His messenger) in order that you acknowledge the obligations of Allah and the wont of His Messenger. (Such are the limits (imposed by Allah)) such are the legal rulings and obligations of Allah regarding the Zihar; (and for disbelievers) in the limits imposed by Allah (is a painful doom) whose pain will extend to their hearts. From the beginning of the surah to this point was revealed about Khawlah Bint Tha'labah Ibn Malik al-Ansariyyah and her husband Aws Ibn al-Samit, the brother of 'Ubadah Ibn al-Samit, who was angered by his wife for refusing him to sleep with her and, as a result, made sexual intercourse with her forbidden on him. But he regretted doing so, and Allah revealed how he could expiate the sin he committed. The Prophet (pbuh) told him: \"You should free a slave\". Aws said: \"I have very little money and it costs a great deal to free a slave\". The Prophet (pbuh) said: \"Then you should fast two successive months\". Aws said: \"I cannot do so! If I do not eat once or twice a day my eyesight becomes dim; and I fear peril if I fast\". The Prophet (pbuh) said: \"Then you should feed 60 needy ones\". Aws said: \"I can not afford it\". The Prophet (pbuh) ordered for him a measure of dates and commanded him to give it to the needy. Aws said: \"I do not know of anyone in Medina who is more in need of it than I\". The Prophet (pbuh) told him to eat it and, with the help of another person, the Prophet (pbuh) fed 60 needy people, and this allowed Aws to go back to his wife whom he had declared unlawful for himself.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "58:4",
            "4:14",
            "9:90",
            "14:22",
            "58:5",
            "14:4",
            "9:61",
            "48:16",
            "40:34",
            "9:79"
        ],
        "BIBLE": [
            "torah:genesis:4:15",
            "torah:exodus:19:12",
            "prophets:ii%20kings:4:43",
            "torah:numbers:5:30",
            "torah:deuteronomy:32:8",
            "torah:leviticus:27:8",
            "writings:psalms:119:30",
            "prophets:ii%20kings:17:37",
            "torah:deuteronomy:4:8",
            "prophets:jeremiah:26:4"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:5",
            
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:3"
        ]
    }
}