{
    "VERSE": "58:7",
    "ARABIC": "أَلَمْ تَرَ أَنَّ ٱللَّهَ يَعْلَمُ مَا فِى ٱلسَّمَٰوَٰتِ وَمَا فِى ٱلْأَرْضِ مَا يَكُونُ مِن نَّجْوَىٰ ثَلَٰثَةٍ إِلَّا هُوَ رَابِعُهُمْ وَلَا خَمْسَةٍ إِلَّا هُوَ سَادِسُهُمْ وَلَآ أَدْنَىٰ مِن ذَٰلِكَ وَلَآ أَكْثَرَ إِلَّا هُوَ مَعَهُمْ أَيْنَ مَا كَانُوا۟ ثُمَّ يُنَبِّئُهُم بِمَا عَمِلُوا۟ يَوْمَ ٱلْقِيَٰمَةِ إِنَّ ٱللَّهَ بِكُلِّ شَىْءٍ عَلِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "Do you not see that Allah knows what is in the heavens and on the earth? Three men cannot confer together secretly without Him being the fourth of them, or five without Him being the sixth of them, or fewer than that or more without Him being with them wherever they are. Then He will inform them on the Day of Rising of what they did. Allah has knowledge of all things.",
        "TRANSLATION_1": "Have you not considered that God knows whatever is in the heavens and the earth? No three persons confer secretly but He is the fourth among them, and no five but He is the sixth; and neither fewer nor more but He is with them wheresoever they be. And on the Day of Judgement He will announce their deeds to them. Verily God has knowledge of everything.\n",
        "TRANSLATION_2": "Are you not aware that Allah knows whatever is in the heavens and whatever is in the earth? Never is there any whispering among three but He is their fourth; nor among five but He is their sixth; nor fewer nor more but He is with them wherever they may be. And then He will tell them on the Day of Judgement all that they have done. Surely Allah knows everything.\n",
        "TRANSLATION_3": "Have you not considered that God knows all that is in the heavens and the earth? There is not a single place wherein any secret counsel can take place between any three people without God being the fourth, nor five people without His being the sixth nor any gathering of more or less people, wherever it may be, without His being with them. On the Day of Judgment, He will tell them about their deeds. God has the knowledge of all things.\n",
        "TRANSLATION_4": "O listener! Did you not see that Allah knows all whatever is in the heavens and all whatever is in the earth? Wherever there is any discussion among three He is the fourth present with them, and among five He is the sixth, and there is no discussion among fewer or more except that He is with them wherever they may be; and then on the Day of Resurrection He will inform them of all what they did; indeed Allah knows all things.\n",
        "TRANSLATION_5": "Have you not seen that Allah knows whatsoever is in the heavens and whatsoever is on the earth There is no Najwa of three but He is their fourth nor of five but He is their sixth nor of less than that or more but He is with them wheresoever they may be. And afterwards on the Day of Resurrection He will inform them of what they did. Verily, Allah is the All-Knower of everything.\n",
        "TRANSLATION_6": "Do you not see that Allah knows whatever is in the heavens and whatever is in the earth? Nowhere is there a secret counsel between three persons but He is the fourth of them, nor (between) five but He is the sixth of them, nor less than that nor more but He is with them wheresoever they are; then He will inform them of what they did on the day of resurrection: surely Allah is Cognizant of all things.\n",
        "TRANSLATION_7": "God has numbered it, and they have forgotten it. God is witness over everything. Hast thou not seen that God knows whatsoever is in the heavens, and whatsoever is in the earth? Three men conspire not secretly together, but He is the fourth of them, neither five men, but He is the sixth of them, neither fewer than that, neither more, but He is with them, wherever they may be; then He shall tell them what they have done, on the Day of Resurrection. Surely God has knowledge of everything.\n",
        "TRANSLATION_8": "Hast thou not seen that Allah knoweth all that is in the heavens and all that is in the earth? There is no secret conference of three but He is their fourth, nor of five but He is their sixth, nor of less than that or more but He is with them wheresoever they may be; and afterward, on the Day of Resurrection, He will inform them of what they did. Lo! Allah is Knower of all things.\n",
        "TRANSLATION_9": "Do you not see that God knows all that is in the heavens and on the earth? There is not a secret consultation between three, but He makes the fourth among them -- nor between five but He makes the sixth -- nor between fewer nor more, but He is in their midst, wherever they may be: in the end He will tell them the truth about their conduct, on the Day of Judgement. For God has full knowledge of all things.\n",
        "TRANSLATION_10": "Observest thou not that Allah knoweth whatsoever is in the heavens and whatsoever is in the earth! There is no whispering among three but He is their fourth, nor among five but He is their sixth, nor fewer than that nor more but He is with them wheresoever they may be; and thereafter He will declare Unto them, on the Day of Judgment, that which they have worked. Verily Allah is of everything Knower.\n",
        "TRANSLATION_11": "Have you not regarded that Allah knows whatever there is in the heavens and whatever there is in the earth? There dost not takes place any secret talk among three, but He is their fourth [companion], nor among five but He is their sixth, nor when they are less than that or more but He is with them wherever they may be. Then He will inform them about what they have done on the Day of Resurrection. Indeed Allah has knowledge of all things.\n",
        "TRANSLATION_12": "Seest thou not that Allah doth know (all) that is in the heavens and on earth? There is not a secret consultation between three, but He makes the fourth among them, - Nor between five but He makes the sixth,- nor between fewer nor more, but He is in their midst, wheresoever they be: In the end will He tell them the truth of their conduct, on the Day of Judgment. For Allah has full knowledge of all things.\n",
        "TRANSLATION_13": "Have you not seen that Allah knows whatsoever is in the heavens and whatsoever is on the earth? There is no Najwa (secret counsel) of three, but He is their fourth (with His Knowledge, while He Himself is over the Throne, over the seventh heaven), nor of five but He is their sixth (with His Knowledge), not of less than that or more, but He is with them (with His Knowledge) wheresoever they may be; and afterwards on the Day of Resurrection, He will inform them of what they did. Verily, Allah is the All-Knower of everything.\n",
        "TRANSLATION_14": "Have you not seen that Allah knows that which is in the heavens and the earth? There is no secret talk between three but He is the fourth of them; nor between five but He is the sixth of them; nor between fewer or more but He is with them wherever they are. Then, on the Day of Resurrection, He will inform them of what they have done. Surely, Allah has knowledge of all things.\n",
        "TRANSLATION_15": "Do you not realize that God knows everything in the heavens and everything on earth? There is no secret counsel between three, but He is their fourth; nor between five, but He is their sixth; nor less than that, nor more, but He is with them wherever they may be. Then, on the Day of Resurrection, He will inform them of what they did. God has knowledge of everything.\n",
        "TRANSLATION_16": "Have you not considered that Allah knows what is in the heavens and what is on the earth? There is in no private conversation three but that He is the fourth of them, nor are there five but that He is the sixth of them - and no less than that and no more except that He is with them [in knowledge] wherever they are. Then He will inform them of what they did, on the Day of Resurrection. Indeed Allah is, of all things, Knowing.\n",
        "TRANSLATION_17": "[58:7] Have you not seen, [have you not] realised, that God knows all that is in the heavens and all that is in the earth? Not secret conversation of three takes place but He is their fourth [companion], by [virtue of] His omniscience, nor of five but He is their sixth, nor of fewer than that or more but He is with them wherever they may be. Then He will inform them of what they did, on the Day of Resurrection. Assuredly God has knowledge of all things.\n",
        "TRANSLATION_18": "(Hast thou not seen) have you not been informed, Muhammad, in the Qur'an (that Allah knoweth all that is in the heavens and all that is in the earth) of creation? (There is no secret conference of three but He is their fourth) except that Allah knows about them, their works and secret conference, (nor of five but He is their sixth) He knows them and knows their secret conference, (nor of less than that or more but He is with them) He knows them and knows their secret conference (wheresoever they may be; and afterward, on the Day of Resurrection, He will inform them of what they did) in the life of the world. (Lo! Allah is Knower of all things) of their works and secret conference. This verse was revealed about Safwan Ibn Umayyah and his son-in-law; their story is mentioned in the Surah of Prostration.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "58:7",
            "24:64",
            "49:16",
            "24:41",
            "10:36",
            "4:126",
            "14:38",
            "9:115",
            "5:40",
            "65:12"
        ],
        "BIBLE": [
            "torah:exodus:32:1",
            "writings:ecclesiastes:3:14",
            "torah:exodus:34:10",
            "writings:daniel:6:13",
            "prophets:ii%20samuel:15:20",
            "writings:daniel:4:15",
            "writings:i%20chronicles:29:17",
            "prophets:ezekiel:39:7",
            "writings:i%20chronicles:17:21",
            "prophets:isaiah:13:13"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:4:6"
        ]
    }
}