{
    "VERSE": "53:1",
    "ARABIC": "بِسْمِ ٱللَّهِ ٱلرَّحْمَٰنِ ٱلرَّحِيمِ وَٱلنَّجْمِ إِذَا هَوَىٰ",
    "ENGLISH": {
        "TRANSLATION_0": "By the star when it descends,",
        "TRANSLATION_1": "I CALL TO witness the star of the pleiades when it has dipped\n",
        "TRANSLATION_2": "By the star when it sets:\n",
        "TRANSLATION_3": "By the declining star,\n",
        "TRANSLATION_4": "By oath of the beloved shining star Mohammed (peace and blessings be upon him), when he returned from the Ascent.\n",
        "TRANSLATION_5": "By the star when it goes down.\n",
        "TRANSLATION_6": "I swear by the star when it goes down.\n",
        "TRANSLATION_7": "By the Star when it plunges,\n",
        "TRANSLATION_8": "By the Star when it setteth,\n",
        "TRANSLATION_9": "By the setting star,\n",
        "TRANSLATION_10": "By the star when it setteth.\n",
        "TRANSLATION_11": "By the star when it sets:\n",
        "TRANSLATION_12": "By the Star when it goes down,-\n",
        "TRANSLATION_13": "By the star when it goes down, (or vanishes).\n",
        "TRANSLATION_14": "By the star when it plunges,\n",
        "TRANSLATION_15": "By the star as it goes down.\n",
        "TRANSLATION_16": "By the star when it descends,\n",
        "TRANSLATION_17": "[53:1] By the Star — the constellation Pleiades (al-thurayya) — when it sets, [when] it disappears,\n",
        "TRANSLATION_18": "And from his narration on the authority of Ibn 'Abbas that he said regarding the interpretation of Allah's saying (By the Najm when it setteth): '(By the Najm when it setteth) He says: Allah swears by the Qur'an when Gabriel takes it down to Muhammad in instalments (nujuman): one, two, three or four verses at a time. There was a 20 years interval between the first and last verses. When this verse was revealed, 'Utbah Ibn Abi Lahab heard that the Prophet (pbuh) swore by the revelation of the Qur'an in instalment and so he said: \"Tell Muhammad that I disbelieve in the instalments of the Qur'an\". When the Prophet (pbuh) was informed of this, he prayed: \"O Allah! Set on him one of Your wild beasts\". Later, Allah set on him a lion near Harran that snatched him from among his friends and took him to a place nearby. It tore him apart from head to foot but did not eat him because of his impurity, just as the Prophet (pbuh) had prayed against him. It is also said here Allah swore by the stars when they set, 620\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "53:1",
            "81:2",
            "77:8",
            "86:3",
            "37:88",
            "16:16",
            "56:1",
            "56:75",
            "55:6",
            "52:49"
        ],
        "BIBLE": [
            "prophets:i%20samuel:23:28",
            "torah:exodus:19:20",
            "prophets:ii%20samuel:11:13",
            "torah:exodus:34:31",
            "writings:psalms:50:1",
            "prophets:jeremiah:32:34",
            "torah:numbers:32:42",
            "writings:esther:2:14",
            "prophets:ii%20samuel:19:40",
            "prophets:jeremiah:7:30"
        ]
    }
}