{
    "VERSE": "53:10",
    "ARABIC": "فَأَوْحَىٰٓ إِلَىٰ عَبْدِهِۦ مَآ أَوْحَىٰ",
    "ENGLISH": {
        "TRANSLATION_0": "Then He revealed to His slave what He revealed.",
        "TRANSLATION_1": "When He revealed to His votary what He revealed.\n",
        "TRANSLATION_2": "Then he revealed to Allah's servant whatever he had to reveal.\n",
        "TRANSLATION_3": "He revealed to God's servant whatever he wanted.\n",
        "TRANSLATION_4": "So Allah divinely revealed to His bondman, whatever He divinely revealed.\n",
        "TRANSLATION_5": "So (Allah) revealed to His servant whatever He revealed.\n",
        "TRANSLATION_6": "And He revealed to His servant what He revealed.\n",
        "TRANSLATION_7": "then revealed to his servant that he revealed.\n",
        "TRANSLATION_8": "And He revealed unto His slave that which He revealed.\n",
        "TRANSLATION_9": "and revealed to God's servant what he revealed.\n",
        "TRANSLATION_10": "Thus He revealed Unto His bondman whatsoever He revealed.\n",
        "TRANSLATION_11": "whereat He revealed to His servant whatever He revealed.\n",
        "TRANSLATION_12": "So did (Allah) convey the inspiration to His Servant- (conveyed) what He (meant) to convey.\n",
        "TRANSLATION_13": "So did (Allah) convey the Inspiration to His slave [Muhammad SAW through Jibrael (Gabriel)].\n",
        "TRANSLATION_14": "so (Allah) revealed to His worshiper (Gabriel) that which he revealed (to Prophet Muhammad).\n",
        "TRANSLATION_15": "Then He revealed to His servant what He revealed.\n",
        "TRANSLATION_16": "And he revealed to His Servant what he revealed.\n",
        "TRANSLATION_17": "[53:10] whereat He, [God] exalted be He, revealed to His servant, Gabriel, what he, Gabriel, revealed, to the Prophet (s); the thing being revealed is not mentioned [explicitly] in exaltation of its [great] status.\n",
        "TRANSLATION_18": "(And He revealed unto His slave) Gabriel (that which He revealed) to His slave Muhammad (pbuh); and it is said this means: and He revealed to His slave Muhammad (pbuh) that which He revealed.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "53:10",
            "89:29",
            "96:10",
            "37:111",
            "44:23",
            "37:132",
            "37:81",
            "37:94",
            "39:36",
            "26:52"
        ],
        "BIBLE": [
            "prophets:amos:3:7",
            "prophets:isaiah:65:15",
            "torah:genesis:50:17",
            "prophets:i%20kings:13:26",
            "prophets:ii%20kings:10:19",
            "writings:daniel:2:19",
            "prophets:ezekiel:38:17",
            "prophets:jeremiah:42:2",
            "prophets:i%20samuel:9:7",
            "prophets:ezekiel:38:14"
        ]
    }
}