{
    "VERSE": "53:11",
    "ARABIC": "مَا كَذَبَ ٱلْفُؤَادُ مَا رَأَىٰٓ",
    "ENGLISH": {
        "TRANSLATION_0": "His heart did not lie about what he saw.",
        "TRANSLATION_1": "His heart did not falsify what he perceived.\n",
        "TRANSLATION_2": "His heart added no untruth to what he saw.\n",
        "TRANSLATION_3": "His (Muhammad's) heart did not lie to him about what his eyes had seen.\n",
        "TRANSLATION_4": "The heart did not deny, what it saw. (The Holy Prophet was bestowed with seeing Allah – see also preceding verses 8, 9, 10.)\n",
        "TRANSLATION_5": "The heart lied not in what he saw.\n",
        "TRANSLATION_6": "The heart was not untrue in (making him see) what he saw.\n",
        "TRANSLATION_7": "His heart lies not of what he saw;\n",
        "TRANSLATION_8": "The heart lied not (in seeing) what it saw.\n",
        "TRANSLATION_9": "The heart [of the Prophet] did not misconstrue what he saw.\n",
        "TRANSLATION_10": "The heart lied not in that which he saw.\n",
        "TRANSLATION_11": "The heart did not deny what it saw.\n",
        "TRANSLATION_12": "The (Prophet's) (mind and) heart in no way falsified that which he saw.\n",
        "TRANSLATION_13": "The (Prophet's) heart lied not (in seeing) what he (Muhammad SAW) saw.\n",
        "TRANSLATION_14": "His heart did not lie of what he saw.\n",
        "TRANSLATION_15": "The heart did not lie about what it saw.\n",
        "TRANSLATION_16": "The heart did not lie [about] what it saw.\n",
        "TRANSLATION_17": "[53:11] The heart, the heart of the Prophet, did not deny (read khadhaba or kadhdhaba) what he saw, with his own eyes of the image of Gabriel.\n",
        "TRANSLATION_18": "(The heart) of Muhammad (pbuh) (lied not (in seeing) what it saw) when he saw his Lord with his heart; it is also said that he saw his Lord with his eyes. This is why Allah made His oath.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "53:11",
            "104:7",
            "6:113",
            "96:5",
            "23:78",
            "67:23",
            "53:57",
            "17:36",
            "32:9",
            "15:90"
        ],
        "BIBLE": [
            "prophets:isaiah:6:10",
            "torah:deuteronomy:4:9",
            "writings:proverbs:27:11",
            "torah:genesis:21:9",
            "torah:genesis:26:28",
            "torah:genesis:3:6",
            "writings:proverbs:2:2",
            "writings:i%20chronicles:15:29",
            "writings:psalms:69:24",
            "writings:ii%20chronicles:29:10"
        ]
    }
}