{
    "VERSE": "53:12",
    "ARABIC": "أَفَتُمَٰرُونَهُۥ عَلَىٰ مَا يَرَىٰ",
    "ENGLISH": {
        "TRANSLATION_0": "What! Do you dispute with him about what he saw?",
        "TRANSLATION_1": "Will you dispute with him what he saw?\n",
        "TRANSLATION_2": "Are you, then, going to contend with him regarding what he sees with his eyes?\n",
        "TRANSLATION_3": "Will you then argue with him about what he saw?\n",
        "TRANSLATION_4": "What! So do you dispute with him regarding what he saw?\n",
        "TRANSLATION_5": "Will you then dispute with him about what he saw\n",
        "TRANSLATION_6": "What! do you then dispute with him as to what he saw?\n",
        "TRANSLATION_7": "what, will you dispute with him what he sees?\n",
        "TRANSLATION_8": "Will ye then dispute with him concerning what he seeth?\n",
        "TRANSLATION_9": "Will you then dispute with him as to what he saw?\n",
        "TRANSLATION_10": "Will ye therefore dispute with him concerning that which he hath Seen?\n",
        "TRANSLATION_11": "Will you then dispute with him about what he saw?!\n",
        "TRANSLATION_12": "Will ye then dispute with him concerning what he saw?\n",
        "TRANSLATION_13": "Will you then dispute with him (Muhammad SAW) about what he saw [during the Mi'raj: (Ascent of the Prophet SAW over the seven heavens)].\n",
        "TRANSLATION_14": "What, will you dispute with him about what he sees!\n",
        "TRANSLATION_15": "Will you dispute with him concerning what he saw?\n",
        "TRANSLATION_16": "So will you dispute with him over what he saw?\n",
        "TRANSLATION_17": "[53:12] Will you then dispute with him, will you [then] argue with him and [hope to] overwhelm him, concerning what he saw? — an address to the idolaters who denied the Prophet’s (s) vision of Gabriel.\n",
        "TRANSLATION_18": "621 When the Prophet (pbuh) informed them of what he saw, they disbelieved him. And so Allah said: (Will ye then dispute with him concerning) will you then disbelieve (what he seeth) what Muhammad (pbuh) saw?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "53:12",
            "56:58",
            "26:75",
            "56:63",
            "37:95",
            "16:17",
            "53:33",
            "37:155",
            "26:146",
            "32:18"
        ],
        "BIBLE": [
            "torah:genesis:16:4",
            "prophets:judges:16:1",
            "torah:deuteronomy:11:7",
            "torah:deuteronomy:1:28",
            "writings:job:7:8",
            "torah:genesis:44:28",
            "torah:genesis:21:19",
            "writings:job:13:1",
            "torah:genesis:24:63",
            "prophets:hosea:5:13"
        ]
    }
}