{
    "VERSE": "53:17",
    "ARABIC": "مَا زَاغَ ٱلْبَصَرُ وَمَا طَغَىٰ",
    "ENGLISH": {
        "TRANSLATION_0": "His eye did not waver nor did he look away.",
        "TRANSLATION_1": "Neither did sight falter nor exceed the bounds.\n",
        "TRANSLATION_2": "His eye did not waver, nor did it stray,\n",
        "TRANSLATION_3": "(Muhammad's) eyes did not deceive him, nor did they lead him to falsehood.\n",
        "TRANSLATION_4": "The sight did not shift, nor did it cross the limits.\n",
        "TRANSLATION_5": "The sight turned not aside, nor it transgressed beyond the limit.\n",
        "TRANSLATION_6": "The eye did not turn aside, nor did it exceed the limit.\n",
        "TRANSLATION_7": "his eye swerved not; nor swept astray.\n",
        "TRANSLATION_8": "The eye turned not aside nor yet was overbold.\n",
        "TRANSLATION_9": "His sight did not waver nor was it unduly bold.\n",
        "TRANSLATION_10": "The sight turned not aside, nor it exceeded.\n",
        "TRANSLATION_11": "His gaze did not swerve, nor did it overstep the bounds.\n",
        "TRANSLATION_12": "(His) sight never swerved, nor did it go wrong!\n",
        "TRANSLATION_13": "The sight (of Prophet Muhammad SAW) turned not aside (right or left), nor it transgressed beyond (the) limit (ordained for it).\n",
        "TRANSLATION_14": "his eyes did not swerve, nor did they stray\n",
        "TRANSLATION_15": "The sight did not waver, nor did it exceed.\n",
        "TRANSLATION_16": "The sight [of the Prophet] did not swerve, nor did it transgress [its limit].\n",
        "TRANSLATION_17": "[53:17] The eye did not swerve, on the part of the Prophet (s), nor did it go beyond [the bounds], that is to say, his gaze did not turn away from the object of vision designated for it, nor did it go beyond that [object] on that night.\n",
        "TRANSLATION_18": "(The eye turned not aside) the sight of Muhammad (pbuh) did not turn right or left because of what he saw (nor yet was overbold) due to what he saw; he saw that Gabriel had 600 wings.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "53:17",
            "35:19",
            "75:7",
            "79:9",
            "7:120",
            "53:53",
            "40:58",
            "38:63",
            "68:51",
            "53:2"
        ],
        "BIBLE": [
            "writings:ii%20chronicles:34:2",
            "prophets:ii%20kings:22:2",
            "prophets:i%20kings:15:5",
            "writings:ii%20chronicles:20:32",
            "prophets:i%20kings:22:43",
            "torah:exodus:3:3",
            "torah:deuteronomy:5:29",
            "torah:deuteronomy:28:14",
            "writings:psalms:119:51",
            "prophets:isaiah:44:20"
        ]
    }
}