{
    "VERSE": "53:25",
    "ARABIC": "فَلِلَّهِ ٱلْءَاخِرَةُ وَٱلْأُولَىٰ",
    "ENGLISH": {
        "TRANSLATION_0": "The last and the first belong to Allah.",
        "TRANSLATION_1": "To God belong the End and the Beginning.\n",
        "TRANSLATION_2": "To Allah belong both the Next World and the present.\n",
        "TRANSLATION_3": "All that is in the life to come and all that is in this life belongs only to God.\n",
        "TRANSLATION_4": "So (know that) Allah only is the Owner of all – the Hereafter and this world.\n",
        "TRANSLATION_5": "But to Allah belongs the last (Hereafter) and the first (the world).\n",
        "TRANSLATION_6": "Nay! for Allah is the hereafter and the former (life).\n",
        "TRANSLATION_7": "And to God belongs the First and the Last.\n",
        "TRANSLATION_8": "But unto Allah belongeth the after (life), and the former.\n",
        "TRANSLATION_9": "But it is to God that the Hereafter and this world belong.\n",
        "TRANSLATION_10": "Allah's is the last and the first.\n",
        "TRANSLATION_11": "Yet to Allah belong this world and the Hereafter.\n",
        "TRANSLATION_12": "But it is to Allah that the End and the Beginning (of all things) belong.\n",
        "TRANSLATION_13": "But to Allah belongs the last (Hereafter) and the first (the world).\n",
        "TRANSLATION_14": "To Allah belongs the Eternal life and the first life.\n",
        "TRANSLATION_15": "To God belong the Last and the First.\n",
        "TRANSLATION_16": "Rather, to Allah belongs the Hereafter and the first [life].\n",
        "TRANSLATION_17": "[53:25] Yet to God belong the Hereafter and the former [life], that is to say, [the life of] the world, and so nothing comes to pass in them except what He, exalted, wills.\n",
        "TRANSLATION_18": "(But Unto Allah belongeth the after (life)) through the bestowal of reward, honour and intercession, (and the former) by giving knowledge and success.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "53:25",
            "79:25",
            "92:13",
            "56:49",
            "28:70",
            "39:66",
            "93:4",
            "26:213",
            "37:126",
            "53:62"
        ],
        "BIBLE": [
            "prophets:isaiah:41:22",
            "prophets:isaiah:41:23",
            "prophets:ezekiel:7:6",
            "writings:ecclesiastes:7:8",
            "writings:ecclesiastes:3:11",
            "prophets:isaiah:40:28",
            "torah:deuteronomy:1:32",
            "writings:job:8:7",
            "writings:psalms:59:14",
            "torah:deuteronomy:11:12"
        ]
    }
}