{
    "VERSE": "53:27",
    "ARABIC": "إِنَّ ٱلَّذِينَ لَا يُؤْمِنُونَ بِٱلْءَاخِرَةِ لَيُسَمُّونَ ٱلْمَلَٰٓئِكَةَ تَسْمِيَةَ ٱلْأُنثَىٰ",
    "ENGLISH": {
        "TRANSLATION_0": "Those who do not have iman in the Next World give the angels female names.",
        "TRANSLATION_1": "Those who do not believe in the Hereafter give the angels names of females.\n",
        "TRANSLATION_2": "Those who do not believe in the Hereafter give angels the names of females,\n",
        "TRANSLATION_3": "Only those who do not believe in the life hereafter call the angels, females. They have no knowledge about it.\n",
        "TRANSLATION_4": "Indeed those who do not believe in the Hereafter, coin the names of angels like those of females.\n",
        "TRANSLATION_5": "Verily, those who believe not in the Hereafter, name the angels with female names.\n",
        "TRANSLATION_6": "Most surely they who do not believe in the hereafter name the angels with female names.\n",
        "TRANSLATION_7": "Those who do not believe in the world to come name the angels with the names of females.\n",
        "TRANSLATION_8": "Lo! it is those who disbelieve in the Hereafter who name the angels with the names of females.\n",
        "TRANSLATION_9": "Those who do not believe in the life to come call the angels by female names.\n",
        "TRANSLATION_10": "Verily those who believe not in the Hereafter name the angels with the names of females.\n",
        "TRANSLATION_11": "Indeed those who do not believe in the Hereafter give female names to the angels.\n",
        "TRANSLATION_12": "Those who believe not in the Hereafter, name the angels with female names.\n",
        "TRANSLATION_13": "Verily, those who believe not in the Hereafter, name the angels with female names.\n",
        "TRANSLATION_14": "Those who disbelieve in the Everlasting Life call the angels by female names.\n",
        "TRANSLATION_15": "Those who do not believe in the Hereafter give the angels the names of females.\n",
        "TRANSLATION_16": "Indeed, those who do not believe in the Hereafter name the angels female names,\n",
        "TRANSLATION_17": "[53:27] Truly those who do not believe in the Hereafter give the angels the names of females, for they say: ‘They are God’s daughters’.\n",
        "TRANSLATION_18": "(Lo! it is those who disbelieve in the Hereafter) in resurrection after death, i.e. the disbelievers of Mecca (who name the angels with the names of females) they make them Allah's daughters.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "53:27",
            "27:4",
            "23:74",
            "37:150",
            "41:7",
            "17:40",
            "17:10",
            "16:109",
            "74:53",
            "6:8"
        ],
        "BIBLE": [
            "torah:genesis:9:4",
            "torah:deuteronomy:12:23",
            "prophets:i%20kings:1:12",
            "writings:daniel:12:2",
            "writings:psalms:96:13",
            "torah:exodus:1:1",
            "prophets:i%20samuel:20:1",
            "prophets:isaiah:41:23",
            "torah:genesis:9:5",
            "prophets:hosea:6:3"
        ]
    }
}