{
    "VERSE": "53:29",
    "ARABIC": "فَأَعْرِضْ عَن مَّن تَوَلَّىٰ عَن ذِكْرِنَا وَلَمْ يُرِدْ إِلَّا ٱلْحَيَوٰةَ ٱلدُّنْيَا",
    "ENGLISH": {
        "TRANSLATION_0": "So turn away from him who turns away from Our remembrance and desires nothing but the life of this world.",
        "TRANSLATION_1": "So you turn away from him who turns away from Our rememberance and wants nothing but the life of this world:\n",
        "TRANSLATION_2": "So leave alone those who turn away from the remembrance of Us and who seek nothing but the life of the world –\n",
        "TRANSLATION_3": "(Muhammad), stay away from those who turn away from Our guidance and who do not desire anything except the worldly life.\n",
        "TRANSLATION_4": "Therefore turn away from whoever has turned away from Our remembrance and has desired only the life of this world.\n",
        "TRANSLATION_5": "Therefore withdraw from him who turns away from Our Reminder and desires nothing but the life of this world.\n",
        "TRANSLATION_6": "Therefore turn aside from him who turns his back upon Our reminder and does not desire anything but this world's life.\n",
        "TRANSLATION_7": "So turn thou from him who turns away from Our Remembrance, and desires only the present life.\n",
        "TRANSLATION_8": "Then withdraw (O Muhammad) from him who fleeth from Our remembrance and desireth but the life of the world.\n",
        "TRANSLATION_9": "So ignore those who turn away from Our revelation and seek nothing but the life of this world.\n",
        "TRANSLATION_10": "Wherefore withdraw thou from him who turneth away from Our admonition and seeketh not but the life of the world.\n",
        "TRANSLATION_11": "So avoid those who turn away from Our remembrance and desire nothing but the life of the world.\n",
        "TRANSLATION_12": "Therefore shun those who turn away from Our Message and desire nothing but the life of this world.\n",
        "TRANSLATION_13": "Therefore withdraw (O Muhammad SAW) from him who turns away from Our Reminder (this Quran) and desires nothing but the life of this world.\n",
        "TRANSLATION_14": "So turn from those who turn away from Our Remembrance and only desire this present life.\n",
        "TRANSLATION_15": "So avoid him who has turned away from Our remembrance, and desires nothing but the present life.\n",
        "TRANSLATION_16": "So turn away from whoever turns his back on Our message and desires not except the worldly life.\n",
        "TRANSLATION_17": "[53:29] So shun him who turns away from Our Remembrance, that is, [from] the Qur’ān, and desires nothing but the life of this world — this was [revealed] before the command to struggle [against the disbelievers].\n",
        "TRANSLATION_18": "(Then withdraw) then turn your face, Muhammad, (from him who fleeth) from him who turns away (from Our remembrance) from Our divine Oneness and Scripture (and desireth) of his works (but the life of the world) but that which is in the life of the world, i.e. Abu Jahl and his host.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "53:29",
            "23:37",
            "6:29",
            "79:38",
            "10:7",
            "20:72",
            "30:7",
            "87:16",
            "2:86",
            "11:15"
        ],
        "BIBLE": [
            "writings:job:37:12",
            "writings:lamentations:5:21",
            "writings:psalms:85:4",
            "writings:lamentations:5:22",
            "writings:song%20of%20songs:6:1",
            "prophets:i%20kings:15:5",
            "prophets:isaiah:12:1",
            "writings:psalms:119:102",
            "prophets:jeremiah:31:18",
            "torah:genesis:3:24"
        ]
    }
}