{
    "VERSE": "53:31",
    "ARABIC": "وَلِلَّهِ مَا فِى ٱلسَّمَٰوَٰتِ وَمَا فِى ٱلْأَرْضِ لِيَجْزِىَ ٱلَّذِينَ أَسَٰٓـُٔوا۟ بِمَا عَمِلُوا۟ وَيَجْزِىَ ٱلَّذِينَ أَحْسَنُوا۟ بِٱلْحُسْنَى",
    "ENGLISH": {
        "TRANSLATION_0": "Everything in the heavens and everything in the earth belongs to Allah so that He can repay those who do evil for what they did and repay those who do good with the Very Best.",
        "TRANSLATION_1": "To God belongs whatever is in the heavens and the earth, that He may requite those who do evil, in accordance with their deeds, and those who do good with good.\n",
        "TRANSLATION_2": "To Allah alone belongs whatever is in the heavens and whatever is in the earth. He will requite the evil-doers for their deeds and bestow a goodly reward on those who have done good,\n",
        "TRANSLATION_3": "To God belongs whatever is in the heavens and the earth. In the end God will re-compense the evil doers for their deeds and reward the righteous ones for their deeds.\n",
        "TRANSLATION_4": "And to Allah only belongs all whatever is in the heavens and all whatever is in the earth, in order to repay those who do evil for what they have done, and give an excellent reward to those who do good.\n",
        "TRANSLATION_5": "And to Allah belongs all that is in the heavens and all that is on the earth, that He may requite those who do evil with that which they have done, and reward those who do good, with what is best.\n",
        "TRANSLATION_6": "And Allah's is what is in the heavens and what is in the earth, that He may reward those who do evil according to what they do, and (that) He may reward those who do good with goodness.\n",
        "TRANSLATION_7": "To God belongs whatsoever is in the heavens and whatsoever is in the earth, that He may recompense those who do evil for what they have done, and recompense those who have done good with the reward most fair.\n",
        "TRANSLATION_8": "And unto Allah belongeth whatsoever is in the heavens and whatsoever is in the earth, that He may reward those who do evil with that which they have done, and reward those who do good with goodness.\n",
        "TRANSLATION_9": "Everything in the heavens and on the earth belongs to God and so He will requite those who do evil in accordance with their deeds and will reward those left with that which is best, for those who do good.\n",
        "TRANSLATION_10": "And Allah's is whatsoever is in the heavens and whatsoever is in the earth, that He may recompense those who do evil for that which they worked and reward those who do good with good.\n",
        "TRANSLATION_11": "To Allah belongs whatever is in the heavens and whatever is in the earth, that He may requite those who do evil for what they have done, and reward those who do good with the best [of rewards].\n",
        "TRANSLATION_12": "Yea, to Allah belongs all that is in the heavens and on earth: so that He rewards those who do evil, according to their deeds, and He rewards those who do good, with what is best.\n",
        "TRANSLATION_13": "And to Allah belongs all that is in the heavens and all that is in the earth, that He may requite those who do evil with that which they have done (i.e. punish them in Hell), and reward those who do good, with what is best (i.e. Paradise).\n",
        "TRANSLATION_14": "To Allah belongs whatsoever is in the heavens and whatsoever is in the earth. He will recompense the evildoers according to their deeds, and recompense those who have done good with the finest reward\n",
        "TRANSLATION_15": "To God belongs whatever is in the heavens and whatever is on earth. He will repay those who do evil according to their deeds, and recompense those who do good with the best.\n",
        "TRANSLATION_16": "And to Allah belongs whatever is in the heavens and whatever is in the earth - that He may recompense those who do evil with [the penalty of] what they have done and recompense those who do good with the best [reward] -\n",
        "TRANSLATION_17": "[53:31] And to God belongs whatever is in the heavens and whatever is in the earth, that is, He owns [all of] that, among which [also] are the misguided one and the [rightly] guided one, leading astray whomever He will and guiding whomever He will, that He may requite those who do evil for what they have done, by way of idolatry and otherwise, and reward those who are virtuous, by [their] affirmation of [God’s] Oneness and other acts of obedience, with the best [reward], namely, Paradise. He points out ‘the virtuous’ as being:\n",
        "TRANSLATION_18": "(And Unto Allah belongeth whatsoever is in the heavens) of creation (and whatsoever is in the earth) of 623 created beings; they are all slaves of Allah, (that He may reward those who do evil) those ascribe partners to Allah (with that which they have done) in their state of idolatry, (and reward those who do good) those who believe in Allah's divine Oneness (with goodness) with the Garden.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "53:31",
            "59:24",
            "7:180",
            "4:132",
            "27:25",
            "3:109",
            "45:22",
            "57:1",
            "39:63",
            "42:53"
        ],
        "BIBLE": [
            "prophets:micah:3:4",
            "torah:genesis:1:1",
            "torah:deuteronomy:26:11",
            "prophets:joshua:1:17",
            "prophets:ii%20samuel:22:21",
            "writings:psalms:58:12",
            "writings:psalms:18:21",
            "prophets:isaiah:31:2",
            "writings:proverbs:13:21",
            "writings:psalms:141:4"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:5:2"
        ]
    }
}