{
    "VERSE": "53:32",
    "ARABIC": "ٱلَّذِينَ يَجْتَنِبُونَ كَبَٰٓئِرَ ٱلْإِثْمِ وَٱلْفَوَٰحِشَ إِلَّا ٱللَّمَمَ إِنَّ رَبَّكَ وَٰسِعُ ٱلْمَغْفِرَةِ هُوَ أَعْلَمُ بِكُمْ إِذْ أَنشَأَكُم مِّنَ ٱلْأَرْضِ وَإِذْ أَنتُمْ أَجِنَّةٌ فِى بُطُونِ أُمَّهَٰتِكُمْ فَلَا تُزَكُّوٓا۟ أَنفُسَكُمْ هُوَ أَعْلَمُ بِمَنِ ٱتَّقَىٰٓ",
    "ENGLISH": {
        "TRANSLATION_0": "To whoever avoids the major wrong actions and indecencies - except for minor lapses - truly your Lord is vast in forgiveness. He has most knowledge of you when He first produced you from the earth, and when you were embryos in your mothers' wombs. So do not claim purity for yourselves. He knows best those who have taqwa.",
        "TRANSLATION_1": "As for those who avoid the greater sins and shameful acts, except minor trespasses, your Lord's forgiveness surely has great amplitude. He is fully knowledgeable of you as He produced you from the earth, and since you were a foetus in your mother's womb. So do not assert your goodness; he is better who takes heed and preserves himself.\n",
        "TRANSLATION_2": "on those who avoid grave sins and shameful deeds, even if they may sometimes stumble into lesser offences. Surely your Lord is abounding in His Forgiveness. Very well is He aware of you since He produced you from the earth, and while you were still in your mothers' wombs and not yet born. So do not boastfully claim yourselves to be purified. He fully knows those that are truly Godfearing.\n",
        "TRANSLATION_3": "Those who stay away from grave sins and indecency (should know that) for their trivial sins your Lord's forgiveness is vast. He knows best about you. When He created you from the earth and when you were embryos in your mother's wombs. Do not consider yourselves very great. God knows best who is the most righteous person.\n",
        "TRANSLATION_4": "Those who avoid the cardinal sins and lewdness, except that they approached it and refrained; indeed your Lord’s mercy is limitless; He knows you very well – since He has created you from clay, and when you were foetuses in your mothers’ wombs; therefore do not, on your own, claim yourselves to be clean; He well knows who are the pious.\n",
        "TRANSLATION_5": "Those who avoid great sins and Al-Fawahish (immoral sins) except Al-Lamam -- verily, your Lord is of vast forgiveness. He knows you well when He created you from the earth (Adam), and when you were fetuses in your mothers' wombs. So, ascribe not purity to yourselves. He knows best him who has Taqwa.\n",
        "TRANSLATION_6": "Those who keep aloof from the great sins and the indecencies but the passing idea; surely your Lord is liberal in forgiving. He knows you best when He brings you forth from the earth and when you are embryos in the wombs of your mothers; therefore do not attribute purity to your souls; He knows him best who guards (against evil).\n",
        "TRANSLATION_7": "Those who avoid the heinous sins and indecencies, save lesser offences surely thy Lord is wide in His forgiveness. Very well He knows you, when He produced you from the earth, and when you were yet unborn in your mothers' wombs; therefore hold not yourselves purified; God knows very well him who is godfearing.\n",
        "TRANSLATION_8": "Those who avoid enormities of sin and abominations, save the unwilled offences - (for them) lo! thy Lord is of vast mercy. He is Best Aware of you (from the time) when He created you from the earth, and when ye were hidden in the bellies of your mothers. Therefor ascribe not purity unto yourselves. He is Best Aware of him who wardeth off (evil).\n",
        "TRANSLATION_9": "As for those who refrain from committing grave sins and indecent acts, though they may commit minor offences, your Lord is unstinting in His forgiveness. He knows you when He brings you out of the earth, and when you were embryos in the wombs of your mothers; so do not make claims to be pure. He knows best who is truly righteous.\n",
        "TRANSLATION_10": "They are those who avoid enormities of sin and abominations save the minor offences. Verily thy Lord is of vast for giveness: He is Best Knower of you when He produced you out Of the earth, and when ye were embryos in the bellies of your mothers. So justify not yourselves; He is the Best Knower of him who feareth Him.\n",
        "TRANSLATION_11": "Those who avoid major sins and indecencies, apart from [minor and occasional] lapses. Indeed your Lord is expansive in [His] forgiveness. He knows you best since [the time] He produced you from the earth and since you were foetuses in the bellies of your mothers. So do not flaunt your piety: He knows best those who are Godwary.\n",
        "TRANSLATION_12": "Those who avoid great sins and shameful deeds, only (falling into) small faults,- verily thy Lord is ample in forgiveness. He knows you well when He brings you out of the earth, And when ye are hidden in your mothers' wombs. Therefore justify not yourselves: He knows best who it is that guards against evil.\n",
        "TRANSLATION_13": "Those who avoid great sins (see the Quran, Verses: 6:152, 153) and Al-Fawahish (illegal sexual intercourse, etc.) except the small faults, verily, your Lord is of vast forgiveness. He knows you well when He created you from the earth (Adam), and when you were fetuses in your mothers' wombs. So ascribe not purity to yourselves. He knows best him who fears Allah and keep his duty to Him [i.e. those who are Al-Muttaqun (pious - see V. 2:2)].\n",
        "TRANSLATION_14": "those who avoid the major sin and indecencies except the small sins, indeed your Lord is of immense forgiveness and He is more knowledgeable of you when He created you from the earth and when you were still unborn in your mothers' wombs. Do not praise yourself. Allah knows the cautious.\n",
        "TRANSLATION_15": "Those who avoid gross sins and indecencies—except for minor lapses—your Lord is of Vast Forgiveness. He knows you well, ever since He created you from the earth, and ever since you were embryos in your mothers’ wombs. So do not acclaim your own virtue; He is fully aware of the righteous.\n",
        "TRANSLATION_16": "Those who avoid the major sins and immoralities, only [committing] slight ones. Indeed, your Lord is vast in forgiveness. He was most knowing of you when He produced you from the earth and when you were fetuses in the wombs of your mothers. So do not claim yourselves to be pure; He is most knowing of who fears Him.\n",
        "TRANSLATION_17": "[53:32] Those who avoid grave sins and abominations, excepting lesser offences, that is, minor sins, such as a look, a kiss or a touch (this constitutes a discontinuous exception, in other words the meaning is: but lesser offences are forgiven by the avoidance of grave sins). Truly your Lord is of vast forgiveness, for such [lesser sins] and for accepting repentance. The following was revealed regarding those who used to say, ‘[What of] our prayers, our fasting, and our pilgrimage!’. He knows you best [from the time] when He produced you from the earth, that is to say, [when] He created your father Adam from dust, and when you were hidden [fetuses] (ajinna is the plural of janīn) in the bellies of your mothers. So do not claim purity for yourselves, do not praise yourselves, that is, in admiration; but [if it is done] in recognition of [God’s] grace, then that is fine. He knows best those who are God-fearing.\n",
        "TRANSLATION_18": "Allah then showed their works in the life of the world, saying: (Those who avoid enormities of sin) i.e. idolatry and the major sins (and abominations) adultery and transgressions, (save the unwilled offences) except a furtive look, a taunt, a censure which they then blame themselves for committing and repent of doing; it is also said that this means: except marrying ((for them) lo! thy Lord is of vast mercy) towards he who repents of major and minor sins. (He is best aware of you) than your own selves (when He created you from the earth) He created you from Adam and Adam is from dust and dust is from the earth, (and when ye were) small (hidden in the bellies of your mothers) Allah knew in these circumstances what will ensue from you. (Therefore ascribe not purity unto yourselves) do not absolve yourselves from committing sins. (He is best aware of him who wardeth off (evil)) transgression and does good.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "53:32",
            "42:37",
            "17:25",
            "3:133",
            "11:108",
            "10:40",
            "3:35",
            "6:38",
            "67:12",
            "6:117"
        ],
        "BIBLE": [
            "torah:leviticus:20:25",
            "writings:i%20chronicles:10:4",
            "prophets:jeremiah:8:12",
            "torah:leviticus:4:35",
            "prophets:ezekiel:35:11",
            "prophets:jeremiah:6:15",
            "prophets:isaiah:63:7",
            "writings:ii%20chronicles:30:5",
            "writings:ezra:10:3",
            "writings:ii%20chronicles:5:13"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:3:4",
            "Sefer%20Yetzirah:3:3"
        ]
    }
}