{
    "VERSE": "53:48",
    "ARABIC": "وَأَنَّهُۥ هُوَ أَغْنَىٰ وَأَقْنَىٰ",
    "ENGLISH": {
        "TRANSLATION_0": "that it is He Who enriches and Who satisfies;",
        "TRANSLATION_1": "That it is He who makes you rich and contented;\n",
        "TRANSLATION_2": "that He it is Who bestowed wealth and riches,\n",
        "TRANSLATION_3": "It is He who grants people temporary and durable wealth.\n",
        "TRANSLATION_4": "And that it is He Who has given wealth and contentment?\n",
        "TRANSLATION_5": "And that it is He Who Aghna and Aqna.\n",
        "TRANSLATION_6": "And that He it is Who enriches and gives to hold;\n",
        "TRANSLATION_7": "and that it is He who gives wealth and riches,\n",
        "TRANSLATION_8": "And that He it is Who enricheth and contenteth;\n",
        "TRANSLATION_9": "that it is He who gives wealth and possessions;\n",
        "TRANSLATION_10": "And that it is He Who enricheth and preserveth property.\n",
        "TRANSLATION_11": "that it is He who enriches and grants possessions,\n",
        "TRANSLATION_12": "That it is He Who giveth wealth and satisfaction;\n",
        "TRANSLATION_13": "And that it is He (Allah) Who gives much or a little (or gives wealth and contentment),\n",
        "TRANSLATION_14": "and that it is He who gives riches and causes to hoard,\n",
        "TRANSLATION_15": "And that it is He who enriches and impoverishes.\n",
        "TRANSLATION_16": "And that it is He who enriches and suffices\n",
        "TRANSLATION_17": "[53:48] and that it is He Who enriches, people by [granting them] sufficient wealth, and grants possessions, [He Who] gives that wealth that is enjoyed as property,\n",
        "TRANSLATION_18": "(And that He it is Who enricheth) He made Himself independent of the need for created beings (and contenteth) and He made His slaves needy for Him; it is also said that this means: He made some rich with gold and silver and others content with the possession of camels, bovines and sheep.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "53:48",
            "53:43",
            "53:44",
            "75:28",
            "74:18",
            "85:13",
            "53:40",
            "80:36",
            "25:66",
            "69:51"
        ],
        "BIBLE": [
            "prophets:ii%20samuel:22:36",
            "torah:leviticus:17:11",
            "torah:leviticus:25:46",
            "torah:leviticus:10:17",
            "torah:exodus:36:6",
            "torah:numbers:8:19",
            "writings:esther:4:8",
            "torah:genesis:21:18",
            "writings:ii%20chronicles:20:11",
            "writings:job:11:3"
        ]
    }
}