{
    "VERSE": "53:52",
    "ARABIC": "وَقَوْمَ نُوحٍ مِّن قَبْلُ إِنَّهُمْ كَانُوا۟ هُمْ أَظْلَمَ وَأَطْغَىٰ",
    "ENGLISH": {
        "TRANSLATION_0": "and the people of Nuh before - they were most unjust and exorbitant -",
        "TRANSLATION_1": "Like the people of Noah before them, who were surely oppressors and rebellious;\n",
        "TRANSLATION_2": "and that He it is Who destroyed the people of Noah before for they were much given to iniquity and transgression.\n",
        "TRANSLATION_3": "and the people of Noah; they were the most unjust and rebellious people.\n",
        "TRANSLATION_4": "And before them, the people of Nooh? Indeed they were more unjust and more rebellious than these!\n",
        "TRANSLATION_5": "And the people of Nuh aforetime. Verily, they were more unjust and more rebellious and transgressing.\n",
        "TRANSLATION_6": "And the people of Nuh before; surely they were most unjust and inordinate;\n",
        "TRANSLATION_7": "and the people of Noah before -- certainly they did exceeding evil, and were insolent\n",
        "TRANSLATION_8": "And the folk of Noah aforetime, Lo! they were more unjust and more rebellious;\n",
        "TRANSLATION_9": "and before them the people of Noah who were even more unjust and insolent;\n",
        "TRANSLATION_10": "And also the people of Nuh aforetime. Verily they were even greater wrong-doers and more contumacious.\n",
        "TRANSLATION_11": "and the people of Noah before that; indeed they were more unjust and rebellious;\n",
        "TRANSLATION_12": "And before them, the people of Noah, for that they were (all) most unjust and most insolent transgressors,\n",
        "TRANSLATION_13": "And the people of Nuh (Noah) aforetime, verily, they were more unjust and more rebellious and transgressing [in disobeying Allah and His Messenger Nuh (Noah)].\n",
        "TRANSLATION_14": "and before them the nation of Noah, they exceeded in evil and were insolent.\n",
        "TRANSLATION_15": "And the people of Noah before that; for they were most unjust and most oppressive.\n",
        "TRANSLATION_16": "And the people of Noah before. Indeed, it was they who were [even] more unjust and oppressing.\n",
        "TRANSLATION_17": "[53:52] and the people of Noah before that, that is to say, before ‘Ād and Thamūd, We [also] destroyed them; indeed they were more unjust and more insolent, than ‘Ād and Thamūd, because of the long time that Noah remained among them: and he remained among them a thousand-less-fifty years [Q. 29:14], for they, despite their disbelief in him, would [still] harm him and assault him;\n",
        "TRANSLATION_18": "(And the folk of Noah) and He also destroyed the folk of Noah (aforetime) before the folk of Salih, (lo! They) i.e. the folk of Noah (were more unjust) more intense in their disbelief (and more rebellious) in their transgression and sinning;\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "53:52",
            "51:46",
            "44:37",
            "5:102",
            "54:9",
            "71:1",
            "51:32",
            "22:42",
            "11:49",
            "50:12"
        ],
        "BIBLE": [
            "torah:deuteronomy:2:12",
            "prophets:i%20kings:3:9",
            "writings:daniel:7:14",
            "writings:psalms:78:62",
            "writings:job:15:19",
            "writings:ezra:9:13",
            "writings:psalms:111:6",
            "writings:ezra:3:11",
            "writings:ii%20chronicles:33:10",
            "writings:psalms:44:12"
        ]
    }
}