{
    "VERSE": "53:55",
    "ARABIC": "فَبِأَىِّ ءَالَآءِ رَبِّكَ تَتَمَارَىٰ",
    "ENGLISH": {
        "TRANSLATION_0": "Which one of your Lord's blessings do you then dispute?",
        "TRANSLATION_1": "How many favours of your Lord will you then deny?\n",
        "TRANSLATION_2": "So, which of your Lord's bounties will you doubt?”\n",
        "TRANSLATION_3": "About which of the bounties of your Lord can they persistently dispute?\n",
        "TRANSLATION_4": "So O listener! Which favour of your Lord will you doubt?\n",
        "TRANSLATION_5": "Then which of the graces of your Lord will you doubt\n",
        "TRANSLATION_6": "Which of your Lord's benefits will you then dispute about?\n",
        "TRANSLATION_7": "Then which of thy Lord's bounties disputest thou?\n",
        "TRANSLATION_8": "Concerning which then, of the bounties of thy Lord, canst thou dispute?\n",
        "TRANSLATION_9": "On which then of your Lord's signs do you cast doubt?\n",
        "TRANSLATION_10": "Which then of thy Lord's benefits wilt thou doubt?\n",
        "TRANSLATION_11": "Then which of the bounties of your Lord will you dispute?\n",
        "TRANSLATION_12": "Then which of the gifts of thy Lord, (O man,) wilt thou dispute about?\n",
        "TRANSLATION_13": "Then which of the Graces of your Lord (O man!) will you doubt.\n",
        "TRANSLATION_14": "So which then of your Lord's favors do you dispute?\n",
        "TRANSLATION_15": "So which of your Lord's marvels can you deny?\n",
        "TRANSLATION_16": "Then which of the favors of your Lord do you doubt?\n",
        "TRANSLATION_17": "[53:55] Then which of the bounties of your Lord, [which of] His graces, [graces] which indicate His Oneness and power, do you dispute?, do you have doubt about, O man, or deny?\n",
        "TRANSLATION_18": "(Concerning which then, of the bounties of thy Lord) which of the blessings of your Lord, man-this refers to all human beings except Muhammad (pbuh)-(canst thou dispute) can you deny that it is not from your Lord?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "53:55",
            "55:16",
            "55:21",
            "55:38",
            "55:55",
            "55:53",
            "55:51",
            "55:23",
            "55:47",
            "55:73"
        ],
        "BIBLE": [
            "writings:proverbs:3:4",
            "writings:proverbs:19:6",
            "writings:psalms:44:24",
            "writings:daniel:6:13",
            "prophets:zechariah:3:8",
            "prophets:jeremiah:51:62",
            "prophets:judges:6:17",
            "writings:proverbs:29:26",
            "writings:psalms:36:7",
            "writings:psalms:94:12"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:3:5",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:5:4"
        ]
    }
}