{
    "VERSE": "53:62",
    "ARABIC": "فَٱسْجُدُوا۟ لِلَّهِ وَٱعْبُدُوا۟",
    "ENGLISH": {
        "TRANSLATION_0": "Prostrate before Allah and worship Him!",
        "TRANSLATION_1": "Bow instead in adoration before God and worship Him.\n",
        "TRANSLATION_2": "Prostrate yourselves before Allah, and serve Him.\n",
        "TRANSLATION_3": "So prostrate yourselves before God and worship him.\n",
        "TRANSLATION_4": "Therefore prostrate for Allah, and worship Him. (Command of Prostration # 12)\n",
        "TRANSLATION_5": "So fall you down in prostration to Allah and worship Him.\n",
        "TRANSLATION_6": "So make obeisance to Allah and serve (Him).\n",
        "TRANSLATION_7": "So bow yourselves before God, and serve Him!\n",
        "TRANSLATION_8": "Rather prostrate yourselves before Allah and serve Him.\n",
        "TRANSLATION_9": "Prostrate yourselves before God, and worship Him alone!\n",
        "TRANSLATION_10": "So prostrate yourselves before Allah and worship.\n",
        "TRANSLATION_11": "So prostrate yourselves to Allah and worship Him!\n",
        "TRANSLATION_12": "But fall ye down in prostration to Allah, and adore (Him)!\n",
        "TRANSLATION_13": "So fall you down in prostration to Allah, and worship Him (Alone).\n",
        "TRANSLATION_14": "Rather, prostrate to Allah and worship Him.\n",
        "TRANSLATION_15": "So bow down to God, and worship!\n",
        "TRANSLATION_16": "So prostrate to Allah and worship [Him].\n",
        "TRANSLATION_17": "[53:62] So prostrate to God, Who created you, and worship Him!, and do not prostrate to idols, nor worship them. Meccan, except for verse 45, which is Medinese; it consists of 55 verses.\n",
        "TRANSLATION_18": "(Rather prostrate yourselves before Allah) rather submit to Him through declaring His divine Oneness and also by repenting (and serve Him) and testify that there is only one God Who has no partner, solely for Allah's sake, for the Hour is nigh'. And of the surah in which the Moon is mentioned, which is all Meccan and consists of 55 verses, 342 words and 1,403 letters: 626 Surah 54: the Moon (al-Qamar) And of the surah in which the Moon is mentioned, which is all Meccan and consists of 55 verses, 342 words and 1,403 letters:\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "53:62",
            "26:131",
            "26:108",
            "26:110",
            "26:126",
            "26:144",
            "26:179",
            "26:150",
            "26:163",
            "16:19"
        ],
        "BIBLE": [
            "prophets:joshua:23:7",
            "writings:proverbs:11:5",
            "prophets:jeremiah:27:7",
            "writings:ezra:10:11",
            "torah:exodus:23:33",
            "torah:leviticus:19:4",
            "torah:exodus:30:37",
            "writings:psalms:71:12",
            "torah:leviticus:25:39",
            "torah:deuteronomy:20:11"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:3:7",
            "Sefer%20Yetzirah:3:5",
            "Sefer%20Yetzirah:1:9"
        ]
    }
}