{
    "VERSE": "109:6",
    "ARABIC": "لَكُمْ دِينُكُمْ وَلِىَ دِينِ",
    "ENGLISH": {
        "TRANSLATION_0": "You have your deen and I have my deen.'",
        "TRANSLATION_1": "To you your way, to me my way\n",
        "TRANSLATION_2": "To you is your religion, and to me, my religion.\n",
        "TRANSLATION_3": "You follow your religion and I follow mine.\n",
        "TRANSLATION_4": "For you is your religion, and for me is mine.\n",
        "TRANSLATION_5": "To you be your religion, and to me my religion.\"\n",
        "TRANSLATION_6": "You shall have your religion and I shall have my religion.\n",
        "TRANSLATION_7": "To you your religion, and to me my religion!'\n",
        "TRANSLATION_8": "Unto you your religion, and unto me my religion.\n",
        "TRANSLATION_9": "You have your religion and I have mine.\"\n",
        "TRANSLATION_10": "Yours shall be your requital, and mine shall be my requital.\n",
        "TRANSLATION_11": "To you your religion, and to me my religion.’\n",
        "TRANSLATION_12": "To you be your Way, and to me mine.\n",
        "TRANSLATION_13": "To you be your religion, and to me my religion (Islamic Monotheism).\"\n",
        "TRANSLATION_14": "To you your religion, and to me my Religion'\n",
        "TRANSLATION_15": "You have your way, and I have my way.”\n",
        "TRANSLATION_16": "For you is your religion, and for me is my religion.\"\n",
        "TRANSLATION_17": "[109:6] You have your religion, idolatry, and I have a religion’, Islam: this was [revealed] before he was commanded to wage war [against the idolaters] (all seven Qur’ānic readers omit the yā’ of the genitive possessive construction [in wa-liya dīni] whether with a pause or without; Ya‘qūb, however, retains it in both cases).\n",
        "TRANSLATION_18": "(Unto you your religion) of disbelief and ascribing partners to Allah, (and unto me my religion) Islam and faith in Allah. The verses of fighting then abrogated this and the Prophet (pbuh) did fight them' And of the surah in which Succour is mentioned which is all Meccan and consists of 3 verses, 23 words and 77 letters: Surah 110: Succour (al-Nasr) And of the surah in which Succour is mentioned which is all Meccan and consists of 3 verses, 23 words and 77 letters:\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "109:6",
            "39:14",
            "40:14",
            "26:82",
            "82:9",
            "74:46",
            "51:6",
            "74:14",
            "70:26",
            "39:11"
        ],
        "BIBLE": [
            "prophets:ii%20kings:6:19",
            "writings:job:34:27",
            "torah:exodus:21:23",
            "torah:deuteronomy:16:20",
            "writings:job:16:22",
            "prophets:i%20samuel:17:14",
            "writings:psalms:94:15",
            "writings:proverbs:10:9",
            "prophets:ezekiel:14:23",
            "writings:proverbs:15:9"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:3:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:3:1",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:12",
            "Sefer%20Yetzirah:1:13"
        ]
    }
}