{
    "VERSE": "89:13",
    "ARABIC": "فَصَبَّ عَلَيْهِمْ رَبُّكَ سَوْطَ عَذَابٍ",
    "ENGLISH": {
        "TRANSLATION_0": "So your Lord unleashed on them a scourging punishment;",
        "TRANSLATION_1": "So your Lord poured a scourge of punishment over them.\n",
        "TRANSLATION_2": "Then their Lord unloosed upon them the lash of chastisement.\n",
        "TRANSLATION_3": "Thus, your Lord afflicted them with torment;\n",
        "TRANSLATION_4": "Therefore your Lord struck them hard with the means of punishment.\n",
        "TRANSLATION_5": "So, your Lord poured on them different kinds of severe torment.\n",
        "TRANSLATION_6": "Therefore your Lord let down upon them a portion of the chastisement.\n",
        "TRANSLATION_7": "Thy Lord unloosed on them a scourge of chastisement;\n",
        "TRANSLATION_8": "Therefore thy Lord poured on them the disaster of His punishment.\n",
        "TRANSLATION_9": "so your Lord unleashed on them the scourge of punishment:\n",
        "TRANSLATION_10": "Wherefore thy Lord poured on them the scourge of His torment.\n",
        "TRANSLATION_11": "so your Lord poured on them lashes of punishment.\n",
        "TRANSLATION_12": "Therefore did thy Lord pour on them a scourge of diverse chastisements:\n",
        "TRANSLATION_13": "So your Lord poured on them different kinds of severe torment.\n",
        "TRANSLATION_14": "(Therefore) your Lord let loose upon them a scourge of punishment;\n",
        "TRANSLATION_15": "So your Lord poured down upon them a scourge of punishment.\n",
        "TRANSLATION_16": "So your Lord poured upon them a scourge of punishment.\n",
        "TRANSLATION_17": "[89:13] So your Lord poured on them a scourge of chastisement.\n",
        "TRANSLATION_18": "(Therefore thy Lord poured on them the disaster of His punishment) your Lord sent on them a severe punishment.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "89:13",
            "70:27",
            "52:7",
            "44:12",
            "74:7",
            "79:19",
            "94:8",
            "74:3",
            "29:59",
            "16:42"
        ],
        "BIBLE": [
            "prophets:jeremiah:13:25",
            "prophets:isaiah:26:16",
            "writings:proverbs:6:1",
            "writings:lamentations:3:24",
            "prophets:ii%20samuel:12:15",
            "writings:lamentations:4:11",
            "prophets:i%20samuel:26:8",
            "writings:psalms:102:1",
            "prophets:i%20samuel:5:9",
            "prophets:jeremiah:42:18"
        ]
    }
}