{
    "VERSE": "89:15",
    "ARABIC": "فَأَمَّا ٱلْإِنسَٰنُ إِذَا مَا ٱبْتَلَىٰهُ رَبُّهُۥ فَأَكْرَمَهُۥ وَنَعَّمَهُۥ فَيَقُولُ رَبِّىٓ أَكْرَمَنِ",
    "ENGLISH": {
        "TRANSLATION_0": "As for man, when his Lord tests him by honouring him and favouring him, he says, 'My Lord has honoured me!'",
        "TRANSLATION_1": "As for man, whenever his Lord tries him and then is gracious and provides good things for him, he says: \"My Lord has been gracious to me.\"\n",
        "TRANSLATION_2": "As for man, when his Lord tests him by exalting him and bestowing His bounties upon him, he says: “My Lord has exalted me.”\n",
        "TRANSLATION_3": "As for the human being, when his Lord tests him, honors him, and grants him bounty, he says, \"God has honored me\".\n",
        "TRANSLATION_4": "So man, whenever his Lord tests him by giving him honour and favours – thereupon he says, “My Lord has honoured me.”\n",
        "TRANSLATION_5": "As for man, when his Lord tries him by giving him honor and bounties, then he says: \"My Lord has honored me.\"\n",
        "TRANSLATION_6": "And as for man, when his Lord tries him, then treats him with honor and makes him lead an easy life, he says: My Lord honors me.\n",
        "TRANSLATION_7": "As for man, whenever his Lord tries him, and honours him, and blesses him, then he says, 'My Lord has honoured me.'\n",
        "TRANSLATION_8": "As for man, whenever his Lord trieth him by honouring him, and is gracious unto him, he saith: My Lord honoureth me.\n",
        "TRANSLATION_9": "As for man, when his Lord tests him, through honour and blessings, he says, \"My Lord has honoured me,\"\n",
        "TRANSLATION_10": "As for man - when his Lord proveth him and so honoureth him and is bounteous Unto him, then he saith: 'my Lord hath honoured me,\n",
        "TRANSLATION_11": "As for man, whenever his Lord tests him, and grants him honour, and blesses him, he says, ‘My Lord has honoured me.’\n",
        "TRANSLATION_12": "Now, as for man, when his Lord trieth him, giving him honour and gifts, then saith he, (puffed up), \"My Lord hath honoured me.\"\n",
        "TRANSLATION_13": "As for man, when his Lord tries him by giving him honour and gifts, then he says (puffed up): \"My Lord has honoured me.\"\n",
        "TRANSLATION_14": "As for man, when his Lord tests him by honoring him and favoring him, he says: 'My Lord, has honored me'\n",
        "TRANSLATION_15": "As for man, whenever his Lord tests him, and honors him, and prospers him, he says, “My Lord has honored me.”\n",
        "TRANSLATION_16": "And as for man, when his Lord tries him and [thus] is generous to him and favors him, he says, \"My Lord has honored me.\"\n",
        "TRANSLATION_17": "[89:15] And as for man, the disbeliever, whenever his Lord tests him and honours him, with wealth and other things, and is gracious to him, he says, ‘My Lord has honoured me’.\n",
        "TRANSLATION_18": "(As for man) the disbelieving man, in reference here to Ubayy Ibn Khalaf; and it is also said: Umayyah Ibn Khalaf, (whenever his Lord trieth him) whenever his Lord tests him with wealth, richness or means of living (by honouring him) by giving him abundant wealth, (and is gracious unto him) and expands for him his means of living, (he saith: My Lord honoureth me) by giving me wealth and means of living.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "89:15",
            "89:16",
            "68:50",
            "80:17",
            "99:3",
            "75:13",
            "84:6",
            "54:10",
            "36:27",
            "74:3"
        ],
        "BIBLE": [
            "torah:genesis:2:18",
            "writings:ii%20chronicles:14:6",
            "torah:deuteronomy:16:17",
            "writings:ecclesiastes:8:15",
            "prophets:isaiah:38:16",
            "torah:leviticus:17:11",
            "writings:ii%20chronicles:19:6",
            "prophets:hosea:2:14",
            "prophets:ii%20kings:7:19",
            "prophets:i%20kings:19:2"
        ]
    }
}