{
    "VERSE": "89:16",
    "ARABIC": "وَأَمَّآ إِذَا مَا ٱبْتَلَىٰهُ فَقَدَرَ عَلَيْهِ رِزْقَهُۥ فَيَقُولُ رَبِّىٓ أَهَٰنَنِ",
    "ENGLISH": {
        "TRANSLATION_0": "But then when He tests him by restricting his provision, he says, 'My Lord has humiliated me!'",
        "TRANSLATION_1": "But when He tries him by restraining his means, he says: \"My Lord despises me.\"\n",
        "TRANSLATION_2": "But when He tests him by straitening his sustenance, he says: “My Lord has humiliated me.”\n",
        "TRANSLATION_3": "However, when his Lord tests him by a measured amount of sustenance, he says, \"God has disgraced me\".\n",
        "TRANSLATION_4": "And if He tests him and restricts his livelihood – thereupon he says, “My Lord has degraded me!”\n",
        "TRANSLATION_5": "But when He tries him by straitening his means of life, he says: \"My Lord has humiliated me!\"\n",
        "TRANSLATION_6": "But when He tries him (differently), then straitens to him his means of subsistence, he says: My Lord has disgraced me.\n",
        "TRANSLATION_7": "But when he tries him and stints for him his provision, then he says, 'My Lord has despised me.'\n",
        "TRANSLATION_8": "But whenever He trieth him by straitening his means of life, he saith: My Lord despiseth me.\n",
        "TRANSLATION_9": "but when He tests him by straitening his means of livelihood, he says, \"My Lord has disgraced me.\"\n",
        "TRANSLATION_10": "And when He proveth him, and so stinteth Unto him his provision, he saith: 'my Lord hath despised me.\n",
        "TRANSLATION_11": "But when He tests him and tightens for him his provision, he says, ‘My Lord has humiliated me.’\n",
        "TRANSLATION_12": "But when He trieth him, restricting his subsistence for him, then saith he (in despair), \"My Lord hath humiliated me!\"\n",
        "TRANSLATION_13": "But when He tries him, by straitening his means of life, he says: \"My Lord has humiliated me!\"\n",
        "TRANSLATION_14": "But when He tests him by restricting his provision, he says: 'My Lord has humiliated me'\n",
        "TRANSLATION_15": "But whenever He tests him, and restricts his livelihood for him, he says, “My Lord has insulted me.”\n",
        "TRANSLATION_16": "But when He tries him and restricts his provision, he says, \"My Lord has humiliated me.\"\n",
        "TRANSLATION_17": "[89:16] But when he tests him and restricts his provision for him, he says, ‘My Lord has humiliated me’.\n",
        "TRANSLATION_18": "(But whenever He trieth him) whenever He tests him with poverty (by straitening his means of life) by tightening his means of living, (he saith: My Lord despiseth me) by giving me poverty and tightening my means of living.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "89:16",
            "89:15",
            "20:122",
            "74:7",
            "79:19",
            "94:8",
            "51:57",
            "74:3",
            "29:59",
            "16:42"
        ],
        "BIBLE": [
            "prophets:i%20kings:3:11",
            "torah:exodus:4:19",
            "prophets:i%20kings:20:42",
            "torah:deuteronomy:6:20",
            "prophets:jeremiah:11:21",
            "writings:job:2:6",
            "writings:ii%20chronicles:18:13",
            "prophets:joshua:9:24",
            "prophets:i%20kings:2:23",
            "torah:exodus:6:2"
        ]
    }
}