{
    "VERSE": "89:25",
    "ARABIC": "فَيَوْمَئِذٍ لَّا يُعَذِّبُ عَذَابَهُۥٓ أَحَدٌ",
    "ENGLISH": {
        "TRANSLATION_0": "That Day no one will punish as He punishes",
        "TRANSLATION_1": "None can punish as He will punish on that day,\n",
        "TRANSLATION_2": "Then on that Day Allah will chastise as none other can chastise;\n",
        "TRANSLATION_3": "On that day the punishment of God and His detention will be unparalleled.\n",
        "TRANSLATION_4": "So on that day, no one punishes like He does!\n",
        "TRANSLATION_5": "So on that Day none will punish as He will punish.\n",
        "TRANSLATION_6": "But on that day shall no one chastise with (anything like) His chastisement,\n",
        "TRANSLATION_7": "Upon that day none shall chastise as He chastises,\n",
        "TRANSLATION_8": "None punisheth as He will punish on that day!\n",
        "TRANSLATION_9": "On that Day no one will punish as He punishes,\n",
        "TRANSLATION_10": "Wherefore on that Day none shall torment with His torment.\n",
        "TRANSLATION_11": "On that day none shall punish as He punishes,\n",
        "TRANSLATION_12": "For, that Day, His Chastisement will be such as none (else) can inflict,\n",
        "TRANSLATION_13": "So on that Day, none will punish as He will punish.\n",
        "TRANSLATION_14": "But on that Day none will punish as He (Allah) will punish,\n",
        "TRANSLATION_15": "On that Day, none will punish as He punishes.\n",
        "TRANSLATION_16": "So on that Day, none will punish [as severely] as His punishment,\n",
        "TRANSLATION_17": "[89:25] Then on that day none shall mete out (read yu‘adhdhibu) His, God’s, chastisement, that is to say, He shall not delegate it to any other;\n",
        "TRANSLATION_18": "(None punisheth as He will punish on that day) on the Day of Judgement!\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "89:25",
            "5:115",
            "72:26",
            "16:85",
            "69:47",
            "78:30",
            "90:7",
            "37:33",
            "43:50",
            "89:26"
        ],
        "BIBLE": [
            "writings:psalms:44:9",
            "torah:deuteronomy:31:17",
            "torah:deuteronomy:29:14",
            "writings:psalms:73:14",
            "prophets:ezekiel:39:8",
            "writings:psalms:30:13",
            "prophets:ii%20samuel:3:35",
            "torah:numbers:29:7",
            "writings:ecclesiastes:8:13",
            "torah:deuteronomy:31:18"
        ]
    }
}