{
    "VERSE": "89:6",
    "ARABIC": "أَلَمْ تَرَ كَيْفَ فَعَلَ رَبُّكَ بِعَادٍ",
    "ENGLISH": {
        "TRANSLATION_0": "Do you not see what your Lord did with 'Ad -",
        "TRANSLATION_1": "Have you not seen what your Lord did to the 'Ad\n",
        "TRANSLATION_2": "Have you not seen how your Lord dealt with Ad\n",
        "TRANSLATION_3": "(Muhammad), consider how your Lord dealt with the tribe of Ad,\n",
        "TRANSLATION_4": "Did you not see how did your Lord deal with (the tribe of) Aad?\n",
        "TRANSLATION_5": "Saw you not how your Lord dealt with `Ad\n",
        "TRANSLATION_6": "Have you not considered how your Lord dealt with Ad,\n",
        "TRANSLATION_7": "Hast thou not seen how thy Lord did with Ad,\n",
        "TRANSLATION_8": "Dost thou not consider how thy Lord dealt with (the tribe of) A'ad,\n",
        "TRANSLATION_9": "Have you not heard of how your Lord dealt with the tribe of 'Ad,\n",
        "TRANSLATION_10": "Bethinkest thou not in what wise thy Lord did with the 'A'ad:\n",
        "TRANSLATION_11": "Have you not regarded how your Lord dealt with [the people of] ‘Ad,\n",
        "TRANSLATION_12": "Seest thou not how thy Lord dealt with the 'Ad (people),-\n",
        "TRANSLATION_13": "Did you (O Muhammad (Peace be upon him)) not see (thought) how your Lord dealt with 'Ad (people)?\n",
        "TRANSLATION_14": "Have you not heard how your Lord dealt with Aad?\n",
        "TRANSLATION_15": "Have you not seen how your Lord dealt with Aad?\n",
        "TRANSLATION_16": "Have you not considered how your Lord dealt with 'Aad -\n",
        "TRANSLATION_17": "[89:6] Have you not seen, [do you not] know O Muhammad (s), how your Lord dealt with ‘Ād,\n",
        "TRANSLATION_18": "Dost thou not consider) have you not been informed, Muhammad, in the Qur'an (how thy Lord dealt with (the tribe of) 'Aad) the people of Hud, how Allah, Exalted is He, destroyed them when they disbelieved,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "89:6",
            "105:1",
            "54:18",
            "18:68",
            "25:45",
            "99:5",
            "7:129",
            "79:16",
            "93:3",
            "68:36"
        ],
        "BIBLE": [
            "writings:psalms:35:22",
            "writings:lamentations:3:59",
            "torah:numbers:27:13",
            "writings:job:38:17",
            "torah:exodus:21:8",
            "torah:exodus:3:7",
            "torah:exodus:32:9",
            "torah:genesis:16:13",
            "writings:psalms:119:65",
            "prophets:i%20samuel:20:42"
        ]
    }
}