{
    "VERSE": "93:11",
    "ARABIC": "وَأَمَّا بِنِعْمَةِ رَبِّكَ فَحَدِّثْ",
    "ENGLISH": {
        "TRANSLATION_0": "And as for the blessing of your Lord, speak out!",
        "TRANSLATION_1": "And keep recounting the favours of your Lord.\n",
        "TRANSLATION_2": "and proclaim the bounty of your Lord.\n",
        "TRANSLATION_3": "and proclaim the bounties of your Lord.\n",
        "TRANSLATION_4": "And abundantly proclaim the favours of your Lord.\n",
        "TRANSLATION_5": "And proclaim the grace of your Lord.\n",
        "TRANSLATION_6": "And as for the favor of your Lord, do announce (it).\n",
        "TRANSLATION_7": "and as for thy Lord's blessing, declare it.\n",
        "TRANSLATION_8": "Therefor of the bounty of thy Lord be thy discourse.\n",
        "TRANSLATION_9": "but proclaim the blessings of your Lord.\n",
        "TRANSLATION_10": "And as to the favour of thine Lord discourse thou thereof.\n",
        "TRANSLATION_11": "and as for your Lord’s blessing, proclaim it!\n",
        "TRANSLATION_12": "But the bounty of the Lord - rehearse and proclaim!\n",
        "TRANSLATION_13": "And proclaim the Grace of your Lord (i.e. the Prophethood and all other Graces).\n",
        "TRANSLATION_14": "But tell of the favors of your Lord!\n",
        "TRANSLATION_15": "But proclaim the blessings of your Lord.\n",
        "TRANSLATION_16": "But as for the favor of your Lord, report [it].\n",
        "TRANSLATION_17": "[93:11] and as for your Lord’s grace, to you, by way of prophethood and otherwise, proclaim [it], make it known. The omission in certain instances of the [suffixed] pronoun referring to the Prophet (s) from the end of the verbs is intended to sustain the end-rhyme of the verses.\n",
        "TRANSLATION_18": "(Therefore of the bounty of thy Lord) through prophethood and Islam (be thy discourse) speak to people and let them know about it'. And of the surah in which \"Have We not caused your bosom to dilate\" is mentioned, which is all Meccan and consists of 8 verses, 27 words and 103 letters: Surah 94: Solace (al-Sharh) And of the surah in which \"Have We not caused your bosom to dilate\" is mentioned, which is all Meccan and consists of 8 verses, 27 words and 103 letters:\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "93:11",
            "52:29",
            "68:2",
            "108:2",
            "37:57",
            "74:7",
            "79:19",
            "94:8",
            "15:98",
            "74:3"
        ],
        "BIBLE": [
            "torah:deuteronomy:33:23",
            "prophets:isaiah:43:12",
            "writings:psalms:9:12",
            "torah:deuteronomy:28:2",
            "torah:exodus:33:17",
            "torah:deuteronomy:17:10",
            "prophets:isaiah:12:4",
            "prophets:isaiah:48:6",
            "writings:psalms:5:13",
            "writings:nehemiah:6:7"
        ]
    }
}