{
    "VERSE": "93:4",
    "ARABIC": "وَلَلْءَاخِرَةُ خَيْرٌ لَّكَ مِنَ ٱلْأُولَىٰ",
    "ENGLISH": {
        "TRANSLATION_0": "The Last will be better for you than the First.",
        "TRANSLATION_1": "What is to come is better for you than what has gone before;\n",
        "TRANSLATION_2": "Indeed what is to come will be better for you than what has gone by.\n",
        "TRANSLATION_3": "The reward in the next life will certainly be better for you than worldly gains.\n",
        "TRANSLATION_4": "And indeed the latter is better for you than the former.\n",
        "TRANSLATION_5": "And indeed the Hereafter is better for you than the present.\n",
        "TRANSLATION_6": "And surely what comes after is better for you than that which has gone before.\n",
        "TRANSLATION_7": "and the Last shall be better for thee than the First.\n",
        "TRANSLATION_8": "And verily the latter portion will be better for thee than the former,\n",
        "TRANSLATION_9": "and the Hereafter will indeed be better for you than the present life;\n",
        "TRANSLATION_10": "And the Hereafter is indeed better Unto thee than the life present.\n",
        "TRANSLATION_11": "and the Hereafter shall be better for you than the world.\n",
        "TRANSLATION_12": "And verily the Hereafter will be better for thee than the present.\n",
        "TRANSLATION_13": "And indeed the Hereafter is better for you than the present (life of this world).\n",
        "TRANSLATION_14": "The Last shall be better for you than the First.\n",
        "TRANSLATION_15": "The Hereafter is better for you than the First.\n",
        "TRANSLATION_16": "And the Hereafter is better for you than the first [life].\n",
        "TRANSLATION_17": "[93:4] And verily the Hereafter shall be better for you, by virtue of the honours awaiting you thereat, than the first [life], this world.\n",
        "TRANSLATION_18": "(And verily the latter portion will be better for thee than the former) He says: the reward of the Hereafter is better for you than the reward of the life of the world.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "93:4",
            "92:13",
            "53:25",
            "12:57",
            "56:49",
            "3:114",
            "5:114",
            "3:150",
            "87:17",
            "57:3"
        ],
        "BIBLE": [
            "prophets:hosea:6:3",
            "writings:ecclesiastes:1:11",
            "writings:psalms:63:4",
            "writings:ruth:2:3",
            "writings:psalms:121:8",
            "torah:genesis:7:15",
            "prophets:i%20kings:19:4",
            "prophets:ezekiel:23:30",
            "writings:ruth:4:15",
            "prophets:ii%20kings:2:9"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:4:8",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:3:7",
            "Sefer%20Yetzirah:3:5",
            "Sefer%20Yetzirah:2:4"
        ]
    }
}