{
    "VERSE": "93:5",
    "ARABIC": "وَلَسَوْفَ يُعْطِيكَ رَبُّكَ فَتَرْضَىٰٓ",
    "ENGLISH": {
        "TRANSLATION_0": "Your Lord will soon give to you and you will be satisfied.",
        "TRANSLATION_1": "For your Lord will certainly give you, and you will be content.\n",
        "TRANSLATION_2": "Verily your Lord will soon give you so amply that you will be well-pleased.\n",
        "TRANSLATION_3": "Your Lord will soon grant you sufficient favors to please you.\n",
        "TRANSLATION_4": "And indeed your Lord will soon give you so much that you will be pleased. (Allah seeks to please the Holy Prophet – peace and blessings be upon him.)\n",
        "TRANSLATION_5": "And verily, your Lord will give you so that you shall be well-pleased.\n",
        "TRANSLATION_6": "And soon will your Lord give you so that you shall be well pleased.\n",
        "TRANSLATION_7": "Thy Lord shall give thee, and thou shalt be satisfied.\n",
        "TRANSLATION_8": "And verily thy Lord will give unto thee so that thou wilt be content.\n",
        "TRANSLATION_9": "soon you will be gratified with what your Lord will give you.\n",
        "TRANSLATION_10": "And presently thy Lord shall give Unto thee so that thou shalt be be well-pleased.\n",
        "TRANSLATION_11": "Soon your Lord will give you [that with which] you will be pleased.\n",
        "TRANSLATION_12": "And soon will thy Guardian-Lord give thee (that wherewith) thou shalt be well-pleased.\n",
        "TRANSLATION_13": "And verily, your Lord will give you (all i.e. good) so that you shall be well-pleased.\n",
        "TRANSLATION_14": "Your Lord will give you, and you will be satisfied.\n",
        "TRANSLATION_15": "And your Lord will give you, and you will be satisfied.\n",
        "TRANSLATION_16": "And your Lord is going to give you, and you will be satisfied.\n",
        "TRANSLATION_17": "[93:5] And verily your Lord shall give you, in the Hereafter, of good things, a bounteous gift, and you shall be satisfied, with it — and so the Prophet (s) said, ‘In that case, I shall not be satisfied if a single person from among my community remains in the Fire’ (the response to the oath terminates here, with two affirmations and two negations).\n",
        "TRANSLATION_18": "(And verily thy Lord will give unto thee) in the Hereafter of intercession (so that thou wilt be content) until you are content.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "93:5",
            "74:3",
            "94:8",
            "74:7",
            "79:19",
            "108:2",
            "93:3",
            "68:50",
            "37:31",
            "20:122"
        ],
        "BIBLE": [
            "torah:genesis:26:29",
            "torah:numbers:10:32",
            "torah:deuteronomy:8:10",
            "torah:numbers:22:35",
            "torah:deuteronomy:28:2",
            "writings:ii%20chronicles:18:12",
            "torah:deuteronomy:33:23",
            "torah:genesis:15:15",
            "writings:psalms:54:8",
            "prophets:i%20kings:22:13"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:6:2"
        ]
    }
}