{
    "VERSE": "93:6",
    "ARABIC": "أَلَمْ يَجِدْكَ يَتِيمًا فَـَٔاوَىٰ",
    "ENGLISH": {
        "TRANSLATION_0": "Did He not find you orphaned and shelter you?",
        "TRANSLATION_1": "Did He not find you an orphan and take care of you?\n",
        "TRANSLATION_2": "Did He not find you an orphan and then gave you shelter?\n",
        "TRANSLATION_3": "Did He not find you as an orphan and give you shelter?\n",
        "TRANSLATION_4": "Did He not find you an orphan, so provided you shelter?\n",
        "TRANSLATION_5": "Did He not find you an orphan and gave you a refuge\n",
        "TRANSLATION_6": "Did He not find you an orphan and give you shelter?\n",
        "TRANSLATION_7": "Did He not find thee an orphan, and shelter thee?\n",
        "TRANSLATION_8": "Did He not find thee an orphan and protect (thee)?\n",
        "TRANSLATION_9": "Did He not find you orphaned and shelter you?\n",
        "TRANSLATION_10": "Found He not thee an orphan, so He sheltered thee?\n",
        "TRANSLATION_11": "Did He not find you an orphan, and shelter you?\n",
        "TRANSLATION_12": "Did He not find thee an orphan and give thee shelter (and care)?\n",
        "TRANSLATION_13": "Did He not find you (O Muhammad (Peace be upon him)) an orphan and gave you a refuge?\n",
        "TRANSLATION_14": "Did He not find you an orphan and give you shelter?\n",
        "TRANSLATION_15": "Did He not find you orphaned, and sheltered you?\n",
        "TRANSLATION_16": "Did He not find you an orphan and give [you] refuge?\n",
        "TRANSLATION_17": "[93:6] Did He not find you an orphan (an interrogative meant as an affirmative, in other words, He did [indeed] find you [an orphan]), having lost your father before you were born or [shortly] thereafter, and shelter you?, by having your uncle Abū Tālib embrace you [as part of his household].\n",
        "TRANSLATION_18": "Allah then mentioned His blessings upon the Prophet (pbuh) saying (Did He not find thee) O Muhammad (an orphan) without a father or mother (and protect (thee)) and joined you to your uncle Abu Talib and sufficed you your provision? The Prophet (pbuh) said: \"Yes, O Gabriel!\"\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "93:6",
            "107:2",
            "93:9",
            "89:17",
            "93:8",
            "93:7",
            "23:105",
            "90:15",
            "96:13",
            "90:8"
        ],
        "BIBLE": [
            "prophets:i%20kings:5:26",
            "prophets:malachi:2:5",
            "prophets:jeremiah:18:19",
            "writings:psalms:119:169",
            "writings:psalms:60:6",
            "writings:psalms:118:18",
            "torah:genesis:35:12",
            "torah:genesis:29:28",
            "writings:i%20chronicles:6:52",
            "torah:deuteronomy:3:15"
        ]
    }
}