{
    "VERSE": "16:1",
    "ARABIC": "بِسْمِ ٱللَّهِ ٱلرَّحْمَٰنِ ٱلرَّحِيمِ أَتَىٰٓ أَمْرُ ٱللَّهِ فَلَا تَسْتَعْجِلُوهُ سُبْحَٰنَهُۥ وَتَعَٰلَىٰ عَمَّا يُشْرِكُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Allah's command is coming, so do not try to hasten it. Glory be to Him! He is exalted above anything they associate with Him.",
        "TRANSLATION_1": "THE DECREE of GOD will surely come; so do not try to hasten it: Too glorious and high is He for what they associate with Him.\n",
        "TRANSLATION_2": "Allah's judgement has (all but) come; do not, then, call for its speedy advent. Holy is He, and far above their associating others with Him in His Divinity.\n",
        "TRANSLATION_3": "God's help will certainly support (the believers), so pagans do not (seek) to hasten it. God is too Glorious and Exalted to be considered equal to idols.\n",
        "TRANSLATION_4": "The command of Allah is arriving soon, therefore do not seek to hasten it; Purity and Supremacy are to Him, above all the partners (they ascribe).\n",
        "TRANSLATION_5": "The Event ordained by Allah has indeed come, so do not seek to hasten it. Glorified and Exalted be He above all that they associate as partners with Him.\n",
        "TRANSLATION_6": "Allah's commandment has come, therefore do not desire to hasten it; glory be to Him, and highly exalted be He above what they associate (with Him).\n",
        "TRANSLATION_7": "God's command comes; so seek not to hasten it. Glory be to Him! High be He exalted above that they associate with Him!\n",
        "TRANSLATION_8": "The commandment of Allah will come to pass, so seek not ye to hasten it. Glorified and Exalted be He above all that they associate (with Him).\n",
        "TRANSLATION_9": "The decree of God is at hand, so do not seek to hasten it. Holy is He, and exalted far above what they associate with Him.\n",
        "TRANSLATION_10": "The affair of Allah cometh, so seek not to hasten it. Hallowed be He and Exalted above that which they associate.\n",
        "TRANSLATION_11": "Allah’s edict is coming! So do not seek to hasten it. Immaculate is He and exalted above [having] any partners that they ascribe [to Him].\n",
        "TRANSLATION_12": "(Inevitable) cometh (to pass) the Command of Allah: seek ye not then to hasten it: Glory to Him, and far is He above having the partners they ascribe unto Him!\n",
        "TRANSLATION_13": "The Event (the Hour or the punishment of disbelievers and polytheists or the Islamic laws or commandments), ordained by Allah will come to pass, so seek not to hasten it. Glorified and Exalted be He above all that they associate as partners with Him.\n",
        "TRANSLATION_14": "The Command of Allah will surely come; do not seek to hasten it. Highly exalted is He above that they associate with Him.\n",
        "TRANSLATION_15": "The command of God has come, so do not rush it. Glory be to Him; exalted above what they associate.\n",
        "TRANSLATION_16": "The command of Allah is coming, so be not impatient for it. Exalted is He and high above what they associate with Him.\n",
        "TRANSLATION_17": "[16:1] When the idolaters found chastisement slow in coming, the following was revealed: God’s commandment has come, that is, the Hour [has come] ([this verb] atā is in the past tense because it means that [the event therein described] will come to pass) in other words, it [God’s commandment] is close at hand, so do not seek to hasten it, do not demand it before its [due] time, for it will come to pass without doubt. Glory be to Him — an affirmation of His transcendence — and exalted be He above what they associate, with Him, in the way of others.\n",
        "TRANSLATION_18": "And from his chain of transmitters on the authority of Ibn 'Abbas that he said: 'When the words of Allah (The reckoning draws near for mankind...) [21:1] and (The hour drew near...) [54:1], people waited whatever time Allah willed them to wait, but nothing happened. So they said: \"0 Muhammad! When will the torment which you promised us happen?\" As a response, Allah revealed: (The commandment of Allah will come to pass) the chastisement of Allah has come. The Prophet (pbuh) was sitting at that point and he suddenly stood, having no doubt in his mind that the chastisement had come. But immediately after that, Allah said: (so seek not ye to hasten it) i.e. the chastisement, at which the Prophet (pbuh) sat down. (Glorified) Allah exonerated Himself from having a son or partner (and Exalted be He) He is too elevated and absolves Himself (above all that they associate (with Him)) of idols.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "16:1",
            "37:159",
            "19:35",
            "16:57",
            "52:43",
            "30:17",
            "30:40",
            "28:68",
            "8:20",
            "18:69"
        ],
        "BIBLE": [
            "torah:exodus:33:22",
            "prophets:i%20samuel:10:5",
            "prophets:zechariah:12:9",
            "torah:deuteronomy:28:1",
            "prophets:zechariah:6:15",
            "prophets:jeremiah:5:19",
            "prophets:joshua:23:14",
            "torah:deuteronomy:11:13",
            "torah:deuteronomy:28:15",
            "prophets:isaiah:11:10"
        ]
    }
}