{
    "VERSE": "16:102",
    "ARABIC": "قُلْ نَزَّلَهُۥ رُوحُ ٱلْقُدُسِ مِن رَّبِّكَ بِٱلْحَقِّ لِيُثَبِّتَ ٱلَّذِينَ ءَامَنُوا۟ وَهُدًى وَبُشْرَىٰ لِلْمُسْلِمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Say: The Purest Ruh has brought it down from your Lord with truth, to make those who have iman firm, and as guidance and good news for the Muslims.'",
        "TRANSLATION_1": "You say: \"It has been sent by divine grace from your Lord with truth to strengthen those who believe, and as guidance and good news for those who have submitted (to God).\"\n",
        "TRANSLATION_2": "Tell them: \"It is the spirit of holiness that has brought it down, by stages, from your Lord so that it might bring firmness to those who believe, and guidance to the Right Way, and give glad tidings of felicity and success to those who submit to Allah.\"\n",
        "TRANSLATION_3": "(Muhammad), say, \"The Holy Spirit has brought the Quran from your Lord to you in all truth to strengthen the faith of the believers and to be a guide and glad news for the Muslims\".\n",
        "TRANSLATION_4": "Proclaim, “The Holy Spirit* has rightly brought it down from your Lord, to make the believers steadfast, and a guidance and glad tidings for the Muslims.” (* Angel Jibreel – peace and blessings be upon him.)\n",
        "TRANSLATION_5": "Say (O Muhammad); \"Ruh-ul-Qudus has brought it (the Qur'an) down from your Lord with truth.\" for the conviction of those who believe, and as a guide and good news for the Muslims.\n",
        "TRANSLATION_6": "Say: The Holy spirit has revealed it from your Lord with the truth, that it may establish those who believe and as a guidance and good news for those who submit.\n",
        "TRANSLATION_7": "Say: 'The Holy Spirit sent it down from thy Lord in truth, and to confirm those who believe, and to be a guidance and good tidings to those who surrender.'\n",
        "TRANSLATION_8": "Say: The holy Spirit hath delivered it from thy Lord with truth, that it may confirm (the faith of) those who believe, and as guidance and good tidings for those who have surrendered (to Allah).\n",
        "TRANSLATION_9": "Say, \"The Holy Spirit has brought it down as truth from your Lord, so that He may strengthen those who believe, and also as guidance and as good tidings for those who submit.\"\n",
        "TRANSLATION_10": "Say thou: the Holy Spirit hath brought it down from thy Lord with truth, that it may establish those who believe, and as a guidance and glad tidings unto the Muslims.\n",
        "TRANSLATION_11": "Say, the Holy Spirit has brought it down duly from your Lord to fortify those who have faith and as guidance and good news for the Muslims.\n",
        "TRANSLATION_12": "Say, the Holy Spirit has brought the revelation from thy Lord in Truth, in order to strengthen those who believe, and as a Guide and Glad Tidings to Muslims.\n",
        "TRANSLATION_13": "Say (O Muhammad SAW) Ruh-ul-Qudus [Jibrael (Gabriel)] has brought it (the Quran) down from your Lord with truth, that it may make firm and strengthen (the Faith of) those who believe and as a guidance and glad tidings to those who have submitted (to Allah as Muslims).\n",
        "TRANSLATION_14": "Say: 'The Holy Spirit (Gabriel) brought it down from your Lord in truth to confirm those who believe, and to give guidance and glad tidings to those who surrender'\n",
        "TRANSLATION_15": "Say, “The Holy Spirit has brought it down from your Lord, truthfully, in order to stabilize those who believe, and as guidance and good news for those who submit.”\n",
        "TRANSLATION_16": "Say, [O Muhammad], \"The Pure Spirit has brought it down from your Lord in truth to make firm those who believe and as guidance and good tidings to the Muslims.\"\n",
        "TRANSLATION_17": "[16:102] Say, to them: ‘The Holy Spirit, Gabriel, has revealed it from your Lord with truth (bi’l-haqq, this is semantically connected to nazzala, ‘he [Gabriel] has revealed [it]’) to confirm [the faith of] those who believe, by their believing in it [when it is revealed], and as guidance and good tidings for those who have submitted [to God]’.\n",
        "TRANSLATION_18": "(Say) to them, Muhammad: (The holy Spirit) the holy Gabriel (hath revealed it) i.e. the Qur'an (from thy Lord) Muhammad (with truth) with the abrogating and the abrogated, (that it may confirm (the faith of)) that it may gladden and set at rest the hearts of (those who believe) in Muhammad (pbuh) and in the Qur'an, (and as guidance) from error (and good tidings for those who have surrendered (to Allah)) that they will have Paradise.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "16:102",
            "27:2",
            "18:13",
            "31:5",
            "2:5",
            "47:2",
            "9:33",
            "61:9",
            "48:28",
            "47:3"
        ],
        "BIBLE": [
            "prophets:joshua:7:19",
            "prophets:ii%20kings:10:5",
            "writings:psalms:70:2",
            "torah:deuteronomy:7:2",
            "torah:exodus:33:19",
            "torah:deuteronomy:13:15",
            "prophets:jeremiah:49:16",
            "writings:ii%20chronicles:30:5",
            "prophets:isaiah:36:15",
            "prophets:ii%20kings:18:30"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:1:12",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:1:1"
        ]
    }
}