{
    "VERSE": "16:103",
    "ARABIC": "وَلَقَدْ نَعْلَمُ أَنَّهُمْ يَقُولُونَ إِنَّمَا يُعَلِّمُهُۥ بَشَرٌ لِّسَانُ ٱلَّذِى يُلْحِدُونَ إِلَيْهِ أَعْجَمِىٌّ وَهَٰذَا لِسَانٌ عَرَبِىٌّ مُّبِينٌ",
    "ENGLISH": {
        "TRANSLATION_0": "We know that they say, 'It is only a human being who is teaching him.' The language of him they allude to is a foreign one whereas this is in clear and lucid Arabic.",
        "TRANSLATION_1": "Yet We know what they say: \"It is only a man who instructs him.\" The speech of the man they imply is obscure while this is clear Arabic.\n",
        "TRANSLATION_2": "Surely We know well that they say about you: \"It is only a human being who teaches him,\" (notwithstanding) that he whom they maliciously hint at is of foreign tongue, while this (Qur'an) is plain Arabic speech.\n",
        "TRANSLATION_3": "We know that they say a mere mortal has taught it (the Quran) to him (Muhammad). The language of the person whom they think has taught it to him is not Arabic. This (the Quran) is in illustrious Arabic.\n",
        "TRANSLATION_4": "And indeed We know that they say, “This Qur’an is being taught by some other man”; the one they refer to speaks a foreign language, whereas this is clear Arabic!\n",
        "TRANSLATION_5": "And indeed We know that they (polytheists and pagans) say: \"It is only a human being who teaches him.\" The tongue of the man they refer to is foreign, while this (the Qur'an) is (in) a clear Arabic tongue.\n",
        "TRANSLATION_6": "And certainly We know that they say: Only a mortal teaches him. The tongue of him whom they reproach is barbarous, and this is clear Arabic tongue.\n",
        "TRANSLATION_7": "And We know very well that they say, 'Only a mortal is teaching him.' The speech of him at whom they hint is barbarous; and this is speech Arabic, manifest.\n",
        "TRANSLATION_8": "And We know well that they say: Only a man teacheth him. The speech of him at whom they falsely hint is outlandish, and this is clear Arabic speech.\n",
        "TRANSLATION_9": "Indeed, We know what they say, \"It is only a human being who imparts [all] this to him!\" But the tongue of him to whom they point is foreign, whereas this is plain Arabic speech.\n",
        "TRANSLATION_10": "And assuredly We know that they say: it is only a human being who teachech him. The speech of him unto whom they incline is foreign while this is Arabic speech plain.\n",
        "TRANSLATION_11": "We certainly know that they say, ‘It is only a human that instructs him.’ The language of him to whom they refer is non-Arabic, while this is a clear Arabic language.\n",
        "TRANSLATION_12": "We know indeed that they say, \"It is a man that teaches him.\" The tongue of him they wickedly point to is notably foreign, while this is Arabic, pure and clear.\n",
        "TRANSLATION_13": "And indeed We know that they (polytheists and pagans) say: \"It is only a human being who teaches him (Muhammad SAW).\" The tongue of the man they refer to is foreign, while this (the Quran) is a clear Arabic tongue.\n",
        "TRANSLATION_14": "We know very well that they say: 'A mortal teaches him' The tongue of him at whom they hint is a nonArab; and this is a clear Arabic tongue.\n",
        "TRANSLATION_15": "We are well aware that they say, “It is a human being who is teaching him.” But the tongue of him they allude to is foreign, while this is a clear Arabic tongue.\n",
        "TRANSLATION_16": "And We certainly know that they say, \"It is only a human being who teaches the Prophet.\" The tongue of the one they refer to is foreign, and this Qur'an is [in] a clear Arabic language.\n",
        "TRANSLATION_17": "[16:103] And verily (wa-laqad is for confirmation) We know that they say, ‘It is only a human that is teaching him, the Qur’ān’ — this was a Christian blacksmith whom the Prophet (s) used to frequent. God, exalted be He, says: The tongue, the language, of him to whom they refer, to whom they incline, [with the accusation] that he is [the one] teaching him, is foreign’; while this, Qur’ān, is [in] a clear Arabic tongue, one of lucidity and clarity: so how can a foreigner be teaching him?\n",
        "TRANSLATION_18": "(And We know well) O Muhammad (that they) i.e. the disbelievers of Mecca (say: Only a man) Jabr and 294 Yasar (teacheth him) the Qur'an. (The speech of him at whom they falsely hint) incline and ascribe this to (is outlandish) Hebraic, (and this is clear Arabic speech) He says: the Qur'an is in the usage of the Arabic language.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "16:103",
            "46:12",
            "26:195",
            "2:46",
            "7:139",
            "23:60",
            "11:69",
            "44:58",
            "38:24",
            "23:34"
        ],
        "BIBLE": [
            "torah:exodus:4:10",
            "torah:genesis:44:15",
            "prophets:jeremiah:31:34",
            "torah:genesis:20:7",
            "prophets:i%20samuel:16:18",
            "prophets:i%20kings:13:26",
            "torah:genesis:22:12",
            "prophets:ezekiel:38:14",
            "prophets:jeremiah:18:18",
            "prophets:ezekiel:3:10"
        ]
    }
}