{
    "VERSE": "16:104",
    "ARABIC": "إِنَّ ٱلَّذِينَ لَا يُؤْمِنُونَ بِـَٔايَٰتِ ٱللَّهِ لَا يَهْدِيهِمُ ٱللَّهُ وَلَهُمْ عَذَابٌ أَلِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "As for those who do not have iman in Allah's Signs, Allah will not guide them and they will have a painful punishment.",
        "TRANSLATION_1": "Those who do not believe in the words of God are verily not guided by God. For them is severe punishment.\n",
        "TRANSLATION_2": "Surely Allah will not enable those who do not believe in the signs of Allah to be directed to the Right Way, and a painful chastisement awaits them.\n",
        "TRANSLATION_3": "God will not guide those who do not believe in His miracles. They will suffer a painful punishment.\n",
        "TRANSLATION_4": "Those who disbelieve in the signs of Allah – Allah does not guide them, and for them is a punishment, most painful.\n",
        "TRANSLATION_5": "Verily, those who do not believe in Allah's Ayat (signs, or revelation), Allah will not guide them, and theirs will be a painful punishment.\n",
        "TRANSLATION_6": "(As for) those who do not believe in Allah's communications, surely Allah will not guide them, and they shall have a painful punishment.\n",
        "TRANSLATION_7": "Those that believe not in the signs of God, God will not guide; there awaits them a painful chastisement.\n",
        "TRANSLATION_8": "Lo! those who disbelieve the revelations of Allah, Allah guideth them not and theirs will be a painful doom.\n",
        "TRANSLATION_9": "God will not guide those who will not believe in the signs of God; and theirs will be a painful punishment.\n",
        "TRANSLATION_10": "Verily those who believe not in the signs of Allah--Allah shall not guide them, and unto them shall be a torment afflictive.\n",
        "TRANSLATION_11": "Indeed those who do not believe in the signs of Allah—Allah shall not guide them and there is a painful punishment for them.\n",
        "TRANSLATION_12": "Those who believe not in the Signs of Allah,- Allah will not guide them, and theirs will be a grievous Penalty.\n",
        "TRANSLATION_13": "Verily! Those who believe not in the Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) of Allah, Allah will not guide them and theirs will be a painful torment.\n",
        "TRANSLATION_14": "Those who disbelieve in the verses of Allah, Allah does not guide them for them is a painful punishment.\n",
        "TRANSLATION_15": "Those who do not believe in God’s revelations—God will not guide them, and for them is a painful punishment.\n",
        "TRANSLATION_16": "Indeed, those who do not believe in the verses of Allah - Allah will not guide them, and for them is a painful punishment.\n",
        "TRANSLATION_17": "[16:104] Indeed those who do not believe in God’s signs — God shall not guide them and there is a painful chastisement for them.\n",
        "TRANSLATION_18": "(Lo! those who disbelieve the revelations of Allah) i.e. Muhammad (pbuh) and the Qur'an, (Allah guideth them not) to His religion, i.e. He does not guide those who do not deserve to be guided; it is also said that this means: He does not guide them to the right proof nor save them from the Fire (and theirs will be a painful doom) a severe chastisement.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "16:104",
            "29:23",
            "51:37",
            "45:8",
            "16:105",
            "3:177",
            "17:10",
            "34:5",
            "9:79",
            "26:201"
        ],
        "BIBLE": [
            "writings:job:36:2",
            "writings:job:32:14",
            "prophets:jeremiah:44:29",
            "writings:proverbs:12:6",
            "writings:proverbs:13:13",
            "prophets:i%20kings:8:59",
            "prophets:joshua:1:18",
            "prophets:isaiah:59:21",
            "prophets:jeremiah:18:18",
            "torah:exodus:4:28"
        ]
    }
}