{
    "VERSE": "16:106",
    "ARABIC": "مَن كَفَرَ بِٱللَّهِ مِنۢ بَعْدِ إِيمَٰنِهِۦٓ إِلَّا مَنْ أُكْرِهَ وَقَلْبُهُۥ مُطْمَئِنٌّۢ بِٱلْإِيمَٰنِ وَلَٰكِن مَّن شَرَحَ بِٱلْكُفْرِ صَدْرًا فَعَلَيْهِمْ غَضَبٌ مِّنَ ٱللَّهِ وَلَهُمْ عَذَابٌ عَظِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "Those who reject Allah after having had iman - except for someone forced to do it whose heart remains at rest in its iman - but as for those whose breasts become dilated with kufr, anger from Allah will come down on them. They will have a terrible punishment.",
        "TRANSLATION_1": "Whosoever denies having once believed -- unless he is forced to do so while his heart enjoys the peace of faith -- and opens his mind to disbelief will suffer the wrath of God. Their punishment will be great,\n",
        "TRANSLATION_2": "Except for those who were forced to engage in infidelity to Allah after believing the while their hearts remained firmly convinced of their belief, the ones whose hearts willingly embraced disbelief shall incur Allah's wrath and a mighty chastisement lies in store for them.\n",
        "TRANSLATION_3": "No one verbally denounces his faith in God - unless he is forced - but his heart is confident about his faith. But those whose breasts have become open to disbelief will be subject to the wrath of God and will suffer a great torment.\n",
        "TRANSLATION_4": "The one who disbelieves in Allah after accepting faith – except him who is forced to and whose heart is still firmly upon faith – but whoever is wholeheartedly a disbeliever, upon them is the wrath of Allah; and for them is a great punishment.\n",
        "TRANSLATION_5": "Whoever disbelieves in Allah after his belief - except one who was forced while his heart is at peace with the faith - but whoever opens their breasts to disbelief, on them is wrath from Allah, and theirs will be a terrible torment.\n",
        "TRANSLATION_6": "He who disbelieves in Allah after his having believed, not he who is compelled while his heart is at rest on account of faith, but he who opens (his) breast to disbelief-- on these is the wrath of Allah, and they shall have a grievous chastisement.\n",
        "TRANSLATION_7": "Whoso disbelieves in God, after he has believed -- excepting him who has been compelled, and his heart is still at rest in his belief -- but whosoever's breast is expanded in unbelief, upon them shall rest anger from God, and there awaits them a mighty chastisement;\n",
        "TRANSLATION_8": "Whoso disbelieveth in Allah after his belief - save him who is forced thereto and whose heart is still content with the Faith - but whoso findeth ease in disbelief: On them is wrath from Allah. Theirs will be an awful doom.\n",
        "TRANSLATION_9": "As for one who denies God after he has believed, with the exception of one who is forced to do it, while his heart rests securely in faith, but one who opens his heart to a denial of truth shall incur the wrath of God; such as these will have a terrible punishment.\n",
        "TRANSLATION_10": "Whosoever disbelieveth in Allah after his belief--save him who is constrained and his heart is at rest with the belief -but whosoever expandeth his breast to infidelity, upon them shall be wrath from Allah, and unto them shall be a torment mighty.\n",
        "TRANSLATION_11": "Excepting someone who is compelled [to recant his faith] while his heart is at rest in it, those who disbelieve in Allah after [affirming] their faith and open up their breasts to unfaith, Allah’s wrath shall be upon them and there is a great punishment for them.\n",
        "TRANSLATION_12": "Any one who, after accepting faith in Allah, utters Unbelief,- except under compulsion, his heart remaining firm in Faith - but such as open their breast to Unbelief, on them is Wrath from Allah, and theirs will be a dreadful Penalty.\n",
        "TRANSLATION_13": "Whoever disbelieved in Allah after his belief, except him who is forced thereto and whose heart is at rest with Faith but such as open their breasts to disbelief, on them is wrath from Allah, and theirs will be a great torment.\n",
        "TRANSLATION_14": "Whosoever disbelieves in Allah after believing except he who is forced while his heart remains in his belief but he who opens his chest for disbelief, shall receive the Anger of Allah and for such awaits a mighty punishment.\n",
        "TRANSLATION_15": "Whoever renounces faith in God after having believed—except for someone who is compelled, while his heart rests securely in faith—but whoever willingly opens up his heart to disbelief—upon them falls wrath from God, and for them is a tremendous torment.\n",
        "TRANSLATION_16": "Whoever disbelieves in Allah after his belief... except for one who is forced [to renounce his religion] while his heart is secure in faith. But those who [willingly] open their breasts to disbelief, upon them is wrath from Allah, and for them is a great punishment;\n",
        "TRANSLATION_17": "[16:106] Whoever disbelieves in God after [having affirmed] his faith — except for him who is compelled, to pronounce [a statement of] unbelief and so pronounces it, while his heart is at rest in faith (man, ‘whoever’, is [either] a subject or a conditional, and so the predicate [of this subject], or the response [to this conditional], is [an implied] lahum wa‘īdun shadīd, ‘there is for them a severe threat [of chastisement]’; this is indicated by [the statement that follows]) — but he who opens up his breast to unbelief, that is, [he who] opens it up and expands it [with unbelief], meaning that his soul is content with it, upon such shall be wrath from God, and there is a great chastisement for them.\n",
        "TRANSLATION_18": "(Whoso disbelieveth in Allah after his belief) in Him, deserves Allah's wrath (save him who is forced thereto) except the person who is coerced into disbelief (and whose heart is still content with Faith). This verse was revealed about 'Ammar Ibn Yasir (but whoso findeth ease in disbelief) whosoever utters words of disbelief willingly: (On them is wrath from Allah. Theirs will be an awful doom) the most awful torment in this worldly life. This verse was revealed about 'Abdullah Ibn Sa'd Ibn Abi Sarh.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "16:106",
            "2:7",
            "31:23",
            "9:79",
            "2:10",
            "42:24",
            "2:90",
            "24:5",
            "3:177",
            "42:16"
        ],
        "BIBLE": [
            "writings:proverbs:10:8",
            "prophets:ezekiel:33:27",
            "prophets:isaiah:35:4",
            "torah:genesis:20:6",
            "prophets:jeremiah:39:18",
            "torah:deuteronomy:15:10",
            "prophets:jeremiah:44:12",
            "writings:proverbs:28:18",
            "prophets:ii%20kings:7:4",
            "writings:proverbs:19:19"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:4:12"
        ]
    }
}