{
    "VERSE": "16:109",
    "ARABIC": "لَا جَرَمَ أَنَّهُمْ فِى ٱلْءَاخِرَةِ هُمُ ٱلْخَٰسِرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "There is no doubt that in the akhira they will be the losers.",
        "TRANSLATION_1": "They will surely be losers in the life to come,\n",
        "TRANSLATION_2": "No doubt they shall be losers in the Hereafter.\n",
        "TRANSLATION_3": "On the Day of Judgment they will certainly be lost.\n",
        "TRANSLATION_4": "So it occurred that they are the losers in the Hereafter.\n",
        "TRANSLATION_5": "No doubt, in the Hereafter they will be the losers.\n",
        "TRANSLATION_6": "No doubt that in the hereafter they will be the losers.\n",
        "TRANSLATION_7": "without a doubt, in the world to come they will be the losers.\n",
        "TRANSLATION_8": "Assuredly in the Hereafter they are the losers.\n",
        "TRANSLATION_9": "and in the life to come, they will surely be the losers.\n",
        "TRANSLATION_10": "Undoubtedly they in the Hereafter shall be the very losers.\n",
        "TRANSLATION_11": "Undoubtedly, they are the ones who will be the losers in the Hereafter.\n",
        "TRANSLATION_12": "Without doubt, in the Hereafter they will perish.\n",
        "TRANSLATION_13": "No doubt, in the Hereafter, they will be the losers.\n",
        "TRANSLATION_14": "In the Everlasting Life, they shall assuredly be the losers.\n",
        "TRANSLATION_15": "There is no doubt that in the Hereafter they will be the losers.\n",
        "TRANSLATION_16": "Assuredly, it is they, in the Hereafter, who will be the losers.\n",
        "TRANSLATION_17": "[16:109] Without a doubt — verily — in the Hereafter they are the ones who will be the losers, because their journey’s end shall be the Fire, in which they shall be perpetually.\n",
        "TRANSLATION_18": "(Assuredly) truly, O Muhammad (in the Hereafter they are the losers). This verse was revealed about those disbelievers who mocked Muhammad and the Qur'an.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "16:109",
            "11:22",
            "74:53",
            "77:17",
            "16:23",
            "27:4",
            "37:78",
            "37:129",
            "37:119",
            "37:108"
        ],
        "BIBLE": [
            "torah:numbers:35:31",
            "torah:numbers:24:14",
            "prophets:jeremiah:51:47",
            "writings:psalms:96:13",
            "writings:daniel:12:2",
            "torah:exodus:22:18",
            "prophets:jeremiah:51:52",
            "prophets:zechariah:14:18",
            "torah:deuteronomy:12:23",
            "prophets:isaiah:27:6"
        ]
    }
}