{
    "VERSE": "16:11",
    "ARABIC": "يُنۢبِتُ لَكُم بِهِ ٱلزَّرْعَ وَٱلزَّيْتُونَ وَٱلنَّخِيلَ وَٱلْأَعْنَٰبَ وَمِن كُلِّ ٱلثَّمَرَٰتِ إِنَّ فِى ذَٰلِكَ لَءَايَةً لِّقَوْمٍ يَتَفَكَّرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "And by it He makes crops grow for you and olives and dates and grapes and fruit of every kind. There is certainly a Sign in that for people who reflect.",
        "TRANSLATION_1": "With which He makes crops grow, and olives, dates and grapes and fruits of every kind for you. In this is a sign for those who think.\n",
        "TRANSLATION_2": "and by virtue of which He causes crops and olives and date-palms and grapes and all kinds of fruit to grow for you. Surely in this there is a great Sign for those who reflect.\n",
        "TRANSLATION_3": "(With this water) He causes corn, olives, palm-trees, vines, and all kinds of fruits to grow. In this there is evidence (of the existence of God) for the people of understanding.\n",
        "TRANSLATION_4": "With this water He produces for you crops, and olives, and dates, and grapes, and all kinds of fruit; indeed in this is a sign for people who ponder.\n",
        "TRANSLATION_5": "With it He causes crops to grow for you, the olives, the date palms, the grapes, and every kind of fruit. Verily, in this there is indeed an evident proof and a manifest sign for people who give thought.\n",
        "TRANSLATION_6": "He causes to grow for you thereby herbage, and the olives, and the palm trees, and the grapes, and of all the fruits; most surely there is a sign in this for a people who reflect.\n",
        "TRANSLATION_7": "and thereby He brings forth for you crops, and olives, and palms, and vines, and all manner of fruit. Surely in that is a sign for a people who reflect.\n",
        "TRANSLATION_8": "Therewith He causeth crops to grow for you, and the olive and the date-palm and grapes and all kinds of fruit. Lo! herein is indeed a portent for people who reflect.\n",
        "TRANSLATION_9": "And with it He grows for you corn, and the olive and the date-palm and the grape, and all kinds of fruits. Surely, in that is a sign for a people who reflect.\n",
        "TRANSLATION_10": "He groweth for you thereby the corn and olives and date- palms and grapes and all kinds of fruit. Verily therein is a sign for a people who ponder.\n",
        "TRANSLATION_11": "For you He makes the crops grow with it and olives, date palms, vines, and fruits of all kinds. There is indeed a sign in that for a people who reflect.\n",
        "TRANSLATION_12": "With it He produces for you corn, olives, date-palms, grapes and every kind of fruit: verily in this is a sign for those who give thought.\n",
        "TRANSLATION_13": "With it He causes to grow for you the crops, the olives, the date-palms, the grapes, and every kind of fruit. Verily! In this is indeed an evident proof and a manifest sign for people who give thought.\n",
        "TRANSLATION_14": "And thereby He brings forth crops and olives, palms and vines, and all the fruits. Surely, in this there is a sign for a nation who think.\n",
        "TRANSLATION_15": "And He produces for you grains with it, and olives, and date-palms, and grapes, and all kinds of fruits. Surely in that is a sign for people who think.\n",
        "TRANSLATION_16": "He causes to grow for you thereby the crops, olives, palm trees, grapevines, and from all the fruits. Indeed in that is a sign for a people who give thought.\n",
        "TRANSLATION_17": "[16:11] With it He makes the crops grow for you, and olives and date-palms and vines and all kinds of fruit. Surely in that, which is mentioned, there is a sign, indicating His Oneness, exalted He be, for people who reflect,   upon His handiwork and therefore believe.\n",
        "TRANSLATION_18": "(Therewith) by means of water (He causeth crops to grow for you, and the olive and the date-palm and grapes and all kinds of fruit. Lo! Herein) in all the different kinds of fruit and of their tastes (is indeed a portent) a sign and a lesson (for people who reflect) upon that which Allah has created for them.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "16:11",
            "16:67",
            "13:4",
            "6:99",
            "13:3",
            "27:52",
            "16:13",
            "13:7",
            "16:69",
            "10:67"
        ],
        "BIBLE": [
            "torah:deuteronomy:5:8",
            "torah:exodus:20:4",
            "prophets:hosea:14:8",
            "writings:i%20chronicles:17:21",
            "prophets:joel:2:19",
            "prophets:isaiah:64:1",
            "prophets:ii%20samuel:7:23",
            "writings:i%20chronicles:17:22",
            "prophets:zechariah:9:17",
            "prophets:isaiah:25:6"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:1:14",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:12",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:3:2"
        ]
    }
}