{
    "VERSE": "16:111",
    "ARABIC": "يَوْمَ تَأْتِى كُلُّ نَفْسٍ تُجَٰدِلُ عَن نَّفْسِهَا وَتُوَفَّىٰ كُلُّ نَفْسٍ مَّا عَمِلَتْ وَهُمْ لَا يُظْلَمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "On that Day every self will come to argue for itself and every self will be paid in full for what it did. They will not be wronged.",
        "TRANSLATION_1": "On the day when every soul will come pleading for itself, and every soul will be recompensed for what it had done, no one will be wronged.\n",
        "TRANSLATION_2": "Allah's judgement will come about them all on the Day when everyone shall come pleading in his defence, and everyone shall be fully requited for his deeds and none shall be wronged in the least.\n",
        "TRANSLATION_3": "On the Day of Judgment every soul shall try to defend itself and every soul will be justly recompensed.\n",
        "TRANSLATION_4": "The day when every soul will come quarrelling against itself, and every soul will be fully repaid for what it did, and they will not be wronged.\n",
        "TRANSLATION_5": "(Remember) the Day when every person will come pleading for himself, and every one will be paid in full for what he did, and they will not be dealt with unjustly.\n",
        "TRANSLATION_6": "(Remember) the day when every soul shall come, pleading for itself and every soul shall be paid in full what it has done, and they shall not be dealt with unjustly.\n",
        "TRANSLATION_7": "The day that every soul shall come disputing in its own behalf; and every soul shall be paid in full for what it wrought, and they shall not be wronged.\n",
        "TRANSLATION_8": "On the Day when every soul will come pleading for itself, and every soul will be repaid what it did, and they will not be wronged.\n",
        "TRANSLATION_9": "On the Day each soul will come pleading for itself, and every soul will be repaid according to whatever it has done, and they will not be wronged.\n",
        "TRANSLATION_10": "Beware a Day whereon each soul will come pleading for itself, and each soul will be paid in full that which it hath wrought, and they shall not be wronged.\n",
        "TRANSLATION_11": "The day [will come] when every soul will come pleading for itself and every soul will be recompensed fully for what it has done, and they will not be wronged.\n",
        "TRANSLATION_12": "One Day every soul will come up struggling for itself, and every soul will be recompensed (fully) for all its actions, and none will be unjustly dealt with.\n",
        "TRANSLATION_13": "(Remember) the Day when every person will come up pleading for himself, and every one will be paid in full for what he did (good or evil, belief or disbelief in the life of this world) and they will not be dealt with unjustly.\n",
        "TRANSLATION_14": "On the Day when every soul will come pleading for itself and when every soul will be recompensed in full for what it did they shall not be wronged.\n",
        "TRANSLATION_15": "On the Day when every soul will come pleading for itself, and every soul will be paid in full for what it has done, and they will not be wronged.\n",
        "TRANSLATION_16": "On the Day when every soul will come disputing for itself, and every soul will be fully compensated for what it did, and they will not be wronged.\n",
        "TRANSLATION_17": "[16:111] Mention, the day when every soul will come pleading, arguing, for itself, not concerned for any other [soul] — this is the Day of Resurrection — and every soul will be repaid, the requital [of], what it has done and they will not be wronged, at all.\n",
        "TRANSLATION_18": "(On the Day) the Day of Judgement (when every soul) righteous or sinful (will come pleading) arguing (for itself) for its cause; it is also said: it will come with its satan; and it is also said: it will come with its spirit, (and every soul) righteous or sinful (will be repaid what it did) for what it did whether it is good or evil, (and they will not be wronged) their good deeds will not be decreased nor will their evil deeds increased.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "16:111",
            "2:281",
            "3:25",
            "39:70",
            "3:161",
            "2:123",
            "91:7",
            "86:4",
            "2:48",
            "36:54"
        ],
        "BIBLE": [
            "prophets:i%20samuel:11:13",
            "torah:genesis:34:7",
            "prophets:ezekiel:38:16",
            "torah:numbers:24:14",
            "prophets:jeremiah:51:47",
            "prophets:jeremiah:18:20",
            "prophets:isaiah:26:18",
            "torah:deuteronomy:17:9",
            "prophets:habakkuk:1:5",
            "torah:exodus:35:2"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:8",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:3:6",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:3:7"
        ]
    }
}