{
    "VERSE": "16:112",
    "ARABIC": "وَضَرَبَ ٱللَّهُ مَثَلًا قَرْيَةً كَانَتْ ءَامِنَةً مُّطْمَئِنَّةً يَأْتِيهَا رِزْقُهَا رَغَدًا مِّن كُلِّ مَكَانٍ فَكَفَرَتْ بِأَنْعُمِ ٱللَّهِ فَأَذَٰقَهَا ٱللَّهُ لِبَاسَ ٱلْجُوعِ وَٱلْخَوْفِ بِمَا كَانُوا۟ يَصْنَعُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Allah makes an example of a city which was safe and at peace, its provision coming to it plentifully from every side. Then it showed ingratitude for Allah's blessings so Allah made it wear the robes of hunger and fear for what it did.",
        "TRANSLATION_1": "God presents the example of a town which enjoyed peace and security, its provisions coming from everywhere in abundance, but it denied the favours of God; so God acquainted it with intimate hunger and fear (as punishment) for what they had done.\n",
        "TRANSLATION_2": "Allah sets forth the parable of (the people of) a town who were secure and content and whose sustenance came in abundance from every quarter. But then the people of the town showed ingratitude towards Allah for His bounties, so Allah afflicted them with hunger and fear in punishment for their evil deeds.\n",
        "TRANSLATION_3": "God tells a parable about a secure and peaceful town surrounded by abundant sustenance. Its inhabitants rejected the bounties of God and He caused them to suffer hunger and fear as a result of their deeds.\n",
        "TRANSLATION_4": "And Allah has illustrated an example of a township – which dwelt in peace and security, its provisions coming in abundance from every side – in response the township started being ungrateful of Allah’s favours, therefore Allah made it taste the punishment by covering it with a cloak of starvation and fear, on account of their deeds.\n",
        "TRANSLATION_5": "And Allah gives the example of a township (Makkah), it was secure and peaceful: its provision coming to it in abundance from every place, but it (its people) denied the favors of Allah. So Allah made it taste extreme hunger (famine) and fear, because of what they did.\n",
        "TRANSLATION_6": "And Allah sets forth a parable: (Consider) a town safe and secure to which its means of subsistence come in abundance from every quarter; but it became ungrateful to Allah's favors, therefore Allah made it to taste the utmost degree of hunger and fear because of what they wrought.\n",
        "TRANSLATION_7": "God has struck a similitude: a city that was secure, at rest, its provision coming to it easefully from every place, then it was unthankful for the blessings of God; so God let it taste the garment of hunger and of fear, for the things that they were working.\n",
        "TRANSLATION_8": "Allah coineth a similitude: a township that dwelt secure and well content, its provision coming to it in abundance from every side, but it disbelieved in Allah's favours, so Allah made it experience the garb of dearth and fear because of what they used to do.\n",
        "TRANSLATION_9": "God makes an example of a town that was secure and at ease, with provisions coming to it abundantly from every quarter. Then it showed ingratitude for God's blessings and God afflicted it with hunger and fear because of what they did.\n",
        "TRANSLATION_10": "And Allah propoundeth a similitude: a town which was secure and at rest, to which came the provision thereof plenteously from every place; then it ungratefully denied the favours of Allah; wherefore Allah made it taste the extreme of hunger and fear because of that which they were wont to perform.\n",
        "TRANSLATION_11": "Allah draws a parable: There was a town secure and peaceful, its provision coming abundantly from every place. But it was ungrateful toward Allah’s blessings. So Allah made it taste hunger and fear because of what they used to do.\n",
        "TRANSLATION_12": "Allah sets forth a Parable: a city enjoying security and quiet, abundantly supplied with sustenance from every place: Yet was it ungrateful for the favours of Allah: so Allah made it taste of hunger and terror (in extremes) (closing in on it) like a garment (from every side), because of the (evil) which (its people) wrought.\n",
        "TRANSLATION_13": "And Allah puts forward the example of a township (Makkah), that dwelt secure and well content; its provision coming to it in abundance from every place, but it (its people) denied the Favours of Allah (with ungratefulness). So Allah made it taste the extreme of hunger (famine) and fear, because of that (evil, i.e. denying Prophet Muhammad SAW) which they (its people) used to do.\n",
        "TRANSLATION_14": "Allah strikes a parable of the village which was safe and peaceful. Its provisions came in abundance from everywhere; but it was thankless for the favors of Allah. Therefore, for what they were doing, Allah let it taste the garment of hunger and fear.\n",
        "TRANSLATION_15": "And God cites the example of a town that was secure and peaceful, with its livelihood coming to it abundantly from every direction. But then it turned unappreciative of God’s blessings, so God made it taste the robe of hunger and fear, because of what they used to craft.\n",
        "TRANSLATION_16": "And Allah presents an example: a city which was safe and secure, its provision coming to it in abundance from every location, but it denied the favors of Allah. So Allah made it taste the envelopment of hunger and fear for what they had been doing.\n",
        "TRANSLATION_17": "[16:112] And God strikes a similitude (mathalan is substituted by [the following, qaryatan]) a town, Mecca — meaning its inhabitants — secure, from any raids, never becoming agitated, and peaceful, without anyone ever needing to emigrate from it, on account of anxiety or fear, its provision coming to it plenteously, abundantly, from every place. But it rejected God’s graces, by denying the Prophet (s), so God made it taste the garb of hunger, and so they suffered seven years of drought, and fear, as a result of the raiding parties of the Prophet (s), [all] because of what they used to do.\n",
        "TRANSLATION_18": "295 (Allah coineth a similitude: a township) Allah explains the characteristic of the people of Mecca: Abu Jahl, al- Walid and their host (that dwelt secure) its inhabitants were safe from the enemy, fighting, hunger and being taken captives (and well content) its inhabitants were well settled, (its provision coming to it) food and fruits were brought to it (in abundance from every side) of the earth, (but it disbelieved in Allah's favours) its inhabitants disbelieved in Muhammad (pbuh) and in the Qur'an, (so Allah made it experience the garb of dearth and fear) so Allah punished its inhabitants with hunger, which lasted seven years, and also with the fear of fighting Muhammad, Allah, bless him and give him peace, and his Companions (because of what they used to do) because of what they said and did with Muhammad (pbuh) of hostility.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "16:112",
            "16:71",
            "28:82",
            "29:62",
            "16:83",
            "16:53",
            "29:17",
            "14:25",
            "16:73",
            "10:38"
        ],
        "BIBLE": [
            "torah:leviticus:10:17",
            "prophets:judges:18:10",
            "torah:exodus:20:21",
            "prophets:i%20kings:5:23",
            "prophets:ezekiel:26:20",
            "writings:ii%20chronicles:14:6",
            "prophets:jeremiah:19:12",
            "torah:exodus:23:27",
            "torah:exodus:36:6",
            "writings:ezra:8:17"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:5"
        ]
    }
}