{
    "VERSE": "16:117",
    "ARABIC": "مَتَٰعٌ قَلِيلٌ وَلَهُمْ عَذَابٌ أَلِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "Those who invent lies against Allah are not successful - a brief enjoyment, then they will have a painful punishment.",
        "TRANSLATION_1": "For them there is some enjoyment, but the punishment is painful.\n",
        "TRANSLATION_2": "Brief is their enjoyment of the world, and thereafter they shall suffer a painful chastisement.\n",
        "TRANSLATION_3": "(Such an invention) will bring only a little enjoyment but will be followed by painful torment.\n",
        "TRANSLATION_4": "A little enjoyment – and for them is a punishment, most painful.\n",
        "TRANSLATION_5": "A passing brief enjoyment (will be theirs), but they will suffer a painful torment.\n",
        "TRANSLATION_6": "A little enjoyment and they shall have a painful punishment.\n",
        "TRANSLATION_7": "A little enjoyment, then for them awaits a painful chastisement.\n",
        "TRANSLATION_8": "A brief enjoyment (will be theirs); and theirs a painful doom.\n",
        "TRANSLATION_9": "their enjoyment of this life is brief, and they shall have a painful punishment.\n",
        "TRANSLATION_10": "A brief enioyment, and unto them shall be a torment afflictive.\n",
        "TRANSLATION_11": "[Their share of the present life is] a trifling enjoyment, and there will be a painful punishment for them.\n",
        "TRANSLATION_12": "(In such falsehood) is but a paltry profit; but they will have a most grievous Penalty.\n",
        "TRANSLATION_13": "A passing brief enjoyment (will be theirs), but they will have a painful torment.\n",
        "TRANSLATION_14": "Brief (is their) enjoyment, after which a painful punishment awaits them.\n",
        "TRANSLATION_15": "A brief enjoyment—then they will have a painful punishment.\n",
        "TRANSLATION_16": "[It is but] a brief enjoyment, and they will have a painful punishment.\n",
        "TRANSLATION_17": "[16:117] For them [there will be], a brief enjoyment, in this world, and for them, in the Hereafter, there will be a painful chastisement.\n",
        "TRANSLATION_18": "(A brief enjoyment (will be theirs)) they will abide in this worldly life but for a short period; (and theirs a painful doom) in the Hereafter.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "16:117",
            "15:50",
            "4:138",
            "84:24",
            "33:8",
            "73:13",
            "37:9",
            "76:31",
            "51:37",
            "26:201"
        ],
        "BIBLE": [
            "torah:exodus:21:23",
            "torah:genesis:24:8",
            "torah:genesis:6:17",
            "torah:numbers:14:24",
            "torah:deuteronomy:18:22",
            "writings:proverbs:16:22",
            "writings:proverbs:19:19",
            "writings:psalms:23:6",
            "prophets:jeremiah:42:16",
            "prophets:ii%20kings:6:19"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:4:8",
            "Sefer%20Yetzirah:3:5",
            "Sefer%20Yetzirah:3:7"
        ]
    }
}