{
    "VERSE": "16:118",
    "ARABIC": "وَعَلَى ٱلَّذِينَ هَادُوا۟ حَرَّمْنَا مَا قَصَصْنَا عَلَيْكَ مِن قَبْلُ وَمَا ظَلَمْنَٰهُمْ وَلَٰكِن كَانُوٓا۟ أَنفُسَهُمْ يَظْلِمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "We forbade the Jews those things We told you about before. We did not wrong them; rather they wronged themselves.",
        "TRANSLATION_1": "We have already told you what We have forbidden the Jews. We did not wrong them, they wronged themselves.\n",
        "TRANSLATION_2": "We have already recounted to you what We prohibited to the Jews. In so doing We did not wrong them; it is they who wronged themselves.\n",
        "TRANSLATION_3": "We had made unlawful for the Jews all that we told you before. We did not do any wrong to them but they wronged themselves.\n",
        "TRANSLATION_4": "And especially for the Jews We forbade which We related to you earlier; and We did not oppress them, but it is they who wronged themselves.\n",
        "TRANSLATION_5": "And for those who are Jews, We have forbidden such things as We have mentioned to you before. And We did not wrong them, but they wronged themselves.\n",
        "TRANSLATION_6": "And for those who were Jews We prohibited what We have related to you already, and We did them no injustice, but they were unjust to themselves.\n",
        "TRANSLATION_7": "And those of Jewry -- We have forbidden them what We related to thee before, and We wronged them not, but they wronged themselves.\n",
        "TRANSLATION_8": "And unto those who are Jews We have forbidden that which We have already related unto thee. And We wronged them not, but they were wont to wrong themselves.\n",
        "TRANSLATION_9": "We forbade the Jews those things We told you about before. We did not wrong them; rather they wronged themselves.\n",
        "TRANSLATION_10": "And un to those who are Judaised We disallowed that which We have already recounted unto thee; and We wronged them not, but themselves they were wont to Wrong.\n",
        "TRANSLATION_11": "We forbade to the Jews what We have recounted to you earlier, and We did not wrong them, but they used to wrong themselves.\n",
        "TRANSLATION_12": "To the Jews We prohibited such things as We have mentioned to thee before: We did them no wrong, but they were used to doing wrong to themselves.\n",
        "TRANSLATION_13": "And unto those who are Jews, We have forbidden such things as We have mentioned to you (O Muhammad SAW) before [in Surat-Al-An'am, (The Cattle), see Verse 6:146]. And We wronged them not, but they used to wrong themselves.\n",
        "TRANSLATION_14": "We have forbidden the Jews what We have already related to you. We did not wrong them, but they wronged themselves.\n",
        "TRANSLATION_15": "For those who are Jews, We have prohibited what We related to you before. We did not wrong them, but they used to wrong their own selves.\n",
        "TRANSLATION_16": "And to those who are Jews We have prohibited that which We related to you before. And We did not wrong them [thereby], but they were wronging themselves.\n",
        "TRANSLATION_17": "[16:118] And to those of Jewry, that is, the Jews, We forbade that which We have related to you already, in the verse, And to those of Jewry We forbade every beast with hoof … to the end [Q. 6:146]; and We did not wrong them, by forbidding [them] that, but they used to wrong themselves, by committing acts of disobedience which necessarily bring about such [consequences].\n",
        "TRANSLATION_18": "(And unto those who are Jews) those who stirred away from Islam, i.e. the Jews (We have forbidden that which We have already) before this surah, and specifically in surah al-An'am (related unto thee) that which We have named to you. (And We wronged them not) because of what We forbade them of meats and fats, (but they were wont to wrong themselves) they were wont to harm, i.e. He forbade them those things because of their sins.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "16:118",
            "41:48",
            "11:21",
            "16:33",
            "91:7",
            "82:5",
            "39:50",
            "21:41",
            "2:57",
            "20:41"
        ],
        "BIBLE": [
            "writings:psalms:40:6",
            "torah:genesis:24:66",
            "writings:job:42:3",
            "writings:esther:6:13",
            "prophets:isaiah:44:21",
            "torah:genesis:34:14",
            "prophets:jeremiah:14:22",
            "writings:daniel:12:8",
            "writings:psalms:148:10",
            "prophets:ii%20kings:23:17"
        ]
    }
}