{
    "VERSE": "16:12",
    "ARABIC": "وَسَخَّرَ لَكُمُ ٱلَّيْلَ وَٱلنَّهَارَ وَٱلشَّمْسَ وَٱلْقَمَرَ وَٱلنُّجُومُ مُسَخَّرَٰتٌۢ بِأَمْرِهِۦٓ إِنَّ فِى ذَٰلِكَ لَءَايَٰتٍ لِّقَوْمٍ يَعْقِلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "He has made night and day subservient to you, and the sun and moon and stars, all subject to His command. There are certainly Signs in that for people who use their intellect.",
        "TRANSLATION_1": "He harnessed the day and night for you, as also the sun, the moon and the stars, by His command. In this are signs for men who understand.\n",
        "TRANSLATION_2": "He has subjected for you the night and the day and the sun and the moon and the stars have also been made subservient by His command. Surely there are Signs in this for those who use their reason.\n",
        "TRANSLATION_3": "God has made the day and the night, the sun and the moon, and all the stars subservient to you by His command. In this there is evidence of the truth for people of understanding.\n",
        "TRANSLATION_4": "And He subjected the night and the day for you – and the sun and the moon; and the stars are subjected to His command; indeed in this are signs for people of intellect.\n",
        "TRANSLATION_5": "And He has subjected the night and the day for you, and the sun and the moon; and the stars are subjected by His command. Surely, in this are proofs for people who understand.\n",
        "TRANSLATION_6": "And He has made subservient for you the night and the day and the sun and the moon, and the stars are made subservient by His commandment; most surely there are signs in this for a people who ponder;\n",
        "TRANSLATION_7": "And He subjected to you the night and day, and the sun and moon; and the stars are subjected by His command. Surely in that are signs for a people who understand.\n",
        "TRANSLATION_8": "And He hath constrained the night and the day and the sun and the moon to be of service unto you, and the stars are made subservient by His command. Lo! herein indeed are portents for people who have sense.\n",
        "TRANSLATION_9": "He has made the night and the day and the sun and the moon subservient to you; and all the stars are subservient to His command. Surely in this there are signs for men of understanding.\n",
        "TRANSLATION_10": "And He hath subiected for you the night and the day and the sun and the moon, and the stars are subjected by His command. Verily therein are signs for a people who understand.\n",
        "TRANSLATION_11": "He disposed the night and the day for you, and the sun, the moon and the stars are disposed by His command. There are indeed signs in that for people who exercise their reason.\n",
        "TRANSLATION_12": "He has made subject to you the Night and the Day; the sun and the moon; and the stars are in subjection by His Command: verily in this are Signs for men who are wise.\n",
        "TRANSLATION_13": "And He has subjected to you the night and the day, the sun and the moon; and the stars are subjected by His Command. Surely, in this are proofs for people who understand.\n",
        "TRANSLATION_14": "He has subjected to you the night, the day, the sun and the moon. The stars are subjected by His Command. Surely, in that there is a sign for a nation who understands.\n",
        "TRANSLATION_15": "And He regulated for you the night and the day; and the sun, and the moon, and the stars are disposed by His command. Surely in that are signs for people who ponder.\n",
        "TRANSLATION_16": "And He has subjected for you the night and day and the sun and moon, and the stars are subjected by His command. Indeed in that are signs for a people who reason.\n",
        "TRANSLATION_17": "[16:12] And He disposed for you the night and the day and the sun (wa’l-shamsa, read in the accusative as a supplement to what precedes it; or read wa’l-shamsu in the nominative as a subject [of a new sentence]) and the moon and the stars (also read both ways) are disposed (musakhkharātin, read in the accusative as a circumstantial qualifier, or in the nominative [musakhkharātun] as a predicate) by His command, by His will. Surely in that there are signs for people who understand, [a people] who reflect.\n",
        "TRANSLATION_18": "(And He hath constrained the night and the day and the sun and the moon to be of service unto you) to be subservient to you, (and the stars are made subservient by His command) by His leave. (Lo! Herein) in the subservience of that which I have mentioned (indeed are portents) signs (for people who have sense) for people who act and believe that it is Allah Who made all these things subservient.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "16:12",
            "10:67",
            "27:86",
            "30:23",
            "14:33",
            "10:6",
            "41:37",
            "13:3",
            "21:33",
            "36:40"
        ],
        "BIBLE": [
            "writings:i%20chronicles:28:21",
            "torah:genesis:1:16",
            "writings:job:7:1",
            "writings:ii%20chronicles:8:14",
            "torah:exodus:36:1",
            "prophets:i%20kings:8:59",
            "prophets:jeremiah:32:20",
            "torah:genesis:1:14",
            "writings:proverbs:30:2",
            "prophets:isaiah:60:11"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:11",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:9"
        ]
    }
}