{
    "VERSE": "16:120",
    "ARABIC": "إِنَّ إِبْرَٰهِيمَ كَانَ أُمَّةً قَانِتًا لِّلَّهِ حَنِيفًا وَلَمْ يَكُ مِنَ ٱلْمُشْرِكِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Ibrahim was a community in himself, exemplary, obedient to Allah, a man of pure natural belief. He was not one of the idolaters.",
        "TRANSLATION_1": "Abraham was certainly a model of faith, obedient to God and upright, and not one of idolaters,\n",
        "TRANSLATION_2": "Indeed Abraham was a whole community by himself, obedient to Allah, exclusively devoted to Him. And he was never one of those who associated others with Allah in His Divinity.\n",
        "TRANSLATION_3": "Abraham was, certainly, an obedient and upright person. He was not a pagan.\n",
        "TRANSLATION_4": "Indeed Ibrahim was a leader, obedient to Allah, and detached from all; and he was not a polytheist.\n",
        "TRANSLATION_5": "Verily, Ibrahim was (himself) an Ummah, obedient to Allah, a Hanif (monotheist), and he was not one of the idolators.\n",
        "TRANSLATION_6": "Surely Ibrahim was an exemplar, obedient to Allah, upright, and he was not of the polytheists.\n",
        "TRANSLATION_7": "Surely, Abraham was a nation obedient unto God, a man of pure faith and no idolater,\n",
        "TRANSLATION_8": "Lo! Abraham was a nation obedient to Allah, by nature upright, and he was not of the idolaters;\n",
        "TRANSLATION_9": "Abraham was a community in himself devoted to God and true in faith, He was not one of the polytheists;\n",
        "TRANSLATION_10": "Verily Ibrahim was a pattern, devout unto Allah, upright, and, not of the associaters.\n",
        "TRANSLATION_11": "Indeed Abraham was a nation [all by himself], obedient to Allah, a Hanif, and he was not a polytheist.\n",
        "TRANSLATION_12": "Abraham was indeed a model, devoutly obedient to Allah, (and) true in Faith, and he joined not gods with Allah:\n",
        "TRANSLATION_13": "Verily, Ibrahim (Abraham) was an Ummah (a leader having all the good righteous qualities), or a nation, obedient to Allah, Hanifa (i.e. to worship none but Allah), and he was not one of those who were Al-Mushrikun (polytheists, idolaters, disbelievers in the Oneness of Allah, and those who joined partners with Allah).\n",
        "TRANSLATION_14": "Abraham was (equal to) a nation, obedient to Allah, of pure faith and was not among the idolaters,\n",
        "TRANSLATION_15": "Abraham was an exemplary leader, devoted to God, a monotheist, and was not of the polytheists.\n",
        "TRANSLATION_16": "Indeed, Abraham was a [comprehensive] leader, devoutly obedient to Allah, inclining toward truth, and he was not of those who associate others with Allah.\n",
        "TRANSLATION_17": "[16:120] Truly Abraham was a community, a leader (imām), a [good] example, comprising [in his character] all the good traits, obedient to God, a hanīf, inclining towards the upright religion, and he was not of the idolaters;\n",
        "TRANSLATION_18": "(Lo! Abraham was a nation) a leader who was emulated (obedient to Allah, by nature upright) sincerely surrendered to Allah, (and he was not of the idolaters) he did not follow the idolaters in their religion;\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "16:120",
            "3:95",
            "41:33",
            "16:74",
            "39:66",
            "16:123",
            "33:64",
            "72:22",
            "9:112",
            "28:56"
        ],
        "BIBLE": [
            "writings:job:1:1",
            "writings:ecclesiastes:7:20",
            "torah:genesis:6:9",
            "prophets:jeremiah:29:32",
            "writings:ecclesiastes:7:29",
            "torah:deuteronomy:1:35",
            "writings:ecclesiastes:12:14",
            "writings:proverbs:16:29",
            "writings:proverbs:13:22",
            "prophets:ezekiel:14:16"
        ]
    }
}