{
    "VERSE": "16:121",
    "ARABIC": "شَاكِرًا لِّأَنْعُمِهِ ٱجْتَبَىٰهُ وَهَدَىٰهُ إِلَىٰ صِرَٰطٍ مُّسْتَقِيمٍ",
    "ENGLISH": {
        "TRANSLATION_0": "He was thankful for His blessings. Allah chose him and guided him to a straight path.",
        "TRANSLATION_1": "Grateful to Him for His favours; so He chose him and guided him to the path that is straight,\n",
        "TRANSLATION_2": "He rendered thanks to Allah for His bounties so that Allah chose him (for His favours) and directed him to the Right Way.\n",
        "TRANSLATION_3": "He was thankful to God for His bounties. God chose him and guided him to the right path.\n",
        "TRANSLATION_4": "Grateful for His blessings; Allah chose him and guided him to the Straight Path.\n",
        "TRANSLATION_5": "(He was) thankful for His favors. He (Allah) chose him and guided him to a straight path.\n",
        "TRANSLATION_6": "Grateful for His favors; He chose him and guided him on the right path.\n",
        "TRANSLATION_7": "showing thankfulness for His blessings; He chose him, and He guided him to a straight path.\n",
        "TRANSLATION_8": "Thankful for His bounties; He chose him and He guided him unto a straight path.\n",
        "TRANSLATION_9": "he was thankful for His blessings. God chose him and guided him to a straight path.\n",
        "TRANSLATION_10": "Grateful for His favours: He chose him and guided him to a straight path.\n",
        "TRANSLATION_11": "Grateful [as he was] for His blessings, He chose him and guided him to a straight path.\n",
        "TRANSLATION_12": "He showed his gratitude for the favours of Allah, who chose him, and guided him to a Straight Way.\n",
        "TRANSLATION_13": "(He was) thankful for His (Allah's) Graces. He (Allah) chose him (as an intimate friend) and guided him to a Straight Path (Islamic Monotheism, neither Judaism nor Christianity).\n",
        "TRANSLATION_14": "ever thankful for His favors. He chose him and He guided him to a Straight Path.\n",
        "TRANSLATION_15": "Thankful for His blessings. He chose him, and guided him to a straight path.\n",
        "TRANSLATION_16": "[He was] grateful for His favors. Allah chose him and guided him to a straight path.\n",
        "TRANSLATION_17": "[16:121] grateful [as he was] for His graces, He chose him, elected him, and guided him to a straight path.\n",
        "TRANSLATION_18": "(Thankful for His bounties) thankful to Allah for the bounties He had bestowed upon him; (He chose him) He selected him for prophethood and Islam (and He guided him unto a straight path) He made him firm on an established path with which He is pleased, i.e. Islam.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "16:121",
            "48:2",
            "23:73",
            "44:27",
            "92:19",
            "37:118",
            "4:68",
            "36:4",
            "15:41",
            "36:61"
        ],
        "BIBLE": [
            "writings:psalms:5:9",
            "writings:proverbs:12:26",
            "writings:psalms:18:33",
            "writings:job:3:23",
            "writings:proverbs:3:6",
            "writings:psalms:139:24",
            "writings:ezra:8:21",
            "writings:proverbs:12:15",
            "prophets:ezekiel:21:21",
            "writings:proverbs:13:15"
        ]
    }
}