{
    "VERSE": "16:124",
    "ARABIC": "إِنَّمَا جُعِلَ ٱلسَّبْتُ عَلَى ٱلَّذِينَ ٱخْتَلَفُوا۟ فِيهِ وَإِنَّ رَبَّكَ لَيَحْكُمُ بَيْنَهُمْ يَوْمَ ٱلْقِيَٰمَةِ فِيمَا كَانُوا۟ فِيهِ يَخْتَلِفُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "The Sabbath was only enjoined on those who differed about it. Your Lord will judge between them on the Day of Rising regarding the things about which they differed.",
        "TRANSLATION_1": "As for the Sabbath, it was imposed on those who had differed about it; and your Lord will tell them on the Day of Resurrection what it was they had differed about.\n",
        "TRANSLATION_2": "As for the Sabbath, it was made incumbent only on those who differed about its laws. Certainly your Lord will judge on the Day of Resurrection between them regarding the matters they disputed.\n",
        "TRANSLATION_3": "(The observance) of the Sabbath was only sanctioned for those who disputed it. Your Lord will certainly issue His decree about their dispute on the Day of Judgment.\n",
        "TRANSLATION_4": "The Sabbath was made obligatory only upon those who differed in it; and indeed your Lord will judge between them on the Day of Resurrection concerning the matter in which they differed.\n",
        "TRANSLATION_5": "The Sabbath was only prescribed for those who differed concerning it, and verily, your Lord will judge between them on the Day of Resurrection about what they differed over.\n",
        "TRANSLATION_6": "The Sabbath was ordained only for those who differed about it, and most surely your Lord will judge between them on the resurrection day concerning that about which they differed.\n",
        "TRANSLATION_7": "The Sabbath was only appointed for those who were at variance thereon; surely thy Lord will decide between them on the Day of Resurrection, touching their differences.\n",
        "TRANSLATION_8": "The Sabbath was appointed only for those who differed concerning it, and lo! thy Lord will judge between them on the Day of Resurrection concerning that wherein they used to differ.\n",
        "TRANSLATION_9": "The Sabbath was only enjoined on those who differed about it. Your Lord will judge between them on the Day of Resurrection regarding the things about which they differed.\n",
        "TRANSLATION_10": "The sabbath was only appointed for those who differed thereon; and verily thy Lord will judge between them on the Judgment-Day concerning that wherein they have been differing.\n",
        "TRANSLATION_11": "The Sabbath was only prescribed for those who differed about it. Your Lord will indeed judge between them on the Day of Resurrection concerning that about which they differ.\n",
        "TRANSLATION_12": "The Sabbath was only made (strict) for those who disagreed (as to its observance); But Allah will judge between them on the Day of Judgment, as to their differences.\n",
        "TRANSLATION_13": "The Sabbath was only prescribed for those who differed concerning it, and verily, your Lord will judge between them on the Day of Resurrection about that wherein they used to differ.\n",
        "TRANSLATION_14": "The Sabbath was ordained only for those who differed about it. On the Day of Resurrection, your Lord will decide the differences that were between them.\n",
        "TRANSLATION_15": "The Sabbath was decreed only for those who differed about it. Your Lord will judge between them on the Day of Resurrection regarding their differences.\n",
        "TRANSLATION_16": "The sabbath was only appointed for those who differed over it. And indeed, your Lord will judge between them on the Day of Resurrection concerning that over which they used to differ.\n",
        "TRANSLATION_17": "[16:124] The Sabbath was only prescribed, in other words, its consecration was made obligatory [only], for those who differed concerning it, with their prophet — these were the Jews. They were commanded to devote themselves solely to worship on Friday, but they said, ‘We do not want it’, and chose Saturday; consequently thereon [the observance of] it was enforced strictly on them; and lo! your Lord will judge between them on the Day of Resurrection, concerning that wherein they used to differ, with regard this matter [of the Sabbath], by rewarding the obedient and chastising the one who disobeyed by [his] violating its sanctity.\n",
        "TRANSLATION_18": "(The Sabbath was appointed) was made sacrosanct (only for those who differed concerning it) concerning the day of Friday, (and lo! thy Lord will judge between them) between the Jews and Christians (on the Day of Resurrection concerning that wherein they used to differ) concerning that which they used to oppose in religion.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "16:124",
            "32:25",
            "10:93",
            "45:17",
            "3:194",
            "22:69",
            "39:31",
            "3:55",
            "68:39",
            "34:18"
        ],
        "BIBLE": [
            "writings:esther:9:31",
            "prophets:i%20samuel:20:23",
            "torah:leviticus:10:19",
            "writings:psalms:2:7",
            "writings:ii%20chronicles:31:3",
            "writings:nehemiah:13:17",
            "writings:ezra:10:14",
            "prophets:ezekiel:44:24",
            "prophets:judges:21:5",
            "prophets:ezekiel:22:26"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:3:2"
        ]
    }
}