{
    "VERSE": "16:127",
    "ARABIC": "وَٱصْبِرْ وَمَا صَبْرُكَ إِلَّا بِٱللَّهِ وَلَا تَحْزَنْ عَلَيْهِمْ وَلَا تَكُ فِى ضَيْقٍ مِّمَّا يَمْكُرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Be patient. But your patience is only by Allah. Do not be grieved by them and do not be constricted by the plots they hatch.",
        "TRANSLATION_1": "Endure with patience, for your endurance is not without the help of God. Do not grieve for them, and do not be distressed by their plots.\n",
        "TRANSLATION_2": "And bear with patience, (O Muhammad) - and your patience is only because of the help of Allah - and do not grieve over them, nor feel distressed by their evil plans.\n",
        "TRANSLATION_3": "Exercise patience and let it be only for the cause of God. Do not be grieved about them nor disappointed at their evil plans.\n",
        "TRANSLATION_4": "And O dear Prophet (Mohammed – peace and blessings be upon him) patiently endure – and your patience is only due to the guidance of Allah – and do not grieve for them, and do not be disheartened by their deceits.\n",
        "TRANSLATION_5": "And be patient, and your patience will not be, but by the help of Allah. And do not grieve over them, and do not be distressed by their plots.\n",
        "TRANSLATION_6": "And be patient and your patience is not but by (the assistance of) Allah, and grieve not for them, and do not distress yourself at what they plan.\n",
        "TRANSLATION_7": "And be patient; yet is thy patience only with the help of God. And do not sorrow for them, nor be thou straitened for what they devise.\n",
        "TRANSLATION_8": "Endure thou patiently (O Muhammad). Thine endurance is only by (the help of) Allah. Grieve not for them, and be not in distress because of that which they devise.\n",
        "TRANSLATION_9": "Endure with patience; truly, your patience is possible only with the help of God. Do not grieve for them, or feel distressed because of their plottings,\n",
        "TRANSLATION_10": "And endure them patiently; and thy patience is not but from Allah; and grieve not over them, and be not thou in straitness because of that which they plot.\n",
        "TRANSLATION_11": "So be steadfast, and you cannot be steadfast except with Allah [’s help]. And do not grieve for them, nor be upset by their guile.\n",
        "TRANSLATION_12": "And do thou be patient, for thy patience is but from Allah; nor grieve over them: and distress not thyself because of their plots.\n",
        "TRANSLATION_13": "And endure you patiently (O Muhammad SAW), your patience is not but from Allah. And grieve not over them (polytheists and pagans, etc.), and be not distressed because of what they plot.\n",
        "TRANSLATION_14": "Be patient; yet your patience is only by the help of Allah. Do not grieve for them (the unbelievers), nor distress yourself because of their devising.\n",
        "TRANSLATION_15": "So be patient. Your patience is solely from God. And do not grieve over them, and do not be stressed by their schemes.\n",
        "TRANSLATION_16": "And be patient, [O Muhammad], and your patience is not but through Allah. And do not grieve over them and do not be in distress over what they conspire.\n",
        "TRANSLATION_17": "[16:127] So be patient, and your patience is only by [the help of] God, [only] by His assistance. And do not grieve for them, that is, [for] the disbelievers if they do not believe, despite your eagerness that they believe, nor be in   distress because of that which they scheme, in other words, do not be concerned with their scheming, for I [God] will make victorious over them.\n",
        "TRANSLATION_18": "(Endure thou patiently) their harm, Muhammad. (Thine endurance is only by (the help of) Allah) by Allah's given success. (Grieve not for them) grieve not for the destruction of those who derided you, (and be not in distress because of that which they devise) because of what they say about you and do to you.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "16:127",
            "27:70",
            "2:15",
            "12:106",
            "11:54",
            "16:56",
            "2:153",
            "27:65",
            "40:4",
            "33:2"
        ],
        "BIBLE": [
            "writings:psalms:83:2",
            "writings:daniel:10:19",
            "prophets:ii%20samuel:7:29",
            "torah:exodus:18:23",
            "writings:nehemiah:13:26",
            "writings:psalms:4:2",
            "writings:ii%20chronicles:14:10",
            "prophets:jeremiah:29:8",
            "writings:psalms:108:2",
            "prophets:jeremiah:14:13"
        ]
    }
}