{
    "VERSE": "16:2",
    "ARABIC": "يُنَزِّلُ ٱلْمَلَٰٓئِكَةَ بِٱلرُّوحِ مِنْ أَمْرِهِۦ عَلَىٰ مَن يَشَآءُ مِنْ عِبَادِهِۦٓ أَنْ أَنذِرُوٓا۟ أَنَّهُۥ لَآ إِلَٰهَ إِلَّآ أَنَا۠ فَٱتَّقُونِ",
    "ENGLISH": {
        "TRANSLATION_0": "He sends down angels with the Ruh of His command to any of His slaves He wills: 'Give warning that there is no god but Me, so have taqwa of Me!'",
        "TRANSLATION_1": "He sends the angels with revelation by His command, to any of His creatures as He please, (saying): \"Warn that there is no god but I, so fear Me.\"\n",
        "TRANSLATION_2": "He sends down this spirit (of prophecy) by His command through His angels on any of His servants whom He wills, (directing them): \"Warn people that there is no deity but Me; so hold Me alone in fear.\"\n",
        "TRANSLATION_3": "He sends the angels with the Spirit to carry His orders to whichever of His servants He wants so that they would warn people that He is the only God and that people must have fear of Him.\n",
        "TRANSLATION_4": "He sends down the angels with the soul of faith – the divine revelations – towards those among His bondmen He wills that, “There is no worship except for Me, therefore fear Me.”\n",
        "TRANSLATION_5": "He sends down the angels with the Ruh (revelation) of His command to those servants of His whom He wills (saying): \"Warn mankind that none has the right to be worshipped but I, so have Taqwa of Me.\"\n",
        "TRANSLATION_6": "He sends down the angels with the inspiration by His commandment on whom He pleases of His servants, saying: Give the warning that there is no god but Me, therefore be careful (of your duty) to Me.\n",
        "TRANSLATION_7": "He sends down the angels with the Spirit of His command upon whomsoever He will among His servants, saying: Give you warning that there is no God but I; so fear you Me!\n",
        "TRANSLATION_8": "He sendeth down the angels with the Spirit of His command unto whom He will of His bondmen, (saying): Warn mankind that there is no Allah save Me, so keep your duty unto Me.\n",
        "TRANSLATION_9": "He sends down the angels with revelations by His command to whoever of His servants He pleases, saying, \"Warn mankind that there is no god save Me, so fear Me.\"\n",
        "TRANSLATION_10": "He sendeth down the angels with the spirit by His command upon whomsoever of his bondmen He willeth: warn that there is no god but I, wherefore fear Me.\n",
        "TRANSLATION_11": "He sends down the angels with the spirit of His command to whomever He wishes of His servants: ‘Warn [the people] that there is no god except Me; so be wary of Me.’\n",
        "TRANSLATION_12": "He doth send down His angels with inspiration of His Command, to such of His servants as He pleaseth, (saying): \"Warn (Man) that there is no god but I: so do your duty unto Me.\"\n",
        "TRANSLATION_13": "He sends down the angels with inspiration of His Command to whom of His slaves He pleases (saying): \"Warn mankind that La ilaha illa Ana (none has the right to be worshipped but I), so fear Me (by abstaining from sins and evil deeds).\n",
        "TRANSLATION_14": "He sends down the angels with the Spirit (Gabriel) by His command to those of His worshipers whom He chooses, (saying:) 'Warn, there is no god except Me, therefore fear Me'\n",
        "TRANSLATION_15": "He sends down the angels with the Spirit by His command, upon whom He wills of His servants: “Give warning that there is no god but Me, and fear Me.”\n",
        "TRANSLATION_16": "He sends down the angels, with the inspiration of His command, upon whom He wills of His servants, [telling them], \"Warn that there is no deity except Me; so fear Me.\"\n",
        "TRANSLATION_17": "[16:2] He sends down the angels, namely, Gabriel, with the Spirit, with the Revelation, of His command, by His will, to whomever He will of His servants, and these are the prophets, [saying] that (an is explicative): Warn, threaten the disbelievers with chastisement and make them aware, that there is no God save Me: so fear Me, fear Me.\n",
        "TRANSLATION_18": "(He sendeth down the angels) i.e. Gabriel and the angels with him (with the Spirit of His command) with prophethood and scripture by His command (unto whom He will of His bondmen) He means Muhammad and other prophets, ((saying): Warn mankind) warn mankind by means of the Qur'an and recite it until they say (that there is no god save Me, so keep your duty unto Me) so obey me and profess my divine Oneness.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "16:2",
            "40:44",
            "18:110",
            "42:52",
            "28:82",
            "4:172",
            "14:11",
            "2:210",
            "40:15",
            "41:30"
        ],
        "BIBLE": [
            "prophets:jeremiah:35:15",
            "prophets:ezekiel:3:20",
            "writings:ii%20chronicles:35:21",
            "writings:ii%20chronicles:6:27",
            "prophets:i%20kings:17:19",
            "prophets:ii%20kings:4:43",
            "prophets:i%20samuel:20:40",
            "torah:exodus:36:6",
            "prophets:i%20samuel:11:3",
            "prophets:jeremiah:44:20"
        ]
    }
}