{
    "VERSE": "16:21",
    "ARABIC": "أَمْوَٰتٌ غَيْرُ أَحْيَآءٍ وَمَا يَشْعُرُونَ أَيَّانَ يُبْعَثُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "They are dead, not alive, and they are not aware of when they will be raised.",
        "TRANSLATION_1": "Dead, without life they are, and do not know when they will be raised.\n",
        "TRANSLATION_2": "they are dead, not living. They do not even know when they will be resurrected.\n",
        "TRANSLATION_3": "They are not living but are dead. They can not know when they will be raised.\n",
        "TRANSLATION_4": "They are dead, not alive; and they do not know when will the people be raised.\n",
        "TRANSLATION_5": "(They are) dead, not alive; and they do not know when they will be resurrected.\n",
        "TRANSLATION_6": "Dead (are they), not living, and they know not when they shall be raised.\n",
        "TRANSLATION_7": "dead, not alive; and are not aware when they shall be raised.\n",
        "TRANSLATION_8": "(They are) dead, not living. And they know not when they will be raised.\n",
        "TRANSLATION_9": "They are dead, not living; nor do they know when they will be raised to life.\n",
        "TRANSLATION_10": "Dead are they, not alive; and they perceive not when they will be raised up.\n",
        "TRANSLATION_11": "They are dead and lifeless, and are not aware when they will be resurrected.\n",
        "TRANSLATION_12": "(They are things) dead, lifeless: nor do they know when they will be raised up.\n",
        "TRANSLATION_13": "(They are) dead, lifeless, and they know not when they will be raised up.\n",
        "TRANSLATION_14": "They are dead, not living; and they do not know when they will be raised (to life).\n",
        "TRANSLATION_15": "They are dead, not alive; and they do not know when they will be resurrected.\n",
        "TRANSLATION_16": "They are, [in fact], dead, not alive, and they do not perceive when they will be resurrected.\n",
        "TRANSLATION_17": "[16:21] They are dead, possessing no life (amwātun, ‘dead’, is a second predicate), not living (an emphasis), and they, the idols, are not aware when, is the time [in which], they shall be raised, that is, creatures: so how can they be worshipped? For, only the Creator, the Living, the Knower of the Unseen can be a God.\n",
        "TRANSLATION_18": "((They are) dead) they are lifeless idols, (not living. And they know not when they) i.e. the idols (will be raised) from the graves and give account; it is also said that this means: the disbelievers do not know when they will give account for their deeds; and it is also said: the angels do not know when they will give account.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "16:21",
            "77:26",
            "3:27",
            "35:22",
            "39:30",
            "30:55",
            "45:21",
            "37:58",
            "30:19",
            "17:75"
        ],
        "BIBLE": [
            "writings:ecclesiastes:9:5",
            "prophets:hosea:6:2",
            "prophets:i%20samuel:11:4",
            "prophets:ezekiel:24:19",
            "writings:proverbs:30:18",
            "prophets:i%20samuel:2:23",
            "writings:psalms:101:4",
            "torah:leviticus:5:17",
            "prophets:i%20samuel:20:33",
            "writings:ecclesiastes:4:2"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:2",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:4:2",
            "Sefer%20Yetzirah:1:4"
        ]
    }
}