{
    "VERSE": "16:24",
    "ARABIC": "وَإِذَا قِيلَ لَهُم مَّاذَآ أَنزَلَ رَبُّكُمْ قَالُوٓا۟ أَسَٰطِيرُ ٱلْأَوَّلِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "When they are asked, 'What has your Lord sent down?' they say, 'Myths and legends of previous peoples.'",
        "TRANSLATION_1": "For when they are asked: \"What has your Lord sent down?\" they say: \"Tales of long ago.\"\n",
        "TRANSLATION_2": "When they are asked: \"What is it that your Lord has revealed?\" They answer: \"They are merely tales of olden times!\"\n",
        "TRANSLATION_3": "When they are asked, \"What has your Lord revealed to you?\" they say, \"Only ancient legends\".\n",
        "TRANSLATION_4": "And when it is said to them, “What has your Lord sent down?”, they say, “The tales of former people.”\n",
        "TRANSLATION_5": "And when it is said to them: \"What is it that your Lord has revealed\" They say: \"Tales of the men of old!\"\n",
        "TRANSLATION_6": "And when it is said to them, what is it that your Lord has revealed? They say: Stories of the ancients;\n",
        "TRANSLATION_7": "And when it is said to them, 'What has your Lord sent down?' they say, 'Fairy-tales of the ancients.'\n",
        "TRANSLATION_8": "And when it is said unto them: What hath your Lord revealed? they say: (Mere) fables of the men of old,\n",
        "TRANSLATION_9": "When they are asked, \"What is it that your Lord has sent down?\" they say, \"Stories of the ancients.\"\n",
        "TRANSLATION_10": "And when it is said unto them: what is it that your Lord hath sent down? they say: fables of the ancient.\n",
        "TRANSLATION_11": "When they are asked, ‘What is it that your Lord has sent down?’ They say, ‘Myths of the ancients,’\n",
        "TRANSLATION_12": "When it is said to them, \"What is it that your Lord has revealed?\" they say, \"Tales of the ancients!\"\n",
        "TRANSLATION_13": "And when it is said to them: \"What is it that your Lord has sent down (unto Muhammad SAW)?\" They say: \"Tales of the men of old!\"\n",
        "TRANSLATION_14": "And if they are asked: 'What has your Lord revealed' they say: 'Tales of the ancients, fairytales'\n",
        "TRANSLATION_15": "And when it is said to them, “What has your Lord sent down?” They say, “Legends of the ancients.”\n",
        "TRANSLATION_16": "And when it is said to them, \"What has your Lord sent down?\" They say, \"Legends of the former peoples,\"\n",
        "TRANSLATION_17": "[16:24] The following was revealed regarding al-Nadr b. al-Hārith: And when it is said to them, ‘What is it (mā is an interrogative particle; dhā is a relative particle) that your Lord has revealed?’, to Muhammad (s), they say, [that] these [revelations] are, ‘fables, lies, of the ancients’, in order to lead people astray.\n",
        "TRANSLATION_18": "284 (And when it is said unto them) to those who were later killed in the valley of Badr: (What hath your Lord revealed?) What does Muhammad (pbuh) say to you on behalf of your Lord? (they say: (Mere) fables of the men of old) the mere lies and tales of the people of old.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "16:24",
            "26:26",
            "25:5",
            "68:15",
            "83:13",
            "26:51",
            "37:126",
            "44:8",
            "25:64",
            "39:12"
        ],
        "BIBLE": [
            "torah:exodus:19:8",
            "prophets:zechariah:1:10",
            "torah:exodus:12:33",
            "writings:job:2:4",
            "prophets:i%20kings:18:22",
            "prophets:habakkuk:2:2",
            "writings:ii%20chronicles:34:23",
            "prophets:ii%20kings:22:15",
            "prophets:jonah:1:10",
            "prophets:jeremiah:26:16"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:4:11",
            "Sefer%20Yetzirah:3:4",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:4:9"
        ]
    }
}