{
    "VERSE": "16:27",
    "ARABIC": "ثُمَّ يَوْمَ ٱلْقِيَٰمَةِ يُخْزِيهِمْ وَيَقُولُ أَيْنَ شُرَكَآءِىَ ٱلَّذِينَ كُنتُمْ تُشَٰٓقُّونَ فِيهِمْ قَالَ ٱلَّذِينَ أُوتُوا۟ ٱلْعِلْمَ إِنَّ ٱلْخِزْىَ ٱلْيَوْمَ وَٱلسُّوٓءَ عَلَى ٱلْكَٰفِرِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Then on the Day of Rising He will disgrace them, and say, 'Where are My partner gods for whose sake you became so hostile?' Those given knowledge will say, Today there is disgrace and evil for the kafirun.'",
        "TRANSLATION_1": "On the Day of Resurrection He will disgrace them and ask: \"Where are My compeers for whom you contended?\" Those endowed with knowledge will say: \"Shame and evil surely are for unbelievers today.\"\n",
        "TRANSLATION_2": "And again, on the Day of Resurrection, He will bring them to disgrace, and say: \"Tell Me, now, where are those to whom you ascribed a share in My Divinity, and for whose sake you disputed (with the upholders of the Truth)?\" Those who were endowed with knowledge (in the world) will say: \"Surely today humiliation and misery shall be the lot of the unbelievers\";\n",
        "TRANSLATION_3": "God will humiliate them on the Day of Judgment and ask them, \"Where are the idols which you had considered equal to Me and which were the cause of hostility and animosity among you?\" The people who were given knowledge will say, \"It is the unbelievers who face disgrace and trouble on this day.\"\n",
        "TRANSLATION_4": "Then on the Day of Resurrection He will disgrace them and proclaim, “Where are My partners, concerning whom you disputed”; the people of knowledge will say, “All disgrace and evil is upon the disbelievers this day.”\n",
        "TRANSLATION_5": "Then, on the Day of Resurrection, He will disgrace them and will say: \"Where are My (so-called) partners, those over which you caused so much discord\" Those who have been given the knowledge will say: \"Indeed it is a Day of disgrace and misery for the disbelievers.\"\n",
        "TRANSLATION_6": "Then on the resurrection day He will bring them to disgrace and say: Where are the associates you gave Me, for whose sake you became hostile? Those who are given the knowledge will say: Surely the disgrace and the evil are this day upon the unbelievers:\n",
        "TRANSLATION_7": "Then on the Day of Resurrection He will degrade them, saying, 'Where are My associates concerning which you made a breach together?' Those that were given the knowledge will say, 'Degradation today and evil are on the unbelievers,\n",
        "TRANSLATION_8": "Then on the Day of Resurrection He will disgrace them and will say: Where are My partners, for whose sake ye opposed (My guidance)? Those who have been given knowledge will say: Disgrace this day and evil are upon the disbelievers,\n",
        "TRANSLATION_9": "Then on the Day of Resurrection He will disgrace them, and say, \"Where are My partners for whose sake you opposed [My guidance]?\" Those given knowledge will say, \"This Day humiliation and affliction will surely befall those who have been denying the truth.\"\n",
        "TRANSLATION_10": "Then on the Judgment-Day He will humiliate them and say: where are My associates regarding whom ye have been causing cleavage? Those who have been vouchsafed knowledge will say: verily the humiliation to-day and ill-hap are upon the infidels-\n",
        "TRANSLATION_11": "Then, on the Day of Resurrection, He will disgrace them, and say, ‘Where are My “partners” for whose sake you used to defy [Allah]?’ Those who were given knowledge will say, ‘Indeed today disgrace and distress pursue the faithless.’\n",
        "TRANSLATION_12": "Then, on the Day of Judgment, He will cover them with shame, and say: \"Where are My 'partners' concerning whom ye used to dispute (with the godly)?\" Those endued with knowledge will say: \"This Day, indeed, are the Unbelievers covered with shame and misery,-\n",
        "TRANSLATION_13": "Then, on the Day of Resurrection, He will disgrace them and will say: \"Where are My (so called) 'partners' concerning whom you used to disagree and dispute (with the believers, by defying and disobeying Allah)?\" Those who have been given the knowledge (about the Torment of Allah for the disbelievers) will say: \"Verily! Disgrace this Day and misery are upon the disbelievers.\n",
        "TRANSLATION_14": "He will degrade them on the Day of Resurrection. He will say: 'Where are My partners, for whose sake you opposed' And those to whom knowledge has been given will say: 'Degradation today and evil are on the unbelievers,\n",
        "TRANSLATION_15": "Then, on the Day of Resurrection, He will disgrace them, and say, “Where are My associates for whose sake you used to dispute?” Those who were given knowledge will say, “Today shame and misery are upon the disbelievers.”\n",
        "TRANSLATION_16": "Then on the Day of Resurrection He will disgrace them and say, \"Where are My 'partners' for whom you used to oppose [the believers]?\" Those who were given knowledge will say, \"Indeed disgrace, this Day, and evil are upon the disbelievers\" -\n",
        "TRANSLATION_17": "[16:27] Then on the Day of Resurrection He will disgrace them, humiliate them, and He, God, will say, to them by the tongues of the angels, in rebuke: ‘Where are those associates of Mine, as you [were wont to] claim, concerning whom, for whose sake, you used to make breaches?’, you used to opposed the believers. Those who were given knowledge, from among the prophets and believers, will say, ‘Truly disgrace on this day, as well as misfortune, are for the disbelievers — they say this rejoicing at their [the disbelievers’] misfortune —\n",
        "TRANSLATION_18": "(Then on the Day of Resurrection He will disgrace them) chastise and humiliate them (and will say) Allah will say on the Day of Judgement: (Where are My partners) where are the idols which you claimed are My partners, (for whose sake ye opposed (My Guidance)) for whose sake you opposed My guidance and declared enmity towards My prophets? (Those who have been given knowledge) i.e. the angels (will say: Disgrace this day) the chastisement on this Day of Judgement (and evil) the Fire and hardship (are upon the disbelievers),\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "16:27",
            "28:62",
            "28:74",
            "23:16",
            "40:32",
            "21:74",
            "6:22",
            "16:25",
            "40:30",
            "41:47"
        ],
        "BIBLE": [
            "prophets:i%20kings:9:13",
            "torah:genesis:30:6",
            "torah:genesis:30:18",
            "prophets:i%20kings:18:26",
            "torah:genesis:49:1",
            "torah:exodus:36:6",
            "prophets:isaiah:65:1",
            "writings:ii%20chronicles:19:6",
            "prophets:jeremiah:7:14",
            "prophets:ezekiel:38:16"
        ]
    }
}