{
    "VERSE": "16:35",
    "ARABIC": "وَقَالَ ٱلَّذِينَ أَشْرَكُوا۟ لَوْ شَآءَ ٱللَّهُ مَا عَبَدْنَا مِن دُونِهِۦ مِن شَىْءٍ نَّحْنُ وَلَآ ءَابَآؤُنَا وَلَا حَرَّمْنَا مِن دُونِهِۦ مِن شَىْءٍ كَذَٰلِكَ فَعَلَ ٱلَّذِينَ مِن قَبْلِهِمْ فَهَلْ عَلَى ٱلرُّسُلِ إِلَّا ٱلْبَلَٰغُ ٱلْمُبِينُ",
    "ENGLISH": {
        "TRANSLATION_0": "The idolaters say, 'If Allah had willed we would not have worshipped anything apart from Him, neither we nor our fathers, nor would we have forbidden anything without His say.' Those before them said the same. Are the Messengers responsible for anything but clear transmission?",
        "TRANSLATION_1": "The idolaters say: \"If God had willed we would not have worshipped anything apart from Him, nor would our fathers have done, nor would we have forbidden any thing without His (leave).\" So had the people done before them. Therefore it is binding on the prophets to convey the message in clearest terms.\n",
        "TRANSLATION_2": "Those who associate others with Allah in His Divinity say: \"Were Allah to will so, neither we nor our forefathers would have worshipped any other than Him, nor would we have prohibited anything without His command.\" Their predecessors proffered similar excuses. Do the Messengers have any other duty but to plainly convey the Message?\n",
        "TRANSLATION_3": "The pagans had said, \"Had God wanted we would not have worshipped anything other than Him, nor would our fathers. We would not have forbidden anything without (a command from) Him.\" The same thing was said by the people who lived before them. Are the Messengers expected to do more than just preach?\n",
        "TRANSLATION_4": "And the polytheists said, “Had Allah willed, we would not have worshipped anything besides Him – neither we nor our forefathers – and nor would we have forbidden anything, whilst being disassociated with Him”; those before them did exactly this; so what is (incumbent) upon the Noble Messengers, except to plainly convey (the message)?\n",
        "TRANSLATION_5": "And those who worshipped others with Allah said: \"If Allah had so willed, neither we nor our fathers would have worshipped any but Him nor would we have forbidden anything without (a command from) Him.\" Those before them did the same. Then! Are the Messengers charged with anything but to clearly convey the Message\n",
        "TRANSLATION_6": "And they who give associates (to Allah) say: If Allah had pleased, we would not have served anything besides Allah, (neither) we nor our fathers, nor would we have prohibited anything without (order from) Him. Thus did those before them; is then aught incumbent upon the apostles except a plain delivery (of the message)?\n",
        "TRANSLATION_7": "The idolators say, 'If God had willed we would not have served; apart from Him, anything, neither we nor our fathers, nor would we have forbidden, apart from Him, anything.' So did those before them; yet is aught for the Messengers, but to deliver the manifest Message?\n",
        "TRANSLATION_8": "And the idolaters say: Had Allah willed, we had not worshipped aught beside Him, we and our fathers, nor had we forbidden aught without (command from) Him. Even so did those before them. Are the messengers charged with aught save plain conveyance (of the message)?\n",
        "TRANSLATION_9": "Those who associate [others with God] say, \"If God had so willed we would not have worshipped anything besides Him, neither we nor our fathers, nor would we have forbidden anything without His sanction.\" So did those who went before them. The duty of the messengers is only to convey the message clearly.\n",
        "TRANSLATION_10": "And those who associate say: had God willed we would not have worshipped aught beside Him, neither we nor our fathers, nor we would have forbidden aught without Him. Like-wise did those before them. Naught is then on the apostles except a preaching plain.\n",
        "TRANSLATION_11": "The polytheists say, ‘Had Allah wished, we would not have worshiped anything besides Him—neither we, nor our fathers—nor we would have forbidden anything without His sanction.’ Those who were before them had acted likewise. Is the apostles’ duty anything but to communicate in clear terms?\n",
        "TRANSLATION_12": "The worshippers of false gods say: \"If Allah had so willed, we should not have worshipped aught but Him - neither we nor our fathers,- nor should we have prescribed prohibitions other than His.\" So did those who went before them. But what is the mission of messengers but to preach the Clear Message?\n",
        "TRANSLATION_13": "And those who join others in worship with Allah say: \"If Allah had so willed, neither we nor our fathers would have worshipped aught but Him, nor would we have forbidden anything without (Command from) Him.\" So did those before them. Then! Are the Messengers charged with anything but to convey clearly the Message?\n",
        "TRANSLATION_14": "The idolaters say: 'Had Allah willed, neither we nor our fathers would have worshipped anything other than Him, nor would we have forbidden anything without Him', as such did those before them. Yet what should Messengers do but give a clear deliverance?\n",
        "TRANSLATION_15": "The idolaters say, “Had God willed, we would not have worshiped anything besides Him, neither us, nor our ancestors, nor would we have prohibited anything besides His prohibitions.” Those before them did likewise. Are the messengers responsible for anything but clear communication?\n",
        "TRANSLATION_16": "And those who associate others with Allah say, \"If Allah had willed, we would not have worshipped anything other than Him, neither we nor our fathers, nor would we have forbidden anything through other than Him.\" Thus did those do before them. So is there upon the messengers except [the duty of] clear notification?\n",
        "TRANSLATION_17": "[16:35] And the idolaters, from among the Meccans, say, ‘Had God willed we would not have worshipped anything besides Him — neither we, nor our fathers — nor would we have deemed anything sacred besides Him’, in the way of those [camels] called bahīras and sā’iba. In other words, our idolatry and our deeming [these animals] sacred are [effected] by His will; therefore He must be satisfied with this. God, exalted He be, says: So did those before them, that is, they denied their messengers regarding that which they [the messengers] brought them. Yet are messengers charged with anything save plain conveyance [of the Message]? It is not their duty to guide.\n",
        "TRANSLATION_18": "(And the idolaters) the people of Mecca (say: Had Allah willed, we had not worshipped aught beside Him) of idols, (we and our fathers) before us, (nor had we forbidden aught) of al-Bahirah, al-Sa'ibah, al-Wasilah and al-Ham (without (command from) Him) for it is indeed Allah who commanded us to do so. (Even so) just as did your people lie about Allah by forbidding some crops and cattle, so (did those before them) lie about Allah. (Are the messengers charged) the messengers are entrusted (with aught save plain) in a plain language (conveyance (of the message)) from Allah?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "16:35",
            "40:74",
            "5:104",
            "6:148",
            "24:54",
            "5:99",
            "16:20",
            "43:45",
            "21:66",
            "3:144"
        ],
        "BIBLE": [
            "prophets:ii%20kings:17:15",
            "writings:ii%20chronicles:28:9",
            "prophets:ii%20kings:17:35",
            "prophets:joshua:24:2",
            "prophets:jeremiah:16:11",
            "prophets:ii%20kings:5:13",
            "prophets:jeremiah:5:19",
            "prophets:jeremiah:44:3",
            "prophets:i%20samuel:14:28",
            "writings:ii%20chronicles:32:13"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:3:2",
            
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:5:1"
        ]
    }
}