{
    "VERSE": "16:38",
    "ARABIC": "وَأَقْسَمُوا۟ بِٱللَّهِ جَهْدَ أَيْمَٰنِهِمْ لَا يَبْعَثُ ٱللَّهُ مَن يَمُوتُ بَلَىٰ وَعْدًا عَلَيْهِ حَقًّا وَلَٰكِنَّ أَكْثَرَ ٱلنَّاسِ لَا يَعْلَمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "They swear by Allah with their most earnest oaths that Allah will not raise up those who die, when, on the contrary, it is a binding promise on Him; but most people do not know it.",
        "TRANSLATION_1": "They swear emphatically in the name of God that God will not raise the dead. On the contrary, it is a promise incumbent on Him, though most men do not understand,\n",
        "TRANSLATION_2": "They swear most solemnly in the name of Allah and say: \"Allah shall not raise to life any who dies.\" (Yes, He will do so); that is a promise by which He is bound, even though most people do not know that.\n",
        "TRANSLATION_3": "They strongly swear by God that God will not bring the dead to life. God's promise (of the Resurrection) will certainly come true but many people do not know.\n",
        "TRANSLATION_4": "And they swore by Allah most vehemently in their oaths that, “Allah will not raise up the dead”; yes He will, why not? A true promise obligatory upon Him, but most men do not know.\n",
        "TRANSLATION_5": "And they swear by Allah with their strongest oaths, that Allah will not raise up one who dies. Yes, (He will raise them up), a promise (binding) upon Him in truth, but most of mankind know not.\n",
        "TRANSLATION_6": "And they swear by Allah with the most energetic of their oaths: Allah will not raise up him who dies. Yea! it is a promise binding on Him, quite true, but most people do not know;\n",
        "TRANSLATION_7": "have sworn by God the most earnest oaths God will never raise up him who dies; nay, it is a promise binding upon Him, but most men know not,\n",
        "TRANSLATION_8": "And they swear by Allah their most binding oaths (that) Allah will not raise up him who dieth. Nay, but it is a promise (binding) upon Him in truth, but most of mankind know not,\n",
        "TRANSLATION_9": "They swear their strongest oaths by God that God will never raise the dead to life -- nonetheless, it is a promise truly binding on Him, even though most people do not realize it --\n",
        "TRANSLATION_10": "And they swear by God the most solemn of oaths that God would not raise him who dieth. Yea! it is a promise on Him incumbent but most of mankind know not.\n",
        "TRANSLATION_11": "They swear by Allah with solemn oaths that Allah will not resurrect those who die. Yes indeed [He will], it is a promise binding upon Him, but most people do not know,\n",
        "TRANSLATION_12": "They swear their strongest oaths by Allah, that Allah will not raise up those who die: Nay, but it is a promise (binding) on Him in truth: but most among mankind realise it not.\n",
        "TRANSLATION_13": "And they swear by Allah their strongest oaths, that Allah will not raise up him who dies. Yes, (He will raise them up), a promise (binding) upon Him in truth, but most of mankind know not.\n",
        "TRANSLATION_14": "They solemnly swear by Allah that Allah will never raise the dead to life. No, surely the promise of Allah is binding upon Him, though most people do not know.\n",
        "TRANSLATION_15": "And they swear by God with their most solemn oaths, “God will not resurrect anyone who dies.” Yes indeed, it is a promise binding on Him, but most people do not know.\n",
        "TRANSLATION_16": "And they swear by Allah their strongest oaths [that] Allah will not resurrect one who dies. But yes - [it is] a true promise [binding] upon Him, but most of the people do not know.\n",
        "TRANSLATION_17": "[16:38] And they swear by God their most earnest oaths, in other words, with their utmost earnestness therein, that God will not resurrect the dead. God, exalted be He, says: Nay, He will resurrect them: it is a promise binding upon Him (both wa‘dan and haqqan are verbal nouns, used for emphasis, and are in the accusative because of the verbal actions implicit in them; in other words, He promised that and made it a binding truth) but most people, that is, the people of Mecca, do not know, that.\n",
        "TRANSLATION_18": "(And they swear by Allah their most binding oaths) when a man swears by Allah, he swears by his most 286 binding oaths ((that) Allah will not raise up him who dieth) that is after he dies. (Nay, but it is a promise (binding) upon Him) upon Allah (in truth) that He will raise again him who dies is incumbent and it will surely happen, (but most of mankind) the people of Mecca (know not) this nor believe in it,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "16:38",
            "30:6",
            "10:55",
            "28:13",
            "45:26",
            "10:36",
            "35:5",
            "30:60",
            "47:3",
            "40:61"
        ],
        "BIBLE": [
            "prophets:i%20kings:12:22",
            "prophets:joshua:5:4",
            "prophets:ezekiel:3:18",
            "prophets:ii%20kings:5:8",
            "prophets:i%20kings:17:18",
            "writings:esther:4:11",
            "prophets:ezekiel:38:14",
            "torah:genesis:19:8",
            "prophets:joel:2:27",
            "prophets:zechariah:8:8"
        ]
    }
}