{
    "VERSE": "16:4",
    "ARABIC": "خَلَقَ ٱلْإِنسَٰنَ مِن نُّطْفَةٍ فَإِذَا هُوَ خَصِيمٌ مُّبِينٌ",
    "ENGLISH": {
        "TRANSLATION_0": "He created man from a drop of sperm and yet he is an open challenger!",
        "TRANSLATION_1": "Man He created from a drop of semen; and still he becomes an open contender.\n",
        "TRANSLATION_2": "He created man out of a mere drop of fluid, and lo! he turned into an open wrangler.\n",
        "TRANSLATION_3": "He created the human being from a drop of fluid but the human being openly disputes His Word.\n",
        "TRANSLATION_4": "He created man from a drop of fluid, yet he is an open quarreller!\n",
        "TRANSLATION_5": "He has created man from a Nutfah, then behold, this same (man) becomes an open opponent.\n",
        "TRANSLATION_6": "He created man from a small seed and lo! he is an open contender.\n",
        "TRANSLATION_7": "He created man of a sperm-drop; and, behold, he is a manifest adversary.\n",
        "TRANSLATION_8": "He hath created man from a drop of fluid, yet behold! he is an open opponent.\n",
        "TRANSLATION_9": "He created man out of a [mere] drop of sperm: yet he shows himself to be openly contentious!\n",
        "TRANSLATION_10": "He hath created man from a drop, and Lo! he is a disputer open.\n",
        "TRANSLATION_11": "He created man from a drop of [seminal] fluid, and, behold, he is an open contender!\n",
        "TRANSLATION_12": "He has created man from a sperm-drop; and behold this same (man) becomes an open disputer!\n",
        "TRANSLATION_13": "He has created man from Nutfah (mixed drops of male and female sexual discharge), then behold, this same (man) becomes an open opponent.\n",
        "TRANSLATION_14": "He created mankind from a sperm drop, yet he is a clear adversary.\n",
        "TRANSLATION_15": "He created the human being from a drop of fluid, yet he becomes an open adversary.\n",
        "TRANSLATION_16": "He created man from a sperm-drop; then at once, he is a clear adversary.\n",
        "TRANSLATION_17": "[16:4] He created man from a drop of fluid, of sperm, until He makes him strong and tough, yet behold! he is disputatious, extremely quarrelsome, openly, making this [disputatiousness] clear in his rejection of resurrection, contending: Who shall revive the bones when they are decayed? [Q. 36:78].\n",
        "TRANSLATION_18": "(He hath created man) the reference here is to Ubayy Ibn Khalaf al-Jumahi (from a drop of) stinking (fluid, yet behold! he is an open opponent) openly arguing in favour of falsehood, saying: Who will revive these bones when they rot away?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "16:4",
            "36:77",
            "53:46",
            "80:24",
            "55:3",
            "76:2",
            "80:19",
            "80:17",
            "99:3",
            "55:14"
        ],
        "BIBLE": [
            "prophets:ii%20samuel:19:15",
            "writings:ecclesiastes:2:12",
            "prophets:i%20samuel:10:6",
            "writings:psalms:40:5",
            "prophets:ezekiel:26:2",
            "prophets:zechariah:13:7",
            "prophets:isaiah:29:21",
            "prophets:ii%20kings:23:16",
            "torah:genesis:18:22",
            "prophets:judges:20:41"
        ]
    }
}