{
    "VERSE": "16:41",
    "ARABIC": "وَٱلَّذِينَ هَاجَرُوا۟ فِى ٱللَّهِ مِنۢ بَعْدِ مَا ظُلِمُوا۟ لَنُبَوِّئَنَّهُمْ فِى ٱلدُّنْيَا حَسَنَةً وَلَأَجْرُ ٱلْءَاخِرَةِ أَكْبَرُ لَوْ كَانُوا۟ يَعْلَمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "As for those who make hijra for Allah's sake after being wronged, We shall give them good lodging in this world, and the reward of the Next World is greater still if they only knew",
        "TRANSLATION_1": "Those who left their homes in the cause of God after having been oppressed, will be given by Us a better place in the world, and if they knew, the guerdon of the next would be greater\n",
        "TRANSLATION_2": "As for those who have forsaken their homes for the sake of Allah after enduring persecution, We shall certainly grant them a good abode in this world; and surely the reward of the Hereafter is much greater. If they could but know (what an excellent end awaits)\n",
        "TRANSLATION_3": "God settles those who leave their homes for His cause after having suffered injustice, in a prosperous dwelling in this life and greater rewards will be theirs in the life to come. Would that they knew this.\n",
        "TRANSLATION_4": "And to those who migrated in Allah's cause after being oppressed, We shall indeed give them a good place in the world, and indeed the reward of the Hereafter is extremely great; if only the people knew!\n",
        "TRANSLATION_5": "And as for those who emigrated for the cause of Allah, after they had been wronged, We will certainly give them good residence in this world, but indeed the reward of the Hereafter will be greater; if they but knew!\n",
        "TRANSLATION_6": "And those who fly for Allah's sake after they are oppressed, We will most certainly give them a good abode in the world, and the reward of the hereafter is certainly much greater, did they but know;\n",
        "TRANSLATION_7": "And those that emigrated in God's cause after they were wronged -- We shall surely lodge them in this world in a goodly lodging, and the wage of the world to come is greater, did they but know;\n",
        "TRANSLATION_8": "And those who became fugitives for the cause of Allah after they had been oppressed, We verily shall give them goodly lodging in the world, and surely the reward of the Hereafter is greater, if they but knew;\n",
        "TRANSLATION_9": "As for those who, after persecution, migrated from their homes for the cause of God, We will provide them with a goodly abode in this life: but truly the reward of the Hereafter will be greater, if they only knew it.\n",
        "TRANSLATION_10": "And those who have emigrated for the sake of Allah after they had been wronged. We shall surely settle them well in the world and the hire of the Hereafter is greater: if they but know!\n",
        "TRANSLATION_11": "Those who migrate for the sake of Allah after they have been wronged, We will surely settle them in a good place in the world, and the reward of the Hereafter is surely greater, had they known\n",
        "TRANSLATION_12": "To those who leave their homes in the cause of Allah, after suffering oppression,- We will assuredly give a goodly home in this world; but truly the reward of the Hereafter will be greater. If they only realised (this)!\n",
        "TRANSLATION_13": "And as for those who emigrated for the Cause of Allah, after suffering oppression, We will certainly give them goodly residence in this world, but indeed the reward of the Hereafter will be greater, if they but knew!\n",
        "TRANSLATION_14": "And those who after they have been wronged emigrated for the Cause of Allah, We will lodge them with a good (life) in this world, but greater still is the wage of the Everlasting Life, if they but knew;\n",
        "TRANSLATION_15": "Those who emigrate for God’s sake after being persecuted, We will settle them in a good place in this world; but the reward of the Hereafter is greater, if they only knew.\n",
        "TRANSLATION_16": "And those who emigrated for [the cause of] Allah after they had been wronged - We will surely settle them in this world in a good place; but the reward of the Hereafter is greater, if only they could know.\n",
        "TRANSLATION_17": "[16:41] And those who emigrated for God’s cause, to establish His religion, after they had been wronged, through harm, [those] from among the people of Mecca — these were the Prophet (s) and his Companions — truly We shall lodge them in this world in a goodly lodging, namely, Medina, and the reward of the Hereafter, that is, Paradise, is surely greater, grander, did they but know, that is, the disbelievers — or those who stayed behind and did not emigrate — [did they but know] the honour that belongs to emigrants, they would have followed them.\n",
        "TRANSLATION_18": "(And those who became fugitives for the cause of Allah) in obedience of Allah from Mecca to Medina (after they had been oppressed) after being tortured by the people of Mecca; the reference here is to 'Ammar Ibn Yasir, Bilal [Ibn Rabah], Suhayb [al-Rumi] and their fellow believers, (We verily shall give them goodly) an honoured and safe land with lawful gains (lodging in the world) in Medina, (and surely the reward of the Hereafter is greater) than that of this worldly life, (if they but knew) and they did know;\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "16:41",
            "39:26",
            "14:27",
            "16:96",
            "16:122",
            "3:148",
            "14:3",
            "33:57",
            "4:74",
            "3:172"
        ],
        "BIBLE": [
            "prophets:i%20samuel:10:13",
            "torah:exodus:18:21",
            "prophets:jeremiah:43:1",
            "prophets:ezekiel:36:36",
            "prophets:ezekiel:38:15",
            "writings:daniel:11:24",
            "prophets:i%20samuel:9:13",
            "prophets:isaiah:41:22",
            "torah:exodus:8:18",
            "prophets:ezekiel:12:16"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:1:1"
        ]
    }
}