{
    "VERSE": "16:42",
    "ARABIC": "ٱلَّذِينَ صَبَرُوا۟ وَعَلَىٰ رَبِّهِمْ يَتَوَكَّلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "- those who are steadfast and put their trust in their Lord.",
        "TRANSLATION_1": "(For) those who persevere and place their trust in their Lord.\n",
        "TRANSLATION_2": "those who remain steadfast and put their trust in their Lord.\n",
        "TRANSLATION_3": "(It is they) who have exercised patience and trust in their Lord.\n",
        "TRANSLATION_4": "Those who patiently endured and who rely only upon Allah.\n",
        "TRANSLATION_5": "(They are) those who remained patient, and put their trust in their Lord.\n",
        "TRANSLATION_6": "Those who are patient and on their Lord do they rely.\n",
        "TRANSLATION_7": "even such men as are patient, and put their trust in their Lord.\n",
        "TRANSLATION_8": "Such as are steadfast and put their trust in Allah.\n",
        "TRANSLATION_9": "They are the ones who are steadfast and put their trust in their Lord.\n",
        "TRANSLATION_10": "They are those who bear with patience, and in their Lord they trust.\n",
        "TRANSLATION_11": "—those who are patient and who put their trust in their Lord.\n",
        "TRANSLATION_12": "(They are) those who persevere in patience, and put their trust on their Lord.\n",
        "TRANSLATION_13": "(They are) those who remained patient (in this world for Allah's sake), and put their trust in their Lord (Allah Alone).\n",
        "TRANSLATION_14": "such are those who are patient, and put their trust in their Lord.\n",
        "TRANSLATION_15": "Those who endure patiently, and in their Lord they put their trust.\n",
        "TRANSLATION_16": "[They are] those who endured patiently and upon their Lord relied.\n",
        "TRANSLATION_17": "[16:42] They are, those who endure, the harm inflicted by the idolaters and [endure] the emigration in order to make manifest the religion, and put their trust in their Lord, so that He provides for them whence they do not reckon.\n",
        "TRANSLATION_18": "(Such as are steadfast) towards the harm of the disbelievers (and put their trust in Allah) and not in any one beside Him; this refers to 'Ammar and his fellow believers.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "16:42",
            "29:59",
            "25:64",
            "23:59",
            "2:46",
            "20:122",
            "84:2",
            "84:5",
            "23:58",
            "23:98"
        ],
        "BIBLE": [
            "prophets:jeremiah:17:7",
            "writings:job:20:4",
            "writings:psalms:146:3",
            "writings:psalms:17:14",
            "writings:psalms:118:8",
            "prophets:ezekiel:36:10",
            "prophets:isaiah:38:11",
            "writings:psalms:40:5",
            "prophets:ezekiel:14:18",
            "prophets:jeremiah:33:10"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:3:5",
            "Sefer%20Yetzirah:3:6",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:3:7",
            "Sefer%20Yetzirah:4:11",
            "Sefer%20Yetzirah:4:10"
        ]
    }
}