{
    "VERSE": "16:43",
    "ARABIC": "وَمَآ أَرْسَلْنَا مِن قَبْلِكَ إِلَّا رِجَالًا نُّوحِىٓ إِلَيْهِمْ فَسْـَٔلُوٓا۟ أَهْلَ ٱلذِّكْرِ إِن كُنتُمْ لَا تَعْلَمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "We have only ever sent before you men who were given Revelation - ask the People of the Reminder if you do not know - who brought Clear Signs and Revealed Books.",
        "TRANSLATION_1": "We sent before you none (as apostles) but men, to whom We sent revelations. In case you are unaware, enquire of those who are keepers of the Oracles of God.\n",
        "TRANSLATION_2": "(O Muhammad), whenever We raised any Messengers before you, they were no other than human beings; (except that) to them We sent revelation. So ask those who possess knowledge if you do not know.\n",
        "TRANSLATION_3": "The Messengers whom We sent before you were mere mortals to whom We had sent with miracles and revelations. Ask those who know about the heavenly Books if you do not know about this.\n",
        "TRANSLATION_4": "And We did not send before you except men, towards whom We sent divine revelations – so O people, ask the people of knowledge if you do not know. (* All the Prophets were men.)\n",
        "TRANSLATION_5": "And We sent not (as Our Messengers) before you (O Muhammad) any but men, whom We sent revelation. So ask Ahl Adh-Dhikr, if you know not.\n",
        "TRANSLATION_6": "And We did not send before you any but men to whom We sent revelation-- so ask the followers of the Reminder if you do not know--\n",
        "TRANSLATION_7": "We sent not any before thee, except men to whom We revealed: 'Question the people of the Remembrance, if it should be that you do not know --\n",
        "TRANSLATION_8": "And We sent not (as Our messengers) before thee other than men whom We inspired - Ask the followers of the Remembrance if ye know not! -\n",
        "TRANSLATION_9": "Before you also the messengers We sent were but [mortal] men to whom We vouchsafed revelation. Ask the People of the Book, if you do not know.\n",
        "TRANSLATION_10": "And We sent not before thee any but men unto whom We Revealed; so ask ye the people of the Admonition if ye know not.\n",
        "TRANSLATION_11": "We did not send [any apostles] before you except as men to whom We revealed. Ask the People of the Reminder if you do not know.\n",
        "TRANSLATION_12": "And before thee also the messengers We sent were but men, to whom We granted inspiration: if ye realise this not, ask of those who possess the Message.\n",
        "TRANSLATION_13": "And We sent not (as Our Messengers) before you (O Muhammad SAW) any but men, whom We inspired, (to preach and invite mankind to believe in the Oneness of Allah). So ask of those who know the Scripture [learned men of the Taurat (Torah) and the Injeel (Gospel)], if you know not.\n",
        "TRANSLATION_14": "We never sent but men before you to whom We revealed, ask the people of the Remembrance, if you do not know.\n",
        "TRANSLATION_15": "We did not send before you except men whom We inspired. So ask the people of knowledge, if you do not know.\n",
        "TRANSLATION_16": "And We sent not before you except men to whom We revealed [Our message]. So ask the people of the message if you do not know.\n",
        "TRANSLATION_17": "[16:43] And We did not send before you anything other than men, to whom We revealed, and [sent] not angels: ‘So ask the followers of the Remembrance, those knowledgeable in the Torah and the Gospels; if you do not know’, that, then they know it, and you are more likely to believe them than the believers are to believe Muhammad (s),\n",
        "TRANSLATION_18": "(And We sent not (as Our messengers) before thee) Muhammad (other than men) human beings like you (whom We inspired) with commands and prohibitions and signs. (Ask the followers of the Remembrance) the followers of the Torah and the Gospel (if ye know not!) that Allah always sent human messengers.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "16:43",
            "21:7",
            "21:25",
            "36:50",
            "28:12",
            "12:109",
            "27:57",
            "29:18",
            "2:4",
            "38:62"
        ],
        "BIBLE": [
            "prophets:ezekiel:38:14",
            "prophets:amos:2:11",
            "prophets:i%20samuel:11:4",
            "prophets:micah:5:4",
            "writings:ii%20chronicles:10:16",
            "prophets:ii%20samuel:23:1",
            "prophets:ii%20kings:5:8",
            "prophets:i%20kings:5:27",
            "writings:nehemiah:5:13",
            "writings:psalms:30:2"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:1:4"
        ]
    }
}