{
    "VERSE": "16:46",
    "ARABIC": "أَوْ يَأْخُذَهُمْ فِى تَقَلُّبِهِمْ فَمَا هُم بِمُعْجِزِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Or that He will not seize them on their travels, something they are powerless to prevent?",
        "TRANSLATION_1": "Or that He will not seize them as they move about, and they will not be able to elude (His grasp);\n",
        "TRANSLATION_2": "or that He will not suddenly seize them while they are going about to and fro and they will be unable to frustrate His design,\n",
        "TRANSLATION_3": "Are they confident that God will not seize them while they are on a journey? They will not be able to escape from God.\n",
        "TRANSLATION_4": "Or that He may seize them while they move here and there, for they cannot escape?\n",
        "TRANSLATION_5": "Or that He may punish them in the midst of their going to and fro (in their livelihood), so that there be no escape for them (from Allah's punishment)\n",
        "TRANSLATION_6": "Or that He may not seize them in the course of their journeys, then shall they not escape;\n",
        "TRANSLATION_7": "Or that He will not seize them in their going to and fro, and they will not be able to frustrate Him?\n",
        "TRANSLATION_8": "Or that He will not seize them in their going to and fro so that there be no escape for them?\n",
        "TRANSLATION_9": "Or that He will not seize them suddenly in their daily activities and they will not be able to frustrate Him?\n",
        "TRANSLATION_10": "Or, thathe will not take hold of them in their going to and fro! so that they cannot escape.\n",
        "TRANSLATION_11": "Or that He will not seize them in the midst of their bustle, whereupon they will not be able to frustrate [Him]?\n",
        "TRANSLATION_12": "Or that He may not call them to account in the midst of their goings to and fro, without a chance of their frustrating Him?-\n",
        "TRANSLATION_13": "Or that He may catch them in the midst of their going to and fro (in their jobs), so that there be no escape for them (from Allah's Punishment)?\n",
        "TRANSLATION_14": "Or, that He will not seize them in their going to and fro, and they will not be able to frustrate Him?\n",
        "TRANSLATION_15": "Or that He will not seize them during their activities? And they will not be able to prevent it.\n",
        "TRANSLATION_16": "Or that He would not seize them during their [usual] activity, and they could not cause failure?\n",
        "TRANSLATION_17": "[16:46] Or that He will not seize them in their going to and fro, during their travels for commerce, whereupon they will not be able to escape?, [whereupon] they will not be able to elude the chastisement.\n",
        "TRANSLATION_18": "(Or that He will not seize them in their going to and fro) in their trade (that there be no escape for them) from Allah's chastisement?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "16:46",
            "51:54",
            "51:45",
            "26:199",
            "83:33",
            "26:94",
            "26:138",
            "68:21",
            "26:60",
            "69:38"
        ],
        "BIBLE": [
            "prophets:ezekiel:19:6",
            "prophets:judges:15:4",
            "writings:psalms:46:6",
            "prophets:i%20samuel:6:9",
            "prophets:i%20samuel:17:35",
            "prophets:joshua:23:14",
            "writings:proverbs:3:26",
            "prophets:i%20kings:1:50",
            "prophets:judges:21:23",
            "writings:i%20chronicles:28:21"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:3:6"
        ]
    }
}