{
    "VERSE": "16:53",
    "ARABIC": "وَمَا بِكُم مِّن نِّعْمَةٍ فَمِنَ ٱللَّهِ ثُمَّ إِذَا مَسَّكُمُ ٱلضُّرُّ فَإِلَيْهِ تَجْـَٔرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Any blessing you have is from Allah. Then when harm touches you, it is to Him you cry for help.",
        "TRANSLATION_1": "Whatsoever the blessings you enjoy are surely from God, and when in trouble you turn to Him in supplication.\n",
        "TRANSLATION_2": "Every bounty that you enjoy is from Allah; and whenever any misfortune strikes you, it is to Him that you cry for the removal of your distress.\n",
        "TRANSLATION_3": "Whatever bounties you have are from God. When hardship befalls you, you begin to cry out to Him.\n",
        "TRANSLATION_4": "And whatever blessings you have, are all from Allah – then whenever misfortune reaches you, towards Him only do you seek refuge.\n",
        "TRANSLATION_5": "And whatever of blessings and good things you have, it is from Allah. Then, when harm touches you, unto Him you cry aloud for help.\n",
        "TRANSLATION_6": "And whatever favor is (bestowed) on you it is from Allah; then when evil afflicts you, to Him do you cry for aid.\n",
        "TRANSLATION_7": "Whatsoever blessing you have, it comes from God; then when affliction visits you it is unto Him that you groan.\n",
        "TRANSLATION_8": "And whatever of comfort ye enjoy, it is from Allah. Then, when misfortune reacheth you, unto Him ye cry for help.\n",
        "TRANSLATION_9": "Whatever blessing you have is from God, and to Him you turn for help when distress befalls you,\n",
        "TRANSLATION_10": "And whatsoever of favours is with you is from Allah; then when distress toucheth you, unto Him ye cry out.\n",
        "TRANSLATION_11": "Whatever blessing you have is from Allah, and when a distress befalls you, you make entreaties to Him.\n",
        "TRANSLATION_12": "And ye have no good thing but is from Allah: and moreover, when ye are touched by distress, unto Him ye cry with groans;\n",
        "TRANSLATION_13": "And whatever of blessings and good things you have, it is from Allah. Then, when harm touches you, unto Him you cry aloud for help.\n",
        "TRANSLATION_14": "Whatever favor you have is from Allah. Whenever you are afflicted you groan to Him.\n",
        "TRANSLATION_15": "Whatever blessing you have is from God. And when harm touches you, it is to Him that you groan.\n",
        "TRANSLATION_16": "And whatever you have of favor - it is from Allah. Then when adversity touches you, to Him you cry for help.\n",
        "TRANSLATION_17": "[16:53] Whatever grace you have, it is from God, none but He brings it (mā, ‘whatever’, is either a conditional or relative [particle]). Then when misfortune, poverty or illness, befalls you, to Him you cry for help, [to Him] you raise your voices with pleas for help and supplications, and you do not call upon any other than Him.\n",
        "TRANSLATION_18": "(And whatever of comfort ye enjoy, it is from Allah) not from the idols. (Then, when misfortune) when hardship (reacheth you, unto Him) unto Allah (ye cry for help) and beseech.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "16:53",
            "40:79",
            "16:114",
            "16:83",
            "3:171",
            "4:61",
            "39:8",
            "47:28",
            "39:66",
            "16:71"
        ],
        "BIBLE": [
            "torah:exodus:23:27",
            "prophets:i%20kings:8:33",
            "prophets:i%20kings:14:13",
            "writings:ii%20chronicles:6:24",
            "torah:exodus:23:13",
            "prophets:i%20kings:1:47",
            "prophets:jeremiah:15:11",
            "writings:job:8:5",
            "prophets:jeremiah:31:13",
            "torah:leviticus:5:13"
        ]
    }
}