{
    "VERSE": "16:57",
    "ARABIC": "وَيَجْعَلُونَ لِلَّهِ ٱلْبَنَٰتِ سُبْحَٰنَهُۥ وَلَهُم مَّا يَشْتَهُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "They allot daughters to Allah - glory be to Him! - while they have what they want!",
        "TRANSLATION_1": "They attribute daughters to God, the glorious, but for themselves whatsoever they please.\n",
        "TRANSLATION_2": "They assign daughters to Allah - glory be to Him - whereas they assign to themselves what they truly desire!\n",
        "TRANSLATION_3": "They ascribe daughters to God, God is too Exalted to have daughters, but they can have whatever they want.\n",
        "TRANSLATION_4": "And they assign daughters to Allah – Purity is to Him! – and assign for themselves what they wish.\n",
        "TRANSLATION_5": "And they assign daughters to Allah! Glorified (and Exalted) is He (above all that they associate with Him!). And for themselves (they assign) what they desire;\n",
        "TRANSLATION_6": "And they ascribe daughters to Allah, glory be to Him; and for themselves (they would have) what they desire.\n",
        "TRANSLATION_7": "And they assign to God daughters; glory be to Him! -- and they have their desire;\n",
        "TRANSLATION_8": "And they assign unto Allah daughters - Be He Glorified! - and unto themselves what they desire;\n",
        "TRANSLATION_9": "They assign daughters to God, glory be to Him!, but for themselves [sons] that they desire to have.\n",
        "TRANSLATION_10": "And they appoint for Allah daughters --hallowed be He! -- and for themselves that which they desire.\n",
        "TRANSLATION_11": "And they attribute daughters to Allah—immaculate is He—while they will have what they desire!\n",
        "TRANSLATION_12": "And they assign daughters for Allah! - Glory be to Him! - and for themselves (sons,- the issue) they desire!\n",
        "TRANSLATION_13": "And they assign daughters unto Allah! Glorified (and Exalted) be He above all that they associate with Him!. And unto themselves what they desire;\n",
        "TRANSLATION_14": "They ascribe daughters to Allah exaltations to Him! But they themselves would have what they desire!\n",
        "TRANSLATION_15": "And they attribute to God daughters—exalted is He—and for themselves what they desire.\n",
        "TRANSLATION_16": "And they attribute to Allah daughters - exalted is He - and for them is what they desire.\n",
        "TRANSLATION_17": "[16:57] And they assign to God daughters, by claiming that the angels are the daughters of God — Be He glorified! — a declaration that He is [exalted] above that which they claim — while they will have what they desire, namely, sons (the status of this sentence is either independent [nominative], or that of an [accusative] object of [the verb] yaj‘alūna, ‘they assign’). The meaning is that to Him they assign daughters, to whom they are averse, when [in any case] He is [exalted] beyond having offspring, while to themselves they assign sons, of their own choosing, so that the best is theirs exclusively — like where God says, Now, ask them: are daughters to be for your Lord, while sons are to be for them? [Q. 37:149].\n",
        "TRANSLATION_18": "288 (And they assign unto Allah daughters) they say: the angels are Allah's daughters. (Be He glorified!) Allah exonerates Himself from having children or partners (and unto themselves what they desire) of sons;\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "16:57",
            "37:159",
            "28:68",
            "6:100",
            "52:43",
            "16:1",
            "30:17",
            "61:4",
            "9:43",
            "9:31"
        ],
        "BIBLE": [
            "prophets:isaiah:30:18",
            "torah:leviticus:15:9",
            "torah:deuteronomy:12:31",
            "torah:leviticus:15:19",
            "writings:psalms:115:3",
            "prophets:ezekiel:14:16",
            "prophets:hosea:9:17",
            "writings:nehemiah:9:5",
            "torah:leviticus:15:26",
            "torah:exodus:15:2"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:1:1"
        ]
    }
}