{
    "VERSE": "16:6",
    "ARABIC": "وَلَكُمْ فِيهَا جَمَالٌ حِينَ تُرِيحُونَ وَحِينَ تَسْرَحُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "And there is beauty in them for you in the evening when you bring them home and in the morning when you drive them out to graze.",
        "TRANSLATION_1": "There is life and cheer for you as you drive them home in the evening, and lead them out in the morning to graze.\n",
        "TRANSLATION_2": "And you find beauty in them as you drive them to pasture in the morning and as you drive them back home in the evening;\n",
        "TRANSLATION_3": "How beautiful you find them when you bring them home and when you drive them out to graze.\n",
        "TRANSLATION_4": "And in them is your elegance, when you bring them home at evening, and when you leave them to graze.\n",
        "TRANSLATION_5": "And there is beauty in them for you, when you bring them home in the evening, and as you lead them forth to pasture (in the morning).\n",
        "TRANSLATION_6": "And there is beauty in them for you when you drive them back (to home), and when you send them forth (to pasture).\n",
        "TRANSLATION_7": "and there is beauty in them for you, when you bring them home to rest and when you drive them forth abroad to pasture;\n",
        "TRANSLATION_8": "And wherein is beauty for you, when ye bring them home, and when ye take them out to pasture.\n",
        "TRANSLATION_9": "how pleasant they look when you bring them home in the evenings and when you take them out to pasture in the mornings.\n",
        "TRANSLATION_10": "And for you there is beauty in them as ye drive them at eventide and as ye drive them out to pasture.\n",
        "TRANSLATION_11": "There is in them a beauty for you when you bring them home for rest and when you drive them forth to pasture.\n",
        "TRANSLATION_12": "And ye have a sense of pride and beauty in them as ye drive them home in the evening, and as ye lead them forth to pasture in the morning.\n",
        "TRANSLATION_13": "And wherein is beauty for you, when you bring them home in the evening, and as you lead them forth to pasture in the morning.\n",
        "TRANSLATION_14": "In them there is beauty for you when you bring them home and when you lead them to pasture.\n",
        "TRANSLATION_15": "And there is beauty in them for you, when you bring them home, and when you drive them to pasture.\n",
        "TRANSLATION_16": "And for you in them is [the enjoyment of] beauty when you bring them in [for the evening] and when you send them out [to pasture].\n",
        "TRANSLATION_17": "[16:6] and for you there is in them beauty, adornment, when you bring them [home] to rest, [when you] return them to their resting places in the evening, and when you drive them forth to pasture, when you bring them out to the grazing pastures in the morning.\n",
        "TRANSLATION_18": "(And wherein is beauty for you) a beautiful scene, (when ye bring them home) back from pasture, (and when ye take them out to pasture).\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "16:6",
            "51:43",
            "56:84",
            "71:18",
            "37:148",
            "25:76",
            "26:218",
            "37:174",
            "37:178",
            "23:54"
        ],
        "BIBLE": [
            "prophets:jeremiah:8:3",
            "prophets:jeremiah:23:8",
            "prophets:jeremiah:32:37",
            "prophets:jeremiah:49:37",
            "prophets:jeremiah:23:3",
            "prophets:jeremiah:29:14",
            "prophets:hosea:13:3",
            "prophets:ezekiel:14:22",
            "prophets:judges:2:23",
            "prophets:jeremiah:16:15"
        ]
    }
}