{
    "VERSE": "16:62",
    "ARABIC": "وَيَجْعَلُونَ لِلَّهِ مَا يَكْرَهُونَ وَتَصِفُ أَلْسِنَتُهُمُ ٱلْكَذِبَ أَنَّ لَهُمُ ٱلْحُسْنَىٰ لَا جَرَمَ أَنَّ لَهُمُ ٱلنَّارَ وَأَنَّهُم مُّفْرَطُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "They allot to Allah what they themselves dislike and their tongues frame the lie that they will receive the Best. There is no doubt at all that they will receive the Fire and that they are people who go to excess.",
        "TRANSLATION_1": "Yet they attribute to God what they find detestable; and their tongues assert the lie that for them is only good. On the contrary, there is Fire for them, and they will be thrown into it.\n",
        "TRANSLATION_2": "They assign to Allah what they dislike for themselves and their tongues utter a sheer lie in stating that a happy state awaits them. Without doubt the Fire awaits them and it is to it that they shall be hastened.\n",
        "TRANSLATION_3": "They ascribe to God that which even they themselves do not like and their lying tongues say that their end will be virtuous. Their share will certainly be hell fire to which they are earnestly heading.\n",
        "TRANSLATION_4": "And they assign to Allah that which is abhorred by themselves, and their tongues speak the lies that goodness is for them; so it occurred that for them is the fire, and they have crossed the limits.\n",
        "TRANSLATION_5": "They assign to Allah that which they dislike (for themselves), and their tongues assert the lie that the better things will be theirs. No doubt the Fire is for them, and they will be forsaken.\n",
        "TRANSLATION_6": "And they ascribe to Allah what they (themselves) hate and their tongues relate the lie that they shall have the good; there is no avoiding it that for them is the fire and that they shall be sent before.\n",
        "TRANSLATION_7": "They assign to God that they themselves dislike; and their tongues describe falsehood, that the reward most fair shall be theirs. Without any doubt theirs shall be the Fire, and they are hastened in.\n",
        "TRANSLATION_8": "And they assign unto Allah that which they (themselves) dislike, and their tongues expound the lie that the better portion will be theirs. Assuredly theirs will be the Fire, and they will be abandoned.\n",
        "TRANSLATION_9": "They attribute to God what they themselves dislike and their tongues utter the lie that all good things are for themselves. Without doubt, the Fire awaits them, and they shall be hastened on into it.\n",
        "TRANSLATION_10": "And they ascribe to Allah that which they detest, and their tongues utter the lie that unto them shall be good; undoubtedly unto them shall be the Fire, and they will be hastened thereto.\n",
        "TRANSLATION_11": "They attribute to Allah what they dislike [for themselves], and their tongues assert the lie that the best of rewards [in the Hereafter] will be theirs. Undoubtedly, the Fire shall be their lot and they will be foremost [in entering it].\n",
        "TRANSLATION_12": "They attribute to Allah what they hate (for themselves), and their tongues assert the falsehood that all good things are for themselves: without doubt for them is the Fire, and they will be the first to be hastened on into it!\n",
        "TRANSLATION_13": "They assign to Allah that which they dislike (for themselves), and their tongues assert the falsehood that the better things will be theirs. No doubt for them is the Fire, and they will be the first to be hastened on into it, and left there neglected. (Tafsir Al-Qurtubi, Vol. 10, Page 121)\n",
        "TRANSLATION_14": "They ascribe to Allah what they themselves dislike. Their tongues utter falsehoods (when they say) the finest of wages shall be theirs. Without doubt, the Fire shall be theirs and they will be hastened to it.\n",
        "TRANSLATION_15": "And they attribute to God what they themselves dislike, while their tongues utter the lie that theirs is the goodness. Without a doubt, for them is the Fire, and they will be neglected.\n",
        "TRANSLATION_16": "And they attribute to Allah that which they dislike, and their tongues assert the lie that they will have the best [from Him]. Assuredly, they will have the Fire, and they will be [therein] neglected.\n",
        "TRANSLATION_17": "[16:62] Still, they assign to God what they dislike, for themselves — such as daughters, partners in power, and the mistreatment of messengers. And their tongues, despite this, relate, tell, the lie, which is, that theirs will be the best reward, with God, namely, Paradise, as He [God] states [in their words elsewhere]: ‘And in case I am returned to my Lord, I will indeed have the best reward with Him’ [Q. 41:50]. But God, exalted be He, says: Without any doubt — verily — theirs shall be the Fire and they shall be abandoned therein, or [it, mufratūn, means that] they shall be foremost in [entering] it (a variant reading [for mufratūn] has mufritūn, meaning that ‘they transgress the bounds’).\n",
        "TRANSLATION_18": "(And they assign unto Allah that which they (themselves) dislike) they say that Allah has daughters when they themselves do not like to have daughters, (and their tongues expound the lie) they speak lies (that the better portion will be theirs) i.e. sons will be theirs; it is also said that this means: Paradise will be theirs; and it is also said that this means: how could Paradise be theirs? (Assuredly theirs will be the Fire, and they will be abandoned) it is also said that this means: they are excessive people both in their words and deeds.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "16:62",
            "16:116",
            "16:23",
            "10:69",
            "40:43",
            "9:68",
            "16:105",
            "57:18",
            "53:31",
            "72:5"
        ],
        "BIBLE": [
            "writings:daniel:12:8",
            "prophets:jeremiah:5:19",
            "prophets:ezekiel:20:8",
            "prophets:isaiah:46:10",
            "prophets:jeremiah:16:19",
            "prophets:i%20kings:19:10",
            "prophets:i%20kings:19:14",
            "writings:i%20chronicles:13:2",
            "torah:deuteronomy:28:49",
            "prophets:joshua:18:6"
        ]
    }
}