{
    "VERSE": "16:67",
    "ARABIC": "وَمِن ثَمَرَٰتِ ٱلنَّخِيلِ وَٱلْأَعْنَٰبِ تَتَّخِذُونَ مِنْهُ سَكَرًا وَرِزْقًا حَسَنًا إِنَّ فِى ذَٰلِكَ لَءَايَةً لِّقَوْمٍ يَعْقِلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "And from the fruit of the date-palm and the grape-vine you derive both intoxicants and wholesome provision. There is certainly a Sign in that for people who use their intellect.",
        "TRANSLATION_1": "And in fruits of the date-palm and the vine, from which you obtain inebriating drinks and excellent food. In this indeed are signs for those who understand.\n",
        "TRANSLATION_2": "And out of the fruits of date-palms and grapes you derive intoxicants as well as wholesome sustenance. Surely there is a sign for those who use reason.\n",
        "TRANSLATION_3": "The fruit of palm trees and vines which provide you with sugar and delicious food also provide a lesson and evidence (of the Truth) for the people of understanding.\n",
        "TRANSLATION_4": "And from the fruits of date and grapes, for you make juices and good nourishment from them; indeed in this is a sign for people of intellect.\n",
        "TRANSLATION_5": "And from the fruits of date palms and grapes, you derive strong drink and a goodly provision. There is indeed a sign in this for those of reason.\n",
        "TRANSLATION_6": "And of the fruits of the palms and the grapes-- you obtain from them intoxication and goodly provision; most surely there is a sign in this for a people who ponder.\n",
        "TRANSLATION_7": "And of the fruits of the palms and the vines, you take therefrom an intoxicant and a provision fair. Surely in that is a sign for a people who understand.\n",
        "TRANSLATION_8": "And of the fruits of the date-palm, and grapes, whence ye derive strong drink and (also) good nourishment. Lo! therein is indeed a portent for people who have sense.\n",
        "TRANSLATION_9": ">From the fruit of the date palm and the grapes you derive intoxicants as well as wholesome food. Surely in this there is a sign for men of understanding.\n",
        "TRANSLATION_10": "And also a lesson for you in the fruits of the date-palms and the grapes whereof ye take a liquor and a provision goodly; verily therein is a sign far a people who understand.\n",
        "TRANSLATION_11": "From the fruits of date palms and vines you draw wine and goodly provision. There are indeed signs in that for people who exercise their reason.\n",
        "TRANSLATION_12": "And from the fruit of the date-palm and the vine, ye get out wholesome drink and food: behold, in this also is a sign for those who are wise.\n",
        "TRANSLATION_13": "And from the fruits of date-palms and grapes, you derive strong drink (this was before the order of the prohibition of the alcoholic drinks) and a goodly provision. Verily, therein is indeed a sign for people who have wisdom.\n",
        "TRANSLATION_14": "And the fruits of the palm and of the vine, from which you derive intoxicants and wholesome provisions. Surely, in this there is a sign for nation who understand.\n",
        "TRANSLATION_15": "And from the fruits of date-palms and grapevines, you derive sugar and wholesome food. In this is a sign for people who understand.\n",
        "TRANSLATION_16": "And from the fruits of the palm trees and grapevines you take intoxicant and good provision. Indeed in that is a sign for a people who reason.\n",
        "TRANSLATION_17": "[16:67] And of the fruits of date-palms and vines, [comes forth] a fruit, from which you draw an intoxicant, a wine that intoxicates — it [the wine] is referred to by the verbal noun [sakaran, ‘intoxicant’], and this [verse]   came before it was prohibited — and goodly provision, such as dates, raisins, vinegar, and molasses. Surely in that, which is mentioned, there is a sign, indicating His power, exalted be He, for a people who understand, [a people who] reflect.\n",
        "TRANSLATION_18": "(And of the fruits of the date-palm, and grapes, whence ye derive strong drink) intoxicants. But this is abrogated; it is also said that this means: you derive food from it (and (also) good nourishment) a lawful nourishment such as vinegar, treacle, raisin and other things. (Lo! Therein) in that which I have mentioned to you, (is indeed a portent) a sign (for people who have sense) for people who believe.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "16:67",
            "16:11",
            "30:37",
            "39:52",
            "16:13",
            "10:67",
            "13:4",
            "45:13",
            "6:99",
            "30:23"
        ],
        "BIBLE": [
            "prophets:isaiah:28:9",
            "prophets:i%20kings:4:7",
            "prophets:jeremiah:49:15",
            "writings:i%20chronicles:12:39",
            "prophets:amos:6:10",
            "prophets:amos:9:14",
            "prophets:ezekiel:30:12",
            "torah:exodus:30:32",
            "torah:genesis:3:6",
            "prophets:judges:20:38"
        ]
    }
}