{
    "VERSE": "16:74",
    "ARABIC": "فَلَا تَضْرِبُوا۟ لِلَّهِ ٱلْأَمْثَالَ إِنَّ ٱللَّهَ يَعْلَمُ وَأَنتُمْ لَا تَعْلَمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Do not try to make metaphors for Allah. Allah knows and you do not know.",
        "TRANSLATION_1": "So do not invent similitudes for God. Indeed God knows, and you do not know.\n",
        "TRANSLATION_2": "So do not strike any similitudes to Allah. Allah knows whereas you do not know.\n",
        "TRANSLATION_3": "Do not consider anything equal to God. God knows that which you do not know.\n",
        "TRANSLATION_4": "Therefore do not ascribe equals to Allah; indeed Allah knows whereas you do not know.\n",
        "TRANSLATION_5": "So do not give examples on behalf of Allah. Truly, Allah knows and you know not.\n",
        "TRANSLATION_6": "Therefore do not give likenesses to Allah; surely Allah knows and you do not know.\n",
        "TRANSLATION_7": "So strike not any similitudes for God; surely God knows, and you know not.\n",
        "TRANSLATION_8": "So coin not similitudes for Allah. Lo! Allah knoweth; ye know not.\n",
        "TRANSLATION_9": "Do not compare God with anyone. God has knowledge, but you have not.\n",
        "TRANSLATION_10": "Propound not then for Allah similitudes, verily Allah knoweth and ye know not.\n",
        "TRANSLATION_11": "So do not draw comparisons for Allah: indeed Allah knows and you do not know.\n",
        "TRANSLATION_12": "Invent not similitudes for Allah: for Allah knoweth, and ye know not.\n",
        "TRANSLATION_13": "So put not forward similitudes for Allah (as there is nothing similar to Him, nor He resembles anything). Truly! Allah knows and you know not.\n",
        "TRANSLATION_14": "Therefore, do not strike parables for Allah; Allah knows, but you do not!\n",
        "TRANSLATION_15": "So do not cite the examples for God. God knows, and you do not know.\n",
        "TRANSLATION_16": "So do not assert similarities to Allah. Indeed, Allah knows and you do not know.\n",
        "TRANSLATION_17": "[16:74] So do not strike any similitude for God, [do not] ascribe to God likenesses and then associate them with Him [in power]. Truly God knows, that there is nothing like Him, and you do not know, this.\n",
        "TRANSLATION_18": "(So coin not similitudes for Allah) do not ascribe sons and partners and co-equals to Allah. (Lo! Allah knoweth) that He has no son or partner; (ye know not) this, congregation of disbelievers.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "16:74",
            "53:62",
            "20:14",
            "11:115",
            "72:18",
            "9:96",
            "3:32",
            "39:66",
            "42:40",
            "28:56"
        ],
        "BIBLE": [
            "torah:deuteronomy:13:14",
            "prophets:ezekiel:21:10",
            "prophets:judges:20:2",
            "prophets:isaiah:40:18",
            "prophets:judges:18:14",
            "prophets:jeremiah:31:3",
            "prophets:i%20samuel:9:11",
            "prophets:i%20kings:13:4",
            "writings:job:10:2",
            "writings:job:42:3"
        ]
    }
}