{
    "VERSE": "16:8",
    "ARABIC": "وَٱلْخَيْلَ وَٱلْبِغَالَ وَٱلْحَمِيرَ لِتَرْكَبُوهَا وَزِينَةً وَيَخْلُقُ مَا لَا تَعْلَمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "And horses, mules and donkeys both to ride and for adornment. And He creates other things you do not know.",
        "TRANSLATION_1": "He created horses, mules and donkeys for riding and for splendour. He created other things too which you do not know.\n",
        "TRANSLATION_2": "And He created horses and mules and asses for you to ride, and also for your adornment. And He creates many things (for you) that you do not even know about.\n",
        "TRANSLATION_3": "He created horses, mules, and donkeys for you to ride and as a means of beauty. He has also created things that you do not know.\n",
        "TRANSLATION_4": "And horses, and mules, and donkeys so that you may ride them, and for adornment; and He will create what you do not know*. (* All modern means of transport – by air, sea, land and even in space – evidence this.)\n",
        "TRANSLATION_5": "And (He has created) horses, mules and donkeys for you to ride, and as an adornment. And He creates (other) things of which you have no knowledge.\n",
        "TRANSLATION_6": "And (He made) horses and mules and asses that you might ride upon them and as an ornament; and He creates what you do not know.\n",
        "TRANSLATION_7": "And horses, and mules, and asses, for you to ride, and as an adornment; and He creates what you know not.\n",
        "TRANSLATION_8": "And horses and mules and asses (hath He created) that ye may ride them, and for ornament. And He createth that which ye know not.\n",
        "TRANSLATION_9": "He has created horses, mules and donkeys, so that you may ride them, and also so that they may be put on show, and He creates other things beyond your knowledge.\n",
        "TRANSLATION_10": "And He hath created horses and mules and asses that ye may ride there on, and as an adornment; and He createth that which ye know not.\n",
        "TRANSLATION_11": "And horses, mules and asses, for you to ride them, and for pomp, and He creates what you do not know.\n",
        "TRANSLATION_12": "And (He has created) horses, mules, and donkeys, for you to ride and use for show; and He has created (other) things of which ye have no knowledge.\n",
        "TRANSLATION_13": "And (He has created) horses, mules and donkeys, for you to ride and as an adornment. And He creates (other) things of which you have no knowledge.\n",
        "TRANSLATION_14": "(He has created for you) horses, mules, and donkeys, which you ride and as an adornment; and He creates what you do not know.\n",
        "TRANSLATION_15": "And the horses, and the mules, and the donkeys—for you to ride, and for luxury. And He creates what you do not know.\n",
        "TRANSLATION_16": "And [He created] the horses, mules and donkeys for you to ride and [as] adornment. And He creates that which you do not know.\n",
        "TRANSLATION_17": "[16:8] And, He created, horses and mules and asses, that you may ride them, and for adornment (wa-zīnatan is an object denoting reason; the use of both of these reasons [‘to ride’ and ‘for adornment’] as illustrations of [God’s] graces does not preclude that they may have been created for other purposes, such as for consumption in the case of horses — which is established [as lawful] by a hadīth in both Sahīhs [of Bukhārī and Muslim]); and He creates what you do not know, of marvelous and strange things.\n",
        "TRANSLATION_18": "(And horses and mules and asses (hath He created) that ye may ride them) in the way of Allah, (and for ornament) they are good to look at. (And He createth that which ye know not) He says: He created things that you do not know, since He has not named them to you.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "16:8",
            "11:15",
            "109:4",
            "28:60",
            "9:92",
            "69:39",
            "109:3",
            "109:5",
            "18:7",
            "84:17"
        ],
        "BIBLE": [
            "torah:genesis:6:7",
            "writings:job:42:3",
            "prophets:jeremiah:22:4",
            "writings:proverbs:30:18",
            "writings:ecclesiastes:3:19",
            "prophets:joel:2:20",
            "prophets:ezekiel:38:15",
            "prophets:joel:2:21",
            "prophets:ezekiel:7:20",
            "torah:exodus:33:17"
        ]
    }
}