{
    "VERSE": "16:83",
    "ARABIC": "يَعْرِفُونَ نِعْمَتَ ٱللَّهِ ثُمَّ يُنكِرُونَهَا وَأَكْثَرُهُمُ ٱلْكَٰفِرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "They acknowledge Allah's blessing and then deny it. Most of them are kuffar.",
        "TRANSLATION_1": "They do know the favours of God, and yet they deny them, for most of them are not grateful.\n",
        "TRANSLATION_2": "They are aware of the favours of Allah, and yet refuse to acknowledge them. Most of them are determined not to accept the Truth.\n",
        "TRANSLATION_3": "They recognize the bounties of God but they refuse them and most of them are unbelievers.\n",
        "TRANSLATION_4": "They recognise the favour* of Allah and then deny it, and most of them are disbelievers. (* Prophet Mohammed (peace and blessings be upon him) and / or all the favours of Allah.)\n",
        "TRANSLATION_5": "They recognize the grace of Allah, yet they deny it (by worshipping others besides Allah) and most of them are disbelievers.\n",
        "TRANSLATION_6": "They recognize the favor of Allah, yet they deny it, and most of them are ungrateful.\n",
        "TRANSLATION_7": "They recognize the blessing of God, then they deny it, and the most of them are the unthankful.\n",
        "TRANSLATION_8": "They know the favour of Allah and then deny it. Most of them are ingrates.\n",
        "TRANSLATION_9": "They recognize the favour of God, yet they deny it; and most of them are ungrateful.\n",
        "TRANSLATION_10": "They recognize the favour of Allah, then they deny it, and most of them are infidels.\n",
        "TRANSLATION_11": "They recognize the blessing of Allah and then deny it, and most of them are faithless.\n",
        "TRANSLATION_12": "They recognise the favours of Allah; then they deny them; and most of them are (creatures) ungrateful.\n",
        "TRANSLATION_13": "They recognise the Grace of Allah, yet they deny it (by worshipping others besides Allah) and most of them are disbelievers (deny the Prophethood of Muhammad SAW).\n",
        "TRANSLATION_14": "They recognize the favors of Allah, then they disbelieve them; most of them are unbelievers.\n",
        "TRANSLATION_15": "They recognize God’s blessing, but then deny it, as most of them are ungrateful.\n",
        "TRANSLATION_16": "They recognize the favor of Allah; then they deny it. And most of them are disbelievers.\n",
        "TRANSLATION_17": "[16:83] They recognise God’s grace, that is, they affirm that it comes from Him, and then deny it, by associating others [with Him], and most of them are ungrateful.\n",
        "TRANSLATION_18": "When the Prophet (pbuh) mentioned to them all those blessings, they agreed that all those blessings came from Allah, but then they denied this afterward, and said: no, we have all these blessings through the intercession of our gods. Allah said in response: (They know the favour of Allah) they acknowledge that all these blessings are from Allah (and then deny it) saying: we got them through the intercession of our gods. (Most of them are ingrates) all of them are disbelievers in Allah.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "16:83",
            "40:79",
            "30:6",
            "12:106",
            "48:19",
            "16:53",
            "3:171",
            "26:223",
            "3:141",
            "26:227"
        ],
        "BIBLE": [
            "prophets:i%20samuel:20:7",
            "writings:ii%20chronicles:25:16",
            "prophets:malachi:1:9",
            "prophets:jeremiah:28:9",
            "writings:psalms:73:11",
            "prophets:jeremiah:14:13",
            "writings:job:9:2",
            "torah:exodus:33:17",
            "torah:exodus:33:16",
            "writings:job:42:3"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:2:5"
        ]
    }
}