{
    "VERSE": "16:87",
    "ARABIC": "وَأَلْقَوْا۟ إِلَى ٱللَّهِ يَوْمَئِذٍ ٱلسَّلَمَ وَضَلَّ عَنْهُم مَّا كَانُوا۟ يَفْتَرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "On that Day they will offer their submission to Allah and the things they invented will abandon them.",
        "TRANSLATION_1": "They will offer submission to God that Day, and the lies they fabricated will not be of the least avail.\n",
        "TRANSLATION_2": "On that Day they will offer their submission and all that they had fabricated will have vanished.\n",
        "TRANSLATION_3": "(On the Day of Judgment) the disbelievers will submit themselves to God and whatever they had falsely invented will disappear.\n",
        "TRANSLATION_4": "And on that day they will fall humbly before Allah, and they will lose all that they used to fabricate.\n",
        "TRANSLATION_5": "And they will offer (their full) submission to Allah on that Day, and what they falsely invented will wander away from them.\n",
        "TRANSLATION_6": "And they shall tender submission to Allah on that day; and what they used to forge shall depart from them.\n",
        "TRANSLATION_7": "And they will offer God surrender that day, and there shall go astray from them that they were forging.\n",
        "TRANSLATION_8": "And they proffer unto Allah submission on that day, and all that they used to invent hath failed them.\n",
        "TRANSLATION_9": "and on that Day they will offer total submission to God: and all that they used to devise will fail them.\n",
        "TRANSLATION_10": "And they will proffer sub mission unto Allah on that Day, and there will stray from them that which they have been fabricating.\n",
        "TRANSLATION_11": "They will submit to Allah on that day, and what they used to fabricate will forsake them.\n",
        "TRANSLATION_12": "That Day shall they (openly) show (their) submission to Allah; and all their inventions shall leave them in the lurch.\n",
        "TRANSLATION_13": "And they will offer (their full) submission to Allah (Alone) on that Day, and their invented false deities [all that they used to invoke besides Allah, e.g. idols, saints, priests, monks, angels, jinns, Jibrael (Gabriel), Messengers, etc.] will vanish from them.\n",
        "TRANSLATION_14": "On that Day they shall offer to submit to Allah, and what they forged will forsake them.\n",
        "TRANSLATION_15": "On that Day they will offer their submission to God, and what they had invented will abandon them.\n",
        "TRANSLATION_16": "And they will impart to Allah that Day [their] submission, and lost from them is what they used to invent.\n",
        "TRANSLATION_17": "[16:87] And they will offer submission to God on that day, that is, they will have surrendered to His judgement, and that which they used to invent, in the way of [claiming that] their gods intercede for them, will fail, forsake, them.\n",
        "TRANSLATION_18": "(And they proffer unto Allah submission on that day) both the worshipper and that which he worshipped in this worldly life will surrender to Allah, Exalted is He, (and all that they used to invent hath failed them) their lies about Allah will go in vain; it is also said that this means: the idols which they falsely worshipped will be occupied with themselves.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "16:87",
            "4:61",
            "9:43",
            "3:141",
            "29:11",
            "2:15",
            "10:25",
            "16:19",
            "2:156",
            "10:109"
        ],
        "BIBLE": [
            "prophets:jeremiah:51:47",
            "torah:genesis:45:24",
            "prophets:ezekiel:20:31",
            "writings:psalms:102:25",
            "prophets:ezekiel:24:21",
            "torah:leviticus:19:10",
            "prophets:ii%20samuel:21:9",
            "torah:leviticus:23:27",
            "prophets:jeremiah:18:15",
            "prophets:jeremiah:17:11"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:7"
        ]
    }
}