{
    "VERSE": "16:9",
    "ARABIC": "وَعَلَى ٱللَّهِ قَصْدُ ٱلسَّبِيلِ وَمِنْهَا جَآئِرٌ وَلَوْ شَآءَ لَهَدَىٰكُمْ أَجْمَعِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "The Way should lead to Allah, but there are those who deviate from it. If He had wished He could have guided every one of you.",
        "TRANSLATION_1": "To God leads the right path, though some deviate. If He willed He could guide you all to the right way.\n",
        "TRANSLATION_2": "It rests with Allah alone to show you the Right Way, even when there are many crooked ways. Had He so willed, He would have (perforce) guided you all aright.\n",
        "TRANSLATION_3": "Some paths lead away from God but one must follow the path that leads to God. Had God wanted, He could have guided (all to the right path).\n",
        "TRANSLATION_4": "And the middle path rightly leads to Allah – any other path is wayward; and had He willed He would have brought all of you upon guidance.\n",
        "TRANSLATION_5": "And it is up to Allah to show the right way. But there are ways that stray. And had He willed, He would have guided you all.\n",
        "TRANSLATION_6": "And upon Allah it rests to show the right way, and there are some deviating (ways); and if He please He would certainly guide you all aright.\n",
        "TRANSLATION_7": "God's it is to show the way; and some do swerve from it. If He willed, He would have guided you all together.\n",
        "TRANSLATION_8": "And Allah's is the direction of the way, and some (roads) go not straight. And had He willed He would have led you all aright.\n",
        "TRANSLATION_9": "The straight way leads to God and there are ways which deviate from the right course. If He so wished, He would guide you all.\n",
        "TRANSLATION_10": "And upon Allah is the direction of the way, and thereof is some crooked; and had He willed He would have guided you all.\n",
        "TRANSLATION_11": "With Allah rests guidance to the straight path, and some of the paths are devious, and had He wished He would have guided you all.\n",
        "TRANSLATION_12": "And unto Allah leads straight the Way, but there are ways that turn aside: if Allah had willed, He could have guided all of you.\n",
        "TRANSLATION_13": "And upon Allah is the responsibility to explain the Straight Path (i.e. Islamic Monotheism for mankind i.e. to show them legal and illegal, good and evil things, etc. so, whosoever accepts the guidance, it will be for his own benefit and whosoever goes astray, it will be for his own destruction), but there are ways that turn aside (such as Paganism, Judaism, Christianity, etc.). And had He willed, He would have guided you all (mankind).\n",
        "TRANSLATION_14": "It is for Allah to show the way. Some swerve from it, but had He willed, He would have guided all of you.\n",
        "TRANSLATION_15": "It is for God to point out the paths, but some of them are flawed. Had He willed, He could have guided you all.\n",
        "TRANSLATION_16": "And upon Allah is the direction of the [right] way, and among the various paths are those deviating. And if He willed, He could have guided you all.\n",
        "TRANSLATION_17": "[16:9] And God’s is the direction of the way, that is, to point out the straight path, and some of them, that is, the paths, are deviant, swerving away from straightness. And had He willed, to guide you, He would have guided you, to seek the way, all, so that you would be [rightly] guided of your own choice.\n",
        "TRANSLATION_18": "(And Allah's is the direction of the way) He is the guide whether it is in the sea or on the land, (and some (roads) go not straight) they are crooked and one cannot find one's way through them. (And had He willed He would have led you all aright) in your way whether you are in the sea or on the land; it is also said that (And Allah's is the direction of the way) means: it is Allah Who guides to monotheism, and some of the religions are crooked and unjust such as Judaism, Christianity and Zoroastrianism. And if Allah had willed, He would have guided you all to His religion.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "16:9",
            "6:149",
            "29:69",
            "39:57",
            "2:244",
            "47:1",
            "2:190",
            "14:12",
            "12:108",
            "29:3"
        ],
        "BIBLE": [
            "prophets:i%20samuel:6:12",
            "writings:job:34:27",
            "prophets:judges:2:17",
            "prophets:isaiah:59:8",
            "torah:numbers:22:26",
            "prophets:ii%20kings:6:19",
            "prophets:ii%20samuel:14:20",
            "torah:deuteronomy:31:29",
            "torah:exodus:23:2",
            "prophets:jonah:3:8"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:13",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:6:2"
        ]
    }
}