{
    "VERSE": "16:90",
    "ARABIC": "إِنَّ ٱللَّهَ يَأْمُرُ بِٱلْعَدْلِ وَٱلْإِحْسَٰنِ وَإِيتَآئِ ذِى ٱلْقُرْبَىٰ وَيَنْهَىٰ عَنِ ٱلْفَحْشَآءِ وَٱلْمُنكَرِ وَٱلْبَغْىِ يَعِظُكُمْ لَعَلَّكُمْ تَذَكَّرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Allah commands justice and doing good and giving to relatives. And He forbids indecency and doing wrong and tyranny. He warns you so that hopefully you will pay heed.",
        "TRANSLATION_1": "Verily God has enjoined justice, the doing of good, and the giving of gifts to your relatives; and forbidden indecency, impropriety and oppression. He warns you so that you may remember.\n",
        "TRANSLATION_2": "Surely Allah enjoins justice, kindness and the doing of good to kith and kin, and forbids all that is shameful, evil and oppressive. He exhorts you so that you may be mindful.\n",
        "TRANSLATION_3": "God commands (people) to maintain justice, kindness, and proper relations with their relatives. He forbids them to commit indecency, sin, and rebellion. God gives you advice so that perhaps you will take heed.\n",
        "TRANSLATION_4": "Indeed Allah decrees the commands of justice and kindness, and of giving to relatives, and forbids from the shameful and evil and rebellion; He advises you so that you may pay heed.\n",
        "TRANSLATION_5": "Verily, Allah orders justice and kindness, and giving (help) to the relatives, and He forbids immoral sins, and evil and tyranny. He admonishes you, so that perhaps you may take heed.\n",
        "TRANSLATION_6": "Surely Allah enjoins the doing of justice and the doing of good (to others) and the giving to the kindred, and He forbids indecency and evil and rebellion; He admonishes you that you may be mindful.\n",
        "TRANSLATION_7": "Surely God bids to justice and good-doing and giving to kinsmen; and He forbids indecency, dishonour, and insolence, admonishing you, so that haply you will remember.\n",
        "TRANSLATION_8": "Lo! Allah enjoineth justice and kindness, and giving to kinsfolk, and forbiddeth lewdness and abomination and wickedness. He exhorteth you in order that ye may take heed.\n",
        "TRANSLATION_9": "God commands justice, kindness and giving their [due to] near relatives, and He forbids all shameful deeds, and injustice and transgression. He admonishes you so that you may take heed!\n",
        "TRANSLATION_10": "Verily Allah commandeth justice and well-doing and giving to kindred; and He prohibiteth lewdness and wickedness and oppression; He exhorteth you that haply ye may beadmonished.\n",
        "TRANSLATION_11": "Indeed Allah enjoins justice and kindness, and generosity towards relatives, and He forbids indecency, wrongdoing, and aggression. He advises you, so that you may take admonition.\n",
        "TRANSLATION_12": "Allah commands justice, the doing of good, and liberality to kith and kin, and He forbids all shameful deeds, and injustice and rebellion: He instructs you, that ye may receive admonition.\n",
        "TRANSLATION_13": "Verily, Allah enjoins Al-Adl (i.e. justice and worshipping none but Allah Alone - Islamic Monotheism) and Al-Ihsan [i.e. to be patient in performing your duties to Allah, totally for Allah's sake and in accordance with the Sunnah (legal ways) of the Prophet SAW in a perfect manner], and giving (help) to kith and kin (i.e. all that Allah has ordered you to give them e.g., wealth, visiting, looking after them, or any other kind of help, etc.): and forbids Al-Fahsha' (i.e. all evil deeds, e.g. illegal sexual acts, disobedience of parents, polytheism, to tell lies, to give false witness, to kill a life without right, etc.), and Al-Munkar (i.e. all that is prohibited by Islamic law: polytheism of every kind, disbelief and every kind of evil deeds, etc.), and Al-Baghy (i.e. all kinds of oppression), He admonishes you, that you may take heed.\n",
        "TRANSLATION_14": "Allah orders justice, and good deeds, and giving to one's kindred. He forbids indecency, dishonor and insolence. He admonishes you in order that you take heed.\n",
        "TRANSLATION_15": "God commands justice, and goodness, and generosity towards relatives. And He forbids immorality, and injustice, and oppression. He advises you, so that you may take heed.\n",
        "TRANSLATION_16": "Indeed, Allah orders justice and good conduct and giving to relatives and forbids immorality and bad conduct and oppression. He admonishes you that perhaps you will be reminded.\n",
        "TRANSLATION_17": "[16:90] Indeed God enjoins justice — [that is] affirmation of [His] Oneness, or [actually] being fair, and virtue, performance of the [religious] obligations, or that you should worship God as if you were able to see Him, as [reported] in the hadīth; and giving to kinsfolk — He has singled it [kinship] out for mention by way of [highlighting] its importance — and He forbids lewdness, fornication, and abomination, with regard to the [stipulations of the] Law, [abomination] such as disbelief and acts of disobedience, and aggression, wrongdoing against people — He also singles this out for mention by way of [showing] its importance; just as He began with [the mention of] ‘lewdness’, in this way, He admonishes you, through commands and prohibitions, so that you might remember, [that you might] be admonished (tadhakkarūna, ‘you [might] remember’, the original tā’ [of tatadhakkarūna] has been assimilated with the dhāl). In the Mustadrak [of alHākim al-Naysābūrī] it is reported from Ibn Mas‘ūd that [he said]: ‘This [verse] is the most comprehensive verse in the Qur’ān in terms of [what is] good and [what is] evil’.\n",
        "TRANSLATION_18": "(Lo! Allah enjoineth justice) Allah's divine Oneness (and kindness) through fulfilling the obligations; it is also said that this means: kindness to people, (and giving to kinsfolk) i.e. keeping ties with one's kinsfolk, (and forbideth lewdness) all transgressions (and abomination) that which is not known in the Shari'ah or Sunnah (and wickedness) overbearing and oppression. (He exhorteth you) He forbids you from engaging in lewdness, abomination and wickedness (in order that ye may take heed) in order that you take admonition from the parable of the Qur'an.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "16:90",
            "7:33",
            "2:169",
            "9:67",
            "29:45",
            "2:268",
            "33:64",
            "49:9",
            "7:56",
            "9:112"
        ],
        "BIBLE": [
            "prophets:ezekiel:3:20",
            "prophets:joshua:23:16",
            "writings:ii%20chronicles:6:27",
            "writings:ecclesiastes:5:17",
            "prophets:jeremiah:35:15",
            "prophets:i%20kings:8:36",
            "prophets:ezekiel:16:52",
            "writings:ecclesiastes:8:15",
            "writings:ecclesiastes:5:18",
            "torah:deuteronomy:26:13"
        ]
    }
}