{
    "VERSE": "16:94",
    "ARABIC": "وَلَا تَتَّخِذُوٓا۟ أَيْمَٰنَكُمْ دَخَلًۢا بَيْنَكُمْ فَتَزِلَّ قَدَمٌۢ بَعْدَ ثُبُوتِهَا وَتَذُوقُوا۟ ٱلسُّوٓءَ بِمَا صَدَدتُّمْ عَن سَبِيلِ ٱللَّهِ وَلَكُمْ عَذَابٌ عَظِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "Do not make your oaths a means of deceiving one another or your foot will slip after it was firmly placed and you will taste evil for barring access to the Way of Allah and you will have a terrible punishment.",
        "TRANSLATION_1": "So do not make your oaths a means of deceiving one another, lest your foot should slip after having found its hold, and you taste of evil for having hindered (others) from the way of God, and suffer a grievous punishment.\n",
        "TRANSLATION_2": "Do not make your oaths a means of deceiving one another or else your foot may slip after having been firm, and you may suffer evil consequences because of hindering people from the way of Allah. A mighty chastisement awaits you.\n",
        "TRANSLATION_3": "Do not consider your oaths as a means of deceit lest you damage the firmness of your faith, suffer from evil by creating obstacles in the way that leads to God, and incur a great torment upon yourselves.\n",
        "TRANSLATION_4": "And do not make your oaths phoney excuses between yourselves, so that a foot may not slip after being steadfast and you may taste evil because you were preventing from Allah’s way; and lest you be severely punished.\n",
        "TRANSLATION_5": "And do not make your oaths a means of deception among yourselves, resulting in the slip of a foot after it was firmly planted, and you taste the evil of having hindered from the path of Allah, and you will suffer a terrible punishment.\n",
        "TRANSLATION_6": "And do not make your oaths a means of deceit between you, lest a foot should slip after its stability and you should taste evil because you turned away from Allah's way and grievous punishment be your (lot).\n",
        "TRANSLATION_7": "Take not your oaths as mere mutual deceit, lest any foot should slip after it has stood firm, and you should taste evil, for that you barred from the way of God, and lest there should await you a mighty chastisement.\n",
        "TRANSLATION_8": "Make not your oaths a deceit between you, lest a foot should slip after being firmly planted and ye should taste evil forasmuch as ye debarred (men) from the way of Allah, and yours should be an awful doom.\n",
        "TRANSLATION_9": "Do not use your oaths to deceive each other lest any foot should slip after being firmly placed and lest you should taste the penalty for having hindered others from the path of God, for then you will have a terrible punishment.\n",
        "TRANSLATION_10": "And make not your oaths a means of discord amongst you lest a foot may slip after the fixture thereof, and ye may taste evil for having hindered others from the way of Allah, and unto you there shall be a torment mighty.\n",
        "TRANSLATION_11": "Do not make your oaths a means of [mutual] deceit among yourselves, lest feet should stumble after being steady and [lest] you suffer ill for barring from the way of Allah and face a great punishment.\n",
        "TRANSLATION_12": "And take not your oaths, to practise deception between yourselves, with the result that someone's foot may slip after it was firmly planted, and ye may have to taste the evil (consequences) of having hindered (men) from the Path of Allah, and a Mighty Wrath descend on you.\n",
        "TRANSLATION_13": "And make not your oaths, a means of deception among yourselves, lest a foot may slip after being firmly planted, and you may have to taste the evil (punishment in this world) of having hindered (men) from the Path of Allah (i.e. Belief in the Oneness of Allah and His Messenger, Muhammad SAW), and yours will be a great torment (i.e. the Fire of Hell in the Hereafter).\n",
        "TRANSLATION_14": "Do not take oaths to deceive each other, lest your foot should slip after its firmness, lest you should taste evil, for you barred others from the Path of Allah, and lest a mighty punishment awaits you.\n",
        "TRANSLATION_15": "And do not use your oaths to deceive one another, so that a foot may not slip after being firm, and you taste misery because you hindered from God’s path, and incur a terrible torment.\n",
        "TRANSLATION_16": "And do not take your oaths as [means of] deceit between you, lest a foot slip after it was [once] firm, and you would taste evil [in this world] for what [people] you diverted from the way of Allah, and you would have [in the Hereafter] a great punishment.\n",
        "TRANSLATION_17": "[16:94] And do not make your oaths a [means of] deceit between you — He repeats this [here] for emphasis — lest a foot should slip, that is, [lest] your feet [should slip] off the path of Islam, after being steady, having been set upon it, and [lest] you should taste evil, that is, chastisement, forasmuch as you barred [people] from the way of God, in other words, for your refraining to fulfil covenants or barring others from [doing] this, since your custom [once established] will be followed [by others], and there be a tremendous chastisement for you, in the Hereafter.\n",
        "TRANSLATION_18": "(Make not your oaths) your pledges (a deceit) cheating, plotting and trickery (between you, lest a foot should slip) lest you should slip from Allah's obedience as a person's foot slips (after being firmly planted and ye should taste evil) hell (forasmuch as ye debarred (men) from the way of Allah) from Allah's religion and obedience, (and yours should be an awful doom) in the Hereafter.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "16:94",
            "26:156",
            "3:105",
            "16:92",
            "16:88",
            "58:16",
            "38:26",
            "16:91",
            "42:44",
            "40:45"
        ],
        "BIBLE": [
            "torah:leviticus:4:35",
            "prophets:amos:6:10",
            "prophets:micah:2:12",
            "prophets:ezekiel:15:3",
            "prophets:ezekiel:39:7",
            "writings:ezra:6:8",
            "prophets:zephaniah:3:20",
            "prophets:isaiah:28:16",
            "prophets:isaiah:57:1",
            "torah:exodus:23:27"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:6:1",
            
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:6:4"
        ]
    }
}