{
    "VERSE": "16:97",
    "ARABIC": "مَنْ عَمِلَ صَٰلِحًا مِّن ذَكَرٍ أَوْ أُنثَىٰ وَهُوَ مُؤْمِنٌ فَلَنُحْيِيَنَّهُۥ حَيَوٰةً طَيِّبَةً وَلَنَجْزِيَنَّهُمْ أَجْرَهُم بِأَحْسَنِ مَا كَانُوا۟ يَعْمَلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Anyone who acts rightly, male or female, being a mumin, We will give them a good life and We will recompense them according to the best of what they did.",
        "TRANSLATION_1": "We shall invest whosoever works for good, whether man or woman, with a pleasant life, and reward them in accordance with the best of what they have done.\n",
        "TRANSLATION_2": "Whosoever acts righteously - whether a man or a woman - and embraces belief, We will surely grant him a good life; and will surely grant such persons their reward according to the best of their deeds.\n",
        "TRANSLATION_3": "All righteously believing male or female will be granted a blessed happy life and will receive their due reward and more.\n",
        "TRANSLATION_4": "Whoever does good deeds – whether a male or female – and is a Muslim, We shall sustain him an excellent life, and shall certainly pay them a recompense which befits the best of their deeds.\n",
        "TRANSLATION_5": "Whoever does righteous deeds - whether male or female - while he (or she) is a believer; then We will certainly give them a good life, and We will certainly grant them their rewards in proportion to the best of what they used to do.\n",
        "TRANSLATION_6": "Whoever does good whether male or female and he is a believer, We will most certainly make him live a happy life, and We will most certainly give them their reward for the best of what they did.\n",
        "TRANSLATION_7": "And whosoever does a righteous deed, be it male or female, believing, We shall assuredly give him to live a goodly life; and We shall recompense them their wage, according to the best of what they did.\n",
        "TRANSLATION_8": "Whosoever doeth right, whether male or female, and is a believer, him verily we shall quicken with good life, and We shall pay them a recompense in proportion to the best of what they used to do.\n",
        "TRANSLATION_9": "To whoever does good deeds, man or woman, and is a believer, We shall assuredly give a good life; and We will bestow upon them their reward according to the best of their works.\n",
        "TRANSLATION_10": "Whosoever worketh righteously, male or female, and is a believer, We will surely quicken him to a clean life, and will surely recompense them their hire for the best of that which they have been working.\n",
        "TRANSLATION_11": "Whoever acts righteously, [whether] male or female, should he be faithful, We shall revive him with a good life and pay them their reward by the best of what they used to do.\n",
        "TRANSLATION_12": "Whoever works righteousness, man or woman, and has Faith, verily, to him will We give a new Life, a life that is good and pure and We will bestow on such their reward according to the best of their actions.\n",
        "TRANSLATION_13": "Whoever works righteousness, whether male or female, while he (or she) is a true believer (of Islamic Monotheism) verily, to him We will give a good life (in this world with respect, contentment and lawful provision), and We shall pay them certainly a reward in proportion to the best of what they used to do (i.e. Paradise in the Hereafter).\n",
        "TRANSLATION_14": "For whosoever does a righteous deed, be they believing men or women, We shall recompense them with their wage according to the best of their deeds.\n",
        "TRANSLATION_15": "Whoever works righteousness, whether male or female, while being a believer, We will grant him a good life—and We will reward them according to the best of what they used to do.\n",
        "TRANSLATION_16": "Whoever does righteousness, whether male or female, while he is a believer - We will surely cause him to live a good life, and We will surely give them their reward [in the Hereafter] according to the best of what they used to do.\n",
        "TRANSLATION_17": "[16:97] Whoever acts righteously, whether male or female, and is a believer, him verily We shall revive with a goodly life. This is said to be life in Paradise; or it is life on earth, [when it is] one of contentedness or one of wholesome (halāl) provision. And We shall surely pay them their reward according to the best of what they used to do.\n",
        "TRANSLATION_18": "(Whosoever doeth right) sincerely between him and his Lord and acknowledges the Truth, (whether male or female, and is a believer) and, in addition, a sincere one, (him verily We shall quicken with good life) spent in obedience; it is also said that this means: a good life spent in contentment; and it is also said that this means: a good life spent in Paradise, (and We shall pay them a recompense) their reward in the Hereafter (in proportion to the best of what they used to do) because of their beneficence in this worldly life. This verse was revealed about 'Abdan Ibn al-Ashu' and Imra' al-Qays al-Kindi regarding a dispute over a plot of land.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "16:97",
            "92:3",
            "40:40",
            "16:96",
            "75:39",
            "4:124",
            "53:21",
            "36:11",
            "28:54",
            "53:45"
        ],
        "BIBLE": [
            "torah:exodus:34:10",
            "prophets:jeremiah:25:14",
            "torah:exodus:30:32",
            "writings:ecclesiastes:9:1",
            "prophets:isaiah:38:16",
            "writings:daniel:6:13",
            "torah:numbers:5:7",
            "torah:exodus:22:4",
            "torah:genesis:2:18",
            "prophets:joshua:1:8"
        ]
    }
}