{
    "VERSE": "16:99",
    "ARABIC": "إِنَّهُۥ لَيْسَ لَهُۥ سُلْطَٰنٌ عَلَى ٱلَّذِينَ ءَامَنُوا۟ وَعَلَىٰ رَبِّهِمْ يَتَوَكَّلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "He has no authority over those who have iman and put their trust in their Lord.",
        "TRANSLATION_1": "He does not have power over those who believe and place their trust in their Lord.\n",
        "TRANSLATION_2": "Surely he has no power over those who have faith and who place their trust in their Lord.\n",
        "TRANSLATION_3": "Satan has certainly no authority over the believers who have trust in their Lord.\n",
        "TRANSLATION_4": "Indeed he has no power over the believers and who rely only upon their Lord.\n",
        "TRANSLATION_5": "Verily, he has no power over those who believe and put their trust only in their Lord.\n",
        "TRANSLATION_6": "Surely he has no authority over those who believe and rely on their Lord.\n",
        "TRANSLATION_7": "he has no authority over those who believe and trust in their Lord;\n",
        "TRANSLATION_8": "Lo! he hath no power over those who believe and put trust in their Lord.\n",
        "TRANSLATION_9": "Surely, he has no power over those who believe and put their trust in their Lord;\n",
        "TRANSLATION_10": "Verily he hath no authority over those who believe and in their Lord trust\n",
        "TRANSLATION_11": "Indeed he does not have any authority over those who have faith and put their trust in their Lord.\n",
        "TRANSLATION_12": "No authority has he over those who believe and put their trust in their Lord.\n",
        "TRANSLATION_13": "Verily! He has no power over those who believe and put their trust only in their Lord (Allah).\n",
        "TRANSLATION_14": "he has no authority over the believers who put their trust in their Lord.\n",
        "TRANSLATION_15": "He has no authority over those who believe and trust in their Lord.\n",
        "TRANSLATION_16": "Indeed, there is for him no authority over those who have believed and rely upon their Lord.\n",
        "TRANSLATION_17": "[16:99] Indeed he has no power, sway, over those who believe and put their trust in their Lord.\n",
        "TRANSLATION_18": "(Lo! he hath no power) a way or overpowering (over those who believe) in Muhammad (pbuh) and in the Qur'an (and put trust in their Lord) and not in anyone else and further consign all their matters to Allah.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "16:99",
            "16:100",
            "29:59",
            "16:42",
            "2:46",
            "25:64",
            "17:65",
            "23:59",
            "20:122",
            "84:5"
        ],
        "BIBLE": [
            "writings:job:1:12",
            "prophets:ezekiel:37:14",
            "prophets:jeremiah:39:18",
            "writings:psalms:78:22",
            "writings:psalms:27:13",
            "writings:psalms:9:11",
            "writings:psalms:146:3",
            "prophets:jeremiah:5:22",
            "writings:psalms:147:5",
            "prophets:ezekiel:33:27"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:3"
        ]
    }
}