{
    "VERSE": "17:10",
    "ARABIC": "وَأَنَّ ٱلَّذِينَ لَا يُؤْمِنُونَ بِٱلْءَاخِرَةِ أَعْتَدْنَا لَهُمْ عَذَابًا أَلِيمًا",
    "ENGLISH": {
        "TRANSLATION_0": "But as for those who do not have iman in the Next World, We have prepared for them a painful punishment.",
        "TRANSLATION_1": "As for those who do not believe in the Hereafter, We have prepared a painful punishment.\n",
        "TRANSLATION_2": "and warns those who do not believe in the Hereafter that We have prepared for them a grievous chastisement.\n",
        "TRANSLATION_3": "(It also declares) that for the disbelievers We have prepared a painful torment in the life to come.\n",
        "TRANSLATION_4": "And those who do not believe in the Hereafter – We have kept prepared for them a punishment, most painful.\n",
        "TRANSLATION_5": "And that those who do not believe in the Hereafter, for them We have prepared a painful torment (Hell).\n",
        "TRANSLATION_6": "And that (as for) those who do not believe in the hereafter, We have prepared for them a painful chastisement.\n",
        "TRANSLATION_7": "and that those who do not believe in the world to come -- we have prepared for them a painful chastisement.\n",
        "TRANSLATION_8": "And that those who believe not in the Hereafter, for them We have prepared a painful doom.\n",
        "TRANSLATION_9": "and warns those who deny the life to come with grievous punishment.\n",
        "TRANSLATION_10": "And that those who believe not in the Hereafter--for them We have gotten ready a torment afflictive.\n",
        "TRANSLATION_11": "As for those who do not believe in the Hereafter, We have prepared a painful punishment for them.\n",
        "TRANSLATION_12": "And to those who believe not in the Hereafter, (it announceth) that We have prepared for them a Penalty Grievous (indeed).\n",
        "TRANSLATION_13": "And that those who believe not in the Hereafter (i.e. they disbelieve that they will be recompensed for what they did in this world, good or bad, etc.), for them We have prepared a painful torment (Hell).\n",
        "TRANSLATION_14": "and for those who do not believe in the Everlasting Life We have prepared for them a painful punishment.\n",
        "TRANSLATION_15": "And those who do not believe in the Hereafter—We have prepared for them a painful punishment.\n",
        "TRANSLATION_16": "And that those who do not believe in the Hereafter - We have prepared for them a painful punishment.\n",
        "TRANSLATION_17": "[17:10] And, it [this Qur’ān] informs, that those who do not believe in the Hereafter, We have prepared for them a painful chastisement, namely, the Fire.\n",
        "TRANSLATION_18": "(And that those who believe not in the Hereafter) those who do not believe in resurrection after death, (for them We have prepared a painful doom) in the Hereafter.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "17:10",
            "4:138",
            "26:201",
            "2:104",
            "51:37",
            "15:50",
            "16:104",
            "24:19",
            "76:31",
            "24:23"
        ],
        "BIBLE": [
            "writings:esther:5:4",
            "prophets:jeremiah:38:25",
            "prophets:isaiah:41:23",
            "torah:genesis:46:6",
            "prophets:i%20kings:13:21",
            "writings:proverbs:20:21",
            "torah:numbers:16:27",
            "prophets:i%20samuel:25:34",
            "prophets:isaiah:41:22",
            "torah:leviticus:5:23"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:8",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:3:7",
            "Sefer%20Yetzirah:3:6",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:3:5"
        ]
    }
}