{
    "VERSE": "17:100",
    "ARABIC": "قُل لَّوْ أَنتُمْ تَمْلِكُونَ خَزَآئِنَ رَحْمَةِ رَبِّىٓ إِذًا لَّأَمْسَكْتُمْ خَشْيَةَ ٱلْإِنفَاقِ وَكَانَ ٱلْإِنسَٰنُ قَتُورًا",
    "ENGLISH": {
        "TRANSLATION_0": "Say: 'Even if you possessed the vast storehouses of my Lord's mercy, you would still hold back, fearing they would run out.'",
        "TRANSLATION_1": "Say: \"Even if you owned the stores of the mercy of my Lord, you would have held them back for fear of spending them, for man is niggardly.\"\n",
        "TRANSLATION_2": "Tell them, (O Prophet): \"Even if you owned the treasures of my Lord's Mercy you would have held them back for fear of spending them.\" Man is indeed ever niggardly.\n",
        "TRANSLATION_3": "Say, \"Had you owned the treasures of the Mercy of my Lord, you would have locked them up for fear of spending them. The human being has always been stingy.\n",
        "TRANSLATION_4": "Proclaim, “If you owned the treasures of the mercy of my Lord, you would hoard them too for fear that they may get spent; and man is a big miser.”\n",
        "TRANSLATION_5": "Say: \"If you possessed the treasure of the mercy of my Lord, then you would surely hold back for fear of spending, and man is ever miserly!\"\n",
        "TRANSLATION_6": "Say: If you control the treasures of the mercy of my Lord, then you would withhold (them) from fear of spending, and man is niggardly.\n",
        "TRANSLATION_7": "Say: 'If you possessed the treasuries of my Lord's mercy, yet would you hold back for fear of expending; and man is ever niggardly.'\n",
        "TRANSLATION_8": "Say (unto them): If ye possessed the treasures of the mercy of my Lord, ye would surely hold them back for fear of spending, for man was ever grudging.\n",
        "TRANSLATION_9": "Say, \"Even if you possessed the treasures of the mercy of my Lord, you would surely hold them back for fear of spending. Man is indeed niggardly!\"\n",
        "TRANSLATION_10": "Say thou: if it were ye who owned the treasures of the mercy of my Lord, ye would surely refrain for fear of expending; and man is ever miserly.\n",
        "TRANSLATION_11": "Say, ‘Even if you possessed the treasuries of my Lord’s mercy, you would withhold them for the fear of being spent, and man is very niggardly.’\n",
        "TRANSLATION_12": "Say: \"If ye had control of the Treasures of the Mercy of my Lord, behold, ye would keep them back, for fear of spending them: for man is (every) niggardly!\"\n",
        "TRANSLATION_13": "Say (to the disbelievers): \"If you possessed the treasure of the Mercy of my Lord (wealth, money, provision, etc.), then you would surely hold back (from spending) for fear of (being exhausted), and man is ever miserly!\"\n",
        "TRANSLATION_14": "Say: 'If you possessed the treasuries of my Lord's Mercy, you would hold them back for fear of spending and mankind is ever grudging!\n",
        "TRANSLATION_15": "Say, “If you possessed the treasuries of my Lord’s mercy, you would have withheld them for fear of spending.” The human being has always been stingy.\n",
        "TRANSLATION_16": "Say [to them], \"If you possessed the depositories of the mercy of my Lord, then you would withhold out of fear of spending.\" And ever has man been stingy.\n",
        "TRANSLATION_17": "[17:100] Say, to them: ‘If you possessed the treasuries of my Lord’s mercy, [those treasuries] of provision and rain, you would surely withhold [them], [you would] stint, for fear of spending, fearing that they would be depleted if [one] spent [from them] and [that] you would then become impoverished; and man is ever niggardly’.\n",
        "TRANSLATION_18": "(Say) Muhammad, to the people of Mecca: (If you possessed the treasures of the mercy of my Lord) if you possessed the keys to the stores of the provision of my Lord, (ye would surely hold them back for fear of spending) for fear of becoming poor, (for man) i.e. the disbelieving man (was ever grudging) parsimonious, stingy and tight-fisted.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "17:100",
            "11:9",
            "26:9",
            "26:104",
            "26:175",
            "26:159",
            "26:122",
            "26:140",
            "26:68",
            "26:191"
        ],
        "BIBLE": [
            "prophets:isaiah:64:11",
            "torah:genesis:24:21",
            "prophets:isaiah:57:11",
            "writings:psalms:62:13",
            "writings:daniel:10:19",
            "writings:job:11:3",
            "prophets:micah:6:8",
            "prophets:i%20samuel:10:27",
            "prophets:jonah:1:10",
            "torah:leviticus:10:3"
        ]
    }
}