{
    "VERSE": "17:102",
    "ARABIC": "قَالَ لَقَدْ عَلِمْتَ مَآ أَنزَلَ هَٰٓؤُلَآءِ إِلَّا رَبُّ ٱلسَّمَٰوَٰتِ وَٱلْأَرْضِ بَصَآئِرَ وَإِنِّى لَأَظُنُّكَ يَٰفِرْعَوْنُ مَثْبُورًا",
    "ENGLISH": {
        "TRANSLATION_0": "He said, 'You know that no one sent these down but the Lord of the heavens and earth to be clear proofs. Pharaoh, I think you are destroyed.'",
        "TRANSLATION_1": "He replied: \"You know that none but the Lord of the heavens and the earth has sent these (signs) as cogent proof. I truly think, O Pharaoh, your days are done.\"\n",
        "TRANSLATION_2": "Moses replied: \"You know well that no one but the Lord of the heavens and the earth has sent these as eye-opening proofs. I truly think, O Pharaoh, that you are indeed doomed.\"\n",
        "TRANSLATION_3": "He replied, \"Certainly you have come to know that these have been sent by the Lord of the heavens and the earth as lessons to people. Pharaoh, I believe that you are doomed to perdition.\n",
        "TRANSLATION_4": "He said, “You certainly know that these have not been sent down except by the Lord of the heavens and the earth, the eye-openers* for the hearts; and I think that you, O Firaun, will surely be ruined.” (* The signs which enlighten the hearts.)\n",
        "TRANSLATION_5": "He said: \"Verily, you know that these signs have been sent down by none but the Lord of the heavens and the earth. And I think you are indeed, O Fir`awn, doomed to destruction!\"\n",
        "TRANSLATION_6": "He said: Truly you know that none but the Lord of the heavens and the earth has sent down these as clear proof and most surely I believe you, O Firon, to be given over to perdition.\n",
        "TRANSLATION_7": "He said, 'Indeed thou knowest that none sent these down, except the Lord of the heavens and earth, as clear proofs; and, Pharaoh, I think thou art accursed.'\n",
        "TRANSLATION_8": "He said: In truth thou knowest that none sent down these (portents) save the Lord of the heavens and the earth as proofs, and lo! (for my part) I deem thee lost, O Pharaoh.\n",
        "TRANSLATION_9": "He said, \"You know full well that none has sent down these signs but the Lord of the heavens and the earth as eye-opening evidence. Indeed, Pharaoh, I can see that you are doomed.\"\n",
        "TRANSLATION_10": "Musa said: assuredly thou knowest that none hath sent down these save the Lord of the heavens and the earth as an enlightenment; and verily imagine thee, Fir'awn, doomed.\n",
        "TRANSLATION_11": "He said, ‘You certainly know that no one has sent these [signs] except the Lord of the heavens and the earth, as eye-openers, and I, O Pharaoh, indeed think you are doomed.’\n",
        "TRANSLATION_12": "Moses said, \"Thou knowest well that these things have been sent down by none but the Lord of the heavens and the earth as eye-opening evidence: and I consider thee indeed, O Pharaoh, to be one doomed to destruction!\"\n",
        "TRANSLATION_13": "[Musa (Moses)] said: \"Verily, you know that these signs have been sent down by none but the Lord of the heavens and the earth as clear (evidences i.e. proofs of Allah's Oneness and His Omnipotence, etc.). And I think you are, indeed, O Fir'aun (Pharaoh) doomed to destruction (away from all good)!\"\n",
        "TRANSLATION_14": "You know' he replied, 'that none except the Lord of the heavens and the earth has sent down these as clear proofs. Pharaoh, I believe you are destroyed.'\n",
        "TRANSLATION_15": "He said, “You know that none sent these down except the Lord of the heavens and the earth—eye openers; and I think that you, Pharaoh, are doomed.”\n",
        "TRANSLATION_16": "[Moses] said, \"You have already known that none has sent down these [signs] except the Lord of the heavens and the earth as evidence, and indeed I think, O Pharaoh, that you are destroyed.\"\n",
        "TRANSLATION_17": "[17:102] He [Moses] said, ‘Indeed you know that none revealed these, signs, except the Lord of the heavens and the earth, as proofs, lessons; however, you are being stubborn (a variant reading [for ‘alimta, ‘you know’] has ‘alimtu [‘I know’]); and I truly think that you, O Pharaoh, are doomed’, [that you] will be destroyed — or [it, mathbūran, means that Pharaoh has been] turned away from [all deeds that are] good.\n",
        "TRANSLATION_18": "(He said) Moses said to him: (In truth thou knowest) Pharaoh (that none sent down these (portents)) these signs (save the Lord of the heavens and the earth as proofs) as an indication and sign of my prophethood, (and lo! (for my part) I deem) I know and believe (thee lost, Pharaoh) that you are a lost disbeliever.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "17:102",
            "11:107",
            "14:38",
            "21:56",
            "44:29",
            "51:23",
            "49:18",
            "21:4",
            "26:24",
            "44:7"
        ],
        "BIBLE": [
            "prophets:joshua:23:14",
            "prophets:i%20kings:18:36",
            "writings:nehemiah:6:8",
            "torah:exodus:4:21",
            "writings:i%20chronicles:29:17",
            "torah:exodus:10:1",
            "prophets:isaiah:38:3",
            "prophets:i%20samuel:12:24",
            "torah:deuteronomy:27:9",
            "torah:deuteronomy:4:39"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:4:2"
        ]
    }
}