{
    "VERSE": "17:105",
    "ARABIC": "وَبِٱلْحَقِّ أَنزَلْنَٰهُ وَبِٱلْحَقِّ نَزَلَ وَمَآ أَرْسَلْنَٰكَ إِلَّا مُبَشِّرًا وَنَذِيرًا",
    "ENGLISH": {
        "TRANSLATION_0": "We have sent it down with truth and with truth it has come down. We only sent you to bring good news and to give warning.",
        "TRANSLATION_1": "We have sent it down with truth, and with truth has (the Qur'an) come down. And We have sent you only to give good news and to warn.\n",
        "TRANSLATION_2": "We have sent down the Qur'an with the Truth, and it is with the Truth that it has descended. And We have not sent you but to proclaim good news and to warn.\n",
        "TRANSLATION_3": "We sent it (the Quran) in all Truth and in all Truth it came. (Muhammad), We have sent you for no other reason than to be a bearer of glad news and a warner.\n",
        "TRANSLATION_4": "And We sent down the Qur’an with the truth, and it has come down only for the truth; and We did not send you except as a Herald of glad tidings and warnings.\n",
        "TRANSLATION_5": "And with truth We have sent it down, and with truth it has descended. And We have sent you as nothing but a bearer of glad tidings, and a warner.\n",
        "TRANSLATION_6": "And with truth have We revealed it, and with truth did it come; and We have not sent you but as the giver of good news and as a warner.\n",
        "TRANSLATION_7": "With the truth We have sent it down, and with the truth it has come down; and We have sent thee not, except good tidings to bear, and warning;\n",
        "TRANSLATION_8": "With truth have We sent it down, and with truth hath it descended. And We have sent thee as naught else save a bearer of good tidings and a warner.\n",
        "TRANSLATION_9": "We have revealed the Quran with the truth, and with the truth it has come down. We have sent you forth only to give good news and to give warning --\n",
        "TRANSLATION_10": "And with truth We have sent it down and with truth it hath come down; and We have not sent thee but as a bringer of glad tidings and a warner.\n",
        "TRANSLATION_11": "With the truth did We send it down, and with the truth did it descend, and We did not send you except as a bearer of good news and as a warner.\n",
        "TRANSLATION_12": "We sent down the (Qur'an) in Truth, and in Truth has it descended: and We sent thee but to give Glad Tidings and to warn (sinners).\n",
        "TRANSLATION_13": "And with truth We have sent it down (i.e. the Quran), and with truth it has descended. And We have sent you (O Muhammad SAW) as nothing but a bearer of glad tidings (of Paradise, for those who follow your Message of Islamic Monotheism), and a warner (of Hell-fire for those who refuse to follow your Message of Islamic Monotheism).\n",
        "TRANSLATION_14": "We have sent it down with the truth, and with the truth it has come down. We have not sent you except a bearer of glad tidings and a warner,\n",
        "TRANSLATION_15": "With the truth We sent it down, and with the truth it descended. We sent you only as a bearer of good news and a warner.\n",
        "TRANSLATION_16": "And with the truth We have sent the Qur'an down, and with the truth it has descended. And We have not sent you, [O Muhammad], except as a bringer of good tidings and a warner.\n",
        "TRANSLATION_17": "[17:105] With the truth have We revealed it, that is, the Qur’ān, and with the truth, it comprises, has it been revealed, in the way it has, unaffected by any alterations; and We have not sent you, O Muhammad (s), except as a bearer of good tidings, of Paradise, for those who believe, and as a warner, of the Fire, for those who disbelieve.\n",
        "TRANSLATION_18": "(With truth have We sent it down) We have sent Gabriel to Muhammad (pbuh) with the Qur'an, (and with truth hath it descended) he descended with the Qur'an. (And We have sent thee) Muhammad (as naught else save a bearer of good tidings) of Paradise (and a warner) from hell.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "17:105",
            "25:56",
            "35:24",
            "34:49",
            "44:39",
            "15:64",
            "2:119",
            "25:33",
            "34:34",
            "15:8"
        ],
        "BIBLE": [
            "torah:genesis:19:8",
            "torah:numbers:18:32",
            "writings:psalms:38:21",
            "prophets:ii%20kings:8:9",
            "prophets:i%20kings:12:20",
            "prophets:i%20kings:18:21",
            "prophets:judges:2:19",
            "prophets:i%20kings:17:18",
            "writings:daniel:5:10",
            "prophets:jeremiah:3:19"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:1:5"
        ]
    }
}