{
    "VERSE": "17:11",
    "ARABIC": "وَيَدْعُ ٱلْإِنسَٰنُ بِٱلشَّرِّ دُعَآءَهُۥ بِٱلْخَيْرِ وَكَانَ ٱلْإِنسَٰنُ عَجُولًا",
    "ENGLISH": {
        "TRANSLATION_0": "Man prays for evil just as he prays for good. Man is prone to be impetuous.",
        "TRANSLATION_1": "Man prays for evil as he prays for good, for man is hasty.\n",
        "TRANSLATION_2": "Man prays for evil in the manner he ought to pray for good. Man is ever hasty.\n",
        "TRANSLATION_3": "People pray as earnestly to gain evil as one should to gain virtue. But people are hasty.\n",
        "TRANSLATION_4": "And man prays for evil like the way he seeks goodness; and man is very hasty.\n",
        "TRANSLATION_5": "And man invokes (Allah) for evil as he invokes (Allah) for good and man is ever hasty.\n",
        "TRANSLATION_6": "And man prays for evil as he ought to pray for good, and man is ever hasty.\n",
        "TRANSLATION_7": "Man prays for evil, as he prays for good; man is ever hasty.\n",
        "TRANSLATION_8": "Man prayeth for evil as he prayeth for good; for man was ever hasty.\n",
        "TRANSLATION_9": "Yet man asks for evil as eagerly as he should ask for good. Truly, man is indeed hasty.\n",
        "TRANSLATION_10": "And man prayeth for evil the prayer he should make for good, and man is ever hasty.\n",
        "TRANSLATION_11": "Man prays for ill as [avidly as] he prays for good, and man is overhasty.\n",
        "TRANSLATION_12": "The prayer that man should make for good, he maketh for evil; for man is given to hasty (deeds).\n",
        "TRANSLATION_13": "And man invokes (Allah) for evil as he invokes (Allah) for good and man is ever hasty [i.e., if he is angry with somebody, he invokes (saying): \"O Allah! Curse him, etc.\" and that one should not do, but one should be patient].\n",
        "TRANSLATION_14": "Yet the human prays for evil as he prays for good mankind is always hasty.\n",
        "TRANSLATION_15": "The human being prays for evil as he prays for good. The human being is very hasty.\n",
        "TRANSLATION_16": "And man supplicates for evil as he supplicates for good, and man is ever hasty.\n",
        "TRANSLATION_17": "[17:11] And man prays for ill, against himself and his family when he is frustrated, as [avidly as] he prays for good. And mankind is ever hasty, to pray against himself, without contemplating the consequence thereof.\n",
        "TRANSLATION_18": "(Man) i.e. al-Nadr Ibn al-Harth (prayeth for evil) prays for curses and chastisement to descend on himself and his family (as he prays for good) as he prays for well-being and mercy; (for man) al-Nadr Ibn al-Harth (was ever hasty) he is hasty to encounter chastisement. 299\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "17:11",
            "41:49",
            "41:51",
            "17:83",
            "10:11",
            "21:35",
            "99:3",
            "70:21",
            "76:7",
            "75:13"
        ],
        "BIBLE": [
            "writings:esther:3:11",
            "prophets:jeremiah:44:20",
            "prophets:jeremiah:25:5",
            "writings:ii%20chronicles:19:6",
            "prophets:i%20kings:8:36",
            "writings:ii%20chronicles:6:27",
            "writings:proverbs:22:24",
            "prophets:jeremiah:35:15",
            "prophets:i%20samuel:18:8",
            "torah:numbers:11:13"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:7"
        ]
    }
}