{
    "VERSE": "17:13",
    "ARABIC": "وَكُلَّ إِنسَٰنٍ أَلْزَمْنَٰهُ طَٰٓئِرَهُۥ فِى عُنُقِهِۦ وَنُخْرِجُ لَهُۥ يَوْمَ ٱلْقِيَٰمَةِ كِتَٰبًا يَلْقَىٰهُ مَنشُورًا",
    "ENGLISH": {
        "TRANSLATION_0": "We have fastened the destiny of every man about his neck and on the Day of Rising We will bring out a Book for him which he will find spread open in front of him.",
        "TRANSLATION_1": "Round each man's neck We have hung his ledger of deeds, and on the Day of Resurrection will present it as a book spread out (and say):\n",
        "TRANSLATION_2": "We have fastened every man's omen to his neck. On the Day of Resurrection We shall produce for him his scroll in the shape of a wide open book, (saying):\n",
        "TRANSLATION_3": "We have made every person's actions cling to his neck. On the Day of Judgment, We will bring forth the record of his actions in the form of a wide open book.\n",
        "TRANSLATION_4": "And We have attached the destiny of every man to his neck; and We shall bring forth a register for him on the Day of Resurrection, which he will find open.\n",
        "TRANSLATION_5": "And We have fastened every man's Ta'irah (deeds) to his neck, and on the Day of Resurrection, We shall bring out for him a Book which he will find wide open.\n",
        "TRANSLATION_6": "And We have made every man's actions to cling to his neck, and We will bring forth to him on the resurrection day a book which he will find wide open:\n",
        "TRANSLATION_7": "And every man -- We have fastened to him his bird of omen upon his neck; and We shall bring forth for him, on the Day of Resurrection, a book he shall find spread wide open.\n",
        "TRANSLATION_8": "And every man's augury have We fastened to his own neck, and We shall bring forth for him on the Day of Resurrection a book which he will find wide open.\n",
        "TRANSLATION_9": "We have tied the fate of every man about his neck; and We shall produce a book for him on Resurrection Day that he will find spread open.\n",
        "TRANSLATION_10": "And every man: We have fastened his action round his neck, and We shall bring forth unto him on the Day of Judgment a book proffered him open.\n",
        "TRANSLATION_11": "We have attached every person’s omen to his neck, and We shall bring it out for him on the Day of Resurrection as a book that he will find wide open.\n",
        "TRANSLATION_12": "Every man's fate We have fastened on his own neck: On the Day of Judgment We shall bring out for him a scroll, which he will see spread open.\n",
        "TRANSLATION_13": "And We have fastened every man's deeds to his neck, and on the Day of Resurrection, We shall bring out for him a book which he will find wide open.\n",
        "TRANSLATION_14": "And to every human? We have fastened to him his bird of deeds upon his neck; and on the Day of Resurrection We shall bring forth to him a book spread open wide.\n",
        "TRANSLATION_15": "For every person We have attached his fate to his neck. And on the Day of Resurrection, We will bring out for him a book which he will find spread open.\n",
        "TRANSLATION_16": "And [for] every person We have imposed his fate upon his neck, and We will produce for him on the Day of Resurrection a record which he will encounter spread open.\n",
        "TRANSLATION_17": "[17:13] And We have attached every person’s omen — his deeds — for him to carry, upon his neck — this [site] is singled out for mention because fastening [something] to it is [much] more severe; Mujāhid [b. Jabr alMakkī] said, ‘There is not a child born but it has a leaf around its neck in which it is decreed [that the child will be either] fortunate or damned’ — and We shall bring forth for him, on the Day of Resurrection, a book, in which his deeds are recorded [and], which he will find wide open (yalqāhu manshūran: both are adjectival qualifications of kitāban, ‘a book’).\n",
        "TRANSLATION_18": "(And every man's augury) the scroll containing his answer to [the angels] Munkar and Nakir in the grave (have We fastened to his own neck) it is also said that this refers to every man's good and evil deeds; and it is also said that it refers to whether he is felicitous or damned, (and We shall bring forth for him on the Day of Resurrection a book which he will find) he will be given (wide open) containing his good and bad deeds.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "17:13",
            "45:28",
            "25:69",
            "17:71",
            "20:101",
            "19:95",
            "78:29",
            "55:29",
            "28:42",
            "3:161"
        ],
        "BIBLE": [
            "prophets:isaiah:22:17",
            "prophets:jeremiah:12:9",
            "prophets:zechariah:8:23",
            "prophets:ii%20kings:14:6",
            "prophets:ii%20kings:4:16",
            "torah:numbers:7:11",
            "writings:nehemiah:8:1",
            "prophets:i%20samuel:9:7",
            "prophets:ii%20samuel:3:12",
            "prophets:isaiah:4:1"
        ]
    }
}