{
    "VERSE": "17:19",
    "ARABIC": "وَمَنْ أَرَادَ ٱلْءَاخِرَةَ وَسَعَىٰ لَهَا سَعْيَهَا وَهُوَ مُؤْمِنٌ فَأُو۟لَٰٓئِكَ كَانَ سَعْيُهُم مَّشْكُورًا",
    "ENGLISH": {
        "TRANSLATION_0": "But as for anyone who desires the Next World, and strives for it with the striving it deserves, being a",
        "TRANSLATION_1": "But he who desires the Hereafter, and strives for it with a will, and is a believer, will be favoured for his endeavour.\n",
        "TRANSLATION_2": "But he who desires the Hereafter and strives for it in the manner he should, and is a true believer, his striving will come to fruition.\n",
        "TRANSLATION_3": "The effort of one who faithfully strives hard for the (happiness) of the life to come will be appreciated (by God).\n",
        "TRANSLATION_4": "And whoever desires the Hereafter and strives for it accordingly, and is a believer – so only their effort has borne fruit.\n",
        "TRANSLATION_5": "And whoever desires the Hereafter and strives for it, with the necessary effort due for it while he is a believer, then such are the ones whose striving shall be appreciated, (rewarded by Allah).\n",
        "TRANSLATION_6": "And whoever desires the hereafter and strives for it as he ought to strive and he is a believer; (as for) these, their striving shall surely be accepted.\n",
        "TRANSLATION_7": "And whosoever desires the world to come and strives after it as he should, being a believer -- those, their striving shall be thanked.\n",
        "TRANSLATION_8": "And whoso desireth the Hereafter and striveth for it with the effort necessary, being a believer; for such, their effort findeth favour (with their Lord).\n",
        "TRANSLATION_9": "Anyone who desires the Hereafter and makes a proper effort to achieve it, being a true believer, shall find favour with God for his endeavours.\n",
        "TRANSLATION_10": "And whosoever intendeth the Hereafter and striveth therefor with due striving, while he is a believer, then those: their striving shall be appreciated.\n",
        "TRANSLATION_11": "Whoever desires the Hereafter and strives for it with an endeavour worthy of it, should he be faithful,—the endeavour of such will be well-appreciated.\n",
        "TRANSLATION_12": "Those who do wish for the (things of) the Hereafter, and strive therefor with all due striving, and have Faith,- they are the ones whose striving is acceptable (to Allah).\n",
        "TRANSLATION_13": "And whoever desires the Hereafter and strives for it, with the necessary effort due for it (i.e. do righteous deeds of Allah's Obedience) while he is a believer (in the Oneness of Allah Islamic Monotheism), then such are the ones whose striving shall be appreciated, thanked and rewarded (by Allah).\n",
        "TRANSLATION_14": "Whosoever, being a believer, desires the Everlasting Life and strives for it as he should those their striving will be thanked.\n",
        "TRANSLATION_15": "But whoever desires the Hereafter, and pursues it as it should be pursued, while he is a believer; these—their effort will be appreciated.\n",
        "TRANSLATION_16": "But whoever desires the Hereafter and exerts the effort due to it while he is a believer - it is those whose effort is ever appreciated [by Allah].\n",
        "TRANSLATION_17": "[17:19] And whoever desires the Hereafter and strives for it with the necessary effort, [that is] he performs the deeds worthy of it, being a believer (wa-huwa mu’minun is a circumstantial qualifier) — for such their effort will find favour, with God, that is, [their effort will be] accepted and rewarded.\n",
        "TRANSLATION_18": "(And whoso desireth the Hereafter) i.e. Paradise by performing that which was made obligatory upon him (and striveth for it with the effort necessary) strives to enter Paradise by performing the acts that lead to it, (being a believer) and besides this he is a sincere believer; (for such, their effort) their works (findeth favour (with their Lord)) their works are accepted. This verse was revealed about Bilal the Muezzin.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "17:19",
            "21:94",
            "11:16",
            "77:17",
            "75:21",
            "17:72",
            "30:16",
            "88:9",
            "37:119",
            "37:129"
        ],
        "BIBLE": [
            "prophets:ii%20samuel:23:5",
            "prophets:isaiah:38:16",
            "writings:daniel:6:13",
            "writings:psalms:71:16",
            "prophets:ezekiel:43:27",
            "writings:ezra:10:3",
            "prophets:ezekiel:35:11",
            "prophets:i%20kings:14:13",
            "torah:exodus:23:13",
            "prophets:ezekiel:39:26"
        ]
    }
}