{
    "VERSE": "17:2",
    "ARABIC": "وَءَاتَيْنَا مُوسَى ٱلْكِتَٰبَ وَجَعَلْنَٰهُ هُدًى لِّبَنِىٓ إِسْرَٰٓءِيلَ أَلَّا تَتَّخِذُوا۟ مِن دُونِى وَكِيلًا",
    "ENGLISH": {
        "TRANSLATION_0": "We gave Musa the Book and made it guidance for the tribe of Israel: 'Do not take anyone besides Me as a guardian.'",
        "TRANSLATION_1": "We gave Moses the Book, and made it a guidance for the children of Israel that they should not take another protector apart from Me.\n",
        "TRANSLATION_2": "We gave Moses the Book, and made it a source of guidance for the Children of Israel, commanding: \"Take no other Guardian beside Me.\"\n",
        "TRANSLATION_3": "To Moses We gave the Book and made it a guide for the children of Israel, so that they would not have any one as their guardian other than Me\n",
        "TRANSLATION_4": "And We gave Moosa the Book, and made it a guidance for the Descendants of Israel that, “Do not appoint anyone as a Trustee besides Me.”\n",
        "TRANSLATION_5": "And We gave Musa the Scripture and made it a guidance for the Children of Israel (saying): \"Take none other than Me as (your) Wakil.\"\n",
        "TRANSLATION_6": "And We gave Musa the Book and made it a guidance to the children of Israel, saying: Do not take a protector besides Me;\n",
        "TRANSLATION_7": "And We gave Moses the Book, and made it a guidance to the Children of Israel: 'Take not unto yourselves any guardian apart from Me.'\n",
        "TRANSLATION_8": "We gave unto Moses the Scripture, and We appointed it a guidance for the children of Israel, saying: Choose no guardian beside Me.\n",
        "TRANSLATION_9": "We gave Moses the Book and made it a guide for the Children of Israel saying, \"Do not take anyone besides Me as a guardian,\n",
        "TRANSLATION_10": "And We vouchsafed unto Musa the Book and We appointed it as a guidance to the Children of Isra'il: take not beside Me a trustee.\n",
        "TRANSLATION_11": "We gave Moses the Book, and made it a guide for the Children of Israel—[saying,] ‘Do not take any trustee besides Me’—\n",
        "TRANSLATION_12": "We gave Moses the Book, and made it a Guide to the Children of Israel, (commanding): \"Take not other than Me as Disposer of (your) affairs.\"\n",
        "TRANSLATION_13": "And We gave Musa (Moses) the Scripture and made it a guidance for the Children of Israel (saying): \"Take not other than Me as (your) Wakil (Protector, Lord, or Disposer of your affairs, etc).\n",
        "TRANSLATION_14": "We gave Moses the Book and made it a guide for the Children of Israel. 'Take no guardian other than Me.\n",
        "TRANSLATION_15": "And We gave Moses the Scripture, and made it a guide for the Children of Israel: Take none for protector other than Me.\n",
        "TRANSLATION_16": "And We gave Moses the Scripture and made it a guidance for the Children of Israel that you not take other than Me as Disposer of affairs,\n",
        "TRANSLATION_17": "[17:2] God, exalted be He, says: And We gave Moses the Scripture, the Torah, and made it a guidance for the Children of Israel [saying] that they should not choose beside Me any guardian, to whom they delegate their affairs (a variant reading [for yattakhidhū, ‘they should [not] choose’] is tattakhidhū, ‘you should [not] choose’, thus turning away [from the third person address], in which case [the particle] an, ‘that’, is extra and the ‘saying’ is implicit).\n",
        "TRANSLATION_18": "(We gave unto Moses the Scripture) We gave Moses the Torah in one instalment, (and We appointed it a guidance for the Children of Israel) from error, (saying: Choose) worship (no guardian) no lord (beside Me).\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "17:2",
            "40:53",
            "32:23",
            "18:27",
            "2:2",
            "4:123",
            "2:159",
            "42:6",
            "10:37",
            "16:64"
        ],
        "BIBLE": [
            "torah:numbers:18:6",
            "torah:numbers:8:16",
            "prophets:joshua:11:23",
            "torah:numbers:27:12",
            "torah:numbers:20:12",
            "torah:numbers:31:47",
            "torah:numbers:18:24",
            "torah:leviticus:7:34",
            "torah:genesis:21:27",
            "writings:job:1:21"
        ]
    }
}