{
    "VERSE": "17:20",
    "ARABIC": "كُلًّا نُّمِدُّ هَٰٓؤُلَآءِ وَهَٰٓؤُلَآءِ مِنْ عَطَآءِ رَبِّكَ وَمَا كَانَ عَطَآءُ رَبِّكَ مَحْظُورًا",
    "ENGLISH": {
        "TRANSLATION_0": "We sustain each one, the former and the latter, through the generous giving of your Lord; and the giving of your Lord is not restricted.",
        "TRANSLATION_1": "We bestow from the gifts of your Lord on these and on those, for the gifts of your Lord are not restricted.\n",
        "TRANSLATION_2": "To all of these as well as those We shall provide the wherewithal of this life in the present world by dint of your Lord's Bounty; and from none shall the Bounty of your Lord be withheld.\n",
        "TRANSLATION_3": "Each group will receive its share of your Lord's generosity. Your Lord's generosity is not limited.\n",
        "TRANSLATION_4": "We provide help to all – to these and to those, by the bestowal of your Lord; and there is no constraint on the bestowal of your Lord.\n",
        "TRANSLATION_5": "On each these as well as those We bestow from the bounties of your Lord. And the bounties of your Lord can never be forbidden.\n",
        "TRANSLATION_6": "All do We aid-- these as well as those-- out of the bounty of your Lord, and the bounty of your Lord is not confined.\n",
        "TRANSLATION_7": "Each We succour, these and those, from thy Lord's gift; and thy Lord's gift is not confined.\n",
        "TRANSLATION_8": "Each do We supply, both these and those, from the bounty of thy Lord. And the bounty of thy Lord can never be walled up.\n",
        "TRANSLATION_9": "Upon all, both these  [who desire the world] and those [who desire the Hereafter] We bestow the bounty of your Lord: none shall be denied the bounty of your Lord --\n",
        "TRANSLATION_10": "To each--these and those--We extend of the bestowment of thy Lord; and the bestowment of thy Lord is never restrained.\n",
        "TRANSLATION_11": "To these and to those—to all We extend the bounty of your Lord, and the bounty of your Lord is not confined.\n",
        "TRANSLATION_12": "Of the bounties of thy Lord We bestow freely on all- These as well as those: The bounties of thy Lord are not closed (to anyone).\n",
        "TRANSLATION_13": "To each these as well as those We bestow from the Bounties of your Lord. And the Bounties of your Lord can never be forbidden.\n",
        "TRANSLATION_14": "We help these and those, a gift from your Lord; and your Lord's gift is not restricted.\n",
        "TRANSLATION_15": "To all—these and those—We extend from the gifts of your Lord. The gifts of your Lord are not restricted.\n",
        "TRANSLATION_16": "To each [category] We extend - to these and to those - from the gift of your Lord. And never has the gift of your Lord been restricted.\n",
        "TRANSLATION_17": "[17:20] Each, of the two parties, We supply, We give, [to] these and [to] those (hā’ūlā’ wa-hā’ūlā’ is a substitute [for kullan, ‘each’) from (min is semantically connected to numiddu, ‘We supply’) from your Lord’s bounty, in this world. And your Lord’s bounty, therein, is not confined, [it is not] forbidden to anyone.\n",
        "TRANSLATION_18": "(Each do We supply) provision, (both these) the obedient people (and those) and the disobedient people, (from the bounty of thy Lord) from the provision of your Lord. (And the bounty of thy Lord) and the provision of your Lord (can never be walled up) withheld from either the obedient or sinful person.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "17:20",
            "93:3",
            "6:132",
            "78:36",
            "40:27",
            "25:31",
            "79:19",
            "74:7",
            "94:8",
            "74:3"
        ],
        "BIBLE": [
            "prophets:jeremiah:39:18",
            "torah:numbers:18:28",
            "writings:proverbs:4:10",
            "writings:psalms:17:14",
            "writings:proverbs:19:23",
            "prophets:isaiah:66:12",
            "prophets:jonah:2:7",
            "prophets:jeremiah:51:6",
            "prophets:i%20kings:20:42",
            "prophets:judges:13:23"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:1",
            
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:4:8",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:2:5"
        ]
    }
}