{
    "VERSE": "17:28",
    "ARABIC": "وَإِمَّا تُعْرِضَنَّ عَنْهُمُ ٱبْتِغَآءَ رَحْمَةٍ مِّن رَّبِّكَ تَرْجُوهَا فَقُل لَّهُمْ قَوْلًا مَّيْسُورًا",
    "ENGLISH": {
        "TRANSLATION_0": "But if you do turn away from them, seeking the mercy you hope for from your Lord, then speak to them with words that bring them ease.",
        "TRANSLATION_1": "If you neglect (your parents) while seeking the bounty of your Lord, of which you are hopeful, speak to them softly.\n",
        "TRANSLATION_2": "(v) And when you must turn away from them - (that is, from the destitute, the near of kin, the needy, and the wayfarer) - in pursuit of God's Mercy which you expect to receive, then speak to them kindly.\n",
        "TRANSLATION_3": "If you are not able to assist them, at least speak to them in a kind manner.\n",
        "TRANSLATION_4": "And if you turn away from these*, expecting the mercy of your Lord, for which you hope, then speak to them an easy word. (* The companions of the Holy Prophet, who sought his assistance.)\n",
        "TRANSLATION_5": "And if you turn away from them and you are awaiting a mercy from your Lord for which you hope, then, speak unto them a soft, kind word.\n",
        "TRANSLATION_6": "And if you turn away from them to seek mercy from your Lord, which you hope for, speak to them a gentle word.\n",
        "TRANSLATION_7": "But if thou turnest from them, seeking mercy from thy Lord that thou hopest for, then speak unto them gentle words.\n",
        "TRANSLATION_8": "But if thou turn away from them, seeking mercy from thy Lord, for which thou hopest, then speak unto them a reasonable word.\n",
        "TRANSLATION_9": "but if, while waiting for your Lord's bounty which you are expecting, you turn them down, then at least speak to them kindly.\n",
        "TRANSLATION_10": "And if thou turnest away from them awaiting a mercy from thy Lord which thou hopest, then speak unto them a gentle speech.\n",
        "TRANSLATION_11": "And if you have to hold off from [assisting] them [for now], seeking your Lord’s mercy which you expect [in the future], speak to them gentle words.\n",
        "TRANSLATION_12": "And even if thou hast to turn away from them in pursuit of the Mercy from thy Lord which thou dost expect, yet speak to them a word of easy kindness.\n",
        "TRANSLATION_13": "And if you (O Muhammad SAW) turn away from them (kindred, poor, wayfarer, etc. whom We have ordered you to give their rights, but if you have no money at the time they ask you for it) and you are awaiting a mercy from your Lord for which you hope, then, speak unto them a soft kind word (i.e. Allah will give me and I shall give you).\n",
        "TRANSLATION_14": "But if you turn away from them to seek the Mercy of your Lord, hoping to attain it, then speak to them with gentle words.\n",
        "TRANSLATION_15": "But if you turn away from them, seeking mercy from your Lord which you hope for, then say to them words of comfort.\n",
        "TRANSLATION_16": "And if you [must] turn away from the needy awaiting mercy from your Lord which you expect, then speak to them a gentle word.\n",
        "TRANSLATION_17": "[17:28] But if you [have to] overlook them, that is, the kinsmen and the others mentioned, and do not give to them, seeking mercy from your Lord, [a mercy] which you expect [in the future], that is, [you do not give to them] because of a request for provision which you are waiting to come to you [from your Lord], before you give to them, then speak to them gentle words, pleasant and reasonable [words], promising them that you will give to them when the provision [from God] arrives.\n",
        "TRANSLATION_18": "(But if thou turn away from them) if you turn away from your kinsmen and the needy because of diffidence and mercy, (seeking mercy from thy Lord) waiting for the mercy of your Lord, (for which thou hope) to come to you; it is also said that this means: if you are waiting for some wealth to come to you, (then speak unto them a reasonable word) promise them kindly that you will give them something in the future.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "17:28",
            "108:2",
            "84:2",
            "84:5",
            "15:56",
            "15:98",
            "28:86",
            "74:7",
            "2:157",
            "7:151"
        ],
        "BIBLE": [
            "prophets:isaiah:12:1",
            "prophets:zechariah:1:6",
            "torah:deuteronomy:13:18",
            "prophets:jeremiah:31:23",
            "writings:psalms:69:17",
            "prophets:i%20kings:18:36",
            "torah:deuteronomy:28:14",
            "prophets:ii%20kings:5:26",
            "prophets:ezekiel:12:28",
            "torah:deuteronomy:5:29"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:1:6"
        ]
    }
}