{
    "VERSE": "17:3",
    "ARABIC": "ذُرِّيَّةَ مَنْ حَمَلْنَا مَعَ نُوحٍ إِنَّهُۥ كَانَ عَبْدًا شَكُورًا",
    "ENGLISH": {
        "TRANSLATION_0": "Descendants of those We carried with Nuh. He was a grateful slave.",
        "TRANSLATION_1": "O you, the offspring of those We bore (in the ark) with Noah, he was indeed a grateful votary.\n",
        "TRANSLATION_2": "You are the descendants of those whom We carried (in the Ark) with Noah. He was truly a thankful servant.\n",
        "TRANSLATION_3": "(We made it a guide for) the offspring of those whom We carried in the Ark with Noah, a thankful servant (of God).\n",
        "TRANSLATION_4": "The descendants of those whom We boarded along with Nooh; he was indeed a grateful bondman.\n",
        "TRANSLATION_5": "O offspring of those whom We carried (in the ship) with Nuh! Verily, he was a grateful servant.\"\n",
        "TRANSLATION_6": "The offspring of those whom We bore with Nuh; surely he was a grateful servant.\n",
        "TRANSLATION_7": "The seed of those We bore with Noah; he was a thankful servant.\n",
        "TRANSLATION_8": "(They were) the seed of those whom We carried (in the ship) along with Noah. Lo! he was a grateful slave.\n",
        "TRANSLATION_9": "you who are the descendants of those whom We carried in the Ark with Noah. He was a truly thankful servant.\"\n",
        "TRANSLATION_10": "O progeny of those whom We bare with Nuh: verily he was a bondman grateful.\n",
        "TRANSLATION_11": "descendants of those whom We carried [in the ark] with Noah. Indeed, he was a grateful servant.\n",
        "TRANSLATION_12": "O ye that are sprung from those whom We carried (in the Ark) with Noah! Verily he was a devotee most grateful.\n",
        "TRANSLATION_13": "O offspring of those whom We carried (in the ship) with Nuh (Noah)! Verily, he was a grateful slave.\"\n",
        "TRANSLATION_14": "(You are) the descendants of those whom We carried (in the Ark) with Noah. He was a truly thankful worshiper'\n",
        "TRANSLATION_15": "The descendants of those We carried with Noah. He was an appreciative servant.\n",
        "TRANSLATION_16": "O descendants of those We carried [in the ship] with Noah. Indeed, he was a grateful servant.\n",
        "TRANSLATION_17": "[17:3] descendants of those whom We carried with Noah, in the Ark. Indeed he was a grateful servant, giving thanks to Us frequently, and offering praise in whichever state he found himself.\n",
        "TRANSLATION_18": "((They were) the seed of those whom We carried (in the ship) along with Noah) i.e. in the loins of those who were carried in the ship with Noah. (Lo! He) i.e. Noah (was a grateful slave) he was thankful whenever he ate, drank or put on his clothes; he always said: thanks to Allah.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "17:3",
            "37:81",
            "37:132",
            "37:111",
            "37:122",
            "53:10",
            "26:52",
            "37:77",
            "38:30",
            "71:27"
        ],
        "BIBLE": [
            "prophets:ii%20samuel:15:29",
            "writings:psalms:106:46",
            "prophets:isaiah:53:4",
            "prophets:isaiah:46:3",
            "writings:ii%20chronicles:36:20",
            "writings:job:10:19",
            "prophets:isaiah:46:1",
            "writings:ii%20chronicles:34:16",
            "prophets:ii%20kings:17:33",
            "writings:i%20chronicles:5:6"
        ]
    }
}