{
    "VERSE": "17:33",
    "ARABIC": "وَلَا تَقْتُلُوا۟ ٱلنَّفْسَ ٱلَّتِى حَرَّمَ ٱللَّهُ إِلَّا بِٱلْحَقِّ وَمَن قُتِلَ مَظْلُومًا فَقَدْ جَعَلْنَا لِوَلِيِّهِۦ سُلْطَٰنًا فَلَا يُسْرِف فِّى ٱلْقَتْلِ إِنَّهُۥ كَانَ مَنصُورًا",
    "ENGLISH": {
        "TRANSLATION_0": "Do not kill any person Allah has made inviolate, except with the right to do so. If someone is wrongly killed We have given authority to his next of kin. But he should not be excessive in taking life. He will be helped.",
        "TRANSLATION_1": "And do not take a life, which God has forbidden, except in a just cause. We have given the right (of redress) to the heir of the person who is killed, but he should not exceed the limits (of justice) by slaying (the killer), for he will be judged (by the same law).\n",
        "TRANSLATION_2": "(ix) Do not kill any person whom Allah has forbidden to kill, except with right. We have granted the heir of him who has been wrongfully killed the authority to (claim retribution); so let him not exceed in slaying. He shall be helped.\n",
        "TRANSLATION_3": "Do not kill a respectable soul without a just cause. If anyone is wrongfully killed, we have given the heirs of that person the right (to demand satisfaction or to forgive). He must not exceed the law in having vengeance; his victim shall also be assisted (by law).\n",
        "TRANSLATION_4": "And do not wrongfully kill any living being which Allah has forbidden; and for whoever is slain wrongfully, We have given the authority to his heir, so he should not cross limits in slaying; he will surely be helped.\n",
        "TRANSLATION_5": "And do not kill anyone whose killing Allah has forbidden, except for a just cause. And whoever is killed wrongfully (not by mistake), We have given his heir the authority. But let him not exceed limits in the matter of taking life. Verily, he is helped.\n",
        "TRANSLATION_6": "And do not kill any one whom Allah has forbidden, except for a just cause, and whoever is slain unjustly, We have indeed given to his heir authority, so let him not exceed the just limits in slaying; surely he is aided.\n",
        "TRANSLATION_7": "And slay not the soul God has forbidden, except by right. Whosoever is slain unjustly, We have appointed to his next-of-kin authority; but let him not exceed in slaying; he shall be helped.\n",
        "TRANSLATION_8": "And slay not the life which Allah hath forbidden save with right. Whoso is slain wrongfully, We have given power unto his heir, but let him not commit excess in slaying. Lo! he will be helped.\n",
        "TRANSLATION_9": "Do not take life which God has made inviolate -- except by right. If anyone is killed wrongfully, We have given authority to his heirs to demand retribution, but let them not transgress the prescribed limits in exacting retribution; for then he will be assisted [by the law].\n",
        "TRANSLATION_10": "And slay not anyone whom Allah hath forbidden except for justification; and whosoever is slain wrongfully, We have surely given his next-of-kin authority so let him not be extravagant in slaying; verily he is ever succoured.\n",
        "TRANSLATION_11": "Do not kill a soul [whose life] Allah has made inviolable, except with due cause, and whoever is killed wrongfully, We have certainly given his heir an authority. But let him not commit any excess in killing [the murderer], for he has been assisted [by law].\n",
        "TRANSLATION_12": "Nor take life - which Allah has made sacred - except for just cause. And if anyone is slain wrongfully, we have given his heir authority (to demand qisas or to forgive): but let him not exceed bounds in the matter of taking life; for he is helped (by the Law).\n",
        "TRANSLATION_13": "And do not kill anyone which Allah has forbidden, except for a just cause. And whoever is killed (intentionally with hostility and oppression and not by mistake), We have given his heir the authority [(to demand Qisas, Law of Equality in punishment or to forgive, or to take Diya (blood money)]. But let him not exceed limits in the matter of taking life (i.e. he should not kill except the killer only). Verily, he is helped (by the Islamic law).\n",
        "TRANSLATION_14": "Do not kill the soul whom Allah has forbidden except by right. If he is slain unjustly, We have given his heir authority. But let him not exceed the limit in slaying, for he will be helped.\n",
        "TRANSLATION_15": "And do not kill the soul which God has made sacred, except in the course of justice. If someone is killed unjustly, We have given his next of kin certain authority. But he should not be excessive in killing, for he will be supported.\n",
        "TRANSLATION_16": "And do not kill the soul which Allah has forbidden, except by right. And whoever is killed unjustly - We have given his heir authority, but let him not exceed limits in [the matter of] taking life. Indeed, he has been supported [by the law].\n",
        "TRANSLATION_17": "[17:33] And do not slay the soul [whose life] God has made inviolable, except with due cause. Whoever is slain wrongfully, We have certainly given his heir, the one inheriting from him, a warrant, a sanction [to retaliate] against the slayer; but let him not commit excess, [let him not] overstep the bounds, in slaying, by slaying other than the killer [of the one slain], or by other than that [instrument] with which he [the slain] was killed; for he is supported [by the Law].\n",
        "TRANSLATION_18": "(And slay not the life) of a believing person (which Allah hath forbidden) to slay (save with right) through stoning, application of the law of retaliation or because of apostasy. (Whoso is slain wrongfully) and intentionally, (We have given power) a cause and pretext against the killer, if he wishes he can kill him and if he wishes he can spare him, and if he wishes he can take blood money instead (unto his heir) the heir of the victim, (but let him not commit excess in slaying) if he kills the killer of the victim. Thus, he should not kill other than the killer himself; it is also said that this means, according to another reading: do not kill ten people to avenge the killing of one person. (Lo! he will be helped) for in that case, he will be killed and cannot be spared.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "17:33",
            "25:68",
            "14:22",
            "10:30",
            "9:51",
            "47:11",
            "59:19",
            "6:81",
            "6:151",
            "44:19"
        ],
        "BIBLE": [
            "prophets:ezekiel:18:13",
            "prophets:ezekiel:18:8",
            "prophets:judges:15:6",
            "torah:deuteronomy:26:13",
            "writings:proverbs:8:29",
            "prophets:ii%20kings:10:15",
            "torah:leviticus:17:11",
            "torah:genesis:31:9",
            "torah:leviticus:7:34",
            "torah:exodus:21:29"
        ]
    }
}