{
    "VERSE": "17:34",
    "ARABIC": "وَلَا تَقْرَبُوا۟ مَالَ ٱلْيَتِيمِ إِلَّا بِٱلَّتِى هِىَ أَحْسَنُ حَتَّىٰ يَبْلُغَ أَشُدَّهُۥ وَأَوْفُوا۟ بِٱلْعَهْدِ إِنَّ ٱلْعَهْدَ كَانَ مَسْـُٔولًا",
    "ENGLISH": {
        "TRANSLATION_0": "Do not go near the property of orphans before they reach maturity, except in a good way. Fulfil your contracts. Contracts will be asked about.",
        "TRANSLATION_1": "And do not touch the property of the orphans except for bettering it, until they come of age; and fulfil the promise made: You will surely be questioned about the promise.\n",
        "TRANSLATION_2": "(x) And do not even go near the property of the orphan - except that it be in the best manner - till he attains his maturity. (xi) And fulfil the covenant, for you will be called to account regarding the covenant.\n",
        "TRANSLATION_3": "Do not get close to the property of the orphans (unless it is for a good reason) until they are mature and strong. Keep your promise; you will be questioned about it.\n",
        "TRANSLATION_4": "And do not approach the wealth of the orphan except in the best possible way, till he reaches adulthood; and fulfil the promise; indeed the promise will be asked about.\n",
        "TRANSLATION_5": "And come not near to the orphan's property except to improve it, until he attains the age of full strength. And fulfill (every) covenant. Verily, the covenant will be questioned about.\n",
        "TRANSLATION_6": "And draw not near to the property of the orphan except in a goodly way till he attains his maturity and fulfill the promise; surely (every) promise shall be questioned about.\n",
        "TRANSLATION_7": "And do not approach the property of the orphan save in the fairest manner, until he is of age. And fulfil the covenant; surely the covenant shall be questioned of.\n",
        "TRANSLATION_8": "Come not near the wealth of the orphan save with that which is better till he come to strength; and keep the covenant. Lo! of the covenant it will be asked.\n",
        "TRANSLATION_9": "Do not go near the orphans' property, except with the best of intentions, until they reach maturity. Keep your promises; you will be called to account for every promise which you have made!\n",
        "TRANSLATION_10": "And approach not the substance of an'orphan save with that which is best, until he attaineth his age of strength. And fulfil the covenant; verily the covenant shall be asked about.\n",
        "TRANSLATION_11": "Do not approach the orphan’s property except in the best manner, until he comes of age. Fulfill the covenants; indeed all covenants are accountable.\n",
        "TRANSLATION_12": "Come not nigh to the orphan's property except to improve it, until he attains the age of full strength; and fulfil (every) engagement, for (every) engagement will be enquired into (on the Day of Reckoning).\n",
        "TRANSLATION_13": "And come not near to the orphan's property except to improve it, until he attains the age of full strength. And fulfil (every) covenant. Verily! the covenant, will be questioned about.\n",
        "TRANSLATION_14": "Do not draw near the wealth of the orphan except in the best manner, until he reaches maturity. And keep your promise. Surely, the promise will be questioned.\n",
        "TRANSLATION_15": "And do not go near the orphan’s property, except with the best of intentions, until he has reached his maturity. And honor your pledge, because the pledge involves responsibility.\n",
        "TRANSLATION_16": "And do not approach the property of an orphan, except in the way that is best, until he reaches maturity. And fulfill [every] commitment. Indeed, the commitment is ever [that about which one will be] questioned.\n",
        "TRANSLATION_17": "[17:34] And do not come [anywhere] near an orphan’s property, except in the fairest manner until he comes of age. And fulfil the covenant, should you make a covenant with God or with people [in general]. Indeed the covenant will be enquired into.\n",
        "TRANSLATION_18": "(Come not near the wealth of the orphan save with that which is better) through generating profit from it 302 and by means of preserving it (till he come to strength) 15 or 18 years old; (and keep the covenant) that you pledged in the name of Allah between you and people. (Lo! of the covenant) the one who breaks the covenant (it will be asked) why he broke it on the Day of Judgement.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "17:34",
            "6:152",
            "4:2",
            "29:46",
            "104:2",
            "9:4",
            "4:10",
            "41:34",
            "7:180",
            "4:6"
        ],
        "BIBLE": [
            "torah:genesis:38:29",
            "writings:esther:4:11",
            "prophets:jeremiah:14:9",
            "torah:genesis:19:22",
            "prophets:i%20samuel:29:6",
            "prophets:judges:19:9",
            "prophets:i%20kings:2:42",
            "torah:deuteronomy:20:2",
            "torah:numbers:3:38",
            "prophets:ii%20samuel:15:2"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:6:1"
        ]
    }
}