{
    "VERSE": "17:35",
    "ARABIC": "وَأَوْفُوا۟ ٱلْكَيْلَ إِذَا كِلْتُمْ وَزِنُوا۟ بِٱلْقِسْطَاسِ ٱلْمُسْتَقِيمِ ذَٰلِكَ خَيْرٌ وَأَحْسَنُ تَأْوِيلًا",
    "ENGLISH": {
        "TRANSLATION_0": "Give full measure when you measure and weigh with a level balance. That is better and gives the best result.",
        "TRANSLATION_1": "Give full measure when you are measuring, and weigh on a balanced scale. This is better, and excellent its consequence.\n",
        "TRANSLATION_2": "(xii) Give full measure when you measure, and weigh with even scales. That is fair and better in consequence.\n",
        "TRANSLATION_3": "While weighing, use proper measurements in the exchange of your property. This is fair and will be better in the end.\n",
        "TRANSLATION_4": "And correctly measure when you measure, and weigh correctly with the scales; this is better, and has a better outcome.\n",
        "TRANSLATION_5": "And give full measure when you measure, and weigh with a balance that is straight. That is good (advantageous) and better in the end.\n",
        "TRANSLATION_6": "And give full measure when you measure out, and weigh with a true balance; this is fair and better in the end.\n",
        "TRANSLATION_7": "And fill up the measure when you measure, and weigh with the straight balance; that is better and fairer in the issue.\n",
        "TRANSLATION_8": "Fill the measure when ye measure, and weigh with a right balance; that is meet, and better in the end.\n",
        "TRANSLATION_9": "Give full measure, when you measure, and weigh with accurate scales. That is fair, and better in the end.\n",
        "TRANSLATION_10": "And give full measures when ye measure and weigh with an even balance that is good, and the best interpretation.\n",
        "TRANSLATION_11": "When you measure, observe fully the measure, [and] weigh with an even balance. That is better and more favourable with respect to the outcome [in the Hereafter].\n",
        "TRANSLATION_12": "Give full measure when ye measure, and weigh with a balance that is straight: that is the most fitting and the most advantageous in the final determination.\n",
        "TRANSLATION_13": "And give full measure when you measure, and weigh with a balance that is straight. That is good (advantageous) and better in the end.\n",
        "TRANSLATION_14": "Give full measure when you measure, and weigh with even scales. That is better, and fairer in the end.\n",
        "TRANSLATION_15": "And give full measure when you measure, and weigh with accurate scales. That is fair, and the best determination.\n",
        "TRANSLATION_16": "And give full measure when you measure, and weigh with an even balance. That is the best [way] and best in result.\n",
        "TRANSLATION_17": "[17:35] And give full measure, complete it, when you measure, and weigh with a right balance, [with] an even balance: that is better and fairer in return.\n",
        "TRANSLATION_18": "(Fill the measure) perfect measurement (when ye measure) to others, (and weigh with a right balance) with a fair balance; (that) perfecting measurement and weighing and fulfilling one's pledge (is meet) is better than breaking covenants and cheating in measure, (and better in the end) in the end result.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "17:35",
            "26:182",
            "27:89",
            "26:181",
            "92:9",
            "92:6",
            "24:12",
            "25:24",
            "70:21",
            "55:70"
        ],
        "BIBLE": [
            "prophets:isaiah:40:12",
            "prophets:joshua:1:8",
            "prophets:jeremiah:12:1",
            "writings:proverbs:20:23",
            "prophets:ezekiel:7:9",
            "writings:psalms:139:24",
            "writings:ezra:8:21",
            "writings:proverbs:16:11",
            "prophets:ezekiel:7:4",
            "prophets:joshua:1:7"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:3:1",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:1:7"
        ]
    }
}