{
    "VERSE": "17:4",
    "ARABIC": "وَقَضَيْنَآ إِلَىٰ بَنِىٓ إِسْرَٰٓءِيلَ فِى ٱلْكِتَٰبِ لَتُفْسِدُنَّ فِى ٱلْأَرْضِ مَرَّتَيْنِ وَلَتَعْلُنَّ عُلُوًّا كَبِيرًا",
    "ENGLISH": {
        "TRANSLATION_0": "We decreed in the Book for the tribe of Israel: 'You will twice cause corruption on the earth and you will rise to a great height.",
        "TRANSLATION_1": "We announced to the children of Israel in the Book: \"You will surely create disorder twice in the land, and become exceedingly arrogant.\"\n",
        "TRANSLATION_2": "Then We clearly declared to the Children of Israel in the Book: \"Twice you will make mischief in the land and will commit transgression.\"\n",
        "TRANSLATION_3": "We made it known to the Israelites through the Torah that they would twice commit evil in the land with great transgression and rebellion.\n",
        "TRANSLATION_4": "And We decreed for the Descendants of Israel in the Book that, “You will indeed create great turmoil in the earth twice, and you will surely become very proud.”\n",
        "TRANSLATION_5": "And We decreed for the Children of Israel in the Scripture: \"Indeed you would do mischief in the land twice and you will become tyrants and extremely arrogant!\"\n",
        "TRANSLATION_6": "And We had made known to the children of Israel in the Book: Most certainly you will make mischief in the land twice, and most certainly you will behave insolently with great insolence.\n",
        "TRANSLATION_7": "And We decreed for the Children of Israel in the Book: 'You shall do corruption in the earth twice, and you shall ascend exceeding high.'\n",
        "TRANSLATION_8": "And We decreed for the Children of Israel in the Scripture: Ye verily will work corruption in the earth twice, and ye will become great tyrants.\n",
        "TRANSLATION_9": "We forewarned the Children of Israel in the Scripture, \"Twice you shall commit evil in the land. You shall become great transgressors.\"\n",
        "TRANSLATION_10": "And We decreed unto the Children of Isra'il in the Book; ye will surely cause corruption in the land twice, l and ye will surely rise to a great height.\n",
        "TRANSLATION_11": "We revealed to the Children of Israel in the Book: ‘Twice you will cause corruption on the earth, and you will perpetrate great tyranny.’\n",
        "TRANSLATION_12": "And We gave (Clear) Warning to the Children of Israel in the Book, that twice would they do mischief on the earth and be elated with mighty arrogance (and twice would they be punished)!\n",
        "TRANSLATION_13": "And We decreed for the Children of Israel in the Scripture, that indeed you would do mischief on the earth twice and you will become tyrants and extremely arrogant!\n",
        "TRANSLATION_14": "And We decreed for the Children of Israel in the Book: 'You shall corrupt the land twice, and you shall ascend exceedingly high'\n",
        "TRANSLATION_15": "And We conveyed to the Children of Israel in the Scripture: You will commit evil on earth twice, and you will rise to a great height.\n",
        "TRANSLATION_16": "And We conveyed to the Children of Israel in the Scripture that, \"You will surely cause corruption on the earth twice, and you will surely reach [a degree of] great haughtiness.\n",
        "TRANSLATION_17": "[17:4] And We decreed, We revealed, to the Children of Israel in the Scripture, the Torah: ‘You shall indeed work corruption in the land, the land of Syria, through acts of disobedience, twice and you shall indeed become great tyrants’, you shall perpetrate grave injustice.\n",
        "TRANSLATION_18": "24 Pickthall erroneously calls this surah \"The Children of Israel\" (Banu Isra'il). 298 (And We decreed) in the Torah (for the Children of Israel in the Scripture: Ye verily will work corruption) you will indeed commit acts of disobedience (in the earth twice, and ye will become great tyrants) it is also said that this means: you will be mightily overpowered.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "17:4",
            "45:16",
            "40:53",
            "32:23",
            "50:4",
            "83:18",
            "43:4",
            "21:71",
            "27:75",
            "20:4"
        ],
        "BIBLE": [
            "torah:exodus:34:10",
            "torah:deuteronomy:4:25",
            "torah:numbers:20:24",
            "torah:numbers:8:19",
            "prophets:ii%20samuel:22:36",
            "prophets:hosea:2:14",
            "prophets:ezekiel:33:28",
            "writings:daniel:2:9",
            "torah:numbers:20:12",
            "torah:leviticus:16:34"
        ]
    }
}