{
    "VERSE": "17:40",
    "ARABIC": "أَفَأَصْفَىٰكُمْ رَبُّكُم بِٱلْبَنِينَ وَٱتَّخَذَ مِنَ ٱلْمَلَٰٓئِكَةِ إِنَٰثًا إِنَّكُمْ لَتَقُولُونَ قَوْلًا عَظِيمًا",
    "ENGLISH": {
        "TRANSLATION_0": "Has your Lord honoured you with sons and Himself taken the angels as daughters? It is truly something terrible that you say!",
        "TRANSLATION_1": "Has God chosen to give you sons, and taken for Himself daughters from among the angels? You utter grievous things indeed!\n",
        "TRANSLATION_2": "What, has your Lord favoured you with sons and has taken for Himself daughters from among the angels? You are indeed uttering a monstrous lie.\n",
        "TRANSLATION_3": "(Pagans) has your Lord given you preference over Himself by granting you sons and taking the angels as His own daughters? What you say is a monstrous utterance.\n",
        "TRANSLATION_4": "Has your Lord chosen sons for you, and created daughters for Himself from among the angels? Indeed you utter a profound word!\n",
        "TRANSLATION_5": "Has then your Lord preferred for you sons, and taken for Himself from among the angels daughters Verily, you indeed utter an awful saying.\n",
        "TRANSLATION_6": "What! has then your Lord preferred to give you sons, and (for Himself) taken daughters from among the angels? Most surely you utter a grievous saying.\n",
        "TRANSLATION_7": "What, has your Lord favoured you with sons and taken to Himself from the angels females? Surely it is a monstrous thing you are saying!\n",
        "TRANSLATION_8": "Hath your Lord then distinguished you (O men of Makka) by giving you sons, and hath chosen for Himself females from among the angels? Lo! verily ye speak an awful word!\n",
        "TRANSLATION_9": "What! Has your Lord then favoured you with sons and Himself adopted females from among the angels? What you say is monstrous.\n",
        "TRANSLATION_10": "Hath then your Lord distinguished you with sons and taken for Himself females from among the angels? Verily ye say a saying mighty?\n",
        "TRANSLATION_11": "Did your Lord prefer you for sons, and [Himself] adopt females from among the angels? Indeed, you say a monstrous word!\n",
        "TRANSLATION_12": "Has then your Lord (O Pagans!) preferred for you sons, and taken for Himself daughters among the angels? Truly ye utter a most dreadful saying!\n",
        "TRANSLATION_13": "Has then your Lord (O pagans of Makkah) preferred for you sons, and taken for Himself from among the angels daughters. Verily! You utter an awful saying, indeed.\n",
        "TRANSLATION_14": "What! Has your Lord favored you with sons and taken to Himself females from among the angels? Indeed, you utter a monstrous thing!\n",
        "TRANSLATION_15": "Has your Lord favored you with sons, while choosing for Himself daughters from among the angels? You are indeed saying a terrible thing.\n",
        "TRANSLATION_16": "Then, has your Lord chosen you for [having] sons and taken from among the angels daughters? Indeed, you say a grave saying.\n",
        "TRANSLATION_17": "[17:40] Has your Lord then preferred you, has He distinguished you [exclusively], O Meccans, with sons and chosen for Himself females from among the angels?, as daughters for Himself, in the way that you [are wont to] claim. Truly, by [saying] this, you are speaking a monstrous word!\n",
        "TRANSLATION_18": "(Hath your Lord then distinguished you) chosen you ((0 men of Mecca) by giving you sons, and hath chosen for Himself females from among the angels) as daughters? (Lo! verily you speak) about Allah (an awful word!) which deserves a severe punishment; it is also said that this means: you speak an awful word as a lie about Allah.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "17:40",
            "89:22",
            "53:27",
            "31:13",
            "37:150",
            "3:80",
            "3:124",
            "37:76",
            "38:71",
            "8:9"
        ],
        "BIBLE": [
            "torah:genesis:31:9",
            "prophets:judges:3:6",
            "torah:numbers:18:19",
            "torah:leviticus:7:34",
            "prophets:i%20kings:13:5",
            "prophets:ezekiel:18:8",
            "torah:deuteronomy:16:17",
            "prophets:jeremiah:44:20",
            "prophets:ezekiel:18:13",
            "prophets:judges:15:6"
        ]
    }
}