{
    "VERSE": "17:42",
    "ARABIC": "قُل لَّوْ كَانَ مَعَهُۥٓ ءَالِهَةٌ كَمَا يَقُولُونَ إِذًا لَّٱبْتَغَوْا۟ إِلَىٰ ذِى ٱلْعَرْشِ سَبِيلًا",
    "ENGLISH": {
        "TRANSLATION_0": "Say: 'If there had, as you say, been other gods together with Him, they would have sought a way to the",
        "TRANSLATION_1": "Say: \"Had there been other gods with Him, as they assert, they would surely have sought a way (of opposition) against the Lord of the Throne.\"\n",
        "TRANSLATION_2": "Say, (O Muhammad): \"Had there been other gods with Him, as they claim, they would surely have attempted to find a way to the Lord of the Throne.\n",
        "TRANSLATION_3": "(Muhammad), ask them, \"Had there been many other gods besides Him, as they say, they should have found a way to the Lord of the Throne\n",
        "TRANSLATION_4": "Proclaim (O dear Prophet Mohammed – peace and blessings be upon him), “If there were other Gods besides Him” – as they utter – “then they would have certainly found a way towards* the Owner of the Throne!”. (* To fight against Him.)\n",
        "TRANSLATION_5": "Say: \"If there had been other gods along with Him as they assert, then they would certainly have sought out a way to the Lord of the Throne.\n",
        "TRANSLATION_6": "Say: If there were with Him gods as they say, then certainly they would have been able to seek a way to the Lord of power.\n",
        "TRANSLATION_7": "Say: 'If there had been other gods with Him, as they say, in that case assuredly they would have sought a way unto the Lord of the Throne.' Glory be to Him!\n",
        "TRANSLATION_8": "Say (O Muhammad, to the disbelievers): If there were other gods along with Him, as they say, then had they sought a way against the Lord of the Throne.\n",
        "TRANSLATION_9": "Say, \"If there were [other] deities along with Him, as they claim, then they would surely have tried to find a way to the Lord of the Throne.\n",
        "TRANSLATION_10": "Say thou: were there along with Him other gods, as they say, then they would have brought unto the Owner of the Throne a way.\n",
        "TRANSLATION_11": "Say, ‘Were there [other] gods besides Him, as they say, they would surely have encroached on the Lord of the Throne.\n",
        "TRANSLATION_12": "Say: If there had been (other) gods with Him, as they say,- behold, they would certainly have sought out a way to the Lord of the Throne!\n",
        "TRANSLATION_13": "Say (O Muhammad SAW to these polytheists, pagans, etc.): \"If there had been other aliha (gods) along with Him as they assert, then they would certainly have sought out a way to the Lord of the Throne (seeking His Pleasures and to be near to Him).\n",
        "TRANSLATION_14": "Say: 'If there had been other gods with Him, as they say, they would surely have sought a way to the Lord of the Throne'\n",
        "TRANSLATION_15": "Say, “If there were other gods with Him, as they say, they would have sought a way to the Lord of the Throne.”\n",
        "TRANSLATION_16": "Say, [O Muhammad], \"If there had been with Him [other] gods, as they say, then they [each] would have sought to the Owner of the Throne a way.\"\n",
        "TRANSLATION_17": "[17:42] Say, to them: ‘If there were with Him, that is, with God, [other] gods, as they say, they would, in that case, have sought against the Lord of the Throne, that is, [against] God, some path, some way, in order to fight Him [off].\n",
        "TRANSLATION_18": "(Say (0 Muhammad, to the disbelievers): If there were other gods along with Him, as they say, then had they sought a way against the Lord of the Throne) they would have sought status and prestige with Allah; it is also said that this means: they would have sought to rise up to Him.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "17:42",
            "21:22",
            "29:69",
            "16:88",
            "9:129",
            "23:91",
            "21:59",
            "5:35",
            "25:42",
            "47:1"
        ],
        "BIBLE": [
            "prophets:i%20kings:13:26",
            "prophets:jeremiah:14:13",
            "writings:ii%20chronicles:20:6",
            "prophets:zechariah:1:4",
            "writings:ezra:8:21",
            "torah:genesis:24:42",
            "prophets:joshua:7:7",
            "prophets:ezekiel:18:23",
            "prophets:judges:18:6",
            "prophets:i%20kings:17:20"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:6:3"
        ]
    }
}