{
    "VERSE": "17:43",
    "ARABIC": "سُبْحَٰنَهُۥ وَتَعَٰلَىٰ عَمَّا يَقُولُونَ عُلُوًّا كَبِيرًا",
    "ENGLISH": {
        "TRANSLATION_0": "Glory be to Him! He is exalted above what they say in Greatness and Sublimity!",
        "TRANSLATION_1": "Too glorious and high is He, too exalted for what they say!\n",
        "TRANSLATION_2": "Holy is He and far above all that they say.\n",
        "TRANSLATION_3": "(to challenge Him). God is too Glorious and Exalted to be considered as they believe Him to be. He is the most High and Great.\n",
        "TRANSLATION_4": "Purity and Supremacy are to Him from what they utter, a Great Supremacy!\n",
        "TRANSLATION_5": "Glorified and Exalted is He high above what they say!\n",
        "TRANSLATION_6": "Glory be to Him and exalted be He in high exaltation above what they say.\n",
        "TRANSLATION_7": "High indeed be He exalted above that they say!\n",
        "TRANSLATION_8": "Glorified is He, and High Exalted above what they say!\n",
        "TRANSLATION_9": "Glory be to Him! Exalted above all that they say!\n",
        "TRANSLATION_10": "Hallowed be He, and exalted be He above that which they say --a greatheight!\n",
        "TRANSLATION_11": "Immaculate is He, and greatly exalted above what they say!’\n",
        "TRANSLATION_12": "Glory to Him! He is high above all that they say!- Exalted and Great (beyond measure)!\n",
        "TRANSLATION_13": "Glorified and High be He! From 'Uluwan Kabira (the great falsehood) that they say! (i.e. forged statements that there are other gods along with Allah, but He is Allah, the One, the Self-Sufficient Master, whom all creatures need. He begets not, nor was He begotten, and there is none comparable or coequal unto Him).\n",
        "TRANSLATION_14": "Exaltations be to Him! High indeed be He exalted above what they say!\n",
        "TRANSLATION_15": "Be He glorified. He is exalted, far above what they say.\n",
        "TRANSLATION_16": "Exalted is He and high above what they say by great sublimity.\n",
        "TRANSLATION_17": "[17:43] Glory be to Him — an affirmation of His transcendence — and exalted be He above what they say, in the way of [His having] associates, greatly!\n",
        "TRANSLATION_18": "303 (Glorified is He) He exonerated Himself from having a son or partner, (and High Exalted) He is free of and too lofty (above what they say!) of idolatry.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "17:43",
            "22:62",
            "31:30",
            "37:159",
            "4:31",
            "16:1",
            "37:180",
            "23:91",
            "83:19",
            "16:57"
        ],
        "BIBLE": [
            "writings:psalms:73:11",
            "prophets:ezekiel:21:5",
            "writings:psalms:97:9",
            "writings:nehemiah:9:5",
            "writings:job:2:3",
            "writings:job:1:8",
            "prophets:ii%20kings:5:22",
            "torah:genesis:14:19",
            "prophets:isaiah:30:18",
            "writings:psalms:87:5"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:1:3"
        ]
    }
}