{
    "VERSE": "17:44",
    "ARABIC": "تُسَبِّحُ لَهُ ٱلسَّمَٰوَٰتُ ٱلسَّبْعُ وَٱلْأَرْضُ وَمَن فِيهِنَّ وَإِن مِّن شَىْءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِۦ وَلَٰكِن لَّا تَفْقَهُونَ تَسْبِيحَهُمْ إِنَّهُۥ كَانَ حَلِيمًا غَفُورًا",
    "ENGLISH": {
        "TRANSLATION_0": "The seven heavens and the earth and everyone in them glorify Him. There is nothing which does not glorify Him with praise but you do not understand their glorification. He is All-Forbearing, Ever-Forgiving.",
        "TRANSLATION_1": "The seven skies, the earth, and all that lies within them, sing hallelujas to Him. There is nothing that does not chant His praises, but you do not understand their hymns of praise. He is verily clement and forgiving.\n",
        "TRANSLATION_2": "The seven heavens, the earth, and all that is within them give glory to Him. There is nothing but gives glory to Him with His praise, though you do not understand their hymns of praise. He is Most Forbearing, Exceedingly Forgiving.\"\n",
        "TRANSLATION_3": "The seven heavens, the earth, and whatever is between them all glorify Him. There is nothing that does not glorify Him and always praise him, but you do not understand their praise and glorification. He is All-forbearing and All-forgiving.\n",
        "TRANSLATION_4": "The seven heavens and the earth and all those in them say His Purity; and there is not a thing that does not proclaim His purity with praise, but you do not understand their proclamation of purity; indeed He is Most Forbearing, Oft Forgiving.\n",
        "TRANSLATION_5": "The seven heavens and the earth and all that is therein, glorify Him and there is not a thing but glorifies His praise. But you understand not their glorification. Truly, He is Ever Forbearing, Oft-Forgiving.\n",
        "TRANSLATION_6": "The seven heavens declare His glory and the earth (too), and those who are in them; and there is not a single thing but glorifies Him with His praise, but you do not understand their glorification; surely He is Forbearing, Forgiving.\n",
        "TRANSLATION_7": "The seven heavens and the earth, and whosoever in them is, extol Him; nothing is, that does not proclaim His praise, but you do not understand their extolling. Surely He is All-clement, All-forgiving.\n",
        "TRANSLATION_8": "The seven heavens and the earth and all that is therein praise Him, and there is not a thing but hymneth His praise; but ye understand not their praise. Lo! He is ever Clement, Forgiving.\n",
        "TRANSLATION_9": "The seven heavens and the earth and all who dwell therein glorify Him. There is not a single thing but glorifies Him with His praise; but you do not understand their glorification. Truly, He is forbearing and most forgiving.\"\n",
        "TRANSLATION_10": "There hallow Him the seven heavens and the earth and whosoever is therein. And naught there is but halloweth His praise, but ye understand not their hallowing; verily He is ever Forbearing, Forgiving.\n",
        "TRANSLATION_11": "The seven heavens glorify Him, and the earth [too], and whoever is in them. There is not a thing but celebrates His praise, but you do not understand their glorification. Indeed, He is all-forbearing, all-forgiving.\n",
        "TRANSLATION_12": "The seven heavens and the earth, and all beings therein, declare His glory: there is not a thing but celebrates His praise; And yet ye understand not how they declare His glory! Verily He is Oft-Forbear, Most Forgiving!\n",
        "TRANSLATION_13": "The seven heavens and the earth and all that is therein, glorify Him and there is not a thing but glorifies His Praise. But you understand not their glorification. Truly, He is Ever Forbearing, Oft-Forgiving.\n",
        "TRANSLATION_14": "The seven heavens, the earth, and whosoever in them, exalt Him. There is nothing that does not exalt with His praise, but you do not understand their exaltation. Surely, He is Clement, Forgiving.\n",
        "TRANSLATION_15": "Praising Him are the seven heavens, and the earth, and everyone in them. There is not a thing that does not glorify Him with praise, but you do not understand their praises. He is indeed Forbearing and Forgiving.\n",
        "TRANSLATION_16": "The seven heavens and the earth and whatever is in them exalt Him. And there is not a thing except that it exalts [Allah] by His praise, but you do not understand their [way of] exalting. Indeed, He is ever Forbearing and Forgiving.\n",
        "TRANSLATION_17": "[17:44] The seven heavens and the earth and all that is therein proclaim His praise, [they] affirm His transcendence. And there is not a thing, among things created, but proclaims, enwrapped [in], His praise, in other words, [everything] says subhāna’Llāh wa-bi-hamdihi, ‘Glory and praise be to God’; but you do not understand their glorification, because it is not [proclaimed] in your language. Lo! He is Forbearing, Forgiving, for He does not hasten [to bring about] your punishment.\n",
        "TRANSLATION_18": "(The seven heavens and the earth and all that is therein) of created beings (praise Him, and there is not a thing) among plants (but hymneth his praise) His command; (but ye understand not their praise) you do not understand the language in which it is said. (Lo! He is ever Clement) with His servants since He does not hasten punishment on them, (Forgiving) of those who repent.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "17:44",
            "35:41",
            "42:5",
            "34:2",
            "25:6",
            "3:5",
            "42:12",
            "30:18",
            "14:38",
            "2:29"
        ],
        "BIBLE": [
            "prophets:jeremiah:25:5",
            "torah:genesis:1:30",
            "prophets:isaiah:49:20",
            "prophets:jeremiah:35:15",
            "torah:numbers:18:19",
            "torah:deuteronomy:26:13",
            "writings:psalms:115:16",
            "torah:genesis:9:3",
            "torah:leviticus:19:24",
            "prophets:i%20samuel:8:6"
        ]
    }
}