{
    "VERSE": "17:48",
    "ARABIC": "ٱنظُرْ كَيْفَ ضَرَبُوا۟ لَكَ ٱلْأَمْثَالَ فَضَلُّوا۟ فَلَا يَسْتَطِيعُونَ سَبِيلًا",
    "ENGLISH": {
        "TRANSLATION_0": "Look how they make likenesses of you and go astray. They are unable to find their way.",
        "TRANSLATION_1": "See, what comparisons they coin for you, and go astray, and thus cannot find the way.\n",
        "TRANSLATION_2": "Just see how strange are the things they invent about you. They have altogether strayed, and are unable to find the right way.\n",
        "TRANSLATION_3": "Consider what they have called you. They have certainly gone astray and cannot find the right path.\n",
        "TRANSLATION_4": "See the kind of examples they invent for you! They therefore strayed, so cannot find a path.\n",
        "TRANSLATION_5": "See what examples they have put forward for you. So they have gone astray, and never can they find a way.\n",
        "TRANSLATION_6": "See what they liken you to! So they have gone astray and cannot find the way.\n",
        "TRANSLATION_7": "Behold, how they strike similitudes for thee, and go astray, and cannot find a way!\n",
        "TRANSLATION_8": "See what similitudes they coin for thee, and thus are all astray, and cannot find a road!\n",
        "TRANSLATION_9": "See to what they liken you! But they are lost and cannot find the right path.\n",
        "TRANSLATION_10": "Behold! how they propound similitudes for thee! They have strayed and cannot find a way.\n",
        "TRANSLATION_11": "Look, how they coin epithets for you; so they go astray, and cannot find a way.\n",
        "TRANSLATION_12": "See what similes they strike for thee: but they have gone astray, and never can they find a way.\n",
        "TRANSLATION_13": "See what examples they have put forward for you. So they have gone astray, and never can they find a way.\n",
        "TRANSLATION_14": "See what they compared you to. They have surely gone astray and cannot find a Path.\n",
        "TRANSLATION_15": "Note what they compared you to. They are lost, and unable to find a way.\n",
        "TRANSLATION_16": "Look how they strike for you comparisons; but they have strayed, so they cannot [find] a way.\n",
        "TRANSLATION_17": "[17:48] God, exalted be He, says: Look how they strike similitudes for you, such as [your being] bewitched, a soothsayer or a poet, and they go astray, thereby from [the path of] guidance, and cannot find a way, a path to it!\n",
        "TRANSLATION_18": "(See) Muhammad (what similitudes they coin for thee) how they liken you to a bewitched person, (and thus are all astray) and thus are wrong in what they say, (and cannot find a road!) out of what they said; and it is also said that this means: they cannot find a proof from what they say.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "25:9",
            "17:48",
            "88:17",
            "14:45",
            "43:25",
            "47:10",
            "88:19",
            "37:73",
            "16:74",
            "37:61"
        ],
        "BIBLE": [
            "prophets:joshua:23:14",
            "prophets:ii%20samuel:1:7",
            "prophets:i%20samuel:29:6",
            "prophets:ezekiel:8:10",
            "prophets:isaiah:30:10",
            "torah:genesis:44:28",
            "writings:psalms:50:1",
            "prophets:jeremiah:7:11",
            "prophets:i%20kings:13:12",
            "torah:genesis:16:13"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:13",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:4:2"
        ]
    }
}