{
    "VERSE": "17:49",
    "ARABIC": "وَقَالُوٓا۟ أَءِذَا كُنَّا عِظَٰمًا وَرُفَٰتًا أَءِنَّا لَمَبْعُوثُونَ خَلْقًا جَدِيدًا",
    "ENGLISH": {
        "TRANSLATION_0": "They say, 'What! When we are bones and crumbled dust, will we then be raised up as a new creation!'",
        "TRANSLATION_1": "Yet they say: \"When we are turned to bones and bits, shall we be raised as a new creation?\"\n",
        "TRANSLATION_2": "They say: \"When we are turned to bones and particles (of dust), shall we truly be raised up as a new creation?\"\n",
        "TRANSLATION_3": "The pagans say, \"When we become mere bones and dust, shall we then be brought back to life again?\"\n",
        "TRANSLATION_4": "And they say, “When we have become bones and decomposed, will we really be raised up anew?”\n",
        "TRANSLATION_5": "And they say: \"When we are bones and fragments (destroyed), should we really be resurrected (to be) a new creation\"\n",
        "TRANSLATION_6": "And they say: What! when we shall have become bones and decayed particles, shall we then certainly be raised up, being a new creation?\n",
        "TRANSLATION_7": "They say, 'What, when we are bones and broken bits, shall we really be raised up again in a new creation?'\n",
        "TRANSLATION_8": "And they say: When we are bones and fragments, shall we forsooth, be raised up as a new creation?\n",
        "TRANSLATION_9": "What!\" they say, \"When we are turned to bones and dust, shall we be restored to life?\"\n",
        "TRANSLATION_10": "And they say: when we shall have become bones and fragments, shall we in sooth be raised as a new creation?\n",
        "TRANSLATION_11": "They say, ‘What, when we have become bones and dust, shall we really be raised in a new creation?’\n",
        "TRANSLATION_12": "They say: \"What! when we are reduced to bones and dust, should we really be raised up (to be) a new creation?\"\n",
        "TRANSLATION_13": "And they say: \"When we are bones and fragments (destroyed), should we really be resurrected (to be) a new creation?\"\n",
        "TRANSLATION_14": "What' they say. 'When we are (turned to) bones and broken bits, shall we be raised again in a new creation'\n",
        "TRANSLATION_15": "And they say, “When we have become bones and fragments, shall we really be resurrected as a new creation?”\n",
        "TRANSLATION_16": "And they say, \"When we are bones and crumbled particles, will we [truly] be resurrected as a new creation?\"\n",
        "TRANSLATION_17": "[17:49] And they say, in denial of the Resurrection: ‘What, when we are bones and fragments, shall we really be raised up in a new creation?’\n",
        "TRANSLATION_18": "(And they say) i.e. al-Nadr Ibn al-Harth and his host: (When we are) rotten (bones and fragments) scattered dust, (shall we, forsooth, be raised up) shall we be revived (as a new creation) shall the spirit be renewed in us after death?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "17:49",
            "17:98",
            "56:47",
            "23:82",
            "37:53",
            "37:16",
            "32:10",
            "68:4",
            "34:7",
            "35:16"
        ],
        "BIBLE": [
            "prophets:i%20samuel:18:11",
            "prophets:jeremiah:2:27",
            "prophets:jeremiah:48:39",
            "prophets:isaiah:42:17",
            "prophets:i%20kings:20:39",
            "prophets:jeremiah:38:22",
            "prophets:jeremiah:29:15",
            "prophets:ezekiel:26:2",
            "torah:genesis:42:28",
            "prophets:joshua:7:26"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:2:2",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:4:8",
            "Sefer%20Yetzirah:1:6"
        ]
    }
}