{
    "VERSE": "17:53",
    "ARABIC": "وَقُل لِّعِبَادِى يَقُولُوا۟ ٱلَّتِى هِىَ أَحْسَنُ إِنَّ ٱلشَّيْطَٰنَ يَنزَغُ بَيْنَهُمْ إِنَّ ٱلشَّيْطَٰنَ كَانَ لِلْإِنسَٰنِ عَدُوًّا مُّبِينًا",
    "ENGLISH": {
        "TRANSLATION_0": "Say to My slaves that they should only say the best. Shaytan wants to stir up trouble between them. Shaytan is an outright enemy to man.",
        "TRANSLATION_1": "Tell My creatures only to speak words that are good. Verily Satan sows dissensions: Satan is indeed the acknowledged enemy of mankind.\n",
        "TRANSLATION_2": "Tell My servants, (O Muhammad), to say always that which is best. Verily it is Satan who sows discord among people. Satan indeed is an open enemy to mankind.\n",
        "TRANSLATION_3": "(Muhammad), tell My servants to say what is best. Satan sows dissension among them; he is the sworn enemy of human beings.\n",
        "TRANSLATION_4": "And tell My bondmen to speak that which is the best; undoubtedly Satan sows discord among them; indeed Satan is man’s open enemy.\n",
        "TRANSLATION_5": "And say to My servants that they should say those words that are best. (Because) Shaytan verily, sows a state of conflict and disagreement among them. Surely, Shaytan is to man a plain enemy.\n",
        "TRANSLATION_6": "And say to My servants (that) they speak that which is best; surely the Shaitan sows dissensions among them; surely the Shaitan is an open enemy to man.\n",
        "TRANSLATION_7": "And say to My servants, that they say words that are kindlier. For surely Satan provokes strife between them, and Satan is ever a manifest foe to man.\n",
        "TRANSLATION_8": "Tell My bondmen to speak that which is kindlier. Lo! the devil soweth discord among them. Lo! the devil is for man an open foe.\n",
        "TRANSLATION_9": "Tell My servants that they should always say what is best. Satan stirs up discord among them. Surely, Satan is an outright enemy to man.\n",
        "TRANSLATION_10": "Say thou unto My bondmen that they should say that which is best, Verily the Satan would stir up strife between them; verily the Satan is unto men ever an enemy manifest.\n",
        "TRANSLATION_11": "Tell My servants to speak in a manner which is the best. Indeed Satan incites ill feeling between them, and Satan is indeed man’s manifest enemy.\n",
        "TRANSLATION_12": "Say to My servants that they should (only) say those things that are best: for Satan doth sow dissensions among them: For Satan is to man an avowed enemy.\n",
        "TRANSLATION_13": "And say to My slaves (i.e. the true believers of Islamic Monotheism) that they should (only) say those words that are the best. (Because) Shaitan (Satan) verily, sows disagreements among them. Surely, Shaitan (Satan) is to man a plain enemy.\n",
        "TRANSLATION_14": "Tell My worshipers, that they should say words that are the finest, satan would arouse discord among them; he is the clear enemy of mankind.\n",
        "TRANSLATION_15": "Tell My servants to say what is best. Satan sows discord among them. Satan is to man an open enemy.\n",
        "TRANSLATION_16": "And tell My servants to say that which is best. Indeed, Satan induces [dissension] among them. Indeed Satan is ever, to mankind, a clear enemy.\n",
        "TRANSLATION_17": "[17:53] And tell My servants, the believers, to speak, to disbelievers, that, word, which is finer. For Satan indeed incites ill feeling, he makes trouble, between them, and Satan is indeed man’s manifest enemy, his enmity is evident. The ‘finer word’ is [to say] this:\n",
        "TRANSLATION_18": "(Tell My bondmen) 'Umar and his fellow believers (to speak) to say to the disbelievers (that which is kindlier) i.e. greet them and be kind to them. (Lo! the devil soweth discord among them) when you treat them harshly. (Lo! the devil is for man an open foe) his enmity is quite manifest. This injunction was before they were commanded to fight.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "17:53",
            "43:62",
            "12:5",
            "41:34",
            "35:6",
            "46:6",
            "25:29",
            "13:29",
            "40:48",
            "47:25"
        ],
        "BIBLE": [
            "writings:daniel:10:11",
            "torah:genesis:44:7",
            "writings:ii%20chronicles:10:7",
            "prophets:i%20samuel:18:23",
            "writings:job:42:7",
            "prophets:ii%20kings:6:12",
            "prophets:ezekiel:3:4",
            "torah:exodus:19:9",
            "prophets:jeremiah:16:10",
            "torah:numbers:22:20"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:1:9"
        ]
    }
}