{
    "VERSE": "17:54",
    "ARABIC": "رَّبُّكُمْ أَعْلَمُ بِكُمْ إِن يَشَأْ يَرْحَمْكُمْ أَوْ إِن يَشَأْ يُعَذِّبْكُمْ وَمَآ أَرْسَلْنَٰكَ عَلَيْهِمْ وَكِيلًا",
    "ENGLISH": {
        "TRANSLATION_0": "Your Lord knows you best. If He wills, He will have mercy on you, and, if He wills, He will punish you. We did not send you to be their guardian.",
        "TRANSLATION_1": "Your Lord knows you better: He may have mercy on you if He please, or punish you if He will. Yet We have not sent you as warden over them.\n",
        "TRANSLATION_2": "Your Lord knows you best. He will have mercy on you if He wills and chastise you if He wills. We have not sent you, (O Muhammad), as an overseer over them.\n",
        "TRANSLATION_3": "Your Lord knows better than you (people). He will have mercy on you or will punish you as He wills. We have not sent you to watch over them. Your Lord knows best about those in the heavens and the earth.\n",
        "TRANSLATION_4": "Your Lord knows you well; if He wills He may have mercy upon you, or if He wills, He may punish you; and We have not sent you (O dear Prophet Mohammed – peace and blessings be upon him) as a guardian over them.\n",
        "TRANSLATION_5": "Lord knows you best; if He wills, He will have mercy on you, or if He wills, He will punish you. And We have not sent you as a guardian over them.\n",
        "TRANSLATION_6": "Your Lord knows you best; He will have mercy on you if He pleases, or He will chastise you if He pleases; and We have not sent you as being in charge of them.\n",
        "TRANSLATION_7": "Your Lord knows you very well; if He will, He will have mercy on you, or, if He will, He will chastise you. We sent thee not to be a guardian over them.\n",
        "TRANSLATION_8": "Your Lord is Best Aware of you. If He will, He will have mercy on you, or if He will, He will punish you. We have not sent thee (O Muhammad) as a warden over them.\n",
        "TRANSLATION_9": "Your Lord is fully aware of you. He may show you mercy if He will, or punish you if He will. We have not sent you as their guardian.\n",
        "TRANSLATION_10": "Your Lord is the Best Knower of you; if He willeth He will have mercy upon you, or if He willeth He will torment you. And We have not sent thee over them as a trustee.\n",
        "TRANSLATION_11": "Your Lord knows you best. He will have mercy on you if He wishes, or punish you, if He wishes, and We did not send you to watch over them.\n",
        "TRANSLATION_12": "It is your Lord that knoweth you best: If He please, He granteth you mercy, or if He please, punishment: We have not sent thee to be a disposer of their affairs for them.\n",
        "TRANSLATION_13": "Your Lord knows you best, if He will, He will have mercy on you, or if He will, He will punish you. And We have not sent you (O Muhammad SAW) as a guardian over them.\n",
        "TRANSLATION_14": "Your Lord knows you very well. He will have mercy on you if He will, or punish you if He will. We have not sent you to be their guardian.\n",
        "TRANSLATION_15": "Your Lord knows you best. If He wills, He will have mercy on you; and if He wills, He will punish you. We did not send you as their advocate.\n",
        "TRANSLATION_16": "Your Lord is most knowing of you. If He wills, He will have mercy upon you; or if He wills, He will punish you. And We have not sent you, [O Muhammad], over them as a manager.\n",
        "TRANSLATION_17": "[17:54] Your Lord knows you best. If He will, He will have mercy on you, by way of [granting you] repentance and faith, or, if He will, for you to be chastised, He will chastise you, by having you die in disbelief. And We did not send you to be a guardian over them, and so compel them to [embrace] faith — this was [revealed] before the command to fight [them].\n",
        "TRANSLATION_18": "(Your Lord is best aware of you) He knows what is best for you. (If He will, He will have mercy on you) and save you from the people of Mecca, (or if He will, He will punish you) and arouse them against you. (We have not sent thee (0 Muhammad) as a warden over them) such that you will be taken to task over them.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "17:54",
            "10:40",
            "26:188",
            "26:47",
            "7:121",
            "17:65",
            "15:25",
            "26:164",
            "26:127",
            "26:180"
        ],
        "BIBLE": [
            "prophets:i%20samuel:20:13",
            "writings:psalms:119:64",
            "prophets:i%20kings:8:60",
            "writings:ii%20chronicles:6:14",
            "writings:nehemiah:1:5",
            "torah:exodus:33:16",
            "prophets:jeremiah:28:9",
            "writings:ii%20chronicles:6:33",
            "prophets:i%20kings:8:43",
            "torah:genesis:26:29"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:4:10"
        ]
    }
}