{
    "VERSE": "17:56",
    "ARABIC": "قُلِ ٱدْعُوا۟ ٱلَّذِينَ زَعَمْتُم مِّن دُونِهِۦ فَلَا يَمْلِكُونَ كَشْفَ ٱلضُّرِّ عَنكُمْ وَلَا تَحْوِيلًا",
    "ENGLISH": {
        "TRANSLATION_0": "Say: 'Call on those you make claims for apart from Him. They possess no power to remove any harm from you or to change anything.'",
        "TRANSLATION_1": "Say: \"Call those whom you imagine to be gods besides Him; yet they have no power to relieve you of any distress or to avert it.\"\n",
        "TRANSLATION_2": "Tell them: \"Call upon those whom you fancy to be (your helpers) instead of Him! They have no power to remove any affliction from you, nor can they shift it (to any other).\"\n",
        "TRANSLATION_3": "(Muhammad), tell them, \"Seek help from those whom you consider equal to God. They are not able to remove or change your hardships\".\n",
        "TRANSLATION_4": "Proclaim, “Call upon those whom you assume besides Allah – so they do not have any power to relieve the misfortune from you nor to avert it.”\n",
        "TRANSLATION_5": "Say: \"Call upon those - besides Him whom you pretend. They have neither the power to remove the adversity from you nor even to shift (it from you to another person).\"\n",
        "TRANSLATION_6": "Say: Call on those whom you assert besides Him, so they shall not control the removal of distress from you nor (its) transference.\n",
        "TRANSLATION_7": "Say: 'Call on those you asserted apart from Him; they have no power to remove affliction from you, or to transfer it.\n",
        "TRANSLATION_8": "Say: Cry unto those (saints and angels) whom ye assume (to be gods) beside Him, yet they have no power to rid you of misfortune nor to change.\n",
        "TRANSLATION_9": "Call upon those you claim to be deities besides God and you will know that they have no power to remove affliction from you or to bring about any change [that you may desire].\n",
        "TRANSLATION_10": "Say thou: call upon those whom ye fancy beside Him; they are able neither to remove the distress from you nor to work a turning off.\n",
        "TRANSLATION_11": "Say, ‘Invoke those whom you claim [to be gods] besides Him. They have no power to remove your distress, nor to bring about any change [in your state].\n",
        "TRANSLATION_12": "Say: \"Call on those - besides Him - whom ye fancy: they have neither the power to remove your troubles from you nor to change them.\"\n",
        "TRANSLATION_13": "Say (O Muhammad SAW): \"Call unto those besides Him whom you pretend [to be gods like angels, Iesa (Jesus), 'Uzair (Ezra), etc.]. They have neither the power to remove the adversity from you nor even to shift it from you to another person.\"\n",
        "TRANSLATION_14": "Say: 'Call to those whom you assert, other than Him. They have neither the power to remove your affliction nor to transfer it'\n",
        "TRANSLATION_15": "Say, “Call upon those you claim besides Him. They have no power to relieve your adversity, nor can they change it.”\n",
        "TRANSLATION_16": "Say, \"Invoke those you have claimed [as gods] besides Him, for they do not possess the [ability for] removal of adversity from you or [for its] transfer [to someone else].\"\n",
        "TRANSLATION_17": "[17:56] Say, to them: ‘Call on those whom you assumed, to be gods, besides Him, such as the angels, Jesus and Ezra (‘Uzayr); yet they have no power to rid you of misfortune nor to transfer, it to [persons] other than you.\n",
        "TRANSLATION_18": "(Say) Muhammad, to Khuza'ah who worshipped the jinn, thinking they were angels: (Cry unto those (saints and angels) whom ye assume (to be gods)) you worship (beside Him) apart from Allah in times of hardship, (yet they have no power to rid you of misfortune) they cannot remove hardship from you (nor to change) nor transfer this hardship to someone else.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "17:56",
            "7:197",
            "43:86",
            "36:23",
            "16:86",
            "5:76",
            "6:51",
            "11:55",
            "29:17",
            "16:20"
        ],
        "BIBLE": [
            "prophets:jeremiah:34:15",
            "torah:exodus:3:4",
            "prophets:i%20samuel:28:15",
            "writings:ii%20chronicles:7:14",
            "torah:deuteronomy:31:18",
            "torah:genesis:16:13",
            "writings:i%20chronicles:4:10",
            "prophets:judges:16:28",
            "torah:deuteronomy:11:28",
            "writings:ii%20chronicles:6:33"
        ]
    }
}