{
    "VERSE": "17:61",
    "ARABIC": "وَإِذْ قُلْنَا لِلْمَلَٰٓئِكَةِ ٱسْجُدُوا۟ لِءَادَمَ فَسَجَدُوٓا۟ إِلَّآ إِبْلِيسَ قَالَ ءَأَسْجُدُ لِمَنْ خَلَقْتَ طِينًا",
    "ENGLISH": {
        "TRANSLATION_0": "When We said to the angels, 'Prostrate yourselves to Adam!' they prostrated, except for Iblis. He said 'What! Am I to prostrate to one You have created out of clay?'",
        "TRANSLATION_1": "When We asked the angels to bow before Adam, they all bowed but Iblis, who said: \"Can I bow before him whom You created from clay?\"\n",
        "TRANSLATION_2": "And recall when We asked the angels to prostrate themselves before Adam; all prostrated themselves except Iblis, who said: \"Shall I prostrate myself before him whom You created of clay?\"\n",
        "TRANSLATION_3": "When We told the angels to prostrate before Adam, they all obeyed, except Iblis who said, \"Should I prostrate before one whom You have created out of clay?\"\n",
        "TRANSLATION_4": "And recall when We ordered the angels that, “Prostrate before Adam” – so they all prostrated except Iblis; he said, “Shall I prostrate before one whom You have created from clay?”\n",
        "TRANSLATION_5": "And (remember) when We said to the angels: \"Prostrate yourselves unto Adam.\" They prostrated themselves except Iblis. He said: \"Shall I prostrate myself to one whom You created from clay\"\n",
        "TRANSLATION_6": "And when We said to the angels: Make obeisance to Adam; they made obeisance, but Iblis (did it not). He said: Shall I make obeisance to him whom Thou hast created of dust?\n",
        "TRANSLATION_7": "And when We said to the angels, 'Bow yourselves to Adam'; so they bowed themselves, save Iblis; he said,, 'Shall I bow myself unto one Thou hast created of clay?'\n",
        "TRANSLATION_8": "And when We said unto the angels: Fall down prostrate before Adam and they fell prostrate all save Iblis, he said: Shall I fall prostrate before that which Thou hast created of clay?\n",
        "TRANSLATION_9": "When We said to the angels, \"Prostrate yourselves before Adam,\" they all prostrated themselves except Iblis. He said, \"Am I to prostrate myself to someone You have created out of clay?\"\n",
        "TRANSLATION_10": "And recall what time We said unto the angels: prostrate youselves before Adam. So they prostrated themselves, but Iblis did not; he said: shall I prostrate myself before one whom Thou hast created of clay?\n",
        "TRANSLATION_11": "When We said to the angels, ‘Prostrate before Adam,’ they [all] prostrated, but not Iblis: he said, ‘Shall I prostrate before someone whom You have created from clay?’\n",
        "TRANSLATION_12": "Behold! We said to the angels: \"Bow down unto Adam\": They bowed down except Iblis: He said, \"Shall I bow down to one whom Thou didst create from clay?\"\n",
        "TRANSLATION_13": "And (remember) when We said to the angels: \"Prostrate unto Adam.\" They prostrated except Iblis (Satan). He said: \"Shall I prostrate to one whom You created from clay?\"\n",
        "TRANSLATION_14": "When We said to the angels: 'Prostrate yourselves before Adam' they all prostrated themselves, except iblis (father of the jinn), who said: 'Shall I prostrate to him whom You have created from clay?\n",
        "TRANSLATION_15": "When We said to the angels, “Bow down before Adam,” they bowed down, except for Satan. He said, “Shall I bow down before someone You created from mud?”\n",
        "TRANSLATION_16": "And [mention] when We said to the angles, \"Prostrate to Adam,\" and they prostrated, except for Iblees. He said, \"Should I prostrate to one You created from clay?\"\n",
        "TRANSLATION_17": "[17:61] And, mention, when We said to the angels, ‘Prostrate yourselves before Adam’, a prostration of salutation, by inclining oneself, and so they [all] prostrated themselves, except Iblīs: he said, ‘Shall I prostrate myself before one whom You have created from clay?’ (tīnan, is in the accusative because the operator of the oblique [min, ‘of’] has been omitted, in other words [it would normally be] min tīnin).\n",
        "TRANSLATION_18": "(And when We said unto the angels) who were on the earth: (Fall down prostrate before Adam) a prostration of greeting (and they fell prostrate all save Iblis, he said: Shall I fall prostrate before that which Thou hast created of clay?)\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "17:61",
            "20:116",
            "2:34",
            "7:11",
            "18:50",
            "38:71",
            "22:56",
            "41:14",
            "34:40",
            "15:8"
        ],
        "BIBLE": [
            "torah:genesis:46:3",
            "writings:daniel:8:19",
            "torah:genesis:19:34",
            "prophets:joshua:7:19",
            "writings:i%20chronicles:10:4",
            "prophets:ezekiel:11:13",
            "torah:deuteronomy:30:12",
            "torah:exodus:30:37",
            "prophets:i%20kings:12:9",
            "writings:ii%20chronicles:10:9"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:6:1"
        ]
    }
}