{
    "VERSE": "17:65",
    "ARABIC": "إِنَّ عِبَادِى لَيْسَ لَكَ عَلَيْهِمْ سُلْطَٰنٌ وَكَفَىٰ بِرَبِّكَ وَكِيلًا",
    "ENGLISH": {
        "TRANSLATION_0": "But as for My slaves, you will not have any authority over them.' Your Lord suffices as a guardian.",
        "TRANSLATION_1": "You will surely have no power over My devotees: Your Lord is sufficient as their protector.\"\n",
        "TRANSLATION_2": "but know well that you will have no power against My servants. Your Lord suffices for them to place their trust in.\"\n",
        "TRANSLATION_3": "You have no authority over My servants. Your Lord is a Sufficient Protector.\"\n",
        "TRANSLATION_4": "“Indeed My bondmen* – you do not have any power over them”; and your Lord is Sufficient as a Trustee. (* The chosen virtuous bondmen)\n",
        "TRANSLATION_5": "Verily, My servants, you have no authority over them. And All-Sufficient is your Lord as a Guardian.\"\n",
        "TRANSLATION_6": "Surely (as for) My servants, you have no authority over them; and your Lord is sufficient as a Protector.\n",
        "TRANSLATION_7": "Surely over My servants thou shalt have no authority.' Thy Lord suffices as a guardian.\n",
        "TRANSLATION_8": "Lo! My (faithful) bondmen - over them thou hast no power, and thy Lord sufficeth as (their) guardian.\n",
        "TRANSLATION_9": "but over My true servants you shall have no power. Your Lord will be their all-sufficient guardian.\"\n",
        "TRANSLATION_10": "Verily My bondmen; over them thou hast no authority; and thy Lord sufficeth as a Trustee.\n",
        "TRANSLATION_11": "‘As for My servants, you shall have no authority over them.’ And your Lord suffices as trustee.\n",
        "TRANSLATION_12": "As for My servants, no authority shalt thou have over them:\" Enough is thy Lord for a Disposer of affairs.\n",
        "TRANSLATION_13": "Verily! My slaves (i.e. the true believers of Islamic Monotheism), you have no authority over them. And All-Sufficient is your Lord as a Guardian.\"\n",
        "TRANSLATION_14": "Over My worshipers you shall have no authority' Your Lord is their Sufficing Guardian.\n",
        "TRANSLATION_15": "“As for My devotees, you have no authority over them.” Your Lord is an adequate Guardian.\n",
        "TRANSLATION_16": "Indeed, over My [believing] servants there is for you no authority. And sufficient is your Lord as Disposer of affairs.\n",
        "TRANSLATION_17": "[17:65] ‘Truly as for My servants, the believers, you shall have no warrant’, [no] sway or ability. And Your Lord   suffices as a guardian, as a protector for them against you.\n",
        "TRANSLATION_18": "(Lo! My (faithful) bondmen) who are protected from you (over them thou hast no power) you have no way to get to them or overcome them, (and your Lord sufficeth as (their) guardian) He guarantees that which He promised; it is also said: He is Protector.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "17:65",
            "16:99",
            "15:42",
            "40:60",
            "17:54",
            "16:100",
            "44:20",
            "23:98",
            "17:80",
            "7:206"
        ],
        "BIBLE": [
            "writings:psalms:9:11",
            "prophets:ezekiel:37:14",
            "prophets:hosea:2:22",
            "prophets:jeremiah:39:18",
            "prophets:isaiah:43:10",
            "torah:exodus:9:30",
            "writings:proverbs:22:19",
            "prophets:i%20samuel:20:7",
            "torah:exodus:33:17",
            "prophets:ezekiel:33:27"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:8"
        ]
    }
}