{
    "VERSE": "17:69",
    "ARABIC": "أَمْ أَمِنتُمْ أَن يُعِيدَكُمْ فِيهِ تَارَةً أُخْرَىٰ فَيُرْسِلَ عَلَيْكُمْ قَاصِفًا مِّنَ ٱلرِّيحِ فَيُغْرِقَكُم بِمَا كَفَرْتُمْ ثُمَّ لَا تَجِدُوا۟ لَكُمْ عَلَيْنَا بِهِۦ تَبِيعًا",
    "ENGLISH": {
        "TRANSLATION_0": "Or do you feel secure against Him taking you back into it another time and sending a violent storm against you and drowning you for your ingratitude? Then you will find no one to defend you against Us.",
        "TRANSLATION_1": "Or you feel so secure that He will not send you back (to sea) again or send a gravel-hurtling storm against you, and drown you for your ingratitude? Then you will not find any avenger against Us.\n",
        "TRANSLATION_2": "Or do you feel secure that He will not cause you to revert to the sea, and let a tempest loose upon you and then drown you for your ingratitude whereupon you will find none even to inquire of Us what happened to you?\n",
        "TRANSLATION_3": "Do you feel secure that We will not drive you back to the sea, send a fierce gale to you, and cause you to drown because of your disbelief when you would not be able to find anyone who would intercede for you with Us?\n",
        "TRANSLATION_4": "Or are you unafraid that He may again take you back to the sea, then send against you a ship-breaking gust of wind, therefore drowning you because of your disbelief – then you may not find for yourself anyone to come after Us for this?\n",
        "TRANSLATION_5": "Or do you feel secure that He will not send you back a second time to sea and send against you a Qasif and drown you because of your disbelief Then you will not find any avenger therein against Us.\n",
        "TRANSLATION_6": "Or, do you feel secure that He will (not) take you back into it another time, then send on you a fierce gale and thus drown you on account of your ungratefulness? Then you shall not find any aider against Us in the matter.\n",
        "TRANSLATION_7": "Or do you feel secure that He will not send you back into it a second time, and loose against you a hurricane of wind and drown you for your thanklessness, then you will find no prosecutor for you against Us?\n",
        "TRANSLATION_8": "Or feel ye secure that He will not return you to that (plight) a second time, and send against you a hurricane of wind and drown you for your thanklessness, and then ye will not find therein that ye have any avenger against Us?\n",
        "TRANSLATION_9": "Or do you feel secure against His sending you back to sea once again, and raising a fierce gale against you  and causing you to drown in requital for your ingratitude? You will find no helper against Us there.\n",
        "TRANSLATION_10": "Or are ye secure that he will not send you back therein anot her time and then send upon you a gale of wind and drown you for your having disbelieved, so that therein you will not find for yourselves against Us an avenger?\n",
        "TRANSLATION_11": "Do you feel secure that He will not send you back into it another time and unleash against you a shattering gale and drown you because of your unfaith? Then you will not find for yourselves any redresser against Us.\n",
        "TRANSLATION_12": "Or do ye feel secure that He will not send you back a second time to sea and send against you a heavy gale to drown you because of your ingratitude, so that ye find no helper. Therein against Us?\n",
        "TRANSLATION_13": "Or do you feel secure that He will not send you back a second time to sea and send against you a hurricane of wind and drown you because of your disbelief, then you will not find any avenger therein against Us?\n",
        "TRANSLATION_14": "Or, do you feel secure that He will not send you back into it a second time, and send against you a violent tempest and drown you because of disbelief? Then you shall find no prosecutor (to help) you against Us.\n",
        "TRANSLATION_15": "Or are you confident that He will not return you to it once again, and unleash a hurricane against you, and drown you for your ingratitude? Then you will find no helper against Us.\n",
        "TRANSLATION_16": "Or do you feel secure that He will not send you back into the sea another time and send upon you a hurricane of wind and drown you for what you denied? Then you would not find for yourselves against Us an avenger.\n",
        "TRANSLATION_17": "[17:69] Or do you feel secure that He will not return you to it, that is, [to] the sea, a second time and unleash upon you a shattering gale, that is, a violent wind that shatters everything in its path, to destroy your ship, and drown you for your ungratefulness? And then you will not find for yourselves any redresser of this against Us, [any] helper or advocate to demand restitution from Us for what We [will] have done to you.\n",
        "TRANSLATION_18": "(Or feel ye) people of Mecca (secure that He will not return you to that (plight)) to the sea (a second time, and send against you a hurricane of wind and drown you) in the sea (for your thanklessness) for your denial of Allah and your ingratitude towards His bounty, (and then ye will not find therein that ye have any avenger against Us) for drowning you?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "17:69",
            "20:55",
            "37:108",
            "37:129",
            "37:78",
            "26:172",
            "26:66",
            "37:82",
            "37:136",
            "7:39"
        ],
        "BIBLE": [
            "writings:ezra:5:5",
            "prophets:judges:2:18",
            "writings:nehemiah:9:28",
            "prophets:ii%20samuel:14:29",
            "writings:ezra:10:14",
            "prophets:isaiah:55:11",
            "prophets:jeremiah:37:7",
            "writings:daniel:11:29",
            "prophets:jeremiah:23:5",
            "prophets:ii%20kings:1:6"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:4:1"
        ]
    }
}