{
    "VERSE": "17:72",
    "ARABIC": "وَمَن كَانَ فِى هَٰذِهِۦٓ أَعْمَىٰ فَهُوَ فِى ٱلْءَاخِرَةِ أَعْمَىٰ وَأَضَلُّ سَبِيلًا",
    "ENGLISH": {
        "TRANSLATION_0": "Those who are blind in this world will be blind in the Next World and even further off the Path.",
        "TRANSLATION_1": "But whoso has been blind in this world shall be blind in the world to come, even farther astray from the path.\n",
        "TRANSLATION_2": "Whoever lived in this world as blind shall live as blind in the Life to Come; rather, he will be even farther astray than if he were (just) blind.\n",
        "TRANSLATION_3": "Those who are blind in this life will also be blind in the life to come and in terrible error.\n",
        "TRANSLATION_4": "Whoever is blind* in this life will be blind in the Hereafter, and even more astray. (* To the truth – disbelieving.)\n",
        "TRANSLATION_5": "And whoever is blind in this [world] then he will be blind in the Hereafter, and most astray from the path.\n",
        "TRANSLATION_6": "And whoever is blind in this, he shall (also) be blind in the hereafter; and more erring from the way.\n",
        "TRANSLATION_7": "And whosoever is blind in this world shall be blind in the world to come, and he shall be even further astray from the way.\n",
        "TRANSLATION_8": "Whoso is blind here will be blind in the Hereafter, and yet further from the road.\n",
        "TRANSLATION_9": "but whoever has been blind in this life will be blind in the life to come, and still farther astray from the path [of truth].\n",
        "TRANSLATION_10": "And whosoever hath been in this life blind will in the Hereafter be blind, and far astray from the way.\n",
        "TRANSLATION_11": "But whoever has been blind in this [world], will be blind in the Hereafter, and [even] more astray from the [right] way.\n",
        "TRANSLATION_12": "But those who were blind in this world, will be blind in the hereafter, and most astray from the Path.\n",
        "TRANSLATION_13": "And whoever is blind in this world (i.e., does not see Allah's Signs and believes not in Him), will be blind in the Hereafter, and more astray from the Path.\n",
        "TRANSLATION_14": "But he who is blind in this life, shall be blind in the Everlasting Life and will be further astray from the Path.\n",
        "TRANSLATION_15": "But whoever is blind in this, he will be blind in the Hereafter, and further astray from the way.\n",
        "TRANSLATION_16": "And whoever is blind in this [life] will be blind in the Hereafter and more astray in way.\n",
        "TRANSLATION_17": "[17:72] And whoever has been in this, that is, [in] this world, blind, to the truth, will be blind in the Hereafter, to the path of salvation and the reciting of the Qur’ān, and [even] further astray from the [right] way, more removed from the road [that leads] to it.\n",
        "TRANSLATION_18": "(Whoso is blind) from giving thanks (here) about these bounties (will be blind in the Hereafter) about the bliss of Paradise, (and yet further from the road). It is also said that this means: whoever is in this worldly life blind to seeing the proof and exposition, will be in the Hereafter even more blind and farther away from proof.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "17:72",
            "17:19",
            "27:81",
            "30:53",
            "43:40",
            "14:3",
            "7:45",
            "30:16",
            "37:78",
            "37:129"
        ],
        "BIBLE": [
            "writings:psalms:139:24",
            "writings:proverbs:5:6",
            "writings:job:16:22",
            "writings:proverbs:5:8",
            "prophets:jeremiah:50:4",
            "prophets:jeremiah:10:2",
            "prophets:ezekiel:21:32",
            "torah:exodus:4:8",
            "prophets:jeremiah:12:1",
            "writings:psalms:96:13"
        ]
    }
}