{
    "VERSE": "17:73",
    "ARABIC": "وَإِن كَادُوا۟ لَيَفْتِنُونَكَ عَنِ ٱلَّذِىٓ أَوْحَيْنَآ إِلَيْكَ لِتَفْتَرِىَ عَلَيْنَا غَيْرَهُۥ وَإِذًا لَّٱتَّخَذُوكَ خَلِيلًا",
    "ENGLISH": {
        "TRANSLATION_0": "They were very near to enticing you away from some of what We have revealed to you, hoping that you would invent something against Us. Then they would have taken you as their intimate.",
        "TRANSLATION_1": "They had almost led you away from what has been revealed to you, that you may invent things about Us besides those revealed, when they would have taken you as friend.\n",
        "TRANSLATION_2": "(O Muhammad), they had all but tempted you away from what We have revealed to you that you may invent something else in Our Name. Had you done so, they would have taken you as their trusted friend.\n",
        "TRANSLATION_3": "(Such blind ones) try to confuse what We have revealed to you so that they may falsely ascribe to Us something other than the true revelation and thus establish friendship with you.\n",
        "TRANSLATION_4": "And it was close that they were about to mislead you somewhat from the divine revelation We sent to you, for you to attribute something else* to Us; and if it were**, they would have accepted you as a friend. (* Other than the divine revelation. ** Which is impossible.)\n",
        "TRANSLATION_5": "Verily, they were about to tempt you away from that which We have revealed to you, to fabricate something other than it against Us, and then they would certainly have taken you as an intimate friend!\n",
        "TRANSLATION_6": "And surely they had purposed to turn you away from that which We have revealed to you, that you should forge against Us other than that, and then they would certainly have taken you for a friend.\n",
        "TRANSLATION_7": "Indeed they were near to seducing thee from that We revealed to thee, that thou mightest forge against Us another, and then they would surely have taken thee as a friend;\n",
        "TRANSLATION_8": "And they indeed strove hard to beguile thee (Muhammad) away from that wherewith We have inspired thee, that thou shouldst invent other than it against Us; and then would they have accepted thee as a friend.\n",
        "TRANSLATION_9": "They indeed sought to entice you away from what We revealed to you, hoping that you might invent something else in Our name; and then they would have accepted you as a close friend.\n",
        "TRANSLATION_10": "And verily they had well-nigh tempted thee away from that which We have revealed unto thee, that thou shouldst fabricate regarding something else; and then surely they would have taken thee as a friend!\n",
        "TRANSLATION_11": "They were about to beguile you from what Allah has revealed to you so that you may fabricate something other than that against Us, whereat they would have befriended you.\n",
        "TRANSLATION_12": "And their purpose was to tempt thee away from that which We had revealed unto thee, to substitute in our name something quite different; (in that case), behold! they would certainly have made thee (their) friend!\n",
        "TRANSLATION_13": "Verily, they were about to tempt you away from that which We have revealed (the Quran) unto you (O Muhammad SAW), to fabricate something other than it against Us, and then they would certainly have taken you a friend!\n",
        "TRANSLATION_14": "Indeed, they were near to seducing you from that We revealed to you, so that you might forge against Us another, and then they would surely have taken you as a friend;\n",
        "TRANSLATION_15": "They almost lured you away from what We have revealed to you, so that you would invent something else in Our name. In that case, they would have taken you for a friend.\n",
        "TRANSLATION_16": "And indeed, they were about to tempt you away from that which We revealed to you in order to [make] you invent about Us something else; and then they would have taken you as a friend.\n",
        "TRANSLATION_17": "[17:73]   The following was revealed regarding the [tribe of] Thaqīf, for they had asked him [the Prophet] (s) to declare their valley inviolable and implored him [to grant them this request]: And indeed (wa-in, [the particle in is] softened) they were about to, they nearly did, beguile you away from that which We revealed to you, so that you might invent against Us [something] other than that; and then, had you done that, they would have taken you as a friend.\n",
        "TRANSLATION_18": "(And they indeed strove hard) they almost succeeded (to beguile thee (Muhammad) away) to drive you away and make you slip (from that wherewith We have inspired thee) regarding the breaking of their idols, (that thou shouldst invent) that you should say (other than it against Us) other than what We commanded you to do: breaking their idols; (and then would they have accepted thee as a friend) because of following them. This verse was revealed about Thaqif.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "17:73",
            "1:7",
            "26:29",
            "17:76",
            "17:86",
            "41:8",
            "23:95",
            "15:6",
            "84:25",
            "37:167"
        ],
        "BIBLE": [
            "torah:deuteronomy:13:15",
            "torah:leviticus:4:35",
            "prophets:joshua:6:18",
            "prophets:isaiah:29:21",
            "writings:ii%20chronicles:6:24",
            "torah:exodus:23:13",
            "prophets:ii%20kings:23:16",
            "prophets:i%20kings:8:33",
            "torah:exodus:23:27",
            "prophets:i%20kings:20:34"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:13",
            
            "Sefer%20Yetzirah:5:2"
        ]
    }
}