{
    "VERSE": "17:75",
    "ARABIC": "إِذًا لَّأَذَقْنَٰكَ ضِعْفَ ٱلْحَيَوٰةِ وَضِعْفَ ٱلْمَمَاتِ ثُمَّ لَا تَجِدُ لَكَ عَلَيْنَا نَصِيرًا",
    "ENGLISH": {
        "TRANSLATION_0": "Then We would have let you taste a double punishment in life and a double punishment in death. You would not have found any helper against Us.",
        "TRANSLATION_1": "In that case We would have made you taste a double anguish of life and a double anguish of death, and then you would not have been able to find a helper against Us for yourself.\n",
        "TRANSLATION_2": "whereupon We would have made you taste double (the chastisement) in the world and double (the chastisement) after death, and then you would have found none to help you against Us.\n",
        "TRANSLATION_3": "Had you done so, We would certainly have made you face double punishment in this life and after your death and you would have found none to help you.\n",
        "TRANSLATION_4": "And if it were*, We would then have made you taste a double life and a double death – you would then not find any supporter against Us. (* Which is impossible.)\n",
        "TRANSLATION_5": "In that case We would have made you taste a double portion in this life and a double portion after death. And then you would have found none to help you against Us.\n",
        "TRANSLATION_6": "In that case We would certainly have made you to taste a double (punishment) in this life and a double (punishment) after death, then you would not have found any helper against Us.\n",
        "TRANSLATION_7": "then would We have let thee taste the double of life and the double of death; and then thou wouldst have found none to help thee against Us.\n",
        "TRANSLATION_8": "Then had we made thee taste a double (punishment) of living and a double (punishment) of dying, then hadst thou found no helper against Us.\n",
        "TRANSLATION_9": "In that case, We should have inflicted a double punishment in this life, and a double punishment after death. Then you would have found no one to help you against Us.\n",
        "TRANSLATION_10": "In that case We would have surely made thee taste the double of the tornment of the life and the double of the torment of death, and then thou wouldst not find against Us a helper.\n",
        "TRANSLATION_11": "Then We would have surely made you taste a double [punishment] in this life and a double [punishment] after death, and then you would have not found for yourself any helper against Us.\n",
        "TRANSLATION_12": "In that case We should have made thee taste an equal portion (of punishment) in this life, and an equal portion in death: and moreover thou wouldst have found none to help thee against Us!\n",
        "TRANSLATION_13": "In that case, We would have made you taste a double portion (of punishment) in this life and a double portion (of punishment) after death. And then you would have found none to help you against Us.\n",
        "TRANSLATION_14": "then We would have let you taste the double of life and death; and you would have found none to help you against Us.\n",
        "TRANSLATION_15": "Then We would have made you taste double in life, and double at death; then you would have found for yourself no helper against Us.\n",
        "TRANSLATION_16": "Then [if you had], We would have made you taste double [punishment in] life and double [after] death. Then you would not find for yourself against Us a helper.\n",
        "TRANSLATION_17": "[17:75] Then, had you inclined, We would have surely made you taste a double, chastisement, in life and a double, chastisement, upon death, in other words, twice the chastisement that any other person would receive in this world and the Hereafter. Then you would not have found for yourself any helper against Us, [anyone] to shield [you] from it.\n",
        "TRANSLATION_18": "(Then) if you had granted to them what they requested (had We made thee taste a double (punishment) of living) the chastisement of this worldly life (and a double (punishment) of dying) the chastisement of the Hereafter, (then hadst thou found no helper against Us) you would not find anyone to save you from Us.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "17:75",
            "77:26",
            "48:22",
            "56:60",
            "30:19",
            "69:46",
            "16:21",
            "23:37",
            "6:162",
            "7:192"
        ],
        "BIBLE": [
            "writings:psalms:17:14",
            "torah:numbers:35:31",
            "prophets:jonah:1:14",
            "prophets:i%20samuel:20:3",
            "torah:genesis:19:19",
            "writings:proverbs:16:22",
            "writings:job:38:17",
            "prophets:ii%20samuel:18:13",
            "torah:deuteronomy:19:4",
            "torah:deuteronomy:30:19"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:8",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:2"
        ]
    }
}