{
    "VERSE": "17:77",
    "ARABIC": "سُنَّةَ مَن قَدْ أَرْسَلْنَا قَبْلَكَ مِن رُّسُلِنَا وَلَا تَجِدُ لِسُنَّتِنَا تَحْوِيلًا",
    "ENGLISH": {
        "TRANSLATION_0": "That was the pattern with those We sent before you as Our Messengers. You will not find any changing of Our pattern.",
        "TRANSLATION_1": "This has been Our way with the apostles whom We sent before you. You will not find any variation in Our line of action.\n",
        "TRANSLATION_2": "This has been Our Way with the Messengers whom We sent before you. You will find no change in Our Way.\n",
        "TRANSLATION_3": "This was Our tradition with Our Messengers who lived before you, and you will find no change in Our tradition.\n",
        "TRANSLATION_4": "The tradition of the Noble Messengers We sent before you – and you will not find Our rules changing.\n",
        "TRANSLATION_5": "A Sunnah with which We sent Our Messengers before you and you will not find any alteration in Our Sunnah.\n",
        "TRANSLATION_6": "(This is Our) course with regard to those of Our apostles whom We sent before you, and you shall not find a change in Our course.\n",
        "TRANSLATION_7": "the wont of those We sent before thee of Our Messengers; thou wilt find no change to Our wont.\n",
        "TRANSLATION_8": "(Such was Our) method in the case of those whom We sent before thee (to mankind), and thou wilt not find for Our method aught of power to change.\n",
        "TRANSLATION_9": "Such was Our way with the messengers We sent before you, and you will find no change in Our ways.\n",
        "TRANSLATION_10": "This was Our dispensation with those whom We sent before thee of Our apostles, and thou wilt not find in this Our dispensation a change.\n",
        "TRANSLATION_11": "A precedent concerning those We have sent before you from among Our apostles, and you will not find any change in Our precedent.\n",
        "TRANSLATION_12": "(This was Our) way with the messengers We sent before thee: thou wilt find no change in Our ways.\n",
        "TRANSLATION_13": "(This was Our) Sunnah (rule or way) with the Messengers We sent before you (O Muhammad SAW), and you will not find any alteration in Our Sunnah (rule or way, etc.).\n",
        "TRANSLATION_14": "Such was Our way with those whom We sent before you. You shall find no change in Our way.\n",
        "TRANSLATION_15": "The tradition of the messengers We sent before you—you will find no change in Our rules.\n",
        "TRANSLATION_16": "[That is Our] established way for those We had sent before you of Our messengers; and you will not find in Our way any alteration.\n",
        "TRANSLATION_17": "[17:77] [That is] the way in the case of those whom We have sent from among Our messengers before you, that is to say, [that is] Our way [of dealing] with them [their enemies], destroying those who expel them [Our messengers]. And as regards Our [established] way you will not find any change, any alternative [manner].\n",
        "TRANSLATION_18": "((Such was Our) method in the case of those whom We sent before you (to mankind)) We destroyed them once their messengers departed from amongst them, (and thou wilt not find for Our method) Our punishment (aught of power to change) it does not alter.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "17:77",
            "21:41",
            "48:23",
            "4:164",
            "33:62",
            "6:10",
            "51:52",
            "41:48",
            "10:91",
            "21:25"
        ],
        "BIBLE": [
            "prophets:micah:2:5",
            "prophets:isaiah:28:10",
            "prophets:isaiah:34:17",
            "writings:job:22:28",
            "prophets:ezekiel:47:3",
            "prophets:jeremiah:52:21",
            "prophets:isaiah:34:11",
            "writings:i%20chronicles:17:23",
            "torah:numbers:34:7",
            "torah:deuteronomy:19:4"
        ]
    }
}