{
    "VERSE": "17:8",
    "ARABIC": "عَسَىٰ رَبُّكُمْ أَن يَرْحَمَكُمْ وَإِنْ عُدتُّمْ عُدْنَا وَجَعَلْنَا جَهَنَّمَ لِلْكَٰفِرِينَ حَصِيرًا",
    "ENGLISH": {
        "TRANSLATION_0": "It may well be that your Lord will have mercy on you. But if you revert to what you did, We also will revert. We have made Hell a prison for the kafirun.'",
        "TRANSLATION_1": "Your Lord may haply be merciful to you. But if you repeat it, We shall do the same. We have constituted Hell as prison for unbelievers.\n",
        "TRANSLATION_2": "Your Lord may well show Mercy to you, but if you revert to your evil behaviour, We shall revert to chastising you. We have made Hell a prison for those who are thankless of Allah's bounties.\n",
        "TRANSLATION_3": "Perhaps your Lord will have mercy on you. If you return to disobedience We will also punish you again. We have made hell a prison for the disbelievers.\"\n",
        "TRANSLATION_4": "It is likely that your Lord may have mercy on you; and if you repeat the mischief, We will repeat the punishment; and We have made hell a prison for the disbelievers.\n",
        "TRANSLATION_5": "It may be that your Lord may show mercy unto you, but if you return (to sins), We shall return (to Our punishment). And We have made Hell a prison for the disbelievers.\n",
        "TRANSLATION_6": "It may be that your Lord will have mercy on you, and if you again return (to disobedience) We too will return (to punishment), and We have made hell a prison for the unbelievers.\n",
        "TRANSLATION_7": "Perchance your Lord will have mercy upon you; but if you return, We shall return; and We have made Gehenna a prison for the unbelievers.\n",
        "TRANSLATION_8": "It may be that your Lord will have mercy on you, but if ye repeat (the crime) We shall repeat (the punishment), and We have appointed hell a dungeon for the disbelievers.\n",
        "TRANSLATION_9": "We said, \"Your Lord may yet have mercy on you, but if you do the same again, so shall We: We have made Hell a prison for those who deny the truth.\"\n",
        "TRANSLATION_10": "Belike your Lord may yet have mercy on you; and if ye still revert, We will revert. And We have appointed Hell for the infidels a prison.\n",
        "TRANSLATION_11": "Maybe your Lord will have mercy on you, but if you revert, We [too] will revert, and We have made hell a prison for the faithless.\n",
        "TRANSLATION_12": "It may be that your Lord may (yet) show Mercy unto you; but if ye revert (to your sins), We shall revert (to Our punishments): And we have made Hell a prison for those who reject (all Faith).\n",
        "TRANSLATION_13": "[And We said in the Taurat (Torah)]: \"It may be that your Lord may show mercy unto you, but if you return (to sins), We shall return (to Our Punishment). And We have made Hell a prison for the disbelievers.\n",
        "TRANSLATION_14": "Perhaps Allah will have mercy on you. But if you return, We will return. We have made Gehenna (Hell) a prison for the unbelievers.\n",
        "TRANSLATION_15": "Perhaps your Lord will have mercy on you. But if you revert, We will revert. We have made Hell a prison for the disbelievers.\n",
        "TRANSLATION_16": "[Then Allah said], \"It is expected, [if you repent], that your Lord will have mercy upon you. But if you return [to sin], We will return [to punishment]. And We have made Hell, for the disbelievers, a prison-bed.\"\n",
        "TRANSLATION_17": "[17:8] And We said in the Scripture: It may be that your Lord will have mercy upon you, after the second time, if you were to repent; but if you revert, to [working] corruption, We [too] will revert, to punishment. And assuredly they did revert by denying the Prophet (s), and so he was given power over them, through the slaying of the [Banū] Qurayza, the expulsion of the [Banū] Nadīr and the exacting of the jizya-tax from them; and We have made Hell a dungeon for the disbelievers, a place of detention and a prison [for them].\n",
        "TRANSLATION_18": "(It may be that your Lord will have mercy on you) after that, (but if ye repeat (the crime) We shall repeat (the punishment)) it is also said that this means: if you return to doing good, We will return to bestowing mercy on you, (and We have appointed hell a dungeon) a prison and jail (for the disbelievers).\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "17:8",
            "11:34",
            "84:5",
            "84:2",
            "44:20",
            "3:43",
            "23:98",
            "37:100",
            "74:7",
            "36:27"
        ],
        "BIBLE": [
            "torah:exodus:32:31",
            "prophets:i%20samuel:15:26",
            "writings:ii%20chronicles:20:21",
            "prophets:hosea:8:13",
            "writings:nehemiah:9:28",
            "prophets:ii%20kings:1:5",
            "prophets:jeremiah:3:1",
            "prophets:jonah:4:2",
            "prophets:ii%20samuel:12:13",
            "prophets:zechariah:8:3"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:2:1"
        ]
    }
}