{
    "VERSE": "17:81",
    "ARABIC": "وَقُلْ جَآءَ ٱلْحَقُّ وَزَهَقَ ٱلْبَٰطِلُ إِنَّ ٱلْبَٰطِلَ كَانَ زَهُوقًا",
    "ENGLISH": {
        "TRANSLATION_0": "Say: 'Truth has come and falsehood has vanished. Falsehood is always bound to vanish.'",
        "TRANSLATION_1": "And say: \"Truth has come and falsehood nullified.\" Verily falsehood is perishable.\n",
        "TRANSLATION_2": "And proclaim: \"The Truth has come, and falsehood has vanished. Surely falsehood is ever bound to vanish.\"\n",
        "TRANSLATION_3": "Say, 'Truth has come and falsehood has been banished; it is doomed to banishment.'\"\n",
        "TRANSLATION_4": "And proclaim, “The Truth has arrived and falsehood has vanished; indeed falsehood had to vanish.” (* With the arrival of the Last Prophet – Mohammed peace and blessings be upon him)\n",
        "TRANSLATION_5": "And say: \"Truth has come and falsehood has vanished. Surely, falsehood is ever bound to vanish.\"\n",
        "TRANSLATION_6": "And say: The truth has come and the falsehood has vanished; surely falsehood is a vanishing (thing).\n",
        "TRANSLATION_7": "And say: 'The truth has come, and falsehood has vanished away; surely falsehood is ever certain to vanish.'\n",
        "TRANSLATION_8": "And say: Truth hath come and falsehood hath vanished away. Lo! falsehood is ever bound to vanish.\n",
        "TRANSLATION_9": "Say, \"Truth has come and falsehood has disappeared. Falsehood is always bound to wither away.\"\n",
        "TRANSLATION_10": "And say thou: the truth is come, and falsehood hath vanished; verily falsehood is ever vanishing.\n",
        "TRANSLATION_11": "And say, ‘The truth has come, and falsehood has vanished. Indeed falsehood is bound to vanish.’\n",
        "TRANSLATION_12": "And say: \"Truth has (now) arrived, and Falsehood perished: for Falsehood is (by its nature) bound to perish.\"\n",
        "TRANSLATION_13": "And say: \"Truth (i.e. Islamic Monotheism or this Quran or Jihad against polytheists) has come and Batil (falsehood, i.e. Satan or polytheism, etc.) has vanished. Surely! Batil is ever bound to vanish.\"\n",
        "TRANSLATION_14": "Say: 'Truth has come and falsehood has vanished. Indeed, falsehood will certainly vanish'\n",
        "TRANSLATION_15": "And say, “The truth has come, and falsehood has withered away; for falsehood is bound to wither away.”\n",
        "TRANSLATION_16": "And say, \"Truth has come, and falsehood has departed. Indeed is falsehood, [by nature], ever bound to depart.\"\n",
        "TRANSLATION_17": "[17:81] And say, upon your entry into Mecca: ‘The Truth, Islam, has come and falsehood has vanished away, disbelief has come to nothing. Truly falsehood is ever bound to vanish’, [ever bound] to fade away and disappear. Indeed the Prophet (s) entered it [Mecca] and there were 360 idols [which had been placed] around the [Sacred] House [sc. the Ka‘ba]. He [the Prophet] then set about thrusting at them with a stick he was carrying, saying those [words] until they had [all] been toppled, as reported by the two Shaykhs [Bukhārī and Muslim].\n",
        "TRANSLATION_18": "(And say: Truth hath come) Muhammad (pbuh) has come with the Qur'an; it is also said that this means: Islam has become triumphant and Muslims numerous (and falsehood hath vanished away) Satan, idolatry and its people all perished. (Lo! Falsehood) Satan, idolatry and its adherents (is ever bound to vanish) is ever bound to perish.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "17:81",
            "38:84",
            "34:49",
            "15:64",
            "37:37",
            "23:90",
            "7:118",
            "8:8",
            "69:51",
            "24:49"
        ],
        "BIBLE": [
            "torah:genesis:42:36",
            "prophets:ii%20kings:23:17",
            "prophets:ii%20kings:5:13",
            "prophets:i%20kings:18:36",
            "prophets:jeremiah:26:8",
            "writings:esther:6:13",
            "torah:genesis:27:35",
            "torah:exodus:33:17",
            "prophets:jeremiah:16:19",
            "torah:numbers:22:38"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:4:2"
        ]
    }
}