{
    "VERSE": "17:84",
    "ARABIC": "قُلْ كُلٌّ يَعْمَلُ عَلَىٰ شَاكِلَتِهِۦ فَرَبُّكُمْ أَعْلَمُ بِمَنْ هُوَ أَهْدَىٰ سَبِيلًا",
    "ENGLISH": {
        "TRANSLATION_0": "Say: 'Each man acts according to his nature, but your Lord knows best who is best guided on the Path.'",
        "TRANSLATION_1": "Say: \"Each one acts according to his disposition, but your Lord knows well who follow the right path.\"\n",
        "TRANSLATION_2": "Say, (O Prophet): \"Each one acts according to his own manner. Your Lord knows well who is best-guided to the Right Path.\"\n",
        "TRANSLATION_3": "Say, \"Everyone does as he wants. Your Lord knows best who has the right guidance.\"\n",
        "TRANSLATION_4": "Proclaim, “Each one works according to his own pattern; and your Lord well knows him who is more upon guidance.”\n",
        "TRANSLATION_5": "Say: \"Each one does according to Shakilatihi, and your Lord knows best of him whose path is right.\"\n",
        "TRANSLATION_6": "Say: Every one acts according to his manner; but your Lord best knows who is best guided in the path.\n",
        "TRANSLATION_7": "Say: 'Every man works according to his own manner; but your Lord knows very well what man is best guided as to the way.'\n",
        "TRANSLATION_8": "Say: Each one doth according to his rule of conduct, and thy Lord is Best Aware of him whose way is right.\n",
        "TRANSLATION_9": "Say to them, \"Everyone acts in his own way, and your Lord knows best who is rightly guided.\"\n",
        "TRANSLATION_10": "Say thou: everyone worketh after his disposition, and your Lord is the Best Knower of him who is best guided on the Way.\n",
        "TRANSLATION_11": "Say, ‘Everyone acts according to his character. Your Lord knows best who is better guided with regard to the way.’\n",
        "TRANSLATION_12": "Say: \"Everyone acts according to his own disposition: But your Lord knows best who it is that is best guided on the Way.\"\n",
        "TRANSLATION_13": "Say (O Muhammad SAW to mankind): \"Each one does according to Shakilatihi (i.e. his way or his religion or his intentions, etc.), and your Lord knows best of him whose path (religion, etc.) is right.\"\n",
        "TRANSLATION_14": "Say: 'Each human works in his own manner. But your Lord knows very well who is best guided on the way'\n",
        "TRANSLATION_15": "Say, “Each does according to his disposition. Your Lord knows best who is better guided in the way.”\n",
        "TRANSLATION_16": "Say, \"Each works according to his manner, but your Lord is most knowing of who is best guided in way.\"\n",
        "TRANSLATION_17": "[17:84] Say: ‘Everyone, [including] us and you, acts according to his [own] character, his [own] manner [of conduct], and your Lord knows best who is better guided as to the way’, [as to] the path [he follows], and He will reward him [accordingly].\n",
        "TRANSLATION_18": "(Say) Muhammad: (Each one) of you (doth according to his rule of conduct) according to his intention and the state in which he is in; it is also said that this means: according to his standpoint and natural disposition, (and thy Lord is best aware of him whose way is right) whose religion is correct.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "17:84",
            "68:7",
            "6:117",
            "26:188",
            "40:7",
            "53:30",
            "73:19",
            "76:29",
            "10:40",
            "7:112"
        ],
        "BIBLE": [
            "writings:proverbs:24:12",
            "torah:exodus:36:1",
            "prophets:ezekiel:20:44",
            "prophets:jeremiah:10:23",
            "prophets:ezekiel:7:9",
            "torah:deuteronomy:31:29",
            "torah:leviticus:23:3",
            "prophets:ii%20kings:6:19",
            "prophets:zephaniah:3:5",
            "writings:ruth:3:10"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:3:6",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:4:10"
        ]
    }
}