{
    "VERSE": "17:88",
    "ARABIC": "قُل لَّئِنِ ٱجْتَمَعَتِ ٱلْإِنسُ وَٱلْجِنُّ عَلَىٰٓ أَن يَأْتُوا۟ بِمِثْلِ هَٰذَا ٱلْقُرْءَانِ لَا يَأْتُونَ بِمِثْلِهِۦ وَلَوْ كَانَ بَعْضُهُمْ لِبَعْضٍ ظَهِيرًا",
    "ENGLISH": {
        "TRANSLATION_0": "Say: 'If both men and jinn banded together to produce the like of this Qur'an, they could never produce anything like it, even if they backed each other up.'",
        "TRANSLATION_1": "Say: \"Surely if men and jinns get together to produce the like of this (Qur'an), they will not be able to produce the like of it, however they might assist one another.\n",
        "TRANSLATION_2": "Say: \"Surely, if mankind and jinn were to get together to produce the like of this Qur'an, they will never be able to produce the like of it, howsoever they might help one another.\"\n",
        "TRANSLATION_3": "Say, \"If all human beings and jinn were to come together to bring the equivalent of this Quran, they could not do so, even if they all were to help each other.\n",
        "TRANSLATION_4": "Proclaim, “If all mankind and jinns agree to bring an equivalent to the Qur’an, they will not be able to bring its equal – even if they were to help each other.”\n",
        "TRANSLATION_5": "Say: \"If mankind and the Jinn were together to produce the like of this Qur'an, they could not produce the like thereof, even if they helped one another.\"\n",
        "TRANSLATION_6": "Say: If men and jinn should combine together to bring the like of this Quran, they could not bring the like of it, though some of them were aiders of others.\n",
        "TRANSLATION_7": "Say: 'If men and jinn banded together to produce the like of this Koran, they would never produce its like, not though they backed one another.'\n",
        "TRANSLATION_8": "Say: Verily, though mankind and the jinn should assemble to produce the like of this Qur'an, they could not produce the like thereof though they were helpers one of another.\n",
        "TRANSLATION_9": "Say, \"If all men and jinn gathered together to produce the like of this Quran, they could not produce one like it, however much they helped one another.\"\n",
        "TRANSLATION_10": "Say thou: if the mankind and the jinn leagued together that they might produce the like of this Qur'an, they could nor produce the like thereof, though one to the other were a backer.\n",
        "TRANSLATION_11": "Say, ‘Should all humans and jinn rally to bring the like of this Quran, they will not bring its like, even if they assisted one another.’\n",
        "TRANSLATION_12": "Say: \"If the whole of mankind and Jinns were to gather together to produce the like of this Qur'an, they could not produce the like thereof, even if they backed up each other with help and support.\n",
        "TRANSLATION_13": "Say: \"If the mankind and the jinns were together to produce the like of this Quran, they could not produce the like thereof, even if they helped one another.\"\n",
        "TRANSLATION_14": "Say: 'If mankind and jinn combined together to produce the like of this Koran, they would never be able to produce one like it, not even if they were to help one another'\n",
        "TRANSLATION_15": "Say, “If mankind and jinn came together to produce the like of this Quran, they could never produce the like of it, even if they backed up one another.”\n",
        "TRANSLATION_16": "Say, \"If mankind and the jinn gathered in order to produce the like of this Qur'an, they could not produce the like of it, even if they were to each other assistants.\"\n",
        "TRANSLATION_17": "[17:88] Say: ‘Verily, should mankind and jinn come together to produce the like of this Qur’ān, [the like thereof] in terms of clarity and rhetorical excellence, they could not produce the like thereof, even if they backed one another’, [even if one was] an assistant [of the other]. This [verse] was revealed as a refutation of their statement: ‘If we wish we can speak the like of this’ [Q. 8:31].\n",
        "TRANSLATION_18": "(Say) Muhammad to the people of Mecca: (Verily, though mankind and the jinn should assemble to produce the like of this Qur'an) conveying therein commands and prohibitions, promises and threats, abrogating and abrogated verses, clear and ambiguous verses and the events of the past and of the future, (they could not produce the like thereof though they were helpers one of another).\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "17:88",
            "34:31",
            "30:58",
            "59:21",
            "39:27",
            "72:5",
            "12:3",
            "7:179",
            "72:6",
            "27:17"
        ],
        "BIBLE": [
            "writings:ii%20chronicles:14:10",
            "prophets:ii%20kings:23:17",
            "prophets:ii%20kings:4:40",
            "torah:deuteronomy:1:22",
            "prophets:i%20kings:17:18",
            "prophets:i%20samuel:28:8",
            "writings:ezra:3:1",
            "prophets:joshua:10:6",
            "prophets:i%20samuel:28:1",
            "torah:genesis:19:5"
        ]
    }
}