{
    "VERSE": "17:89",
    "ARABIC": "وَلَقَدْ صَرَّفْنَا لِلنَّاسِ فِى هَٰذَا ٱلْقُرْءَانِ مِن كُلِّ مَثَلٍ فَأَبَىٰٓ أَكْثَرُ ٱلنَّاسِ إِلَّا كُفُورًا",
    "ENGLISH": {
        "TRANSLATION_0": "We have variegated throughout this Qur'an all kinds of examples for people, but most people spurn anything but kufr.",
        "TRANSLATION_1": "We have given examples of every kind to men in this Qur'an in various ways, and even then most men disdain everything but unbelief,\n",
        "TRANSLATION_2": "We have explained things for people in this Qur'an in diverse ways to make them understand the Message, yet most people obstinately persist in unbelief.\n",
        "TRANSLATION_3": "We have mentioned in this Quran all kinds of examples for the human being, but most human beings turn away in disbelief.\n",
        "TRANSLATION_4": "And indeed We have illustrated all kinds of examples in the Qur’an for mankind – so most men did not accept, except to be ungrateful.\n",
        "TRANSLATION_5": "And indeed We have fully explained to mankind, in this Qur'an, every kind of similitude, but most of mankind refuse (the truth and accept nothing) but disbelief.\n",
        "TRANSLATION_6": "And certainly We have explained for men in this Quran every kind of similitude, but most men do not consent to aught but denying.\n",
        "TRANSLATION_7": "We have indeed turned about for men in this Koran every manner of similitude; yet most men refuse all but unbelief.\n",
        "TRANSLATION_8": "And verily We have displayed for mankind in this Qur'an all kind of similitudes, but most of mankind refuse aught save disbelief.\n",
        "TRANSLATION_9": "In this Quran, We have set out all kinds of examples for people, yet most of them persist in denying the truth.\n",
        "TRANSLATION_10": "And assuredly We have variously propounded for mankind in this Qur'an every kind of similitude, yet most men have refused everything except infidelity.\n",
        "TRANSLATION_11": "We have certainly interspersed this Quran with every [kind of] parable for the people, but most people are only intent on ingratitude.\n",
        "TRANSLATION_12": "And We have explained to man, in this Qur'an, every kind of similitude: yet the greater part of men refuse (to receive it) except with ingratitude!\n",
        "TRANSLATION_13": "And indeed We have fully explained to mankind, in this Quran, every kind of similitude, but most mankind refuse (the truth and accept nothing) but disbelief.\n",
        "TRANSLATION_14": "Indeed, We have set forth for mankind in this Koran every kind of parable, yet most people refuse all except disbelief.\n",
        "TRANSLATION_15": "We have displayed for mankind in this Quran every kind of similitude, but most people insist on denying the truth.\n",
        "TRANSLATION_16": "And We have certainly diversified for the people in this Qur'an from every [kind] of example, but most of the people refused [anything] except disbelief.\n",
        "TRANSLATION_17": "[17:89]   And verily We have dispensed, explained, for people in this Qur’ān every [kind of] similitude (min kulli mathalin, [this] is an adjectival qualification of an omitted clause, in other words, [‘We have dispensed] a similitude from every kind of similitude’), that they might be admonished; but most people, that is, the people of Mecca, insist on disbelieving, on denying the truth.\n",
        "TRANSLATION_18": "(And verily We have displayed for mankind) We have exposited for the people of Mecca (in this Qur'an all kinds or similitudes) parables of all sorts, such as threats and promises, (but most of mankind refuse aught save disbelief) they refused to submit and remained firm in their disbelief.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "17:89",
            "39:27",
            "18:54",
            "30:58",
            "25:50",
            "54:40",
            "54:32",
            "54:22",
            "54:17",
            "17:41"
        ],
        "BIBLE": [
            "torah:exodus:36:6",
            "prophets:isaiah:29:21",
            "torah:leviticus:10:17",
            "torah:numbers:16:30",
            "prophets:i%20kings:8:33",
            "prophets:ii%20samuel:22:36",
            "prophets:ezekiel:3:20",
            "writings:esther:4:8",
            "torah:deuteronomy:28:29",
            "writings:i%20chronicles:29:14"
        ]
    }
}