{
    "VERSE": "17:90",
    "ARABIC": "وَقَالُوا۟ لَن نُّؤْمِنَ لَكَ حَتَّىٰ تَفْجُرَ لَنَا مِنَ ٱلْأَرْضِ يَنۢبُوعًا",
    "ENGLISH": {
        "TRANSLATION_0": "They say, 'We will not believe you until you make a spring gush out from the earth for us;",
        "TRANSLATION_1": "And say: \"We will not believe you until you make a spring of water gush forth from the earth for us;\n",
        "TRANSLATION_2": "They said: \"We shall not accept your Message until you cause a spring to gush forth for us from the earth;\n",
        "TRANSLATION_3": "They have said, \"We shall never believe you until you cause a spring to gush forth from the earth,\n",
        "TRANSLATION_4": "And they said, “We will not accept faith in you, until you cause a spring to gush forth from the earth for us.”\n",
        "TRANSLATION_5": "And they say: \"We shall not believe in you, until you cause a spring to gush forth from the earth for us;\"\n",
        "TRANSLATION_6": "And they say: We will by no means believe in you until you cause a fountain to gush forth from the earth for us.\n",
        "TRANSLATION_7": "They say, 'We will not believe thee till thou makest a spring to gush forth from the earth for us,\n",
        "TRANSLATION_8": "And they say: We will not put faith in thee till thou cause a spring to gush forth from the earth for us;\n",
        "TRANSLATION_9": "They declare, \"We will never believe in you until you cause a spring to flow for us from the earth;\n",
        "TRANSLATION_10": "And they say: we shall by no means believe in thee until thou causest for us to gush forth from the earth a foun tain.\n",
        "TRANSLATION_11": "They say, ‘We will not believe you until you make a spring gush forth for us from the ground.\n",
        "TRANSLATION_12": "They say: \"We shall not believe in thee, until thou cause a spring to gush forth for us from the earth,\n",
        "TRANSLATION_13": "And they say: \"We shall not believe in you (O Muhammad SAW), until you cause a spring to gush forth from the earth for us;\n",
        "TRANSLATION_14": "They say: 'We will not believe in you until you make a spring gush from the earth for us,\n",
        "TRANSLATION_15": "And they said, “We will not believe in you unless you make a spring burst from the ground for us.\n",
        "TRANSLATION_16": "And they say, \"We will not believe you until you break open for us from the ground a spring.\n",
        "TRANSLATION_17": "[17:90] And they say (wa-qālū is a supplement to abā [illā], ‘insist on’), ‘We will not believe you until you make gush forth for us from the ground a spring, from which water issues forth;\n",
        "TRANSLATION_18": "(And they say) i.e. 'Abdullah Ibn Umayyah al-Makhzumi and his host: (We will not put faith in thee) we will not believe you (till thou cause a spring to gush forth from the earth for us) from the earth of Mecca for us;\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "17:90",
            "26:152",
            "55:10",
            "38:28",
            "79:30",
            "91:6",
            "30:3",
            "28:6",
            "84:3",
            "23:84"
        ],
        "BIBLE": [
            "torah:deuteronomy:5:8",
            "torah:exodus:20:4",
            "prophets:isaiah:41:18",
            "prophets:jeremiah:51:36",
            "writings:i%20chronicles:21:3",
            "torah:numbers:5:22",
            "torah:exodus:34:10",
            "prophets:ii%20samuel:3:13",
            "prophets:isaiah:58:11",
            "writings:daniel:9:22"
        ]
    }
}