{
    "VERSE": "17:92",
    "ARABIC": "أَوْ تُسْقِطَ ٱلسَّمَآءَ كَمَا زَعَمْتَ عَلَيْنَا كِسَفًا أَوْ تَأْتِىَ بِٱللَّهِ وَٱلْمَلَٰٓئِكَةِ قَبِيلًا",
    "ENGLISH": {
        "TRANSLATION_0": "or make the sky, as you claim, fall down on us in lumps; or bring Allah and the angels here as a guarantee;",
        "TRANSLATION_1": "Or, let chunks of sky fall over us, as you assert (you will); or, bring God and the angels as a surety;\n",
        "TRANSLATION_2": "or cause the sky to fall on us in pieces as you claimed, or bring Allah and the angels before us, face to face;\n",
        "TRANSLATION_3": "or cause the sky to fall into pieces on us - as you believe you can - or bring God and the angels face to face with us,\n",
        "TRANSLATION_4": "“Or you cause the sky to fall upon us in pieces like you said – or bring Allah and the angels as Witness.”\n",
        "TRANSLATION_5": "Or you cause the heaven to fall upon us in pieces, as you have pretended, or you bring Allah and the angels before (us) face to face;\"\n",
        "TRANSLATION_6": "Or you should cause the heaven to come down upon us in pieces as you think, or bring Allah and the angels face to face (with us).\n",
        "TRANSLATION_7": "or till thou makest heaven to fall, as thou assertest, on us in fragments, or thou bringest God and the angels as a surety,\n",
        "TRANSLATION_8": "Or thou cause the heaven to fall upon us piecemeal, as thou hast pretended, or bring Allah and the angels as a warrant;\n",
        "TRANSLATION_9": "or you cause the heavens to fall down on us in pieces, as you have claimed; or you bring God and the angels before us face to face;\n",
        "TRANSLATION_10": "Or thou causest the heaven to fall upon us, as thou assertest, in pieces, or thou bringest God and the angels face to face.\n",
        "TRANSLATION_11": "Or until you cause the sky to fall in fragments upon us, just as you have averred. Or until you bring Allah and the angels [right] in front of us.\n",
        "TRANSLATION_12": "Or thou cause the sky to fall in pieces, as thou sayest (will happen), against us; or thou bring Allah and the angels before (us) face to face:\n",
        "TRANSLATION_13": "Or you cause the heaven to fall upon us in pieces, as you have pretended, or you bring Allah and the angels before (us) face to face;\n",
        "TRANSLATION_14": "or, until you cause the sky to fall upon us in pieces, as you have claimed, or, as a surety bring Allah with the angels in front;\n",
        "TRANSLATION_15": "Or make the sky fall on us in pieces, as you claim, or bring God and the angels before us.\n",
        "TRANSLATION_16": "Or you make the heaven fall upon us in fragments as you have claimed or you bring Allah and the angels before [us]\n",
        "TRANSLATION_17": "[17:92] or until you cause the heaven to fall upon us, as you assert, in pieces, or bring God and the angels [right] in front [of us], face to face [with us], before [our] very eyes, so that we might see them;\n",
        "TRANSLATION_18": "(Or thou cause the heaven to fall upon us piecemeal) as a punishment, (as thou hast pretended, or bring Allah and the angels as a warrant) as witnesses for what you say;\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "17:92",
            "16:49",
            "16:33",
            "57:5",
            "26:187",
            "53:26",
            "6:111",
            "4:132",
            "24:42",
            "14:38"
        ],
        "BIBLE": [
            "torah:deuteronomy:30:12",
            "writings:nehemiah:2:4",
            "torah:deuteronomy:30:13",
            "prophets:i%20samuel:18:25",
            "prophets:ii%20samuel:3:13",
            "torah:exodus:23:13",
            "torah:genesis:31:44",
            "prophets:ezekiel:11:13",
            "prophets:ii%20samuel:13:6",
            "writings:proverbs:11:5"
        ]
    }
}