{
    "VERSE": "17:94",
    "ARABIC": "وَمَا مَنَعَ ٱلنَّاسَ أَن يُؤْمِنُوٓا۟ إِذْ جَآءَهُمُ ٱلْهُدَىٰٓ إِلَّآ أَن قَالُوٓا۟ أَبَعَثَ ٱللَّهُ بَشَرًا رَّسُولًا",
    "ENGLISH": {
        "TRANSLATION_0": "Nothing prevents people from having iman when guidance comes to them but the fact that they say, 'Has Allah sent a human being as Messenger?'",
        "TRANSLATION_1": "Nothing prevented men from believing when guidance came to them, other than (what) they said: \"Has God sent (only) a man as messenger?\"\n",
        "TRANSLATION_2": "Whenever Guidance came to people, nothing prevented them from believing except that they said: \"Has Allah sent a human being as a Messenger?\"\n",
        "TRANSLATION_3": "What keeps people from belief that guidance has come to them, but they question, \"Why has God sent a mortal Messenger?\"\n",
        "TRANSLATION_4": "And what prevented people from believing when the guidance came to them, except their saying that, “What! Allah has sent a human as a Noble Messenger?”?\n",
        "TRANSLATION_5": "And nothing prevented men from believing when the guidance came to them, except that they said: \"Has Allah sent a man as (His) Messenger\"\n",
        "TRANSLATION_6": "And nothing prevented people from believing when the guidance came to them except that they said: What! has Allah raised up a mortal to be an apostle?\n",
        "TRANSLATION_7": "And naught prevented men from believing when the guidance came to them, but that they said, 'Has God sent forth a mortal as Messenger?'\n",
        "TRANSLATION_8": "And naught prevented mankind from believing when the guidance came unto them save that they said: Hath Allah sent a mortal as (His) messenger?\n",
        "TRANSLATION_9": "Nothing has prevented men from believing whenever guidance came to them, save their query, \"Has God sent a human being as a messenger?\"\n",
        "TRANSLATION_10": "And naught hath prevented men from believing when the guidance came Unto them except that they said: hath God sent a human being as apostle?\n",
        "TRANSLATION_11": "Nothing has kept these people from believing when guidance came to them, but their saying, ‘Has Allah sent a human as an apostle?!’\n",
        "TRANSLATION_12": "What kept men back from belief when Guidance came to them, was nothing but this: they said, \"Has Allah sent a man (like us) to be (His) Messenger?\"\n",
        "TRANSLATION_13": "And nothing prevented men from believing when the guidance came to them, except that they said: \"Has Allah sent a man as (His) Messenger?\"\n",
        "TRANSLATION_14": "Nothing prevented people from believing when guidance came to them but (the excuse): 'Has Allah sent a human as a Messenger'\n",
        "TRANSLATION_15": "Nothing prevented the people from believing, when guidance has come to them, except that they said, “Did God send a human messenger?”\n",
        "TRANSLATION_16": "And what prevented the people from believing when guidance came to them except that they said, \"Has Allah sent a human messenger?\"\n",
        "TRANSLATION_17": "[17:94] And nothing prevented mankind from believing when guidance came to them, but that they said, that is, [except] their saying in denial: ‘Has God sent a human as a messenger [from Him]?’, instead of sending an angel.\n",
        "TRANSLATION_18": "(And naught prevented mankind) the people of Mecca (from believing) in Allah (when the guidance) Muhammad (pbuh) and the Qur'an (came unto them save that they said) these words: (Hath Allah sent a mortal as (His) messenger) to us?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "17:94",
            "18:55",
            "33:22",
            "4:108",
            "3:132",
            "24:51",
            "5:99",
            "29:2",
            "14:11",
            "110:2"
        ],
        "BIBLE": [
            "prophets:i%20kings:13:21",
            "torah:numbers:22:9",
            "prophets:judges:13:6",
            "torah:numbers:22:20",
            "prophets:i%20samuel:2:27",
            "prophets:i%20samuel:11:4",
            "torah:numbers:9:7",
            "prophets:ii%20samuel:16:16",
            "writings:ii%20chronicles:11:2",
            "prophets:i%20kings:17:18"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:11",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:3:5"
        ]
    }
}