{
    "VERSE": "17:95",
    "ARABIC": "قُل لَّوْ كَانَ فِى ٱلْأَرْضِ مَلَٰٓئِكَةٌ يَمْشُونَ مُطْمَئِنِّينَ لَنَزَّلْنَا عَلَيْهِم مِّنَ ٱلسَّمَآءِ مَلَكًا رَّسُولًا",
    "ENGLISH": {
        "TRANSLATION_0": "Say: 'If there had been angels on the earth going about in peace, We would have sent down to them an angel from heaven as Messenger.'",
        "TRANSLATION_1": "Say: \"If angels had peopled the earth and walked about in peace and quiet, We would surely have sent to them an angel as messenger.\n",
        "TRANSLATION_2": "Say: \"Had angels been walking about in peace on the earth, We would surely have sent to them an angel from the heavens as Messenger.\"\n",
        "TRANSLATION_3": "(Muhammad), say, \"Had the earth been inhabited by angels who would walk serenely therein, only then would We have sent to them angelic Messengers\".\n",
        "TRANSLATION_4": "Proclaim, “If there were angels walking peacefully on the earth, We would send down only an angel from heaven, as a Noble Messenger towards them.”\n",
        "TRANSLATION_5": "Say: \"If there were on the earth, angels walking about in peace and security, We should certainly have sent down for them from the heaven an angel as a Messenger.\"\n",
        "TRANSLATION_6": "Say: Had there been in the earth angels walking about as settlers, We would certainly have sent down to them from the heaven an angel as an apostle.\n",
        "TRANSLATION_7": "Say: 'Had there been in the earth angels walking. at peace, We would have sent down upon them out of heaven an angel as Messenger.'\n",
        "TRANSLATION_8": "Say: If there were in the earth angels walking secure, We had sent down for them from heaven an angel as messenger.\n",
        "TRANSLATION_9": "Say, \"If there had been angels walking around on earth, We would have sent an angel down from Heaven as a messenger for them.\"\n",
        "TRANSLATION_10": "Say thou: were there in the earth angels walking about contentedly, We would surely have sent down unto them from the heaven an angel as an apostle.\n",
        "TRANSLATION_11": "Say, ‘Had there been angels in the earth, walking around and residing [in it like humans do], We would have sent down to them an angel from the heaven as apostle.’\n",
        "TRANSLATION_12": "Say, \"If there were settled, on earth, angels walking about in peace and quiet, We should certainly have sent them down from the heavens an angel for a messenger.\"\n",
        "TRANSLATION_13": "Say: \"If there were on the earth, angels walking about in peace and security, We should certainly have sent down for them from the heaven an angel as a Messenger.\"\n",
        "TRANSLATION_14": "Say: 'Had there been angels walking at peace in the earth, We would have sent down an angel from heaven to them as a Messenger'\n",
        "TRANSLATION_15": "Say, “If there were angels on earth, walking around in peace, We would have sent down to them from heaven an angel messenger.”\n",
        "TRANSLATION_16": "Say, \"If there were upon the earth angels walking securely, We would have sent down to them from the heaven an angel [as a] messenger.\"\n",
        "TRANSLATION_17": "[17:95] Say, to them: ‘Had there been in the earth, instead of humans, angels, walking [and living] secure, We would have sent down to them from the heaven an angel as Messenger’, for when a messenger is sent to a people he is [always] of their kind, so that they are able to speak to him and understand from him [his message].\n",
        "TRANSLATION_18": "(Say) Muhammad, to the people of Mecca: (If there were in the earth angels walking secure, We had sent down for them from heaven an angel as messenger) for we send angel messengers only to angels and human messengers to humans.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "17:95",
            "43:60",
            "44:29",
            "16:49",
            "6:75",
            "12:105",
            "14:13",
            "57:5",
            "30:26",
            "23:18"
        ],
        "BIBLE": [
            "prophets:jeremiah:10:11",
            "writings:job:1:7",
            "writings:job:2:2",
            "prophets:zechariah:1:11",
            "writings:daniel:4:32",
            "prophets:isaiah:45:18",
            "writings:ii%20chronicles:25:16",
            "prophets:hosea:2:25",
            "prophets:zechariah:1:10",
            "torah:numbers:22:5"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:4:3"
        ]
    }
}