{
    "VERSE": "17:96",
    "ARABIC": "قُلْ كَفَىٰ بِٱللَّهِ شَهِيدًۢا بَيْنِى وَبَيْنَكُمْ إِنَّهُۥ كَانَ بِعِبَادِهِۦ خَبِيرًۢا بَصِيرًا",
    "ENGLISH": {
        "TRANSLATION_0": "Say: 'Allah is a sufficient witness between me and you. He is certainly aware of and sees His slaves.'",
        "TRANSLATION_1": "Tell them: \"God is sufficient witness between me and you, for He knows His creatures well, and is well-informed.\"\n",
        "TRANSLATION_2": "Tell them, (O Prophet): \"Allah suffices as a witness between me and you. Allah is well aware and fully observes everything pertaining to His servants.\"\n",
        "TRANSLATION_3": "Say, \"God is a sufficient Witness between me and you. He certainly sees and knows all about His servants.\n",
        "TRANSLATION_4": "Proclaim, “Allah is Sufficient as Witness between me and you all; indeed He is Well Aware of, the Beholder of His bondmen.”\n",
        "TRANSLATION_5": "Say: \"Sufficient is Allah for a witness between me and you. Verily, He is Ever the All-Knower, the All-Seer of His servants.\"\n",
        "TRANSLATION_6": "Say: Allah suffices as a witness between me and you; surely He is Aware of His servants, Seeing.\n",
        "TRANSLATION_7": "Say: 'God suffices as a witness between me and you; surely He is aware of and sees His servants.'\n",
        "TRANSLATION_8": "Say: Allah sufficeth for a witness between me and you. Lo! He is Knower, Seer of His slaves.\n",
        "TRANSLATION_9": "Say, \"God suffices as a witness between me and you [all]. He is informed about and observant of His servants.\"\n",
        "TRANSLATION_10": "Say thou: Allah sufficeth as a witness between me and you; verily He is in respect of His bondmen ever the Aware, the Beholder.\n",
        "TRANSLATION_11": "Say, ‘Allah suffices as witness between me and you. Indeed He is well aware His servants and a keen observer.’\n",
        "TRANSLATION_12": "Say: \"Enough is Allah for a witness between me and you: for He is well acquainted with His servants, and He sees (all things).\n",
        "TRANSLATION_13": "Say: \"Sufficient is Allah for a witness between me and you. Verily! He is the All-Knower, the All-Seer of His slaves.\"\n",
        "TRANSLATION_14": "Say: 'Allah is sufficient as a witness between me and you. He knows and observes His worshipers'\n",
        "TRANSLATION_15": "Say, “God is enough witness between you and me. He is fully aware of His servants, and He sees them well.”\n",
        "TRANSLATION_16": "Say, \"Sufficient is Allah as Witness between me and you. Indeed he is ever, concerning His servants, Acquainted and Seeing.\"\n",
        "TRANSLATION_17": "[17:96] Say: ‘God suffices as a witness between me and you, of my sincerity. Truly He is Aware, Seer of His servants’, Knower of what they hide and what they manifest.\n",
        "TRANSLATION_18": "(Say) Muhammad, to the people of Mecca: (Allah sufficeth for a witness between me and you) that I am a messenger to you (Lo! He is) in relation to sending messengers to His servants (Knower, Seer of His slaves) those who believe and those who do not.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "17:96",
            "10:29",
            "35:31",
            "40:44",
            "42:27",
            "13:43",
            "4:35",
            "29:52",
            "76:6",
            "17:30"
        ],
        "BIBLE": [
            "prophets:isaiah:42:20",
            "writings:i%20chronicles:29:17",
            "prophets:i%20kings:18:36",
            "torah:genesis:22:12",
            "prophets:isaiah:30:10",
            "prophets:ezekiel:16:30",
            "writings:daniel:4:6",
            "prophets:ezekiel:13:3",
            "torah:deuteronomy:10:21",
            "writings:daniel:2:47"
        ]
    }
}