{
    "VERSE": "17:99",
    "ARABIC": "أَوَلَمْ يَرَوْا۟ أَنَّ ٱللَّهَ ٱلَّذِى خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلْأَرْضَ قَادِرٌ عَلَىٰٓ أَن يَخْلُقَ مِثْلَهُمْ وَجَعَلَ لَهُمْ أَجَلًا لَّا رَيْبَ فِيهِ فَأَبَى ٱلظَّٰلِمُونَ إِلَّا كُفُورًا",
    "ENGLISH": {
        "TRANSLATION_0": "Do they not see that Allah, Who created the heavens and earth, has the power to create the like of them, and has appointed fixed terms for them of which there is no doubt? But the wrongdoers still spurn anything but kufr.",
        "TRANSLATION_1": "Do they not perceive that God, who created the heavens and the earth, has the power to create the like of them? There is no doubt that. He has fixed a term for them. Even then the wicked disdain everything but unbelief.\n",
        "TRANSLATION_2": "Have they not perceived that Allah, Who has created the heavens and the earth, has the power to create the like of them? He has fixed a term for them about which there is no doubt. And yet the wrong-doers obstinately persist in unbelief.\n",
        "TRANSLATION_3": "Do they not realize that God, who has created the heavens and the earth, has the power to create their like? He has given them life for an appointed time of which there is no doubt. The unjust turn away in disbelief (from Our revelation).\n",
        "TRANSLATION_4": "Do they not see that Allah Who has created the heavens and the earth is Able to create people similar to them, and has set a term for them in which there is no doubt? So the unjust do not accept without being ungrateful.\n",
        "TRANSLATION_5": "See they not that Allah, Who created the heavens and the earth, is able to create the like of them. And He has decreed for them an appointed term, whereof there is no doubt. But the wrongdoers refuse but disbelief.\n",
        "TRANSLATION_6": "Do they not consider that Allah, Who created the heavens and the earth, is able to create their like, and He has appointed for them a doom about which there is no doubt? But the unjust do not consent to aught but denying.\n",
        "TRANSLATION_7": "Have they not seen that God, who created the heavens and earth, is powerful to create the like of them? He has appointed for them a term, no doubt of it; yet the unbelievers refuse all but unbelief.\n",
        "TRANSLATION_8": "Have they not seen that Allah Who created the heavens and the earth is Able to create the like of them, and hath appointed for them an end whereof there is no doubt? But the wrong-doers refuse aught save disbelief.\n",
        "TRANSLATION_9": "Do they not see that God, who has created heavens and earth, is able to create the like of them? He has appointed a definite term for them; there is no doubt about it, but the wrongdoers persist in denying the truth.\n",
        "TRANSLATION_10": "Behold they not that Allah who created the heavens and the earth is Able to create their likes? And He hath appointed for them a term whereof there is no doubt; yet the wrong-doers have refused everything excepting infidelity.\n",
        "TRANSLATION_11": "Do they not see that Allah, who created the heavens and the earth, is able to create the like of them? He has appointed for them a term, in which there is no doubt; yet the wrongdoers are only intent on ingratitude.\n",
        "TRANSLATION_12": "See they not that Allah, Who created the heavens and the earth, has power to create the like of them (anew)? Only He has decreed a term appointed, of which there is no doubt. But the unjust refuse (to receive it) except with ingratitude.\n",
        "TRANSLATION_13": "See they not that Allah, Who created the heavens and the earth, is Able to create the like of them. And He has decreed for them an appointed term, whereof there is not doubt. But the Zalimun (polytheists and wrong-doers, etc.) refuse (the truth the Message of Islamic Monotheism, and accept nothing) but disbelief.\n",
        "TRANSLATION_14": "Have they not seen that Allah, who has created the heavens and the earth, has power to create their like? There is no doubt that He has appointed for them aterm, yet the unbelievers refuse all but disbelief.\n",
        "TRANSLATION_15": "Do they not consider that God, Who created the heavens and the earth, is Able to create the likes of them? He has assigned for them a term, in which there is no doubt. But the wrongdoers persist in denying the truth.\n",
        "TRANSLATION_16": "Do they not see that Allah, who created the heavens and earth, is [the one] Able to create the likes of them? And He has appointed for them a term, about which there is no doubt. But the wrongdoers refuse [anything] except disbelief.\n",
        "TRANSLATION_17": "[17:99] Have they not seen, realised, that God, [He] Who created the heavens and the earth, with all their immensity, has the power to create the like of them?, that is, [the like of] these human beings, [especially] given their smallness? He has appointed for them a term, until [the time for their] death and resurrection, whereof is no doubt; yet the wrongdoers insist on disbelief, on denial of such [a term].\n",
        "TRANSLATION_18": "(Have they) i.e. the people of Mecca (not seen that Allah Who created the heavens and the earth is Able to create) to revive (the like of them, and has appointed for them an end) a term (whereof there is no doubt) as far as the believers are concerned? (But the wrong-doers) the idolaters (refuse aught save disbelief) they rejected this and stayed firm in their disbelief.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "17:99",
            "7:185",
            "27:65",
            "27:25",
            "14:10",
            "6:12",
            "3:5",
            "30:8",
            "22:70",
            "47:10"
        ],
        "BIBLE": [
            "writings:ecclesiastes:5:17",
            "prophets:jeremiah:25:31",
            "prophets:jeremiah:51:16",
            "torah:leviticus:10:17",
            "writings:ecclesiastes:3:11",
            "prophets:judges:20:36",
            "writings:ecclesiastes:3:10",
            "prophets:ezekiel:18:13",
            "torah:deuteronomy:26:10",
            "writings:ezra:9:13"
        ]
    }
}