{
    "VERSE": "44:10",
    "ARABIC": "فَٱرْتَقِبْ يَوْمَ تَأْتِى ٱلسَّمَآءُ بِدُخَانٍ مُّبِينٍ",
    "ENGLISH": {
        "TRANSLATION_0": "So be on the watch for a day when heaven brings forth a distinctive smoke,",
        "TRANSLATION_1": "So watch for the day when the sky begins to emit clear smoke,\n",
        "TRANSLATION_2": "So watch for the Day when the sky will come down with a pall of smoke,\n",
        "TRANSLATION_3": "Wait for the day (which will come before the Day of Judgment) when the sky will give out dense smoke\n",
        "TRANSLATION_4": "So you await the day when the sky will bring forth a visible smoke. –\n",
        "TRANSLATION_5": "Then wait you for the Day when the sky will bring forth a visible smoke,\n",
        "TRANSLATION_6": "Therefore keep waiting for the day when the heaven shall bring an evident smoke,\n",
        "TRANSLATION_7": "So be on the watch for a day when heaven shall bring a manifest smoke\n",
        "TRANSLATION_8": "But watch thou (O Muhammad) for the day when the sky will produce visible smoke\n",
        "TRANSLATION_9": "Wait, then, for the Day when the sky brings forth plainly visible clouds of smoke.\n",
        "TRANSLATION_10": "So wait thou day whereon the heaven will bring forth a manifest smoke:\n",
        "TRANSLATION_11": "So watch out for the day when the sky brings on a manifest smoke,\n",
        "TRANSLATION_12": "Then watch thou for the Day that the sky will bring forth a kind of smoke (or mist) plainly visible,\n",
        "TRANSLATION_13": "Then wait you for the Day when the sky will bring forth a visible smoke.\n",
        "TRANSLATION_14": "Watch for the Day when the heaven will bring clear smoke,\n",
        "TRANSLATION_15": "So watch out for the Day when the sky produces a visible smoke.\n",
        "TRANSLATION_16": "Then watch for the Day when the sky will bring a visible smoke.\n",
        "TRANSLATION_17": "[44:10] God, exalted be He, says: So watch out for the day when the heaven will produce a visible smoke. Thus the earth became barren and famine became so severe that they began to see what looked like smoke rising between the heaven and the earth,\n",
        "TRANSLATION_18": "(But watch thou for) their torment, Muhammad, on (the day when the sky will produce visible smoke) filling what is between the sky and the earth\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "44:10",
            "52:9",
            "70:8",
            "25:25",
            "79:6",
            "74:46",
            "83:11",
            "69:16",
            "36:64",
            "73:18"
        ],
        "BIBLE": [
            "prophets:ezekiel:38:16",
            "torah:leviticus:23:15",
            "writings:psalms:55:24",
            "torah:leviticus:23:27",
            "torah:deuteronomy:4:38",
            "prophets:isaiah:4:5",
            "prophets:jeremiah:51:47",
            "torah:deuteronomy:2:25",
            "writings:psalms:144:5",
            "torah:numbers:28:26"
        ]
    }
}