{
    "VERSE": "44:12",
    "ARABIC": "رَّبَّنَا ٱكْشِفْ عَنَّا ٱلْعَذَابَ إِنَّا مُؤْمِنُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Our Lord, remove the punishment from us. We are really muminun.'",
        "TRANSLATION_1": "O Lord, take away this torment from us,\" (they will pray); \"we have come to believe.\"\n",
        "TRANSLATION_2": "(People will then say): “Our Lord, remove this scourge from us; we shall believe.”\n",
        "TRANSLATION_3": "Lord, remove this torment from us for we are believers\".\n",
        "TRANSLATION_4": "Thereupon they will say, “O our Lord! Remove the punishment from us – we now accept faith.”\n",
        "TRANSLATION_5": "(They will say): \"Our Lord! Remove the torment from us, really we shall become believers!\"\n",
        "TRANSLATION_6": "Our Lord! remove from us the punishment; surely we are believers.\n",
        "TRANSLATION_7": "O our Lord, remove Thou from us the chastisement; we are believers.'\n",
        "TRANSLATION_8": "(Then they will say): Our Lord relieve us of the torment. Lo! we are believers.\n",
        "TRANSLATION_9": "Then they will say, \"Lord, relieve us from this torment, for truly we are now believers in You.\"\n",
        "TRANSLATION_10": "Our Lord! remove from us the torment, verily we shall become believers.\n",
        "TRANSLATION_11": "Our Lord! Remove this punishment from us. Indeed we have believed!’\n",
        "TRANSLATION_12": "(They will say:) \"Our Lord! remove the Penalty from us, for we do really believe!\"\n",
        "TRANSLATION_13": "(They will say): \"Our Lord! Remove the torment from us, really we shall become believers!\"\n",
        "TRANSLATION_14": "Our Lord, remove this punishment from us, we are believers'\n",
        "TRANSLATION_15": "“Our Lord, lift the torment from us, we are believers.”\n",
        "TRANSLATION_16": "[They will say], \"Our Lord, remove from us the torment; indeed, we are believers.\"\n",
        "TRANSLATION_17": "[44:12] Our Lord, relieve us from the chastisement; indeed we have believed’, we have [now] affirmed the sincerity of Your Prophet.\n",
        "TRANSLATION_18": "((Then they will say): Our Lord relieve us of the torment) remove from us hunger. (Lo! we are believers) in You as well as in Your Messenger and Scripture:\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "44:12",
            "52:7",
            "25:65",
            "3:16",
            "23:76",
            "7:125",
            "70:28",
            "43:50",
            "70:27",
            "43:74"
        ],
        "BIBLE": [
            "prophets:ii%20samuel:24:10",
            "prophets:jeremiah:4:10",
            "prophets:ezekiel:36:7",
            "writings:job:22:29",
            "prophets:jeremiah:23:33",
            "prophets:joshua:7:13",
            "torah:numbers:21:7",
            "prophets:hosea:2:25",
            "prophets:jeremiah:16:10",
            "torah:genesis:27:38"
        ]
    }
}