{
    "VERSE": "44:13",
    "ARABIC": "أَنَّىٰ لَهُمُ ٱلذِّكْرَىٰ وَقَدْ جَآءَهُمْ رَسُولٌ مُّبِينٌ",
    "ENGLISH": {
        "TRANSLATION_0": "How can they expect a Reminder when a clear Messenger has already come to them?",
        "TRANSLATION_1": "How can a warning benefit them? The Apostle who explained all things clearly had come to them,\n",
        "TRANSLATION_2": "But how will they take heed? Such are they that a Messenger came to them clearly expounding the Truth,\n",
        "TRANSLATION_3": "How could this punishment bring them to their senses when a Messenger evidently had come to them,\n",
        "TRANSLATION_4": "How is it possible for them to accept guidance, whereas a Noble Messenger who speaks clearly has already come to them?\n",
        "TRANSLATION_5": "How can there be for them an admonition, when a Messenger explaining things clearly has already come to them.\n",
        "TRANSLATION_6": "How shall they be reminded, and there came to them an Apostle making clear (the truth),\n",
        "TRANSLATION_7": "How should they have the Reminder, seeing a clear Messenger already came to them,\n",
        "TRANSLATION_8": "How can there be remembrance for them, when a messenger making plain (the Truth) had already come unto them,\n",
        "TRANSLATION_9": "How can they benefit from admonition, seeing that a messenger had already come to them explaining things clearly?\n",
        "TRANSLATION_10": "How can there be an admonition Unto them, when surely there came Unto them an apostle manifest!\n",
        "TRANSLATION_11": "What will the admonition avail them, when a manifest apostle had already come to them,\n",
        "TRANSLATION_12": "How shall the message be (effectual) for them, seeing that an Messenger explaining things clearly has (already) come to them,-\n",
        "TRANSLATION_13": "How can there be for them an admonition (at the time when the torment has reached them), when a Messenger explaining things clearly has already come to them.\n",
        "TRANSLATION_14": "But how will they avail themselves of the Reminder, when a clear Messenger had already come to them\n",
        "TRANSLATION_15": "But how can they be reminded? An enlightening messenger has already come to them.\n",
        "TRANSLATION_16": "How will there be for them a reminder [at that time]? And there had come to them a clear Messenger.\n",
        "TRANSLATION_17": "[44:13] God, exalted be He, says: How can there be a reminder for them, that is to say, faith will not benefit them once the chastisement has been sent down, when already there has come to them a manifest Messenger, whose Message is plain [to understand],\n",
        "TRANSLATION_18": "(How can there be remembrance for them) how can they take admonition or repent if We were to remove the torment from them; and it is also said: how can they take admonition or repent if We were to destroy 575 them at Badr; and it is also said: on the Day of Judgement, (when a messenger) Muhammad (pbuh) (making plain (the Truth)) in a language they understand (had already come unto them,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "44:13",
            "89:23",
            "53:21",
            "47:18",
            "77:11",
            "16:113",
            "99:3",
            "4:80",
            "5:75",
            "23:69"
        ],
        "BIBLE": [
            "torah:genesis:40:14",
            "writings:daniel:5:15",
            "torah:deuteronomy:32:35",
            "prophets:ii%20samuel:15:20",
            "torah:exodus:20:21",
            "torah:leviticus:11:43",
            "torah:deuteronomy:13:15",
            "prophets:ii%20samuel:3:13",
            "torah:exodus:23:13",
            "writings:daniel:6:13"
        ]
    }
}