{
    "VERSE": "44:15",
    "ARABIC": "إِنَّا كَاشِفُوا۟ ٱلْعَذَابِ قَلِيلًا إِنَّكُمْ عَآئِدُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "We remove the punishment a little, and you revert!",
        "TRANSLATION_1": "If We remove the torment a little, you revert back (to misdeeds).\n",
        "TRANSLATION_2": "Yet We will hold the scourge back for a while, (but no sooner than We will do so) you will revert to your old ways.\n",
        "TRANSLATION_3": "We shall remove the torment for a while but you will revert to your old ways.\n",
        "TRANSLATION_4": "We now remove the punishment for some days – so you will again commit the same.\n",
        "TRANSLATION_5": "Verily, We shall remove the torment for a while. Verily, you will revert.\n",
        "TRANSLATION_6": "Surely We will remove the punishment a little, (but) you will surely return (to evil).\n",
        "TRANSLATION_7": "Behold, We are removing the chastisement a little; behold, you revert!'\n",
        "TRANSLATION_8": "Lo! We withdraw the torment a little. Lo! ye return (to disbelief).\n",
        "TRANSLATION_9": "Were We to ease the torment for a while, you would still revert to denial of the truth.\n",
        "TRANSLATION_10": "Verily We shall remove the torment for a while; but verily ye shall revert.\n",
        "TRANSLATION_11": "Indeed We will withdraw the punishment a little; but you will revert [to your earlier ways].\n",
        "TRANSLATION_12": "We shall indeed remove the Penalty for a while, (but) truly ye will revert (to your ways).\n",
        "TRANSLATION_13": "Verily, We shall remove the torment for a while. Verily! You will revert.\n",
        "TRANSLATION_14": "We are removing the punishment a little, but you revert.\n",
        "TRANSLATION_15": "We will ease the punishment a little, but you will revert.\n",
        "TRANSLATION_16": "Indeed, We will remove the torment for a little. Indeed, you [disbelievers] will return [to disbelief].\n",
        "TRANSLATION_17": "[44:15] ‘Indeed We will remove the chastisement, the famine from you [for], a little, time; and so it was removed from them. [But] you will indeed revert!’, to your disbelief — and they did.\n",
        "TRANSLATION_18": "(Lo! We withdraw the torment) hunger (a little) until the Day of Badr. (Lo! ye) people of Mecca (return) to transgression. And when the torment was removed from them, they did indeed return to transgression, and so Allah destroyed them on the Day of Badr.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "44:15",
            "37:38",
            "77:46",
            "31:24",
            "43:74",
            "44:12",
            "37:33",
            "16:117",
            "15:50",
            "4:138"
        ],
        "BIBLE": [
            "prophets:ii%20kings:7:9",
            "prophets:jeremiah:23:20",
            "prophets:jeremiah:30:24",
            "torah:genesis:33:16",
            "prophets:joshua:2:16",
            "writings:psalms:51:15",
            "writings:nehemiah:8:11",
            "writings:job:16:22",
            "prophets:jeremiah:18:11",
            "torah:numbers:30:8"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:4:11"
        ]
    }
}