{
    "VERSE": "44:16",
    "ARABIC": "يَوْمَ نَبْطِشُ ٱلْبَطْشَةَ ٱلْكُبْرَىٰٓ إِنَّا مُنتَقِمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "On the day We launch the Great Assault We will certainly take Our revenge.",
        "TRANSLATION_1": "The day that We shall seize them with a grievous hold, We will indeed castigate them.\n",
        "TRANSLATION_2": "The Day when We shall seize them with a mighty seizing, that will be the Day on which We shall inflict upon you full retribution.\n",
        "TRANSLATION_3": "However, We shall truly take Our revenge on the day when the great seizure takes place.\n",
        "TRANSLATION_4": "The day when We will seize with the greatest seizure – We will indeed take revenge.\n",
        "TRANSLATION_5": "On the Day when We shall strike you with the great Batshah. Verily, We will exact retribution.\n",
        "TRANSLATION_6": "On the day when We will seize (them) with the most violent seizing; surely We will inflict retribution.\n",
        "TRANSLATION_7": "Upon the day when We shall assault most mightily, then We shall take Our vengeance.\n",
        "TRANSLATION_8": "On the day when We shall seize them with the greater seizure, (then) in truth We shall punish.\n",
        "TRANSLATION_9": "On the Day We inflict the direst scourge upon all sinners, We will certainly exact retribution.\n",
        "TRANSLATION_10": "On the Day whereon We assault them with the greatest assault, verily We shall take vengeance.\n",
        "TRANSLATION_11": "The day We shall strike with the most terrible striking, We will indeed take vengeance [on them].\n",
        "TRANSLATION_12": "One day We shall seize you with a mighty onslaught: We will indeed (then) exact Retribution!\n",
        "TRANSLATION_13": "On the Day when We shall seize you with the greatest grasp. Verily, We will exact retribution.\n",
        "TRANSLATION_14": "But on that Day We will assault them most mightily, and then We shall revenge!\n",
        "TRANSLATION_15": "The Day when We launch the Great Assault—We will avenge.\n",
        "TRANSLATION_16": "The Day We will strike with the greatest assault, indeed, We will take retribution.\n",
        "TRANSLATION_17": "[44:16] Mention, the day when We shall assault with the most mighty assault — this was the day of [the battle of] Badr — [then] indeed We shall take vengeance, on them (al-batsh, means ‘to seize violently’).\n",
        "TRANSLATION_18": "This is because He said: (On the day when We shall seize them with the greater seizure) We shall punish them with the greater punishment, by the sword on the Day of Badr ((then), in truth We shall punish) with Our torment.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "44:16",
            "23:65",
            "79:6",
            "23:16",
            "23:111",
            "37:26",
            "85:2",
            "23:113",
            "20:23",
            "36:59"
        ],
        "BIBLE": [
            "writings:job:30:16",
            "prophets:i%20samuel:21:7",
            "prophets:i%20kings:15:14",
            "prophets:jeremiah:48:41",
            "writings:ii%20chronicles:15:17",
            "prophets:i%20kings:21:19",
            "writings:daniel:8:11",
            "writings:ii%20chronicles:32:12",
            "prophets:jeremiah:49:24",
            "prophets:i%20samuel:9:22"
        ]
    }
}