{
    "VERSE": "44:18",
    "ARABIC": "أَنْ أَدُّوٓا۟ إِلَىَّ عِبَادَ ٱللَّهِ إِنِّى لَكُمْ رَسُولٌ أَمِينٌ",
    "ENGLISH": {
        "TRANSLATION_0": "'Hand over to me the slaves of Allah. I am a trustworthy Messenger to you.'",
        "TRANSLATION_1": "Deliver the creatures of God to me. I am the trusted messenger sent to you.\n",
        "TRANSLATION_2": "(and said): “Deliver to me Allah's servants. I am a trustworthy Messenger to you,\n",
        "TRANSLATION_3": "Send the servants of God with me. I am a trustworthy Messenger sent to you.\n",
        "TRANSLATION_4": "Who said, “Give the bondmen of Allah into my custody; I am indeed a trustworthy Noble Messenger for you.”\n",
        "TRANSLATION_5": "Saying: \"Deliver to me the servants of Allah. Verily, I am to you a Messenger worthy of all trust.\"\n",
        "TRANSLATION_6": "Saying: Deliver to me the servants of Allah, surely I am a faithful apostle to you,\n",
        "TRANSLATION_7": "saying, 'Deliver to me God's servants; I am for you a faithful Messenger,\n",
        "TRANSLATION_8": "Saying: Give up to me the slaves of Allah. Lo! I am a faithful messenger unto you.\n",
        "TRANSLATION_9": "saying, \"Hand over God's servants to me. I am a trustworthy messenger for you.\n",
        "TRANSLATION_10": "Saying: restore to me the bondmen of Allah, verily I am Unto you an apostle trusted.\n",
        "TRANSLATION_11": "[saying,] ‘Give over the servants of Allah to me; indeed I am a trusted apostle [sent] to you.\n",
        "TRANSLATION_12": "Saying: \"Restore to me the Servants of Allah: I am to you an messenger worthy of all trust;\n",
        "TRANSLATION_13": "Saying: \"Restore to me the slaves of Allah (i.e. the Children of Israel). Verily! I am to you a Messenger worthy of all trust,\n",
        "TRANSLATION_14": "(saying:) 'Be obedient to me O worshipers of Allah. I am your honest Messenger.\n",
        "TRANSLATION_15": "Saying, “Hand over God’s servants to me. I am an honest messenger to you.”\n",
        "TRANSLATION_16": "[Saying], \"Render to me the servants of Allah. Indeed, I am to you a trustworthy messenger,\"\n",
        "TRANSLATION_17": "[44:18] [saying], ‘Give over to me, what I summon you to in the way of faith, that is, manifest your faith to me, O, servants of God; indeed I am for you a messenger [who is] faithful’, in what he has been sent with,\n",
        "TRANSLATION_18": "(Saying: Give up to me) send with me (the slaves of Allah) the Children of Israel. (Lo! I am a faithful messenger unto you) I am a messenger to you from Allah and I am faithful in conveying the message.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "44:18",
            "26:125",
            "26:178",
            "26:107",
            "26:143",
            "26:162",
            "40:44",
            "7:68",
            "98:2",
            "26:52"
        ],
        "BIBLE": [
            "prophets:i%20kings:20:5",
            "writings:daniel:3:28",
            "writings:psalms:31:15",
            "torah:exodus:3:14",
            "torah:exodus:3:13",
            "torah:leviticus:18:2",
            "torah:leviticus:24:15",
            "prophets:i%20samuel:23:11",
            "torah:exodus:6:6",
            "prophets:ii%20kings:16:7"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:3:3"
        ]
    }
}