{
    "VERSE": "44:20",
    "ARABIC": "وَإِنِّى عُذْتُ بِرَبِّى وَرَبِّكُمْ أَن تَرْجُمُونِ",
    "ENGLISH": {
        "TRANSLATION_0": "I have sought refuge with my Lord and your Lord against your stoning me.",
        "TRANSLATION_1": "I have taken refuge in my Lord and your Lord against your stoning me to death.\n",
        "TRANSLATION_2": "I have taken refuge with my Lord and your Lord lest you should attack me with stones.\n",
        "TRANSLATION_3": "I seek protection from my Lord and your Lord from your decision of stoning me.\n",
        "TRANSLATION_4": "“And I take the refuge of my Lord and yours, against your stoning me.”\n",
        "TRANSLATION_5": "And truly, I seek refuge with my Lord and your Lord, lest you should stone me.\"\n",
        "TRANSLATION_6": "And surely I take refuge with my Lord and your Lord that you should stone me to death:\n",
        "TRANSLATION_7": "and I take refuge in my Lord and your Lord, lest you should stone me.\n",
        "TRANSLATION_8": "And lo! I have sought refuge in my Lord and your Lord lest ye stone me to death.\n",
        "TRANSLATION_9": "I have sought refuge with my Lord and your Lord lest you stone me [to death].\n",
        "TRANSLATION_10": "And verily I have sought refuge in my Lord and your Lord lest ye stone me.\n",
        "TRANSLATION_11": "I seek the protection of my Lord and your Lord, lest you should stone me.\n",
        "TRANSLATION_12": "For me, I have sought safety with my Lord and your Lord, against your injuring me.\n",
        "TRANSLATION_13": "And truly, I seek refuge in my Lord and your Lord, lest you stone me (or call me a sorcerer or kill me).\n",
        "TRANSLATION_14": "I take refuge with my Lord and your Lord lest you stone me.\n",
        "TRANSLATION_15": "I have taken refuge in my Lord and your Lord, lest you stone me.\n",
        "TRANSLATION_16": "And indeed, I have sought refuge in my Lord and your Lord, lest you stone me.\n",
        "TRANSLATION_17": "[44:20] So he said, ‘And truly I seek refuge in my Lord and your Lord, lest you should stone me, [to death] with rocks.\n",
        "TRANSLATION_18": "(And lo! I have sought refuge in my Lord and your Lord lest ye stone me to death) lest you kill me.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "44:20",
            "23:98",
            "36:25",
            "26:12",
            "37:99",
            "20:45",
            "84:5",
            "84:2",
            "43:14",
            "28:33"
        ],
        "BIBLE": [
            "writings:psalms:37:40",
            "writings:psalms:71:1",
            "writings:psalms:7:2",
            "writings:psalms:31:2",
            "writings:psalms:141:8",
            "writings:psalms:11:1",
            "writings:psalms:25:20",
            "prophets:i%20samuel:16:2",
            "prophets:i%20kings:21:19",
            "prophets:ii%20samuel:12:9"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:5:1",
            
            "Sefer%20Yetzirah:3:1",
            "Sefer%20Yetzirah:1:3"
        ]
    }
}