{
    "VERSE": "44:21",
    "ARABIC": "وَإِن لَّمْ تُؤْمِنُوا۟ لِى فَٱعْتَزِلُونِ",
    "ENGLISH": {
        "TRANSLATION_0": "If you do not have iman in me, then at least leave me alone.'",
        "TRANSLATION_1": "If you do not believe in me, leave me alone.\"\n",
        "TRANSLATION_2": "But if you do not believe what I say, leave me alone (and desist from laying hands on me).”\n",
        "TRANSLATION_3": "If you do not want to believe, leave me alone\".\n",
        "TRANSLATION_4": "“And if you do not believe in me, then have no relation with me.”\n",
        "TRANSLATION_5": "But if you believe me not, then keep away from me and leave me alone.\"\n",
        "TRANSLATION_6": "And if you do not believe in me, then leave me alone.\n",
        "TRANSLATION_7": "But if so be that you believe me not, go you apart from me!'\n",
        "TRANSLATION_8": "And if ye put no faith in me, then let me go.\n",
        "TRANSLATION_9": "If you do not believe in me, at least keep away from me.\"\n",
        "TRANSLATION_10": "And if ye will not believe in me, then let me alone.\n",
        "TRANSLATION_11": "And if you do not believe me, keep out of my way.’\n",
        "TRANSLATION_12": "If ye believe me not, at least keep yourselves away from me.\"\n",
        "TRANSLATION_13": "But if you believe me not, then keep away from me and leave me alone.\"\n",
        "TRANSLATION_14": "And if you do not believe me, then leave me'\n",
        "TRANSLATION_15": "But if you do not believe in me, keep away from me.”\n",
        "TRANSLATION_16": "But if you do not believe me, then leave me alone.\"\n",
        "TRANSLATION_17": "[44:21] And if you do not believe me, then stay away from me’, [that is] then refrain from harming me — but they did not refrain from such [action].\n",
        "TRANSLATION_18": "(And if ye put no faith in me) and if you do not believe in the message I bring you, (then let me go) then leave me alone, neither harmed by you nor benefiting from you.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "44:21",
            "2:152",
            "20:13",
            "74:14",
            "12:60",
            "36:43",
            "26:80",
            "26:211",
            "51:45",
            "53:60"
        ],
        "BIBLE": [
            "writings:nehemiah:6:9",
            "prophets:judges:15:12",
            "prophets:ii%20samuel:16:21",
            "torah:exodus:4:21",
            "torah:exodus:17:16",
            "writings:job:11:14",
            "prophets:ii%20kings:4:29",
            "writings:psalms:37:33",
            "torah:genesis:42:37",
            "prophets:ii%20kings:13:16"
        ]
    }
}