{
    "VERSE": "44:23",
    "ARABIC": "فَأَسْرِ بِعِبَادِى لَيْلًا إِنَّكُم مُّتَّبَعُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "'Set out with My slaves by night. You will certainly be pursued.",
        "TRANSLATION_1": "Journey by night with My devotees,\" (it was said); \"you will certainly be pursued.\n",
        "TRANSLATION_2": "(He was told): “Set out with My servants by night for you will certainly be pursued.\n",
        "TRANSLATION_3": "We told him, \"Leave the city with My servants during the night. You will be pursued.\n",
        "TRANSLATION_4": "We commanded him, “Journey with My bondmen in a part of the night – you will be pursued.”\n",
        "TRANSLATION_5": "(Allah said): \"Depart you with My servants by night. Surely, you will be pursued.\"\n",
        "TRANSLATION_6": "So go forth with My servants by night; surely you will be pursued:\n",
        "TRANSLATION_7": "Then set thou forth with My servants in a watch of the night; surely you will be followed.\n",
        "TRANSLATION_8": "Then (his Lord commanded): Take away My slaves by night. Lo! ye will be followed,\n",
        "TRANSLATION_9": "God said, \"Set out with My servants by night, for you will certainly be pursued.\n",
        "TRANSLATION_10": "So depart thou with My bondmen by night; verily ye shall be pursued.\n",
        "TRANSLATION_11": "[Allah told him,] ‘Set out by night with My servants; for you will be pursued.\n",
        "TRANSLATION_12": "(The reply came:) \"March forth with My Servants by night: for ye are sure to be pursued.\n",
        "TRANSLATION_13": "(Allah said): \"Depart you with My slaves by night. Surely, you will be pursued.\n",
        "TRANSLATION_14": "(His Lord answered): 'Set out with My worshipers in the night, for you will surely be followed.\n",
        "TRANSLATION_15": "“Set out with My servants by night—you will be followed.\n",
        "TRANSLATION_16": "[Allah said], \"Then set out with My servants by night. Indeed, you are to be pursued.\n",
        "TRANSLATION_17": "[44:23] God, exalted be He, said: ‘Then set out (read fa-asri or fa’sri) with My servants, the Children of Israel, by night; for you will assuredly be pursued, [surely] Pharaoh and his people will pursue you.\n",
        "TRANSLATION_18": "(Then (his Lord commanded) Take away my slaves by night) Allah said to Moses: \"take away My slaves, the Children of Israel at the beginning of the night\". (Lo! ye will be followed) to the sea,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "44:23",
            "26:52",
            "53:10",
            "89:29",
            "29:56",
            "36:25",
            "37:111",
            "37:132",
            "37:122",
            "37:81"
        ],
        "BIBLE": [
            "prophets:ii%20kings:8:14",
            "writings:ruth:2:6",
            "prophets:i%20kings:18:21",
            "prophets:i%20kings:9:6",
            "prophets:i%20samuel:22:9",
            "prophets:joshua:9:24",
            "torah:deuteronomy:17:14",
            "prophets:i%20kings:20:12",
            "writings:ruth:1:16",
            "prophets:i%20samuel:9:10"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:8"
        ]
    }
}