{
    "VERSE": "44:24",
    "ARABIC": "وَٱتْرُكِ ٱلْبَحْرَ رَهْوًا إِنَّهُمْ جُندٌ مُّغْرَقُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Leave the sea divided as it is. They are an army who will be drowned.'",
        "TRANSLATION_1": "(Cross and) leave the sea undisturbed. The (pursuing) hosts will surely be drowned,\"\n",
        "TRANSLATION_2": "And leave the sea behind you as calm as ever. Surely they are an army that is doomed to be drowned.”\n",
        "TRANSLATION_3": "Cross the sea by cutting a path through it. Pharaoh's army will be drowned.\n",
        "TRANSLATION_4": "“And leave the sea as it is, parted in several places; indeed that army will be drowned.”\n",
        "TRANSLATION_5": "And leave the sea as it is (quiet and divided). Verily, they are a host to be drowned.\"\n",
        "TRANSLATION_6": "And leave the sea intervening; surely they are a host that shall be drowned.\n",
        "TRANSLATION_7": "And leave the sea becalmed; they are a drowned host.'\n",
        "TRANSLATION_8": "And leave the sea behind at rest, for lo! they are a drowned host.\n",
        "TRANSLATION_9": "Leave the sea behind you parted; they are a host destined to be drowned.\"\n",
        "TRANSLATION_10": "And leave thou the sea divided: verily they are a host to be drowned.\n",
        "TRANSLATION_11": "Leave behind the sea unmoving; for they will be a drowned host.’\n",
        "TRANSLATION_12": "And leave the sea as a furrow (divided): for they are a host (destined) to be drowned.\"\n",
        "TRANSLATION_13": "And leave the sea as it is (quiet and divided). Verily, They are a host to be drowned.\"\n",
        "TRANSLATION_14": "Then leave the sea calm they are an army that will be drowned.\n",
        "TRANSLATION_15": "And cross the sea quickly; they are an army to be drowned.”\n",
        "TRANSLATION_16": "And leave the sea in stillness. Indeed, they are an army to be drowned.\"\n",
        "TRANSLATION_17": "[44:24] And leave the sea behind, once you and your companions have crossed it, at rest, still and calm, until the Egyptians enter it: indeed they will be a drowned host’ — he [Moses] was reassured by this [statement] — and they were [indeed] drowned.\n",
        "TRANSLATION_18": "576 (And leave the sea behind at rest) spacious roads, spacious enough for Moses and his folk to pass through them, (for lo! they are a drowned host) Pharaoh and his folk will be drowned in the sea.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "44:24",
            "37:173",
            "52:6",
            "81:6",
            "82:3",
            "55:19",
            "10:90",
            "36:75",
            "85:17",
            "28:6"
        ],
        "BIBLE": [
            "prophets:jeremiah:51:62",
            "prophets:jeremiah:48:2",
            "writings:psalms:118:11",
            "writings:psalms:118:12",
            "prophets:joshua:17:18",
            "writings:psalms:118:10",
            "prophets:ezekiel:36:36",
            "prophets:jeremiah:8:3",
            "prophets:ezekiel:31:12",
            "prophets:malachi:1:4"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:2:6",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:6:1"
        ]
    }
}