{
    "VERSE": "44:28",
    "ARABIC": "كَذَٰلِكَ وَأَوْرَثْنَٰهَا قَوْمًا ءَاخَرِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "So it was. Yet We bequeathed these things to another people.",
        "TRANSLATION_1": "Thus it was; and We passed them on to another people.\n",
        "TRANSLATION_2": "Thus it was; and We made another people inherit all that.\n",
        "TRANSLATION_3": "We gave these as an inheritance to other people.\n",
        "TRANSLATION_4": "That is what We did; and We made another nation their heirs.\n",
        "TRANSLATION_5": "Thus (it was)! And We made other people inherit them.\n",
        "TRANSLATION_6": "Thus (it was), and We gave them as a heritage to another people.\n",
        "TRANSLATION_7": "Even so; and We bequeathed them upon another people.\n",
        "TRANSLATION_8": "Even so (it was), and We made it an inheritance for other folk;\n",
        "TRANSLATION_9": "Such was their end, and what had been theirs We gave to other people to inherit.\n",
        "TRANSLATION_10": "Even so And We caused to inherit them another people.\n",
        "TRANSLATION_11": "So it was; and We bequeathed them to another people.\n",
        "TRANSLATION_12": "Thus (was their end)! And We made other people inherit (those things)!\n",
        "TRANSLATION_13": "Thus (it was)! And We made other people inherit them (i.e. We made the Children of Israel to inherit the kingdom of Egypt).\n",
        "TRANSLATION_14": "As such (it was). And We made other people inherit them.\n",
        "TRANSLATION_15": "So it was; and We passed it on to another people.\n",
        "TRANSLATION_16": "Thus. And We caused to inherit it another people.\n",
        "TRANSLATION_17": "[44:28] So [it was] (kadhālika is the predicate of a subject [that is missing], such as ‘the matter was [so]’) and We made these an inheritance, that is to say, their riches, for another people, namely, the Children of Israel.\n",
        "TRANSLATION_18": "(Even so (it was)) We destroyed them, (and We made it an inheritance for other folk) We made the Children of Israel inherit all that after they were destroyed;\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "44:28",
            "21:11",
            "20:55",
            "15:58",
            "26:64",
            "20:37",
            "10:86",
            "6:105",
            "26:66",
            "26:172"
        ],
        "BIBLE": [
            "prophets:joshua:19:49",
            "writings:psalms:78:62",
            "writings:psalms:135:12",
            "writings:job:15:19",
            "prophets:joshua:13:29",
            "prophets:joshua:21:3",
            "writings:i%20chronicles:6:49",
            "torah:deuteronomy:32:8",
            "torah:numbers:26:62",
            "prophets:joshua:13:33"
        ]
    }
}