{
    "VERSE": "44:30",
    "ARABIC": "وَلَقَدْ نَجَّيْنَا بَنِىٓ إِسْرَٰٓءِيلَ مِنَ ٱلْعَذَابِ ٱلْمُهِينِ",
    "ENGLISH": {
        "TRANSLATION_0": "We rescued the tribe of Israel from the humiliating punishment,",
        "TRANSLATION_1": "So We saved the children of Israel from degrading suffering\n",
        "TRANSLATION_2": "Thus did We deliver the Children of Israel from the humiliating chastisement,\n",
        "TRANSLATION_3": "We rescued the Israelites from the humiliating torment\n",
        "TRANSLATION_4": "And indeed We rescued the Descendants of Israel from a disgraceful torture.\n",
        "TRANSLATION_5": "And indeed We saved the Children of Israel from the humiliating torment,\n",
        "TRANSLATION_6": "And certainly We delivered the children of Israel from the abasing chastisement,\n",
        "TRANSLATION_7": "and We delivered the Children of Israel from the humbling chastisement,\n",
        "TRANSLATION_8": "And We delivered the Children of Israel from the shameful doom;\n",
        "TRANSLATION_9": "We saved the Children of Israel from their humiliating torment\n",
        "TRANSLATION_10": "And assuredly We delivered the Children of Isra'il from an ignominous torment\n",
        "TRANSLATION_11": "Certainly We delivered the Children of Israel from the humiliating torment\n",
        "TRANSLATION_12": "We did deliver aforetime the Children of Israel from humiliating Punishment,\n",
        "TRANSLATION_13": "And indeed We saved the Children of Israel from the humiliating torment,\n",
        "TRANSLATION_14": "and We saved the Children of Israel from a humiliating punishment\n",
        "TRANSLATION_15": "And We delivered the Children of Israel from the humiliating persecution.\n",
        "TRANSLATION_16": "And We certainly saved the Children of Israel from the humiliating torment -\n",
        "TRANSLATION_17": "[44:30] And verily We delivered the Children of Israel from the humiliating chastisement, of having their children slain and their womenfolk taken as servants,\n",
        "TRANSLATION_18": "(And We delivered the Children of Israel from the shameful doom) from the painful and severe doom.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "44:30",
            "70:11",
            "29:54",
            "15:24",
            "40:53",
            "20:48",
            "26:59",
            "23:76",
            "16:113",
            "43:16"
        ],
        "BIBLE": [
            "prophets:joshua:9:26",
            "writings:ii%20chronicles:13:16",
            "torah:exodus:6:6",
            "writings:job:8:4",
            "writings:daniel:12:1",
            "prophets:ezekiel:16:21",
            "torah:leviticus:12:2",
            "prophets:joshua:11:19",
            "writings:psalms:71:2",
            "prophets:isaiah:49:25"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:12",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:4"
        ]
    }
}