{
    "VERSE": "44:31",
    "ARABIC": "مِن فِرْعَوْنَ إِنَّهُۥ كَانَ عَالِيًا مِّنَ ٱلْمُسْرِفِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "from Pharaoh - he was haughty, one of the profligate.",
        "TRANSLATION_1": "They (had experienced) under the Pharaoh. He was certainly a tyrant, guilty of excess.\n",
        "TRANSLATION_2": "from Pharaoh who was most prominent among the prodigals.\n",
        "TRANSLATION_3": "and from the Pharaoh. He was the chief of the transgressors.\n",
        "TRANSLATION_4": "From Firaun; he was indeed proud, among the transgressors.\n",
        "TRANSLATION_5": "From Fir`awn; verily, he was arrogant and was of the excessive.\n",
        "TRANSLATION_6": "From Firon; surely he was haughty, (and) one of the extravagant.\n",
        "TRANSLATION_7": "from Pharaoh; surely he was a high One, of the prodigals;\n",
        "TRANSLATION_8": "(We delivered them) from Pharaoh. Lo! he was a tyrant of the wanton ones.\n",
        "TRANSLATION_9": "at the hands of Pharaoh: he was a tyrant who exceeded all bounds.\n",
        "TRANSLATION_10": "From Fir'awn; verily he was haughty and of the extravagant.\n",
        "TRANSLATION_11": "of Pharaoh. Indeed, he was a tyrant among the transgressors.\n",
        "TRANSLATION_12": "Inflicted by Pharaoh, for he was arrogant (even) among inordinate transgressors.\n",
        "TRANSLATION_13": "From Fir'aun (Pharaoh); Verily! He was arrogant and was of the Musrifun (those who transgress beyond bound in spending and other things and commit great sins).\n",
        "TRANSLATION_14": "from Pharaoh, who ranked high in sin,\n",
        "TRANSLATION_15": "From Pharaoh. He was a transgressing tyrant.\n",
        "TRANSLATION_16": "From Pharaoh. Indeed, he was a haughty one among the transgressors.\n",
        "TRANSLATION_17": "[44:31] from Pharaoh (min Fir‘awna, is said to be a substitution for al-‘adhābi, on the basis of an implied annexation, that is to say, [min] ‘adhābi [Fir‘awna]; or it is said to be a circumstantial qualifier referring to al-‘adhāb, ‘the chastisement’). Truly he was a tyrant of the wanton ones.\n",
        "TRANSLATION_18": "((We delivered them) from Pharaoh) and his folk who slaughtered their males and used their females as servants. (Lo! he was a tyrant) he was an arrogant transgressor (of the wanton ones) steeped in idolatry.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "44:31",
            "7:15",
            "20:24",
            "79:17",
            "26:153",
            "38:80",
            "15:37",
            "26:185",
            "20:43",
            "83:21"
        ],
        "BIBLE": [
            "writings:job:8:4",
            "prophets:ii%20kings:3:18",
            "prophets:ezekiel:31:11",
            "torah:leviticus:8:36",
            "writings:job:22:30",
            "writings:ezra:9:7",
            "prophets:judges:8:3",
            "prophets:judges:11:32",
            "writings:job:6:23",
            "writings:lamentations:1:14"
        ]
    }
}