{
    "VERSE": "44:33",
    "ARABIC": "وَءَاتَيْنَٰهُم مِّنَ ٱلْءَايَٰتِ مَا فِيهِ بَلَٰٓؤٌا۟ مُّبِينٌ",
    "ENGLISH": {
        "TRANSLATION_0": "and We gave them Signs containing a clear trial.",
        "TRANSLATION_1": "And sent them tokens to bring out the best in them.\n",
        "TRANSLATION_2": "and bestowed upon them the Signs wherein lay an evident test for them.\n",
        "TRANSLATION_3": "and sent them revelations of which some were a clear trial for them.\n",
        "TRANSLATION_4": "And We gave them signs in which lay clear favours.\n",
        "TRANSLATION_5": "And granted them signs in which there was a plain trial.\n",
        "TRANSLATION_6": "And We gave them of the communications wherein was clear blessing.\n",
        "TRANSLATION_7": "and gave them signs wherein there was a manifest trial.\n",
        "TRANSLATION_8": "And We gave them portents wherein was a clear trial.\n",
        "TRANSLATION_9": "and showed them signs in which there was a clear test.\n",
        "TRANSLATION_10": "And We vouchsafed Unto them signs wherein was a manifest favour.\n",
        "TRANSLATION_11": "and We gave them some signs in which there was a manifest test.\n",
        "TRANSLATION_12": "And granted them Signs in which there was a manifest trial\n",
        "TRANSLATION_13": "And granted them signs in which there was a plain trial.\n",
        "TRANSLATION_14": "And gave signs to them in which there was a clear trial.\n",
        "TRANSLATION_15": "And We gave them many signs, in which was an obvious test.\n",
        "TRANSLATION_16": "And We gave them of signs that in which there was a clear trial.\n",
        "TRANSLATION_17": "[44:33] And We gave them signs in which there was a manifest trial, an obvious grace, such as the parting of the sea, [the sending down of] manna and quails and other such [signs].\n",
        "TRANSLATION_18": "(And We gave them portents) signs (wherein was a clear trial) and it is this that saved them from Pharaoh and drowning, and He sent down for them quails and honey in the wilderness, etc.; it is also said that (wherein was a clear trial) means: wherein was a great blessing.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "44:33",
            "42:35",
            "6:49",
            "43:69",
            "78:28",
            "34:38",
            "8:3",
            "22:51",
            "51:37",
            "20:133"
        ],
        "BIBLE": [
            "torah:genesis:39:21",
            "writings:psalms:106:15",
            "prophets:ezekiel:20:25",
            "writings:ii%20chronicles:32:24",
            "writings:ezra:3:11",
            "torah:numbers:18:29",
            "writings:proverbs:8:29",
            "torah:genesis:28:4",
            "torah:numbers:31:41",
            "writings:esther:2:9"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:3:2"
        ]
    }
}