{
    "VERSE": "44:39",
    "ARABIC": "مَا خَلَقْنَٰهُمَآ إِلَّا بِٱلْحَقِّ وَلَٰكِنَّ أَكْثَرَهُمْ لَا يَعْلَمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "We did not create them except with truth but most of them do not know it.",
        "TRANSLATION_1": "We created them with definite purpose; but most of them do not understand.\n",
        "TRANSLATION_2": "We did not create them except in Truth. But most of them do not know.\n",
        "TRANSLATION_3": "We have created them for a genuine purpose, but most people do not know.\n",
        "TRANSLATION_4": "We did not create them except with the truth, but most of them do not know.\n",
        "TRANSLATION_5": "We created them not except with truth, but most of them know not.\n",
        "TRANSLATION_6": "We did not create them both but with the truth, but most of them do not know.\n",
        "TRANSLATION_7": "We created them not save in truth; but most of them know it not.\n",
        "TRANSLATION_8": "We created them not save with truth; but most of them know not.\n",
        "TRANSLATION_9": "We did not create them save with a purpose, yet most people have no knowledge of this.\n",
        "TRANSLATION_10": "We created them not save with a purpose but most of them know not.\n",
        "TRANSLATION_11": "We did not create them except with consummate wisdom; but most of them do not know.\n",
        "TRANSLATION_12": "We created them not except for just ends: but most of them do not understand.\n",
        "TRANSLATION_13": "We created them not except with truth (i.e. to examine and test those who are obedient and those who are disobedient and then reward the obedient ones and punish the disobedient ones), but most of them know not.\n",
        "TRANSLATION_14": "We created them in nothing else except the truth. But most do not know.\n",
        "TRANSLATION_15": "We created them only for a specific purpose, but most of them do not know.\n",
        "TRANSLATION_16": "We did not create them except in truth, but most of them do not know.\n",
        "TRANSLATION_17": "[44:39] We did not create them, and all that is between them, except with the truth, that is to say, [We created them] rightfully so that one might infer thereby Our power and Our Oneness and other matters; but most of them, that is, the Meccan disbelievers, do not know.\n",
        "TRANSLATION_18": "(We created them not save with truth) We created them only for the Truth, never for falsehood; (but most of them) most of the people of Mecca (know not) this nor believe in it.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "44:39",
            "43:78",
            "23:70",
            "17:105",
            "15:8",
            "10:36",
            "23:90",
            "34:49",
            "25:33",
            "15:64"
        ],
        "BIBLE": [
            "prophets:jeremiah:4:22",
            "writings:proverbs:17:24",
            "prophets:isaiah:45:22",
            "prophets:isaiah:41:20",
            "torah:exodus:33:13",
            "writings:psalms:119:96",
            "torah:deuteronomy:32:29",
            "writings:proverbs:30:3",
            "writings:daniel:2:21",
            "writings:ezra:7:25"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:2:2",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:1:8"
        ]
    }
}