{
    "VERSE": "44:40",
    "ARABIC": "إِنَّ يَوْمَ ٱلْفَصْلِ مِيقَٰتُهُمْ أَجْمَعِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "The Day of Decision will be their appointment all together:",
        "TRANSLATION_1": "The Day of Judgement is your promised day of meeting,\n",
        "TRANSLATION_2": "The Day of Final Decision is the appointed time for all;\n",
        "TRANSLATION_3": "The appointed time for all of them will be the Day of Judgment\n",
        "TRANSLATION_4": "Indeed the Day of Decision is the appointment for all of them.\n",
        "TRANSLATION_5": "Verily, the Day of Judgement is the time appointed for all of them --\n",
        "TRANSLATION_6": "Surely the day of separation is their appointed term, of all of them\n",
        "TRANSLATION_7": "Surely the Day of Decision shall be their appointed time, all together,\n",
        "TRANSLATION_8": "Assuredly the Day of Decision is the term for all of them,\n",
        "TRANSLATION_9": "Truly, the Day of Decision is the appointed time for all of them,\n",
        "TRANSLATION_10": "Verily the Day of Distinction is the term appointed for all of them.\n",
        "TRANSLATION_11": "Indeed the Day of Judgement is the tryst for them all,\n",
        "TRANSLATION_12": "Verily the Day of sorting out is the time appointed for all of them,-\n",
        "TRANSLATION_13": "Verily, the Day of Judgement (when Allah will judge between the creatures) is the time appointed for all of them,\n",
        "TRANSLATION_14": "The Day of Decision is the appointed time for all.\n",
        "TRANSLATION_15": "The Day of Sorting Out is the appointed time for them all.\n",
        "TRANSLATION_16": "Indeed, the Day of Judgement is the appointed time for them all -\n",
        "TRANSLATION_17": "[44:40] Assuredly the Day of Decision, the Day of Resurrection, in which God will decide between servants, will be the tryst for all of them, for everlasting chastisement;\n",
        "TRANSLATION_18": "(Assuredly the Day of Decision) the Day of judgement between created beings (is the term of all of them) is their tryst,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "44:40",
            "78:17",
            "77:13",
            "77:14",
            "15:38",
            "38:81",
            "37:21",
            "26:38",
            "56:50",
            "77:38"
        ],
        "BIBLE": [
            "torah:numbers:6:13",
            "torah:exodus:29:30",
            "torah:deuteronomy:10:8",
            "prophets:i%20kings:2:24",
            "torah:leviticus:23:27",
            "writings:psalms:75:3",
            "prophets:zechariah:14:1",
            "prophets:jeremiah:46:21",
            "writings:esther:9:31",
            "writings:job:34:23"
        ]
    }
}