{
    "VERSE": "44:42",
    "ARABIC": "إِلَّا مَن رَّحِمَ ٱللَّهُ إِنَّهُۥ هُوَ ٱلْعَزِيزُ ٱلرَّحِيمُ",
    "ENGLISH": {
        "TRANSLATION_0": "except for those Allah has mercy on. He is the Almighty, the Most Merciful.",
        "TRANSLATION_1": "Apart from those to whom God is kind. He is all-mighty and all-merciful.\n",
        "TRANSLATION_2": "except those to whom Allah shows mercy. He is the Most Mighty, the Most Compassionate.\n",
        "TRANSLATION_3": "except for those to whom God grants mercy. He is Majestic and All-merciful.\n",
        "TRANSLATION_4": "Except those upon whom Allah has mercy; indeed He only is the Most Honourable, the Most Merciful.\n",
        "TRANSLATION_5": "Except him on whom Allah has mercy. Verily, He is the All-Mighty, the Most Merciful.\n",
        "TRANSLATION_6": "Save those on whom Allah shall have mercy; surely He is the Mighty the Merciful.\n",
        "TRANSLATION_7": "save him upon whom God has mercy; He is the All-mighty, the All-compassionate.\n",
        "TRANSLATION_8": "Save him on whom Allah hath mercy. Lo! He is the Mighty, the Merciful.\n",
        "TRANSLATION_9": "save those to whom God shows mercy. Surely, He is the Mighty, the Merciful One.\n",
        "TRANSLATION_10": "Save those on whom Allah will have mercy. Verily He! He is the Mighty, the Merciful.\n",
        "TRANSLATION_11": "except for him on whom Allah has mercy. Indeed He is the All-mighty, the All-merciful.\n",
        "TRANSLATION_12": "Except such as receive Allah's Mercy: for He is Exalted in Might, Most Merciful.\n",
        "TRANSLATION_13": "Except him on whom Allah has Mercy. Verily, He is the All-Mighty, the Most Merciful.\n",
        "TRANSLATION_14": "except those on whom Allah will have mercy. He is the Almighty, the Most Merciful.\n",
        "TRANSLATION_15": "Except for him upon whom God has mercy. He is the Mighty, the Merciful.\n",
        "TRANSLATION_16": "Except those [believers] on whom Allah has mercy. Indeed, He is the Exalted in Might, the Merciful.\n",
        "TRANSLATION_17": "[44:42] except for him on whom God has mercy — and these are the believers, for they will intercede for one another with God’s permission. He is indeed the Mighty, the Victor in His retribution of the disbelievers, the Merciful, to believers.\n",
        "TRANSLATION_18": "(Save him on whom Allah hath mercy) from among the believers, for these are not as described above, for they will intercede for one another. (Lo! He is the Mighty) in retribution against the disbelievers, (the Merciful) towards the believers.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "44:42",
            "30:5",
            "27:9",
            "36:5",
            "85:8",
            "26:217",
            "27:30",
            "3:6",
            "4:106",
            "3:74"
        ],
        "BIBLE": [
            "writings:psalms:57:4",
            "prophets:isaiah:30:18",
            "writings:psalms:24:5",
            "writings:psalms:55:17",
            "writings:job:27:13",
            "writings:daniel:1:9",
            "prophets:isaiah:25:9",
            "torah:genesis:19:19",
            "writings:psalms:49:16",
            "writings:psalms:109:26"
        ]
    }
}