{
    "VERSE": "44:45",
    "ARABIC": "كَٱلْمُهْلِ يَغْلِى فِى ٱلْبُطُونِ",
    "ENGLISH": {
        "TRANSLATION_0": "seething in the belly like molten brass,",
        "TRANSLATION_1": "It is like pitch. It will fume in the belly\n",
        "TRANSLATION_2": "Like dregs of oil, it will boil in their bellies\n",
        "TRANSLATION_3": "It will be like molted brass which will boil in the bellies\n",
        "TRANSLATION_4": "Like molten copper; it churns in their bellies.\n",
        "TRANSLATION_5": "Like boiling oil, it will boil in the bellies,\n",
        "TRANSLATION_6": "Like dregs of oil; it shall boil in (their) bellies,\n",
        "TRANSLATION_7": "like molten copper, bubbling in the belly\n",
        "TRANSLATION_8": "Like molten brass, it seetheth in their bellies\n",
        "TRANSLATION_9": "like the dregs of oil, it shall boil in their bellies,\n",
        "TRANSLATION_10": "Like the dregs of all! It shall seethe in the bellies:\n",
        "TRANSLATION_11": "Like molten copper it will boil in their bellies,\n",
        "TRANSLATION_12": "Like molten brass; it will boil in their insides.\n",
        "TRANSLATION_13": "Like boiling oil, it will boil in the bellies,\n",
        "TRANSLATION_14": "Like molten copper boiling in the belly\n",
        "TRANSLATION_15": "Like molten lead; boiling inside the bellies.\n",
        "TRANSLATION_16": "Like murky oil, it boils within bellies\n",
        "TRANSLATION_17": "[44:45] Like molten copper, that is to say, like the dregs of black oil (ka’l-muhli, is the second predicate) it will boil inside the bellies ([if] read taghlī, then it is a third predicate; [if] yaghlī, then it is a circumstantial qualifier referring to al-muhl, ‘molten copper’),\n",
        "TRANSLATION_18": "(Like molten brass) and it is also said: black like the dregs of oil, (it seetheth in their bellies) it boils in their bellies\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "44:45",
            "56:53",
            "22:20",
            "70:8",
            "37:144",
            "37:66",
            "3:46",
            "70:9",
            "15:12",
            "37:110"
        ],
        "BIBLE": [
            "torah:numbers:31:22",
            "prophets:ezekiel:22:20",
            "writings:ecclesiastes:4:16",
            "prophets:ezekiel:22:18",
            "writings:job:19:24",
            "prophets:jeremiah:6:29",
            "writings:psalms:143:10",
            "writings:job:38:32",
            "prophets:ezekiel:39:2",
            "writings:psalms:31:4"
        ]
    }
}