{
    "VERSE": "44:48",
    "ARABIC": "ثُمَّ صُبُّوا۟ فَوْقَ رَأْسِهِۦ مِنْ عَذَابِ ٱلْحَمِيمِ",
    "ENGLISH": {
        "TRANSLATION_0": "Then pour the punishment of boiling water on his head.'",
        "TRANSLATION_1": "Then pour over his head the torment of scalding water.\"\n",
        "TRANSLATION_2": "then pour boiling water over his head as chastisement.\n",
        "TRANSLATION_3": "Then pour unto their heads the boiling water to torment them\".\n",
        "TRANSLATION_4": "“Then pour on his head the punishment of boiling water.”\n",
        "TRANSLATION_5": "Then pour over his head the torment of boiling water.\"\n",
        "TRANSLATION_6": "Then pour above his head of the torment of the boiling water:\n",
        "TRANSLATION_7": "then pour over his head the chastisement of boiling water!'\n",
        "TRANSLATION_8": "Then pour upon his head the torment of boiling water.\n",
        "TRANSLATION_9": "Then pour boiling water over his head as punishment.\n",
        "TRANSLATION_10": "Then pour upon his head the torment of balling water.\n",
        "TRANSLATION_11": "then pour over his head boiling water as punishment,\n",
        "TRANSLATION_12": "Then pour over his head the Penalty of Boiling Water,\n",
        "TRANSLATION_13": "Then pour over his head the torment of boiling water,\n",
        "TRANSLATION_14": "Then pour the punishment of boiling water over his head,\n",
        "TRANSLATION_15": "Then pour over his head the suffering of the Inferno!\n",
        "TRANSLATION_16": "Then pour over his head from the torment of scalding water.\"\n",
        "TRANSLATION_17": "[44:48] Then pour over his head the torture of boiling water!’, that is to say, the boiling water which is evertorturous (this [use of ‘the torture of boiling water’] is rhetorically more intense than what is stated by the verse: boiling water will be poured over their heads [Q. 22:19]).\n",
        "TRANSLATION_18": "Then pour upon his head the torment of boiling water) after he is beaten with iron skewers.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "44:48",
            "29:55",
            "22:19",
            "76:31",
            "16:88",
            "56:54",
            "25:69",
            "40:72",
            "6:65",
            "10:4"
        ],
        "BIBLE": [
            "torah:exodus:29:7",
            "torah:leviticus:8:12",
            "torah:genesis:2:10",
            "writings:psalms:66:12",
            "writings:lamentations:3:54",
            "torah:exodus:12:9",
            "writings:psalms:109:25",
            "torah:deuteronomy:28:44",
            "prophets:jonah:2:6",
            "torah:leviticus:19:27"
        ]
    }
}