{
    "VERSE": "44:49",
    "ARABIC": "ذُقْ إِنَّكَ أَنتَ ٱلْعَزِيزُ ٱلْكَرِيمُ",
    "ENGLISH": {
        "TRANSLATION_0": "'Taste that! You are the mighty one, the noble one!",
        "TRANSLATION_1": "Taste it,\" (they will be told). \"You were indeed the mighty and noble!\n",
        "TRANSLATION_2": "Taste this, you are a person mighty and noble!\n",
        "TRANSLATION_3": "They will be told, \"Suffer the torment. You had thought yourselves to be majestic and honorable.\n",
        "TRANSLATION_4": "Saying “Taste it! Indeed you only are the most honourable, the dignified!”\n",
        "TRANSLATION_5": "Taste you (this)! Verily, you were (pretending to be) the mighty, the generous.\"\n",
        "TRANSLATION_6": "Taste; you forsooth are the mighty, the honorable:\n",
        "TRANSLATION_7": "Taste! Surely thou art the mighty, the noble.\n",
        "TRANSLATION_8": "(Saying): Taste! Lo! thou wast forsooth the mighty, the noble!\n",
        "TRANSLATION_9": "Taste this; you who considered yourself the mighty, the honourable!\n",
        "TRANSLATION_10": "Taste thou! thou art indeed mighty, honoured!\n",
        "TRANSLATION_11": "[and tell them,] “Taste this! Indeed you are the [self-styled] mighty and noble!\n",
        "TRANSLATION_12": "Taste thou (this)! Truly wast thou mighty, full of honour!\n",
        "TRANSLATION_13": "Taste you (this)! Verily, you were (pretending to be) the mighty, the generous!\n",
        "TRANSLATION_14": "(Saying): 'Taste, surely you are the mighty and noble!\n",
        "TRANSLATION_15": "Taste! You who were powerful and noble.\n",
        "TRANSLATION_16": "[It will be said], \"Taste! Indeed, you are the honored, the noble!\n",
        "TRANSLATION_17": "[44:49] And it will be said to him: ‘Taste!, that is, [taste] the chastisement. Indeed you are the mighty, the noble one!, as you claimed when you used to say, ‘There is nothing between its two mountains [sc. Mecca] that is mightier or nobler than me!’\n",
        "TRANSLATION_18": "((Saying): Taste) Abu Jahl! (Lo! thou wast forsooth the mighty) among your own folk, (the noble) in their midst! And it is also said that this means: you were the mighty who felt powerful through your own folk, the noble who was magnanimous with them!\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "44:49",
            "26:68",
            "26:175",
            "26:104",
            "26:140",
            "26:9",
            "26:159",
            "26:122",
            "26:191",
            "36:5"
        ],
        "BIBLE": [
            "writings:ruth:4:4",
            "prophets:isaiah:49:3",
            "prophets:ii%20samuel:1:13",
            "prophets:i%20samuel:14:43",
            "torah:genesis:29:15",
            "writings:psalms:2:7",
            "torah:deuteronomy:2:4",
            "torah:genesis:27:24",
            "prophets:jonah:4:2",
            "prophets:jonah:1:10"
        ]
    }
}