{
    "VERSE": "44:53",
    "ARABIC": "يَلْبَسُونَ مِن سُندُسٍ وَإِسْتَبْرَقٍ مُّتَقَٰبِلِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "wearing fine silk and rich brocade, face to face with one another.",
        "TRANSLATION_1": "Dressed in brocade and shot silk, facing one another.\n",
        "TRANSLATION_2": "Attired in silk and brocade, they shall be arrayed face to face.\n",
        "TRANSLATION_3": "clothed in fine silk and rich brocade, sitting face to face with one another.\n",
        "TRANSLATION_4": "They will be dressed in fine silk and embroidery, facing one another (on thrones).\n",
        "TRANSLATION_5": "Dressed in Sundus and Istabraq, facing each other,\n",
        "TRANSLATION_6": "They shall wear of fine and thick silk, (sitting) face to face;\n",
        "TRANSLATION_7": "robed in silk and brocade, set face to face.\n",
        "TRANSLATION_8": "Attired in silk and silk embroidery, facing one another.\n",
        "TRANSLATION_9": "dressed in fine silk and in rich brocade, and they will face each other:\n",
        "TRANSLATION_10": "Attired in fine silk and brocade, facing each other.\n",
        "TRANSLATION_11": "dressed in fine silk and brocade, sitting face to face.\n",
        "TRANSLATION_12": "Dressed in fine silk and in rich brocade, they will face each other;\n",
        "TRANSLATION_13": "Dressed in fine silk and (also) in thick silk, facing each other,\n",
        "TRANSLATION_14": "dressed in silks and brocade, set face to face.\n",
        "TRANSLATION_15": "Dressed in silk and brocade, facing one another.\n",
        "TRANSLATION_16": "Wearing [garments of] fine silk and brocade, facing each other.\n",
        "TRANSLATION_17": "[44:53] dressed in fine silk and [heavy] silk brocade, that is to say, in fine and thick silks (sundusin wa’stabraqin, respectively), sitting face to face (mutaqābilīna is a circumstantial qualifier), that is to say, they do not look upon each other backs, since the couches revolve with them in them.\n",
        "TRANSLATION_18": "(Attired in silk and silk embroidery, facing one another) they visit one another.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "44:53",
            "51:45",
            "83:33",
            "44:14",
            "74:14",
            "25:76",
            "52:25",
            "37:27",
            "26:19",
            "32:30"
        ],
        "BIBLE": [
            "prophets:i%20kings:2:24",
            "prophets:jeremiah:49:38",
            "prophets:ezekiel:26:16",
            "torah:numbers:4:6",
            "torah:numbers:1:51",
            "prophets:jeremiah:42:17",
            "torah:exodus:26:35",
            "prophets:jeremiah:52:32",
            "prophets:ii%20kings:25:28",
            "prophets:i%20kings:10:9"
        ]
    }
}