{
    "VERSE": "44:54",
    "ARABIC": "كَذَٰلِكَ وَزَوَّجْنَٰهُم بِحُورٍ عِينٍ",
    "ENGLISH": {
        "TRANSLATION_0": "So it will be. We will marry them to dark-eyed maidens.",
        "TRANSLATION_1": "Just like that. We shall pair them with companions with large black eyes.\n",
        "TRANSLATION_2": "Thus shall it be: and We shall espouse them to fair, wide-eyed maidens.\n",
        "TRANSLATION_3": "We shall unite them to maidens with big black and white lovely eyes.\n",
        "TRANSLATION_4": "So it is; and We have wedded them to maidens with gorgeous eyes.\n",
        "TRANSLATION_5": "So (it will be). And We shall marry them to Hur (fair females) with wide lovely eyes,\n",
        "TRANSLATION_6": "Thus (shall it be), and We will wed them with Houris pure, beautiful ones.\n",
        "TRANSLATION_7": "Even so; and We shall espouse them to wide-eyed houris,\n",
        "TRANSLATION_8": "Even so (it will be). And We shall wed them unto fair ones with wide, lovely eyes.\n",
        "TRANSLATION_9": "so it will be. We shall wed them to maidens with large, dark eyes.\n",
        "TRANSLATION_10": "Even so. And We shall pair them with fair damsels large- eyed.\n",
        "TRANSLATION_11": "So shall it be, and We shall wed them to black-eyed houris.\n",
        "TRANSLATION_12": "So; and We shall join them to fair women with beautiful, big, and lustrous eyes.\n",
        "TRANSLATION_13": "So (it will be), and We shall marry them to Houris (female fair ones) with wide, lovely eyes.\n",
        "TRANSLATION_14": "As such, We shall wed them to wideeyed houris (the virgins of Paradise).\n",
        "TRANSLATION_15": "So it is, and We will wed them to lovely companions.\n",
        "TRANSLATION_16": "Thus. And We will marry them to fair women with large, [beautiful] eyes.\n",
        "TRANSLATION_17": "[44:54] So [shall it be] (an implied al-amru, ‘the matter’, should be read as preceding this); and We shall pair them, either in conjugality or [meaning] We shall join them, with houris of beautiful eyes, women of the fairest complexion with wide and beautiful eyes.\n",
        "TRANSLATION_18": "(Even so (it will be)) this is the station of the believers in Paradise. (And We shall wed them unto fair ones with wide, lovely eyes) and beautiful faces.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "44:54",
            "52:20",
            "56:22",
            "83:28",
            "26:57",
            "44:25",
            "6:129",
            "2:39",
            "11:37",
            "7:36"
        ],
        "BIBLE": [
            "prophets:ezekiel:36:23",
            "writings:psalms:32:8",
            "prophets:ezekiel:7:4",
            "prophets:ezekiel:7:9",
            "writings:psalms:45:15",
            "prophets:zechariah:2:15",
            "prophets:ezekiel:12:2",
            "writings:lamentations:5:11",
            "writings:psalms:101:6",
            "prophets:ezekiel:37:19"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:3:6",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:3:8",
            "Sefer%20Yetzirah:2:6"
        ]
    }
}