{
    "VERSE": "44:56",
    "ARABIC": "لَا يَذُوقُونَ فِيهَا ٱلْمَوْتَ إِلَّا ٱلْمَوْتَةَ ٱلْأُولَىٰ وَوَقَىٰهُمْ عَذَابَ ٱلْجَحِيمِ",
    "ENGLISH": {
        "TRANSLATION_0": "They will not taste any death there - except for the first one. He will safeguard them from the punishment of the Blazing Fire.",
        "TRANSLATION_1": "There they will not know any death apart from the first death they had died, and will be kept safe from the torment of Hell\n",
        "TRANSLATION_2": "They shall not taste death except the death in this world. And Allah will save them from the chastisement of Hell\n",
        "TRANSLATION_3": "They will not experience any death other than that which they have already been through.\n",
        "TRANSLATION_4": "They will not taste death again in it, except their former death; and Allah has saved them from the punishment of fire.\n",
        "TRANSLATION_5": "They will never taste death therein except the first death, and He will save them from the torment of the blazing Fire,\n",
        "TRANSLATION_6": "They shall not taste therein death except the first death, and He will save them from the punishment of the hell,\n",
        "TRANSLATION_7": "They shall not taste therein of death, save the first death, And He shall guard them against the chastisement of Hell --\n",
        "TRANSLATION_8": "They taste not death therein, save the first death. And He hath saved them from the doom of hell,\n",
        "TRANSLATION_9": "They will not taste death therein, save the first death. God will save them from the torment of Hell\n",
        "TRANSLATION_10": "They will not taste death therein, except the first death; and He will preserve them from the torment of the Flaming Fire.\n",
        "TRANSLATION_11": "Other than the first death, they will not taste death therein, and He will save them from the punishment of hell\n",
        "TRANSLATION_12": "Nor will they there taste Death, except the first death; and He will preserve them from the Penalty of the Blazing Fire,-\n",
        "TRANSLATION_13": "They will never taste death therein except the first death (of this world), and He will save them from the torment of the blazing Fire,\n",
        "TRANSLATION_14": "There they shall not taste death, except the first death, and He will shield them from the punishment of Hell,\n",
        "TRANSLATION_15": "Therein they will not taste death, beyond the first death; and He will protect them from the torment of Hell.\n",
        "TRANSLATION_16": "They will not taste death therein except the first death, and He will have protected them from the punishment of Hellfire\n",
        "TRANSLATION_17": "[44:56] They will not taste death therein, other than the first death, namely, the one [that came] in this world after they had lived in it (some [scholars] think that illā, ‘other than’, here means ba‘da, ‘after’). And He will shield them from the chastisement of Hell-fire —\n",
        "TRANSLATION_18": "(They taste not death therein) in the Garden, (save the first death) which they taste in the life of the world. (And He hath saved them from) and their Lord has removed from them (the doom of hell) the torment of the Fire,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "44:56",
            "37:59",
            "44:35",
            "3:88",
            "2:162",
            "52:18",
            "26:201",
            "26:91",
            "76:31",
            "16:85"
        ],
        "BIBLE": [
            "torah:exodus:21:36",
            "torah:leviticus:6:6",
            "torah:genesis:39:9",
            "prophets:haggai:1:10",
            "writings:ecclesiastes:9:5",
            "prophets:isaiah:45:17",
            "prophets:i%20kings:11:10",
            "prophets:ezekiel:36:23",
            "prophets:i%20samuel:26:16",
            "prophets:ii%20samuel:22:22"
        ]
    }
}