{
    "VERSE": "44:57",
    "ARABIC": "فَضْلًا مِّن رَّبِّكَ ذَٰلِكَ هُوَ ٱلْفَوْزُ ٱلْعَظِيمُ",
    "ENGLISH": {
        "TRANSLATION_0": "A favour from your Lord. That is the Great Victory.",
        "TRANSLATION_1": "By the beneficence of your Lord. This will be the great success.\n",
        "TRANSLATION_2": "as a favour from your Lord. That is the great triumph.\n",
        "TRANSLATION_3": "God will protect them from the torment of hell as a favor from your Lord. (Muhammad), this is certainly the greatest triumph.\n",
        "TRANSLATION_4": "By the munificence of your Lord; this is the great success.\n",
        "TRANSLATION_5": "As a bounty from your Lord! That will be the supreme success!\n",
        "TRANSLATION_6": "A grace from your Lord; this is the great achievement.\n",
        "TRANSLATION_7": "a bounty from thy Lord; that is the mighty triumph.\n",
        "TRANSLATION_8": "A bounty from thy Lord. That is the supreme triumph.\n",
        "TRANSLATION_9": "as an act of grace. That will be the supreme triumph.\n",
        "TRANSLATION_10": "A bounty from thy Lord. That! that is the supreme achievement.\n",
        "TRANSLATION_11": "—a grace from your Lord. That is the great success.\n",
        "TRANSLATION_12": "As a Bounty from thy Lord! that will be the supreme achievement!\n",
        "TRANSLATION_13": "As a Bounty from your Lord! That will be the supreme success!\n",
        "TRANSLATION_14": "as a bounty from your Lord. That will be the mighty triumph.\n",
        "TRANSLATION_15": "A favor from your Lord. That is the supreme salvation.\n",
        "TRANSLATION_16": "As bounty from your Lord. That is what is the great attainment.\n",
        "TRANSLATION_17": "[44:57]   a bounty from your Lord (fadlan is a verbal noun, with the sense of tafaddulan, and is in the accusative [dependent status] because of an implied [preceding] tafaddala). That is the supreme triumph.\n",
        "TRANSLATION_18": "(A bounty from thy Lord) a favour from your Lord; and it is also said this means: a gift from your Lord. (That) gift (is the Supreme Triumph) the supreme safety: they earned the Garden and became safe from the 579 Fire.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "44:57",
            "37:60",
            "69:52",
            "56:74",
            "56:96",
            "62:4",
            "45:30",
            "9:89",
            "40:9",
            "57:21"
        ],
        "BIBLE": [
            "prophets:habakkuk:3:18",
            "prophets:isaiah:56:1",
            "prophets:isaiah:12:2",
            "writings:psalms:24:5",
            "torah:deuteronomy:4:7",
            "prophets:micah:7:7",
            "torah:exodus:15:2",
            "writings:psalms:88:2",
            "prophets:jeremiah:3:23",
            "writings:psalms:71:16"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:14",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:6:1"
        ]
    }
}