{
    "VERSE": "44:58",
    "ARABIC": "فَإِنَّمَا يَسَّرْنَٰهُ بِلِسَانِكَ لَعَلَّهُمْ يَتَذَكَّرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "We have made it easy in your own tongue so that hopefully they will pay heed.",
        "TRANSLATION_1": "Therefore We have made this (Qur'an) easy in your tongue. They may haply take a warning.\n",
        "TRANSLATION_2": "(O Prophet), We have made this Book easy in your tongue so that they may take heed.\n",
        "TRANSLATION_3": "We have made the Quran easy for you to recite so that perhaps they may take heed.\n",
        "TRANSLATION_4": "And We have made this Qur’an easy in your language, for them to understand.\n",
        "TRANSLATION_5": "Certainly, We have made this easy in your tongue, in order that they may remember.\n",
        "TRANSLATION_6": "So have We made it easy in your tongue that they may be mindful.\n",
        "TRANSLATION_7": "Now We have made it easy by thy tongue, that haply they may remember.\n",
        "TRANSLATION_8": "And We have made (this Scripture) easy in thy language only that they may heed.\n",
        "TRANSLATION_9": "We have made this Quran easy to understand, in your own language, so that they may take heed.\n",
        "TRANSLATION_10": "And We have made it easy in thy language; they might haply be admonished.\n",
        "TRANSLATION_11": "Indeed We have made it simple in your language, so that they may take admonition.\n",
        "TRANSLATION_12": "Verily, We have made this (Qur'an) easy, in thy tongue, in order that they may give heed.\n",
        "TRANSLATION_13": "Certainly, We have made this (Quran) easy in your tongue, in order that they may remember.\n",
        "TRANSLATION_14": "We have now made it easy on your tongue, in order that they remember.\n",
        "TRANSLATION_15": "We made it easy in your language, so that they may remember.\n",
        "TRANSLATION_16": "And indeed, We have eased the Qur'an in your tongue that they might be reminded.\n",
        "TRANSLATION_17": "[44:58] For We have made it easy, We have facilitated the Qur’ān, in your tongue, in your language, so that the Arabs may understand it from you, that perhaps they may remember, [that perhaps] they may be admonished and become believers — but they do not believe.\n",
        "TRANSLATION_18": "(And We have made (this Scripture) easy in your language) We have made easy for you the recitation of the Qur'an (only that they may heed) that they may take admonition by means of the Qur'an.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "44:58",
            "19:97",
            "75:16",
            "88:21",
            "44:59",
            "36:76",
            "37:127",
            "51:54",
            "16:100",
            "37:90"
        ],
        "BIBLE": [
            "prophets:jeremiah:18:18",
            "torah:genesis:11:7",
            "prophets:isaiah:32:4",
            "prophets:isaiah:33:19",
            "prophets:ezekiel:3:6",
            "torah:deuteronomy:28:49",
            "writings:psalms:2:10",
            "writings:psalms:42:7",
            "prophets:jeremiah:14:10",
            "writings:psalms:139:4"
        ]
    }
}