{
    "VERSE": "44:6",
    "ARABIC": "رَحْمَةً مِّن رَّبِّكَ إِنَّهُۥ هُوَ ٱلسَّمِيعُ ٱلْعَلِيمُ",
    "ENGLISH": {
        "TRANSLATION_0": "as a mercy from your Lord. He is the All-Hearing, the All-Knowing:",
        "TRANSLATION_1": "A mercy from your Lord. Verily He is all-hearing and all-knowing,\n",
        "TRANSLATION_2": "as a Mercy from your Lord. Surely He is All-Hearing, All-Seeing,\n",
        "TRANSLATION_3": "as a mercy (for the human being) from your Lord. Your Lord is All-hearing and All-knowing.\n",
        "TRANSLATION_4": "A mercy from your Lord; indeed He only is the All Hearing, the All Knowing.\n",
        "TRANSLATION_5": "(As) a mercy from your Lord. Verily, He is the All-Hearer, the All-Knower.\n",
        "TRANSLATION_6": "A mercy from your Lord, surely He is the Hearing, the Knowing,\n",
        "TRANSLATION_7": "as a mercy from thy Lord (surely He is the All-hearing, the All-knowing)\n",
        "TRANSLATION_8": "A mercy from thy Lord. Lo! He, even He is the Hearer, the Knower,\n",
        "TRANSLATION_9": "as a mercy from your Lord, He hears all and knows all,\n",
        "TRANSLATION_10": "A mercy from thy Lord. Verily He! He is the Hearer, the Knower.\n",
        "TRANSLATION_11": "as a mercy from your Lord—indeed He is the All-hearing, the All-knowing—\n",
        "TRANSLATION_12": "As Mercy from thy Lord: for He hears and knows (all things);\n",
        "TRANSLATION_13": "(As) a Mercy from your Lord. Verily! He is the All-Hearer, the All-Knower.\n",
        "TRANSLATION_14": "A Mercy from your Lord, He is the Hearer, the Knower.\n",
        "TRANSLATION_15": "As mercy from your Lord. He is the Hearer, the Knower.\n",
        "TRANSLATION_16": "As mercy from your Lord. Indeed, He is the Hearing, the Knowing.\n",
        "TRANSLATION_17": "[44:6] as a mercy, out of compassion for those to whom these [messengers] have been sent. Surely He is the Hearer, of their sayings, the Knower, of their actions.\n",
        "TRANSLATION_18": "(A mercy) a blessing (from thy Lord) to His slaves, i.e. sending messengers with scriptures to them is a blessing from their Lord. (Lo! He is the Hearer) of the saying of the Quraysh when they said: \"Our Lord relieve us of the torment\", (the Knower) of them and of their punishment,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "44:6",
            "26:220",
            "12:34",
            "15:86",
            "69:43",
            "56:80",
            "2:127",
            "51:30",
            "3:35",
            "26:192"
        ],
        "BIBLE": [
            "writings:proverbs:20:12",
            "prophets:joshua:1:17",
            "writings:proverbs:30:18",
            "writings:psalms:107:43",
            "torah:leviticus:5:17",
            "writings:ecclesiastes:1:8",
            "prophets:jeremiah:17:9",
            "writings:job:10:13",
            "prophets:isaiah:48:6",
            "torah:deuteronomy:25:16"
        ]
    }
}