{
    "VERSE": "44:8",
    "ARABIC": "لَآ إِلَٰهَ إِلَّا هُوَ يُحْىِۦ وَيُمِيتُ رَبُّكُمْ وَرَبُّ ءَابَآئِكُمُ ٱلْأَوَّلِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "There is no god but Him - He gives life and causes to die - your Lord and the Lord of your forefathers, the previous peoples.",
        "TRANSLATION_1": "There is no god other than He, who gives you life and death, your Lord and the Lord of your fathers of old.\n",
        "TRANSLATION_2": "There is no god but He: He gives life and causes death. He is your Lord and the Lord of your forefathers of yore.\n",
        "TRANSLATION_3": "There is only One Lord. It is He who gives life and causes things to die. He is your Lord and the Lord of your forefathers.\n",
        "TRANSLATION_4": "There is no worship except for Him – He gives life and causes death; your Lord and the Lord of your forefathers.\n",
        "TRANSLATION_5": "La ilaha illa Huwa. He gives life and causes death -- your Lord and the Lord of your forefathers.\n",
        "TRANSLATION_6": "There is no god but He; He gives life and causes death, your Lord and the Lord of your fathers of yore.\n",
        "TRANSLATION_7": "There is no god but He; He gives life and makes to die; your Lord and the Lord of your fathers, the ancients.\n",
        "TRANSLATION_8": "There is no Allah save Him. He quickeneth and giveth death; your Lord and Lord of your forefathers.\n",
        "TRANSLATION_9": "there is no deity save Him: It is He who gives both life and death -- He is your Lord, and the Lord of your forefathers,\n",
        "TRANSLATION_10": "There is no god but He. He quickeneth and causeth to die: your Lord and Lord of your forefathers.\n",
        "TRANSLATION_11": "There is no god except Him: He gives life and brings death, your Lord and the Lord of your forefathers.\n",
        "TRANSLATION_12": "There is no god but He: It is He Who gives life and gives death,- The Lord and Cherisher to you and your earliest ancestors.\n",
        "TRANSLATION_13": "La ilaha illa Huwa (none has the right to be worshipped but He). It is He Who gives life and causes death, your Lord and the Lord of your fore-fathers.\n",
        "TRANSLATION_14": "There is no god except He. He revives and causes to die. (He is) your Lord and the Lord of your fathers, the ancients.\n",
        "TRANSLATION_15": "There is no god but He. He gives life and causes death—your Lord and Lord of your ancestors of old.\n",
        "TRANSLATION_16": "There is no deity except Him; He gives life and causes death. [He is] your Lord and the Lord of your first forefathers.\n",
        "TRANSLATION_17": "[44:8] There is no god except Him. He gives life and brings death. Your Lord and the Lord of your forefathers.\n",
        "TRANSLATION_18": "(There is no God) there is no Creator (save Him) Who created the heavens and the earth. (He quickeneth) for the Resurrection (and giveth death) in the life of the world; (your Lord and Lord of your forefathers) your Creator and the Creator of you forefathers before you.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "44:8",
            "37:126",
            "26:26",
            "6:106",
            "16:24",
            "23:68",
            "27:26",
            "73:9",
            "56:48",
            "37:17"
        ],
        "BIBLE": [
            "torah:leviticus:17:11",
            "prophets:i%20samuel:2:6",
            "prophets:isaiah:38:16",
            "writings:job:33:4",
            "torah:leviticus:10:17",
            "prophets:hosea:2:14",
            "prophets:joshua:23:15",
            "torah:deuteronomy:26:10",
            "writings:psalms:118:18",
            "writings:ii%20chronicles:14:6"
        ]
    }
}