{
    "VERSE": "40:11",
    "ARABIC": "قَالُوا۟ رَبَّنَآ أَمَتَّنَا ٱثْنَتَيْنِ وَأَحْيَيْتَنَا ٱثْنَتَيْنِ فَٱعْتَرَفْنَا بِذُنُوبِنَا فَهَلْ إِلَىٰ خُرُوجٍ مِّن سَبِيلٍ",
    "ENGLISH": {
        "TRANSLATION_0": "They will say, 'Our Lord, twice You caused us to die and twice You gave us life. We admit our wrong actions. Is there no way out?'",
        "TRANSLATION_1": "They say: \"O Lord, twice You made us die, and twice You made us live. We admit our sins. Is there still a way out for us?\"\n",
        "TRANSLATION_2": "They will say: “Our Lord, twice have You caused us to die and twice have You given us life. We have now confessed our sins. Is there, then, any way out?”\n",
        "TRANSLATION_3": "They say, \"Lord, You have caused us to die twice and You have brought us back to life twice. We have confessed our sins, so is there any way out of this (hell)?\"\n",
        "TRANSLATION_4": "They will say, “O Our Lord! Twice You have given us death and twice You have given us life* – we now confess to our sins – so is there a way out of the fire?” (From nothingness to life in this world, to death and then Resurrection.)\n",
        "TRANSLATION_5": "They will say: \"Our Lord! You have made us to die twice, and You have given us life twice! Now we confess our sins, then is there any way to get out\"\n",
        "TRANSLATION_6": "They shall say: Our Lord! twice didst Thou make us subject to death, and twice hast Thou given us life, so we do confess our faults; is there then a way to get out?\n",
        "TRANSLATION_7": "They shall say, 'Our Lord, Thou hast caused us to die two deaths and Thou hast given us twice to live; now we confess our sins. Is there any way to go forth?'\n",
        "TRANSLATION_8": "They say: Our Lord! Twice hast Thou made us die, and twice hast Thou made us live. Now we confess our sins. Is there any way to go out?\n",
        "TRANSLATION_9": "They will say, \"Our Lord! Twice You have made us die, and twice You have given us life! Now we have confessed our sins: is there any way out [of this]?\"\n",
        "TRANSLATION_10": "They will say: our Lord! Thou hast made us die twice, and Thou hast made us live twice now We confess our sins: there no getting out any way?\n",
        "TRANSLATION_11": "They will say, ‘Our Lord! Twice did You make us die, and twice did You give us life. We admit our sins. Is there any way out [from this plight]?’\n",
        "TRANSLATION_12": "They will say: \"Our Lord! twice hast Thou made us without life, and twice hast Thou given us Life! Now have we recognised our sins: Is there any way out (of this)?\"\n",
        "TRANSLATION_13": "They will say: \"Our Lord! You have made us to die twice (i.e. we were dead in the loins of our fathers and dead after our deaths in this world), and You have given us life twice (i.e. life when we were born and life when we are Resurrected)! Now we confess our sins, then is there any way to get out (of the Fire)?\"\n",
        "TRANSLATION_14": "They shall say: 'Our Lord, twice You have made us die, and twice You have given us life, now, we confess our sins. Is there any way we can be brought out of this'\n",
        "TRANSLATION_15": "They will say, “Our Lord, you made us die twice, and twice you gave us life. Now we acknowledge our sins. Is there any way out?”\n",
        "TRANSLATION_16": "They will say, \"Our Lord, You made us lifeless twice and gave us life twice, and we have confessed our sins. So is there to an exit any way?\"\n",
        "TRANSLATION_17": "[40:11] They will say, ‘Our Lord, You have caused us to die twice, two deaths, and You have given us life twice — for they were lifeless drops of semen, then they were given life, then made to die, then brought back to life for the Resurrection. We [now] confess our sins, in having disbelieved in the Resurrection. Is there then any way to go out?’, out of the Fire and return to the world to be obedient to our Lord? The answer given to them will be: No!\n",
        "TRANSLATION_18": "(They say) i.e. the disbelievers will say in the Fire: (Our Lord!) our Lord! (Twice hast Thou made us die) once when You took away our souls [in the life of the world] and once after Munkar and Nakir questioned us in the graves, (and twice hast Thou made us live) once before we were questioned by Munkar and Nakir in the graves and once for the resurrection. (Now we confess) we acknowledge (our sins) our idolatry and denial. (Is there any way to go out) is there any way we can go back to the life of the world so that we believe in You?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "40:11",
            "91:14",
            "94:8",
            "79:19",
            "23:72",
            "108:2",
            "73:19",
            "76:29",
            "74:7",
            "74:3"
        ],
        "BIBLE": [
            "prophets:hosea:2:14",
            "writings:psalms:32:5",
            "prophets:jeremiah:25:5",
            "torah:leviticus:17:11",
            "torah:deuteronomy:8:3",
            "prophets:jeremiah:20:15",
            "prophets:nahum:1:14",
            "prophets:jeremiah:16:15",
            "writings:ii%20chronicles:14:6",
            "prophets:ii%20samuel:22:36"
        ]
    }
}