{
    "VERSE": "40:15",
    "ARABIC": "رَفِيعُ ٱلدَّرَجَٰتِ ذُو ٱلْعَرْشِ يُلْقِى ٱلرُّوحَ مِنْ أَمْرِهِۦ عَلَىٰ مَن يَشَآءُ مِنْ عِبَادِهِۦ لِيُنذِرَ يَوْمَ ٱلتَّلَاقِ",
    "ENGLISH": {
        "TRANSLATION_0": "He is the Raiser of ranks, the Possessor of the Throne, He sends the Ruh by His command to whichever of His slaves He wills so that he may warn mankind about the Day of Meeting:",
        "TRANSLATION_1": "Most exalted of position, Lord of power, He directs inspiration by His command to any of His creatures as He will, to warn (men) of the Day of Meeting,\n",
        "TRANSLATION_2": "Exalted in Rank, Lord of the Throne: He causes the spirit to descend on whomsoever of His servants He pleases so as to warn them of the Day of Encounter;\n",
        "TRANSLATION_3": "God is the promoter of His servants and the owner of the Throne. He sends His spirit by His command to whichever of His servants He wants to warn them of the Day of Judgment.\n",
        "TRANSLATION_4": "Bestower of High Ranks, Owner of the Throne; it is He Who instils the spirit of faith into the one He wills among His bondmen, in order that he may warn of the Day of Meeting. –\n",
        "TRANSLATION_5": "(He is Allah) Owner of high ranks and degrees, the Owner of the Throne. He sends the revelation by His command to any of His servants He wills, that he may warn of the Day of Mutual Meeting.\n",
        "TRANSLATION_6": "Possessor of the highest rank, Lord of power: He makes the inspiration to light by His command upon whom He pleases of His servants, that he may warn (men) of the day of meeting.\n",
        "TRANSLATION_7": "Exalter of ranks is He, Possessor of the Throne, casting the Spirit of His bidding upon whomever He will of His servants, that he may warn them of the Day of Encounter,\n",
        "TRANSLATION_8": "The Exalter of Ranks, the Lord of the Throne. He causeth the Spirit of His command upon whom He will of His slaves, that He may warn of the Day of Meeting,\n",
        "TRANSLATION_9": "Exalted and throned on high, He lets the Spirit descend at His behest upon whichever of His servants He will, so that he may warn of the Day of Meeting,\n",
        "TRANSLATION_10": "He is Lofty in degrees, Lord of the Throne. He casteth the spirit of His command upon whomsoever He will of His bondmen, that he may warn people of the Day of Meeting.\n",
        "TRANSLATION_11": "Raiser of ranks, Lord of the Throne, He casts the Spirit of His command upon whomever of His servants that He wishes, that he may warn [people] of the Day of Encounter.\n",
        "TRANSLATION_12": "Raised high above ranks (or degrees), (He is) the Lord of the Throne (of Authority): by His Command doth He send the Spirit (of inspiration) to any of His servants he pleases, that it may warn (men) of the Day of Mutual Meeting,-\n",
        "TRANSLATION_13": "(He is Allah) Owner of High Ranks and Degrees, the Owner of the Throne. He sends the Inspiration by His Command to any of His slaves He wills, that he (the person who receives inspiration) may warn (men) of the Day of Mutual Meeting (i.e. The Day of Resurrection).\n",
        "TRANSLATION_14": "Exalter in ranks, Owner of the Throne. He lets the spirit (the revelation) descend at His order on those of His worshipers whom He chooses, in order that He warns of the Day of the Meeting;\n",
        "TRANSLATION_15": "Exalted in rank, Owner of the Throne. He conveys the Spirit, by His command, upon whomever He wills of His servants, to warn of the Day of Encounter.\n",
        "TRANSLATION_16": "[He is] the Exalted above [all] degrees, Owner of the Throne; He places the inspiration of His command upon whom He wills of His servants to warn of the Day of Meeting.\n",
        "TRANSLATION_17": "[40:15] Exalter of ranks, [either means] that God is One Whose attributes are majestic — or [it means] the raiser of the ranks of believers in Paradise — Lord of the Throne, in other words, the Creator thereof, He casts the Spirit, the Revelation, of His command, that is, [of] His words, upon whomever He will of His servants, that he, the one upon whom it is cast, may warn them of, [that he may] make people fear, the Day of Encounter (read yawma’l-talāqi, omitting the [final long] yā’, or yawma’l-talāqī), that is to say, the Day of Resurrection, [so called] because thereat the inhabitants of the heavens will encounter those of the earth, and the worshipper [will encounter] the one whom he worshipped, and the wrongdoer [will encounter] the person whom he wronged;\n",
        "TRANSLATION_18": "(The Exalter of Ranks) the Creator of the heavens, Who has raised you above everything, (the Lord of the Throne. He casteth the Spirit of His command) He sends down Gabriel with the Qur'an (upon whom He will of His slaves) i.e. Muhammad (pbuh) (that He may warn) that Muhammad (pbuh) may warn by means of the Qur'an (of the Day of Meeting) of when the inhabitants of the earth and the inhabitants of the heavens will meet; it is also said that this means: when the Creator and created will meet,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "40:15",
            "16:2",
            "42:52",
            "43:68",
            "26:193",
            "20:5",
            "37:132",
            "37:81",
            "80:34",
            "85:15"
        ],
        "BIBLE": [
            "writings:daniel:6:8",
            "prophets:i%20samuel:2:8",
            "writings:daniel:6:13",
            "prophets:isaiah:49:11",
            "torah:leviticus:23:28",
            "prophets:malachi:3:17",
            "writings:ii%20chronicles:30:16",
            "prophets:ezekiel:13:18",
            "writings:i%20chronicles:21:3",
            "writings:psalms:59:12"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:5:4"
        ]
    }
}