{
    "VERSE": "40:17",
    "ARABIC": "ٱلْيَوْمَ تُجْزَىٰ كُلُّ نَفْسٍۭ بِمَا كَسَبَتْ لَا ظُلْمَ ٱلْيَوْمَ إِنَّ ٱللَّهَ سَرِيعُ ٱلْحِسَابِ",
    "ENGLISH": {
        "TRANSLATION_0": "Every self will be repaid today for what it earned. Today there will be no injustice. Allah is swift at reckoning.'",
        "TRANSLATION_1": "Each soul will be recompensed that Day for what it had earned. There will be no depriving on that Day. Surely God is swift at reckoning.\n",
        "TRANSLATION_2": "(It will then be said): “Today shall everyone be fully recompensed for his deeds. None shall be wronged today. Surely Allah is Swift in Reckoning.”\n",
        "TRANSLATION_3": "Every soul will be recompensed for its deeds on this Day. There will be no injustice. Certainly God's reckoning is swift.\n",
        "TRANSLATION_4": "This day each soul will be repaid for what it has earned; no one will be wronged this day; indeed Allah is Swift At Taking Account.\n",
        "TRANSLATION_5": "This Day shall every person be recompensed for what he earned. This Day no injustice. Truly, Allah is swift in reckoning.\n",
        "TRANSLATION_6": "This day every soul shall be rewarded for what it has earned; no injustice (shall be done) this day; surely Allah is quick in reckoning.\n",
        "TRANSLATION_7": "Today each soul shall be recompensed for that it has earned; no wrong today. Surely God is swift at the reckoning.'\n",
        "TRANSLATION_8": "This day is each soul requited that which it hath earned; no wrong (is done) this day. Lo! Allah is swift at reckoning.\n",
        "TRANSLATION_9": "That Day every soul shall be requited for what it has earned. On that Day none shall be wronged. And God is swift in reckoning.\n",
        "TRANSLATION_10": "To-day each soul will be recompensed for that which it hath earned; no wrong-doing to-day; verily Allah is Swift at reckoning.\n",
        "TRANSLATION_11": "‘Today every soul shall be requited for what it has earned. There will be no injustice today. Indeed Allah is swift at reckoning.’\n",
        "TRANSLATION_12": "That Day will every soul be requited for what it earned; no injustice will there be that Day, for Allah is Swift in taking account.\n",
        "TRANSLATION_13": "This Day shall every person be recompensed for what he earned. No injustice (shall be done to anybody). Truly, Allah is Swift in reckoning.\n",
        "TRANSLATION_14": "On that Day every soul shall be recompensed for its earnings and on that Day none shall be wronged. The reckoning of Allah is swift.\n",
        "TRANSLATION_15": "On that Day, every soul will be recompensed for what it had earned. There will be no injustice on that Day. God is quick to settle accounts.\n",
        "TRANSLATION_16": "This Day every soul will be recompensed for what it earned. No injustice today! Indeed, Allah is swift in account.\n",
        "TRANSLATION_17": "[40:17] Today every soul shall be requited for what it has earned; there will be no injustice today. Indeed God is swift at reckoning’, reckoning with all of creation in the space of half a day of the days of this world — a hadīth states this.\n",
        "TRANSLATION_18": "(This day) which is the Day of Judgement (each soul) whether it is righteous or sinful (is requited that which it hath earned) of good or evil; (no wrong (is done) this day) none will have his good deeds decreased or his evil works increased. (Lo! Allah is swift at reckoning) when He takes to task; it is also said that this means: When He punishes, Allah is severe in His punishment. 541\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "40:17",
            "14:51",
            "2:281",
            "16:111",
            "9:44",
            "82:19",
            "45:22",
            "16:28",
            "20:15",
            "14:34"
        ],
        "BIBLE": [
            "prophets:joshua:10:35",
            "torah:genesis:30:23",
            "torah:numbers:24:23",
            "torah:genesis:31:16",
            "prophets:joshua:10:28",
            "writings:nehemiah:5:12",
            "prophets:ii%20kings:2:10",
            "torah:genesis:21:6",
            "writings:ii%20chronicles:19:7",
            "prophets:i%20kings:18:10"
        ]
    }
}