{
    "VERSE": "40:2",
    "ARABIC": "تَنزِيلُ ٱلْكِتَٰبِ مِنَ ٱللَّهِ ٱلْعَزِيزِ ٱلْعَلِيمِ",
    "ENGLISH": {
        "TRANSLATION_0": "The revelation of the Book is from Allah, the Almighty, the All-Knowing.",
        "TRANSLATION_1": "The revelation of this Book is from God the all-mighty and all-knowing,\n",
        "TRANSLATION_2": "This Book is a revelation from Allah, the All-Mighty, the All-Knowing;\n",
        "TRANSLATION_3": "This Book is a revelation from God, the Majestic and All-knowing\n",
        "TRANSLATION_4": "The revelation of the Book is from Allah, the Most Honourable, the All Knowing.\n",
        "TRANSLATION_5": "The revelation of the Book is from Allah, the Almighty, the All-Knower.\n",
        "TRANSLATION_6": "The revelation of the Book is from Allah, the Mighty, the Knowing,\n",
        "TRANSLATION_7": "The sending down of the Book is from God the All-mighty, the All-knowing,\n",
        "TRANSLATION_8": "The revelation of the Scripture is from Allah, the Mighty, the Knower,\n",
        "TRANSLATION_9": "This Book is revealed by God, the Almighty, the All Knowing.\n",
        "TRANSLATION_10": "The revelation of the Book is from Allah, the Mighty, the Knower. Forgiver of sin, and Accepter of repentance, severe in chastisement, Lord of power. There is no god but He; Unto Him is the journeying.\n",
        "TRANSLATION_11": "The [gradual] sending down of the Book is from Allah, the All-mighty, the All-knowing,\n",
        "TRANSLATION_12": "The revelation of this Book is from Allah, Exalted in Power, Full of Knowledge,-\n",
        "TRANSLATION_13": "The revelation of the Book (this Quran) is from Allah the All-Mighty, the All-Knower.\n",
        "TRANSLATION_14": "The sending down of the Book is from Allah, the Almighty, the Knower.\n",
        "TRANSLATION_15": "The sending down of the Scripture is from God the Almighty, the Omniscient.\n",
        "TRANSLATION_16": "The revelation of the Book is from Allah, the Exalted in Might, the Knowing.\n",
        "TRANSLATION_17": "[40:2] The revelation of the Book, the Qur’ān (tanzīlu’l-kitābi is the subject), is from God (mina’Llāhi is its predicate), the Mighty, in His kingdom, the Knower, of His creatures.\n",
        "TRANSLATION_18": "(The revelation of the Scripture is) this Qur'an is a revelation (from Allah, the Mighty, the Knower) unto Muhammad (pbuh); Allah is Mighty in retribution against those who disbelieve in Him and He is also the Knower of those who believe in Him as well as of those who disbelieve in Him,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "40:2",
            "46:2",
            "45:2",
            "39:1",
            "10:65",
            "42:3",
            "40:42",
            "4:70",
            "27:9",
            "22:8"
        ],
        "BIBLE": [
            "writings:psalms:147:5",
            "prophets:micah:3:8",
            "writings:psalms:21:14",
            "prophets:isaiah:30:18",
            "writings:esther:10:2",
            "torah:deuteronomy:20:18",
            "torah:exodus:32:33",
            "torah:deuteronomy:24:4",
            "prophets:joshua:24:19",
            "torah:deuteronomy:4:7"
        ]
    }
}