{
    "VERSE": "40:21",
    "ARABIC": "أَوَلَمْ يَسِيرُوا۟ فِى ٱلْأَرْضِ فَيَنظُرُوا۟ كَيْفَ كَانَ عَٰقِبَةُ ٱلَّذِينَ كَانُوا۟ مِن قَبْلِهِمْ كَانُوا۟ هُمْ أَشَدَّ مِنْهُمْ قُوَّةً وَءَاثَارًا فِى ٱلْأَرْضِ فَأَخَذَهُمُ ٱللَّهُ بِذُنُوبِهِمْ وَمَا كَانَ لَهُم مِّنَ ٱللَّهِ مِن وَاقٍ",
    "ENGLISH": {
        "TRANSLATION_0": "Have they not travelled in the earth and seen the final fate of those before them? They were greater than them in strength and left far deeper traces on the earth, yet Allah seized them for their wrong actions and they had no one to protect them from Allah.",
        "TRANSLATION_1": "Have they not travelled on the earth that they could see what happened to those before them? They were greater in strength than they, and have left behind them traces on the earth. Yet they were seized by God for their sins, and had none to protect them against God.\n",
        "TRANSLATION_2": "Have they not journeyed in the land that they might observe the end of those who came before them? They were even greater in strength than they and left behind more splendid traces in the land. Then Allah seized them because of their sins and they had none who could protect them from Allah.\n",
        "TRANSLATION_3": "Have they not travelled through the land to see the terrible end of those who lived before them. They had been mightier than them in power and in leaving their traces on earth. God punished them for their sins. They had no one to save them from God's torment.\n",
        "TRANSLATION_4": "So did they not travel in the land in order to see what sort of fate befell those before them? Their strength and the signs they left behind in the earth, exceeded them – so Allah seized them on account of their sins, and they had no one to save them from Allah.\n",
        "TRANSLATION_5": "Have they not traveled in the land and seen what was the end of those who were before them They were superior to them in strength, and in the traces in the land. But Allah seized them with punishment for their sins. And none had they to protect them from Allah.\n",
        "TRANSLATION_6": "Have they not travelled in the earth and seen how was the end of those who were before them? Mightier than these were they in strength-- and in fortifications in the land, but Allah destroyed them for their sins; and there was not for them any defender against Allah.\n",
        "TRANSLATION_7": "What, have they not journeyed in the land and beheld how was the end of those before them? They were stronger than themselves in might and left firmer traces in the earth; yet God seized them in their sins, and they had none to defend them from God.\n",
        "TRANSLATION_8": "Have they not travelled in the land to see the nature of the consequence for those who disbelieved before them? They were mightier than these in power and (in the) traces (which they left behind them) in the earth. Yet Allah seized them for their sins, and they had no protector from Allah.\n",
        "TRANSLATION_9": "Have they not travelled through the land and seen what was the end of those who have gone before them? They were stronger than them and made a more impressive mark upon the land, yet God destroyed them for their sins, they had no one to defend them against Him,\n",
        "TRANSLATION_10": "Have they not travelled about in the land so that they may behold of what wise hath been the end of those who were before them? They were mightier than these in strength and in the traces in the land. Yet Allah laid hold of them for their sins, and from Allah they had none as protector.\n",
        "TRANSLATION_11": "Have they not travelled through the land so that they may observe how was the fate of those who were before them? They were greater than them in might and with respect to the effects [they left] in the land. But then Allah seized them for their sins, and they had no defender against Allah [’s punishment].\n",
        "TRANSLATION_12": "Do they not travel through the earth and see what was the End of those before them? They were even superior to them in strength, and in the traces (they have left) in the land: but Allah did call them to account for their sins, and none had they to defend them against Allah.\n",
        "TRANSLATION_13": "Have they not travelled in the land and seen what was the end of those who were before them? They were superior to them in strength, and in the traces (which they left) in the land. But Allah seized them with punishment for their sins. And none had they to protect them from Allah.\n",
        "TRANSLATION_14": "Have they never journeyed through the land and seen what was the end of those who have gone before them? They were stronger than themselves in might and left firmer traces in the earth, but Allah seized them for their sinning, and they had none to protect them from Allah.\n",
        "TRANSLATION_15": "Have they not travelled through the earth, and seen the consequences for those before them? They were stronger than them, and they left more impact on earth. But God seized them for their sins, and they had no defender against God.\n",
        "TRANSLATION_16": "Have they not traveled through the land and observed how was the end of those who were before them? They were greater than them in strength and in impression on the land, but Allah seized them for their sins. And they had not from Allah any protector.\n",
        "TRANSLATION_17": "[40:21] Have they not travelled in the land and beheld the nature of the consequence for those who were before them? They were more powerful than them (a variant reading has minkum, ‘than yourselves’) in strength and in [their] vestiges on earth, in the way of large structures and palaces. Yet God seized them, He destroyed them, for their sins and they had none to shield them from God, from His chastisement.\n",
        "TRANSLATION_18": "(Have they not travelled) i.e. the disbelievers of Mecca (in the land to see) to reflect on (the nature of the consequence for) the requital of (those who disbelieved before them? They were mightier than these in power) in physical strength (and (in the) traces (which they left behind them) in the earth) they were more keen to possess the life of this world and to travel much farther in its pursuit. (Yet Allah sewed them for their sins) yet Allah punished them because of their sins and disbelief, (and they had no protector from Allah) from Allah's punishment.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "40:21",
            "40:82",
            "30:9",
            "35:44",
            "47:10",
            "30:42",
            "28:78",
            "41:15",
            "3:137",
            "3:11"
        ],
        "BIBLE": [
            "prophets:jeremiah:16:19",
            "prophets:i%20samuel:13:10",
            "prophets:i%20kings:10:7",
            "writings:ii%20chronicles:9:6",
            "prophets:ii%20samuel:24:8",
            "prophets:isaiah:13:5",
            "writings:ii%20chronicles:25:16",
            "prophets:ii%20samuel:7:23",
            "writings:daniel:4:20",
            "prophets:i%20kings:13:12"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:6:5"
        ]
    }
}