{
    "VERSE": "40:22",
    "ARABIC": "ذَٰلِكَ بِأَنَّهُمْ كَانَت تَّأْتِيهِمْ رُسُلُهُم بِٱلْبَيِّنَٰتِ فَكَفَرُوا۟ فَأَخَذَهُمُ ٱللَّهُ إِنَّهُۥ قَوِىٌّ شَدِيدُ ٱلْعِقَابِ",
    "ENGLISH": {
        "TRANSLATION_0": "That was because their Messengers brought them the Clear Signs but they remained kafir. So Allah seized them. He is Most Strong, Severe in Retribution.",
        "TRANSLATION_1": "This was so because their apostles came with clear proofs to them, but they refused to believe. So they were seized by God. Surely God is powerful, unrelenting in retribution.\n",
        "TRANSLATION_2": "They came to this end because their Messengers would come to them with Clear Signs and yet they would refuse to believe. So Allah seized them. He is indeed Strong, Terrible in Retribution.\n",
        "TRANSLATION_3": "Messengers had come to them with illustrious miracles but they disbelieved and thus God struck them with His torment. He is Mighty and Severe in His retribution.\n",
        "TRANSLATION_4": "This occurred because their Noble Messengers came to them with clear signs, thereupon they used to disbelieve, so Allah seized them; indeed Allah is All Powerful, Severe in Punishment.\n",
        "TRANSLATION_5": "That was because there came to them their Messengers with clear evidences but they disbelieved (in them). So Allah seized them. Verily, He is All-Strong, Severe in punishment.\n",
        "TRANSLATION_6": "That was because there came to them their apostles with clear arguments, but they rejected (them), therefore Allah destroyed them; surely He is Strong, Severe in retribution.\n",
        "TRANSLATION_7": "That was because their Messengers came to them with the clear signs; but they disbelieved, so God seized them. Surely He is All-strong, terrible in retribution.\n",
        "TRANSLATION_8": "That was because their messengers kept bringing them clear proofs (of Allah's Sovereignty) but they disbelieved; so Allah seized them. Lo! He is Strong, severe in punishment.\n",
        "TRANSLATION_9": "that was because their messengers came to them with clear signs but they rejected them. So God seized them: He is powerful, severe in punishment.\n",
        "TRANSLATION_10": "That was because their apostles were wont to bring them evidence, but they disbelieved; wherefore Allah laid hold of them. Verily He is strong, severe in chastisement.\n",
        "TRANSLATION_11": "That was because their apostles used to bring them manifest proofs, but they defied [them]. So Allah seized them. Indeed He is all-strong, severe in retribution.\n",
        "TRANSLATION_12": "That was because there came to them their messengers with Clear (Signs), but they rejected them: So Allah called them to account: for He is Full of Strength, Strict in Punishment.\n",
        "TRANSLATION_13": "That was because there came to them their Messengers with clear evidences, proofs and signs but they disbelieved (in them). So Allah seized them with punishment. Verily, He is All-Strong, Severe in punishment.\n",
        "TRANSLATION_14": "That was because they disbelieved their Messengers when they came to them with clear signs, and so Allah seized them. Surely, He is Strong, and Stern in retribution.\n",
        "TRANSLATION_15": "That is because their messengers used to come to them with clear proofs, but they disbelieved, so God seized them. He is Strong, Severe in retribution.\n",
        "TRANSLATION_16": "That was because their messengers were coming to them with clear proofs, but they disbelieved, so Allah seized them. Indeed, He is Powerful and severe in punishment.\n",
        "TRANSLATION_17": "[40:22] That was because their messengers used to bring them clear signs, manifest miracles, but they disbelieved. So God seized them. Indeed He is Strong, Severe in punishment.\n",
        "TRANSLATION_18": "(That) punishment in the life of this world (was because their messengers kept bringing them clear proofs) of commands and prohibitions as well as signs (but they disbelieved) in the messengers and in the message they brought; (so Allah seized them) with punishment. (Lo! He is Strong) when He seizes, (Severe in punishment) towards whoever He punishes.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "40:22",
            "8:13",
            "59:4",
            "64:6",
            "30:9",
            "2:211",
            "4:150",
            "9:80",
            "8:52",
            "3:86"
        ],
        "BIBLE": [
            "writings:esther:2:14",
            "prophets:judges:15:19",
            "prophets:jeremiah:16:19",
            "torah:genesis:19:5",
            "prophets:jeremiah:35:17",
            "torah:exodus:3:1",
            "prophets:isaiah:41:9",
            "torah:genesis:41:14",
            "prophets:i%20samuel:3:10",
            "prophets:i%20kings:13:21"
        ]
    }
}