{
    "VERSE": "40:27",
    "ARABIC": "وَقَالَ مُوسَىٰٓ إِنِّى عُذْتُ بِرَبِّى وَرَبِّكُم مِّن كُلِّ مُتَكَبِّرٍ لَّا يُؤْمِنُ بِيَوْمِ ٱلْحِسَابِ",
    "ENGLISH": {
        "TRANSLATION_0": "Musa said, 'I seek refuge in my Lord and your Lord from every proud man who does not have iman in the Day of Reckoning.'",
        "TRANSLATION_1": "Moses said: \"I seek refuge in my Lord and your Lord from every insolent imposter who does not believe in the Day of Reckoning.\"\n",
        "TRANSLATION_2": "Moses said: “I have taken refuge with my Lord and your Lord from everyone who waxes arrogant and does not believe in the Day of Reckoning.”\n",
        "TRANSLATION_3": "Moses said, \"I seek protection from your and my Lord against every arrogant person who has no faith in the Day of Judgment.\"\n",
        "TRANSLATION_4": "Said Moosa, “I seek the refuge of mine and your Lord, from every haughty person who does not believe in the Day of Reckoning.”\n",
        "TRANSLATION_5": "Musa said: \"Verily, I seek refuge in my Lord and your Lord from every arrogant who believes not in the Day of Reckoning!\"\n",
        "TRANSLATION_6": "And Musa said: Surely I take refuge with my Lord and-- your Lord from every proud one who does not believe in the day of reckoning.\n",
        "TRANSLATION_7": "And Moses said, 'I take refuge in my Lord and your Lord from every man who is proud, and believes not in the Day of Reckoning.'\n",
        "TRANSLATION_8": "Moses said: Lo! I seek refuge in my Lord and your Lord from every scorner who believeth not in a Day of Reckoning.\n",
        "TRANSLATION_9": "Moses replied, \"I seek refuge with my Lord and your Lord from every arrogant person who does not believe in the Day of Reckoning.\"\n",
        "TRANSLATION_10": "And Musa said: verily I seek refuge in my Lord and your Lord from every stiff-necked person who believeth not in a Day of Reckoning.\n",
        "TRANSLATION_11": "Moses said, ‘I seek the protection of my Lord and your Lord from every arrogant one who does not believe in the Day of Reckoning.’\n",
        "TRANSLATION_12": "Moses said: \"I have indeed called upon my Lord and your Lord (for protection) from every arrogant one who believes not in the Day of Account!\"\n",
        "TRANSLATION_13": "Musa (Moses) said: \"Verily, I seek refuge in my Lord and your Lord from every arrogant who believes not in the Day of Reckoning!\"\n",
        "TRANSLATION_14": "Moses said: 'I take refuge in my Lord and in your Lord from every proud (person), who does not believe in Day of Reckoning'\n",
        "TRANSLATION_15": "Moses said, “I have sought the protection of my Lord and your Lord, from every tyrant who does not believe in the Day of Account.”\n",
        "TRANSLATION_16": "But Moses said, \"Indeed, I have sought refuge in my Lord and your Lord from every arrogant one who does not believe in the Day of Account.\"\n",
        "TRANSLATION_17": "[40:27] And Moses said, to his people, after he had heard that [saying of Pharaoh]: ‘Indeed I seek refuge in my Lord and your Lord from every arrogant one who does not believe in the Day of Reckoning’.\n",
        "TRANSLATION_18": "(Moses said: Lo! I seek refuge in my Lord and your Lord from every scorner) who is too proud to believe and (who believeth not in a Day of Reckoning) i.e. the Day of Judgement.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "40:27",
            "14:41",
            "23:65",
            "17:20",
            "44:20",
            "11:57",
            "15:36",
            "38:79",
            "36:27",
            "27:91"
        ],
        "BIBLE": [
            "torah:genesis:2:23",
            "prophets:ii%20samuel:18:18",
            "torah:numbers:31:49",
            "torah:numbers:16:15",
            "writings:nehemiah:5:12",
            "torah:genesis:22:14",
            "torah:genesis:3:9",
            "prophets:isaiah:41:9",
            "prophets:isaiah:4:1",
            "torah:genesis:49:1"
        ]
    }
}