{
    "VERSE": "40:28",
    "ARABIC": "وَقَالَ رَجُلٌ مُّؤْمِنٌ مِّنْ ءَالِ فِرْعَوْنَ يَكْتُمُ إِيمَٰنَهُۥٓ أَتَقْتُلُونَ رَجُلًا أَن يَقُولَ رَبِّىَ ٱللَّهُ وَقَدْ جَآءَكُم بِٱلْبَيِّنَٰتِ مِن رَّبِّكُمْ وَإِن يَكُ كَٰذِبًا فَعَلَيْهِ كَذِبُهُۥ وَإِن يَكُ صَادِقًا يُصِبْكُم بَعْضُ ٱلَّذِى يَعِدُكُمْ إِنَّ ٱللَّهَ لَا يَهْدِى مَنْ هُوَ مُسْرِفٌ كَذَّابٌ",
    "ENGLISH": {
        "TRANSLATION_0": "A man among Pharaoh's people who had iman, but kept his iman concealed, said, 'Are you going to kill a be it on his own head. But if he is telling the truth, then some of what he is promising you will certainly happen to you. Allah does not guide any unbridled inveterate liar.",
        "TRANSLATION_1": "A believer from the House of Pharaoh who had kept his faith to himself, said: \"Will you kill a man because he says: 'My Lord is God,' when he has brought clear signs from his Lord to you? If he is a liar his lie will recoil back on him; but in case he speaks the truth, then what he predicts will befall you. Surely God does not show the way to the shameful liar.\n",
        "TRANSLATION_2": "Then a man endowed with faith, from Pharaoh's folk, who had kept his faith hidden, said: “Do you kill a person simply because he says: 'My Lord is Allah' even though he brought to you clear Signs from your Lord? If he is a liar, his lying will recoil upon him; but if he is truthful, you will be smitten with some of the awesome consequences of which he warns you. Allah does not guide to the Right Way any who exceeds the limits and is an utter liar.\n",
        "TRANSLATION_3": "A believing person from the people of the Pharaoh who concealed his faith said, \"Would you kill a man just because he says God is my Lord? He has brought you illustrious miracles from your Lord. If he speaks lies, it will only harm him, but if he speaks the Truth, some of his warnings may affect you. God does not guide a transgressing liar.\n",
        "TRANSLATION_4": "And said a Muslim man from the people of Firaun, who used to hide his faith, “What! You want to kill a man just because he says, ‘Allah is my Lord’ whereas he has indeed brought clear signs to you from your Lord? And supposedly if he is speaking wrongly, then the calamity of wrongful speech is upon him; and if he is truthful, then part of what he promises you will reach you; indeed Allah does not guide any transgressor, excessive liar.”\n",
        "TRANSLATION_5": "And a believing man of Fir`awn's family, who hid his Faith said: \"Would you kill a man because he says: `My Lord is Allah,' and he has come to you with clear signs from your Lord And if he is a liar, upon him will be (the sin of) his lie; but if he is telling the truth, then some of that (calamity) wherewith he threatens you will befall on you.\" Verily, Allah guides not one who is a transgressor, a liar!\n",
        "TRANSLATION_6": "And a believing man of Firon's people who hid his faith said: What! will you slay a man because he says: My Lord is Allah, and indeed he has brought to you clear arguments from your Lord? And if he be a liar, on him will be his lie, and if he be truthful, there will befall you some of that which he threatens you (with); surely Allah does not guide him who is extravagant, a liar:\n",
        "TRANSLATION_7": "Then said a certain man, a believer 'of Pharaoh's folk that kept hidden his belief, 'What, will you slay a man because he says, \"My Lord is God,\" yet he has brought you the clear signs from your Lord? If he is a liar, his lying is upon his own head; but if he is truthful, somewhat of that he promises you will smite you. Surely God guides not him who is prodigal and a liar.\n",
        "TRANSLATION_8": "And a believing man of Pharaoh's family, who hid his faith, said: Would ye kill a man because he saith: My Lord is Allah, and hath brought you clear proofs from your Lord? If he is lying, then his lie is upon him; and if he is truthful, then some of that wherewith he threateneth you will strike you. Lo! Allah guideth not one who is a prodigal, a liar.\n",
        "TRANSLATION_9": "A believer, a man from among the people of Pharaoh, who had concealed his faith, said, \"Would you slay a man merely because he says, \"My Lord is God.\" He has brought you clear signs from your Lord, and if he is lying, the sin of his will be on his own head; but if he is truthful, a part of that of which he warns you will surely befall you. Certainly, God does not guide one who is a transgressor and a liar.\n",
        "TRANSLATION_10": "And a believing man of Fir'awn 's household, hiding his belief, said: would ye slay a man because he saith: my Lord is God, and hath come upto you with evidences from your Lord? If he is a liar, then upon him will be his lie, and if he is a truth-teller, then there will befall you some of that wherewith he threateneth you; verily God guideth not one who is an extravagant and a liar.\n",
        "TRANSLATION_11": "Said a man of faith from Pharaoh’s clan, who concealed his faith, ‘Will you kill a man for saying, ‘‘My Lord is Allah,’’ while he has already brought you manifest proofs from your Lord? Should he be lying, his falsehood will be to his own detriment; but if he is truthful, there shall visit you some of what he promises you. Indeed Allah does not guide someone who is a transgressor and liar.\n",
        "TRANSLATION_12": "A believer, a man from among the people of Pharaoh, who had concealed his faith, said: \"Will ye slay a man because he says, 'My Lord is Allah'?- when he has indeed come to you with Clear (Signs) from your Lord? and if he be a liar, on him is (the sin of) his lie: but, if he is telling the Truth, then will fall on you something of the (calamity) of which he warns you: Truly Allah guides not one who transgresses and lies!\n",
        "TRANSLATION_13": "And a believing man of Fir'aun's (Pharaoh) family, who hid his faith said: \"Would you kill a man because he says: My Lord is Allah, and he has come to you with clear signs (proofs) from your Lord? And if he is a liar, upon him will be (the sin of) his lie; but if he is telling the truth, then some of that (calamity) wherewith he threatens you will befall on you.\" Verily, Allah guides not one who is a Musrif (a polytheist, or a murderer who shed blood without a right, or those who commit great sins, oppressor, transgressor), a liar!\n",
        "TRANSLATION_14": "But one of Pharaoh's people, who was in secret a believer, asked: 'Would you kill a man because he says: \"My Lord is Allah?\" He has brought you clear signs from your Lord. If he is lying, let his lie be on his head, but, if he is speaking the truth then at least a part of what he promises will befall you. Allah does not guide the lying sinner.\n",
        "TRANSLATION_15": "A believing man from Pharaoh's family, who had concealed his faith, said, “Are you going to kill a man for saying, `My Lord is God,’ and he has brought you clear proofs from your Lord? If he is a liar, his lying will rebound upon him; but if he is truthful, then some of what he promises you will befall you. God does not guide the extravagant imposter.\n",
        "TRANSLATION_16": "And a believing man from the family of Pharaoh who concealed his faith said, \"Do you kill a man [merely] because he says, 'My Lord is Allah' while he has brought you clear proofs from your Lord? And if he should be lying, then upon him is [the consequence of] his lie; but if he should be truthful, there will strike you some of what he promises you. Indeed, Allah does not guide one who is a transgressor and a liar.\n",
        "TRANSLATION_17": "[40:28] Then said a believing man from among Pharaoh’s folk — this is said to have been his paternal cousin — who had concealed his faith, ‘Will you slay a man for saying, “My Lord is God”, even though he has [also] brought you clear signs, manifest miracles, from your Lord? If he is lying, then his mendacity will be to his own detriment, that is, the harm resulting from his mendacity [will be to his own detriment]; but if he is truthful, then there will befall you some of that with which he is threatening you, in the way of chastisement, soon. Truly God does not guide one who is a prodigal, an idolater, a liar.\n",
        "TRANSLATION_18": "(And a believing man) Ezekiel (of Pharaoh's family) who was Pharaoh's cousin, (who hid his faith) from Pharaoh and his folk; it is also said that this means: a believing man, Ezekiel, who hid his faith from Pharaoh's family (said: Would ye kill a man because he saith: My Lord is Allah) and He has sent me to you, (and hath brought you clear proofs) commands, prohibitions and signs of his prophethood (from your Lord? If he is lying) in what he says, (then his lie is upon him) the punishment of his lying is to his own hurt; (and if he is truthful) in what he says and you still disbelieve in him (then some of that wherewith he threatens you) of punishment (will strike you) in the life of this world. (Lo! Allah guideth not) Allah leads not to His religion (one who is a prodigal) an idolater, (a liar) against Allah.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "40:28",
            "3:183",
            "43:63",
            "3:50",
            "40:66",
            "11:88",
            "11:63",
            "5:51",
            "23:38",
            "10:69"
        ],
        "BIBLE": [
            "prophets:ii%20kings:6:32",
            "prophets:ii%20kings:9:6",
            "prophets:ii%20kings:10:6",
            "writings:i%20chronicles:12:20",
            "prophets:i%20samuel:14:45",
            "prophets:joshua:24:17",
            "prophets:ezekiel:22:31",
            "prophets:ezekiel:21:24",
            "prophets:judges:16:17",
            "prophets:ii%20kings:10:8"
        ]
    }
}