{
    "VERSE": "40:3",
    "ARABIC": "غَافِرِ ٱلذَّنۢبِ وَقَابِلِ ٱلتَّوْبِ شَدِيدِ ٱلْعِقَابِ ذِى ٱلطَّوْلِ لَآ إِلَٰهَ إِلَّا هُوَ إِلَيْهِ ٱلْمَصِيرُ",
    "ENGLISH": {
        "TRANSLATION_0": "The Forgiver of wrong action, the Accepter of tawba, the Severe in retribution, the Possessor of abundance. There is no god but Him. He is the final destination.",
        "TRANSLATION_1": "Forgiver of trespasses, acceptor of repentance, severe of retribution, lord of power. There is no god but He. Towards Him is your destination.\n",
        "TRANSLATION_2": "the Forgiver of sins, the Accepter of repentance, the Stern in retribution, the Bountiful. There is no god but He. To Him are all destined to return.\n",
        "TRANSLATION_3": "who forgives sins, who accepts repentance, whose punishment is severe, and whose bounty is universal. He is the only Lord and to Him all things proceed.\n",
        "TRANSLATION_4": "The Forgiver of sin, and the Most Acceptor of Repentance, the Severe in Punishing, the Greatly Rewarding; there is no God except Him; towards Him only is the return.\n",
        "TRANSLATION_5": "The Forgiver of sin, the Acceptor of repentance, the Severe in punishment, the Bestower. La ilaha illa Huwa, to Him is the final return.\n",
        "TRANSLATION_6": "The Forgiver of the faults and the Acceptor of repentance, Severe to punish, Lord of bounty; there is no god but He; to Him is the eventual coming.\n",
        "TRANSLATION_7": "Forgiver of sins, Accepter of penitence, Terrible in retribution, the Bountiful; there is no god but He, and unto Him is the homecoming.\n",
        "TRANSLATION_8": "The Forgiver of sin, the Accepter of repentance, the Stern in punishment, the Bountiful. There is no Allah save Him. Unto Him is the journeying.\n",
        "TRANSLATION_9": "The Forgiver of sin and the Accepter of repentance, who is severe in punishment and Infinite in His Bounty. There is no God but Him. All shall return to Him.\n",
        "TRANSLATION_10": "Forgiver of sin, and Acceptor of repentance severe in chastisement, Lord of Power. There is no god but He; unto Him is the journeying.\n",
        "TRANSLATION_11": "forgiver of sins and acceptor of repentance, severe in retribution, [yet] all-bountiful; there is no god except Him, [and] toward Him is the destination.\n",
        "TRANSLATION_12": "Who forgiveth sin, accepteth repentance, is strict in punishment, and hath a long reach (in all things). there is no god but He: to Him is the final goal.\n",
        "TRANSLATION_13": "The Forgiver of sin, the Acceptor of repentance, the Severe in punishment, the Bestower (of favours), La ilaha illa Huwa (none has the right to be worshipped but He), to Him is the final return.\n",
        "TRANSLATION_14": "The Forgiver of sins and the Acceptor of repentance. Stern in retribution, the Bountiful, there is no god except He and to Him is the arrival.\n",
        "TRANSLATION_15": "Forgiver of sins, Accepter of repentance, Severe in punishment, Bountiful in bounty. There is no god but He. To Him is the ultimate return.\n",
        "TRANSLATION_16": "The forgiver of sin, acceptor of repentance, severe in punishment, owner of abundance. There is no deity except Him; to Him is the destination.\n",
        "TRANSLATION_17": "[40:3] Forgiver of sins, for believers, and Accepter of repentance, from them (al-tawb is the verbal noun), Severe in punishment, of disbelievers — in other words, One Who makes it severe for them — One of [abundant] bounty, bestower of abundant grace — God is eternally possessed of all of these attributes, and so the annexation construction using the derivatives [of these attributes] is for the purposes of characterisation, as in the case of the last. There is no god except Him; to Him is the journeying, the [ultimate] return.\n",
        "TRANSLATION_18": "(The Forgiver of sin) He forgives the sins of those who say: \"there is no deity except Allah\", (the Acceptor of repentance) He accepts those who repent of idolatry, (the Stern in punishment) regarding those who die as idolaters, (the Bountiful) the Possessor of favour and grace and independence from need; that is to say he 539 has favours and graces for those who believe in him and is independent from need of those who disbelieve in Him. (There is no God) who does this (save Him. Unto Him is the journeying) to Him is the journeying of those who believe in Him as well as of those who do not believe in Him.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "40:3",
            "3:11",
            "8:25",
            "8:52",
            "47:19",
            "40:22",
            "5:98",
            "59:4",
            "8:13",
            "40:21"
        ],
        "BIBLE": [
            "prophets:joshua:1:17",
            "prophets:hosea:8:13",
            "prophets:zephaniah:2:11",
            "prophets:i%20kings:12:24",
            "prophets:isaiah:55:7",
            "writings:daniel:11:28",
            "torah:leviticus:5:17",
            "prophets:jeremiah:23:14",
            "torah:numbers:22:38",
            "prophets:malachi:1:9"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:13"
        ]
    }
}