{
    "VERSE": "40:30",
    "ARABIC": "وَقَالَ ٱلَّذِىٓ ءَامَنَ يَٰقَوْمِ إِنِّىٓ أَخَافُ عَلَيْكُم مِّثْلَ يَوْمِ ٱلْأَحْزَابِ",
    "ENGLISH": {
        "TRANSLATION_0": "The man who had iman said, 'My people! I fear for you a day like that of the Confederates,",
        "TRANSLATION_1": "But the man of belief said: \"O my people, what I fear for you is the like of what befell the communities (of old).\n",
        "TRANSLATION_2": "He who had faith said: “My people, I fear that you will confront a day like that which overtook many parties before you,\n",
        "TRANSLATION_3": "The believing man said, \"I am afraid that you will face a (terrible) day like that of the groups:\n",
        "TRANSLATION_4": "And the believer said, “O my people! I fear for you a day similar to that of the earlier groups!”\n",
        "TRANSLATION_5": "And he who believed said: \"O my people! Verily, I fear for you an end like that day (of disaster) of the groups (of old)!\"\n",
        "TRANSLATION_6": "And he who believed said: O my people! surely I fear for you the like of what befell the parties:\n",
        "TRANSLATION_7": "Then said he who believed, 'My people, truly I fear for you the like of the day of the parties,\n",
        "TRANSLATION_8": "And he who believed said: O my people! Lo! I fear for you a fate like that of the factions (of old);\n",
        "TRANSLATION_9": "The believer said, \"My people! I fear for you a fate like that of the people of old:\n",
        "TRANSLATION_10": "And he who believed said: O my people. verily I fear for you a fate like the day of the confederates.\n",
        "TRANSLATION_11": "He who had faith said, ‘O my people! Indeed I fear for you [a day] like the day of the [heathen] factions;\n",
        "TRANSLATION_12": "Then said the man who believed: \"O my people! Truly I do fear for you something like the Day (of disaster) of the Confederates (in sin)!-\n",
        "TRANSLATION_13": "And he who believed said: \"O my people! Verily, I fear for you a fate like that day (of disaster) of the Confederates (of old)!\n",
        "TRANSLATION_14": "The one who believed said: 'I fear for you the like of the day of the confederates my nation,\n",
        "TRANSLATION_15": "The one who had believed said, “O my people, I fear for you the like of the day of the confederates.\n",
        "TRANSLATION_16": "And he who believed said, \"O my people, indeed I fear for you [a fate] like the day of the companies -\n",
        "TRANSLATION_17": "[40:30] Then said he who believed, ‘O my people! Truly I fear for you [a day] like the day of the factions, in other words, the day of one faction [being destroyed] after another;\n",
        "TRANSLATION_18": "(And he who believed) i.e. Ezekiel (said: my people! Lo! I fear for you) I know that you will have (a fate like that of the factions (of old)) a punishment like that of the disbelievers of old;\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "40:30",
            "40:32",
            "10:102",
            "23:16",
            "21:52",
            "40:38",
            "36:59",
            "66:7",
            "20:101",
            "23:111"
        ],
        "BIBLE": [
            "prophets:jeremiah:16:19",
            "writings:ecclesiastes:7:14",
            "writings:daniel:8:17",
            "torah:deuteronomy:4:32",
            "writings:daniel:12:8",
            "writings:daniel:12:6",
            "prophets:ezekiel:2:3",
            "torah:numbers:24:20",
            "torah:deuteronomy:32:20",
            "torah:numbers:16:22"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:11"
        ]
    }
}