{
    "VERSE": "40:32",
    "ARABIC": "وَيَٰقَوْمِ إِنِّىٓ أَخَافُ عَلَيْكُمْ يَوْمَ ٱلتَّنَادِ",
    "ENGLISH": {
        "TRANSLATION_0": "My people! I fear for you the Day of Calling Out,",
        "TRANSLATION_1": "O my people, what I fear for you is the day of gathering, crying and calling,\n",
        "TRANSLATION_2": "My people, I fear that you will encounter a day when there will be much wailing and you will cry out to one another for help,\n",
        "TRANSLATION_3": "My people, I am afraid for you on (the Day of Judgment), when people will cry for help.\n",
        "TRANSLATION_4": "“O my people! I fear for you a day on which will be a great outcry!”\n",
        "TRANSLATION_5": "And, O my people! Verily, I fear for you the Day when there will be mutual calling.\"\n",
        "TRANSLATION_6": "And, O my people! I fear for you the day of calling out,\n",
        "TRANSLATION_7": "O my people, I fear for you the Day of Invocation,\n",
        "TRANSLATION_8": "And, O my people! Lo! I fear for you a Day of Summoning,\n",
        "TRANSLATION_9": "My people, I fear for you the Day you will cry out to one another,\n",
        "TRANSLATION_10": "And, O my people! verily fear for you a Day of Mutual Calling.\n",
        "TRANSLATION_11": "O my people! I fear for you a day of mutual distress calls,\n",
        "TRANSLATION_12": "And O my people! I fear for you a Day when there will be Mutual calling (and wailing),-\n",
        "TRANSLATION_13": "And, O my people! Verily! I fear for you the Day when there will be mutual calling (between the people of Hell and of Paradise).\"\n",
        "TRANSLATION_14": "And, my nation, I fear for you the Day of Calling,\n",
        "TRANSLATION_15": "O my people, I fear for you the Day of Calling Out.\n",
        "TRANSLATION_16": "And O my people, indeed I fear for you the Day of Calling -\n",
        "TRANSLATION_17": "[40:32] And O my people! Truly I fear for you a day of [mutual] calling (read yawma’l-tanādi, omitting the [final long] yā’, or retaining it thus: yawma’l-tanādī) that is to say, the Day of Resurrection, in which repeated calls are made by those meriting Paradise to those meriting the Fire and vice versa, as well as calls [proclaiming] good fortune for those who merit the former and misery for those who merit the latter and [many] other such [calls],\n",
        "TRANSLATION_18": "(And, O my people! Lo! I fear for) I know that you will suffer the torment of (a Day of Summoning) when you will call one another and when the people of the Heights will call you; and it is also said this is the Day when people will flee from each other,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "40:32",
            "23:16",
            "40:30",
            "36:59",
            "15:62",
            "68:39",
            "23:65",
            "23:111",
            "75:1",
            "28:65"
        ],
        "BIBLE": [
            "prophets:i%20samuel:12:18",
            "torah:deuteronomy:28:10",
            "torah:genesis:49:1",
            "torah:genesis:1:8",
            "prophets:isaiah:49:1",
            "torah:genesis:5:2",
            "torah:genesis:22:14",
            "prophets:judges:12:2",
            "prophets:isaiah:4:1",
            "writings:daniel:9:19"
        ]
    }
}