{
    "VERSE": "40:36",
    "ARABIC": "وَقَالَ فِرْعَوْنُ يَٰهَٰمَٰنُ ٱبْنِ لِى صَرْحًا لَّعَلِّىٓ أَبْلُغُ ٱلْأَسْبَٰبَ",
    "ENGLISH": {
        "TRANSLATION_0": "Pharaoh said, 'Haman, build me a tower so that perhaps I may gain means of access,",
        "TRANSLATION_1": "The Pharaoh said: \"O Haman, build me a lofty tower that I may perhaps find the means\n",
        "TRANSLATION_2": "Pharaoh said: “Haman, build for me a lofty tower that I may scale the highways --\n",
        "TRANSLATION_3": "Pharaoh said, \"Haman, build a tower of baked bricks for me so that I shall have access.\n",
        "TRANSLATION_4": "And said Firaun, “O Haman! Build a high palace for me, in order that I may reach the routes.” –\n",
        "TRANSLATION_5": "And Fir`awn said: \"O Haman! Build me a lofty tower that I may arrive at the ways --\n",
        "TRANSLATION_6": "And Firon said: O Haman! build for me a tower that I may attain the means of access,\n",
        "TRANSLATION_7": "Pharaoh said, 'Haman, build for me a tower, that haply so I may reach the cords,\n",
        "TRANSLATION_8": "And Pharaoh said: O Haman! Build for me a tower that haply I may reach the roads,\n",
        "TRANSLATION_9": "Pharaoh said, \"O Haman, build for me a lofty building so that I may gain access\n",
        "TRANSLATION_10": "And Fir'awn said: O Haman! build for me a tower that haply I may reach the ways of access\n",
        "TRANSLATION_11": "Pharaoh said, ‘O Haman! Build me a tower so that I may reach the routes\n",
        "TRANSLATION_12": "Pharaoh said: \"O Haman! Build me a lofty palace, that I may attain the ways and means-\n",
        "TRANSLATION_13": "And Fir'aun (Pharaoh) said: \"O Haman! Build me a tower that I may arrive at the ways,\n",
        "TRANSLATION_14": "Pharaoh said: 'Haman, build me a tower that I can reach the ways,\n",
        "TRANSLATION_15": "And Pharaoh said, “O Hamaan, build me a tower, that I may reach the pathways.\n",
        "TRANSLATION_16": "And Pharaoh said, \"O Haman, construct for me a tower that I might reach the ways -\n",
        "TRANSLATION_17": "[40:36]   And Pharaoh said, ‘O Hāmān! Build for me a tower, a lofty edifice, that perhaps I may reach the routes —\n",
        "TRANSLATION_18": "(And Pharaoh said) to his aid: (0 Haman! Build for me a tower that haply I may reach the roads) that I may climb up to the gates,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "40:36",
            "3:43",
            "28:38",
            "7:104",
            "17:8",
            "36:27",
            "26:83",
            "18:89",
            "18:92",
            "37:100"
        ],
        "BIBLE": [
            "writings:ii%20chronicles:8:11",
            "torah:genesis:11:4",
            "prophets:ii%20kings:3:8",
            "writings:psalms:25:4",
            "prophets:isaiah:49:9",
            "writings:daniel:4:27",
            "prophets:judges:18:6",
            "prophets:i%20samuel:9:6",
            "prophets:ii%20kings:5:19",
            "prophets:isaiah:2:3"
        ]
    }
}