{
    "VERSE": "40:38",
    "ARABIC": "وَقَالَ ٱلَّذِىٓ ءَامَنَ يَٰقَوْمِ ٱتَّبِعُونِ أَهْدِكُمْ سَبِيلَ ٱلرَّشَادِ",
    "ENGLISH": {
        "TRANSLATION_0": "The man who had iman said, 'My people! follow me and I will guide you to the path of rectitude.",
        "TRANSLATION_1": "The man who believed said: \"O my people, follow me; I will guide you to the right path.\n",
        "TRANSLATION_2": "The person endowed with faith said: “My people, follow me; I shall direct you to the Path of Rectitude.\n",
        "TRANSLATION_3": "The believing man said, \"My people, follow me and I shall show you the right guidance.\n",
        "TRANSLATION_4": "And the believer said, “O my people! Follow me, I shall show you the way of righteousness.”\n",
        "TRANSLATION_5": "And the man who believed said: \"O my people! Follow me, I will guide you to the way of right conduct.\"\n",
        "TRANSLATION_6": "And he who believed said: O my people! follow me, I will guide you to the right course;\n",
        "TRANSLATION_7": "Then said he who believed, 'My people, follow me, and I will guide you in the way of rectitude.\n",
        "TRANSLATION_8": "And he who believed said: O my people! Follow me. I will show you the way of right conduct.\n",
        "TRANSLATION_9": "The believer said, \"My people, follow me! I will guide you to the right path.\n",
        "TRANSLATION_10": "And he who believed said: O my people! follow me, I shall guide you to the path of rectitude,\n",
        "TRANSLATION_11": "And he who had faith said, ‘O my people! Follow me; I will guide you to the way of rectitude.\n",
        "TRANSLATION_12": "The man who believed said further: \"O my people! Follow me: I will lead you to the Path of Right.\n",
        "TRANSLATION_13": "And the man who believed said: \"O my people! Follow me, I will guide you to the way of right conduct [i.e. guide you to Allah's religion of Islamic Monotheism with which Musa (Moses) has been sent].\n",
        "TRANSLATION_14": "He who was a believer said: 'Follow me, my nation, so that I may guide you to the Right Path.\n",
        "TRANSLATION_15": "The one who had believed said, “O my people, follow me, and I will guide you to the path of rectitude.”\n",
        "TRANSLATION_16": "And he who believed said, \"O my people, follow me, I will guide you to the way of right conduct.\n",
        "TRANSLATION_17": "[40:38] And he who believed, ‘O my people! Follow me (read ittabi‘ūnī, with the [final long] yā’, or ittabi‘ūni, without); I will guide you to the way of rectitude ([a similar statement] has already been mentioned [verse 29, above]).\n",
        "TRANSLATION_18": "(And he who believed) i.e. Ezekiel (said: O my people! Follow me) follow my religion. (I will show you the way of right conduct) I will invite you to the Truth and guidance.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "40:38",
            "40:29",
            "40:32",
            "25:27",
            "40:30",
            "36:20",
            "80:20",
            "40:41",
            "25:30",
            "50:12"
        ],
        "BIBLE": [
            "prophets:ii%20kings:6:19",
            "writings:psalms:139:24",
            "writings:psalms:5:9",
            "writings:psalms:27:11",
            "prophets:i%20kings:20:10",
            "writings:ruth:3:10",
            "torah:numbers:15:35",
            "prophets:ii%20kings:9:27",
            "prophets:judges:8:5",
            "prophets:ezekiel:33:8"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:3:6",
            "Sefer%20Yetzirah:1:13",
            "Sefer%20Yetzirah:4:8"
        ]
    }
}