{
    "VERSE": "40:4",
    "ARABIC": "مَا يُجَٰدِلُ فِىٓ ءَايَٰتِ ٱللَّهِ إِلَّا ٱلَّذِينَ كَفَرُوا۟ فَلَا يَغْرُرْكَ تَقَلُّبُهُمْ فِى ٱلْبِلَٰدِ",
    "ENGLISH": {
        "TRANSLATION_0": "No one disputes Allah's Signs except those who are kafir. Do not let their free movement about the earth deceive you.",
        "TRANSLATION_1": "Only the unbelievers dispute the revelations of God. So do not let their activities in the land deceive you.\n",
        "TRANSLATION_2": "None but the unbelievers dispute regarding the Signs of Allah. So let not their strutting about in the land delude you.\n",
        "TRANSLATION_3": "No one disputes the revelations of the Lord except the disbelievers. Let not their activities in the land deceive you.\n",
        "TRANSLATION_4": "None except the disbelievers dispute the signs of Allah, therefore do not let their free movements in the land deceive you.\n",
        "TRANSLATION_5": "None disputes in the Ayat of Allah but those who disbelieve. So let not their ability of going about here and there through the land (for their purposes) deceive you!\n",
        "TRANSLATION_6": "None dispute concerning the communications of Allah but those who disbelieve, therefore let not their going to and fro in the cities deceive you.\n",
        "TRANSLATION_7": "None but the unbelievers dispute concerning the signs of God; so let not their going to and fro in the land delude thee.\n",
        "TRANSLATION_8": "None argue concerning the revelations of Allah save those who disbelieve, so let not their turn of fortune in the land deceive thee (O Muhammad).\n",
        "TRANSLATION_9": "Only those who deny the truth dispute God's signs. Do not let their activity in the land deceive you.\n",
        "TRANSLATION_10": "None dispute concerning the revelations of Allah save those who disbelieve, so let not beguile thee their going about in the cities.\n",
        "TRANSLATION_11": "No one disputes the signs of Allah except the faithless. So do not be misled by their bustle in the towns.\n",
        "TRANSLATION_12": "None can dispute about the Signs of Allah but the Unbelievers. Let not, then, their strutting about through the land deceive thee!\n",
        "TRANSLATION_13": "None disputes in the Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) of Allah but those who disbelieve. So let not their ability of going about here and there through the land (for their purposes) deceive you [O Muhammad SAW, their ultimate end will be the Fire of Hell]!\n",
        "TRANSLATION_14": "None but the unbelievers dispute concerning the verses of Allah. So do not be deluded by their going to and fro in the land.\n",
        "TRANSLATION_15": "None argues against God’s revelations except those who disbelieve. So do not be impressed by their activities in the land.\n",
        "TRANSLATION_16": "No one disputes concerning the signs of Allah except those who disbelieve, so be not deceived by their [uninhibited] movement throughout the land.\n",
        "TRANSLATION_17": "[40:4] None dispute the signs of God — the Qur’ān — except those who disbelieve, from among the people of Mecca, so do not be deceived by their bustle in the towns, [going about] seeking their livelihood in security, for the sequel for them will be the Fire.\n",
        "TRANSLATION_18": "(None argue concerning the revelations of Allah) none disbelieves Muhammad (pbuh) and the Qur'an (save those who disbelieve) in Allah, i.e. the people of Mecca, (so let not their turn of fortune in the land deceive thee (0 Muhammad)) so let not, Muhammad, their comings and goings in travel for trade deceive you, for they account for nothing.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "40:4",
            "10:95",
            "6:33",
            "89:11",
            "16:105",
            "40:63",
            "3:196",
            "40:69",
            "40:56",
            "9:43"
        ],
        "BIBLE": [
            "prophets:joshua:24:17",
            "torah:numbers:10:9",
            "prophets:jeremiah:31:23",
            "prophets:i%20samuel:9:27",
            "writings:daniel:9:13",
            "writings:job:1:7",
            "torah:numbers:8:22",
            "prophets:jeremiah:2:28",
            "prophets:ezekiel:37:21",
            "prophets:isaiah:45:17"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:2:3",
            "Sefer%20Yetzirah:6:5"
        ]
    }
}