{
    "VERSE": "40:44",
    "ARABIC": "فَسَتَذْكُرُونَ مَآ أَقُولُ لَكُمْ وَأُفَوِّضُ أَمْرِىٓ إِلَى ٱللَّهِ إِنَّ ٱللَّهَ بَصِيرٌۢ بِٱلْعِبَادِ",
    "ENGLISH": {
        "TRANSLATION_0": "You will remember what I say to you. I consign my affair completely to Allah. Truly Allah sees His slaves.'",
        "TRANSLATION_1": "You will remember what I say in time to come; I submit my case to the judgement of God. Surely God keeps an eye on His creatures.\"\n",
        "TRANSLATION_2": "Soon you shall remember what I say to you. I entrust my affairs to Allah. Surely Allah is watchful over His servants.”\n",
        "TRANSLATION_3": "You will soon recall what I have told you. I entrust God with my affairs. God is Well Aware of His servants.\"\n",
        "TRANSLATION_4": "“And soon the time will come when you will remember what I now say to you; and I entrust my tasks to Allah; indeed Allah sees the bondmen.”\n",
        "TRANSLATION_5": "And you will remember what I am telling you, and my affair I leave it to Allah. Verily, Allah is the All-Seer of (His) servants.\"\n",
        "TRANSLATION_6": "So you shall remember what I say to you, and I entrust my affair to Allah, Surely Allah sees the servants.\n",
        "TRANSLATION_7": "You will remember what I say to you. I commit my affair to God; surely God sees His servants.'\n",
        "TRANSLATION_8": "And ye will remember what I say unto you. I confide my cause unto Allah. Lo! Allah is Seer of (His) slaves.\n",
        "TRANSLATION_9": "Soon you will remember what I say to you! I shall entrust my affair to God, for God is observant of all [His] servants.\"\n",
        "TRANSLATION_10": "And anon ye shall remember that which am telling you. Confide my affair Unto God; verily God is the Beholder of His bondmen.\n",
        "TRANSLATION_11": "Soon you will remember what I tell you, and I entrust my affair to Allah. Indeed Allah watches His servants.’\n",
        "TRANSLATION_12": "Soon will ye remember what I say to you (now), My (own) affair I commit to Allah: for Allah (ever) watches over His Servants.\"\n",
        "TRANSLATION_13": "And you will remember what I am telling you, and my affair I leave it to Allah. Verily, Allah is the All-Seer of (His) slaves.\"\n",
        "TRANSLATION_14": "You will remember what I say to you. To Allah I commit my affair, surely, Allah sees His worshipers'\n",
        "TRANSLATION_15": "You will remember what I am telling you, so I commit my case to God. God is Observant of the servants.”\n",
        "TRANSLATION_16": "And you will remember what I [now] say to you, and I entrust my affair to Allah. Indeed, Allah is Seeing of [His] servants.\"\n",
        "TRANSLATION_17": "[40:44] For you will [soon] remember what I have said to you, when you see the chastisement with your own eyes. And I entrust my affair to God. Truly God is Seer of [His] servants’ — he said this after they threatened him [with retribution] for opposing their religion.\n",
        "TRANSLATION_18": "(And ye will remember) you will know on the Day of Judgement (what I say unto you) in the life of the world regarding the torment. (I confide) I consign (my cause unto Allah) trusting in Him. (Lo! Allah is Seer of (His) slaves) He sees those who believe in Him and those who do not.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "40:44",
            "47:26",
            "17:96",
            "44:18",
            "8:51",
            "3:182",
            "18:69",
            "49:18",
            "3:20",
            "42:27"
        ],
        "BIBLE": [
            "prophets:ii%20kings:6:20",
            "prophets:judges:3:24",
            "prophets:judges:6:22",
            "torah:genesis:26:27",
            "torah:deuteronomy:3:21",
            "prophets:ezekiel:28:22",
            "prophets:ii%20kings:4:25",
            "prophets:isaiah:49:21",
            "writings:i%20chronicles:12:18",
            "prophets:i%20kings:20:13"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:3:6"
        ]
    }
}