{
    "VERSE": "40:45",
    "ARABIC": "فَوَقَىٰهُ ٱللَّهُ سَيِّـَٔاتِ مَا مَكَرُوا۟ وَحَاقَ بِـَٔالِ فِرْعَوْنَ سُوٓءُ ٱلْعَذَابِ",
    "ENGLISH": {
        "TRANSLATION_0": "So Allah safeguarded him from the evil things they plotted and a most evil torment engulfed Pharaoh's people -",
        "TRANSLATION_1": "So God preserved him from the evil they were planning; and a dreadful doom encompassed the people of Pharaoh:\n",
        "TRANSLATION_2": "Eventually Allah saved the person endowed with faith from all the evils of their guile, and a woeful chastisement encompassed the Pharaonites.\n",
        "TRANSLATION_3": "God protected him against their evil plans and the people of the Pharaoh were struck by the most horrible torment.\n",
        "TRANSLATION_4": "Therefore Allah saved him from the evils of their scheming, and an evil punishment enveloped the people of Firaun. –\n",
        "TRANSLATION_5": "So, Allah saved him from the evils that they plotted (against him), while an evil torment encompassed Fir`awn's people.\n",
        "TRANSLATION_6": "So Allah protected him from the evil (consequences) of what they planned, and the most evil punishment overtook Firon's people:\n",
        "TRANSLATION_7": "So God guarded him against the evil things of their devising, and there encompassed the folk of Pharaoh the evil chastisement,\n",
        "TRANSLATION_8": "So Allah warded off from him the evils which they plotted, while a dreadful doom encompassed Pharaoh's folk,\n",
        "TRANSLATION_9": "Thus, God delivered him from the evils which they plotted, and the companions of Pharaoh themselves were encompassed by a dreadful scourge;\n",
        "TRANSLATION_10": "Wherefore Allah protected him from ills which they plotted, and there surrounded the family of Fir'awn the evil of torment.\n",
        "TRANSLATION_11": "Then Allah saved him from their evil schemes, while a terrible punishment besieged Pharaoh’s clan:\n",
        "TRANSLATION_12": "Then Allah saved him from (every) ill that they plotted (against him), but the burnt of the Penalty encompassed on all sides the People of Pharaoh.\n",
        "TRANSLATION_13": "So Allah saved him from the evils that they plotted (against him), while an evil torment encompassed Fir'aun's (Pharaoh) people.\n",
        "TRANSLATION_14": "Allah saved him from the evils that they devised, and an evil punishment encompassed Pharaoh's people.\n",
        "TRANSLATION_15": "So God protected him from the evils of their scheming, while a terrible torment besieged Pharaoh’s clan.\n",
        "TRANSLATION_16": "So Allah protected him from the evils they plotted, and the people of Pharaoh were enveloped by the worst of punishment -\n",
        "TRANSLATION_17": "[40:45] So God shielded him from the evils of what they had plotted, against him, in the way of killing [him], and there besieged, befell, the folk of Pharaoh, his people as well as him, a dreadful chastisement, drowning,\n",
        "TRANSLATION_18": "(So Allah warded off from him the evils which they plotted) Allah drove them away from him when they wanted to kill him, (while a dreadful doom) a severe punishment (encompassed Pharaoh's folk) visited Pharaoh and his folk, i.e. they drowned.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "40:45",
            "13:21",
            "7:165",
            "52:27",
            "16:88",
            "16:34",
            "39:61",
            "4:37",
            "88:24",
            "16:45"
        ],
        "BIBLE": [
            "prophets:ezekiel:37:23",
            "prophets:i%20samuel:26:8",
            "prophets:jeremiah:21:12",
            "writings:daniel:3:29",
            "prophets:isaiah:64:10",
            "torah:deuteronomy:2:33",
            "prophets:jeremiah:18:13",
            "torah:numbers:18:9",
            "prophets:ii%20kings:23:16",
            "writings:ezra:10:2"
        ]
    }
}