{
    "VERSE": "40:46",
    "ARABIC": "ٱلنَّارُ يُعْرَضُونَ عَلَيْهَا غُدُوًّا وَعَشِيًّا وَيَوْمَ تَقُومُ ٱلسَّاعَةُ أَدْخِلُوٓا۟ ءَالَ فِرْعَوْنَ أَشَدَّ ٱلْعَذَابِ",
    "ENGLISH": {
        "TRANSLATION_0": "the Fire, morning and night, to which they are exposed; and on the Day the Hour takes place: 'Admit Pharaoh's people to the harshest punishment!'",
        "TRANSLATION_1": "Fire, to which they are exposed morning and evening. The day the Hour is proclaimed (it will be said:) \"Admit the people of Pharaoh to the severest punishment,\"\n",
        "TRANSLATION_2": "They are exposed to the Fire every morning and evening; and when the Last Hour will come to pass, a command shall be given: “Admit the Pharaonites to an even more severe chastisement.”\n",
        "TRANSLATION_3": "They will be exposed to the fire in the mornings and the evenings and on the Day of Judgment, they will be told, \"People of the Pharaoh, suffer the most severe torment.\"\n",
        "TRANSLATION_4": "The fire – upon which they are presented morning and evening; and when the Last Day is established – “Put the people of Firaun into the most severe punishment.” (Punishment in the grave is proven by this verse.)\n",
        "TRANSLATION_5": "The Fire, they are exposed to it, morning and afternoon. And on the Day when the Hour will be established (it will be said to the angels): \"Admit Fir`awn's people into the severest torment!\"\n",
        "TRANSLATION_6": "The fire; they shall be brought before it (every) morning and evening and on the day when the hour shall come to pass: Make Firon's people enter the severest chastisement.\n",
        "TRANSLATION_7": "the Fire, to which they shall be exposed morning and evening; and on the day when the Hour is come: 'Admit the folk of Pharaoh into the most terrible chastisement!'\n",
        "TRANSLATION_8": "The Fire; they are exposed to it morning and evening; and on the day when the Hour upriseth (it is said): Cause Pharaoh's folk to enter the most awful doom.\n",
        "TRANSLATION_9": "they will be brought before the Fire morning and evening. On the Day the Hour comes, [a voice will cry], \"Mete out to Pharaoh's people the harshest punishment!\"\n",
        "TRANSLATION_10": "The Fire! They are exposed thereto morning and evening. And on the Day whereon the Hour will uprise, it will be said: cause the family of Fir'awn to enter the most grievous torment.\n",
        "TRANSLATION_11": "the Fire, to which they are exposed morning and evening. On the day when the Hour sets in, Pharaoh’s clan will enter the severest punishment.\n",
        "TRANSLATION_12": "In front of the Fire will they be brought, morning and evening: And (the sentence will be) on the Day that Judgment will be established: \"Cast ye the People of Pharaoh into the severest Penalty!\"\n",
        "TRANSLATION_13": "The Fire; they are exposed to it, morning and afternoon, and on the Day when the Hour will be established (it will be said to the angels): \"Cause Fir'aun's (Pharaoh) people to enter the severest torment!\"\n",
        "TRANSLATION_14": "(Before) the Fire they shall be exposed morning and evening, and on the Day when the Hour comes, (it will be said): 'Admit the family of Pharaoh into the most terrible punishment'\n",
        "TRANSLATION_15": "The Fire. They will be exposed to it morning and evening. And on the Day the Hour takes place: “Admit the clan of Pharaoh to the most intense agony.”\n",
        "TRANSLATION_16": "The Fire, they are exposed to it morning and evening. And the Day the Hour appears [it will be said], \"Make the people of Pharaoh enter the severest punishment.\"\n",
        "TRANSLATION_17": "[40:46] then: the Fire, to which they are exposed, in which they are burnt, morning and evening. And on the day when the Hour comes, it will be said: ‘Enter, O, folk of Pharaoh (a variant reading [for udkhulū, ‘enter’] has adkhilū, ‘admit’, being a command to the angels) the most awful chastisement!’, the chastisement of Hell.\n",
        "TRANSLATION_18": "(The Fire; they are exposed to it) He says: the spirits of the folk of Pharaoh will be exposed to the Fire (morning and evening) until the Day of Judgement; (and on the day when the Hour upriseth) which is the Day of Judgement ((it is said)) Allah will say to the angels: (Cause Pharaoh's folk to enter the most awful doom) the bottom of hell.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "40:46",
            "51:13",
            "41:19",
            "22:2",
            "30:14",
            "30:12",
            "40:49",
            "34:42",
            "40:52",
            "46:34"
        ],
        "BIBLE": [
            "prophets:jeremiah:3:16",
            "prophets:i%20samuel:9:12",
            "torah:numbers:21:8",
            "prophets:zechariah:12:6",
            "torah:exodus:20:21",
            "writings:ezra:5:15",
            "prophets:zechariah:12:3",
            "torah:exodus:33:19",
            "prophets:ii%20samuel:17:9",
            "prophets:isaiah:7:23"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:3:2"
        ]
    }
}