{
    "VERSE": "40:47",
    "ARABIC": "وَإِذْ يَتَحَآجُّونَ فِى ٱلنَّارِ فَيَقُولُ ٱلضُّعَفَٰٓؤُا۟ لِلَّذِينَ ٱسْتَكْبَرُوٓا۟ إِنَّا كُنَّا لَكُمْ تَبَعًا فَهَلْ أَنتُم مُّغْنُونَ عَنَّا نَصِيبًا مِّنَ ٱلنَّارِ",
    "ENGLISH": {
        "TRANSLATION_0": "When they are squabbling with one another in the Fire, the weak will say to those deemed great, 'We were your followers, so why do you not relieve us of a portion of the Fire?'",
        "TRANSLATION_1": "As they will noisily argue in the Fire, the weaker ones will say to the arrogant: \"We were your followers, so will you take over some of our share of the fire?\"\n",
        "TRANSLATION_2": "Just imagine when they will remonstrate with one another in Hell. The weak ones will say to those who waxed proud: “We were your followers. Will you, then, lighten for us a part of our suffering of the Fire?”\n",
        "TRANSLATION_3": "During a dispute in the fire, the suppressed ones will say to those who had dominated them, \"We were your followers. Can you now relieve us of our suffering in the fire?\"\n",
        "TRANSLATION_4": "And when they will quarrel amongst themselves in the fire, those who were weak will say to those who sought greatness, “We were your followers, so will you reduce from us some of the punishment of the fire?”\n",
        "TRANSLATION_5": "And, when they will dispute in the Fire, the weak will say to those who were arrogant: \"Verily, we followed you, can you then take from us some portion of the Fire\"\n",
        "TRANSLATION_6": "And when they shall contend one with another in the fire, then the weak shall say to those who were proud: Surely we were your followers; will you then avert from us a portion of the fire?\n",
        "TRANSLATION_7": "And when they argue one with the other in the Fire, and the weak say unto those who waxed proud, 'Why, we were your followers; will you avail us now against any part of the Fire?'\n",
        "TRANSLATION_8": "And when they wrangle in the Fire, the weak say unto those who were proud: Lo! we were a following unto you; will ye therefor rid us of a portion of the Fire?\n",
        "TRANSLATION_9": "When they dispute with one another in the Fire, the weak will say to those who deemed themselves mighty, \"We were your followers; will you then relieve us of some of the Fire?\"\n",
        "TRANSLATION_10": "And consider what time they will wrangle together in the Fire, and the oppressed will say Unto those who were stiff-necked: verily we have been Unto you a following, are ye going to avail us against a portion of the Fire?\n",
        "TRANSLATION_11": "When they argue in the Fire, the oppressed will say to the oppressors, ‘We used to follow you; will you avail us against any portion of the Fire?’\n",
        "TRANSLATION_12": "Behold, they will dispute with each other in the Fire! The weak ones (who followed) will say to those who had been arrogant, \"We but followed you: Can ye then take (on yourselves) from us some share of the Fire?\n",
        "TRANSLATION_13": "And, when they will dispute in the Fire, the weak will say to those who were arrogant; \"Verily! We followed you, can you then take from us some portion of the Fire?\"\n",
        "TRANSLATION_14": "And when they argue with one another in Hell, the weak will say to the proud: 'We were your followers, will you help us against any share of the Fire'\n",
        "TRANSLATION_15": "As they quarrel in the Fire, the weak will say to those who were arrogant, “We were followers of yours; will you then spare us a portion of the Fire?”\n",
        "TRANSLATION_16": "And [mention] when they will argue within the Fire, and the weak will say to those who had been arrogant, \"Indeed, we were [only] your followers, so will you relieve us of a share of the Fire?\"\n",
        "TRANSLATION_17": "[40:47] And, mention, when they will be arguing, [when] they, the disbelievers, will be disputing, [with one another] in the Fire, and the weak will say to those who were arrogant, ‘Indeed we were your followers (taba‘an is the plural of tābi‘); so will you [now] avail, [will you] defend, us against any portion of the Fire?’\n",
        "TRANSLATION_18": "(And when they) the leaders and the followers (wrangle in the Fire, the weak) the followers (say unto those who were proud) too proud to accept faith, i.e. the leaders: (Lo! we were a following unto you) we followed your religion in the life of the world: (will ye therefore rid us of a portion of the Fire) will therefore bear for us some of the punishment of the Fire?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "40:47",
            "38:61",
            "3:16",
            "3:131",
            "14:21",
            "7:36",
            "18:99",
            "55:15",
            "2:39",
            "54:27"
        ],
        "BIBLE": [
            "prophets:ii%20samuel:2:27",
            "prophets:judges:3:24",
            "torah:genesis:44:4",
            "prophets:ii%20kings:2:9",
            "torah:deuteronomy:31:14",
            "prophets:ii%20samuel:17:9",
            "writings:job:1:12",
            "torah:exodus:11:8",
            "torah:deuteronomy:12:30",
            "prophets:ezekiel:37:21"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:5:1"
        ]
    }
}