{
    "VERSE": "40:49",
    "ARABIC": "وَقَالَ ٱلَّذِينَ فِى ٱلنَّارِ لِخَزَنَةِ جَهَنَّمَ ٱدْعُوا۟ رَبَّكُمْ يُخَفِّفْ عَنَّا يَوْمًا مِّنَ ٱلْعَذَابِ",
    "ENGLISH": {
        "TRANSLATION_0": "Those in the Fire will say to the custodians of Hell, 'Call on your Lord to make the punishment less for us for just one day.'",
        "TRANSLATION_1": "Those in the Fire will say to the warders of Hell: \"Ask your Lord to reduce the punishment by a day for us.\"\n",
        "TRANSLATION_2": "Those suffering in the Fire will say to the keepers of Hell: “Call upon your Lord to lighten the chastisement for us just for a day.”\n",
        "TRANSLATION_3": "The dwellers of hell fire will ask its keepers, \"Pray to your Lord to relieve us from the torment at least for one day\".\n",
        "TRANSLATION_4": "And those who are in the fire said to its guards, “Pray to your Lord to decrease the punishment upon us for one day.”\n",
        "TRANSLATION_5": "And those in the Fire will say to the keepers (angels) of Hell: \"Call upon your Lord to lighten for us the torment for a day!\"\n",
        "TRANSLATION_6": "And those who are in the fire shall say to the keepers of hell: Call upon your Lord that He may lighten to us one day of the punishment.\n",
        "TRANSLATION_7": "And those who are in the Fire will say to the keepers of Gehenna, 'Call on your Lord, to lighten for us one day of the chastisement!'\n",
        "TRANSLATION_8": "And those in the Fire say unto the guards of hell: Entreat your Lord that He relieve us of a day of the torment.\n",
        "TRANSLATION_9": "Those in the Fire will say to its keepers, \"Implore your Lord to relieve our torment for one day,\"\n",
        "TRANSLATION_10": "And those in the Fire will say Unto the keepers of Hell: supplicate your Lord that He may lighten for us a day of the torment.\n",
        "TRANSLATION_11": "Those who are in the Fire will say to the keepers of hell, ‘Invoke your Lord to lighten for us [at least] a day’s punishment.’\n",
        "TRANSLATION_12": "Those in the Fire will say to the Keepers of Hell: \"Pray to your Lord to lighten us the Penalty for a day (at least)!\"\n",
        "TRANSLATION_13": "And those in the Fire will say to the keepers (angels) of Hell: \"Call upon your Lord to lighten for us the torment for a day!\"\n",
        "TRANSLATION_14": "And those in the Fire will say to the keepers of Gehenna (Hell): 'Call your Lord to lessen our punishment for one day'\n",
        "TRANSLATION_15": "And those in the Fire will say to the keepers of Hell, “Call to your Lord to lessen our suffering for one day.”\n",
        "TRANSLATION_16": "And those in the Fire will say to the keepers of Hell, \"Supplicate your Lord to lighten for us a day from the punishment.\"\n",
        "TRANSLATION_17": "[40:49] And those who are in the Fire will say to the keepers of Hell, ‘Call on your Lord that He relieve us of [at least] a day, in other words, the equivalent of one day, of the chastisement!’\n",
        "TRANSLATION_18": "(And those in the Fire say) when the Fire becomes too intense for them, and their patience wanes and they lose hope in their prayers (unto the guards of hell) the angels of hell: (Entreat your Lord that He relieve us of a day of the torment) the equivalent of a day of the life of the world of torment.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "40:49",
            "46:34",
            "3:16",
            "34:42",
            "39:71",
            "38:61",
            "2:201",
            "25:69",
            "43:39",
            "70:27"
        ],
        "BIBLE": [
            "prophets:ii%20kings:4:15",
            "torah:genesis:22:11",
            "prophets:judges:16:28",
            "torah:exodus:8:4",
            "prophets:joshua:5:9",
            "torah:genesis:1:8",
            "torah:genesis:22:14",
            "torah:genesis:30:13",
            "prophets:jeremiah:23:6",
            "torah:exodus:9:27"
        ]
    }
}