{
    "VERSE": "40:58",
    "ARABIC": "وَمَا يَسْتَوِى ٱلْأَعْمَىٰ وَٱلْبَصِيرُ وَٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّٰلِحَٰتِ وَلَا ٱلْمُسِىٓءُ قَلِيلًا مَّا تَتَذَكَّرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "The blind and the seeing are not the same. Nor are those who have iman and do right actions the same as evildoers. What little heed they pay!",
        "TRANSLATION_1": "The blind and the seeing are surely not alike, nor those who believe and act rightly and those who do evil. Little do you reflect!\n",
        "TRANSLATION_2": "Never can the blind and the seeing be equal; nor those that believe and act righteously and those that do evil. Little do you understand.\n",
        "TRANSLATION_3": "Just as the blind and the seeing are not equal, so are the righteously striving believers and the sinners are not equal. How little to this you pay attention.\n",
        "TRANSLATION_4": "And the blind and the sighted are not equal – and neither are the believers who perform good deeds and the wicked equal; how very little do you ponder!\n",
        "TRANSLATION_5": "And not equal are the blind and those who see; nor those who believe, and do righteous good deeds, and those who do evil. Little do you remember!\n",
        "TRANSLATION_6": "And the blind and the seeing are not alike, nor those who believe and do good and the evil-doer; little is it that you are mindful.\n",
        "TRANSLATION_7": "Not equal are the blind and the seeing man, those who believe and do deeds of righteousness, and the wrong-doer. Little do you reflect.\n",
        "TRANSLATION_8": "And the blind man and the seer are not equal, neither are those who believe and do good works (equal with) the evil-doer. Little do ye reflect!\n",
        "TRANSLATION_9": "The blind and the sighted are not equal, just as those who believe and do good works and those who do evil are not equal: how seldom you reflect!\n",
        "TRANSLATION_10": "Not equal are the blind and the seeing; nor those who believed and Work righteous works and the evil-doer. Little are ye admonished!\n",
        "TRANSLATION_11": "The blind one and the seer are not equal, neither are the evildoers and those who have faith and do righteous deeds. Little is the admonition that you take!\n",
        "TRANSLATION_12": "Not equal are the blind and those who (clearly) see: Nor are (equal) those who believe and work deeds of righteousness, and those who do evil. Little do ye learn by admonition!\n",
        "TRANSLATION_13": "And not equal are the blind and those who see, nor are (equal) those who believe (in the Oneness of Allah Islamic Monotheism), and do righteous good deeds, and those who do evil. Little do you remember!\n",
        "TRANSLATION_14": "The blind and the seeing are not equal, nor are those who believe and do good works, and the wrongdoer yet you seldom reflect.\n",
        "TRANSLATION_15": "Not equal are the blind and the seeing. Nor are those who believe and work righteousness equal to the sinners. How little you reflect.\n",
        "TRANSLATION_16": "And not equal are the blind and the seeing, nor are those who believe and do righteous deeds and the evildoer. Little do you remember.\n",
        "TRANSLATION_17": "[40:58] And the blind one and the seer are not equal; nor are [they equal] those who believe and perform righteous deeds — such a person being the virtuous one — and the evildoer (wa-lā’l-musī’u: lā here is extra). Little do they reflect, [little] are they admonished (read yatadhakkarūna, or [second person plural] tatadhakkarūna, ‘do you reflect’), in other words, their reflections are very few.\n",
        "TRANSLATION_18": "(And the blind man) i.e. the disbelievers (and the seer) i.e. the believer (are not equal) in reward and honour, (neither are those who believe) in Muhammad (pbuh) and in the Qur'an (and do good works) and do acts of obedience between them and their Lord ((equal with) the evil-doer) the one who ascribes partners to Allah. (Little do you reflect) they do not take any admonition from the similitudes of the Qur'an!\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "40:58",
            "35:19",
            "67:23",
            "23:78",
            "53:17",
            "11:24",
            "32:9",
            "77:46",
            "73:11",
            "10:43"
        ],
        "BIBLE": [
            "writings:ecclesiastes:7:15",
            "writings:ecclesiastes:4:3",
            "torah:numbers:14:22",
            "writings:ecclesiastes:1:14",
            "prophets:ezekiel:18:24",
            "prophets:ezekiel:3:20",
            "prophets:jeremiah:11:15",
            "prophets:isaiah:59:16",
            "writings:psalms:141:4",
            "writings:psalms:31:20"
        ]
    }
}