{
    "VERSE": "40:63",
    "ARABIC": "كَذَٰلِكَ يُؤْفَكُ ٱلَّذِينَ كَانُوا۟ بِـَٔايَٰتِ ٱللَّهِ يَجْحَدُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "That is how those who deny Allah's Signs have been perverted.",
        "TRANSLATION_1": "Only they are turned away thus who deny the signs of God.\n",
        "TRANSLATION_2": "Thus it is only those who had denied Allah's Signs that were led astray.\n",
        "TRANSLATION_3": "Thus are indeed those who have rejected the revelations of God.\n",
        "TRANSLATION_4": "This is how those who deny the signs of Allah go reverting.\n",
        "TRANSLATION_5": "Thus were turned away those who used to deny the Ayat of Allah.\n",
        "TRANSLATION_6": "Thus were turned away those who denied the communications of Allah.\n",
        "TRANSLATION_7": "Even so perverted are they who deny the signs of God.\n",
        "TRANSLATION_8": "Thus are they perverted who deny the revelations of Allah.\n",
        "TRANSLATION_9": "Thus, indeed, those who deny the signs of God turn away from Him.\n",
        "TRANSLATION_10": "In this wise have those strayed who the signs of Allah were away want to gainsay.\n",
        "TRANSLATION_11": "Those who were used to impugning the signs of Allah are thus made to go astray.\n",
        "TRANSLATION_12": "Thus are deluded those who are wont to reject the Signs of Allah.\n",
        "TRANSLATION_13": "Thus were turned away those who used to deny the Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) of Allah.\n",
        "TRANSLATION_14": "As such those who disbelieve the signs of Allah turn away.\n",
        "TRANSLATION_15": "Thus are turned away those who dispute the signs of God.\n",
        "TRANSLATION_16": "Thus were those [before you] deluded who were rejecting the signs of Allah.\n",
        "TRANSLATION_17": "[40:63] So deviate, that is, in the same way that these [Meccans] deviate, deviate, those who used to deny the signs of God, His miracles.\n",
        "TRANSLATION_18": "(Thus are they perverted) lie against Allah (who deny the revelations of Allah) who disbelieve in Muhammad (pbuh) and in the Qur'an.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "40:63",
            "2:242",
            "10:95",
            "40:69",
            "22:16",
            "16:105",
            "30:59",
            "6:33",
            "2:15",
            "43:69"
        ],
        "BIBLE": [
            "writings:psalms:119:157",
            "writings:ii%20chronicles:15:4",
            "prophets:jonah:3:9",
            "writings:psalms:119:102",
            "torah:deuteronomy:31:18",
            "prophets:i%20kings:11:9",
            "prophets:i%20samuel:10:9",
            "writings:psalms:66:20",
            "prophets:ezekiel:14:6",
            "prophets:isaiah:53:6"
        ]
    }
}