{
    "VERSE": "40:65",
    "ARABIC": "هُوَ ٱلْحَىُّ لَآ إِلَٰهَ إِلَّا هُوَ فَٱدْعُوهُ مُخْلِصِينَ لَهُ ٱلدِّينَ ٱلْحَمْدُ لِلَّهِ رَبِّ ٱلْعَٰلَمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "He is the Living - there is no god but Him - so call on Him, making your deen sincerely His. Praise be to Allah, the Lord of all the worlds.",
        "TRANSLATION_1": "He is the living. There is no god but He. Therefore pray to Him with obedience all-exclusive. Praise be to God, the Lord of all the worlds.\n",
        "TRANSLATION_2": "He is the Ever-Living: there is no god but He. So call upon Him, consecrating to Him all your devotion. All praise and thanks be to Allah, the Lord of the whole Universe.\n",
        "TRANSLATION_3": "He is the Everlasting and the only Lord. So worship Him and be devoted to His religion. It is only God, the Lord of the Universe who deserves all praise.\n",
        "TRANSLATION_4": "It is He, the Alive – there is no God except Him; therefore worship Him as His sincere bondmen; all praise is to Allah, the Lord Of The Creation.\n",
        "TRANSLATION_5": "He is the Ever Living, La ilaha illa Huwa; so invoke Him making the religion for Him Alone. All the praises and thanks be to Allah, the Lord of all that exits.\n",
        "TRANSLATION_6": "He is the Living, there is no god but He, therefore call on Him, being sincere to Him in obedience; (all) praise is due to Allah, the Lord of the worlds.\n",
        "TRANSLATION_7": "He is the Living One; there is no god but He. So call upon Him, making your religion His sincerely. Praise belongs to God, the Lord of all Being.\n",
        "TRANSLATION_8": "He is the Living One. There is no Allah save Him. So pray unto Him, making religion pure for Him (only). Praise be to Allah, the Lord of the Worlds!\n",
        "TRANSLATION_9": "He is the Living One. There is no deity save Him. So pray to Him, making religion pure for Him [only]. Praise be to God, the Lord of the Universe!\n",
        "TRANSLATION_10": "He is the Living: there is no god but He so call upon Him, making religion pure for Him. All praise Unto Allah, the Lord of the worlds!\n",
        "TRANSLATION_11": "He is the Living One, there is no god except Him. So supplicate Him, putting exclusive faith in Him. All praise belongs to Allah, Lord of all the worlds.\n",
        "TRANSLATION_12": "He is the Living (One): There is no god but He: Call upon Him, giving Him sincere devotion. Praise be to Allah, Lord of the Worlds!\n",
        "TRANSLATION_13": "He is the Ever Living, La ilaha illa Huwa (none has the right to be worshipped but He), so invoke Him making your worship pure for Him Alone (by worshipping Him Alone, and none else, and by doing righteous deeds sincerely for Allah's sake only, and not to show off, and not to set up rivals with Him in worship). All the praises and thanks be to Allah, the Lord of the 'Alamin (mankind, jinns and all that exists).\n",
        "TRANSLATION_14": "He is the Living; there is no god except He. Supplicate to Him and make the religion sincerely His. Praise belongs to Allah, Lord of the Worlds!\n",
        "TRANSLATION_15": "He is the Living One. There is no god except He. So pray to Him, devoting your religion to Him. Praise be to God, the Lord of the Worlds.\n",
        "TRANSLATION_16": "He is the Ever-Living; there is no deity except Him, so call upon Him, [being] sincere to Him in religion. [All] praise is [due] to Allah, Lord of the worlds.\n",
        "TRANSLATION_17": "[40:65]   He is the Living; there is no god except Him. So supplicate Him, worship Him, devoting [your] religion purely to Him, [free] from any idolatry. Praise be to God, the Lord of the Worlds.\n",
        "TRANSLATION_18": "(He is the Living One) who dies not. (There is no God) who does this (save Him. So pray unto Him) so profess His divine Oneness, (making religion pure for Him (only)) making your worship and profession of Allah's divine Oneness sincere to Him. (Praise be to Allah) gratitude and lordship belong to Allah, (the Lord of the Worlds) the Lord of all that which has a spirit and moves on the face of the earth!\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "40:65",
            "1:2",
            "37:182",
            "81:29",
            "6:45",
            "45:36",
            "27:93",
            "40:14",
            "39:75",
            "6:90"
        ],
        "BIBLE": [
            "torah:leviticus:10:17",
            "writings:ii%20chronicles:14:6",
            "prophets:nahum:1:14",
            "writings:psalms:141:1",
            "writings:esther:4:8",
            "prophets:isaiah:48:1",
            "prophets:judges:15:18",
            "prophets:ii%20samuel:22:36",
            "prophets:ii%20samuel:23:5",
            "prophets:hosea:2:14"
        ]
    }
}