{
    "VERSE": "40:66",
    "ARABIC": "قُلْ إِنِّى نُهِيتُ أَنْ أَعْبُدَ ٱلَّذِينَ تَدْعُونَ مِن دُونِ ٱللَّهِ لَمَّا جَآءَنِىَ ٱلْبَيِّنَٰتُ مِن رَّبِّى وَأُمِرْتُ أَنْ أُسْلِمَ لِرَبِّ ٱلْعَٰلَمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Say: 'I was forbidden to worship those you call upon besides Allah when the Clear Signs came to me from my Lord and I was commanded to submit to the Lord of all the worlds.'",
        "TRANSLATION_1": "Say: \"I am forbidden to worship those you call apart from God, since clear signs have come to me from my Lord, and I am commanded to submit to the Lord of all the worlds.\"\n",
        "TRANSLATION_2": "Say, (O Prophet): “I have been forbidden to worship those beside Allah whom you call upon. (How can I worship any beside Allah) when clear Signs have come to me from my Lord and I have been commanded to surrender to Allah, the Lord of the Universe?”\n",
        "TRANSLATION_3": "(Muhammad), say, \"I have been forbidden to worship whatever you worship besides God after receiving clear evidence from my Lord. I have been commanded to submit myself to the will of the Lord of the Universe\".\n",
        "TRANSLATION_4": "Proclaim (O dear Prophet Mohammed – peace and blessings be upon him), “I have been forbidden to worship those whom you worship besides Allah whilst clear proofs have come to me from my Lord; and I have been commanded to submit to the Lord Of The Creation.”\n",
        "TRANSLATION_5": "Say: \"I have been forbidden to worship those whom you worship besides Allah, since there have come to me evidences from my Lord; and I am commanded to submit to the Lord of all that exists.\n",
        "TRANSLATION_6": "Say: I am forbidden to serve those whom you call upon besides Allah when clear arguments have come to me from my Lord, and I am commanded that I should submit to the Lord of the worlds.\n",
        "TRANSLATION_7": "Say: 'I am forbidden to serve those you call on apart from God once the clear signs came to me from my Lord; and I am commanded to surrender to the Lord of All Being.'\n",
        "TRANSLATION_8": "Say (O Muhammad): I am forbidden to worship those unto whom ye cry beside Allah since there have come unto me clear proofs from my Lord, and I am commanded to surrender to the Lord of the Worlds.\n",
        "TRANSLATION_9": "Say, \"I have been forbidden to invoke those whom you invoke besides God -- seeing that clear signs have come to me from my Lord; and I have been commanded to submit to the Lord of the Universe.\"\n",
        "TRANSLATION_10": "Say thou: verily I am forbidden that should worship these whom ye call upon beside Allah when evidences have come Unto me from my Lord, and I am commanded that I should submit to the Lord of the Worlds.\n",
        "TRANSLATION_11": "Say, ‘I have been forbidden to worship those whom you invoke besides Allah, as manifest proofs have come to me from my Lord, and I have been commanded to submit to the Lord of all the worlds.’\n",
        "TRANSLATION_12": "Say: \"I have been forbidden to invoke those whom ye invoke besides Allah,- seeing that the Clear Signs have come to me from my Lord; and I have been commanded to bow (in Islam) to the Lord of the Worlds.\"\n",
        "TRANSLATION_13": "Say (O Muhammad SAW): \"I have been forbidden to worship those whom you worship besides Allah, since there have come to me evidences from my Lord, and I am commanded to submit (in Islam) to the Lord of the 'Alamin (mankind, jinns and all that exists).\n",
        "TRANSLATION_14": "Say: 'I am forbidden to worship those whom you worship, other than Allah. Clear verses have come to me from my Lord and I am commanded to surrender to the Lord of the Worlds'\n",
        "TRANSLATION_15": "Say, “I was prohibited from worshiping those you invoke besides God, now that clear revelations have come to me from my Lord; and I was commanded to submit to the Lord of the Worlds.”\n",
        "TRANSLATION_16": "Say, [O Muhammad], \"Indeed, I have been forbidden to worship those you call upon besides Allah once the clear proofs have come to me from my Lord, and I have been commanded to submit to the Lord of the worlds.\"\n",
        "TRANSLATION_17": "[40:66] Say: ‘I have been forbidden to worship those on whom you call, [those whom] you worship, besides God, since there have come to me clear signs, proofs of His Oneness, from my Lord; and I have been commanded to submit to the Lord of the Worlds’.\n",
        "TRANSLATION_18": "(Say) O Muhammad, to the people of Mecca, when they said to him: \"revert to the religion of your forefathers\": (I am forbidden) in the Qur'an (to worship those) idols (unto whom ye cry) whom you worship (beside Allah since there have come unto me clear proofs from my Lord, and I am commanded) in the Qur'an (to surrender) to be straight in following Islam (to the Lord of the Worlds) the Lord of all that which has a spirit and moves on the face of the earth.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "40:66",
            "10:37",
            "37:182",
            "19:48",
            "11:47",
            "81:29",
            "3:50",
            "6:162",
            "6:56",
            "60:8"
        ],
        "BIBLE": [
            "prophets:i%20kings:20:13",
            "prophets:jeremiah:5:19",
            "prophets:i%20samuel:10:7",
            "prophets:i%20kings:18:36",
            "writings:ii%20chronicles:12:7",
            "writings:daniel:2:47",
            "writings:i%20chronicles:12:18",
            "prophets:i%20samuel:12:12",
            "torah:genesis:15:2",
            "torah:genesis:16:13"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:5:2"
        ]
    }
}