{
    "VERSE": "40:67",
    "ARABIC": "هُوَ ٱلَّذِى خَلَقَكُم مِّن تُرَابٍ ثُمَّ مِن نُّطْفَةٍ ثُمَّ مِنْ عَلَقَةٍ ثُمَّ يُخْرِجُكُمْ طِفْلًا ثُمَّ لِتَبْلُغُوٓا۟ أَشُدَّكُمْ ثُمَّ لِتَكُونُوا۟ شُيُوخًا وَمِنكُم مَّن يُتَوَفَّىٰ مِن قَبْلُ وَلِتَبْلُغُوٓا۟ أَجَلًا مُّسَمًّى وَلَعَلَّكُمْ تَعْقِلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "It is He who created you from earth, then from a drop of sperm, then from a clot of blood, then He brings you out as infants, then so you may achieve full strength, then so you may become old men - though some of you may die before that time - so that you may reach a predetermined age and so that hopefully you will use your intellect.",
        "TRANSLATION_1": "It is He who created you from dust, then a drop of semen, then the embryo; afterwards He brings you forth as a child; then you attain the age of manhood, and then reach old age. But some of you die before you reach the appointed term that you may haply understand.\n",
        "TRANSLATION_2": "He it is Who created you from dust, then from a sperm-drop, then from a clot; then He brings you out as an infant, then causes you to grow into full maturity, and then causes you to grow further so that you may reach old age, while some of you He recalls earlier. All this is in order that you may reach an appointed term and that you may understand (the Truth).\n",
        "TRANSLATION_3": "It is He Who created you from clay, turning it into a living germ, then into a clot of blood, and then brings you forth as a child. He then made you grow into manhood and become old. He causes some of you to live for the appointed time and some of you to die before so that perhaps you may have understanding.\n",
        "TRANSLATION_4": "It is He Who created you from clay, then from a drop of liquid, then from a clot of blood, and then brings you forth as a child, then keeps you alive for you to reach adulthood and then to become old; and some among you pass away earlier, and for you to reach an appointed term, and so that you may understand.\n",
        "TRANSLATION_5": "It is He, Who has created you from dust, then from a Nutfah then from a clot (a piece of coagulated blood), then brings you forth as an infant, then (makes you grow) to reach the age of full strength, and afterwards to be old -- though some among you die before -- and that you reach an appointed term in order that you may understand.\n",
        "TRANSLATION_6": "He it is Who created you from dust, then from a small lifegerm, then from a clot, then He brings you forth as a child, then that you may attain your maturity, then that you may be old-- and of you there are some who are caused to die before-- and that you may reach an appointed term, and that you may understand.\n",
        "TRANSLATION_7": "It is He who created you of dust then of a sperm-drop, then of a blood-clot, then He delivers you as infants, then that you may come of age, then that you may be old men -- though some of you there are who die before it -- and that you may reach a stated term; haply you will understand.\n",
        "TRANSLATION_8": "He it is Who created you from dust, then from a drop (of seed) then from a clot, then bringeth you forth as a child, then (ordaineth) that ye attain full strength and afterward that ye become old men - though some among you die before - and that ye reach an appointed term, that haply ye may understand.\n",
        "TRANSLATION_9": "It is He who created you from dust, then from a drop of fluid, then from a tiny, clinging form, then He brought you forth as infants, then He allowed you to reach maturity, then He let you grow old, though some of you die sooner, and reach your appointed term so that you may reflect.\n",
        "TRANSLATION_10": "He it is Who created you of dust, and thereafter of a drop, and thereafter of a clot, and thereafter He bringeth you forth as an infant, and thereafter He ordaineth that ye attain your full strength and thereafter that ye become old men-though some of you die before-and that ye attain the appointed term, and that haply ye may reflect.\n",
        "TRANSLATION_11": "It is He who created you from dust, then from a drop of [seminal] fluid, then from a clinging mass, then He brings you forth as infants, then [He nurtures you] so that you may come of age, and then that you may become aged—though there are some of you who die earlier—and complete a specified term, and so that you may exercise your reason.\n",
        "TRANSLATION_12": "It is He Who has created you from dust then from a sperm-drop, then from a leech-like clot; then does he get you out (into the light) as a child: then lets you (grow and) reach your age of full strength; then lets you become old,- though of you there are some who die before;- and lets you reach a Term appointed; in order that ye may learn wisdom.\n",
        "TRANSLATION_13": "He, it is Who has created you (Adam) from dust, then from a Nutfah [mixed semen drops of male and female discharge (i.e. Adam's offspring)] then from a clot (a piece of coagulated blood), then brings you forth as children, then (makes you grow) to reach the age of full strength, and afterwards to be old (men and women), though some among you die before, and that you reach an appointed term, in order that you may understand.\n",
        "TRANSLATION_14": "It is He who created you from dust, then from a (sperm) drop, and then a (blood) clot. He then brings you forth as an infant, then you reach your strength, after which you come of age though some of you die before it and that you reach an appointed term, in order that you understand.\n",
        "TRANSLATION_15": "It is He who created you from dust, then from a seed, then from an embryo, then He brings you out as an infant, then He lets you reach your maturity, then you become elderly—although some of you die sooner—so that you may reach a predetermined age, so that you may understand.\n",
        "TRANSLATION_16": "It is He who created you from dust, then from a sperm-drop, then from a clinging clot; then He brings you out as a child; then [He develops you] that you reach your [time of] maturity, then [further] that you become elders. And among you is he who is taken in death before [that], so that you reach a specified term; and perhaps you will use reason.\n",
        "TRANSLATION_17": "[40:67] He it is Who created you from dust, by having created your father Adam from it, then from a drop [of sperm], then from a blood-clot, congealed blood, then He brings you forth as infants, then, He sustains you, that you may come of age, [until you have attained] your full strength — [this being] from the age of thirty to forty — then that you may become aged (read shuyūkhan or shiyūkhan)— though there are some of you who die earlier, that is, before coming of age or becoming aged. He does this to you so that you may live [on], and that you may complete an appointed term, a defined length of time, that perhaps you might understand, the proofs of [His] Oneness and thus become believers.\n",
        "TRANSLATION_18": "(He it is Who created you from dust) He created you from Adam and Adam is from dust, (then from a drop (of seed)) then He created you from the sperm drops of your fathers (then from a clot) then from a clot of 547 blood, (then brings you forth) from your mothers' wombs (as a child) as a young child, (then (ordaineth) that ye attain full strength) 18 to 30 years old (and afterward that ye become old men) after having attained your full strength (though some among you die before) before the age of puberty or before reaching old age (and that ye reach an appointed term) the end of your lifespan, (that haply ye may understand) that haply you may believe in resurrection after death.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "40:67",
            "22:5",
            "18:37",
            "6:2",
            "8:25",
            "2:21",
            "63:10",
            "6:60",
            "37:11",
            "35:11"
        ],
        "BIBLE": [
            "prophets:zephaniah:3:20",
            "writings:daniel:11:6",
            "writings:daniel:3:29",
            "writings:ezra:10:14",
            "prophets:ii%20kings:10:5",
            "prophets:micah:2:12",
            "prophets:i%20kings:20:39",
            "prophets:isaiah:50:2",
            "prophets:ii%20samuel:8:2",
            "prophets:ezekiel:15:3"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:3:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:8",
            "Sefer%20Yetzirah:1:4"
        ]
    }
}