{
    "VERSE": "40:71",
    "ARABIC": "إِذِ ٱلْأَغْلَٰلُ فِىٓ أَعْنَٰقِهِمْ وَٱلسَّلَٰسِلُ يُسْحَبُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "when they have shackles and chains around their necks and are dragged along the ground",
        "TRANSLATION_1": "When, with (iron) collars and chains around their necks, they will be dragged\n",
        "TRANSLATION_2": "when fetters and chains shall be on their necks, and they shall be dragged into\n",
        "TRANSLATION_3": "when fetters will be placed around their necks and chains will drag them\n",
        "TRANSLATION_4": "When around their necks will be shackles and chains; they will be dragged. –\n",
        "TRANSLATION_5": "When iron collars will be rounded over their necks, and the chains, they shall be dragged along,\n",
        "TRANSLATION_6": "When the fetters and the chains shall be on their necks; they shall be dragged\n",
        "TRANSLATION_7": "When the fetters and chains are on their necks, and they dragged\n",
        "TRANSLATION_8": "When carcans are about their necks and chains. They are dragged\n",
        "TRANSLATION_9": "when, with iron collars and chains around their necks, they are dragged\n",
        "TRANSLATION_10": "When shackles will be on their necks and also chains; they will be dragged.\n",
        "TRANSLATION_11": "when they are dragged [with] iron collars and chains around their necks\n",
        "TRANSLATION_12": "When the yokes (shall be) round their necks, and the chains; they shall be dragged along-\n",
        "TRANSLATION_13": "When iron collars will be rounded over their necks, and the chains, they shall be dragged along.\n",
        "TRANSLATION_14": "When the fetters and chains are round their necks they shall be dragged\n",
        "TRANSLATION_15": "When the yokes are around their necks, and they will be dragged by the chains.\n",
        "TRANSLATION_16": "When the shackles are around their necks and the chains; they will be dragged\n",
        "TRANSLATION_17": "[40:71] when (idh has the meaning of idhā) [with] fetters around their necks and chains (wa’l-salāsilu, a supplement to al-aghlālu, ‘fetters’, so that the meaning is that these [chains] are also around their necks; or it [alsalāsilu, ‘chains’] is the subject, the predicate of which has been omitted, in other words [the meaning being]: around their feet [will be these chains] — or [alternatively] its predicate is [the following, yushabūna]), they are dragged, in other words, they are dragged away by these [chains].\n",
        "TRANSLATION_18": "(When carcans are about their necks and chains) tied up with the satans. (They are dragged) in the Fire\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "40:71",
            "76:4",
            "36:8",
            "17:29",
            "107:7",
            "34:33",
            "13:5",
            "26:94",
            "17:13",
            "38:33"
        ],
        "BIBLE": [
            "writings:psalms:149:8",
            "prophets:zechariah:10:10",
            "writings:ii%20chronicles:4:8",
            "prophets:hosea:10:10",
            "writings:daniel:5:7",
            "writings:proverbs:1:9",
            "prophets:ezekiel:16:11",
            "prophets:ezekiel:36:33",
            "torah:deuteronomy:28:48",
            "prophets:ezekiel:36:10"
        ]
    }
}