{
    "VERSE": "40:75",
    "ARABIC": "ذَٰلِكُم بِمَا كُنتُمْ تَفْرَحُونَ فِى ٱلْأَرْضِ بِغَيْرِ ٱلْحَقِّ وَبِمَا كُنتُمْ تَمْرَحُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "'That is because you exulted on the earth, without any right to do so; and strutted about.",
        "TRANSLATION_1": "This is so because you went about exulting wrongfully in the land,\" (will they be told), \"and you were insolent.\n",
        "TRANSLATION_2": "(They will be told): “This is because while you were on earth you took delight in untruth and exulted in it.\n",
        "TRANSLATION_3": "They will be told, \"This (torment) is the result of your unreasonable happiness on the earth and of your propagation of falsehood.\n",
        "TRANSLATION_4": "“This is the recompense of your being happy upon falsehood in the earth, and the recompense of your conceit.”\n",
        "TRANSLATION_5": "That was because you had been exulting in the earth without any right, and that you used to rejoice extremely.\n",
        "TRANSLATION_6": "That is because you exulted in the land unjustly and because you behaved insolently.\n",
        "TRANSLATION_7": "That is because you rejoiced in the earth without right, and were exultant.\n",
        "TRANSLATION_8": "(And it is said unto them): This is because ye exulted in the earth without right, and because ye were petulant.\n",
        "TRANSLATION_9": "that is because you exulted in the land without justification and because you behaved insolently.\n",
        "TRANSLATION_10": "That is because ye had been exulting in the earth without right, and because ye had been strutting.\n",
        "TRANSLATION_11": "‘That [punishment] is because you used to boast unduly on the earth and because you used to strut.\n",
        "TRANSLATION_12": "That was because ye were wont to rejoice on the earth in things other than the Truth, and that ye were wont to be insolent.\n",
        "TRANSLATION_13": "That was because you had been exulting in the earth without any right (by worshipping others instead of Allah and by committing crimes), and that you used to rejoice extremely (in your error).\n",
        "TRANSLATION_14": "(And it will be said): 'That is because you rejoiced on earth in things of which you had no right, and were very happy.\n",
        "TRANSLATION_15": "That is because you used to rejoice on earth in other than the truth, and because you used to behave with vanity.\n",
        "TRANSLATION_16": "[The angels will say], \"That was because you used to exult upon the earth without right and you used to behave insolently.\n",
        "TRANSLATION_17": "[40:75] And it will also be said to them: ‘That, chastisement, is because you used to exult in the earth without right, by [your] idolatry and denial of resurrection, and because you were insolent, committing acts of disobedience in abundance.\n",
        "TRANSLATION_18": "((And it is said unto them): This) torment in the Fire (is because ye exulted in the earth without right, and because ye were petulant) and because of your arrogance in your state of idolatry.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "40:75",
            "28:39",
            "16:3",
            "42:42",
            "23:79",
            "91:6",
            "46:20",
            "23:84",
            "64:3",
            "26:152"
        ],
        "BIBLE": [
            "prophets:i%20kings:12:28",
            "writings:job:34:5",
            "prophets:ii%20kings:8:9",
            "prophets:ii%20kings:10:15",
            "prophets:amos:6:13",
            "writings:ii%20chronicles:20:21",
            "torah:genesis:24:10",
            "prophets:ii%20kings:12:19",
            "prophets:isaiah:49:4",
            "prophets:ii%20kings:2:14"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:8"
        ]
    }
}