{
    "VERSE": "40:76",
    "ARABIC": "ٱدْخُلُوٓا۟ أَبْوَٰبَ جَهَنَّمَ خَٰلِدِينَ فِيهَا فَبِئْسَ مَثْوَى ٱلْمُتَكَبِّرِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Enter the gates of Hell, remaining in it timelessly, for ever. How evil is the abode of the arrogant!'",
        "TRANSLATION_1": "So enter the gates of Hell to abide in it for ever.\" How evil the abode of the arrogant!\n",
        "TRANSLATION_2": "Enter Hell now to abide in it. How woeful is the abode of those who wax proud!\n",
        "TRANSLATION_3": "Enter the gates of hell to live therein forever. How terrible is the dwelling of the arrogant ones.\n",
        "TRANSLATION_4": "“Enter the gates of hell, to remain in it forever”; so what a wretched destination for the haughty!\n",
        "TRANSLATION_5": "Enter the gates of Hell to abide therein, and (indeed) what an evil abode of the arrogant!\n",
        "TRANSLATION_6": "Enter the gates of hell to abide therein, evil then is the abode of the proud.\n",
        "TRANSLATION_7": "Enter the gates of Gehenna, to dwell therein forever.' How evil is the lodging of those that are proud!\n",
        "TRANSLATION_8": "Enter ye the gates of hell, to dwell therein. Evil is the habitation of the scornful.\n",
        "TRANSLATION_9": "Enter the gates of Hell to stay therein forever. The abode of the arrogant is evil.\n",
        "TRANSLATION_10": "Enter ye the gates of Hell as abiders therein. Hapless is the abode of the stiff-necked.\n",
        "TRANSLATION_11": "Enter the gates of hell, to remain in it [forever].’ Evil is the [final] abode of the arrogant.\n",
        "TRANSLATION_12": "Enter ye the gates of Hell, to dwell therein: and evil is (this) abode of the arrogant!\"\n",
        "TRANSLATION_13": "Enter the gates of Hell to abide therein, and (indeed) what an evil abode of the arrogant!\n",
        "TRANSLATION_14": "Enter the gates of Gehenna and live there for ever. Evil is the lodging of the proud.\n",
        "TRANSLATION_15": "Enter the gates of Hell, to remain therein forever. What a terrible dwelling for the arrogant.\n",
        "TRANSLATION_16": "Enter the gates of Hell to abide eternally therein, and wretched is the residence of the arrogant.\"\n",
        "TRANSLATION_17": "[40:76] Enter the gates of Hell, to abide therein’. Evil then is the [ultimate] abode of the arrogant!\n",
        "TRANSLATION_18": "(Enter ye the gates of hell, to dwell therein) never to die or come out. (Evil is the habitation of the scornful) evil is the habitation of the disbelievers in the Fire.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "40:76",
            "39:72",
            "16:29",
            "15:14",
            "12:23",
            "78:19",
            "7:161",
            "38:50",
            "74:4",
            "17:18"
        ],
        "BIBLE": [
            "writings:job:18:15",
            "prophets:jeremiah:49:33",
            "torah:deuteronomy:16:11",
            "prophets:isaiah:32:18",
            "prophets:isaiah:26:2",
            "writings:psalms:100:4",
            "prophets:i%20kings:8:13",
            "writings:ii%20chronicles:6:2",
            "prophets:jeremiah:17:27",
            "writings:psalms:118:20"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:8"
        ]
    }
}