{
    "VERSE": "40:77",
    "ARABIC": "فَٱصْبِرْ إِنَّ وَعْدَ ٱللَّهِ حَقٌّ فَإِمَّا نُرِيَنَّكَ بَعْضَ ٱلَّذِى نَعِدُهُمْ أَوْ نَتَوَفَّيَنَّكَ فَإِلَيْنَا يُرْجَعُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "So be steadfast, Allah's promise is true. Whether We show you some of what We have promised them, or take you back to Us, they will in any case be returned to Us.",
        "TRANSLATION_1": "So you persevere with patience (in your mission). The promise of God is true. Whether We show you some of the punishment We have promised them, or gather you up in death, they have to come back to Us.\n",
        "TRANSLATION_2": "So be patient, (O Prophet). Surely Allah's promise is true. Whether We show them a part of the woeful consequences against which We warn them (while you are still in their midst) or We recall you (from this world) before that, eventually it is to Us that they shall be brought back.\n",
        "TRANSLATION_3": "(Muhammad), exercise patience. The promise of God is true. Whether We let you witness the suffering with which they were threatened or because of your death (you do not see them suffering,), We shall still punish them when they return to Us (on the Day of Judgment).\n",
        "TRANSLATION_4": "Therefore be patient (O dear Prophet Mohammed – peace and blessings be upon him), undoubtedly Allah’s promise is true; and whether We show some of what We promise them, or cause you to pass away before it – in any case they will return to Us.\n",
        "TRANSLATION_5": "So be patient, verily, the promise of Allah is true and whether We show you some part of what We have promised them, or We cause you to die, then still it is to Us they all shall be returned.\n",
        "TRANSLATION_6": "So be patient, surely the promise of Allah is true. So should We make you see part of what We threaten them with, or should We cause you to die, to Us shall they be returned.\n",
        "TRANSLATION_7": "So be thou patient; surely God's promise is true. Whether We show thee a part of that We promise them, or We call thee unto Us, to Us they shall be returned.\n",
        "TRANSLATION_8": "Then have patience (O Muhammad). Lo! the promise of Allah is true. And whether we let thee see a part of that which We promise them, or (whether) We cause thee to die, still unto Us they will be brought back.\n",
        "TRANSLATION_9": "So be patient [Prophet], for God's promise is true: whether We show you part of what We have promised them in this life, or cause you to die first, it is to Us that they will be recalled.\n",
        "TRANSLATION_10": "Wherefore persevere thou; verily the promise of Allah is true; then whether We let thee see a part of that wherewith We have promised them, or whether We cause thee to die, Unto us they all will be caused to retvtn.\n",
        "TRANSLATION_11": "So be patient! Allah’s promise is indeed true. Whether We show you a part of what We promise them, or take you away [before that], [in any case] they will be brought back to Us.\n",
        "TRANSLATION_12": "So persevere in patience; for the Promise of Allah is true: and whether We show thee (in this life) some part of what We promise them,- or We take thy soul (to Our Mercy) (before that),-(in any case) it is to Us that they shall (all) return.\n",
        "TRANSLATION_13": "So be patient (O Muhammad SAW), verily, the Promise of Allah is true, and whether We show you (O Muhammad SAW in this world) some part of what We have promised them, or We cause you to die, then it is to Us they all shall be returned.\n",
        "TRANSLATION_14": "Therefore have patience, the Promise of Allah is true. Whether We show you something of that We promise them or call you to Us, to Us they shall all return.\n",
        "TRANSLATION_15": "So be patient. The promise of God is true. Whether We show you some of what We have promised them, or take you to Us, to Us they will be returned.\n",
        "TRANSLATION_16": "So be patient, [O Muhammad]; indeed, the promise of Allah is truth. And whether We show you some of what We have promised them or We take you in death, it is to Us they will be returned.\n",
        "TRANSLATION_17": "[40:77] So be patient. Assuredly God’s promise, to chastise them, is true. And if We show you (fa-immā contains an assimilated conditional particle in; the mā is extra and emphasises the conditional import at the beginning of the verb, while the nūn emphasises it at the end) a part of what We promise them, of chastisement, in your lifetime (the response to the conditional has been omitted, in other words [it is something like]: ‘then so be it!’) … or We take you unto Us [in death], before their chastisement, then [in any case] to Us they will be returned, whereupon We shall chastise them with the most severe punishment (this [last] mentioned response is that of the supplement only).\n",
        "TRANSLATION_18": "548 (Then have patience) Muhammad, in the face of the harm of the disbelievers. (Lo! the promise of Allah) to assist you and destroy your enemies (is true) will happen. (And whether we let thee see a part of that which We promise them) of punishment on the Day of Badr, (or (whether) We cause you to die) before you see it, (still unto us they will be brought back) after they die, whether you see them punished or not.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "40:77",
            "30:60",
            "10:46",
            "27:79",
            "2:176",
            "9:67",
            "39:2",
            "28:13",
            "10:55",
            "35:5"
        ],
        "BIBLE": [
            "prophets:ii%20samuel:15:20",
            "writings:ezra:5:5",
            "prophets:isaiah:55:11",
            "prophets:ii%20samuel:3:13",
            "prophets:i%20kings:19:2",
            "torah:deuteronomy:13:15",
            "writings:daniel:6:13",
            "torah:exodus:20:21",
            "prophets:ii%20samuel:17:3",
            "torah:exodus:23:13"
        ]
    }
}