{
    "VERSE": "40:81",
    "ARABIC": "وَيُرِيكُمْ ءَايَٰتِهِۦ فَأَىَّ ءَايَٰتِ ٱللَّهِ تُنكِرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "He shows you His Signs, so which of Allah's Signs do you deny?",
        "TRANSLATION_1": "He shows His signs. How many of God's signs will you then deny?\n",
        "TRANSLATION_2": "Allah shows His Signs to you; then which of Allah's Signs will you deny?\n",
        "TRANSLATION_3": "God shows you the evidence (of His existence). How can you then deny such evidence?\n",
        "TRANSLATION_4": "And He shows you His signs; so which sign of Allah will you deny?\n",
        "TRANSLATION_5": "And He shows you His Ayat. Which, then of the Ayat of Allah do you deny\n",
        "TRANSLATION_6": "And He shows you His signs: which then of Allah's signs will you deny?\n",
        "TRANSLATION_7": "And He shows you His signs; then which of God's signs do you reject?\n",
        "TRANSLATION_8": "And He showeth you His tokens. Which, then, of the tokens of Allah do ye deny?\n",
        "TRANSLATION_9": "He shows you His signs; which then of the signs of God will you deny?\n",
        "TRANSLATION_10": "And He sheweth you His signs. Which, then, of the signs of Allah shall ya deny?\n",
        "TRANSLATION_11": "He shows you His signs. So which of the signs of Allah do you deny?\n",
        "TRANSLATION_12": "And He shows you (always) His Signs: then which of the Signs of Allah will ye deny?\n",
        "TRANSLATION_13": "And He shows you His Signs and Proofs (of His Oneness in all the above mentioned things). Which, then of the Signs and Proofs of Allah do you deny?\n",
        "TRANSLATION_14": "He shows you His signs. Now which of the signs of Allah do you disbelieve?\n",
        "TRANSLATION_15": "And He shows you His signs. So which of God’s signs will you deny?\n",
        "TRANSLATION_16": "And He shows you His signs. So which of the signs of Allah do you deny?\n",
        "TRANSLATION_17": "[40:81] And He shows you His signs. So which of God’s signs, that is, [the signs] that prove His Oneness, do you reject? (the interrogative here is meant as a rebuke; ayya, ‘which of’ is more commonly made masculine than feminine).\n",
        "TRANSLATION_18": "(And He showeth you) O people of Mecca (His tokens) His marvels: the sun, the moon, the stars, the day, the night, the mountains, the clouds, the seas, etc., all these are signs of Allah. (Which, then, of the tokens) of the signs (of Allah do ye deny) and claim is not from Allah?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "40:81",
            "26:150",
            "26:126",
            "26:110",
            "26:108",
            "26:131",
            "26:179",
            "26:163",
            "26:144",
            "53:62"
        ],
        "BIBLE": [
            "prophets:isaiah:38:7",
            "torah:genesis:41:28",
            "prophets:joshua:1:17",
            "writings:proverbs:30:7",
            "prophets:ezekiel:11:25",
            "torah:deuteronomy:1:32",
            "prophets:ii%20kings:20:9",
            "prophets:ezekiel:24:24",
            "torah:deuteronomy:25:16",
            "writings:job:13:20"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:2",
            "Sefer%20Yetzirah:1:2",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:14"
        ]
    }
}