{
    "VERSE": "40:84",
    "ARABIC": "فَلَمَّا رَأَوْا۟ بَأْسَنَا قَالُوٓا۟ ءَامَنَّا بِٱللَّهِ وَحْدَهُۥ وَكَفَرْنَا بِمَا كُنَّا بِهِۦ مُشْرِكِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "When they saw Our violent force, they said, 'We have iman in Allah alone and reject what we associated with Him.'",
        "TRANSLATION_1": "So that when they saw Our might, they said: \"We believe in God the one and single, and reject those we associated (with Him).\" --\n",
        "TRANSLATION_2": "When they saw Our chastisement, they said: “We have come to believe in Allah, the Only One, and we reject all what we had associated (with Allah in His Divinity).”\n",
        "TRANSLATION_3": "They said, \"We believe in One God and disbelieve in whatever we had considered equal to Him,\" when they experienced Our wrath.\n",
        "TRANSLATION_4": "So when they saw Our punishment, they said, “We accept faith in the One Allah, and reject those whom we ascribed with Him.”\n",
        "TRANSLATION_5": "So when they saw Our punishment, they said: \"We believe in Allah Alone and reject (all) that we used to associate with Him as (His) partners.\"\n",
        "TRANSLATION_6": "But when they saw Our punishment, they said: We believe in Allah alone and we deny what we used to associate with Him.\n",
        "TRANSLATION_7": "Then, when they saw Our might, they said, 'We believe in God alone, and we disbelieve in that we were associating with Him.'\n",
        "TRANSLATION_8": "Then, when they saw Our doom, they said: We believe in Allah only and reject (all) that we used to associate (with Him).\n",
        "TRANSLATION_9": "but when they saw Our punishment, they said, \"We believe in God, the One God, and we reject the partners we used to associate with Him,\"\n",
        "TRANSLATION_10": "Then when they behold Our prowess, they said: we believe in Allah alone, and we disbelieve in that which with Him we have been associating.\n",
        "TRANSLATION_11": "Then, when they sighted Our punishment, they said, ‘We believe in Allah alone, and disavow what we used to take as His partners.’\n",
        "TRANSLATION_12": "But when they saw Our Punishment, they said: \"We believe in Allah,- the one Allah - and we reject the partners we used to join with Him.\"\n",
        "TRANSLATION_13": "So when they saw Our punishment, they said: \"We believe in Allah Alone and reject (all) that we used to associate with Him as (His) partners.\n",
        "TRANSLATION_14": "And when they saw Our Might, they said: 'We believe in Allah alone, and we disbelieve in that we used to associate with Him'\n",
        "TRANSLATION_15": "Then, when they witnessed Our might, they said, “We believe in God alone, and we reject what we used to associate with Him.”\n",
        "TRANSLATION_16": "And when they saw Our punishment, they said,\" We believe in Allah alone and disbelieve in that which we used to associate with Him.\"\n",
        "TRANSLATION_17": "[40:84] Then, when they saw Our doom, that is, the severity of Our chastisement, they said, ‘We believe in God alone, and we disavow what we used to associate with Him’.\n",
        "TRANSLATION_18": "(Then, when they saw Our doom) which came to destroy them, (they said: We believe in Allah only and reject (all) that we used to associate (with Him)) but this was said with their tongues only when they saw the punishment, but their hearts still did not believe. 549\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "40:84",
            "7:70",
            "40:85",
            "19:49",
            "2:15",
            "9:77",
            "39:45",
            "21:12",
            "2:156",
            "16:1"
        ],
        "BIBLE": [
            "prophets:ezekiel:22:28",
            "torah:exodus:18:14",
            "torah:genesis:16:13",
            "prophets:isaiah:49:21",
            "torah:exodus:32:9",
            "torah:exodus:2:6",
            "torah:genesis:42:21",
            "prophets:ii%20kings:6:20",
            "prophets:judges:13:22",
            "torah:genesis:7:1"
        ]
    }
}