{
    "VERSE": "40:9",
    "ARABIC": "وَقِهِمُ ٱلسَّيِّـَٔاتِ وَمَن تَقِ ٱلسَّيِّـَٔاتِ يَوْمَئِذٍ فَقَدْ رَحِمْتَهُۥ وَذَٰلِكَ هُوَ ٱلْفَوْزُ ٱلْعَظِيمُ",
    "ENGLISH": {
        "TRANSLATION_0": "And safeguard them from evil acts. Those You safeguard from evil acts are truly the recipients of Your",
        "TRANSLATION_1": "Protect them from evil; and whosoever You preserve from evil on that Day shall have surely received Your mercy. This will be the great triumph.\"\n",
        "TRANSLATION_2": "and guard them against all ills. He whom You guard against ills on that Day, to him You have surely been Most Merciful. That is the great triumph.”\n",
        "TRANSLATION_3": "Lord, keep them away from evil deeds. Whomever You have saved from evil on the Day of Judgment has certainly been granted Your mercy and this is the greatest triumph.\n",
        "TRANSLATION_4": "“And save them from the evil consequences of sins; and whomever You save from the evil consequences of sins on that Day – so You have indeed had mercy upon him; and this only is the greatest success.”\n",
        "TRANSLATION_5": "And save them from the sins, and whomsoever You save from the sins that Day, him verily, You have taken into mercy.\" And that is the supreme success.\n",
        "TRANSLATION_6": "And keep them from evil deeds, and whom Thou keepest from evil deeds this day, indeed Thou hast mercy on him, and that is the mighty achievement.\n",
        "TRANSLATION_7": "And guard them against evil deeds; whomsoever Thou guardest against evil deeds on that day, on him Thou hast had mercy; and that is indeed the mighty triumph.\n",
        "TRANSLATION_8": "And ward off from them ill-deeds; and he from whom Thou wardest off ill-deeds that day, him verily hast Thou taken into mercy. That is the supreme triumph.\n",
        "TRANSLATION_9": "Protect them from all evil deeds: those You protect from [the punishment for] evil deeds will receive Your mercy -- that is the supreme success.\"\n",
        "TRANSLATION_10": "And protect them from evils. And whosoever Thou shalt protect from evils on that Day, him Thou hast of a surety taken into mercy and that: it is an achievement mighty.\n",
        "TRANSLATION_11": "Save them from the ills [of the Day of Retribution]; and whomever You save from the ills that day, You will have had mercy upon him, and that is the great triumph.’\n",
        "TRANSLATION_12": "And preserve them from (all) ills; and any whom Thou dost preserve from ills that Day,- on them wilt Thou have bestowed Mercy indeed: and that will be truly (for them) the highest Achievement\".\n",
        "TRANSLATION_13": "And save them from (the punishment, because of what they did of) the sins, and whomsoever You save from (the punishment, because of what they did of) the sins (i.e. excuse them) that Day, him verily, You have taken into mercy.\" And that is the supreme success.\n",
        "TRANSLATION_14": "and guard them against all evil deeds. Whosoever You guarded against evil deeds on that Day, surely, You have had mercy upon them, and that is indeed the mighty triumph'\n",
        "TRANSLATION_15": "And shield them from the evil deeds. Whomever You shield from the evil deeds, on that Day, You have had mercy on him. That is the supreme achievement.”\n",
        "TRANSLATION_16": "And protect them from the evil consequences [of their deeds]. And he whom You protect from evil consequences that Day - You will have given him mercy. And that is the great attainment.\"\n",
        "TRANSLATION_17": "[40:9] And shield them from evil deeds, that is, [from] the chastisement thereof; for whomever You shield from evil deeds that day, the Day of Resurrection, verily him You will have had been merciful to; and that is indeed the supreme triumph’.\n",
        "TRANSLATION_18": "(And ward off from them ill deeds) and drive away from them the torment of the Day of Judgement; (and he from whom Thou wardest off ill deeds) and he from whom you drive away the chastisement (that day) on the Day of Judgement, (him verily hast Thou taken into mercy) him indeed have You forgiven, protected and raised in station. (That) i.e. forgiveness and driving away chastisement (is the Supreme Triumph) is the abundant triumph: i.e. to gain the Garden and be saved from the Fire.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "40:9",
            "6:16",
            "37:60",
            "48:5",
            "64:9",
            "44:57",
            "4:13",
            "33:71",
            "8:29",
            "45:30"
        ],
        "BIBLE": [
            "prophets:ezekiel:18:13",
            "prophets:i%20samuel:21:7",
            "writings:job:1:21",
            "prophets:zephaniah:3:15",
            "writings:ezra:9:13",
            "torah:leviticus:7:34",
            "torah:numbers:18:6",
            "torah:numbers:8:16",
            "prophets:isaiah:49:25",
            "prophets:i%20kings:3:6"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:4:3"
        ]
    }
}