{
    "VERSE": "27:1",
    "ARABIC": "بِسْمِ ٱللَّهِ ٱلرَّحْمَٰنِ ٱلرَّحِيمِ طسٓ تِلْكَ ءَايَٰتُ ٱلْقُرْءَانِ وَكِتَابٍ مُّبِينٍ",
    "ENGLISH": {
        "TRANSLATION_0": "Ta Sin. Those are the Signs of the Qur'an and a Clear Book.",
        "TRANSLATION_1": "TA SIN. THESE are the verses of the Qur'an, and collection of explicit laws,\n",
        "TRANSLATION_2": "Ta'. Sin. These are the verses of the Qur'an and a Clear Book;\n",
        "TRANSLATION_3": "Ta. Sin. These are the verses of the Quran and of the illustrious Book\n",
        "TRANSLATION_4": "Ta-Seen*; these are verses of the Qur’an and the clear Book. (Alphabets of the Arabic language – Allah, and to whomever he reveals, know their precise meanings.)\n",
        "TRANSLATION_5": "Ta Sin. These are the Ayat of the Qur'an, and (it is) a Book (that is) clear.\n",
        "TRANSLATION_6": "Ta Sin! These are the verses of the Quran and the Book that makes (things) clear\n",
        "TRANSLATION_7": "Ta Sin. Those are the signs of the Koran and a Manifest Book,\n",
        "TRANSLATION_8": "Ta. Sin. These are revelations of the Qur'an and a Scripture that maketh plain;\n",
        "TRANSLATION_9": "Ta Sin. These are verses from the Quran, a book that makes things clear;\n",
        "TRANSLATION_10": "Ta. Sin. These are the verses of the Qur'an and a Book luminous.\n",
        "TRANSLATION_11": "Ta, Seen. These are the signs of the Quran and a manifest Book,\n",
        "TRANSLATION_12": "These are verses of the Qur'an,-a book that makes (things) clear;\n",
        "TRANSLATION_13": "Ta-Sin. [These letters are one of the miracles of the Quran, and none but Allah (Alone) knows their meanings]. These are the Verses of the Quran, and (it is) a Book (that makes things) clear;\n",
        "TRANSLATION_14": "TaSeen. Those are the verses of the Koran, a clear Book,\n",
        "TRANSLATION_15": "Ta, Seen. These are the Signs of the Quran—a book that makes things clear.\n",
        "TRANSLATION_16": "Ta, Seen. These are the verses of the Qur'an and a clear Book\n",
        "TRANSLATION_17": "[27:1] Tā sīn: God knows best what He means by these [letters]. Those, namely, these signs, are the signs of the Qur’ān, signs from it, and a Manifest Book, manifesting [what is] truth from [what is] falsehood (wa-kitābin, ‘Book’, is a supplement [to al-qur’ān] with the addition of an adjective [mubīn, ‘manifest’]).\n",
        "TRANSLATION_18": "And from his narration on the authority of Ibn 'Abbas that he said regarding the interpretation of Allah's saying (Ta. Sin.): '(Ta. Sin.) He says: the (Ta) stands for His might (tawluh) and the (Sin) stands for His majesty (sana'uh); it is also said that it is an oath by which Allah swore. (These are revelations of the Qur'an 425 and a Scripture that maketh plain) this surah consists of verses of the Qur'an and it is a Book that makes plain the lawful and the unlawful;\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "15:1",
            "27:1",
            "12:1",
            "26:2",
            "28:2",
            "10:1",
            "31:2",
            "41:3",
            "52:2",
            "29:47"
        ],
        "BIBLE": [
            "torah:exodus:18:16",
            "writings:job:13:23",
            "writings:daniel:5:15",
            "writings:daniel:4:15",
            "writings:daniel:2:26",
            "torah:deuteronomy:4:9",
            "torah:genesis:26:28",
            "prophets:ii%20samuel:7:21",
            "torah:leviticus:5:13",
            "prophets:nahum:3:6"
        ]
    }
}