{
    "VERSE": "27:11",
    "ARABIC": "إِلَّا مَن ظَلَمَ ثُمَّ بَدَّلَ حُسْنًۢا بَعْدَ سُوٓءٍ فَإِنِّى غَفُورٌ رَّحِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "except for one who did wrong and then changed evil into good - for I am Ever-Forgiving, Most Merciful.",
        "TRANSLATION_1": "Except those who do some wrong but afterwards do good to make up for the wrong. And I am forgiving and merciful.\n",
        "TRANSLATION_2": "except he who has committed some wrong. But if he substitutes good in place of evil, I am Most Forgiving, Most Compassionate.\n",
        "TRANSLATION_3": "Only the unjust become afraid in My presence. Even to these people who replace their bad deeds by good ones, I am All-forgiving and All-merciful.\n",
        "TRANSLATION_4": "“Except the one* who does injustice and then after evil changes it for virtue – then indeed I am Oft Forgiving, Most Merciful.” (Other than the Prophets.)\n",
        "TRANSLATION_5": "Except him who has done wrong and afterwards has changed evil for good; then surely, I am Oft-Forgiving, Most Merciful.\"\n",
        "TRANSLATION_6": "Neither he who has been unjust, then he does good instead after evil, for surely I am the Forgiving, the Merciful:\n",
        "TRANSLATION_7": "save him who has done evil, then; after evil, has changed into good; All-forgiving am I, All-compassionate.\n",
        "TRANSLATION_8": "Save him who hath done wrong and afterward hath changed evil for good. And lo! I am Forgiving, Merciful.\n",
        "TRANSLATION_9": "as for those who do wrong and then do good after evil, I am most forgiving, most merciful.\n",
        "TRANSLATION_10": "Excepting any who may have done wrong and thereafter changeth evil for good then verily I am Forgiving, Merciful.\n",
        "TRANSLATION_11": "nor those who do wrong and then make up for [their] fault with goodness, for indeed I am all-forgiving, all-merciful.’\n",
        "TRANSLATION_12": "But if any have done wrong and have thereafter substituted good to take the place of evil, truly, I am Oft-Forgiving, Most Merciful.\n",
        "TRANSLATION_13": "Except him who has done wrong and afterwards has changed evil for good, then surely, I am Oft-Forgiving, Most Merciful.\n",
        "TRANSLATION_14": "except he who has done evil, then, after evil, has changed into good. I am the Forgiving, Most Merciful.\n",
        "TRANSLATION_15": "But whoever has done wrong, and then substituted goodness in place of evil. I am Forgiving and Merciful.\n",
        "TRANSLATION_16": "Otherwise, he who wrongs, then substitutes good after evil - indeed, I am Forgiving and Merciful.\n",
        "TRANSLATION_17": "[27:11] except him who has wronged, his soul, but then changed [his wrong] for good — he [then] performs [good deeds] — after [having done] evil, in other words, [he has] repented, then truly I am Forgiving, Merciful, I will accept his repentance and forgive him.\n",
        "TRANSLATION_18": "Save him who hath done wrong and afterward hath changed evil for good. And lo! I am Forgiving) I forgive the one who repents, (Merciful) I show mercy towards he who dies in a state of repentance.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "27:11",
            "7:153",
            "25:70",
            "24:5",
            "3:89",
            "16:119",
            "12:53",
            "9:27",
            "16:110",
            "4:110"
        ],
        "BIBLE": [
            "torah:leviticus:27:10",
            "prophets:jeremiah:14:13",
            "prophets:isaiah:52:9",
            "writings:psalms:52:11",
            "torah:exodus:18:21",
            "writings:daniel:11:24",
            "torah:numbers:10:29",
            "writings:ii%20chronicles:33:17",
            "prophets:joshua:3:3",
            "torah:deuteronomy:23:17"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:4:12"
        ]
    }
}