{
    "VERSE": "27:13",
    "ARABIC": "فَلَمَّا جَآءَتْهُمْ ءَايَٰتُنَا مُبْصِرَةً قَالُوا۟ هَٰذَا سِحْرٌ مُّبِينٌ",
    "ENGLISH": {
        "TRANSLATION_0": "When Our Signs came to them in all their clarity, they said, 'This is downright magic,'",
        "TRANSLATION_1": "And when Our signs came as distinct proofs, they said: \"This is only magic.\"\n",
        "TRANSLATION_2": "But when Our Clear Signs came to them, they said: \"This is plain magic.\"\n",
        "TRANSLATION_3": "When Our miracles were visibly shown to them, they said, \"It is plain magic\".\n",
        "TRANSLATION_4": "Then when Our enlightening signs came to them, they said, “This is clear magic.”\n",
        "TRANSLATION_5": "But when Our Ayat came to them, clear to see, they said: \"This is a manifest magic.\"\n",
        "TRANSLATION_6": "So when Our clear signs came to them, they said: This is clear enchantment.\n",
        "TRANSLATION_7": "But when Our signs came to them visibly, they said, 'This is a manifest sorcery';\n",
        "TRANSLATION_8": "But when Our tokens came unto them, plain to see, they said: This is mere magic,\n",
        "TRANSLATION_9": "But when Our signs came to them in all their clarity they said, \"This is clearly sorcery!\"\n",
        "TRANSLATION_10": "Then when Our signs came unto them illuminating, they said: this is a magic manifest.\n",
        "TRANSLATION_11": "But when Our signs came to them, as eye-openers, they said, ‘This is plain magic.’\n",
        "TRANSLATION_12": "But when Our Signs came to them, that should have opened their eyes, they said: \"This is sorcery manifest!\"\n",
        "TRANSLATION_13": "But when Our Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) came to them, clear to see, they said: \"This is a manifest magic.\"\n",
        "TRANSLATION_14": "But when Our signs came to them visibly, they said: 'This is plain sorcery.'\n",
        "TRANSLATION_15": "Yet when Our enlightening signs came to them, they said, “This is obvious witchcraft.”\n",
        "TRANSLATION_16": "But when there came to them Our visible signs, they said, \"This is obvious magic.\"\n",
        "TRANSLATION_17": "[27:13] But when Our signs came to them plain to see, illuminating and clear, they said, ‘This is manifest sorcery’, clear and evident [sorcery].\n",
        "TRANSLATION_18": "(But when Our tokens came unto them) when Moses went with our tokens to them, (plain to see) demonstrating, one after the other, (they said: This is mere magic) what you have brought us, Moses, is a manifest lie,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "27:13",
            "54:2",
            "46:7",
            "28:36",
            "43:47",
            "15:81",
            "10:76",
            "37:15",
            "43:30",
            "37:14"
        ],
        "BIBLE": [
            "prophets:ii%20kings:6:20",
            "torah:genesis:27:1",
            "prophets:ezekiel:3:22",
            "prophets:ii%20samuel:6:20",
            "prophets:ii%20kings:6:33",
            "torah:exodus:2:18",
            "writings:job:1:18",
            "prophets:ezekiel:24:20",
            "prophets:i%20kings:11:2",
            "prophets:judges:11:35"
        ]
    }
}