{
    "VERSE": "27:14",
    "ARABIC": "وَجَحَدُوا۟ بِهَا وَٱسْتَيْقَنَتْهَآ أَنفُسُهُمْ ظُلْمًا وَعُلُوًّا فَٱنظُرْ كَيْفَ كَانَ عَٰقِبَةُ ٱلْمُفْسِدِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "and they repudiated them wrongly and haughtily, in spite of their own certainty about them. See the final fate of the corrupters.",
        "TRANSLATION_1": "And they denied them out of malice and pride, though in their hearts they believed that they were true. So see how was the end of evil-doers!\n",
        "TRANSLATION_2": "They denied those Signs out of iniquity and arrogance although their hearts were convinced of their truth. So see how evil was the end of those mischief-makers!\n",
        "TRANSLATION_3": "They rejected the evidence because of their arrogance and injustice, although their souls knew it to be true. Think how terrible the end of the sinful ones was!\n",
        "TRANSLATION_4": "And they denied them – whereas in their hearts they were certain of them – due to injustice and pride; therefore see what sort of fate befell the mischievous!\n",
        "TRANSLATION_5": "And they belied them wrongfully and arrogantly, though they themselves were convinced thereof. So, see what was the end of the mischief-makers.\n",
        "TRANSLATION_6": "And they denied them unjustly and proudly while their soul had been convinced of them; consider, then how was the end of the mischief-makers.\n",
        "TRANSLATION_7": "and they denied them, though their souls acknowledged them, wrongfully and out of pride. Behold, how was the end of the workers of corruption!\n",
        "TRANSLATION_8": "And they denied them, though their souls acknowledged them, for spite and arrogance. Then see the nature of the consequence for the wrong-doers!\n",
        "TRANSLATION_9": "And they persisted in rejecting them wrongfully and arrogantly, while in their hearts they were convinced of their truth. Observe, then, how evil was the fate of the evil-doers.\n",
        "TRANSLATION_10": "And they gainsaid them, out of spite and arrogance, although their souls were convinced thereof. So behold! what hath been the end of the corruptors.\n",
        "TRANSLATION_11": "They impugned them, wrongfully and out of arrogance, though they were convinced in their hearts [of their veracity]. So observe how the fate of the agents of corruption was!\n",
        "TRANSLATION_12": "And they rejected those Signs in iniquity and arrogance, though their souls were convinced thereof: so see what was the end of those who acted corruptly!\n",
        "TRANSLATION_13": "And they belied them (those Ayat) wrongfully and arrogantly, though their ownselves were convinced thereof [i.e. those (Ayat) are from Allah, and Musa (Moses) is the Messenger of Allah in truth, but they disliked to obey Musa (Moses), and hated to believe in his Message of Monotheism]. So see what was the end of the Mufsidun (disbelievers, disobedient to Allah, evil-doers, liars.).\n",
        "TRANSLATION_14": "They denied them unjustly out of pride, though their souls acknowledged them. See, how was the end of the corrupt workers!\n",
        "TRANSLATION_15": "And they rejected them, although their souls were certain of them, out of wickedness and pride. So see how the outcome was for the mischief-makers.\n",
        "TRANSLATION_16": "And they rejected them, while their [inner] selves were convinced thereof, out of injustice and haughtiness. So see how was the end of the corrupters.\n",
        "TRANSLATION_17": "[27:14] And they denied them, they did not affirm them, though, in reality, their souls had been convinced, in other words, [though] they were certain that these [signs] were from God, wrongfully and arrogantly, in defiance of believing in what Moses had brought ([these two adverbs] refer back to [the cause of] their denial). So behold, O Muhammad (s), how was the sequel for the agents of corruption, [a sequel] which you know: they were destroyed.\n",
        "TRANSLATION_18": "(And they denied them) they denied the tokens, (though their souls acknowledged them) after being accepted by their souls that they were from Allah, (for spite) out of opposition and enmity (and arrogance) and haughtiness and pride. (Then see) Muhammad (the nature of the consequence for the wrong-doers) how was the end result of the idolaters, Pharaoh and his people, how We destroyed them in the sea!\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "27:14",
            "43:25",
            "37:73",
            "7:84",
            "10:39",
            "28:40",
            "6:24",
            "7:103",
            "14:45",
            "41:46"
        ],
        "BIBLE": [
            "writings:proverbs:24:12",
            "prophets:jeremiah:23:14",
            "torah:exodus:4:14",
            "torah:genesis:6:5",
            "writings:i%20chronicles:29:17",
            "torah:deuteronomy:33:9",
            "torah:genesis:42:21",
            "prophets:i%20samuel:3:13",
            "torah:leviticus:5:1",
            "prophets:isaiah:47:10"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:5:1"
        ]
    }
}