{
    "VERSE": "27:16",
    "ARABIC": "وَوَرِثَ سُلَيْمَٰنُ دَاوُۥدَ وَقَالَ يَٰٓأَيُّهَا ٱلنَّاسُ عُلِّمْنَا مَنطِقَ ٱلطَّيْرِ وَأُوتِينَا مِن كُلِّ شَىْءٍ إِنَّ هَٰذَا لَهُوَ ٱلْفَضْلُ ٱلْمُبِينُ",
    "ENGLISH": {
        "TRANSLATION_0": "Sulayman was Dawud's heir. He said, 'Mankind! we have been taught the speech of birds and we have been given everything. This is indeed clear favour.'",
        "TRANSLATION_1": "Solomon was heir to David, and he said: \"O people, we have been taught the language of Tair, and have been given of everything. This is a clear favour indeed.\"\n",
        "TRANSLATION_2": "And Solomon succeeded David and said: \"O people, we have been taught the speech of birds and we have been endowed with all kinds of things. Surely this is a conspicuous favour (from Allah).\"\n",
        "TRANSLATION_3": "Solomon became the heir to David. He said, \"People, we have been taught the language of the birds and have been granted a share of everything. This indeed is a manifest favor (from God)\".\n",
        "TRANSLATION_4": "And Sulaiman became Dawud’s heir; and he said, “O people, we have indeed been taught the language of birds, and have been given from all things; this surely is a manifest favour.”\n",
        "TRANSLATION_5": "And Sulayman inherited from Dawud. He said: \"O mankind! We have been taught the language of birds, and we have been given from everything. This, verily, is an evident grace.\"\n",
        "TRANSLATION_6": "And Sulaiman was Dawood's heir, and he said: O men! we have been taught the language of birds, and we have been given all things; most surely this is manifest grace.\n",
        "TRANSLATION_7": "And Solomon was David's heir, and he said, 'Men, we have been taught the speech of the birds, and we have been given of everything; surely this is indeed the manifest bounty.'\n",
        "TRANSLATION_8": "And Solomon was David's heir. And he said: O mankind! Lo! we have been taught the language of birds, and have been given (abundance) of all things. This surely is evident favour.\n",
        "TRANSLATION_9": "Solomon succeeded David. He said, \"Know, my people, that we have been taught the speech of birds and endowed with all good things. Surely this is God's manifest grace.\"\n",
        "TRANSLATION_10": "And Sulaiman inherited from Daud. And he said: O mankind! verily have been taught the diction of we birds, and we have been vcuchsafed of every thing; and verily this is grace manifest.\n",
        "TRANSLATION_11": "Solomon inherited from David, and he said, ‘O people! We have been taught the speech of the birds, and we have been given out of everything. Indeed this is a manifest advantage.’\n",
        "TRANSLATION_12": "And Solomon was David's heir. He said: \"O ye people! We have been taught the speech of birds, and on us has been bestowed (a little) of all things: this is indeed Grace manifest (from Allah.)\"\n",
        "TRANSLATION_13": "And Sulaiman (Solomon) inherited (the knowledge of) Dawud (David). He said: \"O mankind! We have been taught the language of birds, and on us have been bestowed all things. This, verily, is an evident grace (from Allah).\"\n",
        "TRANSLATION_14": "Solomon inherited David. He said: 'Know, my people, we have been taught the speech of birds and given everything. Surely, this is a clear bounty'\n",
        "TRANSLATION_15": "And Solomon succeeded David. He said, “O people, we were taught the language of birds, and we were given from everything. This is indeed a real blessing.”\n",
        "TRANSLATION_16": "And Solomon inherited David. He said, \"O people, we have been taught the language of birds, and we have been given from all things. Indeed, this is evident bounty.\"\n",
        "TRANSLATION_17": "[27:16] And Solomon inherited from David, prophethood and knowledge exclusively from among all his other children; and he said, ‘O people, we have been taught the speech of the birds, that is, the ability to understand their sounds, and we have been given of all things, given to prophets and kings. Indeed this, gift, is the manifest, the evident, favour’.\n",
        "TRANSLATION_18": "And Solomon was David's heir) as king instead of all the other sons of David who were 19 in number. (And he said) Solomon said: (0 mankind! Lo! we have been taught) we were given the understanding of (the language of birds, and have been given (abundance) of all things) and we were given the knowledge of everything in my kingdom. (This surely is evident favour) this is surely a great blessing from Allah.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "27:16",
            "18:54",
            "39:27",
            "15:19",
            "18:84",
            "12:38",
            "17:89",
            "4:32",
            "26:183",
            "27:73"
        ],
        "BIBLE": [
            "torah:deuteronomy:16:17",
            "writings:esther:3:11",
            "prophets:jeremiah:44:20",
            "writings:i%20chronicles:23:25",
            "prophets:ezekiel:33:24",
            "writings:ii%20chronicles:25:9",
            "writings:ii%20chronicles:19:6",
            "torah:genesis:28:4",
            "prophets:joshua:23:15",
            "prophets:judges:18:10"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:3:2"
        ]
    }
}