{
    "VERSE": "27:17",
    "ARABIC": "وَحُشِرَ لِسُلَيْمَٰنَ جُنُودُهُۥ مِنَ ٱلْجِنِّ وَٱلْإِنسِ وَٱلطَّيْرِ فَهُمْ يُوزَعُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Sulayman's troops, made up of jinn and men and birds, were assembled for him, paraded in tight ranks.",
        "TRANSLATION_1": "His armies of jinns and men and Tair assembled, formed into ranks, (and marched)\n",
        "TRANSLATION_2": "Hosts of jinn and humans and birds were marshalled for Solomon and were kept under full control.\n",
        "TRANSLATION_3": "Soloman's army, consisting of human beings, jinn, and birds were gathered together in his presence in ranks.\n",
        "TRANSLATION_4": "And assembled together for Sulaiman were his armies of jinns and men, and of birds – so they had to be restricted.\n",
        "TRANSLATION_5": "And there were gathered before Sulayman his hosts of Jinn and men, and birds, and they all were set in battle order (marching forward).\n",
        "TRANSLATION_6": "And his hosts of the jinn and the men and the birds were gathered to him, and they were formed into groups.\n",
        "TRANSLATION_7": "And his hosts were mustered to Solomon, jinn, men and birds, duly disposed;\n",
        "TRANSLATION_8": "And there were gathered together unto Solomon his armies of the jinn and humankind, and of the birds, and they were set in battle order;\n",
        "TRANSLATION_9": "Solomon's hosts of jinn and men and birds, were all gathered together in his presence and were ranged in battle order,\n",
        "TRANSLATION_10": "And there were gathered unto Sulaiman his hosts of jinns and mankind and birds, and they were set in bands.\n",
        "TRANSLATION_11": "[Once] Solomon’s hosts were marched out for him, comprising jinn, humans and birds, and they were held in check.\n",
        "TRANSLATION_12": "And before Solomon were marshalled his hosts,- of Jinns and men and birds, and they were all kept in order and ranks.\n",
        "TRANSLATION_13": "And there were gathered before Sulaiman (Solomon) his hosts of jinns and men, and birds, and they all were set in battle order (marching forwards).\n",
        "TRANSLATION_14": "We gathered to Solomon his army of jinn, humans and birds; gathered and dispersed,\n",
        "TRANSLATION_15": "To the service of Solomon were mobilized his troops of sprites, and men, and birds—all held in strict order.\n",
        "TRANSLATION_16": "And gathered for Solomon were his soldiers of the jinn and men and birds, and they were [marching] in rows.\n",
        "TRANSLATION_17": "[27:17] And, on one journey, Solomon’s hosts of jinn and humans and birds stood assembled for him as they were being arrayed, brought together [in groups] and marshalled.\n",
        "TRANSLATION_18": "(And there were gathered together) and made subservient (unto Solomon his armies of the jinn and humankind, and of the birds, and they were set in battle order) they were all retained from the first to the last until they were gathered together;\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "27:17",
            "51:56",
            "72:6",
            "28:6",
            "47:6",
            "26:90",
            "20:78",
            "36:75",
            "99:3",
            "37:173"
        ],
        "BIBLE": [
            "writings:psalms:39:3",
            "prophets:ii%20kings:5:1",
            "writings:ii%20chronicles:8:14",
            "writings:i%20chronicles:11:10",
            "writings:i%20chronicles:28:21",
            "writings:i%20chronicles:6:17",
            "writings:ii%20chronicles:7:9",
            "prophets:jeremiah:6:11",
            "prophets:i%20samuel:10:27",
            "writings:proverbs:28:2"
        ]
    }
}