{
    "VERSE": "27:18",
    "ARABIC": "حَتَّىٰٓ إِذَآ أَتَوْا۟ عَلَىٰ وَادِ ٱلنَّمْلِ قَالَتْ نَمْلَةٌ يَٰٓأَيُّهَا ٱلنَّمْلُ ٱدْخُلُوا۟ مَسَٰكِنَكُمْ لَا يَحْطِمَنَّكُمْ سُلَيْمَٰنُ وَجُنُودُهُۥ وَهُمْ لَا يَشْعُرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Then, when they reached the Valley of the Ants, an ant said, 'Ants! enter your dwellings so that Sulayman and his troops do not crush you unwittingly.'",
        "TRANSLATION_1": "Till they reached the Valley of Naml. Said the lady of Naml: \"O Naml, go into your dwellings lest Solomon and his hordes should crush you unawares.\"\n",
        "TRANSLATION_2": "(Solomon was once on the move with them) until when they reached a valley of ants one of the ants said: \"O ants, get into your holes, lest Solomon and his hosts crush you (under their feet) without even knowing.\"\n",
        "TRANSLATION_3": "When they arrived in the valley of the ants, one ant said to the others, \"Enter your dwellings lest you be carelessly crushed by Soloman and his army.\"\n",
        "TRANSLATION_4": "Until when they came to the valley of the ants, a she ant exclaimed, “O ants, enter your houses – may not Sulaiman and his armies crush you, unknowingly.”\n",
        "TRANSLATION_5": "Till, when they came to the valley of the ants, one of the ants said: \"O ants! Enter your dwellings, lest Sulayman and his armies should crush you, while they perceive not.\"\n",
        "TRANSLATION_6": "Until when they came to the valley of the Naml, a Namlite said: O Naml! enter your houses, (that) Sulaiman and his hosts may not crush you while they do not know.\n",
        "TRANSLATION_7": "till, when they came on the Valley of Ants, an ant said, 'Ants, enter your dwelling-places, lest Solomon and his hosts crush you, being unaware!'\n",
        "TRANSLATION_8": "Till, when they reached the Valley of the Ants, an ant exclaimed: O ants! Enter your dwellings lest Solomon and his armies crush you, unperceiving.\n",
        "TRANSLATION_9": "and when they came to the Valley of the Ants, one ant said, \"Ants! Go into your dwellings, in case Solomon and his hosts inadvertently crush you.\"\n",
        "TRANSLATION_10": "Until when they came unto the valley of the ants, an ant said: O ants! enter Your habitations lest Sulaiman and his hosts crush you while they perceive not.\n",
        "TRANSLATION_11": "When they came to the Valley of Ants, an ant said, ‘O ants! Enter your dwellings, lest Solomon and his hosts should trample on you while they are unaware.’\n",
        "TRANSLATION_12": "At length, when they came to a (lowly) valley of ants, one of the ants said: \"O ye ants, get into your habitations, lest Solomon and his hosts crush you (under foot) without knowing it.\"\n",
        "TRANSLATION_13": "Till, when they came to the valley of the ants, one of the ants said: \"O ants! Enter your dwellings, lest Sulaiman (Solomon) and his hosts crush you, while they perceive not.\"\n",
        "TRANSLATION_14": "and when they came to the Valley of the Ants, an ant said: 'Ants, go into your dwellings lest Solomon and his army should, unknowingly, crush you'\n",
        "TRANSLATION_15": "Until, when they came upon the Valley of Ants, an ant said, “O ants! Go into your nests, lest Solomon and his troops crush you without noticing.”\n",
        "TRANSLATION_16": "Until, when they came upon the valley of the ants, an ant said, \"O ants, enter your dwellings that you not be crushed by Solomon and his soldiers while they perceive not.\"\n",
        "TRANSLATION_17": "[27:18] When they came to the Valley of the Ants — which is [located] either in Tā’if or in Syria, and whose ants are either small or large — an ant, the queen ant, who had seen Solomon’s hosts, said, ‘O ants, enter your dwellings, lest Solomon and his hosts crush you while they are unaware!’ — the ants are likened to rational beings in their use of the latter’s speech.\n",
        "TRANSLATION_18": "(Till, when they reached the Valley of the Ants) in Historic Syria, (an ant exclaimed: ants! Enter your dwellings lest Solomon and his armies crush you) step on you, (unperceiving) unaware of you.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "27:18",
            "89:18",
            "9:26",
            "68:24",
            "51:40",
            "107:3",
            "69:34",
            "27:17",
            "28:55",
            "9:40"
        ],
        "BIBLE": [
            "writings:ruth:3:14",
            "prophets:haggai:1:2",
            "prophets:jeremiah:21:13",
            "prophets:ezekiel:36:22",
            "prophets:ii%20samuel:9:3",
            "prophets:ezekiel:43:7",
            "prophets:i%20kings:1:53",
            "prophets:isaiah:5:9",
            "prophets:ii%20kings:9:5",
            "prophets:ii%20kings:8:5"
        ]
    }
}