{
    "VERSE": "27:20",
    "ARABIC": "وَتَفَقَّدَ ٱلطَّيْرَ فَقَالَ مَا لِىَ لَآ أَرَى ٱلْهُدْهُدَ أَمْ كَانَ مِنَ ٱلْغَآئِبِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "He inspected the birds and said, 'How is it that I do not see the hoopoe? Or is it absent without leave?",
        "TRANSLATION_1": "When he reviewed the Tair, he said: \"How is it I do not see Hud-hud? Is he absent?\n",
        "TRANSLATION_2": "(On another occasion) Solomon inspected the birds and said: \"Why is it that I do not see the hoopoe? Is he among the absentees?\n",
        "TRANSLATION_3": "(Solomon) inspected the birds and said, \"How is it that I cannot see the hoopoe. Is he absent?\n",
        "TRANSLATION_4": "And he surveyed the birds – he therefore said, “What is to me that I do not see the Hudhud (hoopoe), or is he really absent?”\n",
        "TRANSLATION_5": "He inspected the birds, and said: \"What is the matter that I see not the hoopoe Or is he among the absentees\"\n",
        "TRANSLATION_6": "And he reviewed the birds, then said: How is it I see not the hoopoe or is it that he is of the absentees?\n",
        "TRANSLATION_7": "And he reviewed the birds; then he said, 'How is it with me, that I do not see the hoopoe? Or is he among the absent?\n",
        "TRANSLATION_8": "And he sought among the birds and said: How is it that I see not the hoopoe, or is he among the absent?\n",
        "TRANSLATION_9": "Then Solomon inspected the birds, and said, \"How is it that I do not see the hoopoe? Is he absent then?\n",
        "TRANSLATION_10": "And he sought after the birds and said: what aileth me that I see not the hoopoe; is he among the absentees?\n",
        "TRANSLATION_11": "[One day] he reviewed the birds, and said, ‘Why do I not see the hoopoe? Or is he absent?’\n",
        "TRANSLATION_12": "And he took a muster of the Birds; and he said: \"Why is it I see not the Hoopoe? Or is he among the absentees?\n",
        "TRANSLATION_13": "He inspected the birds, and said: \"What is the matter that I see not the hoopoe? Or is he among the absentees?\n",
        "TRANSLATION_14": "He reviewed the birds and said: 'Why is it that I do not see the hoopoe here? Or is he among the absent?\n",
        "TRANSLATION_15": "Then he inspected the birds, and said, “Why do I not see the hoopoe? Or is he among the absentees?\n",
        "TRANSLATION_16": "And he took attendance of the birds and said, \"Why do I not see the hoopoe - or is he among the absent?\n",
        "TRANSLATION_17": "[27:20] And he reviewed the birds, to see the hoopoe — which would locate water beneath the ground and indicate its location by pecking at it, whereupon the devils would extract it, for Solomon required it for when he prayed; but he could not see him — then he said, ‘Why is it that I do not see the hoopoe?, in other words, is there something preventing me from seeing him? Or is he among the absent?, and so I cannot see him   because he is absent?’ And when he became certain [of the hoopoe’s absence],\n",
        "TRANSLATION_18": "(And he sought among the birds) he inspected the birds (and said) when he could not see the hoopoe among them: (How is it that I see not the hoopoe) in his place, (or is he among the absent?)\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "27:20",
            "27:35",
            "27:85",
            "69:3",
            "26:114",
            "77:36",
            "86:2",
            "86:10",
            "27:17",
            "7:198"
        ],
        "BIBLE": [
            "prophets:i%20kings:18:10",
            "torah:genesis:30:15",
            "writings:psalms:11:1",
            "prophets:ii%20samuel:13:11",
            "prophets:judges:6:27",
            "prophets:ii%20kings:2:10",
            "prophets:ii%20kings:7:14",
            "torah:genesis:12:19",
            "writings:daniel:6:6",
            "torah:genesis:27:36"
        ]
    }
}