{
    "VERSE": "27:21",
    "ARABIC": "لَأُعَذِّبَنَّهُۥ عَذَابًا شَدِيدًا أَوْ لَأَا۟ذْبَحَنَّهُۥٓ أَوْ لَيَأْتِيَنِّى بِسُلْطَٰنٍ مُّبِينٍ",
    "ENGLISH": {
        "TRANSLATION_0": "I will certainly punish it most severely or slaughter it if it does not bring me clear authority.'",
        "TRANSLATION_1": "I will punish him severely, or cut his throat, unless he bring a valid excuse.\"\n",
        "TRANSLATION_2": "I will inflict a severe punishment on him or maybe even slaughter him unless he comes forth with a convincing reason (for his absence).\"\n",
        "TRANSLATION_3": "I shall certainly punish him severely or slaughter him unless he has a good reason for his absence.\"\n",
        "TRANSLATION_4": "“I will indeed punish him severely or slay him, or he must bring to me some clear evidence.”\n",
        "TRANSLATION_5": "I will surely punish him with a severe torment or slaughter him, unless he brings me a clear reason.\"\n",
        "TRANSLATION_6": "I will most certainly punish him with a severe punishment, or kill him, or he shall bring to me a clear plea.\n",
        "TRANSLATION_7": "Assuredly I will chastise him with a terrible chastisement, or I will slaughter him, or he bring me a clear authority.'\n",
        "TRANSLATION_8": "I verily will punish him with hard punishment or I verily will slay him, or he verily shall bring me a plain excuse.\n",
        "TRANSLATION_9": "I shall surely punish him severely or order him to be executed, unless he gives me a good reason for his absence.\"\n",
        "TRANSLATION_10": "Surely I shall torment him with a severe torment, or I shall slaughter him, unless he bringeth unto me a warranty manifest.\n",
        "TRANSLATION_11": "‘I will punish him with a severe punishment, or I will behead him, unless he brings me a credible excuse.’\n",
        "TRANSLATION_12": "I will certainly punish him with a severe penalty, or execute him, unless he bring me a clear reason (for absence).\"\n",
        "TRANSLATION_13": "I will surely punish him with a severe torment, or slaughter him, unless he brings me a clear reason.\"\n",
        "TRANSLATION_14": "Surely, I will punish him with a terrible punishment, or I will slaughter him or he gives me a good reason'\n",
        "TRANSLATION_15": "I will punish him most severely, or slay him, unless he gives me a valid excuse.”\n",
        "TRANSLATION_16": "I will surely punish him with a severe punishment or slaughter him unless he brings me clear authorization.\"\n",
        "TRANSLATION_17": "[27:21] He said, ‘Assuredly I will chastise him with a severe chastisement, by having [all] his feathers as well as his tail plucked and leaving him out in the sun, where he would not be able to escape from reptiles, or I will slaughter him, by slitting his throat, unless he brings me (read la-ya’tiyannī or la-ya’tinannī) a clear warrant’, plain manifest proof for his [having a valid] excuse.\n",
        "TRANSLATION_18": "He said: if he is among the absent, then (I verily will punish him with hard punishment) I will pluck out his feathers; such was the punishment of the birds, (or I verily will slay him, or he verily shall bring me a plain excuse) an acceptable excuse.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "27:21",
            "41:27",
            "14:7",
            "42:26",
            "70:1",
            "58:15",
            "69:29",
            "23:77",
            "39:40",
            "16:113"
        ],
        "BIBLE": [
            "prophets:jeremiah:8:14",
            "prophets:joshua:23:15",
            "torah:leviticus:20:3",
            "prophets:jeremiah:48:2",
            "prophets:ezekiel:16:33",
            "writings:i%20chronicles:29:14",
            "writings:psalms:94:23",
            "prophets:ezekiel:18:13",
            "writings:ezra:3:11",
            "prophets:jeremiah:41:5"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:5:2"
        ]
    }
}