{
    "VERSE": "27:23",
    "ARABIC": "إِنِّى وَجَدتُّ ٱمْرَأَةً تَمْلِكُهُمْ وَأُوتِيَتْ مِن كُلِّ شَىْءٍ وَلَهَا عَرْشٌ عَظِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "I found a woman ruling over them who has been given everything. She possesses a mighty throne.",
        "TRANSLATION_1": "I found a woman reigning over them, and she has been favoured with everything; and she has a throne that is magnificent.\n",
        "TRANSLATION_2": "I found there a woman ruling over them, one who has been endowed with all things and has a mighty throne.\n",
        "TRANSLATION_3": "I found a woman ruling the people there and she possessed something of (almost) everything and a great throne.\n",
        "TRANSLATION_4": "“I have seen a woman who rules over them, and she has been given from all things, and she has a mighty throne.”\n",
        "TRANSLATION_5": "I found a woman ruling over them, she has been given all things, and she has a great throne.\"\n",
        "TRANSLATION_6": "Surely I found a woman ruling over them, and she has been given abundance and she has a mighty throne:\n",
        "TRANSLATION_7": "I found a woman ruling over them, and she has been given of everything, and she possesses a mighty throne.\n",
        "TRANSLATION_8": "Lo! I found a woman ruling over them, and she hath been given (abundance) of all things, and hers is a mighty throne.\n",
        "TRANSLATION_9": "I found a woman ruling over them, who has been given everything and she has a mighty throne.\n",
        "TRANSLATION_10": "Verily have found a woman ruling over them and she hath been vouchsafed somewhat of everything, and hers is a mighty throne.\n",
        "TRANSLATION_11": "I found a woman ruling over them, and she has been given everything, and she has a great throne.\n",
        "TRANSLATION_12": "I found (there) a woman ruling over them and provided with every requisite; and she has a magnificent throne.\n",
        "TRANSLATION_13": "I found a woman ruling over them, and she has been given all things that could be possessed by any ruler of the earth, and she has a great throne.\n",
        "TRANSLATION_14": "There I found a woman ruling over them. She possess everything and has a great throne.\n",
        "TRANSLATION_15": "I found a woman ruling over them, and she was given of everything, and she has a magnificent throne.\n",
        "TRANSLATION_16": "Indeed, I found [there] a woman ruling them, and she has been given of all things, and she has a great throne.\n",
        "TRANSLATION_17": "[27:23] I found a woman ruling over them, in other words, she was their queen, her name Bilqīs; and she has been given [an abundance] of all things, that kings might require, in the way of machines and instruments, and she possesses a great throne — its length was 80 cubits, its width 40 cubits, its height 30 cubits, and was made of gold and silver, encrusted with pearls, rubies, chrysolite, and emeralds, with its legs made of rubies, chrysolite and emeralds, containing seven [inner] doors, the door of each chamber shut.\n",
        "TRANSLATION_18": "(Lo! I found a woman ruling over them) whose name is Balqis, (and she hath been given (abundance) of all things) she has been given the knowledge of all things in her country, (and hers is a mighty throne) adorned with gems, pearls, gold and silver.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "27:23",
            "52:21",
            "41:54",
            "18:84",
            "15:19",
            "51:49",
            "54:52",
            "54:49",
            "3:128",
            "80:37"
        ],
        "BIBLE": [
            "writings:i%20chronicles:29:14",
            "torah:genesis:1:30",
            "prophets:joshua:17:14",
            "writings:ii%20chronicles:32:29",
            "writings:ezra:9:13",
            "writings:ecclesiastes:3:10",
            "prophets:i%20kings:1:48",
            "torah:genesis:9:3",
            "prophets:judges:18:10",
            "prophets:ezekiel:17:18"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:2"
        ]
    }
}