{
    "VERSE": "27:26",
    "ARABIC": "ٱللَّهُ لَآ إِلَٰهَ إِلَّا هُوَ رَبُّ ٱلْعَرْشِ ٱلْعَظِيمِ",
    "ENGLISH": {
        "TRANSLATION_0": "Allah - there is no god but Him - the Lord of the Mighty Throne.'",
        "TRANSLATION_1": "God: There is no god but He, the Lord of the glorious throne.\"\n",
        "TRANSLATION_2": "Allah - none is worthy of worship save He; He is the Lord of the Mighty Throne.\n",
        "TRANSLATION_3": "God is the only Lord and master of the Great Throne.\"\n",
        "TRANSLATION_4": "“Allah – there is no True God except Him, the Owner of the Great Throne.” (Command of Prostration # 8)\n",
        "TRANSLATION_5": "Allah, La ilaha illa Huwa, the Lord of the Supreme Throne!\"\n",
        "TRANSLATION_6": "Allah, there is no god but He: He is the Lord of mighty power.\n",
        "TRANSLATION_7": "God: there is no god but He, the Lord of the Mighty Throne.'\n",
        "TRANSLATION_8": "Allah; there is no Allah save Him, the Lord of the Tremendous Throne.\n",
        "TRANSLATION_9": "He is God: there is no deity but He, the Lord of the mighty throne.\"\n",
        "TRANSLATION_10": "Allah! there is no God but he, the Lord of the Magnificent Throne.\n",
        "TRANSLATION_11": "Allah—there is no god except Him—is the Lord of the Great Throne.’\n",
        "TRANSLATION_12": "Allah!- there is no god but He!- Lord of the Throne Supreme!\"\n",
        "TRANSLATION_13": "Allah, La ilaha illa Huwa (none has the right to be worshipped but He), the Lord of the Supreme Throne!\n",
        "TRANSLATION_14": "Allah, there is no god except He, the Lord of the Mighty Throne'\n",
        "TRANSLATION_15": "God—There is no god but He, the Lord of the Sublime Throne.”\n",
        "TRANSLATION_16": "Allah - there is no deity except Him, Lord of the Great Throne.\"\n",
        "TRANSLATION_17": "[27:26] God — there is no god except Him, the Lord of the Mighty Throne’ (this clause constitutes an [independent] new sentence, which is a eulogy comprising [praise of] the Throne of the Compassionate One to counter the [description of the] throne of Bilqīs: between the two, however, is an unfathomable difference).\n",
        "TRANSLATION_18": "(Allah; there is no God save Him, the Lord of the tremendous Throne.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "27:26",
            "9:129",
            "23:116",
            "69:33",
            "81:29",
            "21:22",
            "44:8",
            "23:86",
            "6:106",
            "37:74"
        ],
        "BIBLE": [
            "prophets:ii%20kings:5:18",
            "writings:psalms:66:3",
            "torah:exodus:15:6",
            "prophets:isaiah:49:4",
            "writings:ii%20chronicles:20:6",
            "writings:psalms:147:5",
            "torah:deuteronomy:4:7",
            "prophets:zephaniah:3:17",
            "torah:deuteronomy:20:4",
            "writings:psalms:54:3"
        ]
    }
}