{
    "VERSE": "27:29",
    "ARABIC": "قَالَتْ يَٰٓأَيُّهَا ٱلْمَلَؤُا۟ إِنِّىٓ أُلْقِىَ إِلَىَّ كِتَٰبٌ كَرِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "She said, 'Council! a noble letter has been delivered to me.",
        "TRANSLATION_1": "(The Queen said): \"O nobles, a venerable letter has been delivered to me.\n",
        "TRANSLATION_2": "The Queen said:\" Know my nobles that a gracious letter has been delivered to me.\n",
        "TRANSLATION_3": "(The Queen of Sheba) said to her officials, \"A gracious letter has been dropped before me.\n",
        "TRANSLATION_4": "The woman said, “O chieftains, indeed a noble letter has been dropped upon me.”\n",
        "TRANSLATION_5": "She said: \"O chiefs! Verily, here is delivered to me a noble letter, \"\n",
        "TRANSLATION_6": "She said: O chief! surely an honorable letter has been delivered to me\n",
        "TRANSLATION_7": "She said, 'O Council, see, a letter honourable has been cast unto me.\n",
        "TRANSLATION_8": "(The Queen of Sheba) said (when she received the letter): O chieftains! Lo! there hath been thrown unto me a noble letter.\n",
        "TRANSLATION_9": "The Queen of Sheba said, \"O Counsellors, an honourable letter has been delivered to me.\n",
        "TRANSLATION_10": "She said: O chiefs! verily there hath been cast unto me an honourable epistle.\n",
        "TRANSLATION_11": "She said, ‘O [members of the] elite! Indeed a noble letter has been delivered to me.\n",
        "TRANSLATION_12": "(The queen) said: \"Ye chiefs! here is delivered to me - a letter worthy of respect.\n",
        "TRANSLATION_13": "She said: \"O chiefs! Verily! Here is delivered to me a noble letter,\n",
        "TRANSLATION_14": "She (the Queen of Sheba) said: 'O Council, look, an honorable letter has been dropped to me.\n",
        "TRANSLATION_15": "She said, “O Counselors, a gracious letter was delivered to me.\n",
        "TRANSLATION_16": "She said, \"O eminent ones, indeed, to me has been delivered a noble letter.\n",
        "TRANSLATION_17": "[27:29] Then, she said, to the noblemen of her people: ‘O [members of the] council, lo! (read yā ayyuhā’l-mala’u innī, pronouncing [in the last two words] both hamzas; or by not pronouncing the second one and changing it into a wāw with kasra vowelling) a noble, a sealed, letter has been delivered to me.\n",
        "TRANSLATION_18": "428 He did as Solomon commanded, and Balqis took the letter and went to meet her entourage. ((The Queen of Sheba) said: chieftains! Lo! there hath been thrown unto me a noble letter) a sealed letter.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "27:29",
            "27:32",
            "43:2",
            "44:2",
            "82:6",
            "44:49",
            "37:117",
            "19:51",
            "69:25",
            "27:38"
        ],
        "BIBLE": [
            "writings:daniel:6:17",
            "prophets:i%20kings:3:17",
            "writings:daniel:5:10",
            "prophets:ii%20samuel:20:21",
            "prophets:i%20samuel:23:11",
            "writings:daniel:6:21",
            "prophets:joshua:7:7",
            "torah:exodus:32:4",
            "writings:esther:9:12",
            "prophets:ii%20kings:9:34"
        ]
    }
}