{
    "VERSE": "27:3",
    "ARABIC": "ٱلَّذِينَ يُقِيمُونَ ٱلصَّلَوٰةَ وَيُؤْتُونَ ٱلزَّكَوٰةَ وَهُم بِٱلْءَاخِرَةِ هُمْ يُوقِنُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "those who establish salat and pay zakat and are certain about the Next World.",
        "TRANSLATION_1": "Who fulfil their devotional obligations, pay the zakat, and believe with certainty in the life to come.\n",
        "TRANSLATION_2": "who establish Prayer and give Zakah, and have firm faith in the Hereafter.\n",
        "TRANSLATION_3": "who are steadfast in prayer, who pay the religious tax, and who have strong faith in the life hereafter.\n",
        "TRANSLATION_4": "Those who keep the prayer established and pay the charity and are certain of the Hereafter.\n",
        "TRANSLATION_5": "Those who perform the Salah and give the Zakah and they believe with certainty in the Hereafter.\n",
        "TRANSLATION_6": "Who keep up prayer and pay the poor-rate, and of the hereafter, they are sure.\n",
        "TRANSLATION_7": "who perform the prayer, and pay the alms, and have sure faith in the Hereafter.\n",
        "TRANSLATION_8": "Who establish worship and pay the poor-due and are sure of the Hereafter.\n",
        "TRANSLATION_9": "who pray regularly and pay obligatory alms and have firm faith in the Hereafter.\n",
        "TRANSLATION_10": "Who establish the prayer and give the poor-rate, and of the Hereafter they are convinced.\n",
        "TRANSLATION_11": "—those who maintain the prayer and pay the zakat, and who are certain of the Hereafter.\n",
        "TRANSLATION_12": "Those who establish regular prayers and give in regular charity, and also have (full) assurance of the hereafter.\n",
        "TRANSLATION_13": "Those who perform As-Salat (Iqamat-as-Salat) and give Zakat and they believe with certainty in the Hereafter (resurrection, recompense of their good and bad deeds, Paradise and Hell, etc.).\n",
        "TRANSLATION_14": "who establish their prayers, and pay the obligatory charity, and are certain of the Everlasting Life.\n",
        "TRANSLATION_15": "Those who observe the prayers, and give charity regularly, and are certain of the Hereafter.\n",
        "TRANSLATION_16": "Who establish prayer and give zakah, and of the Hereafter they are certain [in faith].\n",
        "TRANSLATION_17": "[27:3] those who observe prayer, performing it in the way that it should be [performed], and give alms and who are certain of the Hereafter, knowing it [to be true] through the [many] proofs thereof (hum, ‘they’, is repeated because a separation has taken place between it [the first hum] and the predicate [yūqinūna]).\n",
        "TRANSLATION_18": "Allah then showed the attributes of these true believers, saying: (Who establish worship) those who complete the five daily prayers along with their necessary ritual ablution, bowing, prostrating and all that which is obligated in their due times (and pay the poor-due) from their wealth (and are sure of) they believe in (the Hereafter) resurrection after death, Paradise and hell.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "31:4",
            "27:3",
            "41:7",
            "2:43",
            "21:73",
            "19:31",
            "8:3",
            "24:56",
            "23:9",
            "70:34"
        ],
        "BIBLE": [
            "prophets:isaiah:35:4",
            "prophets:i%20kings:1:12",
            "prophets:jeremiah:33:14",
            "writings:ii%20chronicles:12:1",
            "writings:ii%20chronicles:6:39",
            "torah:genesis:17:7",
            "prophets:isaiah:61:8",
            "writings:daniel:12:2",
            "prophets:ii%20kings:1:14",
            "writings:nehemiah:1:4"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:3:2"
        ]
    }
}