{
    "VERSE": "27:31",
    "ARABIC": "أَلَّا تَعْلُوا۟ عَلَىَّ وَأْتُونِى مُسْلِمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Do not rise up against me, but come to me in submission.'\"",
        "TRANSLATION_1": "Do not rise against me, but come to me in submission.'\n",
        "TRANSLATION_2": "(It says): \"Do not act towards me with defiance, but come to me in submission.\"\n",
        "TRANSLATION_3": "Do not consider yourselves superior to me but come to me as Muslims (in submission)\".\n",
        "TRANSLATION_4": "“That ‘Do not wish eminence above me, and present yourselves humbly to me, with submission.’”\n",
        "TRANSLATION_5": "`Be you not exalted against me, but come to me submitting (as Muslims).' \"\n",
        "TRANSLATION_6": "Saying: exalt not yourselves against me and come to me in submission.\n",
        "TRANSLATION_7": "Rise not up against me, but come to me in surrender.\" '\n",
        "TRANSLATION_8": "Exalt not yourselves against me, but come unto me as those who surrender.\n",
        "TRANSLATION_9": "do not exalt yourselves above me, but come to me in all submission.\"\n",
        "TRANSLATION_10": "Saying: exalt not yourselves against me, and come unto me submissive.\n",
        "TRANSLATION_11": "[It states,] ‘‘Do not defy me, and come to me in submission.’’ ’\n",
        "TRANSLATION_12": "Be ye not arrogant against me, but come to me in submission (to the true Religion).'\"\n",
        "TRANSLATION_13": "Be you not exalted against me, but come to me as Muslims (true believers who submit to Allah with full submission)' \"\n",
        "TRANSLATION_14": "Do not rise up against me, but come to me in surrender (Muslims).\"\n",
        "TRANSLATION_15": "Do not defy me, and come to me submissively.’”\n",
        "TRANSLATION_16": "Be not haughty with me but come to me in submission [as Muslims].' \"\n",
        "TRANSLATION_17": "[27:31] Do not rise up against me [in defiance], but come to me in submission”’.\n",
        "TRANSLATION_18": "Exalt not yourselves against me) feel not too haughty towards me, (but come unto me as those who surrender) and seek peace; as well as demanding other things which were mentioned in the letter.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "27:31",
            "23:108",
            "2:152",
            "74:14",
            "44:19",
            "53:60",
            "74:6",
            "37:137",
            "109:4",
            "12:71"
        ],
        "BIBLE": [
            "torah:numbers:22:20",
            "writings:job:6:22",
            "prophets:ii%20kings:9:20",
            "prophets:ii%20kings:9:19",
            "prophets:jonah:1:6",
            "prophets:ii%20samuel:24:13",
            "prophets:ezekiel:24:20",
            "writings:daniel:6:13",
            "prophets:ii%20kings:5:7",
            "prophets:jeremiah:32:7"
        ]
    }
}