{
    "VERSE": "27:32",
    "ARABIC": "قَالَتْ يَٰٓأَيُّهَا ٱلْمَلَؤُا۟ أَفْتُونِى فِىٓ أَمْرِى مَا كُنتُ قَاطِعَةً أَمْرًا حَتَّىٰ تَشْهَدُونِ",
    "ENGLISH": {
        "TRANSLATION_0": "She said, 'Council! give me your opinion about this matter. It is not my habit to make a final decision until I have heard what you have to say.'",
        "TRANSLATION_1": ".\" Advise me, O nobles,\" she said \"in this matter. I do not decide any thing until you concur.\"\n",
        "TRANSLATION_2": "(After reading the letter) the Queen said: \"Nobles, let me have your counsel in this matter for I make no firm decision without you.\"\n",
        "TRANSLATION_3": "She said, \"My officials, what are your views on this matter? I will not decide until I have your views.\n",
        "TRANSLATION_4": "She said, “O chieftains, advise me in this matter of mine; I do not give a final decision until you are present with me.”\n",
        "TRANSLATION_5": "She said: \"O chiefs! Advise me in case of mine. I decide no case till you are present with me.\"\n",
        "TRANSLATION_6": "She said: O chiefs! give me advice respecting my affair: I never decide an affair until you are in my presence.\n",
        "TRANSLATION_7": "She said, 'O Council, pronounce to me concerning my affair; I am not used to decide an affair until you bear me witness.'\n",
        "TRANSLATION_8": "She said: O chieftains! Pronounce for me in my case. I decide no case till ye are present with me.\n",
        "TRANSLATION_9": "Now advise me in this, Counsellors. I never decide any affair till I have conferred with you.\"\n",
        "TRANSLATION_10": "She said: O chiefs! counsel me in my affair. I am wont not to resolve on any affair until ye are present with me.\n",
        "TRANSLATION_11": "She said, ‘O [members of the] elite! Give me your opinion concerning my matter. I do not decide any matter until you are present.’\n",
        "TRANSLATION_12": "She said: \"Ye chiefs! advise me in (this) my affair: no affair have I decided except in your presence.\"\n",
        "TRANSLATION_13": "She said: \"O chiefs! Advise me in (this) case of mine. I decide no case till you are present with me.\"\n",
        "TRANSLATION_14": "She said: 'O Council, let me hear your counsel, concerning my affairs, for I am not used to deciding an affair until you bear me witness'\n",
        "TRANSLATION_15": "She said, “O counselors, advise me in this matter of mine. I never make a decision unless you are present.”\n",
        "TRANSLATION_16": "She said, \"O eminent ones, advise me in my affair. I would not decide a matter until you witness [for] me.\"\n",
        "TRANSLATION_17": "[27:32] She said, ‘O [members of the] council, give me an opinion (read yā ayyuhā’l-mala’u aftūnī, pronouncing both hamzas, or by not pronouncing the second and changing it into a wāw), in other words, guide me, in this matter of mine. I never decide on a matter, I never conclude it, until you are present’.\n",
        "TRANSLATION_18": "(She said: chieftains! Pronounce for me in my case) inform me about what I should do; it is also said that this means: advise me about what to do. (I decide no case) I will not do anything (till ye are present with me) and advise me.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "27:32",
            "20:32",
            "26:151",
            "27:29",
            "21:27",
            "20:26",
            "11:97",
            "27:38",
            "51:4",
            "79:5"
        ],
        "BIBLE": [
            "torah:exodus:23:13",
            "prophets:hosea:2:14",
            "writings:ezra:5:5",
            "torah:leviticus:10:17",
            "torah:genesis:1:26",
            "writings:daniel:6:13",
            "writings:ii%20chronicles:14:6",
            "prophets:nahum:1:14",
            "torah:leviticus:17:11",
            "prophets:ii%20kings:7:19"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:1:2",
            
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:6:4"
        ]
    }
}