{
    "VERSE": "27:38",
    "ARABIC": "قَالَ يَٰٓأَيُّهَا ٱلْمَلَؤُا۟ أَيُّكُمْ يَأْتِينِى بِعَرْشِهَا قَبْلَ أَن يَأْتُونِى مُسْلِمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "He said, 'Council! who among you will bring me her throne before they come to me in submission?'",
        "TRANSLATION_1": "He (then) said (to his courtiers): \"O you nobles, is there any one who can bring me her throne before they come to me in submission?\"\n",
        "TRANSLATION_2": "Solomon said: \"My nobles, which of you can bring me her throne before they come to me in submission?\"\n",
        "TRANSLATION_3": "Solomon asked his people, \"Who among you can bring her throne before (she, the queen of Sheba) comes to me submissively?\"\n",
        "TRANSLATION_4": "Said Sulaiman, “O court members, which one of you can bring me her throne before they come humbled in my presence?”\n",
        "TRANSLATION_5": "He said: \"O chiefs! Which of you can bring me her throne before they come to me surrendering themselves in obedience (as Muslims)\"\n",
        "TRANSLATION_6": "He said: O chiefs! which of you can bring to me her throne before they come to me in submission?\n",
        "TRANSLATION_7": "He said, 'O Council, which one of you will bring me her throne, before they come to me in surrender?'\n",
        "TRANSLATION_8": "He said: O chiefs! Which of you will bring me her throne before they come unto me, surrendering?\n",
        "TRANSLATION_9": "Solomon then said, \"O Counsellors,  which of you can bring me her throne before they come to me in submission?\n",
        "TRANSLATION_10": "He said: O chiefs! which of you will bring unto me her throne, ere they come unto me submitting themselves?\n",
        "TRANSLATION_11": "He said, ‘O [members of the] elite! Which of you will bring me her throne before they come to me in submission?’\n",
        "TRANSLATION_12": "He said (to his own men): \"Ye chiefs! which of you can bring me her throne before they come to me in submission?\"\n",
        "TRANSLATION_13": "He said: \"O chiefs! Which of you can bring me her throne before they come to me surrendering themselves in obedience?\"\n",
        "TRANSLATION_14": "And he said: 'O Council, which of you will bring me her throne, before they come to me, Muslims (submissive to Allah)'\n",
        "TRANSLATION_15": "He said, “O notables, which one of you will bring me her throne before they come to me in submission?”\n",
        "TRANSLATION_16": "[Solomon] said, \"O assembly [of jinn], which of you will bring me her throne before they come to me in submission?\"\n",
        "TRANSLATION_17": "[27:38] He said, ‘O [members of the] council, which of you (regarding the two hamzas read them in the way mentioned above [verse 32]) will bring me her throne before they come to me in submission?’, compliant and obedient? For I may only [rightfully] seize it before this [submission] and not afterwards.\n",
        "TRANSLATION_18": "(He said) Solomon said: (0 chiefs! Which of you will bring me her throne before they come unto me, surrendering) and seeking peace?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "27:38",
            "27:42",
            "27:32",
            "33:49",
            "2:183",
            "27:29",
            "5:102",
            "10:91",
            "27:46",
            "38:69"
        ],
        "BIBLE": [
            "prophets:i%20kings:17:18",
            "prophets:isaiah:39:3",
            "prophets:ii%20kings:20:14",
            "torah:numbers:22:9",
            "writings:daniel:6:16",
            "torah:genesis:19:5",
            "prophets:ezekiel:37:9",
            "prophets:jeremiah:19:14",
            "prophets:jonah:1:10",
            "prophets:ii%20kings:4:40"
        ]
    }
}