{
    "VERSE": "27:41",
    "ARABIC": "قَالَ نَكِّرُوا۟ لَهَا عَرْشَهَا نَنظُرْ أَتَهْتَدِىٓ أَمْ تَكُونُ مِنَ ٱلَّذِينَ لَا يَهْتَدُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "He said, 'Disguise her throne. We shall see whether she is guided or someone who is not guided.'",
        "TRANSLATION_1": "(Turning to his nobles) he said: \"Change the appearance of her throne. Let us see if she is rightly guided, or is not guided at all.\"\n",
        "TRANSLATION_2": "Solomon said: \" Set the throne before her casually, and let us see whether she gets to the Truth or is one of those who are not guided to what is right.\"\n",
        "TRANSLATION_3": "Then he said, \"Make a few changes to her throne and let us see whether she will recognize it or not.\"\n",
        "TRANSLATION_4": "Said Sulaiman, “Disguise her throne in front of her so that we may see whether she finds the way* or becomes of those who remain unknowing.” (*Recognises her throne.)\n",
        "TRANSLATION_5": "He said: \"Disguise her throne for her that we may see whether she will be guided, or she will be one of those not guided.\"\n",
        "TRANSLATION_6": "He said: Alter her throne for her, we will see whether she follows the right way or is of those who do not go aright.\n",
        "TRANSLATION_7": "He said, 'Disguise her throne for her, and we shall behold whether she is guided or if she is of those that are not guided.'\n",
        "TRANSLATION_8": "He said: Disguise her throne for her that we may see whether she will go aright or be of those not rightly guided.\n",
        "TRANSLATION_9": "He said, \"Disguise her throne. We shall see whether or not she will recognize it.\"\n",
        "TRANSLATION_10": "He said: disguise for her her throne, that we may see whether she be guided or be of those who are not guided.\n",
        "TRANSLATION_11": "He said, ‘Disguise her throne for her, so that we may see whether she is discerning or if she is one of the undiscerning ones.’\n",
        "TRANSLATION_12": "He said: \"Transform her throne out of all recognition by her: let us see whether she is guided (to the truth) or is one of those who receive no guidance.\"\n",
        "TRANSLATION_13": "He said: \"Disguise her throne for her that we may see whether she will be guided (to recognise her throne), or she will be one of those not guided.\"\n",
        "TRANSLATION_14": "(Then) he said: 'Let her throne be disguised, so that we can see whether she is guided or if she is among those who are not guided'\n",
        "TRANSLATION_15": "He said, “Disguise her throne for her, and we shall see whether she will be guided, or remains one of the misguided.”\n",
        "TRANSLATION_16": "He said, \"Disguise for her her throne; we will see whether she will be guided [to truth] or will be of those who is not guided.\"\n",
        "TRANSLATION_17": "[27:41] He said, ‘Disguise her throne for her — in other words, transform it such that when she sees it, it will be in an unrecognisable form — that we may see whether she will be guided, to recognising it, or be of those who cannot be guided’, to recognise when things are transformed around them. He [Solomon] sought thereby to test her mind, for it was said to have something wrong with it. Thus they transformed it by adding or taking away [certain things] and in other ways.\n",
        "TRANSLATION_18": "(He said: Disguise her throne for her) add to her throne and take away from it (that we may see whether she will go aright) whether she will know (or be of those not rightly guided) or whether she will not know.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "27:41",
            "61:2",
            "51:27",
            "36:22",
            "36:73",
            "32:18",
            "37:92",
            "37:25",
            "30:57",
            "23:59"
        ],
        "BIBLE": [
            "prophets:jeremiah:21:8",
            "torah:genesis:38:16",
            "writings:job:34:27",
            "prophets:amos:7:8",
            "torah:deuteronomy:9:12",
            "prophets:i%20kings:2:15",
            "prophets:ii%20kings:6:19",
            "torah:genesis:4:15",
            "torah:exodus:11:8",
            "prophets:ii%20samuel:2:21"
        ]
    }
}