{
    "VERSE": "27:44",
    "ARABIC": "قِيلَ لَهَا ٱدْخُلِى ٱلصَّرْحَ فَلَمَّا رَأَتْهُ حَسِبَتْهُ لُجَّةً وَكَشَفَتْ عَن سَاقَيْهَا قَالَ إِنَّهُۥ صَرْحٌ مُّمَرَّدٌ مِّن قَوَارِيرَ قَالَتْ رَبِّ إِنِّى ظَلَمْتُ نَفْسِى وَأَسْلَمْتُ مَعَ سُلَيْمَٰنَ لِلَّهِ رَبِّ ٱلْعَٰلَمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "She was told: 'Enter the courtyard,' but when she saw it she supposed it to be a pool and bared her legs. He said, 'It is a courtyard paved with glass.' She said, 'My Lord, I have wronged myself but I have submitted with Sulayman to the Lord of all the worlds.'",
        "TRANSLATION_1": "She was invited to enter the court. When she saw it, she took it for a sheet of water, and (pulling up her skirts) uncovered her legs. (Solomon) told her: \"This is paved with tiles of glass.\" \"O Lord,\" she said, \"I have wronged myself, and I submit to the Lord of all the worlds with Solomon.\"\n",
        "TRANSLATION_2": "She was told: \"Enter the palace.\" But when she saw it, she thought it was a pool of water and she bared both her calves (to enter into it). Solomon said: \"This is a slippery floor of crystal.\" Thereupon she cried out: \"My Lord, I have been inflicting much wrong on myself. Now I submit myself with Solomon to Allah, the Lord of the whole Universe.\"\n",
        "TRANSLATION_3": "She was told to enter the palace. When she saw it, she thought that it was a pool and raised her clothe up to her legs. Solomon said, \"This is a palace constructed with glass.\" She said, \"My Lord, indeed I have wronged myself and I submit myself with Solomon to the will of God, the Lord of the Universe.\"\n",
        "TRANSLATION_4": "It was said to her, “Enter the hall”; and when she saw it she thought it was a pool and bared her shins*; said Sulaiman, “This is only a smooth hall, affixed with glass”; she said, “My Lord, I have indeed wronged myself, and I now submit myself along with Sulaiman to Allah, the Lord Of The Creation.” (* In order to cross it)\n",
        "TRANSLATION_5": "It was said to her: \"Enter As-Sarh,\" but when she saw it, she thought it was a pool, and she (tucked up her clothes) uncovering her legs. Sulayman said: \"Verily, it is a Sarh Mumarrad of Qawarir.\" She said: \"My Lord! Verily, I have wronged myself, and I submit, together with Sulayman to Allah, the Lord of all that exits.\"\n",
        "TRANSLATION_6": "It was said to her: Enter the palace; but when she saw it she deemed it to be a great expanse of water, and bared her legs. He said: Surely it is a palace made smooth with glass. She said: My Lord! surely I have been unjust to myself, and I submit with Sulaiman to Allah, the Lord of the worlds.\n",
        "TRANSLATION_7": "It was said to her, 'Enter the pavilion.' But when she saw it, she supposed it was a spreading water, and she bared her legs. He said, 'It is a pavilion smoothed of crystal. She said, 'My Lord, indeed I have wronged myself, and I surrender with Solomon to God, the Lord of all Being.'\n",
        "TRANSLATION_8": "It was said unto her: Enter the hall. And when she saw it she deemed it a pool and bared her legs. (Solomon) said: Lo! it is a hall, made smooth, of glass. She said: My Lord! Lo! I have wronged myself, and I surrender with Solomon unto Allah, the Lord of the Worlds.\n",
        "TRANSLATION_9": "Then she was bidden to enter the palace; but when she saw it, she thought it was a deep pool of water, and bared her legs. But Solomon explained, \"It is just a palace paved with glass,\" and she said, \"My Lord, I have wronged myself: now I submit myself along with Solomon, to God, the Lord of the Universe.\"\n",
        "TRANSLATION_10": "It was said unto her: enter the palace. Then when she saw it,, he deemed it a pool and bared her shanks. He said: verily it is a palace evenly floored with glass. She said: my Lord! verily I wronged my soul, and now submit myself together with Sulaiman unto Allah, the Lord of the Worlds.\n",
        "TRANSLATION_11": "It was said to her, ‘Enter the palace.’ So when she saw it, she supposed it to be a pool of water, and she bared her shanks. He said, ‘It is a palace paved with crystal.’ She said, ‘My Lord! Indeed I have wronged myself, and I submit with Solomon to Allah, the Lord of all the worlds.’\n",
        "TRANSLATION_12": "She was asked to enter the lofty Palace: but when she saw it, she thought it was a lake of water, and she (tucked up her skirts), uncovering her legs. He said: \"This is but a palace paved smooth with slabs of glass.\" She said: \"O my Lord! I have indeed wronged my soul: I do (now) submit (in Islam), with Solomon, to the Lord of the Worlds.\"\n",
        "TRANSLATION_13": "It was said to her: \"Enter As-Sarh\" [(a glass surface with water underneath it) or a palace], but when she saw it, she thought it was a pool, and she (tucked up her clothes) uncovering her legs, Sulaiman (Solomon) said: \"Verily, it is Sarh [(a glass surface with water underneath it) or a palace] paved smooth with slab of glass.\" She said: \"My Lord! Verily, I have wronged myself, and I submit (in Islam, together with Sulaiman (Solomon), to Allah, the Lord of the 'Alamin (mankind, jinns and all that exists).\"\n",
        "TRANSLATION_14": "It was said to her: 'Enter the pavilion' And when she saw it, she thought it was a pool of water, and bared her legs. But he said: 'It is a pavilion smoothed with crystal' She said: 'My Lord, I have wronged myself, and I become a Muslim (submissive) with Solomon to Allah, Lord of the Worlds'\n",
        "TRANSLATION_15": "It was said to her, “Go inside the palace.” And when she saw it, she thought it was a deep pond, and she bared her legs. He said, “It is a palace paved with glass.” She said, “My Lord, I have done wrong to myself, and I have submitted with Solomon, to God, Lord of the Worlds.”\n",
        "TRANSLATION_16": "She was told, \"Enter the palace.\" But when she saw it, she thought it was a body of water and uncovered her shins [to wade through]. He said, \"Indeed, it is a palace [whose floor is] made smooth with glass.\" She said, \"My Lord, indeed I have wronged myself, and I submit with Solomon to Allah, Lord of the worlds.\"\n",
        "TRANSLATION_17": "[27:44] It was, also, said to her, ‘Enter the palace [hallway]’ — this was a transparent white glass floor underneath which flowed sweet water that contained fish. Solomon had it made when he was told that her legs and feet resembled the shanks of a mule. And when she saw it, she supposed it to be a pool, of water, and so she bared her legs, to wade through it. Meanwhile Solomon was seated on his throne at the front part of the palace [hallway], and he saw that her legs and feet were [in fact] fair. He said, to her: ‘It is a hallway paved [smooth] with crystal’, and thereafter he called her to submit [to God]. She said, ‘My Lord, indeed I have wronged myself, by worshipping other than You, and I submit with Solomon to God, the Lord of the Worlds’. He wanted to marry her but disliked the hair on her legs. So the devils made a [depilatory] lime mixture (nūra) and she removed it therewith. He married her and had [great] love for her. And he let her remain as ruler of her kingdom and would visit her once a month, staying for three days [every time]. Her reign came to an end at the same time as that of Solomon. It is reported that he became king at the age of 13 and died at the age of 53 — Glory be to the One whose enduring sovereignty will never end!\n",
        "TRANSLATION_18": "(It was said unto her: Enter the hall) enter the castle. (And when she saw it she deemed it a pool and bared her legs) she lifted her dress above her legs. ((Solomon) said: Lo! it is a hall, made smooth, of glass) beneath which there is water, so do not be afraid of getting wet. (She said: My Lord! Lo! I have wronged myself) by worshipping the sun, (and I surrender with Solomon) at the hand of Solomon (unto Allah, the Lord of the Worlds) the master of the jinn and human beings.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "27:44",
            "29:6",
            "40:66",
            "27:8",
            "6:162",
            "12:23",
            "40:64",
            "37:182",
            "59:16",
            "3:36"
        ],
        "BIBLE": [
            "torah:exodus:7:19",
            "prophets:judges:6:22",
            "prophets:ii%20kings:2:14",
            "prophets:i%20kings:12:28",
            "prophets:i%20samuel:26:12",
            "prophets:joshua:7:21",
            "prophets:ii%20kings:2:12",
            "writings:ii%20chronicles:24:11",
            "prophets:ezekiel:19:5",
            "prophets:ii%20kings:2:10"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:3:7",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:1:11",
            
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:1:8"
        ]
    }
}