{
    "VERSE": "27:45",
    "ARABIC": "وَلَقَدْ أَرْسَلْنَآ إِلَىٰ ثَمُودَ أَخَاهُمْ صَٰلِحًا أَنِ ٱعْبُدُوا۟ ٱللَّهَ فَإِذَا هُمْ فَرِيقَانِ يَخْتَصِمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "To Thamud We sent their brother Salih telling them to worship Allah, and straightaway they divided in two, arguing with one another.",
        "TRANSLATION_1": "We sent to Thamud their brother Saleh (who said): \"Worship God.\" But they were divided into two groups disputing with one another.\n",
        "TRANSLATION_2": "And We sent to Thamud their brother Salih (with the Message): \"Serve Allah,\" but all of a sudden they became split into two quarrelling factions.\n",
        "TRANSLATION_3": "We sent to the tribe of Thamud their brother Salih so that they would worship God, but they became two quarrelling groups.\n",
        "TRANSLATION_4": "And indeed We sent to the Thamud, their fellowman Saleh that, “Worship Allah”, thereupon they became two parties quarrelling.\n",
        "TRANSLATION_5": "And indeed We sent to Thamud their brother Salih, (saying): \"Worship Allah.\" Then look! They became two parties quarreling with each other.\n",
        "TRANSLATION_6": "And certainly We sent to Samood their brother Salih, saying: Serve Allah; and lo! they became two sects quarrelling with each other.\n",
        "TRANSLATION_7": "And We sent to Thamood their brother Salih: 'Serve you God!' And behold, they were two parties, that were disputing one with another.\n",
        "TRANSLATION_8": "And We verily sent unto Thamud their brother Salih, saying: Worship Allah. And lo! they (then became two parties quarrelling.\n",
        "TRANSLATION_9": "To Thamud We sent their brother Salih. He said, \"Serve none but God.\" But they divided themselves into two factions contending with one another.\n",
        "TRANSLATION_10": "And assuredly We sent unto the Thamud their brother Saleh saying: worship Allah. Then lo! they became two parties contending.\n",
        "TRANSLATION_11": "Certainly We sent to Thamud Salih, their brother, [with the summons:] ‘Worship Allah!’ But thereat they became two groups contending with each other.\n",
        "TRANSLATION_12": "We sent (aforetime), to the Thamud, their brother Salih, saying, \"Serve Allah\": But behold, they became two factions quarrelling with each other.\n",
        "TRANSLATION_13": "And indeed We sent to Thamud their brother Salih (Saleh), saying: \"Worship Allah (Alone and none else). Then look! They became two parties (believers and disbelievers) quarreling with each other.\"\n",
        "TRANSLATION_14": "To Thamood We sent their brother Salih saying: 'Worship Allah' But they were two parties in dispute with one another.\n",
        "TRANSLATION_15": "And We sent to Thamood their brother Saleh: “Worship God.” But they became two disputing factions.\n",
        "TRANSLATION_16": "And We had certainly sent to Thamud their brother Salih, [saying], \"Worship Allah,\" and at once they were two parties conflicting.\n",
        "TRANSLATION_17": "[27:45] And verily We sent to Thamūd their brother, in terms of [his belonging to the same] tribe, Sālih, with the following [decree]: ‘Worship God!’, affirm His Oneness. And lo! they [then] became two parties quarrelling with one another, over religion, one party having become believers upon his arrival as messenger to them and the other party disbelievers.\n",
        "TRANSLATION_18": "(And We verily sent until Thamud their brother) their Prophet (Salih, saying: Worship Allah) that you should say to them: profess Allah's divine Oneness, and repent to Him from disbelief and idolatry. (And lo! they (then) became two parties) one believing and the other disbelieving, (quarrelling) regarding Religion.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "27:45",
            "26:142",
            "12:90",
            "12:91",
            "33:18",
            "11:61",
            "53:62",
            "24:48",
            "5:61",
            "3:158"
        ],
        "BIBLE": [
            "torah:exodus:3:12",
            "torah:genesis:29:15",
            "torah:exodus:7:16",
            "prophets:joshua:24:16",
            "prophets:ii%20kings:17:12",
            "prophets:jeremiah:22:9",
            "prophets:judges:21:5",
            "writings:daniel:3:28",
            "writings:i%20chronicles:19:5",
            "torah:exodus:10:8"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:2:6",
            "Sefer%20Yetzirah:1:13",
            "Sefer%20Yetzirah:2:1"
        ]
    }
}