{
    "VERSE": "27:48",
    "ARABIC": "وَكَانَ فِى ٱلْمَدِينَةِ تِسْعَةُ رَهْطٍ يُفْسِدُونَ فِى ٱلْأَرْضِ وَلَا يُصْلِحُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "There was a group of nine men in the city causing corruption in the land and not putting things right.",
        "TRANSLATION_1": "There were in that city nine persons who spread disorder in the land, and did not reform.\n",
        "TRANSLATION_2": "Now there were nine ring-leaders in the city who created corruption in the land and never worked to set things right.\n",
        "TRANSLATION_3": "There were nine tribes in the city spreading evil without any reform in the land.\n",
        "TRANSLATION_4": "And there were nine persons in the city who used to cause turmoil in the land and did not wish reform.\n",
        "TRANSLATION_5": "And there were in the city nine Rahtin, who made mischief in the land, and would not reform.\n",
        "TRANSLATION_6": "And there were in the city nine persons who made mischief in the land and did not act aright.\n",
        "TRANSLATION_7": "Now in the city there were nine persons who did corruption in the land, and put not things right;\n",
        "TRANSLATION_8": "And there were in the city nine persons who made mischief in the land and reformed not.\n",
        "TRANSLATION_9": "There were in the city nine men who spread corruption in the land, and would not reform.\n",
        "TRANSLATION_10": "And there were nine of a group in the City, who spread corruption in the land and rectified not.\n",
        "TRANSLATION_11": "There were nine persons in the city who caused corruption in the land and did not set things right.\n",
        "TRANSLATION_12": "There were in the city nine men of a family, who made mischief in the land, and would not reform.\n",
        "TRANSLATION_13": "And there were in the city nine men (from the sons of their chiefs), who made mischief in the land, and would not reform.\n",
        "TRANSLATION_14": "In the city there were nine people who were corrupting the land and did not reform.\n",
        "TRANSLATION_15": "In the city was a gang of nine who made mischief in the land and did no good.\n",
        "TRANSLATION_16": "And there were in the city nine family heads causing corruption in the land and not amending [its affairs].\n",
        "TRANSLATION_17": "[27:48] And there were in the city, the city of Thamūd, a band of nine men, that is, [nine] men, who were causing corruption in the land, with acts of disobedience, which included their corroding of dinar and dirham coins [rendering them worthless], and did not reform [their ways], through obedience [to God].\n",
        "TRANSLATION_18": "(And there were in the city nine persons) nine sinful people among the sons of their chieftains: Qaddar Ibn Salif, Masda' Ibn Dahw and their host (who made mischief in the land) through their transgressions (and reformed not) they did not enjoy righteousness nor practised it.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "27:48",
            "26:152",
            "38:28",
            "44:29",
            "52:36",
            "15:67",
            "21:19",
            "17:90",
            "55:10",
            "23:79"
        ],
        "BIBLE": [
            "prophets:i%20kings:21:12",
            "writings:i%20chronicles:24:4",
            "torah:exodus:16:16",
            "prophets:i%20kings:21:9",
            "torah:exodus:29:6",
            "torah:numbers:30:2",
            "prophets:ii%20kings:10:6",
            "writings:ezra:5:10",
            "writings:i%20chronicles:8:28",
            "torah:deuteronomy:29:9"
        ]
    }
}