{
    "VERSE": "27:51",
    "ARABIC": "فَٱنظُرْ كَيْفَ كَانَ عَٰقِبَةُ مَكْرِهِمْ أَنَّا دَمَّرْنَٰهُمْ وَقَوْمَهُمْ أَجْمَعِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "So look at the end result of all their plotting; We utterly destroyed them and their whole people!",
        "TRANSLATION_1": "Now see the end of their machinations: We destroyed them and their entire people.\n",
        "TRANSLATION_2": "So see what was the outcome of the plan they made: We utterly destroyed them and their people, all of them.\n",
        "TRANSLATION_3": "We destroyed them and their people altogether.\n",
        "TRANSLATION_4": "Therefore see what was the result of their scheming – We destroyed them and their entire nation.\n",
        "TRANSLATION_5": "Then see how was the end of their plot! Verily, We destroyed them and their nation all together.\n",
        "TRANSLATION_6": "See, then, how was the end of their plan that We destroyed them and their people, all (of them).\n",
        "TRANSLATION_7": "and behold, how was the end of their device! For We destroyed them and their people all together.\n",
        "TRANSLATION_8": "Then see the nature of the consequence of their plotting, for lo! We destroyed them and their people, every one.\n",
        "TRANSLATION_9": "See, then, what the consequences of their plan were. We destroyed them and their people utterly, all together.\n",
        "TRANSLATION_10": "So behold thou how was the end of their plotting: verily We annihilated them and their nation all together.\n",
        "TRANSLATION_11": "So observe how was the outcome of their plotting, as We destroyed them and all their people.\n",
        "TRANSLATION_12": "Then see what was the end of their plot!- this, that We destroyed them and their people, all (of them).\n",
        "TRANSLATION_13": "Then see how was the end of their plot! Verily! We destroyed them and their nation, all together.\n",
        "TRANSLATION_14": "And behold the consequences of their devising! We destroyed them, and their nation altogether.\n",
        "TRANSLATION_15": "So note the outcome of their planning; We destroyed them and their people, altogether.\n",
        "TRANSLATION_16": "Then look how was the outcome of their plan - that We destroyed them and their people, all.\n",
        "TRANSLATION_17": "[27:51] So behold how was the consequence of their plot! For lo! We destroyed them and all their people, with Gabriel’s cry, or by the angels’ pelting them with stones, which they could see even though they could not see them [the angels].\n",
        "TRANSLATION_18": "(Then see) Muhammad (the nature of the consequence of their plotting) the punishment for their plan to kill Salih, (for lo! We destroyed them) through raining stones on them (and their people, every one) and We destroyed every one of their people.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "27:51",
            "7:84",
            "43:25",
            "37:73",
            "28:40",
            "27:14",
            "21:77",
            "7:93",
            "27:69",
            "6:11"
        ],
        "BIBLE": [
            "prophets:hosea:4:6",
            "writings:lamentations:3:60",
            "prophets:i%20kings:8:8",
            "torah:exodus:33:13",
            "writings:ii%20chronicles:5:9",
            "writings:psalms:119:96",
            "prophets:jeremiah:46:28",
            "torah:numbers:27:13",
            "prophets:ii%20kings:9:26",
            "torah:numbers:24:20"
        ]
    }
}