{
    "VERSE": "27:52",
    "ARABIC": "فَتِلْكَ بُيُوتُهُمْ خَاوِيَةًۢ بِمَا ظَلَمُوٓا۟ إِنَّ فِى ذَٰلِكَ لَءَايَةً لِّقَوْمٍ يَعْلَمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "These are the ruins of their houses because of the wrong they did. There is certainly a Sign in that for people with knowledge.",
        "TRANSLATION_1": "So these their habitations lie deserted now because of their iniquities. Verily there is a sign in this for those who understand.\n",
        "TRANSLATION_2": "Now behold their houses that lie in utter ruins because of their wrong-doing. Verily there is a Sign in this for the people who know.\n",
        "TRANSLATION_3": "Those are their empty houses which We ruined because of their injustice. In this there is evidence (of the truth) for the people of knowledge.\n",
        "TRANSLATION_4": "So these are their houses fallen flat, the recompense of their injustice; indeed in this is a sign for people who know.\n",
        "TRANSLATION_5": "These are their houses in utter ruin, for they did wrong. Verily, in this is indeed an Ayah for people who know.\n",
        "TRANSLATION_6": "So those are their houses fallen down because they were unjust, most surely there is a sign in this for a people who know.\n",
        "TRANSLATION_7": "Those are their houses, all fallen down because of the evil they committed; surely in that is a sign for a people who have knowledge.\n",
        "TRANSLATION_8": "See, yonder are their dwellings empty and in ruins because they did wrong. Lo! herein is indeed a portent for a people who have knowledge.\n",
        "TRANSLATION_9": "Because of their wrongdoing, their houses are in ruins, in that surely there is a sign for people who have knowledge,\n",
        "TRANSLATION_10": "So yonder are their houses overturned, for they did wrong. Verily, herein is a sign unto a people who know.\n",
        "TRANSLATION_11": "So there lay their houses, fallen in ruin because of their wrongdoing. There is indeed a sign in that for a people who have knowledge.\n",
        "TRANSLATION_12": "Now such were their houses, - in utter ruin, - because they practised wrong-doing. Verily in this is a Sign for people of knowledge.\n",
        "TRANSLATION_13": "These are their houses in utter ruin, for they did wrong. Verily, in this is indeed an Ayah (a lesson or a sign) for people who know.\n",
        "TRANSLATION_14": "Those are their houses, all are in ruins because of the evil they committed; surely in this there is a sign for nation who know.\n",
        "TRANSLATION_15": "Here are their homes, in ruins, on account of their iniquities. Surely in this is a sign for people who know.\n",
        "TRANSLATION_16": "So those are their houses, desolate because of the wrong they had done. Indeed in that is a sign for people who know.\n",
        "TRANSLATION_17": "[27:52] So those then are their houses [lying] deserted (khāwiyatan is in the accusative because it is a circumstantial qualifier, the operator of which is the import of the demonstrative pronoun [tilka, ‘those’]) because of the evil which they did, that is, their disbelief. Surely in that there is a sign, a lesson, for a people who have knowledge, of Our power and are thus admonished.\n",
        "TRANSLATION_18": "(See, yonder are their dwellings empty and in ruins because they did wrong) because of their idolatry. (Lo! Herein) in that which We did to them (is indeed a portent) a sign and an admonition (for a people who have knowledge) who believe in that which was done to them.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "27:52",
            "16:13",
            "25:36",
            "45:13",
            "10:67",
            "29:35",
            "29:24",
            "6:105",
            "15:75",
            "15:77"
        ],
        "BIBLE": [
            "prophets:i%20samuel:3:13",
            "prophets:ii%20samuel:1:12",
            "prophets:i%20kings:12:16",
            "prophets:ezekiel:33:29",
            "writings:ii%20chronicles:10:16",
            "torah:leviticus:5:1",
            "prophets:ezekiel:39:23",
            "torah:exodus:3:7",
            "prophets:jeremiah:4:22",
            "prophets:jeremiah:44:22"
        ]
    }
}