{
    "VERSE": "27:57",
    "ARABIC": "فَأَنجَيْنَٰهُ وَأَهْلَهُۥٓ إِلَّا ٱمْرَأَتَهُۥ قَدَّرْنَٰهَا مِنَ ٱلْغَٰبِرِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "So We rescued him and his family - except for his wife. We ordained her to be one of those who stayed behind.",
        "TRANSLATION_1": "So We saved him and his family except his wife who was destined to stay behind.\n",
        "TRANSLATION_2": "Eventually We saved (Lot) and his family, except his wife. We had decreed that she should be among those who would remain behind.\n",
        "TRANSLATION_3": "We saved (Lot) and his family except his wife who was destined to remain behind.\n",
        "TRANSLATION_4": "We therefore rescued him and his family, except his wife; We had decreed that she is of those who will remain behind.\n",
        "TRANSLATION_5": "So, We saved him and his family, except his wife. We destined her to be of those who remained behind.\n",
        "TRANSLATION_6": "But We delivered him and his followers except his wife; We ordained her to be of those who remained behind.\n",
        "TRANSLATION_7": "So We delivered him and his family, except his wife; We decreed she should be of those that tarried.\n",
        "TRANSLATION_8": "Then We saved him and his household save his wife; We destined her to be of those who stayed behind.\n",
        "TRANSLATION_9": "So We delivered him and his family, except his wife: We ordained her to be one of those who stayed behind,\n",
        "TRANSLATION_10": "Then We delivered him and his household save his wife: We destined hers to be of the lingerers.\n",
        "TRANSLATION_11": "So We delivered him and his family, except his wife. We ordained her to be among those who remained behind.\n",
        "TRANSLATION_12": "But We saved him and his family, except his wife; her We destined to be of those who lagged behind.\n",
        "TRANSLATION_13": "So We saved him and his family, except his wife. We destined her to be of those who remained behind.\n",
        "TRANSLATION_14": "So We saved him and his family, except his wife, whom We decreed should stay behind.\n",
        "TRANSLATION_15": "So We saved him and his family, except for his wife, whom We destined to be among the laggards.\n",
        "TRANSLATION_16": "So We saved him and his family, except for his wife; We destined her to be of those who remained behind.\n",
        "TRANSLATION_17": "[27:57] So We delivered him and his family, except his wife — We decreed [for] her, We made her by Our decree, to be of those who remained behind, in the chastisement.\n",
        "TRANSLATION_18": "(Then we saved him and his household) his daughters (save his wife) the hypocrite; (We destined her to be of those who stayed behind) We decreed that she would stay behind to be destroyed.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "27:57",
            "7:83",
            "29:32",
            "15:60",
            "84:9",
            "26:170",
            "29:33",
            "37:76",
            "11:71",
            "36:50"
        ],
        "BIBLE": [
            "prophets:i%20kings:3:18",
            "prophets:judges:6:15",
            "prophets:ii%20samuel:14:7",
            "writings:psalms:18:42",
            "prophets:zechariah:12:14",
            "prophets:isaiah:49:25",
            "prophets:isaiah:38:20",
            "prophets:ezekiel:16:27",
            "writings:psalms:71:2",
            "prophets:judges:10:13"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:12",
            
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:3:4",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:3:7",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:6:2"
        ]
    }
}