{
    "VERSE": "27:58",
    "ARABIC": "وَأَمْطَرْنَا عَلَيْهِم مَّطَرًا فَسَآءَ مَطَرُ ٱلْمُنذَرِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "We rained down a rain upon them. How evil is the rain of those who are warned!",
        "TRANSLATION_1": "And We rained down on them a shower (of stones). How ruinous was the rain that fell on those who had been warned (but warned in vain)!\n",
        "TRANSLATION_2": "And We rained down upon them a rain. It was an evil rain for those who had already been warned.\n",
        "TRANSLATION_3": "We sent to them a terrible rainstorm. How horrible was the rain for the people who had already received warning.\n",
        "TRANSLATION_4": "And We showered a rain upon them; so what a wretched rain for those who were warned!\n",
        "TRANSLATION_5": "And We rained down on them a rain. So, evil was the rain of those who were warned.\n",
        "TRANSLATION_6": "And We rained on them a rain, and evil was the rain of those who had been warned.\n",
        "TRANSLATION_7": "And We rained on them a rain; and evil indeed is the rain of them that are warned.\n",
        "TRANSLATION_8": "And We rained a rain upon them. Dreadful is the rain of those who have been warned.\n",
        "TRANSLATION_9": "and We pelted them with torrential rain. How dreadful that rain was for those who had been warned!\n",
        "TRANSLATION_10": "And We rained upon them a rain; ill was the rain upon the warned.\n",
        "TRANSLATION_11": "Then We poured down upon them a rain [of stones]. Evil was that rain for those who had been warned!\n",
        "TRANSLATION_12": "And We rained down on them a shower (of brimstone): and evil was the shower on those who were admonished (but heeded not)!\n",
        "TRANSLATION_13": "And We rained down on them a rain (of stones). So evil was the rain of those who were warned.\n",
        "TRANSLATION_14": "And we rained on them a rain (of stones); indeed it is an evil rain that rains on those that are warned.\n",
        "TRANSLATION_15": "And We rained upon them a rain. Miserable was the rain of those forewarned.\n",
        "TRANSLATION_16": "And We rained upon them a rain [of stones], and evil was the rain of those who were warned.\n",
        "TRANSLATION_17": "[27:58] Then We rained on them a rain — these were the stones of baked mud [cf. Q. 15:74] — which destroyed them. And evil indeed was, their rain, the rain of those who were warned, against chastisement.\n",
        "TRANSLATION_18": "(And We rained a rain) stones (upon them) upon their sodomites and travellers. (Dreadful) evil (is the rain of those who have been warned) by Lot but did not believe in him.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "27:58",
            "26:173",
            "7:84",
            "77:23",
            "85:7",
            "27:85",
            "37:116",
            "21:86",
            "74:45",
            "83:33"
        ],
        "BIBLE": [
            "prophets:i%20kings:18:38",
            "prophets:ezekiel:38:22",
            "writings:lamentations:1:7",
            "prophets:ezekiel:13:11",
            "writings:proverbs:10:8",
            "prophets:joshua:11:7",
            "torah:leviticus:9:24",
            "prophets:ii%20samuel:20:8",
            "prophets:ii%20kings:3:19",
            "prophets:jeremiah:3:3"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:2:4"
        ]
    }
}