{
    "VERSE": "27:6",
    "ARABIC": "وَإِنَّكَ لَتُلَقَّى ٱلْقُرْءَانَ مِن لَّدُنْ حَكِيمٍ عَلِيمٍ",
    "ENGLISH": {
        "TRANSLATION_0": "You receive the Qur'an directly from One who is All-Wise, All-Knowing.",
        "TRANSLATION_1": "You have been conveyed the Qur'an from One all-wise and all-knowing.\n",
        "TRANSLATION_2": "As for you, (O Muhammad), you are receiving the Qur'an from the Most Wise, the All-Knowing.\n",
        "TRANSLATION_3": "(Muhammad), you have certainly received the Quran from the All-wise and All-knowing One.\n",
        "TRANSLATION_4": "And indeed you (O dear Prophet Mohammed – peace and blessings be upon him), are taught the Qur’an from the Wise, the All Knowing.\n",
        "TRANSLATION_5": "And verily, you are being taught the Qur'an from One, All-Wise, All-Knowing.\n",
        "TRANSLATION_6": "And most surely you are made to receive the Quran from the Wise, the Knowing Allah.\n",
        "TRANSLATION_7": "Thou receivest the Koran from One All-wise, All-knowing.\n",
        "TRANSLATION_8": "Lo! as for thee (Muhammad), thou verily receivest the Qur'an from the presence of One Wise, Aware.\n",
        "TRANSLATION_9": "You have received this Quran from One who is all-wise, all-knowing.\n",
        "TRANSLATION_10": "And verily thou art receiving the Qur'an) from before the Wise, the Knowing.\n",
        "TRANSLATION_11": "Indeed you receive the Quran from One who is all-wise, all-knowing.\n",
        "TRANSLATION_12": "As to thee, the Qur'an is bestowed upon thee from the presence of one who is wise and all-knowing.\n",
        "TRANSLATION_13": "And verily, you (O Muhammad SAW) are receiving the Quran from the One, All-Wise, All-Knowing.\n",
        "TRANSLATION_14": "You have received the Koran from the Wise, the Knower.\n",
        "TRANSLATION_15": "You are receiving the Quran from an All-Wise, All-Knowing.\n",
        "TRANSLATION_16": "And indeed, [O Muhammad], you receive the Qur'an from one Wise and Knowing.\n",
        "TRANSLATION_17": "[27:6] And truly you — this is an address to the Prophet (s) — are receiving the Qur’ān, it is being transmitted to you intensely, from One Wise, Knowing, in such [transmission].\n",
        "TRANSLATION_18": "(Lo! as for thee) Muhammad, (thou verily receivest the Qur'an) He says: Gabriel comes down to you with the Qur'an (from the presence of One Wise) in His command and judgement, (Aware) of His created beings.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "27:6",
            "36:2",
            "15:25",
            "24:18",
            "33:1",
            "51:30",
            "76:23",
            "27:78",
            "12:6",
            "4:104"
        ],
        "BIBLE": [
            "torah:genesis:26:29",
            "writings:i%20chronicles:12:19",
            "writings:psalms:21:7",
            "torah:exodus:32:4",
            "prophets:jeremiah:4:10",
            "writings:psalms:24:5",
            "writings:proverbs:19:20",
            "prophets:isaiah:45:15",
            "prophets:i%20samuel:25:35",
            "writings:proverbs:4:10"
        ]
    }
}