{
    "VERSE": "27:61",
    "ARABIC": "أَمَّن جَعَلَ ٱلْأَرْضَ قَرَارًا وَجَعَلَ خِلَٰلَهَآ أَنْهَٰرًا وَجَعَلَ لَهَا رَوَٰسِىَ وَجَعَلَ بَيْنَ ٱلْبَحْرَيْنِ حَاجِزًا أَءِلَٰهٌ مَّعَ ٱللَّهِ بَلْ أَكْثَرُهُمْ لَا يَعْلَمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "He Who made the earth a stable dwelling place and appointed rivers flowing through its midst and placed firmly embedded mountains on it and set a barrier between the two seas. Is there another god besides Allah? No indeed, but most of them do not know it!",
        "TRANSLATION_1": "Who then made the earth a habitable place, and made the rivers (flow) in its valleys and dales, and placed upon it firm stabilisers, and kept a barrier between two bodies of water? Is there any other god along with God? In reality most of them do not know.\n",
        "TRANSLATION_2": "Who is it Who has made the earth a place of resort, and has caused rivers to flow in its midst, and has placed upon it firm mountains, and has placed a barrier between two masses of water? Is there any god associated with Allah (in these tasks)? Nay; but most of them do not know.\n",
        "TRANSLATION_3": "(Are the idols worthier or) the One who has made the earth a resting place, the rivers flow from its valleys, the mountains as anchors and a barrier between the two seas? Is there any lord besides God? In fact, most people do not know.\n",
        "TRANSLATION_4": "Or He Who made the earth for habitation, and placed rivers within it, and created mountains as anchors for it, and kept a barrier between the two seas? Is there a God along with Allah?! In fact, most of them are ignorant.\n",
        "TRANSLATION_5": "Is not He Who has made the earth as a fixed abode, and has placed rivers in its midst, and has placed firm mountains therein, and has set a barrier between the two seas (of salt and sweet water) Is there any ilah (god) with Allah Nay, but most of them know not!\n",
        "TRANSLATION_6": "Or, Who made the earth a restingplace, and made in it rivers, and raised on it mountains and placed between the two seas a barrier. Is there a god with Allah? Nay! most of them do not know!\n",
        "TRANSLATION_7": "He who made the earth a fixed place and set amidst it rivers and appointed for it firm mountains and placed a partition between the two seas. Is there a god with God? Nay, but the most of them have no knowledge.\n",
        "TRANSLATION_8": "Is not He (best) Who made the earth a fixed abode, and placed rivers in the folds thereof, and placed firm hills therein, and hath set a barrier between the two seas? Is there any Allah beside Allah? Nay, but most of them know not!\n",
        "TRANSLATION_9": "Who is it that made the earth a stable place to live in? Who made rivers flow through it? Who set mountains upon it and placed a barrier between the two seas? Is there another deity besides God? Indeed, most of them have no knowledge.\n",
        "TRANSLATION_10": "Is not he best Who hath made the earth a fixed abode and placed rivers in the midst thereof and placed Firm mountains thereon, and hath set a barrier between the two seas? IS there any god along with Allah? Nay! but most of them know not.\n",
        "TRANSLATION_11": "Is He who made the earth an abode [for you], and made rivers [flowing] through it, and set firm mountains for it [’s stability], and set a barrier between the two seas...? What! Is there a god besides Allah? Indeed, most of them do not know.\n",
        "TRANSLATION_12": "Or, Who has made the earth firm to live in; made rivers in its midst; set thereon mountains immovable; and made a separating bar between the two bodies of flowing water? (can there be another) god besides Allah? Nay, most of them know not.\n",
        "TRANSLATION_13": "Is not He (better than your gods) Who has made the earth as a fixed abode, and has placed rivers in its midst, and has placed firm mountains therein, and has set a barrier between the two seas (of salt and sweet water). Is there any ilah (god) with Allah? Nay, but most of them know not.\n",
        "TRANSLATION_14": "Who has established the earth a fixed place and set therein rivers; and set for it firm mountains and placed a barrier between the two seas, is there a god with Allah? No, most of them are without knowledge.\n",
        "TRANSLATION_15": "Or, who made the earth habitable, and made rivers flow through it, and set mountains on it, and placed a partition between the two seas? Is there another god with God? But most of them do not know.\n",
        "TRANSLATION_16": "Is He [not best] who made the earth a stable ground and placed within it rivers and made for it firmly set mountains and placed between the two seas a barrier? Is there a deity with Allah? [No], but most of them do not know.\n",
        "TRANSLATION_17": "[27:61] Or He Who made the earth an abode [of stability], that does not [constantly] shake beneath [the feet of] its inhabitants, and made rivers [to flow] throughout it and set firm mountains for it, with which He fixed the earth [in place], and set an isthmus between the two seas, between the sweet one and the salty one, the one not mixing with the other. Is there a god with God? Nay, but most of them have no knowledge, of His Oneness.\n",
        "TRANSLATION_18": "(Is not He (best) Who made the earth a fixed abode, and placed rivers in the folds thereof) in the middle thereof, (and placed firm hills therein) on earth, (and hath set a barrier) preventing mixture (between the two seas) the sweet and salty seas? (Is there any God beside Allah) who has done this? (Nay, but most of them know not) most of them believe not!\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "27:61",
            "31:25",
            "6:116",
            "30:8",
            "27:64",
            "8:63",
            "27:63",
            "29:63",
            "21:21",
            "27:60"
        ],
        "BIBLE": [
            "prophets:ezekiel:5:5",
            "prophets:nahum:3:13",
            "prophets:i%20samuel:26:16",
            "prophets:ezekiel:6:13",
            "torah:exodus:8:18",
            "prophets:ezekiel:26:5",
            "writings:nehemiah:4:7",
            "torah:numbers:2:17",
            "prophets:amos:7:8",
            "writings:nehemiah:13:11"
        ]
    }
}