{
    "VERSE": "27:62",
    "ARABIC": "أَمَّن يُجِيبُ ٱلْمُضْطَرَّ إِذَا دَعَاهُ وَيَكْشِفُ ٱلسُّوٓءَ وَيَجْعَلُكُمْ خُلَفَآءَ ٱلْأَرْضِ أَءِلَٰهٌ مَّعَ ٱللَّهِ قَلِيلًا مَّا تَذَكَّرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "He Who responds to the oppressed when they call on Him and removes their distress, and has appointed you as khalifs on the earth. Is there another god besides Allah? How little you pay heed!",
        "TRANSLATION_1": "Who hears the cry of the anguished (soul) when it calls to Him, and relieves its suffering? And who made you trustees on the earth? Is there any other god along with God? How little it is that you reflect!\n",
        "TRANSLATION_2": "Who is it Who heeds the prayers of the distressed when he calls out to Him and Who removes his affliction? And who is it Who makes you vicegerents of the earth? Is there any god associated with Allah (in this task)? How little do you reflect!\n",
        "TRANSLATION_3": "(Are the idols worthier or) the One who answers the prayers of the distressed ones, removes their hardship, and makes you the successors in the land? Is there any lord besides God? In fact, you take very little heed.\n",
        "TRANSLATION_4": "Or He Who answers the prayer of the helpless when he invokes Him and removes the evil, and makes you inheritors of the earth? Is there a God along with Allah?! Very little do they ponder!\n",
        "TRANSLATION_5": "Is not He Who responds to the distressed one, when he calls on Him, and Who removes the evil, and makes you inheritors of the earth, generations after generations Is there any god with Allah Little is that you remember!\n",
        "TRANSLATION_6": "Or, Who answers the distressed one when he calls upon Him and removes the evil, and He will make you successors in the earth. Is there a god with Allah? Little is it that you mind!\n",
        "TRANSLATION_7": "He who answers the constrained, when he calls unto Him, and removes the evil and appoints you to be successors in the earth. Is there a god with God? Little indeed do you remember.\n",
        "TRANSLATION_8": "Is not He (best) Who answereth the wronged one when he crieth unto Him and removeth the evil, and hath made you viceroys of the earth? Is there any Allah beside Allah? Little do they reflect!\n",
        "TRANSLATION_9": "Who responds to the oppressed when he calls out to Him, and relieves his suffering and who will make you inheritors of the earth? Then, is there a god besides God? How little you pay heed!\n",
        "TRANSLATION_10": "Is not he best Who answereth the distressed when he calleth unto Him and removeth the evil, and hath made you the successors in the earth? Is there any god along with Allah? Little ye reflect!\n",
        "TRANSLATION_11": "Is He who answers the call of the distressed [person] when he invokes Him and removes his distress, and makes you successors on the earth...? What! Is there a god besides Allah? Little is the admonition that you take.\n",
        "TRANSLATION_12": "Or, Who listens to the (soul) distressed when it calls on Him, and Who relieves its suffering, and makes you (mankind) inheritors of the earth? (Can there be another) god besides Allah? Little it is that ye heed!\n",
        "TRANSLATION_13": "Is not He (better than your gods) Who responds to the distressed one, when he calls Him, and Who removes the evil, and makes you inheritors of the earth, generations after generations. Is there any ilah (god) with Allah? Little is that you remember!\n",
        "TRANSLATION_14": "Who answers the oppressed when he supplicates to Him and removes evil and appoints you as inheritors of the earth, is there a god with Allah? How little you remember!\n",
        "TRANSLATION_15": "Or, who answers the one in need when he prays to Him, and relieves adversity, and makes you successors on earth? Is there another god with God? How hardly you pay attention.\n",
        "TRANSLATION_16": "Is He [not best] who responds to the desperate one when he calls upon Him and removes evil and makes you inheritors of the earth? Is there a deity with Allah? Little do you remember.\n",
        "TRANSLATION_17": "[27:62] Or He Who answers the desperate one, the anguished person suffering harm, when he calls to Him and Who removes [his] distress, from him and from others, and makes you successors in the earth (the annexation [khulafā’a l-ardi, ‘successors of the earth’] has the same meaning as fī, ‘in’ [khulafā’a fī’l-ardi, ‘successors in the earth’]), in other words, each generation succeeding the one before it. Is there a god with God? Little do you remember, [little] are you admonished ([read] mā tadhakkarūna, ‘do you remember’; or [read] yadhdhakkarūna, ‘do they remember’, where [in both cases] the tā’ has been assimilated with the dhāl; the mā is extra, [used] to make less what is already ‘little’).\n",
        "TRANSLATION_18": "(Is not He (best) who answereth the wronged one) in his distress (when he crieth unto Him) to drive away his misfortune (and removeth the evil) by removing misfortunes, (and hath made you vicegerents of the earth) the dwellers of the earth after the destruction of its people? (Is there any God beside Allah) who did this? (Little do they reflect!) they derive no admonition at all from this.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "27:62",
            "27:64",
            "21:21",
            "6:3",
            "16:53",
            "13:21",
            "39:68",
            "71:19",
            "27:25",
            "14:19"
        ],
        "BIBLE": [
            "prophets:i%20samuel:28:15",
            "prophets:isaiah:50:2",
            "prophets:isaiah:48:1",
            "prophets:i%20kings:2:42",
            "writings:psalms:141:1",
            "prophets:hosea:12:10",
            "writings:psalms:45:18",
            "torah:deuteronomy:4:25",
            "prophets:jeremiah:15:11",
            "writings:daniel:6:13"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:3:7",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:3"
        ]
    }
}