{
    "VERSE": "27:67",
    "ARABIC": "وَقَالَ ٱلَّذِينَ كَفَرُوٓا۟ أَءِذَا كُنَّا تُرَٰبًا وَءَابَآؤُنَآ أَئِنَّا لَمُخْرَجُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Those who are kafir say, 'When we and our fathers are turned to dust will we then be brought forth again?",
        "TRANSLATION_1": "Those who do not believe, say: \"When we and our fathers have turned to dust, how shall we be raised again?\n",
        "TRANSLATION_2": "The unbelievers say: \"When we become dust, we and our forefathers, shall we really be brought out (from our graves)?\n",
        "TRANSLATION_3": "The unbelievers have said, \"Shall we and our fathers be brought out of the graves after we become dust?\n",
        "TRANSLATION_4": "And the disbelievers said, “Will we, when we and our forefathers have turned into dust, be removed again?”\n",
        "TRANSLATION_5": "And those who disbelieve say: \"When we have become dust -- we and our fathers -- shall we really be brought forth\"\n",
        "TRANSLATION_6": "And those who disbelieve say: What! when we have become dust and our fathers (too), shall we certainly be brought forth?\n",
        "TRANSLATION_7": "The unbelievers say, 'What, when we are dust, and our fathers, shall we indeed be brought forth?\n",
        "TRANSLATION_8": "Yet those who disbelieve say: When we have become dust like our fathers, shall we verily be brought forth (again)?\n",
        "TRANSLATION_9": "Those who deny the truth say, \"When we have turned to dust like our fathers, shall we be brought back to life again?\n",
        "TRANSLATION_10": "And those who disbelieve say: when we have become dust, we and our fathers, shall we, for sooth, be brought forth?\n",
        "TRANSLATION_11": "The faithless say, ‘What! When we and our fathers have become dust shall we be raised [from the dead]?\n",
        "TRANSLATION_12": "The Unbelievers say: \"What! when we become dust,- we and our fathers,- shall we really be raised (from the dead)?\n",
        "TRANSLATION_13": "And those who disbelieve say: \"When we have become dust, we and our fathers, shall we really be brought forth (again)?\n",
        "TRANSLATION_14": "The unbelievers say: 'When we and our fathers are turned to dust, shall we be brought forth?\n",
        "TRANSLATION_15": "Those who disbelieve say, “When we have become dust, and our ancestors, shall we be brought out?\n",
        "TRANSLATION_16": "And those who disbelieve say, \"When we have become dust as well as our forefathers, will we indeed be brought out [of the graves]?\n",
        "TRANSLATION_17": "[27:67] And the disbelievers say, also in rejecting the [idea of] resurrection: ‘What! When we and our fathers are dust shall we indeed be brought forth [again]?, from the graves.\n",
        "TRANSLATION_18": "(Yet those who disbelieve) the disbelievers of Mecca (say: when we have become) scattered (dust like our fathers) before us, (shall we verily be brought forth (again)) given life again and brought out of the graves?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "27:67",
            "23:82",
            "56:47",
            "37:16",
            "37:53",
            "37:69",
            "12:61",
            "23:35",
            "21:53",
            "83:32"
        ],
        "BIBLE": [
            "prophets:jeremiah:2:27",
            "prophets:i%20samuel:18:11",
            "prophets:isaiah:42:17",
            "prophets:malachi:3:7",
            "torah:genesis:47:9",
            "torah:deuteronomy:29:24",
            "prophets:i%20samuel:20:3",
            "prophets:jeremiah:29:15",
            "torah:deuteronomy:9:12",
            "writings:psalms:70:4"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:4:8",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:3:4",
            "Sefer%20Yetzirah:1:4"
        ]
    }
}