{
    "VERSE": "27:68",
    "ARABIC": "لَقَدْ وُعِدْنَا هَٰذَا نَحْنُ وَءَابَآؤُنَا مِن قَبْلُ إِنْ هَٰذَآ إِلَّآ أَسَٰطِيرُ ٱلْأَوَّلِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "We have been promised this before, we and our fathers. This is nothing but myths and legends of previous peoples.'",
        "TRANSLATION_1": "Indeed we and our fathers had been promised this before. It is nothing but the earlier people's lore.\"\n",
        "TRANSLATION_2": "We were told about this and so were our forefathers before us. But these are no more than fairy tales that have been recounted from ancient times.\"\n",
        "TRANSLATION_3": "It was promised to us and to our fathers before us. It is only ancient legends.\"\n",
        "TRANSLATION_4": "“Indeed this promise was given to us, and before us to our forefathers – this is nothing but stories of former people.”\n",
        "TRANSLATION_5": "Indeed we were promised this -- we and our forefathers before, verily, these are nothing but tales of ancients.\"\n",
        "TRANSLATION_6": "We have certainly been promised this, we and our fathers before; these are naught but stories of the ancients\n",
        "TRANSLATION_7": "We have been promised this, and our fathers before; this is naught but the fairy-tales of the ancients.'\n",
        "TRANSLATION_8": "We were promised this, forsooth, we and our fathers. (All) this is naught but fables of the men of old.\n",
        "TRANSLATION_9": "We and our fathers were promised this before; these are but old stories.\"\n",
        "TRANSLATION_10": "Assuredly we have been promised this aforetime, we and our fathers. Naught is this but fables of the ancients.\n",
        "TRANSLATION_11": "We and our fathers were promised this before. [But] these are just myths of the ancients.’\n",
        "TRANSLATION_12": "It is true we were promised this,- we and our fathers before (us): these are nothing but tales of the ancients.\"\n",
        "TRANSLATION_13": "Indeed we were promised this, we and our forefathers before, Verily, these are nothing but tales of ancients.\"\n",
        "TRANSLATION_14": "We were promised this before, and so were our fathers. It is but the fictitious story of the ancients'\n",
        "TRANSLATION_15": "We were promised that before, we and our ancestors—these are nothing but legends of the ancients.”\n",
        "TRANSLATION_16": "We have been promised this, we and our forefathers, before. This is not but legends of the former peoples.\"\n",
        "TRANSLATION_17": "[27:68] Already we and our fathers have been promised this before. [But] these are just the [legendary] fables of the ancients’ (asātīr is the plural of ustūra, meaning ‘what has been written down [mā sutira] of lies’).\n",
        "TRANSLATION_18": "(We were promised this) which you are promising us, (forsooth, we and our fathers) before us. ((All) this) which you are promising us, Muhammad, (is naught but fables) tales (of the men of old.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "27:68",
            "23:83",
            "8:31",
            "15:10",
            "37:71",
            "46:17",
            "26:26",
            "44:8",
            "16:24",
            "25:5"
        ],
        "BIBLE": [
            "prophets:jeremiah:44:20",
            "prophets:i%20kings:12:13",
            "torah:deuteronomy:22:16",
            "prophets:i%20kings:8:56",
            "writings:psalms:115:16",
            "prophets:ezekiel:36:28",
            "writings:ecclesiastes:6:10",
            "prophets:isaiah:55:4",
            "torah:deuteronomy:26:15",
            "torah:genesis:20:16"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:3:4",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:7"
        ]
    }
}