{
    "VERSE": "27:69",
    "ARABIC": "قُلْ سِيرُوا۟ فِى ٱلْأَرْضِ فَٱنظُرُوا۟ كَيْفَ كَانَ عَٰقِبَةُ ٱلْمُجْرِمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Say: 'Travel about the earth and see the final fate of the evildoers.'",
        "TRANSLATION_1": "Say: \"Travel in the land and see how (bad) was the end of sinners.\"\n",
        "TRANSLATION_2": "Say: \"Go about through the earth and see what has been the end of the evil-doers.\"\n",
        "TRANSLATION_3": "Say, \"Travel through the land and see how terrible was the end of the criminal ones\".\n",
        "TRANSLATION_4": "“Proclaim, (O dear Prophet Mohammed – peace and blessings be upon him), “Travel in the land and see what sort of fate befell the guilty.”\n",
        "TRANSLATION_5": "Say to them: \"Travel in the land and see how has been the end of the criminals.\"\n",
        "TRANSLATION_6": "Say: Travel in the earth, then see how was the end of the guilty.\n",
        "TRANSLATION_7": "Say: 'Journey in the land, then behold how was the end of the sinners.'\n",
        "TRANSLATION_8": "Say (unto them, O Muhammad): Travel in the land and see the nature of the sequel for the guilty!\n",
        "TRANSLATION_9": "Say, \"Roam across the earth and observe what was the end of the sinful ones.\"\n",
        "TRANSLATION_10": "Say thou: travel in the land and behold what like hath been the end of the culprits.\n",
        "TRANSLATION_11": "Say, ‘Travel over the land and observe how was the fate of the guilty.’\n",
        "TRANSLATION_12": "Say: \"Go ye through the earth and see what has been the end of those guilty (of sin).\"\n",
        "TRANSLATION_13": "Say to them (O Muhammad SAW) \"Travel in the land and see how has been the end of the criminals (those who denied Allah's Messengers and disobeyed Allah).\"\n",
        "TRANSLATION_14": "Say: 'Journey in the land and see what was the end of the sinners'\n",
        "TRANSLATION_15": "Say, travel through the earth, and observe the fate of the guilty.”\n",
        "TRANSLATION_16": "Say, [O Muhammad], \"Travel through the land and observe how was the end of the criminals.\"\n",
        "TRANSLATION_17": "[27:69] Say: ‘Travel in the land and see how was the sequel for the criminals’, because of their denials — and this [sequel] is that they were destroyed with punishment.\n",
        "TRANSLATION_18": "Say) Muhammad, to the people of Mecca: (Travel in the land and see) and take admonition from (the nature of the sequel for the guilty) how was the end of the idolaters!\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "27:69",
            "6:11",
            "30:42",
            "3:137",
            "88:20",
            "37:73",
            "43:25",
            "47:10",
            "10:14",
            "7:129"
        ],
        "BIBLE": [
            "prophets:isaiah:62:11",
            "prophets:ii%20samuel:24:8",
            "writings:ezra:9:11",
            "prophets:jeremiah:14:18",
            "prophets:jeremiah:12:12",
            "prophets:jeremiah:16:19",
            "prophets:i%20kings:22:13",
            "torah:exodus:8:18",
            "writings:psalms:48:11",
            "prophets:ii%20samuel:7:23"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:3:7",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:3:2"
        ]
    }
}