{
    "VERSE": "27:70",
    "ARABIC": "وَلَا تَحْزَنْ عَلَيْهِمْ وَلَا تَكُن فِى ضَيْقٍ مِّمَّا يَمْكُرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Do not grieve over them and do not let the plots they make distress you.",
        "TRANSLATION_1": "Do not grieve over them, and do not be distressed by what they contrive.\n",
        "TRANSLATION_2": "(O Prophet), do not grieve over them, nor be distressed at their designs.\n",
        "TRANSLATION_3": "(Muhammad), do not be grieved (about their disbelief) nor distressed about their evil plans against you.\n",
        "TRANSLATION_4": "And do not grieve upon them, nor be distressed because of their scheming.\n",
        "TRANSLATION_5": "And grieve you not over them, nor be straitened (in distress) because of what they plot.\n",
        "TRANSLATION_6": "And grieve not for them and be not distressed because of what they plan.\n",
        "TRANSLATION_7": "Do not sorrow for them, nor be thou straitened for what they devise.\n",
        "TRANSLATION_8": "And grieve thou not for them, nor be in distress because of what they plot (against thee).\n",
        "TRANSLATION_9": "Do not grieve over them, nor feel distressed at their schemes.\n",
        "TRANSLATION_10": "And grieve thou not over them nor be straitened because of that which they plot.\n",
        "TRANSLATION_11": "Do not grieve for them, and do not be upset by their guile.\n",
        "TRANSLATION_12": "But grieve not over them, nor distress thyself because of their plots.\n",
        "TRANSLATION_13": "And grieve you not for them, nor be straitened (in distress) because of what they plot.\n",
        "TRANSLATION_14": "Do not be sorry for them, nor be distressed for what they devise.\n",
        "TRANSLATION_15": "But do not grieve over them, and do not be troubled by what they plot.\n",
        "TRANSLATION_16": "And grieve not over them or be in distress from what they conspire.\n",
        "TRANSLATION_17": "[27:70] And do not grieve for them, and do not be distressed by their schemes — this is meant to comfort the Prophet (s), in other words, do not be concerned with their plotting against you, for We will grant you victory over them.\n",
        "TRANSLATION_18": "(And grieve thou not) Muhammad (for them) if they do not believe; it is also said that this means: do not grieve for their destruction, (nor be in distress because of what they plot (against you)) and do not be grieved because of what they do and say against you.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "27:70",
            "16:127",
            "83:33",
            "21:23",
            "27:85",
            "109:5",
            "109:3",
            "43:75",
            "51:45",
            "109:4"
        ],
        "BIBLE": [
            "writings:psalms:25:17",
            "prophets:micah:2:7",
            "prophets:ii%20samuel:7:29",
            "writings:psalms:4:2",
            "writings:proverbs:6:3",
            "writings:psalms:10:1",
            "writings:psalms:89:47",
            "writings:lamentations:2:20",
            "writings:nehemiah:13:26",
            "writings:psalms:139:21"
        ]
    }
}