{
    "VERSE": "27:72",
    "ARABIC": "قُلْ عَسَىٰٓ أَن يَكُونَ رَدِفَ لَكُم بَعْضُ ٱلَّذِى تَسْتَعْجِلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Say: 'It may well be that some of what you are anxious to hasten is right on your heels.'",
        "TRANSLATION_1": "Say: \"Perhaps some of what you wish to hasten is right behind you.\"\n",
        "TRANSLATION_2": "Say: \"The chastisement whose hastening you have been asking for, maybe a part of it has drawn quite near to you.\"\n",
        "TRANSLATION_3": "Say, \"Perhaps some of the things which you wish to experience immediately are very close to you.\"\n",
        "TRANSLATION_4": "Say, “It could be that a part of what you are impatient for is (already) after you.”\n",
        "TRANSLATION_5": "Say: \"Perhaps that which you wish to hasten on, may be close behind you.\"\n",
        "TRANSLATION_6": "Say: Maybe there may have drawn near to you somewhat of that which you seek to hasten on.\n",
        "TRANSLATION_7": "Say: 'It may be that riding behind you already is some part of that you seek to hasten on.\n",
        "TRANSLATION_8": "Say: It may be that a part of that which ye would hasten on is close behind you.\n",
        "TRANSLATION_9": "Say, \"It may be that a part of what you would hasten on is close behind you.\"\n",
        "TRANSLATION_10": "Say thou: belike close behind you may be some of that which ye would hasten on.\n",
        "TRANSLATION_11": "Say, ‘Perhaps there is right behind you some of what you seek to hasten.’\n",
        "TRANSLATION_12": "Say: \"It may be that some of the events which ye wish to hasten on may be (close) in your pursuit!\"\n",
        "TRANSLATION_13": "Say: \"Perhaps that which you wish to hasten on, may be close behind you.\n",
        "TRANSLATION_14": "Say: 'It may be that part of what you seek to hasten on is already riding behind you'\n",
        "TRANSLATION_15": "Say, “Perhaps some of what you are impatient for has drawn near.”\n",
        "TRANSLATION_16": "Say, \"Perhaps it is close behind you - some of that for which you are impatient.\n",
        "TRANSLATION_17": "[27:72] Say: ‘It may be that part of what you seek to hasten on is close behind you’ — so they were slain at Badr and the remaining chastisement will come to them after death.\n",
        "TRANSLATION_18": "(Say) to them, Muhammad: (It may be) and \"may be\" when it comes from Allah denotes necessity (that a part of that which ye would hasten on) of punishment at the Day of Badr (is close behind you) is coming soon.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "27:72",
            "37:50",
            "68:30",
            "37:27",
            "52:25",
            "6:129",
            "81:28",
            "23:36",
            "74:37",
            "47:26"
        ],
        "BIBLE": [
            "writings:proverbs:24:11",
            "writings:ecclesiastes:12:1",
            "prophets:jeremiah:31:3",
            "writings:ezra:9:1",
            "writings:psalms:74:11",
            "prophets:joshua:14:6",
            "writings:psalms:37:14",
            "writings:ruth:2:9",
            "prophets:i%20samuel:17:21",
            "prophets:joshua:8:6"
        ]
    }
}