{
    "VERSE": "27:73",
    "ARABIC": "وَإِنَّ رَبَّكَ لَذُو فَضْلٍ عَلَى ٱلنَّاسِ وَلَٰكِنَّ أَكْثَرَهُمْ لَا يَشْكُرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Allah shows favour to mankind but most of them are not thankful.",
        "TRANSLATION_1": "Verily your Lord is gracious to men, though most men are ungrateful.\n",
        "TRANSLATION_2": "Indeed Your Lord is exceedingly bountiful to mankind. Yet most of them do not give thanks.\n",
        "TRANSLATION_3": "Your Lord has many favors for mankind but most of them are ungrateful.\n",
        "TRANSLATION_4": "Indeed your Lord is Most Munificent upon mankind, but most men do not give thanks.\n",
        "TRANSLATION_5": "Verily, your Lord is full of grace for mankind, yet most of them do not give thanks.\n",
        "TRANSLATION_6": "And surely your Lord is the Lord of grace to men, but most of them are not grateful.\n",
        "TRANSLATION_7": "Surely thy Lord is bountiful to men; but most of them are not thankful.\n",
        "TRANSLATION_8": "Lo! thy Lord is full of bounty for mankind, but most of them do not give thanks.\n",
        "TRANSLATION_9": "Truly, your Lord is bountiful to mankind, but most of them are not grateful.\n",
        "TRANSLATION_10": "And verily thine Lord is full of grace for mankind, but most of them give not thanks.\n",
        "TRANSLATION_11": "Indeed your Lord is gracious to mankind, but most of them do not give thanks.\n",
        "TRANSLATION_12": "But verily thy Lord is full of grace to mankind: Yet most of them are ungrateful.\n",
        "TRANSLATION_13": "Verily, your Lord is full of Grace for mankind, yet most of them do not give thanks.\"\n",
        "TRANSLATION_14": "Surely, your Lord is bountiful to the people; yet most of them do not give thanks.\n",
        "TRANSLATION_15": "Your Lord is gracious towards humanity, but most of them are not thankful.\n",
        "TRANSLATION_16": "And indeed, your Lord is full of bounty for the people, but most of them do not show gratitude.\"\n",
        "TRANSLATION_17": "[27:73] And surely your Lord is bountiful to mankind, an example of which is His deferring chastisement for the disbelievers, but most of them are not thankful — disbelievers are not grateful for the deferring of chastisement since they reject [the fact] that it will ever come to pass.\n",
        "TRANSLATION_18": "(Lo! thy Lord) Muhammad (is full of bounty for mankind) for deferring His punishment, (but most of them do not give thanks) for the deferment of punishment.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "27:73",
            "34:36",
            "40:61",
            "10:60",
            "40:59",
            "12:103",
            "2:243",
            "13:1",
            "40:57",
            "12:38"
        ],
        "BIBLE": [
            "writings:psalms:75:2",
            "torah:genesis:13:13",
            "prophets:jonah:1:16",
            "prophets:jonah:1:10",
            "writings:proverbs:3:4",
            "writings:psalms:107:21",
            "writings:psalms:107:31",
            "writings:psalms:107:8",
            "writings:psalms:107:15",
            "writings:proverbs:29:26"
        ]
    }
}