{
    "VERSE": "27:74",
    "ARABIC": "وَإِنَّ رَبَّكَ لَيَعْلَمُ مَا تُكِنُّ صُدُورُهُمْ وَمَا يُعْلِنُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Certainly your Lord knows what their hearts keep hidden and what they divulge.",
        "TRANSLATION_1": "Verily your Lord knows what lies hidden in their breasts and what they disclose.\n",
        "TRANSLATION_2": "Verily your Lord knows all that their hearts conceal as well as all that they reveal.\n",
        "TRANSLATION_3": "Your Lord certainly knows whatever their hearts conceal or reveal.\n",
        "TRANSLATION_4": "And indeed your Lord knows what is hidden in their bosoms, and what they disclose.\n",
        "TRANSLATION_5": "And verily, your Lord knows what their breasts conceal and what they reveal.\n",
        "TRANSLATION_6": "And most surely your Lord knows what their breasts conceal and what they manifest.\n",
        "TRANSLATION_7": "Surely thy Lord knows what their hearts conceal, and what they publish.\n",
        "TRANSLATION_8": "Lo! thy Lord knoweth surely all that their bosoms hide, and all that they proclaim.\n",
        "TRANSLATION_9": "The Lord knows full well what they conceal in their hearts and what they disclose:\n",
        "TRANSLATION_10": "And verily thine Lord knoweth whatsoever their breasts conceal and whatsoever they make known.\n",
        "TRANSLATION_11": "Your Lord knows whatever their breasts conceal, and whatever they disclose.\n",
        "TRANSLATION_12": "And verily thy Lord knoweth all that their hearts do hide. As well as all that they reveal.\n",
        "TRANSLATION_13": "And verily, your Lord knows what their breasts conceal and what they reveal.\n",
        "TRANSLATION_14": "Surely, your Lord knows what they hide in their hearts and what they reveal.\n",
        "TRANSLATION_15": "And your Lord knows what their hearts conceal, and what they reveal.\n",
        "TRANSLATION_16": "And indeed, your Lord knows what their breasts conceal and what they declare.\n",
        "TRANSLATION_17": "[27:74] And surely your Lord knows what their hearts conceal, [what these] hide, and what they proclaim, by their tongues.\n",
        "TRANSLATION_18": "(Lo! thy Lord) Muhammad (knoweth surely all that their bosoms hide) of hatred and enmity, (and all that they proclaim) and all that they display of disbelief, idolatry and aggression.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "27:74",
            "28:69",
            "15:97",
            "20:25",
            "93:3",
            "43:14",
            "89:14",
            "43:49",
            "74:3",
            "36:16"
        ],
        "BIBLE": [
            "prophets:ii%20samuel:7:21",
            "writings:psalms:25:14",
            "writings:i%20chronicles:17:19",
            "writings:psalms:51:8",
            "torah:leviticus:5:26",
            "writings:proverbs:27:11",
            "writings:ii%20chronicles:29:10",
            "writings:psalms:89:2",
            "writings:proverbs:2:2",
            "prophets:ezekiel:38:23"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:1:12",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:6:2"
        ]
    }
}