{
    "VERSE": "27:79",
    "ARABIC": "فَتَوَكَّلْ عَلَى ٱللَّهِ إِنَّكَ عَلَى ٱلْحَقِّ ٱلْمُبِينِ",
    "ENGLISH": {
        "TRANSLATION_0": "So put your trust in Allah. You are clearly on a path of truth.",
        "TRANSLATION_1": "So you place your trust in God. Certainly you stand on positive truth.\n",
        "TRANSLATION_2": "So put your trust in Allah for you are on the manifest truth.\n",
        "TRANSLATION_3": "Trust in God for you follow the manifest truth.\n",
        "TRANSLATION_4": "Therefore rely on Allah; you are indeed upon the clear Truth.\n",
        "TRANSLATION_5": "So, put your trust in Allah; surely, you are on manifest truth.\n",
        "TRANSLATION_6": "Therefore rely on Allah; surely you are on the clear truth.\n",
        "TRANSLATION_7": "So put thy trust in God; thou art upon the manifest truth.\n",
        "TRANSLATION_8": "Therefor (O Muhammad) put thy trust in Allah, for thou (standest) on the plain Truth.\n",
        "TRANSLATION_9": "so put your trust in God. Surely you are on the path of manifest truth.\n",
        "TRANSLATION_10": "Wherefore put thy trust in Allah; verily thou art on manifest truth.\n",
        "TRANSLATION_11": "So put your trust in Allah, for you indeed stand on the manifest truth.\n",
        "TRANSLATION_12": "So put thy trust in Allah: for thou art on (the path of) manifest Truth.\n",
        "TRANSLATION_13": "So put your trust in Allah; surely, you (O Muhammad SAW) are on manifest truth.\n",
        "TRANSLATION_14": "Therefore put your trust in Allah, for you are upon a clear truth.\n",
        "TRANSLATION_15": "So rely on God. You are upon the clear truth.\n",
        "TRANSLATION_16": "So rely upon Allah; indeed, you are upon the clear truth.\n",
        "TRANSLATION_17": "[27:79] So rely on God, trust in Him, for you are indeed upon the manifest truth, [upon] the manifest religion: the sequel shall be in your favour, with victory over the disbelievers. God then draws comparisons between them and the dead, the deaf and the blind, saying:\n",
        "TRANSLATION_18": "(Therefore) Muhammad (put thy trust in Allah, for thou (standest) on the plain Truth) Islam.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "27:79",
            "2:252",
            "39:2",
            "30:60",
            "10:82",
            "40:77",
            "24:25",
            "64:13",
            "3:108",
            "45:6"
        ],
        "BIBLE": [
            "torah:deuteronomy:16:20",
            "prophets:joshua:14:9",
            "writings:psalms:71:5",
            "prophets:isaiah:45:15",
            "torah:genesis:24:8",
            "writings:psalms:119:151",
            "writings:ruth:1:16",
            "prophets:isaiah:37:20",
            "torah:exodus:21:23",
            "prophets:i%20samuel:19:3"
        ]
    }
}