{
    "VERSE": "27:88",
    "ARABIC": "وَتَرَى ٱلْجِبَالَ تَحْسَبُهَا جَامِدَةً وَهِىَ تَمُرُّ مَرَّ ٱلسَّحَابِ صُنْعَ ٱللَّهِ ٱلَّذِىٓ أَتْقَنَ كُلَّ شَىْءٍ إِنَّهُۥ خَبِيرٌۢ بِمَا تَفْعَلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "You will see the mountains you reckoned to be solid going past like clouds - the handiwork of Allah who gives to everything its solidity. He is aware of what you do.",
        "TRANSLATION_1": "You will see the mountains and think they are firmly planted, but they will pass away like flying clouds: Artistry of God who perfected everything. He is indeed fully aware of what you do.\n",
        "TRANSLATION_2": "You now see the mountains and consider them firmly fixed, but then they shall pass away even as clouds pass away. That will be the handiwork of Allah Who has created everything with perfect wisdom. He is well aware of what you do.\n",
        "TRANSLATION_3": "You think the mountains are solid. In fact, they move like clouds. It is God's technique which has established everything perfectly. He is well Aware of what you do.\n",
        "TRANSLATION_4": "And you will see the mountains presuming them fixed whereas they will be moving like the clouds; this is Allah’s making, Who created all things with wisdom; indeed He is Informed of what you do.\n",
        "TRANSLATION_5": "And you will see the mountains and think them solid, but they shall pass away as the passing away of the clouds. The work of Allah, Who perfected all things, verily, He is well-acquainted with what you do.\n",
        "TRANSLATION_6": "And you see the mountains, you think them to be solid, and they shall pass away as the passing away of the cloud-- the handiwork of Allah Who has made every thing thoroughly; surely He is Aware of what you do.\n",
        "TRANSLATION_7": "and thou shalt see the mountains, that thou supposest fixed, passing by like clouds -- God's handiwork, who has created everything very well. He is aware of the things you do.\n",
        "TRANSLATION_8": "And thou seest the hills thou deemest solid flying with the flight of clouds: the doing of Allah Who perfecteth all things. Lo! He is Informed of what ye do.\n",
        "TRANSLATION_9": "You see the mountains and think them firmly fixed. But they shall pass away as the clouds pass away. Such is the work of God, who has ordered all things to perfection: He is fully aware of what you do.\n",
        "TRANSLATION_10": "And thou shalt see the mountains thou deemest solid passing away as the passing away of the clouds: the handiwork of Allah Who hath perfected everything. Verily He is Aware of all that ye do.\n",
        "TRANSLATION_11": "You see the mountains, which you suppose, to be stationary, while they drift like passing clouds—the handiwork of Allah who has made everything faultless. He is indeed well aware of what you do.\n",
        "TRANSLATION_12": "Thou seest the mountains and thinkest them firmly fixed: but they shall pass away as the clouds pass away: (such is) the artistry of Allah, who disposes of all things in perfect order: for he is well acquainted with all that ye do.\n",
        "TRANSLATION_13": "And you will see the mountains and think them solid, but they shall pass away as the passing away of the clouds. The Work of Allah, Who perfected all things, verily! He is Well-Acquainted with what you do.\n",
        "TRANSLATION_14": "And you will see the mountains which you think to be firm pass by like clouds. (Such is the) making of Allah, who has created everything well. He is Aware of the things you do.\n",
        "TRANSLATION_15": "And you see the mountains, and imagine them fixed, yet they pass, as the passing of the clouds—the making of God, who has perfected everything. He is fully Informed of what you do.\n",
        "TRANSLATION_16": "And you see the mountains, thinking them rigid, while they will pass as the passing of clouds. [It is] the work of Allah, who perfected all things. Indeed, He is Acquainted with that which you do.\n",
        "TRANSLATION_17": "[27:88] And you see the mountains, you notice them, at the moment of the Blast, supposing them to be still, stationary in their place, because of their tremendous size, while they drift like passing clouds, [like the drifting of the] rain when it is blown around by the wind, in other words, they [the mountains] will be drifting in like manner until they [eventually] fall to the ground, whereby they are flattened before becoming like [tufts of] ‘wool’ [cf. Q. 101:5] and then ‘scattered dust’ [cf. Q. 56:6]. God’s handiwork (sun‘a, a verbal noun emphasising the import of the preceding sentence, and which has been annexed [in a genitive construction] to its agent [Allāhi, ‘God’] after the omission of its operator) Who has perfected everything, that He has made. Truly He is aware of what you do (taf‘alūna; or [read] yaf‘alūna, ‘[what] they do’), namely, His enemies, [what they do] in the way of disobedience, and His friends, in the way of obedience.\n",
        "TRANSLATION_18": "(And thou seest) Muhammad upon the first blow of the trumpet (the hills thou deemest solid) and still (flying with the flight of clouds) in the air: (the doing of Allah) this is the doing of Allah with His creation (Who perfecteth all things) of creation. (Lo! He is Informed) Aware (of what ye do) of good or evil.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "27:88",
            "4:32",
            "49:16",
            "29:62",
            "4:86",
            "40:20",
            "33:54",
            "13:8",
            "64:8",
            "31:29"
        ],
        "BIBLE": [
            "prophets:ii%20samuel:23:5",
            "torah:genesis:41:32",
            "torah:deuteronomy:30:1",
            "writings:psalms:40:6",
            "torah:deuteronomy:15:10",
            "prophets:jeremiah:5:19",
            "prophets:ezekiel:5:11",
            "torah:deuteronomy:4:25",
            "torah:exodus:34:10",
            "torah:genesis:19:17"
        ]
    }
}