{
    "VERSE": "27:89",
    "ARABIC": "مَن جَآءَ بِٱلْحَسَنَةِ فَلَهُۥ خَيْرٌ مِّنْهَا وَهُم مِّن فَزَعٍ يَوْمَئِذٍ ءَامِنُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Those who perform good actions will receive better than them and will be safe that Day from terror.",
        "TRANSLATION_1": "Whoever comes with good (deeds) will receive better than (what he had done), and be safe that day from terror.\n",
        "TRANSLATION_2": "Whosoever comes with good will receive a reward better than his deed, and they will be made secure from the terror of that Day.\n",
        "TRANSLATION_3": "Whoever does a good deed will receive a better reward than what he has done. He will be secure from the terror of the Day of Judgment.\n",
        "TRANSLATION_4": "Whoever brings a good deed – for him is a reward better than it; and they will be safe from the terror on that Day.\n",
        "TRANSLATION_5": "Whoever brings a good deed, will have better than its worth; and they will be safe from the terror on that Day.\n",
        "TRANSLATION_6": "Whoever brings good, he shall have better than it; and they shall be secure from terror on the day.\n",
        "TRANSLATION_7": "Whosoever comes with a good deed, he shall have better than it; and they shall be secure from terror that day.\n",
        "TRANSLATION_8": "Whoso bringeth a good deed will have better than its worth; and such are safe from fear that Day.\n",
        "TRANSLATION_9": "Whoever does a good deed, shall be rewarded with what is better, and will be secure from fear of that Day,\n",
        "TRANSLATION_10": "Whosoever will bring good shall have better than the worth thereof; and they from the terror of that Day will be secure.\n",
        "TRANSLATION_11": "Whoever brings virtue shall receive [a reward] better than it; and on that day they will be secure from terror.\n",
        "TRANSLATION_12": "If any do good, good will (accrue) to them therefrom; and they will be secure from terror that Day.\n",
        "TRANSLATION_13": "Whoever brings a good deed (i.e. Belief in the Oneness of Allah along with every deed of righteousness), will have better than its worth, and they will be safe from the terror on that Day.\n",
        "TRANSLATION_14": "Whosoever comes with a good deed shall have better than it, and shall be secure from the terrors of that Day.\n",
        "TRANSLATION_15": "Whoever brings a virtue will receive better than it—and they will be safe from the horrors of that Day.\n",
        "TRANSLATION_16": "Whoever comes [at Judgement] with a good deed will have better than it, and they, from the terror of that Day, will be safe.\n",
        "TRANSLATION_17": "[27:89] Whoever brings a good deed, namely, [the profession of] ‘there is no god but God’, on the Day of Resurrection, shall have good, [shall have] a reward, for it, because of it (this [khayrun] is not the comparative [‘better’], since there is no deed better [than a good deed]). In another verse [it is stated that] he shall have tenfold the like of it [Q. 6:160]; and they, namely, those who bring such [good deeds], shall   be secure from the terror of that day (min faza‘i yawmi’idhin, if read as a genitive annexation; or min faza‘in yawma’idhin, ‘from terror on that day’).\n",
        "TRANSLATION_18": "(Whoso bringeth a good deed) whoever comes on the Day of Judgement with \"there is no god save Allah\" sincerely believing in it (will have better than its worth) all his goodness derives from it; (and such are safe from fear that Day) they are safe from fear and torment when the Fire is closed.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "27:89",
            "28:84",
            "25:24",
            "92:9",
            "92:6",
            "17:35",
            "16:126",
            "70:21",
            "55:70",
            "23:61"
        ],
        "BIBLE": [
            "prophets:jeremiah:51:47",
            "prophets:jeremiah:51:52",
            "torah:leviticus:23:27",
            "prophets:zechariah:8:8",
            "torah:leviticus:23:15",
            "writings:ecclesiastes:12:14",
            "torah:deuteronomy:17:9",
            "prophets:hosea:3:5",
            "torah:deuteronomy:6:24",
            "torah:numbers:24:14"
        ]
    }
}