{
    "VERSE": "27:9",
    "ARABIC": "يَٰمُوسَىٰٓ إِنَّهُۥٓ أَنَا ٱللَّهُ ٱلْعَزِيزُ ٱلْحَكِيمُ",
    "ENGLISH": {
        "TRANSLATION_0": "Musa, I am Allah, the Almighty, the All-Wise.",
        "TRANSLATION_1": "O Moses, I am that God, the mighty and all-wise.\n",
        "TRANSLATION_2": "O Moses, verily this is Me, Allah, the All-Mighty, the All-Wise!\n",
        "TRANSLATION_3": "Moses, I am God, the Majestic and All-wise.\n",
        "TRANSLATION_4": "“O Moosa, I am indeed, in truth, Allah the Almighty, the Wise.”\n",
        "TRANSLATION_5": "O Musa! Verily, it is I, Allah, the All-Mighty, the All-Wise.\"\n",
        "TRANSLATION_6": "O Musa! surely I am Allah, the Mighty, the Wise;\n",
        "TRANSLATION_7": "Moses, behold, it is I, God, the All-mighty, the All-wise.\n",
        "TRANSLATION_8": "O Moses! Lo! it is I, Allah, the Mighty, the Wise.\n",
        "TRANSLATION_9": "O Moses, I am God, the Powerful, the Wise.\n",
        "TRANSLATION_10": "O Musa! verily it is I, Allah, the Mighty the Wise!\n",
        "TRANSLATION_11": "‘O Moses! Indeed I am Allah, the All-mighty, the All-wise.’\n",
        "TRANSLATION_12": "O Moses! verily, I am Allah, the exalted in might, the wise!....\n",
        "TRANSLATION_13": "O Musa (Moses)! Verily! It is I, Allah, the All-Mighty, the All-Wise.\n",
        "TRANSLATION_14": "Moses, it is I, Allah, the Almighty, the Wise.\n",
        "TRANSLATION_15": "O Moses, it is I, God, the Almighty, the Wise.\n",
        "TRANSLATION_16": "O Moses, indeed it is I - Allah, the Exalted in Might, the Wise.\"\n",
        "TRANSLATION_17": "[27:9] O Moses, lo!, in other words, the fact is that, it is I, God, the Mighty, the Wise.\n",
        "TRANSLATION_18": "(0 Moses! Lo! it is I) Who is calling you, (Allah, the Mighty) in retribution against those who do not believe in Me, (the Wise) in My command and judgement, I command that none should be worshipped besides Me.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "27:9",
            "4:158",
            "45:2",
            "46:2",
            "39:1",
            "29:42",
            "44:42",
            "31:9",
            "34:27",
            "3:62"
        ],
        "BIBLE": [
            "prophets:isaiah:25:1",
            "writings:psalms:57:12",
            "writings:psalms:57:6",
            "writings:psalms:108:6",
            "writings:psalms:21:14",
            "prophets:isaiah:45:15",
            "writings:psalms:54:3",
            "writings:job:36:22",
            "prophets:ezekiel:23:22",
            "writings:job:36:5"
        ]
    }
}