{
    "VERSE": "12:1",
    "ARABIC": "بِسْمِ ٱللَّهِ ٱلرَّحْمَٰنِ ٱلرَّحِيمِ الٓر تِلْكَ ءَايَٰتُ ٱلْكِتَٰبِ ٱلْمُبِينِ",
    "ENGLISH": {
        "TRANSLATION_0": "Alif Lam Ra Those are the Signs of the Clear Book.",
        "TRANSLATION_1": "ALIF LAM RA. These are the verses of the immaculate Book.\n",
        "TRANSLATION_2": "Alif. Lam. Ra'. These are the verses of a Book that clearly expounds the truth.\n",
        "TRANSLATION_3": "Alif. Lam. Ra. These are the verses of the illustrious Book.\n",
        "TRANSLATION_4": "Alif-Lam-Ra*; these are verses of the clear Book. (* Alphabets of the Arabic language; Allah and to whomever He reveals, know their precise meanings.)\n",
        "TRANSLATION_5": "Alif-Lam-Ra. These are the verses of the Book that is clear.\n",
        "TRANSLATION_6": "Alif Lam Ra. These are the verses of the Book that makes (things) manifest.\n",
        "TRANSLATION_7": "Alif Lam Ra. Those are the signs of the Manifest Book.\n",
        "TRANSLATION_8": "Alif. Lam. Ra. These are verse of the Scripture that maketh plain.\n",
        "TRANSLATION_9": "Alif Lam Ra. These are verses from the clear Book.\n",
        "TRANSLATION_10": "Alif. Lam. Ra. These are the verses of a Book luminous.\n",
        "TRANSLATION_11": "Aif, Lam, Ra. These are the signs of the Manifest Book.\n",
        "TRANSLATION_12": "A. L. R. These are the symbols (or Verses) of the perspicuous Book.\n",
        "TRANSLATION_13": "Alif-Lam-Ra. [These letters are one of the miracles of the Quran, and none but Allah (Alone) knows their meanings]. These are the Verses of the Clear Book (the Quran that makes clear the legal and illegal things, legal laws, a guidance and a blessing).\n",
        "TRANSLATION_14": "AlifLaamRa. Those are the verses of the Clear Book.\n",
        "TRANSLATION_15": "Alif, Lam, Ra. These are the Verses of the Clear Book.\n",
        "TRANSLATION_16": "Alif, Lam, Ra. These are the verses of the clear Book.\n",
        "TRANSLATION_17": "[12:1] Alif lām rā’: God knows best what He means by these [letters]. Those, verses, are the verses of the Book, the Qur’ān (the genitive annexation carries the meaning of [partitive] min, ‘from’) that makes plain, the one that manifests truth [distinguishing it] from what is falsehood.\n",
        "TRANSLATION_18": "And from his own narration on the authority of Ibn 'Abbas that he said in the explanation of the saying of Allah, Exalted is He, (Alif. Lam. Ra.): '(Alif. Lam. Ra.) Allah says: I am Allah, I see what you do and what you say. That which Muhammad (pbuh) recites unto you is My speech; it is also said that (Alif. Lam. Ra.) is an oath that Allah swore by. (These are verses of the Scripture that maketh plain) this surah, or verses of the Qur'an, expounds the lawful and unlawful, the commands and prohibitions.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "12:1",
            "26:2",
            "28:2",
            "10:1",
            "31:2",
            "15:1",
            "27:1",
            "29:47",
            "43:2",
            "44:2"
        ],
        "BIBLE": [
            "torah:exodus:18:16",
            "writings:job:13:23",
            "writings:proverbs:22:21",
            "prophets:ii%20samuel:7:21",
            "prophets:nahum:3:6",
            "prophets:isaiah:43:19",
            "writings:psalms:25:14",
            "writings:daniel:5:15",
            "writings:psalms:89:2",
            "writings:psalms:51:8"
        ]
    }
}