{
    "VERSE": "12:107",
    "ARABIC": "أَفَأَمِنُوٓا۟ أَن تَأْتِيَهُمْ غَٰشِيَةٌ مِّنْ عَذَابِ ٱللَّهِ أَوْ تَأْتِيَهُمُ ٱلسَّاعَةُ بَغْتَةً وَهُمْ لَا يَشْعُرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Do they feel secure that the all-enveloping punishment of Allah will not come upon them, or that the Last Hour will not come upon them all of a sudden when they least expect it?",
        "TRANSLATION_1": "Do they really believe that an all-embracing punishment of God will not come upon them, or the Day of Doom overtake them suddenly while they remain unaware?\n",
        "TRANSLATION_2": "Do they, then, feel secure that an overwhelming chastisement shall not visit them, and the Hour shall not suddenly come upon them without their even perceiving it?\n",
        "TRANSLATION_3": "Do they feel safe from God's overwhelming torment or of the sudden approach of the Day of Judgment while they are unaware?\n",
        "TRANSLATION_4": "Do they remain complacent over Allah’s punishment coming and surrounding them, or the Last Day coming suddenly upon them whilst they are unaware?\n",
        "TRANSLATION_5": "Do they then feel secure from the coming against them of the covering veil of the torment of Allah, or of the coming against them of the (Final) Hour, all of a sudden while they perceive not\n",
        "TRANSLATION_6": "Do they then feel secure that there may come to them an extensive chastisement from Allah or (that) the hour may come to them suddenly while they do not perceive?\n",
        "TRANSLATION_7": "Do they feel secure that there shall come upon them no enveloping of the chastisement of God, or that the Hour shall not come upon them suddenly when they are unaware?\n",
        "TRANSLATION_8": "Deem they themselves secure from the coming on them of a pall of Allah's punishment, or the coming of the Hour suddenly while they are unaware?\n",
        "TRANSLATION_9": "Do they feel secure that the all-encompassing punishment of God will not come upon them, or that the Last Hour will not come upon them suddenly when they least expect it?\n",
        "TRANSLATION_10": "Are they secure then against this, that there may come upon them an overwhelming of Allah's torment, or that there may come upon them the Hour on a sudden while they percieve not?\n",
        "TRANSLATION_11": "Do they feel secure from being overtaken by a blanket punishment from Allah, or being overtaken by the Hour, suddenly, while they are unaware?\n",
        "TRANSLATION_12": "Do they then feel secure from the coming against them of the covering veil of the wrath of Allah,- or of the coming against them of the (final) Hour all of a sudden while they perceive not?\n",
        "TRANSLATION_13": "Do they then feel secure from the coming against them of the covering veil of the Torment of Allah, or of the coming against them of the (Final) Hour, all of a sudden while they perceive not?\n",
        "TRANSLATION_14": "Do they feel secure that the punishment of Allah will envelop them, or that the Hour will overtake them suddenly when they are unaware?\n",
        "TRANSLATION_15": "Do they feel secure that a covering of God’s punishment will not come upon them, or that the Hour will not come upon them suddenly, while they are unaware?\n",
        "TRANSLATION_16": "Then do they feel secure that there will not come to them an overwhelming [aspect] of the punishment of Allah or that the Hour will not come upon them suddenly while they do not perceive?\n",
        "TRANSLATION_17": "[12:107] Do they deem themselves secure from the coming upon them of a pall, a calamity enveloping them, of God’s chastisement, or the coming of the Hour upon them suddenly, while they are unaware?, of the time of its arrival beforehand?\n",
        "TRANSLATION_18": "(Deem they) i.e. the people of Mecca (themselves secure from the coming on them of a pall of Allah's punishment) such as the punishment they were exposed to on the Day of Badr, (or the coming of the Hour) or that the punishment of the Hour seizes them (suddenly while they are unaware) of the descent of punishment?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "12:107",
            "43:66",
            "16:45",
            "6:40",
            "6:47",
            "29:53",
            "22:55",
            "39:55",
            "58:14",
            "40:45"
        ],
        "BIBLE": [
            "prophets:ezekiel:38:16",
            "torah:numbers:9:15",
            "writings:psalms:46:6",
            "torah:genesis:38:14",
            "torah:numbers:4:20",
            "torah:deuteronomy:28:15",
            "torah:deuteronomy:31:17",
            "torah:numbers:24:14",
            "torah:numbers:4:15",
            "prophets:jeremiah:3:25"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:6:1"
        ]
    }
}