{
    "VERSE": "12:11",
    "ARABIC": "قَالُوا۟ يَٰٓأَبَانَا مَا لَكَ لَا تَأْمَ۫نَّا عَلَىٰ يُوسُفَ وَإِنَّا لَهُۥ لَنَٰصِحُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "They said, 'Our father! What is wrong with you that you refuse to trust us with Yusuf when in truth we only wish him well?",
        "TRANSLATION_1": "(Then going to their father) they said: \"O father, why don't you trust us with Joseph? We are in fact his well-wishers.\n",
        "TRANSLATION_2": "After so deciding they said to their father: \"Why is it that you do not trust us regarding Joseph although we are his true well-wishers?\"\n",
        "TRANSLATION_3": "Then they asked their father, \"Why do you not trust us with Joseph? We are his well-wishers.\n",
        "TRANSLATION_4": "They said, “O our father! What is the matter with you that you do not trust us with Yusuf, although we are in fact his well-wishers?”\n",
        "TRANSLATION_5": "They said: \"O our father! Why do you not trust us with Yusuf though we are indeed his well-wishers\"\n",
        "TRANSLATION_6": "They said: O our father! what reason have you that you do not trust in us with respect to Yusuf? And most surely we are his sincere well-wishers:\n",
        "TRANSLATION_7": "They said, 'Father, what ails thee, that thou trustest us not with Joseph? Surely we are his sincere well-wishers.\n",
        "TRANSLATION_8": "They said: O our father! Why wilt thou not trust us with Joseph, when lo! we are good friends to him?\n",
        "TRANSLATION_9": "They said to their father, \"Why do you not trust us with Joseph? We are indeed his well-wishers.\n",
        "TRANSLATION_10": "They said: our father! wherefore thou intrustest us not with Yusuf, whereas verily we are his well-wishers.\n",
        "TRANSLATION_11": "They said, ‘Father! Why is it that you do not trust us with Joseph? We are indeed his well-wishers.\n",
        "TRANSLATION_12": "They said: \"O our father! why dost thou not trust us with Joseph,- seeing we are indeed his sincere well-wishers?\n",
        "TRANSLATION_13": "They said: \"O our father! Why do you not trust us with Yusuf (Joseph), - when we are indeed his well-wishers?\"\n",
        "TRANSLATION_14": "They said: 'Father, what is the matter with you, do you not trust us with Joseph? Indeed, we are sincere advisors.\n",
        "TRANSLATION_15": "They said, “Father, why do you not trust us with Joseph, although we care for him?”\n",
        "TRANSLATION_16": "They said, \"O our father, why do you not entrust us with Joseph while indeed, we are to him sincere counselors?\n",
        "TRANSLATION_17": "[12:11] They said, ‘O father, what is wrong with you that you do not trust us with Joseph? We are indeed his wellwishers, we are indeed only looking out for his best interests.\n",
        "TRANSLATION_18": "Then they went to their father, (They said) to their father: (0 our father! Why wilt thou not trust us with Joseph, when lo! we are good friends to him) we will protect him?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "12:11",
            "12:97",
            "12:61",
            "21:53",
            "37:69",
            "19:42",
            "26:86",
            "12:81",
            "12:17",
            "23:95"
        ],
        "BIBLE": [
            "writings:i%20chronicles:29:10",
            "prophets:ii%20samuel:3:7",
            "torah:genesis:32:10",
            "prophets:i%20samuel:20:12",
            "writings:psalms:31:15",
            "prophets:i%20kings:19:4",
            "torah:exodus:18:17",
            "prophets:i%20samuel:29:6",
            "torah:genesis:44:4",
            "torah:genesis:47:1"
        ]
    }
}