{
    "VERSE": "12:12",
    "ARABIC": "أَرْسِلْهُ مَعَنَا غَدًا يَرْتَعْ وَيَلْعَبْ وَإِنَّا لَهُۥ لَحَٰفِظُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Why don't you send him out with us tomorrow so he can enjoy himself and play about? All of us will make sure that he is safe.'",
        "TRANSLATION_1": "Let him go out with us tomorrow that he may enjoy and play. We shall take care of him.\"\n",
        "TRANSLATION_2": "Send him out with us tomorrow that he may enjoy himself and play while we will be there, standing guard over him.\"\n",
        "TRANSLATION_3": "Send him with us tomorrow to play with us and enjoy himself. We shall carefully protect him\".\n",
        "TRANSLATION_4": "“Send him with us tomorrow so that he may eat some fruits and play, and indeed we are his protectors.”\n",
        "TRANSLATION_5": "Send him with us tomorrow to enjoy himself and play, and verily, we will take care of him.\"\n",
        "TRANSLATION_6": "Send him with us tomorrow that he may enjoy himself and sport, and surely we will guard him well.\n",
        "TRANSLATION_7": "Send him forth with us tomorrow, to frolic and play; surely we shall be watching over him.'\n",
        "TRANSLATION_8": "Send him with us to-morrow that he may enjoy himself and play. And lo! we shall take good care of him.\n",
        "TRANSLATION_9": "Send him with us tomorrow, so that he may play and enjoy himself. We will look after him.\"\n",
        "TRANSLATION_10": "Send him with us tomorrow, that he may refresh himself and play, and verily we are to be his guards.\n",
        "TRANSLATION_11": "Let him go with us tomorrow so that he may eat lots of fruits and play, and we will indeed take [good] care of him.’\n",
        "TRANSLATION_12": "Send him with us tomorrow to enjoy himself and play, and we shall take every care of him.\"\n",
        "TRANSLATION_13": "Send him with us tomorrow to enjoy himself and play, and verily, we will take care of him.\"\n",
        "TRANSLATION_14": "Send him with us tomorrow to frolic and play. We will look after him'\n",
        "TRANSLATION_15": "“Send him with us tomorrow, that he may roam and play; we will take care of him.”\n",
        "TRANSLATION_16": "Send him with us tomorrow that he may eat well and play. And indeed, we will be his guardians.\n",
        "TRANSLATION_17": "[12:12] Send him forth with us tomorrow, to the desert, to frolic and play (read [first person plural] narta‘ wa-nal‘ab, ‘that we might frolic and play’, or [third person plural] yarta‘ wa-yal‘ab, ‘that he might frolic and play’), in other words, so that we might be spirited and roam freely. Surely we shall take good care of him’.\n",
        "TRANSLATION_18": "(Send him with us tomorrow that he may enjoy himself) come, go and move about (and play) and have fun. (And lo! we shall take good care of him) we will be kind to him.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "12:12",
            "15:9",
            "18:23",
            "26:55",
            "69:49",
            "15:23",
            "37:137",
            "7:21",
            "71:9",
            "37:165"
        ],
        "BIBLE": [
            "prophets:i%20samuel:16:16",
            "writings:job:40:20",
            "writings:ii%20chronicles:23:13",
            "prophets:ezekiel:16:16",
            "prophets:habakkuk:2:1",
            "prophets:i%20samuel:20:12",
            "writings:song%20of%20songs:4:16",
            "prophets:judges:20:28",
            "prophets:zechariah:8:5",
            "torah:exodus:8:25"
        ]
    }
}