{
    "VERSE": "12:14",
    "ARABIC": "قَالُوا۟ لَئِنْ أَكَلَهُ ٱلذِّئْبُ وَنَحْنُ عُصْبَةٌ إِنَّآ إِذًا لَّخَٰسِرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "They said, 'If a wolf does come and eat him up when together we make up a powerful group in that case we would truly be in loss!'",
        "TRANSLATION_1": "They replied: \"If a wolf should devour him when we are there, a well-knit band, we shall certainly be treacherous.\"\n",
        "TRANSLATION_2": "They said: \"Should a wolf eat him, despite the presence of our strong group, we would indeed be a worthless lot!\"\n",
        "TRANSLATION_3": "They said, \"If some wild-beast would be able to harm him, despite the presence of our strong group, it would certainly be a great loss to us!\"\n",
        "TRANSLATION_4": "They said, “If the wolf devours him, whereas we are a group, then surely we are useless!”\n",
        "TRANSLATION_5": "They said: \"If a wolf devours him, while we are `Usbah (a group), then surely, we are the losers.\"\n",
        "TRANSLATION_6": "They said: Surely if the wolf should devour him notwithstanding that we are a (strong) company, we should then certainly be losers.\n",
        "TRANSLATION_7": "They said, 'If the wolf eats him, and we a band, then are we losers!'\n",
        "TRANSLATION_8": "They said: If the wolf should devour him when we are (so strong) a band, then surely we should have already perished.\n",
        "TRANSLATION_9": "They said, \"Surely, if the wolf devoured him while we were a strong party, we should indeed be great losers.\"\n",
        "TRANSLATION_10": "They said: if the wolf devoured him while we were a company, we must indeed then be the losers!\n",
        "TRANSLATION_11": "They said, ‘Should the wolf eat him while we are a hardy band, then we will indeed be losers!’\n",
        "TRANSLATION_12": "They said: \"If the wolf were to devour him while we are (so large) a party, then should we indeed (first) have perished ourselves!\"\n",
        "TRANSLATION_13": "They said: \"If a wolf devours him, while we are 'Usbah (a strong group) (to guard him), then surely, we are the losers.\"\n",
        "TRANSLATION_14": "They said: 'We are many, if a wolf devours him, then we are losers'\n",
        "TRANSLATION_15": "They said, “If the wolf ate him, and we are many, we would be good for nothing.”\n",
        "TRANSLATION_16": "They said, \"If a wolf should eat him while we are a [strong] clan, indeed, we would then be losers.\"\n",
        "TRANSLATION_17": "[12:14] They said, ‘Truly if (la-in: the lām here is for oaths) the wolf were to devour him, when we are [so hardy] a band, a group, then we indeed are losers!’, incapable [of anything]. Thus, he sent him off with them.\n",
        "TRANSLATION_18": "(They said) to their father: (If the wolf should devour him when we are (so strong) a band) ten of us, (then surely we should have already perished) we should be very weak; it is also said that this means: we should be really losers by neglecting the inviolability of our father and brother.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "12:14",
            "12:13",
            "26:40",
            "12:8",
            "15:23",
            "7:113",
            "37:165",
            "37:166",
            "37:127",
            "12:61"
        ],
        "BIBLE": [
            "torah:exodus:33:14",
            "prophets:jeremiah:24:3",
            "prophets:joshua:10:25",
            "prophets:ii%20kings:3:14",
            "prophets:jonah:1:10",
            "prophets:ezekiel:39:4",
            "writings:proverbs:25:7",
            "writings:i%20chronicles:28:20",
            "torah:numbers:23:19",
            "prophets:jeremiah:4:10"
        ]
    }
}