{
    "VERSE": "12:22",
    "ARABIC": "وَلَمَّا بَلَغَ أَشُدَّهُۥٓ ءَاتَيْنَٰهُ حُكْمًا وَعِلْمًا وَكَذَٰلِكَ نَجْزِى ٱلْمُحْسِنِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "And then when he became a full-grown man. We gave him knowledge and right judgement too. That is how We reward all doers of good.",
        "TRANSLATION_1": "When he reached the prime of life We gave him wisdom and knowledge. Thus We reward those who are good.\n",
        "TRANSLATION_2": "And when Joseph reached the age of maturity, We granted him judgement and knowledge. Thus do We reward those who do good.\n",
        "TRANSLATION_3": "When he attained maturity, God gave him strength, wisdom and knowledge. Thus, do We reward those who do good.\n",
        "TRANSLATION_4": "And when he matured to his full strength, We bestowed him wisdom and knowledge; and this is how We reward the virtuous.\n",
        "TRANSLATION_5": "And when he [Yusuf] attained his full manhood, We gave him wisdom and knowledge (the prophethood), thus We reward the doers of good.\n",
        "TRANSLATION_6": "And when he had attained his maturity, We gave him wisdom and knowledge: and thus do We reward those who do good.\n",
        "TRANSLATION_7": "And when he was fully grown, We gave him judgment and knowledge. Even so We recompense the good-doers.\n",
        "TRANSLATION_8": "And And when he reached his prime We gave him wisdom and knowledge. Thus We reward the good.\n",
        "TRANSLATION_9": "And when he reached maturity, We bestowed on him right judgement and knowledge. Thus We reward those who do good.\n",
        "TRANSLATION_10": "And when he reached his maturity We vouchsafed unto him judgement and knowledge; and Thus We recompense the well-doers.\n",
        "TRANSLATION_11": "When he came of age, We gave him judgement and [sacred] knowledge, and thus do We reward the virtuous.\n",
        "TRANSLATION_12": "When Joseph attained His full manhood, We gave him power and knowledge: thus do We reward those who do right.\n",
        "TRANSLATION_13": "And when he [Yusuf (Joseph)] attained his full manhood, We gave him wisdom and knowledge (the Prophethood), thus We reward the Muhsinun (doers of good - see V. 2:112).\n",
        "TRANSLATION_14": "And when he reached maturity, We bestowed on him judgment and knowledge. As such We recompense those who do good.\n",
        "TRANSLATION_15": "When he reached his maturity, We gave him wisdom and knowledge. We thus reward the righteous.\n",
        "TRANSLATION_16": "And when Joseph reached maturity, We gave him judgment and knowledge. And thus We reward the doers of good.\n",
        "TRANSLATION_17": "[12:22] And when he reached his prime — which was at 30 or 33 years of age — We gave him [power of] judgement, wisdom, and knowledge, understanding in [matters of] religion, before his call to prophethood. Thus, just as We rewarded him, We reward those who are virtuous, to [the good] of their souls.\n",
        "TRANSLATION_18": "(And when he reached his prime) between 18 and 30 years old (We gave him wisdom and knowledge) understanding and prophethood. (Thus We reward the good) in speech and works, in knowledge and wisdom.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "12:22",
            "28:14",
            "51:30",
            "13:37",
            "44:32",
            "27:42",
            "3:58",
            "43:20",
            "24:18",
            "21:79"
        ],
        "BIBLE": [
            "writings:daniel:2:37",
            "writings:ii%20chronicles:7:3",
            "torah:deuteronomy:26:11",
            "writings:daniel:7:22",
            "writings:ezra:5:3",
            "writings:psalms:72:1",
            "writings:ii%20chronicles:1:10",
            "prophets:i%20samuel:10:9",
            "torah:deuteronomy:1:3",
            "writings:daniel:2:23"
        ]
    }
}