{
    "VERSE": "12:28",
    "ARABIC": "فَلَمَّا رَءَا قَمِيصَهُۥ قُدَّ مِن دُبُرٍ قَالَ إِنَّهُۥ مِن كَيْدِكُنَّ إِنَّ كَيْدَكُنَّ عَظِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "He saw the shirt torn at the back and said, 'The source of this is women's deviousness. Without a doubt your guile is very great.",
        "TRANSLATION_1": "When the husband saw the shirt torn at the back, he said: \"Surely this is a woman's ruse, and the wiles of women are great.\n",
        "TRANSLATION_2": "So when the husband saw Joseph's shirt torn from behind he exclaimed: \"Surely, this is one of the tricks of you women; your tricks are indeed great.\n",
        "TRANSLATION_3": "When the master saw that Joseph's shirt was torn from behind, he told his wife, \"This is some of your womanly guile in which you are certainly skillful.\n",
        "TRANSLATION_4": "So when the governor saw his shirt torn from behind, he said, “Indeed this is a deception of women; undoubtedly the deception of women is very great.”\n",
        "TRANSLATION_5": "So when he (her husband) saw his [Yusuf`s] shirt torn at the back, he (her husband) said: \"Surely, it is a plot of you women! Certainly mighty is your plot!\"\n",
        "TRANSLATION_6": "So when he saw his shirt rent from behind, he said: Surely it is a guile of you women; surely your guile is great:\n",
        "TRANSLATION_7": "When he saw his shirt was torn from behind he said, 'This is of your women's guile; surely your guile is great.\n",
        "TRANSLATION_8": "So when he saw his shirt torn from behind, he said: Lo! this is of the guile of you women. Lo! the guile of you is very great.\n",
        "TRANSLATION_9": "So when he saw his shirt torn from behind [her husband] said, \"This is the guile of you women. Your guile is great indeed.\n",
        "TRANSLATION_10": "So when he saw his shirt rent from behind, he said: verily it is of the guile of ye women; verily the guile of ye women is mighty.\n",
        "TRANSLATION_11": "So when he saw that his shirt was torn from behind, he said, ‘This is [a case] of you women’s guile! Your guile is indeed great!\n",
        "TRANSLATION_12": "So when he saw his shirt,- that it was torn at the back,- (her husband) said: \"Behold! It is a snare of you women! truly, mighty is your snare!\n",
        "TRANSLATION_13": "So when he (her husband) saw his [(Yusuf's (Joseph)] shirt torn at the back; (her husband) said: \"Surely, it is a plot of you women! Certainly mighty is your plot!\n",
        "TRANSLATION_14": "And when he saw his shirt torn at the back, he said: 'This is one of your (women's) guiles. Your guile, (O woman), is great indeed!\n",
        "TRANSLATION_15": "And when he saw that his shirt was torn from the back, he said, “This is a woman's scheme. Your scheming is serious indeed.”\n",
        "TRANSLATION_16": "So when her husband saw his shirt torn from the back, he said, \"Indeed, it is of the women's plan. Indeed, your plan is great.\n",
        "TRANSLATION_17": "[12:28] So when he, her husband, saw that his shirt was torn from behind, he said: ‘Indeed this — that is, your saying: ‘What is to be the requital of him who intends …’ to the end [of the verse, Q. 12:25] — is of the guile of you, O, women. Verily your guile is great.\n",
        "TRANSLATION_18": "245 (So when he saw his shirt torn from behind, he said) her brother said: (Lo! this is of the guile) the scheming and devising (of you women. Lo! the guile of you is very great) it touches the innocent and the sick.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "12:28",
            "12:27",
            "86:15",
            "12:34",
            "21:76",
            "20:60",
            "37:115",
            "26:189",
            "26:135",
            "37:76"
        ],
        "BIBLE": [
            "prophets:ezekiel:8:15",
            "torah:genesis:24:56",
            "prophets:i%20samuel:24:7",
            "torah:genesis:42:21",
            "prophets:judges:21:16",
            "torah:genesis:50:15",
            "torah:genesis:40:16",
            "prophets:judges:14:2",
            "prophets:judges:19:23",
            "prophets:judges:13:22"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:3:1",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:2:1"
        ]
    }
}