{
    "VERSE": "12:31",
    "ARABIC": "فَلَمَّا سَمِعَتْ بِمَكْرِهِنَّ أَرْسَلَتْ إِلَيْهِنَّ وَأَعْتَدَتْ لَهُنَّ مُتَّكَـًٔا وَءَاتَتْ كُلَّ وَٰحِدَةٍ مِّنْهُنَّ سِكِّينًا وَقَالَتِ ٱخْرُجْ عَلَيْهِنَّ فَلَمَّا رَأَيْنَهُۥٓ أَكْبَرْنَهُۥ وَقَطَّعْنَ أَيْدِيَهُنَّ وَقُلْنَ حَٰشَ لِلَّهِ مَا هَٰذَا بَشَرًا إِنْ هَٰذَآ إِلَّا مَلَكٌ كَرِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "But when she heard of their malicious talk, she sent for them and made a sumptuous meal and then she gave a knife to each of them. She said, 'Go out to them.' When they saw him, they were amazed by him and cut their hands. They said, 'Allah preserve us! This is no man. What can this be but a noble angel here!'",
        "TRANSLATION_1": "When she heard their slanderings, she sent for them and prepared a banquet, and gave each of them a knife (for paring fruit), and called (to Joseph): \"Come out before them.\" When they saw him, the women were so wonderstruck they cut their hands, and exclaimed: \"O Lord preserve us! He is no mortal but an honourable angel.\"\n",
        "TRANSLATION_2": "Hearing of their sly talk the chief's wife sent for those ladies, and arranged for them a banquet, and got ready couches, and gave each guest a knife. Then, while they were cutting and eating the fruit, she signalled Joseph: \"Come out to them.\" When the ladies saw him they were so struck with admiration that they cut their hands, exclaiming: \"Allah preserve us. This is no mortal human. This is nothing but a noble angel!\"\n",
        "TRANSLATION_3": "When she heard their gossiping, she invited them to her house for a banquet and gave a knife to each of them. Then she told Joseph to appear before them. When they saw Joseph, they were so amazed that they cut their hands and said, \"Goodness gracious! He is not a mortal but is a charming angel!\"\n",
        "TRANSLATION_4": "And when she heard of their secret talk, she sent for them and prepared cushioned mattresses for them and gave a knife to each one of them and said to Yusuf, “Come out before them!” When the women saw him they praised him and cut their hands, and said, “Purity is to Allah – this is no human being; this is not but an honourable angel!”\n",
        "TRANSLATION_5": "So when she heard of their accusation, she sent for them and prepared a banquet for them; she gave each one of them a knife, and she said [to Yusuf]: \"Come out before them.\" Then, when they saw him, they exalted him (at his beauty) and (in their astonishment) cut their hands. They said: \"How perfect is Allah! No man is this! This is none other than a noble angel!\"\n",
        "TRANSLATION_6": "So when she heard of their sly talk she sent for them and prepared for them a repast, and gave each of them a knife, and said (to Yusuf): Come forth to them. So when they saw him, they deemed him great, and cut their hands (in amazement), and said: Remote is Allah (from imperfection); this is not a mortal; this is but a noble angel.\n",
        "TRANSLATION_7": "When she heard their sly whispers, she sent to them, and made ready for them a repast, then she gave to each one of them a knife. 'Come forth, attend to them,' she said. And when they saw him, they so admired him that they cut their hands, saying, 'God save us! This is no mortal; he is no other but a noble angel.'\n",
        "TRANSLATION_8": "And when she heard of their sly talk, she sent to them and prepared for them a cushioned couch (to lie on at the feast) and gave to every one of them a knife and said (to Joseph): Come out unto them! And when they saw him they exalted him and cut their hands, exclaiming: Allah Blameless! This is no a human being. This is not other than some gracious angel.\n",
        "TRANSLATION_9": "When she heard of their intrigues, she sent for them and prepared a party for them. She gave a knife to each of them [to cut fruits, etc.] and then asked Joseph to appear before them. When the women saw him, they were greatly amazed [at his beauty], and they cut their hands, exclaiming, \"God preserve us! This is no human being but a noble angel!\"\n",
        "TRANSLATION_10": "Then, when she heard of their cunning talk, she sent unto them a messenger, and got ready for them a cushioned Couch, and gave a knife to each of them. And she said: come forth to them. Then when they saw him, they were astonished at him, and they made a cut in their hands, and said: how perfect is God! no man is he: he is naught but an angel noble.\n",
        "TRANSLATION_11": "When she heard of their machinations, she sent for them and arranged a repast, and gave each of them a knife, and said [to Joseph], ‘Come out before them.’ So when they saw him, they marvelled at him and cut their hands [absent-mindedly], and they said, ‘Good heavens! This is not a human being! This is but a noble angel!’\n",
        "TRANSLATION_12": "When she heard of their malicious talk, she sent for them and prepared a banquet for them: she gave each of them a knife: and she said (to Joseph), \"Come out before them.\" When they saw him, they did extol him, and (in their amazement) cut their hands: they said, \"Allah preserve us! no mortal is this! this is none other than a noble angel!\"\n",
        "TRANSLATION_13": "So when she heard of their accusation, she sent for them and prepared a banquet for them; she gave each one of them a knife (to cut the foodstuff with), and she said [(to Yusuf (Joseph)]: \"Come out before them.\" Then, when they saw him, they exalted him (at his beauty) and (in their astonishment) cut their hands. They said: \"How perfect is Allah (or Allah forbid)! No man is this! This is none other than a noble angel!\"\n",
        "TRANSLATION_14": "When she heard of their sly whispers, she sent for them and prepared a banquet. To each she gave a knife, (then called Joseph saying:) 'Come and attend to them' When they saw him, they were so taken with him that they cut their hands, and said: 'Allah save us! This is no mortal, he is no other but a noble angel'\n",
        "TRANSLATION_15": "And when she heard of their gossip, she invited them, and prepared for them a banquet, and she gave each one of them a knife. She said, “Come out before them.” And when they saw him, they marveled at him, and cut their hands. They said, “Good God, this is not a human, this must be a precious angel.”\n",
        "TRANSLATION_16": "So when she heard of their scheming, she sent for them and prepared for them a banquet and gave each one of them a knife and said [to Joseph], \"Come out before them.\" And when they saw him, they greatly admired him and cut their hands and said, \"Perfect is Allah! This is not a man; this is none but a noble angel.\"\n",
        "TRANSLATION_17": "[12:31] And when she heard of their machinations, their backbiting of her, she sent for them and prepared for them a repast (muttaka’ is food that requires cutting with a knife, since one leans upon it (ittikā’): this [repast] was utruj, ‘citron’). She then gave each one of them a knife and said, to Joseph: ‘Come out before them!’ And when they saw him, they were in awe of, they exalted, him and cut their hands, with the knives, without feeling any pain, because their hearts were so engrossed by Joseph, and they exclaimed: ‘God preserve us! — in exaltation of him — This, namely, Joseph, is no human being: this is but a noble angel!’, on account of his all-encompassing beauty, which is [a characteristic] not usually found among humankind. In the Sahīh [of al-Bukhārī], it is [reported] that one half of all beauty was given to him.\n",
        "TRANSLATION_18": "(And when she heard of their sly talk, she sent to them) an invitation (and prepared for them a cushioned couch) to lie on and then she had meat and bread brought to them (and gave to every one of them a knife) for they did not eat of meat except that which they could cut with their knives (and said) Zelicha said to Joseph: (Come out unto them!) Joseph! (And when they saw him they exalted him and cut their hands, exclaiming: Allah Blameless!) Allah forbid! (This is not a human being. This is no other than some gracious angel) gracious in the sight of his Lord.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "12:31",
            "34:47",
            "36:83",
            "40:84",
            "41:6",
            "23:24",
            "12:67",
            "23:88",
            "4:62",
            "19:49"
        ],
        "BIBLE": [
            "prophets:judges:16:18",
            "prophets:ezekiel:11:15",
            "prophets:judges:15:18",
            "prophets:ii%20samuel:24:17",
            "torah:deuteronomy:26:13",
            "torah:genesis:31:42",
            "prophets:i%20samuel:11:7",
            "prophets:ii%20samuel:9:9",
            "prophets:isaiah:65:1",
            "writings:i%20chronicles:29:8"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:1"
        ]
    }
}