{
    "VERSE": "12:35",
    "ARABIC": "ثُمَّ بَدَا لَهُم مِّنۢ بَعْدِ مَا رَأَوُا۟ ٱلْءَايَٰتِ لَيَسْجُنُنَّهُۥ حَتَّىٰ حِينٍ",
    "ENGLISH": {
        "TRANSLATION_0": "Then, after they had seen the Signs, they thought that they should still imprison him for a time.",
        "TRANSLATION_1": "And yet in spite of having seen these clear proofs they found it proper to incarcerate him for a time.\n",
        "TRANSLATION_2": "Then it occurred to them to cast Joseph into prison for a while even though they had seen clear signs (of Joseph's innocence and of the evil ways of their ladies).\n",
        "TRANSLATION_3": "Even after Joseph had been found innocent of any crime, the King and his people decided to imprison him for an appointed time (so that people would forget the incident).\n",
        "TRANSLATION_4": "Then after having seeing all the signs, they all decided that he should be imprisoned for some time.\n",
        "TRANSLATION_5": "Then it occurred to them, after they had seen the proofs (of his innocence), to imprison him for a time.\n",
        "TRANSLATION_6": "Then it occurred to them after they had seen the signs that they should imprison him till a time.\n",
        "TRANSLATION_7": "Then it seemed good to them, after they had seen the signs, that they should imprison him for a while.\n",
        "TRANSLATION_8": "And it seemed good to them (the men-folk) after they had seen the signs (of his innocence) to imprison him for a time.\n",
        "TRANSLATION_9": "Yet, even after all the evidence they had seen, they thought it right to jail him for a time.\n",
        "TRANSLATION_10": "Thereafter it occurred to them even after they had, the signs, to imprison him for a season.\n",
        "TRANSLATION_11": "Then it appeared to them, after they had seen all the signs [of his innocence], that they should confine him for some time.\n",
        "TRANSLATION_12": "Then it occurred to the men, after they had seen the signs, (that it was best) to imprison him for a time.\n",
        "TRANSLATION_13": "Then it appeared to them, after they had seen the proofs (of his innocence) to imprison him for a time.\n",
        "TRANSLATION_14": "Then it seemed good to them, even after they had seen the signs, that they should imprison him for some time.\n",
        "TRANSLATION_15": "Then it occurred to them, after they had seen the signs, to imprison him for a while.\n",
        "TRANSLATION_16": "Then it appeared to them after they had seen the signs that al-'Azeez should surely imprison him for a time.\n",
        "TRANSLATION_17": "[12:35] Then it seemed, it appeared, [good] to them, after they had seen the signs, indicating Joseph’s innocence, that they should imprison him for a while, until such time as people ceased to talk of him. He was thus imprisoned.\n",
        "TRANSLATION_18": "(And it seemed good to them) to the Chief Official (after they had seen the signs (of his innocence)) the torn shirt and the judgement of her brother (to imprison him for a time) a few years; it is also said that (for a time) means: until people stopped talking about it.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "12:35",
            "38:88",
            "44:33",
            "98:4",
            "28:87",
            "26:120",
            "42:35",
            "6:49",
            "2:92",
            "54:4"
        ],
        "BIBLE": [
            "torah:numbers:14:22",
            "prophets:joshua:8:14",
            "prophets:isaiah:6:5",
            "writings:ecclesiastes:8:9",
            "prophets:ii%20kings:9:26",
            "prophets:jeremiah:39:4",
            "torah:numbers:35:23",
            "prophets:ii%20samuel:16:6",
            "prophets:ii%20samuel:20:12",
            "torah:deuteronomy:3:21"
        ]
    }
}