{
    "VERSE": "12:37",
    "ARABIC": "قَالَ لَا يَأْتِيكُمَا طَعَامٌ تُرْزَقَانِهِۦٓ إِلَّا نَبَّأْتُكُمَا بِتَأْوِيلِهِۦ قَبْلَ أَن يَأْتِيَكُمَا ذَٰلِكُمَا مِمَّا عَلَّمَنِى رَبِّىٓ إِنِّى تَرَكْتُ مِلَّةَ قَوْمٍ لَّا يُؤْمِنُونَ بِٱللَّهِ وَهُم بِٱلْءَاخِرَةِ هُمْ كَٰفِرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "He said, 'No meal to feed you will arrive before I have informed you what they mean. That is part of what about the world to come.",
        "TRANSLATION_1": "(Joseph) answered: \"I will give you its interpretation before the food you are served arrives. This knowledge is one of the things my Lord has taught me. I have given up the religion of those who do not believe in God and deny the life to come.\n",
        "TRANSLATION_2": "Joseph said: \"I will inform you about the interpretation of the dreams before the arrival of the food that is sent to you. This knowledge is part of what I have been taught by my Lord. I have renounced the way of those who do not believe in Allah, and who deny the Hereafter,\n",
        "TRANSLATION_3": "(Joseph) said, \"To prove that my interpretation of your dream is true, I can tell you what kind of food you will receive even before it comes to you. My Lord has given me such talents. I have given up the tradition of the people who do not believe in God and the Day of Judgment\n",
        "TRANSLATION_4": "Said Yusuf, “The food which you get will not reach you, but I will tell you the interpretation of this before it comes to you; this is one of the sciences my Lord has taught me; indeed I did not accept the religion of the people who do not believe in Allah and are deniers of the Hereafter.”\n",
        "TRANSLATION_5": "He said: \"No food will come to you as your provision, but I will inform its interpretation before it comes. This is of that which my Lord has taught me. Verily, I have abandoned the religion of a people that believe not in Allah and are disbelievers in the Hereafter.\"\n",
        "TRANSLATION_6": "He said: There shall not come to you the food with which you are fed, but I will inform you both of its interpretation before it comes to you; this is of what my Lord has taught me; surely I have forsaken the religion of a people who do not believe in Allah, and they are deniers of the hereafter:\n",
        "TRANSLATION_7": "He said, 'No food shall come to you for your sustenance, but ere it comes to you I shall tell you its interpretation. That I shall tell you is of what God has taught me. I have forsaken the creed of a people who believe not in God and who moreover are unbelievers in the world to come.\n",
        "TRANSLATION_8": "He said: The food which ye are given (daily) shall not come unto you but I shall tell you the interpretation ere it cometh unto you. This is of that which my Lord hath taught me. Lo! I have forsaken the religion of folk who believe not in Allah and are disbelievers in the Hereafter.\n",
        "TRANSLATION_9": "Joseph said to them, \"I shall inform you of the interpretation of your dreams before your meal is brought to you. This is a part of the knowledge that my Lord has taught me. I have renounced the religion of the people who do not believe in God and who deny the Hereafter.\n",
        "TRANSLATION_10": "He said: there will not come to you any food wherewith ye are provided but I shall have declared unto the interpretation thereof ere it cometh unto you. that is of that which my Lord hath taught me; verily I have abandoned the creed of a people who believe not in Allah and who in the Hereafter are disbelievers.\n",
        "TRANSLATION_11": "He said, ‘Before the meals you are served come to you I will inform you of its interpretation. That is among things my Lord has taught me. Indeed, I renounce the creed of the people who have no faith in Allah and who [also] disbelieve in the Hereafter.\n",
        "TRANSLATION_12": "He said: \"Before any food comes (in due course) to feed either of you, I will surely reveal to you the truth and meaning of this ere it befall you: that is part of the (duty) which my Lord hath taught me. I have (I assure you) abandoned the ways of a people that believe not in Allah and that (even) deny the Hereafter.\n",
        "TRANSLATION_13": "He said: \"No food will come to you (in wakefulness or in dream) as your provision, but I will inform (in wakefulness) its interpretation before it (the food) comes. This is of that which my Lord has taught me. Verily, I have abandoned the religion of a people that believe not in Allah and are disbelievers in the Hereafter (i.e. the Kan'aniun of Egypt who were polytheists and used to worship sun and other false deities).\n",
        "TRANSLATION_14": "He said: 'Before any food comes to feed either of you, I will give you its interpretation. That which I will tell you has been taught to me by Allah. I reject the belief of a nation who do not believe in Allah and disbelieve in the Everlasting Life.\n",
        "TRANSLATION_15": "He said, “No food is served to you, but I have informed you about it before you have received it. That is some of what my Lord has taught me. I have forsaken the tradition of people who do not believe in God; and regarding the Hereafter, they are deniers.”\n",
        "TRANSLATION_16": "He said, \"You will not receive food that is provided to you except that I will inform you of its interpretation before it comes to you. That is from what my Lord has taught me. Indeed, I have left the religion of a people who do not believe in Allah, and they, in the Hereafter, are disbelievers.\n",
        "TRANSLATION_17": "[12:37] He said, to them both, in order to inform [them] that he knew how to interpret dreams: ‘The food, with which you are provided, shall not come to you, while you are asleep, but I shall tell you the interpretation thereof, while you are conscious, before it, the interpretation thereof, comes to you. This is from that which my Lord has taught me — herein is an incitement for them to believe, which he reinforces with the following words: Lo! I have forsaken the creed, the religion, of a folk who do not believe in God and who moreover (hum, ‘they’ [is repeated] for emphasis) are disbelievers in the Hereafter.\n",
        "TRANSLATION_18": "(He said) Joseph said to them, because he wanted to inform them about his knowledge of interpreting dreams: (The food which ye are given (daily) shall not come unto you but I shall tell you the interpretation) i.e. of its colour and type (ere it cometh unto you) so can I fail to interpret your dreams? (This) the interpretation of dreams (is of that which my Lord hath taught me. Lo! I have forsaken the religion of folk) I did not follow the religion of a people (who believe not in Allah and are disbelievers in) they are deniers of (the Hereafter) resurrection after death.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "12:37",
            "11:29",
            "5:84",
            "16:107",
            "16:33",
            "13:21",
            "2:286",
            "2:258",
            "11:88",
            "12:87"
        ],
        "BIBLE": [
            "prophets:jeremiah:35:15",
            "torah:deuteronomy:26:13",
            "writings:ii%20chronicles:25:9",
            "prophets:jeremiah:5:19",
            "writings:i%20chronicles:29:14",
            "torah:numbers:20:12",
            "writings:ii%20chronicles:35:21",
            "prophets:joshua:23:16",
            "writings:daniel:2:7",
            "prophets:ezekiel:29:20"
        ]
    }
}