{
    "VERSE": "12:38",
    "ARABIC": "وَٱتَّبَعْتُ مِلَّةَ ءَابَآءِىٓ إِبْرَٰهِيمَ وَإِسْحَٰقَ وَيَعْقُوبَ مَا كَانَ لَنَآ أَن نُّشْرِكَ بِٱللَّهِ مِن شَىْءٍ ذَٰلِكَ مِن فَضْلِ ٱللَّهِ عَلَيْنَا وَعَلَى ٱلنَّاسِ وَلَٰكِنَّ أَكْثَرَ ٱلنَّاسِ لَا يَشْكُرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "I hold fast to the creed of my forebears Ibrahim and Ishaq and Ya'qub. We don't associate anything with Allah. And that is how Allah has favoured us and all mankind, but most do not give thanks.",
        "TRANSLATION_1": "I follow the faith of my fathers, of Abraham and Isaac and Jacob. We cannot associate anyone with God. This is among God's favours to us and to all mankind; but most men are not grateful.\n",
        "TRANSLATION_2": "and I have adopted the way of my forefathers - Abraham and Isaac and Jacob. It is not for us to associate any with Allah in His Divinity. It is out of Allah's grace upon us and upon mankind (that He did not require of us to serve any other than Allah), and yet most people do not give thanks.\n",
        "TRANSLATION_3": "and I have embraced the religion of my fathers, Abraham, Isaac, and Jacob. We are not supposed to consider anything equal to God. This is part of God's blessing to us and the people, but most people do not give thanks.\n",
        "TRANSLATION_4": "“And I have chosen the religion of my forefathers, Ibrahim and Ishaq and Yaqub; it is not rightful for us to ascribe anything as a partner to Allah; this is a grace of Allah upon us and upon mankind, but most men are not thankful.”\n",
        "TRANSLATION_5": "And I have followed the religion of my fathers, - Ibrahim, Ishaq and Ya'qub and never could we attribute any partners whatsoever to Allah. This is from the grace of Allah to us and to mankind, but most men thank not.\n",
        "TRANSLATION_6": "And I follow the religion of my fathers, Ibrahim and Ishaq and Yaqoub; it beseems us not that we should associate aught with Allah; this is by Allah's grace upon us and on mankind, but most people do not give thanks:\n",
        "TRANSLATION_7": "And I have followed the creed of my fathers, Abraham, Isaac and Jacob. Not ours is it to associate aught with God. That is of God's bounty to us, and to men; but most men are not thankful.\n",
        "TRANSLATION_8": "And I have followed the religion of my fathers, Abraham and Isaac and Jacob. It never was for us to attribute aught as partner to Allah. This is of the bounty of Allah unto us (the seed of Abraham) and unto mankind; but most men give not thanks.\n",
        "TRANSLATION_9": "I follow the religion of my fathers, Abraham, Isaac and Jacob; and it is not for us to associate anyone with God as a partner. This is of God's grace upon us and upon mankind; even though most men are not grateful.\n",
        "TRANSLATION_10": "And I have followed the creed of my fathers, Ibrahim and Is'haq and ya'qub: it is not for us to associate aught with Allah. That is of Allah's and upon mankind; but grace upon us most of mankind thank not.\n",
        "TRANSLATION_11": "I follow the creed of my fathers, Abraham, Isaac and Jacob. It is not for us to ascribe any partner to Allah. That is by virtue of Allah’s grace upon us and upon all mankind, but most people do not give thanks.\n",
        "TRANSLATION_12": "And I follow the ways of my fathers,- Abraham, Isaac, and Jacob; and never could we attribute any partners whatever to Allah: that (comes) of the grace of Allah to us and to mankind: yet most men are not grateful.\n",
        "TRANSLATION_13": "And I have followed the religion of my fathers, - Ibrahim (Abraham), Ishaque (Isaac) and Ya'qub (Jacob)], and never could we attribute any partners whatsoever to Allah. This is from the Grace of Allah to us and to mankind, but most men thank not (i.e. they neither believe in Allah, nor worship Him).\n",
        "TRANSLATION_14": "I follow the creed of my fathers, Abraham, Isaac, and Jacob. It is not for us to associate anything with Allah. Such is the favor of Allah to us, and to mankind. Yet most people do not give thanks.\n",
        "TRANSLATION_15": "“And I have followed the faith of my forefathers, Abraham, and Isaac, and Jacob. It is not for us to associate anything with God. This is by virtue of God’s grace upon us and upon the people, but most people do not give thanks.\n",
        "TRANSLATION_16": "And I have followed the religion of my fathers, Abraham, Isaac and Jacob. And it was not for us to associate anything with Allah. That is from the favor of Allah upon us and upon the people, but most of the people are not grateful.\n",
        "TRANSLATION_17": "[12:38] And I follow the creed of my fathers, Abraham and Isaac and Jacob. It never was, right, for us to associate anything (min shay’in: min is extra) with God — on account of our [God-given] immunity [from error]. That, affirmation of [God’s] Oneness, is from God’s bounty to us and to mankind; but most people — and these are the disbelievers — do not give thanks, to God, and so they associate others with Him.\n",
        "TRANSLATION_18": "(And I have followed the religion of my fathers) I held firm to the religion of my forefathers, (Abraham and Isaac and Jacob. It never was for us) it was not permissible for us (to attribute aught) any idols (as partner to Allah. This) pure Religion, prophethood and Islam with which Allah has honoured us (is of the bounty of Allah unto us) a blessing that Allah blessed us with (and unto mankind) by sending us to them; it is also said that this means: this is a bounty unto the believers through the blessing of faith; (but most men) the people of Egypt (give not thanks) do not believe in this.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "12:38",
            "12:68",
            "40:61",
            "10:60",
            "10:44",
            "12:40",
            "27:73",
            "30:6",
            "4:32",
            "6:111"
        ],
        "BIBLE": [
            "torah:numbers:32:11",
            "prophets:judges:2:19",
            "writings:ii%20chronicles:34:33",
            "prophets:ii%20kings:6:19",
            "prophets:i%20kings:13:12",
            "prophets:jeremiah:16:13",
            "torah:exodus:33:13",
            "prophets:i%20samuel:30:21",
            "prophets:jeremiah:35:15",
            "prophets:joshua:24:2"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:3:5",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:6:3"
        ]
    }
}