{
    "VERSE": "12:4",
    "ARABIC": "إِذْ قَالَ يُوسُفُ لِأَبِيهِ يَٰٓأَبَتِ إِنِّى رَأَيْتُ أَحَدَ عَشَرَ كَوْكَبًا وَٱلشَّمْسَ وَٱلْقَمَرَ رَأَيْتُهُمْ لِى سَٰجِدِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "When Yusuf told his father, 'Father! I saw eleven bright stars, and the sun and moon as well. I saw them all prostrate in front of me.'",
        "TRANSLATION_1": "When Joseph told his father: \"O my father, I saw eleven stars and the sun and the moon bowing before me in homage,\"\n",
        "TRANSLATION_2": "Call to mind when Joseph said to his father: \"My father! I saw (in a dream) eleven stars and the sun and the moon: I saw them prostrating themselves before me.\"\n",
        "TRANSLATION_3": "When Joseph said, \"Father, in my dream I saw eleven stars, the sun and the moon prostrating before me,\"\n",
        "TRANSLATION_4": "Remember when Yusuf (Joseph) said to his father, “O my father! I saw eleven stars and the sun and the moon – I saw them prostrating to me.”\n",
        "TRANSLATION_5": "(Remember) when Yusuf said to his father: \"O my father! Verily, I saw (in a dream) eleven stars and the sun and the moon - I saw them prostrating themselves to me.\"\n",
        "TRANSLATION_6": "When Yusuf said to his father: O my father! surely I saw eleven stars and the sun and the moon-- I saw them making obeisance to me.\n",
        "TRANSLATION_7": "When Joseph said to his father, 'Father, I saw eleven stars, and the sun and the moon; I saw them bowing down before me.'\n",
        "TRANSLATION_8": "When Joseph said unto his father: O my father! Lo! I saw in a dream eleven planets and the sun and the moon, I saw them prostrating themselves unto me.\n",
        "TRANSLATION_9": "When Joseph told his father, \"My father, I saw eleven stars, and the sun and moon: I saw them prostrate themselves before me,\"\n",
        "TRANSLATION_10": "Recall what time Yusufj said unto his father:, y father! verily have seen eleven stars and the sun and the moon; I have seen them prostrating themselves unto me.\n",
        "TRANSLATION_11": "When Joseph said to his father, ‘Father! I saw eleven planets, and the sun and the moon: I saw them prostrating themselves before me,’\n",
        "TRANSLATION_12": "Behold! Joseph said to his father: \"O my father! I did see eleven stars and the sun and the moon: I saw them prostrate themselves to me!\"\n",
        "TRANSLATION_13": "(Remember) when Yusuf (Joseph) said to his father: \"O my father! Verily, I saw (in a dream) eleven stars and the sun and the moon, I saw them prostrating themselves to me.\"\n",
        "TRANSLATION_14": "When Joseph said to his father: 'Father, I saw eleven planets, and the sun and the moon; I saw them prostrating themselves before me'\n",
        "TRANSLATION_15": "When Joseph said to his father, “O my father, I saw eleven planets, and the sun, and the moon; I saw them bowing down to me.”\n",
        "TRANSLATION_16": "[Of these stories mention] when Joseph said to his father, \"O my father, indeed I have seen [in a dream] eleven stars and the sun and the moon; I saw them prostrating to me.\"\n",
        "TRANSLATION_17": "[12:4] Mention, when Joseph said to his father, Jacob: ‘O my father (read yā abati to indicate the omitted yā’ of genitive annexation [sc. of yā abī]; or read yā abata to indicate that an alif, originally a yā’, has been   omitted) I saw, in my sleep, eleven planets and the sun and the moon, I saw them ([repeated] for emphasis) prostrating themselves before me’ (sājidīn: this plural form is used to describe [the act of] ‘prostration’, which is an attribute associated with rational beings).\n",
        "TRANSLATION_18": "(When Joseph said unto his father: my father! Lo! I saw in a dream) that I dreamt during the day (eleven planets) they came down from their orbits and prostrated themselves before me, a prostration of greeting- these are his brothers who were eleven in number-(and the sun and the moon, I saw them prostrating themselves unto me) he says: and I saw the sun and the moon coming down from their orbits and prostrated themselves before me, a prostration of greeting-these are his parents: Rachel and Jacob.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "12:4",
            "75:9",
            "26:86",
            "12:78",
            "55:5",
            "19:44",
            "43:26",
            "82:2",
            "6:78",
            "29:28"
        ],
        "BIBLE": [
            "torah:genesis:37:9",
            "writings:daniel:2:26",
            "torah:genesis:26:28",
            "writings:daniel:8:19",
            "prophets:i%20samuel:28:15",
            "torah:genesis:16:13",
            "prophets:i%20samuel:17:25",
            "writings:psalms:141:1",
            "torah:genesis:32:3",
            "prophets:i%20kings:2:42"
        ]
    }
}