{
    "VERSE": "12:43",
    "ARABIC": "وَقَالَ ٱلْمَلِكُ إِنِّىٓ أَرَىٰ سَبْعَ بَقَرَٰتٍ سِمَانٍ يَأْكُلُهُنَّ سَبْعٌ عِجَافٌ وَسَبْعَ سُنۢبُلَٰتٍ خُضْرٍ وَأُخَرَ يَابِسَٰتٍ يَٰٓأَيُّهَا ٱلْمَلَأُ أَفْتُونِى فِى رُءْيَٰىَ إِن كُنتُمْ لِلرُّءْيَا تَعْبُرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "The King declared, 'I dreamt of seven fat cows which seven thin ones ate and seven green ears of wheat and seven others which were dry. O counsellors! Explain my dream to me if you are those who can interpret visions!'",
        "TRANSLATION_1": "(One day) the king said (to his courtiers): \"I saw seven fat cows in a dream being devoured by seven lean ones, and seven ears of corn that were green and seven others that were seared. O courtiers, tell me the significance of my dream, if you know how to interpret them.\"\n",
        "TRANSLATION_2": "And once the king said: \"I have dreamt that there are seven fat cows and seven lean cows are devouring them, and there are seven fresh green ears of corn and seven others dry and withered. My nobles! Tell me what is the interpretation of this dream, if you are well-versed in interpretation of dreams.\"\n",
        "TRANSLATION_3": "(Sometimes later), the King dreamt that seven lean cows were eating seven fat ones and that there were seven green ears of corn and seven dry ones. He asked the nobles to tell him the meaning of his dream if they were able to.\n",
        "TRANSLATION_4": "And the king said, “I saw in a dream seven healthy cows whom seven lean cows were eating, and seven green ears of corn and seven others dry; O court-members! Explain my dream, if you can interpret dreams.”\n",
        "TRANSLATION_5": "And the king (of Egypt) said: \"Verily, I saw (in a dream) seven fat cows, whom seven lean ones were devouring, and seven green ears of corn, and (seven) others dry. O notables! Explain to me my dream, if it be that you can interpret dreams.\"\n",
        "TRANSLATION_6": "And the king said: Surely I see seven fat kine which seven lean ones devoured; and seven green ears and (seven) others dry: O chiefs! explain to me my dream, if you can interpret the dream.\n",
        "TRANSLATION_7": "And the king said, 'I saw in a dream seven fat kine, and seven lean ones devouring them; likewise seven green ears of corn, and seven withered. My counsellors, pronounce to me upon my dream, if you are expounders of dreams.'\n",
        "TRANSLATION_8": "And the king said: Lo! I saw in a dream seven fat kine which seven lean were eating, and seven green ears of corn and other (seven) dry. O notables! Expound for me my vision, if ye can interpret dreams.\n",
        "TRANSLATION_9": "The king said, \"I saw [in a dream] seven fat cows which seven lean ones were eating, also seven green ears of corn and seven others which were dry. Tell me the meaning of this vision, my nobles, if you can interpret visions.\"\n",
        "TRANSLATION_10": "And the king said: verily I saw seven fat kine which seven lean ones are devouring and seven green cornears and seven others dry. O ye chiefs! give me an answer in regard to my vision if a vision ye are wont to expound.\n",
        "TRANSLATION_11": "[One day] the king said, ‘I saw [in a dream] seven fat cows being devoured by seven lean ones, and seven green ears and [seven] others [that were] dry. O courtiers, give me your opinion about my dream, if you can interpret dreams.’\n",
        "TRANSLATION_12": "The king (of Egypt) said: \"I do see (in a vision) seven fat kine, whom seven lean ones devour, and seven green ears of corn, and seven (others) withered. O ye chiefs! Expound to me my vision if it be that ye can interpret visions.\"\n",
        "TRANSLATION_13": "And the king (of Egypt) said: \"Verily, I saw (in a dream) seven fat cows, whom seven lean ones were devouring - and of seven green ears of corn, and (seven) others dry. O notables! Explain to me my dream, if it be that you can interpret dreams.\"\n",
        "TRANSLATION_14": "The king said: 'I saw in a vision seven fatted cows being devoured by seven lean ones; and seven green ears of corn and seven others withered. My counselors, tell me the meaning of my vision, if you can interpret visions'\n",
        "TRANSLATION_15": "The king said, “I see seven fat cows being eaten by seven lean ones, and seven green spikes, and others dried up. O elders, explain to me my vision, if you are able to interpret visions.”\n",
        "TRANSLATION_16": "And [subsequently] the king said, \"Indeed, I have seen [in a dream] seven fat cows being eaten by seven [that were] lean, and seven green spikes [of grain] and others [that were] dry. O eminent ones, explain to me my vision, if you should interpret visions.\"\n",
        "TRANSLATION_17": "[12:43] And the king, the king of Egypt — al-Rayyān b. al-Walīd — said, ‘I saw in [a dream] seven fat kine being devoured, being swallowed up, by seven lean ones, of kine (‘ijāf is the plural of ‘ajfā’), and seven green ears of corn and others, that is seven [other] ears of corn, dry, that had wound themselves around the green ones and risen above them. O courtiers! Give me [your] opinion about my vision: expound for me its interpretation, if you can interpret visions’, then interpret it for me.\n",
        "TRANSLATION_18": "(And the king said: Lo! I saw in a dream seven fat kine) coming out of a river (which seven lean were eating) the seven lean kine, that were dying of lack of nourishment swallowed up the fat kine, but even then it was as if they did not eat anything, (and seven green ears of corn and other (seven) dry) the dry ones coiling around the green ones such that they overshadowed their greenery and became unnoticeable. (0 notables!) Meaning: the soothsayers, sorcerers and fortune-tellers, (Expound for me my vision) interpret for me my dream, (if ye can interpret dreams) if you know how to interpret dreams.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "12:43",
            "12:46",
            "27:29",
            "27:32",
            "33:56",
            "23:51",
            "4:136",
            "26:84",
            "17:72",
            "3:45"
        ],
        "BIBLE": [
            "writings:daniel:2:26",
            "writings:daniel:4:6",
            "writings:daniel:2:7",
            "writings:daniel:4:15",
            "prophets:i%20kings:20:13",
            "torah:genesis:40:8",
            "torah:exodus:3:7",
            "writings:daniel:2:4",
            "torah:genesis:40:16",
            "writings:ii%20chronicles:10:16"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:3:4",
            "Sefer%20Yetzirah:5:2"
        ]
    }
}