{
    "VERSE": "12:44",
    "ARABIC": "قَالُوٓا۟ أَضْغَٰثُ أَحْلَٰمٍ وَمَا نَحْنُ بِتَأْوِيلِ ٱلْأَحْلَٰمِ بِعَٰلِمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "They said, 'A jumbled mass of mixed-up dreams! We do not know the meaning of such things.'",
        "TRANSLATION_1": "They were only confused dreams,\" they said; \"we do not know how to interpret them.\"\n",
        "TRANSLATION_2": "They said: \"These are confused dreams, and we do not know the interpretation of such dreams.\"\n",
        "TRANSLATION_3": "They replied, \"It is a confused dream and we do not know the meaning of such dreams.\"\n",
        "TRANSLATION_4": "They answered, “These are confused dreams – and we do not know the interpretation of dreams.”\n",
        "TRANSLATION_5": "They said: \"Mixed up false dreams and we are not skilled in the interpretation of dreams.\"\n",
        "TRANSLATION_6": "They said: Confused dreams, and we do not know the interpretation of dreams.\n",
        "TRANSLATION_7": "A hotchpotch of nightmares!' they said. 'We know nothing of the interpretation of nightmares.'\n",
        "TRANSLATION_8": "They answered: Jumbled dreams! And we are not knowing in the interpretation of dreams.\n",
        "TRANSLATION_9": "They said, \"These are confusing dreams and we do not know the interpretation of such dreams.\"\n",
        "TRANSLATION_10": "They said: medleys of dreams! and in the interpretation of dreams we are not skilled.\n",
        "TRANSLATION_11": "They said, ‘[These are] confused nightmares, and we do not know the interpretation of nightmares.’\n",
        "TRANSLATION_12": "They said: \"A confused medley of dreams: and we are not skilled in the interpretation of dreams.\"\n",
        "TRANSLATION_13": "They said: \"Mixed up false dreams and we are not skilled in the interpretation of dreams.\"\n",
        "TRANSLATION_14": "They said: 'They are confused nightmares, nor do we know anything of the interpretation of visions'\n",
        "TRANSLATION_15": "They said, “Jumbles of dreams, and we know nothing of the interpretation of dreams.”\n",
        "TRANSLATION_16": "They said, \"[It is but] a mixture of false dreams, and we are not learned in the interpretation of dreams.\"\n",
        "TRANSLATION_17": "[12:44] They said, this is, ‘A jumble, a mixture, of dreams! And we are not knowledgeable in the interpretation of dreams’.\n",
        "TRANSLATION_18": "(They) i.e. the soothsayers, sorcerers and fortune-tellers (answered: Jumbled dreams!) these are false and unreal dreams. (And we are not knowing in the interpretation of dreams) we do not know how to interpret dreams.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "12:44",
            "21:5",
            "26:114",
            "85:7",
            "27:85",
            "68:1",
            "52:32",
            "83:33",
            "26:112",
            "26:138"
        ],
        "BIBLE": [
            "writings:daniel:2:7",
            "writings:daniel:2:5",
            "torah:genesis:40:8",
            "torah:genesis:40:18",
            "writings:daniel:4:16",
            "writings:daniel:5:17",
            "prophets:zechariah:4:13",
            "writings:daniel:2:36",
            "writings:daniel:2:3",
            "writings:daniel:2:26"
        ]
    }
}