{
    "VERSE": "12:49",
    "ARABIC": "ثُمَّ يَأْتِى مِنۢ بَعْدِ ذَٰلِكَ عَامٌ فِيهِ يُغَاثُ ٱلنَّاسُ وَفِيهِ يَعْصِرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Then after that another year will come in which the people will be helped by rain in plenty and when they once more will press.'",
        "TRANSLATION_1": "This will be followed by a year of rain, and people shall press (the grapes).\"\n",
        "TRANSLATION_2": "Then there will come a year when people will be helped by plenty of rain and they will press (grapes).\"\n",
        "TRANSLATION_3": "Then there will be a year with plenty of rain and people will have sufficient milk and other produce.\"\n",
        "TRANSLATION_4": "“Then after that will come a year when the people will be given rain and in which they will extract juices.”\n",
        "TRANSLATION_5": "Then thereafter will come a year in which people will have abundant rain and in which they will press (wine and oil).\"\n",
        "TRANSLATION_6": "Then there will come after that a year in which people shall have rain and in which they shall press (grapes).\n",
        "TRANSLATION_7": "Then thereafter there shall come a year wherein the people will be succoured and press in season.\n",
        "TRANSLATION_8": "Then, after that, will come a year when the people will have plenteous crops and when they will press (wine and oil).\n",
        "TRANSLATION_9": "Then a year will come after that when people will have abundant rain and when once more they will press [wine and oil].\"\n",
        "TRANSLATION_10": "Then thereafter will come a year wherein mankind will have rain and wherein they will press.\n",
        "TRANSLATION_11": "Then after that there will come a year wherein the people will be granted relief and provided with rains therein.\n",
        "TRANSLATION_12": "Then will come after that (period) a year in which the people will have abundant water, and in which they will press (wine and oil).\"\n",
        "TRANSLATION_13": "Then thereafter will come a year in which people will have abundant rain and in which they will press (wine and oil).\"\n",
        "TRANSLATION_14": "Then, there will come a year in which people are helped, in which the people will press'\n",
        "TRANSLATION_15": "Then after that will come a year that brings relief to the people, and during which they will press.\n",
        "TRANSLATION_16": "Then will come after that a year in which the people will be given rain and in which they will press [olives and grapes].\"\n",
        "TRANSLATION_17": "[12:49] Then after that, in other words, after the seven barren years, there shall come a year in which the people will be granted relief, through rain, and in which they will press [fruit], grapes, and other [seeds], because of its [that year’s] fertility.\n",
        "TRANSLATION_18": "(Then, after that) after the years of drought, (will come a year when the people) of Egypt (will have plenteous crops) foodstuffs and rain (and when they will press) wine and oils.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "12:49",
            "46:6",
            "2:159",
            "26:39",
            "36:28",
            "26:120",
            "2:52",
            "30:3",
            "20:85",
            "3:46"
        ],
        "BIBLE": [
            "torah:leviticus:26:4",
            "writings:ii%20chronicles:31:5",
            "prophets:judges:7:4",
            "torah:deuteronomy:11:14",
            "prophets:isaiah:55:1",
            "torah:numbers:32:11",
            "prophets:jeremiah:31:12",
            "torah:exodus:17:6",
            "writings:psalms:78:71",
            "prophets:i%20kings:20:10"
        ]
    }
}