{
    "VERSE": "12:53",
    "ARABIC": "وَمَآ أُبَرِّئُ نَفْسِىٓ إِنَّ ٱلنَّفْسَ لَأَمَّارَةٌۢ بِٱلسُّوٓءِ إِلَّا مَا رَحِمَ رَبِّىٓ إِنَّ رَبِّى غَفُورٌ رَّحِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "I do not say my self was free from blame. The self indeed commands to evil acts - except for those my Lord has mercy on. My Lord, He is Forgiving, Merciful.'",
        "TRANSLATION_1": "But I do not wish to absolve myself, for the soul is prone to evil, unless my Lord have mercy. Indeed my Lord is forgiving and kind.\" --\n",
        "TRANSLATION_2": "I do not seek to acquit myself; for surely one's self prompts one to evil except him to whom my Lord may show mercy. Verily my Lord is Ever Forgiving, Most Merciful.\"\n",
        "TRANSLATION_3": "I do not think that I am free from weakness; all human souls are susceptible to evil except for those to whom my Lord has granted mercy. My Lord is certainly All-forgiving and All-merciful.\"\n",
        "TRANSLATION_4": "“And I do not portray my soul as innocent; undoubtedly the soul excessively commands towards evil, except upon whom my Lord has mercy; indeed my Lord is Oft Forgiving, Most Merciful.”\n",
        "TRANSLATION_5": "And I free not myself (from the blame). Verily, the self is inclined to evil, except when my Lord bestows His mercy (upon whom He wills). Verily, my Lord is Oft-Forgiving, Most Merciful.\"\n",
        "TRANSLATION_6": "And I do not declare myself free, most surely (man's) self is wont to command (him to do) evil, except such as my Lord has had mercy on, surely my Lord is Forgiving, Merciful.\n",
        "TRANSLATION_7": "Yet I claim not that my soul was innocent -- surely the soul of man incites to evil -- except inasmuch as my Lord had mercy; truly my Lord is All-forgiving, All-compassionate.'\n",
        "TRANSLATION_8": "I do not exculpate myself. Lo! the (human) soul enjoineth unto evil, save that whereon my Lord hath mercy. Lo! my Lord is Forgiving, Merciful.\n",
        "TRANSLATION_9": "I am not trying to absolve myself: for man's very soul incites him to evil unless my Lord bestows His mercy. Indeed, my Lord is forgiving and merciful.\"\n",
        "TRANSLATION_10": "Nor I acquit myself; verily the self ever urgeth to evil save that self on Whom my Lord hath mercy; verily My Lord is Forgiving, Merciful.\n",
        "TRANSLATION_11": "‘Yet I do not absolve my [own carnal] soul, for the [carnal] soul indeed prompts [men] to evil, except inasmuch as my Lord has mercy. Indeed my Lord is all-forgiving, all-merciful.’\n",
        "TRANSLATION_12": "Nor do I absolve my own self (of blame): the (human) soul is certainly prone to evil, unless my Lord do bestow His Mercy: but surely my Lord is Oft-forgiving, Most Merciful.\"\n",
        "TRANSLATION_13": "And I free not myself (from the blame). Verily, the (human) self is inclined to evil, except when my Lord bestows His Mercy (upon whom He wills). Verily, my Lord is Oft-Forgiving, Most Merciful.\"\n",
        "TRANSLATION_14": "Yet I do not consider my soul was innocent, surely the soul incites to evil except to whom my Lord has mercy; indeed, my Lord is Forgiving, the MostMerciful'\n",
        "TRANSLATION_15": "“Yet I do not claim to be innocent. The soul commands evil, except those on whom my Lord has mercy. Truly my Lord is Forgiving and Merciful.”\n",
        "TRANSLATION_16": "And I do not acquit myself. Indeed, the soul is a persistent enjoiner of evil, except those upon which my Lord has mercy. Indeed, my Lord is Forgiving and Merciful.\"\n",
        "TRANSLATION_17": "[12:53] Yet I do not exculpate my own soul, of slipping into error; verily the soul, as such, is ever inciting to evil, except that whereon, meaning the person [upon whom], my Lord has mercy, and so protects [from sin]. Truly my Lord is Forgiving, Merciful’.\n",
        "TRANSLATION_18": "At this point Gabriel said to him: \"Not even when you nearly went to her, Joseph?\" Joseph said: (I do not exculpate myself) I do not exonerate my heart from nearly going towards her. (Lo! the (human) soul) the heart (enjoineth) the body (unto evil) evil works, (save that whereon my Lord hath mercy) save those whom Allah protects. (My Lord is Forgiving) He pardons, (Merciful) regarding the fact that I nearly went towards her.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "12:53",
            "28:16",
            "7:153",
            "16:119",
            "12:98",
            "27:11",
            "14:36",
            "16:7",
            "16:110",
            "11:41"
        ],
        "BIBLE": [
            "prophets:jonah:4:2",
            "writings:job:1:8",
            "prophets:jeremiah:42:20",
            "prophets:i%20kings:11:11",
            "prophets:joshua:2:14",
            "prophets:ezekiel:18:27",
            "prophets:zechariah:7:9",
            "writings:job:2:3",
            "writings:job:11:11",
            "writings:ii%20chronicles:19:6"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:2:2"
        ]
    }
}