{
    "VERSE": "12:55",
    "ARABIC": "قَالَ ٱجْعَلْنِى عَلَىٰ خَزَآئِنِ ٱلْأَرْضِ إِنِّى حَفِيظٌ عَلِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "He said, 'Entrust the country's stores to me. In truth I am a knowing guardian.'",
        "TRANSLATION_1": "Appoint me over the granaries of the land,\" (he said); \"I shall be a knowledgeable keeper.\"\n",
        "TRANSLATION_2": "Joseph said: \"Place me in charge of the treasures of the land. I am a good keeper and know my task well.\"\n",
        "TRANSLATION_3": "Joseph said, \"Put me in charge of the treasuries of the land. I know how to manage them.\"\n",
        "TRANSLATION_4": "Said Yusuf, “Appoint me over the treasures of the earth; indeed I am a protector, knowledgeable.”\n",
        "TRANSLATION_5": "[Yusuf] said: \"Set me over the storehouses of the land; I will indeed guard them with full knowledge.\"\n",
        "TRANSLATION_6": "He said: Place me (in authority) over the treasures of the land, surely I am a good keeper, knowing well.\n",
        "TRANSLATION_7": "He said, 'Set me over the land's storehouses; I am a knowing guardian.'\n",
        "TRANSLATION_8": "He said: Set me over the storehouses of the land. Lo! I am a skilled custodian.\n",
        "TRANSLATION_9": "Joseph said, \"Place in my charge the storehouses of the land; for I am a good and knowledgeable custodian.\"\n",
        "TRANSLATION_10": "He said: set me over the store houses of the land; verily I shall be a keeper knowing.\n",
        "TRANSLATION_11": "He said, ‘Put me in charge of the country’s granaries. I am indeed fastidious [and]well-informed.’\n",
        "TRANSLATION_12": "(Joseph) said: \"Set me over the store-houses of the land: I will indeed guard them, as one that knows (their importance).\"\n",
        "TRANSLATION_13": "[Yusuf (Joseph)] said: \"Set me over the storehouses of the land; I will indeed guard them with full knowledge\" (as a minister of finance in Egypt, in place of Al-'Aziz who was dead at that time).\n",
        "TRANSLATION_14": "He (Joseph) said: 'Give me charge of the storehouses of the land, I am a knowledgeable guardian'\n",
        "TRANSLATION_15": "He said, “Put me in charge of the storehouses of the land; I am honest and knowledgeable.”\n",
        "TRANSLATION_16": "[Joseph] said, \"Appoint me over the storehouses of the land. Indeed, I will be a knowing guardian.\"\n",
        "TRANSLATION_17": "[12:55] He, Joseph, said, ‘Place me in charge of the storehouses of the land, the land of Egypt. I am indeed a skilled custodian’, one worthy of custodianship thereof, and knowledgeable in such affairs — it is also said [that he meant]: [I am indeed] a [competent] scribe and accountant.\n",
        "TRANSLATION_18": "249 (He said: Set me over the storehouses of the land) appoint me in charge of the treasury of Egypt (I am a skilled custodian) I am skilled in its estimation and know the time when people go hungry; it is also said that this means: I am trustworthy regarding that with which you have entrusted me, and also know the languages of the strangers who come to you.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "12:55",
            "21:4",
            "21:71",
            "19:40",
            "43:9",
            "63:7",
            "36:81",
            "42:12",
            "18:7",
            "26:220"
        ],
        "BIBLE": [
            "prophets:zechariah:5:11",
            "writings:nehemiah:13:11",
            "torah:genesis:41:41",
            "prophets:ii%20kings:21:7",
            "writings:ezra:8:17",
            "prophets:ezekiel:40:45",
            "writings:ii%20chronicles:33:7",
            "torah:leviticus:20:24",
            "prophets:ezekiel:45:4",
            "torah:genesis:28:17"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:4"
        ]
    }
}