{
    "VERSE": "12:56",
    "ARABIC": "وَكَذَٰلِكَ مَكَّنَّا لِيُوسُفَ فِى ٱلْأَرْضِ يَتَبَوَّأُ مِنْهَا حَيْثُ يَشَآءُ نُصِيبُ بِرَحْمَتِنَا مَن نَّشَآءُ وَلَا نُضِيعُ أَجْرَ ٱلْمُحْسِنِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "And thus We established Yusuf in the land so he could live in any olace he pleased. We grant Our grace to anyone We will and We do not allow to go to waste the wage of any people who do good.",
        "TRANSLATION_1": "Thus We gave Joseph authority in the land so that he lived wherever he liked. We bestow Our favours on whomsoever We please, and do not allow the reward of those who are good to go waste.\n",
        "TRANSLATION_2": "Thus did We establish Joseph in the land so that he could settle wherever he pleased. We bestow favour, out of Our Mercy, on whomsoever We please, and We do not cause the reward of those who do good to go to waste.\n",
        "TRANSLATION_3": "Thus, We settled Joseph in the land to live wherever he wanted. We grant a due share of Our mercy to whomever We want and We do not ignore the reward of the righteous ones.\n",
        "TRANSLATION_4": "And this is how We gave Yusuf the control over that land; to stay in it wherever he pleased; We may convey Our mercy to whomever We will, and We do not waste the wages of the righteous.\n",
        "TRANSLATION_5": "Thus did We give full authority to Yusuf in the land, to take possession therein, when or where he likes. We bestow of Our mercy on whom We will, and We make not to be lost the reward of the good doers.\n",
        "TRANSLATION_6": "And thus did We give to Yusuf power in the land-- he had mastery in it wherever he liked; We send down Our mercy on whom We please, and We do not waste the reward of those who do good.\n",
        "TRANSLATION_7": "So We established Joseph in the land, to make his dwelling there wherever he would. We visit with Our mercy whomsoever We will, and We leave not to waste the wage of the good-doers.\n",
        "TRANSLATION_8": "Thus gave We power to Joseph in the land. He was the owner of it where he pleased. We reach with Our mercy whom We will. We lose not the reward of the good.\n",
        "TRANSLATION_9": "Thus We caused Joseph to be established in a position of authority in the land. He could dwell therein wherever he pleased. We bestow Our mercy on whomever We please, and We do not allow the reward of the righteous to go to waste.\n",
        "TRANSLATION_10": "Thus We established Yusuf in the land so that he might settle therein wherever he listed. We bestow of Our mercy on whomsoever We will, and We waste not the hire of the well-doers.\n",
        "TRANSLATION_11": "That is how We established Joseph in the land that he may settle in it wherever he wished. We confer Our mercy on whomever We wish, and We do not waste the reward of the virtuous.\n",
        "TRANSLATION_12": "Thus did We give established power to Joseph in the land, to take possession therein as, when, or where he pleased. We bestow of our Mercy on whom We please, and We suffer not, to be lost, the reward of those who do good.\n",
        "TRANSLATION_13": "Thus did We give full authority to Yusuf (Joseph) in the land, to take possession therein, as when or where he likes. We bestow of Our Mercy on whom We please, and We make not to be lost the reward of Al-Muhsinun (the good doers - see V. 2:112).\n",
        "TRANSLATION_14": "And as such We established Joseph in the land to live wherever he liked. We bestow Our Mercy on whom We will, and We never waste the wage of therighteous.\n",
        "TRANSLATION_15": "And thus We established Joseph in the land, to live therein wherever he wished. We touch with Our mercy whomever We will, and We never waste the reward of the righteous.\n",
        "TRANSLATION_16": "And thus We established Joseph in the land to settle therein wherever he willed. We touch with Our mercy whom We will, and We do not allow to be lost the reward of those who do good.\n",
        "TRANSLATION_17": "[12:56] Thus, in the same way that We were graceful towards Him by delivering him from prison, We established Joseph in the land, the land of Egypt, that he may settle in it wherever he wished, after [having suffered] hardship and imprisonment. According to the story, the king crowned him, gave him a signet-ring to wear, and appointed him in place of the Court officer, whom he removed from his position, and who later died; and so he [the king] made him [Joseph] take the latter’s spouse as a wife. He [Joseph] discovered that she was [still] a virgin and she bore him two children. He [Joseph] established justice in Egypt and people became subject to him. We confer Our mercy on whomever We will and We do not waste the wage of the virtuous.\n",
        "TRANSLATION_18": "(Thus gave We power to Joseph in the land) the land of Egypt. (He was the owner of it) who could go in this land (where be pleased. We reach with our mercy) with prophethood and Islam (whom We will) whoever deserves it. (We lose not) We thwart not (the reward of the good) the reward of the believers who do good in their deeds and speech.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "12:56",
            "39:74",
            "23:84",
            "26:152",
            "21:75",
            "21:86",
            "38:28",
            "21:71",
            "91:6",
            "36:21"
        ],
        "BIBLE": [
            "prophets:hosea:2:14",
            "torah:genesis:3:6",
            "torah:leviticus:10:17",
            "torah:deuteronomy:2:19",
            "prophets:joshua:24:13",
            "writings:esther:4:8",
            "torah:deuteronomy:2:9",
            "torah:deuteronomy:2:12",
            "prophets:jeremiah:7:7",
            "prophets:i%20kings:5:23"
        ]
    }
}