{
    "VERSE": "12:57",
    "ARABIC": "وَلَأَجْرُ ٱلْءَاخِرَةِ خَيْرٌ لِّلَّذِينَ ءَامَنُوا۟ وَكَانُوا۟ يَتَّقُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "But the wages of the akhira are the best for people who have iman and fear their Lord.",
        "TRANSLATION_1": "And certainly the recompense of the life to come is better for those who believe and follow the right path.\n",
        "TRANSLATION_2": "Surely the reward of the Hereafter is better for those who believe and act in a God-fearing way.\n",
        "TRANSLATION_3": "The reward in the next life is certainly better for the faithful ones who have observed piety in this life.\n",
        "TRANSLATION_4": "And undoubtedly the reward of the Hereafter is better, for those who accept faith and remain pious.\n",
        "TRANSLATION_5": "And verily, the reward of the Hereafter is better for those who believed and had Taqwa.\n",
        "TRANSLATION_6": "And certainly the reward of the hereafter is much better for those who believe and guard (against evil).\n",
        "TRANSLATION_7": "Yet is the wage of the world to come better for those who believe, and are godfearing.\n",
        "TRANSLATION_8": "And the reward of the Hereafter is better, for those who believe and ward off (evil).\n",
        "TRANSLATION_9": "Yet the reward of the hereafter is best for those who believe and are mindful of God.\n",
        "TRANSLATION_10": "And surely the hire of the Here after is better for those who believe and ever fear.\n",
        "TRANSLATION_11": "And the reward of the Hereafter is surely better for those who have faith and are Godwary.\n",
        "TRANSLATION_12": "But verily the reward of the Hereafter is the best, for those who believe, and are constant in righteousness.\n",
        "TRANSLATION_13": "And verily, the reward of the Hereafter is better for those who believe and used to fear Allah and keep their duty to Him (by abstaining from all kinds of sins and evil deeds and by performing all kinds of righteous good deeds).\n",
        "TRANSLATION_14": "Indeed, the reward of the Everlasting Life is better for those who believe and are cautious.\n",
        "TRANSLATION_15": "But the reward of the Hereafter is better for those who believe and observed piety.\n",
        "TRANSLATION_16": "And the reward of the Hereafter is better for those who believed and were fearing Allah.\n",
        "TRANSLATION_17": "[12:57] Yet the wage of the Hereafter is better, than the wage of this world, for those who believe and are Godfearing. And so the years of drought arrived and afflicted the land of Canaan and Syria.\n",
        "TRANSLATION_18": "(And the reward of the Hereafter is better) than the reward of the life of this world, (for those who believe) in Allah and all the Scriptures and messengers (and ward off (evil)) ward off disbelief, idolatry and indecencies.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "12:57",
            "84:25",
            "41:8",
            "95:6",
            "93:4",
            "16:30",
            "77:17",
            "75:21",
            "23:61",
            "87:17"
        ],
        "BIBLE": [
            "prophets:isaiah:40:10",
            "writings:psalms:96:13",
            "writings:psalms:38:21",
            "writings:psalms:23:6",
            "prophets:judges:2:19",
            "writings:proverbs:10:16",
            "writings:ecclesiastes:4:9",
            "torah:numbers:32:11",
            "torah:exodus:21:23",
            "writings:psalms:90:2"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:13",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:4:12"
        ]
    }
}