{
    "VERSE": "12:58",
    "ARABIC": "وَجَآءَ إِخْوَةُ يُوسُفَ فَدَخَلُوا۟ عَلَيْهِ فَعَرَفَهُمْ وَهُمْ لَهُۥ مُنكِرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "The brothers of Yusuf came into his presence and he knew them but they did not know him.",
        "TRANSLATION_1": "The brothers of Joseph came (to Egypt) and visited him. He recognised them, though they did not recognise him.\n",
        "TRANSLATION_2": "And Joseph's brothers came to Egypt and presented themselves before him. He recognized them, but they did not know him.\n",
        "TRANSLATION_3": "Joseph's brothers came to him. When they entered his court, he recognized them. They did not know him.\n",
        "TRANSLATION_4": "And Yusuf’s brothers came and presented themselves before him, so he recognised them whereas they remained unaware of him.\n",
        "TRANSLATION_5": "And Yusuf's brethren came and they entered unto him, and he recognized them, but they recognized him not.\n",
        "TRANSLATION_6": "And Yusuf's brothers came and went in to him, and he knew them, while they did not recognize him.\n",
        "TRANSLATION_7": "And the brethren of Joseph came, and entered unto him, and he knew them, but they knew him not.\n",
        "TRANSLATION_8": "And Joseph's brethren came and presented themselves before him, and he knew them but they knew him not.\n",
        "TRANSLATION_9": "Joseph's brothers arrived and presented themselves before him. He recognized them, but they did not know him.\n",
        "TRANSLATION_10": "And the brethren of Yusuf came and entered unto him, and he recognized them, while they recognized him not.\n",
        "TRANSLATION_11": "[After some years] the brothers of Joseph came and entered his presence. He recognized them, but they did not recognize him.\n",
        "TRANSLATION_12": "Then came Joseph's brethren: they entered his presence, and he knew them, but they knew him not.\n",
        "TRANSLATION_13": "And Yusuf's (Joseph) brethren came and they entered unto him, and he recognized them, but they recognized him not.\n",
        "TRANSLATION_14": "Joseph's brothers came and presented themselves before him. He recognized them, but they did not know him.\n",
        "TRANSLATION_15": "And Joseph's brothers came, and entered into his presence. He recognized them, but they did not recognize him.\n",
        "TRANSLATION_16": "And the brothers of Joseph came [seeking food], and they entered upon him; and he recognized them, but he was to them unknown.\n",
        "TRANSLATION_17": "[12:58] And Joseph’s brothers came — except for Benjamin — in order to secure provisions, when they found out that the [new] Court officer of Egypt was providing food at its [fair] price; and they entered to him, and he recognised them, to be his brothers, but they did not recognise him, not knowing who he was, because it had been a long time since they had seen him, and because they supposed that he had died. They spoke to him in Hebrew and he said to them, as if reproaching them: ‘What brings you to my land?’ They replied, ‘[We have come] for supplies’. He said, ‘You might be spies!’ They said, ‘God forbid!’ He said, ‘So where are you from?’ They said, ‘From the land of Canaan, our father is Jacob, the prophet of God.’ He said, ‘Does he have children other than you?’ They said, ‘Yes. We used to be twelve, but the youngest of us passed away: he perished in the wild. He was the most beloved to him [our father] from among us; only his full brother remains, and so he keeps him by his side, in order to comfort himself with him in place of the other.’ He [Joseph] commanded that they be given lodging and treated well.\n",
        "TRANSLATION_18": "(And Joseph's brethren came) to Egypt: there were ten of them (and presented themselves before him) before Joseph, (and he knew them) Joseph knew that they were his brothers (but they knew him not) they did not know he was their brother.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "12:58",
            "12:7",
            "12:89",
            "12:69",
            "26:36",
            "7:111",
            "26:161",
            "26:106",
            "70:12",
            "28:11"
        ],
        "BIBLE": [
            "torah:genesis:41:46",
            "torah:genesis:38:9",
            "torah:genesis:42:3",
            "torah:exodus:2:11",
            "torah:genesis:42:8",
            "torah:genesis:45:4",
            "torah:genesis:27:30",
            "writings:psalms:81:6",
            "torah:genesis:47:15",
            "torah:numbers:13:22"
        ]
    }
}