{
    "VERSE": "12:61",
    "ARABIC": "قَالُوا۟ سَنُرَٰوِدُ عَنْهُ أَبَاهُ وَإِنَّا لَفَٰعِلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "They said, 'We will request our father for him. That is something we will surely do.'",
        "TRANSLATION_1": "They said: \"We shall request his father, and will certainly do that.\"\n",
        "TRANSLATION_2": "They said: \"We will surely try to prevail over our father to send him. Be sure we shall do so.\"\n",
        "TRANSLATION_3": "Joseph's brothers said, \"We shall try to influence his father to send him with us and we shall be successful\".\n",
        "TRANSLATION_4": "They said, “We will seek him from his father – this we must surely do.”\n",
        "TRANSLATION_5": "They said: \"We shall try to get permission (for him) from his father, and verily, we shall do it.\"\n",
        "TRANSLATION_6": "They said: We will strive to make his father yield in respect of him, and we are sure to do (it).\n",
        "TRANSLATION_7": "They said, 'We will solicit him of our father; that we will do.'\n",
        "TRANSLATION_8": "They said: We will try to win him from his father: that we will surely do.\n",
        "TRANSLATION_9": "They replied, \"We shall try to persuade his father to send him with us. We shall do [our utmost]!\"\n",
        "TRANSLATION_10": "They said: we will surely entice away his father from him; and verily we are doers.\n",
        "TRANSLATION_11": "They said, ‘We will solicit him from his father. [That] we will surely do.’\n",
        "TRANSLATION_12": "They said: \"We shall certainly seek to get our wish about him from his father: Indeed we shall do it.\"\n",
        "TRANSLATION_13": "They said: \"We shall try to get permission (for him) from his father, and verily, we shall do it.\"\n",
        "TRANSLATION_14": "They replied: 'We will ask our father for him. This we will surely do'\n",
        "TRANSLATION_15": "They said, “We will solicit him from his father. We will surely do.”\n",
        "TRANSLATION_16": "They said, \"We will attempt to dissuade his father from [keeping] him, and indeed, we will do [it].\"\n",
        "TRANSLATION_17": "[12:61] They said, ‘We will try to tempt his father away from him, that is, we will try our hardest to seek him from him. That we will surely do’.\n",
        "TRANSLATION_18": "(They said: We will try to win him from his father) we will ask his father and try to entice his father to let him come with us: (that we will surely do) we surely guarantee that we will bring him with us.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "12:61",
            "26:86",
            "37:69",
            "21:53",
            "12:11",
            "27:67",
            "12:97",
            "37:137",
            "26:55",
            "15:9"
        ],
        "BIBLE": [
            "torah:genesis:46:3",
            "prophets:i%20kings:20:34",
            "torah:genesis:19:32",
            "torah:deuteronomy:30:13",
            "prophets:i%20samuel:28:2",
            "writings:nehemiah:2:4",
            "torah:deuteronomy:30:12",
            "prophets:jeremiah:20:15",
            "torah:genesis:19:34",
            "torah:genesis:37:11"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:11"
        ]
    }
}