{
    "VERSE": "12:62",
    "ARABIC": "وَقَالَ لِفِتْيَٰنِهِ ٱجْعَلُوا۟ بِضَٰعَتَهُمْ فِى رِحَالِهِمْ لَعَلَّهُمْ يَعْرِفُونَهَآ إِذَا ٱنقَلَبُوٓا۟ إِلَىٰٓ أَهْلِهِمْ لَعَلَّهُمْ يَرْجِعُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "He told his serving men, 'Put back their goods into their saddlebags for them to find when they arrive back to their families so that perhaps they will return again.'",
        "TRANSLATION_1": "Then he ordered his servants: \"Put their money back in their packs: They may find it on reaching home, and perhaps come again.\"\n",
        "TRANSLATION_2": "And Joseph said to his servants: \"Put surreptitiously in their packs the goods they had given in exchange for corn.\" Joseph did so expecting that they would find it when they returned home. Feeling grateful for this generosity, they might be inclined to return to him.\n",
        "TRANSLATION_3": "Then Joseph told his people to put his brothers' money back into their bags so that perhaps they would recognize it, when at home, and come back to Egypt once again.\n",
        "TRANSLATION_4": "He said to his slaves, “Place their means back into their sacks, perhaps they may recognise it when they return to their homes, perhaps they may come again.”\n",
        "TRANSLATION_5": "And [Yusuf] told his servants to put their money into their bags, so that they might know it when they go back to their people; in order that they might come again.\n",
        "TRANSLATION_6": "And he said to his servants: Put their money into their bags that they may recognize it when they go back to their family, so that they may come back.\n",
        "TRANSLATION_7": "He said to his pages, 'Put their merchandise in their saddlebags; haply they will recognize it when they have turned to their people; haply they will return.\n",
        "TRANSLATION_8": "He said unto his young men: Place their merchandise in their saddlebags, so that they may know it when they go back to their folk, and so will come again.\n",
        "TRANSLATION_9": "Joseph said to his servants, \"Put their money back into their saddlebags, so that they will recognize it when they return home to their family; thus they may come back.\"\n",
        "TRANSLATION_10": "And he said to his pages: place their goods in their packs, haply they will recognize them when they reach back to their household: haply they will return.\n",
        "TRANSLATION_11": "He said to his servants, ‘Put their money [back] into their saddlebags. Maybe they will recognize it when they return to their folks, and maybe they will come back [again].’\n",
        "TRANSLATION_12": "And (Joseph) told his servants to put their stock-in-trade (with which they had bartered) into their saddle-bags, so they should know it only when they returned to their people, in order that they might come back.\n",
        "TRANSLATION_13": "And [Yusuf (Joseph)] told his servants to put their money (with which they had bought the corn) into their bags, so that they might know it when they go back to their people, in order that they might come back.\n",
        "TRANSLATION_14": "Then he said to his attendants: 'Put their merchandise in their saddlebags, hopefully they will recognize it when they return to their people. Perhaps they will come back'\n",
        "TRANSLATION_15": "He said to his servants, “Put their goods in their saddlebags; perhaps they will recognize them when they return to their families, and maybe they will come back.”\n",
        "TRANSLATION_16": "And [Joseph] said to his servants, \"Put their merchandise into their saddlebags so they might recognize it when they have gone back to their people that perhaps they will [again] return.\"\n",
        "TRANSLATION_17": "[12:62] And he said to his young men (li-fityatihi: a variant reading has li-fityānihi, ‘his servants’): ‘Place their merchandise, that [money] with which they bought the supplies, and these were a few dirhams, in their saddlebags, their [supply] sacks, so that they may recognise it when they return to their folk, and empty their sacks, and so come back’, to us, deeming it unlawful to retain these [monies].\n",
        "TRANSLATION_18": "(He) Joseph (said unto his young men) his servants: (Place their merchandise) hide their money (in their saddlebags so that they may know it) such that they know the favour I am bestowing upon them; it is also said that this means: such that they realise it is their money and bring it back to me, (when they go back to their folk) when they go back to their father, (and so will come again) a second time.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "12:62",
            "84:9",
            "83:31",
            "84:13",
            "75:33",
            "12:88",
            "28:12",
            "36:50",
            "24:27",
            "52:26"
        ],
        "BIBLE": [
            "torah:genesis:27:37",
            "writings:ezra:8:17",
            "prophets:jeremiah:30:3",
            "torah:genesis:47:15",
            "prophets:jeremiah:35:15",
            "writings:ii%20chronicles:9:12",
            "prophets:amos:4:6",
            "prophets:i%20samuel:25:12",
            "torah:genesis:43:23",
            "torah:numbers:32:9"
        ]
    }
}