{
    "VERSE": "12:69",
    "ARABIC": "وَلَمَّا دَخَلُوا۟ عَلَىٰ يُوسُفَ ءَاوَىٰٓ إِلَيْهِ أَخَاهُ قَالَ إِنِّىٓ أَنَا۠ أَخُوكَ فَلَا تَبْتَئِسْ بِمَا كَانُوا۟ يَعْمَلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Then when they entered into Yusuf's presence, he drew his brother close to him and said, 'I am your brother. Do not be distressed concerning all the things they used to do.'",
        "TRANSLATION_1": "When they came to Joseph he made his brother his guest, and said: \"I am your brother. So do not grieve for what they had done.\"\n",
        "TRANSLATION_2": "When they presented themselves before Joseph, he took his brother aside to himself and said: \"Verily I am your own brother Joseph; so do not grieve over the manner they have treated you.\"\n",
        "TRANSLATION_3": "When they entered Joseph's court, he gave lodging to his own brother (Benjamin) and said, \"I am your brother. Do not feel sad about whatever they had done\".\n",
        "TRANSLATION_4": "And when they entered in the company Yusuf, he seated his brother close to him and said, “Be assured, I really am your brother – therefore do not grieve for what they do.”\n",
        "TRANSLATION_5": "And when they went in before Yusuf, he took his brother (Binyamin) to himself and said: \"Verily, I am your brother, so grieve not for what they used to do.\"\n",
        "TRANSLATION_6": "And when they went in to Yusuf. he lodged his brother with himself, saying: I am your brother, therefore grieve not at what they do.\n",
        "TRANSLATION_7": "And when they entered unto Joseph, he said, taking his brother into his arms, 'I am thy brother; so do not despair of that they have done.'\n",
        "TRANSLATION_8": "And when they went in before Joseph, he took his brother unto him, saying: Lo! I, even I, am thy brother, therefore sorrow not for what they did.\n",
        "TRANSLATION_9": "When they presented themselves before Joseph, he took his brother [Benjamin] aside. He said, \"I am your brother, so do not feel distressed about whatever they have been doing.\"\n",
        "TRANSLATION_10": "And when they entered unto Yusuf, he betook his full brother unto himself, and said: verily I am thine own brother Yusuf, so sorrow not over that which they have been working.\n",
        "TRANSLATION_11": "When they entered into the presence of Joseph, he set his brother close to himself, and said, ‘Indeed I am your brother, so do not sorrow for what they used to do.’\n",
        "TRANSLATION_12": "Now when they came into Joseph's presence, he received his (full) brother to stay with him. He said (to him): \"Behold! I am thy (own) brother; so grieve not at aught of their doings.\"\n",
        "TRANSLATION_13": "And when they went in before Yusuf (Joseph), he betook his brother (Benjamin) to himself and said: \"Verily! I am your brother, so grieve not for what they used to do.\"\n",
        "TRANSLATION_14": "When they presented themselves before Joseph, he took his brother in his arms, and said: 'I am your brother. Do not grieve at what they did'\n",
        "TRANSLATION_15": "And when they entered into the presence of Joseph, he embraced his brother, and said, “I am your brother; do not be saddened by what they used to do.”\n",
        "TRANSLATION_16": "And when they entered upon Joseph, he took his brother to himself; he said, \"Indeed, I am your brother, so do not despair over what they used to do [to me].\"\n",
        "TRANSLATION_17": "[12:69] And when they entered to Joseph, he took his brother into his arms, saying [to him]: ‘Truly it is me, your brother, therefore do not despair, do not be grieved, at what they did’, in the way of envying us. He commanded him not to tell them anything, and he [Joseph] agreed with him that he would devise a trick to keep him [Benjamin] with him.\n",
        "TRANSLATION_18": "(And when they went in before Joseph, he took his brother) from both his father and mother (unto himself) he gave audience to his brother Benjamin and made his other brothers wait, (saying: Lo! I, even I, am your brother) in the position of your deceased brother, (therefore sorrow not) do not be saddened (for what they did) for the alienation, insults and vilification you face from your brothers.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "12:69",
            "12:89",
            "12:58",
            "36:76",
            "12:90",
            "20:42",
            "11:70",
            "16:34",
            "11:36",
            "26:106"
        ],
        "BIBLE": [
            "writings:nehemiah:2:1",
            "prophets:ii%20kings:10:15",
            "writings:esther:8:2",
            "writings:job:1:21",
            "prophets:judges:14:19",
            "prophets:judges:15:6",
            "prophets:judges:14:9",
            "prophets:ii%20kings:8:9",
            "torah:genesis:47:15",
            "writings:ruth:4:13"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:5:1",
            
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:3:6",
            "Sefer%20Yetzirah:4:12"
        ]
    }
}