{
    "VERSE": "12:7",
    "ARABIC": "لَّقَدْ كَانَ فِى يُوسُفَ وَإِخْوَتِهِۦٓ ءَايَٰتٌ لِّلسَّآئِلِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "In Yusuf and his brothers there are Signs for every one of those who wants to ask.",
        "TRANSLATION_1": "In the story of Joseph and his brothers are lessons for those who inquire.\n",
        "TRANSLATION_2": "Verily in the story of Joseph and his brothers there are many signs for those who inquire (about the truth).\n",
        "TRANSLATION_3": "In the story of Joseph and his brothers, there is evidence (of the truth) for those who seek to know.\n",
        "TRANSLATION_4": "Indeed in Yusuf and his brothers are signs* for those who enquire**. (* Of the truthfulness of Prophet Mohammed – peace and blessings be upon him. ** The Jews who enquired about their story.)\n",
        "TRANSLATION_5": "Verily, in Yusuf and his brethren there were Ayat for those who ask.\n",
        "TRANSLATION_6": "Certainly in Yusuf and his brothers there are signs for the inquirers.\n",
        "TRANSLATION_7": "(In Joseph and his brethren were signs for those who ask questions.)\n",
        "TRANSLATION_8": "Verily in Joseph and his brethren are signs (of Allah's Sovereignty) for the inquiring.\n",
        "TRANSLATION_9": "Surely, in Joseph and his brothers there are signs for the inquirers.\n",
        "TRANSLATION_10": "Assuredly in Yusuf and his brethren there have been signs for the inquirers.\n",
        "TRANSLATION_11": "In Joseph and his brothers there are certainly signs for the seekers.\n",
        "TRANSLATION_12": "Verily in Joseph and his brethren are signs (or symbols) for seekers (after Truth).\n",
        "TRANSLATION_13": "Verily, in Yusuf (Joseph) and his brethren, there were Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) for those who ask.\n",
        "TRANSLATION_14": "Indeed, in Joseph and his brothers there were signs for those who inquire.\n",
        "TRANSLATION_15": "In Joseph and his brothers are lessons for the seekers.\n",
        "TRANSLATION_16": "Certainly were there in Joseph and his brothers signs for those who ask,\n",
        "TRANSLATION_17": "[12:7] Verily in, the tale of, Joseph and his brethren — who were eleven — are signs, lessons, for those who inquire, about their tale.\n",
        "TRANSLATION_18": "(Verily in Joseph) in the narrative of Joseph (and his brethren are signs (of Allah's Sovereignty)) lessons (for the inquiring) about his story. This verse was revealed about a Jewish rabbi.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "12:7",
            "12:58",
            "20:42",
            "23:30",
            "23:45",
            "54:15",
            "15:75",
            "15:77",
            "11:96",
            "40:23"
        ],
        "BIBLE": [
            "torah:genesis:42:8",
            "prophets:i%20samuel:20:7",
            "writings:psalms:74:9",
            "writings:esther:9:30",
            "torah:genesis:49:26",
            "prophets:jeremiah:28:9",
            "torah:exodus:31:13",
            "writings:ezra:9:12",
            "writings:nehemiah:5:8",
            "prophets:isaiah:59:8"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:6:3"
        ]
    }
}