{
    "VERSE": "12:73",
    "ARABIC": "قَالُوا۟ تَٱللَّهِ لَقَدْ عَلِمْتُم مَّا جِئْنَا لِنُفْسِدَ فِى ٱلْأَرْضِ وَمَا كُنَّا سَٰرِقِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "They said, 'By Allah, you know we did not come to corrupt the land and that we are not thieves.'",
        "TRANSLATION_1": "They said: \"We swear by God. You know we did not come to commit any crime in the land, nor are we thieves.\"\n",
        "TRANSLATION_2": "They said: \"By Allah, you certainly know that we did not come to act corruptly in this land, nor are we those who steal.\"\n",
        "TRANSLATION_3": "Joseph's brothers said, \"We swear by God, as you know, that we have not come to spread evil in the land and that we have not committed any theft.\"\n",
        "TRANSLATION_4": "They said, “By Allah, you know very well that we did not come here to cause turmoil in the land, and nor are we thieves!”\n",
        "TRANSLATION_5": "They said: \"By Allah! Indeed you know that we came not to make mischief in the land, and we are no thieves!\"\n",
        "TRANSLATION_6": "They said: By Allah! you know for certain that we have not come to make mischief in the land, and we are not thieves.\n",
        "TRANSLATION_7": "By God,' they said, 'you know well that we came not to work corruption in the land. We are not robbers.'\n",
        "TRANSLATION_8": "They said: By Allah, well ye know we came not to do evil in the land, and are no thieves.\n",
        "TRANSLATION_9": "They said, \"By God, you [ought to] know we have not come here to cause any trouble in the land. We are not thieves!\"\n",
        "TRANSLATION_10": "They said: by Allah! assuredly ye know that we came not to work corruption in the land, nor we have been thieves.\n",
        "TRANSLATION_11": "They said, ‘By Allah! You certainly know that we did not come to make trouble in this country, and we are not thieves.’\n",
        "TRANSLATION_12": "(The brothers) said: \"By Allah! well ye know that we came not to make mischief in the land, and we are no thieves!\"\n",
        "TRANSLATION_13": "They said: \"By Allah! Indeed you know that we came not to make mischief in the land, and we are no thieves!\"\n",
        "TRANSLATION_14": "By Allah' they said, 'you know we did not come to do evil in this land. We are not thieves'\n",
        "TRANSLATION_15": "They said, “By God, you know we did not come to cause trouble in the land, and we are not thieves.”\n",
        "TRANSLATION_16": "They said, \"By Allah, you have certainly known that we did not come to cause corruption in the land, and we have not been thieves.\"\n",
        "TRANSLATION_17": "[12:73]   They said, ‘By God,’ (ta’Llāhi is an oath, entailing astonishment) ‘You know very well that we did not come to work corruption in the land, and we are certainly not thieves’, that is, we have never stolen [anything].\n",
        "TRANSLATION_18": "(They said: By Allah, well ye know) people of Egypt (we came not to do evil in the land) the land of Egypt by stealing or harming people, (and are no thieves) we have not taken what you are looking for.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "12:73",
            "12:91",
            "21:21",
            "72:12",
            "8:33",
            "53:31",
            "3:141",
            "71:19",
            "27:25",
            "43:60"
        ],
        "BIBLE": [
            "torah:exodus:32:23",
            "prophets:joshua:23:7",
            "torah:exodus:34:10",
            "prophets:joshua:9:6",
            "writings:esther:5:5",
            "prophets:isaiah:5:19",
            "torah:exodus:32:1",
            "writings:daniel:5:8",
            "writings:job:10:2",
            "writings:psalms:74:8"
        ]
    }
}