{
    "VERSE": "12:75",
    "ARABIC": "قَالُوا۟ جَزَٰٓؤُهُۥ مَن وُجِدَ فِى رَحْلِهِۦ فَهُوَ جَزَٰٓؤُهُۥ كَذَٰلِكَ نَجْزِى ٱلظَّٰلِمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "They said, 'Its reparation shall be him in the saddlebags of whom it is discovered. With us that is how wrongdoers are repaid.'",
        "TRANSLATION_1": "The punishment for that (should be),\" they said, \"that he in whose luggage it is found should be held as punishment. This is how we repay the wrong-doers.\"\n",
        "TRANSLATION_2": "They replied: \"He in whose saddlebag the cup is found, he himself shall be its recompense.\" Thus do we punish the wrong-doers.\n",
        "TRANSLATION_3": "Joseph's brothers replied, \"In whosoever baggage it is found, that person will be your bondsman. Thus is the punishment of the unjust.\"\n",
        "TRANSLATION_4": "They said, “The punishment for it is that he in whose bag it shall be found, shall himself become a slave for it; this is how we punish the unjust.”\n",
        "TRANSLATION_5": "They [Yusuf's brothers] said: \"His penalty should be that he, in whose bag it is found, should be held for the punishment (of the crime). Thus we punish the wrongdoers!\"\n",
        "TRANSLATION_6": "They said: The requital of this is that the person in whose bag it is found shall himself be (held for) the satisfaction thereof; thus do we punish the wrongdoers.\n",
        "TRANSLATION_7": "They said, 'This shall be its recompense -- in whoever's saddlebag the goblet is found, he shall be its recompense. So we recompense the evildoers.'\n",
        "TRANSLATION_8": "They said: The penalty for it! He in whose bag (the cup) is found, he is the penalty for it. Thus we requite wrong-doers.\n",
        "TRANSLATION_9": "They replied, \"The penalty should be that he in whose saddlebag it is found, should be held [as bondman] to atone for the crime. That is how we punish the wrongdoers.\"\n",
        "TRANSLATION_10": "They said: his meed shall be that he, in whose pack it is found, shall himself be recompense thereof. Thus we reccmpense the wrong- doers.\n",
        "TRANSLATION_11": "They said, ‘The requital for it shall be that he in whose saddlebag it is found shall give himself over as its requital. Thus do we requite the wrongdoers.’\n",
        "TRANSLATION_12": "They said: \"The penalty should be that he in whose saddle-bag it is found, should be held (as bondman) to atone for the (crime). Thus it is we punish the wrong-doers!\"\n",
        "TRANSLATION_13": "They [Yusuf's (Joseph) brothers] said: \"The penalty should be that he, in whose bag it is found, should be held for the punishment (of the crime). Thus we punish the Zalimun (wrong-doers, etc.)!\"\n",
        "TRANSLATION_14": "They replied: 'Its recompense in whosoever's saddle bag it is found, he shall be its recompense. As such we punish the harmdoers'\n",
        "TRANSLATION_15": "They said, “His punishment, if it is found in his bag: he will belong to you. Thus we penalize the guilty.”\n",
        "TRANSLATION_16": "[The brothers] said, \"Its recompense is that he in whose bag it is found - he [himself] will be its recompense. Thus do we recompense the wrongdoers.\"\n",
        "TRANSLATION_17": "[12:75] They said, ‘His requital (qālū jazā’uhu: the subject, the predicate of which is [the following, man wujida fī rahlihi) shall be [the requital of] him in whose saddlebag it is found, that he be enslaved — this is then reiterated by His words: He, the thief, shall be the requital for it, that is, [for] the stolen item, and nothing else: this was the customary practice of the family of Jacob. Thus, [with such] a requital, do we requite those who do evil’, through theft. They thus permitted Joseph to have their saddlebags searched.\n",
        "TRANSLATION_18": "(They said: The penalty for it!) the penalty against (He in whose bag (the cup) is found, he is the penalty for it) is that he is to be taken as a slave. (Thus we requite wrong-doers) thus we punish the thieves in our land.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "12:75",
            "12:74",
            "56:24",
            "20:76",
            "46:14",
            "17:63",
            "39:34",
            "5:85",
            "51:35",
            "59:17"
        ],
        "BIBLE": [
            "writings:nehemiah:5:8",
            "prophets:i%20kings:7:26",
            "torah:leviticus:10:3",
            "torah:genesis:44:17",
            "writings:ii%20chronicles:4:5",
            "writings:nehemiah:5:7",
            "torah:genesis:44:16",
            "prophets:jeremiah:2:3",
            "prophets:i%20samuel:10:27",
            "prophets:ii%20kings:7:9"
        ]
    }
}