{
    "VERSE": "12:79",
    "ARABIC": "قَالَ مَعَاذَ ٱللَّهِ أَن نَّأْخُذَ إِلَّا مَن وَجَدْنَا مَتَٰعَنَا عِندَهُۥٓ إِنَّآ إِذًا لَّظَٰلِمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "He said, 'Allah forbid that we should take anyone but him with whom our goods were found. In that case we would clearly be wrongdoers.'",
        "TRANSLATION_1": "May God forgive us,\" he said, \"if we hold any one but him with whom we found our property, or else we would be unjust.\"\n",
        "TRANSLATION_2": "Joseph said: \"Allah forbid that we should seize any except him with whom we found our good. Were we to do so, we would surely be one of the wrong-doers.\"\n",
        "TRANSLATION_3": "He replied, \"God forbid! How could I take someone in place of the thief? In doing so I would be committing injustice.\"\n",
        "TRANSLATION_4": "He said, “The refuge of Allah from that we should take anyone except him with whom our property was found – we would then surely be unjust.”\n",
        "TRANSLATION_5": "He said: \"Allah forbid, that we should take anyone but him with whom we found our property. Indeed (if we did so), we should be wrongdoers.\"\n",
        "TRANSLATION_6": "He said: Allah protect us that we should seize other than him with whom we found our property, for then most surely we would be unjust.\n",
        "TRANSLATION_7": "He said, 'God forbid that we should take any other but him in whose possession we found the goods; for if we did so, we would be evildoers.'\n",
        "TRANSLATION_8": "He said: Allah forbid that we should seize save him with whom we found our property; then truly we should be wrong-doers.\n",
        "TRANSLATION_9": "He replied, \"God forbid that we should take anyone other than the person on whom we found our property. In that case, we would clearly be wrongdoers.\"\n",
        "TRANSLATION_10": "He said: Allah forbid that we should take anyone but him with whom we found our stuff; verily then we should be the wrong-doers.\n",
        "TRANSLATION_11": "He said, ‘God forbid that we should detain anyone except him with whom we found our wares, for then we would indeed be wrongdoers.’\n",
        "TRANSLATION_12": "He said: \"Allah forbid that we take other than him with whom we found our property: indeed (if we did so), we should be acting wrongfully.\n",
        "TRANSLATION_13": "He said: \"Allah forbid, that we should take anyone but him with whom we found our property. Indeed (if we did so), we should be Zalimun (wrong-doers).\"\n",
        "TRANSLATION_14": "He replied: 'Allah forbid that we should seize any but he with whom our property was found, for then we should be harmdoers'\n",
        "TRANSLATION_15": "He said, “God forbid that we should arrest anyone except him in whose possession we found our property; for then we would be unjust.”\n",
        "TRANSLATION_16": "He said, \"[I seek] the refuge of Allah [to prevent] that we take except him with whom we found our possession. Indeed, we would then be unjust.\"\n",
        "TRANSLATION_17": "[12:79] He said, ‘God forbid (ma‘ādha’Llāhi, [lit.] ‘refuge is with God’, is in the accusative because it is a verbal noun, the verb having been omitted and placed in a genitive annexation with its direct object, in other words, [understand it as] na‘ūdhu bi’Llāhi, ‘we seek refuge with God’) that we should take anyone save him with whom we found our property — he did not say ‘[save] him who stole [our property]’, being careful not to lie; for then truly — if we were to take anyone other than him — we would be evildoers’.\n",
        "TRANSLATION_18": "(He said) Joseph said to them: (Allah forbid that we should seize) for the crime of theft (save him with whom we found our property; then truly we should be wrong-doers) by arresting someone with whom we did not find our property.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "12:79",
            "61:3",
            "27:47",
            "13:39",
            "67:26",
            "9:52",
            "46:23",
            "3:59",
            "37:152",
            "12:17"
        ],
        "BIBLE": [
            "prophets:ii%20kings:7:9",
            "writings:nehemiah:5:8",
            "torah:exodus:5:1",
            "writings:nehemiah:2:17",
            "torah:leviticus:10:3",
            "prophets:jeremiah:2:13",
            "prophets:isaiah:18:4",
            "prophets:i%20samuel:10:27",
            "prophets:isaiah:36:21",
            "writings:nehemiah:8:11"
        ]
    }
}