{
    "VERSE": "12:81",
    "ARABIC": "ٱرْجِعُوٓا۟ إِلَىٰٓ أَبِيكُمْ فَقُولُوا۟ يَٰٓأَبَانَآ إِنَّ ٱبْنَكَ سَرَقَ وَمَا شَهِدْنَآ إِلَّا بِمَا عَلِمْنَا وَمَا كُنَّا لِلْغَيْبِ حَٰفِظِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Return now to your father and say to him, \"Your son stole, father. We can do no more than testify to what we know and we are not the guardians of the Unseen.",
        "TRANSLATION_1": "So, go to your father and tell him: 'O father, your son has committed a theft. We bear witness to only what we know; we could not prevent the unknown.\n",
        "TRANSLATION_2": "So go back to your father and tell him: \"Father! Your son has certainly been guilty of stealing. We did not see him stealing but testify according to what we know, and obviously we had no power to keep watch over that what is altogether hidden from us.\n",
        "TRANSLATION_3": "Go to our father and tell him, 'Father, your son committed theft. We say only what we have seen and we have no control over the unseen.\n",
        "TRANSLATION_4": "“Return to your father and then submit, ‘O our father! Indeed your son has stolen; we were witness only to what we know and we were not guardians of the unseen.’\n",
        "TRANSLATION_5": "Return to your father and say, `O our father! Verily, your son has stolen, and we testify not except according to what we know, and we could not know the Unseen!\n",
        "TRANSLATION_6": "Go back to your father and say: O our father! surely your son committed theft, and we do not bear witness except to what we have known, and we could not keep watch over the unseen:\n",
        "TRANSLATION_7": "Return you all to your father, and say, \"Father, thy son stole; we do not testify except that we know; we were no guardians of the Unseen.\n",
        "TRANSLATION_8": "Return unto your father and say: O our father! Lo! thy son hath stolen. We testify only to that which we know; we are not guardians of the Unseen.\n",
        "TRANSLATION_9": "Return to your father and say, 'Father, your son has committed a theft. We testify only to what we know. How could we guard against the unforeseen?\n",
        "TRANSLATION_10": "Return unto your father, and say: our father! verily thy son hath stolen, and we testify not save according to that which we know; and of the unseen we could not be guards.\n",
        "TRANSLATION_11": "Go back to your father, and say, ‘‘Father! Your son has indeed committed theft, and we testified only to what we knew, and we could not have forestalled the unseen.\n",
        "TRANSLATION_12": "Turn ye back to your father, and say, 'O our father! behold! thy son committed theft! we bear witness only to what we know, and we could not well guard against the unseen!\n",
        "TRANSLATION_13": "Return to your father and say, 'O our father! Verily, your son (Benjamin) has stolen, and we testify not except according to what we know, and we could not know the unseen!\n",
        "TRANSLATION_14": "Return, all of you to your father and say to him: 'Father, your son has committed a theft. We testify only to what we know. How could we guard against the unforeseen?\n",
        "TRANSLATION_15": "“Go back to your father, and say, ‘Our father, your son has stolen. We testify only to what we know, and we could not have prevented the unforeseen.’”\n",
        "TRANSLATION_16": "Return to your father and say, \"O our father, indeed your son has stolen, and we did not testify except to what we knew. And we were not witnesses of the unseen,\n",
        "TRANSLATION_17": "[12:81] Go back to your father and say, “O our father, your son has indeed stolen and we testified, against him, only regarding what we knew, from the certainty of having seen the [king’s] cup in his saddlebag; we could not have guarded against the Unseen, that which was hidden from us, when we gave our pledge: had we known that he would steal, we would not have taken him [with us to Egypt].\n",
        "TRANSLATION_18": "Judah then said: (Return) my brothers (unto your father and say: our father! Lo! thy son hath stolen) the king's golden cup; it is also said that this means: your son was taken for stealing. (We testify only to that which we know) we saw the stolen cup found in his bag; (we are not guardians of the Unseen) he said: if we knew the unseen, we would not have taken him; it is also said that this means: we could not look after him at night.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "12:81",
            "26:86",
            "43:16",
            "2:33",
            "12:11",
            "81:24",
            "12:97",
            "62:8",
            "19:42",
            "12:17"
        ],
        "BIBLE": [
            "torah:deuteronomy:33:9",
            "prophets:ii%20kings:20:5",
            "prophets:ii%20samuel:15:34",
            "prophets:i%20samuel:20:9",
            "prophets:jeremiah:32:8",
            "torah:genesis:31:3",
            "prophets:isaiah:38:5",
            "torah:leviticus:5:1",
            "prophets:zechariah:1:4",
            "torah:exodus:3:16"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:3"
        ]
    }
}