{
    "VERSE": "12:85",
    "ARABIC": "قَالُوا۟ تَٱللَّهِ تَفْتَؤُا۟ تَذْكُرُ يُوسُفَ حَتَّىٰ تَكُونَ حَرَضًا أَوْ تَكُونَ مِنَ ٱلْهَٰلِكِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "They said, 'By Allah, you will not ever cease to mention Yusuf, till you waste away or are among the people of the grave!'",
        "TRANSLATION_1": "By God,\" said they, \"you will never stop thinking of Joseph till you are consumed or perish.\"\n",
        "TRANSLATION_2": "The sons said: \"By Allah! You will continue to remember Joseph until you will either consume yourself with grief, or will die.\"\n",
        "TRANSLATION_3": "They said, \"You are always remembering Joseph. By God, it will either make you sick or you will die\".\n",
        "TRANSLATION_4": "They said, “By Allah, you will keep remembering Yusuf till your health fails you or you lose your life.”\n",
        "TRANSLATION_5": "They said: \"By Allah! You will never cease remembering Yusuf until you become weak with old age, or until you be of the dead.\"\n",
        "TRANSLATION_6": "They said: By Allah! you will not cease to remember Yusuf until you are a prey to constant disease or (until) you are of those who perish.\n",
        "TRANSLATION_7": "By God,' they said, 'thou wilt never cease mentioning Joseph till thou art consumed, or among the perishing.'\n",
        "TRANSLATION_8": "They said: By Allah, thou wilt never cease remembering Joseph till thy health is ruined or thou art of those who perish!\n",
        "TRANSLATION_9": "They said, \"By God, will you keep on remembering Joseph until your health is ruined, and you die?\"\n",
        "TRANSLATION_10": "They said: by Allah! thou wilt not cease remembering Yusuf until thou art wizened or thou be of the dead.\n",
        "TRANSLATION_11": "They said, ‘By Allah! You will go on remembering Joseph until you wreck your health or perish.’\n",
        "TRANSLATION_12": "They said: \"By Allah! (never) wilt thou cease to remember Joseph until thou reach the last extremity of illness, or until thou die!\"\n",
        "TRANSLATION_13": "They said: \"By Allah! You will never cease remembering Yusuf (Joseph) until you become weak with old age, or until you be of the dead.\"\n",
        "TRANSLATION_14": "They said: 'By Allah, will you not cease to mention Joseph until you are consumed, or are among the perishing'\n",
        "TRANSLATION_15": "They said, “By God, you will not stop remembering Joseph, until you have ruined your health, or you have passed away.”\n",
        "TRANSLATION_16": "They said, \"By Allah, you will not cease remembering Joseph until you become fatally ill or become of those who perish.\"\n",
        "TRANSLATION_17": "[12:85] They said, ‘By God, you will never cease remembering Joseph until you are consumed, on the verge of perishing, on account of your illness (it [haradan, ‘consumed’] is a verbal noun equally [applicable] to one person or more) or you are of those who perish’, [of] the dead.\n",
        "TRANSLATION_18": "(They said) i.e. his children and his grandchildren: (By Allah, thou wilt never cease remembering Joseph till your health is ruined or you art of those who perish) through death!\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "12:85",
            "21:21",
            "39:57",
            "9:43",
            "2:15",
            "12:73",
            "3:141",
            "39:66",
            "71:19",
            "29:11"
        ],
        "BIBLE": [
            "prophets:ezekiel:11:13",
            "torah:exodus:23:13",
            "prophets:i%20samuel:8:5",
            "writings:nehemiah:2:4",
            "prophets:i%20kings:19:2",
            "torah:exodus:34:10",
            "prophets:joshua:7:19",
            "prophets:jeremiah:15:14",
            "prophets:i%20samuel:9:27",
            "torah:genesis:46:3"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:4:8"
        ]
    }
}