{
    "VERSE": "12:86",
    "ARABIC": "قَالَ إِنَّمَآ أَشْكُوا۟ بَثِّى وَحُزْنِىٓ إِلَى ٱللَّهِ وَأَعْلَمُ مِنَ ٱللَّهِ مَا لَا تَعْلَمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "He said, 'I make complaint about my grief and sorrow to Allah alone because I know things from Allah you do not know.",
        "TRANSLATION_1": "He replied: \"I cry my plaint and grief to God, and know from God what you do not know.\n",
        "TRANSLATION_2": "He said: \"I will address my sorrow and grief only to Allah, and I know from Allah what you do not know.\n",
        "TRANSLATION_3": "He replied, \"I only complain of my sorrow and grief to God. I know about God what you do not know.\n",
        "TRANSLATION_4": "He said, “I complain of my worry and grief only to Allah, and I know the great traits of Allah which you do not know.”\n",
        "TRANSLATION_5": "He said: \"I only complain of my grief and sorrow to Allah, and I know from Allah that which you know not.\"\n",
        "TRANSLATION_6": "He said: I only complain of my grief and sorrow to Allah, and I know from Allah what you do not know.\n",
        "TRANSLATION_7": "He said, 'I make complaint of my anguish and my sorrow unto God; I know from God that you know not.\n",
        "TRANSLATION_8": "He said: I expose my distress and anguish only unto Allah, and I know from Allah that which ye know not.\n",
        "TRANSLATION_9": "He said \"I only complain of my anguish and my sorrow to God. God has made known to me things that you do not know.\n",
        "TRANSLATION_10": "He said: I only bewail my cogitation and grief unto Allah, and I know from Allah that which ye know not.\n",
        "TRANSLATION_11": "He said, ‘I complain of my anguish and grief only to Allah. I know from Allah what you do not know.’\n",
        "TRANSLATION_12": "He said: \"I only complain of my distraction and anguish to Allah, and I know from Allah that which ye know not...\n",
        "TRANSLATION_13": "He said: \"I only complain of my grief and sorrow to Allah, and I know from Allah that which you know not.\n",
        "TRANSLATION_14": "He replied: 'I complain to Allah of my anguish and sadness. I know from Allah what you do not know.\n",
        "TRANSLATION_15": "He said, “I only complain of my grief and sorrow to God, and I know from God what you do not know.”\n",
        "TRANSLATION_16": "He said, \"I only complain of my suffering and my grief to Allah, and I know from Allah that which you do not know.\n",
        "TRANSLATION_17": "[12:86] He said, to them: ‘I complain of my anguish — (bathth is) severe grief, which cannot be endured unless it is proclaimed [yubaththu] to others — and grief only to God, not to any other than Him, for it is worth complaining to Him; and I know from God what you do not know, [and that is] that Joseph’s dream is true and that he is alive. Then he said:\n",
        "TRANSLATION_18": "253 (He said) Jacob said: (I expose my distress and anguish only unto Allah, and I know from Allah that which ye know not) I know that Joseph's vision is true and that we will prostrate to him; it is also said that this means: I know of Allah's mercy and of His good work that which you do not; it is also said that this means: I know that Joseph is alive. That is because the angel of death came to him and he asked him: \"did you take away the soul of Joseph from among those you took their souls away\". And the angel said he did not.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "12:86",
            "11:33",
            "41:33",
            "16:19",
            "21:98",
            "72:22",
            "13:36",
            "33:2",
            "15:69",
            "11:34"
        ],
        "BIBLE": [
            "writings:job:10:2",
            "torah:exodus:23:13",
            "prophets:ii%20samuel:7:21",
            "torah:genesis:46:3",
            "writings:daniel:2:5",
            "torah:exodus:32:23",
            "prophets:isaiah:43:19",
            "prophets:ii%20samuel:23:5",
            "prophets:joshua:7:19",
            "writings:daniel:5:15"
        ]
    }
}