{
    "VERSE": "12:89",
    "ARABIC": "قَالَ هَلْ عَلِمْتُم مَّا فَعَلْتُم بِيُوسُفَ وَأَخِيهِ إِذْ أَنتُمْ جَٰهِلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "He said, 'Are you aware of what you did to Yusuf and his brother in ignorance?'",
        "TRANSLATION_1": ", He said: \"Do you know what you did to Joseph and his brother in your ignorance?\"\n",
        "TRANSLATION_2": "When Joseph heard this (he could not hold himself and said): \"Do you remember what you did to Joseph and his brother when you were ignorant?\"\n",
        "TRANSLATION_3": "Joseph asked them, \"Do you know what you did to Joseph and his brother in your ignorance?\"\n",
        "TRANSLATION_4": "He said, “Are you aware of what you did to Yusuf and his brother when you were unwise?”\n",
        "TRANSLATION_5": "He said: \"Do you know what you did with Yusuf and his brother, when you were ignorant\"\n",
        "TRANSLATION_6": "He said: Do you know how you treated Yusuf and his brother when you were ignorant?\n",
        "TRANSLATION_7": "He said, 'Are you aware of what you did with Joseph and his brother, when you were ignorant?'\n",
        "TRANSLATION_8": "He said: Know ye what ye did unto Joseph and his brother in your ignorance?\n",
        "TRANSLATION_9": "He said, \"Are you aware of what you did to Joseph and his brother in ignorance?\"\n",
        "TRANSLATION_10": "He said: remember ye that which ye did Unto Yusuf and his brother while ye were ignorant?\n",
        "TRANSLATION_11": "He said, ‘Have you realized what you did to Joseph and his brother, when you were senseless?’\n",
        "TRANSLATION_12": "He said: \"Know ye how ye dealt with Joseph and his brother, not knowing (what ye were doing)?\"\n",
        "TRANSLATION_13": "He said: \"Do you know what you did with Yusuf (Joseph) and his brother, when you were ignorant?\"\n",
        "TRANSLATION_14": "Do you know' he replied, 'what you did to Joseph and his brother in your ignorance'\n",
        "TRANSLATION_15": "He said, “Do you realize what you did with Joseph and his brother, in your ignorance?”\n",
        "TRANSLATION_16": "He said, \"Do you know what you did with Joseph and his brother when you were ignorant?\"\n",
        "TRANSLATION_17": "[12:89] Then, he said, to them, in rebuke: ‘Do you realise what you did to Joseph, in the way of beating [him] and selling [him] and otherwise, and his brother, oppressing him, after having separated him from his brother, while you were ignorant?’, of where the affair of Joseph will lead?\n",
        "TRANSLATION_18": "(He said) Joseph said to them: (Know ye what ye did unto Joseph and his brother in your ignorance) when you were ignorant youth?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "12:89",
            "12:69",
            "26:161",
            "26:106",
            "12:58",
            "26:124",
            "26:142",
            "20:30",
            "26:132",
            "23:45"
        ],
        "BIBLE": [
            "writings:nehemiah:5:8",
            "torah:genesis:4:9",
            "writings:nehemiah:5:7",
            "torah:genesis:43:7",
            "torah:genesis:44:19",
            "torah:genesis:44:15",
            "writings:job:9:28",
            "prophets:i%20kings:2:9",
            "prophets:ii%20kings:2:5",
            "torah:leviticus:10:3"
        ]
    }
}