{
    "VERSE": "12:90",
    "ARABIC": "قَالُوٓا۟ أَءِنَّكَ لَأَنتَ يُوسُفُ قَالَ أَنَا۠ يُوسُفُ وَهَٰذَآ أَخِى قَدْ مَنَّ ٱللَّهُ عَلَيْنَآ إِنَّهُۥ مَن يَتَّقِ وَيَصْبِرْ فَإِنَّ ٱللَّهَ لَا يُضِيعُ أَجْرَ ٱلْمُحْسِنِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "They said, 'Are you Yusuf?' He said, 'I am indeed Yusuf, and this here is my brother. Allah has acted graciously to us. As for those who fear Allah and are steadfast, Allah does not allow to go to waste the wage of any people who do good.'",
        "TRANSLATION_1": "They said: \"Surely you are not Joseph!\" \"I am Joseph,\" he said, \"and this is my brother. God has been gracious to us; for God does not verily deprive those who fear Him and are patient of the recompense of those who are good.\"\n",
        "TRANSLATION_2": "They exclaimed: \"Are you indeed Joseph?\" He said: \"Yes, I am Joseph and this is my brother. Allah has surely been gracious to us. Indeed whoever fears Allah and remains patient, Allah does not allow the reward of such people to go to waste.\"\n",
        "TRANSLATION_3": "Then they inquired, \"Are you Joseph?\" He said, \"Yes, I am Joseph and this is my brother. God has indeed been gracious to us. One who exercises patience and observes piety should know that God does not ignore the reward of the righteous ones.\"\n",
        "TRANSLATION_4": "They said, “Are you, in truth you, really Yusuf?” He said, “I am Yusuf and this is my brother; indeed Allah has bestowed favour upon us; undoubtedly whoever practices piety and patience – so Allah does not waste the wages of the righteous.”\n",
        "TRANSLATION_5": "They said: \"Are you indeed Yusuf\" He said: \"I am Yusuf, and this is my brother. Allah has indeed been gracious to us. He who has Taqwa, and is patient, then surely, Allah makes not the reward of the gooddoers to be lost.\"\n",
        "TRANSLATION_6": "They said: Are you indeed Yusuf? He said: I am Yusuf and this is my brother; Allah has indeed been gracious to us; surely he who guards (against evil) and is patient (is rewarded) for surely Allah does not waste the reward of those who do good.\n",
        "TRANSLATION_7": "They said, 'Why, art thou indeed Joseph?' 'I am Joseph,' he said. 'This is my brother. God has indeed been gracious unto us. Whosoever fears God, and is patient -- surely God leaves not to waste the wage of the good-doers.\n",
        "TRANSLATION_8": "They said: Is it indeed thou who art Joseph? He said: I am Joseph and this is my brother. Allah hath shown us favour. Lo! he who wardeth off (evil) and endureth (findeth favour); for lo! Allah loseth not the wages of the kindly.\n",
        "TRANSLATION_9": "They exclaimed, \"Are you indeed Joseph?\" He replied, \"I am Joseph and this is my brother. God has indeed been gracious to us. The truth is that God does not waste the reward of those who do good, who are righteous and steadfast.\"\n",
        "TRANSLATION_10": "They said: art thou Yusuf indeed! He said: I am Yusuf and this is my brother; Allah hath surely been gracious unto us; verily whosoever feareth and endureth, then verily Allah wasteth not the hire of the well-doers.\n",
        "TRANSLATION_11": "They said, ‘Are you really Joseph?!’ He said, ‘I am Joseph, and this is my brother. Certainly Allah has shown us favour. Indeed if one is Godwary and patient Allah does not waste the reward of the virtuous.’\n",
        "TRANSLATION_12": "They said: \"Art thou indeed Joseph?\" He said, \"I am Joseph, and this is my brother: Allah has indeed been gracious to us (all): behold, he that is righteous and patient,- never will Allah suffer the reward to be lost, of those who do right.\"\n",
        "TRANSLATION_13": "They said: \"Are you indeed Yusuf (Joseph)?\" He said: \"I am Yusuf (Joseph), and this is my brother (Benjamin). Allah has indeed been gracious to us. Verily, he who fears Allah with obedience to Him (by abstaining from sins and evil deeds, and by performing righteous good deeds), and is patient, then surely, Allah makes not the reward of the Muhsinun (good-doers - see V. 2:112) to be lost.\"\n",
        "TRANSLATION_14": "They said: 'Are you Joseph' 'I am Joseph' he answered, 'and this is my brother. Allah has been gracious to us. Those who keep from evil and are patient, indeed, Allah does not let the wage of the good doers go to waste'\n",
        "TRANSLATION_15": "They said, “Is that you, Joseph?” He said, “I am Joseph, and this is my brother. God has been gracious to us. He who practices piety and patience—God never fails to reward the righteous.”\n",
        "TRANSLATION_16": "They said, \"Are you indeed Joseph?\" He said \"I am Joseph, and this is my brother. Allah has certainly favored us. Indeed, he who fears Allah and is patient, then indeed, Allah does not allow to be lost the reward of those who do good.\"\n",
        "TRANSLATION_17": "[12:90] They said — after recognising him by his noble traits — cautiously [inquiring]: ‘Is it really (read a-innaka, either pronouncing both hamzas, or by not pronouncing the second, but in both cases inserting an alif) you, Joseph?’. He said, ‘I am [indeed] Joseph, and this is my brother. God has truly shown favour, He has been gracious, to us, by bringing [us] together. Verily if one fears, [if] one fears God, and endures, what happens to him, God does not waste the wage of those who are virtuous’, in this [respect] (the overt noun [almuhsinīn, ‘the virtuous’] has replaced the [third person] pronominalisation).\n",
        "TRANSLATION_18": "(They said: Is it indeed thou who art Joseph? He said: I am Joseph and this is my brother) my full brother. (Allah hath shown us favour) by bestowing patience upon us. (Lo! he who wardeth off (evil)) in times of blessing (and endureth) in times of hardship finds favour; (for verily Allah loseth not) thwarts not (the wages) the reward (of the kindly) those who ward off evil and are patient.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "12:90",
            "11:115",
            "42:40",
            "12:69",
            "6:33",
            "21:59",
            "10:72",
            "16:23",
            "46:13",
            "3:57"
        ],
        "BIBLE": [
            "torah:exodus:34:10",
            "writings:daniel:5:17",
            "prophets:ii%20kings:7:19",
            "writings:job:10:2",
            "prophets:i%20samuel:28:2",
            "prophets:ii%20kings:7:2",
            "prophets:i%20kings:2:42",
            "prophets:i%20samuel:28:15",
            "torah:genesis:2:18",
            "prophets:ezekiel:39:7"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:13"
        ]
    }
}