{
    "VERSE": "12:91",
    "ARABIC": "قَالُوا۟ تَٱللَّهِ لَقَدْ ءَاثَرَكَ ٱللَّهُ عَلَيْنَا وَإِن كُنَّا لَخَٰطِـِٔينَ",
    "ENGLISH": {
        "TRANSLATION_0": "They said, 'By Allah, Allah has favoured you above us. Clearly we were in the wrong.'",
        "TRANSLATION_1": "They said: \"By God, God has favoured you above us, for we have indeed been sinners.\"\n",
        "TRANSLATION_2": "They said: \"We swear by Allah! Indeed Allah has chosen you in preference to us and we were truly guilty.\"\n",
        "TRANSLATION_3": "They said, \"We swear by God that He has given preference to you over us and we have sinned\".\n",
        "TRANSLATION_4": "They said, “By Allah, undoubtedly Allah has given you superiority over us, and we were indeed guilty.”\n",
        "TRANSLATION_5": "They said: \"By Allah! Indeed Allah has preferred you above us, and we certainly have been sinners.\"\n",
        "TRANSLATION_6": "They said: By Allah! now has Allah certainly chosen you over us, and we were certainly sinners.\n",
        "TRANSLATION_7": "By God,' they said, 'God has indeed preferred thee above us, and certainly we have been sinful.'\n",
        "TRANSLATION_8": "They said: By Allah, verily Allah hath preferred thee above us, and we were indeed sinful.\n",
        "TRANSLATION_9": "[The brothers] said, \"By God! Most certainly God has raised you high above us, and we have indeed been guilty!\"\n",
        "TRANSLATION_10": "They said: by Allah! assuredly Allah hath chosen thee above us, and we have been sinners indeed.\n",
        "TRANSLATION_11": "They said, ‘By Allah, Allah has certainly preferred you over us, and we have indeed been erring.’\n",
        "TRANSLATION_12": "They said: \"By Allah! indeed has Allah preferred thee above us, and we certainly have been guilty of sin!\"\n",
        "TRANSLATION_13": "They said: \"By Allah! Indeed Allah has preferred you above us, and we certainly have been sinners.\"\n",
        "TRANSLATION_14": "By Allah' they said, 'Allah has preferred you above us all. We have indeed been sinful'\n",
        "TRANSLATION_15": "They said, “By God, God has preferred you over us. We were definitely in the wrong.”\n",
        "TRANSLATION_16": "They said, \"By Allah, certainly has Allah preferred you over us, and indeed, we have been sinners.\"\n",
        "TRANSLATION_17": "[12:91] They said, ‘By God, truly God has preferred you over us, with kingship and in other ways, and indeed we (wa-in: in is softened, in other words [it is understood as] innā, ‘indeed we’) have been erring’, sinful towards you and treated you disgracefully.\n",
        "TRANSLATION_18": "(They said) Joseph's brothers said to Joseph: (By Allah, verily Allah hath preferred you above us, and we were indeed sinful) towards you, and disobedient of Allah..\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "12:91",
            "37:56",
            "3:158",
            "37:152",
            "26:97",
            "2:15",
            "4:80",
            "12:73",
            "29:11",
            "9:75"
        ],
        "BIBLE": [
            "torah:genesis:48:9",
            "torah:genesis:14:20",
            "prophets:i%20kings:9:13",
            "torah:genesis:20:16",
            "prophets:i%20kings:21:20",
            "torah:genesis:43:23",
            "torah:numbers:20:12",
            "writings:i%20chronicles:23:25",
            "torah:genesis:30:18",
            "torah:numbers:27:12"
        ]
    }
}