{
    "VERSE": "12:92",
    "ARABIC": "قَالَ لَا تَثْرِيبَ عَلَيْكُمُ ٱلْيَوْمَ يَغْفِرُ ٱللَّهُ لَكُمْ وَهُوَ أَرْحَمُ ٱلرَّٰحِمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "He said. 'No blame at all will fall on vou. Todav vou have foraiveness from Allah. He is the Most Merciful of the merciful.",
        "TRANSLATION_1": "There is no blame on you today,\" he said, \"May God forgive you. He is the most merciful of all.\n",
        "TRANSLATION_2": "He replied: \"No blame lies with you today. May Allah forgive you. He is the Most Merciful of all those that are merciful.\n",
        "TRANSLATION_3": "(Joseph) said, \"No one will blame you on this day. God will forgive you; He is more Merciful than others.\n",
        "TRANSLATION_4": "He said, “There is no reproach on you, this day! May Allah forgive you – and He is the Utmost Merciful, of all those who show mercy.”\n",
        "TRANSLATION_5": "He said: \"No reproach on you this day; may Allah forgive you, and He is the Most Merciful of those who show mercy!\n",
        "TRANSLATION_6": "He said: (There shall be) no reproof against you this day; Allah may forgive you, and He is the most Merciful of the merciful.\n",
        "TRANSLATION_7": "He said, 'No reproach this day shall be on you; God will forgive you; He is the most merciful of the merciful.\n",
        "TRANSLATION_8": "He said: Have no fear this day! May Allah forgive you, and He is the Most Merciful of those who show mercy.\n",
        "TRANSLATION_9": "He said, \"No blame [shall fall] on you this day; may God forgive you! And He is the Most Merciful of those who show mercy.\n",
        "TRANSLATION_10": "He said; no reproach upon you today. May Allah forgive you; and He is the Most Merciful of the merciful.\n",
        "TRANSLATION_11": "He said, ‘There shall be no reproach on you today. Allah will forgive you, and He is the most merciful of the merciful.\n",
        "TRANSLATION_12": "He said: \"This day let no reproach be (cast) on you: Allah will forgive you, and He is the Most Merciful of those who show mercy!\n",
        "TRANSLATION_13": "He said: \"No reproach on you this day, may Allah forgive you, and He is the Most Merciful of those who show mercy!\n",
        "TRANSLATION_14": "He replied: 'Let no reproach be on you this day. Allah will forgive you He is the Most Merciful of the merciful.\n",
        "TRANSLATION_15": "He said, “There is no blame upon you today. God will forgive you. He is the Most Merciful of the merciful.”\n",
        "TRANSLATION_16": "He said, \"No blame will there be upon you today. Allah will forgive you; and He is the most merciful of the merciful.\"\n",
        "TRANSLATION_17": "[12:92] He said, ‘There shall be no reproach, [no] blame, on you this day — he specifically mentions this [day] because it was [the day] when they expected to be reproached, although any other day would have been more appropriate [for them to be reproached on]. God will forgive you, and He is the Most Merciful of the merciful.\n",
        "TRANSLATION_18": "(He said) Joseph said to them: (Have no fear this day!) he says: I will not reproach you today. (May Allah forgive you) for what you did, (and He is the Most Merciful of those who show mercy) He is more Merciful than one's own parents.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "12:92",
            "40:33",
            "14:42",
            "60:3",
            "2:203",
            "19:85",
            "7:49",
            "33:73",
            "6:12",
            "45:14"
        ],
        "BIBLE": [
            "writings:i%20chronicles:21:13",
            "prophets:ii%20samuel:24:14",
            "writings:ruth:3:18",
            "writings:psalms:5:11",
            "prophets:jonah:1:7",
            "prophets:ezekiel:13:12",
            "prophets:isaiah:66:5",
            "prophets:ii%20samuel:11:12",
            "torah:genesis:42:18",
            "torah:genesis:32:27"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:4:11",
            "Sefer%20Yetzirah:1:6"
        ]
    }
}