{
    "VERSE": "12:97",
    "ARABIC": "قَالُوا۟ يَٰٓأَبَانَا ٱسْتَغْفِرْ لَنَا ذُنُوبَنَآ إِنَّا كُنَّا خَٰطِـِٔينَ",
    "ENGLISH": {
        "TRANSLATION_0": "They said, 'Our father, may we be forgiven for all the many wrongs that we have done. We were indeed greatly mistaken men.'",
        "TRANSLATION_1": "Said (the sons): \"O our father, pray for us that our sins be forgiven, for we are really sinners.\"\n",
        "TRANSLATION_2": "They said: \"Father! Pray for the forgiveness of our sins; we were truly guilty.\"\n",
        "TRANSLATION_3": "They said, \"Father, ask God to forgive our sins; we have certainly sinned\".\n",
        "TRANSLATION_4": "They said, “O our father! Seek forgiveness for our sins, for we were indeed guilty.”\n",
        "TRANSLATION_5": "They said: \"O our father! Ask forgiveness (from Allah) for our sins, indeed we have been sinners.\"\n",
        "TRANSLATION_6": "They said: O our father! ask forgiveness of our faults for us, surely we were sinners.\n",
        "TRANSLATION_7": "They said, 'Our father, ask forgiveness of our crimes for us; for certainly we have been sinful.'\n",
        "TRANSLATION_8": "They said: O our father! Ask forgiveness of our sins for us, for lo! we were sinful.\n",
        "TRANSLATION_9": "They said, \"O our father! Ask forgiveness for our sins -- we were truly in the wrong.\"\n",
        "TRANSLATION_10": "They said: our father! pray for forgiveness of our sins for us; verily we have been sinners.\n",
        "TRANSLATION_11": "They said, ‘Father! Plead [with Allah] for forgiveness of our sins! We have indeed been erring.’\n",
        "TRANSLATION_12": "They said: \"O our father! ask for us forgiveness for our sins, for we were truly at fault.\"\n",
        "TRANSLATION_13": "They said: \"O our father! Ask forgiveness (from Allah) for our sins, indeed we have been sinners.\"\n",
        "TRANSLATION_14": "His sons said: 'Father, ask forgiveness for our sins. We have indeed been sinners'\n",
        "TRANSLATION_15": "They said, “Father, pray for the forgiveness of our sins; we were indeed at fault.”\n",
        "TRANSLATION_16": "They said, \"O our father, ask for us forgiveness of our sins; indeed, we have been sinners.\"\n",
        "TRANSLATION_17": "[12:97] They said, ‘O our father, ask forgiveness for us of our sins; truly we have been sinful’.\n",
        "TRANSLATION_18": "(They said) his children and grandchildren said: (0 our father! Ask forgiveness of our sins for us) ask Allah to forgive our sins, (for lo! we were sinful) we were wrong-doers and disobedient towards Allah.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "12:97",
            "21:53",
            "12:11",
            "37:69",
            "26:86",
            "12:61",
            "68:31",
            "21:14",
            "26:14",
            "26:74"
        ],
        "BIBLE": [
            "torah:genesis:48:9",
            "torah:genesis:31:5",
            "writings:i%20chronicles:29:10",
            "prophets:jeremiah:50:7",
            "prophets:i%20samuel:19:4",
            "prophets:jeremiah:14:20",
            "writings:i%20chronicles:21:17",
            "prophets:i%20samuel:12:19",
            "writings:ezra:8:28",
            "prophets:i%20samuel:20:1"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:1:9"
        ]
    }
}