{
    "VERSE": "62:1",
    "ARABIC": "بِسْمِ ٱللَّهِ ٱلرَّحْمَٰنِ ٱلرَّحِيمِ يُسَبِّحُ لِلَّهِ مَا فِى ٱلسَّمَٰوَٰتِ وَمَا فِى ٱلْأَرْضِ ٱلْمَلِكِ ٱلْقُدُّوسِ ٱلْعَزِيزِ ٱلْحَكِيمِ",
    "ENGLISH": {
        "TRANSLATION_0": "Everything in the heavens and everything in the earth glorifies Allah, the King, the All-Pure, the Almighty, the All-Wise.",
        "TRANSLATION_1": "ALL THAT IS in the heavens and the earth sings the praises of God the King, the Holy, Omnipotent, the Wise.\n",
        "TRANSLATION_2": "All that is in the heavens and all that is in the earth extols the glory of Allah, the Sovereign, the Holy, the All- Mighty, the All-Wise.\n",
        "TRANSLATION_3": "All that is in the heavens and the earth glorify God, the King, the Holy, the Majestic and the All-wise.\n",
        "TRANSLATION_4": "All whatever is in the heavens and all whatever is in the earth proclaims the Purity of Allah, the King, the Most Pure, the Most Honourable, the Wise.\n",
        "TRANSLATION_5": "Whatsoever is in the heavens and whatsoever is on the earth glorifies Allah -- the King, the Holy, the Almighty, the All-Wise.\n",
        "TRANSLATION_6": "Whatever is in the heavens and whatever is in the earth declares the glory of Allah, the King, the Holy, the Mighty, the Wise.\n",
        "TRANSLATION_7": "All that is in the heavens and the earth magnifies God, the King, the All-holy, the All-mighty, the All-wise.\n",
        "TRANSLATION_8": "All that is in the heavens and all that is in the earth glorifieth Allah, the Sovereign Lord, the Holy One, the Mighty, the Wise.\n",
        "TRANSLATION_9": "Whatever is in the heavens and on the earth glorifies God, the Sovereign Lord, the Holy One, the Mighty, the Wise.\n",
        "TRANSLATION_10": "Whatsoever is in the heavens and whatsoever is in the earth halloweth Allah, the Sovereign, the Holy, the Mighty, the Wise.\n",
        "TRANSLATION_11": "Whatever there is in the heavens and in the earth glorifies Allah, the Sovereign, the All-holy, the All-mighty, the All-wise.\n",
        "TRANSLATION_12": "Whatever is in the heavens and on earth, doth declare the Praises and Glory of Allah,- the Sovereign, the Holy One, the Exalted in Might, the Wise.\n",
        "TRANSLATION_13": "Whatsoever is in the heavens and whatsoever is on the earth glorifies Allah, the King (of everything), the Holy, the All-Mighty, the All-Wise.\n",
        "TRANSLATION_14": "All that is in heavens and earth exalt Allah, the King, the Pure, the Almighty, the Wise.\n",
        "TRANSLATION_15": "Everything in the heavens and the earth glorifies God the Sovereign, the Holy, the Almighty, the Wise.\n",
        "TRANSLATION_16": "Whatever is in the heavens and whatever is on the earth is exalting Allah, the Sovereign, the Pure, the Exalted in Might, the Wise.\n",
        "TRANSLATION_17": "[62:1] All that is the heavens and all that is in the earth glorifies God, [all] proclaims His transcendence (the lām [of li’Llāhi] is extra; mā is used instead of min in order to indicate the predominance [of non-rational beings]), the King, the Holy, the One Who transcends what does not befit Him, the Mighty, the Wise, in His kingdom and in His actions.\n",
        "TRANSLATION_18": "And from his narration on the authority of Ibn 'Abbas that he said about the interpretation of Allah's saying (All that is in the heavens and all that is in the earth glorifieth Allah): '(All that is in the heavens) of created beings (and all that is in the earth) of creatures and living beings (glorifies Allah) prays to Allah; and it is also said this means: remembers Allah, (the Sovereign Lord) the Eternal whose sovereignty does not perish, (the Holy One) the Pure who has no son or partner, (the Mighty) the All-Conquering in His sovereignty and in His retribution against those who disbelieve in Him, (the Wise) in His command and decree, and He has decreed that none should be worshipped but Him.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "62:1",
            "57:1",
            "61:1",
            "59:1",
            "48:7",
            "59:24",
            "45:37",
            "43:84",
            "16:49",
            "34:1"
        ],
        "BIBLE": [
            "writings:psalms:148:13",
            "writings:psalms:57:6",
            "writings:psalms:57:12",
            "writings:psalms:108:6",
            "prophets:habakkuk:3:3",
            "writings:psalms:47:7",
            "writings:psalms:47:8",
            "writings:psalms:75:10",
            "prophets:i%20kings:1:27",
            "writings:psalms:19:2"
        ]
    }
}