{
    "VERSE": "62:5",
    "ARABIC": "مَثَلُ ٱلَّذِينَ حُمِّلُوا۟ ٱلتَّوْرَىٰةَ ثُمَّ لَمْ يَحْمِلُوهَا كَمَثَلِ ٱلْحِمَارِ يَحْمِلُ أَسْفَارًۢا بِئْسَ مَثَلُ ٱلْقَوْمِ ٱلَّذِينَ كَذَّبُوا۟ بِـَٔايَٰتِ ٱللَّهِ وَٱللَّهُ لَا يَهْدِى ٱلْقَوْمَ ٱلظَّٰلِمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "The metaphor of those who were charged with the Torah but then have not upheld it, is that of a donkey loaded with weighty tomes. How evil is the metaphor of those who deny Allah's Signs! Allah does not guide wrongdoing people.",
        "TRANSLATION_1": "The likeness of those who were charged with (the law of) the Torah which they did not observe, is that of a donkey who carries a load of books (oblivious of what they contain). How wretched the semblance of the people who deny the words of God! God does not show an unjust people the way.\n",
        "TRANSLATION_2": "The parable of those who were charged with the Torah and then they failed to live up to it is that of a donkey laden with books. Even more evil is the parable of the people who gave the lie to the Signs of Allah. Allah does not direct such wrong-doers to the Right Way.\n",
        "TRANSLATION_3": "Those who were to carry the responsibility of the Torah but ignored, are like donkeys laden with books. How terrible is the example of the people who reject the revelations of God. God does not guide the unjust.\n",
        "TRANSLATION_4": "The example of those who were entrusted with the Taurat, and did not carry out its commands, is like the donkey carrying books; what a wretched example is of the people who denied the signs of Allah; and Allah does not guide the unjust.\n",
        "TRANSLATION_5": "The likeness of those who were entrusted with the Tawrah, but did not carry it, is as the likeness of a donkey which carries huge burdens of books. How bad is the example of people who deny the Ayat of Allah. And Allah does not guide the people who are wrongdoers.\n",
        "TRANSLATION_6": "The likeness of those who were charged with the Taurat, then they did not observe it, is as the likeness of the ass bearing books, evil is the likeness of the people who reject the communications of Allah; and Allah does not guide the unjust people.\n",
        "TRANSLATION_7": "The likeness of those who have been loaded with the Torah then they have not carried it, is as the likeness of an ass carrying books. Evil is the likeness of the people who have cried lies to God's signs. God guides never the people of the evildoers.\n",
        "TRANSLATION_8": "The likeness of those who are entrusted with the Law of Moses, yet apply it not, is as the likeness of the ass carrying books. Wretched is the likeness of folk who deny the revelations of Allah. And Allah guideth not wrongdoing folk.\n",
        "TRANSLATION_9": "Those who were charged with bearing the Torah, but did not do so are like an ass carrying a load of books. How unfortunate are those who belie the sign of God. God does not guide the wrongdoers.\n",
        "TRANSLATION_10": "The likeness of those who were laden with the Taurat and then they bare it not, is as the likeness of the ass bearing tomes. Hapless is the likeness of the people who belie the signs of Allah. And Allah guideth not a wrong doing people. J\n",
        "TRANSLATION_11": "The example of those who were charged with the Torah, then failed to carry it, is that of an ass carrying books. Evil is the example of the people who deny Allah’s signs, and Allah does not guide the wrongdoing lot.\n",
        "TRANSLATION_12": "The similitude of those who were charged with the (obligations of the) Mosaic Law, but who subsequently failed in those (obligations), is that of a donkey which carries huge tomes (but understands them not). Evil is the similitude of people who falsify the Signs of Allah: and Allah guides not people who do wrong.\n",
        "TRANSLATION_13": "The likeness of those who were entrusted with the (obligation of the) Taurat (Torah) (i.e. to obey its commandments and to practise its legal laws), but who subsequently failed in those (obligations), is as the likeness of a donkey who carries huge burdens of books (but understands nothing from them). How bad is the example (or the likeness) of people who deny the Ayat (proofs, evidences, verses, signs, revelations, etc.) of Allah. And Allah guides not the people who are Zalimun (polytheists, wrong-doers, disbelievers, etc.).\n",
        "TRANSLATION_14": "The likeness of those who were loaded with the Torah, but did not carry it, is like that of a donkey carrying books. Evil is the example of the people who have belied the verses of Allah. Allah does not guide the evildoers.\n",
        "TRANSLATION_15": "The example of those who were entrusted with the Torah, but then failed to uphold it, is like the donkey carrying works of literature. Miserable is the example of the people who denounce God’s revelations. God does not guide the wrongdoing people.\n",
        "TRANSLATION_16": "The example of those who were entrusted with the Torah and then did not take it on is like that of a donkey who carries volumes [of books]. Wretched is the example of the people who deny the signs of Allah. And Allah does not guide the wrongdoing people.\n",
        "TRANSLATION_17": "[62:5] The likeness of those who were entrusted with the Torah, those who were charged with implementing it, then failed to uphold it, [then] failed to act in accordance with it, in what pertains to the descriptions of the Prophet (s), and so did not believe in him, is as the likeness of an ass carrying books, in that it does not benefit from them. Evil is the likeness of the people who deny God’s signs, those confirming the truth of the Prophet (s) — (the object of rebuke is omitted but is implied to be hādhā’l-mathalu, ‘this likeness’). And God does not guide the evildoing folk, the disbelievers.\n",
        "TRANSLATION_18": "(The likeness) the description (of those who are entrusted with the Law of Moses) of those who were commanded to apply that which is in the Torah; i.e. they were commanded to reveal the traits and description of Muhammad (pbuh) in the Torah, (yet apply it not) yet act not upon what they were commanded, i.e. they did not reveal the traits and description of Muhammad (pbuh) in the Torah, (is as the likeness of the ass carrying books) the ass does not benefit from the books it carries and, similarly, the Jews will not benefit from the Torah. (Wretched is the likeness of folk who deny the revelations of Allah) Muhammad (pbuh) and the Qur'an. This refers to the Jews. (And Allah guideth not) to His religion (wrong- doing folk) the Jews; those who are to die following Judaism, as it is in Allah's pre-eternal knowledge.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "62:5",
            "7:177",
            "2:118",
            "3:117",
            "10:95",
            "6:33",
            "25:36",
            "45:14",
            "40:63",
            "63:6"
        ],
        "BIBLE": [
            "prophets:ii%20kings:21:8",
            "writings:daniel:1:2",
            "writings:nehemiah:8:8",
            "writings:nehemiah:10:30",
            "writings:ezra:5:12",
            "prophets:jeremiah:52:9",
            "prophets:i%20samuel:20:40",
            "writings:ii%20chronicles:28:15",
            "writings:ii%20chronicles:6:27",
            "prophets:i%20kings:8:56"
        ]
    }
}