{
    "VERSE": "62:7",
    "ARABIC": "وَلَا يَتَمَنَّوْنَهُۥٓ أَبَدًۢا بِمَا قَدَّمَتْ أَيْدِيهِمْ وَٱللَّهُ عَلِيمٌۢ بِٱلظَّٰلِمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "But they will never ever wish for it because of what they have done. Allah knows the wrongdoers.",
        "TRANSLATION_1": "But they will never wish for death because of what they had done in the past, and God knows the sinners well.\n",
        "TRANSLATION_2": "But they shall never wish for death because of the (evil) deeds they have committed. Allah is well aware of these evil-doers.\n",
        "TRANSLATION_3": "They will never wish for death because of what they have done! God knows best about the unjust people.\n",
        "TRANSLATION_4": "And they will never wish for it because of the misdeeds their hands have sent ahead; and Allah well knows the unjust.\n",
        "TRANSLATION_5": "But they will never long for it, because of what their hands have sent before them! And Allah knows well the wrongdoers.\n",
        "TRANSLATION_6": "And they will never invoke it because of what their hands have sent before; and Allah is Cognizant of the unjust.\n",
        "TRANSLATION_7": "But they will never long for it, because of that their hands have forwarded; God knows the evildoers.\n",
        "TRANSLATION_8": "But they will never long for it because of all that their own hands have sent before, and Allah is Aware of evil-doers.\n",
        "TRANSLATION_9": "They will never wish for it, because of what their hands have sent forward. God has full knowledge of evil-doers.\n",
        "TRANSLATION_10": "And they will never wish there for, because of that which their hands have sent forward. And Allah is the Knower of he wrong-doers.\n",
        "TRANSLATION_11": "Yet they will never long for it, because of what their hands have sent ahead, and Allah knows best the wrongdoers.\n",
        "TRANSLATION_12": "But never will they express their desire (for Death), because of the (deeds) their hands have sent on before them! and Allah knows well those that do wrong!\n",
        "TRANSLATION_13": "But they will never long for it (death), because of what (deeds) their hands have sent before them! And Allah knows well the Zalimun (polytheists, wrong-doers, disbelievers, etc.).\n",
        "TRANSLATION_14": "But, because of what their hands forwarded they will never long for it. Allah knows the harmdoers.\n",
        "TRANSLATION_15": "But they will not wish for it, ever, due to what their hands have advanced. God knows well the wrongdoers.\n",
        "TRANSLATION_16": "But they will not wish for it, ever, because of what their hands have put forth. And Allah is Knowing of the wrongdoers.\n",
        "TRANSLATION_17": "[62:7] But they will never long for it, because of what their hands have sent ahead, in the way of their disbelief of the Prophet, [which itself is] a necessary consequence of their denial; and God is Knower of the evildoers, the disbelievers.\n",
        "TRANSLATION_18": "However, they did not want to say it and ask for death. Upon which Allah said: (But they will never long for it) but the Jews will never ask for death (because of all that their own hands have sent before) because of that which they committed in their adherence to Judaism, (and Allah is Aware of evil-doers) He is aware that the Jews will not ask for death.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "62:7",
            "2:95",
            "84:23",
            "3:115",
            "5:28",
            "9:67",
            "22:10",
            "8:51",
            "3:182",
            "3:63"
        ],
        "BIBLE": [
            "prophets:ezekiel:25:14",
            "torah:deuteronomy:17:7",
            "prophets:jeremiah:26:24",
            "prophets:joshua:4:24",
            "prophets:ezekiel:13:23",
            "writings:ezra:7:25",
            "prophets:ezekiel:13:21",
            "torah:deuteronomy:31:29",
            "writings:ii%20chronicles:6:29",
            "torah:deuteronomy:13:10"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:1:6"
        ]
    }
}