{
    "VERSE": "82:5",
    "ARABIC": "عَلِمَتْ نَفْسٌ مَّا قَدَّمَتْ وَأَخَّرَتْ",
    "ENGLISH": {
        "TRANSLATION_0": "each self will know what it has sent ahead and left behind.",
        "TRANSLATION_1": "Each soul will know what it had sent ahead and what it had left behind.\n",
        "TRANSLATION_2": "everyone shall know all his deeds, both the earlier and the later.\n",
        "TRANSLATION_3": "every soul will see the result of its deeds - those recorded before his death and those which will produce either virtue or evil after his death.\n",
        "TRANSLATION_4": "Every soul will come to know what it has sent ahead and what it left behind.\n",
        "TRANSLATION_5": "A person will know what he has sent forward and left behind.\n",
        "TRANSLATION_6": "Every soul shall know what it has sent before and held back.\n",
        "TRANSLATION_7": "then a soul shall know its works, the former and the latter.\n",
        "TRANSLATION_8": "A soul will know what it hath sent before (it) and what left behind.\n",
        "TRANSLATION_9": "then everyone will know what he has sent ahead, and what he has left behind.\n",
        "TRANSLATION_10": "Each soul shall know that which it sent afore and that which it left behind.\n",
        "TRANSLATION_11": "then a soul shall know what it has sent ahead and left behind.\n",
        "TRANSLATION_12": "(Then) shall each soul know what it hath sent forward and (what it hath) kept back.\n",
        "TRANSLATION_13": "(Then) a person will know what he has sent forward and (what he has) left behind (of good or bad deeds).\n",
        "TRANSLATION_14": "the soul shall know what it has done, the former and the latter.\n",
        "TRANSLATION_15": "Each soul will know what it has advanced, and what it has deferred.\n",
        "TRANSLATION_16": "A soul will [then] know what it has put forth and kept back.\n",
        "TRANSLATION_17": "[82:5] a soul, every soul, will know, at the time of the [occurrence of the] things mentioned, which is the Day of Resurrection, what it has sent ahead, in the way of deeds, and, what [it has], left behind, of these and did not do.\n",
        "TRANSLATION_18": "(A soul) every soul at that point (will know what it hath sent before (it)) of good or evil (and what left behind) of good or evil wont; it is also said this means: it will know the acts of obedience it offered and those it missed.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "82:5",
            "91:7",
            "81:14",
            "11:21",
            "81:7",
            "20:41",
            "21:102",
            "6:24",
            "39:70",
            "51:21"
        ],
        "BIBLE": [
            "torah:numbers:16:28",
            "torah:numbers:30:8",
            "torah:numbers:30:12",
            "prophets:haggai:1:10",
            "prophets:i%20kings:2:9",
            "prophets:i%20samuel:25:34",
            "prophets:ii%20kings:7:9",
            "torah:exodus:21:36",
            "writings:job:13:13",
            "writings:proverbs:24:12"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:2:2",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:3:7",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:5:2",
            
            "Sefer%20Yetzirah:1:8"
        ]
    }
}