{
    "VERSE": "82:7",
    "ARABIC": "ٱلَّذِى خَلَقَكَ فَسَوَّىٰكَ فَعَدَلَكَ",
    "ENGLISH": {
        "TRANSLATION_0": "He Who created you and formed you and proportioned you",
        "TRANSLATION_1": "Who created you then formed your symmetry, then gave you right proportion,\n",
        "TRANSLATION_2": "Who created you, shaped you, and made you well-proportioned,\n",
        "TRANSLATION_3": "Who created you proportionately and fashioned you\n",
        "TRANSLATION_4": "The One Who created you, then moulded you, then made you proper?\n",
        "TRANSLATION_5": "Who created you, fashioned you perfectly, and gave you due proportion.\n",
        "TRANSLATION_6": "Who created you, then made you complete, then made you symmetrical?\n",
        "TRANSLATION_7": "who created thee and shaped thee and wrought thee in symmetry\n",
        "TRANSLATION_8": "Who created thee, then fashioned, then proportioned thee?\n",
        "TRANSLATION_9": "who created you, fashioned you and proportioned you,\n",
        "TRANSLATION_10": "Who created thee, then moulded thee, then proportioned thee?\n",
        "TRANSLATION_11": "who created you and proportioned you, and gave you an upright nature,\n",
        "TRANSLATION_12": "Him Who created thee. Fashioned thee in due proportion, and gave thee a just bias;\n",
        "TRANSLATION_13": "Who created you, fashioned you perfectly, and gave you due proportion;\n",
        "TRANSLATION_14": "who created you, formed you and proportioned you?\n",
        "TRANSLATION_15": "He Who created you, and formed you, and proportioned you?\n",
        "TRANSLATION_16": "Who created you, proportioned you, and balanced you?\n",
        "TRANSLATION_17": "[82:7] Who created you, when you were not, then made you upright, in your created form, with sound limbs, then proportioned you (read fa-‘adalak or fa-‘addalak), making you symmetrical in shape, with well-proportioned parts, so that no hand or leg is longer than the other,\n",
        "TRANSLATION_18": "(Who created thee) a living being from a sperm drop, (then fashioned) in the womb of your mother, (then proportioned thee) then made your stature erect?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "82:7",
            "26:78",
            "87:2",
            "87:3",
            "96:9",
            "93:7",
            "10:63",
            "26:79",
            "93:8",
            "107:6"
        ],
        "BIBLE": [
            "writings:psalms:44:12",
            "writings:psalms:78:62",
            "torah:deuteronomy:3:15",
            "writings:psalms:119:73",
            "torah:leviticus:6:10",
            "writings:psalms:18:36",
            "writings:ii%20chronicles:33:10",
            "torah:genesis:47:22",
            "writings:nehemiah:12:31",
            "writings:psalms:60:6"
        ]
    }
}