{
    "VERSE": "Sefer%20Yetzirah:4:12",
    "HEBREW": "שבע כפולות כיצד צרפן. שתי אבנים בונות שני בתים. שלש בונות ששה בתים. ארבע בונות ארבעה ועשרים בתים. חמש בונות מאה ועשרים בתים. שש בונות שבע מאות ועשרים בתים. שבע בונות חמשת אלפים וארבעים בתים. מכאן ואילך צא וחשוב מה שאין הפה יכול לדבר ואין האוזן יכולה לשמוע. ואלו הן שבעה כוכבים בעולם חמה נוגה כוכב לבנה שבתאי צדק מאדים. ואלו הן ז' ימים בשנה שבעה ימי בראשית. ושבעה שערים בנפש שתי עינים שתי אזנים ושני נקבי האף והפה. ובהן נחקקו שבעה רקיעים ושבע ארצות ושבע שעות. לפיכך חבב שביעי לכל חפץ תחת השמים: \n",
    "ENGLISH": "Two Letters produce two houses; three form six; four form twenty-four; five form one hundred and twenty; six form seven hundred and twenty; seven form five thousand and forty; and beyond this their numbers increase so that the mouth can hardly utter them, nor the ear hear the number of them. So now, behold the Stars of our World, the Planets which are Seven; the Sun, Venus, Mercury, Moon, Saturn, Jupiter and Mars. The Seven are also the Seven Days of Creation; and the Seven Gateways of the Soul of Man—the two eyes, the two ears, the mouth and the two nostrils. So with the Seven are formed the seven heavens, the seven earths, and the seven periods of time; and so has He preferred the number Seven above all things under His Heaven."
}