{
    "VERSE": "75:13",
    "ARABIC": "يُنَبَّؤُا۟ ٱلْإِنسَٰنُ يَوْمَئِذٍۭ بِمَا قَدَّمَ وَأَخَّرَ",
    "ENGLISH": {
        "TRANSLATION_0": "That Day man will be told what he did and failed to do.",
        "TRANSLATION_1": "Then man will be told what he had sent ahead (of good) and what he had left behind.\n",
        "TRANSLATION_2": "On that Day will man be apprised of his deeds, both the earlier and the later.\n",
        "TRANSLATION_3": "On that day, people will be informed of all that they had done and all that they were supposed to do.\n",
        "TRANSLATION_4": "On that day, man will be informed of all what he sent ahead and left behind.\n",
        "TRANSLATION_5": "On that Day man will be informed of what he sent forward, and what he left behind.\n",
        "TRANSLATION_6": "Man shall on that day be informed of what he sent before and (what he) put off.\n",
        "TRANSLATION_7": "Upon that day man shall be told his former deeds and his latter;\n",
        "TRANSLATION_8": "On that day man is told the tale of that which he hath sent before and left behind.\n",
        "TRANSLATION_9": "On that Day, man will be told of all that he has sent before and what he has left behind.\n",
        "TRANSLATION_10": "To man will be declared on that Day that which he hath sent on and left behind.\n",
        "TRANSLATION_11": "That day man will be informed about what [works] he had sent ahead [to the scene of judgement] and [the legacy that he had] left behind.\n",
        "TRANSLATION_12": "That Day will Man be told (all) that he put forward, and all that he put back.\n",
        "TRANSLATION_13": "On that Day man will be informed of what he sent forward (of his evil or good deeds), and what he left behind (of his good or evil traditions).\n",
        "TRANSLATION_14": "On that Day the human shall be informed of his former and latter deeds.\n",
        "TRANSLATION_15": "On that Day man will be informed of everything he put forward, and everything he left behind.\n",
        "TRANSLATION_16": "Man will be informed that Day of what he sent ahead and kept back.\n",
        "TRANSLATION_17": "[75:13] On that day man will be informed of what he has sent ahead and left behind, [he will be informed] of the his first and last deeds.\n",
        "TRANSLATION_18": "(On that day) on the Day of Judgement (man is told) 'Adiyy Ibn Rabi'ah and others will be informed about (the tale of that which he hath sent before and left behind) the tale of what he has sent before of good or evil works and of what he left behind of good or evil wont; it is also said this means: he will be informed about what he has sent before of acts of obedience and what he left behind of acts of disobedience.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "75:13",
            "53:24",
            "99:3",
            "53:39",
            "86:5",
            "96:5",
            "55:3",
            "80:17",
            "79:35",
            "89:23"
        ],
        "BIBLE": [
            "prophets:i%20samuel:9:24",
            "prophets:i%20samuel:11:13",
            "prophets:i%20samuel:25:34",
            "prophets:habakkuk:1:5",
            "writings:psalms:141:4",
            "prophets:jeremiah:29:32",
            "torah:genesis:34:7",
            "writings:psalms:145:4",
            "torah:deuteronomy:31:18",
            "writings:ecclesiastes:12:14"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:4:11",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:6:1"
        ]
    }
}