{
    "VERSE": "75:17",
    "ARABIC": "إِنَّ عَلَيْنَا جَمْعَهُۥ وَقُرْءَانَهُۥ",
    "ENGLISH": {
        "TRANSLATION_0": "Its collection and recitation are Our affair.",
        "TRANSLATION_1": "Surely its collection and recitation are Our responsibility.\n",
        "TRANSLATION_2": "Surely it is for Us to have you commit it to memory and to recite it.\n",
        "TRANSLATION_3": "We shall be responsible for its collection and its recitation.\n",
        "TRANSLATION_4": "Indeed assembling the Qur’an and reading it are upon Us.\n",
        "TRANSLATION_5": "It is for Us to collect it and that it be recited.\n",
        "TRANSLATION_6": "Surely on Us (devolves) the collecting of it and the reciting of it.\n",
        "TRANSLATION_7": "Ours it is to gather it, and to recite it.\n",
        "TRANSLATION_8": "Lo! upon Us (resteth) the putting together thereof and the reading thereof.\n",
        "TRANSLATION_9": "We Ourself shall see to its collection and recital.\n",
        "TRANSLATION_10": "Verily upon us is the collecting thereof and the reciting thereof.\n",
        "TRANSLATION_11": "Indeed it is up to Us to put it together and to recite it.\n",
        "TRANSLATION_12": "It is for Us to collect it and to promulgate it:\n",
        "TRANSLATION_13": "It is for Us to collect it and to give you (O Muhammad SAW) the ability to recite it (the Quran),\n",
        "TRANSLATION_14": "It's gathering and reciting is upon Us.\n",
        "TRANSLATION_15": "Upon Us is its collection and its recitation.\n",
        "TRANSLATION_16": "Indeed, upon Us is its collection [in your heart] and [to make possible] its recitation.\n",
        "TRANSLATION_17": "[75:17] Assuredly it is for Us to bring it together, in your breast, and to recite it, your reciting of it, that is, its flowing off your tongue.\n",
        "TRANSLATION_18": "(Lo! upon Us (resteth) the putting together thereof) preserving the Qur'an in your heart (and the reading thereof) and also preserving the reading of Gabriel to you; it is also said that this means: upon Us rests its composition of the lawful and the unlawful.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "75:17",
            "26:56",
            "73:4",
            "76:23",
            "100:5",
            "36:69",
            "26:170",
            "43:3",
            "37:134",
            "12:2"
        ],
        "BIBLE": [
            "prophets:micah:2:12",
            "prophets:hosea:11:8",
            "writings:psalms:74:8",
            "torah:exodus:30:37",
            "prophets:jeremiah:20:9",
            "prophets:isaiah:44:19",
            "prophets:ezekiel:18:31",
            "torah:exodus:31:6",
            "torah:exodus:30:32",
            "writings:proverbs:27:11"
        ]
    }
}