{
    "VERSE": "75:2",
    "ARABIC": "وَلَآ أُقْسِمُ بِٱلنَّفْسِ ٱللَّوَّامَةِ",
    "ENGLISH": {
        "TRANSLATION_0": "No! I swear by the self-reproaching self.",
        "TRANSLATION_1": "And I call the reprehensive soul to witness:\n",
        "TRANSLATION_2": "and nay, I swear by the self-reproaching soul!\n",
        "TRANSLATION_3": "and by the self accusing soul (that you will certainly be resurrected).\n",
        "TRANSLATION_4": "And by oath of the soul that reproaches itself.\n",
        "TRANSLATION_5": "And nay! I swear by An-Nafs Al-Lawwamah.\n",
        "TRANSLATION_6": "Nay! I swear by the self-accusing soul.\n",
        "TRANSLATION_7": "No! I swear by the reproachful soul.\n",
        "TRANSLATION_8": "Nay, I swear by the accusing soul (that this Scripture is true).\n",
        "TRANSLATION_9": "and by the self-reproaching soul!\n",
        "TRANSLATION_10": "And I swear by the self-reproaching soul.\n",
        "TRANSLATION_11": "And I swear by the self-critical soul!\n",
        "TRANSLATION_12": "And I do call to witness the self-reproaching spirit: (Eschew Evil).\n",
        "TRANSLATION_13": "And I swear by the self-reproaching person (a believer).\n",
        "TRANSLATION_14": "No! I swear by the reproachful soul!\n",
        "TRANSLATION_15": "And I swear by the blaming soul.\n",
        "TRANSLATION_16": "And I swear by the reproaching soul [to the certainty of resurrection].\n",
        "TRANSLATION_17": "[75:2] And, nay, I swear by the (self-)reproaching soul, the one that reproaches itself, even if it should expend great effort in being virtuous (the response to the oath has been omitted, that is to say, la-tub‘athunna, ‘you shall indeed be resurrected!’, as indicated by [what follows]):\n",
        "TRANSLATION_18": "710 (Nay, I swear by the accusing soul (that this Scripture is true)) and I swear by every righteous and sinful soul that will blame itself on the Day of Resurrection. As for the righteous soul, it will say: if only I did more righteous works. And as for the sinful soul, it will say: if only I abstained from committing sins. Both souls will say this upon seeing the reward and punishment awaiting each one of them respectively. It is also said that the accusing soul in question is the soul that reproaches itself; and it is also said: it is the soul that repents of its sins and reproaches itself for what it had committed; and it is also said it is the sinful, disbelieving soul.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "75:2",
            "81:7",
            "16:111",
            "51:21",
            "82:5",
            "7:177",
            "20:41",
            "36:54",
            "9:44",
            "89:27"
        ],
        "BIBLE": [
            "writings:proverbs:14:25",
            "prophets:isaiah:57:16",
            "torah:numbers:19:22",
            "writings:job:7:11",
            "prophets:jeremiah:42:5",
            "writings:psalms:69:11",
            "torah:leviticus:5:4",
            "prophets:i%20samuel:20:17",
            "writings:proverbs:15:32",
            "torah:leviticus:22:3"
        ]
    }
}