{
    "VERSE": "75:26",
    "ARABIC": "كَلَّآ إِذَا بَلَغَتِ ٱلتَّرَاقِىَ",
    "ENGLISH": {
        "TRANSLATION_0": "No indeed! When it reaches the gullet",
        "TRANSLATION_1": "Never so, for when life withdraws into the clavicula,\n",
        "TRANSLATION_2": "Nay; when a man's soul reaches up to the throat,\n",
        "TRANSLATION_3": "Some people, certainly, do not believe in it, but when a person's soul reaches up to his throat\n",
        "TRANSLATION_4": "Yes indeed, when the soul will reach up to the throat.\n",
        "TRANSLATION_5": "Nay, when it rea- ches to the collarbones.\n",
        "TRANSLATION_6": "Nay! When it comes up to the throat,\n",
        "TRANSLATION_7": "No indeed; when it reaches the clavicles\n",
        "TRANSLATION_8": "Nay, but when the life cometh up to the throat\n",
        "TRANSLATION_9": "But when [man's soul] reaches the throat,\n",
        "TRANSLATION_10": "By no means! When it cometh up to he collar-bone.\n",
        "TRANSLATION_11": "No indeed! When it reaches up to the collar bones\n",
        "TRANSLATION_12": "Yea, when (the soul) reaches to the collar-bone (in its exit),\n",
        "TRANSLATION_13": "Nay, when (the soul) reaches to the collar bone (i.e. up to the throat in its exit),\n",
        "TRANSLATION_14": "But, when (the soul) reaches the collar bone\n",
        "TRANSLATION_15": "Indeed, when it has reached the breast-bones.\n",
        "TRANSLATION_16": "No! When the soul has reached the collar bones\n",
        "TRANSLATION_17": "[75:26] No indeed! (kallā: in the sense of alā) When it, the soul, reaches up to the collar bones,\n",
        "TRANSLATION_18": "(Nay) truly, (but when the life cometh up to the throat) when the soul of the body reaches the throat\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "75:26",
            "56:1",
            "80:33",
            "81:8",
            "89:21",
            "53:57",
            "75:20",
            "69:15",
            "69:1",
            "82:1"
        ],
        "BIBLE": [
            "writings:psalms:26:9",
            "writings:job:2:4",
            "writings:job:33:22",
            "torah:genesis:2:7",
            "torah:leviticus:7:21",
            "torah:genesis:9:5",
            "writings:ezra:3:1",
            "torah:deuteronomy:23:11",
            "writings:proverbs:13:8",
            "torah:numbers:9:6"
        ]
    }
}