{
    "VERSE": "75:39",
    "ARABIC": "فَجَعَلَ مِنْهُ ٱلزَّوْجَيْنِ ٱلذَّكَرَ وَٱلْأُنثَىٰٓ",
    "ENGLISH": {
        "TRANSLATION_0": "making from it both sexes, male and female?",
        "TRANSLATION_1": "And assigned it sexes, male and female.\n",
        "TRANSLATION_2": "and then He made of him a pair, male and female?\n",
        "TRANSLATION_3": "Was he not turned into a clot of blood? God then formed him and gave him proper shape. From the human being, God made males and females in pairs.\n",
        "TRANSLATION_4": "So created from him a pair, the male and female.\n",
        "TRANSLATION_5": "And made of him two sexes, male and female.\n",
        "TRANSLATION_6": "Then He made of him two kinds, the male and the female.\n",
        "TRANSLATION_7": "and He made of him two kinds, male and female.\n",
        "TRANSLATION_8": "And made of him a pair, the male and female.\n",
        "TRANSLATION_9": "fashioning out of him the two sexes, the male and the female?\n",
        "TRANSLATION_10": "And made of him the two sexes, male and female.\n",
        "TRANSLATION_11": "and made of him the two sexes, male and female.\n",
        "TRANSLATION_12": "And of him He made two sexes, male and female.\n",
        "TRANSLATION_13": "And made him in two sexes, male and female.\n",
        "TRANSLATION_14": "and made from him two kinds, male and female.\n",
        "TRANSLATION_15": "And made of him the two sexes, the male and the female?\n",
        "TRANSLATION_16": "And made of him two mates, the male and the female.\n",
        "TRANSLATION_17": "[75:39] and made of it, of the drop of semen that became a blood-clot, then an embryo, a [small] mass of flesh, the two sexes, the two kinds, the male and the female, at times coming together and at times each being on their own.\n",
        "TRANSLATION_18": "(And made of him) after that (a pair, the male and female) Abu Jahl had a son called 'Ikrimah Ibn Abi Jahl and a daughter called Juwayrah Bint Abi Jahl.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "75:39",
            "53:45",
            "53:21",
            "92:3",
            "6:143",
            "4:124",
            "43:70",
            "38:58",
            "78:8",
            "42:49"
        ],
        "BIBLE": [
            "prophets:i%20samuel:10:9",
            "prophets:joshua:22:4",
            "prophets:ezekiel:3:20",
            "writings:ii%20chronicles:9:12",
            "prophets:i%20kings:10:13",
            "writings:song%20of%20songs:5:6",
            "torah:deuteronomy:16:17",
            "writings:ecclesiastes:12:7",
            "writings:psalms:119:73",
            "writings:proverbs:22:24"
        ]
    }
}