{
    "VERSE": "75:40",
    "ARABIC": "أَلَيْسَ ذَٰلِكَ بِقَٰدِرٍ عَلَىٰٓ أَن يُحْۦِىَ ٱلْمَوْتَىٰ",
    "ENGLISH": {
        "TRANSLATION_0": "Is He who does this not able to bring the dead to life?",
        "TRANSLATION_1": "Cannot such as He bring the dead to life?\n",
        "TRANSLATION_2": "Does He, then, not have the power to bring back the dead to life?\n",
        "TRANSLATION_3": "Does He then not have the power to bring the dead back to life?\n",
        "TRANSLATION_4": "So will He, Who has done all this, not be able to revive the dead?\n",
        "TRANSLATION_5": "Is it not so then, that He would be able to give life to the dead\n",
        "TRANSLATION_6": "Is not He able to give life to the dead?\n",
        "TRANSLATION_7": "What, is He not able to quicken the dead?\n",
        "TRANSLATION_8": "Is not He (Who doeth so) Able to bring the dead to life?\n",
        "TRANSLATION_9": "Then is He not able to bring the dead back to life?\n",
        "TRANSLATION_10": "Is not That One then Able to quicken the dead?\n",
        "TRANSLATION_11": "Is not [someone like] that able to revive the dead?\n",
        "TRANSLATION_12": "Has not He, (the same), the power to give life to the dead?\n",
        "TRANSLATION_13": "Is not He (Allah Who does that), Able to give life to the dead? (Yes! He is Able to do all things).\n",
        "TRANSLATION_14": "What, is He then unable to revive the dead?\n",
        "TRANSLATION_15": "Is He not Able to revive the dead?\n",
        "TRANSLATION_16": "Is not that [Creator] Able to give life to the dead?\n",
        "TRANSLATION_17": "[75:40] Is not such, a Doer of [all] these things, able to revive the dead? — the Prophet (s) would say, ‘Yes, indeed!’\n",
        "TRANSLATION_18": "(Is not He (who doeth so) able to bring the dead to life) for the resurrection? Indeed, our Lord is Able to do so; He is Able to bring the dead back to life just as He did create Adam from dust'. And of the surah in which Time is mentioned, which is all Meccan and consists of 30 verses, 240 words and 1054 letters: Surah 76: Time or Man (al-Dahr , Al-lnsan) And of the surah in which Time is mentioned, which is all Meccan and consists of 30 verses, 240 words and 1054 letters:\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "75:40",
            "37:58",
            "77:18",
            "37:110",
            "50:19",
            "56:60",
            "75:25",
            "67:16",
            "15:54",
            "3:143"
        ],
        "BIBLE": [
            "prophets:jeremiah:45:5",
            "prophets:ii%20samuel:23:17",
            "writings:i%20chronicles:11:19",
            "prophets:ii%20samuel:12:23",
            "torah:genesis:6:17",
            "writings:i%20chronicles:29:14",
            "writings:job:13:20",
            "writings:proverbs:22:20",
            "writings:job:14:4",
            "torah:genesis:28:15"
        ]
    }
}