{
    "VERSE": "13:10",
    "ARABIC": "سَوَآءٌ مِّنكُم مَّنْ أَسَرَّ ٱلْقَوْلَ وَمَن جَهَرَ بِهِۦ وَمَنْ هُوَ مُسْتَخْفٍۭ بِٱلَّيْلِ وَسَارِبٌۢ بِٱلنَّهَارِ",
    "ENGLISH": {
        "TRANSLATION_0": "It makes no difference whether you keep secret what you say or voice it out loud, whether you hide in the night or go out in the day.",
        "TRANSLATION_1": "He who keeps his secret among you is the same to Him as he who speaks out publicly, and he who hides himself in the night and walks freely in the day.\n",
        "TRANSLATION_2": "It is all the same for Him whether any of you says a thing secretly, or says it loudly, and whether one hides oneself in the darkness of night, or struts about in broad daylight.\n",
        "TRANSLATION_3": "It is all the same to Him whether you speak in secret or out loud, try to hide in the darkness of night or walk in the brightness of day.\n",
        "TRANSLATION_4": "Equal* are the one among you who speaks softly and one who speaks aloud, and one who is hidden during the night and one who walks during the daytime. (* For Allah.)\n",
        "TRANSLATION_5": "It is the same (to Him) whether any of you conceals his speech or declares it openly, whether he be hid by night or goes forth freely by day.\n",
        "TRANSLATION_6": "Alike (to Him) among you is he who conceals (his) words and he who speaks them openly, and he who hides himself by night and (who) goes forth by day.\n",
        "TRANSLATION_7": "Alike of you is he who conceals his -- saying, and he who proclaims it, he who hides himself in the night, and he who sallies by day;\n",
        "TRANSLATION_8": "Alike of you is he who hideth the saying and he who noiseth it abroad, he who lurketh in the night and he who goeth freely in the daytime.\n",
        "TRANSLATION_9": "It makes no difference whether you converse in secret or aloud, whether you hide under the cloak of night or walk about freely in the light of day.\n",
        "TRANSLATION_10": "Equal unto him is he among you who hideth the word and he who publisheth it, and he who hideth himself in the night and he who goeth about freely in the day.\n",
        "TRANSLATION_11": "It is the same [to Him] whether any of you speaks secretly, or does so loudly, or whether he lurks in the night, or is open to view in daytime.\n",
        "TRANSLATION_12": "It is the same (to Him) whether any of you conceal his speech or declare it openly; whether he lie hid by night or walk forth freely by day.\n",
        "TRANSLATION_13": "It is the same (to Him) whether any of you conceal his speech or declare it openly, whether he be hid by night or go forth freely by day.\n",
        "TRANSLATION_14": "Similar to yourself is he who conceals his saying, and he who proclaims it, he who hides himself in the night, and he who goes forth by day,\n",
        "TRANSLATION_15": "It is the same; whether one of you conceals his speech, or declares it; whether he goes into hiding by night, or goes out by day.\n",
        "TRANSLATION_16": "It is the same [to Him] concerning you whether one conceals [his] speech or one publicizes it and whether one is hidden by night or conspicuous [among others] by day.\n",
        "TRANSLATION_17": "[13:10] [They are all] the same, according to His knowledge, exalted be He, those of you who speak secretly and those who do so openly, and those who lurk, [who] hide themselves, in the night, in its darkness, and those who go forth, [those who] are manifest [to view] when they make their way, by day.\n",
        "TRANSLATION_18": "258 (Alike of you) in the sight of Allah, as far as His knowledge is concerned (is he who hideth the saying) and works (and he who noiseth it abroad) and him who makes his speech and works public; Allah knows all this, (he who lurketh in the night) he who hides in the dark of the night (and he who goeth freely in the daytime) He says: or works, Allah knows what he does.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "13:10",
            "21:20",
            "23:80",
            "21:42",
            "3:27",
            "36:37",
            "14:33",
            "6:13",
            "57:6",
            "25:62"
        ],
        "BIBLE": [
            "writings:psalms:37:6",
            "torah:genesis:35:3",
            "prophets:isaiah:55:11",
            "torah:numbers:12:6",
            "writings:nehemiah:8:12",
            "writings:daniel:2:9",
            "writings:nehemiah:8:15",
            "prophets:isaiah:42:16",
            "torah:deuteronomy:4:10",
            "prophets:ezekiel:12:23"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:3:2"
        ]
    }
}