{
    "VERSE": "13:11",
    "ARABIC": "لَهُۥ مُعَقِّبَٰتٌ مِّنۢ بَيْنِ يَدَيْهِ وَمِنْ خَلْفِهِۦ يَحْفَظُونَهُۥ مِنْ أَمْرِ ٱللَّهِ إِنَّ ٱللَّهَ لَا يُغَيِّرُ مَا بِقَوْمٍ حَتَّىٰ يُغَيِّرُوا۟ مَا بِأَنفُسِهِمْ وَإِذَآ أَرَادَ ٱللَّهُ بِقَوْمٍ سُوٓءًا فَلَا مَرَدَّ لَهُۥ وَمَا لَهُم مِّن دُونِهِۦ مِن وَالٍ",
    "ENGLISH": {
        "TRANSLATION_0": "Everyone has a succession of angels in front of him and behind him, guarding him by Allah's command. Allah never changes a people's state until they change what is in themselves. When Allah desires evil for a people, there is no averting it. They have no protector apart from Him.",
        "TRANSLATION_1": "His angels keep watch over him in succession (night and day), in front and behind, by God's command. Verily God does not change the state of a people till they change themselves. When God intends misfortune for a people no one can avert it, and no saviour will they have apart from Him.\n",
        "TRANSLATION_2": "There are guardians over everyone, both before him and behind him, who guard him by Allah's command. Verily Allah does not change a people's condition unless they change their inner selves. And when Allah decides to make a people suffer punishment, no one can avert it. Nor can any be of help to such a people against Allah.\n",
        "TRANSLATION_3": "Everyone is guarded and protected on all sides by the order of God. God does not change the condition of a nation unless it changes what is in its heart. When God wants to punish a people, there is no way to escape from it and no one besides God will protect them from it.\n",
        "TRANSLATION_4": "For man are angels of alternating duties, in front and behind him, who guard him by Allah’s command; indeed Allah does not change His favour upon any nation until they change their own condition; and when Allah wills misfortune for a nation, it cannot be repelled; and they do not have any supporter besides Him.\n",
        "TRANSLATION_5": "For him (each person), there are angels in succession, before and behind him. They guard him by the command of Allah. Verily, Allah will not change the (good) condition of a people as long as they do not change their state (of goodness) themselves. But when Allah wills a people's punishment, there can be no turning it back, and they will find besides Him no protector.\n",
        "TRANSLATION_6": "For his sake there are angels following one another, before him and behind him, who guard him by Allah's commandment; surely Allah does not change the condition of a people until they change their own condition; and when Allah intends evil to a people, there is no averting it, and besides Him they have no protector.\n",
        "TRANSLATION_7": "he has attendant angels, before him and behind him, watching over him by God's command. God changes not what is in a people, until they change what is in themselves. Whensover God desires evil for a people, there is no turning it back; apart from Him, they have no protector.\n",
        "TRANSLATION_8": "For him are angels ranged before him and behind him, who guard him by Allah's command. Lo! Allah changeth not the condition of a folk until they (first) change that which is in their hearts; and if Allah willeth misfortune for a folk there is none that can repel it, nor have they a defender beside Him.\n",
        "TRANSLATION_9": "Each has guardian angels before him and behind him, who watch him at God's command. God does not change the condition of a people's lot, unless they change what is in their hearts. But when God decrees punishment for a people, none can ward it off. Besides Him, they have no protector.\n",
        "TRANSLATION_10": "For him are angels in succession, before him and behind him; they guard him with Allah's command. Verily Allah altereth not that which is with a people until they alter that which is with themselves. And when Allah intendeth evil unto a people there is no turning it back; nor is for them, beside Him, any patron.\n",
        "TRANSLATION_11": "He has guardian angels, to his front and his rear, who guard him by Allah’s command. Indeed Allah does not change a people’s lot, unless they change what is in their souls. And when Allah wishes to visit ill on a people, there is nothing that can avert it, and they have no protector besides Him.\n",
        "TRANSLATION_12": "For each (such person) there are (angels) in succession, before and behind him: They guard him by command of Allah. Allah does not change a people's lot unless they change what is in their hearts. But when (once) Allah willeth a people's punishment, there can be no turning it back, nor will they find, besides Him, any to protect.\n",
        "TRANSLATION_13": "For each (person), there are angels in succession, before and behind him. They guard him by the Command of Allah. Verily! Allah will not change the good condition of a people as long as they do not change their state of goodness themselves (by committing sins and by being ungrateful and disobedient to Allah). But when Allah wills a people's punishment, there can be no turning back of it, and they will find besides Him no protector.\n",
        "TRANSLATION_14": "he has attendant angels before him and behind him, who, by the Command of Allah watch over him. Allah does not change what is in a nation unless they change what is in themselves. Whenever Allah wants evil for a nation, none can ward it off. Other than Him, they have no guardian.\n",
        "TRANSLATION_15": "He has a succession; before him and behind him, protecting him by God’s command. God does not change the condition of a people until they change what is within themselves. And if God wills any hardship for a people, there is no turning it back;, and apart from Him they have no protector.\n",
        "TRANSLATION_16": "For each one are successive [angels] before and behind him who protect him by the decree of Allah. Indeed, Allah will not change the condition of a people until they change what is in themselves. And when Allah intends for a people ill, there is no repelling it. And there is not for them besides Him any patron.\n",
        "TRANSLATION_17": "[13:11]   For him, for man, are attendants, angels who follow him, to his front and to his rear, guarding him through God’s command, that is, by His command, from [the danger of] the jinn and others. Indeed God does not alter the state of a people — He does not deprive them of His grace — unless they have altered the state of their souls, from [their] comely nature, through an act of disobedience. And if God wills misfortune, chastisement, for a people there is none that can repel it, either from among the attendant angels or others; and they, for whom God wills misfortune, have no protector (min wālin: min is extra) to avert it from them, apart from Him, that is, other than God.\n",
        "TRANSLATION_18": "(For him are angels ranged before him) He has angels who succeed one another: the angels of the night succeed the angels of the day and vice versa (and behind him who guard him by Allah's command) and who drive him to the things destined. (Lo! Allah changeth not the condition of a folk) the blessing and safety of a people (until they (first) change that which is in their hearts) by failing to give thanks; (and if Allah willeth misfortune) a chastisement or destruction (for a folk there is none that can repel it) there is none that can repel Allah's decree concerning them, (nor have they) for those whom Allah wants to destroy (a defender) who can save them from Allah's chastisement; it is also said that this means: none can give them a refuge to which they can escape (beside Him) beside Allah.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "13:11",
            "22:76",
            "41:14",
            "27:43",
            "36:9",
            "11:101",
            "36:45",
            "19:64",
            "72:27",
            "21:43"
        ],
        "BIBLE": [
            "prophets:joshua:1:8",
            "prophets:jeremiah:32:40",
            "writings:daniel:6:13",
            "writings:i%20chronicles:12:39",
            "prophets:i%20samuel:12:20",
            "prophets:isaiah:63:17",
            "writings:daniel:6:8",
            "torah:deuteronomy:31:29",
            "torah:genesis:2:18",
            "prophets:jeremiah:31:33"
        ]
    }
}