{
    "VERSE": "13:12",
    "ARABIC": "هُوَ ٱلَّذِى يُرِيكُمُ ٱلْبَرْقَ خَوْفًا وَطَمَعًا وَيُنشِئُ ٱلسَّحَابَ ٱلثِّقَالَ",
    "ENGLISH": {
        "TRANSLATION_0": "It is He Who shows you the lightning, striking fear and bringing hope; it is He Who heaps up the heavy clouds.",
        "TRANSLATION_1": "It is He who makes the lightning flash for fear and hope, and raises massive clouds.\n",
        "TRANSLATION_2": "He it is Who causes you to see lightning that inspires you with both fear and hope, and He it is Who whips up heavy clouds.\n",
        "TRANSLATION_3": "It is God who flashes lightning to frighten you and to give you hope. It is He who forms the heavy clouds.\n",
        "TRANSLATION_4": "It is He Who shows you the lightning, for fear and for hope, and raises the heavy clouds.\n",
        "TRANSLATION_5": "It is He Who shows you the lightning, as a fear and as a hope. And it is He Who brings up the clouds, heavy (with water).\n",
        "TRANSLATION_6": "He it is Who shows you the lightning causing fear and hope and (Who) brings up the heavy cloud.\n",
        "TRANSLATION_7": "It is He who shows you the lightning, for fear and hope, and produces the heavy clouds;\n",
        "TRANSLATION_8": "He it is Who showeth you the lightning, a fear and a hope, and raiseth the heavy clouds.\n",
        "TRANSLATION_9": "It is He who shows you the lightning, inspiring fear and hope, and gathers up the heavy clouds;\n",
        "TRANSLATION_10": "He It is who sheweth the lightning unto you for fear and for desire, and bringeth up the clouds heavy.\n",
        "TRANSLATION_11": "It is He who shows you the lightning, inspiring fear and hope, and He produces the clouds heavy [with rain].\n",
        "TRANSLATION_12": "It is He Who doth show you the lightning, by way both of fear and of hope: It is He Who doth raise up the clouds, heavy with (fertilising) rain!\n",
        "TRANSLATION_13": "It is He who shows you the lightning, as a fear (for travellers) and as a hope (for those who wait for rain). And it is He Who brings up (or originates) the clouds, heavy (with water).\n",
        "TRANSLATION_14": "It is He who shows you the lightning, for fear and hope, and Who produces laden clouds.\n",
        "TRANSLATION_15": "It is He who shows you the lightening, causing fear and hope. And He produces the heavy clouds.\n",
        "TRANSLATION_16": "It is He who shows you lightening, [causing] fear and aspiration, and generates the heavy clouds.\n",
        "TRANSLATION_17": "[13:12] He it is Who shows you the lightning, [inspiring] fear, in travellers, of thunderbolts, and hope, for those who are at home, of rain; and He produces, He creates, the clouds that are heavy, with rain.\n",
        "TRANSLATION_18": "(He it is Who showeth you the lightning) rain, (a fear) for the traveller in that his clothes will be soaked (and a hope) for the sedentary for his land gets irrigated, (and raises) He creates and raises (the heavy clouds) which carry rain.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "13:12",
            "23:78",
            "67:23",
            "32:16",
            "76:27",
            "106:4",
            "7:56",
            "30:24",
            "32:9",
            "7:48"
        ],
        "BIBLE": [
            "prophets:isaiah:49:11",
            "prophets:i%20samuel:2:7",
            "writings:job:40:19",
            "prophets:ii%20samuel:22:33",
            "prophets:isaiah:40:3",
            "writings:psalms:85:14",
            "torah:exodus:20:4",
            "torah:deuteronomy:5:8",
            "prophets:isaiah:48:15",
            "torah:deuteronomy:30:12"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:12",
            "Sefer%20Yetzirah:1:14",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:3:4",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:3:7"
        ]
    }
}