{
    "VERSE": "13:14",
    "ARABIC": "لَهُۥ دَعْوَةُ ٱلْحَقِّ وَٱلَّذِينَ يَدْعُونَ مِن دُونِهِۦ لَا يَسْتَجِيبُونَ لَهُم بِشَىْءٍ إِلَّا كَبَٰسِطِ كَفَّيْهِ إِلَى ٱلْمَآءِ لِيَبْلُغَ فَاهُ وَمَا هُوَ بِبَٰلِغِهِۦ وَمَا دُعَآءُ ٱلْكَٰفِرِينَ إِلَّا فِى ضَلَٰلٍ",
    "ENGLISH": {
        "TRANSLATION_0": "The call of truth is made to Him alone. Those they call upon apart from Him do not respond to them at all. It is like someone stretching out his cupped hands towards water to convey it to his mouth: it will never get there. The call of the kuffar only goes astray.",
        "TRANSLATION_1": "To call on Him is true (supplication). For those they invoke other than Him do not answer them at all, except like a man who stretches his hands towards the water that it reach his mouth, but it will never reach it. Not more than error are the prayers of infidels.\n",
        "TRANSLATION_2": "To Him alone should all prayer be addressed, for those to whom they do address their prayers beside Him are altogether powerless to respond to them. The example of praying to any other than Allah is that of a man who stretches out his hands to water, asking it to reach his mouth, although water has no power to reach his mouth. The prayers of the unbelievers are a sheer waste.\n",
        "TRANSLATION_3": "Prayer to Him is the true prayer. Those to whom they pray instead of God will answer none of their prayers. It is as though one stretches his hands out to the water that can never reach his mouth. The prayers of the unbelievers will get nowhere.\n",
        "TRANSLATION_4": "Only the prayer to Him is truthful; and whomever they pray to besides Him, do not hear them at all, but like one who has his hands outstretched towards water that it may come into his mouth, and it will never come; and every prayer of the disbelievers remains wandering.\n",
        "TRANSLATION_5": "For Him is the Word of Truth. And those whom they invoke besides Him, answer them no more than one who stretches forth his hand for water to reach his mouth, but it reaches him not; and the invocation of the disbelievers is nothing but misguidance.\n",
        "TRANSLATION_6": "To Him is due the true prayer; and those whom they pray to besides Allah give them no answer, but (they are) like one who stretches forth his two hands towards water that it may reach his mouth, but it will not reach it; and the prayer of the unbelievers is only in error.\n",
        "TRANSLATION_7": "To Him is the call of truth; and those upon whom they call, apart from Him, answer them nothing, but it is as a man who stretches out his hands to water that it may reach his mouth, and it reaches it not. The prayer of the unbelievers goes only astray.\n",
        "TRANSLATION_8": "Unto Him is the real prayer. Those unto whom they pray beside Allah respond to them not at all, save as (is the response to) one who stretcheth forth his hands toward water (asking) that it may come unto his mouth, and it will never reach it. The prayer of disbelievers goeth (far) astray.\n",
        "TRANSLATION_9": "The only true appeal is to God alone; those they appeal to instead of Him will never respond to them in any way. They are like a man who stretches forth his hands toward the water, so that it may reach his mouth, but it never does. The calls of those who deny the truth are all in vain.\n",
        "TRANSLATION_10": "Unto Him is the true call, and those whom they call upon beside Him answer them not at all, save as is answered one stretching out his palms to water that it may reach his mouth, while it will reach it not. And the supplication of the infidels only goeth astray.\n",
        "TRANSLATION_11": "[Only] to Him belongs the true invocation; and those whom they invoke besides Him do not answer them in any wise—like someone who stretches his hands towards water [desiring] that it should reach his mouth, but it does not reach it—and the invocations of the faithless only go awry.\n",
        "TRANSLATION_12": "For Him (alone) is prayer in Truth: any others that they call upon besides Him hear them no more than if they were to stretch forth their hands for water to reach their mouths but it reaches them not: for the prayer of those without Faith is nothing but (futile) wandering (in the mind).\n",
        "TRANSLATION_13": "For Him (Alone) is the Word of Truth (i.e. none has the right to be worshipped but He). And those whom they (polytheists and disbelievers) invoke, answer them no more than one who stretches forth his hand (at the edge of a deep well) for water to reach his mouth, but it reaches him not, and the invocation of the disbelievers is nothing but an error (i.e. of no use).\n",
        "TRANSLATION_14": "To Him is the Call of truth. Those to whom they call, other than Him, give them no answer. They are like he who stretches out his hands to the water andbids it rise to his mouth, it does not reach it! The prayers of the unbelievers goes astray.\n",
        "TRANSLATION_15": "To Him belongs the call to truth. Those they call upon besides Him do not respond to them with anything—except as someone who stretches his hands towards water, so that it may reach his mouth, but it does not reach it. The prayers of the unbelievers are only in vain.\n",
        "TRANSLATION_16": "To Him [alone] is the supplication of truth. And those they call upon besides Him do not respond to them with a thing, except as one who stretches his hands toward water [from afar, calling it] to reach his mouth, but it will not reach it [thus]. And the supplication of the disbelievers is not but in error [i.e. futility].\n",
        "TRANSLATION_17": "[13:14] His, exalted be He, is the call of truth, that is, the words that constitute it [the truth], and these are: ‘there is no god but God’ (lā ilāha illā’Llāh); and those upon whom they call (read yad‘ūn or tad‘ūn, ‘you call’), [those whom] they worship, apart from Him, that is, other than Him — namely, the idols — do not answer them anything, of which they ask; save as, is the response to, one who stretches forth his hands towards water, at the edge of a well, calling to it, that it may reach his mouth, by its rising through the well to [reach] him, but it would never reach it, that is, [reach] his mouth, ever: likewise they [the idols] will not answer them; and the call of the disbelievers, their worship of idols — or their actual supplication — goes only astray, [it is only] in perdition.\n",
        "TRANSLATION_18": "(Unto Him is the real prayer) the Religion of the Truth: the confession that there is no god save Allah, which is the declaration of one's sincerity to Allah. (Those unto whom they pray) worship (beside Allah respond to them not at all) of benefit when they call upon them, (save as (if the response to) one who stretcheth forth his hands towards water) from far ((asking) that it may come unto his mouth and it will never reach it) in such state, hard as he may try. Allah says: just as water cannot possibly reach the mouth of such a man, the idols will also not benefit those who worship them. (The prayer of disbelievers) the worship of the disbelievers (goeth (far) astray) it is void and they will not find it.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "13:14",
            "43:86",
            "46:5",
            "40:20",
            "53:28",
            "16:20",
            "16:73",
            "10:36",
            "29:42",
            "40:25"
        ],
        "BIBLE": [
            "prophets:isaiah:50:2",
            "torah:numbers:22:38",
            "writings:i%20chronicles:12:18",
            "prophets:ii%20samuel:14:19",
            "prophets:joshua:3:16",
            "writings:proverbs:1:24",
            "prophets:ii%20samuel:15:2",
            "prophets:isaiah:66:2",
            "prophets:ezekiel:9:2",
            "prophets:i%20samuel:9:8"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:3",
            
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:9"
        ]
    }
}