{
    "VERSE": "13:15",
    "ARABIC": "وَلِلَّهِ يَسْجُدُ مَن فِى ٱلسَّمَٰوَٰتِ وَٱلْأَرْضِ طَوْعًا وَكَرْهًا وَظِلَٰلُهُم بِٱلْغُدُوِّ وَٱلْءَاصَالِ",
    "ENGLISH": {
        "TRANSLATION_0": "Everyone in heaven and earth prostrates to Allah willingly or unwillingly, as do their shadows in the",
        "TRANSLATION_1": "Whosoever is in the heavens and on earth bows to God in submission with a will or perforce, as do their shadows in the morning and evening.\n",
        "TRANSLATION_2": "All that is in the heavens and the earth prostrates itself, whether willingly or by force, before Allah; and so do their shadows in the morning and in the evening.\n",
        "TRANSLATION_3": "All in the heavens and the earth prostrate themselves before God, either of their own free will or by force, just as do their shadows in the mornings and evenings.\n",
        "TRANSLATION_4": "And to Allah only prostrate all those who are in the heavens and in the earth, willingly or helplessly – and their shadows – every morning and evening. (Command of prostration # 2).\n",
        "TRANSLATION_5": "And unto Allah falls in prostration whoever is in the heavens and the earth, willingly or unwillingly, and so do their shadows in the mornings and in the afternoons.\n",
        "TRANSLATION_6": "And whoever is in the heavens and the earth makes obeisance to Allah only, willingly and unwillingly, and their shadows too at morn and eve.\n",
        "TRANSLATION_7": "To God bow all who are in the heavens and the earth, willingly or unwillingly, as do their shadows also in the mornings and the evenings.\n",
        "TRANSLATION_8": "And unto Allah falleth prostrate whosoever is in the heavens and the earth, willingly or unwillingly, as do their shadows in the morning and the evening hours.\n",
        "TRANSLATION_9": "All who dwell in heavens and on the earth submit to God alone, willingly or unwillingly, as do their shadows in the mornings and in the evenings.\n",
        "TRANSLATION_10": "And unto Allah prostrateth himself whosoever is in the heavens and the earth, willingly or of constraint, and also thir shadows in the moring and the evenings.\n",
        "TRANSLATION_11": "To Allah prostrates whoever there is in the heavens and the earth, willingly or unwillingly, and their shadows at sunrise and sunset.\n",
        "TRANSLATION_12": "Whatever beings there are in the heavens and the earth do prostrate themselves to Allah (Acknowledging subjection),- with good-will or in spite of themselves: so do their shadows in the morning and evenings.\n",
        "TRANSLATION_13": "And unto Allah (Alone) falls in prostration whoever is in the heavens and the earth, willingly or unwillingly, and so do their shadows in the mornings and in the afternoons.\n",
        "TRANSLATION_14": "All who dwell in the heavens and earth shall prostrate themselves before Allah, either willingly or unwillingly; as do their shadows in the mornings andevenings.\n",
        "TRANSLATION_15": "To God prostrates everyone in the heavens and the earth, willingly or unwillingly, as do their shadows, in the morning and in the evening.\n",
        "TRANSLATION_16": "And to Allah prostrates whoever is within the heavens and the earth, willingly or by compulsion, and their shadows [as well] in the mornings and the afternoons.\n",
        "TRANSLATION_17": "[13:15] And to God prostrate whoever is in the heavens and the earth, willingly, such as believers, or unwillingly, such as hypocrites and those coerced by the sword, and their shadows also, prostrate, in the mornings and the evenings.\n",
        "TRANSLATION_18": "(And unto Allah falleth prostrate) pray to and worship (whosoever is in the heavens) the angels (and the earth) the believing servants, (willingly) this refers to the dwellers of heaven for their worship is performed without any hardship (or unwillingly) this refers to the dwellers of earth, for their worship is performed with some hardship; it is also said that (willingly) is in reference to the sincere believers while (unwillingly) refers to the hypocrites; it is also said that (willingly) refers to those who were born Muslim while (unwillingly) refers to those who were coerced to embrace Islam, (as do their shadows) the shadows of those who prostrate to Allah also prostrate (in the morning and the evening hours) in the morning they do so on the right side and in the evening on the left side.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "13:15",
            "3:83",
            "4:132",
            "24:36",
            "53:31",
            "16:49",
            "64:4",
            "30:26",
            "57:1",
            "4:126"
        ],
        "BIBLE": [
            "torah:genesis:24:3",
            "prophets:jeremiah:19:7",
            "prophets:ezekiel:34:28",
            "prophets:isaiah:66:22",
            "prophets:zechariah:12:2",
            "writings:psalms:32:5",
            "prophets:hosea:14:8",
            "writings:proverbs:11:5",
            "prophets:ii%20samuel:23:5",
            "torah:deuteronomy:5:8"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:1:1"
        ]
    }
}