{
    "VERSE": "13:2",
    "ARABIC": "ٱللَّهُ ٱلَّذِى رَفَعَ ٱلسَّمَٰوَٰتِ بِغَيْرِ عَمَدٍ تَرَوْنَهَا ثُمَّ ٱسْتَوَىٰ عَلَى ٱلْعَرْشِ وَسَخَّرَ ٱلشَّمْسَ وَٱلْقَمَرَ كُلٌّ يَجْرِى لِأَجَلٍ مُّسَمًّى يُدَبِّرُ ٱلْأَمْرَ يُفَصِّلُ ٱلْءَايَٰتِ لَعَلَّكُم بِلِقَآءِ رَبِّكُمْ تُوقِنُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Allah is He who raised up the heavens without any support - you can see that - and then established Himself firmly on the Throne. He made the sun and moon subservient, each running for a specified term. He directs the whole affair. He makes the Signs clear so that hopefully you will be certain about the meeting with your Lord.",
        "TRANSLATION_1": "It is God who raised the skies without support, as you can see, then assumed His throne, and enthralled the sun and the moon (so that) each runs to a predetermined course. He disposes all affairs, distinctly explaining every sign that you may be certain of the meeting with your Lord.\n",
        "TRANSLATION_2": "It is Allah Who has raised the heavens without any supports that you could see, and then He established Himself on the Throne (of Dominion). And He it is Who has made the sun and the moon subservient (to a law), each running its course till an appointed term. He governs the entire order of the universe and clearly explains the signs that you may be firmly convinced about meeting your Lord.\n",
        "TRANSLATION_3": "God is the One Who raised the heavens without a pillar as you can see. Then He established his control over the realm and made the sun and moon subservient to Him. Each of them will remain in motion for an appointed time. He regulates all affairs and explains the evidence (of His existence) so that perhaps you will be certain of your meeting with your Lord.\n",
        "TRANSLATION_4": "It is Allah Who raised up the heavens without columns for you to observe, then (in the manner befitting His Majesty) established Himself upon the Throne (of control), then subjected the sun and the moon; each one runs for up to an appointed term; Allah plans the works and explain the signs in detail, so that you may believe in meeting with your Lord.\n",
        "TRANSLATION_5": "Allah is He Who raised the heavens without any pillars that you can see. Then, He rose above (Istawa) the `Arsh [Throne]. He has subjected the sun and the moon, each running (its course) for a term appointed. He manages and regulates all affairs; He explains the Ayat in detail, that you may believe with certainty in the meeting with your Lord.\n",
        "TRANSLATION_6": "Allah is He Who raised the heavens without any pillars that you see, and He is firm in power and He made the sun and the moon subservient (to you); each one pursues its course to an appointed time; He regulates the affair, making clear the signs that you may be certain of meeting your Lord.\n",
        "TRANSLATION_7": "God is He who raised up the heavens without pillars you can see, then He sat Himself upon the Throne. He subjected the sun and the moon, each one running to a term stated. He directs the affair; He distinguishes the signs; haply you will have faith in the encounter with your Lord.\n",
        "TRANSLATION_8": "Allah it is Who raised up the heavens without visible supports, then mounted the Throne, and compelled the sun and the moon to be of service, each runneth unto an appointed term; He ordereth the course; He detaileth the revelations, that haply ye may be certain of the meeting with your Lord.\n",
        "TRANSLATION_9": "It was God who raised the heavens with no visible supports, and then established Himself on the throne; He has regulated the sun and the moon, so that each will pursue its course for an appointed time; He ordains all things and makes plain His revelations, so that you may be certain of meeting your Lord;\n",
        "TRANSLATION_10": "Allah it is who hath raised the heavens without pillars that ye can see, then He established Himself on the throne, and subjected the sun and the moon, each running unto a period determined. He disposeth the affair, and detaileth the signs, that haply of the meeting with your Lord ye may be convinced.\n",
        "TRANSLATION_11": "It is Allah who raised the heavens without any pillars that you see, and then presided over the Throne. He disposed the sun and the moon, each moving for a specified term. He directs the command, [and] elaborates the signs that you may be certain of encountering your Lord.\n",
        "TRANSLATION_12": "Allah is He Who raised the heavens without any pillars that ye can see; is firmly established on the throne (of authority); He has subjected the sun and the moon (to his Law)! Each one runs (its course) for a term appointed. He doth regulate all affairs, explaining the signs in detail, that ye may believe with certainty in the meeting with your Lord.\n",
        "TRANSLATION_13": "Allah is He Who raised the heavens without any pillars that you can see. Then, He Istawa (rose above) the Throne (really in a manner that suits His Majesty). He has subjected the sun and the moon (to continue going round)! Each running (its course) for a term appointed. He regulates all affairs, explaining the Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) in detail, that you may believe with certainty in the meeting with your Lord.\n",
        "TRANSLATION_14": "It is Allah who raised the heavens without pillars that you see. Then He willed to the Throne and subjected the sun and the moon, each pursuing an appointed course. He directs the affair. He makes plain His verses so that you will firmly believe in meeting your Lord.\n",
        "TRANSLATION_15": "God is He who raised the heavens without pillars that you can see, and then settled on the Throne. And He regulated the sun and the moon, each running for a specified period. He manages all affairs, and He explains the signs, that you may be certain of the meeting with your Lord.\n",
        "TRANSLATION_16": "It is Allah who erected the heavens without pillars that you [can] see; then He established Himself above the Throne and made subject the sun and the moon, each running [its course] for a specified term. He arranges [each] matter; He details the signs that you may, of the meeting with your Lord, be certain.\n",
        "TRANSLATION_17": "[13:2] God is He Who raised up the heavens without visible supports (‘amad is the plural of ‘imād, which is [the same as] an ustuwāna, ‘a column’; and this [statement] is true, since there are no actual supports) then presided upon the Throne, a presiding befitting Him, and disposed, made subservient, the sun and the moon, each one, of them, moving, along its course, until [the conclusion of] an appointed time, that is, [until] the Day of Resurrection. He directs the command, He conducts the affairs of His Kingdom. He details, He expounds, the signs, the indications of His power, so that you, O people of Mecca, might be certain of the encounter with your Lord, through resurrection.\n",
        "TRANSLATION_18": "(Allah it is who raised up the heavens) He created the heavens and raised them up above the earth (without visible supports) He says: you see them without support; it is also said that this means: they have supports which you do not see, (then mounted the Throne) Allah was on the Throne before He raised up the heavens; it is also said that this means: He established Himself on the Throne; and it is also said that this means: as far as His knowledge and power are concerned, that which is near and that which is far are all equal to Him, (and compelled the sun and the moon to be of service) He made the light emanating from the sun and the moon of service to the Children of Adam, (each runneth unto an appointed term) to a fixed time; (He ordereth the course) He looks into the affairs of the servants and He sends the angels with revelation, Scripture and misfortune; (He detaileth the revelations) He explains the Qur'an by expositing the commands and prohibitions, (that haply ye may be certain of the meeting with your Lord) that you may believe in resurrection after death.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "13:2",
            "11:123",
            "35:13",
            "7:54",
            "31:29",
            "39:5",
            "27:93",
            "39:63",
            "41:37",
            "31:10"
        ],
        "BIBLE": [
            "prophets:ezekiel:32:14",
            "prophets:i%20samuel:2:8",
            "prophets:ii%20samuel:23:5",
            "writings:daniel:6:13",
            "writings:daniel:6:8",
            "writings:daniel:9:27",
            "prophets:ii%20samuel:7:23",
            "writings:ii%20chronicles:20:20",
            "writings:i%20chronicles:17:21",
            "prophets:isaiah:29:3"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:4",
            
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:4:3"
        ]
    }
}