{
    "VERSE": "13:20",
    "ARABIC": "ٱلَّذِينَ يُوفُونَ بِعَهْدِ ٱللَّهِ وَلَا يَنقُضُونَ ٱلْمِيثَٰقَ",
    "ENGLISH": {
        "TRANSLATION_0": "those who fulfil Allah's contract and do not break their agreement;",
        "TRANSLATION_1": "Who fulfil their covenant with God and do not break their agreement,\n",
        "TRANSLATION_2": "those who fulfil their covenant with Allah and do not break their compact after firmly confirming it;\n",
        "TRANSLATION_3": "Those who fulfill their promise to and covenant with God,\n",
        "TRANSLATION_4": "Those who fulfil the pact of Allah, and do not renege on the covenant.\n",
        "TRANSLATION_5": "Those who fulfill, the covenant of Allah and break not the trust.\n",
        "TRANSLATION_6": "Those who fulfil the promise of Allah and do not break the covenant,\n",
        "TRANSLATION_7": "who fulfil God's covenant, and break not the compact,\n",
        "TRANSLATION_8": "Such as keep the pact of Allah, and break not the covenant;\n",
        "TRANSLATION_9": "they who are true to their bond with God and never break their covenant;\n",
        "TRANSLATION_10": "Those who fulfil the covenant of Allah, and violate not the bond.\n",
        "TRANSLATION_11": "—those who fulfill Allah’s covenant and do not break the pledge solemnly made,\n",
        "TRANSLATION_12": "Those who fulfil the covenant of Allah and fail not in their plighted word;\n",
        "TRANSLATION_13": "Those who fulfill the Covenant of Allah and break not the Mithaq (bond, treaty, covenant);\n",
        "TRANSLATION_14": "who fulfill their promise to Allah and do not break their pledge;\n",
        "TRANSLATION_15": "Those who fulfill the promise to God, and do not violate the agreement.\n",
        "TRANSLATION_16": "Those who fulfill the covenant of Allah and do not break the contract,\n",
        "TRANSLATION_17": "[13:20] such as fulfil God’s covenant, [meaning] the one that was taken from them while they were still atoms — or [meaning] any covenant — and do not break the pact, by abandoning belief, or [religious] obligations;\n",
        "TRANSLATION_18": "(Such as keep the pact of Allah) they fulfil the obligations of Allah, (and break not the covenant) they do not refrain from the obligations of Allah;\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "13:20",
            "2:27",
            "3:76",
            "33:15",
            "13:25",
            "3:141",
            "47:11",
            "5:7",
            "13:28",
            "39:61"
        ],
        "BIBLE": [
            "torah:numbers:30:3",
            "prophets:ezekiel:16:59",
            "torah:leviticus:26:44",
            "prophets:nahum:1:13",
            "torah:leviticus:26:15",
            "writings:nehemiah:13:27",
            "prophets:jeremiah:33:20",
            "torah:numbers:15:31",
            "prophets:isaiah:24:5",
            "writings:psalms:34:21"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:1:3"
        ]
    }
}