{
    "VERSE": "13:21",
    "ARABIC": "وَٱلَّذِينَ يَصِلُونَ مَآ أَمَرَ ٱللَّهُ بِهِۦٓ أَن يُوصَلَ وَيَخْشَوْنَ رَبَّهُمْ وَيَخَافُونَ سُوٓءَ ٱلْحِسَابِ",
    "ENGLISH": {
        "TRANSLATION_0": "those who join what Allah has commanded to be joined and are afraid of their Lord and fear an evil Reckoning;",
        "TRANSLATION_1": "Who keep together what God has ordained held together, and fear their Lord and dread the hardship of the Reckoning,\n",
        "TRANSLATION_2": "who join together the ties which Allah has bidden to be joined; who fear their Lord and dread lest they are subjected to severe reckoning;\n",
        "TRANSLATION_3": "who maintain all the proper relations that God has commanded them to maintain, who have fear of their Lord and the hardships of the Day of Judgment,\n",
        "TRANSLATION_4": "Those who unite what Allah has commanded to be united, and fear their Lord, and apprehend the evil of the account.\n",
        "TRANSLATION_5": "And those who join that which Allah has commanded to be joined and fear their Lord, and dread the terrible reckoning.\n",
        "TRANSLATION_6": "And those who join that which Allah has bidden to be joined and have awe of their Lord and fear the evil reckoning.\n",
        "TRANSLATION_7": "who join what God has commanded shall be joined, and fear their Lord, and dread the evil reckoning,\n",
        "TRANSLATION_8": "Such as unite that which Allah hath commandeth should be joined, and fear their Lord, and dread a woeful reckoning;\n",
        "TRANSLATION_9": "and those who join together what God has commanded to be joined, and fear their Lord and dread the harshness of the reckoning;\n",
        "TRANSLATION_10": "And those who enjoin that which Allah hath commanded to be enjoined, and fear their Lord, and dread the evil reckoning;\n",
        "TRANSLATION_11": "and those who join what Allah has commanded to be joined, and fear their Lord, and are afraid of an adverse reckoning\n",
        "TRANSLATION_12": "Those who join together those things which Allah hath commanded to be joined, hold their Lord in awe, and fear the terrible reckoning;\n",
        "TRANSLATION_13": "Those who join that which Allah has commanded to be joined (i.e. they are good to their relatives and do not sever the bond of kinship), fear their Lord, and dread the terrible reckoning (i.e. abstain from all kinds of sins and evil deeds which Allah has forbidden and perform all kinds of good deeds which Allah has ordained).\n",
        "TRANSLATION_14": "who join together what Allah has bidden to be united; who fear their Lord and dread the evil reckoning.\n",
        "TRANSLATION_15": "And those who join what God has commanded to be joined, and fear their Lord, and dread the dire reckoning.\n",
        "TRANSLATION_16": "And those who join that which Allah has ordered to be joined and fear their Lord and are afraid of the evil of [their] account,\n",
        "TRANSLATION_17": "[13:21] and such as cement what God has commanded should be cemented, of faith and kinship ties and so forth, and fear their Lord, that is, His Threat [of punishment], and dread an awful reckoning — a similar [statement] has preceded;\n",
        "TRANSLATION_18": "(Such as unite that which Allah hath commanded should be joined) of kinsfolk; it is also said that this means: of the belief in Muhammad (pbuh) and in the Qur'an, (and fear their Lord) and do works for the sake of their Lord, (and dread a woeful reckoning) and fear Allah's severe chastisement. 260\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "13:21",
            "39:61",
            "30:10",
            "2:169",
            "40:45",
            "47:2",
            "2:278",
            "28:68",
            "9:64",
            "3:141"
        ],
        "BIBLE": [
            "torah:deuteronomy:6:24",
            "torah:numbers:30:15",
            "torah:leviticus:5:17",
            "prophets:i%20kings:11:10",
            "torah:numbers:30:8",
            "torah:leviticus:4:22",
            "prophets:isaiah:64:11",
            "torah:leviticus:4:27",
            "writings:ecclesiastes:12:14",
            "torah:leviticus:4:2"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:5"
        ]
    }
}