{
    "VERSE": "13:23",
    "ARABIC": "جَنَّٰتُ عَدْنٍ يَدْخُلُونَهَا وَمَن صَلَحَ مِنْ ءَابَآئِهِمْ وَأَزْوَٰجِهِمْ وَذُرِّيَّٰتِهِمْ وَٱلْمَلَٰٓئِكَةُ يَدْخُلُونَ عَلَيْهِم مِّن كُلِّ بَابٍ",
    "ENGLISH": {
        "TRANSLATION_0": "Gardens of Eden which they will enter, and all of their parents, wives and children who were righteous. Angels will enter in to welcome them from every gate: 'Peace be upon you because of your steadfastness!",
        "TRANSLATION_1": "Perpetual gardens which they will enter with those of their fathers, spouses and children who were virtuous and at peace, with angels coming in through every door\n",
        "TRANSLATION_2": "- the Ever-lasting Gardens which they shall enter and so shall the righteous from among their fathers, and their spouses, and their offspring. And angels shall enter unto them from every gate, and say:\n",
        "TRANSLATION_3": "They will be admitted to the gardens of Eden wherein they will live forever with their righteous fathers, spouses, and offspring. The angels will come to them through every gate\n",
        "TRANSLATION_4": "The everlasting Gardens of Eden which they will enter, and the deserving among their forefathers and their wives and their descendants – the angels will enter upon them from every gate.\n",
        "TRANSLATION_5": "`Adn Gardens, which they shall enter and (also) those who acted righteously from among their fathers, and their wives, and their offspring. And angels shall enter unto them from every gate (saying):\n",
        "TRANSLATION_6": "The gardens of perpetual abode which they will enter along with those who do good from among their parents and their spouses and their offspring; and the angels will enter in upon them from every gate:\n",
        "TRANSLATION_7": "Gardens of Eden which they shall enter; and those who were righteous of their fathers, and their wives, and their seed, shall enter them, and the angels shall enter unto them from every gate:\n",
        "TRANSLATION_8": "Gardens of Eden which they enter, along with all who do right of their fathers and their helpmeets and their seed. The angels enter unto them from every gate,\n",
        "TRANSLATION_9": "They shall enter the eternal Gardens of Eden, along with the righteous from among their fathers, wives and descendants. From every gate the angels will come to them, saying,\n",
        "TRANSLATION_10": "Gardens Everlasting; they shall enter them, and also whosoever shall have acted righteously from among their fathers and their spouses and their progeny. And angels shall enter unto them from every portal, saying:\n",
        "TRANSLATION_11": "the Gardens of Eden, which they will enter along with whoever is righteous from among their forebears, their spouses, and their descendants, and the angels will call on them from every door:\n",
        "TRANSLATION_12": "Gardens of perpetual bliss: they shall enter there, as well as the righteous among their fathers, their spouses, and their offspring: and angels shall enter unto them from every gate (with the salutation):\n",
        "TRANSLATION_13": "Adn (Eden) Paradise (everlasting Gardens), which they shall enter and (also) those who acted righteously from among their fathers, and their wives, and their offspring. And angels shall enter unto them from every gate (saying):\n",
        "TRANSLATION_14": "They shall enter the Gardens of Eden together with the righteous among their fathers, their wives, and their descendants. From every gate the angels will come to them,\n",
        "TRANSLATION_15": "Everlasting Gardens, which they will enter, along with the righteous among their parents, and their spouses, and their descendants. And the angels will enter upon them from every gate.\n",
        "TRANSLATION_16": "Gardens of perpetual residence; they will enter them with whoever were righteous among their fathers, their spouses and their descendants. And the angels will enter upon them from every gate, [saying],\n",
        "TRANSLATION_17": "[13:23] Gardens of Eden, as a [place of] residence, which they shall enter, they, along with those who were righteous, [those who] believed, from among their fathers and their spouses and their descendants, even if   these [latter] did not perform deeds of the same [merit] as theirs, they shall share with them their stations [of Paradise] as an honouring for them; and the angels shall enter to them from every gate, of the gates of Paradise or of [the gates of] the palaces [of Paradise], when they first enter, in order to congratulate them.\n",
        "TRANSLATION_18": "Then Allah explained which of the abodes of Paradise it is question, by saying: (Gardens of Eden) the compartment of the All-Merciful which is the source of the prophets, the veracious, the martyrs and the righteous (which they enter, along with all who do right) those who profess monotheism (of their fathers) will also enter it (and their helpmeets) those among them who profess monotheism will enter it (and their seed) as will do those of their offspring who profess monotheism-they will all enter the Gardens of Eden. (The angels enter unto them from every gate) He says: every one of them has a tent made of a hollowed pearl which has 4,000 doors, and each door has a leaf from which an angel enters.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "13:23",
            "40:8",
            "43:70",
            "43:12",
            "38:50",
            "50:7",
            "36:36",
            "97:4",
            "25:74",
            "16:32"
        ],
        "BIBLE": [
            "torah:exodus:3:13",
            "torah:genesis:42:36",
            "prophets:jeremiah:16:19",
            "torah:genesis:24:7",
            "prophets:judges:21:5",
            "writings:i%20chronicles:12:18",
            "writings:i%20chronicles:19:3",
            "torah:exodus:2:18",
            "prophets:joshua:4:21",
            "writings:i%20chronicles:19:2"
        ]
    }
}