{
    "VERSE": "13:24",
    "ARABIC": "سَلَٰمٌ عَلَيْكُم بِمَا صَبَرْتُمْ فَنِعْمَ عُقْبَى ٱلدَّارِ",
    "ENGLISH": {
        "TRANSLATION_0": "How wonderful is the Ultimate Abode!'",
        "TRANSLATION_1": "Saying: \"(Welcome,) peace on you, for you persevered.\" How excellent the recompense of Paradise!\n",
        "TRANSLATION_2": "Peace be upon you. You merit this reward for your steadfastness.\" How excellent is the ultimate abode!\n",
        "TRANSLATION_3": "saying, \"Peace be with you for all that you have patiently endured. Blessed is the reward of Paradise.\"\n",
        "TRANSLATION_4": "(Saying), “Peace be upon you, the recompense of your patience – so what an excellent gain is the final abode!”\n",
        "TRANSLATION_5": "Salamun `Alaykum (peace be upon you) for you persevered in patience! Excellent indeed is the final home!\"\n",
        "TRANSLATION_6": "Peace be on you because you were constant, how excellent, is then, the issue of the abode.\n",
        "TRANSLATION_7": "Peace be upon you, for that you were patient.' Fair is the Ultimate Abode.\n",
        "TRANSLATION_8": "(Saying): Peace be unto you because ye persevered. Ah, passing sweet will be the sequel of the (heavenly) Home.\n",
        "TRANSLATION_9": "Peace be upon you for all that you have steadfastly endured. How excellent is the final abode!\"\n",
        "TRANSLATION_10": "Peace be upOn you for ye patiently persevered. Excellent then is the happy end in the Abode!\n",
        "TRANSLATION_11": "‘Peace be to you, for your patience.’ How excellent is the reward of the [ultimate] abode!\n",
        "TRANSLATION_12": "Peace unto you for that ye persevered in patience! Now how excellent is the final home!\"\n",
        "TRANSLATION_13": "Salamun 'Alaikum (peace be upon you) for that you persevered in patience! Excellent indeed is the final home!\"\n",
        "TRANSLATION_14": "Peace be to you, for that you were patient' Best is the Ultimate Abode.\n",
        "TRANSLATION_15": "“Peace be upon you, because you endured patiently. How excellent is the Final Home.”\n",
        "TRANSLATION_16": "Peace be upon you for what you patiently endured. And excellent is the final home.\"\n",
        "TRANSLATION_17": "[13:24] They will say [to them]: ‘Peace be upon you, this is the reward, for your patience’, during life on earth. How excellent is, your sequel, the sequel of the [heavenly] Abode!\n",
        "TRANSLATION_18": "And the angel says: (Peace be unto you because you persevered) this Garden is yours because you persevered in observing Allah's commands and in bearing misfortunes. (Ah, passing sweet will be the sequel of the (heavenly) Home) how good is the Garden for you.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "13:24",
            "6:127",
            "15:46",
            "37:181",
            "10:25",
            "6:135",
            "28:37",
            "25:75",
            "51:25",
            "23:51"
        ],
        "BIBLE": [
            "prophets:jeremiah:26:8",
            "prophets:ezekiel:3:16",
            "prophets:isaiah:62:11",
            "prophets:isaiah:46:10",
            "prophets:joshua:9:16",
            "prophets:joshua:8:24",
            "prophets:i%20kings:2:39",
            "prophets:ii%20kings:10:25",
            "torah:genesis:27:30",
            "torah:deuteronomy:32:20"
        ]
    }
}