{
    "VERSE": "13:25",
    "ARABIC": "وَٱلَّذِينَ يَنقُضُونَ عَهْدَ ٱللَّهِ مِنۢ بَعْدِ مِيثَٰقِهِۦ وَيَقْطَعُونَ مَآ أَمَرَ ٱللَّهُ بِهِۦٓ أَن يُوصَلَ وَيُفْسِدُونَ فِى ٱلْأَرْضِ أُو۟لَٰٓئِكَ لَهُمُ ٱللَّعْنَةُ وَلَهُمْ سُوٓءُ ٱلدَّارِ",
    "ENGLISH": {
        "TRANSLATION_0": "But as for those who break Allah's contract after it has been agreed and sever what Allah has commanded to be joined, and cause corruption in the earth, the curse will be upon them. They will have the Evil Abode.",
        "TRANSLATION_1": "As for those who break God's covenant after validating it, and sever relations which God ordained cohered, and spread corruption in the land, there is condemnation for them and an evil abode.\n",
        "TRANSLATION_2": "As for those who break the covenant of Allah after firmly confirming it, who cut asunder the ties that Allah has commanded to be joined, and who create corruption in the land: Allah's curse shall be upon them and theirs shall be a wretched abode (in the Hereafter).\n",
        "TRANSLATION_3": "Those who disregard their covenant with God after He has taken such a pledge from them, who sever the proper relations that God has commanded them to establish, and those who spread evil in the land will have God's condemnation instead of reward and will face the most terrible end.\n",
        "TRANSLATION_4": "And those who break the pact of Allah after its ratification, and sever what Allah has commanded to be joined, and spread turmoil in the earth – their share is only the curse and their destiny is the wretched abode.\n",
        "TRANSLATION_5": "And those who break the covenant of Allah, after its ratification, and sever that which Allah has commanded to be joined, and work mischief in the land, on them is the curse, and for them is the unhappy (evil) home (i.e. Hell).\n",
        "TRANSLATION_6": "And those who break the covenant of Allah after its confirmation and cut asunder that which Allah has ordered to be joined and make mischief in the land; (as for) those, upon them shall be curse and they shall have the evil (issue) of the abode.\n",
        "TRANSLATION_7": "And those who break the covenant of God after His compact, and who snap what God has commanded to be joined, and who work corruption in the earth -- theirs shall be the curse, and theirs the Evil Abode.\n",
        "TRANSLATION_8": "And those who break the covenant of Allah after ratifying it, and sever that which Allah hath commanded should be joined, and make mischief in the earth: theirs is the curse and theirs the ill abode.\n",
        "TRANSLATION_9": "As for those who break the covenant of God, after having confirmed  it, who cut asunder what God has commanded to be joined and spread corruption in the land, a curse shall be laid on them; they shall have an evil abode.\n",
        "TRANSLATION_10": "And those who violate the covenant of Allah after the ratification thereof, and sunder that which Allah hath commanded to be conjoined, and act corruptly in the earth--these! unto them is a curse, and unto them shall be the evil Abode.\n",
        "TRANSLATION_11": "But as for those who break Allah’s compact after having pledged it solemnly, and sever what Allah has commanded to be joined, and cause corruption in the earth—it is such on whom the curse will lie, and for them will be the ills of the [ultimate] abode.\n",
        "TRANSLATION_12": "But those who break the Covenant of Allah, after having plighted their word thereto, and cut asunder those things which Allah has commanded to be joined, and work mischief in the land;- on them is the curse; for them is the terrible home!\n",
        "TRANSLATION_13": "And those who break the Covenant of Allah, after its ratification, and sever that which Allah has commanded to be joined (i.e. they sever the bond of kinship and are not good to their relatives), and work mischief in the land, on them is the curse (i.e. they will be far away from Allah's Mercy); And for them is the unhappy (evil) home (i.e. Hell).\n",
        "TRANSLATION_14": "As for those who break the covenant of Allah after accepting it, who part what He has commanded to be united and worked corruption in the land, a curse shall be laid on them, and they shall have an evil abode.\n",
        "TRANSLATION_15": "As for those who violate the promise to God, after pledging to keep it, and sever what God has commanded to be joined, and spread corruption on earth—these, the curse will be upon them, and they will have the Worst Home.\n",
        "TRANSLATION_16": "But those who break the covenant of Allah after contracting it and sever that which Allah has ordered to be joined and spread corruption on earth - for them is the curse, and they will have the worst home.\n",
        "TRANSLATION_17": "[13:25] And those who break God’s covenant after pledging it, and sever what God has commanded should be cemented, and work corruption in the earth, through unbelief and acts of disobedience, theirs shall be the curse, banishment from God’s mercy, and theirs shall be the awful abode, the awful sequel in the abode of the Hereafter, namely, Hell.\n",
        "TRANSLATION_18": "(And those who break the covenant of Allah) those who refrain from the obligations of Allah (after ratifying it) after making it sacred, more firm and confirmed, (and sever that which Allah hath commanded should be joined) of ties with one's kinsfolk as well as of belief in Muhammad (pbuh) and in the Qur'an, (and make mischief in the earth) through disbelief, idolatry, and calling to the worship of other than Allah: (theirs) the reward of those who are thus described (is the curse) Allah's wrath in the life of this world (and theirs the ill abode) i.e. the Fire in the Hereafter.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "13:25",
            "2:27",
            "13:20",
            "13:21",
            "28:81",
            "29:52",
            "27:25",
            "2:159",
            "16:45",
            "53:31"
        ],
        "BIBLE": [
            "prophets:hosea:2:20",
            "prophets:zechariah:11:10",
            "writings:ezra:9:14",
            "torah:exodus:34:10",
            "torah:leviticus:26:19",
            "prophets:i%20kings:5:23",
            "prophets:ii%20samuel:23:5",
            "prophets:isaiah:28:13",
            "prophets:jeremiah:31:32",
            "prophets:isaiah:38:12"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:4:12",
            
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:2"
        ]
    }
}