{
    "VERSE": "13:3",
    "ARABIC": "وَهُوَ ٱلَّذِى مَدَّ ٱلْأَرْضَ وَجَعَلَ فِيهَا رَوَٰسِىَ وَأَنْهَٰرًا وَمِن كُلِّ ٱلثَّمَرَٰتِ جَعَلَ فِيهَا زَوْجَيْنِ ٱثْنَيْنِ يُغْشِى ٱلَّيْلَ ٱلنَّهَارَ إِنَّ فِى ذَٰلِكَ لَءَايَٰتٍ لِّقَوْمٍ يَتَفَكَّرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "It is He who stretched out the earth and placed firmly embedded mountains and rivers in it and made two types of every kind of fruit. He covers over day with night. There are Signs in that for people who reflect.",
        "TRANSLATION_1": "It is He who stretched the earth and placed upon it stabilisers and rivers; and made two of a pair of every fruit; (and) He covers up the day with the night. In these are signs for those who reflect.\n",
        "TRANSLATION_2": "He it is Who has stretched out the earth and has placed in it firm mountains and has caused the rivers to flow. He has made every fruit in pairs, two and two, and He it is Who causes the night to cover the day. Surely there are signs in these for those who reflect.\n",
        "TRANSLATION_3": "It is God who spread out the earth and fixed mountains and placed rivers therein. He made a pair of every fruit and made the night cover the day. All this is evidence (of the existence of God) for the people who think.\n",
        "TRANSLATION_4": "And it is He Who spread out the earth and made mountains as anchors and rivers in it; and in it made all kinds of fruits in pairs – He covers the night with the day; indeed in this are signs for people who ponder.\n",
        "TRANSLATION_5": "And it is He Who spread out the earth, and placed therein firm mountains and rivers and of every kind of fruit He made Zawjayn Ithnayn (two in pairs). He brings the night as a cover over the day. Verily, in these things, there are Ayat (signs) for people who reflect.\n",
        "TRANSLATION_6": "And He it is Who spread the earth and made in it firm mountains and rivers, and of all fruits He has made in it two kinds; He makes the night cover the day; most surely there are signs in this for a people who reflect.\n",
        "TRANSLATION_7": "It is He who stretched out the earth and set therein firm mountains and rivers, and of every fruit He placed there two kinds, covering the day with the night. Surely in that are signs for a people who reflect.\n",
        "TRANSLATION_8": "And He it is Who spread out the earth and placed therein firm hills and flowing streams, and of all fruits He placed therein two spouses (male and female). He covereth the night with the day. Lo! herein verily are portents for people who take thought.\n",
        "TRANSLATION_9": "it was He who spread out the earth and placed upon it mountains and rivers, and fruits of every kind in male and female pairs. He drew the veil of night over the day. In all this, truly, there are signs for people who reflect.\n",
        "TRANSLATION_10": "And He it is who hath stretched forth the earth, and placed therein firm mountains and rivers; and of every fruit he hath placed therein two in pairs. He covereth the night with the day; verily therein are signs for a people who ponder.\n",
        "TRANSLATION_11": "It is He who has spread out the earth and set in it firm mountains and streams, and of every fruit in it He has made two kinds. He draws the night’s cover over the day. There are indeed signs in that for a people who reflect.\n",
        "TRANSLATION_12": "And it is He who spread out the earth, and set thereon mountains standing firm and (flowing) rivers: and fruit of every kind He made in pairs, two and two: He draweth the night as a veil o'er the Day. Behold, verily in these things there are signs for those who consider!\n",
        "TRANSLATION_13": "And it is He Who spread out the earth, and placed therein firm mountains and rivers and of every kind of fruits He made Zawjain Ithnain (two in pairs - may mean two kinds or it may mean: of two sorts, e.g. black and white, sweet and sour, small and big, etc.) He brings the night as a cover over the day. Verily, in these things, there are Ayat (proofs, evidences, lessons, signs, etc.) for people who reflect.\n",
        "TRANSLATION_14": "It is He who stretched out the earth and placed upon it firm mountains and rivers. And of all fruits, He has put in it two pairs and drew the veil of night over the day. Surely, in these there are signs for a nation who think.\n",
        "TRANSLATION_15": "And it is He who spread the earth, and placed in it mountains and rivers. And He placed in it two kinds of every fruit. He causes the night to overlap the day. In that are signs for people who reflect.\n",
        "TRANSLATION_16": "And it is He who spread the earth and placed therein firmly set mountains and rivers; and from all of the fruits He made therein two mates; He causes the night to cover the day. Indeed in that are signs for a people who give thought.\n",
        "TRANSLATION_17": "[13:3] And He it is Who spread out, extended [flat], the earth and set, created, therein firm mountains and rivers, and of every fruit He has made in it two kinds, of every species. He covers, He cloaks, the night, and its darkness, with the day. Surely in that, which is mentioned, are signs, indications of His Oneness, exalted be He, for a people who reflect, upon God’s handiwork.\n",
        "TRANSLATION_18": "257 (And He it is who spread out the earth) He spread out the earth on water (and placed therein firm hills) He created in the earth firm mountains as pillars (and flowing streams) and placed therein flowing rivers, (and of all fruits) and of all the different kinds of fruit (He placed therein two spouses) sweet and sour are one pair, the white and the red are another pair. (He covereth the night with the day) and the day with the night, i.e. He brings the day and removes the night and brings the night and removes the day. (Lo! Herein) in the difference of that which I have mentioned (verily are portents) signs (for people who take thought) in order to reflect.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "13:3",
            "10:67",
            "10:6",
            "30:23",
            "27:86",
            "16:13",
            "16:12",
            "16:11",
            "45:13",
            "50:7"
        ],
        "BIBLE": [
            "prophets:ii%20samuel:23:5",
            "prophets:ezekiel:26:20",
            "writings:daniel:3:29",
            "writings:i%20chronicles:17:21",
            "torah:deuteronomy:13:15",
            "torah:numbers:16:13",
            "prophets:ii%20samuel:7:23",
            "prophets:ezekiel:25:4",
            "prophets:ezekiel:24:17",
            "prophets:ezekiel:38:16"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:3:6"
        ]
    }
}