{
    "VERSE": "13:37",
    "ARABIC": "وَكَذَٰلِكَ أَنزَلْنَٰهُ حُكْمًا عَرَبِيًّا وَلَئِنِ ٱتَّبَعْتَ أَهْوَآءَهُم بَعْدَمَا جَآءَكَ مِنَ ٱلْعِلْمِ مَا لَكَ مِنَ ٱللَّهِ مِن وَلِىٍّ وَلَا وَاقٍ",
    "ENGLISH": {
        "TRANSLATION_0": "Accordingly We have sent it down as a judgement in Arabic. If you followed their whims and desires after the knowledge that has come to you, you would have no protector or defender against Allah.",
        "TRANSLATION_1": "That is how We have sent down this (Qur'an) as a code of clear judgement. But if you follow their caprices, now that you have been given knowledge, you will have no friend or protector against God.\n",
        "TRANSLATION_2": "And it is with the same directive that We revealed to you this Arabic Writ. Were you indeed to follow the vain desires of people after the true knowledge has come to you, none will be your supporter against Allah, and none will have the power to shield you from His punishment.\n",
        "TRANSLATION_3": "We revealed it (the Quran) as a code of conduct in the Arabic language. (Muhammad), if you follow their desires after the knowledge has been revealed to you, know that no one will be able to guard or protect you from the wrath of God.\n",
        "TRANSLATION_4": "And similarly We have revealed this as a command in Arabic; and O listener (follower of this Prophet), if you follow their desires after the knowledge having come to you, then you will have neither a supporter nor any saviour against Allah.\n",
        "TRANSLATION_5": "And thus have We sent it (the Qur'an) down to be a judgement of authority in Arabic. Were you to follow their (vain) desires after the knowledge which has come to you, then you will not have any Wali (protector) or defender against Allah.\n",
        "TRANSLATION_6": "And thus have We revealed it, a true judgment in Arabic, and if you follow their low desires after what has come to you of knowledge, you shall not have against Allah any guardian or a protector.\n",
        "TRANSLATION_7": "Even so We have sent it down as an Arabic judgment. And if thou dost follow their caprices, after the knowledge that has come to thee, thou shalt have no protector against God, and no defender.\n",
        "TRANSLATION_8": "Thus have We revealed it, a decisive utterance in Arabic; and if thou shouldst follow their desires after that which hath come unto thee of knowledge, then truly wouldst thou have from Allah no protecting friend nor defender.\n",
        "TRANSLATION_9": "Thus We have revealed it as a [clear] commandment in Arabic. If you followed their desires after all the knowledge which has come to you, you would have no protector or shield against God.\n",
        "TRANSLATION_10": "And Thus We have sent it down as a judgment in Arabic, And surely wert thou to follow their vain desires, after that which hath come to thee of knowledge, thou wilt not have against Allah any patron or protector.\n",
        "TRANSLATION_11": "Thus We have sent it down as a dispensation in Arabic; and should you follow their desires after the knowledge that has come to you, you shall have against Allah neither any guardian nor defender.\n",
        "TRANSLATION_12": "Thus have We revealed it to be a judgment of authority in Arabic. Wert thou to follow their (vain) desires after the knowledge which hath reached thee, then wouldst thou find neither protector nor defender against Allah.\n",
        "TRANSLATION_13": "And thus have We sent it (the Quran) down to be a judgement of authority in Arabic. Were you (O Muhammad SAW) to follow their (vain) desires after the knowledge which has come to you, then you will not have any Wali (protector) or defender against Allah.\n",
        "TRANSLATION_14": "And as such We have sent it down an Arabic judgment. And if you follow their desires, after the knowledge that has come to you, you shall have no guardian other than Allah, nor yet a defender.\n",
        "TRANSLATION_15": "Thus We revealed it an Arabic code of law. Were you to follow their desires, after the knowledge that has come to you, you would have neither ally nor defender against God.\n",
        "TRANSLATION_16": "And thus We have revealed it as an Arabic legislation. And if you should follow their inclinations after what has come to you of knowledge, you would not have against Allah any ally or any protector.\n",
        "TRANSLATION_17": "[13:37] And so, just like that [manner of] revelation, We have revealed it, that is, the Qur’ān, as a [decisive] judgement in Arabic, in the language of the Arabs, for you to judge thereby between people. And if you should follow their whims, that is, [those of] the disbelievers, in that to which they summon you of their creed, hypothetically [speaking], after what has come to you of knowledge, of God’s Oneness, you shall have no protector, to assist you, against God (mina’Llāhi min: the [second] min is extra) and no defender, to ward off His chastisement.\n",
        "TRANSLATION_18": "(Thus have We revealed it) thus have We sent Gabriel with the Qur'an, (a decisive utterance) the whole Qur'an is Allah's judgement (in Arabic) in the Arabic usage (and if thou shouldst follow their desires) their religion and Qiblah (after that which hath come unto thee of knowledge) after Abraham's Religion and Qiblah were made clear to you, (then truly wouldst thou have from Allah) from Allah's torment (no protecting friend) nearby to benefit you (nor defender) to save you from the torment.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "13:37",
            "2:120",
            "18:26",
            "35:2",
            "4:104",
            "40:12",
            "6:119",
            "42:44",
            "9:28",
            "30:29"
        ],
        "BIBLE": [
            "writings:ii%20chronicles:35:21",
            "writings:i%20chronicles:29:14",
            "writings:daniel:2:23",
            "torah:genesis:31:42",
            "torah:deuteronomy:26:11",
            "prophets:ezekiel:18:13",
            "prophets:judges:18:10",
            "prophets:i%20kings:14:8",
            "writings:psalms:111:6",
            "torah:deuteronomy:1:3"
        ]
    }
}