{
    "VERSE": "13:38",
    "ARABIC": "وَلَقَدْ أَرْسَلْنَا رُسُلًا مِّن قَبْلِكَ وَجَعَلْنَا لَهُمْ أَزْوَٰجًا وَذُرِّيَّةً وَمَا كَانَ لِرَسُولٍ أَن يَأْتِىَ بِـَٔايَةٍ إِلَّا بِإِذْنِ ٱللَّهِ لِكُلِّ أَجَلٍ كِتَابٌ",
    "ENGLISH": {
        "TRANSLATION_0": "We sent Messengers before you and gave them wives and children. Nor was any Messenger able to bring a Sign except by Allah's permission. There is a prescribed limit to every term.",
        "TRANSLATION_1": "We sent many apostles before you, and bestowed on them wives and children, but it was not for any apostle to come up with a miracle unless by the leave of God. For every age there is a law.\n",
        "TRANSLATION_2": "We indeed sent many Messengers before you and We gave them wives and children; and no Messenger had the power to produce a miraculous sign except by the command of Allah. Every age has its own (revealed) Book.\n",
        "TRANSLATION_3": "We sent Messengers before you (Muhammad) and gave them wives and offspring. No Messenger was to show miracles without the permission of God.\n",
        "TRANSLATION_4": "And indeed We sent Noble Messengers before you, and made wives and children for them; and it is not the task of any Noble Messenger to bring a sign except by Allah’s command; and all promises have a time prescribed.\n",
        "TRANSLATION_5": "And indeed We sent Messengers before you, and made for them wives and offspring. And it was not for a Messenger to bring a sign except by Allah's leave. (For) every matter there is a decree (from Allah).\n",
        "TRANSLATION_6": "And certainly We sent apostles before you and gave them wives and children, and it is not in (the power of) an apostle to bring a sign except by Allah's permission; for every term there is an appointment.\n",
        "TRANSLATION_7": "And We sent Messengers before thee, and We assigned to them wives, and seed; and it was not for any Messengers to bring a sign, but by God's leave. Every term has a Book.\n",
        "TRANSLATION_8": "And verily We sent messengers (to mankind) before thee, and We appointed for them wives and offspring, and it was not (given) to any messenger that he should bring a portent save by Allah's leave. For everything there is a time prescribed.\n",
        "TRANSLATION_9": "We sent down messengers before you and gave them wives and children. Yet it was not possible for a messenger to bring a sign, save by the command of God. Every age has had its revelation.\n",
        "TRANSLATION_10": "And assuredly We sent apostles before thee and We made for them wives and progeny and it is not for an apostle to Produce a verse except by the command of Allah; for everv time there is a Book.\n",
        "TRANSLATION_11": "Certainly We have sent apostles before you, and We appointed for them wives and descendants; and an apostle may not bring a sign except by Allah’s leave. There is a written [ordinance] for every term:\n",
        "TRANSLATION_12": "We did send messengers before thee, and appointed for them wives and children: and it was never the part of a messenger to bring a sign except as Allah permitted (or commanded). For each period is a Book (revealed).\n",
        "TRANSLATION_13": "And indeed We sent Messengers before you (O Muhammad SAW), and made for them wives and offspring. And it was not for a Messenger to bring a sign except by Allah's Leave. (For) each and every matter there is a Decree (from Allah).\n",
        "TRANSLATION_14": "We have sent forth other Messengers before you and given them wives and descendants. Yet none of them could bring a sign except by the permission of Allah. Every term has its Book.\n",
        "TRANSLATION_15": "We sent messengers before you, and We assigned for them wives and offspring. No messenger could bring a sign except with the permission of God. For every era is a scripture.\n",
        "TRANSLATION_16": "And We have already sent messengers before you and assigned to them wives and descendants. And it was not for a messenger to come with a sign except by permission of Allah. For every term is a decree.\n",
        "TRANSLATION_17": "[13:38] And when they derided him for having many wives, the following was revealed: And indeed We sent messengers before you, and We assigned to them wives and seed, children — and you are like them; and it was not for any Messenger, from among them, that he should bring a sign, save by God’s leave, because they are servants enthralled [by Him]. For every term, period, there is a Book, wherein is inscribed its delimitation.\n",
        "TRANSLATION_18": "(And verily We sent messengers (to mankind) before thee) just as We have sent you, (and We appointed for them wives) more than you have of wives, such as David and Solomon (and offspring) more than your offspring, such was the case with Abraham, Isaac and Jacob. This verse was revealed about the Jews because they said: Had Muhammad been a prophet, he would have been too preoccupied to get married, (and it was not (given) to any messenger that he should bring a portent) a sign (save by Allah's leave) save by Allah's command. (For everything there is a time prescribed) an appointed time.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "13:38",
            "40:78",
            "58:5",
            "4:164",
            "3:164",
            "6:34",
            "5:19",
            "21:25",
            "33:52",
            "9:65"
        ],
        "BIBLE": [
            "torah:deuteronomy:3:18",
            "writings:nehemiah:10:30",
            "writings:proverbs:8:29",
            "writings:ii%20chronicles:35:21",
            "writings:daniel:2:23",
            "writings:ii%20chronicles:25:4",
            "writings:ii%20chronicles:34:14",
            "writings:nehemiah:8:8",
            "writings:i%20chronicles:24:19",
            "prophets:i%20kings:13:5"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:8",
            
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:4:4"
        ]
    }
}