{
    "VERSE": "13:7",
    "ARABIC": "وَيَقُولُ ٱلَّذِينَ كَفَرُوا۟ لَوْلَآ أُنزِلَ عَلَيْهِ ءَايَةٌ مِّن رَّبِّهِۦٓ إِنَّمَآ أَنتَ مُنذِرٌ وَلِكُلِّ قَوْمٍ هَادٍ",
    "ENGLISH": {
        "TRANSLATION_0": "Those who are kafir say, 'If only a Sign could be sent down to him from his Lord!' You are only a warner. Every people has a guide.",
        "TRANSLATION_1": "The unbelievers say: \"Why no miracle was sent down to him by his Lord?\" But you are only a bearer of warnings, and a guide for every nation.\n",
        "TRANSLATION_2": "Those who refused to believe in you say: \"Why has no (miraculous) sign been sent down upon him from his Lord?\" You are only a warner, and every people has its guide.\n",
        "TRANSLATION_3": "The unbelievers say, \"Why has God not sent him, (Muhammad), some miracles.\" (Muhammad), you are only a warner. For every nation there is a guide.\n",
        "TRANSLATION_4": "The disbelievers say, “Why is not a sign sent down upon him from his Lord?” You are purely a Herald of Warning, and a guide for all nations.\n",
        "TRANSLATION_5": "And the disbelievers say: \"Why is not a sign sent down to him from his Lord\" You are only a warner, and to every people there is a guide.\n",
        "TRANSLATION_6": "And those who disbelieve say: Why has not a sign been sent down upon him from his Lord? You are only a warner and (there is) a guide for every people.\n",
        "TRANSLATION_7": "The unbelievers say, 'Why has a sign not been sent down upon him from his Lord?' Thou art only a warner, and a guide to every people.\n",
        "TRANSLATION_8": "Those who disbelieve say: If only some portent were sent down upon him from his Lord! Thou art a warner only, and for every folk a guide.\n",
        "TRANSLATION_9": "Those who deny the truth ask, \"Why has no sign been sent down to him by His Lord?\" But you are only a warner; every people has its guide.\n",
        "TRANSLATION_10": "And those who disbelieve say: wherefore is not a sign sent down unto him from his Lord! Thou art but a warner; and unto every people there is a guide.\n",
        "TRANSLATION_11": "The faithless say, ‘Why has not some sign been sent down to him from his Lord?’ You are only a warner, and there is a guide for every people.\n",
        "TRANSLATION_12": "And the Unbelievers say: \"Why is not a sign sent down to him from his Lord?\" But thou art truly a warner, and to every people a guide.\n",
        "TRANSLATION_13": "And the disbelievers say: \"Why is not a sign sent down to him from his Lord?\" You are only a warner, and to every people there is a guide.\n",
        "TRANSLATION_14": "The unbelievers say: 'Why has no sign been sent down to him from his Lord' You are only a warner, and there is a guide for every nation.\n",
        "TRANSLATION_15": "Those who disbelieve say, “Why was a miracle not sent down to him from his Lord?” You are only a warner, and to every community is a guide.\n",
        "TRANSLATION_16": "And those who disbelieved say, \"Why has a sign not been sent down to him from his Lord?\" You are only a warner, and for every people is a guide.\n",
        "TRANSLATION_17": "[13:7] And those who disbelieve say, ‘Why has not some sign been sent down upon him, upon Muhammad (s), from his Lord!’, the like of the staff and the [glowing] hand, or the she-camel. God, exalted be He, says: You are only a warner, one to threaten the disbelievers, for it is not your duty to bring forth signs; and for every folk there is a guide, a prophet, to guide them to their Lord with the signs that He gives him, and not what with they request.\n",
        "TRANSLATION_18": "(Those who disbelieve) in Muhammad (pbuh) and in the Qur'an (say: If only some portent sign were sent down upon him) why is not some sign sent to him (from his Lord!) to prove his prophethood as it was sent to earlier messengers (Thou art) Muhammad (a warner only) a warning messenger, (and for every folk a guide) a prophet; it is also said that this means: a caller who calls them to leave error and follow guidance.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "13:7",
            "13:27",
            "23:58",
            "11:57",
            "7:203",
            "45:4",
            "8:2",
            "10:20",
            "26:117",
            "32:15"
        ],
        "BIBLE": [
            "prophets:hosea:2:25",
            "prophets:ii%20kings:1:16",
            "prophets:ezekiel:36:3",
            "torah:numbers:14:11",
            "prophets:ezekiel:36:13",
            "torah:exodus:5:22",
            "writings:ii%20chronicles:25:15",
            "prophets:joshua:24:27",
            "torah:exodus:7:16",
            "prophets:joel:2:17"
        ]
    }
}