{
    "VERSE": "13:9",
    "ARABIC": "عَٰلِمُ ٱلْغَيْبِ وَٱلشَّهَٰدَةِ ٱلْكَبِيرُ ٱلْمُتَعَالِ",
    "ENGLISH": {
        "TRANSLATION_0": "the Knower of the Unseen and the Visible, the Most Great, the High-Exalted.",
        "TRANSLATION_1": "He is the knower of the known and the unknown, the mighty and most high.\n",
        "TRANSLATION_2": "He knows both what is hidden and what is manifest. He is the Supreme One, the Most High.\n",
        "TRANSLATION_3": "He knows all the unseen and seen. He is the most Great and High.\n",
        "TRANSLATION_4": "The All Knowing of all things hidden and visible, the Great, the Supreme.\n",
        "TRANSLATION_5": "All-Knower of the unseen and the seen, the Most Great, the Most High.\n",
        "TRANSLATION_6": "The knower of the unseen and the seen, the Great, the Most High.\n",
        "TRANSLATION_7": "the Knower of the unseen and the visible, the All-great, the All-exalted:\n",
        "TRANSLATION_8": "He is the Knower of the Invisible and the Visible, the Great, the High Exalted.\n",
        "TRANSLATION_9": "He is the knower of the unseen and the visible, the Great, the Most-Exalted.\n",
        "TRANSLATION_10": "Knower of the hidden and the manifest! the Great! the Exalted.\n",
        "TRANSLATION_11": "the Knower of the sensible and the Unseen, the All-great, the All-sublime.\n",
        "TRANSLATION_12": "He knoweth the unseen and that which is open: He is the Great, the Most High.\n",
        "TRANSLATION_13": "All-Knower of the unseen and the seen, the Most Great, the Most High.\n",
        "TRANSLATION_14": "(He is) the Knower of the unseen and the seen, the Great, the Exalted.\n",
        "TRANSLATION_15": "The Knower of the Invisible and the Visible; the Grand, the Supreme.\n",
        "TRANSLATION_16": "[He is] Knower of the unseen and the witnessed, the Grand, the Exalted.\n",
        "TRANSLATION_17": "[13:9] [He is] the Knower of the unseen and the visible, [of] what is hidden and what is witnessed; the Great, the Tremendous, the High Exalted, above His creation, through His [overpowering] subjugation (read al-muta‘ālī or al-muta‘āl, ‘the High Exalted’).\n",
        "TRANSLATION_18": "(He is the Knower of the invisible) that which is unseen by the people (and the visible) that which the people know; it is also said that the invisible refers to that which will happen in the future while the visible refers to that which has already happened, (the Great) there is nothing greater than Him, (the High Exalted) there is nothing more exalted than Him.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "13:9",
            "64:18",
            "23:92",
            "32:6",
            "59:22",
            "25:52",
            "62:8",
            "67:12",
            "9:105",
            "6:73"
        ],
        "BIBLE": [
            "torah:deuteronomy:10:21",
            "prophets:isaiah:42:20",
            "writings:i%20chronicles:29:17",
            "writings:psalms:83:19",
            "writings:job:8:2",
            "writings:ecclesiastes:7:15",
            "writings:job:21:22",
            "prophets:jeremiah:33:3",
            "torah:deuteronomy:29:16",
            "torah:genesis:18:18"
        ]
    }
}