{
    "VERSE": "39:12",
    "ARABIC": "وَأُمِرْتُ لِأَنْ أَكُونَ أَوَّلَ ٱلْمُسْلِمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "And I am commanded to be the first of the Muslims.'",
        "TRANSLATION_1": "And I am commanded to be the first of those who submit.\"\n",
        "TRANSLATION_2": "and I am bidden to be the first of those who surrender to Him.”\n",
        "TRANSLATION_3": "and I am commanded to be the first Muslim\".\n",
        "TRANSLATION_4": "“And I am commanded that I be the first to submit.”\n",
        "TRANSLATION_5": "And I am commanded (this) in order that I may be the first of the Muslims.\"\n",
        "TRANSLATION_6": "And I am commanded that I shall be the first of those who submit.\n",
        "TRANSLATION_7": "and I have been commanded to be the first of those that surrender.'\n",
        "TRANSLATION_8": "And I am commanded to be the first of those who are muslims (surrender unto Him).\n",
        "TRANSLATION_9": "I have been commanded to be the first to submit.\"\n",
        "TRANSLATION_10": "And I am commanded this, in order I may be the first Of those who submit.\n",
        "TRANSLATION_11": "and I have been commanded to be the foremost of those who submit [to Him].’\n",
        "TRANSLATION_12": "And I am commanded to be the first of those who bow to Allah in Islam.\"\n",
        "TRANSLATION_13": "And I am commanded (this) in order that I may be the first of those who submit themselves to Allah (in Islam) as Muslims.\"\n",
        "TRANSLATION_14": "I am ordered to be the first of those to be submissive (Muslims to Him)'\n",
        "TRANSLATION_15": "And I was commanded to be the first of those who submit.”\n",
        "TRANSLATION_16": "And I have been commanded to be the first [among you] of the Muslims.\"\n",
        "TRANSLATION_17": "[39:12] and I have been commanded to be the first of those who submit’, from this community.\n",
        "TRANSLATION_18": "(And I am commanded) in the Qur'an (to be the first of those who surrender (unto Him)) the first of those who accept Islam.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "39:12",
            "20:65",
            "53:50",
            "92:13",
            "43:6",
            "6:163",
            "15:61",
            "15:13",
            "17:59",
            "26:51"
        ],
        "BIBLE": [
            "prophets:ii%20samuel:22:45",
            "torah:deuteronomy:31:5",
            "writings:job:13:18",
            "torah:deuteronomy:6:25",
            "torah:genesis:32:18",
            "torah:leviticus:10:13",
            "torah:exodus:40:23",
            "prophets:i%20kings:17:4",
            "prophets:joshua:8:8",
            "torah:deuteronomy:18:20"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:1:10",
            "Sefer%20Yetzirah:1:8"
        ]
    }
}