{
    "VERSE": "39:13",
    "ARABIC": "قُلْ إِنِّىٓ أَخَافُ إِنْ عَصَيْتُ رَبِّى عَذَابَ يَوْمٍ عَظِيمٍ",
    "ENGLISH": {
        "TRANSLATION_0": "Say: 'I fear, were I to disobey my Lord, the punishment of a Terrible Day.'",
        "TRANSLATION_1": "Say: \"If I disobey my Lord, I fear the punishment of an evil Day.\"\n",
        "TRANSLATION_2": "Say: “If I disobey my Lord, I fear the chastisement of an Awesome Day.”\n",
        "TRANSLATION_3": "Say, \"I am afraid that for disobeying my Lord I shall suffer the torment of the great day\".\n",
        "TRANSLATION_4": "Say, “Were I to disobey my Lord, I too would fear the punishment of the great Day (of Resurrection).”\n",
        "TRANSLATION_5": "Say: \"Verily, if I disobey my Lord, I am afraid of the torment of a great Day.\"\n",
        "TRANSLATION_6": "Say: I fear, if I disobey my Lord, the chastisement of a grievous day.\n",
        "TRANSLATION_7": "Say: 'Truly I fear, if I should rebel against my Lord, the chastisement of a dreadful day.'\n",
        "TRANSLATION_8": "Say: Lo! if I should disobey my Lord, I fear the doom of a tremendous Day.\n",
        "TRANSLATION_9": "Say, \"I fear, if I disobey my Lord, the punishment of a Terrible Day.\"\n",
        "TRANSLATION_10": "Say thou: verily fear, if I disobeyed my Lord, torment of a Day mighty.\n",
        "TRANSLATION_11": "Say, ‘Indeed, should I disobey my Lord, I fear the punishment of a tremendous day.’\n",
        "TRANSLATION_12": "Say: \"I would, if I disobeyed my Lord, indeed have fear of the Penalty of a Mighty Day.\"\n",
        "TRANSLATION_13": "Say (O Muhammad SAW): \"Verily, if I disobey my Lord, I am afraid of the torment of a great Day.\"\n",
        "TRANSLATION_14": "Say: 'Indeed, if I rebel against my Lord I fear the punishment of a dreadful Day'\n",
        "TRANSLATION_15": "Say, “I fear, if I disobeyed my Lord, the punishment of a horrendous Day.”\n",
        "TRANSLATION_16": "Say, \"Indeed I fear, if I should disobey my Lord, the punishment of a tremendous Day.\"\n",
        "TRANSLATION_17": "[39:13] Say: ‘Indeed, should I disobey my Lord, I fear the chastisement of a tremendous day’.\n",
        "TRANSLATION_18": "(Say) to them, Muhammad: (Lo! if I should disobey my Lord) if I revert to your religion, (I fear) I know I will face (the doom of a tremendous Day) a severe and variegated chastisement.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "39:13",
            "6:15",
            "26:135",
            "26:189",
            "26:156",
            "52:7",
            "83:5",
            "15:36",
            "38:79",
            "44:12"
        ],
        "BIBLE": [
            "writings:proverbs:19:19",
            "prophets:jeremiah:10:6",
            "torah:genesis:18:20",
            "torah:deuteronomy:21:8",
            "prophets:joel:2:11",
            "torah:genesis:44:5",
            "prophets:malachi:3:23",
            "torah:exodus:15:11",
            "prophets:ii%20kings:20:19",
            "torah:numbers:7:11"
        ]
    }
}