{
    "VERSE": "39:24",
    "ARABIC": "أَفَمَن يَتَّقِى بِوَجْهِهِۦ سُوٓءَ ٱلْعَذَابِ يَوْمَ ٱلْقِيَٰمَةِ وَقِيلَ لِلظَّٰلِمِينَ ذُوقُوا۟ مَا كُنتُمْ تَكْسِبُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Is someone who tries to shield himself with his face from the worst of the torment on the Day of Rising . . . ? The wrongdoers will be told, Taste what you have earned.'",
        "TRANSLATION_1": "Can he who will have to shield himself against the torment of the Day of Resurrection (be the same as one at peace)? The evil-doers will be told: \"So taste what you earned.\"\n",
        "TRANSLATION_2": "How woeful is the plight of him who has nothing except his face to shield him from severe chastisement on the Day of Resurrection? Such evil-doers shall be told: “Taste now the consequence of your deeds.”\n",
        "TRANSLATION_3": "Is there anyone who is afraid of the torment of the Day of Judgment when the unjust will be told, \"Suffer the result of your deeds?\"\n",
        "TRANSLATION_4": "So will he who will not have a shield except his own face against the wretched punishment on the Day of Resurrection, ever be equal to one who is forgiven? And it will be said to the unjust, “Taste what you have earned!”\n",
        "TRANSLATION_5": "Is he then, who will confront with his face the awful torment on the Day of Resurrection And it will be said to the wrongdoers: \"Taste what you used to earn!\"\n",
        "TRANSLATION_6": "Is he then who has to guard himself with his own person against the evil chastisement on the resurrection day? And it will be said to the unjust: Taste what you earned.\n",
        "TRANSLATION_7": "Is he who guards himself with his face against the evil of the chastisement on the Day of Resurrection...? And it is said to the evildoers, 'Taste now that you were earning!'\n",
        "TRANSLATION_8": "Is he then, who will strike his face against the awful doom upon the Day of Resurrection (as he who doeth right)? And it will be said unto the wrong-doers: Taste what ye used to earn.\n",
        "TRANSLATION_9": "What about the one who will have only his bare face to protect him from his terrible punishment on the Day of Resurrection? The evil-doers will be told, \"Taste what you have earned.\"\n",
        "TRANSLATION_10": "Is he, then, who will shield himself with his face from the evil of torment on the Day of Resurrection be as he who is secure therefrom And it shall be said Unto the wrong-doers: taste ye that which ye have been earning.\n",
        "TRANSLATION_11": "What! Is someone who fends off with his face the terrible punishment [meted out to him] on the Day of Resurrection…? And the wrongdoers will be told, ‘Taste what you used to earn.’\n",
        "TRANSLATION_12": "Is, then, one who has to fear the brunt of the Penalty on the Day of Judgment (and receive it) on his face, (like one guarded therefrom)? It will be said to the wrong-doers: \"Taste ye (the fruits of) what ye earned!\"\n",
        "TRANSLATION_13": "Is he then, who will confront with his face the awful torment on the Day of Resurrection (as he who enters peacefully in Paradise)? And it will be said to the Zalimun (polytheists and wrong-doers, etc.): \"Taste what you used to earn!\"\n",
        "TRANSLATION_14": "Is he whose face is cautious of the evil of the punishment on the Day of Resurrection (to be compared to the unbeliever)! To the evildoers it shall be said:'Now taste that which you have been earning'\n",
        "TRANSLATION_15": "What about someone who covers his face against the terrible misery of the Day of Resurrection? To the evildoers it will be said, “Taste what you used to earn.”\n",
        "TRANSLATION_16": "Then is he who will shield with his face the worst of the punishment on the Day of Resurrection [like one secure from it]? And it will be said to the wrongdoers, \"Taste what you used to earn.\"\n",
        "TRANSLATION_17": "[39:24] Is he who will be fending off, [is he] who will encounter, with his face the awful chastisement on the Day of Resurrection …?, that is, the most severe [chastisement], when he is flung into the Fire with his hands bound to his neck in fetters, [is he] like one who will be secure from it by entering Paradise? And it will be said to the wrongdoers, namely, the disbelievers of Mecca: ‘Taste [now] what you used to earn’, that is, [taste] the requital for it.\n",
        "TRANSLATION_18": "(Is he then, who will strike his face against the awful doom) the severe torment (upon the Day of Resurrection) the reference here is to Abu Jahl and his host; his hands will be tied to his neck with iron chains, this is why he covers his face ((as he who doeth right)? And it will be said unto the wrong-doers) the disbelievers: Abu Jahl and his host; the angels of the Fire say to them: (Taste) the doom of (what ye used to earn) of what you used to do and say of transgressions in the life of this world.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "39:24",
            "25:69",
            "3:106",
            "39:47",
            "26:156",
            "39:60",
            "43:39",
            "40:45",
            "11:8",
            "32:14"
        ],
        "BIBLE": [
            "writings:job:24:15",
            "writings:psalms:44:16",
            "torah:deuteronomy:31:17",
            "torah:numbers:22:5",
            "prophets:ii%20kings:7:9",
            "prophets:ezekiel:38:16",
            "torah:numbers:9:15",
            "prophets:i%20samuel:26:8",
            "torah:deuteronomy:1:17",
            "writings:esther:7:8"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:7"
        ]
    }
}