{
    "VERSE": "39:27",
    "ARABIC": "وَلَقَدْ ضَرَبْنَا لِلنَّاسِ فِى هَٰذَا ٱلْقُرْءَانِ مِن كُلِّ مَثَلٍ لَّعَلَّهُمْ يَتَذَكَّرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "We have given all kinds of examples to people in this Qur'an, so that hopefully they will pay heed -",
        "TRANSLATION_1": "We have given examples of every kind for men in this Qur'an so that they may contemplate:\n",
        "TRANSLATION_2": "We have indeed propounded for mankind all kinds of parables in this Qur'an that they may take heed.\n",
        "TRANSLATION_3": "We have given all kinds of examples for the human being in this Quran so that perhaps he may take heed.\n",
        "TRANSLATION_4": "And We have indeed illustrated examples of all kinds in this Qur’an, so that they may ponder.\n",
        "TRANSLATION_5": "And indeed We have put forth for men, in this Qur'an every kind of parable in order that they may remember.\n",
        "TRANSLATION_6": "And certainly We have set forth to men in this Quran similitudes of every sort that they may mind.\n",
        "TRANSLATION_7": "Indeed We have struck for the people in this Koran every manner of similitude; haply they will remember;\n",
        "TRANSLATION_8": "And verily We have coined for mankind in this Qur'an all kinds of similitudes, that haply they may reflect;\n",
        "TRANSLATION_9": "We have set forth to men all kinds of parables in this Quran so that they may take heed:\n",
        "TRANSLATION_10": "And assuredly We have propounded for mankind in this Qur'an all kinds of similitudes, that haply they may be admonished.\n",
        "TRANSLATION_11": "We have drawn for mankind in this Quran every [kind of] example, so that they may take admonition:\n",
        "TRANSLATION_12": "We have put forth for men, in this Qur'an every kind of Parable, in order that they may receive admonition.\n",
        "TRANSLATION_13": "And indeed We have put forth for men, in this Quran every kind of similitude in order that they may remember.\n",
        "TRANSLATION_14": "Indeed, We have struck of every manner of parable for mankind in this Koran in order that they will remember.\n",
        "TRANSLATION_15": "We have cited in this Quran for mankind every ideal, that they may take heed.\n",
        "TRANSLATION_16": "And We have certainly presented for the people in this Qur'an from every [kind of] example - that they might remember.\n",
        "TRANSLATION_17": "[39:27] And verily We have struck, coined, for mankind in this Qur’ān every [kind of] similitude, that perhaps they may remember, [that perhaps] they may be admonished —\n",
        "TRANSLATION_18": "(And verily We have coined for mankind) We exposited for people (in this Qur'an all kinds of similitudes, that haply they may reflect) that haply they may take heed;\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "39:27",
            "17:89",
            "30:58",
            "18:54",
            "59:21",
            "25:39",
            "17:106",
            "54:40",
            "54:17",
            "54:22"
        ],
        "BIBLE": [
            "writings:i%20chronicles:21:5",
            "torah:genesis:24:19",
            "torah:numbers:31:47",
            "writings:ruth:4:7",
            "torah:genesis:24:43",
            "writings:i%20chronicles:29:14",
            "prophets:jeremiah:44:20",
            "prophets:ii%20kings:4:43",
            "torah:deuteronomy:16:17",
            "writings:ecclesiastes:3:10"
        ]
    }
}