{
    "VERSE": "39:28",
    "ARABIC": "قُرْءَانًا عَرَبِيًّا غَيْرَ ذِى عِوَجٍ لَّعَلَّهُمْ يَتَّقُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "an Arabic Qur'an with no distortion in it, so that hopefully they will have taqwa.",
        "TRANSLATION_1": "A clear discourse which expounds all things without any obliquity, so that they may take heed for themselves.\n",
        "TRANSLATION_2": "It is an Arabic Qur'an free of all crookedness that they may guard against their evil end.\n",
        "TRANSLATION_3": "This Quran is a flawless reading text in the Arabic language. Perhaps they will have fear of God.\n",
        "TRANSLATION_4": "The Qur’an in Arabic, having no deviation at all, so that they may be pious.\n",
        "TRANSLATION_5": "An Arabic Qur'an, without any crookedness (therein) in order that they may have Taqwa of Him.\n",
        "TRANSLATION_6": "An Arabic Quran without any crookedness, that they may guard (against evil).\n",
        "TRANSLATION_7": "Koran, wherein there is no crookedness; haply they will be godfearing.\n",
        "TRANSLATION_8": "A Lecture in Arabic, containing no crookedness, that haply they may ward off (evil).\n",
        "TRANSLATION_9": "a Quran in Arabic, free from any ambiguity -- so that people may be mindful.\n",
        "TRANSLATION_10": "An Arabic Qur'an, wherein there is no crookedness, that haply they may fear.\n",
        "TRANSLATION_11": "an Arabic Quran, without any deviousness, so that they may be Godwary.\n",
        "TRANSLATION_12": "(It is) a Qur'an in Arabic, without any crookedness (therein): in order that they may guard against Evil.\n",
        "TRANSLATION_13": "An Arabic Quran, without any crookedness (therein) in order that they may avoid all evil which Allah has ordered them to avoid, fear Him and keep their duty to Him.\n",
        "TRANSLATION_14": "It is an Arabic Koran free from all crookedness, in order that they will be cautious.\n",
        "TRANSLATION_15": "An Arabic Quran, without any defect, so they may become righteous.\n",
        "TRANSLATION_16": "[It is] an Arabic Qur'an, without any deviance that they might become righteous.\n",
        "TRANSLATION_17": "[39:28] an Arabic Qur’ān (qur’ānan ‘arabiyyan, a circumstantial qualifier for emphasis) without any deviation, that is,   [without] any contradiction or variance, that perhaps they may guard themselves, against disbelief.\n",
        "TRANSLATION_18": "(A Lecture in Arabic) a Qur'an in the Arabic usage, (containing no crookedness) not contradicting the Torah, the Gospel, the Psalms or any other divinely inspired Scripture in terms of the affirmation of Allah's divine Oneness, some legal rulings and punishments; it is also said that (containing no crookedness) means: it is uncreated-this is the opinion of al-Suddi-, (that haply they may ward off (evil)) by means of the Qur'an that which Allah has prohibited them.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "39:28",
            "43:3",
            "12:2",
            "20:113",
            "41:3",
            "15:91",
            "70:28",
            "76:23",
            "38:1",
            "55:2"
        ],
        "BIBLE": [
            "writings:ecclesiastes:12:14",
            "writings:ecclesiastes:12:13",
            "prophets:jeremiah:3:5",
            "prophets:ezekiel:37:23",
            "writings:psalms:48:11",
            "prophets:ii%20samuel:23:5",
            "writings:psalms:67:8",
            "writings:daniel:5:26",
            "writings:daniel:12:8",
            "torah:exodus:33:13"
        ]
    }
}