{
    "VERSE": "39:29",
    "ARABIC": "ضَرَبَ ٱللَّهُ مَثَلًا رَّجُلًا فِيهِ شُرَكَآءُ مُتَشَٰكِسُونَ وَرَجُلًا سَلَمًا لِّرَجُلٍ هَلْ يَسْتَوِيَانِ مَثَلًا ٱلْحَمْدُ لِلَّهِ بَلْ أَكْثَرُهُمْ لَا يَعْلَمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Allah has made a metaphor for them of a man owned by several partners in dispute with one another and another man wholly owned by a single man. Are they the same? Praise be to Allah! The fact is that most of them do not know.",
        "TRANSLATION_1": "God advances the example of a man who is owned (as slave in common) by a number of men at loggerheads, and another man who is owned by only one. Are these two alike in attribute? God be praised; yet many of them do not know.\n",
        "TRANSLATION_2": "Allah propounds a parable: there is a man whose ownership is shared by several quarrelsome masters, each pulling him to himself; and there is another who is exclusively owned by one man. Can the two be alike? All praise and thanks be to Allah. But most of them are unaware.\n",
        "TRANSLATION_3": "God tells a parable in which there is a company of quarrelsome people and only one of them is well disciplined. Can they be considered as equal? It is only God who deserves all praise. In fact, most of them do not know.\n",
        "TRANSLATION_4": "Allah illustrates an example – “A man having several wicked masters as partners, and another man belonging wholly to just one master; are the two equal in comparison?” All praise is to Allah; in fact, most among them do not know.\n",
        "TRANSLATION_5": "Allah puts forth a parable: a man belonging to many partners disputing with one another, and a man belonging entirely to one master. Are those two equal in comparison All the praises and thanks be to Allah! But most of them know not.\n",
        "TRANSLATION_6": "Allah sets forth an example: There is a slave in whom are (several) partners differing with one another, and there is another slave wholly owned by one man. Are the two alike in condition? (All) praise is due to Allah. Nay! most of them do not know.\n",
        "TRANSLATION_7": "God has struck a similitude -- a man in whom partners disagreeing share, and a man the property of one man. Are the two equal in likeness? Praise belongs to God! Nay, but most of them do not know.\n",
        "TRANSLATION_8": "Allah coineth a similitude: A man in relation to whom are several part-owners, quarrelling, and a man belonging wholly to one man. Are the two equal in similitude? Praise be to Allah! But most of them know not.\n",
        "TRANSLATION_9": "God sets forth a parable: there are two men -- one belonging to many masters, all disagreeing with one another, and the other belonging entirely to one master: are those two equal in comparison? Praise be to God! But most of them have no knowledge.\n",
        "TRANSLATION_10": "Allah propoundeth a similitude: man having several partners,\"quarelling, and a man wholly belonging to one man. Are the two equal in likeness? All praise Unto Allah. But most of them know not.\n",
        "TRANSLATION_11": "Allah draws an example: a man jointly owned by several contending masters, and a man belonging entirely to one man: are the two equal in comparison? All praise belongs to Allah! But most of them do not know.\n",
        "TRANSLATION_12": "Allah puts forth a Parable a man belonging to many partners at variance with each other, and a man belonging entirely to one master: are those two equal in comparison? Praise be to Allah! but most of them have no knowledge.\n",
        "TRANSLATION_13": "Allah puts forth a similitude: a (slave) man belonging to many partners (like those who worship others along with Allah) disputing with one another, and a (slave) man belonging entirely to one master, (like those who worship Allah Alone). Are those two equal in comparison? All the praises and thanks be to Allah! But most of them know not.\n",
        "TRANSLATION_14": "Allah has struck an example of a man shared by disagreeing partners, and a man who is owned by just one man, are the two equally alike? Praise belongs toAllah, but most of them do not know.\n",
        "TRANSLATION_15": "God cites the example of a man shared by partners at odds, and a man belonging exclusively to one man. Are they equal in status? Praise be to God, but most of them do not know.\n",
        "TRANSLATION_16": "Allah presents an example: a slave owned by quarreling partners and another belonging exclusively to one man - are they equal in comparison? Praise be to Allah! But most of them do not know.\n",
        "TRANSLATION_17": "[39:29] God strikes, for the idolater and the believer in God’s Oneness, a similitude: a man (rajulan, substitutes for mathalan, ‘a similitude’) shared by several [masters], quarrelling, disputing, ill-mannered, and a man belonging exclusively to one man. Are the two equal in comparison? (mathalan, for specification), in other words, the slave of many [masters] is not the same as the slave of a single person. For in the case of the former, if all of his masters were to demand his service simultaneously, he would be confused as to whom of them he should serve — which is the similitude of the idolater; the latter [the slave of one] is the similitude of the one who believes in the One God. Praise be to God!, alone. Nay, but most of them, that is, the people of Mecca, do not know, the chastisement in which they will end up and so they associate others with God.\n",
        "TRANSLATION_18": "(Allah coineth a similitude: A man in relation to whom are several part owners, quarrelling) one ordering him to do something while the other forbidding him from doing the same; such is the similitude of a man who worships several deities, (and a man belonging wholly to one man) this is like the believer who worships only Allah and surrenders his religion and works to Allah alone. (Are the two equal in similitude) are the disbeliever and believer equal? (Praise be to Allah) divine Oneness and praise belong to Allah! (But most of them know not) the similitudes of the Qur'an.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "39:29",
            "16:75",
            "31:25",
            "17:111",
            "16:74",
            "27:59",
            "27:15",
            "30:6",
            "29:63",
            "28:70"
        ],
        "BIBLE": [
            "writings:psalms:86:14",
            "torah:deuteronomy:32:8",
            "writings:ii%20chronicles:7:19",
            "torah:deuteronomy:13:14",
            "torah:genesis:24:44",
            "writings:i%20chronicles:21:5",
            "prophets:i%20kings:9:6",
            "torah:numbers:11:24",
            "torah:deuteronomy:4:19",
            "writings:job:16:21"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:2:5"
        ]
    }
}