{
    "VERSE": "39:30",
    "ARABIC": "إِنَّكَ مَيِّتٌ وَإِنَّهُم مَّيِّتُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "You will die and they too will die.",
        "TRANSLATION_1": "Verily you will die, and so will they.\n",
        "TRANSLATION_2": "(O Prophet), you are destined to die and they too are destined to die.\n",
        "TRANSLATION_3": "(Muhammad), you will die and all of them will also die.\n",
        "TRANSLATION_4": "Indeed you (O dear Prophet Mohammed – peace and blessings be upon him) will taste death, and they (the disbelievers) too will die.\n",
        "TRANSLATION_5": "Verily, you will die, and verily, they (too) will die.\n",
        "TRANSLATION_6": "Surely you shall die and they (too) shall surely die.\n",
        "TRANSLATION_7": "Thou art mortal, and they are mortal;\n",
        "TRANSLATION_8": "Lo! thou wilt die, and lo! they will die;\n",
        "TRANSLATION_9": "You will die and they too will die,\n",
        "TRANSLATION_10": "Verily thou art mortal, and verily they are mortals.\n",
        "TRANSLATION_11": "You will die, and they [too] will die.\n",
        "TRANSLATION_12": "Truly thou wilt die (one day), and truly they (too) will die (one day).\n",
        "TRANSLATION_13": "Verily, you (O Muhammad SAW) will die and verily, they (too) will die.\n",
        "TRANSLATION_14": "You are mortal, and they are mortal\n",
        "TRANSLATION_15": "You will die, and they will die.\n",
        "TRANSLATION_16": "Indeed, you are to die, and indeed, they are to die.\n",
        "TRANSLATION_17": "[39:30] You — an address to the Prophet (s) — will indeed die, and they [too] will indeed die, and so there is no satisfaction to be gained from [another’s] death: this was revealed because they kept waiting for the Prophet (s) to die.\n",
        "TRANSLATION_18": "(Lo! thou) Muhammad (wilt die, and lo! They) i.e. the disbelievers of Mecca (will die; 533\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "39:30",
            "27:80",
            "30:52",
            "77:26",
            "23:15",
            "37:24",
            "6:36",
            "16:21",
            "37:58",
            "25:66"
        ],
        "BIBLE": [
            "writings:ruth:1:17",
            "torah:genesis:2:17",
            "prophets:judges:6:23",
            "torah:genesis:20:7",
            "prophets:i%20samuel:14:44",
            "prophets:hosea:4:5",
            "torah:deuteronomy:30:19",
            "prophets:i%20kings:2:37",
            "torah:numbers:35:21",
            "torah:deuteronomy:23:7"
        ]
    }
}