{
    "VERSE": "39:35",
    "ARABIC": "لِيُكَفِّرَ ٱللَّهُ عَنْهُمْ أَسْوَأَ ٱلَّذِى عَمِلُوا۟ وَيَجْزِيَهُمْ أَجْرَهُم بِأَحْسَنِ ٱلَّذِى كَانُوا۟ يَعْمَلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "So that Allah may erase from them the worst of what they did and pay them their wages for the best of what they did.",
        "TRANSLATION_1": "That God may absolve them of their sins and reward them for the best that they had done.\n",
        "TRANSLATION_2": "so that Allah may remit their worst deeds and reward them according to the best of their deeds.\n",
        "TRANSLATION_3": "God will certainly expiate their bad deeds and reward them much more for what they have done.\n",
        "TRANSLATION_4": "So that Allah may relieve them of their worst deeds, and reward them for the best deeds they had done.\n",
        "TRANSLATION_5": "So that Allah may expiate from them the evil of what they did and give them the reward, according to the best of what they used to do.\n",
        "TRANSLATION_6": "So that Allah will do away with the worst of what they did and give them their reward for the best of what they do.\n",
        "TRANSLATION_7": "that God may acquit them of the worst of what they did, and recompense them with the wages of the fairest of what they were doing.\n",
        "TRANSLATION_8": "That Allah will remit from them the worst of what they did, and will pay them for reward the best they used to do.\n",
        "TRANSLATION_9": "God will efface their worst deeds from their record and give them their reward in accordance with the best of their actions.\n",
        "TRANSLATION_10": "That through this Promise Allah may expiate from them the worst of that which they may have worked, and may recompense them their hire for the best of that which they have been working.\n",
        "TRANSLATION_11": "that Allah may absolve them of the worst of what they did, and pay them their reward by the best of what they used to do.\n",
        "TRANSLATION_12": "So that Allah will turn off from them (even) the worst in their deeds and give them their reward according to the best of what they have done.\n",
        "TRANSLATION_13": "So that Allah may remit from them the evil of what they did and give them the reward, according to the best of what they used to do.\n",
        "TRANSLATION_14": "that Allah may acquit them of the worst of what they did, and recompense with the finest wages for what they did.\n",
        "TRANSLATION_15": "God will acquit them of the worst of their deeds, and will reward them according to the best of what they used to do.\n",
        "TRANSLATION_16": "That Allah may remove from them the worst of what they did and reward them their due for the best of what they used to do.\n",
        "TRANSLATION_17": "[39:35] so that God may absolve them of the worst of what they did, and pay them their reward by the best of what they used to do (aswa’a and ahsana mean [simply] al-sayyi’, ‘bad’, and al-hasan, ‘good’).\n",
        "TRANSLATION_18": "(That Allah will remit from them the worst of what they did) the vilest of their works, (and will pay them for reward the best they used to do) of good.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "39:35",
            "16:96",
            "53:31",
            "29:7",
            "24:38",
            "28:54",
            "13:21",
            "3:141",
            "41:33",
            "65:5"
        ],
        "BIBLE": [
            "prophets:micah:3:4",
            "torah:deuteronomy:31:18",
            "torah:exodus:31:15",
            "torah:exodus:35:2",
            "torah:leviticus:20:12",
            "writings:ii%20chronicles:4:11",
            "prophets:ezekiel:20:44",
            "prophets:isaiah:59:18",
            "prophets:ii%20kings:9:26",
            "writings:daniel:3:32"
        ]
    }
}