{
    "VERSE": "39:39",
    "ARABIC": "قُلْ يَٰقَوْمِ ٱعْمَلُوا۟ عَلَىٰ مَكَانَتِكُمْ إِنِّى عَٰمِلٌ فَسَوْفَ تَعْلَمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Say: 'My people, do as you think best; that is what I am doing. You will soon know",
        "TRANSLATION_1": "Say: \"O people, act as best you can on your part, I am acting too. You will come to know in time\n",
        "TRANSLATION_2": "Tell them: “My people, continue to work in your position as you will, I too will continue with my work. Soon you shall know\n",
        "TRANSLATION_3": "Say, \"My people, act as you wish. I shall do as I like and you will soon know\n",
        "TRANSLATION_4": "Proclaim, “O my people! Keep on with your works in your positions, I am doing mine; so you will soon come to know.” –\n",
        "TRANSLATION_5": "Say: \"O My people! Work according to your way, I am working. Then you will come to know\"\n",
        "TRANSLATION_6": "Say: O my people! work in your place, surely I am a worker, so you will come to know.\n",
        "TRANSLATION_7": "Say: 'My people, act according to your station; I am acting; and soon you will know\n",
        "TRANSLATION_8": "Say: O my people! Act in your manner. Lo! I (too) am acting. Thus ye will come to know\n",
        "TRANSLATION_9": "Say, \"My people, do whatever is in your power -- and so will I. Soon you shall come to know\n",
        "TRANSLATION_10": "Say thou: my nation! work according to your condition; I am going to work in my way; presently ye shall come to know.\n",
        "TRANSLATION_11": "Say, ‘O my people! Act according to your ability. I too am acting. Soon you will know\n",
        "TRANSLATION_12": "Say: \"O my People! Do whatever ye can: I will do (my part): but soon will ye know-\n",
        "TRANSLATION_13": "Say: (O Muhammad SAW) \"O My people! Work according to your way, I am working (according to my way). Then you will come to know,\n",
        "TRANSLATION_14": "Say: 'O nation, work according to your status, I am working according to my status, and soon you will know\n",
        "TRANSLATION_15": "Say: “O my people, work according to your ability; and so will I. Then you will know.\n",
        "TRANSLATION_16": "Say, \"O my people, work according to your position, [for] indeed, I am working; and you are going to know\n",
        "TRANSLATION_17": "[39:39] Say: ‘O my people! Act according to your situation, [according to] your circumstances, I [too] am acting, according to my circumstances. For you will [come to] know\n",
        "TRANSLATION_18": "534 (Say) Muhammad, to the people of Mecca: (0 my people! Act in your manner) act according to your religion and plot in your home for my destruction. (I too am acting) to destroy you. (Thus ye will come to know) this is a threat to them from Allah\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "39:39",
            "6:135",
            "11:93",
            "15:62",
            "40:32",
            "71:2",
            "43:44",
            "51:32",
            "43:54",
            "15:58"
        ],
        "BIBLE": [
            "prophets:ezekiel:20:44",
            "torah:exodus:34:10",
            "torah:genesis:18:33",
            "prophets:i%20samuel:26:25",
            "prophets:malachi:1:11",
            "prophets:ii%20kings:5:11",
            "torah:leviticus:23:3",
            "prophets:jeremiah:2:23",
            "torah:exodus:36:1",
            "prophets:ezekiel:7:9"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:2:1"
        ]
    }
}