{
    "VERSE": "39:4",
    "ARABIC": "لَّوْ أَرَادَ ٱللَّهُ أَن يَتَّخِذَ وَلَدًا لَّٱصْطَفَىٰ مِمَّا يَخْلُقُ مَا يَشَآءُ سُبْحَٰنَهُۥ هُوَ ٱللَّهُ ٱلْوَٰحِدُ ٱلْقَهَّارُ",
    "ENGLISH": {
        "TRANSLATION_0": "If Allah had desired to have a son He would have chosen whatever He wished from what He has created. Glory be to Him! He is Allah, the One, the All-Conquering.",
        "TRANSLATION_1": "Had God pleased to take a son, He could have chosen whom He liked from among those He has created. Glory be to Him. He is God, the one, the omnipotent.\n",
        "TRANSLATION_2": "If Allah had wanted to take to Himself a son, He could have chosen anyone He wanted out of those whom He creates. Glory be to Him (that He should have a son). He is Allah: the One, the Overpowering.\n",
        "TRANSLATION_3": "Had God wanted to have a son, He would have chosen one from His creatures according to His will. God is too Exalted to have a son. He is One and Almighty.\n",
        "TRANSLATION_4": "Were Allah to create a son* for Himself, He would have chosen any one from His creation! Purity is to Him! He is Allah, the One, the All Dominant. (*Which is impossible.)\n",
        "TRANSLATION_5": "Had Allah willed to take a son, He could have chosen whom He willed out of those whom He created. But glory be to Him! He is Allah, the One, the Irresistible.\n",
        "TRANSLATION_6": "If Allah desire to take a son to Himself, He will surely choose those He pleases from what He has created. Glory be to Him: He is Allah, the One, the Subduer (of all).\n",
        "TRANSLATION_7": "Had God desired to take to Him a son, He would have chosen whatever He willed of that He has created. Glory be to Him! He is God, the One, the Omnipotent.\n",
        "TRANSLATION_8": "If Allah had willed to choose a son, He could have chosen what He would of that which He hath created. Be He Glorified! He is Allah, the One, the Absolute.\n",
        "TRANSLATION_9": "If God had willed to take a son He could have chosen anyone He pleased out of His creation: but Glory be to Him! [He is above such things.] He is God, the One, the Omnipotent.\n",
        "TRANSLATION_10": "Had Allah willed to take a son, He could have chosen whatsoever He pleased out of that which He hath created. Hallowed be He! He is Allah the One, the Subduer.\n",
        "TRANSLATION_11": "Had Allah intended to take a son, He could have chosen from those He has created whatever He wished. Immaculate is He! He is Allah, the One, the All-paramount.\n",
        "TRANSLATION_12": "Had Allah wished to take to Himself a son, He could have chosen whom He pleased out of those whom He doth create: but Glory be to Him! (He is above such things.) He is Allah, the One, the Irresistible.\n",
        "TRANSLATION_13": "Had Allah willed to take a son (or offspring or children), He could have chosen whom He pleased out of those whom He created. But glory be to Him! (He is above such things). He is Allah, the One, the Irresistible.\n",
        "TRANSLATION_14": "If Allah had desired to take a son, He would have chosen whatever He willed out of His creation. Exaltations to Him! He is Allah, the One, the Conqueror.\n",
        "TRANSLATION_15": "If God wanted to have a son, He could have selected from His creation at will. Glory be to Him. He is God, the One, the Prevailing.\n",
        "TRANSLATION_16": "If Allah had intended to take a son, He could have chosen from what He creates whatever He willed. Exalted is He; He is Allah, the One, the Prevailing.\n",
        "TRANSLATION_17": "[39:4] Had God wanted to take a son — as they allege [that He has], ‘The Compassionate One has taken [to Himself] a son’ [Q. 19:88], He could have chosen from what He has created whatever He willed, and taken it as a child, instead of the angels whom they claim to be God’s daughters, or [their claim] that ‘Ezra is the son of God’, or that ‘Jesus is the son of God’ [cf. Q. 9:30]. Glory be to Him, in exaltation of Him as being above that He should take a child. He is God, the One, the All-Compelling, over all His creatures.\n",
        "TRANSLATION_18": "(If Allah had willed to choose a son) from among the angels or human beings as claimed the Jews, Christians and the Banu Malih, (He could have chosen what he would of that which He hath created) in Paradise; and it is said: from among the angels. (Be He glorified!) Allah exonerated Himself. (He is Allah, the One) He has no son or partner, (the Absolute) the All-Conquering over His creation.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "39:4",
            "38:65",
            "19:35",
            "37:159",
            "23:91",
            "2:116",
            "40:16",
            "16:57",
            "21:22",
            "9:31"
        ],
        "BIBLE": [
            "writings:daniel:11:36",
            "prophets:ii%20samuel:23:5",
            "prophets:joshua:1:17",
            "torah:numbers:5:9",
            "torah:leviticus:4:2",
            "torah:leviticus:22:2",
            "prophets:ezekiel:5:11",
            "torah:leviticus:17:2",
            "torah:numbers:18:8",
            "torah:leviticus:22:3"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:12"
        ]
    }
}