{
    "VERSE": "39:40",
    "ARABIC": "مَن يَأْتِيهِ عَذَابٌ يُخْزِيهِ وَيَحِلُّ عَلَيْهِ عَذَابٌ مُّقِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "who will receive a punishment which disgraces him and will unleash against himself an everlasting punishment.'",
        "TRANSLATION_1": "Who suffers the shameful punishment, and on whom falls the everlasting torment.\n",
        "TRANSLATION_2": "whom the degrading chastisement will visit and upon whom the everlasting chastisement will alight.\n",
        "TRANSLATION_3": "who will face the humiliating torment and suffer everlasting retribution\".\n",
        "TRANSLATION_4": "“To whom will come a punishment that will disgrace, and upon whom descends the punishment that never ends.”\n",
        "TRANSLATION_5": "To whom comes a disgracing torment, and on whom descends an everlasting torment.\"\n",
        "TRANSLATION_6": "Who it is to whom there shall come a punishment which will disgrace him and to whom will be due a lasting punishment.\n",
        "TRANSLATION_7": "to whom will come a chastisement degrading him, and upon whom lights a lasting chastisement.'\n",
        "TRANSLATION_8": "Who it is unto whom cometh a doom that will abase him, and on whom there falleth everlasting doom.\n",
        "TRANSLATION_9": "who will suffer a humiliating torment and on whom will descend an everlasting punishment.\"\n",
        "TRANSLATION_10": "On whom cometh a torment humiliating him, and on whom alighteth a torment lasting.\n",
        "TRANSLATION_11": "who will be overtaken by a punishment that will disgrace him, and on whom a lasting punishment will descend.’\n",
        "TRANSLATION_12": "Who it is to whom comes a Penalty of ignominy, and on whom descends a Penalty that abides.\"\n",
        "TRANSLATION_13": "To whom comes a disgracing torment, and on whom descends an everlasting torment.\"\n",
        "TRANSLATION_14": "upon whom the punishment will come that will degrade him, and who will be overtaken by an everlasting punishment'\n",
        "TRANSLATION_15": "Who will receive a humiliating punishment, and on whom will fall a lasting torment.”\n",
        "TRANSLATION_16": "To whom will come a torment disgracing him and on whom will descend an enduring punishment.\"\n",
        "TRANSLATION_17": "[39:40] to whom (man, introduces the relative clause that is the direct object of [the action of] ‘knowing’) will come a chastisement that will disgrace him and on whom there will descend a lasting chastisement’, an everlasting one, namely, the chastisement of the Fire. Indeed God [then] disgraced them at Badr.\n",
        "TRANSLATION_18": "(Who it is unto whom cometh a doom that will abase him) that will humiliate and destroy him, (and on whom there falleth everlasting doom) and upon whom an eternal chastisement is decreed.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "39:40",
            "11:39",
            "37:9",
            "20:48",
            "22:4",
            "19:79",
            "70:1",
            "70:27",
            "2:162",
            "3:88"
        ],
        "BIBLE": [
            "writings:proverbs:10:8",
            "prophets:jeremiah:44:12",
            "torah:leviticus:9:24",
            "prophets:ii%20kings:7:4",
            "writings:psalms:91:7",
            "prophets:ezekiel:43:3",
            "prophets:jeremiah:51:47",
            "prophets:zephaniah:3:7",
            "torah:numbers:17:10",
            "writings:esther:8:6"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:11"
        ]
    }
}