{
    "VERSE": "39:41",
    "ARABIC": "إِنَّآ أَنزَلْنَا عَلَيْكَ ٱلْكِتَٰبَ لِلنَّاسِ بِٱلْحَقِّ فَمَنِ ٱهْتَدَىٰ فَلِنَفْسِهِۦ وَمَن ضَلَّ فَإِنَّمَا يَضِلُّ عَلَيْهَا وَمَآ أَنتَ عَلَيْهِم بِوَكِيلٍ",
    "ENGLISH": {
        "TRANSLATION_0": "We have sent down to you the Book for mankind with truth. So whoever is guided is guided to his own good and whoever is misguided, it is to his detriment. You are not set over them as a guardian.",
        "TRANSLATION_1": "We have Sent down this Book to you with the truth for all mankind. So, he who comes to guidance does so for himself, and he who goes astray does so for his own loss; on you does not lie their guardianship.\n",
        "TRANSLATION_2": "(O Prophet), We revealed to you the Book with the Truth for all mankind. So he who follows the Right Way does so to his own benefit, and he who goes astray, shall hurt only himself by straying. You are not accountable on their behalf.\n",
        "TRANSLATION_3": "(Muhammad), We have revealed the Book to you for mankind in all truth. Whoever seeks guidance does so for his own good. Whosoever goes astray goes against his own soul. You are not their representative.\n",
        "TRANSLATION_4": "We have indeed sent down this Book to you with the truth, in order to guide mankind; so whoever attains guidance has attained it is for his own good, and whoever strays, has strayed for his own harm; and you are not at all responsible for them.\n",
        "TRANSLATION_5": "Verily, We have sent down to you the Book for mankind in truth. So, whosoever accepts the guidance, it is only for himself; and whosoever goes astray, he goes astray only to his (own) loss. And you are not a trustee over them.\n",
        "TRANSLATION_6": "Surely We have revealed to you the Book with the truth for the sake of men; so whoever follows the right way, it is for his own soul and whoever errs, he errs only to its detriment; and you are not a custodian over them.\n",
        "TRANSLATION_7": "Surely We have sent down upon thee the Book for mankind with the truth. Whosoever is guided, is only guided to his own gain, and whosoever goes astray, it is only to his own loss; thou art not a guardian over them.\n",
        "TRANSLATION_8": "Lo! We have revealed unto thee (Muhammad) the Scripture for mankind with truth. Then whosoever goeth right it is for his soul, and whosoever strayeth, strayeth only to its hurt. And thou art not a warder over them.\n",
        "TRANSLATION_9": "[O Prophet!] We have sent down to you the Book for mankind with the truth. Then whoever adopts the right way, will do so for his own soul, and whoever goes astray, injures his own soul. You are not their custodian.\n",
        "TRANSLATION_10": "Verily We! We have sent down Unto thee the Book for mankind? with truth. Then whosoever receiveth guidance, it is for his soul and whosoever strayeth, strayeth only to its hurt; and thou art not over them a trustee.\n",
        "TRANSLATION_11": "Indeed We have sent down the Book to you with the truth for [the deliverance of] mankind. So whoever is guided is guided for his own sake, and whoever goes astray, goes astray to his own detriment, and it is not your duty to watch over them.\n",
        "TRANSLATION_12": "Verily We have revealed the Book to thee in Truth, for (instructing) mankind. He, then, that receives guidance benefits his own soul: but he that strays injures his own soul. Nor art thou set over them to dispose of their affairs.\n",
        "TRANSLATION_13": "Verily, We have sent down to you (O Muhammad SAW) the Book (this Quran) for mankind in truth. So whosoever accepts the guidance, it is only for his ownself, and whosoever goes astray, he goes astray only for his (own) loss. And you (O Muhammad SAW) are not a Wakil (trustee or disposer of affairs, or keeper) over them.\n",
        "TRANSLATION_14": "Surely, We have sent down to you the Book for mankind with the truth. Whosoever is guided, is guided for himself, and he who goes astray, it is only for his own loss, you (Prophet Muhammad) are not their (compulsory) guardian.\n",
        "TRANSLATION_15": "We sent down upon you the Book for mankind in truth. He who follows guidance does so for the good of his soul. And he who strays in error does so to its detriment. You are not their overseer.\n",
        "TRANSLATION_16": "Indeed, We sent down to you the Book for the people in truth. So whoever is guided - it is for [the benefit of] his soul; and whoever goes astray only goes astray to its detriment. And you are not a manager over them.\n",
        "TRANSLATION_17": "[39:41] Truly We have revealed the Book to you for [the sake of] mankind with the truth (bi’l-haqqi is semantically connected to anzalnā, ‘We have revealed’). So whoever is guided, then it, his being guided, is for [the sake of] his own soul, and whoever goes astray, goes astray only to the detriment thereof. And you are not [meant to be] a guardian over them, and so compel them to [embrace] guidance.\n",
        "TRANSLATION_18": "(Lo! We have revealed unto thee (Muhammad) the Scripture) We have sent you Gabriel with the Scripture (for mankind with truth) He says: in order to explain the Truth and falsehood to people. (Then whosoever goeth right) by means of the Qur'an and believes in it (it is for his soul) the reward of it, (and whosoever strayeth) and whoever disbelieves in the Qur'an, (strayeth only to its hurt) the punishment of his denial will be inflicted on his soul. (And thou art not a warder) a custodian (over them) over the disbelievers of Mecca such that you are taken to task for their denial.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "39:41",
            "10:108",
            "23:62",
            "45:29",
            "4:105",
            "2:121",
            "2:44",
            "3:173",
            "3:3",
            "39:2"
        ],
        "BIBLE": [
            "prophets:i%20samuel:18:5",
            "prophets:i%20samuel:30:21",
            "torah:genesis:44:4",
            "torah:exodus:21:22",
            "prophets:ii%20kings:1:6",
            "writings:psalms:86:14",
            "prophets:zechariah:8:10",
            "prophets:ii%20kings:8:9",
            "torah:exodus:19:12",
            "writings:job:7:20"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:6"
        ]
    }
}