{
    "VERSE": "39:42",
    "ARABIC": "ٱللَّهُ يَتَوَفَّى ٱلْأَنفُسَ حِينَ مَوْتِهَا وَٱلَّتِى لَمْ تَمُتْ فِى مَنَامِهَا فَيُمْسِكُ ٱلَّتِى قَضَىٰ عَلَيْهَا ٱلْمَوْتَ وَيُرْسِلُ ٱلْأُخْرَىٰٓ إِلَىٰٓ أَجَلٍ مُّسَمًّى إِنَّ فِى ذَٰلِكَ لَءَايَٰتٍ لِّقَوْمٍ يَتَفَكَّرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Allah takes back people's souls when their death arrives and those who have not yet died, while they are asleep. He keeps hold of those whose death has been decreed and sends the others back for a specified term. There are certainly Signs in that for people who reflect.",
        "TRANSLATION_1": "God gathers up the souls of those who die, and of those who do not die, in their sleep; then He keeps back those ordained for death, and sends the others back for an appointed term. Surely there are signs in this for those who reflect.\n",
        "TRANSLATION_2": "It is Allah Who takes away the souls of people at the hour of their death, and takes away at the time of sleep the souls of those that have not died. Then He retains the souls of those against whom He had decreed death and returns the souls of others till an appointed time. Surely there are Signs in this for a people who reflect.\n",
        "TRANSLATION_3": "God will receive their souls when they die. Their souls do not die when they are sleeping. During people's sleep He withholds those souls which He has decreed to die and releases the others for an appointed time. In this there is evidence (of the Truth) for the thoughtful people.\n",
        "TRANSLATION_4": "It is Allah Who gives death* to living beings at the time of their demise, and to those who do not die, during their sleep; so He restrains the soul on which the decree of death has been passed, and leaves the other till the appointed term; indeed in this are signs for people who reflect. (*Death is of 2 types – passing to the next world, and sleeping.)\n",
        "TRANSLATION_5": "It is Allah Who takes away the souls at the time of their death, and those that die not during their sleep. He keeps those (souls) for which He has ordained death and sends the rest for a term appointed. Verily, in this are signs for a people who think deeply.\n",
        "TRANSLATION_6": "Allah takes the souls at the time of their death, and those that die not during their sleep; then He withholds those on whom He has passed the decree of death and sends the others back till an appointed term; most surely there are signs in this for a people who reflect.\n",
        "TRANSLATION_7": "God takes the souls at the time of their death, and that which has not died, in its sleep; He withholds that against which He has decreed death, but looses the other till a stated term. Surely in that are signs for a people who reflect. Or have they taken intercessors apart from God?\n",
        "TRANSLATION_8": "Allah receiveth (men's) souls at the time of their death, and that (soul) which dieth not (yet) in its sleep. He keepeth that (soul) for which He hath ordained death and dismisseth the rest till an appointed term. Lo! herein verily are portents for people who take thought.\n",
        "TRANSLATION_9": "It is God who takes away men's souls upon their death and the souls of the living during their sleep. Then He withholds those for whom He has ordained death and restores the souls of others for an appointed term. There are certainly signs in this for those who reflect.\n",
        "TRANSLATION_10": "Allah it is who taketh away souls at the time of their death, and those which die not in their sleep: then He withhold those on which He hath decreed death, and sendeth back the rest for an appointed term. Verily herein are signs for a people who ponder.\n",
        "TRANSLATION_11": "Allah takes the souls at the time of their death, and those who have not died, in their sleep. Then He retains those for whom He has ordained death and releases the others until a specified time. There are indeed signs in that for a people who reflect.\n",
        "TRANSLATION_12": "It is Allah that takes the souls (of men) at death; and those that die not (He takes) during their sleep: those on whom He has passed the decree of death, He keeps back (from returning to life), but the rest He sends (to their bodies) for a term appointed verily in this are Signs for those who reflect.\n",
        "TRANSLATION_13": "It is Allah Who takes away the souls at the time of their death, and those that die not during their sleep. He keeps those (souls) for which He has ordained death and sends the rest for a term appointed. Verily, in this are signs for a people who think deeply.\n",
        "TRANSLATION_14": "Allah takes away souls at the time of their death (the temporary death of sleep), and those who do not die during their sleep He withholds that upon whichHe has decreed death, but turns lose the other till a stated term. Surely, there are signs in this for a nation who contemplate.\n",
        "TRANSLATION_15": "God takes the souls at the time of their death, and those that have not died during their sleep. He retains those for which He has decreed death, and He releases the others until a predetermined time. In that are signs for people who reflect.\n",
        "TRANSLATION_16": "Allah takes the souls at the time of their death, and those that do not die [He takes] during their sleep. Then He keeps those for which He has decreed death and releases the others for a specified term. Indeed in that are signs for a people who give thought.\n",
        "TRANSLATION_17": "[39:42] God takes the souls at the time of their death, and, He takes, those that have not died in their sleep, in other words, He takes them during sleep. Then He retains those for whom He has ordained death and releases the others until an appointed term, that is, until the time of their death. The one that is released is the soul [that possesses the faculty] of discernment, without which the soul [containing the force] of life is able to remain [temporarily] — but this cannot be the other way round. Truly in that, mentioned, there are signs, indications, for a people who reflect, and then realise that the One with the power to do this also has the power to resurrect — Quraysh, however, never reflected on this [fact].\n",
        "TRANSLATION_18": "(Allah receiveth (men's) souls) Allah takes to Himself the souls of people (at the time of their death) their sleep, (and that (soul) which dieth not (yet) in its sleep. He keepeth that (soul) for which He hath ordained death and dismisseth the rest till an appointed term. Lo herein) in keeping and releasing souls (verily are portents) signs and admonitions (for people who take thought) for people who reflect on this.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "39:42",
            "16:65",
            "39:52",
            "30:37",
            "16:107",
            "16:79",
            "29:24",
            "10:6",
            "6:12",
            "25:68"
        ],
        "BIBLE": [
            "prophets:i%20samuel:10:9",
            "prophets:ezekiel:18:13",
            "prophets:ezekiel:3:20",
            "writings:nehemiah:2:1",
            "prophets:i%20samuel:9:24",
            "torah:deuteronomy:20:7",
            "prophets:ezekiel:18:8",
            "writings:job:1:21",
            "prophets:i%20kings:20:39",
            "writings:daniel:7:12"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:4:1",
            
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:5:1"
        ]
    }
}