{
    "VERSE": "39:48",
    "ARABIC": "وَبَدَا لَهُمْ سَيِّـَٔاتُ مَا كَسَبُوا۟ وَحَاقَ بِهِم مَّا كَانُوا۟ بِهِۦ يَسْتَهْزِءُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "What confronts them will be the evil actions which they earned and what they used to mock at will engulf them.",
        "TRANSLATION_1": "And the evil of what they had earned would become visible to them; and what they used to mock would surround them from all sides.\n",
        "TRANSLATION_2": "The evil consequences of their deeds will become fully apparent to them, and what they had scoffed at will encompass them.\n",
        "TRANSLATION_3": "Their bad deeds will become public and they will be surrounded by the torment which they had mocked during their worldly life.\n",
        "TRANSLATION_4": "And the evils they earned appeared to them, and the thing they used to mock at descended upon them.\n",
        "TRANSLATION_5": "And the evils of that which they earned will become apparent to them, and that which they used to mock at will encircle them.\n",
        "TRANSLATION_6": "And the evil (consequences) of what they wrought shall become plain to them, and the very thing they mocked at shall beset them.\n",
        "TRANSLATION_7": "and there would appear to them die evils of that they have earned, and they would be encompassed by that they mocked at.\n",
        "TRANSLATION_8": "And the evils that they earned will appear unto them, and that whereat they used to scoff will surround them.\n",
        "TRANSLATION_9": "the evil of their deeds will become apparent to them, and they will be overwhelmed by that which they used to mock.\n",
        "TRANSLATION_10": "And there shall appear Unto them the evils that they earned, and there shall surround them that whereat they had been mocking.\n",
        "TRANSLATION_11": "The evils of what they had earned will appear to them, and they will be besieged by what they used to deride.\n",
        "TRANSLATION_12": "For the evils of their Deeds will confront them, and they will be (completely) encircled by that which they used to mock at!\n",
        "TRANSLATION_13": "And the evils of that which they earned will become apparent to them, and they will be encircled by that which they used to mock at!\n",
        "TRANSLATION_14": "and the evils of their earnings will appear to them, and that which they mocked at will encompass them.\n",
        "TRANSLATION_15": "There will appear to them the evils of their deeds, and they will be surrounded by what they used to ridicule.\n",
        "TRANSLATION_16": "And there will appear to them the evils they had earned, and they will be enveloped by what they used to ridicule.\n",
        "TRANSLATION_17": "[39:48] And there will appear to them the evils of what they had earned, and they will be besieged by, there will descend [on them], that which they used to deride, in other words, the chastisement.\n",
        "TRANSLATION_18": "(And the evils that they earned) their evil works (will appear unto them, and that whereat they used to scoff) the prophets and Scriptures that they used to mock; and it is said the torment that they used to scoff (will surround them) i.e. the torment will visit them.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "39:48",
            "45:33",
            "16:34",
            "39:51",
            "29:4",
            "29:7",
            "85:7",
            "28:84",
            "13:21",
            "26:211"
        ],
        "BIBLE": [
            "writings:psalms:141:4",
            "torah:deuteronomy:31:18",
            "prophets:joshua:7:15",
            "prophets:micah:3:4",
            "torah:genesis:34:7",
            "torah:deuteronomy:17:4",
            "torah:exodus:34:10",
            "prophets:jeremiah:11:17",
            "torah:numbers:4:15",
            "prophets:ii%20kings:17:11"
        ]
    }
}