{
    "VERSE": "39:50",
    "ARABIC": "قَدْ قَالَهَا ٱلَّذِينَ مِن قَبْلِهِمْ فَمَآ أَغْنَىٰ عَنْهُم مَّا كَانُوا۟ يَكْسِبُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Those who came before them also said that, but what they earned did not avail them.",
        "TRANSLATION_1": "Those before them had also said so, and yet nothing of what they did availed them in the least.\n",
        "TRANSLATION_2": "Their predecessors also said the same, but their earnings proved of no avail to them,\n",
        "TRANSLATION_3": "People who lived before them had also said, \"Our wealth has been earned by our own merits.\" What they had earned was of no benefit to them\n",
        "TRANSLATION_4": "Those before them also said the same, so their earnings did not benefit them at all.\n",
        "TRANSLATION_5": "Verily, those before them said it, yet (all) that they had earned availed them not.\n",
        "TRANSLATION_6": "Those before them did say it indeed, but what they earned availed them not.\n",
        "TRANSLATION_7": "So said those that were before them; but that they earned did not avail them,\n",
        "TRANSLATION_8": "Those before them said it, yet (all) that they had earned availed them not;\n",
        "TRANSLATION_9": "Those who preceded them said the same thing but they gained nothing from what they did;\n",
        "TRANSLATION_10": "Surely those who were before them said it, yet there availed them not that which they had been earning.\n",
        "TRANSLATION_11": "Those who were before them [also] said that, but what they used to earn did not avail them.\n",
        "TRANSLATION_12": "Thus did the (generations) before them say! But all that they did was of no profit to them.\n",
        "TRANSLATION_13": "Verily, those before them said it, yet (all) that they had earned availed them not.\n",
        "TRANSLATION_14": "Those before them said the same, but what they earned did not help them;\n",
        "TRANSLATION_15": "Those before them said it, but what they had earned did not avail them.\n",
        "TRANSLATION_16": "Those before them had already said it, but they were not availed by what they used to earn.\n",
        "TRANSLATION_17": "[39:50] Already the same was said by those who were before them, of communities, such as Korah and those of his people who were content with such [a saying]. But what they used to earn did not avail them.\n",
        "TRANSLATION_18": "(Those before them) before your people, Muhammad, such as Korah and others (said it) claimed this claim, (yet (all) that they had earned availed them not) what they used to do and say as well as what they used to worship beside Allah and amass of wealth did not benefit them in driving away Allah's punishment;\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "39:50",
            "41:48",
            "21:41",
            "70:36",
            "6:10",
            "6:28",
            "5:102",
            "67:18",
            "51:52",
            "39:25"
        ],
        "BIBLE": [
            "writings:psalms:102:25",
            "writings:psalms:95:10",
            "writings:ecclesiastes:1:10",
            "prophets:ezekiel:24:19",
            "prophets:i%20samuel:2:23",
            "prophets:jeremiah:7:23",
            "prophets:judges:3:2",
            "prophets:joshua:22:28",
            "prophets:joshua:7:13",
            "prophets:i%20samuel:3:17"
        ]
    }
}