{
    "VERSE": "39:54",
    "ARABIC": "وَأَنِيبُوٓا۟ إِلَىٰ رَبِّكُمْ وَأَسْلِمُوا۟ لَهُۥ مِن قَبْلِ أَن يَأْتِيَكُمُ ٱلْعَذَابُ ثُمَّ لَا تُنصَرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Turn in repentance to your Lord and submit to Him before punishment comes upon you, for then you cannot be helped.",
        "TRANSLATION_1": "Turn towards your Lord and obey Him before the punishment comes upon you when you will not be helped.\n",
        "TRANSLATION_2": "Turn to your Lord and surrender yourselves to Him before the chastisement over-takes you; for then you will receive no help.\n",
        "TRANSLATION_3": "Turn in repentance to your Lord and submit to His will before you are afflicted with the torment after which you can receive no help.\n",
        "TRANSLATION_4": "“And incline towards your Lord and submit to Him, before the punishment comes you and then you may not be helped.”\n",
        "TRANSLATION_5": "And turn in repentance (and in obedience with true faith) to your Lord and submit to Him before the torment comes upon you, (and) then you will not be helped.\"\n",
        "TRANSLATION_6": "And return to your Lord time after time and submit to Him before there comes to you the punishment, then you shall not be helped.\n",
        "TRANSLATION_7": "Turn unto your Lord and surrender to Him, ere the chastisement comes upon you, then you will not be helped.\n",
        "TRANSLATION_8": "Turn unto your Lord repentant, and surrender unto Him, before there come unto you the doom, when ye cannot be helped.\n",
        "TRANSLATION_9": "Turn to your Lord and submit to Him before His scourge overtakes you, for then you shall not be helped.\n",
        "TRANSLATION_10": "And turn penitently Unto your Lord and submit Unto Him ere there cometh Unto you the torment, and then ye shall not be succoured.\n",
        "TRANSLATION_11": "Turn penitently to Him and submit to Him before the punishment overtakes you, whereupon you will not be helped.\n",
        "TRANSLATION_12": "Turn ye to our Lord (in repentance) and bow to His (Will), before the Penalty comes on you: after that ye shall not be helped.\n",
        "TRANSLATION_13": "And turn in repentance and in obedience with true Faith (Islamic Monotheism) to your Lord and submit to Him, (in Islam), before the torment comes upon you, then you will not be helped.\n",
        "TRANSLATION_14": "Turn to your Lord and surrender yourselves to Him before the punishment overtakes you, for then you will not be helped.\n",
        "TRANSLATION_15": "And turn to your Lord, and submit to Him, before the retribution comes upon you. Then you will not be helped.\n",
        "TRANSLATION_16": "And return [in repentance] to your Lord and submit to Him before the punishment comes upon you; then you will not be helped.\n",
        "TRANSLATION_17": "[39:54] And turn, return, [penitently] to your Lord and submit, perform deeds sincerely, to Him, before the chastisement comes on you, whereupon you will not be helped, to ward it off, if you have not repented.\n",
        "TRANSLATION_18": "(Turn unto Him repentant) from disbelief, (and surrender unto Him) and believe in Him and obey Him, (before there come unto you the doom, when ye cannot be helped) you will not be spared from Allah's torment. This verse was revealed about Wahshiyy and his believing brothers.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "39:54",
            "39:55",
            "70:27",
            "23:76",
            "44:12",
            "20:134",
            "39:25",
            "2:162",
            "3:88",
            "2:21"
        ],
        "BIBLE": [
            "prophets:jeremiah:31:18",
            "prophets:ii%20kings:5:26",
            "prophets:malachi:3:7",
            "prophets:jeremiah:30:3",
            "writings:lamentations:5:22",
            "writings:lamentations:5:21",
            "writings:job:17:10",
            "prophets:judges:11:31",
            "torah:deuteronomy:30:3",
            "prophets:jeremiah:5:3"
        ]
    }
}