{
    "VERSE": "39:57",
    "ARABIC": "أَوْ تَقُولَ لَوْ أَنَّ ٱللَّهَ هَدَىٰنِى لَكُنتُ مِنَ ٱلْمُتَّقِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "or lest they should say, 'If only Allah had guided me, I would have had taqwa,'",
        "TRANSLATION_1": "Or say: \"If only God had guided me I would have been a man of fear and piety;\"\n",
        "TRANSLATION_2": "and lest a person should say: “If only Allah had guided me, I should have been one of the God-fearing”;\n",
        "TRANSLATION_3": "Or before the soul says, \"Had God guided me, I could have been a pious man\".\n",
        "TRANSLATION_4": "Or (so that no soul) may say, “If Allah had shown me the right path, I would then be among the pious!”\n",
        "TRANSLATION_5": "Or (lest) he should say: \"If only Allah had guided me, I should indeed have been among those who have Taqwa.\"\n",
        "TRANSLATION_6": "Or it should say: Had Allah guided me, I would certainly have been of those who guard (against evil);\n",
        "TRANSLATION_7": "or lest it should say, 'If only God had guided me, I should have been or lest among the godfearing,'\n",
        "TRANSLATION_8": "Or should say: If Allah had but guided me I should have been among the dutiful!\n",
        "TRANSLATION_9": "Or, \"If only God had guided me, I would surely have joined the God-fearing.\"\n",
        "TRANSLATION_10": "Or, lest it should say: had Allah but guided me, I should surely have been of the God-fearing!\n",
        "TRANSLATION_11": "Or say, ‘Had Allah guided me I would have surely been among the Godwary!’\n",
        "TRANSLATION_12": "Or (lest) it should say: 'If only Allah had guided me, I should certainly have been among the righteous!'-\n",
        "TRANSLATION_13": "Or (lest) he should say: \"If only Allah had guided me, I should indeed have been among the Muttaqun (pious and righteous persons - see V. 2:2).\"\n",
        "TRANSLATION_14": "Or, lest it should say: 'If Allah had only guided me I would have been one of the cautious'\n",
        "TRANSLATION_15": "Or say, “Had God guided me; I would have been of the pious.”\n",
        "TRANSLATION_16": "Or [lest] it say, \"If only Allah had guided me, I would have been among the righteous.\"\n",
        "TRANSLATION_17": "[39:57] or [before] that it should say, ‘If only God had guided me, to obedience and I had become guided, I would have been among those who have feared’, His chastisement;\n",
        "TRANSLATION_18": "(Or should say) and that it will not say: (if Allah had but guided me) if Allah had showed me faith (I should have been among the dutiful) I would have been among those who believe in Allah's divine Oneness!\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "39:57",
            "3:158",
            "37:152",
            "37:56",
            "29:11",
            "39:66",
            "9:75",
            "41:33",
            "7:178",
            "2:103"
        ],
        "BIBLE": [
            "writings:job:34:9",
            "writings:psalms:58:12",
            "writings:job:32:13",
            "prophets:ezekiel:3:21",
            "prophets:i%20kings:17:18",
            "writings:job:1:8",
            "prophets:jeremiah:4:10",
            "torah:genesis:2:16",
            "prophets:ii%20kings:13:19",
            "writings:job:28:28"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:3:6",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:3:7",
            "Sefer%20Yetzirah:1:1"
        ]
    }
}