{
    "VERSE": "39:58",
    "ARABIC": "أَوْ تَقُولَ حِينَ تَرَى ٱلْعَذَابَ لَوْ أَنَّ لِى كَرَّةً فَأَكُونَ مِنَ ٱلْمُحْسِنِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "or lest he should say, when he sees the punishment, 'If only I could have another chance so that I could be a good-doer!'",
        "TRANSLATION_1": "Or say on seeing the punishment: \"If I could only return I would be among the good.\"\n",
        "TRANSLATION_2": "or lest he should say, when he sees the chastisement: “O that I might return again, and be among those who do good.”\n",
        "TRANSLATION_3": "Or, on seeing the torment, it would say, \"Would I have the opportunity, this time I would certainly become a pious person\".\n",
        "TRANSLATION_4": "Or (so that no soul) may say when it beholds the punishment, “If only I may be sent back, so that I may do good deeds!”\n",
        "TRANSLATION_5": "Or (lest) he should say when he sees the torment: \"If only I had another chance, then I should indeed be among the doers of good.\"\n",
        "TRANSLATION_6": "Or it should say when it sees the punishment: Were there only a returning for me, I should be of the doers of good.\n",
        "TRANSLATION_7": "it should say, when it sees the chastisement, 'O that I might return again, and be among the good-doers.'\n",
        "TRANSLATION_8": "Or should say, when it seeth the doom: Oh, that I had but a second chance that I might be among the righteous!\n",
        "TRANSLATION_9": "Or, he may say as he sees the punishment, \"Would that I had a second chance, so that I could be among the doers of good.\"\n",
        "TRANSLATION_10": "Or lest it should say, when it will behold the torment: were there for me a return I would be of the well-doers.\n",
        "TRANSLATION_11": "Or say, when he sights the punishment, ‘If only there were a second chance for me, I would be among the virtuous!’\n",
        "TRANSLATION_12": "Or (lest) it should say when it (actually) sees the penalty: 'If only I had another chance, I should certainly be among those who do good!'\n",
        "TRANSLATION_13": "Or (lest) he should say when he sees the torment: \"If only I had another chance (to return to the world) then I should indeed be among the Muhsinun (good-doers - see V. 2:112).\"\n",
        "TRANSLATION_14": "Or, lest when it sees the punishment should say: 'O that I might return, and be among those that did good'\n",
        "TRANSLATION_15": "Or say, when it sees the penalty, “If only I had another chance, I would be of the virtuous.”\n",
        "TRANSLATION_16": "Or [lest] it say when it sees the punishment, \"If only I had another turn so I could be among the doers of good.\"\n",
        "TRANSLATION_17": "[39:58] or [before] that it should say, when it sees the chastisement, ‘If only there had been a second chance, a return to this world, I would be among the virtuous’, the believers. It is then said to him by God:\n",
        "TRANSLATION_18": "(Or should say) and so that it will not say, (when it seeth the doom: Oh, that I had but a second chance) to return to the life of this world (that I might be among the righteous) among those who believe in Allah's divine Oneness!\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "39:58",
            "26:102",
            "28:64",
            "8:14",
            "19:79",
            "10:50",
            "37:9",
            "70:11",
            "20:48",
            "4:138"
        ],
        "BIBLE": [
            "prophets:ezekiel:47:6",
            "prophets:ii%20kings:9:19",
            "prophets:ezekiel:8:15",
            "prophets:ii%20kings:20:5",
            "torah:genesis:42:21",
            "prophets:zechariah:1:3",
            "prophets:jeremiah:3:7",
            "prophets:judges:17:13",
            "writings:ecclesiastes:9:11",
            "torah:genesis:18:14"
        ]
    }
}