{
    "VERSE": "39:59",
    "ARABIC": "بَلَىٰ قَدْ جَآءَتْكَ ءَايَٰتِى فَكَذَّبْتَ بِهَا وَٱسْتَكْبَرْتَ وَكُنتَ مِنَ ٱلْكَٰفِرِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "'No, the fact is that My Signs came to you but you denied them and were arrogant and were one of the kafirun.'",
        "TRANSLATION_1": "Why, My revelations had come to you, but you denied them and were filled with pride, and were among the disbelievers.\n",
        "TRANSLATION_2": "Yes indeed! But My Signs came to you and you rejected them as lies, and waxed arrogant and were among those who disbelieved.\n",
        "TRANSLATION_3": "God will reply to the soul, \"My revelations had certainly come to you but you rejected them. You were puffed-up with pride and you became an unbeliever\".\n",
        "TRANSLATION_4": "It will be said to him, “Surely yes, why not?* My signs did come to you, so you denied them and you were haughty and you were a disbeliever.” (They will be mocked at.)\n",
        "TRANSLATION_5": "Yes! Verily, there came to you My Ayat and you denied them, and were proud and were among the disbelievers.\n",
        "TRANSLATION_6": "Aye! My communications came to you, but you rejected them, and you were proud and you were one of the unbelievers.\n",
        "TRANSLATION_7": "Yes indeed! My signs did come to thee, but thou hast cried them lies, and thou hast waxed proud, and become one of the unbelievers.'\n",
        "TRANSLATION_8": "(But now the answer will be): Nay, for My revelations came unto thee, but thou didst deny them and wast scornful and wast among the disbelievers.\n",
        "TRANSLATION_9": "No indeed! My revelations did come to you, but you rejected them: you showed arrogance, and were among those who deny the truth.\"\n",
        "TRANSLATION_10": "Yea! surely there came Unto thee My revelations, but thou beliedest them and wast stiff-necked and wast of the infidels.\n",
        "TRANSLATION_11": "[They will be told,] ‘Yes, My signs certainly came to you, but you denied them and acted arrogantly and you were among the faithless.’\n",
        "TRANSLATION_12": "(The reply will be:) 'Nay, but there came to thee my Signs, and thou didst reject them: thou wast Haughty, and became one of those who reject faith!'\"\n",
        "TRANSLATION_13": "Yes! Verily, there came to you My Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) and you denied them, and were proud and were among the disbelievers.\n",
        "TRANSLATION_14": "Indeed, My verses did come to you, but you belied them. You were proud and became one of the unbelievers'\n",
        "TRANSLATION_15": "Yes indeed! My Verses did come to you, but you called them lies, turned arrogant, and were of the faithless.\n",
        "TRANSLATION_16": "But yes, there had come to you My verses, but you denied them and were arrogant, and you were among the disbelievers.\n",
        "TRANSLATION_17": "[39:59] ‘Yes indeed! My signs came to you, the Qur’ān — which is the means to guidance — but you denied them and were arrogant, you disdained to believe in them, and you were among the disbelievers’.\n",
        "TRANSLATION_18": "Allah will say to them: (Nay, for My revelations) My Scripture and Messenger (came unto thee, but thou didst deny them) you denied the Scripture and Messenger (and were scornful) you were too proud to believe (and were among the disbelievers) you were with the disbelievers, following their religion.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "39:59",
            "54:15",
            "7:106",
            "78:28",
            "15:81",
            "20:126",
            "43:69",
            "43:47",
            "6:49",
            "23:66"
        ],
        "BIBLE": [
            "torah:exodus:3:4",
            "writings:song%20of%20songs:5:6",
            "prophets:jeremiah:36:16",
            "torah:genesis:27:1",
            "torah:genesis:12:18",
            "torah:genesis:35:10",
            "prophets:judges:16:18",
            "torah:genesis:30:11",
            "torah:genesis:3:9",
            "prophets:ii%20kings:8:14"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:1"
        ]
    }
}