{
    "VERSE": "39:61",
    "ARABIC": "وَيُنَجِّى ٱللَّهُ ٱلَّذِينَ ٱتَّقَوْا۟ بِمَفَازَتِهِمْ لَا يَمَسُّهُمُ ٱلسُّوٓءُ وَلَا هُمْ يَحْزَنُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Allah will give security those who had taqwa in their victorious Safe Haven. No evil will touch them and they will know no sorrow.",
        "TRANSLATION_1": "God would rescue those who fear Him (and guide them) to places of safety. Neither will evil touch them nor regret.\n",
        "TRANSLATION_2": "But as for the God-fearing, Allah will deliver them on account of their achievements: no harm shall visit them nor shall they grieve.\n",
        "TRANSLATION_3": "God will save the pious ones because of their virtuous deeds. No hardship will touch them nor will they be grieved.\n",
        "TRANSLATION_4": "And Allah will rescue the pious, to their place of salvation; neither will the punishment touch them, nor shall they grieve.\n",
        "TRANSLATION_5": "And Allah will deliver those who have Taqwa to their places of success. Evil shall touch them not, nor shall they grieve.\n",
        "TRANSLATION_6": "And Allah shall deliver those who guard (against evil) with their achievement; evil shall not touch them, nor shall they grieve.\n",
        "TRANSLATION_7": "But God shall deliver those that were godfearing in their security; evil shall not visit them, neither shall they sorrow.\n",
        "TRANSLATION_8": "And Allah delivereth those who ward off (evil) because of their deserts. Evil toucheth them not, nor do they grieve.\n",
        "TRANSLATION_9": "But God will deliver them who feared Him to their place of salvation. No evil shall touch them, nor shall they grieve.\n",
        "TRANSLATION_10": "And Allah will deliver those who feared Him to their place of safety. Evil will not touch them, nor will they grieve.\n",
        "TRANSLATION_11": "Allah will deliver those who were Godwary with their salvation. No ill shall touch them, nor will they grieve.\n",
        "TRANSLATION_12": "But Allah will deliver the righteous to their place of salvation: no evil shall touch them, nor shall they grieve.\n",
        "TRANSLATION_13": "And Allah will deliver those who are the Muttaqun (pious - see V. 2:2) to their places of success (Paradise). Evil shall touch them not, nor shall they grieve.\n",
        "TRANSLATION_14": "But, Allah will save those who fear Him with their winnings (Paradise). No evil shall touch them, nor shall they ever grieve.\n",
        "TRANSLATION_15": "And God will save those who maintained righteousness to their place of salvation. No harm will touch them, nor will they grieve.\n",
        "TRANSLATION_16": "And Allah will save those who feared Him by their attainment; no evil will touch them, nor will they grieve.\n",
        "TRANSLATION_17": "[39:61] And God will deliver, from Hell, those who fear, idolatry, because of their triumph, that is, on account of the place they have won in Paradise, by placing them in it. No evil will touch them, nor will they grieve.\n",
        "TRANSLATION_18": "(And Allah delivereth those who ward off (evil)) those who believe and obey their Lord (because of their deserts) because of their faith and good deeds. (Evil toucheth them not) hardship and torment do not touch them, (nor do they grieve) when others grieve.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "39:61",
            "13:21",
            "2:169",
            "3:141",
            "47:11",
            "29:11",
            "30:10",
            "10:95",
            "13:20",
            "2:15"
        ],
        "BIBLE": [
            "writings:psalms:51:16",
            "prophets:zephaniah:2:11",
            "writings:psalms:71:2",
            "prophets:jeremiah:14:13",
            "writings:daniel:11:21",
            "torah:exodus:32:34",
            "prophets:jeremiah:22:3",
            "prophets:isaiah:46:13",
            "prophets:judges:7:7",
            "prophets:ezekiel:14:20"
        ]
    }
}