{
    "VERSE": "39:63",
    "ARABIC": "لَّهُۥ مَقَالِيدُ ٱلسَّمَٰوَٰتِ وَٱلْأَرْضِ وَٱلَّذِينَ كَفَرُوا۟ بِـَٔايَٰتِ ٱللَّهِ أُو۟لَٰٓئِكَ هُمُ ٱلْخَٰسِرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "The keys of the heavens and earth belong to Him. It is those who reject Allah's Signs who are the losers.",
        "TRANSLATION_1": "He has the keys of the heavens and the earth; and those who deny the revelations of God will be losers.\n",
        "TRANSLATION_2": "To Him belong the keys of the heavens and the earth. It is those who disbelieve in Allah's Signs who will be the losers.\n",
        "TRANSLATION_3": "In His hands are the keys of the treasuries of the heavens and the earth. Those who reject God's revelations will be lost.\n",
        "TRANSLATION_4": "For Him only are the keys of the heavens and the earth; and those who denied the signs of Allah – it is they who are the losers.\n",
        "TRANSLATION_5": "To Him belong the Maqalid of the heavens and the earth. And those who disbelieve in the Ayat of Allah, such are they who will be the losers.\n",
        "TRANSLATION_6": "His are the treasures of the heavens and the earth; and (as for) those who disbelieve in the communications of Allah, these it is that are the losers.\n",
        "TRANSLATION_7": "unto Him belong the keys of the heavens and the earth. And those who disbelieve in the signs of God, those they are the losers.\n",
        "TRANSLATION_8": "His are the keys of the heavens and the earth, and they who disbelieve the revelations of Allah - such are they who are the losers.\n",
        "TRANSLATION_9": "the keys of the heavens and the earth belong to Him. Those who deny God's revelations will surely be the losers.\n",
        "TRANSLATION_10": "His are the keys of the heavens and the earth and those who disbelieve in the revelations of Allah-those! they are the losers.\n",
        "TRANSLATION_11": "To Him belong the keys of the heavens and the earth, and those who disbelieve in the signs of Allah—it is they who are the losers.\n",
        "TRANSLATION_12": "To Him belong the keys of the heavens and the earth: and those who reject the Signs of Allah,- it is they who will be in loss.\n",
        "TRANSLATION_13": "To Him belong the keys of the heavens and the earth. And those who disbelieve in the Ayat (proofs, evidences, verses, signs, revelations, etc.) of Allah, such are they who will be the losers.\n",
        "TRANSLATION_14": "To Him belong the keys of the heavens and the earth. Those who disbelieve in the verses of Allah they are the losers.\n",
        "TRANSLATION_15": "To Him belong the reins of the heavens and the earth. But those who blaspheme against the revelations of God—it is they who are the losers.\n",
        "TRANSLATION_16": "To Him belong the keys of the heavens and the earth. And they who disbelieve in the verses of Allah - it is those who are the losers.\n",
        "TRANSLATION_17": "[39:63] To Him belong the keys of the heavens and the earth, in other words, the keys to their storehouses of rain and vegetation and other things. And those who disbelieve in the signs of God, [such as] the Qur’ān — those, they are the losers (ūlā’ika humu’l-khāsirūna is semantically connected to His words wayunajjī’Llāhu’lladhīna ittaqaw, ‘and God will deliver those who guarded themselves …’ to the end [of that statement]; the intervening statements are parentheticals).\n",
        "TRANSLATION_18": "(His are the keys) the stores (of the heavens) rain (and the earth) vegetation, (and they who disbelieve the revelations of Allah) i.e. Muhammad (pbuh) and the Qur'an (such are they who are the losers) in the Hereafter, for they will be punished.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "39:63",
            "29:44",
            "53:31",
            "29:52",
            "10:6",
            "4:132",
            "27:25",
            "16:65",
            "3:109",
            "16:49"
        ],
        "BIBLE": [
            "writings:psalms:102:26",
            "prophets:ezekiel:7:21",
            "writings:lamentations:3:41",
            "prophets:isaiah:45:12",
            "writings:ii%20chronicles:32:19",
            "writings:job:16:11",
            "writings:job:1:11",
            "prophets:isaiah:14:26",
            "prophets:i%20samuel:14:10",
            "prophets:jeremiah:34:20"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:1"
        ]
    }
}