{
    "VERSE": "39:64",
    "ARABIC": "قُلْ أَفَغَيْرَ ٱللَّهِ تَأْمُرُوٓنِّىٓ أَعْبُدُ أَيُّهَا ٱلْجَٰهِلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Say: 'Do you order me to worship something other than Allah, you ignorant people?'",
        "TRANSLATION_1": "Say: \"O you ignorant people, do you bid me to worship someone other than God?\n",
        "TRANSLATION_2": "(O Prophet), say: “Ignorant people! Do you bid me to serve any other beside Allah?”\n",
        "TRANSLATION_3": "(Muhammad), say, \"Ignorant ones, do you command me to worship things other than God\n",
        "TRANSLATION_4": "Say (O dear Prophet Mohammed – peace and blessings be upon him) “So do you instruct me to worship (deities) other than Allah? You ignorant fools!”\n",
        "TRANSLATION_5": "Say: \"Do you order me to worship other than Allah O you fools!\"\n",
        "TRANSLATION_6": "Say: What! Do you then bid me serve others than Allah, O ignorant men?\n",
        "TRANSLATION_7": "Say: 'Is it other than God you bid me serve, you ignorant ones?'\n",
        "TRANSLATION_8": "Say (O Muhammad, to the disbelievers): Do ye bid me serve other than Allah? O ye fools!\n",
        "TRANSLATION_9": "Say, \"Ignorant men! Would you bid me worship someone other than God?\"\n",
        "TRANSLATION_10": "Say thou: is it other than Allah that ye command me to worship! O ye pagans\n",
        "TRANSLATION_11": "Say, ‘Will you, then, bid me to worship other than Allah, O you ignorant ones?!’\n",
        "TRANSLATION_12": "Say: \"Is it some one other than Allah that ye order me to worship, O ye ignorant ones?\"\n",
        "TRANSLATION_13": "Say (O Muhammad SAW to the polytheists, etc.): \"Do you order me to worship other than Allah O you fools?\"\n",
        "TRANSLATION_14": "Say: 'O you who are ignorant, is it other than Allah that you would order me to worship'\n",
        "TRANSLATION_15": "Say, “Is it other than God you instruct me to worship, you ignorant ones?”\n",
        "TRANSLATION_16": "Say, [O Muhammad], \"Is it other than Allah that you order me to worship, O ignorant ones?\"\n",
        "TRANSLATION_17": "[39:64] Say: ‘Is it [something] other than God that you bid me to worship, O you who are ignorant?’ (ghayra is in the accusative because of [the verb] a‘budu, ‘I worship’, which itself is operated by ta’murūnī, ‘you bid me’,   read with one nūn on the basis of an implicit an; it [ta’murūnī] may also be read with two nūns assimilated [ta’murūnnī] or separated [ta’murūnanī]).\n",
        "TRANSLATION_18": "(Say) Muhammad, to the people of Mecca when they said: revert to the religion of your forefathers: (Do ye bid me serve) do you bid me to follow (other than Allah) other than Allah's religion? (0 ye fools) you miscreants! 537\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "39:64",
            "7:140",
            "6:40",
            "26:29",
            "16:52",
            "23:32",
            "23:23",
            "4:82",
            "3:54",
            "23:85"
        ],
        "BIBLE": [
            "prophets:jeremiah:5:19",
            "prophets:isaiah:7:13",
            "prophets:ii%20samuel:23:17",
            "torah:exodus:18:23",
            "torah:exodus:10:7",
            "prophets:joshua:24:16",
            "prophets:ii%20kings:23:17",
            "prophets:ii%20kings:17:12",
            "writings:i%20chronicles:11:19",
            "prophets:joshua:24:19"
        ]
    }
}