{
    "VERSE": "39:70",
    "ARABIC": "وَوُفِّيَتْ كُلُّ نَفْسٍ مَّا عَمِلَتْ وَهُوَ أَعْلَمُ بِمَا يَفْعَلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Every self will be repaid in full for what it did. He knows best what they are doing.",
        "TRANSLATION_1": "Each soul will be paid in full for what it had done. He is cognisant of what you do.\n",
        "TRANSLATION_2": "and everyone shall be paid in full for all that he did. Allah is best aware of all that they do.\n",
        "TRANSLATION_3": "Every soul will be recompensed for its deeds. God knows best whatever they have done.\n",
        "TRANSLATION_4": "And every soul will be repaid for its deeds in full, and He knows very well what they used to do.\n",
        "TRANSLATION_5": "And each person will be paid in full of what he did; and He is Best Aware of what they do.\n",
        "TRANSLATION_6": "And every soul shall be paid back fully what it has done, and He knows best what they do.\n",
        "TRANSLATION_7": "Every soul shall be paid in full for what it has wrought; and He knows very well what they do.\n",
        "TRANSLATION_8": "And each soul is paid in full for what it did. And He is Best Aware of what they do.\n",
        "TRANSLATION_9": "Every soul will be repaid in full for what it has done. He is fully aware of all that they did.\n",
        "TRANSLATION_10": "And each soul will be paid in full that which it hath worked; and He is the Best Knower of which they do.\n",
        "TRANSLATION_11": "Every soul will be recompensed fully for what it has done, and He is best aware of what they do.\n",
        "TRANSLATION_12": "And to every soul will be paid in full (the fruit) of its Deeds; and (Allah) knoweth best all that they do.\n",
        "TRANSLATION_13": "And each person will be paid in full of what he did; and He is Best Aware of what they do.\n",
        "TRANSLATION_14": "Every soul shall be paid in full according to what it has done, for He knows well what they did.\n",
        "TRANSLATION_15": "And every soul will be fully compensated for what it had done. He is well aware of what they do.\n",
        "TRANSLATION_16": "And every soul will be fully compensated [for] what it did; and He is most knowing of what they do.\n",
        "TRANSLATION_17": "[39:70] And every soul will be paid in full for what it did, that is, [it will be paid] the requital thereof, and He is best aware of what they do, and has no need for any witnesses.\n",
        "TRANSLATION_18": "(And each soul) whether it is righteous or sinful (is paid in full for what it did) of good or evil. (And He is best aware of what they do) of good or evil.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "39:70",
            "16:111",
            "7:112",
            "74:38",
            "26:112",
            "10:79",
            "20:15",
            "91:7",
            "82:5",
            "11:21"
        ],
        "BIBLE": [
            "prophets:ezekiel:20:44",
            "prophets:jeremiah:48:30",
            "writings:daniel:3:32",
            "prophets:ezekiel:24:24",
            "torah:exodus:10:2",
            "prophets:micah:3:4",
            "prophets:joshua:7:15",
            "prophets:jeremiah:42:20",
            "prophets:isaiah:3:9",
            "torah:exodus:36:1"
        ]
    }
}