{
    "VERSE": "39:75",
    "ARABIC": "وَتَرَى ٱلْمَلَٰٓئِكَةَ حَآفِّينَ مِنْ حَوْلِ ٱلْعَرْشِ يُسَبِّحُونَ بِحَمْدِ رَبِّهِمْ وَقُضِىَ بَيْنَهُم بِٱلْحَقِّ وَقِيلَ ٱلْحَمْدُ لِلَّهِ رَبِّ ٱلْعَٰلَمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "You will see the angels circling round the Throne, glorifying their Lord with praise. It will be decided between them with truth. And it will be said: 'Praise be to Allah, the Lord of all the worlds.'",
        "TRANSLATION_1": "You will see the angels hover round the Throne, singing the praises of their Lord; and justice will be done between them equitably, and it would be said: \"All praise to God the Lord of all the worlds.\"\n",
        "TRANSLATION_2": "You shall see the angels surrounding the Throne, glorifying their Lord with His praise, and judgement will have been made among them with fairness, and it will be proclaimed: “All praise and thanks be to Allah, the Lord of the whole Universe.”\n",
        "TRANSLATION_3": "(Muhammad), on that day you will see the angels circling around the Throne, glorifying and praising their Lord. Judgment with justice will be decreed between the people of Paradise and hell and it will be said, \"It is only God, Lord of the Universe who deserves all praise.\"\n",
        "TRANSLATION_4": "And you will see the angels gathered around the Throne, saying the Purity of their Lord, with praise; and a true judgement will be delivered between the people, and it will be said, “All praise is to Allah, the Lord Of The Creation!”\n",
        "TRANSLATION_5": "And you will see the angels surrounding the Throne from all round, glorifying the praises of their Lord. And they will be judged with truth. And it will be said, \"All the praises and thanks be to Allah, the Lord of all that exits.\"\n",
        "TRANSLATION_6": "And you shall see the angels going round about the throne glorifying the praise of their Lord; and judgment shall be given between them with justice, and it shall be said: All praise is due to Allah, the Lord of the worlds.\n",
        "TRANSLATION_7": "And thou shalt see the angels encircling about the Throne proclaiming the praise of their Lord; and justly the issue shall be decided between them; and it shall be said, 'Praise belongs to God, the Lord of all Being.'\n",
        "TRANSLATION_8": "And thou (O Muhammad) seest the angels thronging round the Throne, hymning the praises of their Lord. And they are judged aright. And it is said: Praise be to Allah, the Lord of the Worlds!\n",
        "TRANSLATION_9": "You shall see the angels circling about the throne, glorifying their Lord with praise. And judgement will have been passed in justice on all and it will be said, \"Praise be to God, Lord of the Universe!\"\n",
        "TRANSLATION_10": "And thou wilt see the angels thronging round the Throne, hallowing the praise of their Lord. And judgment shall be given between them with truth: and it will be said: all praise Unto Allah, the Lord of the worlds.\n",
        "TRANSLATION_11": "And you will see the angels surrounding the Throne, celebrating the praise of their Lord, and judgment will be made between them with justice, and it will be said, ‘All praise belongs to Allah, the Lord of all the worlds!’\n",
        "TRANSLATION_12": "And thou wilt see the angels surrounding the Throne (Divine) on all sides, singing Glory and Praise to their Lord. The Decision between them (at Judgment) will be in (perfect) justice, and the cry (on all sides) will be, \"Praise be to Allah, the Lord of the Worlds!\"\n",
        "TRANSLATION_13": "And you will see the angels surrounding the Throne (of Allah) from all round, glorifying the praises of their Lord (Allah). And they (all the creatures) will be judged with truth, and it will be said. All the praises and thanks be to Allah, the Lord of the 'Alamin (mankind, jinns and all that exists).\n",
        "TRANSLATION_14": "And you shall see the angels encircling the Throne exalting with the praise of their Lord. And the matter will be justly decided between them, and it shall be said: 'Praise belongs to Allah, Lord of all the Worlds'\n",
        "TRANSLATION_15": "And you will see the angels hovering around the Throne, glorifying their Lord with praise. And it will be judged between them equitably, and it will be said, “Praise be to God, Lord of the Worlds.”\n",
        "TRANSLATION_16": "And you will see the angels surrounding the Throne, exalting [Allah] with praise of their Lord. And it will be judged between them in truth, and it will be said, \"[All] praise to Allah, Lord of the worlds.\"\n",
        "TRANSLATION_17": "[39:75] And you will see the angels encircling (hāffīna, a circumstantial qualifier) all round the Throne, from its every side, glorifying (yusabbihūn is a circumstantial qualifier referring to the person [of the participle] hāffīn) with praise of their Lord, continuously proclaiming [His] praise — in other words, saying subhāna’Llāhi wa-bihamdih, ‘Glory, and praise, be to God!’ — and judgement will be made between them, that is, between all creatures, with truth, in other words, [with] justice, so that believers enter Paradise while the disbelievers enter the Fire, and it will be said, ‘Praise be to God, the Lord of the Worlds!’ — the [final] establishing of both groups [in their respective abodes] is concluded with [this] angelic praise. Meccan, except for verses 56 and 57, which are Medinese; it consists of 85 verses, revealed after [sūrat] alZumar.\n",
        "TRANSLATION_18": "(And thou (0 Muhammad) seest the angels thronging round the Throne, hymning the praises of their Lord) by the command of Allah. (And they are judged) and it is judged between the prophets and their nations (aright) with justice. (And it is said) to them after the end of reckoning, say: (Praise be to Allah) thanks and gratitude belong to Allah, (the Lord of the Worlds!) the Master of the jinn and human beings Who separated us apart from our enemies, this is the station of Ha Mim, and He is the Mighty, the Knower'. And of the surah in which the Believer is mentioned, which is all Meccan and consists of 82 verses, 1,199 words and 4,960 letters: Surah 40: The Believer (al-Mu'min , Ghafir) And of the surah in which the Believer is mentioned, which is all Meccan and consists of 82 verses, 1,199 words and 4,960 letters:\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "39:75",
            "37:182",
            "1:2",
            "40:55",
            "6:45",
            "23:116",
            "40:66",
            "34:26",
            "20:114",
            "45:36"
        ],
        "BIBLE": [
            "writings:i%20chronicles:14:10",
            "prophets:joshua:7:7",
            "writings:i%20chronicles:16:35",
            "torah:exodus:16:4",
            "prophets:judges:4:14",
            "prophets:i%20kings:18:36",
            "torah:exodus:10:3",
            "prophets:ezekiel:37:21",
            "prophets:isaiah:12:4",
            "prophets:ii%20kings:4:16"
        ]
    }
}