{
    "VERSE": "39:9",
    "ARABIC": "أَمَّنْ هُوَ قَٰنِتٌ ءَانَآءَ ٱلَّيْلِ سَاجِدًا وَقَآئِمًا يَحْذَرُ ٱلْءَاخِرَةَ وَيَرْجُوا۟ رَحْمَةَ رَبِّهِۦ قُلْ هَلْ يَسْتَوِى ٱلَّذِينَ يَعْلَمُونَ وَٱلَّذِينَ لَا يَعْلَمُونَ إِنَّمَا يَتَذَكَّرُ أُو۟لُوا۟ ٱلْأَلْبَٰبِ",
    "ENGLISH": {
        "TRANSLATION_0": "What of him who spends the night hours in prayer, prostrating and standing up, mindful of the Next World, hoping for the mercy of his Lord? Say: 'Are they the same - those who know and those who do not know?' It is only people of intelligence who pay heed.",
        "TRANSLATION_1": "Can one who prays in the watches of the night, bowing in homage or standing attentive, fearful of the life to come, and hoping for the mercy of his Lord, (be like one who does not)? Say: \"Can those who know, and those who do not know, be equal? Only they think who are wise.\"\n",
        "TRANSLATION_2": "Is such a person (preferable or he) who is obedient, and prostrates himself in the watches of the night, stands (in Prayer), is fearful of the Hereafter, and looks forward to the mercy of His Lord? Ask them: “Are those who know equal to those who do not know?” Only those endowed with understanding take heed.\n",
        "TRANSLATION_3": "Can this one be considered equal to one who worships God during the night, prostrating and standing, who has fear of the Day of Judgment, and who has hope in the mercy of his Lord? Say, \"Are those who know equal to those who do not know? Only the people of reason take heed\".\n",
        "TRANSLATION_4": "Will he, whose night hours pass in obedience while prostrating and standing, fearing the Hereafter and hoping for the mercy of his Lord, ever be equal to the disobedient? Proclaim, “Are the knowledgeable and the ignorant equal?” It is only the men of intellect who heed advice.\n",
        "TRANSLATION_5": "Is one who is obedient to Allah, Ana'a Al-Layl prostrating and standing fearing the Hereafter and hoping for the mercy of his Lord Say: \"Are those who know equal to those who know not\" It is only men of understanding who will remember.\n",
        "TRANSLATION_6": "What! he who is obedient during hours of the night, prostrating himself and standing, takes care of the hereafter and hopes for the mercy of his Lord! Say: Are those who know and those who do not know alike? Only the men of understanding are mindful.\n",
        "TRANSLATION_7": "Or is he who is obedient in the watches of the night, bowing himself and standing, he being afraid of the world to come and hoping for the mercy of his Lord..? Say: 'Are they equal -- those who know and those who know not?' Only men possessed of minds remember.\n",
        "TRANSLATION_8": "Is he who payeth adoration in the watches of the night, prostrate and standing, bewaring of the Hereafter and hoping for the mercy of his Lord, (to be accounted equal with a disbeliever)? Say (unto them, O Muhammad): Are those who know equal with those who know not? But only men of understanding will pay heed.\n",
        "TRANSLATION_9": "Is he who prays devoutly to God in the hours of the night, prostrating himself and standing in prayer, who is ever mindful of the life to come and hopes for the mercy of his Lord [like one who does not]? Say, \"Are those who know equal to those who do not know?\" Truly, only those endowed with understanding will take heed.\n",
        "TRANSLATION_10": "Is he who is devout, in the watches of the night prostrating himself and standing, bewaring of the Hereafter and hoping for the mercy of his Lord to be dealt with like a wicked infidel? Say thou: shall they who know and those who know not be held equal? It is only men of understanding who receive admonition.\n",
        "TRANSLATION_11": "Is he who supplicates in the watches of the night, prostrating and standing, apprehensive of the Hereafter and expecting the mercy of his Lord...? Say, ‘Are those who know equal to those who do not know?’ Only those who possess intellect take admonition.\n",
        "TRANSLATION_12": "Is one who worships devoutly during the hour of the night prostrating himself or standing (in adoration), who takes heed of the Hereafter, and who places his hope in the Mercy of his Lord - (like one who does not)? Say: \"Are those equal, those who know and those who do not know? It is those who are endued with understanding that receive admonition.\n",
        "TRANSLATION_13": "Is one who is obedient to Allah, prostrating himself or standing (in prayer) during the hours of the night, fearing the Hereafter and hoping for the Mercy of his Lord (like one who disbelieves)? Say: \"Are those who know equal to those who know not?\" It is only men of understanding who will remember (i.e. get a lesson from Allah's Signs and Verses).\n",
        "TRANSLATION_14": "Or, is he who is obedient that prostrates himself and stands during parts of the night, being afraid of the Everlasting Life but hoping for the Mercy of the Lord (to be compared to the unbeliever)' Say: 'Are they equal, those who know and those who do not know' Only those with minds remember.\n",
        "TRANSLATION_15": "Is he who worships devoutly during the watches of the night, prostrating himself and standing up, mindful of the Hereafter, and placing his hope in the mercy of his Lord? Say, “Are those who know and those who do not know equal?” Only those possessed of reason will remember.\n",
        "TRANSLATION_16": "Is one who is devoutly obedient during periods of the night, prostrating and standing [in prayer], fearing the Hereafter and hoping for the mercy of his Lord, [like one who does not]? Say, \"Are those who know equal to those who do not know?\" Only they will remember [who are] people of understanding.\n",
        "TRANSLATION_17": "[39:9] Or is he who (read, softened, a-man) devotes himself [in worship], observing duties of obedience, in the watches of the night, [during] its hours, prostrating and standing, in prayer, apprehensive of the [eventuality of the] Hereafter, in other words, fearing its chastisement, and hoping for the mercy, the Paradise, of his Lord … ?, like one who is disobedient through disbelief or otherwise? (a variant reading has am-man, pronouncing the hamza, so that am has the sense of bal, ‘rather’). Say: ‘Are those who know equal with those who do not know?’, in other words, they are not equal, just as the person of knowledge is not equal to the ignorant one. Only people of pith, possessors of intellect, remember, [only they] are admonished.\n",
        "TRANSLATION_18": "(Is he who payeth adoration) is he who obeys Allah, i.e. the Prophet (pbuh) (in the watches of the night) in the hours of the night, (prostrate and standing) in prayer, (bewaring of the Hereafter) fearing the torment of the Hereafter (and hoping for the mercy of his Lord) and hoping for the Garden of his Lord, to be counted equal to Abu Jahl and his host? (Say) to them, Muhammad: (Are those who know) Allah's divine Oneness and Allah's commands and prohibitions, i.e. Abu Bakr and his fellow believers (equal) in reward and acts of obedience (with those who know not) Allah's divine Oneness or Allah's commands and prohibitions, i.e. Abu Jahl and his host? (But only men of understanding) only those possessed of intellect among people (will pay heed) will take admonition from the similitudes of the Qur'an.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "39:9",
            "13:19",
            "21:42",
            "56:49",
            "15:56",
            "32:15",
            "92:13",
            "17:57",
            "9:45",
            "38:43"
        ],
        "BIBLE": [
            "writings:ecclesiastes:3:14",
            "prophets:judges:12:3",
            "torah:genesis:20:3",
            "prophets:isaiah:57:1",
            "prophets:i%20kings:18:36",
            "writings:daniel:6:13",
            "prophets:ii%20kings:2:9",
            "prophets:ii%20kings:5:7",
            "writings:ii%20chronicles:20:21",
            "prophets:ezekiel:33:6"
        ]
    }
}