{
    "VERSE": "19:10",
    "ARABIC": "قَالَ رَبِّ ٱجْعَل لِّىٓ ءَايَةً قَالَ ءَايَتُكَ أَلَّا تُكَلِّمَ ٱلنَّاسَ ثَلَٰثَ لَيَالٍ سَوِيًّا",
    "ENGLISH": {
        "TRANSLATION_0": "He said, 'My Lord, give me a Sign.' He said, 'Your Sign is not to speak to people for three nights despite the fact that you are perfectly able to.'",
        "TRANSLATION_1": "He said: \"O Lord, give me a token.\" \"Though sound,\" He answered, \"you will not talk to any one for three nights running.\"\n",
        "TRANSLATION_2": "Zechariah said: \"Lord, grant me a Sign.\" Said He: \"Your Sign is that you shall not be able to speak to people for three nights, though you will be otherwise sound.\"\n",
        "TRANSLATION_3": "Zachariah asked, \" Lord, show me evidence (if this is a heavenly news).\" The Lord said, \"The evidence for it is that you must not speak (to any mortal) though you are in good health for three nights (and days).\"\n",
        "TRANSLATION_4": "He said, “My Lord, give me a sign”; He said, “Your token is that you will not speak to people for three nights, although in proper health.”\n",
        "TRANSLATION_5": "He [Zakariyya] said: \"My Lord! Appoint for me a sign.\" He said: \"Your sign is that you shall not speak unto mankind for three nights, though having no bodily defect.\"\n",
        "TRANSLATION_6": "He said: My Lord! give me a sign. He said: Your sign is that you will not be able to speak to the people three nights while in sound health.\n",
        "TRANSLATION_7": "He said, 'Lord, appoint to me some sign.' Said He, 'Thy sign is that thou shall not speak to men, though being without fault, three nights.'\n",
        "TRANSLATION_8": "He said: My Lord! Appoint for me some token. He said: Thy token is that thou, with no bodily defect, shalt not speak unto mankind three nights.\n",
        "TRANSLATION_9": "He said, \"My Lord, grant me a sign!\" He said, \"Your sign will be that you will not speak to anyone for three successive days and nights, although sound in body.\"\n",
        "TRANSLATION_10": "He said: my Lord appoint for me a sign. Allah said: thy sign is that thou shalt not speak unto mankind for three nights, while sound.\n",
        "TRANSLATION_11": "He said, ‘My Lord! Appoint a sign for me.’ He said, ‘Your sign is that you will not speak to the people for three complete nights.’\n",
        "TRANSLATION_12": "(Zakariya) said: \"O my Lord! give me a Sign.\" \"Thy Sign,\" was the answer, \"Shall be that thou shalt speak to no man for three nights, although thou art not dumb.\"\n",
        "TRANSLATION_13": "[Zakariya (Zachariah)] said: \"My Lord! Appoint for me a sign.\" He said: \"Your sign is that you shall not speak unto mankind for three nights, though having no bodily defect.\"\n",
        "TRANSLATION_14": "He (Zachariah) said: 'Lord, make for me a sign' He replied: 'Your sign is that you shall not speak to people for three nights being without fault'\n",
        "TRANSLATION_15": "He said, “My Lord, give me a sign.” He said, “Your sign is that you will not speak to the people for three nights straight.”\n",
        "TRANSLATION_16": "[Zechariah] said, \"My Lord, make for me a sign.\" He said, \"Your sign is that you will not speak to the people for three nights, [being] sound.\"\n",
        "TRANSLATION_17": "[19:10] He said, ‘Lord, appoint for me some sign’, namely, some indication of my wife’s becoming pregnant. Said He, ‘Your sign, for this, is that you shall not speak to people, that is, that you [should] refrain from speaking to them, but not [from speaking] the remembrance of God, exalted be He, for three nights, that is, together with the days thereof, as [stated] in [sūrat] Āl ‘Imrān, ‘for three days’ [Q. 3:41], while [you are] in sound health’ (sawiyyan, a circumstantial qualifier referring to the subject of the verb tukallima, ‘you shall [not] speak’) in other words, despite there being no defect [in you].\n",
        "TRANSLATION_18": "(He said: My Lord!) my Lord! (Appoint for me some token) some sign when my wife becomes pregnant. (He said: Thy token is that thou, with no bodily defect, shall not speak unto mankind) will not be able to speak to people (three nights) without suffering dumbness or any other illness.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "19:10",
            "3:41",
            "114:1",
            "83:6",
            "27:82",
            "13:1",
            "6:76",
            "17:79",
            "6:27",
            "34:36"
        ],
        "BIBLE": [
            "prophets:i%20kings:12:7",
            "prophets:i%20samuel:8:11",
            "prophets:ii%20kings:5:20",
            "prophets:ezekiel:37:3",
            "prophets:judges:13:10",
            "torah:numbers:22:20",
            "writings:daniel:6:13",
            "torah:numbers:14:11",
            "prophets:ezekiel:33:12",
            "torah:deuteronomy:27:9"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:11",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:4:9"
        ]
    }
}