{
    "VERSE": "19:11",
    "ARABIC": "فَخَرَجَ عَلَىٰ قَوْمِهِۦ مِنَ ٱلْمِحْرَابِ فَأَوْحَىٰٓ إِلَيْهِمْ أَن سَبِّحُوا۟ بُكْرَةً وَعَشِيًّا",
    "ENGLISH": {
        "TRANSLATION_0": "He came out to his people from the Upper Room and gestured to them to glorify Allah in the morning and the evening.",
        "TRANSLATION_1": "So he came from the chamber to his people, and suggested to them (by signs) to sing the praises of the Lord morning and evening.\n",
        "TRANSLATION_2": "Thereupon Zechariah came out from the sanctuary and directed his people by gestures to extol His glory by day and by night.\n",
        "TRANSLATION_3": "Zachariah came out to his people from place of worship and inspired them to glorify the Lord both in the morning and evening.\n",
        "TRANSLATION_4": "He therefore emerged upon his people from the mosque, and told them through gestures, “Keep proclaiming the Purity (of your Lord) morning and evening.”\n",
        "TRANSLATION_5": "Then he came out to his people from the Mihrab and he indicated to them by signs to glorify [Allah] in the morning and in the afternoon.\n",
        "TRANSLATION_6": "So he went forth to his people from his place of worship, then he made known to them that they should glorify (Allah) morning and evening.\n",
        "TRANSLATION_7": "So he came forth unto his people from the Sanctuary, then he made signal to them, 'Give you glory at dawn and evening.'\n",
        "TRANSLATION_8": "Then he came forth unto his people from the sanctuary, and signified to them: Glorify your Lord at break of day and fall of night.\n",
        "TRANSLATION_9": "Then Zachariah came forth from the shrine to his people and told them by signs to glorify the Lord morning and evening.\n",
        "TRANSLATION_10": "Then he came forth to his people from the sanctuary, and he beckoned unto them. hallow your Lord morning and evening.\n",
        "TRANSLATION_11": "So he emerged before his people from the Temple, and signalled to them that they should glorify [Allah] morning and evening.\n",
        "TRANSLATION_12": "So Zakariya came out to his people from him chamber: He told them by signs to celebrate Allah's praises in the morning and in the evening.\n",
        "TRANSLATION_13": "Then he came out to his people from Al-Mihrab (a praying place or a private room, etc.), he told them by signs to glorify Allah's Praises in the morning and in the afternoon.\n",
        "TRANSLATION_14": "Then he came out from the Sanctuary to his nation, and gestured to them to exalt (their Lord) at the dawn and at the evening.\n",
        "TRANSLATION_15": "And he came out to his people, from the sanctuary, and signaled to them to praise morning and evening.\n",
        "TRANSLATION_16": "So he came out to his people from the prayer chamber and signaled to them to exalt [Allah] in the morning and afternoon.\n",
        "TRANSLATION_17": "[19:11] So he emerged before his people from the sanctuary, that is, from the temple — they had been waiting for him to open it in order to perform [their] prayers therein after his command, as was the custom — and signalled, indicated, to them, ‘Make glorifications, perform prayers, at morning and evening’, at the beginning of the day and [at] its end, as per usual. He then realised, upon his being prevented from speaking to them, that she was pregnant with John.\n",
        "TRANSLATION_18": "326 (Then he came forth unto his people from the sanctuary) from the prayer hall, (and signified to them) he made gestures to them; and it is also said: he wrote on the ground to them: (Glorify your Lord at break of day and fall of night) pray to Him in the morning and at night.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "19:11",
            "37:115",
            "28:21",
            "26:10",
            "29:30",
            "43:54",
            "23:106",
            "11:74",
            "68:50",
            "23:94"
        ],
        "BIBLE": [
            "prophets:judges:20:26",
            "torah:deuteronomy:1:33",
            "prophets:i%20samuel:9:13",
            "torah:exodus:13:3",
            "prophets:ezekiel:36:20",
            "writings:ii%20chronicles:6:20",
            "torah:leviticus:9:23",
            "prophets:i%20kings:8:29",
            "prophets:hosea:6:3",
            "torah:deuteronomy:1:31"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:13",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:3:2"
        ]
    }
}