{
    "VERSE": "19:12",
    "ARABIC": "يَٰيَحْيَىٰ خُذِ ٱلْكِتَٰبَ بِقُوَّةٍ وَءَاتَيْنَٰهُ ٱلْحُكْمَ صَبِيًّا",
    "ENGLISH": {
        "TRANSLATION_0": "'Yahya, take hold of the Book with vigour.' We gave him judgement while still a child,",
        "TRANSLATION_1": "(We said:) \"O John, hold fast to the Book;\" and We gave him wisdom right from boyhood,\n",
        "TRANSLATION_2": "O John! Hold the Book with all your strength.\" We had bestowed wisdom upon him while he was still a child;\n",
        "TRANSLATION_3": "We commanded John, Zachariah's son, to follow the guidance of the Lord with due steadfastness. To John We gave knowledge and wisdom to John during his childhood.\n",
        "TRANSLATION_4": "“O Yahya – hold the Book firmly”; and We gave him Prophethood in his infancy. (Prophet Yahya was only 2 years old at that time.)\n",
        "TRANSLATION_5": "(It was said to his son): \"O Yahya! Hold fast to the Scripture.\" And We gave him wisdom while yet a child.\n",
        "TRANSLATION_6": "O Yahya! take hold of the Book with strength, and We granted him wisdom while yet a child\n",
        "TRANSLATION_7": "O John, take the Book forcefully'; and We gave him judgment, yet a little child,\n",
        "TRANSLATION_8": "(And it was said unto his son): O John! Hold fast the Scripture. And we gave him wisdom when a child,\n",
        "TRANSLATION_9": "To John We said, \"Hold fast the Book,\" and while he was still a child, We bestowed upon him wisdom,\n",
        "TRANSLATION_10": "O Yahya! se hold fast the book. And We vouchsafed unto him wisdom, while yet a child.\n",
        "TRANSLATION_11": "‘O John!’ [We said,] ‘Hold on with power to the Book!’ And We gave him judgement while still a child,\n",
        "TRANSLATION_12": "(To his son came the command): \"O Yahya! take hold of the Book with might\": and We gave him Wisdom even as a youth,\n",
        "TRANSLATION_13": "(It was said to his son): \"O Yahya (John)! Hold fast the Scripture [the Taurat (Torah)].\" And We gave him wisdom while yet a child.\n",
        "TRANSLATION_14": "(We said): 'O John, hold fast to the Book', and We bestowed on him judgment while yet a child\n",
        "TRANSLATION_15": "“O John, hold on to the Scripture firmly,” and We gave him wisdom in his youth.\n",
        "TRANSLATION_16": "[Allah] said, \"O John, take the Scripture with determination.\" And We gave him judgement [while yet] a boy\n",
        "TRANSLATION_17": "[19:12] And two years after his birth, God, exalted be He, said to him: ‘O John! Hold on to the Scripture, namely, the Torah, firmly’, earnestly. And We gave him judgement, prophethood, while still a child, a three-year old;\n",
        "TRANSLATION_18": "(0 John!) Allah said to John when he reached the age of puberty and understanding: (Hold the Scripture) act according to that which is in the Torah, seriously and diligently. (And We gave him) and We gave John (wisdom) understanding and knowledge (when a child) when he was still young.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "19:12",
            "3:48",
            "6:89",
            "2:121",
            "28:52",
            "6:114",
            "31:2",
            "45:29",
            "37:117",
            "37:157"
        ],
        "BIBLE": [
            "prophets:joshua:17:4",
            "prophets:ii%20kings:2:3",
            "writings:daniel:7:22",
            "prophets:i%20kings:14:8",
            "prophets:ii%20kings:2:5",
            "prophets:joshua:23:1",
            "torah:exodus:34:32",
            "torah:deuteronomy:3:18",
            "writings:ii%20chronicles:7:3",
            "torah:deuteronomy:1:3"
        ]
    }
}