{
    "VERSE": "19:13",
    "ARABIC": "وَحَنَانًا مِّن لَّدُنَّا وَزَكَوٰةً وَكَانَ تَقِيًّا",
    "ENGLISH": {
        "TRANSLATION_0": "and tenderness and purity from Us - he had taqwa -",
        "TRANSLATION_1": "And compassion from Us, and goodness. So he was devout,\n",
        "TRANSLATION_2": "and We also endowed him with tenderness and purity, and he was exceedingly pious\n",
        "TRANSLATION_3": "We gave him compassion and purity. He was a pious human being,\n",
        "TRANSLATION_4": "And compassion from Ourselves, and chastity; and he was extremely pious.\n",
        "TRANSLATION_5": "And Hananan from Us, and Zakatan, and he was pious,\n",
        "TRANSLATION_6": "And tenderness from Us and purity, and he was one who guarded (against evil),\n",
        "TRANSLATION_7": "and a tenderness from Us, and purity; and he was godfearing,\n",
        "TRANSLATION_8": "And compassion from Our presence, and purity; and he was devout,\n",
        "TRANSLATION_9": "and tenderness [of heart] and purity. He was pious,\n",
        "TRANSLATION_10": "And tenderness from Our presence and purity, and he was God-fearing.\n",
        "TRANSLATION_11": "and a compassion and purity from Us. He was Godwary\n",
        "TRANSLATION_12": "And piety (for all creatures) as from Us, and purity: He was devout,\n",
        "TRANSLATION_13": "And (made him) sympathetic to men as a mercy (or a grant) from Us, and pure from sins [i.e. Yahya (John)] and he was righteous,\n",
        "TRANSLATION_14": "and tenderness from Us and purity, and he was cautious;\n",
        "TRANSLATION_15": "And tenderness from Us, and innocence. He was devout.\n",
        "TRANSLATION_16": "And affection from Us and purity, and he was fearing of Allah\n",
        "TRANSLATION_17": "[19:13] and compassion, a mercy for mankind, from Us, from Our presence, and purity, a charity for them, and he was God-fearing — it is related that he never committed a sin, nor contemplated [committing] one;\n",
        "TRANSLATION_18": "(And compassion from Our presence) and We gave him compassion from Our presence towards his parents, (and purity) as an act of charity to them; it is also said that this means: We gave righteousness with regard to his religion; (and he was devout) he was obedient to his Lord,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "19:13",
            "2:43",
            "23:4",
            "19:31",
            "19:63",
            "20:99",
            "18:81",
            "21:17",
            "92:17",
            "27:6"
        ],
        "BIBLE": [
            "prophets:i%20kings:5:9",
            "prophets:i%20kings:3:9",
            "writings:ecclesiastes:1:13",
            "writings:proverbs:9:9",
            "writings:psalms:119:34",
            "writings:psalms:136:21",
            "prophets:ezekiel:3:20",
            "torah:exodus:2:21",
            "prophets:ezekiel:20:11",
            "torah:deuteronomy:16:17"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:6"
        ]
    }
}