{
    "VERSE": "19:19",
    "ARABIC": "قَالَ إِنَّمَآ أَنَا۠ رَسُولُ رَبِّكِ لِأَهَبَ لَكِ غُلَٰمًا زَكِيًّا",
    "ENGLISH": {
        "TRANSLATION_0": "He said, 'I am only your Lord's messenger so that He can give you a pure boy.'",
        "TRANSLATION_1": "He replied: \"I am only a messenger from your Lord (sent) to bestow a good son on you.\"\n",
        "TRANSLATION_2": "He said: \"I am just a message-bearer of your Lord, I have come to grant you a most pure boy.\"\n",
        "TRANSLATION_3": "He said, \"I am the Messengers of your Lord. I have come to give you a purified son\".\n",
        "TRANSLATION_4": "He said, “I am indeed one sent by your Lord; so that I may give you a chaste son.”\n",
        "TRANSLATION_5": "(The angel) said: \"I am only a messenger from your Lord, (to announce) to you the gift of a righteous son.\"\n",
        "TRANSLATION_6": "He said: I am only a messenger of your Lord: That I will give you a pure boy.\n",
        "TRANSLATION_7": "If thou fearest God... He said, 'I am but a messenger come from thy Lord, to give thee a boy most pure.\n",
        "TRANSLATION_8": "He said: I am only a messenger of thy Lord, that I may bestow on thee a faultless son.\n",
        "TRANSLATION_9": "I am only the messenger of your Lord,\" he replied. \"I shall bestow upon you the gift of a son endowed with purity.\"\n",
        "TRANSLATION_10": "He said: I am but a meenger from thy Lord that I may bestow on thee a boy pure.\n",
        "TRANSLATION_11": "He said, ‘I am only a messenger of your Lord that I may give you a pure son.’\n",
        "TRANSLATION_12": "He said: \"Nay, I am only a messenger from thy Lord, (to announce) to thee the gift of a holy son.\n",
        "TRANSLATION_13": "(The angel) said: \"I am only a Messenger from your Lord, (to announce) to you the gift of a righteous son.\"\n",
        "TRANSLATION_14": "I am the Messenger of your Lord' he replied, 'and have come to give you a pure boy'\n",
        "TRANSLATION_15": "He said, “I am only the messenger of your Lord, to give you the gift of a pure son.”\n",
        "TRANSLATION_16": "He said, \"I am only the messenger of your Lord to give you [news of] a pure boy.\"\n",
        "TRANSLATION_17": "[19:19]   He said, ‘I am only a messenger of your Lord, that I may give you a boy [who shall be] pure’, in [his] prophethood.\n",
        "TRANSLATION_18": "(He said) Gabriel said to her: (I am only a messenger of thy Lord, that I may bestow on thee) that Allah may bestow on you (a faultless son) a righteous son.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "19:19",
            "69:10",
            "7:104",
            "7:68",
            "19:47",
            "26:16",
            "26:162",
            "26:143",
            "26:125",
            "26:107"
        ],
        "BIBLE": [
            "torah:genesis:27:20",
            "torah:numbers:10:29",
            "torah:numbers:22:20",
            "torah:exodus:3:13",
            "torah:deuteronomy:26:3",
            "prophets:judges:13:8",
            "torah:deuteronomy:1:20",
            "prophets:i%20kings:20:5",
            "prophets:i%20kings:17:18",
            "torah:genesis:42:10"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:2:5"
        ]
    }
}