{
    "VERSE": "19:22",
    "ARABIC": "فَحَمَلَتْهُ فَٱنتَبَذَتْ بِهِۦ مَكَانًا قَصِيًّا",
    "ENGLISH": {
        "TRANSLATION_0": "So she conceived him and withdrew with him to a distant place.",
        "TRANSLATION_1": "When she conceived him she went away to a distant place.\n",
        "TRANSLATION_2": "Then she conceived him and withdrew with him to a far-off place.\n",
        "TRANSLATION_3": "She conceived the child and retreated with him to a distant and solitary place.\n",
        "TRANSLATION_4": "So she conceived him, and she went away with him to a far place.\n",
        "TRANSLATION_5": "So she conceived him, and she withdrew with him to a remote place.\n",
        "TRANSLATION_6": "So she conceived him; then withdrew herself with him to a remote place.\n",
        "TRANSLATION_7": "So she conceived him, and withdrew with him to a distant place.\n",
        "TRANSLATION_8": "And she conceived him, and she withdrew with him to a far place.\n",
        "TRANSLATION_9": "So she conceived him and withdrew with him to a distant place.\n",
        "TRANSLATION_10": "hen she conceived him, and she retired with him to a place far-off.\n",
        "TRANSLATION_11": "Thus she conceived him, then withdrew with him to a distant place.\n",
        "TRANSLATION_12": "So she conceived him, and she retired with him to a remote place.\n",
        "TRANSLATION_13": "So she conceived him, and she withdrew with him to a far place (i.e. Bethlehem valley about 4-6 miles from Jerusalem).\n",
        "TRANSLATION_14": "Thereupon she carried him, and retired to a far off place.\n",
        "TRANSLATION_15": "So she carried him, and secluded herself with him in a remote place.\n",
        "TRANSLATION_16": "So she conceived him, and she withdrew with him to a remote place.\n",
        "TRANSLATION_17": "[19:22] Thus she conceived him and then withdrew, retreated, with him to a distant place, far from her family.\n",
        "TRANSLATION_18": "(And she, conceived him) she bore him for nine months; and it is also said: her pregnancy lasted one day, (and she withdrew with him) i.e. to deliver him (to a place) far away from people.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "19:22",
            "19:57",
            "34:51",
            "7:107",
            "51:39",
            "26:45",
            "43:54",
            "26:32",
            "20:58",
            "39:39"
        ],
        "BIBLE": [
            "writings:i%20chronicles:5:41",
            "writings:nehemiah:7:6",
            "writings:ezra:2:1",
            "prophets:jeremiah:27:22",
            "prophets:i%20samuel:30:2",
            "prophets:isaiah:46:7",
            "prophets:jeremiah:41:14",
            "writings:ii%20chronicles:14:14",
            "prophets:jeremiah:29:14",
            "torah:deuteronomy:14:24"
        ]
    }
}