{
    "VERSE": "19:23",
    "ARABIC": "فَأَجَآءَهَا ٱلْمَخَاضُ إِلَىٰ جِذْعِ ٱلنَّخْلَةِ قَالَتْ يَٰلَيْتَنِى مِتُّ قَبْلَ هَٰذَا وَكُنتُ نَسْيًا مَّنسِيًّا",
    "ENGLISH": {
        "TRANSLATION_0": "The pains of labour drove her to the trunk of a date-palm. She said, 'Oh if only I had died before this time and was something discarded and forgotten!'",
        "TRANSLATION_1": "The birth pangs led her to the trunk of a date-palm tree. \"Would that I had died before this,\" she said, \"and become a thing forgotten, unremembered.\"\n",
        "TRANSLATION_2": "Then the birth pangs drove her to the trunk of a palm-tree and she said: \"Oh, would that I had died before this and had been all forgotten.\"\n",
        "TRANSLATION_3": "When she started to experience (the pain of) of childbirth labor, by the trunk of a palm tree in sadness she said, \"Would that I had died long before and passed into oblivion.\"\n",
        "TRANSLATION_4": "Then the pangs of childbirth brought her to the base of the palm-tree; she said, “Oh, if only had I died before this and had become forgotten, unremembered.”\n",
        "TRANSLATION_5": "And the pains of childbirth drove her to the trunk of a date palm. She said: \"Would that I had died before this, and had been forgotten and out of sight!\"\n",
        "TRANSLATION_6": "And the throes (of childbirth) compelled her to betake herself to the trunk of a palm tree. She said: Oh, would that I had died before this, and had been a thing quite forgotten!\n",
        "TRANSLATION_7": "And the birthpangs surprised her by the trunk of the palm-tree. She said, 'Would I had died ere this, and become a thing forgotten!'\n",
        "TRANSLATION_8": "And the pangs of childbirth drove her unto the trunk of the palm-tree. She said: Oh, would that I had died ere this and had become a thing of naught, forgotten!\n",
        "TRANSLATION_9": "The pains of labour drove her to the trunk of a date-palm. She said, \"Oh, if only I had died before this and passed into oblivion!\"\n",
        "TRANSLATION_10": "Then the birth-pangs drave her to the trunk of a palm- tree; she said: would that had died afore this and become forgotten, lost in oblivion!\n",
        "TRANSLATION_11": "The birth pangs brought her to the trunk of a date palm. She said, ‘I wish I had died before this and become a forgotten thing, beyond recall.’\n",
        "TRANSLATION_12": "And the pains of childbirth drove her to the trunk of a palm-tree: She cried (in her anguish): \"Ah! would that I had died before this! would that I had been a thing forgotten and out of sight!\"\n",
        "TRANSLATION_13": "And the pains of childbirth drove her to the trunk of a date-palm. She said: \"Would that I had died before this, and had been forgotten and out of sight!\"\n",
        "TRANSLATION_14": "And when the birthpangs came upon her by the trunk of a palmtree, she said: 'Oh, would that I had died before this and become a thing forgotten'\n",
        "TRANSLATION_15": "The labor-pains came upon her, by the trunk of a palm-tree. She said, “I wish I had died before this, and been completely forgotten.”\n",
        "TRANSLATION_16": "And the pains of childbirth drove her to the trunk of a palm tree. She said, \"Oh, I wish I had died before this and was in oblivion, forgotten.\"\n",
        "TRANSLATION_17": "[19:23] And the birth pangs, the pains of childbirth, brought her to the trunk of the palm-tree, that she may support herself against it, and then she gave birth: the conception, formation [of the foetus] and delivery [all] took place within one hour. She said, ‘O (yā is [used] to call attention [to something]) would that I had died before this, affair, and become a forgotten thing, beyond recall!’, a thing abandoned which no one knows or mentions.\n",
        "TRANSLATION_18": "(And the pangs of childbirth drove her unto the trunk of the palm-tree) a dry palm-tree. (She said: Oh, would that I had died ere this) this child; and it is said that this means: before this day (and had become a thing of naught, forgotten) an abandoned thing which is never mentioned! And it is also said that this means: a still born child.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "19:23",
            "19:25",
            "11:49",
            "27:42",
            "20:71",
            "69:9",
            "33:49",
            "10:91",
            "2:21",
            "32:14"
        ],
        "BIBLE": [
            "torah:genesis:22:1",
            "torah:genesis:35:17",
            "prophets:i%20samuel:5:10",
            "prophets:i%20samuel:25:37",
            "prophets:i%20kings:21:13",
            "torah:exodus:13:17",
            "torah:genesis:43:2",
            "writings:i%20chronicles:17:1",
            "torah:genesis:22:20",
            "writings:i%20chronicles:17:3"
        ]
    }
}