{
    "VERSE": "19:27",
    "ARABIC": "فَأَتَتْ بِهِۦ قَوْمَهَا تَحْمِلُهُۥ قَالُوا۟ يَٰمَرْيَمُ لَقَدْ جِئْتِ شَيْـًٔا فَرِيًّا",
    "ENGLISH": {
        "TRANSLATION_0": "She brought him to her people, carrying him. They said, 'Maryam! You have done an unthinkable thing!",
        "TRANSLATION_1": "Then she brought the child to her people. They exclaimed: \"O Mary, you have done a most astonishing thing!\n",
        "TRANSLATION_2": "Then she came to her people, carrying her baby. They said: \"O Mary! You have committed a monstrous thing.\n",
        "TRANSLATION_3": "She took him to her people and they said, \"Mary, this is indeed an strange thing.\n",
        "TRANSLATION_4": "So carrying him in her arms, she brought him to her people; they said, “O Maryam, you have indeed committed a great evil!”\n",
        "TRANSLATION_5": "Then she brought him to her people, carrying him. They said: \"O Mary! Indeed you have brought a thing Fariy.\"\n",
        "TRANSLATION_6": "And she came to her people with him, carrying him (with her). They said: O Marium! surely you have done a strange thing.\n",
        "TRANSLATION_7": "Then she brought the child to her folk carrying him; and they said, 'Mary, thou hast surely committed a monstrous thing!\n",
        "TRANSLATION_8": "Then she brought him to her own folk, carrying him. They said: O Mary! Thou hast come with an amazing thing.\n",
        "TRANSLATION_9": "Carrying her child, she brought him to her people. They said, \"O Mary, you have indeed done something terrible!\n",
        "TRANSLATION_10": "Then she brought him to her nation carrying him. They said: Maryam! assuredly thou hast brought a thing unheard Of.\n",
        "TRANSLATION_11": "Then carrying him she brought him to her people. They said, ‘O Mary, you have certainly come up with an odd thing!\n",
        "TRANSLATION_12": "At length she brought the (babe) to her people, carrying him (in her arms). They said: \"O Mary! truly an amazing thing hast thou brought!\n",
        "TRANSLATION_13": "Then she brought him (the baby) to her people, carrying him. They said: \"O Mary! Indeed you have brought a thing Fariya (an unheard mighty thing).\n",
        "TRANSLATION_14": "She came to her nation, carrying him; and they said: 'O Mary, you have committed a monstrous thing.\n",
        "TRANSLATION_15": "Then she came to her people, carrying him. They said, “O Mary, you have done something terrible.\n",
        "TRANSLATION_16": "Then she brought him to her people, carrying him. They said, \"O Mary, you have certainly done a thing unprecedented.\n",
        "TRANSLATION_17": "[19:27] Then, carrying him, she brought him to her folk (tahmiluhu, ‘carrying him’, a circumstantial qualifier), and they saw him, and they said, ‘O Mary, truly you have done a curious thing!, an astounding [thing], for you have begotten a son without [his having] a father.\n",
        "TRANSLATION_18": "(Then she brought him) i.e. Jesus (to her own folk, carrying him) when he was forty days old. (They said: Mary! thou hast come with an amazing thing) you have come with an abominable act.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "19:27",
            "5:68",
            "11:57",
            "23:46",
            "43:54",
            "29:35",
            "46:25",
            "7:93",
            "54:6",
            "10:84"
        ],
        "BIBLE": [
            "torah:genesis:50:25",
            "torah:numbers:11:12",
            "prophets:jeremiah:39:14",
            "torah:exodus:13:19",
            "writings:ii%20chronicles:28:8",
            "prophets:i%20kings:20:33",
            "prophets:i%20kings:22:26",
            "prophets:ezekiel:17:12",
            "writings:ii%20chronicles:18:25",
            "writings:i%20chronicles:21:11"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:2",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:1"
        ]
    }
}