{
    "VERSE": "19:32",
    "ARABIC": "وَبَرًّۢا بِوَٰلِدَتِى وَلَمْ يَجْعَلْنِى جَبَّارًا شَقِيًّا",
    "ENGLISH": {
        "TRANSLATION_0": "and to show devotion to my mother. He has not made me insolent or arrogant.",
        "TRANSLATION_1": "And be dutiful to my mother. He has not made me haughty or rebellious.\n",
        "TRANSLATION_2": "and has made me dutiful to my mother. He has not made me oppressive, nor bereft of God's blessings.\n",
        "TRANSLATION_3": "He has commanded me to be good to my parents and has not made me an arrogant rebellious person.\n",
        "TRANSLATION_4": "“And has made me good to my mother and not made me forceful, ill-fated.”\n",
        "TRANSLATION_5": "And to be dutiful to my mother, and made me not arrogant, unblessed.\"\n",
        "TRANSLATION_6": "And dutiful to my mother, and He has not made me insolent, unblessed;\n",
        "TRANSLATION_7": "and likewise to cherish my mother; He has not made me arrogant, unprosperous.\n",
        "TRANSLATION_8": "And (hath made me) dutiful toward her who bore me, and hath not made me arrogant, unblest.\n",
        "TRANSLATION_9": "He has made me dutiful toward my mother, and He has not made me arrogant or wicked.\n",
        "TRANSLATION_10": "And dutecus Unto my mother, and hath not made me high- handed, unblest.\n",
        "TRANSLATION_11": "and to be good to my mother, and He has not made me self-willed and wretched.\n",
        "TRANSLATION_12": "(He) hath made me kind to my mother, and not overbearing or miserable;\n",
        "TRANSLATION_13": "And dutiful to my mother, and made me not arrogant, unblest.\n",
        "TRANSLATION_14": "(He has made me) kind to my mother; He has not made me arrogant, unprosperous.\n",
        "TRANSLATION_15": "And kind to my mother, and He did not make me a disobedient rebel.\n",
        "TRANSLATION_16": "And [made me] dutiful to my mother, and He has not made me a wretched tyrant.\n",
        "TRANSLATION_17": "[19:32] and [He has made me] dutiful towards my mother (barran, in the accusative because of the implicit [verb] ja‘alanī, ‘He has made me’). And He has not made me arrogant, haughty, wretched, disobedient to his Lord.\n",
        "TRANSLATION_18": "(And (hath made me) dutiful towards her who bore me) and kind to my mother, (and hath not made me arrogant) in the practice of religion, ready to hurt when angry, (unblest) and has not made me disobedient to Him.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "19:32",
            "19:14",
            "26:130",
            "90:3",
            "19:48",
            "50:45",
            "23:106",
            "14:15",
            "87:11",
            "34:35"
        ],
        "BIBLE": [
            "torah:genesis:2:18",
            "torah:deuteronomy:1:11",
            "torah:leviticus:8:34",
            "torah:deuteronomy:4:23",
            "prophets:jeremiah:16:20",
            "prophets:ii%20samuel:23:5",
            "writings:job:8:5",
            "torah:leviticus:16:34",
            "writings:psalms:119:98",
            "torah:exodus:35:10"
        ]
    }
}