{
    "VERSE": "19:33",
    "ARABIC": "وَٱلسَّلَٰمُ عَلَىَّ يَوْمَ وُلِدتُّ وَيَوْمَ أَمُوتُ وَيَوْمَ أُبْعَثُ حَيًّا",
    "ENGLISH": {
        "TRANSLATION_0": "Peace be upon me the day I was born, and the day I die and the day I am raised up again alive.'",
        "TRANSLATION_1": "There was peace on me the day I was born, and will be the day I die, and on the day I will be raised from the dead.\"\n",
        "TRANSLATION_2": "Peace be upon me the day I was born and the day I will die, and the day I will be raised up alive.\"\n",
        "TRANSLATION_3": "I was born with peace and I shall die and be brought to life again with peace.\"\n",
        "TRANSLATION_4": "“And peace is upon me the day I was born, and on the day I shall taste death, and on the day I will be raised alive.”\n",
        "TRANSLATION_5": "And Salam (peace) be upon me the day I was born, and the day I die, and the day I shall be raised alive!\"\n",
        "TRANSLATION_6": "And peace on me on the day I was born, and on the day I die, and on the day I am raised to life.\n",
        "TRANSLATION_7": "Peace be upon me, the day I was born, and the day I die, and the day I am raised up alive!'\n",
        "TRANSLATION_8": "Peace on me the day I was born, and the day I die, and the day I shall be raised alive!\n",
        "TRANSLATION_9": "Blessed was I on the day I was born, and blessed I shall be on the day I die and on the day I am raised to life again.\"\n",
        "TRANSLATION_10": "And peace be on me the day was born and the day die and the day I shall be raised up alive.\n",
        "TRANSLATION_11": "Peace to me the day I was born, and the day I die, and the day I am raised alive.’\n",
        "TRANSLATION_12": "So peace is on me the day I was born, the day that I die, and the day that I shall be raised up to life (again)\"!\n",
        "TRANSLATION_13": "And Salam (peace) be upon me the day I was born, and the day I die, and the day I shall be raised alive!\"\n",
        "TRANSLATION_14": "Peace be upon me on the day I was born, and on the day I die; and on the day when I shall be raised up alive'\n",
        "TRANSLATION_15": "So Peace is upon me the day I was born, and the day I die, and the Day I get resurrected alive.”\n",
        "TRANSLATION_16": "And peace is on me the day I was born and the day I will die and the day I am raised alive.\"\n",
        "TRANSLATION_17": "[19:33] And peace, from God, be upon me the day I was born, and the day I die, and the day I shall be raised alive!’ — the same is being said about him as [was said above] regarding the lord John. God, exalted be He, says:\n",
        "TRANSLATION_18": "(Peace on me the day I was born) safety to me from Satan's touch when I was born, (and the day I die) and safety to me from the compression of the grave when I die, (and the day I shall be raised alive) when I am resurrected alive from the grave!\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "19:33",
            "19:15",
            "37:181",
            "36:59",
            "50:34",
            "79:6",
            "40:51",
            "20:101",
            "30:14",
            "40:32"
        ],
        "BIBLE": [
            "prophets:hosea:6:2",
            "writings:job:3:3",
            "writings:proverbs:3:2",
            "prophets:micah:5:4",
            "prophets:jeremiah:20:14",
            "prophets:judges:16:30",
            "prophets:judges:2:18",
            "prophets:i%20kings:14:14",
            "torah:genesis:48:15",
            "prophets:ii%20samuel:12:18"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:4:8",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:3:2"
        ]
    }
}