{
    "VERSE": "19:34",
    "ARABIC": "ذَٰلِكَ عِيسَى ٱبْنُ مَرْيَمَ قَوْلَ ٱلْحَقِّ ٱلَّذِى فِيهِ يَمْتَرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "That is 'Isa, son of Maryam, the word of truth about which they are in doubt.",
        "TRANSLATION_1": "This was Jesus, son of Mary: A true account they contend about.\n",
        "TRANSLATION_2": "This is Jesus, the son of Mary; and this is the truth about him concerning which they are in doubt.\n",
        "TRANSLATION_3": "Such was the true story of Jesus, the son of Mary, about which they dispute bitterly.\n",
        "TRANSLATION_4": "This is Eisa (Jesus), the son of Maryam; a true statement, in which they doubt.\n",
        "TRANSLATION_5": "Such is `Isa, son of Maryam. Qawlal-Haqq [it is a statement of truth] about which they doubt (or dispute).\n",
        "TRANSLATION_6": "Such is Isa, son of Marium; (this is) the saying of truth about which they dispute.\n",
        "TRANSLATION_7": "That is Jesus, son of Mary, in word of truth, concerning which they are doubting.\n",
        "TRANSLATION_8": "Such was Jesus, son of Mary: (this is) a statement of the truth concerning which they doubt.\n",
        "TRANSLATION_9": "Such was Jesus, the son of Mary. That is the whole truth, about which they still dispute:\n",
        "TRANSLATION_10": "Such is 'lsa, son of Maryam: this Is the word of truth wherein they are doubting.\n",
        "TRANSLATION_11": "That is Jesus, son of Mary, a Word of the Real concerning whom they are in doubt.\n",
        "TRANSLATION_12": "Such (was) Jesus the son of Mary: (it is) a statement of truth, about which they (vainly) dispute.\n",
        "TRANSLATION_13": "Such is 'Iesa (Jesus), son of Maryam (Mary). (it is) a statement of truth, about which they doubt (or dispute).\n",
        "TRANSLATION_14": "Such was (Prophet) Jesus, the son of Mary. A saying of truth, concerning what they doubt.\n",
        "TRANSLATION_15": "That is Jesus son of Mary—the Word of truth about which they doubt.\n",
        "TRANSLATION_16": "That is Jesus, the son of Mary - the word of truth about which they are in dispute.\n",
        "TRANSLATION_17": "[19:34] That is Jesus, son of Mary, a statement of truth (read qawlu’l-haqqi, as the predicate of an implied subject, in other words, ‘the statement of the son of Mary [is a statement of truth]’; or read qawla’l-haqqi, because of [it being the object of] an implied [verb] qultu, ‘I say’, meaning, ‘[I say] a statement of truth’) concerning which they are in doubt (yamtarūna, derives from [the infinitive] al-mirya) — they are the Christians, who say, ‘Indeed Jesus is the son of God’; [but] they lie.\n",
        "TRANSLATION_18": "(Such was Jesus, son of Mary) such was the event of Jesus, son of Mary: ((this is) a statement of the Truth concerning which they doubt) i.e. the Christians, for some of them said he is Allah, and some said he was the son of Allah and some of them claimed he was Allah's partner.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "19:34",
            "27:76",
            "30:38",
            "2:146",
            "11:79",
            "5:78",
            "24:49",
            "10:103",
            "40:75",
            "16:57"
        ],
        "BIBLE": [
            "prophets:jeremiah:37:6",
            "prophets:haggai:1:3",
            "prophets:zechariah:1:1",
            "prophets:ii%20samuel:24:11",
            "prophets:jeremiah:49:34",
            "prophets:haggai:2:10",
            "prophets:jeremiah:7:4",
            "prophets:ii%20kings:20:19",
            "prophets:i%20kings:16:1",
            "prophets:jeremiah:44:1"
        ]
    }
}