{
    "VERSE": "19:36",
    "ARABIC": "وَإِنَّ ٱللَّهَ رَبِّى وَرَبُّكُمْ فَٱعْبُدُوهُ هَٰذَا صِرَٰطٌ مُّسْتَقِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "'Allah is my Lord and your Lord so worship Him. This is a straight path.'",
        "TRANSLATION_1": "(Jesus only said:) \"Surely God is my Lord and your Lord, so worship Him. This is the straight path.\"\n",
        "TRANSLATION_2": "(Jesus had said): \"Indeed Allah is my Lord and your Lord, so serve Him alone. This is the Straight Way.\"\n",
        "TRANSLATION_3": "(Baby Jesus said), \"Worship God who is my Lord as well as yours. This is the straight path\".\n",
        "TRANSLATION_4": "And said Eisa, “Indeed Allah is my Lord and your Lord – therefore worship Him; this is the Straight Path.”\n",
        "TRANSLATION_5": "[`Isa said]: \"And verily, Allah is my Lord and your Lord. So worship Him. That is the straight path.\"\n",
        "TRANSLATION_6": "And surely Allah is my Lord and your Lord, therefore serve Him; this is the right path.\n",
        "TRANSLATION_7": "Surely God is my Lord, and your Lord; So serve you Him. This is a straight path.\n",
        "TRANSLATION_8": "And lo! Allah is my Lord and your Lord. So serve Him. That is the right path.\n",
        "TRANSLATION_9": "God is my Lord and your Lord, so worship Him alone. That is the right path.\n",
        "TRANSLATION_10": "And verily Allah is my Lord and your Lord; so worship Him; this is a way straight.\n",
        "TRANSLATION_11": "[And Jesus said,] ‘Indeed Allah is my Lord and your Lord. So worship Him. This is a straight path.’\n",
        "TRANSLATION_12": "Verily Allah is my Lord and your Lord: Him therefore serve ye: this is a Way that is straight.\n",
        "TRANSLATION_13": "['Iesa (Jesus) said]: \"And verily Allah is my Lord and your Lord. So worship Him (Alone). That is the Straight Path. (Allah's Religion of Islamic Monotheism which He did ordain for all of His Prophets).\" [Tafsir At-Tabari]\n",
        "TRANSLATION_14": "Indeed, Allah is my Lord and your Lord therefore worship Him. That is the Straight Path.\n",
        "TRANSLATION_15": "“God is my Lord and your Lord, so worship Him. That is a straight path.”\n",
        "TRANSLATION_16": "[Jesus said], \"And indeed, Allah is my Lord and your Lord, so worship Him. That is a straight path.\"\n",
        "TRANSLATION_17": "[19:36] And indeed God is my Lord and your Lord. So worship Him (read [the introductory particle] as anna, with an implicit [preceding] udhkur, ‘mention’; or read [it] as inna, with an implicit [preceding] qul, ‘say’, [a reading] indicated by [the fact that God says elsewhere] ‘I only said to them that which You commanded me: “Worship God, my Lord and your Lord” ’ [Q. 5:117]). This, that has been mentioned, is a straight path, a route leading to Paradise.\n",
        "TRANSLATION_18": "When Jesus brought the Message to his people, he said: I am the servant of Allah and His messiah, (And lo! Allah is my Lord) my Creator and Provider (and your Lord) your Creator and Provider. (So serve Him) profess His divine Oneness. (That) the monotheism with which I am enjoining you (is the right path) an established religion with which Allah is pleased, i.e. Islam.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "19:36",
            "43:64",
            "3:51",
            "11:56",
            "26:126",
            "26:108",
            "26:110",
            "26:179",
            "26:131",
            "26:163"
        ],
        "BIBLE": [
            "prophets:i%20kings:13:26",
            "torah:deuteronomy:8:19",
            "prophets:ii%20kings:17:12",
            "prophets:joshua:24:19",
            "torah:exodus:10:8",
            "prophets:jeremiah:5:19",
            "prophets:jeremiah:5:4",
            "torah:deuteronomy:10:12",
            "prophets:joshua:24:16",
            "prophets:i%20kings:22:54"
        ]
    }
}