{
    "VERSE": "19:39",
    "ARABIC": "وَأَنذِرْهُمْ يَوْمَ ٱلْحَسْرَةِ إِذْ قُضِىَ ٱلْأَمْرُ وَهُمْ فِى غَفْلَةٍ وَهُمْ لَا يُؤْمِنُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Warn them of the Day of Bitter Regret when the affair will be resolved. But they take no notice. They have no iman.",
        "TRANSLATION_1": "Warn them of that day of pining when all matters will have been settled, though they would still be unaware and unbelieving (of the truth).\n",
        "TRANSLATION_2": "(O Muhammad), warn those who are steeped in heedlessness and are obstinately rejecting the truth that the Day shall come when things will be finally decided and they shall be left with utter remorse.\n",
        "TRANSLATION_3": "Warn them of the woeful day when the final decree will be issued; they are neglectful and faithless.\n",
        "TRANSLATION_4": "And warn them of the Day of Regret when the matter will have been decided; and they are in neglect, and they do not accept faith.\n",
        "TRANSLATION_5": "And warn them of the Day of grief and regrets, when the case has been decided, while (now) they are in a state of carelessness, and they believe not.\n",
        "TRANSLATION_6": "And warn them of the day of intense regret, when the matter shall have been decided; and they are (now) in negligence and they do not believe.\n",
        "TRANSLATION_7": "Warn thou them of the day of anguish, when the matter shall be determined, and they yet heedless and unbelieving.\n",
        "TRANSLATION_8": "And warn them of the Day of anguish when the case hath been decided. Now they are in a state of carelessness, and they believe not.\n",
        "TRANSLATION_9": "Warn them of [the coming of] the Day of Remorse, when everything will have been decided, while they are heedless and do not believe.\n",
        "TRANSLATION_10": "And warn thou them of thy Day of Sighing when the affair shall have been decreed while yet they are in negligence and are not believing.\n",
        "TRANSLATION_11": "Warn them of the Day of Regret, when the matter will be decided, while they are [yet] heedless and do not have faith.\n",
        "TRANSLATION_12": "But warn them of the Day of Distress, when the matter will be determined: for (behold,) they are negligent and they do not believe!\n",
        "TRANSLATION_13": "And warn them (O Muhammad SAW) of the Day of grief and regrets, when the case has been decided, while (now) they are in a state of carelessness, and they believe not.\n",
        "TRANSLATION_14": "Warn them of that Day of Anguish, when the matter is determined whilst heedlessly they disbelieve.\n",
        "TRANSLATION_15": "And warn them of the Day of Regret, when the matter will be concluded. Yet they are heedless, and they do not believe.\n",
        "TRANSLATION_16": "And warn them, [O Muhammad], of the Day of Regret, when the matter will be concluded; and [yet], they are in [a state of] heedlessness, and they do not believe.\n",
        "TRANSLATION_17": "[19:39] And warn them, threaten, O Muhammad (s), the disbelievers of Mecca, of the Day of Regret, namely, the Day of Resurrection, on which the sinner will regret not having been virtuous in [the life of] this world, when the matter will be decided, for them thereupon, that they be chastised, while they, in this world, are [yet] heedless, of it, and do not believe, in it [the Day of Resurrection].\n",
        "TRANSLATION_18": "(And warn them) Muhammad (of the Day of anguish) of the Day of regret (when the case hath been decided) when the reckoning is over and the people of Paradise enter Paradise and the people of hell enter hell and Death is slain. (Now they are in a state of carelessness) in a state of ignorance and blindness 329 concerning it, (and they believe not) in Muhammad (pbuh) in the Qur'an or in resurrection after death.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "19:39",
            "21:27",
            "21:1",
            "26:87",
            "32:29",
            "26:151",
            "82:19",
            "12:92",
            "28:41",
            "12:102"
        ],
        "BIBLE": [
            "prophets:jeremiah:16:19",
            "writings:daniel:6:13",
            "prophets:ii%20kings:20:17",
            "prophets:isaiah:39:6",
            "writings:nehemiah:2:17",
            "prophets:i%20kings:18:36",
            "writings:ruth:3:18",
            "prophets:isaiah:25:1",
            "prophets:micah:7:15",
            "prophets:jeremiah:50:31"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:2:1"
        ]
    }
}