{
    "VERSE": "19:4",
    "ARABIC": "قَالَ رَبِّ إِنِّى وَهَنَ ٱلْعَظْمُ مِنِّى وَٱشْتَعَلَ ٱلرَّأْسُ شَيْبًا وَلَمْ أَكُنۢ بِدُعَآئِكَ رَبِّ شَقِيًّا",
    "ENGLISH": {
        "TRANSLATION_0": "and said, 'My Lord, my bones have lost their strength and my head is crowned with white, but in calling on You, My Lord, I have never been disappointed.",
        "TRANSLATION_1": "And said: \"O my Lord, my bones decay, my head is white and hoary, yet in calling You, O Lord, I have never been deprived.\n",
        "TRANSLATION_2": "He said: \"Lord! My bones have grown feeble and my head is glistening with age; yet, never have my prayers to You, my Lord, been unfruitful.\n",
        "TRANSLATION_3": "and said, \"My Lord, my bones have become feeble and my hair has turned white with age. Yet I have never been deprived in receiving from You the answer to my prayers.\n",
        "TRANSLATION_4": "He submitted, “O my Lord – my bones have become weak and old age shines forth from my head, and O my Lord, I have never been disappointed in my prayer to you.”\n",
        "TRANSLATION_5": "He said: \"My Lord! Indeed my bones have grown feeble, and gray hair has Ashta`al on my head, and I have never been unblessed in my invocation to You, O my Lord!\"\n",
        "TRANSLATION_6": "He said: My Lord! surely my bones are weakened and my head flares with hoariness, and, my Lord! I have never been unsuccessful in my prayer to Thee:\n",
        "TRANSLATION_7": "saying, 'O my Lord, behold the bones within me are feeble and my head is all aflame with hoariness. And in calling on Thee, my Lord, I have never been hitherto unprosperous.\n",
        "TRANSLATION_8": "Saying: My Lord! Lo! the bones of me wax feeble and my head is shining with grey hair, and I have never been unblest in prayer to Thee, my Lord.\n",
        "TRANSLATION_9": "Lord, my bones have weakened and my head has turned hoary with age, but never, Lord, have I been disappointed in my prayer to you:\n",
        "TRANSLATION_10": "He said: O my Lord! verily the bones of me have waxen feeble, and the head is glistening with hoariness, and have not yet been in my prayer to thee, my Lord, unblest.\n",
        "TRANSLATION_11": "He said, ‘My Lord! Indeed my bones have become feeble, and my head has turned white with age, yet never have I, my Lord, been disappointed in supplicating You!\n",
        "TRANSLATION_12": "Praying: \"O my Lord! infirm indeed are my bones, and the hair of my head doth glisten with grey: but never am I unblest, O my Lord, in my prayer to Thee!\n",
        "TRANSLATION_13": "Saying: \"My Lord! Indeed my bones have grown feeble, and grey hair has spread on my head, And I have never been unblest in my invocation to You, O my Lord!\n",
        "TRANSLATION_14": "saying: 'O my Lord, my bones are enfeebled, and my head glows silver with age. Yet, never Lord, have I been unblessed in prayer to You.\n",
        "TRANSLATION_15": "He said, “My Lord, my bones have become feeble, and my hair is aflame with gray, and never, Lord, have I been disappointed in my prayer to you.\n",
        "TRANSLATION_16": "He said, \"My Lord, indeed my bones have weakened, and my head has filled with white, and never have I been in my supplication to You, my Lord, unhappy.\n",
        "TRANSLATION_17": "[19:4] He said, ‘My Lord, truly the bones, all [the bones], within me have become feeble, weak, and my head is alight with grey hair (shayban, a specification derived from the subject of the verb in other words, hoariness has spread throughout his hairs just as a spark of fire spreads through firewood) and I wish to supplicate to you, and I have never been in my supplications to You, my Lord, unsuccessful, that is, [I have never been] disappointed, in the past, so do not disappoint me in what follows.\n",
        "TRANSLATION_18": "(Saying: My Lord!) my Lord! (Lo! the bones of me wax feeble) my body has become weak (and my head is shining with grey hair, and I have never been unblest in prayer to You, my Lord) he said: my prayers were never rejected by You, my Lord.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "19:4",
            "19:48",
            "56:96",
            "56:74",
            "69:52",
            "3:38",
            "14:40",
            "36:27",
            "32:12",
            "40:27"
        ],
        "BIBLE": [
            "prophets:joshua:23:2",
            "writings:ezra:9:6",
            "prophets:ii%20samuel:1:16",
            "prophets:judges:11:8",
            "prophets:i%20samuel:10:1",
            "prophets:jeremiah:31:7",
            "writings:daniel:1:10",
            "prophets:judges:16:17",
            "prophets:ii%20kings:9:3",
            "torah:deuteronomy:33:20"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:3:8",
            "Sefer%20Yetzirah:3:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:4:12"
        ]
    }
}