{
    "VERSE": "19:41",
    "ARABIC": "وَٱذْكُرْ فِى ٱلْكِتَٰبِ إِبْرَٰهِيمَ إِنَّهُۥ كَانَ صِدِّيقًا نَّبِيًّا",
    "ENGLISH": {
        "TRANSLATION_0": "Mention Ibrahim in the Book. He was a true man and a Prophet.",
        "TRANSLATION_1": "Commemorate Abraham in the Book: He was upright, a prophet.\n",
        "TRANSLATION_2": "(O Muhammad), recite in the Book the account of Abraham. Most surely he was a man of truth, a Prophet.\n",
        "TRANSLATION_3": "Mention the story of Abraham, the truthful Prophet, in the Book (the Quran)\n",
        "TRANSLATION_4": "And remember Ibrahim in the Book; he was very truthful, a Herald of the Hidden (a Prophet).\n",
        "TRANSLATION_5": "And mention in the Book, Ibrahim. Verily, he was a man of truth, a Prophet.\n",
        "TRANSLATION_6": "And mention Ibrahim in the Book; surely he was a truthful man, a prophet.\n",
        "TRANSLATION_7": "And mention in the Book Abraham; surely he was a true man, a Prophet.\n",
        "TRANSLATION_8": "And make mention (O Muhammad) in the Scripture of Abraham. Lo! he was a saint, a prophet.\n",
        "TRANSLATION_9": "Also recount the story of Abraham in the Book. He was a man of truth, and a prophet.\n",
        "TRANSLATION_10": "And mention thou in the Book Ibrahim; verily he was a man of truth, a prophet.\n",
        "TRANSLATION_11": "And mention in the Book Abraham. Indeed, he was a truthful man and a prophet.\n",
        "TRANSLATION_12": "(Also mention in the Book (the story of) Abraham: He was a man of Truth, a prophet.\n",
        "TRANSLATION_13": "And mention in the Book (the Quran) Ibrahim (Abraham). Verily! He was a man of truth, a Prophet.\n",
        "TRANSLATION_14": "Mention in the Book Abraham; He was truthful and a Prophet.\n",
        "TRANSLATION_15": "And mention in the Scripture Abraham. He was a man of truth, a prophet.\n",
        "TRANSLATION_16": "And mention in the Book [the story of] Abraham. Indeed, he was a man of truth and a prophet.\n",
        "TRANSLATION_17": "[19:41] And mention, to them, in the Book Abraham, that is, [mention] his tale. Indeed he was a truthful one ([the intensive form siddīq] means ‘extremely truthful’), a prophet (the following [statement] substitutes for the [preceding] predicate).\n",
        "TRANSLATION_18": "(And make mention (0 Muhammad) in the Scripture of Abraham) the event of Abraham. (Lo! he was a saint) he believed in faith, (a prophet) sent to people, informing them on behalf of his Lord.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "19:41",
            "19:56",
            "19:51",
            "19:54",
            "19:30",
            "37:112",
            "29:27",
            "57:26",
            "37:117",
            "68:37"
        ],
        "BIBLE": [
            "writings:psalms:77:12",
            "prophets:jeremiah:16:20",
            "writings:psalms:71:16",
            "prophets:isaiah:38:16",
            "torah:genesis:13:16",
            "prophets:isaiah:26:13",
            "torah:deuteronomy:32:26",
            "writings:job:8:6",
            "torah:exodus:30:32",
            "torah:exodus:23:32"
        ]
    }
}