{
    "VERSE": "19:42",
    "ARABIC": "إِذْ قَالَ لِأَبِيهِ يَٰٓأَبَتِ لِمَ تَعْبُدُ مَا لَا يَسْمَعُ وَلَا يُبْصِرُ وَلَا يُغْنِى عَنكَ شَيْـًٔا",
    "ENGLISH": {
        "TRANSLATION_0": "Remember when he said to his father, 'Father, why do you worship what can neither hear nor see and is not of any use to you at all?",
        "TRANSLATION_1": "Remember, when he said to his father: \"O my father, why do you worship that which can neither hear nor see nor even profit you the least?\n",
        "TRANSLATION_2": "(And remind people) when he said to his father: \"Father! Why do you worship that which neither sees nor hears, and which can be of no avail to you?\n",
        "TRANSLATION_3": "who asked his father, \"Father, why do you worship something that can neither hear nor see nor help you at all?\n",
        "TRANSLATION_4": "When he said to his father,* “O my father – why do you worship one which neither hears nor sees, and cannot benefit you in any way?” (* His uncle Azar.)\n",
        "TRANSLATION_5": "When he said to his father: \"O my father! Why do you worship that which hears not, sees not and cannot avail you in anything\"\n",
        "TRANSLATION_6": "When he said to his father; O my father! why do you worship what neither hears nor sees, nor does it avail you in the least:\n",
        "TRANSLATION_7": "When he said to his father, 'Father, why worshippest thou that which neither hears nor sees, nor avails thee anything?\n",
        "TRANSLATION_8": "When he said unto his father: O my father! Why worshippest thou that which heareth not nor seeth, nor can in aught avail thee?\n",
        "TRANSLATION_9": "He said to his father, \"Why do you worship something that can neither hear nor see nor benefit you in any way?\n",
        "TRANSLATION_10": "Recall what time he said unto his father:, O my father! wherefore worshippest thou that which heareth not and seeth not, nor availeth thee at all?\n",
        "TRANSLATION_11": "When he said to his father, ‘Father! Why do you worship that which neither hears nor sees, and is of no avail to you in any way?\n",
        "TRANSLATION_12": "Behold, he said to his father: \"O my father! why worship that which heareth not and seeth not, and can profit thee nothing?\n",
        "TRANSLATION_13": "When he said to his father: \"O my father! Why do you worship that which hears not, sees not and cannot avail you in anything?\n",
        "TRANSLATION_14": "He said to his father: 'O father, why worship that which can neither see nor hear, nor helps you in anything?\n",
        "TRANSLATION_15": "He said to his father, “O my father, why do you worship what can neither hear, nor see, nor benefit you in any way?\n",
        "TRANSLATION_16": "[Mention] when he said to his father, \"O my father, why do you worship that which does not hear and does not see and will not benefit you at all?\n",
        "TRANSLATION_17": "[19:42] When he said to his father, Āzar, ‘O my father! (the [final] tā’ here [of abati] has replaced the [possessive] yā’ of [genitive] annexation [sc. of yā abī]; the two, however, are never used together) — he [Abraham’s father] used to worship idols. Why do you worship that which neither hears nor sees, and is of no avail to you, suffices you [not], in any way? whether in [terms of] benefit or harm.\n",
        "TRANSLATION_18": "(When he said unto his father) Azar: (0 my father! Why worshippest thou) beside Allah (that which heareth not) when called upon (nor seeth) when you worship it, (nor can in aught avail thee) from Allah's chastisement?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "19:42",
            "2:170",
            "26:70",
            "18:70",
            "37:85",
            "7:191",
            "80:18",
            "5:104",
            "26:86",
            "12:11"
        ],
        "BIBLE": [
            "torah:exodus:18:14",
            "prophets:ii%20kings:20:5",
            "torah:numbers:14:14",
            "torah:exodus:32:9",
            "prophets:joshua:22:28",
            "prophets:i%20kings:13:12",
            "torah:genesis:24:56",
            "prophets:judges:14:2",
            "prophets:i%20samuel:20:2",
            "writings:i%20chronicles:29:10"
        ]
    }
}