{
    "VERSE": "19:45",
    "ARABIC": "يَٰٓأَبَتِ إِنِّىٓ أَخَافُ أَن يَمَسَّكَ عَذَابٌ مِّنَ ٱلرَّحْمَٰنِ فَتَكُونَ لِلشَّيْطَٰنِ وَلِيًّا",
    "ENGLISH": {
        "TRANSLATION_0": "Father, I am afraid that a punishment from the All-Merciful will afflict you, and turn you into a comrade of Shaytan.'",
        "TRANSLATION_1": "O my father, I fear lest a punishment from Ar-Rahman should befall you, and you should become a friend of the Devil.\"\n",
        "TRANSLATION_2": "Father, I fear that a punishment from the Most Compassionate Lord might strike you and you may end up as one of Satan's companions?\"\n",
        "TRANSLATION_3": "Father, I am afraid that the Beneficent God's torment will strike you and you will become a friend of satan.\"\n",
        "TRANSLATION_4": "“O my father, I fear that a punishment from the Most Gracious may reach you, so you would become a companion of the devil.”\n",
        "TRANSLATION_5": "O my father! Verily, I fear lest a torment from the Most Gracious should overtake you, so that you become a companion of Shaytan.\"\n",
        "TRANSLATION_6": "O my father! surely I fear that a punishment from the Beneficent Allah should afflict you so that you should be a friend of the Shaitan.\n",
        "TRANSLATION_7": "Father, I fear that some chastisement from the All-merciful will smite thee, so that thou becomest a friend to Satan.\n",
        "TRANSLATION_8": "O my father! Lo! I fear lest a punishment from the Beneficent overtake thee so that thou become a comrade of the devil.\n",
        "TRANSLATION_9": "Father, indeed I fear lest a punishment from the Gracious One afflict you, and you become a friend of Satan.\"\n",
        "TRANSLATION_10": "O My father! verily I fear that there may touch thee a torment from the Compassionate so that thou become to the Satan a companin.\n",
        "TRANSLATION_11": "Father! I am indeed afraid that a punishment from the All-beneficent will befall you, and you will become Satan’s accomplice.’\n",
        "TRANSLATION_12": "O my father! I fear lest a Penalty afflict thee from (Allah) Most Gracious, so that thou become to Satan a friend.\"\n",
        "TRANSLATION_13": "O my father! Verily! I fear lest a torment from the Most Beneficent (Allah) overtake you, so that you become a companion of Shaitan (Satan) (in the Hell-fire).\" [Tafsir Al-Qurtubi]\n",
        "TRANSLATION_14": "Father, I fear that the punishment of the Merciful will fall upon you and you will become a guide of satan'\n",
        "TRANSLATION_15": "O my father, I fear that a punishment from the Most Gracious will afflict you, and you become an ally of the devil.”\n",
        "TRANSLATION_16": "O my father, indeed I fear that there will touch you a punishment from the Most Merciful so you would be to Satan a companion [in Hellfire].\"\n",
        "TRANSLATION_17": "[19:45] O my father! I do fear lest a chastisement from the Compassionate One should befall you, if you do not repent, and then you become an ally of Satan, an assistant and a comrade [of his] in the Fire.\n",
        "TRANSLATION_18": "(0 my father! Lo! I fear) I know (lest a punishment from the Beneficent overtake thee) if you do not believe in Him (so that thou become a comrade of the devil) a companion of the devil in hell.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "19:45",
            "19:44",
            "16:63",
            "19:43",
            "3:175",
            "43:36",
            "19:5",
            "19:91",
            "12:78",
            "14:22"
        ],
        "BIBLE": [
            "prophets:jonah:4:2",
            "writings:psalms:86:15",
            "writings:i%20chronicles:29:10",
            "writings:psalms:103:13",
            "writings:ii%20chronicles:20:6",
            "prophets:i%20samuel:20:13",
            "torah:genesis:26:24",
            "prophets:isaiah:30:18",
            "torah:genesis:28:13",
            "prophets:i%20samuel:2:30"
        ]
    }
}