{
    "VERSE": "19:46",
    "ARABIC": "قَالَ أَرَاغِبٌ أَنتَ عَنْ ءَالِهَتِى يَٰٓإِبْرَٰهِيمُ لَئِن لَّمْ تَنتَهِ لَأَرْجُمَنَّكَ وَٱهْجُرْنِى مَلِيًّا",
    "ENGLISH": {
        "TRANSLATION_0": "He said, 'Do you forsake my gods, Ibrahim? If you do not stop, I will stone you. Keep away from me for a good long time.'",
        "TRANSLATION_1": "He said: \"Are you averse to my gods, O Abraham? If you do not desist, I shall have you stoned to death. So go away for a while from me.\"\n",
        "TRANSLATION_2": "The father said: \"Abraham, have you turned away from my gods? If you do not give this up, I shall stone you to death. Now begone from me forever.\"\n",
        "TRANSLATION_3": "His father replied, \"Abraham, are you telling me to give-up my gods? If you will not stop this, I shall stone you to death. Leave my house and do not come back again\".\n",
        "TRANSLATION_4": "He said, “What! You turn away from my Gods, O Ibrahim? If you do not desist, I will certainly stone you, and keep no relation with me for a long while.”\n",
        "TRANSLATION_5": "He (the father) said: \"Do you revile my gods, O Ibrahim If you stop not (this), I will La'arjumannak. So get away from me Maliyan.\"\n",
        "TRANSLATION_6": "He said: Do you dislike my gods, O Ibrahim? If you do not desist I will certainly revile you, and leave me for a time.\n",
        "TRANSLATION_7": "Said he, 'What, art thou shrinking from my gods, Abraham? Surely, if thou givest not over, I shall stone thee; so forsake me now for some while.'\n",
        "TRANSLATION_8": "He said: Rejectest thou my gods, O Abraham? If thou cease not, I shall surely stone thee. Depart from me a long while!\n",
        "TRANSLATION_9": "[His father] said, \"Do you reject my deities, Abraham? If you do not desist, I shall surely stone you to death. Keep out of my way!\"\n",
        "TRANSLATION_10": "He said: art thou averse to my gods, O Ibrahim? If thou desistest not, surely I shall stone thee; and depart from me for ever so long.\n",
        "TRANSLATION_11": "He said, ‘Abraham! Are you renouncing my gods? If you do not desist, I will stone you. Get away from me for a long while.’\n",
        "TRANSLATION_12": "(The father) replied: \"Dost thou hate my gods, O Abraham? If thou forbear not, I will indeed stone thee: Now get away from me for a good long while!\"\n",
        "TRANSLATION_13": "He (the father) said: \"Do you reject my gods, O Ibrahim (Abraham)? If you stop not (this), I will indeed stone you. So get away from me safely before I punish you.\"\n",
        "TRANSLATION_14": "But he replied: 'Do you shrink away from my gods, Abraham? Surely, if you do not cease I will stone you, so leave me for awhile'\n",
        "TRANSLATION_15": "He said, “Are you renouncing my gods, O Abraham? If you do not desist, I will stone you. So leave me alone for a while.”\n",
        "TRANSLATION_16": "[His father] said, \"Have you no desire for my gods, O Abraham? If you do not desist, I will surely stone you, so avoid me a prolonged time.\"\n",
        "TRANSLATION_17": "[19:46] He said, ‘Are you renouncing my gods, O Abraham?, so that you are denouncing them [in this way]? If you do not desist, from criticising them, I shall surely assail you, with stones, or with evil words, so beware of me; and stay away from me for a long time’.\n",
        "TRANSLATION_18": "(He said) Azar said: (Rejectest thou my gods) do you reject the worship of my deities, (0 Abraham? If thou cease not) from what you say, (I shall surely stone thee) I will kill you. (Depart from me a long while!) stay away from me as long as you live; it is also said that this means: leave me and do not speak with me for a long time.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "19:46",
            "11:30",
            "37:56",
            "21:62",
            "12:91",
            "3:158",
            "10:84",
            "18:69",
            "26:29",
            "21:68"
        ],
        "BIBLE": [
            "prophets:ezekiel:33:11",
            "prophets:jeremiah:2:27",
            "torah:genesis:24:23",
            "torah:genesis:31:30",
            "torah:genesis:38:16",
            "torah:genesis:24:40",
            "prophets:i%20samuel:20:12",
            "prophets:i%20kings:2:26",
            "prophets:ezekiel:18:30",
            "writings:i%20chronicles:21:17"
        ]
    }
}