{
    "VERSE": "19:47",
    "ARABIC": "قَالَ سَلَٰمٌ عَلَيْكَ سَأَسْتَغْفِرُ لَكَ رَبِّىٓ إِنَّهُۥ كَانَ بِى حَفِيًّا",
    "ENGLISH": {
        "TRANSLATION_0": "He said, 'Peace be upon you. I will ask my Lord to forgive you. He has always honoured me.",
        "TRANSLATION_1": "He answered: \"Peace be on you. I will seek forgiveness of my Lord for you. He has been gracious to me.\n",
        "TRANSLATION_2": "Abraham answered: \"Peace be upon you. I shall seek pardon for you from my Lord. My Lord has always been kind to Me.\n",
        "TRANSLATION_3": "Abraham said, \"Peace be with you. I shall ask my Lord to forgive you; He has been gracious to me.\n",
        "TRANSLATION_4": "He said, “Stop it – peace be upon you; I shall seek forgiveness for you from my Lord; indeed He is very kind to me.”\n",
        "TRANSLATION_5": "Ibrahim said: \"Peace be on you! I will ask forgiveness of my Lord for you. Verily, He is unto me Hafiyyan.\n",
        "TRANSLATION_6": "He said: Peace be on you, I will pray to my Lord to forgive you; surely He is ever Affectionate to me:\n",
        "TRANSLATION_7": "He said, 'Peace be upon thee! I will ask my Lord to forgive thee; surely He is ever gracious to me.\n",
        "TRANSLATION_8": "He said: Peace be unto thee! I shall ask forgiveness of my Lord for thee. Lo! He was ever gracious unto me.\n",
        "TRANSLATION_9": "Abraham replied, \"Peace be on you: I will pray to my Lord for your forgiveness, He has indeed been gracious to me,\n",
        "TRANSLATION_10": "Ibrahim said: peace be on thee! anon shall ask forgiveness of my Lord for thee; verily He is unto me ever so soicitous.\n",
        "TRANSLATION_11": "He said, ‘Peace be to you! I shall plead with my Lord to forgive you. Indeed, He is gracious to me.\n",
        "TRANSLATION_12": "Abraham said: \"Peace be on thee: I will pray to my Lord for thy forgiveness: for He is to me Most Gracious.\n",
        "TRANSLATION_13": "Ibrahim (Abraham) said: \"Peace be on you! I will ask Forgiveness of my Lord for you. Verily! He is unto me, Ever Most Gracious.\n",
        "TRANSLATION_14": "Peace be on you' he (Abraham) said, 'I shall call upon my Lord to forgive you, for to me He has been gracious.\n",
        "TRANSLATION_15": "He said, “Peace be upon you. I will ask my Lord to forgive you; He has been Kind to me.\n",
        "TRANSLATION_16": "[Abraham] said, \"Peace will be upon you. I will ask forgiveness for you of my Lord. Indeed, He is ever gracious to me.\n",
        "TRANSLATION_17": "[19:47] He said, ‘Peace be to you, from me — in other words, I shall not cause you any harm. I shall ask forgiveness of my Lord for you. Truly He is ever gracious to me (hafiyyan, from hafiyyun, meaning bārrun, ‘kind’) answering my prayers. And indeed he [Abraham] fulfilled his above-mentioned promise [as described] in [sūrat] al-Shu‘arā’, And forgive my father [Q. 26:86]; but this was before it became clear to him that he [Abraham’s father] was an enemy of God, as mentioned in [sūrat] Barā’a [Q. 9:114].\n",
        "TRANSLATION_18": "(He said) Abraham said: (Peace be unto thee! I shall ask forgiveness of my Lord for thee) I will pray to Allah for you. (Lo! He was ever gracious unto me) He knows, if He wants to answer my prayer.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "19:47",
            "99:5",
            "37:99",
            "37:84",
            "16:99",
            "36:58",
            "36:25",
            "17:65",
            "12:98",
            "10:96"
        ],
        "BIBLE": [
            "prophets:i%20samuel:1:17",
            "torah:genesis:41:16",
            "torah:exodus:4:1",
            "prophets:ii%20samuel:14:18",
            "torah:numbers:32:31",
            "prophets:ii%20kings:6:3",
            "prophets:i%20kings:22:15",
            "prophets:ii%20samuel:15:21",
            "prophets:i%20kings:18:24",
            "prophets:jeremiah:14:13"
        ]
    }
}