{
    "VERSE": "19:48",
    "ARABIC": "وَأَعْتَزِلُكُمْ وَمَا تَدْعُونَ مِن دُونِ ٱللَّهِ وَأَدْعُوا۟ رَبِّى عَسَىٰٓ أَلَّآ أَكُونَ بِدُعَآءِ رَبِّى شَقِيًّا",
    "ENGLISH": {
        "TRANSLATION_0": "I will separate myself from you and all you call upon besides Allah and I will call upon my Lord. It may well be that, in calling on my Lord, I will not be disappointed.'",
        "TRANSLATION_1": "I will leave you and those you invoke apart from God, and pray to my Lord. Haply in praying to my Lord I will not be deprived.\"\n",
        "TRANSLATION_2": "I shall withdraw from you and all that you call upon beside Allah. I shall only call upon my Lord. I trust the prayer to my Lord will not go unanswered.\"\n",
        "TRANSLATION_3": "I shall stay away from you and what you worship instead of God. I worship my Lord and hope that my prayers will not be ignored.\"\n",
        "TRANSLATION_4": "And I shall remain separated from you and all that you worship other than Allah and shall worship my Lord; possibly, by worshipping my Lord, I will not be amongst the unfortunate.”\n",
        "TRANSLATION_5": "And I shall turn away from you and from those whom you invoke besides Allah. And I shall call upon my Lord, and I certainly hope that I shall not be unblessed in my invocation to my Lord.\"\n",
        "TRANSLATION_6": "And I will withdraw from you and what you call on besides Allah, and I will call upon my Lord; may be I shall not remain unblessed in calling upon my Lord.\n",
        "TRANSLATION_7": "Now I will go apart from you and that you call upon, apart from God; I will call upon my Lord, and haply I shall not be, in calling upon my Lord, unprosperous.\n",
        "TRANSLATION_8": "I shall withdraw from you and that unto which ye pray beside Allah, and I shall pray unto my Lord. It may be that, in prayer unto my Lord, I shall not be unblest.\n",
        "TRANSLATION_9": "I will separate myself from you and from whatever you call upon besides God, and I will pray only to my Lord. It may well be that, in calling on my Lord, I will not be disappointed.\"\n",
        "TRANSLATION_10": "And I renounce you and that unto which ye call beside Allah; and I shall call unto my Lord; belike in calling unto my Lord I shall not be unblest.\n",
        "TRANSLATION_11": "I dissociate myself from you and whatever you invoke besides Allah. I will supplicate my Lord. Hopefully, I will not be disappointed in supplicating my Lord.’\n",
        "TRANSLATION_12": "And I will turn away from you (all) and from those whom ye invoke besides Allah: I will call on my Lord: perhaps, by my prayer to my Lord, I shall be not unblest.\"\n",
        "TRANSLATION_13": "And I shall turn away from you and from those whom you invoke besides Allah. And I shall call on my Lord; and I hope that I shall not be unblest in my invocation to my Lord.\"\n",
        "TRANSLATION_14": "Now I will go away from you and that you call upon, other than Allah. I will call on my Lord. Perhaps I shall not be unblessed in calling my Lord'\n",
        "TRANSLATION_15": "And I will withdraw from you, and from what you pray to instead of God. And I will pray to my Lord, and I hope I will not be disappointed in my prayer to my Lord.”\n",
        "TRANSLATION_16": "And I will leave you and those you invoke other than Allah and will invoke my Lord. I expect that I will not be in invocation to my Lord unhappy.\"\n",
        "TRANSLATION_17": "[19:48] And I shall shun you and that which you call upon, [that which] you worship, besides God. I will supplicate, I will worship, my Lord — hopefully in calling upon, in worshipping, my Lord I shall not be wretched’, as you have become wretched by your worship of idols.\n",
        "TRANSLATION_18": "(I shall withdraw from you) I will leave you (and that unto which ye pray beside Allah) of idols, (and I shall pray unto my Lord) I shall worship my Lord. (It may be that) 'may be' in connection with Allah denotes a requisite, (in prayer unto my Lord) in worship of my Lord, (I shall not be unblest) I shall not be rejected.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "19:48",
            "40:66",
            "25:55",
            "27:43",
            "21:66",
            "7:62",
            "11:34",
            "16:20",
            "18:38",
            "21:67"
        ],
        "BIBLE": [
            "prophets:jeremiah:35:17",
            "prophets:judges:16:28",
            "prophets:jeremiah:7:13",
            "prophets:isaiah:55:6",
            "torah:genesis:3:9",
            "torah:genesis:35:10",
            "torah:genesis:26:22",
            "torah:genesis:4:25",
            "torah:genesis:29:35",
            "prophets:jeremiah:42:2"
        ]
    }
}