{
    "VERSE": "19:50",
    "ARABIC": "وَوَهَبْنَا لَهُم مِّن رَّحْمَتِنَا وَجَعَلْنَا لَهُمْ لِسَانَ صِدْقٍ عَلِيًّا",
    "ENGLISH": {
        "TRANSLATION_0": "We endowed them with Our mercy and made them highly honoured.",
        "TRANSLATION_1": "And bestowed on them some of Our blessings, and gave them high renown.\n",
        "TRANSLATION_2": "and We bestowed on them Our mercy, and granted them a truly lofty renown.\n",
        "TRANSLATION_3": "We granted them Our blessing and high renown.\n",
        "TRANSLATION_4": "And We gave them Our mercy, and assigned for them a true and high repute.\n",
        "TRANSLATION_5": "And We gave them of Our mercy, and We granted them Sidqin `Aliyyan on the tongues.\n",
        "TRANSLATION_6": "And We granted to them of Our mercy, and We left (behind them) a truthful mention of eminence for them.\n",
        "TRANSLATION_7": "and We gave them of Our mercy, and We appointed unto them a tongue of truthfulness, sublime.\n",
        "TRANSLATION_8": "And we gave them of Our mercy, and assigned to them a high and true renown.\n",
        "TRANSLATION_9": "We granted them Our mercy and bestowed on them true and high renown.\n",
        "TRANSLATION_10": "And We bestowed on them of Our mercy, and We made for them a renown lofty.\n",
        "TRANSLATION_11": "And We gave them out of Our mercy, and conferred on them a worthy and lofty repute.\n",
        "TRANSLATION_12": "And We bestowed of Our Mercy on them, and We granted them lofty honour on the tongue of truth.\n",
        "TRANSLATION_13": "And We gave them of Our Mercy (a good provision in plenty), and We granted them honour on the tongues (of all the nations, i.e. everybody remembers them with a good praise).\n",
        "TRANSLATION_14": "and We gave them of Our Mercy and We appointed to them a truthful, highly sincere tongue,\n",
        "TRANSLATION_15": "And We gave them freely of Our mercy, and gave them a noble reputation of truth.\n",
        "TRANSLATION_16": "And We gave them of Our mercy, and we made for them a reputation of high honor.\n",
        "TRANSLATION_17": "[19:50] And We gave them, all three [of them], out of Our mercy, wealth and offspring, and We assigned for them a worthy repute [one] that is lofty, sublime, namely, [We assigned] fair praise [of them] among all the members of the [Abrahamic] religions.\n",
        "TRANSLATION_18": "(And We gave them of Our mercy) We gave him of Our bounty a righteous son and a lawful property, (and assigned to them a high and true renown) We favoured them with being praised by others.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "19:50",
            "26:84",
            "20:27",
            "10:86",
            "21:107",
            "21:75",
            "19:57",
            "21:86",
            "26:13",
            "19:53"
        ],
        "BIBLE": [
            "writings:psalms:136:21",
            "writings:ezra:3:11",
            "writings:psalms:106:7",
            "writings:ii%20chronicles:7:3",
            "writings:proverbs:8:29",
            "torah:deuteronomy:8:10",
            "torah:genesis:28:4",
            "prophets:ezekiel:20:25",
            "writings:psalms:106:41",
            "torah:deuteronomy:16:17"
        ]
    }
}