{
    "VERSE": "19:52",
    "ARABIC": "وَنَٰدَيْنَٰهُ مِن جَانِبِ ٱلطُّورِ ٱلْأَيْمَنِ وَقَرَّبْنَٰهُ نَجِيًّا",
    "ENGLISH": {
        "TRANSLATION_0": "We called out to him from the right hand side of the Mount and We brought him near in close communication.",
        "TRANSLATION_1": "We called him from the right side of the Mount, and brought him close for communion;\n",
        "TRANSLATION_2": "We called out to him from the right side of the Mount, and We drew him near to Us by communing to him in secret,\n",
        "TRANSLATION_3": "We called him from the right side of Mount Sinai and drew him close for communication.\n",
        "TRANSLATION_4": "We called him from the right side of the mountain Tur, and brought him close to reveal Our secret.\n",
        "TRANSLATION_5": "And We called him from the right side of the Mount (Tur), and made him draw near to Us for a talk with him.\n",
        "TRANSLATION_6": "And We called to him from the blessed side of the mountain, and We made him draw nigh, holding communion (with Us).\n",
        "TRANSLATION_7": "We called to him from the right side Of the Mount, and We brought him near in communion.\n",
        "TRANSLATION_8": "We called him from the right slope of the Mount, and brought him nigh in communion.\n",
        "TRANSLATION_9": "We called out to him from the right side of the mount and made him draw near to be in close communion with Us;\n",
        "TRANSLATION_10": "And We cried unto him from the right side of the mount, and We drew him nigh for whispering.\n",
        "TRANSLATION_11": "We called him from the right side of the Mount and We drew him near [to Ourselves] for confidential discourse.\n",
        "TRANSLATION_12": "And we called him from the right side of Mount (Sinai), and made him draw near to Us, for mystic (converse).\n",
        "TRANSLATION_13": "And We called him from the right side of the Mount, and made him draw near to Us for a talk with him [Musa (Moses)].\n",
        "TRANSLATION_14": "We called out to him from the right side of the mountain, and drew him near in (Divine) conversation.\n",
        "TRANSLATION_15": "And We called him from the right side of the Mount, and brought him near in communion.\n",
        "TRANSLATION_16": "And We called him from the side of the mount at [his] right and brought him near, confiding [to him].\n",
        "TRANSLATION_17": "[19:52] And We called him — with the words, ‘O Moses! Verily I am God’ [Q. 27:9] — from the right side of the Mount (al-Tūr, is [actually] the name of a mountain) that is, [from the side] to the right of Moses as he was approaching [the Mount] from Midian; and We brought him near in communion, as God, exalted be He, made him hear His speech.\n",
        "TRANSLATION_18": "(We called him from the right slope of the Mount) We called him from his right side at the mountain, (and brought him nigh in communion) and brought him very close to the extent that he heard the screeching of the pen; it is also said that this means: We spoke to him from a near distance.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "19:52",
            "69:45",
            "55:15",
            "20:80",
            "52:1",
            "52:49",
            "90:10",
            "37:28",
            "20:62",
            "15:27"
        ],
        "BIBLE": [
            "torah:exodus:2:10",
            "torah:leviticus:9:5",
            "torah:genesis:38:29",
            "torah:exodus:19:20",
            "writings:esther:5:2",
            "prophets:joshua:8:16",
            "torah:genesis:47:29",
            "torah:leviticus:10:5",
            "torah:genesis:39:14",
            "torah:genesis:19:5"
        ]
    }
}