{
    "VERSE": "19:53",
    "ARABIC": "وَوَهَبْنَا لَهُۥ مِن رَّحْمَتِنَآ أَخَاهُ هَٰرُونَ نَبِيًّا",
    "ENGLISH": {
        "TRANSLATION_0": "We endowed him with Our mercy, making his brother Harun a Prophet.",
        "TRANSLATION_1": "And bestowed on him his brother Aaron, a prophet, through Our benevolence.\n",
        "TRANSLATION_2": "and out of Our mercy We appointed his brother Aaron, a Prophet (that he may assist him).\n",
        "TRANSLATION_3": "Out of Our mercy We gave him his brother Aaron who himself was a Prophet.\n",
        "TRANSLATION_4": "And with Our mercy We bestowed upon him his brother Haroon, a Prophet.\n",
        "TRANSLATION_5": "And We granted him his brother Harun, (also) a Prophet, out of Our mercy.\n",
        "TRANSLATION_6": "And We gave to him out of Our mercy his brother Haroun a prophet.\n",
        "TRANSLATION_7": "And We gave him his brother Aaron, of Our mercy, a Prophet.\n",
        "TRANSLATION_8": "And We bestowed upon him of Our mercy his brother Aaron, a prophet (likewise).\n",
        "TRANSLATION_9": "and We gave him as his helper, out of Our mercy, his brother Aaron, having made him a prophet.\n",
        "TRANSLATION_10": "And We bestowed on him, out of Our mercy, his brother Harun, a prophet.\n",
        "TRANSLATION_11": "And We gave him out of Our mercy his brother Aaron, a prophet.\n",
        "TRANSLATION_12": "And, out of Our Mercy, We gave him his brother Aaron, (also) a prophet.\n",
        "TRANSLATION_13": "And We bestowed on him his brother Harun (Aaron), (also) a Prophet, out of Our Mercy.\n",
        "TRANSLATION_14": "From Our Mercy We gave him, his brother Aaron, a Prophet.\n",
        "TRANSLATION_15": "And We granted him, out of Our mercy, his brother Aaron, a prophet.\n",
        "TRANSLATION_16": "And We gave him out of Our mercy his brother Aaron as a prophet.\n",
        "TRANSLATION_17": "[19:53] And We gave him out of Our mercy, Our grace, his brother Aaron (Hārūn, either a substitution [for akhāhu, ‘his brother’], or an explicative supplement [thereof]), [likewise] a prophet (nabiyyan, a circumstantial qualifier, constituting the import of the ‘gift’ [to Moses], which was in response to his [Moses’s] request that He [God] send forth his brother with him; he [Aaron] was older in years than him).\n",
        "TRANSLATION_18": "(And We bestowed upon him of Our mercy) from Our blessing (his brother Aaron, a prophet (likewise)) a helping assistant.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "19:53",
            "7:151",
            "37:112",
            "21:75",
            "12:58",
            "21:86",
            "70:12",
            "26:36",
            "7:111",
            "20:30"
        ],
        "BIBLE": [
            "writings:psalms:136:21",
            "writings:psalms:78:62",
            "prophets:i%20kings:5:26",
            "torah:deuteronomy:3:15",
            "torah:numbers:18:29",
            "torah:genesis:25:5",
            "prophets:isaiah:47:6",
            "prophets:joshua:14:13",
            "writings:ii%20chronicles:33:10",
            "writings:psalms:106:15"
        ]
    }
}