{
    "VERSE": "19:54",
    "ARABIC": "وَٱذْكُرْ فِى ٱلْكِتَٰبِ إِسْمَٰعِيلَ إِنَّهُۥ كَانَ صَادِقَ ٱلْوَعْدِ وَكَانَ رَسُولًا نَّبِيًّا",
    "ENGLISH": {
        "TRANSLATION_0": "Mention Isma'il in the Book. He was true to his promise and was a Messenger and a Prophet.",
        "TRANSLATION_1": "Commemorate Ishmael in the Book. He was true of his promise, and a messenger, a prophet.\n",
        "TRANSLATION_2": "And recite in the Book the account of Ishmael. He was ever true to his promise, and was a Messenger, a Prophet.\n",
        "TRANSLATION_3": "Mention in the Book (the Quran) the story of Ishmael; he was true to his promise, a Messengers and a Prophet.\n",
        "TRANSLATION_4": "And remember Ismail in the Book; he was indeed true to his promise and was a Noble Messenger, a Prophet.\n",
        "TRANSLATION_5": "And mention in the Book, Isma`il. Verily, he was true to what he promised, and he was a Messenger, (and) a Prophet.\n",
        "TRANSLATION_6": "And mention Ismail in the Book; surely he was truthful in (his) promise, and he was an apostle, a prophet.\n",
        "TRANSLATION_7": "And mention in the Book Ishmael; he was true to his promise, and he was a Messenger, a Prophet.\n",
        "TRANSLATION_8": "And make mention in the Scripture of Ishmael. Lo! he was a keeper of his promise, and he was a messenger (of Allah), a prophet.\n",
        "TRANSLATION_9": "Tell also of Ishmael in the Book. He was true to his promise and was a messenger and a prophet.\n",
        "TRANSLATION_10": "And mention thou in the Book lsma'i; verily he was true in promise, and was apostle, prophet.\n",
        "TRANSLATION_11": "And mention in the Book Ishmael. Indeed, he was true to his promise, and an apostle and prophet.\n",
        "TRANSLATION_12": "Also mention in the Book (the story of) Isma'il: He was (strictly) true to what he promised, and he was a messenger (and) a prophet.\n",
        "TRANSLATION_13": "And mention in the Book (the Quran) Isma'il (Ishmael). Verily! He was true to what he promised, and he was a Messenger, (and) a Prophet.\n",
        "TRANSLATION_14": "And mention in the Book, Ishmael; he too was true to his promise, a Messenger and a Prophet.\n",
        "TRANSLATION_15": "And mention in the Scripture Ishmael. He was true to his promise, and was a messenger, a prophet.\n",
        "TRANSLATION_16": "And mention in the Book, Ishmael. Indeed, he was true to his promise, and he was a messenger and a prophet.\n",
        "TRANSLATION_17": "[19:54] And mention in the Book Ishmael. Indeed he was true to his promise — he never promised anything which he did not fulfil; he [once] waited for three days for someone whom he had promised [to meet]; or [it is said that he waited] an entire year until that person [finally] returned to the place in which he [Ishamel] was [supposed to have met the former]; and he was a messenger, to [the tribe of] Jurhum, a prophet [likewise].\n",
        "TRANSLATION_18": "(And make mention in the Scripture of Ishmael) of the event of Ishmael. (Lo! he was a keeper of his promise) whenever he promised he kept his promise, (and he was a messenger (of Allah)) to his people (a prophet) informing on behalf of Allah.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "19:54",
            "19:51",
            "19:41",
            "19:56",
            "19:30",
            "40:70",
            "29:27",
            "2:98",
            "33:57",
            "37:112"
        ],
        "BIBLE": [
            "writings:psalms:77:12",
            "writings:job:40:28",
            "writings:psalms:45:18",
            "torah:exodus:23:32",
            "torah:deuteronomy:1:11",
            "writings:psalms:71:16",
            "writings:psalms:119:98",
            "torah:exodus:30:37",
            "torah:exodus:34:17",
            "writings:i%20chronicles:17:22"
        ]
    }
}