{
    "VERSE": "19:56",
    "ARABIC": "وَٱذْكُرْ فِى ٱلْكِتَٰبِ إِدْرِيسَ إِنَّهُۥ كَانَ صِدِّيقًا نَّبِيًّا",
    "ENGLISH": {
        "TRANSLATION_0": "Mention Idris in the Book. He was a true man and a Prophet.",
        "TRANSLATION_1": "Commemorate Enoch in the Book. He was a truthful person and a prophet,\n",
        "TRANSLATION_2": "And recite in the Book the account of Idris. He was a man of truth, a Prophet;\n",
        "TRANSLATION_3": "Mention in the Book (the Quran) the story of Idris (Enoch); he was a truthful Prophet.\n",
        "TRANSLATION_4": "And remember Idrees in the Book; he was indeed very truthful, a Prophet.\n",
        "TRANSLATION_5": "And mention in the Book, Idris. Verily, he was a man of truth, (and) a Prophet.\n",
        "TRANSLATION_6": "And mention Idris in the Book; surely he was a truthful man, a prophet,\n",
        "TRANSLATION_7": "And mention in the Book Idris; he was a true man, a Prophet.\n",
        "TRANSLATION_8": "And make mention in the Scripture of Idris. Lo! he was a saint, a prophet;\n",
        "TRANSLATION_9": "Tell also of Idris in the Book. He was a man of truth and a prophet.\n",
        "TRANSLATION_10": "And mention thou in the book ldris, verily he was a man of truth, a prophet. *Chapter: 19\n",
        "TRANSLATION_11": "And mention in the Book Idrees. Indeed, he was a truthful one and a prophet,\n",
        "TRANSLATION_12": "Also mention in the Book the case of Idris: He was a man of truth (and sincerity), (and) a prophet:\n",
        "TRANSLATION_13": "And mention in the Book (the Quran) Idris (Enoch). Verily! He was a man of truth, (and) a Prophet.\n",
        "TRANSLATION_14": "And mention in the Book, Idris; he too was of the truth and a Prophet,\n",
        "TRANSLATION_15": "And mention in the Scripture Enoch. He was a man of truth, a prophet.\n",
        "TRANSLATION_16": "And mention in the Book, Idrees. Indeed, he was a man of truth and a prophet.\n",
        "TRANSLATION_17": "[19:56] And mention in the Book Idrīs, who was Noah’s great-grandfather. Indeed he was a truthful one, a prophet.\n",
        "TRANSLATION_18": "(And make mention in the Scripture of Idris) of the event of Idris. (Lo! he was a saint) he believed in his faith, (a prophet) informing on behalf of Allah;\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "19:56",
            "19:41",
            "19:51",
            "19:54",
            "19:30",
            "37:112",
            "29:27",
            "57:26",
            "68:37",
            "37:117"
        ],
        "BIBLE": [
            "writings:psalms:77:12",
            "prophets:jeremiah:16:20",
            "torah:genesis:13:16",
            "writings:psalms:20:8",
            "torah:deuteronomy:32:26",
            "torah:exodus:30:32",
            "prophets:joshua:9:7",
            "prophets:isaiah:38:16",
            "prophets:jeremiah:49:15",
            "torah:genesis:2:18"
        ]
    }
}