{
    "VERSE": "19:6",
    "ARABIC": "يَرِثُنِى وَيَرِثُ مِنْ ءَالِ يَعْقُوبَ وَٱجْعَلْهُ رَبِّ رَضِيًّا",
    "ENGLISH": {
        "TRANSLATION_0": "to be my inheritor and the inheritor of the family of Ya'qub, and make him, my Lord, pleasing to You.'",
        "TRANSLATION_1": "Who will be heir to me, and heir to the house of Jacob; and make him obedient to You, O Lord.\"\n",
        "TRANSLATION_2": "one that might be my heir and the heir of the house of Jacob; and make him, Lord, one that will be pleasing to You.\n",
        "TRANSLATION_3": "who will be my heir and the heir of the family of Jacob. Lord, make him a person who will please you\".\n",
        "TRANSLATION_4": "“He being my successor and the heir of the Descendants of Yaqub (Jacob); and my Lord, make him a cherished* one.” (* Make him a Prophet among the Descendants of Israel.)\n",
        "TRANSLATION_5": "Who shall inherit me, and inherit (also) the posterity of Ya`qub. And make him, my Lord, one with whom You are well-pleased!\"\n",
        "TRANSLATION_6": "Who should inherit me and inherit from the children of Yaqoub, and make him, my Lord, one in whom Thou art well pleased.\n",
        "TRANSLATION_7": "who shall be my inheritor and the inheritor of the House of Jacob; and make him, my Lord, well-pleasing.'\n",
        "TRANSLATION_8": "Who shall inherit of me and inherit (also) of the house of Jacob. And make him, my Lord, acceptable (unto Thee).\n",
        "TRANSLATION_9": "to be my heir and to be the heir [of the blessings] of the House of Jacob; and make him, O my Lord, acceptable to you.\"\n",
        "TRANSLATION_10": "Inheriting me and inheriting the Children of Ya'qub; and make him, my Lord, acceptable!\n",
        "TRANSLATION_11": "who may inherit from me and inherit from the House of Jacob, and make him, my Lord, pleasing [to You]!’\n",
        "TRANSLATION_12": "(One that) will (truly) represent me, and represent the posterity of Jacob; and make him, O my Lord! one with whom Thou art well-pleased!\"\n",
        "TRANSLATION_13": "Who shall inherit me, and inherit (also) the posterity of Ya'qub (Jacob) (inheritance of the religious knowledge and Prophethood, not the wealth, etc.). And make him, my Lord, one with whom You are Well-pleased!\".\n",
        "TRANSLATION_14": "who will be my heir and an heir to the House of Jacob, and make him, my Lord, satisfied'\n",
        "TRANSLATION_15": "To inherit me, and inherit from the House of Jacob, and make him, my Lord, pleasing.”\n",
        "TRANSLATION_16": "Who will inherit me and inherit from the family of Jacob. And make him, my Lord, pleasing [to You].\"\n",
        "TRANSLATION_17": "[19:6] who may inherit from me (read yarithnī in apocopated form as a response to the imperative statement [fahab lī, ‘grant me’], or read yarithunī as an adjectival qualification of waliyyan, ‘a successor’) and inherit (also read in both ways [mentioned]), from the House of Jacob, my forefather, [inherit] knowledge and prophethood, and make him, my Lord, acceptable’, that is, pleasing to you.\n",
        "TRANSLATION_18": "(Who shall inherit of me) who shall inherit my office and position (and inherit (also) of the house of Jacob) if they have an office and kingship, for the family of Jacob were John's maternal uncles. (And make him, my Lord, acceptable (unto Thee)) make him well pleasing to you and righteous.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "19:6",
            "26:26",
            "71:26",
            "26:169",
            "20:122",
            "84:5",
            "84:2",
            "23:98",
            "39:12",
            "36:27"
        ],
        "BIBLE": [
            "prophets:ezekiel:20:31",
            "prophets:jeremiah:30:10",
            "prophets:isaiah:48:1",
            "prophets:ezekiel:35:15",
            "torah:exodus:30:37",
            "torah:genesis:34:30",
            "prophets:isaiah:63:7",
            "prophets:jeremiah:46:27",
            "torah:exodus:9:4",
            "torah:genesis:40:14"
        ]
    }
}