{
    "VERSE": "19:62",
    "ARABIC": "لَّا يَسْمَعُونَ فِيهَا لَغْوًا إِلَّا سَلَٰمًا وَلَهُمْ رِزْقُهُمْ فِيهَا بُكْرَةً وَعَشِيًّا",
    "ENGLISH": {
        "TRANSLATION_0": "They will not hear any prattling there - nothing but 'Peace'. They will receive their provision there morning and night.",
        "TRANSLATION_1": "They will hear no vain talk there, but only salutations of peace, and they will have their sustenance morning and evening.\"\n",
        "TRANSLATION_2": "They shall not hear in it anything vain; they shall hear only what is good; and they shall have their provision in it, morning and evening.\n",
        "TRANSLATION_3": "They will not hear therein any meaningless words. They will be greeted (by the angels) with \"Peace be with you,\" and they will receive their sustenance both in the mornings and evenings.\n",
        "TRANSLATION_4": "They will not hear any lewd talk in it, but only Peace; and in it for them is sustenance, every morning and evening.\n",
        "TRANSLATION_5": "They shall not hear therein any Laghw, but only Salam. And they will have therein their sustenance, morning and afternoon.\n",
        "TRANSLATION_6": "They shall not hear therein any vain discourse, but only: Peace, and they shall have their sustenance therein morning and evening.\n",
        "TRANSLATION_7": "There they shall hear no idle talk, but only 'Peace.' There they shall have their provision at dawn and evening.\n",
        "TRANSLATION_8": "They hear therein no idle talk, but only Peace; and therein they have food for morn and evening.\n",
        "TRANSLATION_9": "They will not hear therein anything vain, only greetings of peace. They will receive their provision there morning and evening.\n",
        "TRANSLATION_10": "They shall not hear therein any vain word, but they shall hear only peace; and therein they shall have their provision morning and evening. *Chapter: 19\n",
        "TRANSLATION_11": "Therein they will not hear vain talk, but only ‘Peace!’ Therein they will have their provision morning and evening.\n",
        "TRANSLATION_12": "They will not there hear any vain discourse, but only salutations of Peace: And they will have therein their sustenance, morning and evening.\n",
        "TRANSLATION_13": "They shall not hear therein (in Paradise) any Laghw (dirty, false, evil vain talk), but only Salam (salutations of peace). And they will have therein their sustenance, morning and afternoon. [See (V. 40:55)].\n",
        "TRANSLATION_14": "There, they shall hear no idle talk, but only peace. And there they shall be given their provision at dawn and at the evening.\n",
        "TRANSLATION_15": "They will hear no nonsense therein, but only peace. And they will have their provision therein, morning and evening.\n",
        "TRANSLATION_16": "They will not hear therein any ill speech - only [greetings of] peace - and they will have their provision therein, morning and afternoon.\n",
        "TRANSLATION_17": "[19:62] Therein they shall not hear anything that is trifling, of talk, but, they shall hear, only [a greeting of] ‘Peace!’, from the angels to them, or from some among them to others. And therein they will have their provision morning and evening, in other words, according to the [equivalent] measure of these two in the [life of this] world, since there is no day or night in Paradise, only everlasting light and illumination.\n",
        "TRANSLATION_18": "(They hear therein) in Paradise (no idle talk) false oath, (but only Peace) but they greet one another to honour each other; (and therein they have food) their food in Paradise (for morn and evening) in the measure of the morning and evening of this worldly life.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "19:62",
            "56:25",
            "78:35",
            "28:55",
            "52:23",
            "25:72",
            "19:11",
            "37:47",
            "51:57",
            "3:41"
        ],
        "BIBLE": [
            "prophets:ezekiel:3:10",
            "writings:job:22:22",
            "writings:psalms:19:4",
            "prophets:jeremiah:35:13",
            "prophets:joshua:1:18",
            "prophets:jeremiah:22:5",
            "writings:proverbs:2:1",
            "writings:job:33:1",
            "prophets:jeremiah:6:19",
            "prophets:malachi:2:17"
        ]
    }
}