{
    "VERSE": "19:66",
    "ARABIC": "وَيَقُولُ ٱلْإِنسَٰنُ أَءِذَا مَا مِتُّ لَسَوْفَ أُخْرَجُ حَيًّا",
    "ENGLISH": {
        "TRANSLATION_0": "Man says, 'When I am dead, will I then be brought out again alive?'",
        "TRANSLATION_1": "Yet man says: \"When I am dead, will I come to life again?\"\n",
        "TRANSLATION_2": "Man is prone to say: \"Shall I be raised to life after I die?\"\n",
        "TRANSLATION_3": "The human being says, \"Shall I be brought to life again after I will die?\"\n",
        "TRANSLATION_4": "And says man, “When I am dead, will I soon be brought forth alive?”\n",
        "TRANSLATION_5": "And man says: \"When I am dead, shall I then be raised up alive\"\n",
        "TRANSLATION_6": "And says man: What! when I am dead shall I truly be brought forth alive?\n",
        "TRANSLATION_7": "Man says, 'What, when I am dead shall I then be brought forth alive?'\n",
        "TRANSLATION_8": "And man saith: When I am dead, shall I forsooth be brought forth alive?\n",
        "TRANSLATION_9": "Man asks, \"When I am once dead, shall I be raised to life?\"\n",
        "TRANSLATION_10": "And man saith: when I am daed, Shall I be presently brought forth alive. *Chapter: 19\n",
        "TRANSLATION_11": "Man says, ‘What? Shall I be brought forth alive [from the grave], when I have been dead?’\n",
        "TRANSLATION_12": "Man says: \"What! When I am dead, shall I then be raised up alive?\"\n",
        "TRANSLATION_13": "And man (the disbeliever) says: \"When I am dead, shall I then be raised up alive?\"\n",
        "TRANSLATION_14": "The human says: 'What, when I am dead, shall I be raised to life'\n",
        "TRANSLATION_15": "And the human being says, “When I am dead, will I be brought back alive?”\n",
        "TRANSLATION_16": "And the disbeliever says, \"When I have died, am I going to be brought forth alive?\"\n",
        "TRANSLATION_17": "[19:66] And man, the denier of the Resurrection — namely, Ubayy b. Khalaf or al-Walīd b. al-Mughīra, concerning whom the verse was revealed — says, ‘When (read a-idha, either pronouncing the second hamza, or not, but inserting an alif between the two [hamzas] in both [readings]) I am dead, shall I then be brought forth alive?’, from the grave, as Muhammad (s) says? (the interrogative [here] statement is meant as a denial, in other words [he means to say] I shall not be brought forth alive after death; mā [of mā mittu, ‘I am dead’] is extra, for emphasis, likewise [extra is] the lām [of la-sawfa, ‘shall I then’]). He [God] then responds to him with the following saying [of His], exalted be He:\n",
        "TRANSLATION_18": "(And man) i.e. Ubayy Ibn Khalaf al-Jumahi, in denial of the resurrection, (saith: When I am dead, shall I forsooth be brought forth alive) from the grave after I die? This will never be.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "19:66",
            "99:3",
            "75:13",
            "80:17",
            "53:24",
            "96:5",
            "55:3",
            "79:35",
            "53:39",
            "86:5"
        ],
        "BIBLE": [
            "prophets:i%20kings:20:39",
            "prophets:ii%20kings:10:24",
            "prophets:joshua:2:14",
            "torah:genesis:18:16",
            "prophets:jeremiah:29:15",
            "prophets:i%20samuel:21:15",
            "prophets:ezekiel:3:18",
            "prophets:ii%20kings:1:6",
            "prophets:joshua:10:24",
            "prophets:zechariah:6:7"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:8",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:3:6",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:6"
        ]
    }
}