{
    "VERSE": "19:67",
    "ARABIC": "أَوَلَا يَذْكُرُ ٱلْإِنسَٰنُ أَنَّا خَلَقْنَٰهُ مِن قَبْلُ وَلَمْ يَكُ شَيْـًٔا",
    "ENGLISH": {
        "TRANSLATION_0": "Does not man recall that We created him before when he was not anything?",
        "TRANSLATION_1": "Does man not remember that before We created him he was nothing?\n",
        "TRANSLATION_2": "Does man not remember that We created him before when he was nothing?\n",
        "TRANSLATION_3": "Does he not remember that We created him when he did not exist?\n",
        "TRANSLATION_4": "Does not man remember that We created him before this, and he was non existent?\n",
        "TRANSLATION_5": "Does not man remember that We created him before, while he was nothing\n",
        "TRANSLATION_6": "Does not man remember that We created him before, when he was nothing?\n",
        "TRANSLATION_7": "Will not man remember that We created him aforetime, when he was nothing?\n",
        "TRANSLATION_8": "Doth not man remember that We created him before, when he was naught?\n",
        "TRANSLATION_9": "But does man not remember that We created him when he was nothing before?\n",
        "TRANSLATION_10": "Remembereth not man that We created him afore when he was not aught? *Chapter: 19\n",
        "TRANSLATION_11": "Does not man remember that We created him before when he was nothing?\n",
        "TRANSLATION_12": "But does not man call to mind that We created him before out of nothing?\n",
        "TRANSLATION_13": "Does not man remember that We created him before, while he was nothing?\n",
        "TRANSLATION_14": "Will the human not remember that We created him before when he was not a thing.\n",
        "TRANSLATION_15": "Does the human being not remember that We created him before, when he was nothing?\n",
        "TRANSLATION_16": "Does man not remember that We created him before, while he was nothing?\n",
        "TRANSLATION_17": "[19:67] Does not man then remember (yadhdhakaru, is actually yatadhakkaru, but the tā’ has been changed to a dhāl and assimilated with the [other] dhāl; a variant reading leaves it as yadhkuru) that We created him before, when he was nothing?, and thus infer from the first act [of creation] the [possibility of] resurrection.\n",
        "TRANSLATION_18": "332 (Doth not man remember) does not Ubayy Ibn Khalaf take admonition (that We created him before) this from a stinking sperm drop, (when he was naught?) Likewise, I am able to bring him back to life again.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "19:67",
            "36:31",
            "55:56",
            "55:74",
            "32:26",
            "40:74",
            "36:77",
            "32:7",
            "7:191",
            "76:1"
        ],
        "BIBLE": [
            "prophets:i%20samuel:25:15",
            "torah:numbers:19:14",
            "torah:genesis:6:7",
            "prophets:isaiah:65:17",
            "torah:numbers:5:10",
            "torah:leviticus:21:18",
            "writings:psalms:89:48",
            "torah:deuteronomy:24:22",
            "prophets:joshua:3:12",
            "prophets:jeremiah:48:31"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:3:6",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:3:5",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:8"
        ]
    }
}