{
    "VERSE": "19:68",
    "ARABIC": "فَوَرَبِّكَ لَنَحْشُرَنَّهُمْ وَٱلشَّيَٰطِينَ ثُمَّ لَنُحْضِرَنَّهُمْ حَوْلَ جَهَنَّمَ جِثِيًّا",
    "ENGLISH": {
        "TRANSLATION_0": "By your Lord, We will collect them and the shaytans together. Then We will assemble them around Hell on their knees.",
        "TRANSLATION_1": "By your Lord, We shall gather them and the devils together, then bring them crawling on their knees around Hell.\n",
        "TRANSLATION_2": "By your Lord, We will surely muster them and the devils together. Then We will surely bring them all, on their knees, around Hell,\n",
        "TRANSLATION_3": "By your Lord, We will bring them back to life with satan and gather them around hell in large groups.\n",
        "TRANSLATION_4": "So by your Lord, We shall assemble them and the devils – all of them – and bring them around hell, fallen on their knees.\n",
        "TRANSLATION_5": "So by your Lord, surely We shall gather them together, and (also) the Shayatin, then We shall bring them round Hell, Jithyya.\n",
        "TRANSLATION_6": "So by your Lord! We will most certainly gather them together and the Shaitans, then shall We certainly cause them to be present round hell on their knees.\n",
        "TRANSLATION_7": "Now, by thy Lord, We shall surely muster them, and the Satans, then We shall parade them about Gehenna hobbling on their knees.\n",
        "TRANSLATION_8": "And, by thy Lord, verily We shall assemble them and the devils, then We shall bring them, crouching, around hell.\n",
        "TRANSLATION_9": "By your Lord, We shall most surely gather them and the devils too; and bring them close to hell on their knees.\n",
        "TRANSLATION_10": "By thy Lord, then, We shall surely gather them and the satans; thereafter We shall surely bring them round Hell, kneeling. *Chapter: 19\n",
        "TRANSLATION_11": "By your Lord, We will surely gather them with the devils; then We will surely bring them up around hell [scrambling] on their knees.\n",
        "TRANSLATION_12": "So, by thy Lord, without doubt, We shall gather them together, and (also) the Evil Ones (with them); then shall We bring them forth on their knees round about Hell;\n",
        "TRANSLATION_13": "So by your Lord, surely, We shall gather them together, and (also) the Shayatin (devils) (with them), then We shall bring them round Hell on their knees.\n",
        "TRANSLATION_14": "By your Lord, We will gather them and the satans, and We shall parade them hobbling on their knees in Gehenna:\n",
        "TRANSLATION_15": "By your Lord, We will round them up, and the devils, then We will bring them around Hell, on their knees.\n",
        "TRANSLATION_16": "So by your Lord, We will surely gather them and the devils; then We will bring them to be present around Hell upon their knees.\n",
        "TRANSLATION_17": "[19:68]   For by your Lord, We will surely gather them, namely, the deniers of the Resurrection, and the devils, that is to say, We shall gather every one of them with his devil [bound together] in a chain; then We shall bring them around Hell, [around] the outside of it, crouching, on their knees ([jithiyyan is] the plural of jāthin, and is originally [formed as] jathawuwwin or jathawiyyun [deriving] from [the verb] jathā, [imperfect tense] yajthu or yajthī, two [variant] forms).\n",
        "TRANSLATION_18": "(And, by your Lord) Allah swore by Himself, (verily We shall assemble them and the devils, then We shall bring them, crouching, around hell) in the middle of hell.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "19:68",
            "23:97",
            "20:70",
            "108:2",
            "17:27",
            "12:42",
            "15:92",
            "68:50",
            "26:210",
            "23:76"
        ],
        "BIBLE": [
            "prophets:jeremiah:39:18",
            "prophets:isaiah:49:18",
            "prophets:jeremiah:50:15",
            "torah:numbers:11:31",
            "prophets:i%20samuel:5:8",
            "writings:psalms:78:28",
            "torah:numbers:14:3",
            "prophets:ezekiel:32:24",
            "prophets:ezekiel:13:14",
            "prophets:ezekiel:5:12"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:4:8",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:11"
        ]
    }
}