{
    "VERSE": "19:69",
    "ARABIC": "ثُمَّ لَنَنزِعَنَّ مِن كُلِّ شِيعَةٍ أَيُّهُمْ أَشَدُّ عَلَى ٱلرَّحْمَٰنِ عِتِيًّا",
    "ENGLISH": {
        "TRANSLATION_0": "Then We will drag out from every sect the one among them most insolent towards the All-Merciful.",
        "TRANSLATION_1": "We shall pull out of every section those who were most perversely rebellious against Ar-Rahman.\n",
        "TRANSLATION_2": "and then We will draw aside from each party those who were most rebellious against the Most Compassionate Lord,\n",
        "TRANSLATION_3": "Then We will separate from every group those who were strongly rebellious against the Beneficent God.\n",
        "TRANSLATION_4": "We shall then pick out from every group the one who was most arrogant towards the Most Gracious.\n",
        "TRANSLATION_5": "Then indeed We shall drag out from every sect all those who were worst in obstinate rebellion against the Most Gracious.\n",
        "TRANSLATION_6": "Then We will most certainly draw forth from every sect of them him who is most exorbitantly rebellious against the Beneficent Allah.\n",
        "TRANSLATION_7": "Then We shall pluck forth from every party whichever of them was the most hardened in disdain of the All-merciful;\n",
        "TRANSLATION_8": "Then We shall pluck out from every sect whichever of them was most stubborn in rebellion to the Beneficent.\n",
        "TRANSLATION_9": "Then We shall carry off from every group those who were most stubborn in their opposition to the Gracious One,\n",
        "TRANSLATION_10": "Thereafter, We shall surely draw aside, from each sect, whichever of them against the Compassionate were most in excess. *Chapter: 19\n",
        "TRANSLATION_11": "Then from every group We shall draw whichever of them was more defiant towards the All-beneficent.\n",
        "TRANSLATION_12": "Then shall We certainly drag out from every sect all those who were worst in obstinate rebellion against (Allah) Most Gracious.\n",
        "TRANSLATION_13": "Then indeed We shall drag out from every sect all those who were worst in obstinate rebellion against the Most Beneficent (Allah).\n",
        "TRANSLATION_14": "from every party We will pluck out whichever of them was the most hardened in disdain of the Most Merciful.\n",
        "TRANSLATION_15": "Then, out of every sect, We will snatch those most defiant to the Most Merciful.\n",
        "TRANSLATION_16": "Then We will surely extract from every sect those of them who were worst against the Most Merciful in insolence.\n",
        "TRANSLATION_17": "[19:69] Then We shall pluck out from every party, every sect, whichever of them was most hardened in disdain, in insolence, of the Compassionate One.\n",
        "TRANSLATION_18": "(Then We shall pluck out) We shall bring out (from every sect) from the adherents of each religion (whichever of them was most stern in rebellion to the Beneficent) which of them was most daring vis-a-vis the Qur'an.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "19:69",
            "19:88",
            "30:32",
            "6:154",
            "19:91",
            "67:19",
            "20:5",
            "19:96",
            "26:5",
            "30:50"
        ],
        "BIBLE": [
            "torah:deuteronomy:13:6",
            "writings:nehemiah:9:17",
            "torah:exodus:20:18",
            "prophets:isaiah:30:18",
            "prophets:ezekiel:21:8",
            "torah:exodus:15:9",
            "prophets:jeremiah:31:3",
            "prophets:ezekiel:28:7",
            "writings:proverbs:20:5",
            "prophets:zephaniah:3:2"
        ]
    }
}