{
    "VERSE": "19:7",
    "ARABIC": "يَٰزَكَرِيَّآ إِنَّا نُبَشِّرُكَ بِغُلَٰمٍ ٱسْمُهُۥ يَحْيَىٰ لَمْ نَجْعَل لَّهُۥ مِن قَبْلُ سَمِيًّا",
    "ENGLISH": {
        "TRANSLATION_0": "'Zakariyya! We give you the good news of a boy named Yahya, a name We have given to no one else before.'",
        "TRANSLATION_1": "O Zachariah,\" (it was) said, \"We give you good news of a son by name of John.' To none have We attributed the name before.\"\n",
        "TRANSLATION_2": "(He was told): \"Zechariah, We bring you the good news of the birth of a son whose name shall be Yahya (John), one whose namesake We never created before.\"\n",
        "TRANSLATION_3": "We answered his prayers with the glad news of the birth of a son by the name of John and told him, \"We have never given such a name to anyone else.\"\n",
        "TRANSLATION_4": "“O Zakaria! We give you the glad tidings of a son whose name is Yahya (John) – before him, We have not created anyone of this name.”\n",
        "TRANSLATION_5": "(Allah said:) \"O Zakariyya! Verily, We give you the good news of a son, whose name will be Yahya. We have given that name to none before (him).\"\n",
        "TRANSLATION_6": "O Zakariya! surely We give you good news of a boy whose name shall be Yahya: We have not made before anyone his equal.\n",
        "TRANSLATION_7": "O Zachariah, We give thee good tidings of a boy, whose name is John. No namesake have We given him aforetime.'\n",
        "TRANSLATION_8": "(It was said unto him): O Zachariah! Lo! We bring thee tidings of a son whose name is John; we have given the same name to none before (him).\n",
        "TRANSLATION_9": "Zachariah, We bring you good news of a son whose name shall be John. We have not given such a name to anyone before.\"\n",
        "TRANSLATION_10": "O Zakariyya! verily We give thee the glad tidings of a boy: his name shall be Yahya; We have not afore-time made his namesake.\n",
        "TRANSLATION_11": "‘O Zechariah! Indeed We give you the good news of a son, whose name is ‘‘John.’’ Never before have We made anyone his namesake.’\n",
        "TRANSLATION_12": "(His prayer was answered): \"O Zakariya! We give thee good news of a son: His name shall be Yahya: on none by that name have We conferred distinction before.\"\n",
        "TRANSLATION_13": "(Allah said) \"O Zakariya (Zachariah)! Verily, We give you the glad tidings of a son, His name will be Yahya (John). We have given that name to none before (him).\"\n",
        "TRANSLATION_14": "O Zachariah, We give you good tidings of a son, and he shall be called John (Yahya); a name We have never given before'\n",
        "TRANSLATION_15": "“O Zechariah, We give you good news of a son, whose name is John, a name We have never given before.”\n",
        "TRANSLATION_16": "[He was told], \"O Zechariah, indeed We give you good tidings of a boy whose name will be John. We have not assigned to any before [this] name.\"\n",
        "TRANSLATION_17": "[19:7] God, exalted be He, in responding to his request for a son that will be the incarnation of His mercy, says: ‘O Zachariah! Indeed We give you good tidings of a boy, who will inherit in the way that you have requested — whose name is John. Never before have We made anyone his namesake’, that is, [never has there been] anyone with the name ‘John’.\n",
        "TRANSLATION_18": "And so Gabriel called him, saying: (0 Zachariah! Lo! We bring you tidings of a son whose name is John) Yahya in Arabic, because he has breathed life (ahya) into his mother's womb; (We have given the same name to none before (him)) We have not given before a son to Zachariah whose name is John; it is also said that this means: there was no one before him whose name was John.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "19:7",
            "51:46",
            "71:1",
            "15:53",
            "53:52",
            "15:27",
            "41:48",
            "52:28",
            "20:115",
            "2:33"
        ],
        "BIBLE": [
            "torah:genesis:30:18",
            "torah:genesis:29:33",
            "torah:genesis:30:6",
            "prophets:i%20kings:18:26",
            "prophets:isaiah:65:1",
            "torah:genesis:48:9",
            "prophets:ii%20samuel:9:9",
            "prophets:i%20kings:9:13",
            "writings:ruth:4:17",
            "torah:genesis:27:37"
        ]
    }
}