{
    "VERSE": "19:74",
    "ARABIC": "وَكَمْ أَهْلَكْنَا قَبْلَهُم مِّن قَرْنٍ هُمْ أَحْسَنُ أَثَٰثًا وَرِءْيًا",
    "ENGLISH": {
        "TRANSLATION_0": "How many generations We have destroyed before them who had finer furnishings and a better outward show!",
        "TRANSLATION_1": "How many generations that had far more wealth and ostentation have We laid low before them!\n",
        "TRANSLATION_2": "How numerous are the peoples We destroyed before them - those that were more resourceful and grander in outward appearance!\n",
        "TRANSLATION_3": "How many generations of greater prosperity and splendor have We destroyed before them?\n",
        "TRANSLATION_4": "And many a generation We did destroy before them, who exceeded them in wealth and pomp!\n",
        "TRANSLATION_5": "And how many a generation have We destroyed before them, who were better in wealth, goods and outward appearance\n",
        "TRANSLATION_6": "And how many of the generations have We destroyed before them who were better in respect of goods and outward appearance!\n",
        "TRANSLATION_7": "And how many a generation We destroyed before them, who were fairer in furnishing and outward show!\n",
        "TRANSLATION_8": "How many a generation have We destroyed before them, who were more imposing in respect of gear and outward seeming!\n",
        "TRANSLATION_9": "We have destroyed so many generations before them, who surpassed them in material power and splendour.\n",
        "TRANSLATION_10": "And how many a generation have We destroyed before these, who were goodlier in goods and outward appearance? *Chapter: 19\n",
        "TRANSLATION_11": "How many a generation We have destroyed before them, who were superior in furnishings and appearance!\n",
        "TRANSLATION_12": "But how many (countless) generations before them have we destroyed, who were even better in equipment and in glitter to the eye?\n",
        "TRANSLATION_13": "And how many a generation (past nations) have We destroyed before them, who were better in wealth, goods and outward appearance?\n",
        "TRANSLATION_14": "How many generations have We destroyed before them, who were far greater in riches and more boastful!\n",
        "TRANSLATION_15": "How many a generation have We destroyed before them, who surpassed them in riches and splendor?\n",
        "TRANSLATION_16": "And how many a generation have We destroyed before them who were better in possessions and [outward] appearance?\n",
        "TRANSLATION_17": "[19:74] And how many — in other words, many — a generation, that is, a community from among the communities of the past, have We destroyed before them, who were superior in [their possession of] gear, in wealth and chattel, and in appearance, [superior] as a sight (ri’yan derives from [the infinitive] al-ru’ya). Thus in the same way that We destroyed those [ones] because of their disbelief, We will destroy these [ones also].\n",
        "TRANSLATION_18": "(How many a generation) how many past nations (have We destroyed before them) before Quraysh, (who were more imposing about gear) are better looking in outward form (and outward seeming) and have more wealth and offspring!\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "19:74",
            "38:3",
            "19:98",
            "36:31",
            "50:36",
            "12:3",
            "9:50",
            "32:26",
            "21:6",
            "20:128"
        ],
        "BIBLE": [
            "writings:daniel:8:24",
            "prophets:ezekiel:36:3",
            "writings:daniel:3:33",
            "writings:ecclesiastes:6:2",
            "prophets:joel:2:2",
            "prophets:ezekiel:36:5",
            "torah:genesis:10:32",
            "prophets:jeremiah:50:41",
            "writings:esther:3:6",
            "prophets:isaiah:25:7"
        ]
    }
}