{
    "VERSE": "19:75",
    "ARABIC": "قُلْ مَن كَانَ فِى ٱلضَّلَٰلَةِ فَلْيَمْدُدْ لَهُ ٱلرَّحْمَٰنُ مَدًّا حَتَّىٰٓ إِذَا رَأَوْا۟ مَا يُوعَدُونَ إِمَّا ٱلْعَذَابَ وَإِمَّا ٱلسَّاعَةَ فَسَيَعْلَمُونَ مَنْ هُوَ شَرٌّ مَّكَانًا وَأَضْعَفُ جُندًا",
    "ENGLISH": {
        "TRANSLATION_0": "Say: 'As for those who are astray, let the All-Merciful prolong their term until they see what they were promised, whether it be the punishment or the Hour. Then they will know who is in the worse position and has the weaker troops.'",
        "TRANSLATION_1": "Say: \"Ar-Rahman extends the life of those who are astray until they come to realise what had been promised them was either (physical) affliction or (the terror) of Resurrection. Then will they know who is worse in position, and who is weak in supporters.\n",
        "TRANSLATION_2": "Say: \"The Most Compassionate Lord grants respite to those who stray into error, until they behold what they had been threatened with, either God's chastisement (in the world) or the Hour (of Resurrection)\" - then they fully know whose station is worse, and who is weaker in hosts!\n",
        "TRANSLATION_3": "(Muhammad), tell them, \"The Beneficent God gives respite to those who have gone astray only until they face the torment with which they were threatened or to the Day of Judgment. Then they will find out who will have the most miserable place and the weakest forces.\n",
        "TRANSLATION_4": "Proclaim, “For one in error – so the Most Gracious may give him respite; to the extent that when they see the thing which they are promised – either the punishment or the Last Day; so then they will come to know for whom is the evil rank and whose army is weak.”\n",
        "TRANSLATION_5": "Say: whoever is in error, the Most Gracious will extend [circumstances] for him, until, when they see that which they were promised, either the torment or the Hour, they will come to know who is worst in position, and who is weaker in forces.\n",
        "TRANSLATION_6": "Say: As for him who remains in error, the Beneficent Allah will surely prolong his length of days, until they see what they were threatened with, either the punishment or the hour; then they shall know who is in more evil plight and weaker in forces\n",
        "TRANSLATION_7": "Say: 'Whosoever is in error, let the All-merciful prolong his term for him! Till, when they see that they were threatened, whether the chastisement, or the Hour, then they shall surely know who is worse in place, and who is weaker in hosts.'\n",
        "TRANSLATION_8": "Say: As for him who is in error, the Beneficent will verily prolong his span of life until, when they behold that which they were promised, whether it be punishment (in the world), or the Hour (of doom), they will know who is worse in position and who is weaker as an army.\n",
        "TRANSLATION_9": "Say, \"The Gracious One grants respite for a time to those who are in error until, when they are confronted with what they are promised, either in punishment [in the world] or in [the approach of] the Hour, they will realize who is worse in respect of position and who is weaker in resources.\"\n",
        "TRANSLATION_10": "Say thou: whosoever is in error--surely unto him the Compassionate lengtheneth a length, until When they behold that wherewith they were threatened, either the torment or the Hour, then they shall come to know whosoever is worse in position and weaker as an army. *Chapter: 19\n",
        "TRANSLATION_11": "Say, ‘Whoever abides in error, the All-beneficent shall prolong his respite until they sight what they have been promised: either punishment, or the Hour.’ Then they will know whose position is worse, and whose host is weaker.\n",
        "TRANSLATION_12": "Say: \"If any men go astray, (Allah) Most Gracious extends (the rope) to them, until, when they see the warning of Allah (being fulfilled) - either in punishment or in (the approach of) the Hour,- they will at length realise who is worst in position, and (who) weakest in forces!\n",
        "TRANSLATION_13": "Say (O Muhammad SAW) whoever is in error, the Most Beneficent (Allah) will extend (the rope) to him, until, when they see that which they were promised, either the torment or the Hour, they will come to know who is worst in position, and who is weaker in forces. [This is the answer for the Verse No. 19:73]\n",
        "TRANSLATION_14": "Say: 'Whosoever is in error, let the Most Merciful prolong his life span until they see that which they were threatened, be it a punishment, or the Hour. Thenshall they know whose is the worst place and who is weaker in hosts'\n",
        "TRANSLATION_15": "Say, “Whoever is in error, the Most Merciful will lead him on.” Until, when they see what they were promised—either the punishment, or the Hour. Then they will know who was in worse position and weaker in forces.\n",
        "TRANSLATION_16": "Say, \"Whoever is in error - let the Most Merciful extend for him an extension [in wealth and time] until, when they see that which they were promised - either punishment [in this world] or the Hour [of resurrection] - they will come to know who is worst in position and weaker in soldiers.\"\n",
        "TRANSLATION_17": "[19:75] Say: ‘As for him who is in error (man kāna fī’l-dalālati, a conditional clause, the response to which is [fa’lyamdud, ‘He shall prolong’ and what follows it]) the Compassionate One shall defer (fa’l-yamdud, functions in the sense of a predicate) him, from chastisement by [granting him] some respite, in this world, drawing him on [to his eventual chastisement] gradually, until, when they catch sight of that which they were promised, whether it be chastisement [in this world], by being killed or taken captive, or the Hour, the Resurrection that comprises Hell, they will enter it. Then they will surely know who is worse in [respect of] position and weaker in [respect of the number of] hosts’, in [respect of the number of] supporters,   themselves or the believers? Their hosts will be the devils, while the hosts of the believers against them will be the angels.\n",
        "TRANSLATION_18": "(Say) to them, Muhammad: (As for him who is in error) in disbelief and idolatry, (the Beneficent will verily prolong) will increase (his span of life) his wealth and offspring. So observe them, Muhammad, (until, when they behold that which they were promised) of chastisement, (whether it be punishment (in the world)) on the Day of Badr, by the sword, (or Hour (of Doom)) or the chastisement of the Day of Judgement in hell, (they will know) this is a threat to them (who is worse in position) in the Hereafter and tightness in this worldly life (and who is weaker as, an army) who is weaker in receiving help.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "19:75",
            "67:29",
            "76:31",
            "2:175",
            "7:156",
            "38:61",
            "41:50",
            "25:34",
            "16:85",
            "19:79"
        ],
        "BIBLE": [
            "torah:exodus:16:29",
            "prophets:judges:18:10",
            "prophets:i%20samuel:1:11",
            "prophets:zechariah:8:23",
            "writings:ecclesiastes:8:15",
            "writings:ii%20chronicles:25:9",
            "torah:deuteronomy:12:21",
            "writings:ecclesiastes:5:17",
            "writings:ecclesiastes:1:13",
            "prophets:amos:5:16"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:6"
        ]
    }
}