{
    "VERSE": "19:77",
    "ARABIC": "أَفَرَءَيْتَ ٱلَّذِى كَفَرَ بِـَٔايَٰتِنَا وَقَالَ لَأُوتَيَنَّ مَالًا وَوَلَدًا",
    "ENGLISH": {
        "TRANSLATION_0": "Have you seen him who rejects Our Signs and says, 'I will certainly be given wealth and children there.'",
        "TRANSLATION_1": "Have you seen him who denies Our revelations, and says: \"I will certainly be given wealth and children.\"\n",
        "TRANSLATION_2": "Have you seen him who rejected Our signs and said: \"Surely I shall continue to be favoured with riches and children.\"\n",
        "TRANSLATION_3": "Note the words of the disbeliever, \"I shall certainly be given wealth and children?\"\n",
        "TRANSLATION_4": "So have you seen him who denied Our signs and says, “I shall certainly be given wealth and children?”\n",
        "TRANSLATION_5": "Have you seen him who disbelieved in Our Ayat and said: \"I shall certainly be given wealth and children [if I live again].\"\n",
        "TRANSLATION_6": "Have you, then, seen him who disbelieves in Our communications and says: I shall certainly be given wealth and children?\n",
        "TRANSLATION_7": "Hast thou seen him who disbelieves in Our signs and says, 'Assuredly I shall be given wealth and children'?\n",
        "TRANSLATION_8": "Hast thou seen him who disbelieveth in Our revelations and saith: Assuredly I shall be given wealth and children?\n",
        "TRANSLATION_9": "Have you seen him who denies the truth in Our revelations and says, \"I shall certainly be given wealth and children.\"\n",
        "TRANSLATION_10": "Hast thou observed him who disbelieveth in Our signs and saith: surely I shall be vouchsafed riches and children. *Chapter: 19\n",
        "TRANSLATION_11": "Have you not regarded him who defies Our signs, and says, ‘I will surely be given wealth and children’?\n",
        "TRANSLATION_12": "Hast thou then seen the (sort of) man who rejects Our Signs, yet says: \"I shall certainly be given wealth and children?\"\n",
        "TRANSLATION_13": "Have you seen him who disbelieved in Our Ayat (this Quran and Muhammad SAW) and (yet) says: \"I shall certainly be given wealth and children [if I will be alive (again)],\"\n",
        "TRANSLATION_14": "Have you seen he who disbelieves Our verses and yet says: 'I shall surely be given wealth and children'\n",
        "TRANSLATION_15": "Have you seen him who denied Our revelations, and said, “I will be given wealth and children”?\n",
        "TRANSLATION_16": "Then, have you seen he who disbelieved in Our verses and said, \"I will surely be given wealth and children [in the next life]?\"\n",
        "TRANSLATION_17": "[19:77] Have you seen him who disbelieves in Our signs, namely, al-‘Ās b. Wā’il, and says, to Khabbāb b. al-Aratt — who had said to him, ‘You will be resurrected after death!’, and who had requested from him repayment of money — ‘I shall assuredly be given, on the supposition that there is [such a thing as] resurrection, wealth and children?’, and so I will repay you [then]. God, exalted be He, says:\n",
        "TRANSLATION_18": "(Hast thou seen him who disbelieveth in Our revelations) in Muhammad (pbuh) and in the Qur'an, i.e. al-'As Ibn Wa'il al-Sahmi (and saith: Assuredly I shall be given wealth and children) if what Muhammad (pbuh) say about the Hereafter is true, then I shall be given wealth and children!\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "19:77",
            "43:69",
            "104:2",
            "78:28",
            "34:35",
            "23:55",
            "54:15",
            "92:18",
            "111:2",
            "42:35"
        ],
        "BIBLE": [
            "prophets:ezekiel:8:15",
            "torah:deuteronomy:33:9",
            "prophets:jeremiah:1:12",
            "prophets:i%20samuel:28:21",
            "prophets:i%20samuel:17:25",
            "prophets:jeremiah:38:24",
            "torah:exodus:20:19",
            "prophets:ezekiel:13:6",
            "prophets:jeremiah:11:3",
            "prophets:ezekiel:47:6"
        ]
    }
}