{
    "VERSE": "19:79",
    "ARABIC": "كَلَّا سَنَكْتُبُ مَا يَقُولُ وَنَمُدُّ لَهُۥ مِنَ ٱلْعَذَابِ مَدًّا",
    "ENGLISH": {
        "TRANSLATION_0": "No indeed! We will write down what he says and prolong the punishment for him.",
        "TRANSLATION_1": "Never so. We shall certainly write down what he says, and prolong the extent of his punishment.\n",
        "TRANSLATION_2": "By no means! We shall write down all what he says; and We shall greatly prolong his chastisement,\n",
        "TRANSLATION_3": "Absolutely not, We will record his words and prolong his punishment.\n",
        "TRANSLATION_4": "Never; We shall now record what he says and give him a prolonged punishment.\n",
        "TRANSLATION_5": "Nay, We shall record what he says, and We shall increase his torment;\n",
        "TRANSLATION_6": "By no means! We write down what he says, and We will lengthen to him the length of the chastisement\n",
        "TRANSLATION_7": "No, indeed! We shall assuredly write down all that he says, and We shall prolong for him the chastisement;\n",
        "TRANSLATION_8": "Nay, but We shall record that which he saith and prolong for him a span of torment.\n",
        "TRANSLATION_9": "Indeed not. We shall record what he says and shall prolong the punishment for him.\n",
        "TRANSLATION_10": "By no means! We shall write down that which he saith; and We shall lengthen for him of the torment a length. *Chapter: 19\n",
        "TRANSLATION_11": "No indeed! We will write down what he says, and We will prolong his punishment endlessly.\n",
        "TRANSLATION_12": "Nay! We shall record what he says, and We shall add and add to his punishment.\n",
        "TRANSLATION_13": "Nay! We shall record what he says, and We shall increase his torment (in the Hell);\n",
        "TRANSLATION_14": "On the contrary, We will write down what he says and prolong the length of his punishment.\n",
        "TRANSLATION_15": "No indeed! We will write what he says, and will keep extending the agony for him.\n",
        "TRANSLATION_16": "No! We will record what he says and extend for him from the punishment extensively.\n",
        "TRANSLATION_17": "[19:79] Nay, he shall not be given [any of] that, but We will assuredly write down, We shall command that it be written down, that which he says and prolong for him the chastisement endlessly, We shall give him because of that [claim] an extra chastisement, in addition to the chastisement for his disbelief;\n",
        "TRANSLATION_18": "(Nay) he will not have what he said, (but We shall record) We shall preserve (that which he saith) of lies (and prolong) and increase (for him a span of torment) an increase of chastisement.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "19:79",
            "37:9",
            "39:40",
            "3:88",
            "2:162",
            "11:39",
            "6:49",
            "20:48",
            "16:85",
            "2:166"
        ],
        "BIBLE": [
            "prophets:jeremiah:36:17",
            "prophets:jeremiah:30:2",
            "torah:exodus:34:27",
            "prophets:joshua:1:18",
            "prophets:ezekiel:24:1",
            "prophets:isaiah:29:11",
            "torah:genesis:44:10",
            "prophets:jeremiah:42:4",
            "prophets:jeremiah:18:18",
            "prophets:jeremiah:23:38"
        ]
    }
}