{
    "VERSE": "19:80",
    "ARABIC": "وَنَرِثُهُۥ مَا يَقُولُ وَيَأْتِينَا فَرْدًا",
    "ENGLISH": {
        "TRANSLATION_0": "We will inherit from him the things he is talking about and he will come to Us all alone.",
        "TRANSLATION_1": "All that he claims will revert to Us, and he will come before Us all alone.\n",
        "TRANSLATION_2": "and We shall inherit all the resources and hosts of which he boasts, and he will come to Us all alone.\n",
        "TRANSLATION_3": "All that he speaks of will belong to Us, and he will come into Our presence all alone.\n",
        "TRANSLATION_4": "And it is We only Who shall inherit what he says (belongs to him), and he will come to Us, alone.\n",
        "TRANSLATION_5": "And We shall inherit from him all that he speaks of, and he shall come to Us alone.\n",
        "TRANSLATION_6": "And We will inherit of him what he says, and he shall come to Us alone.\n",
        "TRANSLATION_7": "and We shall inherit from him that he says, and he shall come to Us alone.\n",
        "TRANSLATION_8": "And We shall inherit from him that whereof he spake, and he will come unto Us, alone (without his wealth and children).\n",
        "TRANSLATION_9": "We shall inherit all that he boasts of, and he will come to Us all alone.\n",
        "TRANSLATION_10": "And We shall inherit from him that whereof he spake, and he shall come to us alone. *Chapter: 19\n",
        "TRANSLATION_11": "We shall take over from him what he talks about, and he will come to Us alone.\n",
        "TRANSLATION_12": "To Us shall return all that he talks of and he shall appear before Us bare and alone.\n",
        "TRANSLATION_13": "And We shall inherit from him (at his death) all that he talks of (i.e. wealth and children which We have bestowed upon him in this world), and he shall come to Us alone.\n",
        "TRANSLATION_14": "We shall inherit that of which he speaks and he will come before Us alone.\n",
        "TRANSLATION_15": "Then We will inherit from him what he speaks of, and he will come to Us alone.\n",
        "TRANSLATION_16": "And We will inherit him [in] what he mentions, and he will come to Us alone.\n",
        "TRANSLATION_17": "[19:80] and We shall take over from him that which he talks about, of wealth and children, and he shall come to Us, on the Day of Resurrection, alone, with neither wealth nor children.\n",
        "TRANSLATION_18": "(And We shall inherit from him that whereof he spake) in Paradise and give it to the believers, (and he will come unto Us) on the Day of Judgement, (alone) without wealth, children or any goodness. This verse was revealed about Khabbab Ibn al-Aratt and another man with whom he had a quarrel.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "19:80",
            "109:3",
            "109:5",
            "37:77",
            "26:209",
            "109:4",
            "33:61",
            "69:26",
            "21:89",
            "34:17"
        ],
        "BIBLE": [
            "prophets:zechariah:1:3",
            "writings:daniel:10:20",
            "prophets:jeremiah:38:25",
            "torah:genesis:42:36",
            "prophets:zechariah:7:4",
            "torah:numbers:22:20",
            "torah:exodus:3:13",
            "prophets:zechariah:8:23",
            "prophets:ii%20kings:5:15",
            "prophets:judges:11:31"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:3:6",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:3:7",
            "Sefer%20Yetzirah:1:1"
        ]
    }
}