{
    "VERSE": "19:81",
    "ARABIC": "وَٱتَّخَذُوا۟ مِن دُونِ ٱللَّهِ ءَالِهَةً لِّيَكُونُوا۟ لَهُمْ عِزًّا",
    "ENGLISH": {
        "TRANSLATION_0": "They have taken other gods besides Allah to be a source of power and strength for them!",
        "TRANSLATION_1": "They have taken other gods apart from God that they might be a strength to them.\n",
        "TRANSLATION_2": "They have taken other gods instead of Allah that they may be a source of strength for them.\n",
        "TRANSLATION_3": "They have sought honor from other gods instead of God.\n",
        "TRANSLATION_4": "And they have chosen Gods besides Allah, so that they may provide them strength!\n",
        "TRANSLATION_5": "And they have taken gods besides Allah, that they might give them honor, power and glory.\n",
        "TRANSLATION_6": "And they have taken gods besides Allah, that they should be to them a source of strength;\n",
        "TRANSLATION_7": "And they have taken to them other gods apart from God, that they might be for them a might.\n",
        "TRANSLATION_8": "And they have chosen (other) gods beside Allah that they may be a power for them.\n",
        "TRANSLATION_9": "They have taken other deities besides God, so that they may be a source of strength for them.\n",
        "TRANSLATION_10": "And they have taken gods beside Allah that they might be unto them a glory. *Chapter: 19\n",
        "TRANSLATION_11": "They have taken gods besides Allah that they may be a [source of] might to them.\n",
        "TRANSLATION_12": "And they have taken (for worship) gods other than Allah, to give them power and glory!\n",
        "TRANSLATION_13": "And they have taken (for worship) aliha (gods) besides Allah, that they might give them honour, power and glory (and also protect them from Allah's Punishment etc.).\n",
        "TRANSLATION_14": "And they have taken gods, other than Allah, that they might be a power from them.\n",
        "TRANSLATION_15": "And they took, besides God, other gods, to be for them a source of strength.\n",
        "TRANSLATION_16": "And they have taken besides Allah [false] deities that they would be for them [a source of] honor.\n",
        "TRANSLATION_17": "[19:81] And they, namely, the disbelievers of Mecca, have taken besides God, graven images [as], [other] gods, for them to worship, that they may be for them a [source of] might, [that they may be] intercessors before God, so that they will not be chastised.\n",
        "TRANSLATION_18": "(And they have chosen (other)) the people of Mecca worshipped (gods beside Allah) i.e. idols (that they may be a power for them) that they be a protection for them from Allah's chastisement.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "19:81",
            "36:74",
            "53:58",
            "26:93",
            "18:43",
            "16:20",
            "72:22",
            "29:42",
            "39:36",
            "21:98"
        ],
        "BIBLE": [
            "prophets:hosea:12:4",
            "writings:psalms:141:8",
            "prophets:ezekiel:21:28",
            "prophets:i%20samuel:4:22",
            "prophets:amos:2:8",
            "prophets:amos:6:13",
            "writings:psalms:78:70",
            "writings:ecclesiastes:3:14",
            "prophets:i%20kings:7:8",
            "prophets:isaiah:40:29"
        ]
    }
}