{
    "VERSE": "19:82",
    "ARABIC": "كَلَّا سَيَكْفُرُونَ بِعِبَادَتِهِمْ وَيَكُونُونَ عَلَيْهِمْ ضِدًّا",
    "ENGLISH": {
        "TRANSLATION_0": "No indeed! They will reject their worship and will be opposed to them.",
        "TRANSLATION_1": "Never. They will deny their devotion and become their adversaries.\n",
        "TRANSLATION_2": "By no means! They shall soon deny their worship and shall become their adversaries instead.\n",
        "TRANSLATION_3": "In fact, they can have no honor; their gods will renounce their worship of idols and will turn against them.\n",
        "TRANSLATION_4": "Never; soon they will deny ever worshipping them, and will turn into their opponents.\n",
        "TRANSLATION_5": "Nay, but they will deny their worship of them, and will become their adversaries.\n",
        "TRANSLATION_6": "By no means! They shall soon deny their worshipping them, and they shall be adversaries to them.\n",
        "TRANSLATION_7": "No, indeed! They shall deny their service, and they shall be against them pitted.\n",
        "TRANSLATION_8": "Nay, but they will deny their worship of them, and become opponents unto them.\n",
        "TRANSLATION_9": "But they shall reject their worship and turn against them.\n",
        "TRANSLATION_10": "By no means! anon they shall deny their worship, and become unto them an adversary. *Chapter: 19\n",
        "TRANSLATION_11": "No Indeed! Soon they will disown their worship, and they will be their opponents.\n",
        "TRANSLATION_12": "Instead, they shall reject their worship, and become adversaries against them.\n",
        "TRANSLATION_13": "Nay, but they (the so-called gods) will deny their worship of them, and become opponents to them (on the Day of Resurrection).\n",
        "TRANSLATION_14": "Indeed no! They will renounce their worship and turn against them.\n",
        "TRANSLATION_15": "By no means! They will reject their worship of them, and become opponents to them.\n",
        "TRANSLATION_16": "No! Those \"gods\" will deny their worship of them and will be against them opponents [on the Day of Judgement].\n",
        "TRANSLATION_17": "[19:82] Nay, that is to say, there is none to prevent their being chastised, but they, namely, the [idol] gods, shall reject their worship, that is, they will deny it — as [is stated] in another verse: It was not us that they used to worship [Q. 28:63]) — and they shall be [pitted] against them as opponents, enemies, supporting one another [against them].\n",
        "TRANSLATION_18": "(Nay, but they will deny their worship of them) i.e. the idols will absolve themselves from the disbelievers' worship of them, (and become) i.e. the idols (opponents unto them) a help in the torment of the disbelievers.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "19:82",
            "52:25",
            "37:27",
            "40:60",
            "37:50",
            "68:30",
            "89:29",
            "19:79",
            "46:6",
            "78:5"
        ],
        "BIBLE": [
            "writings:lamentations:5:22",
            "writings:lamentations:5:21",
            "torah:deuteronomy:11:28",
            "prophets:jeremiah:31:18",
            "prophets:jeremiah:48:47",
            "torah:deuteronomy:31:18",
            "prophets:ezekiel:33:11",
            "writings:daniel:9:13",
            "prophets:ezekiel:36:9",
            "writings:psalms:22:28"
        ]
    }
}