{
    "VERSE": "19:83",
    "ARABIC": "أَلَمْ تَرَ أَنَّآ أَرْسَلْنَا ٱلشَّيَٰطِينَ عَلَى ٱلْكَٰفِرِينَ تَؤُزُّهُمْ أَزًّا",
    "ENGLISH": {
        "TRANSLATION_0": "Do you not see that We send the shaytans against those who are kafir to goad them on?",
        "TRANSLATION_1": "Do you not see that We have set the devils against the infidels to rouse and instigate them?\n",
        "TRANSLATION_2": "Do you not see that We have sent devils upon the unbelievers who greatly incite them (to oppose the Truth)?\n",
        "TRANSLATION_3": "Do you not realize that We have sent Satan to incite the unbelievers to sin.\n",
        "TRANSLATION_4": "Did you not see that We sent devils upon the disbelievers, so they excite them abundantly?\n",
        "TRANSLATION_5": "See you not that We have sent the Shayatin against the disbelievers to push them to do evil.\n",
        "TRANSLATION_6": "Do you not see that We have sent the Shaitans against the unbelievers, inciting them by incitement?\n",
        "TRANSLATION_7": "Hast thou not seen how We sent the Satans against the unbelievers, to prick them?\n",
        "TRANSLATION_8": "Seest thou not that We have set the devils on the disbelievers to confound them with confusion?\n",
        "TRANSLATION_9": "Do you not see that We have appointed devils to incite those who deny the truth to disobedience?\n",
        "TRANSLATION_10": "Beholdest thou not that We have sent the satans upon the infidels inciting them by an incitement? *Chapter: 19\n",
        "TRANSLATION_11": "Have you not regarded that We unleash the devils upon the faithless to urge them vigorously?\n",
        "TRANSLATION_12": "Seest thou not that We have set the Evil Ones on against the unbelievers, to incite them with fury?\n",
        "TRANSLATION_13": "See you not that We have sent the Shayatin (devils) against the disbelievers to push them to do evil.\n",
        "TRANSLATION_14": "Have you not seen how We send down to the unbelievers satans who prick them?\n",
        "TRANSLATION_15": "Have you not considered how We dispatch the devils against the disbelievers, exciting them with incitement?\n",
        "TRANSLATION_16": "Do you not see that We have sent the devils upon the disbelievers, inciting them to [evil] with [constant] incitement?\n",
        "TRANSLATION_17": "[19:83] Have you not regarded that We unleash the devils against, We have set them upon, the disbelievers to urge them, to incite them to [commit] acts of disobedience, impetuously?\n",
        "TRANSLATION_18": "(Seest thou not) have you not been informed, Muhammad, (that We have set the devils on the disbelievers to confound them with confusion) they forcefully drive them to disobey Allah and strongly entice them to do so?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "19:83",
            "26:221",
            "26:210",
            "7:201",
            "58:19",
            "4:120",
            "7:175",
            "36:60",
            "74:43",
            "43:62"
        ],
        "BIBLE": [
            "writings:job:38:17",
            "torah:deuteronomy:30:15",
            "prophets:jeremiah:1:10",
            "writings:i%20chronicles:29:3",
            "prophets:i%20samuel:22:9",
            "writings:psalms:10:14",
            "torah:numbers:24:1",
            "torah:genesis:16:13",
            "writings:psalms:90:15",
            "prophets:i%20samuel:24:11"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:5:1"
        ]
    }
}