{
    "VERSE": "19:85",
    "ARABIC": "يَوْمَ نَحْشُرُ ٱلْمُتَّقِينَ إِلَى ٱلرَّحْمَٰنِ وَفْدًا",
    "ENGLISH": {
        "TRANSLATION_0": "On that Day We will gather those who have taqwa to the All-Merciful with due ceremony.",
        "TRANSLATION_1": "The day We shall usher the righteous before Ar-Rahman like envoys into the presence of a king,\n",
        "TRANSLATION_2": "The Day shall soon come when We shall bring together the God-fearing to the Most Compassionate Lord, as honoured guests;\n",
        "TRANSLATION_3": "On the Day of Judgment, when the pious people will be brought into the presence of the Beneficent God as the guests of honor\n",
        "TRANSLATION_4": "On the day when We shall assemble the righteous towards the Most Gracious, as guests.\n",
        "TRANSLATION_5": "The Day We shall gather those with Taqwa unto the Most Gracious (Allah), like a delegation.\n",
        "TRANSLATION_6": "The day on which We will gather those who guard (against evil) to the Beneficent Allah to receive honors\n",
        "TRANSLATION_7": "On the day that We shall muster the godfearing to the All-merciful with pomp\n",
        "TRANSLATION_8": "On the day when We shall gather the righteous unto the Beneficent, a goodly company.\n",
        "TRANSLATION_9": "The Day will surely come when We shall gather the God-fearing like [honoured] guests before the Compassionate God\n",
        "TRANSLATION_10": "On the Day whereon We shall gather the God-feaing unto the Com- passionate as an embassy. *Chapter: 19\n",
        "TRANSLATION_11": "The day We shall gather the Godwary toward the All-beneficent, on mounts,\n",
        "TRANSLATION_12": "The day We shall gather the righteous to (Allah) Most Gracious, like a band presented before a king for honours,\n",
        "TRANSLATION_13": "The Day We shall gather the Muttaqun (pious - see V. 2:2) unto the Most Beneficent (Allah), like a delegate (presented before a king for honour).\n",
        "TRANSLATION_14": "and on the Day when We will ceremonially gather the righteous to the Merciful,\n",
        "TRANSLATION_15": "On the Day when We will gather the righteous to the Most Merciful, as guests.\n",
        "TRANSLATION_16": "On the Day We will gather the righteous to the Most Merciful as a delegation\n",
        "TRANSLATION_17": "[19:85] Mention, the day on which We shall gather those who fear God, by their [adherence to] faith, to the Compassionate One, [honoured] on mounts (wafdan, the [accusative] plural of wāfid, meaning ‘mounted’);\n",
        "TRANSLATION_18": "(On the Day) which is the Day of Judgement (when We shall gather the righteous) those who ward off disbelief, idolatry and indecency (unto the Beneficent) unto the Garden of the Beneficent, (a goodly company) mounting on she-camels. 334\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "19:85",
            "79:6",
            "7:14",
            "41:2",
            "54:8",
            "12:92",
            "77:12",
            "55:1",
            "51:13",
            "15:38"
        ],
        "BIBLE": [
            "prophets:isaiah:7:17",
            "prophets:ezekiel:38:8",
            "prophets:hosea:3:5",
            "prophets:ezekiel:26:7",
            "prophets:jeremiah:23:5",
            "torah:numbers:24:14",
            "prophets:zechariah:14:5",
            "prophets:jeremiah:28:1",
            "prophets:ii%20kings:11:19",
            "writings:nehemiah:8:1"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:5"
        ]
    }
}