{
    "VERSE": "19:90",
    "ARABIC": "تَكَادُ ٱلسَّمَٰوَٰتُ يَتَفَطَّرْنَ مِنْهُ وَتَنشَقُّ ٱلْأَرْضُ وَتَخِرُّ ٱلْجِبَالُ هَدًّا",
    "ENGLISH": {
        "TRANSLATION_0": "The heavens are all but rent apart and the earth split open and the mountains brought crashing down,",
        "TRANSLATION_1": "Which would cleave the skies asunder, rend the earth, and split the mountains,\n",
        "TRANSLATION_2": "It is such a monstrosity that heavens might well-nigh burst forth at it, the earth might be cleaved, and the mountains fall\n",
        "TRANSLATION_3": "This would almost cause the heavens to rent apart, the earth to cleave asunder and the mountains to crumble down in fragments,\n",
        "TRANSLATION_4": "The heavens are close to being torn apart by it, and the earth being split asunder, and the mountains succumbing and falling down.\n",
        "TRANSLATION_5": "Whereby the heavens are almost torn, and the earth is split asunder, and the mountains Hadda.\n",
        "TRANSLATION_6": "The heavens may almost be rent thereat, and the earth cleave asunder, and the mountains fall down in pieces,\n",
        "TRANSLATION_7": "The heavens are wellnigh rent of it and the earth split asunder, and the mountains wellnigh fall down crashing for\n",
        "TRANSLATION_8": "Whereby almost the heavens are torn, and the earth is split asunder and the mountains fall in ruins,\n",
        "TRANSLATION_9": "the heavens might well-nigh burst thereat, and the earth break asunder, and the mountains fall down in pieces,\n",
        "TRANSLATION_10": "Well-nigh the heavens are rent thereat and the earth cleft in sunder and the mountains fall down in pieces. *Chapter: 19\n",
        "TRANSLATION_11": "The heavens are about to be rent apart at it, the earth to split open, and the mountains to collapse into bits,\n",
        "TRANSLATION_12": "At it the skies are ready to burst, the earth to split asunder, and the mountains to fall down in utter ruin,\n",
        "TRANSLATION_13": "Whereby the heavens are almost torn, and the earth is split asunder, and the mountains fall in ruins,\n",
        "TRANSLATION_14": "Thereby the heavens are nearly torn and the earth split asunder, and mountains fall crashing down\n",
        "TRANSLATION_15": "At which the heavens almost rupture, and the earth splits, and the mountains fall and crumble.\n",
        "TRANSLATION_16": "The heavens almost rupture therefrom and the earth splits open and the mountains collapse in devastation\n",
        "TRANSLATION_17": "[19:90] The heavens are almost (read takādu, or yakādu) rent (read takādu tatafattarna), by being torn apart (a variant reading has yanfatirna), because of it and the earth [is almost] split asunder, and the mountains [almost] fall down crashing, collapsing on top of them, because of [the fact]:\n",
        "TRANSLATION_18": "(Whereby almost the heavens are torn) crack, (and the earth is split asunder and the mountains fall in ruins),\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "19:90",
            "44:29",
            "33:72",
            "20:4",
            "21:56",
            "18:47",
            "52:36",
            "14:2",
            "30:26",
            "23:18"
        ],
        "BIBLE": [
            "prophets:isaiah:45:8",
            "prophets:jeremiah:46:12",
            "prophets:habakkuk:3:6",
            "prophets:isaiah:44:23",
            "writings:job:14:18",
            "prophets:isaiah:34:4",
            "prophets:jeremiah:8:12",
            "prophets:ezekiel:32:24",
            "prophets:hosea:14:1",
            "prophets:ezekiel:31:12"
        ]
    }
}