{
    "VERSE": "19:92",
    "ARABIC": "وَمَا يَنۢبَغِى لِلرَّحْمَٰنِ أَن يَتَّخِذَ وَلَدًا",
    "ENGLISH": {
        "TRANSLATION_0": "It is not fitting for the All-Merciful to have a son.",
        "TRANSLATION_1": "When it does not behove the Merciful to have a son.\n",
        "TRANSLATION_2": "It does not befit the Most Compassionate Lord that He should take a son.\n",
        "TRANSLATION_3": "The Beneficent God is too Exalted to have a son.\n",
        "TRANSLATION_4": "And it does not befit the Most Gracious to choose an offspring!\n",
        "TRANSLATION_5": "But it is not suitable for the Most Gracious that He should beget a son.\n",
        "TRANSLATION_6": "And it is not worthy of the Beneficent Allah that He should take (to Himself) a son.\n",
        "TRANSLATION_7": "and it behoves not the All-merciful to take a son.\n",
        "TRANSLATION_8": "When it is not meet for (the Majesty of) the Beneficent that He should choose a son.\n",
        "TRANSLATION_9": "It does not become the majesty of the Compassionate God to take to Himself a son:\n",
        "TRANSLATION_10": "And it behoveth not the Compassionate that he should take a son. *Chapter: 19\n",
        "TRANSLATION_11": "It does not behoove the All-beneficent to take a son.\n",
        "TRANSLATION_12": "For it is not consonant with the majesty of (Allah) Most Gracious that He should beget a son.\n",
        "TRANSLATION_13": "But it is not suitable for (the Majesty of) the Most Beneficent (Allah) that He should beget a son (or offspring or children).\n",
        "TRANSLATION_14": "It is not for the Merciful to take a son!\n",
        "TRANSLATION_15": "It is not fitting for the Most Merciful to have a son.\n",
        "TRANSLATION_16": "And it is not appropriate for the Most Merciful that He should take a son.\n",
        "TRANSLATION_17": "[19:92] when it is not meet for [the Majesty of] the Compassionate One to take a son, that is to say, such a thing does not befit Him.\n",
        "TRANSLATION_18": "(When it is not meet for (the Majesty of) the Beneficent that He should choose a son) It does not befit him to take Ezra as a son.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "19:92",
            "19:91",
            "19:88",
            "43:81",
            "26:5",
            "21:26",
            "21:107",
            "19:96",
            "31:3",
            "90:3"
        ],
        "BIBLE": [
            "prophets:isaiah:30:18",
            "writings:ii%20chronicles:30:9",
            "writings:psalms:116:5",
            "prophets:jonah:4:2",
            "writings:job:27:14",
            "torah:numbers:14:10",
            "prophets:joel:2:13",
            "torah:deuteronomy:5:9",
            "torah:exodus:20:5",
            "prophets:joshua:9:18"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:14",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:6:5"
        ]
    }
}