{
    "VERSE": "19:96",
    "ARABIC": "إِنَّ ٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّٰلِحَٰتِ سَيَجْعَلُ لَهُمُ ٱلرَّحْمَٰنُ وُدًّا",
    "ENGLISH": {
        "TRANSLATION_0": "As for those who have iman and do right actions, the All-Merciful will bestow His love on them.",
        "TRANSLATION_1": "Surely Ar-Rahman will show love for those who believe and do the right.\n",
        "TRANSLATION_2": "Indeed, the Most Compassionate Lord will soon create enduring love for those who believe and do righteous works.\n",
        "TRANSLATION_3": "To the righteously striving believers God will grant love.\n",
        "TRANSLATION_4": "Indeed those who believed and did good deeds – the Most Gracious will appoint love for them. (In the hearts of other believers.)\n",
        "TRANSLATION_5": "Verily, those who believe and work deeds of righteousness, the Most Gracious will bestow love for them.\n",
        "TRANSLATION_6": "Surely (as for) those who believe and do good deeds for them will Allah bring about love.\n",
        "TRANSLATION_7": "Surely those who believe and do deeds of righteousness -- unto them the All-merciful shall assign love.\n",
        "TRANSLATION_8": "Lo! those who believe and do good works, the Beneficent will appoint for them love.\n",
        "TRANSLATION_9": "The Lord of Mercy will bestow affection upon those who believe and perform righteous deeds.\n",
        "TRANSLATION_10": "Verily those who believe and do righteOUs works--anon the Compassionate shall appoint for them affection. *Chapter: 19\n",
        "TRANSLATION_11": "Indeed those who have faith and do righteous deeds—the All-beneficent will endear them [to His creation].\n",
        "TRANSLATION_12": "On those who believe and work deeds of righteousness, will (Allah) Most Gracious bestow love.\n",
        "TRANSLATION_13": "Verily, those who believe [in the Oneness of Allah and in His Messenger (Muhammad SAW)] and work deeds of righteousness, the Most Beneficent (Allah) will bestow love for them (in the hearts of the believers).\n",
        "TRANSLATION_14": "Those who believe and do righteous deeds, the Merciful will assign for them love.\n",
        "TRANSLATION_15": "Those who believe and do righteous deeds, the Most Merciful will give them love.\n",
        "TRANSLATION_16": "Indeed, those who have believed and done righteous deeds - the Most Merciful will appoint for them affection.\n",
        "TRANSLATION_17": "[19:96] Truly those who believe and perform righteous deeds — for them the Compassionate One shall appoint love, between them, so that they have mutual love and affection, and God, exalted be He, will love them.\n",
        "TRANSLATION_18": "(Lo! those who believe) in Muhammad (pbuh) and in the Qur'an (and do good works) between them and their Lord, (the Beneficent will appoint for them love) Allah will love them and make people love them.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "19:96",
            "21:86",
            "19:88",
            "21:75",
            "19:91",
            "11:90",
            "26:5",
            "19:92",
            "2:160",
            "90:17"
        ],
        "BIBLE": [
            "prophets:joel:2:13",
            "torah:deuteronomy:15:10",
            "writings:ii%20chronicles:31:20",
            "writings:ecclesiastes:9:1",
            "writings:psalms:125:4",
            "writings:nehemiah:9:17",
            "prophets:isaiah:26:12",
            "writings:psalms:111:4",
            "writings:psalms:86:15",
            "writings:psalms:13:6"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:5"
        ]
    }
}