{
    "VERSE": "19:97",
    "ARABIC": "فَإِنَّمَا يَسَّرْنَٰهُ بِلِسَانِكَ لِتُبَشِّرَ بِهِ ٱلْمُتَّقِينَ وَتُنذِرَ بِهِۦ قَوْمًا لُّدًّا",
    "ENGLISH": {
        "TRANSLATION_0": "We have made it easy on your tongue so that you can give good news to those who have taqwa and warn stubbornly hostile people by it.",
        "TRANSLATION_1": "So We have made this (Qur'an) easy in your tongue that you may give good news to those who take heed, and warn the people who are contentious.\n",
        "TRANSLATION_2": "Therefore, We have revealed the Qur'an in your tongue and made it easy to understand that you may give glad tidings to the God-fearing and warn a contentious people.\n",
        "TRANSLATION_3": "(Muhammad), We have given you the Book (the Quran) in your own language so that you could easily give the glad news to the pious ones and warn the quarrelsome ones.\n",
        "TRANSLATION_4": "We have therefore made this Qur’an easy upon your tongue, (O dear Prophet Mohammed – peace and blessings be upon him) for you to announce glad tidings with it to those who fear, and warn those who are quarrelsome.\n",
        "TRANSLATION_5": "So, We have made this easy in your own tongue, only that you may give glad tidings to those who have Taqwa, and warn with it the people that are Ludda.\n",
        "TRANSLATION_6": "So We have only made it easy in your tongue that you may give good news thereby to those who guard (against evil) and warn thereby a vehemently contentious people.\n",
        "TRANSLATION_7": "Now We have made it easy by thy tongue that thou mayest bear good tidings thereby to the godfearing, and warn a people stubborn.\n",
        "TRANSLATION_8": "And We make (this Scripture) easy in thy tongue, (O Muhammad) only that thou mayst bear good tidings therewith unto those who ward off (evil), and warn therewith the froward folk.\n",
        "TRANSLATION_9": "We have made it [the Quran] easy, in your own language [Prophet], so that you may convey glad news to the righteous and give warning to a stubborn people.\n",
        "TRANSLATION_10": "So We have made it easy in thine tongue in order that thou mayest thereby give glad tidings unto the Godfearing and warn thereby a people contentious. *Chapter: 19\n",
        "TRANSLATION_11": "Indeed We have made it simple in your language so that you may give good news thereby to the Godwary and warn with it a disputatious lot.\n",
        "TRANSLATION_12": "So have We made the (Qur'an) easy in thine own tongue, that with it thou mayest give Glad Tidings to the righteous, and warnings to people given to contention.\n",
        "TRANSLATION_13": "So We have made this (the Quran) easy in your own tongue (O Muhammad SAW), only that you may give glad tidings to the Muttaqun (pious and righteous persons - See V. 2:2), and warn with it the Ludda (most quarrelsome) people.\n",
        "TRANSLATION_14": "We have made it easy in your own tongue in order that you proclaim the glad tidings to the cautious and give warning to a stubborn nation.\n",
        "TRANSLATION_15": "We made it easy in your tongue, in order to deliver good news to the righteous, and to warn with it a hostile people.\n",
        "TRANSLATION_16": "So, [O Muhammad], We have only made Qur'an easy in the Arabic language that you may give good tidings thereby to the righteous and warn thereby a hostile people.\n",
        "TRANSLATION_17": "[19:97] Indeed We have made it easy, namely, the Qur’ān, in your tongue, only that you may bear good tidings therewith to the God-fearing, those who will be prosperous because of their faith, and warn, threaten, therewith a folk [who are] contumacious (luddan, the [accusative] plural of aladd), in other words, [extremely] disputatious, [using] false arguments — and they are the disbelievers of Mecca.\n",
        "TRANSLATION_18": "(And We make (this Scripture) easy in your tongue) We made the recitation of the Qur'an easy for you, ((0 335 Muhammad) only that thou mayst bear good tidings therewith) by means of the Qur'an (unto those who ward off (evil)) disbelief, idolatry and indecency, (and warn therewith) by means of the Qur'an (the froward folk) people who argue by means of falsehood.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "19:97",
            "44:58",
            "14:4",
            "43:54",
            "10:86",
            "20:85",
            "15:58",
            "75:16",
            "28:25",
            "43:44"
        ],
        "BIBLE": [
            "torah:leviticus:10:17",
            "torah:genesis:3:6",
            "prophets:nahum:1:14",
            "torah:genesis:28:4",
            "writings:daniel:3:29",
            "torah:exodus:36:6",
            "prophets:ezekiel:16:52",
            "prophets:joshua:17:14",
            "torah:leviticus:17:11",
            "writings:esther:4:8"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:8"
        ]
    }
}