{
    "VERSE": "63:3",
    "ARABIC": "ذَٰلِكَ بِأَنَّهُمْ ءَامَنُوا۟ ثُمَّ كَفَرُوا۟ فَطُبِعَ عَلَىٰ قُلُوبِهِمْ فَهُمْ لَا يَفْقَهُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "That is because they have had iman and then returned to kufr. So their hearts have been sealed up and they cannot understand.",
        "TRANSLATION_1": "That is because they came to believe, and then renounced (their faith). So their hearts were sealed; and now they do not understand.\n",
        "TRANSLATION_2": "All that is because they first believed and then disbelieved, and therefore a seal was set on their hearts; as a result they understand nothing.\n",
        "TRANSLATION_3": "This is because they accepted the faith and then rejected it. God has sealed their hearts, thus, they do not have any understanding.\n",
        "TRANSLATION_4": "That is because they accepted faith with their tongues then disbelieved with their hearts, therefore their hearts were sealed – so now they do not understand anything.\n",
        "TRANSLATION_5": "That is because they believed, and then disbelieved; therefore their hearts are sealed, so they understand not.\n",
        "TRANSLATION_6": "That is because they believe, then disbelieve, so a seal is set upon their hearts so that they do not understand.\n",
        "TRANSLATION_7": "That is because they have believed, then they have disbelieved; therefore a seal has been set on their hearts, and they do not understand.\n",
        "TRANSLATION_8": "That is because they believed, then disbelieved, therefore their hearts are sealed so that they understand not.\n",
        "TRANSLATION_9": "that is because they believed and then rejected their faith: their hearts are sealed up, so that they are devoid of understanding.\n",
        "TRANSLATION_10": "That is, because they believed, and thereafter disbelieved, wherefore their hearts are sealed, so that they understand not.\n",
        "TRANSLATION_11": "That is because they believed and then disbelieved, so their hearts were sealed. Hence, they do not understand.\n",
        "TRANSLATION_12": "That is because they believed, then they rejected Faith: So a seal was set on their hearts: therefore they understand not.\n",
        "TRANSLATION_13": "That is because they believed, then disbelieved, therefore their hearts are sealed, so they understand not.\n",
        "TRANSLATION_14": "That is because they believed, then disbelieved, because of this a seal has been set upon their hearts so they are unable to understand.\n",
        "TRANSLATION_15": "That is because they believed, and then disbelieved; so their hearts were sealed, and they cannot understand.\n",
        "TRANSLATION_16": "That is because they believed, and then they disbelieved; so their hearts were sealed over, and they do not understand.\n",
        "TRANSLATION_17": "[63:3] That, namely, their evil deed, is because they believed, by [affirming faith only with] the tongue, then disbelieved, in [their] hearts, that is to say, they persist in harbouring disbelief in it; therefore their hearts have been stamped, sealed, with disbelief. Hence they do not understand, faith.\n",
        "TRANSLATION_18": "(That) which I have mentioned regarding the hypocrites (is because they believed) outwardly, (then disbelieved) and became firm in their disbelief inwardly, (therefore their hearts are sealed) as a punishment for their disbelief and hypocrisy (so that they understand not) the Truth or guidance.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "63:3",
            "30:59",
            "15:12",
            "9:87",
            "83:14",
            "26:200",
            "26:199",
            "26:194",
            "5:113",
            "27:85"
        ],
        "BIBLE": [
            "prophets:isaiah:44:18",
            "writings:daniel:10:12",
            "writings:job:17:4",
            "writings:nehemiah:7:5",
            "writings:proverbs:3:5",
            "prophets:isaiah:32:4",
            "prophets:i%20samuel:4:13",
            "writings:proverbs:26:25",
            "prophets:ii%20samuel:15:6",
            "prophets:ii%20samuel:15:13"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:4",
            
            "Sefer%20Yetzirah:1:14",
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:1:9"
        ]
    }
}