{
    "VERSE": "31:13",
    "ARABIC": "وَإِذْ قَالَ لُقْمَٰنُ لِٱبْنِهِۦ وَهُوَ يَعِظُهُۥ يَٰبُنَىَّ لَا تُشْرِكْ بِٱللَّهِ إِنَّ ٱلشِّرْكَ لَظُلْمٌ عَظِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "When Luqman said to his son, counselling him, 'My son, do not associate anything with Allah. Associating others with Him is a terrible wrong.'",
        "TRANSLATION_1": "(Remember) when Luqman counselled his son: \"O son, do not associate any one with God. To associate others with God is a grievous wrong.\"\n",
        "TRANSLATION_2": "And call to mind when Luqman said to his son while exhorting him: “My son, do not associate others with Allah in His Divinity. Surely, associating others with Allah in His Divinity is a mighty wrong.”\n",
        "TRANSLATION_3": "Luqman advised his son telling him, \"My son, do not consider anything equal to God, for it is the greatest injustice.\"\n",
        "TRANSLATION_4": "And remember when Luqman said to his son, and he used to advise him, “O my son! Never ascribe anything as a partner to Allah; indeed ascribing partners to Him is a tremendous injustice.”\n",
        "TRANSLATION_5": "And when Luqman said to his son when he was advising him: \"O my son! Join not in worship others with Allah. Verily, joining others in worship with Allah is a great Zulm (wrong) indeed.\"\n",
        "TRANSLATION_6": "And when Luqman said to his son while he admonished him: O my son! do not associate aught with Allah; most surely polytheism is a grievous iniquity--\n",
        "TRANSLATION_7": "And when Lokman said to his son, admonishing him, 'O my son, do not associate others with God; to associate others with God is a mighty wrong.\n",
        "TRANSLATION_8": "And (remember) when Luqman said unto his son, when he was exhorting him: O my dear son! Ascribe no partners unto Allah. Lo! to ascribe partners (unto Him) is a tremendous wrong -\n",
        "TRANSLATION_9": "Luqman said to his son, counselling him, \"My son, do not associate anything with God. Associating others with Him is a terrible wrong.\"\n",
        "TRANSLATION_10": "And recall what time Luqman said unto his son, while he was exhorting him: O my son! associate not aught with Allah; verily this associating is surely a tremendous wrong.\n",
        "TRANSLATION_11": "When Luqman said to his son, as he advised him: ‘O my son! Do not ascribe any partners to Allah. Polytheism is indeed a great injustice.’\n",
        "TRANSLATION_12": "Behold, Luqman said to his son by way of instruction: \"O my son! join not in worship (others) with Allah: for false worship is indeed the highest wrong-doing.\"\n",
        "TRANSLATION_13": "And (remember) when Luqman said to his son when he was advising him: \"O my son! Join not in worship others with Allah. Verily! Joining others in worship with Allah is a great Zulm (wrong) indeed.\n",
        "TRANSLATION_14": "And when Lokman said to his son, in warning: 'My son, associate none with Allah, to associate others with Allah is a tremendous wrong'\n",
        "TRANSLATION_15": "When Luqman said to his son, as he advised him, “O my son, do not associate anything with God, for idolatry is a terrible wrong.”\n",
        "TRANSLATION_16": "And [mention, O Muhammad], when Luqman said to his son while he was instructing him, \"O my son, do not associate [anything] with Allah. Indeed, association [with him] is great injustice.\"\n",
        "TRANSLATION_17": "[31:13] And, mention, when Luqmān said to his son, when he was admonishing him, ‘O my son (yā bunayya is an affectionate diminutive [of yā ibnī]) do not ascribe partners to God: idolatry is truly a tremendous wrong’, so return to him [in repentance] and submit [to Him].\n",
        "TRANSLATION_18": "(And (remember) when Luqman said unto his son) Salam, (when he was exhorting him) when he was enjoining him to do good and forbidding him to engage in evil: (0 my dear son! Ascribe no partners unto Allah. Lo! to ascribe partners (unto Him) is a tremendous wrong) it is a great sin which is punished by Allah.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "31:13",
            "2:132",
            "69:33",
            "6:100",
            "17:40",
            "12:87",
            "46:10",
            "4:157",
            "28:56",
            "42:21"
        ],
        "BIBLE": [
            "prophets:jeremiah:31:34",
            "torah:genesis:40:8",
            "prophets:ezekiel:33:8",
            "prophets:jeremiah:16:10",
            "writings:psalms:77:14",
            "torah:numbers:22:32",
            "torah:genesis:18:20",
            "writings:job:2:3",
            "prophets:i%20kings:13:26",
            "prophets:jeremiah:5:4"
        ]
    }
}