{
    "VERSE": "31:15",
    "ARABIC": "وَإِن جَٰهَدَاكَ عَلَىٰٓ أَن تُشْرِكَ بِى مَا لَيْسَ لَكَ بِهِۦ عِلْمٌ فَلَا تُطِعْهُمَا وَصَاحِبْهُمَا فِى ٱلدُّنْيَا مَعْرُوفًا وَٱتَّبِعْ سَبِيلَ مَنْ أَنَابَ إِلَىَّ ثُمَّ إِلَىَّ مَرْجِعُكُمْ فَأُنَبِّئُكُم بِمَا كُنتُمْ تَعْمَلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "But if they try to make you associate something with Me about which you have no knowledge, do not obey them. Keep company with them correctly and courteously in this world but follow the Way of him who turns to Me. Then you will return to Me and I will inform you about the things you did.'",
        "TRANSLATION_1": "If they try to force you to associate with Me that of which you have no knowledge, do not obey them. Live with them honourably in the world, but follow the way of him who turns to Me. Your returning is to Me in the end, when I will tell you what you did.\n",
        "TRANSLATION_2": "But if they press you to associate others with Me in My Divinity, (to associate) those regarding whom you have no knowledge (that they are My associates), do not obey them. And yet treat them well in this world, and follow the way of him who turns to Me in devotion. Eventually it is to Me that all of you shall return, and I shall then tell you all that you did.”\n",
        "TRANSLATION_3": "If they try to force you to consider things equal to Me, which you cannot justify, equal to Me, do not obey them. Maintain lawful relations with them in this world and follow the path of those who turn in repentance to Me. To Me you will all return and I shall tell you all that you have done.\n",
        "TRANSLATION_4": "And if they force you, that you ascribe a partner to Me a thing concerning which you do not have knowledge – so do not obey them and support them well in the world; and follow the path of one who has inclined towards Me; then towards Me only is your return, and I shall tell you what you used to do.\n",
        "TRANSLATION_5": "But if they strive with you to make you join in worship with Me others that of which you have no knowledge, then obey them not; but behave with them in the world kindly, and follow the path of him who turns to Me in repentance and in obedience. Then to Me will be your return, and I shall tell you what you used to do.\n",
        "TRANSLATION_6": "And if they contend with you that you should associate with Me what you have no knowledge of, do not obey them, and keep company with them in this world kindly, and follow the way of him who turns to Me, then to Me is your return, then will I inform you of what you did--\n",
        "TRANSLATION_7": "But if they strive with thee to make thee associate with Me that whereof thou hast no knowledge, then do not obey them. Keep them company honourable in this world; but follow the way of him who turns to Me. Then unto Me you shall return, and I shall tell you what you were doing.')\n",
        "TRANSLATION_8": "But if they strive with thee to make thee ascribe unto Me as partner that of which thou hast no knowledge, then obey them not. Consort with them in the world kindly, and follow the path of him who repenteth unto Me. Then unto Me will be your return, and I shall tell you what ye used to do -\n",
        "TRANSLATION_9": "But if they press you to associate something with Me about which you have no knowledge, do not obey them. Yet be kind to them in this world and follow the path of those who turn to Me. You will all return to Me in the end, and I will tell you everything that you have done.\n",
        "TRANSLATION_10": "And if the twain strive with thee to make thee associate with Me that for which thou hast no knowledge, then obey them not. And bear them thou company in the world reputably, and follow thou the path of him who turneth penitently unto Me. Then unto Me is your return, and I shall declare unto you that which ye have been working.\n",
        "TRANSLATION_11": "But if they urge you to ascribe to Me as partner that of which you have no knowledge, then do not obey them. Keep their company honourably in this world and follow the way of those who turn to Me penitently. Then to Me will be your return, whereat I will inform you concerning what you used to do.\n",
        "TRANSLATION_12": "But if they strive to make thee join in worship with Me things of which thou hast no knowledge, obey them not; yet bear them company in this life with justice (and consideration), and follow the way of those who turn to me (in love): in the end the return of you all is to Me, and I will tell you the truth (and meaning) of all that ye did.\"\n",
        "TRANSLATION_13": "But if they (both) strive with you to make you join in worship with Me others that of which you have no knowledge, then obey them not, but behave with them in the world kindly, and follow the path of him who turns to Me in repentance and in obedience. Then to Me will be your return, and I shall tell you what you used to do.\n",
        "TRANSLATION_14": "But if they strive with you to make you associate with Me that of which you have no knowledge, do not obey them. And accompany them in this life with kindness; and follow the Path of he who turned to Me. To Me you shall return and I will inform you of all that you have done.\n",
        "TRANSLATION_15": "But if they strive to have you associate with Me something of which you have no knowledge, do not obey them. But keep them company in this life, in kindness, and follow the path of him who turns to Me. Then to Me is your return; and I will inform you of what you used to do.\n",
        "TRANSLATION_16": "But if they endeavor to make you associate with Me that of which you have no knowledge, do not obey them but accompany them in [this] world with appropriate kindness and follow the way of those who turn back to Me [in repentance]. Then to Me will be your return, and I will inform you about what you used to do.\n",
        "TRANSLATION_17": "[31:15] But if they urge you to ascribe to Me as partner that whereof you have no knowledge, that accords with [any] reality, then do not obey them. And keep them company in this world honourably, in other words, with decency: dutifulness and kindness — and follow the way of him who returns to Me [in penitence], with [acts of] obedience. Then to Me will be your return, and I will inform you of what you used to do, and requite you for it (the [entire] sentence containing the ‘enjoinder’ [verse 14] and what comes after it constitutes a parenthetical statement).\n",
        "TRANSLATION_18": "(But if they strive with thee to make thee) if they want or command you to (ascribe unto Me as partner that of which thou hast no knowledge) that it is My partner while you know that it is not My partner, (then obey them not) regarding idolatry. (Consort with them in the world kindly) with kindness and beneficence, (and 465 follow the path of him who repenteth unto Me) the religion of him who betakes himself to Me and obeys me, i.e. Muhammad (pbuh). (Then unto Me will be your return) and the return of your parents, (and I shall tell you what ye used to do) of good or evil.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "31:15",
            "29:8",
            "6:117",
            "11:47",
            "17:47",
            "10:70",
            "50:45",
            "33:51",
            "68:7",
            "31:23"
        ],
        "BIBLE": [
            "prophets:ii%20samuel:15:20",
            "prophets:isaiah:55:11",
            "torah:deuteronomy:13:15",
            "writings:daniel:6:13",
            "writings:ii%20chronicles:30:5",
            "prophets:isaiah:43:19",
            "writings:daniel:5:15",
            "torah:exodus:34:10",
            "writings:ezra:5:5",
            "prophets:isaiah:29:21"
        ]
    }
}