{
    "VERSE": "31:23",
    "ARABIC": "وَمَن كَفَرَ فَلَا يَحْزُنكَ كُفْرُهُۥٓ إِلَيْنَا مَرْجِعُهُمْ فَنُنَبِّئُهُم بِمَا عَمِلُوٓا۟ إِنَّ ٱللَّهَ عَلِيمٌۢ بِذَاتِ ٱلصُّدُورِ",
    "ENGLISH": {
        "TRANSLATION_0": "And do not let the kufr of those who are kafir sadden you. They will return to Us and We will inform them about the things they did. Allah knows what the heart contains.",
        "TRANSLATION_1": "So do not let the unbelief of disbelievers grieve you. They will be brought back to Us, when We shall tell them what they used to do. Whatever is in their hearts is known to God.\n",
        "TRANSLATION_2": "So let the unbelief of the unbeliever not grieve you. To Us is their return and then We shall inform them of all that they did. Surely Allah knows well even the secrets that are hidden in the breasts (of people).\n",
        "TRANSLATION_3": "(Muhammad), do not let the disbelievers grieve you. To Us they will all return and We shall tell them all about what they have done. God knows best what is in everyone's hearts.\n",
        "TRANSLATION_4": "And whoever disbelieves – then do not be aggrieved by his disbelief (O dear Prophet Mohammed – peace and blessings be upon him); they have to return to Us, and We will inform them what they were doing; indeed Allah knows what lies within the hearts.\n",
        "TRANSLATION_5": "And whoever disbelieves, let not his disbelief grieve you. To Us is their return, and We shall inform them what they have done. Verily, Allah is the All-Knower of what is in the breasts.\n",
        "TRANSLATION_6": "And whoever disbelieves, let not his disbelief grieve you; to Us is their return, then will We inform them of what they did surely Allah is the Knower of what is in the breasts.\n",
        "TRANSLATION_7": "And whoso disbelieves, let not his disbelief grieve thee; unto Us they shall return, and We shall tell them what they did. Surely God knows all the thoughts within the breasts.\n",
        "TRANSLATION_8": "And whosoever disbelieveth, let not his disbelief afflict thee (O Muhammad). Unto Us is their return, and We shall tell them what they did. Lo! Allah is Aware of what is in the breasts (of men).\n",
        "TRANSLATION_9": "But if any reject the Faith, let not his rejection grieve you: for to Us they shall return, and We shall tell them the truth about their deeds: for God knows well all that is in the human hearts --\n",
        "TRANSLATION_10": "And whosoever disbelieveth, let not his unbelief grieve thee. Unto Us is their return, and We shall declare unto them that which they have worked. Verily Allah is the Knower of that which is in the breasts.\n",
        "TRANSLATION_11": "As for those who are faithless, let their faithlessness not grieve you. To Us will be their return, and We will inform them about what they have done. Indeed Allah knows best what is in the breasts.\n",
        "TRANSLATION_12": "But if any reject Faith, let not his rejection grieve thee: to Us is their return, and We shall tell them the truth of their deeds: for Allah knows well all that is in (men's) hearts.\n",
        "TRANSLATION_13": "And whoever disbelieved, let not his disbelief grieve you (O Muhammad SAW),. to Us is their return, and We shall inform them what they have done. Verily, Allah is the All-Knower of what is in the breasts (of men).\n",
        "TRANSLATION_14": "As for those who disbelieve, do not let their disbelief grieve you, to Us they shall return and We will tell to them what they did. Allah has knowledge of what is innermost in their chests.\n",
        "TRANSLATION_15": "Whoever disbelieves—let not his disbelief sadden you. To Us is their return. Then We will inform them of what they did. God knows what lies within the hearts.\n",
        "TRANSLATION_16": "And whoever has disbelieved - let not his disbelief grieve you. To Us is their return, and We will inform them of what they did. Indeed, Allah is Knowing of that within the breasts.\n",
        "TRANSLATION_17": "[31:23] And whoever disbelieves, then do not let his disbelief grieve you, O Muhammad (s), do not be concerned with his disbelief. To Us shall be their return and We shall inform them of what they did. Truly God knows [best] what is in the breasts, just as [He knows] other things, and so He will requite [them] accordingly.\n",
        "TRANSLATION_18": "(And whosoever disbelieveth) in Allah, whether it is from the Quraysh or others, (let not his disbelief) his destruction in his state of disbelief (afflict thee) Muhammad. (Unto Us is their return) after they die, (and We shall tell them what they did) in their state of disbelief in the life of this world. (Lo! Allah is Aware of what is in the breasts (of men)) whether it is good or evil.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "31:23",
            "39:7",
            "28:56",
            "5:61",
            "42:24",
            "5:7",
            "67:13",
            "64:4",
            "3:119",
            "22:68"
        ],
        "BIBLE": [
            "prophets:ii%20samuel:17:3",
            "prophets:jeremiah:24:7",
            "prophets:ezekiel:32:9",
            "writings:psalms:141:4",
            "torah:deuteronomy:15:10",
            "writings:daniel:11:28",
            "torah:deuteronomy:20:8",
            "prophets:i%20samuel:6:6",
            "prophets:jeremiah:15:19",
            "prophets:isaiah:51:7"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:3"
        ]
    }
}