{
    "VERSE": "31:27",
    "ARABIC": "وَلَوْ أَنَّمَا فِى ٱلْأَرْضِ مِن شَجَرَةٍ أَقْلَٰمٌ وَٱلْبَحْرُ يَمُدُّهُۥ مِنۢ بَعْدِهِۦ سَبْعَةُ أَبْحُرٍ مَّا نَفِدَتْ كَلِمَٰتُ ٱللَّهِ إِنَّ ٱللَّهَ عَزِيزٌ حَكِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "If all the trees on earth were pens and all the sea, with seven more seas besides, was ink Allah's words still would not run dry. Allah is Almighty, All-Wise.",
        "TRANSLATION_1": "If all the trees of the earth were pens and the oceans ink, with many more oceans for replenishing them, the colloquy of God would never come to end. He is indeed all-mighty and all-wise.\n",
        "TRANSLATION_2": "If all the trees on earth become pens, and the sea replenished by seven more seas were to supply them with ink, the Words of Allah would not be exhausted. Verily Allah is Most Mighty, Most Wise.\n",
        "TRANSLATION_3": "If all the trees in the earth were pens and the ocean, with seven more oceans, were ink still these could not suffice to record all the Words of God. God is Majestic and All-wise.\n",
        "TRANSLATION_4": "And if all the trees in the earth were pens, and the seas were its ink, with seven more seas to back it up – the Words of Allah will not finish; indeed Allah is Almighty, Wise.\n",
        "TRANSLATION_5": "And if all the trees on the earth were pens and the sea, with seven seas behind it to add to it, yet the Words of Allah would not be exhausted. Verily, Allah is All-Mighty, All-Wise.\n",
        "TRANSLATION_6": "And were every tree that is in the earth (made into) pens and the sea (to supply it with ink), with seven more seas to increase it, the words of Allah would not come to an end; surely Allah is Mighty, Wise.\n",
        "TRANSLATION_7": "Though all the trees in the earth were pens, and the sea-seven seas after it to replenish it, yet would the Words of God not be spent. God is All-mighty, All-wise.\n",
        "TRANSLATION_8": "And if all the trees in the earth were pens, and the sea, with seven more seas to help it, (were ink), the words of Allah could not be exhausted. Lo! Allah is Mighty, Wise.\n",
        "TRANSLATION_9": "If all the trees on earth were pens, and the sea [were] ink, with seven [more] seas added to it, the words of God would not be exhausted: for, truly, God is Almighty and Wise.\n",
        "TRANSLATION_10": "And if whatever trees there are on the earth were pens, and the sea were ink with seven more seas to help it, the words of Allah could not be exhausted; verily Allah is Mighty, Wise.\n",
        "TRANSLATION_11": "If all the trees on the earth were pens, and the sea replenished with seven more seas [were ink], the words of Allah would not be spent. Indeed Allah is all-mighty, all-wise.\n",
        "TRANSLATION_12": "And if all the trees on earth were pens and the ocean (were ink), with seven oceans behind it to add to its (supply), yet would not the words of Allah be exhausted (in the writing): for Allah is Exalted in Power, full of Wisdom.\n",
        "TRANSLATION_13": "And if all the trees on the earth were pens and the sea (were ink wherewith to write), with seven seas behind it to add to its (supply), yet the Words of Allah would not be exhausted. Verily, Allah is All-Mighty, All-Wise.\n",
        "TRANSLATION_14": "If all the trees in the earth were pens, and the sea, with seven more seas to replenish it (with ink), the Words of Allah would never end. Allah is the Almighty, the Wise.\n",
        "TRANSLATION_15": "If all the trees on earth were pens, filled by the ocean, with seven more oceans besides, the Words of God would not run out. God is Majestic and Wise.\n",
        "TRANSLATION_16": "And if whatever trees upon the earth were pens and the sea [was ink], replenished thereafter by seven [more] seas, the words of Allah would not be exhausted. Indeed, Allah is Exalted in Might and Wise.\n",
        "TRANSLATION_17": "[31:27] And if all the trees on earth were pens, and the sea (wa’l-bahru is a supplement to [mā] the subject of anna) replenished with seven more seas, were ink, the Words of God would not be spent, [those words] expressing all the things He knows, written in those pens with that [amount of] ink or with even more [ink] than that [would not be spent], for His knowledge, exalted be He, is infinite. Truly God is Mighty, nothing being beyond Him, Wise, from Whose knowledge and wisdom nothing escapes.\n",
        "TRANSLATION_18": "(And if all the trees in the earth were pens, and the sea) were ink, (with seven more seas to help it) and seven more seas were ink and were used to write the words of Allah and the knowledge of Allah, (the words of Allah could not be exhausted) the words and knowledge of Allah would not be exhausted; it is also said that this means: Allah's providence would not be exhausted. (Allah is Mighty) in His sovereignty and dominion, (Wise) in His command and decree.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "31:27",
            "8:63",
            "57:1",
            "61:1",
            "59:1",
            "35:2",
            "2:209",
            "62:1",
            "59:24",
            "48:7"
        ],
        "BIBLE": [
            "torah:deuteronomy:31:24",
            "torah:genesis:6:13",
            "prophets:jeremiah:43:1",
            "torah:deuteronomy:32:45",
            "writings:psalms:139:18",
            "prophets:ii%20kings:21:16",
            "writings:daniel:11:45",
            "prophets:isaiah:45:22",
            "writings:nehemiah:6:6",
            "torah:deuteronomy:13:8"
        ]
    }
}