{
    "VERSE": "31:28",
    "ARABIC": "مَّا خَلْقُكُمْ وَلَا بَعْثُكُمْ إِلَّا كَنَفْسٍ وَٰحِدَةٍ إِنَّ ٱللَّهَ سَمِيعٌۢ بَصِيرٌ",
    "ENGLISH": {
        "TRANSLATION_0": "Your creation and rising is only like that of a single self. Allah is All-Hearing, All-Seeing.",
        "TRANSLATION_1": "Your creation and resurrection is but like that of a single cell. Verily He is all-hearing and all-seeing.\n",
        "TRANSLATION_2": "To create all of you or to resurrect all of you is to Him like (creating or resurrecting) a single person. Verily Allah is All-Hearing, All-Seeing.\n",
        "TRANSLATION_3": "For God your creation and your resurrection are only like the creation and resurrection of one soul. God is All-hearing and All-seeing.\n",
        "TRANSLATION_4": "Creating you all and raising you from the dead are like that of one soul*; indeed Allah is All Hearing, All Knowing. (He can create you slowly or all at once).\n",
        "TRANSLATION_5": "The creation of you all and the resurrection of you all are only as a single person. Verily, Allah is All-Hearer, All-Seer.\n",
        "TRANSLATION_6": "Neither your creation nor your raising is anything but as a single soul; surely Allah is Hearing, Seeing.\n",
        "TRANSLATION_7": "Your creation and your upraising are as but as a single soul. God is All-hearing, All-seeing.\n",
        "TRANSLATION_8": "Your creation and your raising (from the dead) are only as (the creation and the raising of) a single soul. Lo! Allah is Hearer, Knower.\n",
        "TRANSLATION_9": "Creating and resurrecting all of you is just like creating and resurrecting a single soul. Truly, God hears all and observes all.\n",
        "TRANSLATION_10": "And your creation and your upraising are only as though of one soul; verily Allah is Hearing, Beholding.\n",
        "TRANSLATION_11": "Your creation and your resurrection are not but as of a single soul. Indeed Allah is all-hearing, all-seeing.\n",
        "TRANSLATION_12": "And your creation or your resurrection is in no wise but as an individual soul: for Allah is He Who hears and sees (all things).\n",
        "TRANSLATION_13": "The creation of you all and the resurrection of you all are only as (the creation and resurrection of) a single person. Verily, Allah is All-Hearer, All-Seer.\n",
        "TRANSLATION_14": "Your creation and your resurrection are but as a single soul. Allah is the Hearer, the Seer.\n",
        "TRANSLATION_15": "Your creation and your resurrection are only as a single soul. God is Hearing and Seeing.\n",
        "TRANSLATION_16": "Your creation and your resurrection will not be but as that of a single soul. Indeed, Allah is Hearing and Seeing.\n",
        "TRANSLATION_17": "[31:28] Your creation and your resurrection are only as [that of] a single soul, in terms of creation and resurrection, because it is the result of the words kun fa-yakūn, ‘“Be!” and it is!’ Truly God is Hearer, hearing everything that may be heard, Seer, seeing everything that may be seen, nothing able to distract Him from anything else.\n",
        "TRANSLATION_18": "(Your creation) when He created you (and your raising (from the dead)) when He will resurrect you (are only as (the creation and the raising of) a single soul. Lo! Allah is Hearer) He hears you when you say: \"how is Allah going to raise us from the dead?\", (Seer) of your resurrection.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "31:28",
            "40:20",
            "58:1",
            "38:65",
            "22:75",
            "4:107",
            "41:22",
            "18:51",
            "8:53",
            "2:110"
        ],
        "BIBLE": [
            "prophets:joshua:5:7",
            "writings:ecclesiastes:1:8",
            "prophets:i%20samuel:3:11",
            "prophets:i%20samuel:2:35",
            "prophets:jeremiah:25:32",
            "prophets:i%20kings:11:23",
            "prophets:jeremiah:5:29",
            "prophets:jeremiah:5:9",
            "prophets:jeremiah:9:8",
            "prophets:ii%20samuel:23:8"
        ]
    }
}