{
    "VERSE": "31:5",
    "ARABIC": "أُو۟لَٰٓئِكَ عَلَىٰ هُدًى مِّن رَّبِّهِمْ وَأُو۟لَٰٓئِكَ هُمُ ٱلْمُفْلِحُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Such people are following guidance from their Lord. They are the ones who are successful.",
        "TRANSLATION_1": "They are on guidance from their Lord, and will prosper.\n",
        "TRANSLATION_2": "It is they who are on true guidance from their Lord, and it is they who shall prosper.\n",
        "TRANSLATION_3": "They follow the guidance of their Lord and they will have everlasting happiness.\n",
        "TRANSLATION_4": "It is they who are on guidance from their Lord, and only they are the successful.\n",
        "TRANSLATION_5": "Such are on guidance from their Lord, and such are the successful.\n",
        "TRANSLATION_6": "These are on a guidance from their Lord, and these are they who are successful:\n",
        "TRANSLATION_7": "Those are upon guidance from their Lord; those are the prosperers.\n",
        "TRANSLATION_8": "Such have guidance from their Lord. Such are the successful.\n",
        "TRANSLATION_9": "these are rightly guided by their Lord: and these are the ones who will prosper.\n",
        "TRANSLATION_10": "These are on guidance from their Lord, and these! they are the blissful ones.\n",
        "TRANSLATION_11": "Those follow their Lord’s guidance, and it is they who are the felicitous.\n",
        "TRANSLATION_12": "These are on (true) guidance from their Lord: and these are the ones who will prosper.\n",
        "TRANSLATION_13": "Such are on guidance from their Lord, and such are the successful.\n",
        "TRANSLATION_14": "Those are guided by their Lord and will surely prosper.\n",
        "TRANSLATION_15": "These are upon guidance from their Lord. These are the successful.\n",
        "TRANSLATION_16": "Those are on [right] guidance from their Lord, and it is those who are the successful.\n",
        "TRANSLATION_17": "[31:5] Such follow guidance from their Lord and it is they who are the successful, the winners.\n",
        "TRANSLATION_18": "(Such have guidance) have a clear sight and honour (from their Lord. Such are the successful) they are saved from Allah's wrath and chastisement.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "2:5",
            "31:5",
            "2:157",
            "27:2",
            "29:59",
            "16:42",
            "18:13",
            "53:42",
            "36:27",
            "37:100"
        ],
        "BIBLE": [
            "writings:psalms:23:6",
            "prophets:jeremiah:20:11",
            "torah:deuteronomy:1:36",
            "writings:psalms:94:15",
            "prophets:joshua:14:9",
            "writings:psalms:38:21",
            "writings:psalms:103:17",
            "torah:deuteronomy:18:22",
            "torah:exodus:21:23",
            "torah:genesis:24:8"
        ]
    }
}