{
    "VERSE": "31:7",
    "ARABIC": "وَإِذَا تُتْلَىٰ عَلَيْهِ ءَايَٰتُنَا وَلَّىٰ مُسْتَكْبِرًا كَأَن لَّمْ يَسْمَعْهَا كَأَنَّ فِىٓ أُذُنَيْهِ وَقْرًا فَبَشِّرْهُ بِعَذَابٍ أَلِيمٍ",
    "ENGLISH": {
        "TRANSLATION_0": "When Our Signs are recited to such a person, he turns away arrogantly as if he had not heard, as if there was a great weight in his ears. So give him news of a painful punishment.",
        "TRANSLATION_1": "When Our verses are recited before them they turn away haughtily as though they did not hear them, as if a deafness had come into their ears. So give them tidings of a shameful punishment.\n",
        "TRANSLATION_2": "When Our verses are recited to such a person, he arrogantly turns away, as though he had not heard them, or as though there was a deafness in his ears. So announce to him the tidings of a grievous chastisement.\n",
        "TRANSLATION_3": "When Our revelations are recited to them, they turn back on their heels out of pride as if they did not hear them or their ears had been sealed off. Warn them of the painful torment.\n",
        "TRANSLATION_4": "And when Our verses are recited to him he haughtily turns away as if he did not hear them – as if there is deafness in his ears; so give him the glad tidings of a painful punishment.\n",
        "TRANSLATION_5": "And when Our Ayat are recited to such a one, he turns away in pride, as if he heard them not -- as if there were deafness in his ear. So announce to him a painful torment.\n",
        "TRANSLATION_6": "And when Our communications are recited to him, he turns back proudly, as if he had not heard them, as though in his ears were a heaviness, therefore announce to him a painful chastisement.\n",
        "TRANSLATION_7": "And when Our signs are recited to such a man he turns away, waxing proud, as though he heard them not, and in his ears were heaviness; so give him good tidings of a painful chastisement.\n",
        "TRANSLATION_8": "And when Our revelations are recited unto him he turneth away in pride as if he heard them not, as if there were a deafness in his ears. So give him tidings of a painful doom.\n",
        "TRANSLATION_9": "Whenever Our messages are conveyed to such a person, he turns away in his arrogance, as though he had not heard them -- as though his ears were sealed: give him, then, the tidings of grievous suffering [in the life to come].\n",
        "TRANSLATION_10": "And when Our revelations are recited unto him he turneth away in his stiff-neckedness as though he heard them not: as though there was a deafness in his ears. So announce thou unto him a torment afflictive.\n",
        "TRANSLATION_11": "When Our signs are recited to him he turns away disdainfully, as if he had not heard them [at all], as if there were a deafness in his ears. So inform him of a painful punishment.\n",
        "TRANSLATION_12": "When Our Signs are rehearsed to such a one, he turns away in arrogance, as if he heard them not, as if there were deafness in both his ears: announce to him a grievous Penalty.\n",
        "TRANSLATION_13": "And when Our Verses (of the Quran) are recited to such a one, he turns away in pride, as if he heard them not, as if there were deafness in his ear. So announce to him a painful torment.\n",
        "TRANSLATION_14": "When Our verses are recited to him, he turns his back in pride, as though he never heard them, and in his ears was heaviness. Give glad tidings to him of a painful punishment!\n",
        "TRANSLATION_15": "And when Our Verses are recited to him, he turns away in pride, as though he did not hear them, as though there is deafness in his ears. So inform him of a painful punishment.\n",
        "TRANSLATION_16": "And when our verses are recited to him, he turns away arrogantly as if he had not heard them, as if there was in his ears deafness. So give him tidings of a painful punishment.\n",
        "TRANSLATION_17": "[31:7] And when Our signs, in other words, [in] the Qur’ān, are recited to such [a one] he turns away disdainfully as though he never heard them, as though there were a deafness in his ears (both comparisons constitute two circumstantial qualifiers referring to the subject of [the verb] wallā, ‘turns away’; or it is that the second [comparison] is an explication of the first). So give him tidings of, inform him of, a painful chastisement. The   use of [the expression] ‘good tidings’ meant derisively against such [a person] — this was al-Nadr b. alHārith. He used to visit al-Hīra for commerce and purchase books containing the stories of the non-Arab peoples and then recount these to the people of Mecca. He would say, ‘Muhammad recounts to you the stories of ‘Ād and Thamūd, whereas I relate to you the stories of the Persians and the Byzantines!’ They would thus [go to] enjoy his stories and neglect to listen to the Qur’ān.\n",
        "TRANSLATION_18": "464 (And when Our revelations) which explain the commands and prohibitions (are recited unto him he turneth away in his pride) too proud to accept faith (as if he heard them not, as if there were a deafness in his ears. So give him) Muhammad (tidings of a painful doom) and he was killed in captivity on the Day of Badr.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "31:7",
            "45:8",
            "51:37",
            "16:104",
            "18:57",
            "34:5",
            "25:37",
            "36:18",
            "46:24",
            "10:97"
        ],
        "BIBLE": [
            "prophets:i%20samuel:10:9",
            "prophets:ezekiel:3:20",
            "prophets:i%20samuel:2:15",
            "writings:job:42:11",
            "torah:leviticus:19:20",
            "writings:ecclesiastes:8:15",
            "prophets:i%20kings:13:5",
            "writings:ii%20chronicles:19:6",
            "prophets:i%20samuel:4:19",
            "prophets:jeremiah:35:15"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:8",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:3:8",
            "Sefer%20Yetzirah:1:8"
        ]
    }
}