{
    "VERSE": "31:9",
    "ARABIC": "خَٰلِدِينَ فِيهَا وَعْدَ ٱللَّهِ حَقًّا وَهُوَ ٱلْعَزِيزُ ٱلْحَكِيمُ",
    "ENGLISH": {
        "TRANSLATION_0": "to remain in them timelessly, for ever. Allah's promise is true. He is the Almighty, the All-Wise.",
        "TRANSLATION_1": "They will abide in them for ever. The promise of God is true; and He is all-mighty and all-wise.\n",
        "TRANSLATION_2": "They shall abide in them forever. This is Allah's promise that shall come true. He is the Most Powerful, the Most Wise.\n",
        "TRANSLATION_3": "wherein they will live forever. It is the true promise of God. He is Majestic and All-wise.\n",
        "TRANSLATION_4": "In which they will abide; it is a true promise of Allah; and only He is the Almighty, the Wise.\n",
        "TRANSLATION_5": "To abide therein. It is a promise of Allah in truth. And He is the All-Mighty, the All-Wise.\n",
        "TRANSLATION_6": "Abiding in them; the promise of Allah; (a) true (promise), and He is the Mighty, the Wise.\n",
        "TRANSLATION_7": "therein to dwell forever -- God's promise in truth; and He is the All-mighty, the All-wise.\n",
        "TRANSLATION_8": "Wherein they will abide. It is a promise of Allah in truth. He is the Mighty, the Wise.\n",
        "TRANSLATION_9": "wherein they will abide forever. That is God's true promise; He is the Mighty, the Wise One.\n",
        "TRANSLATION_10": "Therein they will be abiders: a true promise of Allah. And He is the Mighty, the Wise.\n",
        "TRANSLATION_11": "to remain in them [forever]—a true promise of Allah, and He is the All-mighty, the All-wise.\n",
        "TRANSLATION_12": "To dwell therein. The promise of Allah is true: and He is Exalted in Power, Wise.\n",
        "TRANSLATION_13": "To abide therein. It is a Promise of Allah in truth. And He is the All-Mighty, the All-Wise.\n",
        "TRANSLATION_14": "where they shall live for ever. The promise of Allah is the truth; He is the Almighty, the Wise.\n",
        "TRANSLATION_15": "Dwelling therein forever. The promise of God is true. He is the Mighty, the Wise.\n",
        "TRANSLATION_16": "Wherein they abide eternally; [it is] the promise of Allah [which is] truth. And He is the Exalted in Might, the Wise.\n",
        "TRANSLATION_17": "[31:9] abiding therein (khālidīna fīhā, is a circumstantial qualification [of a future status]), in other words, their abiding therein will have been ordained once they enter it — a promise of God in truth, that is to say, God promised them this and realised it in truth; and He is the Mighty, Whom nothing can overwhelm and so prevent Him from fulfilling His promise and His threat [of chastisement], the Wise, the One Who assigns all things to their rightful places.\n",
        "TRANSLATION_18": "(Wherein they will abide) for eternity, never to die or leave it. (It is a promise of Allah) to the believers (in truth) truly. (He is the Mighty) in His kingdom and dominion, (the Wise) in His command and decree.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "31:9",
            "57:1",
            "45:2",
            "39:1",
            "46:2",
            "42:3",
            "27:9",
            "3:62",
            "61:1",
            "59:1"
        ],
        "BIBLE": [
            "torah:deuteronomy:17:14",
            "torah:deuteronomy:26:1",
            "torah:numbers:22:38",
            "writings:psalms:21:14",
            "prophets:jeremiah:8:16",
            "writings:daniel:8:24",
            "writings:psalms:49:16",
            "prophets:zechariah:8:8",
            "writings:psalms:42:3",
            "prophets:ii%20samuel:7:28"
        ]
    }
}