{
    "VERSE": "36:13",
    "ARABIC": "وَٱضْرِبْ لَهُم مَّثَلًا أَصْحَٰبَ ٱلْقَرْيَةِ إِذْ جَآءَهَا ٱلْمُرْسَلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Make an example for them of the inhabitants of the city when the Messengers came to it.",
        "TRANSLATION_1": "Narrate to them the example of the people of the city when the messengers came to it.\n",
        "TRANSLATION_2": "Recite to them, as a case in point, the story of the people of the town when the Messengers came to them.\n",
        "TRANSLATION_3": "Tell them the story of the people of the town to whom Messengers came.\n",
        "TRANSLATION_4": "And relate to them the signs of the people of the city – when two emissaries came to them.\n",
        "TRANSLATION_5": "And put forward to them a similitude; the Dwellers of the Town, when there came Messengers to them.\n",
        "TRANSLATION_6": "And set out to them an example of the people of the town, when the apostles came to it.\n",
        "TRANSLATION_7": "Strike for them a similitude -- the inhabitants of the city, when the Envoys came to it;\n",
        "TRANSLATION_8": "Coin for them a similitude: The people of the city when those sent (from Allah) came unto them;\n",
        "TRANSLATION_9": "Recount to them the example of the people to whose town Our messengers came.\n",
        "TRANSLATION_10": "And propound thou Unto them the similitude of the inhabitants of a town, When there came thereto the sent ones;\n",
        "TRANSLATION_11": "Cite for them the example of the inhabitants of the town when the apostles came to it.\n",
        "TRANSLATION_12": "Set forth to them, by way of a parable, the (story of) the Companions of the City. Behold!, there came messengers to it.\n",
        "TRANSLATION_13": "And put forward to them a similitude; the (story of the) dwellers of the town, [It is said that the town was Antioch (Antakiya)], when there came Messengers to them.\n",
        "TRANSLATION_14": "Give to them a parable; to the people of the village there came Messengers,\n",
        "TRANSLATION_15": "And cite for them the parable of the landlords of the town—when the messengers came to it.\n",
        "TRANSLATION_16": "And present to them an example: the people of the city, when the messengers came to it -\n",
        "TRANSLATION_17": "[36:13]   And strike for them as a similitude (mathalan is the first direct object) the inhabitants (ashāba is the second direct object) of the town, [of] Antioch (Antākya), when the messengers, namely, Jesus’s disciples, came to it (idh jā’ahā’l-mursalūna is an inclusive substitution for ashāba’l-qaryati, ‘the inhabitants of the town’).\n",
        "TRANSLATION_18": "(Coin for them a similitude) explain to the people of Mecca: (The people of the city) of Antioch, how We destroyed them (when those sent (from Allah) came unto them) i.e. when the emissary of Jesus, Simon the Pure, came to them and they disbelieved in and denied him;\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "36:13",
            "25:39",
            "22:48",
            "7:161",
            "17:16",
            "56:38",
            "56:90",
            "26:176",
            "11:100",
            "21:52"
        ],
        "BIBLE": [
            "prophets:joshua:6:16",
            "writings:ezra:5:3",
            "torah:genesis:47:15",
            "torah:genesis:38:18",
            "prophets:jeremiah:32:24",
            "writings:ii%20chronicles:6:27",
            "writings:ii%20chronicles:35:21",
            "torah:numbers:27:12",
            "writings:i%20chronicles:29:14",
            "prophets:i%20kings:8:36"
        ]
    }
}