{
    "VERSE": "36:14",
    "ARABIC": "إِذْ أَرْسَلْنَآ إِلَيْهِمُ ٱثْنَيْنِ فَكَذَّبُوهُمَا فَعَزَّزْنَا بِثَالِثٍ فَقَالُوٓا۟ إِنَّآ إِلَيْكُم مُّرْسَلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "When We sent them two and they denied them both, so We reinforced them with a third. They said, 'Truly We have been sent to you as Messengers.'",
        "TRANSLATION_1": "When We sent two of them they called them liars; so We sent a third to strengthen them. \"We have been sent to you,\" they said.\n",
        "TRANSLATION_2": "We sent to them two Messengers and they rejected both of them as liars. Then We strengthened them with a third (Messenger).\n",
        "TRANSLATION_3": "We sent them two Messengers whom they rejected. We supported them by sending a third one who told the people, \"We are the Messengers (of God) who have been sent to you\".\n",
        "TRANSLATION_4": "When We had sent two towards them and they denied them both, so We fortified them with a third, and they all said, “Indeed we have been sent to you.”\n",
        "TRANSLATION_5": "When We sent to them two Messengers, they denied them both; so We reinforced them with a third, and they said: \"Verily, we have been sent to you as Messengers.\"\n",
        "TRANSLATION_6": "When We sent to them two, they rejected both of them, then We strengthened (them) with a third, so they said: Surely we are apostles to you.\n",
        "TRANSLATION_7": "when We sent unto them two men, but they cried them lies, so We sent a third as reinforcement. They said, 'We are assuredly Envoys unto you.\n",
        "TRANSLATION_8": "When We sent unto them twain, and they denied them both, so We reinforced them with a third, and they said: Lo! we have been sent unto you.\n",
        "TRANSLATION_9": "When We sent them two messengers, they rejected them both, so We strengthened them with a third. They said, \"Truly, we have been sent to you [by God] as messengers.\"\n",
        "TRANSLATION_10": "What time We sent Unto them two, then they belied the twain, wherefore We strengthened them with a third, and they said: verily we are Unto you the sent ones.\n",
        "TRANSLATION_11": "When We sent to them two [apostles], they impugned both of them. Then We reinforced them with a third, and they said, ‘We have indeed been sent to you.’\n",
        "TRANSLATION_12": "When We (first) sent to them two messengers, they rejected them: But We strengthened them with a third: they said, \"Truly, we have been sent on a mission to you.\"\n",
        "TRANSLATION_13": "When We sent to them two Messengers, they belied them both, so We reinforced them with a third, and they said: \"Verily! We have been sent to you as Messengers.\"\n",
        "TRANSLATION_14": "We sent to them two, but they belied them so We reinforced them with a third. They said: 'We have surely been sent as Messengers to you'\n",
        "TRANSLATION_15": "We sent them two messengers, but they denied them both, so We reinforced them with a third. They said, “We are messengers to you.”\n",
        "TRANSLATION_16": "When We sent to them two but they denied them, so We strengthened them with a third, and they said, \"Indeed, we are messengers to you.\"\n",
        "TRANSLATION_17": "[36:14] When We sent to them two men, and they denied them both (from idh arsalnā ilayhim ithnayni fakadhdhabūhumā to the end is a substitution for the previous idh, ‘when’), so We reinforced [them] (read fa‘azaznā or fa-‘azzaznā, in other words, We reinforced the two men) with a third, and they said, ‘We have indeed been sent to you [by God]’.\n",
        "TRANSLATION_18": "(When We sent unto them twain) two apostles: Simon the Canaanite and Thomas, (and they denied them both, so We reinforced them with a third) We strengthened them with Simon Peter who confirmed the message conveyed by the other two apostles, (and they said; Lo! we have been sent unto you. 497\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "36:14",
            "37:148",
            "43:41",
            "37:32",
            "21:64",
            "32:30",
            "7:76",
            "44:59",
            "23:48",
            "40:11"
        ],
        "BIBLE": [
            "torah:genesis:3:9",
            "torah:exodus:9:27",
            "torah:genesis:19:5",
            "torah:genesis:32:29",
            "prophets:i%20kings:20:7",
            "torah:exodus:10:16",
            "prophets:i%20samuel:3:8",
            "prophets:judges:16:28",
            "torah:exodus:12:31",
            "torah:genesis:24:58"
        ]
    }
}