{
    "VERSE": "36:15",
    "ARABIC": "قَالُوا۟ مَآ أَنتُمْ إِلَّا بَشَرٌ مِّثْلُنَا وَمَآ أَنزَلَ ٱلرَّحْمَٰنُ مِن شَىْءٍ إِنْ أَنتُمْ إِلَّا تَكْذِبُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "They said, 'You are nothing but human beings like ourselves. The All-Merciful has not sent down anything. You are simply lying.'",
        "TRANSLATION_1": "You are only men like us,\" they replied; \"Ar-Rahman has not sent down any thing. You are speaking only lies.\"\n",
        "TRANSLATION_2": "They said: “We have been sent to you as Messengers.” The people of the town said: “You are only human beings like ourselves, and the Merciful Lord has revealed nothing. You are simply lying.”\n",
        "TRANSLATION_3": "The people said, \"You are mere mortals like us and the Beneficent God has sent nothing. You are only liars.\"\n",
        "TRANSLATION_4": "They said, “You are nothing but mortals like us; the Most Gracious has not sent down anything – you are nothing but liars.”\n",
        "TRANSLATION_5": "They said: \"You are only human beings like ourselves, and the Most Gracious has revealed nothing. You are only telling lies.\"\n",
        "TRANSLATION_6": "They said: You are naught but mortals like ourselves, nor has the Beneficent Allah revealed anything; you only lie.\n",
        "TRANSLATION_7": "They said, 'You are naught but mortals like us; the All-merciful has not sent down anything. You are speaking only lies.'\n",
        "TRANSLATION_8": "They said: Ye are but mortals like unto us. The Beneficent hath naught revealed. Ye do but lie!\n",
        "TRANSLATION_9": "They replied, \"You are nothing but mortal men like us and the Merciful God has not revealed anything. You are surely lying.\"\n",
        "TRANSLATION_10": "They said: ye are but human beings like ourselves; the Compassionate hath not sent down aught; ye are only lying.\n",
        "TRANSLATION_11": "They said, ‘You are no other than human beings like us, and the All-beneficent has not sent down anything, and you are only lying.’\n",
        "TRANSLATION_12": "The (people) said: \"Ye are only men like ourselves; and (Allah) Most Gracious sends no sort of revelation: ye do nothing but lie.\"\n",
        "TRANSLATION_13": "They (people of the town) said: \"You are only human beings like ourselves, and the Most Beneficent (Allah) has revealed nothing, you are only telling lies.\"\n",
        "TRANSLATION_14": "But they said: 'You are only humans like ourselves. The Merciful has not sent down anything, your speech is but lies'\n",
        "TRANSLATION_15": "They said, “You are nothing but humans like us, and the Gracious did not send down anything; you are only lying.”\n",
        "TRANSLATION_16": "They said, \"You are not but human beings like us, and the Most Merciful has not revealed a thing. You are only telling lies.\"\n",
        "TRANSLATION_17": "[36:15] They said, ‘You are nothing but humans like us, and the Compassionate One has revealed nothing. You are only lying!’\n",
        "TRANSLATION_18": "They said) i.e. the apostles said: (Ye are but mortals) human beings (like unto us. The Beneficent hath naught revealed) He has not revealed any Scripture or sent any messenger. (Ye do but lie) about Allah!\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "36:15",
            "26:186",
            "26:154",
            "26:5",
            "43:20",
            "23:33",
            "23:34",
            "11:27",
            "51:42",
            "36:42"
        ],
        "BIBLE": [
            "prophets:ii%20kings:22:15",
            "writings:ii%20chronicles:34:23",
            "prophets:jeremiah:14:14",
            "prophets:ezekiel:20:7",
            "prophets:ezekiel:24:19",
            "torah:numbers:32:20",
            "prophets:jeremiah:43:2",
            "torah:leviticus:8:5",
            "prophets:jeremiah:26:16",
            "prophets:ii%20kings:23:17"
        ]
    }
}