{
    "VERSE": "36:18",
    "ARABIC": "قَالُوٓا۟ إِنَّا تَطَيَّرْنَا بِكُمْ لَئِن لَّمْ تَنتَهُوا۟ لَنَرْجُمَنَّكُمْ وَلَيَمَسَّنَّكُم مِّنَّا عَذَابٌ أَلِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "They said, 'We see an evil omen in you. If you do not stop we will stone you and you will suffer a painful punishment at our hands.'",
        "TRANSLATION_1": "They rejoined: \"We feel you augur ill. If you do not desist, we shall stone you to death, and inflict a grievous punishment on you.\"\n",
        "TRANSLATION_2": "The people of the town said: “We believe you are an evil omen for us. If you do not desist, we will stone you or you will receive a grievous chastisement from us.”\n",
        "TRANSLATION_3": "The people said, \"We have ill omens about you. If you will not desist, we shall stone you and make you suffer a painful torment\".\n",
        "TRANSLATION_4": "They (the people of the city) said, “We think you are ominous; indeed, if you do not desist, we shall surely stone you to death, and you will surely face a grievous torture at our hands.”\n",
        "TRANSLATION_5": "They (people) said: \"For us, we see an evil omen from you; if you cease not, we will surely stone you, and a painful torment will touch you from us.\"\n",
        "TRANSLATION_6": "They said: Surely we augur evil from you; if you do not desist, we will certainly stone you, and there shall certainly afflict you a painful chastisement from us.\n",
        "TRANSLATION_7": "They said, 'We augur ill of you. If you give not over, we will stone you and there shall visit you from us a painful chastisement.'\n",
        "TRANSLATION_8": "(The people of the city) said: We augur ill of you. If ye desist not, we shall surely stone you, and grievous torture will befall you at our hands.\n",
        "TRANSLATION_9": "but they answered, \"We see an evil omen in you. If you do not stop, we shall certainly stone you, and you will suffer a painful punishment at our hands.\"\n",
        "TRANSLATION_10": "They said: verily we augur ill of you; if ye desist not, we shall surely stone you, and there will befall you from us a torment afflictive.\n",
        "TRANSLATION_11": "They said, ‘Indeed we take you for a bad omen. If you do not desist we will stone you, and surely a painful punishment will visit you from us.’\n",
        "TRANSLATION_12": "The (people) said: \"for us, we augur an evil omen from you: if ye desist not, we will certainly stone you. And a grievous punishment indeed will be inflicted on you by us.\"\n",
        "TRANSLATION_13": "They (people) said: \"For us, we see an evil omen from you, if you cease not, we will surely stone you, and a painful torment will touch you from us.\"\n",
        "TRANSLATION_14": "They answered: 'We predict evil of you. If you do not desist, we will stone you and a painful punishment from us will befall you'\n",
        "TRANSLATION_15": "They said, “We see an evil omen in you; if you do not give up, we will stone you, and a painful punishment from us will befall you.”\n",
        "TRANSLATION_16": "They said, \"Indeed, we consider you a bad omen. If you do not desist, we will surely stone you, and there will surely touch you, from us, a painful punishment.\"\n",
        "TRANSLATION_17": "[36:18] They said, ‘We augur ill of you, for we have been deprived of rain because of you. If (la-in: the lām is for oaths) you do not desist, we will surely stone you and there shall befall you, at our hands, a painful chastisement’.\n",
        "TRANSLATION_18": "((The people of the city) said) to the apostles: (We augur ill of you) you are of ill omen. (If ye desist not) from what you say, (we shall surely stone you) we shall kill you, (and grievous torture will befall you) you will be slain (at our hands.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "36:18",
            "37:38",
            "84:24",
            "26:201",
            "4:138",
            "17:10",
            "16:104",
            "3:188",
            "15:50",
            "2:104"
        ],
        "BIBLE": [
            "prophets:ii%20kings:18:30",
            "prophets:isaiah:36:15",
            "prophets:joel:2:19",
            "prophets:i%20samuel:9:12",
            "prophets:ii%20kings:7:2",
            "prophets:judges:9:48",
            "prophets:i%20samuel:18:25",
            "prophets:jeremiah:15:11",
            "torah:exodus:22:10",
            "writings:job:5:18"
        ]
    }
}