{
    "VERSE": "36:19",
    "ARABIC": "قَالُوا۟ طَٰٓئِرُكُم مَّعَكُمْ أَئِن ذُكِّرْتُم بَلْ أَنتُمْ قَوْمٌ مُّسْرِفُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "They said, 'Your evil omen is in yourselves. Is it not just that you have been reminded? No, you are an unbridled people!'",
        "TRANSLATION_1": "(The messengers) said: \"The augury is within your own selves. Do you (consider it a bad omen) that you should be warned? You are a people guilty of excess.\"\n",
        "TRANSLATION_2": "The Messengers replied: “Your evil omen is with you. (Are you saying this) because you were asked to take heed? The truth is that you are a people who have exceeded all bounds.”\n",
        "TRANSLATION_3": "The Messengers said, \"This ill omen lies within yourselves. Will you then take heed? In fact, you are a transgressing people.\"\n",
        "TRANSLATION_4": "They said, “Your evil omens are with you! What! You get annoyed for being advised? In fact you are a people who transgress the limits!”\n",
        "TRANSLATION_5": "They (Messengers) said: \"Your evil omens be with you! Because you are admonished Nay, but you are a people mischievous.\"\n",
        "TRANSLATION_6": "They said: Your evil fortune is with you; what! if you are reminded! Nay, you are an extravagant people.\n",
        "TRANSLATION_7": "They said, 'Your augury is with you; if you are reminded? But you are a prodigal people.'\n",
        "TRANSLATION_8": "They said: Your evil augury be with you! Is it because ye are reminded (of the truth)? Nay, but ye are froward folk!\n",
        "TRANSLATION_9": "They said, \"Your evil augury be with you! Is it because you are admonished about the truth? Surely, you are a people transgressing all bounds!\"\n",
        "TRANSLATION_10": "They said: your evil augury be with you. Call ye it an ill- luck because ye are admonished! Aye! ye are a people extravagant.\n",
        "TRANSLATION_11": "They said, ‘Your bad omens attend you. What! If you are admonished.... Indeed, you are an unrestrained lot.’\n",
        "TRANSLATION_12": "They said: \"Your evil omens are with yourselves: (deem ye this an evil omen). If ye are admonished? Nay, but ye are a people transgressing all bounds!\"\n",
        "TRANSLATION_13": "They (Messengers) said: \"Your evil omens be with you! (Do you call it \"evil omen\") because you are admonished? Nay, but you are a people Musrifun (transgressing all bounds by committing all kinds of great sins, and by disobeying Allah).\n",
        "TRANSLATION_14": "They said: 'Your prediction is with you, if you are reminded. Surely, you are but a wayward nation'\n",
        "TRANSLATION_15": "They said, “Your evil omen is upon you. Is it because you were reminded? But you are an extravagant people.”\n",
        "TRANSLATION_16": "They said, \"Your omen is with yourselves. Is it because you were reminded? Rather, you are a transgressing people.\"\n",
        "TRANSLATION_17": "[36:19] They said, ‘May your augury of ill be with you!, [as punishment] for your disbelief. What! [Even] if (a-in: the interrogative hamza has been added to the conditional in, ‘if’, the hamza may be pronounced or elided, but in both cases add an alif between it and the other one) [it be that] you are being reminded?, [even if] you are being admonished and made to fear [God’s chastisement]? (the response to the conditional has been omitted, that is to say, ‘do you augur ill and disbelieve [even if it be that you are being admonished]?’ and this [response] constitutes the object of the interrogative, which is meant [rhetorically] as a rebuke). Nay, but you are a profligate people!’, who transgressing the bounds [set by God] with your [practice of] idolatry.\n",
        "TRANSLATION_18": "They said) the apostles said: (Your evil augury) your toughness and ill omen (be with you) from Allah due to your own deeds! (Is it because ye are reminded (of the Truth)) do you find us of ill omen just because we reminded you of Allah and warned you by Him? (Nay, but you are froward folk) you are folk who associate partners with Allah?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "36:19",
            "51:53",
            "26:11",
            "15:62",
            "15:58",
            "37:124",
            "43:54",
            "51:32",
            "45:31",
            "11:30"
        ],
        "BIBLE": [
            "prophets:hosea:1:9",
            "torah:genesis:20:9",
            "torah:exodus:9:27",
            "torah:exodus:12:31",
            "torah:genesis:30:11",
            "prophets:jeremiah:16:10",
            "writings:daniel:9:19",
            "torah:exodus:8:4",
            "writings:nehemiah:5:12",
            "prophets:i%20kings:2:42"
        ]
    }
}