{
    "VERSE": "36:20",
    "ARABIC": "وَجَآءَ مِنْ أَقْصَا ٱلْمَدِينَةِ رَجُلٌ يَسْعَىٰ قَالَ يَٰقَوْمِ ٱتَّبِعُوا۟ ٱلْمُرْسَلِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "A man came running from the far side of the city, saying, 'My people! follow the Messengers!",
        "TRANSLATION_1": "Then a man came running from the other side of the city. \"O my people,\" he said, \"follow the messengers.\n",
        "TRANSLATION_2": "In the meantime a man came running from the far end of the town, saying: “My people, follow the Messengers;\n",
        "TRANSLATION_3": "A man came running from the farthest part of the city saying, \"My people, follow the Messengers.\n",
        "TRANSLATION_4": "And from the outermost part of the city came a man running; he said, “O my people! Obey those who have been sent.”\n",
        "TRANSLATION_5": "And there came a man running from the farthest part of the town. He said, \"O my people! Obey the Messengers.\"\n",
        "TRANSLATION_6": "And from the remote part of the city there came a man running, he said: O my people! follow the apostles;\n",
        "TRANSLATION_7": "Then came a man from the furthest part of the city, running; he said, 'My people, follow the Envoys!\n",
        "TRANSLATION_8": "And there came from the uttermost part of the city a man running. He cried: O my people! Follow those who have been sent!\n",
        "TRANSLATION_9": "Then, from the furthest part of the city, a man came running. He said, \"My people, follow the messengers.\n",
        "TRANSLATION_10": "And there came from the farthest part of the town a man running. He said; O my people! follow the sent ones.\n",
        "TRANSLATION_11": "There came a man hurrying from the city outskirts. He said, ‘O my people! Follow the apostles!\n",
        "TRANSLATION_12": "Then there came running, from the farthest part of the City, a man, saying, \"O my people! Obey the messengers:\n",
        "TRANSLATION_13": "And there came running from the farthest part of the town, a man, saying: \"O my people! Obey the Messengers;\n",
        "TRANSLATION_14": "Then, a man came running from the furthest part of the village 'My nation' he said, 'follow the Messengers,\n",
        "TRANSLATION_15": "Then a man came running from the remotest part of the city. He said, “O my people, follow the messengers.\n",
        "TRANSLATION_16": "And there came from the farthest end of the city a man, running. He said, \"O my people, follow the messengers.\n",
        "TRANSLATION_17": "[36:20] And there came a man from the furthest part of the city — this was Habīb the carpenter, who had believed in these messengers and whose house lay at the far end of the city — hastening, with a hurried pace, after he had heard that the people had denied the messengers. He said, ‘O my people, follow the messengers!\n",
        "TRANSLATION_18": "(And there came from the uttermost part of the city) there came from the centre of the city (a man) his name was Habib the carpenter (running) when he heard about the emissaries. (He cried: my people! Follow those who have been sent) by accepting faith in Allah!\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "36:20",
            "28:20",
            "40:32",
            "40:41",
            "40:38",
            "36:26",
            "7:81",
            "27:55",
            "10:86",
            "11:78"
        ],
        "BIBLE": [
            "prophets:judges:13:10",
            "prophets:i%20kings:2:39",
            "prophets:i%20kings:19:20",
            "prophets:ii%20kings:6:19",
            "prophets:ii%20samuel:12:1",
            "writings:ii%20chronicles:23:12",
            "prophets:ezekiel:36:20",
            "prophets:ii%20samuel:18:23",
            "prophets:i%20samuel:4:12",
            "prophets:i%20kings:12:22"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:3:6",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:1:6"
        ]
    }
}