{
    "VERSE": "36:21",
    "ARABIC": "ٱتَّبِعُوا۟ مَن لَّا يَسْـَٔلُكُمْ أَجْرًا وَهُم مُّهْتَدُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Follow those who do not ask you for any wage and who have received guidance.",
        "TRANSLATION_1": "Follow those who do not ask for any recompense of you, and are rightly guided.\n",
        "TRANSLATION_2": "follow those who do not ask any recompense from you and are rightly-guided.\n",
        "TRANSLATION_3": "Follow those who do not ask you for any reward and who are rightly guided.\n",
        "TRANSLATION_4": "“Obey those who do not ask any fee from you, and they are on guidance.”\n",
        "TRANSLATION_5": "Obey those who ask no wages of you, and who are rightly guided.\"\n",
        "TRANSLATION_6": "Follow him who does not ask you for reward, and they are the followers of the right course;\n",
        "TRANSLATION_7": "Follow such as ask no wage of you, that are right-guided.\n",
        "TRANSLATION_8": "Follow those who ask of you no fee, and who are rightly guided.\n",
        "TRANSLATION_9": "Follow those who ask no recompense of you and are rightly guided.\n",
        "TRANSLATION_10": "Follow those who ask not of you any hire, and who are rightly guided.\n",
        "TRANSLATION_11": "Follow them who do not ask you any reward and they are rightly guided.\n",
        "TRANSLATION_12": "Obey those who ask no reward of you (for themselves), and who have themselves received Guidance.\n",
        "TRANSLATION_13": "Obey those who ask no wages of you (for themselves), and who are rightly guided.\n",
        "TRANSLATION_14": "follow those who ask no wage of you and are rightly guided.\n",
        "TRANSLATION_15": "Follow those who ask you of no wage, and are themselves guided.\n",
        "TRANSLATION_16": "Follow those who do not ask of you [any] payment, and they are [rightly] guided.\n",
        "TRANSLATION_17": "[36:21] Follow (ittabi‘ū, this reiterates the preceding [ittabi‘ū]) them who do not ask you for any reward, in return for [delivering to you] the message, and who are rightly guided. And so he was asked, ‘Do you follow their religion?’ So he replied:\n",
        "TRANSLATION_18": "(Follow those who ask of you no fee) or reward for believing in Allah, (and who are rightly guided) and who guide to belief in Allah's divine Oneness. They said to him: you have absolved yourself from us and from the religion of our forefathers and embraced the religion of our enemy.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "36:21",
            "38:86",
            "18:30",
            "109:4",
            "109:5",
            "109:3",
            "69:39",
            "53:60",
            "11:115",
            "41:8"
        ],
        "BIBLE": [
            "prophets:zephaniah:1:6",
            "writings:job:34:27",
            "prophets:i%20samuel:12:14",
            "writings:psalms:73:24",
            "prophets:isaiah:40:10",
            "writings:psalms:94:15",
            "torah:genesis:24:39",
            "prophets:judges:13:23",
            "prophets:i%20kings:14:8",
            "prophets:isaiah:51:1"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:13",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:2:5"
        ]
    }
}