{
    "VERSE": "36:22",
    "ARABIC": "وَمَا لِىَ لَآ أَعْبُدُ ٱلَّذِى فَطَرَنِى وَإِلَيْهِ تُرْجَعُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Why indeed should I not worship Him Who brought me into being, Him to Whom you will be returned?",
        "TRANSLATION_1": "Why should I not worship Him who brought me into being, to whom you will be brought back in the end?\n",
        "TRANSLATION_2": "Why should I not serve the One Who created me and to Whom all of you shall be sent back?\n",
        "TRANSLATION_3": "Why should I not worship God who has created me? To him you will all return.\n",
        "TRANSLATION_4": "“And what is the matter with me that I should not worship Him Who created me, whereas it is towards Him that you are to return?”\n",
        "TRANSLATION_5": "And why should I not worship Him Who has created me and to Whom you shall be returned.\"\n",
        "TRANSLATION_6": "And what reason have I that I should not serve Him Who brought me into existence? And to Him you shall be brought back;\n",
        "TRANSLATION_7": "And why should I not serve Him who originated me, and unto whom you shall be returned?\n",
        "TRANSLATION_8": "For what cause should I not serve Him Who hath created me, and unto Whom ye will be brought back?\n",
        "TRANSLATION_9": "Why should I not worship Him who has brought me into being, and to whom you shall all be recalled?\n",
        "TRANSLATION_10": "And what aileth me that I should not worship Him who hath created me, and Unto whom ye shall be returned.\n",
        "TRANSLATION_11": "Why should I not worship Him who has originated me, and to whom you shall be brought back?\n",
        "TRANSLATION_12": "It would not be reasonable in me if I did not serve Him Who created me, and to Whom ye shall (all) be brought back.\n",
        "TRANSLATION_13": "And why should I not worship Him (Allah Alone) Who has created me and to Whom you shall be returned.\n",
        "TRANSLATION_14": "Why should I not worship Him who has originated me and to whom you shall all be returned?\n",
        "TRANSLATION_15": "“And why should I not worship Him Who created me, and to Whom you will be returned?\n",
        "TRANSLATION_16": "And why should I not worship He who created me and to whom you will be returned?\n",
        "TRANSLATION_17": "[36:22]   And why should I not worship Him Who originated me, [Him Who] created me — in other words: there is nothing to prevent me from worshipping Him when the necessitating factors for this exist, and the same applies to you — and to Whom you shall be returned?, after death, whereupon He will requite you for your disbelief.\n",
        "TRANSLATION_18": "And he said to them in reply: (For what cause should I not serve Him Who hath created me, and unto Whom ye will be brought back) after you die?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "36:22",
            "26:92",
            "69:39",
            "37:25",
            "37:92",
            "34:25",
            "26:132",
            "109:4",
            "29:21",
            "10:56"
        ],
        "BIBLE": [
            "torah:exodus:3:12",
            "torah:deuteronomy:4:30",
            "prophets:jeremiah:15:19",
            "prophets:jeremiah:5:19",
            "prophets:jeremiah:35:15",
            "writings:ezra:5:5",
            "prophets:ezekiel:46:9",
            "torah:exodus:10:8",
            "prophets:jeremiah:30:24",
            "prophets:jeremiah:23:20"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:3:6",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:14",
            "Sefer%20Yetzirah:3:3"
        ]
    }
}