{
    "VERSE": "36:25",
    "ARABIC": "إِنِّىٓ ءَامَنتُ بِرَبِّكُمْ فَٱسْمَعُونِ",
    "ENGLISH": {
        "TRANSLATION_0": "I have iman in your Lord so listen to me!'",
        "TRANSLATION_1": "I believe in your Lord, so listen to me.\"\n",
        "TRANSLATION_2": "I believe in your Lord; so listen to me.”\n",
        "TRANSLATION_3": "Messengers, listen to me. I believe in your Lord.\"\n",
        "TRANSLATION_4": "“Indeed I have believed in your Lord, so heed me.”\n",
        "TRANSLATION_5": "Verily, I have believed in your Lord, so listen to me!\"\n",
        "TRANSLATION_6": "Surely I believe in your Lord, therefore hear me.\n",
        "TRANSLATION_7": "Behold, I believe in your Lord; therefore hear me!'\n",
        "TRANSLATION_8": "Lo! I have believed in your Lord, so hear me!\n",
        "TRANSLATION_9": "Indeed, I have believed in your Lord, so listen to me.\"\n",
        "TRANSLATION_10": "Verily I believe now in your Lord; so hearken Unto me.\"\n",
        "TRANSLATION_11": "Indeed I have faith in your Lord, so listen to me.’\n",
        "TRANSLATION_12": "For me, I have faith in the Lord of you (all): listen, then, to me!\"\n",
        "TRANSLATION_13": "Verily! I have believed in your Lord, so listen to me!\"\n",
        "TRANSLATION_14": "I believe in your Lord, so hear me'\n",
        "TRANSLATION_15": "I have believed in your Lord, so listen to me.”\n",
        "TRANSLATION_16": "Indeed, I have believed in your Lord, so listen to me.\"\n",
        "TRANSLATION_17": "[36:25] Lo! I believe in your Lord. So listen to me!’, in other words, hear what I have to say; but they stoned him and he died.\n",
        "TRANSLATION_18": "498 (Lo! I have believed in your Lord, so hear me) so obey me regarding faith; it is also said that he said this to the apostles: 'I believe in your Lord, so be witnesses that I am the slave of Allah'. He was then taken away and killed, crucified and trodden upon until his entrails burst forth from his rectum.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "36:25",
            "44:20",
            "54:10",
            "37:31",
            "23:107",
            "26:12",
            "23:26",
            "7:125",
            "23:39",
            "99:5"
        ],
        "BIBLE": [
            "prophets:jeremiah:11:11",
            "torah:exodus:4:1",
            "prophets:ezekiel:13:8",
            "prophets:ii%20kings:17:14",
            "torah:exodus:6:12",
            "prophets:jeremiah:25:8",
            "prophets:ezekiel:34:20",
            "prophets:i%20samuel:12:13",
            "writings:ii%20chronicles:28:11",
            "torah:numbers:32:23"
        ]
    }
}