{
    "VERSE": "36:27",
    "ARABIC": "بِمَا غَفَرَ لِى رَبِّى وَجَعَلَنِى مِنَ ٱلْمُكْرَمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "how my Lord has forgiven me and placed me among the honoured ones!'",
        "TRANSLATION_1": "How my Lord has forgiven me and made me one of those who are honoured!\"\n",
        "TRANSLATION_2": "for what reason Allah has forgiven me and placed me among the honoured ones.”\n",
        "TRANSLATION_3": "(wherein he said), \"Would that people knew how my Lord has granted me forgiveness and honor\".\n",
        "TRANSLATION_4": "“The manner in which my Lord has pardoned me and made me of the honoured ones!”\n",
        "TRANSLATION_5": "That my Lord (Allah) has forgiven me, and made me of the honored ones!\"\n",
        "TRANSLATION_6": "Of that on account of which my Lord has forgiven me and made me of the honored ones!\n",
        "TRANSLATION_7": "that my Lord has forgiven me and that He has placed me among the honoured.'\n",
        "TRANSLATION_8": "With what (munificence) my Lord hath pardoned me and made me of the honoured ones!\n",
        "TRANSLATION_9": "how my Lord has forgiven me and placed me among the honoured ones!\"\n",
        "TRANSLATION_10": "That my Lord hath forgiven me, and hath made me of the honoured ones.\n",
        "TRANSLATION_11": "for what my Lord forgave me and made me one of the honoured ones!’\n",
        "TRANSLATION_12": "For that my Lord has granted me Forgiveness and has enrolled me among those held in honour!\"\n",
        "TRANSLATION_13": "That my Lord (Allah) has forgiven me, and made me of the honoured ones!\"\n",
        "TRANSLATION_14": "that my Lord has forgiven me, and caused me to be amongst the receivers of generosity'\n",
        "TRANSLATION_15": "How my Lord has forgiven me, and made me one of the honored.”\n",
        "TRANSLATION_16": "Of how my Lord has forgiven me and placed me among the honored.\"\n",
        "TRANSLATION_17": "[36:27] with what [munificence] my Lord has forgiven me, [would that they knew] of His great forgiveness, and made me of the honoured ones!’\n",
        "TRANSLATION_18": "(With what (munificence) my Lord hath pardoned me) through believing in Allah's divine Oneness (and made me of the honoured ones) in Paradise, through the reward He bestowed upon me because of the testification of \"there is no deity except Allah!\"\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "36:27",
            "37:100",
            "23:39",
            "23:26",
            "84:2",
            "84:5",
            "26:83",
            "11:47",
            "25:64",
            "23:98"
        ],
        "BIBLE": [
            "torah:leviticus:10:3",
            "writings:psalms:83:4",
            "prophets:ii%20kings:18:36",
            "writings:nehemiah:5:8",
            "torah:exodus:5:1",
            "writings:nehemiah:8:11",
            "torah:genesis:21:6",
            "torah:exodus:3:7",
            "torah:genesis:24:21",
            "writings:nehemiah:5:7"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:13",
            "Sefer%20Yetzirah:1:5"
        ]
    }
}