{
    "VERSE": "36:32",
    "ARABIC": "وَإِن كُلٌّ لَّمَّا جَمِيعٌ لَّدَيْنَا مُحْضَرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Each and every one will be summoned to Our presence.",
        "TRANSLATION_1": "They will all be brought together before Us.\n",
        "TRANSLATION_2": "All of them shall (one day) be gathered before Us.\n",
        "TRANSLATION_3": "They will all be brought into Our presence together.\n",
        "TRANSLATION_4": "And without exception, all of them will be brought forth before Us.\n",
        "TRANSLATION_5": "And surely, all -- everyone of them will be brought before Us.\n",
        "TRANSLATION_6": "And all of them shall surely be brought before Us.\n",
        "TRANSLATION_7": "They shall every one of them be arraigned before Us.\n",
        "TRANSLATION_8": "But all, without exception, will be brought before Us.\n",
        "TRANSLATION_9": "All of them, gathered together, will certainly be brought before Us.\n",
        "TRANSLATION_10": "And surely all, every one of them, shall be brought before us.\n",
        "TRANSLATION_11": "And all of them will indeed be presented before Us.\n",
        "TRANSLATION_12": "But each one of them all - will be brought before Us (for judgment).\n",
        "TRANSLATION_13": "And surely, all, everyone of them will be brought before Us.\n",
        "TRANSLATION_14": "all shall be arraigned before Us.\n",
        "TRANSLATION_15": "All of them, every single one of them, will be arraigned before Us.\n",
        "TRANSLATION_16": "And indeed, all of them will yet be brought present before Us.\n",
        "TRANSLATION_17": "[36:32] And indeed (in, is either for negation or is in its softened form) every one of them, that is, every single creature (kullun is the subject) will be gathered (jamī‘un is the predicate of the subject) before Us, at the Scene, following their resurrection, arraigned (muhdarūna is a second predicate) for the Reckoning (read lammā with the sense of illā, or lamā with the lām functioning as a separator and the mā being extra).\n",
        "TRANSLATION_18": "(But all, without exception) He says: all these nations, (will be brought before Us) for reckoning.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "36:32",
            "26:56",
            "38:73",
            "15:30",
            "54:44",
            "37:134",
            "26:65",
            "43:55",
            "25:39",
            "15:17"
        ],
        "BIBLE": [
            "torah:exodus:16:26",
            "prophets:i%20samuel:17:16",
            "prophets:haggai:2:19",
            "writings:psalms:17:2",
            "torah:leviticus:14:2",
            "prophets:isaiah:24:22",
            "torah:exodus:16:5",
            "writings:ii%20chronicles:29:4",
            "torah:leviticus:26:25",
            "prophets:joel:4:2"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:11",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:4:6"
        ]
    }
}