{
    "VERSE": "36:34",
    "ARABIC": "وَجَعَلْنَا فِيهَا جَنَّٰتٍ مِّن نَّخِيلٍ وَأَعْنَٰبٍ وَفَجَّرْنَا فِيهَا مِنَ ٱلْعُيُونِ",
    "ENGLISH": {
        "TRANSLATION_0": "We place in it gardens of dates and grapes, and cause springs to gush out in it,",
        "TRANSLATION_1": "We have laid out gardens of dates and grapes upon it, and made springs of water flow,\n",
        "TRANSLATION_2": "We made in it gardens of date-palms and vines, and We caused springs to gush forth\n",
        "TRANSLATION_3": "and produced therein grains from which they eat and established therein gardens of palms trees and vineyards and have made streams flow therein\n",
        "TRANSLATION_4": "And We have placed in it gardens of dates and grapes, and We have made springs of water in it.\n",
        "TRANSLATION_5": "And We have made therein gardens of date palms and grapes, and We have caused springs of water to gush forth therein.\n",
        "TRANSLATION_6": "And We make therein gardens of palms and grapevines and We make springs to flow forth in it,\n",
        "TRANSLATION_7": "and We made therein gardens of palms and vines, and therein We caused fountains to gush forth,\n",
        "TRANSLATION_8": "And We have placed therein gardens of the date-palm and grapes, and We have caused springs of water to gush forth therein,\n",
        "TRANSLATION_9": "We have placed in it gardens of date palms and vines, and caused springs to gush [forth] from it,\n",
        "TRANSLATION_10": "And We place therein gardens of the date-palms and vines; and We therein cause to gush forth springs.\n",
        "TRANSLATION_11": "We make in it orchards of date palms and vines, and We cause springs to gush forth in it,\n",
        "TRANSLATION_12": "And We produce therein orchard with date-palms and vines, and We cause springs to gush forth therein:\n",
        "TRANSLATION_13": "And We have made therein gardens of date-palms and grapes, and We have caused springs of water to gush forth therein.\n",
        "TRANSLATION_14": "And there We made gardens of palms and vines, and in it We caused fountains to gush forth,\n",
        "TRANSLATION_15": "And We place in it gardens of palm-trees and vines, and cause springs to gush out of it.\n",
        "TRANSLATION_16": "And We placed therein gardens of palm trees and grapevines and caused to burst forth therefrom some springs -\n",
        "TRANSLATION_17": "[36:34] and We have placed therein gardens, orchards, of date-palms and vines, and We have caused, a number of, springs to gush forth therein,\n",
        "TRANSLATION_18": "And We have placed therein) in the earth (gardens of the date-palm and grapes, and We have caused springs of water to gush forth therein) i.e. rivers therein.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "36:34",
            "17:91",
            "26:57",
            "51:15",
            "15:45",
            "26:147",
            "44:52",
            "23:19",
            "44:25",
            "26:134"
        ],
        "BIBLE": [
            "prophets:isaiah:41:18",
            "prophets:isaiah:58:11",
            "prophets:amos:9:14",
            "torah:leviticus:16:24",
            "writings:psalms:46:5",
            "prophets:hosea:2:14",
            "prophets:jeremiah:51:36",
            "prophets:isaiah:63:12",
            "prophets:isaiah:36:16",
            "prophets:ii%20kings:18:31"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:3:7",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:1:12"
        ]
    }
}