{
    "VERSE": "36:35",
    "ARABIC": "لِيَأْكُلُوا۟ مِن ثَمَرِهِۦ وَمَا عَمِلَتْهُ أَيْدِيهِمْ أَفَلَا يَشْكُرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "so they may eat its fruits - they did not do it themselves. So will they not be thankful?",
        "TRANSLATION_1": "So that they may eat of its fruit; yet it was not done by their hands. Then why do they not acknowledge thanks?\n",
        "TRANSLATION_2": "that they might eat of its fruits. It was not their hands that made them. Will they not, then, give thanks?\n",
        "TRANSLATION_3": "so that they may consume the fruits and whatever their hands prepare. Will they not then be grateful?\n",
        "TRANSLATION_4": "So that they may eat from its fruits, whereas they are not manufactured by their hands! So will they not be grateful?\n",
        "TRANSLATION_5": "So that they may eat of the fruit thereof -- and their hands made it not. Will they not then give thanks\n",
        "TRANSLATION_6": "That they may eat of the fruit thereof, and their hands did not make it; will they not then be grateful?\n",
        "TRANSLATION_7": "that they might eat of its fruits and their hands' labour. What, will they not be thankful?\n",
        "TRANSLATION_8": "That they may eat of the fruit thereof, and their hands made it not. Will they not, then, give thanks?\n",
        "TRANSLATION_9": "so that they may eat its fruit, though it was not their hands that made this. Will they not then be grateful?\n",
        "TRANSLATION_10": "That they may eat of the fruit thereof; and their hands worked it not. Will they not, therefore, give thanks?\n",
        "TRANSLATION_11": "so that they may eat of its fruit and what their hands have cultivated. Will they not then give thanks?\n",
        "TRANSLATION_12": "That they may enjoy the fruits of this (artistry): It was not their hands that made this: will they not then give thanks?\n",
        "TRANSLATION_13": "So that they may eat of the fruit thereof, and their hands made it not. Will they not, then, give thanks?\n",
        "TRANSLATION_14": "so that they might eat of its fruit and the labor of their hands. Will they not give thanks?\n",
        "TRANSLATION_15": "That they may eat from its fruits, although their hands did not make it. Will they not be appreciative?\n",
        "TRANSLATION_16": "That they may eat of His fruit. And their hands have not produced it, so will they not be grateful?\n",
        "TRANSLATION_17": "[36:35] that they might eat of its fruits (read thamarihi or thumurihi) in other words, [of] the fruits of the mentioned date-palms and otherwise; but it was not their hands that made it, namely, they did not cultivate the fruits. Will they not then give thanks?, for His favours to them, exalted be He?\n",
        "TRANSLATION_18": "(That they may eat of the fruit thereof) of the fruit of the palm-tree, (and their hand made it not) their hands did not make it grow; it is also said that this means: their hands did not plant it. (Will they not, then, 499 give thanks) to the One Who did it and hence believe in Him?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "36:35",
            "36:71",
            "42:30",
            "10:43",
            "32:18",
            "21:27",
            "51:45",
            "43:75",
            "83:33",
            "21:50"
        ],
        "BIBLE": [
            "writings:ecclesiastes:2:11",
            "writings:proverbs:31:31",
            "writings:job:12:9",
            "prophets:isaiah:43:13",
            "writings:psalms:128:2",
            "writings:lamentations:2:20",
            "writings:nehemiah:4:11",
            "writings:psalms:63:5",
            "torah:deuteronomy:32:27",
            "writings:ii%20chronicles:34:25"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:4"
        ]
    }
}