{
    "VERSE": "36:37",
    "ARABIC": "وَءَايَةٌ لَّهُمُ ٱلَّيْلُ نَسْلَخُ مِنْهُ ٱلنَّهَارَ فَإِذَا هُم مُّظْلِمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "A Sign for them is the night: We peel the day away from it and there they are in darkness.",
        "TRANSLATION_1": "And there is a sign in the night for them. We strip off the day from it and they are left in darkness,\n",
        "TRANSLATION_2": "And the night is another Sign for them. We strip the day from it and they become plunged in darkness.\n",
        "TRANSLATION_3": "Of the signs for them is how We separated the day from the night and thus they remained in darkness;\n",
        "TRANSLATION_4": "And a sign for them is the night; We strip the day out of it, thereupon they are in darkness.\n",
        "TRANSLATION_5": "And a sign for them is the night. We withdraw therefrom the day, and behold, they are in darkness.\n",
        "TRANSLATION_6": "And a sign to them is the night: We draw forth from it the day, then lo! they are in the dark;\n",
        "TRANSLATION_7": "And a sign for them is the night; We strip it of the day and lo, they are in darkness.\n",
        "TRANSLATION_8": "A token unto them is night. We strip it of the day, and lo! they are in darkness.\n",
        "TRANSLATION_9": "They have a sign in the night: We withdraw from it the [light of] day -- and they are left in darkness.\n",
        "TRANSLATION_10": "And a sign Unto them is the night. We draw off the day therefrom, and lo! they are darkened.\n",
        "TRANSLATION_11": "A sign for them is the night, which We strip of daylight, and, behold, they find themselves in the dark!\n",
        "TRANSLATION_12": "And a Sign for them is the Night: We withdraw therefrom the Day, and behold they are plunged in darkness;\n",
        "TRANSLATION_13": "And a sign for them is the night, We withdraw therefrom the day, and behold, they are in darkness.\n",
        "TRANSLATION_14": "A sign for them is the night. From it We withdraw the day and they are in darkness.\n",
        "TRANSLATION_15": "Another sign for them is the night: We strip the day out of it—and they are in darkness.\n",
        "TRANSLATION_16": "And a sign for them is the night. We remove from it [the light of] day, so they are [left] in darkness.\n",
        "TRANSLATION_17": "[36:37] And a sign for them, of the tremendous power [of God], is the night, from which We strip, We separate, the day and, behold, they find themselves in darkness, passing into the darkness [of the night].\n",
        "TRANSLATION_18": "(A token) a lesson and sign (unto them) to the people of Mecca (is night) the dark night. (We strip it) We clear it (of the day, and lo! they are in darkness) at night.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "36:37",
            "21:20",
            "76:26",
            "10:67",
            "23:80",
            "27:86",
            "30:23",
            "13:10",
            "91:3",
            "41:37"
        ],
        "BIBLE": [
            "writings:job:17:12",
            "writings:psalms:139:12",
            "prophets:isaiah:5:30",
            "prophets:ezekiel:21:8",
            "torah:genesis:1:14",
            "torah:genesis:1:18",
            "writings:psalms:78:14",
            "writings:ecclesiastes:12:1",
            "prophets:isaiah:60:20",
            "prophets:ezekiel:28:7"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:11",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:4:8",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:1:6"
        ]
    }
}