{
    "VERSE": "36:42",
    "ARABIC": "وَخَلَقْنَا لَهُم مِّن مِّثْلِهِۦ مَا يَرْكَبُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "And We have created for them the like of it in which they sail.",
        "TRANSLATION_1": "And We made similar vessels for them to ride.\n",
        "TRANSLATION_2": "and then created for them other vessels like those on which they ride.\n",
        "TRANSLATION_3": "and created for them similar things to ride.\n",
        "TRANSLATION_4": "And We have created for them similar ships, in which they now ride.\n",
        "TRANSLATION_5": "And We have created for them of the like thereunto, on which they ride.\n",
        "TRANSLATION_6": "And We have created for them the like of it, what they will ride on.\n",
        "TRANSLATION_7": "and We have created for them the like of it whereon they ride;\n",
        "TRANSLATION_8": "And have created for them of the like thereof whereon they ride.\n",
        "TRANSLATION_9": "We have created for them the like of it in which they ride.\n",
        "TRANSLATION_10": "And We have created for them of the like thereUnto whereon they ride.\n",
        "TRANSLATION_11": "and We have created for them what is similar to it, which they ride.\n",
        "TRANSLATION_12": "And We have created for them similar (vessels) on which they ride.\n",
        "TRANSLATION_13": "And We have created for them of the like thereunto, so on them they ride.\n",
        "TRANSLATION_14": "And We have created for them the like of it in which they board.\n",
        "TRANSLATION_15": "And We created for them the like of it, in which they ride.\n",
        "TRANSLATION_16": "And We created for them from the likes of it that which they ride.\n",
        "TRANSLATION_17": "[36:42] and We have created for them the like of it, that is, the like of Noah’s Ark, namely, the small and large ships resembling it which they have made, by the instruction of God, exalted be He, in which they ride.\n",
        "TRANSLATION_18": "(And have created for them of the like thereof) the like of the ship of Noah (whereon they ride) of boats and camels.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "36:42",
            "25:39",
            "56:61",
            "50:35",
            "16:126",
            "26:186",
            "23:81",
            "41:48",
            "94:4",
            "26:211"
        ],
        "BIBLE": [
            "writings:ii%20chronicles:15:18",
            "writings:job:13:20",
            "prophets:ezekiel:22:25",
            "writings:psalms:87:3",
            "prophets:ezekiel:5:9",
            "writings:nehemiah:7:65",
            "torah:exodus:36:33",
            "torah:leviticus:5:5",
            "writings:i%20chronicles:26:20",
            "writings:job:23:14"
        ]
    }
}