{
    "VERSE": "36:44",
    "ARABIC": "إِلَّا رَحْمَةً مِّنَّا وَمَتَٰعًا إِلَىٰ حِينٍ",
    "ENGLISH": {
        "TRANSLATION_0": "except as an act of mercy from Us, to give them enjoyment for a time.",
        "TRANSLATION_1": "Unless by Our benevolence, to reap advantage for a time.\n",
        "TRANSLATION_2": "It is only Our Mercy (that rescues them) and enables enjoyment of life for a while.\n",
        "TRANSLATION_3": "except Our mercy which could enable them to enjoy themselves for an appointed time.\n",
        "TRANSLATION_4": "Unless by mercy from Us, and as a comfort for a while.\n",
        "TRANSLATION_5": "Unless it be a mercy from Us, and as an enjoyment for a while.\n",
        "TRANSLATION_6": "But (by) mercy from Us and for enjoyment till a time.\n",
        "TRANSLATION_7": "save as a mercy from Us, and enjoyment for a while.\n",
        "TRANSLATION_8": "Unless by mercy from Us and as comfort for a while.\n",
        "TRANSLATION_9": "It is only by Our mercy that they are granted provision for a time.\n",
        "TRANSLATION_10": "unless it be a mercy from us, and as an enjoyment for a season.\n",
        "TRANSLATION_11": "except by a mercy from Us and for an enjoyment until some time.\n",
        "TRANSLATION_12": "Except by way of Mercy from Us, and by way of (world) convenience (to serve them) for a time.\n",
        "TRANSLATION_13": "Unless it be a mercy from Us, and as an enjoyment for a while.\n",
        "TRANSLATION_14": "except through Our Mercy and as enjoyment for awhile.\n",
        "TRANSLATION_15": "Except by a mercy from Us, and enjoyment for a while.\n",
        "TRANSLATION_16": "Except as a mercy from Us and provision for a time.\n",
        "TRANSLATION_17": "[36:44] except by a mercy from Us and for an enjoyment until some time, in other words, they can only be saved by Our showing them mercy and Our permitting them to enjoy those pleasures of theirs until their terms [of life] are concluded.\n",
        "TRANSLATION_18": "Unless by mercy from Us) unless by a blessing from Us that will save them from drowning (and as comfort for a while) until the time of their death and destruction.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "36:44",
            "21:111",
            "7:24",
            "37:148",
            "56:73",
            "21:75",
            "21:86",
            "21:107",
            "2:36",
            "79:33"
        ],
        "BIBLE": [
            "writings:proverbs:1:19",
            "writings:job:10:12",
            "writings:daniel:7:12",
            "prophets:jeremiah:51:6",
            "prophets:hosea:10:12",
            "prophets:joshua:22:5",
            "writings:psalms:17:14",
            "writings:psalms:139:24",
            "writings:nehemiah:9:19",
            "writings:proverbs:10:17"
        ]
    }
}