{
    "VERSE": "36:48",
    "ARABIC": "وَيَقُولُونَ مَتَىٰ هَٰذَا ٱلْوَعْدُ إِن كُنتُمْ صَٰدِقِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "And they say, 'When will this promise come about if you are telling the truth?'",
        "TRANSLATION_1": "And they say: \"When will this promise come to pass, if what you say is true?\"\n",
        "TRANSLATION_2": "They say: “When will this threat (of Resurrection) come to pass? Tell us if indeed you are truthful.”\n",
        "TRANSLATION_3": "The unbelievers say, \"When will the Day of Judgment come if what you say is at all true?\"\n",
        "TRANSLATION_4": "And they say, “When will this promise be fulfilled, if you are truthful?”\n",
        "TRANSLATION_5": "And they say: \"When will this promise be fulfilled, if you are truthful\"\n",
        "TRANSLATION_6": "And they say: When will this threat come to pass, if you are truthful?\n",
        "TRANSLATION_7": "They also say, 'When shall this promise come to pass, if you speak truly?'\n",
        "TRANSLATION_8": "And they say: When will this promise be fulfilled, if ye are truthful?\n",
        "TRANSLATION_9": "They say, \"When will this promise be fulfilled, if you are truthful?\"\n",
        "TRANSLATION_10": "And they say: when will this promise be fulfilled if ye say sooth?\n",
        "TRANSLATION_11": "And they say, ‘When will this promise be fulfilled, should you be truthful?’\n",
        "TRANSLATION_12": "Further, they say, \"When will this promise (come to pass), if what ye say is true?\"\n",
        "TRANSLATION_13": "And they say: \"When will this promise (i.e. Resurrection) be fulfilled, if you are truthful?\"\n",
        "TRANSLATION_14": "They also say: 'When will this promise be, if what you say is true'\n",
        "TRANSLATION_15": "And they say, “When will this promise be, if you are truthful?”\n",
        "TRANSLATION_16": "And they say, \"When is this promise, if you should be truthful?\"\n",
        "TRANSLATION_17": "[36:48]   And they say, ‘When will this promise, of resurrection, be [fulfilled], if you are being truthful?’, therein.\n",
        "TRANSLATION_18": "(And they say) and the disbelievers of Mecca say: (When will this promise) which you promise us, Muhammad, (be fulfilled, if ye are truthful) that we will be resurrected after death?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "36:48",
            "10:48",
            "34:29",
            "27:71",
            "21:38",
            "67:25",
            "21:9",
            "32:28",
            "50:28",
            "17:108"
        ],
        "BIBLE": [
            "torah:genesis:46:33",
            "prophets:jeremiah:15:2",
            "prophets:nahum:3:7",
            "prophets:jeremiah:3:16",
            "prophets:i%20samuel:2:36",
            "prophets:jeremiah:16:10",
            "torah:genesis:12:12",
            "prophets:isaiah:65:24",
            "prophets:zechariah:13:3",
            "prophets:zechariah:12:9"
        ]
    }
}