{
    "VERSE": "36:50",
    "ARABIC": "فَلَا يَسْتَطِيعُونَ تَوْصِيَةً وَلَآ إِلَىٰٓ أَهْلِهِمْ يَرْجِعُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "They will not be able to make a will or return to their families.",
        "TRANSLATION_1": "Then they would not be able to make a will, or go back to their people.\n",
        "TRANSLATION_2": "and they will not even be able to make a testament, nor to return to their households.\n",
        "TRANSLATION_3": "Then they will not be able to make a will or return to their families.\n",
        "TRANSLATION_4": "Therefore neither able to make a will, nor returning to their homes.\n",
        "TRANSLATION_5": "Then they will not be able to make bequest, nor they will return to their family.\n",
        "TRANSLATION_6": "So they shall not be able to make a bequest, nor shall they return to their families.\n",
        "TRANSLATION_7": "then they will not be able to make any testament, nor will they return to their people.\n",
        "TRANSLATION_8": "Then they cannot make bequest, nor can they return to their own folk.\n",
        "TRANSLATION_9": "They will have no time to make a will, nor shall they return to their own people.\n",
        "TRANSLATION_10": "And they will not be able to make a disposition, nor to their family they return.\n",
        "TRANSLATION_11": "Then they will not be able to make any will, nor will they return to their folks.\n",
        "TRANSLATION_12": "No (chance) will they then have, by will, to dispose (of their affairs), nor to return to their own people!\n",
        "TRANSLATION_13": "Then they will not be able to make bequest, nor they will return to their family.\n",
        "TRANSLATION_14": "Then they will be unable to make a will, nor shall they return to their kinsmen.\n",
        "TRANSLATION_15": "They will not be able to make a will, nor will they return to their families.\n",
        "TRANSLATION_16": "And they will not be able [to give] any instruction, nor to their people can they return.\n",
        "TRANSLATION_17": "[36:50] Then they will not be able to make any testament, that is, to make a bequest, nor will they return to their folk, from their markets and their businesses, rather they will die then and there.\n",
        "TRANSLATION_18": "(Then they cannot make bequest) it is also said that this means: they cannot speak, (nor can they return to their own folk) from the marketplace; it is also said that this means: nor can they answer back their families.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "36:50",
            "84:9",
            "75:33",
            "83:31",
            "37:91",
            "21:7",
            "16:43",
            "26:170",
            "51:45",
            "26:169"
        ],
        "BIBLE": [
            "prophets:ezekiel:35:9",
            "prophets:ii%20samuel:7:11",
            "writings:psalms:45:18",
            "prophets:isaiah:55:11",
            "writings:ezra:5:5",
            "writings:daniel:3:29",
            "prophets:jeremiah:7:16",
            "torah:exodus:30:37",
            "prophets:zephaniah:3:20",
            "prophets:i%20kings:12:9"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:5"
        ]
    }
}