{
    "VERSE": "36:54",
    "ARABIC": "فَٱلْيَوْمَ لَا تُظْلَمُ نَفْسٌ شَيْـًٔا وَلَا تُجْزَوْنَ إِلَّا مَا كُنتُمْ تَعْمَلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Today no self will be wronged in any way. You will only be repaid for what you did.",
        "TRANSLATION_1": "No soul will be wronged the least that Day, nor would be recompensed but only for what it had done.\n",
        "TRANSLATION_2": "Today no one shall suffer the least injustice, and you shall not be recompensed except according to your deeds.\n",
        "TRANSLATION_3": "No soul will be in the least bit wronged on that Day and no one will receive any recompense other than what he deserves for his deeds.\n",
        "TRANSLATION_4": "So this day no soul will be wronged in the least; and you will not be compensated except for your deeds.\n",
        "TRANSLATION_5": "This Day, none will be wronged in anything, nor will you be requited anything except that which you used to do.\n",
        "TRANSLATION_6": "So this day no soul shall be dealt with unjustly in the least; and you shall not be rewarded aught but that which you did.\n",
        "TRANSLATION_7": "So today no soul shall be wronged anything, and you shall not be recompensed, except according to what you have been doing.\n",
        "TRANSLATION_8": "This day no soul is wronged in aught; nor are ye requited aught save what ye used to do.\n",
        "TRANSLATION_9": "On that Day no soul shall suffer the least injustice. You shall be rewarded only according to your deeds.\n",
        "TRANSLATION_10": "To-day no soul will be wronged at all; nor shall ye be requited but for that which ye have been working.\n",
        "TRANSLATION_11": "‘Today no soul will be wronged in the least, nor will you be requited except for what you used to do.’\n",
        "TRANSLATION_12": "Then, on that Day, not a soul will be wronged in the least, and ye shall but be repaid the meeds of your past Deeds.\n",
        "TRANSLATION_13": "This Day (Day of Resurrection), none will be wronged in anything, nor will you be requited anything except that which you used to do.\n",
        "TRANSLATION_14": "Today, no soul shall be wronged a thing. You shall not be recompensed except according to your deeds.\n",
        "TRANSLATION_15": "On that Day, no soul will be wronged in the least, and you will be recompensed only for what you used to do.\n",
        "TRANSLATION_16": "So today no soul will be wronged at all, and you will not be recompensed except for what you used to do.\n",
        "TRANSLATION_17": "[36:54] So today no soul shall be wronged in any way, and you shall not be requited, except, the requital of, what you used to do.\n",
        "TRANSLATION_18": "(This day) which is the Day of Judgement (no soul is wronged in aught) none will have his good deeds decreased or evil works increased; (nor are you requited) in the Hereafter (aught save what ye used to do) and say in the life of this world. 501\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "36:54",
            "2:48",
            "2:123",
            "82:19",
            "16:111",
            "11:105",
            "19:60",
            "10:44",
            "44:41",
            "36:59"
        ],
        "BIBLE": [
            "prophets:i%20samuel:11:13",
            "prophets:micah:3:4",
            "torah:exodus:31:15",
            "torah:exodus:35:2",
            "torah:leviticus:7:18",
            "torah:deuteronomy:31:18",
            "torah:leviticus:19:7",
            "prophets:joshua:7:15",
            "prophets:jeremiah:42:20",
            "torah:deuteronomy:17:4"
        ]
    }
}