{
    "VERSE": "36:55",
    "ARABIC": "إِنَّ أَصْحَٰبَ ٱلْجَنَّةِ ٱلْيَوْمَ فِى شُغُلٍ فَٰكِهُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "The Companions of the Garden are busy enjoying themselves today,",
        "TRANSLATION_1": "Surely the inmates of Paradise will be engaged in pastimes.\n",
        "TRANSLATION_2": "Indeed, the people of Paradise will be busy enjoying themselves:\n",
        "TRANSLATION_3": "The dwellers of Paradise on that day will enjoy themselves.\n",
        "TRANSLATION_4": "Indeed this day the dwellers of Paradise are in comfort, with blissful hearts.\n",
        "TRANSLATION_5": "Verily, the dwellers of the Paradise, that Day, will be busy with joyful things.\n",
        "TRANSLATION_6": "Surely the dwellers of the garden shall on that day be in an occupation quite happy.\n",
        "TRANSLATION_7": "See, the inhabitants of Paradise today are busy in their rejoicing,\n",
        "TRANSLATION_8": "Lo! those who merit paradise this day are happily employed,\n",
        "TRANSLATION_9": "The people of Paradise shall be happily occupied on that Day,\n",
        "TRANSLATION_10": "Verily the fellows of the Garden to-day shall be happily employed.\n",
        "TRANSLATION_11": "Indeed today the inhabitants of paradise rejoice in their engagements\n",
        "TRANSLATION_12": "Verily the Companions of the Garden shall that Day have joy in all that they do;\n",
        "TRANSLATION_13": "Verily, the dwellers of the Paradise, that Day, will be busy in joyful things.\n",
        "TRANSLATION_14": "Indeed, the companions of the Garden are this Day busy in their rejoicing.\n",
        "TRANSLATION_15": "The inhabitants of Paradise, on that Day, will be happily busy.\n",
        "TRANSLATION_16": "Indeed the companions of Paradise, that Day, will be amused in [joyful] occupation -\n",
        "TRANSLATION_17": "[36:55] Indeed today the inhabitants of Paradise are busy (read fī shughlin or fī shughulin), [oblivious] to what the inhabitants of the Fire are suffering, [busy] delighting in pleasures such as deflowering virgins — not busy with anything wearisome, as there is no toil in Paradise — rejoicing, blissful (fākihūna is a second predicate of inna, the first being fī shugulin, ‘busy’);\n",
        "TRANSLATION_18": "(Lo! those who merit Paradise) the inhabitants of Paradise (this day) which is the Day of Judgement (are happily employed) are in comfort, preoccupied from the plight of the inhabitants of the Fire,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "36:55",
            "11:23",
            "46:14",
            "2:82",
            "68:17",
            "59:20",
            "56:38",
            "7:50",
            "25:24",
            "52:17"
        ],
        "BIBLE": [
            "writings:i%20chronicles:29:17",
            "prophets:ezekiel:16:30",
            "torah:numbers:14:14",
            "torah:deuteronomy:1:28",
            "writings:psalms:140:3",
            "writings:ecclesiastes:7:15",
            "prophets:isaiah:66:8",
            "prophets:isaiah:57:18",
            "torah:deuteronomy:15:10",
            "writings:esther:5:9"
        ]
    }
}