{
    "VERSE": "36:56",
    "ARABIC": "هُمْ وَأَزْوَٰجُهُمْ فِى ظِلَٰلٍ عَلَى ٱلْأَرَآئِكِ مُتَّكِـُٔونَ",
    "ENGLISH": {
        "TRANSLATION_0": "they and their wives reclining on couches in the shade.",
        "TRANSLATION_1": "They and their companions will recline on couches in the shade.\n",
        "TRANSLATION_2": "they and their spouses shall be reclining on their couches in shady groves;\n",
        "TRANSLATION_3": "They and their spouses will recline on couches in the shade therein.\n",
        "TRANSLATION_4": "They and their wives are in shades, reclining on thrones.\n",
        "TRANSLATION_5": "They and their wives will be in pleasant shade, reclining on thrones.\n",
        "TRANSLATION_6": "They and their wives shall be in shades, reclining on raised couches.\n",
        "TRANSLATION_7": "they and their spouses, reclining upon couches in the shade;\n",
        "TRANSLATION_8": "They and their wives, in pleasant shade, on thrones reclining;\n",
        "TRANSLATION_9": "they and their wives, shall recline on couches in the shade.\n",
        "TRANSLATION_10": "They and their spouses, in shade on couches shall be reclining.\n",
        "TRANSLATION_11": "—they and their mates, reclining on couches in the shades.\n",
        "TRANSLATION_12": "They and their associates will be in groves of (cool) shade, reclining on Thrones (of dignity);\n",
        "TRANSLATION_13": "They and their wives will be in pleasant shade, reclining on thrones.\n",
        "TRANSLATION_14": "Together with their spouses, they shall recline on couches in the shade.\n",
        "TRANSLATION_15": "They and their spouses, in shades, reclining on couches.\n",
        "TRANSLATION_16": "They and their spouses - in shade, reclining on adorned couches.\n",
        "TRANSLATION_17": "[36:56] they (hum, the subject) and their spouses, beneath the shade (zilāl is the plural of zulla or zill, and is the predicate) in other words, no [blinding] sunlight affects them, reclining upon (muttaki’ūna is a second predicate, connected to ‘alā, ‘upon’) couches (arā’ik is the plural of arīka, which is a bed inside a curtained canopy, or the bedding therein).\n",
        "TRANSLATION_18": "(They and their wives, in pleasant shade, on thrones reclining;\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "36:56",
            "83:23",
            "83:35",
            "50:7",
            "4:57",
            "38:58",
            "75:39",
            "76:13",
            "36:36",
            "26:7"
        ],
        "BIBLE": [
            "prophets:isaiah:14:9",
            "writings:psalms:41:11",
            "torah:deuteronomy:18:18",
            "prophets:i%20kings:5:27",
            "writings:psalms:30:2",
            "prophets:hosea:6:2",
            "prophets:micah:5:4",
            "prophets:jeremiah:25:32",
            "prophets:i%20kings:11:14",
            "prophets:i%20kings:14:14"
        ]
    }
}