{
    "VERSE": "36:6",
    "ARABIC": "لِتُنذِرَ قَوْمًا مَّآ أُنذِرَ ءَابَآؤُهُمْ فَهُمْ غَٰفِلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "so that you may warn a people whose fathers were not warned and who are therefore unaware.",
        "TRANSLATION_1": "That you may warn a people whose ancestors had never been warned, who are therefore heedless.\n",
        "TRANSLATION_2": "so that you may warn a people whose ancestors were not warned before wherefore they are heedless.\n",
        "TRANSLATION_3": "so that you may warn a people who are unaware because their fathers were not warned.\n",
        "TRANSLATION_4": "So that you may warn these people whose ancestors were not warned, they are therefore unaware.\n",
        "TRANSLATION_5": "In order that you may warn a people whose forefathers were not warned, so they are heedless.\n",
        "TRANSLATION_6": "That you may warn a people whose fathers were not warned, so they are heedless.\n",
        "TRANSLATION_7": "that thou mayest warn a people whose fathers were never warned, so they are heedless.\n",
        "TRANSLATION_8": "That thou mayst warn a folk whose fathers were not warned, so they are heedless.\n",
        "TRANSLATION_9": "so that you may warn a people whose fathers were not warned and so they are unaware.\n",
        "TRANSLATION_10": "That thou mayest warn a people whose fathers were not warned; so they are negligent.\n",
        "TRANSLATION_11": "that you may warn a people whose fathers were not warned, so they are oblivious.\n",
        "TRANSLATION_12": "In order that thou mayest admonish a people, whose fathers had received no admonition, and who therefore remain heedless (of the Signs of Allah).\n",
        "TRANSLATION_13": "In order that you may warn a people whose forefathers were not warned, so they are heedless.\n",
        "TRANSLATION_14": "so that you may warn a people whose fathers were not warned, and so were heedless.\n",
        "TRANSLATION_15": "To warn a people whose ancestors were not warned, and so they are unaware.\n",
        "TRANSLATION_16": "That you may warn a people whose forefathers were not warned, so they are unaware.\n",
        "TRANSLATION_17": "[36:6] that you may warn, therewith, a people (qawman, connected to tanzīla, ‘a revelation’) whose fathers were not warned, in the period of the interval (al-fatra), so they, this people, are oblivious, to faith and right guidance.\n",
        "TRANSLATION_18": "(That thou mayst warn) by means of the Qur'an (a folk) i.e. the Quraysh (whose fathers were not warned) by any messenger; it is also said that this means: that you may warn your folk as their fathers were warned, (so they are heedless) of the matter of the Hereafter, i.e. they are in denial of it. 496\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "36:6",
            "26:70",
            "37:69",
            "43:54",
            "37:85",
            "21:53",
            "26:11",
            "20:79",
            "28:25",
            "9:96"
        ],
        "BIBLE": [
            "writings:ii%20chronicles:32:15",
            "prophets:jeremiah:35:16",
            "prophets:jeremiah:7:28",
            "prophets:jeremiah:6:21",
            "torah:numbers:34:14",
            "writings:ii%20chronicles:6:25",
            "prophets:i%20kings:8:34",
            "writings:ruth:2:11",
            "prophets:i%20samuel:12:7",
            "torah:deuteronomy:21:13"
        ]
    }
}