{
    "VERSE": "36:65",
    "ARABIC": "ٱلْيَوْمَ نَخْتِمُ عَلَىٰٓ أَفْوَٰهِهِمْ وَتُكَلِّمُنَآ أَيْدِيهِمْ وَتَشْهَدُ أَرْجُلُهُم بِمَا كَانُوا۟ يَكْسِبُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Today We seal up their mouths and their hands speak to us, and their feet bear witness to what they have earned.",
        "TRANSLATION_1": "We shall seal their lips that day; and their hands will speak, their feet testify to what they had done.\n",
        "TRANSLATION_2": "Today We shall put a seal on their mouths, and their hands will speak to Us and their feet shall bear witness to what they had been doing.\n",
        "TRANSLATION_3": "We shall seal your mouths on that Day, let your hands speak to us and your feet testify to what you had achieved.\n",
        "TRANSLATION_4": "This day We will set a seal on their mouths, and their hands will speak out to Us and their feet will bear witness to their deeds.\n",
        "TRANSLATION_5": "This Day, We shall seal up their mouths, and their hands will speak to Us, and their legs will bear witness to what they used to earn.\n",
        "TRANSLATION_6": "On that day We will set a seal upon their mouths, and their hands shall speak to Us, and their feet shall bear witness of what they earned.\n",
        "TRANSLATION_7": "Today We set a seal on their mouths, and their hands speak to Us, and their feet bear witness as to what they have been earning.\n",
        "TRANSLATION_8": "This day We seal up their mouths, and their hands speak out to Us and their feet bear witness as to what they used to earn.\n",
        "TRANSLATION_9": "Today We shall seal up their mouths and their hands will speak to Us, and their feet will bear witness to their misdeeds.\n",
        "TRANSLATION_10": "To-day We shall seal upon their mouths, and their hands will speak Unto us, and their feet will bear witness of that which they have been earning.\n",
        "TRANSLATION_11": "Today We shall seal their mouths, and their hands shall speak to Us, and their feet shall bear witness concerning what they used to earn.’\n",
        "TRANSLATION_12": "That Day shall We set a seal on their mouths. But their hands will speak to us, and their feet bear witness, to all that they did.\n",
        "TRANSLATION_13": "This Day, We shall seal up their mouths, and their hands will speak to Us, and their legs will bear witness to what they used to earn. (It is said that one's left thigh will be the first to bear the witness). [Tafsir At-Tabari, Vol. 22, Page 24]\n",
        "TRANSLATION_14": "This Day We set a seal on their mouths and their hands speak to Us, and their feet will testify to their earnings.\n",
        "TRANSLATION_15": "On this Day, We will seal their mouths, and their hands will speak to Us, and their feet will testify to everything they had done.\n",
        "TRANSLATION_16": "That Day, We will seal over their mouths, and their hands will speak to Us, and their feet will testify about what they used to earn.\n",
        "TRANSLATION_17": "[36:65] Today We shall seal up their mouths, namely, [the mouths of] the disbelievers for their saying: By God, our Lord, we were never idolaters!’ [Q. 6:23]; and their hands shall speak to Us, and their feet shall bear witness, as will other [parts of their bodies] concerning what they used to earn, and so each limb will speak of that [sinful action] which issued from it.\n",
        "TRANSLATION_18": "(This day) which is the Day of Judgement (We seal up mouths) We prevent them from talking because of their denial, (and hands speak out) revealing what they had struck (and feet bear witness) testify about where they went and their limbs testify (as to what they used to earn) of evil.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "36:65",
            "24:24",
            "70:26",
            "29:55",
            "74:46",
            "36:64",
            "83:11",
            "23:111",
            "85:7",
            "25:27"
        ],
        "BIBLE": [
            "torah:genesis:43:9",
            "prophets:i%20samuel:12:5",
            "prophets:zephaniah:3:16",
            "writings:psalms:91:12",
            "torah:genesis:21:30",
            "prophets:jeremiah:38:22",
            "writings:ii%20chronicles:6:4",
            "writings:psalms:89:26",
            "writings:job:11:13",
            "torah:exodus:23:31"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:11",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:1:8"
        ]
    }
}