{
    "VERSE": "36:69",
    "ARABIC": "وَمَا عَلَّمْنَٰهُ ٱلشِّعْرَ وَمَا يَنۢبَغِى لَهُۥٓ إِنْ هُوَ إِلَّا ذِكْرٌ وَقُرْءَانٌ مُّبِينٌ",
    "ENGLISH": {
        "TRANSLATION_0": "We did not teach him poetry nor would it be right for him. It is simply a reminder and a clear Qur'an",
        "TRANSLATION_1": "We have not taught (Muhammad) to versify, nor is it worthy of him. This is nothing but a reminder and illuminating discourse,\n",
        "TRANSLATION_2": "We did not teach him (to wit, the Messenger) poetry and it does not behove him. This is none but an Admonition, and a Clear Book\n",
        "TRANSLATION_3": "We did not teach him (Muhammad) poetry, nor was he supposed to be a poet. It is only the word (of God) and the illustrious Quran\n",
        "TRANSLATION_4": "And We have not taught him (Prophet Mohammed- peace and blessings be upon him) to recite poetry, nor does it befit him; it is nothing but an advice and the bright Qur’an.\n",
        "TRANSLATION_5": "And We have not taught him poetry, nor is it suitable for him. This is only a Reminder and a plain Qur'an.\n",
        "TRANSLATION_6": "And We have not taught him poetry, nor is it meet for him; it is nothing but a reminder and a plain Quran,\n",
        "TRANSLATION_7": "We have not taught him poetry; it is not seemly for him. It is only a Remembrance and a Clear Koran,\n",
        "TRANSLATION_8": "And We have not taught him (Muhammad) poetry, nor is it meet for him. This is naught else than a Reminder and a Lecture making plain,\n",
        "TRANSLATION_9": "We have not taught him any poetry nor would it be fitting for him. This is merely a Reminder and a clear Quran\n",
        "TRANSLATION_10": "And We have not taught him poetry, nor it befitteth him. This is but an admonition and a Recital luminous:\n",
        "TRANSLATION_11": "We did not teach him poetry, nor does it behoove him. This is just a reminder and a manifest Quran,\n",
        "TRANSLATION_12": "We have not instructed the (Prophet) in Poetry, nor is it meet for him: this is no less than a Message and a Qur'an making things clear:\n",
        "TRANSLATION_13": "And We have not taught him (Muhammad SAW) poetry, nor is it meet for him. This is only a Reminder and a plain Quran.\n",
        "TRANSLATION_14": "We have not taught him (Prophet Muhammad) poetry, nor does it become him. This is only a Remembrance and a Clear Holy Reading (Koran)\n",
        "TRANSLATION_15": "We did not teach him poetry, nor is it proper for him. It is only a reminder, and a Clear Quran.\n",
        "TRANSLATION_16": "And We did not give Prophet Muhammad, knowledge of poetry, nor is it befitting for him. It is not but a message and a clear Qur'an\n",
        "TRANSLATION_17": "[36:69] And We did not teach him, that is, the Prophet, poetry — this was [revealed] to refute their saying, ‘This Qur’ān that he has brought is but poetry!’ — nor is it, poetry, seemly, [nor is it] facilitated, for him. It — that which he has brought — is just Remembrance, an admonition, and a Qur’ān that clarifies, that manifests [God’s] rulings and other matters;\n",
        "TRANSLATION_18": "(And we have not taught him) i.e. Muhammad (pbuh) (poetry, nor is it meet for him) poetry is not appropriate for him. (This is) i.e. the Qur'an (naught else than a Reminder) an admonition (and a Lecture making plain) the lawful and unlawful, the commands and prohibitions,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "36:69",
            "73:4",
            "20:2",
            "84:21",
            "26:99",
            "54:17",
            "54:22",
            "54:32",
            "54:40",
            "17:41"
        ],
        "BIBLE": [
            "torah:exodus:23:13",
            "prophets:ii%20samuel:23:5",
            "prophets:isaiah:55:11",
            "prophets:ii%20samuel:7:21",
            "prophets:micah:3:5",
            "prophets:ii%20samuel:11:25",
            "torah:exodus:34:10",
            "torah:deuteronomy:4:10",
            "torah:leviticus:11:43",
            "torah:numbers:12:6"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:2",
            "Sefer%20Yetzirah:1:4"
        ]
    }
}