{
    "VERSE": "36:72",
    "ARABIC": "وَذَلَّلْنَٰهَا لَهُمْ فَمِنْهَا رَكُوبُهُمْ وَمِنْهَا يَأْكُلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "We have made them tame for them and some they ride and some they eat.",
        "TRANSLATION_1": "Whom We made subservient to them so that some of them they ride and some they eat?\n",
        "TRANSLATION_2": "We have subjected the cattle to them so that some of them they ride and eat the flesh of others.\n",
        "TRANSLATION_3": "We have made the cattle subservient to them so they ride and consume them.\n",
        "TRANSLATION_4": "And have subjected the animals for them, so they ride some animals and eat some?\n",
        "TRANSLATION_5": "And We have subdued them unto them so that some of them they have for riding and some they eat.\n",
        "TRANSLATION_6": "And We have subjected them to them, so some of them they have to ride upon, and some of them they eat.\n",
        "TRANSLATION_7": "We have subdued them to them, and some of them they ride, and some they eat;\n",
        "TRANSLATION_8": "And have subdued them unto them, so that some of them they have for riding, some for food?\n",
        "TRANSLATION_9": "We have subjected these to them, so that some may be used for riding and some for food,\n",
        "TRANSLATION_10": "And We have subdued them Unto them, so that some of them they have for riding and on some of them they feed?\n",
        "TRANSLATION_11": "And We made them tractable for them; so some of them make their mounts and some of them they eat.\n",
        "TRANSLATION_12": "And that We have subjected them to their (use)? of them some do carry them and some they eat:\n",
        "TRANSLATION_13": "And We have subdued them unto them so that some of them they have for riding and some they eat.\n",
        "TRANSLATION_14": "We have subdued these to them, and some of them they ride and some of them they eat;\n",
        "TRANSLATION_15": "And We subdued them for them. Some they ride, and some they eat.\n",
        "TRANSLATION_16": "And We have tamed them for them, so some of them they ride, and some of them they eat.\n",
        "TRANSLATION_17": "[36:72] And We have subdued, We have disposed, these [cattle] for them, so that some of them provide rides for them and some of them they eat.\n",
        "TRANSLATION_18": "(And have subdued them unto them) and made the cattle subservient to them, (so that some of them they have for riding, some for food) their meat is food for them?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "36:72",
            "51:45",
            "26:94",
            "108:2",
            "37:116",
            "84:5",
            "84:2",
            "94:4",
            "26:157",
            "32:30"
        ],
        "BIBLE": [
            "torah:leviticus:16:27",
            "prophets:ii%20kings:9:2",
            "torah:exodus:25:40",
            "torah:genesis:27:7",
            "prophets:i%20kings:8:47",
            "writings:ii%20chronicles:6:37",
            "torah:genesis:27:4",
            "prophets:hosea:12:2",
            "torah:numbers:17:11",
            "torah:leviticus:11:47"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:3:7",
            "Sefer%20Yetzirah:2:2",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:11"
        ]
    }
}