{
    "VERSE": "36:73",
    "ARABIC": "وَلَهُمْ فِيهَا مَنَٰفِعُ وَمَشَارِبُ أَفَلَا يَشْكُرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "And they have other uses for them, and milk to drink. So will they not be thankful?",
        "TRANSLATION_1": "And they derive other advantages and drinks from them. Even then they do not offer thanks,\n",
        "TRANSLATION_2": "They derive a variety of benefits and drinks from them. Will they, then, not give thanks?\n",
        "TRANSLATION_3": "From cattle they get milk and other benefits. Will they not then give thanks?\n",
        "TRANSLATION_4": "And for them in the animals are numerous different benefits and drinks; so will they not be grateful?\n",
        "TRANSLATION_5": "And they have (other) benefits from them, and (they get to) drink. Will they not then be grateful\n",
        "TRANSLATION_6": "And therein they have advantages and drinks; will they not then be grateful?\n",
        "TRANSLATION_7": "other uses also they have in them, and beverages. What, will they not be thankful?\n",
        "TRANSLATION_8": "Benefits and (divers) drinks have they from them. Will they not then give thanks?\n",
        "TRANSLATION_9": "some for milk to drink and some from which other benefits may be received? Will they not be grateful?\n",
        "TRANSLATION_10": "And they have therefrom other benefits and drinks. Will they not then give thanks?\n",
        "TRANSLATION_11": "There are other benefits for them therein, and drinks. Will they not then give thanks?\n",
        "TRANSLATION_12": "And they have (other) profits from them (besides), and they get (milk) to drink. Will they not then be grateful?\n",
        "TRANSLATION_13": "And they have (other) benefits from them (besides), and they get (milk) to drink, will they not then be grateful?\n",
        "TRANSLATION_14": "they also have other uses in them and drinks. What, will they not give thanks!\n",
        "TRANSLATION_15": "And they have in them other benefits, and drinks. Will they not give thanks?\n",
        "TRANSLATION_16": "And for them therein are [other] benefits and drinks, so will they not be grateful?\n",
        "TRANSLATION_17": "[36:73] And there are other benefits for them therein, such as their wool, fur and hairs, and drinks, [made] from their milk (mashārib is the plural of mashrab meaning shurb, ‘a drink’; or [what is meant is] the place [from which the drink issues]). Will they not then give thanks?, to the One Who has bestowed these graces upon them and so become believers? In other words, they do not do [any of] this.\n",
        "TRANSLATION_18": "(Benefits) carrying their loads and trading through them (and (divers) drinks) from their milk (have they) i.e. the people of Mecca (from them) from the cattle. (Will they not then give thanks) to He Who did this for them and, thus, believe in Him?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "36:73",
            "20:89",
            "78:24",
            "51:21",
            "21:100",
            "27:41",
            "30:13",
            "32:18",
            "84:2",
            "84:5"
        ],
        "BIBLE": [
            "torah:genesis:24:46",
            "torah:genesis:24:14",
            "torah:deuteronomy:9:9",
            "torah:numbers:20:19",
            "writings:ii%20chronicles:7:7",
            "prophets:jeremiah:7:9",
            "writings:i%20chronicles:29:14",
            "writings:psalms:30:13",
            "torah:leviticus:21:6",
            "writings:job:35:3"
        ]
    }
}