{
    "VERSE": "36:74",
    "ARABIC": "وَٱتَّخَذُوا۟ مِن دُونِ ٱللَّهِ ءَالِهَةً لَّعَلَّهُمْ يُنصَرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "They have taken gods besides Allah so that perhaps they may be helped.",
        "TRANSLATION_1": "And take other gods apart from God that they may perhaps give them help.\n",
        "TRANSLATION_2": "They set up deities apart from Allah, hoping that they will receive help from them.\n",
        "TRANSLATION_3": "They chose idols besides God in the hope of receiving help from them, but they will not be able to help them.\n",
        "TRANSLATION_4": "And they have appointed Gods other than Allah, that perhaps they may be helped!\n",
        "TRANSLATION_5": "And they have taken besides Allah, gods, hoping that they might be helped.\n",
        "TRANSLATION_6": "And they have taken gods besides Allah that they may be helped.\n",
        "TRANSLATION_7": "Yet they have taken, apart from God, gods; haply they might be helped.\n",
        "TRANSLATION_8": "And they have taken (other) gods beside Allah, in order that they may be helped.\n",
        "TRANSLATION_9": "They have set up other gods besides God, hoping to be helped by them,\n",
        "TRANSLATION_10": "And they have taken beside Allah gods, hoping that haply they may be succoured.\n",
        "TRANSLATION_11": "They have taken gods besides Allah, [hoping] that they might be helped [by the fake deities].\n",
        "TRANSLATION_12": "Yet they take (for worship) gods other than Allah, (hoping) that they might be helped!\n",
        "TRANSLATION_13": "And they have taken besides Allah aliha (gods), hoping that they might be helped (by those so called gods).\n",
        "TRANSLATION_14": "And yet they have taken gods, other than Allah, so that they might helped!\n",
        "TRANSLATION_15": "Yet they have taken to themselves gods other than God, that perhaps they may be helped.\n",
        "TRANSLATION_16": "But they have taken besides Allah [false] deities that perhaps they would be helped.\n",
        "TRANSLATION_17": "[36:74] And they have taken besides God, in other words, other than Him, [other] gods, idols, which they worship, that perhaps they might be helped, protected against God’s chastisement by their gods’ interceding for them, as they are wont to claim.\n",
        "TRANSLATION_18": "(And they have) and the disbelievers of Mecca worshipped ((other) gods) idols (beside Allah, in order that they may be helped) so that they may save them from Allah's punishment.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "36:74",
            "53:58",
            "26:93",
            "72:22",
            "19:81",
            "16:20",
            "21:29",
            "27:43",
            "18:43",
            "21:98"
        ],
        "BIBLE": [
            "writings:nehemiah:5:12",
            "prophets:i%20samuel:7:12",
            "torah:genesis:2:23",
            "torah:numbers:24:23",
            "torah:deuteronomy:3:14",
            "writings:ezra:2:61",
            "writings:nehemiah:7:63",
            "torah:numbers:32:41",
            "prophets:isaiah:41:9",
            "writings:ii%20chronicles:3:17"
        ]
    }
}