{
    "VERSE": "36:75",
    "ARABIC": "لَا يَسْتَطِيعُونَ نَصْرَهُمْ وَهُمْ لَهُمْ جُندٌ مُّحْضَرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "They cannot help them even though they are an army mobilised in their support.",
        "TRANSLATION_1": "They will not be able to help them and will be brought (to Us) as their levied troops.\n",
        "TRANSLATION_2": "Those deities can render them no help. Yet these devotees act as though they were an army in waiting for them.\n",
        "TRANSLATION_3": "Instead, the disbelievers will be brought into the presence of God as the soldiers of the idols.\n",
        "TRANSLATION_4": "They (the appointed Gods) cannot help them; and they and their armies will come (to Us), as captives.\n",
        "TRANSLATION_5": "They cannot help them, but they will be brought forward as a troop (against those who worshipped them).\n",
        "TRANSLATION_6": "(But) they shall not be able to assist them, and they shall be a host brought up before them.\n",
        "TRANSLATION_7": "They cannot help them, though they be hosts made ready for them.\n",
        "TRANSLATION_8": "It is not in their power to help them; but they (the worshippers) are unto them a host in arms.\n",
        "TRANSLATION_9": "but they are not able to help them: rather they will be brought before God as their allied host.\n",
        "TRANSLATION_10": "They are not able to give them succour; whereas they shall be against them host brought forward.\n",
        "TRANSLATION_11": "[But] they cannot help them, while they [themselves] are an army mobilized for their defence.\n",
        "TRANSLATION_12": "They have not the power to help them: but they will be brought up (before Our Judgment-seat) as a troop (to be condemned).\n",
        "TRANSLATION_13": "They cannot help them, but they will be brought forward as a troop against those who worshipped them (at the time of Reckoning).\n",
        "TRANSLATION_14": "They cannot help them, for them (the socalled) army are brought (with them to Hell).\n",
        "TRANSLATION_15": "They cannot help them, although they are arrayed as troops for them.\n",
        "TRANSLATION_16": "They are not able to help them, and they [themselves] are for them soldiers in attendance.\n",
        "TRANSLATION_17": "[36:75] They, their gods, cannot help them — they are being treated as [though they were] rational beings — and they, their idol gods, are their host, as they claim, their supporters, ever-present, [but] in the Fire, together   with them.\n",
        "TRANSLATION_18": "(It is not in their power to help them) the idols are unable to save them from Allah's chastisement; (but they) i.e. the disbelievers of Mecca (are unto them) in falsehood (a host in arms) like slaves standing before the idols.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "36:75",
            "7:192",
            "37:173",
            "21:43",
            "7:197",
            "77:36",
            "36:43",
            "28:6",
            "33:65",
            "27:37"
        ],
        "BIBLE": [
            "writings:ii%20chronicles:16:7",
            "prophets:jeremiah:50:31",
            "writings:ezra:10:14",
            "prophets:isaiah:18:7",
            "writings:ii%20chronicles:24:24",
            "torah:deuteronomy:17:3",
            "prophets:jeremiah:35:17",
            "torah:genesis:21:22",
            "writings:i%20chronicles:12:23",
            "prophets:ii%20kings:17:16"
        ]
    }
}