{
    "VERSE": "36:76",
    "ARABIC": "فَلَا يَحْزُنكَ قَوْلُهُمْ إِنَّا نَعْلَمُ مَا يُسِرُّونَ وَمَا يُعْلِنُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "So do not let their words distress you. We know what they keep secret and what they divulge.",
        "TRANSLATION_1": "So be not grieved by what they say. We certainly know what they hide and disclose.\n",
        "TRANSLATION_2": "Let not their words grieve you. Surely We know all things about them, what they conceal and what they reveal.\n",
        "TRANSLATION_3": "Muhammad, let not their words annoy you. We certainly know whatever they conceal or reveal.\n",
        "TRANSLATION_4": "Therefore (O dear Prophet Mohammed – peace and blessings be upon him) do not grieve because of what they (the disbelievers) say; indeed We know what they conceal and what they disclose.\n",
        "TRANSLATION_5": "So, let not their speech then grieve you. Verily, We know what they conceal and what they reveal.\n",
        "TRANSLATION_6": "Therefore let not their speech grieve you; surely We know what they do in secret and what they do openly.\n",
        "TRANSLATION_7": "So do not let their saying grieve thee; assuredly We know what they keep secret and what they publish.\n",
        "TRANSLATION_8": "So let not their speech grieve thee (O Muhammad). Lo! We know what they conceal and what proclaim.\n",
        "TRANSLATION_9": "Let not their words grieve you. We have knowledge of all that they conceal and all that they reveal.\n",
        "TRANSLATION_10": "So let not their speech grieve thee. Verily We! We know whatsoever they keep secret and whatsoever they make known.\n",
        "TRANSLATION_11": "So do not let their remarks grieve you. We indeed know whatever they hide and whatever they disclose.\n",
        "TRANSLATION_12": "Let not their speech, then, grieve thee. Verily We know what they hide as well as what they disclose.\n",
        "TRANSLATION_13": "So let not their speech, then, grieve you (O Muhammad SAW). Verily, We know what they conceal and what they reveal.\n",
        "TRANSLATION_14": "So do not let their sayings grieve you. Surely, We have knowledge of what they hide and all that they reveal.\n",
        "TRANSLATION_15": "So let their words not sadden you. We know what they conceal, and what they reveal.\n",
        "TRANSLATION_16": "So let not their speech grieve you. Indeed, We know what they conceal and what they declare.\n",
        "TRANSLATION_17": "[36:76] So do not be grieved by their remarks, to you, that you have not been sent [by God] and otherwise. Assuredly We know what they conceal and what they proclaim, in this respect and otherwise, and We will requite them accordingly.\n",
        "TRANSLATION_18": "503 (So let not their speech) their denial (grieve thee) Muhammad. (Lo! We know what they conceal) of plotting and treachery (and proclaim) of enmity.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "36:76",
            "37:161",
            "32:30",
            "43:42",
            "23:95",
            "44:59",
            "26:226",
            "37:116",
            "11:122",
            "37:32"
        ],
        "BIBLE": [
            "torah:numbers:12:6",
            "writings:daniel:2:9",
            "writings:daniel:5:15",
            "torah:exodus:23:13",
            "prophets:ii%20samuel:11:25",
            "prophets:ii%20samuel:7:21",
            "prophets:isaiah:55:11",
            "prophets:i%20samuel:28:2",
            "prophets:jeremiah:42:4",
            "writings:proverbs:22:21"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:10",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:4:2",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:4"
        ]
    }
}