{
    "VERSE": "36:80",
    "ARABIC": "ٱلَّذِى جَعَلَ لَكُم مِّنَ ٱلشَّجَرِ ٱلْأَخْضَرِ نَارًا فَإِذَآ أَنتُم مِّنْهُ تُوقِدُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "He Who produces fire for you from green trees so that you use them to light your fires.'",
        "TRANSLATION_1": "Who gave you fire from a green tree, with which you ignite the flame.\"\n",
        "TRANSLATION_2": "He Who created from a green tree a fire for you, a fire to light your stoves with.”\n",
        "TRANSLATION_3": "He has created fire for you out of the green tree from which you can kindle other fires.\n",
        "TRANSLATION_4": "“The One Who has created for you fire from the green tree, so you kindle from it.”\n",
        "TRANSLATION_5": "He Who produces for you fire out of the green tree, when behold you kindle therewith.\n",
        "TRANSLATION_6": "He Who has made for you the fire (to burn) from the green tree, so that with it you kindle (fire).\n",
        "TRANSLATION_7": "who has made for you out of the green tree fire and lo, from it you kindle.'\n",
        "TRANSLATION_8": "Who hath appointed for you fire from the green tree, and behold! ye kindle from it.\n",
        "TRANSLATION_9": "He who produces fire for you from green trees and from this you kindle fire.\"\n",
        "TRANSLATION_10": "Who giveth you out of the green tree fire, and lo! ye kindle therewith.\n",
        "TRANSLATION_11": "He, who made for you fire out of the green tree, and, behold, you light fire from it!\n",
        "TRANSLATION_12": "The same Who produces for you fire out of the green tree, when behold! ye kindle therewith (your own fires)!\n",
        "TRANSLATION_13": "He, Who produces for you fire out of the green tree, when behold! You kindle therewith.\n",
        "TRANSLATION_14": "who has made fire for you from the green tree with which you kindle'\n",
        "TRANSLATION_15": "He who produced fuel for you from the green trees, with which you kindle a fire.\n",
        "TRANSLATION_16": "[It is] He who made for you from the green tree, fire, and then from it you ignite.\n",
        "TRANSLATION_17": "[36:80] He Who has made for you, and for all human beings, fire from the green tree, namely, [from] the markh and ‘afār [variety], or [from] all trees, except for the jujube (‘unnāb), and, behold, from it you kindle’, [from it] you strike fire: this is proof of the power [of God] to resurrect, for in this [example of the green tree] He has combined [the elements of] water, fire and wood; but neither the water extinguishes the fire, nor does the fire ignite the wood.\n",
        "TRANSLATION_18": "(Who hath appointed for you fire) other than the Fire of punishment (from the green tree, and behold! Ye) people of Mecca (kindle from it) you derive from the green tree fire.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "36:80",
            "3:131",
            "52:14",
            "55:15",
            "56:71",
            "16:10",
            "11:16",
            "88:4",
            "87:12",
            "56:72"
        ],
        "BIBLE": [
            "writings:i%20chronicles:14:12",
            "prophets:jeremiah:17:4",
            "prophets:ezekiel:15:6",
            "prophets:jeremiah:47:7",
            "torah:genesis:9:3",
            "writings:proverbs:8:29",
            "torah:genesis:1:30",
            "torah:genesis:15:3",
            "torah:numbers:18:29",
            "prophets:isaiah:55:4"
        ]
    }
}