{
    "VERSE": "36:82",
    "ARABIC": "إِنَّمَآ أَمْرُهُۥٓ إِذَآ أَرَادَ شَيْـًٔا أَن يَقُولَ لَهُۥ كُن فَيَكُونُ",
    "ENGLISH": {
        "TRANSLATION_0": "His command when He desires a thing is just to say to it, 'Be!' and it is.",
        "TRANSLATION_1": "When He wills a thing He has only to say: \"Be,\" and it is.\n",
        "TRANSLATION_2": "Whenever He wills a thing, He just commands it “Be” and it is.\n",
        "TRANSLATION_3": "Whenever He decides to create something He has only to say, \"Exist,\" and it comes into existence.\n",
        "TRANSLATION_4": "And His only task when He intends a thing is to command it, “Be” – and it thereupon happens!\n",
        "TRANSLATION_5": "Verily, His command, when He intends a thing, is only that He says to it, \"Be!\" -- and it is!\n",
        "TRANSLATION_6": "His command, when He intends anything, is only to say to it: Be, so it is.\n",
        "TRANSLATION_7": "His command, when He desires a thing, is to say to it 'Be,' and it is.\n",
        "TRANSLATION_8": "But His command, when He intendeth a thing, is only that He saith unto it: Be! and it is.\n",
        "TRANSLATION_9": "when He decrees a thing, He need only say, \"Be!\" and it is.\n",
        "TRANSLATION_10": "His affair, when He intendeth a thing, is only that He saith Unto it: be, and it becometh.\n",
        "TRANSLATION_11": "All His command, when He wills something, is to say to it ‘Be,’ and it is.\n",
        "TRANSLATION_12": "Verily, when He intends a thing, His Command is, \"be\", and it is!\n",
        "TRANSLATION_13": "Verily, His Command, when He intends a thing, is only that He says to it, \"Be!\" and it is!\n",
        "TRANSLATION_14": "When He wills a thing, His command is to say to it 'Be', and it is!\n",
        "TRANSLATION_15": "His command, when He wills a thing, is to say to it, “Be,” and it comes to be.\n",
        "TRANSLATION_16": "His command is only when He intends a thing that He says to it, \"Be,\" and it is.\n",
        "TRANSLATION_17": "[36:82] His command, His affair, when He wills a thing, that is, [when He will] to create something, is just to say to it ‘Be’, and it is (a variant reading [for fa-yakūnu] has fa-yakūna, as a supplement to yaqūla, ‘to say’).\n",
        "TRANSLATION_18": "(But His command) regarding the resurrection, (when He intends a thing) when He wishes the resurrection to take place, (is only that he says unto it: Be! and it is) and the coming of the Hour happens.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "36:82",
            "16:40",
            "40:68",
            "3:128",
            "20:26",
            "19:35",
            "20:32",
            "6:159",
            "80:18",
            "43:79"
        ],
        "BIBLE": [
            "torah:leviticus:8:5",
            "torah:genesis:42:36",
            "writings:ecclesiastes:1:10",
            "torah:leviticus:17:2",
            "prophets:judges:4:20",
            "prophets:judges:13:14",
            "torah:leviticus:9:6",
            "prophets:isaiah:45:11",
            "torah:numbers:22:38",
            "writings:job:33:32"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:3:1"
        ]
    }
}