{
    "VERSE": "36:9",
    "ARABIC": "وَجَعَلْنَا مِنۢ بَيْنِ أَيْدِيهِمْ سَدًّا وَمِنْ خَلْفِهِمْ سَدًّا فَأَغْشَيْنَٰهُمْ فَهُمْ لَا يُبْصِرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "We have placed a barrier in front of them and a barrier behind them, blindfolding them so that they cannot see.",
        "TRANSLATION_1": "And We shall raise a barrier in front of them and a barrier behind them, and cover them over so that they will not be able to see.\n",
        "TRANSLATION_2": "and We have put a barrier before them and a barrier behind them, and have covered them up, so they are unable to see.\n",
        "TRANSLATION_3": "We have set-up a barrier in front of and behind them and have made them blind. Thus, they cannot see.\n",
        "TRANSLATION_4": "And We have set a wall before them and a wall behind them, and covered the top – so they are unable to see anything.\n",
        "TRANSLATION_5": "And We have put a barrier before them, and a barrier behind them, and We have covered them up, so that they cannot see.\n",
        "TRANSLATION_6": "And We have made before them a barrier and a barrier behind them, then We have covered them over so that they do not see.\n",
        "TRANSLATION_7": "and We have put before them a barrier and behind them a barrier; and We have covered them, so they do not see.\n",
        "TRANSLATION_8": "And We have set a bar before them and a bar behind them, and (thus) have covered them so that they see not.\n",
        "TRANSLATION_9": "and We have set a barrier before them and a barrier behind them, and We have covered them up so that they cannot see.\n",
        "TRANSLATION_10": "And We have placed before them a barrier and behind them a barrier, so We have covered them, so that they see not.\n",
        "TRANSLATION_11": "And We have put a barrier before them and a barrier behind them, then We have blind-folded them, so they do not see.\n",
        "TRANSLATION_12": "And We have put a bar in front of them and a bar behind them, and further, We have covered them up; so that they cannot see.\n",
        "TRANSLATION_13": "And We have put a barrier before them, and a barrier behind them, and We have covered them up, so that they cannot see.\n",
        "TRANSLATION_14": "We have set a barrier before them and a barrier behind them, and, We have covered them so that they do not see.\n",
        "TRANSLATION_15": "And We placed a barrier in front of them, and a barrier behind them, and We have enshrouded them, so they cannot see.\n",
        "TRANSLATION_16": "And We have put before them a barrier and behind them a barrier and covered them, so they do not see.\n",
        "TRANSLATION_17": "[36:9] And We have set before them a barrier (read saddan or suddan in both instances) and behind them a barrier; so We have covered them, so they do not see — this is also figurative, depicting the way in which the paths of faith are closed to them.\n",
        "TRANSLATION_18": "(And We have set a bar) a veil (before them) of the matter of the Hereafter (and a bar) a veil (behind them) of the matter of this worldly life, (and (thus) have covered them) covered the insight of their hearts (so that they see not) the Truth and guidance; it is also said that this means: We have set a veil before them when they were about to stone the Prophet (pbuh) while he was praying, such that they did not see him; and We set behind them a veil so that they do not see the Companions of the Prophet (pbuh); and because of this veil they were not able to see the Prophet (pbuh) or consequently harm him.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "36:9",
            "21:28",
            "20:110",
            "36:45",
            "72:27",
            "41:42",
            "7:17",
            "2:66",
            "22:76",
            "41:14"
        ],
        "BIBLE": [
            "torah:numbers:4:8",
            "torah:numbers:4:11",
            "torah:numbers:4:15",
            "prophets:ezekiel:24:8",
            "writings:psalms:104:9",
            "prophets:ezekiel:24:7",
            "writings:job:38:10",
            "torah:numbers:4:20",
            "torah:numbers:4:12",
            "prophets:ezekiel:16:18"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:2:4"
        ]
    }
}