{
    "VERSE": "5:1",
    "ARABIC": "بِسْمِ ٱللَّهِ ٱلرَّحْمَٰنِ ٱلرَّحِيمِ يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓا۟ أَوْفُوا۟ بِٱلْعُقُودِ أُحِلَّتْ لَكُم بَهِيمَةُ ٱلْأَنْعَٰمِ إِلَّا مَا يُتْلَىٰ عَلَيْكُمْ غَيْرَ مُحِلِّى ٱلصَّيْدِ وَأَنتُمْ حُرُمٌ إِنَّ ٱللَّهَ يَحْكُمُ مَا يُرِيدُ",
    "ENGLISH": {
        "TRANSLATION_0": "You who have iman! fulfil your contracts. All livestock animals are halal for you, except those that are recited to you now; but it is still not halal to hunt while you are in ihram. Allah makes whatever judgements He wills.",
        "TRANSLATION_1": "O YOU WHO believe, fulfil your obligations. Made lawful (as food) for you are animals except those mentioned (here); but unlawful during Pilgrimage is game. God ordains whatsoever He wills.\n",
        "TRANSLATION_2": "Believers! Honour your bonds! All grazing beasts of the flock are permitted to you except those which are recited to you hereinafter, but you are not allowed to hunt in the state of Ihram (a state of pilgrim sanctity). Indeed Allah decrees as He wills.\n",
        "TRANSLATION_3": "Believers, stand by your contracts (and obligations). Of all animals, cattle has been made lawful for you as food with certain exceptions. Hunting is not lawful for you during ihram (a part of the rituals during pilgrimage). God decrees as He wills.\n",
        "TRANSLATION_4": "O People who Believe! Fulfil your words (agreements); the mute animals are made lawful for you (to eat) except what will be declared to you after this, but do not assume hunting as lawful when you are on the pilgrimage; indeed Allah commands whatever He wills.\n",
        "TRANSLATION_5": "O you who believe! Fulfill (your) obligations. Lawful to you (for food) are all the beasts of cattle except that which will be announced to you (herein), game (also) being unlawful when you assume Ihram. Verily, Allah commands that which He wills.\n",
        "TRANSLATION_6": "O you who believe! fulfill the obligations. The cattle quadrupeds are allowed to you except that which is recited to you, not violating the prohibition against game when you are entering upon the performance of the pilgrimage; surely Allah orders what He desires.\n",
        "TRANSLATION_7": "O believers, fulfil your bonds. Permitted to you is the beast of the flocks, except that which is now recited to you, so that you deem not game permitted to be hunted when you are in pilgrim sanctity. God decrees whatsoever He desires.\n",
        "TRANSLATION_8": "O ye who believe! Fulfil your indentures. The beast of cattle is made lawful unto you (for food) except that which is announced unto you (herein), game being unlawful when ye are on the pilgrimage. Lo! Allah ordaineth that which pleaseth Him.\n",
        "TRANSLATION_9": "Believers, fulfill your obligations. All livestock is lawful for you, other than that which is hereby announced to you. You are forbidden to kill game while you are on a pilgrimage -- God commands what He will.\n",
        "TRANSLATION_10": "O ye who believe! fulfil the compacts. Allowed unto you is the beast of the flock except that which is rehearsed unto you, not allowing the chase while ye are in a state of sanctity. Verily Allah ordaineth whatsoever He will.\n",
        "TRANSLATION_11": "O you who have faith! Keep your agreements. You are permitted animals of grazing livestock, except what is [now] announced to you, disallowing game while you are in pilgrim sanctity. Indeed Allah decrees whatever He desires.\n",
        "TRANSLATION_12": "O ye who believe! fulfil (all) obligations. Lawful unto you (for food) are all four-footed animals, with the exceptions named: But animals of the chase are forbidden while ye are in the sacred precincts or in pilgrim garb: for Allah doth command according to His will and plan.\n",
        "TRANSLATION_13": "O you who believe! Fulfill (your) obligations. Lawful to you (for food) are all the beasts of cattle except that which will be announced to you (herein), game (also) being unlawful when you assume Ihram for Hajj or 'Umrah (pilgrimage). Verily, Allah commands that which He wills.\n",
        "TRANSLATION_14": "Believers, fulfill your obligations. It is lawful for you (to eat the flesh of) the beast among cattle other than that which is recited to you, hunting is forbidden while you are on pilgrimage. Allah decrees what He will.\n",
        "TRANSLATION_15": "O you who believe! Fulfill your commitments. Livestock animals are permitted for you, except those specified to you; but not wild game while you are in pilgrim sanctity. God decrees whatever He wills.\n",
        "TRANSLATION_16": "O you who have believed, fulfill [all] contracts. Lawful for you are the animals of grazing livestock except for that which is recited to you [in this Qur'an] - hunting not being permitted while you are in the state of ihram. Indeed, Allah ordains what He intends.\n",
        "TRANSLATION_17": "[5:1]   O you who believe, fulfil your bonds, the covenants confirmed between you and God and [between you and other] people. Lawful to you is the beast of the flocks, camels, cattle, and sheep [and goats], to eat after slaughtering [them], except that which is now being recited to you, as forbidden in [the verse below] Forbidden to you are carrion…[Q. 5:3]; the exceptive clause here is a discontinuous one, but may also be continuous; the forbidding concerns that which has succumbed to death and the like; game not being lawful to you when you are on pilgrimage (hurum means muhrimūn; ghayra, ‘not’, is in the accusative as [it introduces] a circumstantial qualifier referring to the subject of the pronoun lakum, ‘to you’). Verily, God decrees whatever He desires, in the way of making [things] lawful or otherwise, and there can be no objection thereto.\n",
        "TRANSLATION_18": "And on his authority Ibn 'Abbas said regarding Allah's saying: (0 ye who believe! Fulfil your undertakings): '(0 ye who believe! Fulfil your undertakings) fulfil the pledges that are between you and Allah or between you and other people; it is also said that this means: fulfil the obligations which have been made obligatory upon you and which you accepted on the Day of the Covenant and in this Book. (The beast of cattle is made lawful unto you (for food)) you have a legal dispensation to eat of the meat of game such as wild oxen, wild camels and gazelles (except that which is announced unto you) except that which is recited to you in this no surah, (game being unlawful when ye are on pilgrimage) or in the Sacred Precinct. (Lo! Allah ordaineth that which pleaseth Him) He says: He makes lawful and prohibits what He wills whether you are in a state of ritual consecration or not.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "5:1",
            "5:96",
            "7:140",
            "5:87",
            "40:79",
            "33:9",
            "39:10",
            "33:56",
            "52:43",
            "16:116"
        ],
        "BIBLE": [
            "writings:daniel:2:9",
            "writings:nehemiah:8:12",
            "writings:ii%20chronicles:30:5",
            "prophets:jeremiah:42:4",
            "writings:daniel:6:13",
            "prophets:joel:2:17",
            "prophets:ii%20samuel:23:5",
            "torah:deuteronomy:4:10",
            "prophets:jeremiah:5:14",
            "prophets:ezekiel:13:18"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:1:3"
        ]
    }
}