{
    "VERSE": "5:10",
    "ARABIC": "وَٱلَّذِينَ كَفَرُوا۟ وَكَذَّبُوا۟ بِـَٔايَٰتِنَآ أُو۟لَٰٓئِكَ أَصْحَٰبُ ٱلْجَحِيمِ",
    "ENGLISH": {
        "TRANSLATION_0": "But those who are kafir and deny Our Signs, are the Companions of the Blazing Fire.",
        "TRANSLATION_1": "But those who disbelieve and deny Our revelations are the people of Hell.\n",
        "TRANSLATION_2": "As for those who disbelieve and give the lie to Our signs, they are destined for the Blazing Flame.\n",
        "TRANSLATION_3": "However, the unbelievers who have called Our revelations lies will have hell for their dwelling.\n",
        "TRANSLATION_4": "And those who disbelieve and deny Our signs – it is they who are the people of hell.\n",
        "TRANSLATION_5": "And they who disbelieve and deny Our Ayat are those who will be the dwellers of the Hell-fire.\n",
        "TRANSLATION_6": "And (as for) those who disbelieve and reject our communications, these are the companions of the name.\n",
        "TRANSLATION_7": "And the unbelievers, who cried lies to Our signs -- they shall be the inhabitants of Hell.\n",
        "TRANSLATION_8": "And they who disbelieve and deny Our revelations, such are rightful owners of hell.\n",
        "TRANSLATION_9": "but those who deny the truth and deny Our signs are destined for Hell.\n",
        "TRANSLATION_10": "And those who disbelieve and belie Our signs, they shall be the fellows of the Flaming Fire.\n",
        "TRANSLATION_11": "As for those who are faithless and deny Our signs, they shall be the inmates of hell.\n",
        "TRANSLATION_12": "Those who reject faith and deny our signs will be companions of Hell-fire.\n",
        "TRANSLATION_13": "They who disbelieve and deny our Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) are those who will be the dwellers of the Hell-fire.\n",
        "TRANSLATION_14": "As for those who disbelieve and belie Our verses, they shall become the companions of Hell.\n",
        "TRANSLATION_15": "As for those who disbelieve and reject Our revelations—these are the inmates of Hell.\n",
        "TRANSLATION_16": "But those who disbelieve and deny Our signs - those are the companions of Hellfire.\n",
        "TRANSLATION_17": "[5:10] And they who disbelieve and deny Our signs — they shall be the inhabitants of Hell-fire.\n",
        "TRANSLATION_18": "(And they who disbelieve) in Allah (and deny Our revelations) Muhammad and the Qur'an, (such are rightful owners of hell) the dwellers of the Fire.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "5:10",
            "5:86",
            "22:51",
            "2:39",
            "90:19",
            "7:36",
            "64:10",
            "2:82",
            "43:69",
            "34:38"
        ],
        "BIBLE": [
            "torah:deuteronomy:28:10",
            "prophets:jeremiah:25:29",
            "writings:ii%20chronicles:6:33",
            "torah:genesis:48:6",
            "prophets:i%20kings:8:43",
            "torah:genesis:17:5",
            "prophets:isaiah:1:26",
            "prophets:hosea:1:9",
            "prophets:zechariah:8:3",
            "prophets:amos:9:12"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:12",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:1:14",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:5:2"
        ]
    }
}