{
    "VERSE": "5:102",
    "ARABIC": "قَدْ سَأَلَهَا قَوْمٌ مِّن قَبْلِكُمْ ثُمَّ أَصْبَحُوا۟ بِهَا كَٰفِرِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "People before you asked about them and then later came to reject them.",
        "TRANSLATION_1": "Such things were asked by a people before you, but they disbelieved them afterwards.\n",
        "TRANSLATION_2": "Indeed some people before you had asked such questions and in consequence fell into unbelief.\n",
        "TRANSLATION_3": "People living before you had asked about such things, but then rejected them.\n",
        "TRANSLATION_4": "A nation before you asked about such matters and then disbelieved in them.\n",
        "TRANSLATION_5": "Before you, a community asked such questions, then on that account they became disbelievers.\n",
        "TRANSLATION_6": "A people before you indeed asked such questions, and then became disbelievers on account of them.\n",
        "TRANSLATION_7": "A people before you questioned concerning them, then disbelieved in them.\n",
        "TRANSLATION_8": "A folk before you asked (for such disclosures) and then disbelieved therein.\n",
        "TRANSLATION_9": "Other people before you enquired about such things, but when they were disclosed to them, they refused to carry them out.\n",
        "TRANSLATION_10": "Surely people have asked questions before you, and were then found disbelievers therein.\n",
        "TRANSLATION_11": "Certainly some people asked about them before you and then came to disbelieve in them.\n",
        "TRANSLATION_12": "Some people before you did ask such questions, and on that account lost their faith.\n",
        "TRANSLATION_13": "Before you, a community asked such questions, then on that account they became disbelievers.\n",
        "TRANSLATION_14": "A nation asked about them before you, and with it they became unbelievers.\n",
        "TRANSLATION_15": "A people before you asked about them, but then came to reject them.\n",
        "TRANSLATION_16": "A people asked such [questions] before you; then they became thereby disbelievers.\n",
        "TRANSLATION_17": "[5:102] Verily a people before you asked about them, that is, [they asked] their prophets about such things and they received the response in the form of [revealed] explications of the rules concerning them; and then they disbelieved in them, by neglecting to implement them.\n",
        "TRANSLATION_18": "(A folk before you asked) their prophets ((for such disclosures) and then disbelieved there in) when things were made clear to them, they disbelieved in them.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "5:102",
            "51:46",
            "53:52",
            "39:50",
            "22:42",
            "54:9",
            "44:37",
            "10:13",
            "44:17",
            "51:53"
        ],
        "BIBLE": [
            "writings:ii%20chronicles:14:12",
            "prophets:jeremiah:39:9",
            "prophets:isaiah:30:6",
            "prophets:jeremiah:52:15",
            "writings:daniel:7:20",
            "prophets:ii%20kings:17:15",
            "writings:lamentations:1:7",
            "writings:ii%20chronicles:36:6",
            "writings:psalms:28:9",
            "prophets:ii%20kings:20:17"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:2",
            "Sefer%20Yetzirah:1:2",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:1"
        ]
    }
}