{
    "VERSE": "5:103",
    "ARABIC": "مَا جَعَلَ ٱللَّهُ مِنۢ بَحِيرَةٍ وَلَا سَآئِبَةٍ وَلَا وَصِيلَةٍ وَلَا حَامٍ وَلَٰكِنَّ ٱلَّذِينَ كَفَرُوا۟ يَفْتَرُونَ عَلَى ٱللَّهِ ٱلْكَذِبَ وَأَكْثَرُهُمْ لَا يَعْقِلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Allah did not institute any such thing as bahira or sa'iba or wasila or hami. Those who were kafir invented lies against Allah. Most of them do not use their intellect.",
        "TRANSLATION_1": "God has not sanctioned Baheerah or Sa'ibah, Waseelah or Ham. The unbelievers fabricate lies of God, for many of them are devoid of sense.\n",
        "TRANSLATION_2": "Allah has neither appointed (cattle devoted to idols such as) Bahirah, Sa'ibah, Wasilah nor Ham; but those who disbelieve forge lies against Allah and of them most have no understanding (and therefore succumb to such superstitions).\n",
        "TRANSLATION_3": "God has not instituted the rites of Bahirah, Sa'ibah, Wasilah, nor of Hami (names of certain animals that the pagans would offer as sacrifice). It is the pagans who have attributed falsehood to God. Many of them have no understanding.\n",
        "TRANSLATION_4": "Allah has not appointed (commanded to sacrifice) the camel with ears sliced (Bahira) or the she-camel (Saibah) or the she-goat (Wasilah) or the breeding camel (Hami), but the disbelievers fabricate lies against Allah; and most of them do not have any sense at all.\n",
        "TRANSLATION_5": "Allah has not instituted things like Bahirah or a Sa'ibah or a Wasilah or a Ham. But those who disbelieve invent lies against Allah, and most of them have no understanding.\n",
        "TRANSLATION_6": "Allah has not ordained (the making of) a bahirah or a saibah or a wasilah or a hami but those who disbelieve fabricate a lie against Allah, and most of them do not understand.\n",
        "TRANSLATION_7": "God has not appointed cattle dedicated to idols, such as Bahira, Sa'iba, Wasila, Hami; but the unbelievers forge against God falsehood, and most of them have no understanding.\n",
        "TRANSLATION_8": "Allah hath not appointed anything in the nature of a Bahirah or a Sa'ibah or a Wasilah or a Hami, but those who disbelieve invent a lie against Allah. Most of them have no sense.\n",
        "TRANSLATION_9": "God has ordained no sanctity about animals described as bahirah, or sa'ibah, or wasilah or ham. Those who deny the truth invent falsehoods about God. Most of them do not use their reason:\n",
        "TRANSLATION_10": "Allah hath not appointed aught of the bahira or the sa'iba or the wasila or the ham, those who disbelieve have fabricated a lie against Allah, and most of them reflect not.\n",
        "TRANSLATION_11": "Allah has not prescribed any such thing as Bahirah, Sa’ibah, Waseelah, or Haam; but those who are faithless fabricate lies against Allah, and most of them do not exercise their reason.\n",
        "TRANSLATION_12": "It was not Allah who instituted (superstitions like those of) a slit-ear she-camel, or a she-camel let loose for free pasture, or idol sacrifices for twin-births in animals, or stallion-camels freed from work: It is blasphemers who invent a lie against Allah; but most of them lack wisdom.\n",
        "TRANSLATION_13": "Allah has not instituted things like Bahirah (a she-camel whose milk was spared for the idols and nobody was allowed to milk it) or a Sa'ibah (a she-camel let loose for free pasture for their false gods, e.g. idols, etc., and nothing was allowed to be carried on it), or a Wasilah (a she-camel set free for idols because it has given birth to a she-camel at its first delivery and then again gives birth to a she-camel at its second delivery) or a Ham (a stallion-camel freed from work for their idols, after it had finished a number of copulations assigned for it, all these animals were liberated in honour of idols as practised by pagan Arabs in the pre-Islamic period). But those who disbelieve invent lies against Allah, and most of them have no understanding.\n",
        "TRANSLATION_14": "Allah has not made cattle, a slit eared shecamel, nor a freely grazing shecamel, nor a shecamel that bore twins, nor an uncastrated camel (dedicated to idols), but those who disbelieve invent lies against Allah. Most of them do not understand.\n",
        "TRANSLATION_15": "God did not institute the superstitions of Bahirah, Saibah, Wasilah, or of Hami; but those who disbelieve fabricate lies about God—most of them do not understand.\n",
        "TRANSLATION_16": "Allah has not appointed [such innovations as] bahirah or sa'ibah or wasilah or ham. But those who disbelieve invent falsehood about Allah, and most of them do not reason.\n",
        "TRANSLATION_17": "[5:103] God has not ordained, He has not stipulated [in His Law], anything such as a Bahīra, a Sā’iba, a Wasīla or a Hām, in the way that people did at the time of paganism. Al-Bukhārī reported [in a hadīth] from Sa‘īd b. alMusayyab, who said: ‘The bahīra is that [camel] whose milk is consecrated to idols and whom no human   may milk; the sā’iba is the one they would leave to roam freely for their gods and was forbidden to bear any load; the wasīla is the young she-camel that would give birth to a young female, as its first offspring, followed by another female, bearing one after the other without a male in between: she would then be left to roam freely for their idols; the hām is the mature male camel, which after completing a certain number of copulations with a female, would then be consigned to their idols and be exempt from bearing any load, and they would call it hāmī; but the disbelievers invent lies against God, in this matter, by attributing [the sanctioning of] such [practices] to Him; and most of them do not understand, that this is mendacity, for in this they have [merely] followed the example of their forefathers.\n",
        "TRANSLATION_18": "(Allah hath not appointed anything in the nature of a Bahirah or a Sa'ibah or a Wasilah or a Hami) He says: Allah has not prohibited the Bahirah, the Sa'ibah, the Wasilah or the Hami. As for the Bahirah, it was the norm that if a she-camel delivered on its fifth birthing a male camel, the latter would be immolated and both men and women would eat from it, but if it were a female, they would cleave its ear. The latter is called a Bahirah. The latter's milk and benefits were for men only, to the exclusion of women, and when she died both men and women could share her meat. As for the Sa'ibah, people used to give whatever they were willing to give of cattle and hand it over to the custodians of idols. The latter would offer it to travellers who passed by, the men not the women. The animals offered were also male and never female. When these died both men and women shared its meat. As for the Wasilah, when a sheep had delivered seven times, they used to check the seventh birth. If it were male, they used to immolate it and its meat was shared by men and women. If it were female, women would not be allowed to benefit from it until the animal died. When the animal died, both men and women shared its meat. If it were a twin delivery, male and female, both were spared for the benefit of men only, until their death. When the animal died, both men and women shared their meat. As for the Ham, it is the male camel whose offspring has produced its own offspring, it is said that such an animal has protected its back. This animal is left alone: it is not used for riding or transporting things. It cannot be stopped from drinking of any water or grazing in any pasture, nor can it be stopped from copulating with any she-camel that comes its way. When this animal gets too old or dies, its meat is shared by men and women. Allah says that He did not prescribe any of these practices described above; (but those who disbelieve) i.e. 'Amr ibn Luhayy and his followers (invent a lie against Allah) by declaring the above unlawful [for some]. (Most of them) all of them (have no sense) in relation to Allah's command, that which He has made lawful and that which He has made unlawful.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "5:103",
            "58:14",
            "10:69",
            "16:105",
            "10:60",
            "5:81",
            "12:106",
            "61:7",
            "8:34",
            "16:116"
        ],
        "BIBLE": [
            "writings:ecclesiastes:1:13",
            "torah:deuteronomy:26:13",
            "writings:i%20chronicles:29:14",
            "prophets:isaiah:46:1",
            "writings:ii%20chronicles:30:22",
            "prophets:ii%20kings:17:11",
            "writings:daniel:1:2",
            "torah:deuteronomy:12:21",
            "writings:ii%20chronicles:2:11",
            "prophets:i%20kings:5:9"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:4:1"
        ]
    }
}