{
    "VERSE": "5:104",
    "ARABIC": "وَإِذَا قِيلَ لَهُمْ تَعَالَوْا۟ إِلَىٰ مَآ أَنزَلَ ٱللَّهُ وَإِلَى ٱلرَّسُولِ قَالُوا۟ حَسْبُنَا مَا وَجَدْنَا عَلَيْهِ ءَابَآءَنَآ أَوَلَوْ كَانَ ءَابَآؤُهُمْ لَا يَعْلَمُونَ شَيْـًٔا وَلَا يَهْتَدُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "When they are told, 'Come to what Allah has sent down and to the Messenger,' they say, 'What we found our fathers doing is enough for us.' What! Even if their fathers did not know anything and were not guided!",
        "TRANSLATION_1": "When you say to them: \"Come to what God has revealed, and the Prophet,\" they say: \"Sufficient to us is the faith that our fathers had followed,\" even though their fathers had no knowledge or guidance.\n",
        "TRANSLATION_2": "When they are asked: 'Come to what Allah has revealed, and come to the Messenger', they reply: 'The way of our refathers suffices us.' (Will they continue to follow their forefathers) even though their forefathers might have known nothing, and might have been on the wrong way?\n",
        "TRANSLATION_3": "When they are told to refer to the guidance of God and to the Messenger, they say, \"The tradition of our fathers is sufficient for our guidance,\" even though, in fact, their fathers had neither knowledge nor proper guidance.\n",
        "TRANSLATION_4": "And when it is said to them, “Come towards what Allah has sent down and towards the Noble Messenger”, they say, “Sufficient for us is what we found our forefathers upon”; even if their forefathers did not have knowledge nor had guidance?\n",
        "TRANSLATION_5": "And when it is said to them: \"Come to what Allah has revealed and unto the Messenger.\" They say: \"Enough for us is that which we found our fathers following,\" even though their fathers had no knowledge whatsoever and no guidance.\n",
        "TRANSLATION_6": "And when it is said to them, Come to what Allah has revealed and to the Apostle, they say: That on which we found our fathers is sufficient for us. What! even though their fathers knew nothing and did not follow the right way.\n",
        "TRANSLATION_7": "And when it is said to them, 'Come now to what God has sent down, and the Messenger, they say, 'Enough for us is what we found our fathers doing.' What, even if their fathers had knowledge of naught and were not guided?\n",
        "TRANSLATION_8": "And when it is said unto them: Come unto that which Allah hath revealed and unto the messenger, they say: Enough for us is that wherein we found our fathers. What! Even though their fathers had no knowledge whatsoever, and no guidance?\n",
        "TRANSLATION_9": "when it is said to them, \"Come to what God has sent down and to the Messenger.\" They reply, \"The faith we have inherited from our fathers is sufficient for us.\" Even though their forefathers knew nothing and were not guided!\n",
        "TRANSLATION_10": "And when it is said unto them: come to that which Allah hath sent down and to the apostle, they say: enough for us is that whereon we found our fathers. What! even though their fathers knew not aught nor were guided.\n",
        "TRANSLATION_11": "When they are told, ‘Come to what Allah has sent down and [come] to the Apostle,’ they say, ‘Sufficient for us is what we have found our fathers following.’ What, even if their fathers did not know anything and were not guided?!\n",
        "TRANSLATION_12": "When it is said to them: \"Come to what Allah hath revealed; come to the Messenger\": They say: \"Enough for us are the ways we found our fathers following.\" what! even though their fathers were void of knowledge and guidance?\n",
        "TRANSLATION_13": "And when it is said to them: \"Come to what Allah has revealed and unto the Messenger (Muhammad SAW for the verdict of that which you have made unlawful).\" They say: \"Enough for us is that which we found our fathers following,\" even though their fathers had no knowledge whatsoever and no guidance.\n",
        "TRANSLATION_14": "When it is said to them: 'Come to that which Allah has sent down, and to the Messenger' they reply: 'Sufficient for us is what we have found our fathers upon' even though their fathers knew nothing and were not guided.\n",
        "TRANSLATION_15": "And when it is said to them, “Come to what God has revealed, and to the Messenger,” they say, “Sufficient for us is what we found our forefathers upon.” Even if their forefathers knew nothing, and were not guided?\n",
        "TRANSLATION_16": "And when it is said to them, \"Come to what Allah has revealed and to the Messenger,\" they say, \"Sufficient for us is that upon which we found our fathers.\" Even though their fathers knew nothing, nor were they guided?\n",
        "TRANSLATION_17": "[5:104] And when it is said to them, ‘Come to what God has revealed and to the Messenger’, that is, to His ruling concerning the permitting of what you have forbidden, they say, ‘What we have found our fathers following suffices us’, in the way of religion and laws. God, exalted be He, says: What, does that suffice them, even if their fathers knew nothing and were not guided?, to any truth (the interrogative is meant as a disavowal).\n",
        "TRANSLATION_18": "(And when it is said unto them) when the Prophet (pbuh) said to the idolaters of Mecca: (Come unto that which Allah hath revealed) come and make lawful that which Allah has clarified in the Qur'an (and unto the messenger) and come to that which the Messenger has shown you to be lawful, (they say: Enough for us) enough prohibition for us (is that wherein we found our fathers. What! Even though their fathers had no knowledge whatsoever) regarding Allah's divine Oneness and religion, (and no guidance) to the practice of any prophet; it is also said that this means: were not their fathers completely ignorant of the religion and not guided to the practice of the Prophet? How then can their example be followed?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "5:104",
            "2:170",
            "16:35",
            "4:61",
            "31:21",
            "7:28",
            "9:59",
            "5:99",
            "3:144",
            "4:80"
        ],
        "BIBLE": [
            "torah:exodus:3:13",
            "prophets:judges:2:19",
            "writings:ii%20chronicles:21:12",
            "prophets:jeremiah:16:19",
            "writings:ii%20chronicles:25:16",
            "prophets:i%20kings:20:10",
            "prophets:ii%20kings:5:8",
            "prophets:zechariah:1:4",
            "prophets:i%20kings:13:12",
            "prophets:ii%20kings:6:19"
        ]
    }
}