{
    "VERSE": "5:105",
    "ARABIC": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ عَلَيْكُمْ أَنفُسَكُمْ لَا يَضُرُّكُم مَّن ضَلَّ إِذَا ٱهْتَدَيْتُمْ إِلَى ٱللَّهِ مَرْجِعُكُمْ جَمِيعًا فَيُنَبِّئُكُم بِمَا كُنتُمْ تَعْمَلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "You who have iman! you are only responsible for yourselves. The misguided cannot harm you as long as you are guided. All of you will return to Allah and He will inform you about what you were doing.",
        "TRANSLATION_1": "O you who believe, on you rests (the responsibility) for your own selves. If you follow the right path those who have gone astray will not be able to do you harm. To God have all of you to return, when He will tell you what you were doing.\n",
        "TRANSLATION_2": "Believers! Take heed of your own selves. If you are rightly guided, the error of he who strays will not harm you. To Allah will all of you return; then He will let all of you know what you did.\n",
        "TRANSLATION_3": "Believers, save your own souls, for if you have the right guidance, no one who strays can harm you. You will all return to God who will tell you about what you have done.\n",
        "TRANSLATION_4": "O People who Believe! Fear for your own souls; he who has strayed cannot harm you in the least if you are on guidance; towards Allah only you will all return – He will then inform you of what you used to do.\n",
        "TRANSLATION_5": "O you who believe! Take care of yourselves. If you follow the right guidance, no hurt can come to you from those who are in error. The return of you all is to Allah, then He will inform you about (all) that you used to do.\n",
        "TRANSLATION_6": "O you who believe! take care of your souls; he who errs cannot hurt you when you are on the right way; to Allah is your return, of all (of you), so He will inform you of what you did.\n",
        "TRANSLATION_7": "O believers, look after your own souls. He who is astray cannot hurt you, if you are rightly guided. Unto God shall you return, all together, and He will tell you what you were doing.\n",
        "TRANSLATION_8": "O ye who believe! Ye have charge of your own souls. He who erreth cannot injure you if ye are rightly guided. Unto Allah ye will all return; and then He will inform you of what ye used to do.\n",
        "TRANSLATION_9": "Believers, take care of your own souls. The misguided cannot harm you as long as you are guided. All of you will return to God. Then He will make you realize that which you used to do.\n",
        "TRANSLATION_10": "O ye who believe! on you resteth the case of yourselves; it can hurt you not as to whosoever strayeth so long as ye keep yourselves guided. Unto Allah is the return of you all; then He shall declare unto you that which ye were wont to work.\n",
        "TRANSLATION_11": "O you who have faith! Take care of your own souls. He who strays cannot hurt you if you are guided. To Allah will be the return of you all, whereat He will inform you concerning what you used to do.\n",
        "TRANSLATION_12": "O ye who believe! Guard your own souls: If ye follow (right) guidance, no hurt can come to you from those who stray. the goal of you all is to Allah: it is He that will show you the truth of all that ye do.\n",
        "TRANSLATION_13": "O you who believe! Take care of your ownselves, [do righteous deeds, fear Allah much (abstain from all kinds of sins and evil deeds which He has forbidden) and love Allah much (perform all kinds of good deeds which He has ordained)]. If you follow the right guidance and enjoin what is right (Islamic Monotheism and all that Islam orders one to do) and forbid what is wrong (polytheism, disbelief and all that Islam has forbidden) no hurt can come to you from those who are in error. The return of you all is to Allah, then He will inform you about (all) that which you used to do.\n",
        "TRANSLATION_14": "Believers, look after your own souls, he who goes astray cannot harm you if you are guided. You shall all return to Allah, and He will inform you of what you have done.\n",
        "TRANSLATION_15": "O you who believe! You are responsible for your own souls. He who has strayed cannot harm you if you are guided. To God is you return, all of you, and He will inform you of what you used to do.\n",
        "TRANSLATION_16": "O you who have believed, upon you is [responsibility for] yourselves. Those who have gone astray will not harm you when you have been guided. To Allah is you return all together; then He will inform you of what you used to do.\n",
        "TRANSLATION_17": "[5:105] O you who believe, you are responsible for your own souls, in other words, preserve them and do what is in their best interest; he who is astray cannot hurt you, if you are rightly guided: it is said that this means, ‘None of those misguided ones from among the People of the Scripture can hurt you’; it is also said to mean others, on the basis of the [following] hadīth of Abū Tha‘laba al-Khushanī: ‘I asked the Messenger of God (s) about it [this verse] and he said, “Enjoin one other to decency and forbid one another indecency, and then if you see niggardliness being obeyed, whims being followed, this present world being preferred, and every intelligent person proud of his own opinions, then you are [still] responsible for [looking after] your own soul”,’ as reported by al-Hākim and others. Unto God you shall return, all together, and He will inform you of what you used to do, and requite you for it.\n",
        "TRANSLATION_18": "(0 ye who believe! Ye have charge of your own souls) hasten to save your own persons. (He who erreth) the error of the one who errs (cannot injure you if you are rightly guided) to faith and further show their error. (Unto Allah ye will all return) after you die; (and then He will inform you of what ye used to do) and say of good and evil. This verse was revealed about the idolaters of Mecca when the Prophet (pbuh) accepted the capitation tax from the people of the Book and then refused to take it from them. This story has already been mentioned in surah al-Baqarah.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "5:105",
            "63:11",
            "10:100",
            "2:9",
            "39:53",
            "2:72",
            "4:49",
            "59:18",
            "58:11",
            "2:272"
        ],
        "BIBLE": [
            "writings:ezra:5:5",
            "prophets:ezekiel:13:18",
            "writings:daniel:2:9",
            "prophets:i%20samuel:9:27",
            "prophets:ezekiel:39:7",
            "torah:genesis:35:3",
            "writings:nehemiah:8:12",
            "writings:daniel:4:15",
            "prophets:ii%20samuel:15:20",
            "prophets:ezekiel:35:9"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:13"
        ]
    }
}