{
    "VERSE": "5:107",
    "ARABIC": "فَإِنْ عُثِرَ عَلَىٰٓ أَنَّهُمَا ٱسْتَحَقَّآ إِثْمًا فَـَٔاخَرَانِ يَقُومَانِ مَقَامَهُمَا مِنَ ٱلَّذِينَ ٱسْتَحَقَّ عَلَيْهِمُ ٱلْأَوْلَيَٰنِ فَيُقْسِمَانِ بِٱللَّهِ لَشَهَٰدَتُنَآ أَحَقُّ مِن شَهَٰدَتِهِمَا وَمَا ٱعْتَدَيْنَآ إِنَّآ إِذًا لَّمِنَ ٱلظَّٰلِمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "If it then comes to light that the two of them have merited the allegation of wrongdoing, two others who have the most right to do so should take their place and swear by Allah: 'Our testimony is truer than their testimony. We have not committed perjury. If we had we would indeed be wrongdoers.'",
        "TRANSLATION_1": "If it transpires they have concealed the truth, two of those who are immediately concerned should take their place and swear by God: \"Our testimony is truer than theirs. We have stated no more (than the truth), or else we shall be unjust\"\n",
        "TRANSLATION_2": "Then if it is discovered later that the two are guilty of such sin, then two others shall stand in their place from among those against whom the two had sinfully deposed, and swear by Allah: 'Our testimony is truer than the testimony of the other two, and we have not transgressed in our statement; for then indeed we would become wrong-doers.'\n",
        "TRANSLATION_3": "If their honesty is challenged, two others from the relatives of the deceased should swear in the same way and testify to the bequest saying, \"We swear by God that our testimony is the true one. We do not transgress in the matter lest we become unjust ones.\"\n",
        "TRANSLATION_4": "Then if it is later known that both of them committed sin, two others may take their place, from those who were caused the most harm by the false testimony, and they must swear by Allah that, “Our testimony is more accurate than the testimony of these two, and we have not exceeded the limits – if we do, then surely we shall be of the unjust.”\n",
        "TRANSLATION_5": "If it then becomes known that these two had been guilty of sin, let two others stand forth in their places, nearest in kin from among those who claim a lawful right. Let them swear by Allah (saying): \"We affirm that our testimony is truer than that of both of them, and that we have not trespassed (the truth), for then indeed we should be of the wrongdoers.\"\n",
        "TRANSLATION_6": "Then if it becomes known that they both have been guilty of a sin, two others shall stand up in their place from among those who have a claim against them, the two nearest in kin; so they two should swear by Allah: Certainly our testimony is truer than the testimony of those two, and we have not exceeded the limit, for then most surely we should be of the unjust.\n",
        "TRANSLATION_7": "But if it be discovered that both of them have merited the accusation of any sin, then two others shall stand in their place, these being the nearest of those most concerned, and they shall swear by God, 'Our testimony is truer than their testimony, and we have not transgressed, for then we would assuredly be among the evildoers.'\n",
        "TRANSLATION_8": "But then, if it is afterwards ascertained that both of them merit (the suspicion of) sin, let two others take their place of those nearly concerned, and let them swear by Allah, (saying): Verily our testimony is truer than their testimony and we have not transgressed (the bounds of duty), for them indeed we should be of the evil-doers.\n",
        "TRANSLATION_9": "If it turns out that both prove dishonest, two others should take their place from amongst those whose rights have been usurped and let them swear by God, saying, \"Our testimony is indeed truer than the testimony of these two. And we have not been guilty of any misstatement for then indeed we would be transgressors.\"\n",
        "TRANSLATION_10": "If then it be lit upon that the twain had been guilty of a sin, then two othershall take their place from among those who were sinned against, the two nearest of kin, and they shall swear by Allah affirming: our testimony is worthier of credit than their testimony and we have not trespassed, for then verily we shall be of the wrong-doers.\n",
        "TRANSLATION_11": "But if it is found that both of them were guilty of a sin, then two others shall stand up in their place from among those nearest in kinship to the claimants and swear by Allah: ‘Our testimony is surely truer than their testimony, and we have not transgressed, for then we would indeed be among the wrongdoers.’\n",
        "TRANSLATION_12": "But if it gets known that these two were guilty of the sin (of perjury), let two others stand forth in their places,- nearest in kin from among those who claim a lawful right: let them swear by Allah: \"We affirm that our witness is truer than that of those two, and that we have not trespassed (beyond the truth): if we did, behold! the wrong be upon us!\"\n",
        "TRANSLATION_13": "If then it gets known that these two had been guilty of sin, let two others stand forth in their places, nearest in kin from among those who claim a lawful right. Let them swear by Allah (saying): \"We affirm that our testimony is truer than that of both of them, and that we have not trespassed (the truth), for then indeed we should be of the wrong-doers.\"\n",
        "TRANSLATION_14": "But if it is discovered that both of them have been subject to sinning, then two others shall stand in their place, these being the nearest of those most concerned, and they shall swear by Allah: 'Our testimony is truer than their testimony, and we have not transgressed, because then we would surely be among the harmdoers'\n",
        "TRANSLATION_15": "If it is discovered that they are guilty of perjury: let two others take their place, two from among those responsible for the claim, and have them swear by God, “Our testimony is more truthful than their testimony, and we will not be biased, for then we would be wrongdoers.”\n",
        "TRANSLATION_16": "But if it is found that those two were guilty of perjury, let two others stand in their place [who are] foremost [in claim] from those who have a lawful right. And let them swear by Allah, \"Our testimony is truer than their testimony, and we have not transgressed. Indeed, we would then be of the wrongdoers.\"\n",
        "TRANSLATION_17": "[5:107] But if it be discovered, [if] it be ascertained after they have sworn their oaths, that both of them have merited [the suspicion of] sin, that is, that they have done something to incur it, in the way of a breach of faith or perjury in the testimony; for example, if what they are accused of is found with them and then they claim that they had bought it from the deceased or that he had bequeathed it to them, then two others shall take their place, so that the oaths are to be taken from them, being the nearest (al-awlayān is a substitution for ākharān, ‘two others’; a variant reading has al-awwalīn, plural of awwal, as an adjectival qualification of, or a substitution for, alladhīna, ‘of those’), in kinship to the deceased, of those most concerned, with the bequest, namely, the inheritors, and they shall swear by God, to the breach of faith of the two witnesses,   and they shall both say, ‘Verily, our testimony, our oath, is truer, is more faithful, than their testimony, their oath, and we have not transgressed, we have [not] overstepped the [bounds of] truth in our oaths, for then we would assuredly be among the evildoers’: meaning, let the one about to die call two men as witnesses to his bequest, or let him instruct in his bequest that the two be from among his co-religionists or from among others, if he cannot find any [from among the former] because he is travelling or for some similar reason. If the inheritors have doubts about the two men and claim a breach of faith on the part of the two for having taken something or given it to some other person — alleging that the deceased bequeathed it to him — then let the two men swear in full [in the way mentioned above]. If then some indication surfaces that the two men have been lying and these two then claim some motivation for this action [of theirs], the nearest of the inheritors in kinship [to the deceased] shall swear to the perjury of the two men and to the truth of what they [the inheritors] suspected. This stipulation holds for the two trustees, but is abrogated in the case of the two witnesses. Likewise, the testimony of non co-religionists is abrogated. The reason for [stipulating] the mid-afternoon prayer is to consecrate the oaths. The specification in this verse that the oath be from the two inheritors nearest in kinship concerns the incident regarding which it was revealed. This [incident], as reported by al-Bukhārī, involved a man from the Banū Sahm who had set out on a journey with Tamīm alDārī and ‘Adiyy b. Baddā’, when they were both [still] Christians. The man from the Banū Sahm died in a place where there were no Muslims. When the two came back with his bequest, they [his relatives] found that a silver bowl plated with gold was missing and so the two were brought before the Prophet (s); thereupon this verse was revealed. The Prophet (s) made the two swear oaths. The bowl was later discovered in Mecca, where the owners said that they had bought it from Tamīm and ‘Udayy. The next verse was then revealed, after which two of the Sahmī man’s close kin came to swear their oaths; in al-Tirmidhī’s version, ‘Amr b. al-‘Ās, who was closer to the deceased man, stood up with one other from among the kin, and they swore an oath; in yet another version, the [Sahmī] man fell ill and instructed them as to his bequest and asked them to deliver what he had left to his family, but when he died, they took the bowl [and sold it] and then gave what remained [of that money] to his family.\n",
        "TRANSLATION_18": "However, it became clear after their testimony that they had betrayed the dead person, and the custodians of the deceased found out. Allah said: (But then, if it is afterwards ascertained that both of them merit (the suspicion of) sin) of betrayal, (let two others) representing the deceased person, 'Amr Ibn al-'As and Muttalib Ibn Abi Wada'ah (take their place) the place of the two Christians (of those nearly concerned) about such a betrayal, i.e. the two Christians, and it is said that the reference here is to those from whom the property was taken away, i.e. the custodians of the deceased person, (and let them) the custodians of the deceased person (swear by Allah) that the property that was with the deceased person was more than what the two Christians gave back, ((saying): Verily our testimony) the testimony of the Muslims (is truer than their testimony) the testimony of the Christians (and we have not transgressed) let them say: we have not transgressed in our claim, (for then) for if we have transgressed (indeed we should be of the evil-doers) liars who harm others.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "5:107",
            "8:58",
            "5:27",
            "6:150",
            "5:106",
            "16:107",
            "49:9",
            "5:51",
            "4:39",
            "9:56"
        ],
        "BIBLE": [
            "torah:numbers:14:40",
            "prophets:ezekiel:38:12",
            "torah:numbers:22:26",
            "prophets:jeremiah:14:13",
            "prophets:jeremiah:23:22",
            "prophets:ii%20samuel:14:20",
            "prophets:zechariah:1:6",
            "prophets:jonah:3:10",
            "torah:genesis:19:2",
            "prophets:judges:18:3"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:1:13",
            "Sefer%20Yetzirah:6:1"
        ]
    }
}