{
    "VERSE": "5:115",
    "ARABIC": "قَالَ ٱللَّهُ إِنِّى مُنَزِّلُهَا عَلَيْكُمْ فَمَن يَكْفُرْ بَعْدُ مِنكُمْ فَإِنِّىٓ أُعَذِّبُهُۥ عَذَابًا لَّآ أُعَذِّبُهُۥٓ أَحَدًا مِّنَ ٱلْعَٰلَمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Allah said, 'I will send it down to you but if anyone among you is kafir after that, I will punish him with a punishment the like of which I will not inflict on anyone else in all the worlds!'",
        "TRANSLATION_1": "And said God: \"I shall send it down to you; but if any of you disbelieve after this, I shall inflict such punishment on him as I never shall inflict on any other creature.\"\n",
        "TRANSLATION_2": "Allah said: 'I shall indeed send it down to you; then, I shall afflict whoever among you who disbelieves with a chastisement wherewith I will afflict none in the worlds.'\n",
        "TRANSLATION_3": "God replied, \"I am sending it to you, but if anyone of you turns back to disbelief, I will make him suffer a torment that no one has ever suffered.\"\n",
        "TRANSLATION_4": "Said Allah, “Indeed I shall send it down to you; so thereafter whoever disbelieves amongst you – I will surely mete out to him a punishment with which I shall not punish anyone else in the whole world.”\n",
        "TRANSLATION_5": "Allah said: \"I am going to send it down unto you, but if any of you after that disbelieves, then I will punish him with a torment such as I have not inflicted on anyone among the `Alamin.\"\n",
        "TRANSLATION_6": "Allah said: Surely I will send it down to you, but whoever shall disbelieve afterwards from among you, surely I will chastise him with a chastisement with which I will not chastise, anyone among the nations.\n",
        "TRANSLATION_7": "God said, 'Verily I do send it down on you; whoso of you hereafter disbelieves, verily I shall chastise him with a chastisement wherewith I chastise no other being.'\n",
        "TRANSLATION_8": "Allah said: Lo! I send it down for you. And whoso disbelieveth of you afterward, him surely will I punish with a punishment wherewith I have not punished any of (My) creatures.\n",
        "TRANSLATION_9": "God replied, \"I will certainly send it down to you, but whosoever of you deny the truth thereafter will be punished with a punishment such as I have never meted out to anyone else in the world.\"\n",
        "TRANSLATION_10": "Allah said: verily I am going to send it down to you, but whosoever of you disbelieveth thereafter, verily shall torment him with a torment wherewith I shall not torment any other of the worlds.\n",
        "TRANSLATION_11": "Allah said, ‘I will indeed send it down to you. But should any of you disbelieve after this, I will indeed punish him with a punishment such as I do not punish anyone in all creation.’\n",
        "TRANSLATION_12": "Allah said: \"I will send it down unto you: But if any of you after that resisteth faith, I will punish him with a penalty such as I have not inflicted on any one among all the peoples.\"\n",
        "TRANSLATION_13": "Allah said: \"I am going to send it down unto you, but if any of you after that disbelieves, then I will punish him with a torment such as I have not inflicted on anyone among (all) the 'Alamin (mankind and jinns).\"\n",
        "TRANSLATION_14": "Allah replied: 'I am sending it to you. But whoever of you disbelieves thereafter I shall punish him with a punishment that I do not punish anyone from the worlds'\n",
        "TRANSLATION_15": "God said, “I will send it down to you. But whoever among you disbelieves thereafter, I will punish him with a punishment the like of which I never punish any other being.”\n",
        "TRANSLATION_16": "Allah said, \"Indeed, I will sent it down to you, but whoever disbelieves afterwards from among you - then indeed will I punish him with a punishment by which I have not punished anyone among the worlds.\"\n",
        "TRANSLATION_17": "[5:115] God said, granting his supplication: ‘Verily I shall send it down (read munziluhā or munazziluhā) to you; but whoever of you disbelieves afterward, after it has been sent down, I shall surely chastise him with a chastisement wherewith I chastise no other being from among all the worlds’: and so the angels descended with it from heaven, on it were seven loaves and seven large fish, and so they ate of it until they were full, as related by Ibn ‘Abbās. In one hadīth it is said that the Table sent down from heaven consisted of bread and meat, and they were commanded not to be treacherous and nor to store anything for the next day: but they were and they stored some of it, and were [consequently] transformed into apes and swine.\n",
        "TRANSLATION_18": "(Allah said) to Jesus, tell them: (Lo! I send it down for you) that which you have asked for. (And whoso disbelieveth of you afterward) after sending it down and eating from it, (him surely will I punish with a punishment wherewith I have not punished any of (My) creatures) of his time: I will turn them into swine. But after they ate from the food, they said: this is clear magic. Jesus said in response: Allah! If you punish them for what they are saying, they are Your servants; but if you forgive them, You are Mighty in Your retribution towards him who does not repent.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "5:115",
            "3:94",
            "3:160",
            "3:63",
            "2:181",
            "89:25",
            "5:39",
            "67:28",
            "4:147",
            "52:27"
        ],
        "BIBLE": [
            "prophets:joel:2:19",
            "torah:exodus:34:10",
            "torah:exodus:23:13",
            "torah:exodus:23:27",
            "prophets:joel:2:17",
            "torah:genesis:2:18",
            "prophets:zephaniah:3:20",
            "prophets:ezekiel:39:7",
            "writings:i%20chronicles:17:21",
            "prophets:ii%20samuel:7:23"
        ]
    }
}