{
    "VERSE": "5:14",
    "ARABIC": "وَمِنَ ٱلَّذِينَ قَالُوٓا۟ إِنَّا نَصَٰرَىٰٓ أَخَذْنَا مِيثَٰقَهُمْ فَنَسُوا۟ حَظًّا مِّمَّا ذُكِّرُوا۟ بِهِۦ فَأَغْرَيْنَا بَيْنَهُمُ ٱلْعَدَاوَةَ وَٱلْبَغْضَآءَ إِلَىٰ يَوْمِ ٱلْقِيَٰمَةِ وَسَوْفَ يُنَبِّئُهُمُ ٱللَّهُ بِمَا كَانُوا۟ يَصْنَعُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "We also made a covenant with those who say, 'We are Christians,' and they too forgot a good portion of what they were reminded of. So We stirred up enmity and hatred between them until the Day of Rising when Allah will inform them about what they did.",
        "TRANSLATION_1": "We had taken the pledge of those also who call themselves Christians. But they too forgot to take advantage of the warning they were given. So We have caused enmity and hatred among them to last till the Day of Resurrection, when God will inform them of what they were doing.\n",
        "TRANSLATION_2": "We also took a covenant from those who said: 'We are Christians'; but they forgot a good portion of the teaching they had been imparted with. Wherefore We aroused enmity and spite between them till the Day of Resurrection, and ultimately Allah will tell them what they had contrived.\n",
        "TRANSLATION_3": "We had made a solemn covenant with those who call themselves Christians, but they forgot their share of the guidance that was sent to them. We have induced hatred and animosity among them which will remain with them until the Day of Judgment when God will tell them about what they had done.\n",
        "TRANSLATION_4": "And We made a covenant with those who proclaimed, “We are Christians” – they then forgot a large portion of the advices given to them; We have therefore instilled enmity and hatred between them till the Day of Resurrection; and Allah will soon inform them of what they were doing.\n",
        "TRANSLATION_5": "And from those who call themselves Christians, We took their covenant, but they have abandoned a good part of the Message that was sent to them. So We planted amongst them enmity and hatred till the Day of Resurrection; and Allah will inform them of what they used to do.\n",
        "TRANSLATION_6": "And with those who say, We are Christians, We made a covenant, but they neglected a portion of what they were reminded of, therefore We excited among them enmity and hatred to the day of resurrection; and Allah will inform them of what they did.\n",
        "TRANSLATION_7": "And with those who say 'We are Christians' We took compact; and they have forgotten a portion of that they were reminded of. So We have stirred up among them enmity and hatred, till the Day of Resurrection; and God will assuredly tell them of the things they wrought.\n",
        "TRANSLATION_8": "And with those who say: \"Lo! we are Christians,\" We made a covenant, but they forgot a part of that whereof they were admonished. Therefor We have stirred up enmity and hatred among them till the Day of Resurrection, when Allah will inform them of their handiwork.\n",
        "TRANSLATION_9": "We also made a covenant with those who say, \"We are Christians.\" But they too have forgotten much of what they were enjoined. So, We have put enmity and hatred between them till the Day of Judgement; and soon God will declare to them what they have been doing.\n",
        "TRANSLATION_10": "And of them who say: verily we are Nazarenes, We took a bond from them, but they have abandoned a good portion of that wherewith they were admonished. Wherefore We have occasioned enmity and hatred amongst them till the Day of Judgement, and presently Allah shall declare unto them that which they have been performing.\n",
        "TRANSLATION_11": "Also from those who say, ‘We are Christians,’ We took their pledge; but they forgot a part of what they were reminded. So We stirred up enmity and hatred among them until the Day of Resurrection, and soon Allah will inform them concerning what they had been doing.\n",
        "TRANSLATION_12": "From those, too, who call themselves Christians, We did take a covenant, but they forgot a good part of the message that was sent them: so we estranged them, with enmity and hatred between the one and the other, to the day of judgment. And soon will Allah show them what it is they have done.\n",
        "TRANSLATION_13": "And from those who call themselves Christians, We took their covenant, but they have abandoned a good part of the Message that was sent to them. So We planted amongst them enmity and hatred till the Day of Resurrection (when they discarded Allah's Book, disobeyed Allah's Messengers and His Orders and transgressed beyond bounds in Allah's disobedience), and Allah will inform them of what they used to do.\n",
        "TRANSLATION_14": "With those who said they were Nazarenes, We made a Covenant, but they have forgotten much of what they were reminded. Therefore, We stirred among them enmity and hatred till the Day of Resurrection when Allah will inform them of all that they have done.\n",
        "TRANSLATION_15": "And from those who say, “We are Christians,” We received their pledge, but they neglected some of what they were reminded of. So We provoked enmity and hatred among them until the Day of Resurrection; God will then inform them of what they used to craft.\n",
        "TRANSLATION_16": "And from those who say, \"We are Christians\" We took their covenant; but they forgot a portion of that of which they were reminded. So We caused among them animosity and hatred until the Day of Resurrection. And Allah is going to inform them about what they used to do.\n",
        "TRANSLATION_17": "[5:14] And with those who say ‘We are Christians’ (this is semantically connected to [what follows]) We made a covenant, just as We did with the Children of Israel, the Jews, and they have forgotten a portion of that they were reminded of, in the Gospel, pertaining to faith and other matters, and they [too] broke the covenant.   So We have stirred up, We have caused, among them enmity and hatred until the Day of Resurrection, on account of their schisms and differing whims, each sect charging the other with unbelief; and God will assuredly tell them, in the Hereafter, of what they wrought, and requite them for this.\n",
        "TRANSLATION_18": "(And with those who say: \"Lo! we are Christians\"), i.e. the Christians of Najran (We made a covenant) in the Gospel that they should follow Muhammad (pbuh) and manifest his traits and not worship anyone or anything except Allah or associate anyone with Him, (but they forgot a part) they left part (of that whereof they were admonished) with which they were commanded. (Therefore We have stirred up) We have cast (enmity) killing and destruction (and hatred) in the hearts (among them) between the Jews and Christians; and it is said between the Nestorians of Najran, the sects known as the Jacobites, the Marqusiyya and the Melkites (till the Day of Resurrection, when Allah will inform them of their handiwork) of their opposition, treachery, concealment, enmity and hatred.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "5:14",
            "22:17",
            "60:3",
            "22:69",
            "3:55",
            "5:64",
            "2:113",
            "8:72",
            "5:13",
            "5:51"
        ],
        "BIBLE": [
            "torah:deuteronomy:26:13",
            "prophets:judges:15:6",
            "prophets:ezekiel:18:13",
            "prophets:ii%20kings:8:9",
            "prophets:ii%20samuel:4:10",
            "prophets:i%20kings:9:16",
            "writings:ruth:2:18",
            "prophets:joshua:23:15",
            "prophets:joshua:23:16",
            "prophets:ii%20kings:10:15"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:5:2",
            
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:3"
        ]
    }
}