{
    "VERSE": "5:15",
    "ARABIC": "يَٰٓأَهْلَ ٱلْكِتَٰبِ قَدْ جَآءَكُمْ رَسُولُنَا يُبَيِّنُ لَكُمْ كَثِيرًا مِّمَّا كُنتُمْ تُخْفُونَ مِنَ ٱلْكِتَٰبِ وَيَعْفُوا۟ عَن كَثِيرٍ قَدْ جَآءَكُم مِّنَ ٱللَّهِ نُورٌ وَكِتَٰبٌ مُّبِينٌ",
    "ENGLISH": {
        "TRANSLATION_0": "People of the Book! Our Messenger has come to you, making clear to you much of the Book that you have kept concealed, and passing over a lot. A Light has come to you from Allah and a Clear Book.",
        "TRANSLATION_1": "O people of the Book, Our Apostle has come to you, announcing many things of the Scriptures that you have suppressed, passing over some others. To you has come light and a clear Book from God\n",
        "TRANSLATION_2": "People of the Book! Now Our Messenger has come to you: he makes clear to you a good many things of the Book which you were wont to conceal, and also passes over many things. There has now come to you a light from Allah, and a clear Book.\n",
        "TRANSLATION_3": "People of the Book, Our Messenger has come to you. He tells you about the many things that you had been hiding of the Book and forgives you much. A light and a clarifying Book has come to you from God\n",
        "TRANSLATION_4": "O People given the Book(s)! Indeed this Noble Messenger (Prophet Mohammed – peace and blessings be upon him) of Ours has come to you, revealing to you a lot of the things which you had hidden in the Book, and forgiving a lot of them; indeed towards you has come a light* from Allah, and a clear Book. (* The Holy Prophet is a light from Allah).\n",
        "TRANSLATION_5": "O People of the Scripture! Now has come to you Our Messenger explaining to you much of that which you used to hide from the Scripture and passing over much. Indeed, there has come to you from Allah a light and a plain Book.\n",
        "TRANSLATION_6": "O followers of the Book! indeed Our Apostle has come to you making clear to you much of what you concealed of the Book and passing over much; indeed, there has come to you light and a clear Book from Allah;\n",
        "TRANSLATION_7": "People of the Book, now there has come to you Our Messenger, making clear to you many things you have been concealing of the Book, and effacing many things. There has come to you from God a light, and a Book Manifest\n",
        "TRANSLATION_8": "O People of the Scripture! Now hath Our messenger come unto you, expounding unto you much of that which ye used to hide in the Scripture, and forgiving much. now hath come unto you light from Allah and plain Scripture,\n",
        "TRANSLATION_9": "People of the Book! Our Messenger has come to make clear to you much of what you have hidden of the Scriptures and to forgive you much. A light has now come to you from God and a clear Book,\n",
        "TRANSLATION_10": "O ye people of the Book! surely there hath come Our apostle unto you expounding unto you much in the Book that ye were wont to hide, and much he passeth over. Of a surety, there hath come unto you from Allah a light and a Book luminous.\n",
        "TRANSLATION_11": "O People of the Book! Certainly Our Apostle has come to you, clarifying for you much of what you used to hide of the Book, and excusing many [an offense of yours]. Certainly, there has come to you a light from Allah, and a manifest Book.\n",
        "TRANSLATION_12": "O people of the Book! There hath come to you our Messenger, revealing to you much that ye used to hide in the Book, and passing over much (that is now unnecessary): There hath come to you from Allah a (new) light and a perspicuous Book, -\n",
        "TRANSLATION_13": "O people of the Scripture (Jews and Christians)! Now has come to you Our Messenger (Muhammad SAW) explaining to you much of that which you used to hide from the Scripture and passing over (i.e. leaving out without explaining) much. Indeed, there has come to you from Allah a light (Prophet Muhammad SAW) and a plain Book (this Quran).\n",
        "TRANSLATION_14": "People of the Book! Our Messenger (Muhammad) has come to clarify to you much of what you have hidden of the Book, and to forgive you much. A light has come to you from Allah and a Clear Book,\n",
        "TRANSLATION_15": "O People of the Book! Our Messenger has come to you, clarifying for you much of what you kept hidden of the Book, and overlooking much. A light from God has come to you, and a clear Book.\n",
        "TRANSLATION_16": "O People of the Scripture, there has come to you Our Messenger making clear to you much of what you used to conceal of the Scripture and overlooking much. There has come to you from Allah a light and a clear Book.\n",
        "TRANSLATION_17": "[5:15] O People of the Scripture, Jews and Christians, now there has come to you Our Messenger, Muhammad (s), making clear to you much of what you used to conceal of the Scripture, the Torah and the Gospel, such as the ‘stoning’ verse and the description [of the Prophet Muhammad (s)], and pardoning much, of it, which he does not reveal, since this would not be of any benefit, serving only to disgrace you. There has verily come to you from God a light, namely, the Prophet (s), and a Book, a Qur’ān, lucid, plain and manifest,\n",
        "TRANSLATION_18": "(0 people of the Scripture! Now hath Our messenger) Muhammad (pbuh) (come unto you, expositing unto you much of that which ye used to hide in the Scripture) regarding the traits and description of the Prophet 113 Muhammad (pbuh) and the legal ruling on stoning [married fornicators] as well as other things, (and forgiving much) and leave many other things, not mentioning them to you. (Now hath come unto you light) a messenger, i.e. Muhammad (from Allah and a plain Scripture) explaining the lawful and the unlawful,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "5:15",
            "5:59",
            "3:110",
            "64:8",
            "5:19",
            "3:70",
            "29:46",
            "4:61",
            "33:21",
            "57:28"
        ],
        "BIBLE": [
            "writings:i%20chronicles:29:14",
            "prophets:joshua:23:15",
            "prophets:isaiah:42:16",
            "writings:esther:4:8",
            "torah:leviticus:17:11",
            "torah:leviticus:10:17",
            "prophets:i%20samuel:25:34",
            "prophets:nahum:1:14",
            "torah:exodus:36:6",
            "writings:daniel:6:13"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:2",
            "Sefer%20Yetzirah:1:9"
        ]
    }
}