{
    "VERSE": "5:21",
    "ARABIC": "يَٰقَوْمِ ٱدْخُلُوا۟ ٱلْأَرْضَ ٱلْمُقَدَّسَةَ ٱلَّتِى كَتَبَ ٱللَّهُ لَكُمْ وَلَا تَرْتَدُّوا۟ عَلَىٰٓ أَدْبَارِكُمْ فَتَنقَلِبُوا۟ خَٰسِرِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "'My people! enter the Holy Land which Allah has ordained for you Do not turn back in your tracks and so become transformed into losers.'",
        "TRANSLATION_1": "Enter then, my people, the Holy Land that God has ordained for you, and do not turn back, or you will suffer.\"\n",
        "TRANSLATION_2": "My people! Enter the holy land which Allah has ordained for you; and do not turn back for then you will turn about losers.\n",
        "TRANSLATION_3": "Enter the sacred promised land which God has designated for you. Do not return to disbelief lest you become lost\".\n",
        "TRANSLATION_4": "“O my people! Enter the holy land which Allah has decreed for you and do not turn back, for you will turn back as losers.”\n",
        "TRANSLATION_5": "O my people! Enter the Holy Land which Allah has assigned to you and turn not back; for then you will be returned as losers.\"\n",
        "TRANSLATION_6": "O my people! enter the holy land which Allah has prescribed for you and turn not on your backs for then you will turn back losers.\n",
        "TRANSLATION_7": "O my people, enter the Holy Land which God has prescribed for you, and turn not back in your traces, to turn about losers.'\n",
        "TRANSLATION_8": "O my people! Go into the holy land which Allah hath ordained for you. Turn not in flight, for surely ye turn back as losers:\n",
        "TRANSLATION_9": "O my people! Enter the holy land which God has assigned  for you. Do not turn back, or you will be the losers.\"\n",
        "TRANSLATION_10": "O my people! enter the holy land which Allah hath prescribed for you and turn not back to your rearward for then ye become losers.\n",
        "TRANSLATION_11": "O my people, enter the Holy Land which Allah has ordained for you, and do not turn your backs, or you will become losers.’\n",
        "TRANSLATION_12": "O my people! Enter the holy land which Allah hath assigned unto you, and turn not back ignominiously, for then will ye be overthrown, to your own ruin.\"\n",
        "TRANSLATION_13": "O my people! Enter the holy land (Palestine) which Allah has assigned to you, and turn not back (in flight) for then you will be returned as losers.\"\n",
        "TRANSLATION_14": "Enter, my people, the Holy Land which Allah has written for you. Do not turn back in your footsteps, lest you shall turn to be losers'\n",
        "TRANSLATION_15": "“O my people, enter the Holy Land which God has assigned for you, and do not turn back, lest you return as losers.”\n",
        "TRANSLATION_16": "O my people, enter the Holy Land which Allah has assigned to you and do not turn back [from fighting in Allah 's cause] and [thus] become losers.\"\n",
        "TRANSLATION_17": "[5:21]   O my people, enter the Holy, the purified, Land which God has ordained for you, [which] He commanded you to enter, and this is Syria (al-shām), and do not turn back in flight, [do not] retreat in fear of the enemy, or you will end up as losers’, in your efforts.\n",
        "TRANSLATION_18": "(0 my people! Go into the holy land) the purified Damascus, Palestine and parts of Jordan (which Allah hath 114 ordained for you) which Allah has gifted to you and made it a bequest of your father Abraham. (Turn not in flight) retreating, (for surely ye turn back as losers) who are punished: Allah will take away from you the quails and honey:\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "5:21",
            "7:128",
            "6:45",
            "29:36",
            "10:85",
            "11:64",
            "5:51",
            "10:84",
            "9:96",
            "71:17"
        ],
        "BIBLE": [
            "prophets:jeremiah:31:18",
            "torah:deuteronomy:30:3",
            "writings:lamentations:5:22",
            "writings:lamentations:5:21",
            "prophets:joshua:7:12",
            "prophets:ezekiel:29:14",
            "prophets:ezekiel:33:11",
            "prophets:joshua:7:8",
            "writings:nehemiah:2:15",
            "prophets:ii%20samuel:1:22"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:12",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:3:2"
        ]
    }
}