{
    "VERSE": "5:25",
    "ARABIC": "قَالَ رَبِّ إِنِّى لَآ أَمْلِكُ إِلَّا نَفْسِى وَأَخِى فَٱفْرُقْ بَيْنَنَا وَبَيْنَ ٱلْقَوْمِ ٱلْفَٰسِقِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "He said, 'My Lord, I have no control over anyone but myself and my brother, so make a clear distinction between us and this deviant people.'",
        "TRANSLATION_1": "Said (Moses): \"O Lord, I have control over none but myself and my brother; so distinguish between us and these, the wicked people.\"\n",
        "TRANSLATION_2": "Thereupon Moses said: 'My Lord! I have control over none but my own self and my brother; so distinguish between us and the transgressing people.'\n",
        "TRANSLATION_3": "(Moses) said, \"Lord, I can only speak for myself and my brother; keep us away from the evil-doers\".\n",
        "TRANSLATION_4": "Said Moosa, “My Lord! I have no control except over myself and my brother, so keep us separated from the disobedient nation.” (Do not count us among them).\n",
        "TRANSLATION_5": "He [Musa] said: \"O my Lord! I have power only over myself and my brother, so Ifruq us from the rebellious people!\"\n",
        "TRANSLATION_6": "He said: My Lord! Surely I have no control (upon any) but my own self and my brother; therefore make a separation between us and the nation of transgressors.\n",
        "TRANSLATION_7": "He said, 'O my Lord, I rule no one except myself and my brother. So do Thou divide between us and the people of the ungodly.'\n",
        "TRANSLATION_8": "He said: My Lord! I have control of none but myself and my brother, so distinguish between us and the wrong-doing folk.\n",
        "TRANSLATION_9": "Moses supplicated, \"Lord, I have power over none but myself and my brother; so separate us from the disobedient people.\"\n",
        "TRANSLATION_10": "Said he: my Lord control not but myself and my brother, so decide Thou between us and this transgressing people.\n",
        "TRANSLATION_11": "He said, ‘My Lord! I have no power over [anyone] except myself and my brother, so part us from the transgressing lot.’\n",
        "TRANSLATION_12": "He said: \"O my Lord! I have power only over myself and my brother: so separate us from this rebellious people!\"\n",
        "TRANSLATION_13": "He [Musa (Moses)] said: \"O my Lord! I have power only over myself and my brother, so separate us from the people who are the Fasiqun (rebellious and disobedient to Allah)!\"\n",
        "TRANSLATION_14": "He said: 'Lord, I have none but myself and my brother. Set a barrier between us and the wicked people'\n",
        "TRANSLATION_15": "He said, “My Lord! I have control only over myself and my brother, so separate between us and between the wicked people.”\n",
        "TRANSLATION_16": "[Moses] said, \"My Lord, indeed I do not possess except myself and my brother, so part us from the defiantly disobedient people.\"\n",
        "TRANSLATION_17": "[5:25] He, Moses, thereupon, said, ‘My Lord, I control none but myself and my brother, and I control no one else to be able to force them to obedience. So separate, distinguish, us from the wicked folk’.\n",
        "TRANSLATION_18": "(He said: My Lord!) Moses said: my Lord! (I have control of none but myself and my brother, so distinguish between us) judge between us (and the wrong-doing folk) the contravening folk.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "5:25",
            "32:25",
            "79:40",
            "26:117",
            "29:30",
            "23:94",
            "16:124",
            "12:87",
            "43:88",
            "28:21"
        ],
        "BIBLE": [
            "torah:exodus:34:10",
            "prophets:joel:2:17",
            "writings:psalms:32:5",
            "torah:numbers:21:8",
            "writings:i%20chronicles:22:5",
            "prophets:isaiah:36:8",
            "prophets:ii%20kings:18:23",
            "prophets:joshua:7:19",
            "writings:psalms:59:12",
            "torah:exodus:32:30"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:3:2"
        ]
    }
}