{
    "VERSE": "5:27",
    "ARABIC": "وَٱتْلُ عَلَيْهِمْ نَبَأَ ٱبْنَىْ ءَادَمَ بِٱلْحَقِّ إِذْ قَرَّبَا قُرْبَانًا فَتُقُبِّلَ مِنْ أَحَدِهِمَا وَلَمْ يُتَقَبَّلْ مِنَ ٱلْءَاخَرِ قَالَ لَأَقْتُلَنَّكَ قَالَ إِنَّمَا يَتَقَبَّلُ ٱللَّهُ مِنَ ٱلْمُتَّقِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Recite to them the true report of Adam's two sons when they offered a sacrifice and it was accepted from one of them but not accepted from the other. The one said, 'I shall kill you.' The other said, 'Allah only accepts from people who have taqwa.",
        "TRANSLATION_1": "Narrate to them exactly the tale of the two sons of Adam. When each of them offered a sacrifice (to God), that of one was accepted, and that of the other was not. Said (the one): \"I will murder you,\" and the other replied: \"God only accepts from those who are upright and preserve themselves from evil.\n",
        "TRANSLATION_2": "Narrate to them in all truth the story of the two sons of Adam. When they made an offering and it was accepted from one of them and was not accepted from the other, the latter said: 'I will surely kill you.' Thereupon the former said: 'Allah accepts offerings only from the God-fearing.\n",
        "TRANSLATION_3": "(Muhammad) tell them the true story of the two sons of Adam (Abel and Cain). Each one of them offered a sacrifice. God accepted the sacrifice of one of them (Abel) but not that of the other (Cain) who then said to his brother, \"I shall certainly kill you.\" (Abel) replied, \"God only accepts the offerings of the pious ones.\n",
        "TRANSLATION_4": "And recite to them the true tale of the two sons of Adam; when both of them offered a sacrifice each – hence the sacrifice of one was accepted and not accepted from the other; he (the other) said, “I swear I will kill you”; he answered, “Allah accepts only from the pious.”\n",
        "TRANSLATION_5": "And recite to them the story of the two sons of Adam in truth; when each offered a sacrifice, it was accepted from the one but not from the other. The latter said to the former: \"I will surely, kill you.\" The former said: \"Verily, Allah accepts only from those who have Taqwa.\n",
        "TRANSLATION_6": "And relate to them the story of the two sons of Adam with truth when they both offered an offering, but it was accepted from one of them and was not accepted from the other. He said: I will most certainly slay you. (The other) said: Allah only accepts from those who guard (against evil).\n",
        "TRANSLATION_7": "And recite thou to them the story of the two sons of Adam truthfully, when they offered a sacrifice, and it was accepted of one of them, and not accepted of the other. 'I will surely slay thee,' said one. 'God accepts only of the godfearing,' said the other.\n",
        "TRANSLATION_8": "But recite unto them with truth the tale of the two sons of Adam, how they offered each a sacrifice, and it was accepted from the one of them and it was not accepted from the other. (The one) said: I will surely kill thee. (The other) answered: Allah accepteth only from those who ward off (evil).\n",
        "TRANSLATION_9": "Relate to them, the true story of the two sons of Adam. When they both presented an offering, it was accepted from one of them and not from the other. The latter said, \"I shall kill you!\" The former said, \"God accepts [things] only from the righteous.\n",
        "TRANSLATION_10": "And rehearse thou unto them with truth the tale of the two sons of Adam, when the twain offered an offering, and it was accepted from one of them, and was not accepted from the other; he said: surely I will slay thee. Said the other: Allah accepteth only from the God- fearing.\n",
        "TRANSLATION_11": "Relate to them truly the account of Adam’s two sons. When the two of them offered an offering, it was accepted from one of them and not accepted from the other. [One of them] said, ‘Surely I will kill you.’ [The other one] said, ‘Allah accepts only from the Godwary.\n",
        "TRANSLATION_12": "Recite to them the truth of the story of the two sons of Adam. Behold! they each presented a sacrifice (to Allah): It was accepted from one, but not from the other. Said the latter: \"Be sure I will slay thee.\" \"Surely,\" said the former, \"Allah doth accept of the sacrifice of those who are righteous.\n",
        "TRANSLATION_13": "And (O Muhammad SAW) recite to them (the Jews) the story of the two sons of Adam [Habil (Abel) and Qabil (Cain)] in truth; when each offered a sacrifice (to Allah), it was accepted from the one but not from the other. The latter said to the former: \"I will surely kill you.\" The former said: \"Verily, Allah accepts only from those who are Al-Muttaqun (the pious - see V. 2:2).\"\n",
        "TRANSLATION_14": "Recite to them in all truth the news of Adam's two sons; how they each made an offering, and how the offering of the one was accepted while that of the other was not. He said: 'I will surely kill you' (The other) said: 'Allah accepts only from the righteous.\n",
        "TRANSLATION_15": "And relate to them the true story of Adam's two sons: when they offered an offering, and it was accepted from one of them, but it was not accepted from the other. He Said, “I will kill you.” He Said, “God accepts only from the righteous.”\n",
        "TRANSLATION_16": "And recite to them the story of Adam's two sons, in truth, when they both offered a sacrifice [to Allah], and it was accepted from one of them but was not accepted from the other. Said [the latter], \"I will surely kill you.\" Said [the former], \"Indeed, Allah only accepts from the righteous [who fear Him].\n",
        "TRANSLATION_17": "[5:27] And recite, O Muhammad (s), to them, your people, the story, the tale, of the two sons of Adam, Abel and Cain, truthfully (bi’l-haqq is semantically connected to utlu, ‘recite’), how they each offered a sacrifice, to God, which in Abel’s case was a ram, and in Cain’s, some green crops, and it was accepted from one of them, namely, from Abel, when a fire came down from the heaven and consumed his offering, and not accepted from the other, that is, from Cain, and so he became furious and kept secret his envy until Adam left on pilgrimage. He said, to him, ‘I will surely slay you,’, and the other said, ‘Why?’, to which the first replied, ‘Because only your offering was accepted’. The other said, ‘God accepts only from the God-fearing’.\n",
        "TRANSLATION_18": "(But recite unto them) Muhammad (with truth) with the Qur'an (the tale of the two sons of Adam, how they offered each a sacrifice, and it was accepted from the one) Abel (of them and it was not accepted from the other) Cain. ((The one)) Cain (said) to Abel: (I will surely kill thee) Abel. ((The other) answered) why? Because Allah has accepted your offering and rejected mine. And Abel said: (Allah accepteth only from those who ward off (evil)) the sincere in their speech and action, whose hearts are pure, and your heart is not pure.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "5:27",
            "18:13",
            "27:79",
            "2:252",
            "11:79",
            "5:107",
            "24:25",
            "3:181",
            "3:84",
            "18:38"
        ],
        "BIBLE": [
            "prophets:ii%20kings:5:17",
            "prophets:jeremiah:42:4",
            "prophets:joshua:9:24",
            "torah:exodus:2:14",
            "prophets:judges:13:23",
            "torah:genesis:19:21",
            "torah:leviticus:19:5",
            "prophets:malachi:1:8",
            "torah:genesis:21:6",
            "writings:i%20chronicles:29:17"
        ]
    }
}