{
    "VERSE": "5:28",
    "ARABIC": "لَئِنۢ بَسَطتَ إِلَىَّ يَدَكَ لِتَقْتُلَنِى مَآ أَنَا۠ بِبَاسِطٍ يَدِىَ إِلَيْكَ لِأَقْتُلَكَ إِنِّىٓ أَخَافُ ٱللَّهَ رَبَّ ٱلْعَٰلَمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Even if you do raise your hand against me to kill me, I am not going to raise my hand against you to kill you. Truly I fear Allah, the Lord of all the worlds.",
        "TRANSLATION_1": "If you raise your hand to kill me, I will raise not mine to kill you, for I fear God, the Lord of all the worlds;\n",
        "TRANSLATION_2": "Even if you stretch forth your hand against me to kill, I will not stretch forth my hand to kill you. Surely, I fear Allah, the Lord of the entire universe.\n",
        "TRANSLATION_3": "Even if you try to kill me, I certainly shall not try to kill you. I have fear of God, the Lord of the creation.\n",
        "TRANSLATION_4": "“Indeed, if you do extend your hand against me to kill me, I will not extend my hand against you to kill you; I fear Allah, the Lord Of The Creation.”\n",
        "TRANSLATION_5": "If you do stretch your hand against me to kill me, I shall never stretch my hand against you to kill you, for I fear Allah; the Lord of all that exists.\"\n",
        "TRANSLATION_6": "If you will stretch forth your hand towards me to slay me, I am not one to stretch forth my hand towards you to slay you surely I fear Allah, the Lord of the worlds:\n",
        "TRANSLATION_7": "Yet if thou stretchest out thy hand against me, to slay me, I will not stretch out my hand against thee, to slay thee; I fear God, the Lord of all Being.\n",
        "TRANSLATION_8": "Even if thou stretch out thy hand against me to kill me, I shall not stretch out my hand against thee to kill thee, lo! I fear Allah, the Lord of the Worlds.\n",
        "TRANSLATION_9": "If you raise your hand to kill me, I will not raise mine to kill you. I fear God, the Lord of the Universe,\n",
        "TRANSLATION_10": "If thou stretchest forth thine hand against me to slay me, I shall not be stretching forth my hand against thee to slay thee, verily I fear Allah, the Lord of the worlds.\n",
        "TRANSLATION_11": "Even if you extend your hand toward me to kill me, I will not extend my hand toward you to kill you. Indeed, I fear Allah, the Lord of all the worlds.\n",
        "TRANSLATION_12": "If thou dost stretch thy hand against me, to slay me, it is not for me to stretch my hand against thee to slay thee: for I do fear Allah, the cherisher of the worlds.\n",
        "TRANSLATION_13": "If you do stretch your hand against me to kill me, I shall never stretch my hand against you to kill you, for I fear Allah; the Lord of the 'Alamin (mankind, jinns, and all that exists).\"\n",
        "TRANSLATION_14": "If you stretch your hand to kill me, I shall not stretch mine to kill you; for I fear Allah, the Lord of the Worlds.\n",
        "TRANSLATION_15": "“If you extend your hand to kill me, I will not extend my hand to kill you; for I fear God, Lord of the Worlds.”\n",
        "TRANSLATION_16": "If you should raise your hand against me to kill me - I shall not raise my hand against you to kill you. Indeed, I fear Allah, Lord of the worlds.\n",
        "TRANSLATION_17": "[5:28] ‘Yet if (la-in, the lām is for oaths) you extend your hand against me to slay me, I will not extend my hand against you to slay you; I fear God, the Lord of the Worlds, in slaying you.\n",
        "TRANSLATION_18": "(Even if thou stretch out thy hand against me to kill me) wrongfully, (I shall not stretch out my hand against thee to kill you) wrongfully, (lo! I fear Allah, the Lord of the Worlds) if I were to kill you wrongfully.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "5:28",
            "81:29",
            "62:7",
            "2:95",
            "1:2",
            "2:70",
            "3:63",
            "22:54",
            "37:182",
            "28:56"
        ],
        "BIBLE": [
            "prophets:judges:2:16",
            "torah:deuteronomy:15:10",
            "torah:deuteronomy:13:10",
            "prophets:jeremiah:15:6",
            "prophets:ii%20samuel:1:14",
            "prophets:i%20samuel:24:7",
            "prophets:ezekiel:28:9",
            "prophets:ii%20samuel:18:28",
            "prophets:judges:13:23",
            "prophets:ezekiel:23:28"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:7",
            
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:3:5",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:3"
        ]
    }
}