{
    "VERSE": "5:29",
    "ARABIC": "إِنِّىٓ أُرِيدُ أَن تَبُوٓأَ بِإِثْمِى وَإِثْمِكَ فَتَكُونَ مِنْ أَصْحَٰبِ ٱلنَّارِ وَذَٰلِكَ جَزَٰٓؤُا۟ ٱلظَّٰلِمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "I want you to take on both my wrongdoing and your wrongdoing and so become one of the Companions of the Fire. That is the repayment of the wrongdoers.'",
        "TRANSLATION_1": "I would rather you suffered the punishment for sinning against me, and for your own sin, and became an inmate of Hell. And that is the requital for the unjust.\"\n",
        "TRANSLATION_2": "I would desire that you be laden with my sin and with your sin, and thus become among the inmates of the Fire. That indeed is the right recompense of the wrong-doers.'\n",
        "TRANSLATION_3": "I would prefer you to take sole responsibility for both our sins and thus become a dweller of hell; this is what an unjust person deserves.\"\n",
        "TRANSLATION_4": "“I only desire that you alone should bear my sin and your own sin – hence you become of the people of hell; and that is the proper punishment of the unjust.”\n",
        "TRANSLATION_5": "Verily, I intend to let you draw my sin on yourself as well as yours, then you will be one of the dwellers of the Fire, and that is the recompense of the wrongdoers.\"\n",
        "TRANSLATION_6": "Surely I wish that you should bear the sin committed against me and your own sin, and so you would be of the inmates of the fire, and this is the recompense of the unjust.\n",
        "TRANSLATION_7": "I desire that thou shouldest be laden with my sin and thy sin, and so become an inhabitant of the Fire; that is the recompense of the evildoers.'\n",
        "TRANSLATION_8": "Lo! I would rather thou shouldst bear the punishment of the sin against me and thine own sin and become one of the owners of the fire. That is the reward of evil-doers.\n",
        "TRANSLATION_9": "and I want you to bear your sins against me as well as your own sins and become an inhabitant of the Fire. Such is the reward of the wrongdoers.\"\n",
        "TRANSLATION_10": "Verily would that thou bear my sin and thine own sin, and then thou become of the fellows of the Fire; that is the meed of the wrong-doers.\n",
        "TRANSLATION_11": "I desire that you earn [the burden of] my sin and your sin, to become one of the inmates of the Fire, and such is the requital of the wrongdoers.’\n",
        "TRANSLATION_12": "For me, I intend to let thee draw on thyself my sin as well as thine, for thou wilt be among the companions of the fire, and that is the reward of those who do wrong.\"\n",
        "TRANSLATION_13": "Verily, I intend to let you draw my sin on yourself as well as yours, then you will be one of the dwellers of the Fire, and that is the recompense of the Zalimun (polytheists and wrong-doers).\"\n",
        "TRANSLATION_14": "I would rather you bear my sin and your sin and become among the inhabitants of Hell. Such is the recompense of the harmdoers'\n",
        "TRANSLATION_15": "“I would rather you bear my sin and your sin, and you become among the inmates of the Fire. Such is the reward for the evildoers.”\n",
        "TRANSLATION_16": "Indeed I want you to obtain [thereby] my sin and your sin so you will be among the companions of the Fire. And that is the recompense of wrongdoers.\"\n",
        "TRANSLATION_17": "[5:29] I desire that you should end up with my sin, the sin of slaying me, and your own sin, the one that you had committed before, and so become an inhabitant of the Fire, whereas I do not want to end up with your sin if I were to slay you, and become one of them. God, exalted be He, says: that is the requital of the evildoers’.\n",
        "TRANSLATION_18": "(Lo! I would rather thou shouldst bear the punishment of the sin against me and thine own sin) of shedding my blood (and become one of the owners of the Fire) of the dwellers of hell. (That is the reward of evil- doers) Hell is the reward of those who wrongfully transgress. 115\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "5:29",
            "2:39",
            "7:36",
            "64:10",
            "59:17",
            "40:6",
            "59:20",
            "10:27",
            "7:50",
            "3:116"
        ],
        "BIBLE": [
            "torah:deuteronomy:13:14",
            "torah:numbers:11:17",
            "torah:genesis:24:44",
            "writings:proverbs:24:11",
            "writings:ruth:2:9",
            "prophets:judges:5:11",
            "prophets:jeremiah:44:22",
            "torah:deuteronomy:13:6",
            "prophets:ezekiel:16:52",
            "torah:deuteronomy:4:19"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:1:12",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:4"
        ]
    }
}