{
    "VERSE": "5:30",
    "ARABIC": "فَطَوَّعَتْ لَهُۥ نَفْسُهُۥ قَتْلَ أَخِيهِ فَقَتَلَهُۥ فَأَصْبَحَ مِنَ ٱلْخَٰسِرِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "So his lower self persuaded him to kill his brother, and he killed him and became one of the lost.",
        "TRANSLATION_1": "Then the other was induced by his passion to murder his brother, and he killed him, and became one of the damned.\n",
        "TRANSLATION_2": "At last his evil soul drove him to the murder of his brother, and he killed him, whereby he himself became one of the losers.\n",
        "TRANSLATION_3": "(Cain's) soul prompted him to kill his own brother. In doing so he became of those who lose.\n",
        "TRANSLATION_4": "So his soul incited him to kill his brother – he therefore killed him, and was therefore ruined.\n",
        "TRANSLATION_5": "So the soul of the other encouraged him and made fair-seeming to him the murder of his brother; he murdered him and became one of the losers.\n",
        "TRANSLATION_6": "Then his mind facilitated to him the slaying of his brother so he slew him; then he became one of the losers\n",
        "TRANSLATION_7": "Then his soul prompted him to slay his brother, and he slew him, and became one of the losers.\n",
        "TRANSLATION_8": "But (the other's) mind imposed on him the killing of his brother, so he slew him and became one of the losers.\n",
        "TRANSLATION_9": "His lower self persuaded him to kill his brother, and he killed him and he became one of the lost.\n",
        "TRANSLATION_10": "Then his soul made the slaying of his brother agreeable to him, so he slew him, and he became of the losers.\n",
        "TRANSLATION_11": "So his soul prompted him to kill his brother, and he killed him, and thus became one of the losers.\n",
        "TRANSLATION_12": "The (selfish) soul of the other led him to the murder of his brother: he murdered him, and became (himself) one of the lost ones.\n",
        "TRANSLATION_13": "So the Nafs (self) of the other (latter one) encouraged him and made fair-seeming to him the murder of his brother; he murdered him and became one of the losers.\n",
        "TRANSLATION_14": "His soul made it seem fair to him to slay his brother; he killed him and became one of the lost.\n",
        "TRANSLATION_15": "Then His soul prompted him to kill his brother, so he killed him, and became one of the losers.\n",
        "TRANSLATION_16": "And his soul permitted to him the murder of his brother, so he killed him and became among the losers.\n",
        "TRANSLATION_17": "[5:30] Then his soul prompted him, it seduced him, to slay his brother, so he slew him and became one of the losers, by slaying him. And he did not know what to do with him, because he was the first of the Children of Adam to die on earth, and so he carried him on his back.\n",
        "TRANSLATION_18": "(But (the other's) mind imposed on him) his ego permitted him (the killing of his brother, so he slew him and became one of the losers) who deserved punishment.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "5:30",
            "21:64",
            "20:67",
            "27:92",
            "20:41",
            "3:168",
            "26:36",
            "7:111",
            "37:141",
            "12:58"
        ],
        "BIBLE": [
            "prophets:ii%20kings:17:25",
            "prophets:i%20kings:21:19",
            "torah:numbers:31:17",
            "prophets:i%20samuel:24:12",
            "prophets:jeremiah:23:2",
            "writings:ii%20chronicles:25:3",
            "torah:numbers:22:6",
            "prophets:jeremiah:23:8",
            "prophets:ii%20samuel:14:7",
            "prophets:i%20samuel:18:1"
        ]
    }
}