{
    "VERSE": "5:34",
    "ARABIC": "إِلَّا ٱلَّذِينَ تَابُوا۟ مِن قَبْلِ أَن تَقْدِرُوا۟ عَلَيْهِمْ فَٱعْلَمُوٓا۟ أَنَّ ٱللَّهَ غَفُورٌ رَّحِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "except for those who make tawba before you gain power over them. Know that Allah is Ever-Forgiving,",
        "TRANSLATION_1": "But those who repent before they are subdued should know that God is forgiving and kind.\n",
        "TRANSLATION_2": "except for those who repent before you have overpowered them. Know well that Allah is All-Forgiving, All-Compassionate.\n",
        "TRANSLATION_3": "As for those who repent before you (the legal authorities) have control over them (by proving their guilts). They should know that God is All-forgiving and All-merciful.\n",
        "TRANSLATION_4": "Except those who repent before you apprehend them; so know well that Allah is Oft Forgiving, Most Merciful.\n",
        "TRANSLATION_5": "Except for those who (having fled away and then) came back (as Muslims) with repentance before they fall into your power; in that case, know that Allah is Oft-Forgiving, Most Merciful.\n",
        "TRANSLATION_6": "Except those who repent before you have them in your power; so know that Allah is Forgiving, Merciful.\n",
        "TRANSLATION_7": "except for such as repent, before you have power over them. So know you that God is All-forgiving, All-compassionate.\n",
        "TRANSLATION_8": "Save those who repent before ye overpower them. For know that Allah is Forgiving, Merciful.\n",
        "TRANSLATION_9": "except for those who repent before you gain power over them: for you must know that God is forgiving and merciful.\n",
        "TRANSLATION_10": "Save those who repent ere ye have them in your power; for know that Allah is Forgiving, Merciful.\n",
        "TRANSLATION_11": "excepting those who repent before you capture them, and know that Allah is all-forgiving, all-merciful.\n",
        "TRANSLATION_12": "Except for those who repent before they fall into your power: in that case, know that Allah is Oft-forgiving, Most Merciful.\n",
        "TRANSLATION_13": "Except for those who (having fled away and then) came back (as Muslims) with repentance before they fall into your power; in that case, know that Allah is Oft-Forgiving, Most Merciful.\n",
        "TRANSLATION_14": "except those who repent before you have power over them. For you must know that Allah is Forgiving, the Most Merciful.\n",
        "TRANSLATION_15": "Except for those who repent before you apprehend them. So know that God is Forgiving and Merciful.\n",
        "TRANSLATION_16": "Except for those who return [repenting] before you apprehend them. And know that Allah is Forgiving and Merciful.\n",
        "TRANSLATION_17": "[5:34] Except for such, warmongers and waylayers, as repent before you overpower them; for know that God is   Forgiving, to them of what they have done, Merciful, to them. This [proviso] is expressed without any statement to the effect ‘do not submit them to prescribed legal punishment’, to point out that when such a person repents only God’s prescribed punishments (hudūd) — and not those deriving from the rights of human beings — are waived. This is how I see it. I do not know of any that have tackled this [topic], and God knows best. If, then, a person has killed and stolen property, he should be killed and have his limbs cut off [on opposite sides], but not crucified — this is the more sound of two opinions held by al-Shāfi‘ī. However, his repentance is of no avail, once he has been overpowered [by the authorities] — this is also the more sound of two opinions held by him.\n",
        "TRANSLATION_18": "Allah then showed that He pardons those who repent, saying: (Save those who repent) from disbelief and idolatry (before ye overpower them) i.e. before you capture them. (For know that Allah is Forgiving) He pardons, (Merciful) towards him who repents.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "5:34",
            "3:89",
            "24:5",
            "2:192",
            "2:218",
            "4:106",
            "60:7",
            "8:69",
            "5:98",
            "33:73"
        ],
        "BIBLE": [
            "writings:ii%20chronicles:30:9",
            "writings:nehemiah:4:9",
            "prophets:ii%20kings:5:15",
            "writings:job:16:22",
            "writings:nehemiah:2:17",
            "writings:ii%20chronicles:32:21",
            "prophets:ii%20samuel:24:13",
            "writings:job:17:10",
            "writings:daniel:11:30",
            "writings:ii%20chronicles:25:16"
        ]
    }
}