{
    "VERSE": "5:37",
    "ARABIC": "يُرِيدُونَ أَن يَخْرُجُوا۟ مِنَ ٱلنَّارِ وَمَا هُم بِخَٰرِجِينَ مِنْهَا وَلَهُمْ عَذَابٌ مُّقِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "They will want to get out of the Fire but they will not be able to. They will have an everlasting punishment.",
        "TRANSLATION_1": "They would like to escape from the Fire, but will never succeed, and their suffering will be constant\n",
        "TRANSLATION_2": "They will wish to come out of the Fire, but they will not. Theirs will be a long-lasting chastisement.\n",
        "TRANSLATION_3": "They will wish to get out of the fire but they will not have such a choice. Their torment will be constant.\n",
        "TRANSLATION_4": "They will wish to come out of hell, and will not come out of it – and for them is an unending punishment.\n",
        "TRANSLATION_5": "They will long to get out of the Fire, but never will they get out therefrom; and theirs will be a lasting torment.\n",
        "TRANSLATION_6": "They would desire to go forth from the fire, and they shall not go forth from it, and they shall have a lasting punishment.\n",
        "TRANSLATION_7": "They will desire to come forth from the Fire, but they will not come forth from it; for them awaits a lasting chastisement.\n",
        "TRANSLATION_8": "They will wish to come forth from the Fire, but they will not come forth from it. Theirs will be a lasting doom.\n",
        "TRANSLATION_9": "They will want to get out of the Fire but they will be unable to do so: theirs shall be a lasting punishment.\n",
        "TRANSLATION_10": "They will desire to come forth from the Fire, but they shall not be able to come forth therefrom, and theirs shall be a torment lasting.\n",
        "TRANSLATION_11": "They would long to leave the Fire, but they shall never leave it, and there is a lasting punishment for them.\n",
        "TRANSLATION_12": "Their wish will be to get out of the Fire, but never will they get out therefrom: their penalty will be one that endures.\n",
        "TRANSLATION_13": "They will long to get out of the Fire, but never will they get out therefrom, and theirs will be a lasting torment.\n",
        "TRANSLATION_14": "They will wish to get out of the Fire, but they shall not, theirs shall be a lasting punishment.\n",
        "TRANSLATION_15": "They will want to leave the Fire, but they will not leave it. For them is a lasting punishment.\n",
        "TRANSLATION_16": "They will wish to get out of the Fire, but never are they to emerge therefrom, and for them is an enduring punishment.\n",
        "TRANSLATION_17": "[5:37] They will desire, they will wish, to exit from the Fire, but they will not exit from it; theirs shall be a lasting, a perpetual, chastisement.\n",
        "TRANSLATION_18": "(They will wish to come forth from the Fire) by changing one state into another, (but they will not come forth from it) from the Fire. (Theirs will be a lasting doom) which will never be interrupted.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "5:37",
            "32:20",
            "38:61",
            "8:14",
            "3:16",
            "3:188",
            "34:42",
            "59:3",
            "23:76",
            "3:56"
        ],
        "BIBLE": [
            "writings:job:20:21",
            "prophets:ezekiel:14:22",
            "torah:leviticus:6:6",
            "prophets:ezekiel:6:8",
            "writings:psalms:81:16",
            "writings:psalms:37:33",
            "torah:leviticus:16:23",
            "prophets:jeremiah:44:14",
            "prophets:jeremiah:11:11",
            "torah:genesis:28:15"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:1:14",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:12",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:8"
        ]
    }
}