{
    "VERSE": "5:39",
    "ARABIC": "فَمَن تَابَ مِنۢ بَعْدِ ظُلْمِهِۦ وَأَصْلَحَ فَإِنَّ ٱللَّهَ يَتُوبُ عَلَيْهِ إِنَّ ٱللَّهَ غَفُورٌ رَّحِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "But if anyone makes tawba after his wrongdoing and puts things right, Allah will turn towards him. Allah is Ever-Forgiving, Most Merciful.",
        "TRANSLATION_1": "But those who repent after a crime and reform, shall be forgiven by God, for God is forgiving and kind.\n",
        "TRANSLATION_2": "But he who repents after he has committed wrong, and makes amends, Allah will graciously turn to him. Truly Allah is All-Forgiving, All-Compassionate.\n",
        "TRANSLATION_3": "However, God will accept the repentance of whoever repents and reforms himself after committing injustice; He is All-forgiving and All-merciful.\n",
        "TRANSLATION_4": "So if one repents after his wrongdoing and reforms himself, Allah will incline towards him with His mercy; indeed Allah is Oft Forgiving, Most Merciful.\n",
        "TRANSLATION_5": "But whosoever repents after his crime and does righteous good deeds, then verily, Allah will pardon him. Verily, Allah is Oft-Forgiving, Most Merciful.\n",
        "TRANSLATION_6": "But whoever repents after his iniquity and reforms (himself), then surely Allah will turn to him (mercifully); surely Allah is Forgiving, Merciful.\n",
        "TRANSLATION_7": "But whoso repents, after his evildoing, and makes amends, God will turn towards him; God is All-forgiving, All-compassionate.\n",
        "TRANSLATION_8": "But whoso repenteth after his wrongdoing and amendeth, lo! Allah will relent toward him. Lo! Allah is Forgiving, Merciful.\n",
        "TRANSLATION_9": "But God will surely turn in mercy to him who repents after his transgression and reforms. Surely, God is most forgiving and ever merciful.\n",
        "TRANSLATION_10": "Then whosoever repenteth after his wrong-doing and amendeth, verily Allah shall relent toward him. Verily Allah is Forgiving, Merciful.\n",
        "TRANSLATION_11": "But whoever repents after his wrongdoing, and reforms, then Allah shall accept his repentance. Indeed Allah is all-forgiving, all-merciful.\n",
        "TRANSLATION_12": "But if the thief repents after his crime, and amends his conduct, Allah turneth to him in forgiveness; for Allah is Oft-forgiving, Most Merciful.\n",
        "TRANSLATION_13": "But whosoever repents after his crime and does righteous good deeds (by obeying Allah), then verily, Allah will pardon him (accept his repentance). Verily, Allah is Oft-Forgiving, Most Merciful.\n",
        "TRANSLATION_14": "But whoever repents and mends his ways after committing evil shall be pardoned by Allah. Allah is Forgiving, Most Merciful.\n",
        "TRANSLATION_15": "But whoever repents after his crime, and reforms, God will accept his repentance. God is Forgiving and Merciful.\n",
        "TRANSLATION_16": "But whoever repents after his wrongdoing and reforms, indeed, Allah will turn to him in forgiveness. Indeed, Allah is Forgiving and Merciful.\n",
        "TRANSLATION_17": "[5:39] But whoever repents after his evildoing, refrains from theft, and amends, his actions, God will relent to him. God is indeed Forgiving, Merciful, in expressing what has been stated. However, the rights of the victim to have the penalty of amputation carried out and his property restored are not [automatically] forgone after repentance. In fact, as is clarified in the Sunna, only if he is pardoned before being taken to the Imam is the [punishment of] amputation waived, and al-Shāfi‘ī is of this opinion.\n",
        "TRANSLATION_18": "(But whoso repenteth after his wrong-doing) after his theft and being punished for it (and amendeth) that which is between him and his Lord through repentance, (lo! Allah will relent towards him) Allah will forgive him. (Lo! Allah is Forgiving) He pardons, (Merciful) towards him who repents.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "5:39",
            "24:5",
            "3:89",
            "9:27",
            "2:192",
            "4:106",
            "4:96",
            "2:182",
            "3:31",
            "33:73"
        ],
        "BIBLE": [
            "prophets:joel:2:13",
            "torah:leviticus:5:26",
            "writings:psalms:85:14",
            "prophets:ezekiel:18:30",
            "prophets:jeremiah:31:13",
            "writings:daniel:9:24",
            "prophets:hosea:11:8",
            "torah:deuteronomy:7:2",
            "writings:psalms:71:16",
            "prophets:ii%20samuel:22:33"
        ]
    }
}