{
    "VERSE": "5:42",
    "ARABIC": "سَمَّٰعُونَ لِلْكَذِبِ أَكَّٰلُونَ لِلسُّحْتِ فَإِن جَآءُوكَ فَٱحْكُم بَيْنَهُمْ أَوْ أَعْرِضْ عَنْهُمْ وَإِن تُعْرِضْ عَنْهُمْ فَلَن يَضُرُّوكَ شَيْـًٔا وَإِنْ حَكَمْتَ فَٱحْكُم بَيْنَهُم بِٱلْقِسْطِ إِنَّ ٱللَّهَ يُحِبُّ ٱلْمُقْسِطِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "They are people who listen to lies and consume ill-gotten gains. If they come to you, you can either judge between them or turn away from them. If you turn away from them, they cannot harm you in any way. But if you do judge, judge between them justly. Allah loves the just.",
        "TRANSLATION_1": "Eavesdropping for telling lies, earning through unlawful means! So, if they come to you, judge between them or decline. And if you decline, they can do you no harm; but if you judge, you should do so with justice, for God loves those who are just.\n",
        "TRANSLATION_2": "They are listeners of falsehood and greedy devourers of unlawful earnings. If they come to you you may either judge between them or turn away from them. And were you to turn away from them they shall not be able to harm you; and were you to judge between them judge with justice. Surely Allah loves the just.\n",
        "TRANSLATION_3": "They deliberately listen to lies (for deceitful purposes) and live on usury. If they come to you (seeking your judgment to settle their differences), you may settle their disputes or keep aloof from them. Should you choose not to bother with them, it will not harm you in the least. If you decide to issue your decree, decide their case with justice. God loves those who are just.\n",
        "TRANSLATION_4": "The excessively eager listeners of falsehood, extreme devourers of the forbidden; so if they come humbly to you (Prophet Mohammed – peace and blessings be upon him), judge between them or shun them; and if you turn away from them they cannot harm you at all; and if you do judge between them, judge with fairness; indeed Allah loves the equitable.\n",
        "TRANSLATION_5": "They (like to) listen to falsehood, to devour Suht. So if they come to you, either judge between them, or turn away from them. If you turn away from them, they cannot hurt you in the least. And if you judge, judge with justice between them. Verily, Allah loves those who act justly.\n",
        "TRANSLATION_6": "(They are) listeners of a lie, devourers of what is forbidden; therefore if they come to you, judge between them or turn aside from them, and if you turn aside from them, they shall not harm you in any way; and if you judge, judge between them with equity; surely Allah loves those who judge equitably.\n",
        "TRANSLATION_7": "who listen to falsehood, and consume the unlawful. If they come to thee, judge thou between them, or turn away from them; if thou turnest away from them, they will hurt thee nothing; and if thou judgest, judge justly between them; God loves the just.\n",
        "TRANSLATION_8": "Listeners for the sake of falsehood! Greedy for illicit gain! If then they have recourse unto thee (Muhammad) judge between them or disclaim jurisdiction. If thou disclaimest jurisdiction, then they cannot harm thee at all. But if thou judgest, judge between them with equity. Lo! Allah loveth the equitable.\n",
        "TRANSLATION_9": "They listen eagerly to falsehood, and devour forbidden things voraciously. If they come to you, then judge between them or avoid them. If you avoid them, they can in no way harm you, but if you do judge, judge them with fairness: God loves those that deal justly.\n",
        "TRANSLATION_10": "Listeners are they to falsehood, devourers of the forbidden. Wherefore if they come to thee, either judge between them or turn away from them. And if thou turnest away from them, they shall not be able to hurt thee in aught; and if thou judgest, judge between them with equity, verily Allah loveth the equitable.\n",
        "TRANSLATION_11": "Eavesdroppers with the aim of [telling] lies, eaters of the unlawful—if they come to you, judge between them, or disregard them. If you disregard them, they will not harm you in any way. But if you judge, judge between them with justice. Indeed Allah loves the just.\n",
        "TRANSLATION_12": "(They are fond of) listening to falsehood, of devouring anything forbidden. If they do come to thee, either judge between them, or decline to interfere. If thou decline, they cannot hurt thee in the least. If thou judge, judge in equity between them. For Allah loveth those who judge in equity.\n",
        "TRANSLATION_13": "(They like to) listen to falsehood, to devour anything forbidden. So if they come to you (O Muhammad SAW), either judge between them, or turn away from them. If you turn away from them, they cannot hurt you in the least. And if you judge, judge with justice between them. Verily, Allah loves those who act justly.\n",
        "TRANSLATION_14": "They are listeners to lies and devourers of the unlawful. If they come to you, judge between them or turn away from them. If you avoid them they cannot harm you in anything; but if you judge, judge between them with fairness. Allah loves the just.\n",
        "TRANSLATION_15": "Listeners to falsehoods, eaters of illicit earnings. If they come to you, judge between them, or turn away from them. If you turn away from them, they will not harm you in the least. But if you judge, judge between them equitably. God loves the equitable.\n",
        "TRANSLATION_16": "[They are] avid listeners to falsehood, devourers of [what is] unlawful. So if they come to you, [O Muhammad], judge between them or turn away from them. And if you turn away from them - never will they harm you at all. And if you judge, judge between them with justice. Indeed, Allah loves those who act justly.\n",
        "TRANSLATION_17": "[5:42] They are, listeners to calumny and consumers of unlawful gain (read suhut or suht), that which is illicit, such as bribes. If they come to you, to judge between them, then judge between them or turn away from them: the [second] option given here was abrogated by His saying, So judge between them [to the end of] the verse [Q. 5:48]. Therefore, we [Muslims] are obliged to judge between them if they request arbitration before us — and this is the more sound of al-Shāfi‘ī’s two opinions. If their request for arbitration involves a Muslim, however, then we are obliged to judge according to the consensus [of legal scholars and not just alShāfi‘ī]); if you turn away from them, they cannot harm you at all; and if you judge, between them, then judge justly between them; God loves the just, those that judge fairly, meaning that He will reward them.\n",
        "TRANSLATION_18": "117 (Listeners) and ones who utter words (for the sake of falsehood! Greedy for illicit gain!) bribery and that which is unlawful by changing the rulings of Allah. (If then they) i.e. the Banu Qurayzah and the Banu'l- Nadir (have recourse unto thee) Muhammad (judge between them) between the Banu Qurayzah and the Banu'l-Nadir; and it is also said: between the people of Khaybar (or disclaim jurisdiction) by choice. (If thou disclaimest jurisdiction) and do not judge between them, (then they cannot harm thee at all) they cannot take away anything from you. (But if thou judgest) between the Banu Qurayzah and the Banu'l-Nadir; and it is also said: between the people of Khaybar, (judge between them with equity) with stoning [married people who commit adultery]. (Lo! Allah loveth the equitable) who are fair when they judge with the Book of Allah and who apply the legal ruling of stoning.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "5:42",
            "45:19",
            "3:64",
            "10:47",
            "33:54",
            "3:177",
            "46:8",
            "8:1",
            "2:227",
            "3:63"
        ],
        "BIBLE": [
            "prophets:ezekiel:18:30",
            "torah:deuteronomy:17:11",
            "torah:deuteronomy:31:29",
            "writings:ezra:10:14",
            "prophets:i%20samuel:12:21",
            "prophets:jeremiah:16:19",
            "prophets:jeremiah:2:35",
            "prophets:judges:2:17",
            "prophets:ii%20samuel:14:20",
            "prophets:jeremiah:12:1"
        ]
    }
}