{
    "VERSE": "5:44",
    "ARABIC": "إِنَّآ أَنزَلْنَا ٱلتَّوْرَىٰةَ فِيهَا هُدًى وَنُورٌ يَحْكُمُ بِهَا ٱلنَّبِيُّونَ ٱلَّذِينَ أَسْلَمُوا۟ لِلَّذِينَ هَادُوا۟ وَٱلرَّبَّٰنِيُّونَ وَٱلْأَحْبَارُ بِمَا ٱسْتُحْفِظُوا۟ مِن كِتَٰبِ ٱللَّهِ وَكَانُوا۟ عَلَيْهِ شُهَدَآءَ فَلَا تَخْشَوُا۟ ٱلنَّاسَ وَٱخْشَوْنِ وَلَا تَشْتَرُوا۟ بِـَٔايَٰتِى ثَمَنًا قَلِيلًا وَمَن لَّمْ يَحْكُم بِمَآ أَنزَلَ ٱللَّهُ فَأُو۟لَٰٓئِكَ هُمُ ٱلْكَٰفِرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "We sent down the Torah containing guidance and light, and the Prophets who had submitted themselves gave judgement by it for the Jews - as did their scholars and their rabbis - by what they had been allowed to preserve of Allah's Book to which they were witnesses. Do not be afraid of people, be afraid of Me. And do not sell My Signs for a paltry price. Those who do not judge by what Allah has sent down, such people are kafirun.",
        "TRANSLATION_1": "We sent down the Torah which contains guidance and light, in accordance with which the prophets who were obedient (to God) gave instructions to the Jews, as did the rabbis and priests, for they were the custodians and witnesses of God's writ. So, therefore, do not fear men, fear Me, and barter not My messages away for a paltry gain. Those who do not judge by God's revelations are infidels indeed.\n",
        "TRANSLATION_2": "Surely We revealed the Torah, wherein there is guidance and light. Thereby did Prophets - who had submitted themselves (to Allah) - judge for the Judaized folk; and so did the scholars and jurists. They judged by the Book of Allah for they had been entrusted to keep it, and bear witness to it. So (O Jews!) do not fear men but fear Me, and do not barter away My signs for a trivial gain. Those who do not judge by what Allah has revealed are indeed the unbelievers.\n",
        "TRANSLATION_3": "We had revealed the Torah, containing guidance and light. The Prophets who had submitted themselves to the will of God, judged the Jews by the laws of the Torah. So did the godly people and the Jewish scholars who remembered some parts of the Book of God and bore witness to it. Mankind, do not be afraid of people but have fear of Me. Do not sell My revelations for a paltry price. Those who do not judge by the laws of God are disbelievers.\n",
        "TRANSLATION_4": "Undoubtedly We sent down the Taurat, in which is guidance and light; the Jews were commanded according to it by Our obedient Prophets, and the rabbis and the religious jurists for they were commanded to protect Allah’s Book, and were witnesses to it; so do not fear men, and fear Me, and do not exchange My verses for an abject price; and whoever does not judge according to what is sent down by Allah – it is they who are disbelievers.\n",
        "TRANSLATION_5": "Verily, We did send down the Tawrah, therein was guidance and light, by which the Prophets who submitted themselves to Allah's will, judged for the Jews. And the Rabbaniyyun and the Ahbar, for to them was entrusted the protection of Allah's Book, and they were witnesses thereto. Therefore fear not men but fear Me and sell not My verses for a miserable price. And whosoever does not judge by what Allah has revealed, such are the disbelievers.\n",
        "TRANSLATION_6": "Surely We revealed the Taurat in which was guidance and light; with it the prophets who submitted themselves (to Allah) judged (matters) for those who were Jews, and the masters of Divine knowledge and the doctors, because they were required to guard (part) of the Book of Allah, and they were witnesses thereof; therefore fear not the people and fear Me, and do not take a small price for My communications; and whoever did not judge by what Allah revealed, those are they that are the unbelievers.\n",
        "TRANSLATION_7": "Surely We sent down the Torah, wherein is guidance and light; thereby the Prophets who had surrendered themselves gave judgment for those of Jewry, as did the masters and the rabbis, following such portion of God's Book as they were given to keep and were witnesses to. So fear not men, but fear you Me; and sell not My signs for a little price. Whoso judges not according to what God has sent down - they are the unbelievers.\n",
        "TRANSLATION_8": "Lo! We did reveal the Torah, wherein is guidance and a light, by which the prophets who surrendered (unto Allah) judged the Jews, and the rabbis and the priests (judged) by such of Allah's Scripture as they were bidden to observe, and thereunto were they witnesses. So fear not mankind, but fear Me. And My revelations for a little gain. Whoso judgeth not by that which Allah hath revealed: such are disbelievers.\n",
        "TRANSLATION_9": "We have revealed the Torah, in which there is guidance and light. By it the prophets who were obedient to Us judged the Jews, and so did the rabbis and the priests, according to God's Book which had been entrusted to their care; and to which they were witnesses. Have no fear of man; fear Me, and do not sell My revelations for a paltry sum. Those who do not judge by what God has sent down are deniers of truth.\n",
        "TRANSLATION_10": "Verily We sent down the Taurat wherein was a guidance and a light. By it the prophets who submitted themselves judged those who were judaised, and so did the divines and the priests by that wherewith they were entrusted of the Book of Allah and they had become witnesses thereof. Wherefore fear not the mankind but fear Me, and barter not My revelations for a small price, And whosoever judgeth not by that which Allah hath sent down - those then they are the infidels.\n",
        "TRANSLATION_11": "We sent down the Torah containing guidance and light. The prophets, who had submitted, judged by it for the Jews, and so did the rabbis and the scribes, as they were charged to preserve the Book of Allah and were witnesses to it. So do not fear the people, but fear Me, and do not sell My signs for a paltry gain. Those who do not judge by what Allah has sent down—it is they who are the faithless.\n",
        "TRANSLATION_12": "It was We who revealed the law (to Moses): therein was guidance and light. By its standard have been judged the Jews, by the prophets who bowed (as in Islam) to Allah's will, by the rabbis and the doctors of law: for to them was entrusted the protection of Allah's book, and they were witnesses thereto: therefore fear not men, but fear me, and sell not my signs for a miserable price. If any do fail to judge by (the light of) what Allah hath revealed, they are (no better than) Unbelievers.\n",
        "TRANSLATION_13": "Verily, We did send down the Taurat (Torah) [to Musa (Moses)], therein was guidance and light, by which the Prophets, who submitted themselves to Allah's Will, judged the Jews. And the rabbis and the priests [too judged the Jews by the Taurat (Torah) after those Prophets] for to them was entrusted the protection of Allah's Book, and they were witnesses thereto. Therefore fear not men but fear Me (O Jews) and sell not My Verses for a miserable price. And whosoever does not judge by what Allah has revealed, such are the Kafirun (i.e. disbelievers - of a lesser degree as they do not act on Allah's Laws).\n",
        "TRANSLATION_14": "We have sent down the Torah in which there is guidance and light by which the submissive prophets judged the Jews, as did the rabbis and those of their Lord, guarding what they were required to of the Book of Allah, and for which they were witness. Do not fear people, but fear Me. And, do not take a small price for My verses. Those who do not judge with what Allah has sent down are the unbelievers.\n",
        "TRANSLATION_15": "We have revealed the Torah, wherein is guidance and light. The submissive prophets ruled the Jews according to it, so did the rabbis and the scholars, as they were required to protect God’s Book, and were witnesses to it. So do not fear people, but fear Me. And do not sell My revelations for a cheap price. Those who do not rule according to what God revealed are the unbelievers.\n",
        "TRANSLATION_16": "Indeed, We sent down the Torah, in which was guidance and light. The prophets who submitted [to Allah] judged by it for the Jews, as did the rabbis and scholars by that with which they were entrusted of the Scripture of Allah, and they were witnesses thereto. So do not fear the people but fear Me, and do not exchange My verses for a small price. And whoever does not judge by what Allah has revealed - then it is those who are the disbelievers.\n",
        "TRANSLATION_17": "[5:44] Surely We revealed the Torah, wherein is guidance, from error, and light, that is, an exposition of the rulings, by which the prophets, from the Children of Israel, who had submitted, [who] had been compliant before God, judged for those of Jewry, as did the rabbis, the scholars among them, and the priests, the jurists, according to, because of, that which they were bidden to observe, [that which] was entrusted to them, that is to say, [that which] God bid them to observe, of God’s Scripture, lest they change it, and were witnesses to, its truth. So do not fear men, O Jews, in disclosing what you have pertaining to the descriptions of Muhammad (s), the ‘stoning’ verse and otherwise; but fear Me, when you conceal it; and do not sell, do not exchange, My signs for a small price, of this world, which you take in return for concealing them. Whoever does not judge according to what God has revealed — such are the disbelievers, in it.\n",
        "TRANSLATION_18": "(Lo! We did reveal the Torah) to Moses, (wherein is guidance) from error (and a light) the explanation of stoning, (by which) by the Torah (the Prophets who surrendered (unto Allah)) those who surrendered to Allah from the time of Moses to the time of Jesus, in the interval of which there were 1,00O Prophets (judged the Jews) the forefathers who were Jews, (and the rabbis) He says: those who judged between them were the godly men of knowledge and the ascetics (and the priests) all the other men of knowledge ((judged) by such of Allah's Scripture as they were bidden to observe) by that which they acted upon and called other people to, as in the Book of Allah, (and thereunto) i.e. about the legal ruling of stoning (were they witnesses. So fear not mankind) regarding the display of the traits and description of Muhammad and the legal ruling of stoning, (but fear Me) for concealing them. (And barter not My revelations) through concealment of the traits and description of Muhammad (pbuh) and the verse of stoning (for a little gain) for a paltry portion in your means of living. (Whoso judgeth not by that which Allah hath revealed) Allah says: whoever does not show that which Allah has shown in the Torah regarding the traits and description of Muhammad and the verse of stoning: (such are disbelievers) in Allah, the messenger and the Scripture.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "5:44",
            "3:199",
            "3:187",
            "2:159",
            "2:174",
            "6:91",
            "2:79",
            "2:283",
            "6:150",
            "6:157"
        ],
        "BIBLE": [
            "prophets:ii%20kings:21:8",
            "prophets:i%20kings:8:56",
            "prophets:ezekiel:3:20",
            "prophets:i%20kings:14:8",
            "writings:daniel:2:23",
            "prophets:i%20kings:13:5",
            "writings:ii%20chronicles:19:6",
            "torah:genesis:31:42",
            "writings:ii%20chronicles:25:4",
            "torah:deuteronomy:26:13"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:12",
            
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:6"
        ]
    }
}