{
    "VERSE": "5:45",
    "ARABIC": "وَكَتَبْنَا عَلَيْهِمْ فِيهَآ أَنَّ ٱلنَّفْسَ بِٱلنَّفْسِ وَٱلْعَيْنَ بِٱلْعَيْنِ وَٱلْأَنفَ بِٱلْأَنفِ وَٱلْأُذُنَ بِٱلْأُذُنِ وَٱلسِّنَّ بِٱلسِّنِّ وَٱلْجُرُوحَ قِصَاصٌ فَمَن تَصَدَّقَ بِهِۦ فَهُوَ كَفَّارَةٌ لَّهُۥ وَمَن لَّمْ يَحْكُم بِمَآ أَنزَلَ ٱللَّهُ فَأُو۟لَٰٓئِكَ هُمُ ٱلظَّٰلِمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "We prescribed for them in it: a life for a life, an eye for an eye, a nose for a nose, an ear for an ear, a tooth for a tooth, and retaliation for wounds. But if anyone forgoes that as a sadaqa, it will act as expiation for him. Those who do not judge by what Allah has sent down, such people are wrongdoers.",
        "TRANSLATION_1": "And there (in the Torah) We had ordained for them a life for a life, and an eye for an eye, and a nose for a nose, and an ear for an ear, and a tooth for a tooth, and for wounds retribution, though he who forgoes it out of charity, atones for his sins. And those who do not judge by God's revelations are unjust.\n",
        "TRANSLATION_2": "And therein We had ordained for them: 'A life for a life, and an eye for an eye, and a nose for a nose, and an ear for an ear, and a tooth for a tooth, and for all wounds, like for like. But whosoever forgoes it by way of charity, it will be for him an expiation. Those who do not judge by what Allah has revealed are indeed the wrong-doers.\n",
        "TRANSLATION_3": "In the Torah We made mandatory for the Jews these rules of retaliation: Capital punishment for the murder of a person; an eye for an eye, a nose for a nose, an ear for an ear, a tooth for a tooth, and a just compensation for a wound. If the perpetrator is forgiven by the affected party, this will be an expiation of his crime. Those who do not judge according to what God has revealed are unjust.\n",
        "TRANSLATION_4": "And in the Taurat, We made it obligatory upon them that, “A life (is the retribution) for a life, and an eye for an eye, and a nose for a nose, and an ear for an ear, and a tooth for a tooth, and for wounds is a retribution”; then whoever willingly agrees to retribution, it shall redeem him of his sin; and whoever does not judge according to what is sent down by Allah – it is they who are the unjust.\n",
        "TRANSLATION_5": "And We ordained therein for them \"Life for life, eye for eye, nose for nose, ear for ear, tooth for tooth, and wounds equal for equal. \" But if anyone remits the retaliation by way of charity, it shall be for him an expiation. And whosoever does not judge by that which Allah has revealed, such are the unjust.\n",
        "TRANSLATION_6": "And We prescribed to them in it that life is for life, and eye for eye, and nose for nose, and ear for ear, and tooth for tooth, and (that there is) reprisal in wounds; but he who foregoes it, it shall be an expiation for him; and whoever did not judge by what Allah revealed, those are they that are the unjust.\n",
        "TRANSLATION_7": "And therein We prescribed for them: 'A life for a life, an eye for an eye, a nose for a nose, an ear for an ear, a tooth for a tooth, and for wounds retaliation'; but whosoever forgoes it as a freewill offering, that shall be for him an expiation. Whoso judges not according to what God has sent down -- they are the evildoers.\n",
        "TRANSLATION_8": "And We prescribed for them therein: The life for the life, and the eye for the eye, and the nose for the nose, and the ear for the ear, and the tooth for the tooth, and for wounds retaliation. But whoso forgoeth it (in the way of charity) it shall be expiation for him. Whoso judgeth not by that which Allah hath revealed: such are wrong-doers.\n",
        "TRANSLATION_9": "We prescribed for them in [the Torah]: a life for a life, an eye for an eye, a nose for a nose, an ear for an ear, a tooth for a tooth, and a wound for a wound. But, if anyone forgoes it, this shall be for him an expiation. Those who do not judge by what God has sent down are wrongdoers!\n",
        "TRANSLATION_10": "And We prescribed unto them therein: a life for a life, and an eye for an eye, and a nose for a nose, and an ear for an ear, and a tooth for a tooth, and wounds in reprisal, then whosoever forgoeth it, then it shall be for him an expiation. And whosoever judgeth not by that which Allah hath sent down - those then! they are the wrong-doers.\n",
        "TRANSLATION_11": "In it We prescribed for them: a life for a life, an eye for an eye, a nose for a nose, and an ear for an ear, a tooth for a tooth, and retaliation for wounds. Yet whoever remits it out of charity, that shall be an atonement for him. Those who do not judge by what Allah has sent down—it is they who are the wrongdoers.\n",
        "TRANSLATION_12": "We ordained therein for them: \"Life for life, eye for eye, nose or nose, ear for ear, tooth for tooth, and wounds equal for equal.\" But if any one remits the retaliation by way of charity, it is an act of atonement for himself. And if any fail to judge by (the light of) what Allah hath revealed, they are (No better than) wrong-doers.\n",
        "TRANSLATION_13": "And We ordained therein for them: \"Life for life, eye for eye, nose for nose, ear for ear, tooth for tooth, and wounds equal for equal.\" But if anyone remits the retaliation by way of charity, it shall be for him an expiation. And whosoever does not judge by that which Allah has revealed, such are the Zalimun (polytheists and wrong-doers - of a lesser degree).\n",
        "TRANSLATION_14": "We have written for them a life for a life, an eye for an eye, a nose for a nose, an ear for an ear, a tooth for a tooth, and for wounds equal retaliation, but whosoever forgoes it as a freewill offering, it will be an expiation for him. Whoever does not judge according to what Allah has sent down are the harmdoers.\n",
        "TRANSLATION_15": "And We wrote for them in it: a life for a life, an eye for an eye, a nose for a nose, an ear for an ear, a tooth for a tooth, and an equal wound for a wound; but whoever forgoes it in charity, it will serve as atonement for him. Those who do not rule according to what God revealed are the evildoers.\n",
        "TRANSLATION_16": "And We ordained for them therein a life for a life, an eye for an eye, a nose for a nose, an ear for an ear, a tooth for a tooth, and for wounds is legal retribution. But whoever gives [up his right as] charity, it is an expiation for him. And whoever does not judge by what Allah has revealed - then it is those who are the wrongdoers.\n",
        "TRANSLATION_17": "[5:45] And therein, in the Torah, We prescribed, We made obligatory, for them that a life, be slain in return, for a life, if it has slain one; and an eye, should be gouged out, for an eye, and a nose, is to be cut off, for a nose, and an ear, is to be amputated, for an ear, and a tooth, should be pulled out, for a tooth (a variant reading has the last four [nouns] in the nominative); and for wounds (read wa’l-jurūhu or wa’l-jurūha) retaliation, that is, the person is entitled to retaliate if this is feasible, as in the case of a hand or a leg; but in cases where one is not able to [retaliate], this is left to arbitration. Although this stipulation was prescribed for   them, it is established in our Law; but whoever forgoes it, that is, retaliation, out of charity, able to restrain himself, then that shall be an expiation for him, of what he has done [of other sins]. Whoever does not judge according to what God has revealed, in the matter of retaliation and otherwise, those are the evildoers.\n",
        "TRANSLATION_18": "(And We prescribed for them) We obligated on the Children of Israel (therein) in the Torah: (The life for the life) that is premeditatedly killed as an expiation for this killing, (and the eye for the eye) that is premeditatedly ruined as an expiation for this ruination, (and the nose for the nose) that is premeditatedly damaged as an expiation for this damage, (and the ear for the ear) that is premeditatedly harmed as an expiation for this harm, (and the tooth for the tooth) that is premeditatedly broken as an expiation for this breaking, (and for wounds retaliation) as a just judgement. (But whoso forgoeth it (in the way of charity)) whoever forgoes retaliating (it shall be expiation for him) i.e. for the harmed person; it is also said: for the person who harmed. (Whoso judgeth not by that which Allah hath revealed) Allah says: whoever does not show what the Qur'an has shown nor act according to it: (such are wrong-doers) who harm themselves with punishment.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "5:45",
            "10:100",
            "9:17",
            "64:16",
            "29:40",
            "4:64",
            "2:72",
            "43:71",
            "59:5",
            "30:44"
        ],
        "BIBLE": [
            "prophets:jeremiah:35:15",
            "torah:leviticus:19:20",
            "prophets:joshua:23:16",
            "writings:psalms:45:7",
            "writings:daniel:7:14",
            "writings:ii%20chronicles:6:27",
            "prophets:zephaniah:3:5",
            "prophets:i%20kings:8:36",
            "prophets:ezekiel:3:20",
            "torah:deuteronomy:26:13"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:8",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:6:3"
        ]
    }
}