{
    "VERSE": "5:51",
    "ARABIC": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ لَا تَتَّخِذُوا۟ ٱلْيَهُودَ وَٱلنَّصَٰرَىٰٓ أَوْلِيَآءَ بَعْضُهُمْ أَوْلِيَآءُ بَعْضٍ وَمَن يَتَوَلَّهُم مِّنكُمْ فَإِنَّهُۥ مِنْهُمْ إِنَّ ٱللَّهَ لَا يَهْدِى ٱلْقَوْمَ ٱلظَّٰلِمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "You who have iman! do not take the Jews and Christians as your friends; they are the friends of one another. Any of you who takes them as friends is one of them. Allah does not guide wrongdoing people.",
        "TRANSLATION_1": "O believers, do not hold Jews and Christians as your allies. They are allies of one another; and anyone who makes them his friends is surely one of them; and God does not guide the unjust.\n",
        "TRANSLATION_2": "Believers! Do not take the Jews and the Christians for your allies. They are the allies of each other. And among you he who takes them for allies, shall be regarded as one of them. Allah does not guide the wrong-doers.\n",
        "TRANSLATION_3": "Believers, do not consider the Jews and Christians as your intimate friends for they are only friends with each other. Whoever does so will be considered as one of them. God does not guide the unjust people.\n",
        "TRANSLATION_4": "O People who Believe! Do not make the Jews and the Christians your friends; they are friends of one another; and whoever among you befriends them, is one of them; indeed Allah does not guide the unjust.\n",
        "TRANSLATION_5": "O you who believe! Do not take friends from the Jews and the Christians, as they are but friends of each other. And if any among you befriends them, then surely, he is one of them. Verily, Allah guides not those people who are the wrongdoers.\n",
        "TRANSLATION_6": "O you who believe! do not take the Jews and the Christians for friends; they are friends of each other; and whoever amongst you takes them for a friend, then surely he is one of them; surely Allah does not guide the unjust people.\n",
        "TRANSLATION_7": "O believers, take not Jews and Christians as friends; they are friends of each other. Whoso of you makes them his friends is one of them. God guides not the people of the evildoers.\n",
        "TRANSLATION_8": "O ye who believe! Take not the Jews and the Christians for friends. They are friends one to another. He among you who taketh them for friends is (one) of them. Lo! Allah guideth not wrongdoing folk.\n",
        "TRANSLATION_9": "Believers, do not take the Jews and Christians as allies. They are allies with one another. Whoever of you takes them as an ally shall become one of them. God does not guide the wrongdoers.\n",
        "TRANSLATION_10": "O ye who believe! take not the Jews and the Nazarenes as friends: friends they are to each other: and whosoever of you befriendeth them, verily he is of them; verily Allah guideth not a wrong-doing people.\n",
        "TRANSLATION_11": "O you who have faith! Do not take the Jews and the Christians for allies: they are allies of each other. Any of you who allies with them is indeed one of them. Indeed Allah does not guide the wrongdoing lot.\n",
        "TRANSLATION_12": "O ye who believe! take not the Jews and the Christians for your friends and protectors: They are but friends and protectors to each other. And he amongst you that turns to them (for friendship) is of them. Verily Allah guideth not a people unjust.\n",
        "TRANSLATION_13": "O you who believe! Take not the Jews and the Christians as Auliya' (friends, protectors, helpers, etc.), they are but Auliya' to one another. And if any amongst you takes them as Auliya', then surely he is one of them. Verily, Allah guides not those people who are the Zalimun (polytheists and wrong-doers and unjust).\n",
        "TRANSLATION_14": "Believers, take neither Jews nor Nazarenes for your guides. They are guides of one another. Whosoever of you takes them for a guide shall become one of their number. Allah does not guide the wrongdoers.\n",
        "TRANSLATION_15": "O you who believe! Do not take the Jews and the Christians as allies; some of them are allies of one another. Whoever of you allies himself with them is one of them. God does not guide the wrongdoing people.\n",
        "TRANSLATION_16": "O you who have believed, do not take the Jews and the Christians as allies. They are [in fact] allies of one another. And whoever is an ally to them among you - then indeed, he is [one] of them. Indeed, Allah guides not the wrongdoing people.\n",
        "TRANSLATION_17": "[5:51] O you who believe, do not take Jews and Christians as patrons, affiliating with them or showing them affection; they are patrons of each other, being united in disbelief. Whoever amongst you affiliates with them, he is one of them, counted with them. God does not guide the folk who do wrong, by affiliating with disbelievers.\n",
        "TRANSLATION_18": "(0 ye who believe!) in Muhammad and the Qur'an. (Take not the Jews and Christians for friends) seeking their assistance and help. (They are friends one to another) He says: some are followers of the religion of others in secret and in the open, just as they are friends of each other. (He among you) group of believers (who taketh them for friends) seeking their assistance and help (is (one) of them) in alliance and is not included in Allah's protection and safety. (Lo! Allah guideth not) to His religion and proof (wrong-doing folk) the Jews and Christians.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "5:51",
            "8:40",
            "8:72",
            "4:104",
            "5:69",
            "45:19",
            "5:67",
            "2:120",
            "63:9",
            "11:30"
        ],
        "BIBLE": [
            "torah:leviticus:25:46",
            "prophets:zephaniah:3:20",
            "torah:exodus:23:27",
            "prophets:ezekiel:4:9",
            "torah:leviticus:20:25",
            "writings:i%20chronicles:28:4",
            "prophets:isaiah:26:13",
            "writings:ii%20chronicles:6:24",
            "prophets:amos:9:14",
            "torah:genesis:13:16"
        ]
    }
}