{
    "VERSE": "5:55",
    "ARABIC": "إِنَّمَا وَلِيُّكُمُ ٱللَّهُ وَرَسُولُهُۥ وَٱلَّذِينَ ءَامَنُوا۟ ٱلَّذِينَ يُقِيمُونَ ٱلصَّلَوٰةَ وَيُؤْتُونَ ٱلزَّكَوٰةَ وَهُمْ رَٰكِعُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Your friend is only Allah and His Messenger and those who have iman: those who establish salat and pay zakat, and bow.",
        "TRANSLATION_1": "Your only friends are God and His Messenger, and those who believe and are steadfast in devotion, who pay the zakat and bow in homage (before God).\n",
        "TRANSLATION_2": "Only Allah, His Messenger, and those who believe and who establish Prayer, pay Zakah, and bow (before Allah) are your allies.\n",
        "TRANSLATION_3": "Only God, His Messenger, and the true believers who are steadfast in prayer and pay alms, while they kneel during prayer, are your guardians.\n",
        "TRANSLATION_4": "You do not have any friends except Allah and His Noble Messenger and the believers who establish the prayer and pay the charity, and are bowed down before Allah.\n",
        "TRANSLATION_5": "Verily, your Protector is Allah, His Messenger, and the believers, those who perform the Salah, and give Zakah, and they bow down.\n",
        "TRANSLATION_6": "Only Allah is your Vali and His Apostle and those who believe, those who keep up prayers and pay the poor-rate while they bow.\n",
        "TRANSLATION_7": "Your friend is only God, and His Messenger, and the believers who perform the prayer and pay the alms, and bow them down.\n",
        "TRANSLATION_8": "Your guardian can be only Allah; and His messenger and those who believe, who establish worship and pay the poordue, and bow down (in prayer).\n",
        "TRANSLATION_9": "Your helpers are only God and His Messenger and the believers who say their prayers and pay the alms and bow down in worship.\n",
        "TRANSLATION_10": "Your friend is but Allah and His apostle and those who have believed- those who establish the prayer and give the poor-rate while they bow down.\n",
        "TRANSLATION_11": "Your guardian is only Allah, His Apostle, and the faithful who maintain the prayer and give the zakat while bowing down.\n",
        "TRANSLATION_12": "Your (real) friends are (no less than) Allah, His Messenger, and the (fellowship of) believers,- those who establish regular prayers and regular charity, and they bow down humbly (in worship).\n",
        "TRANSLATION_13": "Verily, your Wali (Protector or Helper) is Allah, His Messenger, and the believers, - those who perform As-Salat (Iqamat-as-Salat), and give Zakat, and they bow down (submit themselves with obedience to Allah in prayer).\n",
        "TRANSLATION_14": "Your guide is only Allah, His Messenger, and the believers; those who establish the prayer, pay their obligatory charity, and bow down (in worship).\n",
        "TRANSLATION_15": "Your allies are God, and His Messenger, and those who believe—those who pray regularly, and give charity, and bow down.\n",
        "TRANSLATION_16": "Your ally is none but Allah and [therefore] His Messenger and those who have believed - those who establish prayer and give zakah, and they bow [in worship].\n",
        "TRANSLATION_17": "[5:55] When [‘Abd Allāh] Ibn Salām said, ‘O Messenger of God, our people have shunned us’, the following was revealed: Your patron is God only, and His Messenger, and the believers who establish prayer and pay the alms, bowing down, humble, or performing voluntary prayers.\n",
        "TRANSLATION_18": "Then Allah revealed about 'Abdullah Ibn Salam and his companions-Asad, Usayd, Tha'labah Ibn Qays and others-when they were shunned by the Jews, saying: (Your friend) your protector, helper and intimate companion (can be only Allah; and His messenger and those who believe) i.e. Abu Bakr and his companions, (who establish worship) the five daily prayers (and pay the poor-due) from their wealth, (and bow down (in prayer)) in the five daily prayers in congregation with the Prophet (pbuh).\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "5:55",
            "9:71",
            "24:56",
            "33:33",
            "3:132",
            "9:54",
            "7:196",
            "8:20",
            "58:20",
            "2:110"
        ],
        "BIBLE": [
            "prophets:ezekiel:36:3",
            "prophets:ezekiel:12:28",
            "torah:numbers:20:12",
            "prophets:i%20samuel:13:13",
            "prophets:i%20samuel:13:12",
            "prophets:ezekiel:11:17",
            "prophets:jeremiah:44:25",
            "writings:psalms:89:3",
            "prophets:jeremiah:42:5",
            "prophets:joel:2:17"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:6:2"
        ]
    }
}