{
    "VERSE": "5:56",
    "ARABIC": "وَمَن يَتَوَلَّ ٱللَّهَ وَرَسُولَهُۥ وَٱلَّذِينَ ءَامَنُوا۟ فَإِنَّ حِزْبَ ٱللَّهِ هُمُ ٱلْغَٰلِبُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "As for those who make Allah their friend, and His Messenger and those who have iman: it is the party of Allah who are victorious!",
        "TRANSLATION_1": "And those who take God and His Prophet and the faithful as their friends are indeed men of God, who will surely be victorious.\n",
        "TRANSLATION_2": "All those who take Allah and His Messenger and those who believe as their allies, should remember that the party of Allah will be triumphant.\n",
        "TRANSLATION_3": "One whose guardians are God, His Messenger, and the true believers should know that God's party will certainly triumph.\n",
        "TRANSLATION_4": "And whoever takes Allah and His Noble Messenger and the Muslims as friends – so undoubtedly only the party of Allah is victorious.\n",
        "TRANSLATION_5": "And whosoever takes Allah, His Messenger, and those who have believed, as protectors, then the party of Allah will be the victorious.\n",
        "TRANSLATION_6": "And whoever takes Allah and His apostle and those who believe for a guardian, then surely the party of Allah are they that shall be triumphant.\n",
        "TRANSLATION_7": "Whoso makes God his friend, and His Messenger, and the believers -- the party of God, they are the victors.\n",
        "TRANSLATION_8": "And whoso taketh Allah and His messenger and those who believe for guardian (will know that), lo! the party of Allah, they are the victorious.\n",
        "TRANSLATION_9": "Those who ally themsleves with God, His Messenger, and the believers must know that God's party is sure to triumph.\n",
        "TRANSLATION_10": "And whosoever befriendeth Allah and His apostle and those who have believed, then verily the party of Allah! - they are the overcomers.\n",
        "TRANSLATION_11": "Whoever takes for his guardians Allah, His Apostle and the faithful [should know that] the confederates of Allah are indeed the victorious.\n",
        "TRANSLATION_12": "As to those who turn (for friendship) to Allah, His Messenger, and the (fellowship of) believers,- it is the fellowship of Allah that must certainly triumph.\n",
        "TRANSLATION_13": "And whosoever takes Allah, His Messenger, and those who have believed, as Protectors, then the party of Allah will be the victorious.\n",
        "TRANSLATION_14": "Whosoever takes Allah for a guide, His Messenger, and the believers the party of Allah is the victor.\n",
        "TRANSLATION_15": "Whoever allies himself with God, and His Messenger, and those who believe—surely the Party of God is the victorious.\n",
        "TRANSLATION_16": "And whoever is an ally of Allah and His Messenger and those who have believed - indeed, the party of Allah - they will be the predominant.\n",
        "TRANSLATION_17": "[5:56] Whoever affiliates to God and His Messenger and the believers, He will help them and assist them; for verily the party of God, they are the victors, because of His assistance to them (He has made this [hizb Allāh, ‘the party of God’] to fall in the place of [an implied] fa-innahum, ‘for verily they’, as an explication, since they belong to His party, that is, [they] His followers).\n",
        "TRANSLATION_18": "(And whoso taketh Allah and His messenger and those who believe) Abu Bakr and his fellow believers, seeking their assistance and help (for friend (will know that), lo! the party of Allah) the soldiers of Allah, i.e. Muhammad and his Companions (they are the victorious) over their enemies.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "5:56",
            "33:22",
            "3:32",
            "63:1",
            "24:52",
            "59:4",
            "8:13",
            "58:20",
            "3:132",
            "4:80"
        ],
        "BIBLE": [
            "writings:ecclesiastes:3:14",
            "prophets:ezekiel:15:3",
            "prophets:jeremiah:16:20",
            "torah:exodus:32:23",
            "torah:leviticus:4:10",
            "prophets:ezekiel:39:7",
            "torah:exodus:18:16",
            "prophets:jeremiah:31:13",
            "writings:i%20chronicles:28:4",
            "prophets:isaiah:29:21"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:8",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:6"
        ]
    }
}