{
    "VERSE": "5:62",
    "ARABIC": "وَتَرَىٰ كَثِيرًا مِّنْهُمْ يُسَٰرِعُونَ فِى ٱلْإِثْمِ وَٱلْعُدْوَٰنِ وَأَكْلِهِمُ ٱلسُّحْتَ لَبِئْسَ مَا كَانُوا۟ يَعْمَلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "You see many of them rushing to wrongdoing and enmity and acquiring ill-gotten gains. What an evil thing they do!",
        "TRANSLATION_1": "You will see among them many who rush into sin and wickedness, and devour unlawful gain. How evil are the things they do!\n",
        "TRANSLATION_2": "You will see many of them hastening towards sin and transgression and devouring unlawful earnings. Indeed what they do is evil.\n",
        "TRANSLATION_3": "You can see many of them competing with each other in sin, hostility, and in taking usury. What they had been doing is certainly evil.\n",
        "TRANSLATION_4": "And you will see many of them rushing towards sin and oppression, and to devour the forbidden; undoubtedly what they do is extremely evil.\n",
        "TRANSLATION_5": "And you see many of them hurrying for sin and transgression, and eating illegal things. Evil indeed is that which they have been doing.\n",
        "TRANSLATION_6": "And you will see many of them striving with one another to hasten in sin and exceeding the limits, and their eating of what is unlawfully acquired; certainly evil is that which they do.\n",
        "TRANSLATION_7": "Thou seest many of them vying in sin and enmity, and how they consume the unlawful; evil is the thing they have been doing.\n",
        "TRANSLATION_8": "And thou seest many of them vying one with another in sin and transgression and their devouring of illicit gain. Verily evil is what they do.\n",
        "TRANSLATION_9": "You see many among them vie with one another in sin and transgression and practice what is unlawful. It is vile indeed what they have been doing!\n",
        "TRANSLATION_10": "And thou shalt see many of them hastening toward sin and transgression and their devouring of the forbidden. Vile indeed is that which they have been doing!\n",
        "TRANSLATION_11": "You see many of them actively engaged in sin and aggression, and consuming illicit gains. Surely, evil is what they have been doing.\n",
        "TRANSLATION_12": "Many of them dost thou see, racing each other in sin and rancour, and their eating of things forbidden. Evil indeed are the things that they do.\n",
        "TRANSLATION_13": "And you see many of them (Jews) hurrying for sin and transgression, and eating illegal things [as bribes and Riba (usury), etc.]. Evil indeed is that which they have been doing.\n",
        "TRANSLATION_14": "You see many of them race with one another in sin and transgression and devour the unlawful. Evil is what they do.\n",
        "TRANSLATION_15": "You see many of them competing with one another in sin and hostility, and their consuming of what is illicit. What they have been doing is truly evil.\n",
        "TRANSLATION_16": "And you see many of them hastening into sin and aggression and the devouring of [what is] unlawful. How wretched is what they have been doing.\n",
        "TRANSLATION_17": "[5:62] And you see many of them, namely, the Jews, vying, falling headlong, in sin, in calumny, and enmity, wrongdoing, and their consuming of unlawful gain, what is illicit, like bribes; evil is that, deed of theirs, which they have been committing.\n",
        "TRANSLATION_18": "(And thou seest) Muhammad (many of them) i.e. the Jews (vying one with another in sin) competing with one another in committing contraventions and indulging in idolatry (and transgression) wrong-doing and violation against other people (and their devouring of illicit gain) bribery and that which is unlawful in return for changing legal rulings. (Verily evil is what they do) of contraventions and violations against others.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "5:62",
            "5:63",
            "6:120",
            "5:66",
            "26:223",
            "42:34",
            "5:80",
            "26:227",
            "6:119",
            "26:158"
        ],
        "BIBLE": [
            "torah:leviticus:5:23",
            "prophets:ezekiel:3:21",
            "prophets:ii%20kings:2:10",
            "prophets:ezekiel:22:12",
            "torah:genesis:27:33",
            "prophets:joshua:7:11",
            "prophets:jeremiah:48:7",
            "prophets:joshua:7:1",
            "writings:nehemiah:9:25",
            "torah:deuteronomy:28:31"
        ]
    }
}