{
    "VERSE": "5:63",
    "ARABIC": "لَوْلَا يَنْهَىٰهُمُ ٱلرَّبَّٰنِيُّونَ وَٱلْأَحْبَارُ عَن قَوْلِهِمُ ٱلْإِثْمَ وَأَكْلِهِمُ ٱلسُّحْتَ لَبِئْسَ مَا كَانُوا۟ يَصْنَعُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Why do their scholars and rabbis not prohibit them from evil speech and acquiring ill-gotten gains? What an evil thing they invent!",
        "TRANSLATION_1": "Why do not their rabbis and priests prohibit them from talking of sinful things and from devouring unlawful gain? Evil are the acts they commit!\n",
        "TRANSLATION_2": "Why is it that their scholars and jurists do not forbid them from sinful utterances and devouring unlawful earnings? Indeed they have been contriving evil.\n",
        "TRANSLATION_3": "Why did the men of God and rabbis not forbid them from following their sinful words and their consuming of unlawful gains. Evil was their (rabbis and priests) profession!\n",
        "TRANSLATION_4": "Why do not their priests and monks forbid them from speaking evil and devouring the forbidden? Undoubtedly what they do is extremely evil.\n",
        "TRANSLATION_5": "Why do not the Rabbaniyyun and the Ahbar forbid them from uttering sinful words and from eating illegal things. Evil indeed is that which they have been performing.\n",
        "TRANSLATION_6": "Why do not the learned men and the doctors of law prohibit them from their speaking of what is sinful and their eating of what is unlawfully acquired? Certainly evil is that which they work.\n",
        "TRANSLATION_7": "Why do the masters and the rabbis not forbid them to utter sin, and consume the unlawful? Evil is the thing they have been working.\n",
        "TRANSLATION_8": "Why do not the rabbis and the priests forbid their evil-speaking and their devouring of illicit gain? Verily evil is their handiwork.\n",
        "TRANSLATION_9": "Why do their rabbis and scholars not forbid them to utter sinful words or to consume what is unlawful? Their actions are indeed vile.\n",
        "TRANSLATION_10": "Wherefore is it that the divines and priests forbid them not of their speaking of sin and their devouring of the forbidden? Vile indeed is that which they have been performing!\n",
        "TRANSLATION_11": "Why do not the rabbis and the scribes forbid them from sinful speech and consuming illicit gains? Surely, evil is what they have been working.\n",
        "TRANSLATION_12": "Why do not the rabbis and the doctors of Law forbid them from their (habit of) uttering sinful words and eating things forbidden? Evil indeed are their works.\n",
        "TRANSLATION_13": "Why do not the rabbis and the religious learned men forbid them from uttering sinful words and from eating illegal things. Evil indeed is that which they have been performing.\n",
        "TRANSLATION_14": "Do those of the Lord and the rabbis not forbid them to speak sinfully and to devour what is unlawful? Evil indeed is what they were doing.\n",
        "TRANSLATION_15": "Why do the rabbis and the priests not prevent them from speaking sinfully and from consuming forbidden wealth? Evil is what they have been doing.\n",
        "TRANSLATION_16": "Why do the rabbis and religious scholars not forbid them from saying what is sinful and devouring what is unlawful? How wretched is what they have been practicing.\n",
        "TRANSLATION_17": "[5:63] Why do the rabbis and the priests, among them, not forbid them from uttering sin, calumny, and consuming unlawful gain? Evil is what they have been doing, in refraining from forbidding them.\n",
        "TRANSLATION_18": "(Why do not the rabbis) the recluse in their cloisters (and the priests) the men of knowledge (forbid their evil speaking) their idolatry (and their devouring of illicit gain) bribery and that which unlawful? (Verily evil is their handiwork) their abstention from forbidding them to do so.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "5:63",
            "5:62",
            "42:37",
            "33:58",
            "6:120",
            "36:27",
            "37:57",
            "16:42",
            "29:59",
            "15:39"
        ],
        "BIBLE": [
            "prophets:jeremiah:8:8",
            "prophets:ii%20kings:18:27",
            "prophets:isaiah:36:12",
            "prophets:isaiah:29:11",
            "torah:deuteronomy:29:28",
            "prophets:isaiah:59:13",
            "writings:nehemiah:8:9",
            "prophets:ezekiel:12:28",
            "prophets:i%20samuel:24:7",
            "prophets:jeremiah:16:10"
        ]
    }
}