{
    "VERSE": "5:67",
    "ARABIC": "يَٰٓأَيُّهَا ٱلرَّسُولُ بَلِّغْ مَآ أُنزِلَ إِلَيْكَ مِن رَّبِّكَ وَإِن لَّمْ تَفْعَلْ فَمَا بَلَّغْتَ رِسَالَتَهُۥ وَٱللَّهُ يَعْصِمُكَ مِنَ ٱلنَّاسِ إِنَّ ٱللَّهَ لَا يَهْدِى ٱلْقَوْمَ ٱلْكَٰفِرِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "O Messenger! transmit what has been sent down to you from your Lord. If you do not do it you will not have transmitted His Message. Allah will protect you from people. Allah does not guide the people of the kafirun.",
        "TRANSLATION_1": "Some among them are moderate, but evil is what most of them do! O Prophet, announce what has reached you from your Lord, for if you do not, you will not have delivered His message. God will preserve you from (the mischief of) men; for God does not guide those who do not believe.\n",
        "TRANSLATION_2": "O Messenger! Deliver what has been revealed to you from your Lord, for if you fail to do that, you have not fulfilled the task of His messengership. Allah will certainly protect you from the evil of men. Surely Allah will not guide the unbelievers (to succeed against you).\n",
        "TRANSLATION_3": "Messenger, preach what is revealed to you from your Lord. If you will not preach, it would be as though you have not conveyed My message. God protects you from men. He does not guide the unbelieving people.\n",
        "TRANSLATION_4": "O Noble Messenger (Prophet Mohammed – peace and blessings be upon him)! Convey all what has been sent down upon you from your Lord; and if you do not, then you have not conveyed any of His messages; and Allah will protect you from the people; indeed Allah does not guide the disbelievers.\n",
        "TRANSLATION_5": "O Messenger! Convey what has been sent down to you from your Lord. And if you do not, then you have not conveyed His Message. Allah will protect you from mankind. Verily, Allah guides not the people who disbelieve.\n",
        "TRANSLATION_6": "O Apostle! deliver what has been revealed to you from your Lord; and if you do it not, then you have not delivered His message, and Allah will protect you from the people; surely Allah will not guide the unbelieving people.\n",
        "TRANSLATION_7": "O Messenger, deliver that which has been sent down to thee from thy Lord; for if thou dost not, thou wilt not have delivered His Message. God will protect thee from men. God guides not the people of the unbelievers.\n",
        "TRANSLATION_8": "O Messenger! Make known that which hath been revealed unto thee from thy Lord, for if thou do it not, thou wilt not have conveyed His message. Allah will protect thee from mankind. Lo! Allah guideth not the disbelieving folk.\n",
        "TRANSLATION_9": "O Messenger, deliver whatever has been sent down to you by your Lord. If you do not do so, you will not have conveyed His message. God will defend you from mankind. For God does not guide those who deny the truth.\n",
        "TRANSLATION_10": "O Apostle! preach thou all that hath been sent down unto thee from thy Lord; and if thou do it not, thou wilt not have preached His message. Allah shall protect thee from mankind; verily Allah shall not guide a disbelieving people.\n",
        "TRANSLATION_11": "O Apostle! Communicate that which has been sent down to you from your Lord, and if you do not, you will not have communicated His message, and Allah shall protect you from the people. Indeed Allah does not guide the faithless lot.\n",
        "TRANSLATION_12": "O Messenger! proclaim the (message) which hath been sent to thee from thy Lord. If thou didst not, thou wouldst not have fulfilled and proclaimed His mission. And Allah will defend thee from men (who mean mischief). For Allah guideth not those who reject Faith.\n",
        "TRANSLATION_13": "O Messenger (Muhammad SAW)! Proclaim (the Message) which has been sent down to you from your Lord. And if you do not, then you have not conveyed His Message. Allah will protect you from mankind. Verily, Allah guides not the people who disbelieve.\n",
        "TRANSLATION_14": "O Messenger, deliver what is sent down to you from your Lord; if you do not, you will not have conveyed His Message. Allah protects you from the people. Allah does not guide the nation, the unbelievers.\n",
        "TRANSLATION_15": "O Messenger, convey what was revealed to you from your Lord. But if you do not, then you would not have delivered His message. And God will protect you from the people. God does not guide the disbelieving people.\n",
        "TRANSLATION_16": "O Messenger, announce that which has been revealed to you from your Lord, and if you do not, then you have not conveyed His message. And Allah will protect you from the people. Indeed, Allah does not guide the disbelieving people.\n",
        "TRANSLATION_17": "[5:67] O Messenger, make known, all of, that which has been revealed to you from your Lord, and do not conceal any of it out of fear that you may suffer some harm; for if you do not, that is, if you do not make known all of what has been revealed to you, you will not have conveyed His Message (risālatahu, or read plural, risālātihi, ‘His Messages’) since to conceal some of it is to conceal it all. God will protect you from people, who may try to kill you. The Prophet (s) used to have guards up until [the time that] this [verse] was revealed, then he said, ‘Depart, for God protects me now’, as reported by al-Hākim. God does not guide the unbelieving folk.\n",
        "TRANSLATION_18": "(0 Messenger!) i.e. Muhammad (pbuh). (Make known that which hath been revealed unto you from your Lord) of reviling their goddesses, denouncing their religion, fighting against them, and inviting people to Islam (for if ye do it not) that which you have been commanded with, (you will not have conveyed His message) as it ought to be conveyed. (Allah will protect you from mankind) from the Jews and others. (Lo! Allah guideth not the disbelieving folk) He does not guide to His religion anyone who is not fit for it.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "5:67",
            "4:170",
            "5:51",
            "61:5",
            "8:58",
            "7:62",
            "3:32",
            "5:84",
            "3:9",
            "11:88"
        ],
        "BIBLE": [
            "writings:ii%20chronicles:25:15",
            "prophets:i%20samuel:20:13",
            "writings:psalms:140:2",
            "prophets:jeremiah:4:10",
            "torah:deuteronomy:7:16",
            "prophets:ii%20samuel:22:44",
            "writings:psalms:43:1",
            "prophets:judges:13:8",
            "prophets:ii%20kings:5:8",
            "writings:ii%20chronicles:32:15"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:5"
        ]
    }
}