{
    "VERSE": "5:68",
    "ARABIC": "قُلْ يَٰٓأَهْلَ ٱلْكِتَٰبِ لَسْتُمْ عَلَىٰ شَىْءٍ حَتَّىٰ تُقِيمُوا۟ ٱلتَّوْرَىٰةَ وَٱلْإِنجِيلَ وَمَآ أُنزِلَ إِلَيْكُم مِّن رَّبِّكُمْ وَلَيَزِيدَنَّ كَثِيرًا مِّنْهُم مَّآ أُنزِلَ إِلَيْكَ مِن رَّبِّكَ طُغْيَٰنًا وَكُفْرًا فَلَا تَأْسَ عَلَى ٱلْقَوْمِ ٱلْكَٰفِرِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Say: 'People of the Book! you have nothing to stand on until you implement the Torah and the Gospel and what has been sent down to you from your Lord.' What has been sent down to you from your Lord increases many of them in insolence and kufr. So do not waste your grief on the people of the kafirun.",
        "TRANSLATION_1": "Say to them: \"O people of the Book, you have no ground (for argument) until you follow the Torah and the Gospel and what has been revealed to you by your Lord.\" But what has been revealed to you by your Lord will surely increase rebellion and unbelief in many; so do not grieve for those who do not believe.\n",
        "TRANSLATION_2": "Say to them: 'People of the Book! You have no solid ground to stand on unless you establish the Torah and the Gospel and all that had been revealed to you from your Lord. Indeed the message revealed to you from your Lord will aggravate insurgence and unbelief in many of them. So do not grieve for those who disbelieve.\n",
        "TRANSLATION_3": "(Muhammad), tell the People of the Book, \"You have nothing unless you follow the Old and New Testaments and that which (the Quran) God has revealed to you.\" Whatever has been revealed to you (Muhammad) from your Lord will only increase their disbelief and rebellion (against you). Do not grieve for the unbelieving people.\n",
        "TRANSLATION_4": "Say, “O People given the Book(s)! You are nothing until you establish the Taurat and the Injeel, and what was sent down towards you from your Lord”; and this Book which has been sent down upon you from your Lord will cause many of them to advance in their rebellion and disbelief; so do not at all grieve for the disbelievers.\n",
        "TRANSLATION_5": "Say: \"O People of the Scripture! You have nothing till you act according to the Tawrah, the Injil, and what has (now) been sent down to you from your Lord (the Qur'an).\" Verily, the revelation that has come to you from your Lord makes many of them increase in rebellion and disbelief. So do not grieve for the people who disbelieve.\n",
        "TRANSLATION_6": "Say: O followers of the Book! you follow no good till you keep up the Taurat and the Injeel and that which is revealed to you from your Lord; and surely that which has been revealed to you from your Lord shall make many of them increase in inordinacy and unbelief; grieve not therefore for the unbelieving people.\n",
        "TRANSLATION_7": "Say: 'People of the Book, you do not stand on anything, until you perform the Torah and the Gospel, and what was sent down to you from your Lord.' And what has been sent down to thee from thy Lord will surely increase many of them in insolence and unbelief; so grieve not for the people of the unbelievers.\n",
        "TRANSLATION_8": "Say O People of the Scripture! Ye have naught (of guidance) till ye observe the Torah and the Gospel and that which was revealed unto you from your Lord. That which is revealed unto thee (Muhammad) from thy Lord is certain to increase the contumacy and disbelief of many of them. But grieve not for the disbelieving folk.\n",
        "TRANSLATION_9": "Say, \"People of the Book, you have no ground to stand on until you observe the Torah and the Gospel and what is revealed to you from your Lord.\" What is revealed to you from your Lord will surely increase many of them in rebellion and in their denial of the truth. But do not grieve for those who deny the truth.\n",
        "TRANSLATION_10": "Say thou: people of the Book! ye rest not on aught until ye establish the Taurat and the Injil and that which hath now been sent down unto you from your Lord. And that which hath been sent down unto thee will surely increase many of them in exorbitance and infidelity; so mourn thou not over and disbelieving people.\n",
        "TRANSLATION_11": "Say, ‘O People of the Book! You do not stand on anything until you observe the Torah and the Evangel and what was sent down to you from your Lord.’ Surely many of them will be increased in rebellion and unfaith by what has been sent down to you from your Lord. So do not grieve for the faithless lot.\n",
        "TRANSLATION_12": "Say: \"O People of the Book! ye have no ground to stand upon unless ye stand fast by the Law, the Gospel, and all the revelation that has come to you from your Lord.\" It is the revelation that cometh to thee from thy Lord, that increaseth in most of them their obstinate rebellion and blasphemy. But sorrow thou not over (these) people without Faith.\n",
        "TRANSLATION_13": "Say (O Muhammad SAW) \"O people of the Scripture (Jews and Christians)! You have nothing (as regards guidance) till you act according to the Taurat (Torah), the Injeel (Gospel), and what has (now) been sent down to you from your Lord (the Quran).\" Verily, that which has been sent down to you (Muhammad SAW) from your Lord increases in many of them their obstinate rebellion and disbelief. So be not sorrowful over the people who disbelieve.\n",
        "TRANSLATION_14": "Say: 'People of the Book, you are not upon anything until you establish the Torah and the Gospel and that which is sent down to you from your Lord' And that which is sent down to you (Prophet Muhammad) from your Lord will surely increase the tyranny and disbelief of many of them. But do not grieve for the unbelieving nation.\n",
        "TRANSLATION_15": "Say, “O People of the Scripture! You have no basis until you uphold the Torah, and the Gospel, and what is revealed to you from your Lord.” But what is revealed to you from your Lord will increase many of them in rebellion and disbelief, so do not be sorry for the disbelieving people.\n",
        "TRANSLATION_16": "Say, \"O People of the Scripture, you are [standing] on nothing until you uphold [the law of] the Torah, the Gospel, and what has been revealed to you from your Lord.\" And that which has been revealed to you from your Lord will surely increase many of them in transgression and disbelief. So do not grieve over the disbelieving people.\n",
        "TRANSLATION_17": "[5:68] Say: ‘O People of the Scripture, you have no basis, in religion, on which to rely, until you observe the Torah and the Gospel and what was revealed to you from your Lord’, by implementing what is therein, including believing in me [Muhammad (s)]. And what has been revealed to you from your Lord, of the Qur’ān, will surely increase many of them in insolence and disbelief, because of their disbelief in it; so do not grieve for the disbelieving folk, if they do not believe in you, in other words, do not be concerned with them.\n",
        "TRANSLATION_18": "(Say) Muhammad: (0 People of the Scripture!) i.e. the Jews and Christians. (You have naught) of the religion of Allah (till ye observe the Torah and the Gospel) until you truly believe in what is in the Torah and the Gospel (and that which was revealed unto thee (Muhammad) from your Lord) in all Scriptures given to all messengers. (That which is revealed unto you (Muhammad) from your Lord) the Qur'an (is certain to increase the contumacy) constancy in disbelief (and disbelief) and firmness in disbelief (of many of them) of their disbelievers. (But grieve not for the disbelieving folk) do not be saddened for their destruction in their state of disbelief, if they do not believe.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "5:68",
            "5:66",
            "2:109",
            "3:64",
            "11:57",
            "5:15",
            "10:85",
            "5:59",
            "5:77",
            "3:110"
        ],
        "BIBLE": [
            "prophets:joshua:1:8",
            "prophets:nahum:1:14",
            "writings:ii%20chronicles:14:6",
            "torah:exodus:34:10",
            "torah:leviticus:10:17",
            "torah:deuteronomy:26:13",
            "prophets:i%20kings:8:56",
            "prophets:joshua:7:19",
            "prophets:joshua:23:16",
            "prophets:ii%20kings:21:8"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:6"
        ]
    }
}