{
    "VERSE": "5:70",
    "ARABIC": "لَقَدْ أَخَذْنَا مِيثَٰقَ بَنِىٓ إِسْرَٰٓءِيلَ وَأَرْسَلْنَآ إِلَيْهِمْ رُسُلًا كُلَّمَا جَآءَهُمْ رَسُولٌۢ بِمَا لَا تَهْوَىٰٓ أَنفُسُهُمْ فَرِيقًا كَذَّبُوا۟ وَفَرِيقًا يَقْتُلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "We made a covenant with the tribe of Israel and We sent Messengers to them. Each time a Messenger came to them with something their lower selves did not desire, they denied some and they murdered others.",
        "TRANSLATION_1": "We had taken a solemn pledge from the children of Israel, and sent messengers to them; but whenever an apostle came to them bringing what did not suit their mood, they called one imposter, another they slew,\n",
        "TRANSLATION_2": "And We took a covenant from the Children of Israel and sent to them many Messengers. But whenever any Messenger brought to them something that did not suit their desires, they gave the lie to some of them and killed the others,\n",
        "TRANSLATION_3": "We made a covenant with the Israelites and sent Messengers to them. Whenever a Messenger came to them with a message which did not suit their desires, they would reject some of the Messengers and kill others.\n",
        "TRANSLATION_4": "We made a covenant with the Descendants of Israel and sent Noble Messengers towards them; whenever a Noble Messenger came to them with whatever was not according to their own desires, they denied some of them and some they slew.\n",
        "TRANSLATION_5": "Verily, We took the covenant of the Children of Israel and sent Messengers to them. Whenever there came to them a Messenger with what they themselves desired not, a group of them they called liars, and others among them they killed.\n",
        "TRANSLATION_6": "Certainly We made a covenant with the children of Israel and We sent to them apostles; whenever there came to them an apostle with what that their souls did not desire, some (of them) did they call liars and some they slew.\n",
        "TRANSLATION_7": "And We took compact with the Children of Israel, and We sent Messengers to them. Whensoever there came to them a Messenger with that their souls had not desire for, some they cried lies to, and some they slew.\n",
        "TRANSLATION_8": "We made a covenant of old with the Children of Israel and We sent unto them messengers. As often as a messenger came unto them with that which their souls desired not (they became rebellious). Some (of them) they denied and some they slew.\n",
        "TRANSLATION_9": "We made a covenant with the Children of Israel and sent forth messengers among them. But whenever a messenger came to them with a message that was not to their liking, some they accused of lying, while others they put to death,\n",
        "TRANSLATION_10": "Assuredly We took a bond from the Children of Isra'il and We sent unto them apostles. Whenever there came unto them an apostle with that which their souls desired not, a party of them they belied and a party they slew.\n",
        "TRANSLATION_11": "Certainly We took a pledge from the Children of Israel, and We sent apostles to them. Whenever an apostle brought them that which was not to their liking, they would impugn a part of them, and a part they would slay.\n",
        "TRANSLATION_12": "We took the covenant of the Children of Israel and sent them messengers, every time, there came to them a messenger with what they themselves desired not - some (of these) they called impostors, and some they (go so far as to) slay.\n",
        "TRANSLATION_13": "Verily, We took the covenant of the Children of Israel and sent them Messengers. Whenever there came to them a Messenger with what they themselves desired not - a group of them they called liars, and others among them they killed.\n",
        "TRANSLATION_14": "We took a covenant with the Children of Israel and sent forth Messengers to them. But whenever a Messenger came to them with that which did not suit their fancies they belied some and killed others.\n",
        "TRANSLATION_15": "We made a covenant with the Children of Israel, and We sent to them messengers. Whenever a messenger came to them with what their souls did not desire, some of them they accused of lying, and others they put to death.\n",
        "TRANSLATION_16": "We had already taken the covenant of the Children of Israel and had sent to them messengers. Whenever there came to them a messenger with what their souls did not desire, a party [of messengers] they denied, and another party they killed.\n",
        "TRANSLATION_17": "[5:70] And We made a covenant with the Children of Israel, to believe in God and His messengers, and We sent messengers to them. Every time a messenger came to them, from among them, with what their souls did not desire, in the way of truth, they denied it; some, of them, they denied, and some, of them, they slay, such as Zachariah and John (the use of [the present tense] yaqtulūn, ‘they slay’, instead of [the perfect tense] qatalū is to narrate past events [as if in the present] and to conclude [in harmony with] the end-   rhyme of the verses).\n",
        "TRANSLATION_18": "(We made a covenant of old with the Children of Israel) in the Torah regarding Muhammad (pbuh) that they shall not associate any partners with Allah (and We sent unto them messengers. As often as a messenger came unto them with that which their souls desired not) that which did not agree with their hearts or their religion: Judaism ((they became rebellious). Some (of them) they denied) they denied Jesus and Muhammad, Allah bless both of them (and some they slew) like Zachariah and John. 122\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "5:70",
            "2:87",
            "16:111",
            "39:70",
            "21:41",
            "6:123",
            "2:281",
            "3:25",
            "24:48",
            "57:8"
        ],
        "BIBLE": [
            "prophets:ezekiel:18:13",
            "prophets:i%20kings:18:26",
            "torah:deuteronomy:1:3",
            "torah:numbers:8:16",
            "prophets:i%20samuel:4:19",
            "writings:nehemiah:2:1",
            "prophets:ii%20samuel:4:10",
            "writings:job:1:21",
            "torah:genesis:21:27",
            "writings:ruth:2:18"
        ]
    }
}