{
    "VERSE": "5:76",
    "ARABIC": "قُلْ أَتَعْبُدُونَ مِن دُونِ ٱللَّهِ مَا لَا يَمْلِكُ لَكُمْ ضَرًّا وَلَا نَفْعًا وَٱللَّهُ هُوَ ٱلسَّمِيعُ ٱلْعَلِيمُ",
    "ENGLISH": {
        "TRANSLATION_0": "Say: 'Do you worship, besides Allah, something which has no power to harm or help you when Allah is the All-Hearing, the All-Knowing?'",
        "TRANSLATION_1": "Tell them: \"Leaving God aside, will you worship something that has no power over your loss or gain?\" But God is all-hearing and all-knowing.\n",
        "TRANSLATION_2": "Say: 'Do you serve, beside Allah, that which has no power either to harm or benefit you, whereas Allah alone is All-Hearing, All-Knowing?'\n",
        "TRANSLATION_3": "(Muhammad), say to them, \"Do you worship things besides God which can neither harm or benefit you?\" It is only God who is All-hearing and All-knowing.\n",
        "TRANSLATION_4": "Say (O dear Prophet Mohammed – peace and blessings be upon him), “What! You worship, other than Allah, that which is neither the controller of your losses nor of your benefits? And Allah only is the All Hearing, the All Knowing.”\n",
        "TRANSLATION_5": "Say: \"How do you worship besides Allah something which has no power either to harm or to benefit you But it is Allah Who is the All-Hearer, All-Knower.\"\n",
        "TRANSLATION_6": "Say: Do you serve besides Allah that which does not control for you any harm, or any profit? And Allah-- He is the Hearing, the Knowing.\n",
        "TRANSLATION_7": "Say: 'Do you serve, apart from God, that which cannot hurt or profit you? God is the All-hearing, the All-knowing.'\n",
        "TRANSLATION_8": "Say: Serve ye in place of Allah that which possesseth for you neither hurt nor use? Allah it is Who is the Hearer, the Knower.\n",
        "TRANSLATION_9": "Say, \"Do you worship something other than God, that has no power to do you harm or good? God alone is the All Hearing and All Knowing.\"\n",
        "TRANSLATION_10": "Say thou: worship ye, beside Allah, that which availeth you not for hurt nor for profit! whereas Allah! He is the Hearer, the Knower.\n",
        "TRANSLATION_11": "Say, ‘Do you worship, besides Allah, what has no power to bring you any benefit or harm, while Allah—He is the All-hearing, the All-knowing?!’\n",
        "TRANSLATION_12": "Say: \"Will ye worship, besides Allah, something which hath no power either to harm or benefit you? But Allah,- He it is that heareth and knoweth all things.\"\n",
        "TRANSLATION_13": "Say (O Muhammad SAW to mankind): \"How do you worship besides Allah something which has no power either to harm or to benefit you? But it is Allah Who is the All-Hearer, All-Knower.\"\n",
        "TRANSLATION_14": "Say: 'Will you worship instead of Allah that which owns neither harm, nor benefit for you? Allah is the Hearer, Knower'\n",
        "TRANSLATION_15": "Say, “Do you worship, besides God, what has no power to harm or benefit you?” But God: He is the Hearer, the Knower.\n",
        "TRANSLATION_16": "Say, \"Do you worship besides Allah that which holds for you no [power of] harm or benefit while it is Allah who is the Hearing, the Knowing?\"\n",
        "TRANSLATION_17": "[5:76] Say: ‘Do you worship besides God, that is, other than Him, what cannot hurt or profit you? God is the Hearer, of your sayings, the Knower’, of your circumstances (the interrogative is meant as a disavowal).\n",
        "TRANSLATION_18": "(Say) to them, Muhammad: (Serve ye in place of Allah) the idols (that which possesseth for you neither hurt) that which cannot drive away from you harm in this world or in the Hereafter (nor use) nor bring benefit to you in this world or in the Hereafter? (Allah it is Who is the Hearer) of your claims about Jesus, (the Knower) of your punishment.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "5:76",
            "21:67",
            "22:71",
            "4:148",
            "2:224",
            "29:60",
            "3:34",
            "21:66",
            "64:4",
            "8:61"
        ],
        "BIBLE": [
            "prophets:ii%20kings:7:9",
            "prophets:isaiah:64:11",
            "prophets:jeremiah:5:19",
            "prophets:i%20kings:2:9",
            "prophets:isaiah:36:21",
            "prophets:i%20kings:18:36",
            "prophets:ii%20kings:17:12",
            "prophets:ii%20kings:18:36",
            "prophets:jeremiah:25:6",
            "prophets:joshua:23:16"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:5:1"
        ]
    }
}