{
    "VERSE": "5:81",
    "ARABIC": "وَلَوْ كَانُوا۟ يُؤْمِنُونَ بِٱللَّهِ وَٱلنَّبِىِّ وَمَآ أُنزِلَ إِلَيْهِ مَا ٱتَّخَذُوهُمْ أَوْلِيَآءَ وَلَٰكِنَّ كَثِيرًا مِّنْهُمْ فَٰسِقُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "If they had had iman in Allah and the Prophet and what has been sent down to him, they would not have taken them as friends. But most of them are deviators.",
        "TRANSLATION_1": "If they had believed in God and the Prophet and what had been revealed to him, they would never have held them as allies; and many among them are transgressors.\n",
        "TRANSLATION_2": "For had they truly believed in Allah and the Messenger and what was sent down to him, they would not have taken unbelievers (instead of believers) for their allies. But many of them have rebelled against Allah altogether.\n",
        "TRANSLATION_3": "Had they had faith in God, the Prophet, and what was revealed to him, they would not have been the friends of the unbelievers. However, many of them are evil-doers.\n",
        "TRANSLATION_4": "Had they believed in Allah and this Prophet (Mohammed – peace and blessings be upon him) and what is sent down upon him, they would not befriend the disbelievers, but most of them are disobedient.\n",
        "TRANSLATION_5": "And had they believed in Allah, and in the Prophet and in what has been revealed to him, never would they have taken them as friends; but many of them are rebellious.\n",
        "TRANSLATION_6": "And had they believed in Allah and the prophet and what was revealed to him, they would not have taken them for friends but! most of them are transgressors.\n",
        "TRANSLATION_7": "Yet had they believed in God and the Prophet and what has been sent down to him, they would not have taken them as friends; but many of them are ungodly.\n",
        "TRANSLATION_8": "If they believed in Allah and the Prophet and that which is revealed unto him, they would not choose them for their friends. But many of them are of evil conduct.\n",
        "TRANSLATION_9": "Had they believed in God and the Prophet and what was revealed to him, they would not have taken those who deny the truth as their allies, but many of them are disobedient.\n",
        "TRANSLATION_10": "And had they believed in Allah and the prophet and that which is sent down unto him, they would not have taken them for friends, but many of them are transgressors.\n",
        "TRANSLATION_11": "Had they believed in Allah and the Prophet and what has been sent down to him, they would not have taken them for allies. But most of them are transgressors.\n",
        "TRANSLATION_12": "If only they had believed in Allah, in the Prophet, and in what hath been revealed to him, never would they have taken them for friends and protectors, but most of them are rebellious wrong-doers.\n",
        "TRANSLATION_13": "And had they believed in Allah, and in the Prophet (Muhammad SAW) and in what has been revealed to him, never would they have taken them (the disbelievers) as Auliya' (protectors and helpers), but many of them are the Fasiqun (rebellious, disobedient to Allah).\n",
        "TRANSLATION_14": "Had they believed in Allah and the Prophet (Muhammad) and that which is sent down to him, they would not have taken them as guides. But many of them are evildoers.\n",
        "TRANSLATION_15": "Had they believed in God and the Prophet, and in what was revealed to him, they would not have befriended them. But many of them are immoral.\n",
        "TRANSLATION_16": "And if they had believed in Allah and the Prophet and in what was revealed to him, they would not have taken them as allies; but many of them are defiantly disobedient.\n",
        "TRANSLATION_17": "[5:81] Yet had they believed in God and the Prophet, Muhammad (s), and what has been revealed to him, they would not have affiliated with them, namely, [with] the disbelievers; but many of them are wicked, rebellious against faith.\n",
        "TRANSLATION_18": "(If they) i.e. the hypocrites (believed in Allah) genuinely believed in Allah (and the Prophet) Muhammad (and that which is revealed unto him) i.e. the Qur'an, (they would not choose them) i.e. the Jews (for their friends) seeking their assistance and help. (But many of them) from among the people of the Book (are of evil conduct) they are hypocrites. It is also said that this means: if the Jews genuinely believed in Allah, and in Allah's divine Oneness, and believed in the Prophet (pbuh) and that which was revealed to him, i.e. the Qur'an, they would not have taken Abu Sufyan and his followers for friends, seeking their assistance and help. Nonetheless, many among the people of the Book are disbelievers.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "5:81",
            "3:146",
            "3:68",
            "6:137",
            "42:6",
            "47:11",
            "12:106",
            "5:49",
            "5:71",
            "8:34"
        ],
        "BIBLE": [
            "writings:job:13:5",
            "writings:proverbs:27:13",
            "writings:proverbs:20:16",
            "prophets:jeremiah:50:33",
            "writings:job:13:19",
            "prophets:isaiah:57:11",
            "writings:nehemiah:5:8",
            "prophets:jeremiah:6:11",
            "writings:psalms:5:11",
            "prophets:joshua:7:11"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:7",
            
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:6"
        ]
    }
}