{
    "VERSE": "5:82",
    "ARABIC": "لَتَجِدَنَّ أَشَدَّ ٱلنَّاسِ عَدَٰوَةً لِّلَّذِينَ ءَامَنُوا۟ ٱلْيَهُودَ وَٱلَّذِينَ أَشْرَكُوا۟ وَلَتَجِدَنَّ أَقْرَبَهُم مَّوَدَّةً لِّلَّذِينَ ءَامَنُوا۟ ٱلَّذِينَ قَالُوٓا۟ إِنَّا نَصَٰرَىٰ ذَٰلِكَ بِأَنَّ مِنْهُمْ قِسِّيسِينَ وَرُهْبَانًا وَأَنَّهُمْ لَا يَسْتَكْبِرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "You will find that the people most hostile to those who have iman are the Jews and the idolaters. You will find the people most affectionate to those who have iman are those who say, 'We are Christians.' That is because some of them are priests and monks and because they are not arrogant.",
        "TRANSLATION_1": "You will find the Jews and idolaters most excessive in hatred of those who believe; and the closest in love to the faithful are the people who say: \"We are the followers of Christ,\" because there are priests and monks among them, and they are not arrogant.\n",
        "TRANSLATION_2": "Of all men you will find the Jews and those who associate others with Allah in His divinity to be the most hostile to those who believe; and you will surely find that of ail people they who say: 'We are Christians', are closest to feeling affection for those who believe. This is because there are worshipful priests and monks among them, and because they are not arrogant.\n",
        "TRANSLATION_3": "You find Jews and pagans among the worst of the enemies of the believers. (Of the non-believers) nearest to them (the believers) in affection you find those who say, \"We are Christians,\" for among them are the priests and monks who are not proud.\n",
        "TRANSLATION_4": "You will certainly find the Jews and the polytheists as the greatest enemies of the Muslims; and you will find the closest in friendship to the Muslims those who said, “We are Christians”; that is because scholars and monks are among them, and they are not proud.\n",
        "TRANSLATION_5": "Verily, you will find the strongest among men in enmity to the believers the Jews and those who commit Shirk, and you will find the nearest in love to the believers those who say: \"We are Christians.\" That is because among them are priests and monks, and they are not proud.\n",
        "TRANSLATION_6": "Certainly you will find the most violent of people in enmity for those who believe (to be) the Jews and those who are polytheists, and you will certainly find the nearest in friendship to those who believe (to be) those who say: We are Christians; this is because there are priests and monks among them and because they do not behave proudly.\n",
        "TRANSLATION_7": "Thou wilt surely find the most hostile of men to the believers are the Jews and the idolaters; and thou wilt surely find the nearest of them in love to the believers are those who say 'We are Christians'; that, because some of them are priests and monks, and they wax not proud;\n",
        "TRANSLATION_8": "Thou wilt find the most vehement of mankind in hostility to those who believe (to be) the Jews and the idolaters. And thou wilt find the nearest of them in affection to those who believe (to be) those who say: Lo! We are Christians. That is because there are among them priests and monks, and because they are not proud.\n",
        "TRANSLATION_9": "You will find that the bitterest in their enmity to the faithful are the Jews and the polytheists; the nearest in affection to them are those who say, \"We are Christians.\" That is because there are priests and monks among them; and because they are free from pride.\n",
        "TRANSLATION_10": "Surely thou wilt find the Jews and those who associate the bitterest of mankind in enmity toward those who believe. And surely thou wilt find the highest in affection to those who believe those who say: we are Nazarenes. That is, because among them are divines and monks and because they are not stiff-necked.\n",
        "TRANSLATION_11": "Surely You will find the most hostile of all people towards the faithful to be the Jews and the polytheists, and surely you will find the nearest of them in affection to the faithful to be those who say ‘We are Christians.’ That is because there are priests and monks among them, and because they are not arrogant.\n",
        "TRANSLATION_12": "Strongest among men in enmity to the believers wilt thou find the Jews and Pagans; and nearest among them in love to the believers wilt thou find those who say, \"We are Christians\": because amongst these are men devoted to learning and men who have renounced the world, and they are not arrogant.\n",
        "TRANSLATION_13": "Verily, you will find the strongest among men in enmity to the believers (Muslims) the Jews and those who are Al-Mushrikun (see V. 2:105), and you will find the nearest in love to the believers (Muslims) those who say: \"We are Christians.\" That is because amongst them are priests and monks, and they are not proud.\n",
        "TRANSLATION_14": "You will find that the most people in enmity to the believers are the Jews and idolaters, and that the nearest in affection to the believers are those who say: 'We are Nazarenes' That is because amongst them there are priests and monks; and because they are not proud.\n",
        "TRANSLATION_15": "You will find that the people most hostile towards the believers are the Jews and the polytheists. And you will find that the nearest in affection towards the believers are those who say, “We are Christians.” That is because among them are priests and monks, and they are not arrogant.\n",
        "TRANSLATION_16": "You will surely find the most intense of the people in animosity toward the believers [to be] the Jews and those who associate others with Allah; and you will find the nearest of them in affection to the believers those who say, \"We are Christians.\" That is because among them are priests and monks and because they are not arrogant.\n",
        "TRANSLATION_17": "[5:82] You, O Muhammad (s), will truly find the most hostile of people to those who believe to be the Jews and the idolaters, of Mecca, because of the intensity of their disbelief, ignorance and utter preoccupation with following whims; and you will truly find the nearest of them in love to those who believe to be those who say ‘Verily, we are Christians’; that, nearness of theirs in love to the believers is, because some of them are priests, scholars, and monks, devout worshippers, and because they are not disdainful, of following the truth, as the Jews and the Meccans are.\n",
        "TRANSLATION_18": "Allah then showed their enmity towards the Prophet (pbuh) and his Companions, saying: (Thou wilt find) Muhammad (the most vehement of mankind in hostility) and most vile in speech (to those who believe) Muhammad and his Companions ((to be) the Jews) the Jews of the Banu Qurayzah, Banu'l-Nadir, Fadak and Khaybar (and the idolaters) and the most vehement in hostility to the believers among the idolaters are the idolaters of Mecca. (And thou wilt find the nearest of them in affection) in their bond and most lenient in speech (to those who believe) Muhammad and his Companions ((to be) those who say: Lo! We are Christians) the Negus and his followers who were 32 men; it is also said that they were 40 people in total: 32 from Abyssinia, and eight monks from Historic Syria: the monk Bahirah and his followers Abrahah, Ashraf, Idris, Tamim, Tammam, Durayd and Ayman. (That) affection (is because there are among them priests) ascetics whose heads are shaved in the middle (and monks) secluded in monasteries who are their men of knowledge, (and because they are not proud) in believing in Muhammad and the Qur'an.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "5:82",
            "59:13",
            "46:6",
            "47:3",
            "8:25",
            "43:62",
            "22:39",
            "25:31",
            "10:2",
            "42:23"
        ],
        "BIBLE": [
            "prophets:ii%20samuel:17:8",
            "prophets:jeremiah:26:16",
            "prophets:isaiah:38:11",
            "prophets:ezekiel:8:6",
            "torah:numbers:5:19",
            "prophets:jeremiah:16:10",
            "prophets:i%20samuel:14:24",
            "torah:numbers:11:21",
            "prophets:jeremiah:26:11",
            "torah:numbers:14:15"
        ]
    },
    "FEATURES": [
        "NO",
        " FEE",
        "AIN",
        "LE",
        "commit.v.06",
        " SA",
        "LIE",
        "TRED",
        "DI",
        "capital.s.03",
        "ATER",
        "IMO",
        "IDO",
        "ILI",
        "WAX ",
        "G ",
        "say.v.08",
        "STI",
        "ARR",
        "inform.v.01",
        "RIK",
        "HRIK",
        "spiritual_being.n.01",
        "LLO",
        "request.v.01",
        "UN",
        "state.v.01",
        "ingredient.n.03",
        "NT ",
        " SE",
        "IRK",
        "commit.v.03",
        "status.n.01",
        "THER",
        "ED ",
        "BEH",
        "SLIM",
        "XCES",
        " D",
        " AFF",
        "_LO",
        "OTHE",
        "experience.n.02",
        "WORLD",
        "LAR",
        "DIVI",
        "vehement.s.02",
        "MONKS",
        " ARE",
        "nazarene.n.03",
        "THF",
        "IK",
        "AFFECTIONATE",
        "curiosity.n.01",
        "search.v.01",
        "close.s.13",
        "close.s.11",
        "HOLA",
        "OU ",
        "bad.s.04",
        "OWA",
        "WORSHIPFUL",
        "POLY",
        "approximate.s.02",
        "disease.n.01",
        "RNI",
        "hostility.n.01",
        "RK",
        "dainty.n.01",
        "REAT",
        "WORS",
        "“ ",
        "ENOU",
        "order.v.01",
        "bad.s.08",
        "ENES",
        "SO",
        "N ",
        "leave.v.08",
        "pathological_state.n.01",
        "CTIO",
        " IM",
        "RENE",
        "VEHEMENT",
        "integer.n.01",
        "ONA",
        "MI",
        "LOW",
        "ON ",
        "nutriment.n.01",
        "man.n.10",
        "SLI",
        "arrogant.s.01",
        "ST ",
        "chordate.n.01",
        " AMO",
        "teach.v.01",
        "ARRO",
        "IANS",
        "determine.v.08",
        "IKUN",
        "AREN",
        "EI",
        "IL ",
        "domestic_partner.n.01",
        "RED",
        "transfer.v.02",
        "JEWS",
        "bad.s.12",
        "world.n.03",
        "RLD ",
        "pronounce.v.01",
        "KS ",
        "-BE",
        "transgression.n.01",
        "ERS ",
        "DOL",
        "entity.n.01",
        "acute.s.02",
        "LEN",
        "proudly.r.01",
        "RELY",
        "LIMS",
        " CH",
        "close.s.15",
        "POLYTHEISTS",
        "primate.n.02",
        "REST",
        "IGH",
        "ill_health.n.01",
        "ILL ",
        "AV",
        " VIO",
        "OUD",
        "MIT ",
        "RIES",
        "FRE",
        "high.a.02",
        "NAT",
        "bad.s.07",
        "INTE",
        "tell.v.02",
        "LOSE",
        "IO",
        "ARS ",
        "NSE ",
        "OSES",
        "KUN ",
        "event.n.01",
        "change.v.01",
        " R",
        "INIT",
        "ORST",
        "bad.a.01",
        "learn.v.04",
        "HOS",
        " EXC",
        "interest.n.01",
        "CHRISTIANS.",
        "AY ",
        "PRI",
        "DEVOTED",
        "near.s.03",
        "AS",
        "decrease.v.01",
        "weaken.v.02",
        "HE",
        "HFU",
        "knowledge_domain.n.01",
        "ELY ",
        "EN",
        "EMI",
        "NIMO",
        "thing.n.12",
        "close.s.10",
        "LEARNING",
        "CIA",
        "food.n.01",
        " SU",
        "state.n.02",
        "hate.n.01",
        "LL",
        "ATRE",
        "LI",
        "friendship.n.01",
        "DIVINITY",
        "free.s.09",
        "AL",
        " PR",
        "intellectual.n.01",
        "ANS",
        "weakening.n.02",
        "bad.s.14",
        "multitude.n.03",
        "SUR",
        "LAH ",
        "ECTI",
        "TEST",
        "ERT",
        " SH",
        "RON",
        "HR",
        "assistant.n.01",
        "ONK",
        "FRIE",
        "ANIM",
        " HO",
        "SCH",
        "reject.v.01",
        "OLLO",
        "OUDL",
        " OTH",
        "believer.n.01",
        "SSO",
        "consort.v.01",
        "ROGA",
        " JE",
        "close.s.05",
        "AN",
        "vacate.v.01",
        "RNIN",
        "wilt.n.02",
        "wilt.v.02",
        "HEI",
        "OM",
        " V. ",
        "spare.s.03",
        "give.v.18",
        "INI",
        "EARE",
        "WE ",
        "verily.r.01",
        "AG",
        "EHEM",
        "N-BE",
        " L",
        "TI",
        "AL-",
        "CHR",
        "GR",
        " FOL",
        "skilled_worker.n.01",
        "-BEL",
        " PA",
        "leader.n.01",
        "HATRED",
        "IAN",
        "gamey.s.02",
        " SUR",
        "GANT",
        "IST",
        "move.v.02",
        " HI",
        "think.v.01",
        "RO",
        "nazarene.n.02",
        "RK ",
        "ITY",
        "unfriendliness.n.02",
        "PA",
        " VER",
        "abandon.v.02",
        "ARN",
        "EVE",
        "EEL",
        "AL-M",
        "EL",
        "physical_entity.n.01",
        "EE ",
        "TH",
        "MIES",
        " BIT",
        " DO",
        "placental.n.01",
        "NGS",
        "N-B",
        "NGST",
        "AFFECTION",
        "heathen.n.01",
        "TERE",
        "expect.v.01",
        "high.a.01",
        "NSE",
        " MUS",
        "K ",
        " VE",
        "CTI",
        "RED ",
        "SI",
        "HEM",
        "bad.s.06",
        "SSIV",
        "indispose.v.03",
        " FO",
        "AID ",
        "big.s.13",
        "PLE",
        "NEAR",
        "TY ",
        "credit.v.04",
        "ITHF",
        " BEL",
        "_LOV",
        "godly.s.01",
        "utter.v.02",
        "worldly_concern.n.01",
        "YTHE",
        "ND ",
        "ID ",
        "URE",
        "RIKU",
        "XCE",
        "CLOSEST",
        "game_equipment.n.01",
        "IM",
        "proud.a.01",
        "ECK",
        "earth.n.01",
        "bad.s.11",
        "OT",
        "change_of_magnitude.n.01",
        "prosecute.v.03",
        "NIM",
        "trait.n.01",
        "citizenry.n.01",
        "FFEC",
        "DOLA",
        "keep.v.03",
        "NTEN",
        "savior.n.02",
        "reason.v.01",
        "ILT",
        "ANS ",
        "TTER",
        "great.s.01",
        "IL",
        "AGA",
        "ILT ",
        "be.v.01",
        "BI",
        "SU",
        "cognitive_state.n.01",
        "use.v.01",
        "TAIN",
        "MOS",
        "hostile.s.05",
        "FECT",
        "NCED",
        "feel.v.12",
        "REE",
        "SC",
        "illness.n.01",
        " “",
        "EOPL",
        "SCHOLARS",
        " J",
        "TIAN",
        "follower.n.02",
        "IE",
        "OG",
        "good_person.n.01",
        "PAGANS",
        "ERS",
        "UR",
        "VEH",
        "EMIE",
        "PL",
        "withhold.v.01",
        " INT",
        "feel.v.09",
        "AM",
        "AZA",
        " STI",
        "SEE",
        "person.n.01",
        " N",
        "INTENSE",
        " B",
        "excessive.s.01",
        "OST ",
        "PROUD",
        " PRO",
        "ZA",
        "unit.n.03",
        "MS",
        "TIO",
        "-NEC",
        "pride.n.05",
        "AN ",
        "S. ",
        "EV",
        "REE ",
        " MOS",
        "man.n.01",
        "MENT",
        "ERIL",
        "TIF",
        " PO",
        "DE",
        "BE",
        "S ",
        " CO",
        "OVE",
        "GS",
        "wrongdoing.n.02",
        "godhead.n.01",
        "LOVE",
        "USH",
        " EX",
        "AFFE",
        " MON",
        "HA",
        "EXCESSIVE",
        "NON",
        "AX",
        "IFF",
        "ING ",
        "PEO",
        "CKED",
        " '",
        "IT ",
        " VEH",
        "bad.s.03",
        "RIEN",
        " DEV",
        "excessive.s.02",
        "NDS",
        "FA",
        "advocate.n.01",
        "TT",
        "speculate.v.02",
        "TIL",
        "OSIT",
        "MOSI",
        "ILIT",
        "impregnable.s.01",
        " LEA",
        " PRI",
        "SAI",
        "RLD",
        "OR",
        "NEA",
        "EVOT",
        "MMIT",
        " DI",
        "vertebrate.n.01",
        "express.v.02",
        "people.n.03",
        "IMOS",
        "nonreligious_person.n.01",
        "SAY",
        "act.v.01",
        "LOS",
        "shirk.v.02",
        "UL",
        "NLY ",
        "ANT",
        "END",
        "belief.n.01",
        "US",
        "RS",
        "bad.s.13",
        "PFUL",
        "RILY",
        "ID",
        "LT",
        "ELIE",
        "EIS",
        "RE",
        " FIN",
        "IDE ",
        " FI",
        "NS. ",
        "BELI",
        "ILE ",
        "get.v.01",
        "MIE",
        "ME",
        "SIT",
        "unite.v.01",
        "USHR",
        "FUL",
        "F-",
        "wax.v.01",
        "SA",
        "DSH",
        "LOWE",
        "MM",
        "IA",
        "KE",
        "study.v.05",
        "kin.n.02",
        "CI",
        "attribute.n.02",
        "high.a.04",
        "RIDE",
        "TE ",
        "LL ",
        "rival.n.01",
        "ARE ",
        "ANS.",
        "GHES",
        "change.n.03",
        "VERILY",
        "airless.s.01",
        "RES",
        "OLL",
        "REL",
        "ELI",
        "cheeseparing.s.01",
        "AMON",
        "USLI",
        " “ ",
        "feel.v.04",
        "foodstuff.n.02",
        "ESSI",
        "say.v.10",
        "RD",
        "monk.n.02",
        "NKIN",
        "YTH",
        "ENDS",
        "CL",
        " BE",
        "EAR",
        "feel.v.06",
        "SOCI",
        "PAG",
        "POL",
        "regretful.a.01",
        "close.a.01",
        "OUNC",
        "TAI",
        "biological_group.n.01",
        "TENS",
        "FREE",
        "large_integer.n.01",
        "cognition.n.01",
        "MUS",
        "behave.v.02",
        "worst.a.01",
        "VE",
        "intense.a.01",
        "PF",
        "benefactor.n.01",
        "MANKIND",
        "NA",
        "SHI",
        "IV",
        "gallant.s.03",
        "LEA",
        "ITY ",
        "great.s.02",
        "HOU",
        "MO",
        "EELI",
        "strong.s.09",
        "SCHO",
        "LIM",
        "YT",
        " NON",
        "-MU",
        "ATE ",
        "OWE",
        "AI",
        "IFF-",
        "PROU",
        "violent.s.03",
        "ail.v.01",
        "content.n.05",
        "valet.n.01",
        "WER",
        "EM",
        " H",
        "LING",
        "NATE",
        "NS",
        " ENE",
        "IN",
        "KU",
        "communicate.v.02",
        "ILY",
        " HA",
        " POL",
        "CLO",
        "H ",
        "hostility.n.02",
        "Y ",
        "free.a.06",
        "EIST",
        "have.v.01",
        "candy.n.01",
        "learn.v.02",
        "transfer.v.05",
        "WI",
        "SAID",
        " AI",
        "SHR",
        "ORSH",
        "TY",
        "DEVO",
        "ENEMIES",
        "GREA",
        "STIL",
        "IN_LOVE",
        "LOV",
        " LE",
        "FEEL",
        "solid.s.07",
        "SS",
        "jesus.n.01",
        "EX",
        "ANKI",
        "ARE",
        "PAGA",
        "OLAT",
        "HO",
        "BELIEVE",
        "TTE",
        "UD",
        "ECKE",
        "CHOL",
        " 'W",
        " MEN",
        "AT",
        "LATE",
        "emotion.n.01",
        "WILL",
        "hostile.a.02",
        "AINL",
        "WILT",
        " SHI",
        " G",
        "OST",
        "FAITHFUL",
        "OCI",
        "bitter.s.06",
        " SCH",
        "feel.v.07",
        "ENT",
        "AZ",
        "VOTE",
        "hostile.s.03",
        " NAZ",
        "PRIE",
        "ORL",
        "EA",
        "NES ",
        "ELY",
        "IND ",
        "'WE",
        "near.s.02",
        "INLY",
        "PLE ",
        "have.v.02",
        "LO",
        "VINE",
        "great.s.03",
        "NDSH",
        " DE",
        "TRO",
        "KED ",
        "natural_object.n.01",
        "SEST",
        "UN ",
        "DO",
        " FR",
        "AGAN",
        " AIL",
        "ENO",
        " NA",
        "RIST",
        "act.n.02",
        "bitter.s.02",
        "flavorer.n.01",
        "PE",
        " ’",
        "UDL",
        "TO",
        "NMIT",
        "feel.v.08",
        "definite_quantity.n.01",
        "ENEM",
        "-MUS",
        "GH",
        "divinity.n.02",
        "ARDS",
        "free.a.02",
        "theology.n.01",
        "servant.n.01",
        "ENMI",
        "free.a.01",
        "'WE ",
        "FRIENDSHIP",
        "EXC",
        "AID",
        "psychological_feature.n.01",
        "HRIS",
        "O ",
        "GST ",
        "AIL",
        "NKS",
        "MOST",
        "FIN",
        "T ",
        "disown.v.02",
        "HERS",
        "NG ",
        "LYT",
        "INT",
        " AF",
        "LARS",
        "NCE",
        "MAN ",
        " HOS",
        "SIV",
        "F-NE",
        "act.v.02",
        "EHE",
        "potent.a.03",
        "EVO",
        "N_L",
        "ILE",
        "bad.s.09",
        "IS ",
        "CO",
        "NEMI",
        "detached.s.06",
        "DEV",
        "convey.v.03",
        "PO",
        "EST ",
        " S",
        "N-",
        "MIT",
        "hostility.n.03",
        "OSE",
        "inhabitant.n.01",
        "PRIDE",
        "THEI",
        "enemy.n.03",
        "feel.v.03",
        "spiritual_leader.n.01",
        "N_LO",
        "close.a.02",
        "NM",
        "NOT ",
        "EH",
        "psychological_state.n.01",
        "AMONGST",
        "memorize.v.01",
        " PAG",
        "fierce.s.02",
        "foe.n.02",
        "world.n.08",
        "WORST",
        "ITH",
        "strong.a.01",
        "leave_office.v.01",
        "IEST",
        "FOLL",
        " NO",
        "EMEN",
        "IEVE",
        "PEOP",
        "IS",
        "ATES",
        "priest.n.02",
        "man.n.06",
        "TER",
        "intense.s.03",
        "say.v.07",
        "[",
        "EXCE",
        "find.v.05",
        "repeat.v.04",
        "IF",
        "suffer.v.06",
        "ESS",
        "HIRK",
        "assert.v.01",
        "RENOUNCED",
        "IN_",
        "F-N",
        "RT",
        "fudge.n.01",
        "IEN",
        "FO",
        "WIL",
        "CED ",
        "sensualist.n.01",
        "L-MU",
        "perpetrate.v.01",
        "ROG",
        "animal_group.n.01",
        "LLOW",
        "lover.n.03",
        "man.n.05",
        "EW",
        "BEHAVE",
        "RN",
        "DSHI",
        "abdicate.v.01",
        "MANK",
        "NS ",
        "WARD",
        "MONK",
        "ANT ",
        "LITY",
        "whole.n.02",
        "EHA",
        "aggression.n.03",
        "OUN",
        " F",
        " AL",
        " ” ",
        "TRON",
        " ID",
        "FAIT",
        "man.n.09",
        "VINI",
        "reserve.v.01",
        "OGAN",
        " MA",
        "messiah.n.01",
        "satisfaction.n.01",
        "strong.s.07",
        "KED",
        "WOR",
        "FF-N",
        "HAV",
        "ES",
        "MEN",
        "HES",
        "LY",
        "NOT",
        "SHIRK",
        "RL",
        "KI",
        "LAH",
        "UNC",
        "change_magnitude.v.01",
        "surely.r.01",
        "IT",
        "physical_condition.n.01",
        "VER",
        "WORL",
        "DE ",
        "greatest.s.01",
        "U ",
        " REN",
        "christian.n.01",
        "IOLE",
        "NES",
        "CHO",
        " O",
        "hurt.v.02",
        "HEIS",
        "accept.v.01",
        "cleric.n.01",
        "CIAT",
        "CK",
        "FUL ",
        "UDLY",
        "ILL",
        "ARROGANT",
        "DL",
        " NE",
        "HEST",
        "MA",
        "IDE",
        "E ",
        "RI",
        "believe.v.03",
        "AITH",
        "STIFF-NECKED",
        " MO",
        "ANI",
        "request.v.02",
        "KIN",
        "-NE",
        " VI",
        "EVER",
        "measure.n.02",
        "HEME",
        "OS",
        "N_",
        "RRO",
        "EARN",
        "ARD",
        "NGES",
        "PRID",
        "pride.n.03",
        "GHE",
        "military_unit.n.01",
        "OPL",
        "jew.n.01",
        "interact.v.01",
        "enemy.n.01",
        "VERI",
        "causal_agent.n.01",
        "give.v.03",
        "feel.v.11",
        " [ ",
        "say.v.09",
        "ONG",
        " AL-",
        "AR",
        "indicate.v.03",
        "SIVE",
        "FR",
        "ARS",
        " THO",
        " AM",
        "high.s.07",
        "SH",
        "IRK ",
        "RIS",
        " ARR",
        "WAX",
        "nature.n.04",
        "FEC",
        "scholar.n.01",
        "crimson.s.02",
        "TED ",
        "SES",
        "RST",
        "ION",
        "dear.s.02",
        "HIR",
        "MS ",
        " ENM",
        "CT",
        "DLY",
        " V.",
        "pay.v.01",
        " LO",
        "GE",
        "ENE",
        "cover.v.01",
        "TR",
        "-N",
        "IP ",
        "potent.s.02",
        "wax.v.02",
        "STIA",
        "IGHE",
        "garlic.n.02",
        "NMI",
        "NEM",
        "mortal_sin.n.01",
        "HF",
        "BELIEVERS",
        "allah.n.01",
        "NIN",
        "supporter.n.01",
        "insist.v.01",
        "PFU",
        "HRI",
        " LO ",
        "AH ",
        "TED",
        "perceive.v.01",
        "ELIN",
        "associate.v.01",
        " W",
        "ERTA",
        "NI",
        "OC",
        "OLEN",
        "relationship.n.03",
        "mammal.n.01",
        "bang-up.s.01",
        "LD",
        "CED",
        "THOU",
        "close.s.09",
        "BIT",
        "believe.v.01",
        "KS",
        "VIO",
        "affectionate.s.01",
        "FEELING",
        "disposition.n.01",
        "number.n.02",
        "consociate.v.01",
        "CERTAINLY",
        "ERI",
        "ESTS",
        " ANI",
        "violent.s.02",
        "UREL",
        "IVE",
        " A",
        "-B",
        " OT",
        "RENO",
        "COMMIT",
        "believer.n.02",
        "RSH",
        " CHR",
        "AX ",
        "MEN ",
        " IS ",
        "DLY ",
        "“",
        "congregation.n.01",
        "DS ",
        "ZAR",
        " EN",
        "enrollee.n.01",
        "concern.n.01",
        "wilt.v.01",
        "ORLD",
        "MITY",
        "HIP",
        "world.n.06",
        "social_group.n.01",
        "living_thing.n.01",
        "say.v.11",
        "IEV",
        "INES",
        "MMI",
        "eminent.s.01",
        "SEE ",
        "EHAV",
        "STR",
        "HOSTILE",
        "ON-B",
        "GREATEST",
        " WI",
        "stiff-necked.s.01",
        " V",
        "NOUN",
        "ROUD",
        "RTAI",
        "reason.v.03",
        "adoring.s.01",
        "OP",
        "NS.",
        "OMMI",
        "pride.n.02",
        "IDOL",
        "trust.v.01",
        "ONGE",
        "ENS",
        "LA",
        "WERS",
        "ER",
        "hominid.n.01",
        " AR",
        "evaluate.v.02",
        "SL",
        " BI",
        "RONG",
        "PROUDLY",
        "KIND",
        "NOU",
        "HIG",
        "OCIA",
        "HOU ",
        "NAZARENES",
        "EVE ",
        "IMS",
        " COM",
        "IPF",
        "CHRIST",
        "CES",
        "OWAR",
        "IST ",
        "L-M",
        "quality.n.01",
        "deny.v.04",
        "find.v.03",
        "AVE",
        "traveler.n.01",
        "GES",
        "ZARE",
        "AIT",
        "body_servant.n.01",
        "KUN",
        "EST",
        "L-",
        "FI",
        "VOT",
        "RE ",
        "sin.n.02",
        "adult.n.01",
        "plant_disease.n.01",
        " CER",
        "BEHA",
        "[ ",
        "ON-",
        "IMA",
        "WS ",
        "OLYT",
        "follower.n.01",
        "OGA",
        "spend.v.02",
        "STS ",
        "NON-",
        "ANIMOSITY",
        "HOL",
        "ALLAH",
        " AS",
        "IES ",
        "LIT",
        "genealogy.n.01",
        "ILY ",
        " IN_",
        " T",
        "OTHERS",
        "”",
        "impart.v.01",
        "RTA",
        "EME",
        "STRONGEST",
        "behave.v.03",
        "LIN",
        " FAI",
        "MUSL",
        "FU",
        "LT ",
        "NC",
        "NING",
        "NITY",
        "divinity.n.03",
        "ARNI",
        "OLY",
        " GR",
        "wax.v.03",
        "D ",
        "SOC",
        " IMA",
        "close.s.06",
        "free.s.04",
        "WA",
        "animosity.n.01",
        "TOWA",
        "EOP",
        "VE ",
        "NK",
        "OU",
        "NEC",
        "OSTI",
        "bitter.s.04",
        "IATE",
        "near.a.01",
        "bitter.s.05",
        "MU",
        "THFU",
        "OLE",
        "holy_order.n.01",
        "object.n.01",
        "AY",
        "REN",
        "learner.n.01",
        "DO ",
        "NKI",
        "WS",
        " ’ ",
        " E",
        " RE",
        "ERES",
        "HAVE",
        "man.n.08",
        "WAR",
        "feel.v.01",
        "IONA",
        "SSI",
        "NL",
        "RSHI",
        "COM",
        " ”",
        "hostile.a.01",
        " TH",
        " ASS",
        "VO",
        "idolater.n.01",
        " CLO",
        "PRO",
        "SAY ",
        " WOR",
        "NE",
        " C",
        "fiddle.v.01",
        "world.n.02",
        " NOT",
        "ASS",
        "VIOL",
        " HAV",
        "OT ",
        "artifact.n.01",
        " CE",
        "RROG",
        "RIE",
        "TRE",
        "palpate.v.01",
        "convey.v.01",
        "GRE",
        "EWS ",
        "PEOPLE",
        "TERS",
        "THO",
        " WAX",
        "worker.n.01",
        "COMM",
        "OW",
        "NGE",
        "bad.s.02",
        "barren.s.03",
        "subordinate.n.01",
        "polytheist.n.01",
        "AZAR",
        "LY ",
        "AL-MUSHRIKUN",
        "decrease.n.04",
        "decay.v.02",
        " IDO",
        "pride.n.01",
        " TOW",
        "ISTI",
        "CERT",
        "experience.v.01",
        "scholar.n.03",
        "ONAT",
        "religious_person.n.01",
        "people.n.01",
        "violent.a.01",
        "SITY",
        "SE ",
        "change.v.02",
        "V. ",
        "AMO",
        "JEW",
        "ARES",
        "invest.v.01",
        "EC",
        "ISTS",
        " IN",
        "matter.n.03",
        "GEST",
        "PRIESTS",
        "MAN",
        "EN ",
        "P ",
        "serviceman.n.01",
        "THE",
        "OTE",
        "strong.s.02",
        "DS",
        "HAT",
        "AVE ",
        "ATR",
        "part.n.03",
        "LENT",
        "pagan.n.02",
        "ALL",
        "IDOLATERS",
        "AH",
        "equipment.n.01",
        "ANK",
        "adversary.n.01",
        " 'WE",
        "OLA",
        "TS ",
        "IN_L",
        "SHIP",
        "bad.s.10",
        "SSOC",
        "lineage.n.01",
        "HIGHEST",
        " DO ",
        "ITT",
        "enamored.s.01",
        " WO",
        "monk.n.01",
        "'W",
        "CESS",
        "OLAR",
        "LIEV",
        "think.v.03",
        "OVE ",
        "abstraction.n.06",
        "substance.n.07",
        "close.s.07",
        "pass.v.05",
        " PEO",
        "CKE",
        "FEE",
        "hostile.s.04",
        "OMM",
        "IOL",
        "give.v.10",
        "’ ",
        "EWS",
        "GA",
        "DIV",
        "group.n.01",
        "male.n.02",
        "trouble.v.05",
        "LD ",
        "manservant.n.01",
        "IG",
        "ES ",
        "STRO",
        "class.n.03",
        "OV",
        "WE",
        "SHIR",
        "STIF",
        "activity.n.01",
        "hedonist.n.01",
        " SC",
        "acrimonious.s.01",
        "join.v.01",
        "ATE",
        "RDS ",
        "JE",
        "ENSE",
        "priest.n.01",
        " FRI",
        "EE",
        "devote.v.03",
        "TES",
        " ME",
        " SAY",
        "LEAR",
        "read.v.02",
        "ENMITY",
        "wilt.n.01",
        " HIG",
        "affection.n.01",
        "MONG",
        "TE",
        " MAN",
        "SHRI",
        "INL",
        "RDS",
        "man.n.03",
        "close.s.12",
        "undergo.v.01",
        "ECT",
        " CL",
        "student.n.01",
        "LAT",
        "HOSTILITY",
        "ITTE",
        "FF",
        "populace.n.01",
        "IKU",
        "NEAREST",
        "CLOS",
        "MUSLIMS",
        "OUD ",
        "TILE",
        "EAT",
        "_L",
        "REA",
        "HFUL",
        "ORS",
        "allege.v.01",
        "TOW",
        "close.s.04",
        "SURELY",
        "NECK",
        "sweet.n.03",
        "OWER",
        "DIVINES",
        "OPLE",
        "HER",
        "UL ",
        " [",
        "pride.n.04",
        "NAZA",
        "LO ",
        "V.",
        "ASSO",
        "force.n.04",
        "TS",
        "avoid.v.03",
        "read.v.08",
        "thousand.n.01",
        "CE",
        "HI",
        "foreswear.v.02",
        "VEHE",
        "IVE ",
        "IEND",
        "firm.s.03",
        "high.s.05",
        "IPFU",
        "ON",
        "OSI",
        "ASSOCIATE",
        "EATE",
        "IMS ",
        "HATR",
        "IR",
        "HIGH",
        "homo.n.02",
        "” ",
        "FAI",
        "CER",
        "NTE",
        "GST",
        "VIOLENT",
        "IES",
        "ONKS",
        " IS",
        "RST ",
        "increase.v.01",
        "FRI",
        "SE",
        "AFF",
        " FA",
        "organization.n.01",
        "AF",
        "ENT ",
        "LLA",
        "learn.v.01",
        "contentment.n.01",
        "XC",
        "feeling.n.01",
        " GRE",
        "discipline.n.01",
        "OTED",
        "hold.v.14",
        "IVIN",
        "ED",
        "RIL",
        "acerb.s.02",
        "FF-",
        "OTH",
        "clergyman.n.01",
        "RID",
        "OL",
        "deity.n.01",
        "FOL",
        "HIPF",
        "TIFF",
        "AIL ",
        "RR",
        "-M",
        " P",
        "touch.v.01",
        " M",
        " FE",
        "NT",
        "BE ",
        " SEE",
        "NKS ",
        "TA",
        "believe.v.05",
        "VIN",
        "religious.n.01",
        " STR",
        "enemy.n.02",
        "ION ",
        "ST",
        "CHRI",
        "HIP ",
        "ND",
        "USL",
        "BITT",
        "IMAN",
        "condition.n.01",
        "universe.n.01",
        "believe.v.04",
        " I",
        "NAZ",
        "happiness.n.02",
        "IAT",
        "NON-BELIEVERS",
        "NLY",
        " SAI",
        "ING",
        " TO",
        "following.n.01",
        " ST",
        "NG",
        "GANS",
        "ERE",
        "communicate.v.01",
        "TEN",
        "VERS",
        "organism.n.01",
        " HAT",
        " NEA",
        "UNCE",
        " ALL",
        "NIT",
        " MU",
        "GAN",
        "IP",
        "faithful.n.01",
        "FOLLOWERS",
        "ENM",
        "LYTH",
        "CH",
        "nazarene.n.01",
        " DIV",
        "FE",
        "instrumentality.n.03",
        "LE ",
        "ALLA",
        "’",
        "entrust.v.01",
        "avoid.v.01",
        " BEH",
        "INE",
        "TILI",
        "STS",
        "L ",
        " WIL",
        "TOWARDS",
        "X ",
        "suppose.v.01",
        "ONGS",
        "MON",
        "animal.n.01",
        " BE ",
        "IND",
        "BITTEREST",
        "SURE",
        "feel.v.13",
        "feel.v.05",
        "complimentary.s.02",
        "PR",
        " PE",
        "LLAH",
        ". ",
        "MUSH",
        "hard.s.10",
        "CHRISTIANS",
        " FRE",
        "recite.v.02",
        "muslim.n.01",
        "HOST",
        "RS ",
        "family.n.04",
        "ROU",
        "biting.s.02",
        "look.v.02",
        "ask.v.02",
        "UD ",
        "action.n.01",
        "VI",
        "work_force.n.01",
        " WA",
        "EO",
        "S.",
        "IVI",
        "BEL",
        "FIND",
        "WO",
        "contestant.n.01",
        " JEW",
        "TIA",
        "TION",
        "FFE",
        " AN",
        "theist.n.01"
    ]
}