{
    "VERSE": "5:84",
    "ARABIC": "وَمَا لَنَا لَا نُؤْمِنُ بِٱللَّهِ وَمَا جَآءَنَا مِنَ ٱلْحَقِّ وَنَطْمَعُ أَن يُدْخِلَنَا رَبُّنَا مَعَ ٱلْقَوْمِ ٱلصَّٰلِحِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "How could we not have iman in Allah, and the truth that has come to us, when we long for our Lord to include us among the righteous?'",
        "TRANSLATION_1": "And why should we not believe in God and what has come down to us of the truth? And we hope to be admitted by our Lord among those who are upright and do good?\"\n",
        "TRANSLATION_2": "And why should we not believe in Allah and the Truth which has come down to us when we do fervently desire that our Lord include us among the righteous?'\n",
        "TRANSLATION_3": "Why should we not believe in God and the Truth that has come to us and hope that the Lord will admit us into the company of the righteous people?\"\n",
        "TRANSLATION_4": "“And what is the matter with us, that we should not believe in Allah and this truth which has come to us? And we hope that our Lord will admit us along with the righteous.”\n",
        "TRANSLATION_5": "And why should we not believe in Allah and in that which has come to us of the truth And we wish that our Lord will admit us along with the righteous people.\"\n",
        "TRANSLATION_6": "And what (reason) have we that we should not believe in Allah and in the truth that has come to us, while we earnestly desire that our Lord should cause us to enter with the good people?\n",
        "TRANSLATION_7": "Why should we not believe in God and the truth that has come to us, and be eager that our Lord should admit us with the righteous people?'\n",
        "TRANSLATION_8": "How should we not believe in Allah and that which hath come unto us of the Truth. And (how should we not) hope that our Lord will bring us in along with righteous folk?\n",
        "TRANSLATION_9": "Why should we not believe in God and in the truth that has come down to us? We yearn for our Lord to admit us among the righteous.\"\n",
        "TRANSLATION_10": "And what aileth us that we should not believe in Allah and that which hath come unto us of the truth; and we long that our Lord will enter us with the righteous people.\n",
        "TRANSLATION_11": "Why should we not believe in Allah and the truth that has come to us, eager as we are that our Lord should admit us among the righteous people?’\n",
        "TRANSLATION_12": "What cause can we have not to believe in Allah and the truth which has come to us, seeing that we long for our Lord to admit us to the company of the righteous?\"\n",
        "TRANSLATION_13": "And why should we not believe in Allah and in that which has come to us of the truth (Islamic Monotheism)? And we wish that our Lord will admit us (in Paradise on the Day of Resurrection) along with the righteous people (Prophet Muhammad SAW and his Companions).\"\n",
        "TRANSLATION_14": "Why should we not believe in Allah and in the truth that has come down to us? Why should we not hope for admission among the righteous'\n",
        "TRANSLATION_15": "“And why should we not believe in God, and in the truth that has come to us, and hope that our Lord will include us among the righteous people?”\n",
        "TRANSLATION_16": "And why should we not believe in Allah and what has come to us of the truth? And we aspire that our Lord will admit us [to Paradise] with the righteous people.\"\n",
        "TRANSLATION_17": "[5:84] And, in response to those Jews who reviled them for their Islam, they would say: why should we not believe in God and what has come to us of the truth, the Qur’ān, that is to say, there is nothing to prevent us from faith when its prerequisites are present; and hope (natma‘u is a supplement to nu’minu, ‘we believe’) that our Lord should admit us with the righteous people?’, the believers, into Paradise?\n",
        "TRANSLATION_18": "124 When their own people blamed them for believing, they said: (How should we not believe in Allah and that which hath come unto us of the Truth) He says: and also believe in the Truth that has come to us from Scripture and the Messenger. (And (how should we not) hope that our Lord will) in the Hereafter in Paradise (bring us in along with righteous folk) the righteous among the Community of Muhammad (pbuh)?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "5:84",
            "10:85",
            "6:80",
            "58:14",
            "7:62",
            "13:21",
            "11:88",
            "2:26",
            "61:7",
            "47:3"
        ],
        "BIBLE": [
            "prophets:i%20kings:20:13",
            "prophets:judges:11:35",
            "writings:ecclesiastes:2:16",
            "prophets:judges:14:11",
            "prophets:jeremiah:44:2",
            "torah:genesis:1:31",
            "prophets:isaiah:7:17",
            "torah:genesis:7:1",
            "writings:daniel:7:13",
            "torah:numbers:18:32"
        ]
    }
}