{
    "VERSE": "5:93",
    "ARABIC": "لَيْسَ عَلَى ٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّٰلِحَٰتِ جُنَاحٌ فِيمَا طَعِمُوٓا۟ إِذَا مَا ٱتَّقَوا۟ وَّءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّٰلِحَٰتِ ثُمَّ ٱتَّقَوا۟ وَّءَامَنُوا۟ ثُمَّ ٱتَّقَوا۟ وَّأَحْسَنُوا۟ وَٱللَّهُ يُحِبُّ ٱلْمُحْسِنِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Those who have iman and do right actions are not to blame for anything they have consumed provided they have taqwa and iman and do right actions, and then again have taqwa and iman, and then have taqwa and do good. Allah loves good-doers.",
        "TRANSLATION_1": "Those who believe and perform good deeds will not be held guilty for what they have eaten (in the past) if they fear God and believe, and do good things and are conscious (of God) and believe, and still fear and do good, for God loves those who do good.\n",
        "TRANSLATION_2": "There will be no blame on those who believe and do righteous deeds for whatever they might have partaken (in the past) as long as they refrain from things prohibited, and persist in their belief and do righteous deeds, and continue to refrain from whatever is forbidden and submit to divine commandments, and persevere in doing good, fearing Allah. Allah loves those who do good.\n",
        "TRANSLATION_3": "The righteously striving believers will not be blamed for what they have eaten, if they maintain piety, do good deeds, have faith, and be charitable. God loves the generous people.\n",
        "TRANSLATION_4": "Upon those who accepted faith and did good deeds, there shall be no sin for whatever they have consumed in the past, provided they fear and continue to believe and do good deeds, then again fear and continue to believe, and then again fear and remain virtuous; and Allah loves the virtuous.\n",
        "TRANSLATION_5": "Those who believe and do righteous good deeds, there is no sin on them for what they ate, if they have Taqwa and believe and do righteous good deeds, and they (again) have Taqwa and believe, and then (once again) have Taqwa and perform good. And Allah loves the good-doers.\n",
        "TRANSLATION_6": "On those who believe and do good there is no blame for what they eat, when they are careful (of their duty) and believe and do good deeds, then they are careful (of their duty) and believe, then they are careful (of their duty) and do good (to others), and Allah loves those who do good (to others).\n",
        "TRANSLATION_7": "There is no fault in those who believe and do deeds of righteousness what they may eat, if they are godfearing, and believe, and do deeds of righteousness, and then are godfearing and believe, and then are godfearing and do good; God loves the good-doers.\n",
        "TRANSLATION_8": "There shall be no sin (imputed) unto those who believe and do good works for what they may have eaten (in the past). So be mindful of your duty (to Allah), and believe, and do good works; and again: be mindful of your duty, and believe; and once again: be mindful of your duty, and do right. Allah loveth the good.\n",
        "TRANSLATION_9": "Those who believe and do good deeds will not be blamed for what they may have consumed [in the past], so long as they fear God and believe in Him and do good works; so long as they fear God and believe in Him, so long as they fear God and do good deeds. For God loves those who do good.\n",
        "TRANSLATION_10": "No sin is on those who believe and work righteous works for that which they have eaten when they have abstained, and believed and work righteous works, and shall again abstain and believe, and shall again abstain and do well; and Allah loveth the well-doers.\n",
        "TRANSLATION_11": "There will be no sin upon those who have faith and do righteous deeds in regard to what they have eaten [in the past] so long as they are Godwary and faithful and do righteous deeds, and are further Godwary and faithful, and are further Godwary and virtuous. And Allah loves the virtuous.\n",
        "TRANSLATION_12": "On those who believe and do deeds of righteousness there is no blame for what they ate (in the past), when they guard themselves from evil, and believe, and do deeds of righteousness,- (or) again, guard themselves from evil and believe,- (or) again, guard themselves from evil and do good. For Allah loveth those who do good.\n",
        "TRANSLATION_13": "Those who believe and do righteous good deeds, there is no sin on them for what they ate (in the past), if they fear Allah (by keeping away from His forbidden things), and believe and do righteous good deeds, and again fear Allah and believe, and once again fear Allah and do good deeds with Ihsan (perfection). And Allah loves the good-doers.\n",
        "TRANSLATION_14": "No blame shall be attached to those who believe and did good works in regard to any food they have eaten, so long as they ward off (the forbidden) and believe, and do good deeds, then they fear and believe, and again, so long as they fear and do fine deeds. Allah loves the generous.\n",
        "TRANSLATION_15": "Those who believe and do righteous deeds will not be blamed for what they may have eaten, provided they obey, and believe, and do good deeds, then maintain piety and faith, then remain righteous and charitable. God loves the charitable.\n",
        "TRANSLATION_16": "There is not upon those who believe and do righteousness [any] blame concerning what they have eaten [in the past] if they [now] fear Allah and believe and do righteous deeds, and then fear Allah and believe, and then fear Allah and do good; and Allah loves the doers of good.\n",
        "TRANSLATION_17": "[5:93]   Those who believe and perform righteous deeds are not at fault in what they may have consumed, of wine and [indulged in] of gambling before the prohibition, so long as they fear, the forbidden things, and believed and performed righteous deeds, and then were God-fearing and believed, [and then] adhered to fear of God and belief, and then were God-fearing and virtuous, in deeds; God loves the virtuous, meaning that He will reward them.\n",
        "TRANSLATION_18": "Then Allah revealed about a group of men from the Emigrants and the Helpers who asked the Prophet (pbuh): \"what shall happen to those of us who died drinking intoxicant drinks before they were made unlawful\", saying: (There shall be no sin (imputed) unto those who believe) in Muhammad and the Qur'an (and do good works) that is between them and their Lord (for what they may have eaten (in the past)) for what they have drunk in the past before intoxicants were made unlawful, whether those who did it are dead or still living. (So be mindful of your duty (to Allah)) if they warded off disbelief, idolatry and indecencies, (and do good works) that is between them and their Lord; (and again: be mindful of your duty) ward off making intoxicants lawful after they were made unlawful; this address is to the believers who are still living, (and believe) in the unlawfulness of intoxicant; (and once again: be mindful of your duty) ward off drinking it, (and do right) leave the drinking of it. (Allah loveth the good) for avoiding drinking intoxicants; this relates to those who were still alive and who drunk intoxicants before they were made unlawful.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "5:93",
            "3:141",
            "9:43",
            "4:61",
            "29:11",
            "33:23",
            "2:15",
            "8:33",
            "2:156",
            "22:35"
        ],
        "BIBLE": [
            "writings:ecclesiastes:12:14",
            "writings:nehemiah:4:15",
            "prophets:i%20kings:11:10",
            "prophets:ii%20kings:7:9",
            "writings:psalms:141:4",
            "torah:leviticus:5:17",
            "torah:exodus:34:10",
            "prophets:micah:6:16",
            "torah:exodus:16:32",
            "prophets:jeremiah:14:10"
        ]
    }
}