{
    "VERSE": "5:95",
    "ARABIC": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ لَا تَقْتُلُوا۟ ٱلصَّيْدَ وَأَنتُمْ حُرُمٌ وَمَن قَتَلَهُۥ مِنكُم مُّتَعَمِّدًا فَجَزَآءٌ مِّثْلُ مَا قَتَلَ مِنَ ٱلنَّعَمِ يَحْكُمُ بِهِۦ ذَوَا عَدْلٍ مِّنكُمْ هَدْيًۢا بَٰلِغَ ٱلْكَعْبَةِ أَوْ كَفَّٰرَةٌ طَعَامُ مَسَٰكِينَ أَوْ عَدْلُ ذَٰلِكَ صِيَامًا لِّيَذُوقَ وَبَالَ أَمْرِهِۦ عَفَا ٱللَّهُ عَمَّا سَلَفَ وَمَنْ عَادَ فَيَنتَقِمُ ٱللَّهُ مِنْهُ وَٱللَّهُ عَزِيزٌ ذُو ٱنتِقَامٍ",
    "ENGLISH": {
        "TRANSLATION_0": "You who have iman! do not kill game while you are in ihram. If one of you kills any deliberately, the reprisal for it is a livestock animal equivalent to what he killed, as judged by two just men among you, a sacrifice to reach the Ka'ba, or expiation by feeding the poor, or fasting commensurate with that, so that he anyone does it again Allah will take revenge on him. Allah is Almighty, Exactor of Revenge.",
        "TRANSLATION_1": "O you who believe, do not kill game when you are on pilgrimage. And anyone among you who does so on purpose should offer livestock of equivalent value, determined by two honourable persons among you, (as atonement), to be brought to the Ka'bah as an offering; or else expiate by giving food to the poor, or its equivalent in fasting, so that he may realise the gravity of his deed. God has forgiven what has happened in the past; but any one who does so again will be punished by God. And God is severe in requital.\n",
        "TRANSLATION_2": "Believers! Do not kill game while you are in the state of pilgrim sanctity. Whoever of you kills it wilfully there shall be a recompense, the like of what he has killed in cattle - as shall be judged by two men of equity among you - to be brought to the Ka'bah as an offering, or as an expiation the feeding of the needy, or its equivalent in fasting in order that he may taste the grievousness of his deed. Allah has pardoned whatever has passed; but Allah will exact a penalty from him who repeats it. Allah is All-Mighty. He is fully capable of exacting penalties.\n",
        "TRANSLATION_3": "Believers, do not hunt when you are in the holy precinct. Whichever of you purposely kills game in the holy precinct has to offer, as an expiation, a sacrifice in the holy precinct which two just people among you would consider equal to the prey or food to a destitute person or has to fast (for an appointed time) to bear the burden of the penalty for his deed. God forgives whatever was done in the past, but He will take revenge on whoever returns to transgression, for He is Majestic and Capable of taking revenge.\n",
        "TRANSLATION_4": "O People who Believe! Do not kill prey while you are on the pilgrimage; and whoever among you kills it intentionally, so its recompense is that he shall give a similar domestic animal (for sacrifice), two honest men among you rendering the command, the sacrifice being brought to the Kaa’bah – or he gives as redemption, food for some needy persons, or fasts for the same number of days, so that he may taste the consequences of his deed; Allah has forgiven what has passed; and henceforth whoever does it, Allah will take recompense from him; and Allah is Almighty, Avenger.\n",
        "TRANSLATION_5": "O you who believe! Kill not game while you are in a state of Ihram, and whosoever of you kills it intentionally, the penalty is an offering, brought to the Ka`bah, of livestock equivalent to the one he killed, as adjudged by two just men among you; or, for expiation, he should feed the poor, or its equivalent in fasting, that he may taste the heaviness (punishment) of his deed. Allah has forgiven what is past, but whosoever commits it again, Allah will take retribution from him. And Allah is Almighty, All-Able of Retribution.\n",
        "TRANSLATION_6": "O you who believe! do not kill game while you are on pilgrimage, and whoever among you shall kill it intentionally, the compensation (of it) is the like of what he killed, from the cattle, as two just persons among you shall judge, as an offering to be brought to the Kaaba or the expiation (of it) is the feeding of the poor or the equivalent of it in fasting, that he may taste the unwholesome result of his deed; Allah has pardoned what is gone by; and whoever returns (to it), Allah will inflict retribution on him; and Allah is Mighty, Lord of Retribution.\n",
        "TRANSLATION_7": "O believers, slay not the game while you are in pilgrim sanctity; whosoever of you slays it wilfully, there shall be recompense -- the like of what he has slain, in flocks as shall be judged by two men of equity among you, an offering to reach the Kaaba; or expiation -- food for poor persons or the equivalent of that in fasting, so that he may taste the mischief of his action. God has pardoned what is past; but whoever offends again, God will take vengeance on him, God is All-mighty, Vengeful.\n",
        "TRANSLATION_8": "O ye who believe! Kill no wild game while ye are on the pilgrimage. Whoso of you killeth it of set purpose he shall pay its forfeit in the equivalent of that which he hath killed, of domestic animals, the judge to be two men among you known for justice, (the forfeit) to be brought as an offering to the Ka'bah; or, for expiation, he shall feed poor persons, or the equivalent thereof in fasting, that he may taste the evil consequences of his deed. Allah forgiveth whatever (of this kind) may have happened in the past, but whoso relapseth, Allah will take retribution from him. Allah is Mighty, Able to Requite (the wrong).\n",
        "TRANSLATION_9": "Believers, do not kill any game while you are on a pilgrimage. Anyone of you who kills game deliberately shall make compensation with an animal which is the equivalent of what he has killed, to be determined by two just men from among you, as an offering brought to the Ka'bah; or he shall, in expiation, either feed the poor or do the equivalent of that in fasting, so that he may taste the consequence of his deeds. God forgives what is past, but if anyone relapses into wrongdoing, God will exact His retribution. God is mighty, the Lord of retribution.\n",
        "TRANSLATION_10": "O ye who believe! slay not chase while ye are in a state of sanctity; and whosoever of you slayeth it wittingly, his compensation is the like of that which he hath slain, in domestic flocks, which two equitable persons among you shall judge: an offering brought to the Ka'ba; or as an expiation the feeding of the needy, or the equivalent thereof in fasts, that he may taste the grievousness of his deed. Allah hath pardoned that which is past, but whosoever returnoth, Allah shall take retribution from him; verily Allah is Mighty, Lord of Retribution\n",
        "TRANSLATION_11": "O you who have faith! Do not kill any game when you are in pilgrim sanctity. Should any of you kill it intentionally, its atonement, the counterpart from cattle of what he has killed, as judged by two fair men among you, will be an offering brought to the Ka‘bah, or an atonement by feeding needy persons, or its equivalent in fasting, that he may taste the untoward consequences of his conduct. Allah has excused what is already past; but should anyone resume, Allah shall take vengeance on him, for Allah is all-mighty, avenger.\n",
        "TRANSLATION_12": "O ye who believe! Kill not game while in the sacred precincts or in pilgrim garb. If any of you doth so intentionally, the compensation is an offering, brought to the Ka'ba, of a domestic animal equivalent to the one he killed, as adjudged by two just men among you; or by way of atonement, the feeding of the indigent; or its equivalent in fasts: that he may taste of the penalty of his deed. Allah forgives what is past: for repetition Allah will exact from him the penalty. For Allah is Exalted, and Lord of Retribution.\n",
        "TRANSLATION_13": "O you who believe! Kill not game while you are in a state of Ihram for Hajj or 'Umrah (pilgrimage), and whosoever of you kills it intentionally, the penalty is an offering, brought to the Ka'bah, of an eatable animal (i.e. sheep, goat, cow, etc.) equivalent to the one he killed, as adjudged by two just men among you; or, for expiation, he should feed Masakin (poor persons), or its equivalent in Saum (fasting), that he may taste the heaviness (punishment) of his deed. Allah has forgiven what is past, but whosoever commits it again, Allah will take retribution from him. And Allah is All-Mighty, All-Able of Retribution.\n",
        "TRANSLATION_14": "O believers, do not kill the hunted while you are in pilgrim sanctity. Whosoever of you kills it willfully there shall be a recompense, the like of what he has slain from cattle as shall be judged by two just men among you, an offering to reach the Ka'bah; or expiation food for needy persons or the equivalent of that in fasting, so that he may taste the weight of the recompense of his action. Allah has pardoned what is past; but whoever offends again, Allah will take vengeance on him. Allah is the Almighty, Owner of Vengeance.\n",
        "TRANSLATION_15": "O you who believe! do not kill game while you are in pilgrim sanctity. Whoever of you kills any intentionally, its penalty shall be a domestic animal comparable to what he killed, as determined by two honest persons among you—an offering delivered to the Kaabah. Or he may atone by feeding the needy, or its equivalent in fasting, so that he may taste the consequences of his conduct. God forgives what is past. But whoever repeats, God will take revenge on him. God is Almighty, Avenger.\n",
        "TRANSLATION_16": "O you who have believed, do not kill game while you are in the state of ihram. And whoever of you kills it intentionally - the penalty is an equivalent from sacrificial animals to what he killed, as judged by two just men among you as an offering [to Allah] delivered to the Ka'bah, or an expiation: the feeding of needy people or the equivalent of that in fasting, that he may taste the consequence of his deed. Allah has pardoned what is past; but whoever returns [to violation], then Allah will take retribution from him. And Allah is Exalted in Might and Owner of Retribution.\n",
        "TRANSLATION_17": "[5:95] O you who believe, do not slay game while you are in the state of pilgrimage inviolability, for the hajj or the ‘umra; whoever of you slays it wilfully, then the compensation shall be (read fa-jazā’un, ‘then the compensation [shall be]’, followed by a nominative [mithlu, ‘the like of’]) that is to say, a compensation is incumbent on him, and that is, the equivalent of what he has slain, of flocks, in other words, a similar creature (a variant reading has an annexation construction for jazā’, ‘compensation’, [sc. fa-jazā’u mithli, ‘then the compensation of’]), to be judged, that is, the equivalent [is to be judged], by two just men among you, both possessing astuteness, with which they are able to identify the nearest [animal] in equivalence to it [the slain animal]. Ibn ‘Abbās, ‘Umar and ‘Alī, may God be pleased with them, all adjudged a beast of sacrifice [as redemption] for an ostrich [slain]; Ibn ‘Abbās and Abū ‘Ubayda adjudged a cow [as redemption] for wildebeest or wild ass; [‘Abd Allāh] Ibn ‘Umar and [‘Abd al-Rahmān] Ibn ‘Awf, a sheep for a gazelle, and, as Ibn ‘Abbās, ‘Umar and others did, [a sheep] also [as a redemption] for [slaying] pigeons, because they [pigeons] resemble these [sheep] in taking scoops of water [when drinking]; an offering (hadyan is a circumstantial qualifier referring to jazā’, ‘compensation’) to reach the Ka‘ba, that is, to be taken into the Sanctuary, sacrificed there and given as a voluntary offering to its needy [residents], and it cannot be sacrificed wherever [else] it may be (bāligha l-ka‘ba, ‘to reach the Ka‘ba’, is in the accusative because it is an adjectival qualification of what precedes, even if it stands as an annexation, since such an annexation is only morphological and not [valid] as a [grammatical] characterisation); if there is no equivalent beast of flock for the game slain, as in the case of a small bird or locusts, then the person is obliged [to compensate] with [equivalent] value. Or, it is incumbent on him [to make], an expiation: other than compensation, and if he should find the means then this [expiation] is, food for the poor, [food] to be taken from the principal food of the town, equivalent to the value of the compensation, being one mudd measure for each poor person (a variant reading has kaffāra, ‘expiation’, in an annexation with the following noun [sc. kaffāratu ta‘āmin, ‘the expiation of food’] as an explication [of kaffāra, ‘expiation’]); or, it is incumbent on him [to compensate with], the equivalent of that, food, in fasting, so that he fasts one day for every mudd measure [that he is unable to provide]; but if he has the means to [provide the food] then it is incumbent on him to do so, so that he may taste the evil consequence, the burden of the compensation, of his deed, the one he has perpetrated. God has pardoned what is past, of game slain before it was prohibited; but whoever offends again, God will take vengeance on him; God is Mighty, His way will prevail, Lord of Retribution, against those who disobey Him. Unintentional slaying [of game] is also included with intentional slaying in what has been mentioned [of required compensation or expiation].\n",
        "TRANSLATION_18": "(0 ye who believe! Kill no wild game while ye are on the pilgrimage) or in the Sacred Precinct. (Whoso of you killeth it of set purpose) this verse was revealed about Abu'l-Yusr Ibn 'Amr who intentionally killed game, forgetting he was in ritual consecration, (he shall pay its forfeit in the equivalent of that which he hath killed, of domestic animals, the judge to be two men among you known for justice) two judges will evaluate such equivalence; ((the forfeit) to be brought as an offering to the Ka'bah; or, for expiation, he shall feed poor persons) or he should give money for it by feeding some of the poor of Mecca, (or the equivalent thereof in fasting) if he cannot feed the poor, he should fast one for each half measure (Sa') of food he is supposed to feed to the poor, (that he may taste the evil consequences) the punishment (of his deed. Allah forgiveth whatever (of this kind) may have happened in the past) before it was made unlawful, (but whoso relapseth) after being condemned and beaten severely in this world, (Allah will take retribution from him) he should be left until Allah takes retribution from him. (Allah is Mighty) in His retribution, (Able to 126 Requite (the wrong)) Able to punish those who do wrong.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "5:95",
            "5:54",
            "60:11",
            "5:1",
            "5:38",
            "5:94",
            "63:9",
            "5:6",
            "5:89",
            "3:140"
        ],
        "BIBLE": [
            "torah:leviticus:10:17",
            "torah:leviticus:4:35",
            "writings:daniel:6:8",
            "prophets:ii%20kings:5:7",
            "prophets:ezekiel:20:31",
            "torah:exodus:36:6",
            "torah:leviticus:5:18",
            "prophets:ezekiel:4:9",
            "torah:genesis:3:6",
            "prophets:jeremiah:35:15"
        ]
    }
}