{
    "VERSE": "5:96",
    "ARABIC": "أُحِلَّ لَكُمْ صَيْدُ ٱلْبَحْرِ وَطَعَامُهُۥ مَتَٰعًا لَّكُمْ وَلِلسَّيَّارَةِ وَحُرِّمَ عَلَيْكُمْ صَيْدُ ٱلْبَرِّ مَا دُمْتُمْ حُرُمًا وَٱتَّقُوا۟ ٱللَّهَ ٱلَّذِىٓ إِلَيْهِ تُحْشَرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Anything you catch in the sea is halal for you, and all food from it, for your enjoyment and that of travellers, but land game is haram for you while you are in ihram. So have taqwa of Allah, Him to whom you will be gathered.",
        "TRANSLATION_1": "Lawful is all game of the water for you, and eating of it as food, so that you and the travellers may benefit by it. But unlawful is game of the jungle when you are on pilgrimage. Fear God before whom you have to gather in the end.\n",
        "TRANSLATION_2": "The game of the water and eating thereof are permitted to you as a provision for you (who are settled) and for those on a journey; but to hunt on land while you are in the state of Pilgrim sanctity is forbidden for you. Beware, then, of disobeying Allah to Whom you shall all be mustered.\n",
        "TRANSLATION_3": "It is lawful for you to hunt from the sea and to eat seafood. This is for your benefit and for the benefit of travellers. However, it is not lawful for you to hunt on land as long as you are in the sacred precinct. Have fear of God before whom you will all be raised.\n",
        "TRANSLATION_4": "It is lawful for you to hunt from the sea and to eat from it, for your benefit and that of the travellers; and hunting on land is forbidden for you while you are on the pilgrimage; and fear Allah, towards Whom you will arise.\n",
        "TRANSLATION_5": "Lawful to you is water game and its use for food -- for the benefit of yourselves and those who travel, but forbidden is (the pursuit of) land game as long as you are in a state of Ihram. And have Taqwa of Allah to Whom you shall be gathered back.\n",
        "TRANSLATION_6": "Lawful to you is the game of the sea and its food, a provision for you and for the travellers, and the game of the land is forbidden to you so long as you are on pilgrimage, and be careful of (your duty to) Allah, to Whom you shall be gathered.\n",
        "TRANSLATION_7": "Permitted to you is the game of the sea and the food of it, as a provision for you and for the journeyers; but forbidden to you is the game of the land, so long as you remain in pilgrim sanctity; and fear God, unto whom you shall be mustered.\n",
        "TRANSLATION_8": "To hunt and to eat the fish of the sea is made lawful for you, a provision for you and for seafarers; but to hunt on land is forbidden you so long as ye are on the pilgrimage. Be mindful of your duty to Allah, unto Whom ye will be gathered.\n",
        "TRANSLATION_9": "To hunt and to eat the fish of the sea is made lawful for you, a provision made for you and for seafarers. But you are forbidden the game of the land while you are on a pilgrimage. Have fear of God, before whom you shall all be gathered.\n",
        "TRANSLATION_10": "Allowed unto you is the game of the sea and the eating thereof: a provision for you and for the caravan; and forbidden unto you is the game of the land while ye are in the state of sanctity. And fear Allah unto whom ye shall be gathered.\n",
        "TRANSLATION_11": "You are permitted the game of the sea and its food, a provision for you and for the caravans, but you are forbidden the game of the land so long as you remain in pilgrim sanctity, and be wary of Allah toward whom you will be gathered.\n",
        "TRANSLATION_12": "Lawful to you is the pursuit of water-game and its use for food,- for the benefit of yourselves and those who travel; but forbidden is the pursuit of land-game;- as long as ye are in the sacred precincts or in pilgrim garb. And fear Allah, to Whom ye shall be gathered back.\n",
        "TRANSLATION_13": "Lawful to you is (the pursuit of) water-game and its use for food - for the benefit of yourselves and those who travel, but forbidden is (the pursuit of) land-game as long as you are in a state of Ihram (for Hajj or 'Umrah). And fear Allah to Whom you shall be gathered back.\n",
        "TRANSLATION_14": "Made lawful to you is the fished of the sea and its food, an enjoyment for you and for travelers. But you are forbidden the hunted of the land whilst you are on pilgrimage. Have fear of Allah, before whom you shall all be assembled.\n",
        "TRANSLATION_15": "Permitted for you is the catch of sea, and its food—as sustenance for you and for travelers. But forbidden for you is the game of land while you are in pilgrim sanctity. And fear God, to whom you will be gathered.\n",
        "TRANSLATION_16": "Lawful to you is game from the sea and its food as provision for you and the travelers, but forbidden to you is game from the land as long as you are in the state of ihram. And fear Allah to whom you will be gathered.\n",
        "TRANSLATION_17": "[5:96] Permitted to you, O people, be you in pilgrimage inviolability or not, is the game of the sea, for consumption, and it is what can only live in the sea, such as fish, but not what is able to live both in the sea and on land, such as crabs; and food from it, what it casts out that is dead, is a provision for you, for you to consume, and for the wayfarers, the travellers among you, to take as their provisions; but forbidden to you   is the hunting of game on the land, and this consists of those edible beasts that live on it; do not hunt them, so long as you remain in pilgrimage inviolability: if it is caught by one not in pilgrimage inviolability, then it is permissible for a person in pilgrimage inviolability to consume it, as is clarified in the Sunna; and fear God, to whom you shall be gathered.\n",
        "TRANSLATION_18": "(To hunt and to eat the fish of the sea is made lawful for you) this was revealed about a people from the Banu Mudlij who lived off the sea. They asked the Prophet (pbuh) about the fish of the sea and about that which is washed out of the sea, so Allah revealed that it is lawful to fish just as it is lawful to eat that which is washed out by the sea (a provision for you) a benefit for you (and for seafarers; but to hunt on land is forbidden you so long as ye are on the pilgrimage) or in the Sacred Precinct. (Be mindful of your duty to Allah) fear Allah, (unto Whom ye will be gathered) and questioned about the game made forbidden for you during ritual consecration and at the Sacred Precinct.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "5:96",
            "5:1",
            "24:29",
            "9:1",
            "4:61",
            "16:57",
            "58:9",
            "16:53",
            "42:36",
            "2:194"
        ],
        "BIBLE": [
            "prophets:isaiah:49:11",
            "prophets:ezekiel:29:12",
            "torah:deuteronomy:4:23",
            "prophets:jeremiah:3:16",
            "prophets:micah:2:12",
            "torah:genesis:34:30",
            "torah:exodus:34:15",
            "prophets:joshua:9:11",
            "prophets:jeremiah:24:8",
            "prophets:jeremiah:30:10"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:2:1",
            
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:8"
        ]
    }
}