{
    "VERSE": "28:11",
    "ARABIC": "وَقَالَتْ لِأُخْتِهِۦ قُصِّيهِ فَبَصُرَتْ بِهِۦ عَن جُنُبٍ وَهُمْ لَا يَشْعُرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "She said to his sister, 'Go after him.' And she kept an eye on him from afar and they were not aware.",
        "TRANSLATION_1": "She told his sister: \"Follow him.\" So she kept an eye on him from a distance, unbeknown to them.\n",
        "TRANSLATION_2": "She told the sister of Moses: \"Follow him.\" So she kept watch over him unperceived (by the enemies).\n",
        "TRANSLATION_3": "She told Moses' sister to follow her brother. His sister watched him from one side and the people of the Pharaoh did not notice her presence.\n",
        "TRANSLATION_4": "And she said to his sister, “Go after him” – she therefore observed him from far, and they were not aware.\n",
        "TRANSLATION_5": "And she said to his sister: \"Follow him.\" So she watched him from a far place (secretly), while they perceived not.\n",
        "TRANSLATION_6": "And she said to his sister: Follow him up. So she watched him from a distance while they did not perceive,\n",
        "TRANSLATION_7": "and she said to his sister, 'Follow him,' and she perceived him from afar, even while they were not aware.\n",
        "TRANSLATION_8": "And she said unto his sister: Trace him. So she observed him from afar, and they perceived not.\n",
        "TRANSLATION_9": "She said to Moses' sister, \"Go, and follow him.\" So she watched him from a distance, like a stranger, without anyone noticing her.\n",
        "TRANSLATION_10": "And she said unto his sister: follow him. So she watched him from afar; and they perceived not.\n",
        "TRANSLATION_11": "She said to his sister, ‘Follow him.’ So she watched him from a distance, while they were not aware.\n",
        "TRANSLATION_12": "And she said to the sister of (Moses), \"Follow him\" so she (the sister) watched him in the character of a stranger. And they knew not.\n",
        "TRANSLATION_13": "And she said to his [Musa's (Moses)] sister: \"Follow him.\" So she (his sister) watched him from a far place secretly, while they perceived not.\n",
        "TRANSLATION_14": "She said to his sister: 'Follow him' And she watched him from a distance, but they were unaware.\n",
        "TRANSLATION_15": "She said to his sister, “Trail him.” So she watched him from afar, and they were unaware.\n",
        "TRANSLATION_16": "And she said to his sister, \"Follow him\"; so she watched him from a distance while they perceived not.\n",
        "TRANSLATION_17": "[28:11] And she said to his sister, Mary, ‘Follow him’, in other words, follow where he goes in order to find out his news. So she watched him from afar, from a distance, secretly, while they were not aware, that she was his sister, or that she was [even] watching him.\n",
        "TRANSLATION_18": "(And she) the mother of Moses (said unto his sister) the sister of Moses whose name was Mary: (Trace him. So she observed him) the child (from afar, and they perceived not) that she is the sister of Moses.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "28:11",
            "12:58",
            "12:69",
            "43:75",
            "55:39",
            "51:54",
            "19:53",
            "37:90",
            "7:111",
            "26:36"
        ],
        "BIBLE": [
            "prophets:ii%20samuel:2:27",
            "prophets:i%20samuel:14:46",
            "torah:exodus:11:8",
            "torah:genesis:44:4",
            "writings:job:1:12",
            "prophets:jonah:1:10",
            "torah:genesis:28:16",
            "prophets:amos:7:15",
            "writings:proverbs:15:3",
            "prophets:judges:3:28"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:2:1"
        ]
    }
}