{
    "VERSE": "28:15",
    "ARABIC": "وَدَخَلَ ٱلْمَدِينَةَ عَلَىٰ حِينِ غَفْلَةٍ مِّنْ أَهْلِهَا فَوَجَدَ فِيهَا رَجُلَيْنِ يَقْتَتِلَانِ هَٰذَا مِن شِيعَتِهِۦ وَهَٰذَا مِنْ عَدُوِّهِۦ فَٱسْتَغَٰثَهُ ٱلَّذِى مِن شِيعَتِهِۦ عَلَى ٱلَّذِى مِنْ عَدُوِّهِۦ فَوَكَزَهُۥ مُوسَىٰ فَقَضَىٰ عَلَيْهِ قَالَ هَٰذَا مِنْ عَمَلِ ٱلشَّيْطَٰنِ إِنَّهُۥ عَدُوٌّ مُّضِلٌّ مُّبِينٌ",
    "ENGLISH": {
        "TRANSLATION_0": "He entered the city at a time when its inhabitants were unaware and found two men fighting there - one from his party and the other from his enemy. The one from his party asked for his support against the other from his enemy. So Musa hit him, dealing him a fatal blow. He said, 'This is part of Shaytan's handiwork. He truly is an outright and misleading enemy.'",
        "TRANSLATION_1": "He came to the city when the people were in a care-free mood, and saw two men quarrelling, one belonging to his community, the other to his enemies. The man who belonged to his community appealed for help against the one who belonged to the enemies. Moses struck him a blow with his fist and finished him off. \"This is of Satan's doing,\" he said. \"He is certainly an enemy and a corrupter.\"\n",
        "TRANSLATION_2": "Once he entered the city at a time when its people were heedless, and he encountered two men fighting, one of whom belonged to his own people and the other to his foes. Now the man belonging to Moses' own people cried out to him for help against the man from the foes, and Moses struck him with his fist and finished him. Moses said: \"This is an act of Satan. Surely he is an enemy who openly misleads.\"\n",
        "TRANSLATION_3": "He entered the city without the knowledge of its inhabitants and found two men fighting each other. One was his follower and the other his enemy. His follower asked him for help. Moses struck his enemy to death, but later said, \"It was the work of satan; he is the sworn enemy of the human being and wants to mislead him\".\n",
        "TRANSLATION_4": "And he entered the city when its inhabitants were sleeping unaware in the afternoon – he therefore found two men fighting; one was from Moosa’s group, and the other from among his enemies; so the one who was of Moosa’s group pleaded to Moosa for help against him who was of his enemies – therefore Moosa punched him thereby finishing him; he said, “This act was from the devil*; indeed he is an open enemy, a misleader.” (* The act of oppressing the man from Bani Israel).\n",
        "TRANSLATION_5": "And he entered the city when its people were unaware: and he found there two men fighting, -- one of his party, and the other of his foes. The man of his (own) party asked him for help against his foe, so Musa struck him with his fist and he died. He said: \"This is of Shaytan's doing, verily, he is a plain misleading enemy.\"\n",
        "TRANSLATION_6": "And he went into the city at a time of unvigilance on the part of its people, so he found therein two men fighting, one being of his party and the other of his foes, and he who was of his party cried out to him for help against him who was of his enemies, so Musa struck him with his fist and killed him. He said: This is on account of the Shaitan's doing; surely he is an enemy, openly leading astray.\n",
        "TRANSLATION_7": "And he entered the city, at a time when its people were unheeding, and found there two men fighting; the one was of his own party, and the other was of his enemies. Then the one that was of his party cried to him to aid him against the other that was of his enemies; so Moses struck him, and despatched him, and said, 'This is of Satan's doing; he is surely an enemy misleading, manifest.'\n",
        "TRANSLATION_8": "And he entered the city at a time of carelessness of its folk, and he found therein two men fighting, one of his own caste, and the other of his enemies; and he who was of his caste asked him for help against him who was of his enemies. So Moses struck him with his fist and killed him. He said: This is of the devil's doing. Lo! he is an enemy, a mere misleader.\n",
        "TRANSLATION_9": "He entered the city unnoticed by its people, and there he encountered two men fighting with one another -- one of his own people and the other one of his enemies. The one who belonged to his own people cried out to him for help against his foe -- whereupon Moses struck him down with his fist, thereby causing his death. Moses said, \"This is Satan's doing; he is an open foe, leading man astray.\"\n",
        "TRANSLATION_10": "And he entered the City at a time of unawareness of the inhabitants thereof, and he found therein two men fighting, one being of his own party, and the other of his enemies. And he who was of his party, called him for help against him who was of his enemies. So Musa truck him with his fist, and put an end of him. He said: this is of the work of the satan, verily he is an enemy, a misleader manifest.\n",
        "TRANSLATION_11": "[One day] he entered the city at a time when its people were not likely to take notice. He found there two men fighting, this one from among his followers, and that one from his enemies. The one who was from his followers sought his help against him who was from his enemies. So Moses hit him with his fist, whereupon he expired. He said, ‘This is of Satan’s doing. Indeed he is clearly a misguiding enemy.’\n",
        "TRANSLATION_12": "And he entered the city at a time when its people were not watching: and he found there two men fighting,- one of his own religion, and the other, of his foes. Now the man of his own religion appealed to him against his foe, and Moses struck him with his fist and made an end of him. He said: \"This is a work of Evil (Satan): for he is an enemy that manifestly misleads!\"\n",
        "TRANSLATION_13": "And he entered the city at a time of unawareness of its people, and he found there two men fighting, - one of his party (his religion - from the Children of Israel), and the other of his foes. The man of his (own) party asked him for help against his foe, so Musa (Moses) struck him with his fist and killed him. He said: \"This is of Shaitan's (Satan) doing, verily, he is a plain misleading enemy.\"\n",
        "TRANSLATION_14": "And he entered the city unnoticed by the people and found two men fighting, one was of his own party, and the other of his enemies. The one of his party appealed for his help against his enemy, Moses struck and killed him, and said: 'This is the work of satan, he is surely a clear, misleading enemy.\n",
        "TRANSLATION_15": "Once he entered the city, unnoticed by its people. He found in it two men fighting—one of his own sect, and one from his enemies. The one of his sect solicited his assistance against the one from his enemies; so Moses punched him, and put an end to him. He said, “This is of Satan's doing; he is an enemy that openly misleads.”\n",
        "TRANSLATION_16": "And he entered the city at a time of inattention by its people and found therein two men fighting: one from his faction and one from among his enemy. And the one from his faction called for help to him against the one from his enemy, so Moses struck him and [unintentionally] killed him. [Moses] said, \"This is from the work of Satan. Indeed, he is a manifest, misleading enemy.\"\n",
        "TRANSLATION_17": "[28:15] And he, Moses, entered the city, Pharaoh’s city, Memphis, having been absent from it for a while, at a time when its people were oblivious, the time of the afternoon nap, and found therein two men fighting, one of his own faction, namely, an Israelite, and the other of his enemies, in other words, an Egyptian, who was exploiting an Israelite to carry firewood to Pharaoh’s kitchen. So the one who was of his faction called to him for help against the one who was of his enemies, and so Moses said to him, ‘Leave him be!’, and it is said that he replied to Moses [thus]: ‘I am truly considering making you carry this [firewood]!’. So Moses punched him, that is, he hit him with his fist clenched — he [Moses] was a strong man with a powerful strike, and did away with him, that is, he killed him, but he had not intended to kill him. He buried him in the sand. He said, ‘This, killing of him, is of Satan’s doing, inciting my anger. Indeed he is an enemy, to the son of Adam, a manifest misleader’, of him.\n",
        "TRANSLATION_18": "(And he entered the city at a time of carelessness of its folk) when its folk were preoccupied, at the time of the siesta, and it is said after the Maghrib prayer, (and he found therein) in the city (two men fighting, one of his own caste) of the caste of Moses, i.e. an Israelite, (and the other of his enemies) of the enemies of Moses, i.e. a Copt; (and he who was of his caste) Moses' caste (asked him for help against him who was of his enemies) Moses' enemies. (So Moses struck him with his fist and killed him. He said) Moses said: (This is of the devil's doing) by the devil's command. (Lo! he is an enemy, a mere misleaders) whose enmity is quite manifest. And he felt remorse for killing him.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "28:15",
            "2:36",
            "21:82",
            "6:142",
            "28:20",
            "43:62",
            "28:4",
            "15:67",
            "9:120",
            "5:90"
        ],
        "BIBLE": [
            "prophets:joshua:10:24",
            "prophets:i%20samuel:29:6",
            "prophets:joshua:8:14",
            "prophets:i%20kings:17:10",
            "writings:esther:4:11",
            "torah:numbers:13:32",
            "prophets:ii%20kings:1:6",
            "torah:genesis:22:14",
            "torah:genesis:19:5",
            "prophets:judges:16:18"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:5:1"
        ]
    }
}