{
    "VERSE": "28:17",
    "ARABIC": "قَالَ رَبِّ بِمَآ أَنْعَمْتَ عَلَىَّ فَلَنْ أَكُونَ ظَهِيرًا لِّلْمُجْرِمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "He said, 'My Lord, because of Your blessing to me, I will never be a supporter of evildoers.'",
        "TRANSLATION_1": "(Moses) said: \"O Lord, as You have been gracious to me I will never aid the guilty.\"\n",
        "TRANSLATION_2": "Thereupon Moses vowed: \"My Lord, because of the favour that You have done me I shall never support the guilty.\"\n",
        "TRANSLATION_3": "He said, \"Lord, in appreciation for Your favor to me I shall never support the criminals\".\n",
        "TRANSLATION_4": "He said, “My Lord! The way You have bestowed favour upon me, so never will I be a supporter of the guilty.”\n",
        "TRANSLATION_5": "He said: \"My Lord! For that with which You have favored me, I will nevermore be a helper of the criminals!\"\n",
        "TRANSLATION_6": "He said: My Lord! because Thou hast bestowed a favor on me, I shall never be a backer of the guilty.\n",
        "TRANSLATION_7": "He said, 'My Lord, forasmuch as Thou hast blessed me, I will never be a partisan of the sinners.'\n",
        "TRANSLATION_8": "He said: My Lord! Forasmuch as Thou hast favoured me, I will nevermore be a supporter of the guilty.\n",
        "TRANSLATION_9": "He said, \"My Lord, because of the favour that You have shown me, I vow that I will never be a helper of the guilty.\"\n",
        "TRANSLATION_10": "He said: my Lord! whereas Thou hast favoured me, I shall nevermore be a supporter of the culprits.\n",
        "TRANSLATION_11": "He said, ‘My Lord! As You have blessed me, I will never be a supporter of the guilty.’\n",
        "TRANSLATION_12": "He said: \"O my Lord! For that Thou hast bestowed Thy Grace on me, never shall I be a help to those who sin!\"\n",
        "TRANSLATION_13": "He said: \"My Lord! For that with which You have favoured me, I will never more be a helper for the Mujrimun (criminals, disobedient to Allah, polytheists, sinners, etc.)!\"\n",
        "TRANSLATION_14": "He said: 'My Lord as You have favored me, I will never be a helper to the wrongdoer'\n",
        "TRANSLATION_15": "He said, “My Lord, in as much as you have favored me, I will never be a supporter of the criminals.”\n",
        "TRANSLATION_16": "He said, \"My Lord, for the favor You bestowed upon me, I will never be an assistant to the criminals.\"\n",
        "TRANSLATION_17": "[28:17]   He said, ‘My Lord, forasmuch as You have been gracious to me, with forgiveness, protect me [so], I will never be a partisan, a supporter, of the criminals’, the disbelievers henceforth, if you were to protect me.\n",
        "TRANSLATION_18": "(He said: My Lord! Forasmuch as Thou hast favoured me) with knowledge and the profession of Your divine Oneness and forgiveness, (I will nevermore be a supporter of the guilty) do not make me a helper to the idolaters: Pharaoh and his host.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "28:17",
            "36:27",
            "37:100",
            "23:26",
            "23:39",
            "28:86",
            "108:2",
            "36:25",
            "99:5",
            "3:53"
        ],
        "BIBLE": [
            "writings:psalms:41:5",
            "writings:i%20chronicles:29:10",
            "torah:exodus:33:17",
            "prophets:ezekiel:35:10",
            "torah:deuteronomy:33:23",
            "writings:psalms:25:4",
            "torah:numbers:11:11",
            "prophets:i%20kings:9:3",
            "torah:exodus:33:12",
            "writings:ruth:3:10"
        ]
    }
}