{
    "VERSE": "28:20",
    "ARABIC": "وَجَآءَ رَجُلٌ مِّنْ أَقْصَا ٱلْمَدِينَةِ يَسْعَىٰ قَالَ يَٰمُوسَىٰٓ إِنَّ ٱلْمَلَأَ يَأْتَمِرُونَ بِكَ لِيَقْتُلُوكَ فَٱخْرُجْ إِنِّى لَكَ مِنَ ٱلنَّٰصِحِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "A man came running from the furthest part of the city, saying, 'Musa, the Council are conspiring to kill you, so leave! I am someone who brings you good advice.'",
        "TRANSLATION_1": "There came a man running from the other part of the city. \"O Moses,\" he said, \"the chiefs are deliberating to kill you. Go away from the city. I wish you well.\"\n",
        "TRANSLATION_2": "Then a man came running from the farther end of the city and said: \"O Moses, the nobles are deliberating about you that they may put you to death. So do be gone. I am one of your well-wishers.\"\n",
        "TRANSLATION_3": "A man came running from the farthest part of the city saying, \"Moses, people are planning to kill you. I sincerely advise you to leave the city.\n",
        "TRANSLATION_4": "And a man came running from the outer part of the city; he said, “O Moosa! Indeed the court members are considering killing you, therefore go away – I surely am your well-wisher.”\n",
        "TRANSLATION_5": "And there came a man running, from the farthest end of the city. He said: \"O Musa! Verily, the chiefs are taking counsel together about you, to kill you, so escape. Truly, I am one of the good advisers to you.\"\n",
        "TRANSLATION_6": "And a man came running from the remotest part of the city. He said: O Musa! surely the chiefs are consulting together to slay you, therefore depart (at once); surely I am of those who wish well to you.\n",
        "TRANSLATION_7": "Then came a man from the furthest part of the city, running; he said, 'Moses, the Council are conspiring to slay thee. Depart; I am one of thy sincere advisers.'\n",
        "TRANSLATION_8": "And a man came from the uttermost part of the city, running. He said: O Moses! Lo! the chiefs take counsel against thee to slay thee; therefor escape. Lo! I am of those who give thee good advice.\n",
        "TRANSLATION_9": "A man came running from the far side of the city, and said, \"Moses, the authorities are conspiring to kill you, so leave the city. I am one of your well-wishers.\"\n",
        "TRANSLATION_10": "And there came a man from the farthest part of the city, running; he said: O Musa! the chiefs are taking counsel together concerning thee, that they might slay thee; wherefore go forth thou, verily I am unto thee of the admonishers.\n",
        "TRANSLATION_11": "There came a man from the city outskirts, hurrying. He said, ‘Moses! The elite are indeed conspiring to kill you. So leave. I am indeed your well-wisher.’\n",
        "TRANSLATION_12": "And there came a man, running, from the furthest end of the City. He said: \"O Moses! the Chiefs are taking counsel together about thee, to slay thee: so get thee away, for I do give thee sincere advice.\"\n",
        "TRANSLATION_13": "And there came a man running, from the farthest end of the city. He said: \"O Musa (Moses)! Verily, the chiefs are taking counsel together about you, to kill you, so escape. Truly, I am to you of those who give sincere advice.\"\n",
        "TRANSLATION_14": "Then a man came running from the furthest part of the city, 'Moses' he said, 'the Assembly are plotting to kill you. Leave, for I am one of your sincere advisers'\n",
        "TRANSLATION_15": "And a man came from the farthest part of the city running. He said, “O Moses, the authorities are considering killing you, so leave; I am giving you good advice.”\n",
        "TRANSLATION_16": "And a man came from the farthest end of the city, running. He said, \"O Moses, indeed the eminent ones are conferring over you [intending] to kill you, so leave [the city]; indeed, I am to you of the sincere advisors.\"\n",
        "TRANSLATION_17": "[28:20] And a man, who was the [only] believer among Pharaoh’s kinsfolk, came from the outskirts of the city, hastening, walking fast, via a route quicker than theirs. He said, ‘O Moses, lo! the council, of Pharaoh’s folk, are conspiring, discussing [the means], to slay you. So leave, the city. Truly I am speaking to you in good faith’, in bidding you to leave.\n",
        "TRANSLATION_18": "(And a man) Ezekiel (came from the uttermost part) and it is said from the centre (of the city, running. He said: Moses! Lo! the chiefs) the family of the man killed (take counsel against thee) they agreed (to slay thee; therefore escape) from the city. (Lo! I am of those who give thee good advice) I am of those who feel pity for you.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "28:20",
            "36:20",
            "7:144",
            "28:38",
            "19:5",
            "28:18",
            "28:31",
            "28:25",
            "23:46",
            "28:15"
        ],
        "BIBLE": [
            "writings:job:1:21",
            "prophets:judges:14:19",
            "prophets:i%20kings:2:39",
            "writings:ruth:2:18",
            "prophets:ii%20kings:10:15",
            "prophets:judges:14:9",
            "prophets:ii%20kings:2:9",
            "prophets:i%20kings:11:18",
            "prophets:ii%20kings:8:9",
            "prophets:ezekiel:18:13"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:6:4"
        ]
    }
}