{
    "VERSE": "28:21",
    "ARABIC": "فَخَرَجَ مِنْهَا خَآئِفًا يَتَرَقَّبُ قَالَ رَبِّ نَجِّنِى مِنَ ٱلْقَوْمِ ٱلظَّٰلِمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "So he left there fearful and on his guard, saying, 'My Lord, rescue me from the people of the wrongdoers!'",
        "TRANSLATION_1": "So he left the city, fearful and hesitant, (and) prayed: \"O Lord, deliver me from these wicked people.\"\n",
        "TRANSLATION_2": "Soon after hearing this Moses departed in a state of fear, looking around as one in apprehension and prayed: \"My Lord, deliver me from these unjust people.\"\n",
        "TRANSLATION_3": "So he left the city afraid and cautious, saying, \"Lord, protect me against the unjust people\".\n",
        "TRANSLATION_4": "So he left the city in fear, waiting to see what happens; he said, “My Lord! Rescue me from the unjust people.”\n",
        "TRANSLATION_5": "So he escaped from there, looking about in a state of fear. He said: \"My Lord! Save me from the people who are wrongdoers!\"\n",
        "TRANSLATION_6": "So he went forth therefrom, fearing, awaiting, (and) he said: My Lord! deliver me from the unjust people.\n",
        "TRANSLATION_7": "So he departed therefrom, fearful and vigilant; he said, 'My Lord, deliver me from the people of the evildoers.'\n",
        "TRANSLATION_8": "So he escaped from thence, fearing, vigilant. He said: My Lord! Deliver me from the wrongdoing folk.\n",
        "TRANSLATION_9": "So Moses departed from the city, fearful and vigilant, and prayed, \"My Lord, save me from these unjust people.\"\n",
        "TRANSLATION_10": "So he went forth from thence fearing, looking abcut. He said: my Lord! deliver me from the wrong-doing people.\n",
        "TRANSLATION_11": "So he left the city, fearful and vigilant. He said, ‘My Lord! Deliver me from the wrongdoing lot.’\n",
        "TRANSLATION_12": "He therefore got away therefrom, looking about, in a state of fear. He prayed \"O my Lord! save me from people given to wrong-doing.\"\n",
        "TRANSLATION_13": "So he escaped from there, looking about in a state of fear. He said: \"My Lord! Save me from the people who are Zalimun (polytheists and wrong-doers)!\"\n",
        "TRANSLATION_14": "So he left, fearful and vigilant, saying: 'My Lord, save me from the harmdoing nation'\n",
        "TRANSLATION_15": "So he left, fearful and vigilant. He said, “My Lord, deliver me from the wrongdoing people.”\n",
        "TRANSLATION_16": "So he left it, fearful and anticipating [apprehension]. He said, \"My Lord, save me from the wrongdoing people.\"\n",
        "TRANSLATION_17": "[28:21] So he departed from it, fearful, vigilant, lest any of the pursuers catch up with him, or [in the hope] that God might rescue him. He said, ‘My Lord, deliver me from the evildoing people’, Pharaoh’s people.\n",
        "TRANSLATION_18": "(So he escaped from thence) from the city, (fearing, vigilant) waiting and looking behind him expecting to be hunted down and arrested. (He said) at this point: (My Lord! Deliver me from the wrong-doing folk) the people of Egypt.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "28:21",
            "23:94",
            "29:30",
            "26:117",
            "44:22",
            "37:100",
            "26:10",
            "68:50",
            "6:77",
            "23:106"
        ],
        "BIBLE": [
            "prophets:i%20samuel:14:41",
            "prophets:ezekiel:11:15",
            "torah:exodus:17:2",
            "prophets:i%20kings:21:20",
            "torah:numbers:32:7",
            "prophets:joshua:17:14",
            "writings:ruth:2:18",
            "torah:numbers:20:12",
            "torah:numbers:27:12",
            "torah:deuteronomy:2:9"
        ]
    }
}