{
    "VERSE": "28:24",
    "ARABIC": "فَسَقَىٰ لَهُمَا ثُمَّ تَوَلَّىٰٓ إِلَى ٱلظِّلِّ فَقَالَ رَبِّ إِنِّى لِمَآ أَنزَلْتَ إِلَىَّ مِنْ خَيْرٍ فَقِيرٌ",
    "ENGLISH": {
        "TRANSLATION_0": "So he drew water for them and then withdrew into the shade and said, 'My Lord, I am truly in need of any good You have in store for me.'",
        "TRANSLATION_1": "So he watered (their flock), and moved into the shade and prayed: \"My Lord, I have need of whatever good you send me.\"\n",
        "TRANSLATION_2": "On hearing this Moses watered their flocks for them, and then returned in a shaded place and said: \"My Lord, I am truly in great need of any good that You might send down to me.\"\n",
        "TRANSLATION_3": "Moses watered their flocks and then sought shelter under a shadow praying, \"Lord, I need the means to preserve (the power) that You have granted me.\"\n",
        "TRANSLATION_4": "Therefore Moosa watered their animals for them, and then turned towards the shade and said, “My Lord! I am in need of the sustenance you may send down for me.”\n",
        "TRANSLATION_5": "So he watered (their flocks) for them, then he turned back to shade, and said: \"My Lord! Truly, I am in need of whatever good that You bestow on me!\"\n",
        "TRANSLATION_6": "So he watered (their sheep) for them, then went back to the shade and said: My Lord! surely I stand in need of whatever good Thou mayest send down to me.\n",
        "TRANSLATION_7": "So he drew water for them; then he turned away to the shade, and he said, 'O my Lord, surely I have need of whatever good Thou shalt have sent down upon me.\n",
        "TRANSLATION_8": "So he watered (their flock) for them. Then he turned aside into the shade, and said: My Lord! I am needy of whatever good Thou sendest down for me.\n",
        "TRANSLATION_9": "So Moses watered their flocks for them; and returned into the shade and prayed, \"Lord, I am truly in need of whatever blessing You may send down for me,\"\n",
        "TRANSLATION_10": "Then he watered their flocks for the twain. Then he turned aside into the shade, and said: my Lord! I verily of the good which Thou mayest send down for me I am needy.\n",
        "TRANSLATION_11": "So he watered [their flock] for them. Then he withdrew toward the shade and said, ‘My Lord! I am indeed in need of any good You may send down to me!’\n",
        "TRANSLATION_12": "So he watered (their flocks) for them; then he turned back to the shade, and said:\"O my Lord! truly am I in (desperate) need of any good that Thou dost send me!\"\n",
        "TRANSLATION_13": "So he watered (their flocks) for them, then he turned back to shade, and said: \"My Lord! Truly, I am in need of whatever good that You bestow on me!\"\n",
        "TRANSLATION_14": "So he drew water for them and then retired to the shade, saying: 'O my Lord, surely I have need of whatever good You send me'\n",
        "TRANSLATION_15": "So he drew water for them, and then withdrew to the shade, and said, “My Lord, I am in dire need of whatever good you might send down to me.”\n",
        "TRANSLATION_16": "So he watered [their flocks] for them; then he went back to the shade and said, \"My Lord, indeed I am, for whatever good You would send down to me, in need.\"\n",
        "TRANSLATION_17": "[28:24] So he watered [their flock] for them, from another well nearby, by lifting a rock from on top of it, which only ten men could have lifted; then he retreated to the shade, of an acacia tree (samura), because of the extreme heat of the sun and he was hungry, and said, ‘My Lord, indeed I am in utter need of whatever   good, [whatever] food, You send down to me’. The two women returned to their father quicker than usual and so he asked them why [it was so]. They told him about the man who had watered [their flock] for them. So he said to one of them, ‘Summon him to [come to] me’.\n",
        "TRANSLATION_18": "(So he watered (their flock) for them) and they went back to their father to inform him about Moses. (Then he) Moses (turned aside into the shade) of a tree; and it is said: the shade of a wall; and it is said: the shade of a shelter, (and said) Moses said: (My Lord! I am needy of whatever good) food (Thou sendest down for me) You have decreed for me.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "28:24",
            "23:109",
            "23:118",
            "23:29",
            "34:39",
            "68:32",
            "36:27",
            "68:50",
            "38:32",
            "23:72"
        ],
        "BIBLE": [
            "prophets:i%20samuel:26:25",
            "prophets:joshua:4:18",
            "prophets:i%20samuel:3:9",
            "torah:genesis:32:1",
            "torah:exodus:2:19",
            "prophets:i%20kings:20:39",
            "prophets:ii%20kings:5:11",
            "prophets:ii%20kings:1:6",
            "torah:numbers:22:23",
            "prophets:judges:5:11"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:4:12"
        ]
    }
}