{
    "VERSE": "28:3",
    "ARABIC": "نَتْلُوا۟ عَلَيْكَ مِن نَّبَإِ مُوسَىٰ وَفِرْعَوْنَ بِٱلْحَقِّ لِقَوْمٍ يُؤْمِنُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "We recite to you with truth some news of Musa and Pharaoh for people who have iman.",
        "TRANSLATION_1": "We narrate to you from the history of Moses and Pharaoh in all verity, for those who believe.\n",
        "TRANSLATION_2": "We recount to you with truth some parts of the story of Moses and Pharaoh for the benefit of those who believe.\n",
        "TRANSLATION_3": "We recite to you some of the story of Moses and the Pharaoh for a genuine purpose, and for the benefit of the believing people.\n",
        "TRANSLATION_4": "We shall narrate to you the true tidings of Moosa and Firaun, for the people who have faith.\n",
        "TRANSLATION_5": "We recite to you some of the news of Musa and Fir`awn in truth, for a people who believe.\n",
        "TRANSLATION_6": "We recite to you from the account of Musa and Firon with truth for people who believe.\n",
        "TRANSLATION_7": "We will recite to thee something of the tiding of Moses and Pharaoh truthfully, for a people who believe.\n",
        "TRANSLATION_8": "We narrate unto thee (somewhat) of the story of Moses and Pharaoh with truth, for folk who believe.\n",
        "TRANSLATION_9": "We shall narrate to you some of the story of Moses and Pharaoh, with truth, for people who would believe.\n",
        "TRANSLATION_10": "WE recite unto thee of the story of Musa and Fir'awn with truth fora people who believe.\n",
        "TRANSLATION_11": "We relate to you truly some of the account of Moses and Pharaoh for a people who have faith.\n",
        "TRANSLATION_12": "We rehearse to thee some of the story of Moses and Pharaoh in Truth, for people who believe.\n",
        "TRANSLATION_13": "We recite to you some of the news of Musa (Moses) and Fir'aun (Pharaoh) in truth, for a people who believe (those who believe in this Quran, and in the Oneness of Allah).\n",
        "TRANSLATION_14": "We shall in truth recite to you some of the news of Moses and Pharaoh for a nation who believe.\n",
        "TRANSLATION_15": "We narrate to you from the history of Moses and Pharaoh—in truth—for people who believe.\n",
        "TRANSLATION_16": "We recite to you from the news of Moses and Pharaoh in truth for a people who believe.\n",
        "TRANSLATION_17": "[28:3] We will recount, narrate, to you [something] of the tale of Moses and Pharaoh truthfully, for a people who believe, for their sake, since they are the ones to benefit from such [an account].\n",
        "TRANSLATION_18": "(We narrate unto thee (somewhat) of the story of Moses and Pharaoh with truth) through the Qur'an, (for folk who believe) in you and in the Qur'an.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "28:3",
            "7:159",
            "26:69",
            "6:5",
            "10:86",
            "21:55",
            "37:112",
            "18:13",
            "6:66",
            "5:84"
        ],
        "BIBLE": [
            "prophets:jeremiah:6:22",
            "prophets:jeremiah:50:41",
            "prophets:joshua:1:17",
            "prophets:jeremiah:10:7",
            "torah:genesis:47:24",
            "prophets:ezekiel:31:18",
            "writings:psalms:63:10",
            "torah:exodus:8:5",
            "writings:ecclesiastes:7:27",
            "prophets:jeremiah:5:29"
        ]
    }
}