{
    "VERSE": "28:33",
    "ARABIC": "قَالَ رَبِّ إِنِّى قَتَلْتُ مِنْهُمْ نَفْسًا فَأَخَافُ أَن يَقْتُلُونِ",
    "ENGLISH": {
        "TRANSLATION_0": "He said, 'My Lord, I killed one of them and I am afraid they will kill me;",
        "TRANSLATION_1": "He said: \"O Lord, I have killed a man of theirs, and fear they would kill me.\n",
        "TRANSLATION_2": "Moses said: \"My Lord, I have killed one person from among them, and I fear that they will kill me.\n",
        "TRANSLATION_3": "(Moses) said, \"Lord, I have killed a man from their people and I am afraid that they will kill me.\n",
        "TRANSLATION_4": "He submitted, “My Lord! I killed a soul among them and I fear they will kill me.”\n",
        "TRANSLATION_5": "He said: \"My Lord! I have killed a man among them, and I fear that they will kill me.\"\n",
        "TRANSLATION_6": "He said: My Lord! surely I killed one of them, so I fear lest they should slay me;\n",
        "TRANSLATION_7": "Said he, 'My Lord, I have indeed slain a living soul among them, and I fear that they will slay me.\n",
        "TRANSLATION_8": "He said: My Lord! Lo! I killed a man among them and I fear that they will kill me.\n",
        "TRANSLATION_9": "Moses said, \"My Lord, I have killed one of their people and fear that they may kill me.\n",
        "TRANSLATION_10": "He said: My Lord! verily I have slain a man among them and I fear they shall slay me.\n",
        "TRANSLATION_11": "He said, ‘My Lord! Indeed, I have killed one of their men, so I fear they will kill me.\n",
        "TRANSLATION_12": "He said: \"O my Lord! I have slain a man among them, and I fear lest they slay me.\n",
        "TRANSLATION_13": "He said: \"My Lord! I have killed a man among them, and I fear that they will kill me.\n",
        "TRANSLATION_14": "My Lord' (said Moses), 'I have killed a living soul among them, and fear that they will slay me.\n",
        "TRANSLATION_15": "He said, “My Lord, I have killed one of them, and I fear they will kill me.\n",
        "TRANSLATION_16": "He said, \"My Lord, indeed, I killed from among them someone, and I fear they will kill me.\n",
        "TRANSLATION_17": "[28:33] He said, ‘My Lord, I have indeed slain a soul among them — the mentioned Egyptian — and so I fear that they will slay me, because of him.\n",
        "TRANSLATION_18": "(He said) Moses said: (My Lord! Lo! I killed a man among them and I fear that they will kill me) in retaliation.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "28:33",
            "26:12",
            "44:20",
            "23:98",
            "20:45",
            "21:64",
            "7:23",
            "7:125",
            "37:99",
            "26:3"
        ],
        "BIBLE": [
            "torah:numbers:14:15",
            "prophets:i%20samuel:17:27",
            "torah:genesis:26:7",
            "prophets:ii%20samuel:16:18",
            "prophets:judges:6:16",
            "torah:numbers:17:6",
            "prophets:ii%20samuel:21:4",
            "prophets:jeremiah:4:10",
            "writings:psalms:41:5",
            "torah:exodus:2:14"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:2",
            "Sefer%20Yetzirah:3:5",
            "Sefer%20Yetzirah:3:7",
            "Sefer%20Yetzirah:3:6",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:4:8",
            "Sefer%20Yetzirah:4:4"
        ]
    }
}