{
    "VERSE": "28:39",
    "ARABIC": "وَٱسْتَكْبَرَ هُوَ وَجُنُودُهُۥ فِى ٱلْأَرْضِ بِغَيْرِ ٱلْحَقِّ وَظَنُّوٓا۟ أَنَّهُمْ إِلَيْنَا لَا يُرْجَعُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "He and his troops were arrogant in the land without any right. They thought that they would not return to Us.",
        "TRANSLATION_1": "He and his soldiers had become arrogant in the land for no reason, and did not think that they have to come back to Us in the end.\n",
        "TRANSLATION_2": "And he and his hosts waxed arrogant in the land without any right, believing that they will never have to return to Us!\n",
        "TRANSLATION_3": "The Pharaoh and his army were puffed-up with pride in the land for no true cause. They thought that they would never return to Us.\n",
        "TRANSLATION_4": "And he and his soldiers wrongfully sought greatness in the land, and assumed they would never be brought back to Us.\n",
        "TRANSLATION_5": "And he and his armies were arrogant in the land, without right, and they thought that they would never return to Us.\n",
        "TRANSLATION_6": "And he was unjustly proud in the land, he and his hosts, and they deemed that they would not be brought back to Us.\n",
        "TRANSLATION_7": "And he waxed proud in the land, he and his hosts, wrongfully; and they thought they should not be returned to Us.\n",
        "TRANSLATION_8": "And he and his hosts were haughty in the land without right, and deemed that they would never be brought back to Us.\n",
        "TRANSLATION_9": "He and his hosts behaved arrogantly in the land without any justification, thinking that they would not be recalled to Us,\n",
        "TRANSLATION_10": "And he and his hosts were stiff-necked in the land without right, and imagined that before Us they would not be brought back.\n",
        "TRANSLATION_11": "He and his hosts unduly acted arrogantly in the land, and thought they would not be brought back to Us.\n",
        "TRANSLATION_12": "And he was arrogant and insolent in the land, beyond reason,- He and his hosts: they thought that they would not have to return to Us!\n",
        "TRANSLATION_13": "And he and his hosts were arrogant in the land, without right, and they thought that they would never return to Us.\n",
        "TRANSLATION_14": "He and his hosts became wrongfully proud in the land and they thought that they would never be returned to Us.\n",
        "TRANSLATION_15": "He and his troops acted arrogantly in the land, with no justification. They thought they would not be returned to Us.\n",
        "TRANSLATION_16": "And he was arrogant, he and his soldiers, in the land, without right, and they thought that they would not be returned to Us.\n",
        "TRANSLATION_17": "[28:39] And he and his hosts acted arrogantly in the land, the land of Egypt, without right, and thought they would not return to Us (read active yarji‘ūna, or passive yurja‘ūna, ‘they would [not] be brought back’).\n",
        "TRANSLATION_18": "440 (And he and his hosts) the Copts (were haughty) too proud to accept faith (in the land) of Egypt (without right) to do so, (and deemed that they would never be brought back to Us) in the Hereafter.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "28:39",
            "40:75",
            "7:146",
            "28:6",
            "26:152",
            "41:15",
            "16:3",
            "42:42",
            "23:79",
            "19:40"
        ],
        "BIBLE": [
            "prophets:jeremiah:42:12",
            "prophets:zechariah:8:3",
            "writings:daniel:4:33",
            "prophets:jeremiah:33:11",
            "prophets:hosea:7:10",
            "torah:genesis:21:32",
            "prophets:ezekiel:46:9",
            "prophets:jeremiah:29:8",
            "torah:exodus:13:17",
            "prophets:jeremiah:23:20"
        ]
    }
}