{
    "VERSE": "28:41",
    "ARABIC": "وَجَعَلْنَٰهُمْ أَئِمَّةً يَدْعُونَ إِلَى ٱلنَّارِ وَيَوْمَ ٱلْقِيَٰمَةِ لَا يُنصَرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "We made them leaders, summoning to the Fire, and on the Day of Rising they will not be helped.",
        "TRANSLATION_1": "We made them the leaders of those who call to Hell; and on the Day of Judgement they will not be helped.\n",
        "TRANSLATION_2": "And We made them leaders who invite people to the Fire. On the Day of Judgement they shall not find help from any quarter.\n",
        "TRANSLATION_3": "We made them the kinds of leaders who would invite people to the fire and who would receive no help on the Day of Judgment.\n",
        "TRANSLATION_4": "And We made them leaders of the people of hell, inviting towards the fire; and they will not be helped on the Day of Resurrection.\n",
        "TRANSLATION_5": "And We made them leaders inviting to the Fire: and on the Day of Resurrection, they will not be helped.\n",
        "TRANSLATION_6": "And We made them Imams who call to the fire, and on the day of resurrection they shall not be assisted.\n",
        "TRANSLATION_7": "And We appointed them leaders, calling to the Fire; and on the Day of Resurrection they shall not be helped;\n",
        "TRANSLATION_8": "And We made them patterns that invite unto the Fire, and on the Day of Resurrection they will not be helped.\n",
        "TRANSLATION_9": "We had made them leaders, but they called people to the Fire; and on the Day of Judgement they will not be helped.\n",
        "TRANSLATION_10": "And We made them leaders calling to the Fire, and on the Day of Resurrection they shall not be succoured.\n",
        "TRANSLATION_11": "We made them leaders who invite to the Fire, and on the Day of Resurrection they will not receive any help.\n",
        "TRANSLATION_12": "And we made them (but) leaders inviting to the Fire; and on the Day of Judgment no help shall they find.\n",
        "TRANSLATION_13": "And We made them leaders inviting to the Fire, and on the Day of Resurrection, they will not be helped.\n",
        "TRANSLATION_14": "We made them leaders inviting to the Fire, and on the Day of Resurrection they shall not be victors.\n",
        "TRANSLATION_15": "And We made them leaders calling to the Fire. And on Resurrection Day, they will not be saved.\n",
        "TRANSLATION_16": "And We made them leaders inviting to the Fire, and on the Day of Resurrection they will not be helped.\n",
        "TRANSLATION_17": "[28:41] And We made them, in this world, leaders (read a-imma, pronouncing both hamzas, or by changing the second one into a yā’), chieftains of idolatry, who invite to the Fire, by inviting to idolatry, and on the Day of Resurrection they will not be helped, by having the chastisement averted from them.\n",
        "TRANSLATION_18": "(And We made them patterns) We forsook them (that invite unto) they were leaders to disbelief and error to (the Fire) to disbelief, idolatry and the worship of idols, (and on the Day of Resurrection they will not be helped) they will not be saved from the Fire.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "28:41",
            "11:98",
            "51:13",
            "52:13",
            "75:1",
            "45:34",
            "41:19",
            "28:42",
            "26:87",
            "41:40"
        ],
        "BIBLE": [
            "torah:genesis:1:8",
            "prophets:jeremiah:23:6",
            "torah:genesis:49:1",
            "prophets:jeremiah:33:16",
            "prophets:jeremiah:14:9",
            "prophets:isaiah:4:1",
            "writings:esther:4:11",
            "prophets:i%20samuel:12:18",
            "prophets:isaiah:47:15",
            "writings:esther:3:12"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:1:12",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:3"
        ]
    }
}