{
    "VERSE": "28:46",
    "ARABIC": "وَمَا كُنتَ بِجَانِبِ ٱلطُّورِ إِذْ نَادَيْنَا وَلَٰكِن رَّحْمَةً مِّن رَّبِّكَ لِتُنذِرَ قَوْمًا مَّآ أَتَىٰهُم مِّن نَّذِيرٍ مِّن قَبْلِكَ لَعَلَّهُمْ يَتَذَكَّرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Nor were you on the side of the Mount when We called, yet it is a mercy from your Lord so that you can warn a people to whom no warner came before, so that hopefully they will pay heed.",
        "TRANSLATION_1": "You were not present on the side of Mount Sinai when We called. And all this (knowledge that you are given) is by the grace of your Lord so that you may warn a people to whom no admonisher had come before you, that they may take heed;\n",
        "TRANSLATION_2": "Nor were you on the side of the Mount (Sinai) when We called out to Moses (in the first instance). But it is out of Mercy from your Lord (that you are being informed of all this) so that you may warn a people to whom no warner came before you. Maybe they will take heed.\n",
        "TRANSLATION_3": "You had not been present at the side of the Mount (Sinai) when We called Moses (from the tree), but through Our mercy we told you his story so that you might warn the people\n",
        "TRANSLATION_4": "And nor were you beside the Mount when We proclaimed – however it is a mercy from your Lord* so that you may warn a nation towards whom no Herald of Warning came before you, in the hope of their heeding advice. (*That He has bestowed knowledge of the hidden to you)\n",
        "TRANSLATION_5": "And you were not at the side of At-Tur when We called. But (you are sent) as a mercy from your Lord, to give warning to a people to whom no warner had come before you, in order that they may remember or receive admonition.\n",
        "TRANSLATION_6": "And you were not on this side of the mountain when We called, but a mercy from your Lord that you may warn a people to whom no warner came before you, that they may be mindful.\n",
        "TRANSLATION_7": "Thou wast not upon the side of the Mount when We called; but for a mercy from thy Lord, that thou mayest warn a people to whom no warner came before thee, and that haply they may remember.\n",
        "TRANSLATION_8": "And thou was not beside the Mount when We did call; but (the knowledge of it is) a mercy from thy Lord that thou mayst warn a folk unto whom no warner came before thee, that haply they may give heed.\n",
        "TRANSLATION_9": "you were not on the side of the Mount when We called out to Moses, but We have sent you as a mercy from your Lord, so that you may warn people to whom no warner has been sent before you, so that they may take heed,\n",
        "TRANSLATION_10": "Nor wast thou beside the Tur when We called; but thou art sent as a mercy from thy Lord, that thou mayest warn a people unto whom no warner came before thee, that haply they might be admonished.\n",
        "TRANSLATION_11": "And you were not on the side of the Mount when We called out [to Moses], but [We have sent you as] a mercy from your Lord that you may warn a people to whom there did not come any warner before you, so that they may take admonition.\n",
        "TRANSLATION_12": "Nor wast thou at the side of (the Mountain of) Tur when we called (to Moses). Yet (art thou sent) as Mercy from thy Lord, to give warning to a people to whom no warner had come before thee: in order that they may receive admonition.\n",
        "TRANSLATION_13": "And you (O Muhammad SAW) were not at the side of the Tur (Mount) when We did call, [it is said that Allah called the followers of Muhammad SAW, and they answered His Call, or that Allah called Musa (Moses)]. But (you are sent) as a mercy from your Lord, to give warning to a people to whom no warner had come before you, in order that they may remember or receive admonition. [Tafsir At-Tabari, Vol. 20, Page 81].\n",
        "TRANSLATION_14": "You were not present on the side of the Tor when We called. Yet as a mercy from your Lord to warn a nation to whom no warner has been sent before, in order that they remember\n",
        "TRANSLATION_15": "Nor were you by the side of the Mount when We proclaimed. Rather, it was a mercy from your Lord, that you may warn people who received no warner before you, so that they may take heed.\n",
        "TRANSLATION_16": "And you were not at the side of the mount when We called [Moses] but [were sent] as a mercy from your Lord to warn a people to whom no warner had come before you that they might be reminded.\n",
        "TRANSLATION_17": "[28:46] And you were not on the side of the Mount when We called out, to Moses to take the Scripture earnestly; but, We have sent you, as a mercy from your Lord, that you may warn a people to whom no warner came before you — these are the people of Mecca — and that perhaps they may remember, they may be admonished.\n",
        "TRANSLATION_18": "(And thou wast not beside the Mount) of Zubayr (when We did call) Moses; and it is also said this means: when We called your nation; (but) We taught you and sent you as (a mercy) a blessing and a favour (from thy Lord) for He sent Gabriel to you with the Qur'an containing the events of the people of old (that thou mayst warn) by means of the Qur'an (a folk unto whom no warner came before thee) no warning messenger came to the people of Quraysh before, (that haply they may give heed) that haply they may take admonition and, hence, believe.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "28:46",
            "32:3",
            "10:86",
            "28:53",
            "34:44",
            "20:90",
            "26:10",
            "38:16",
            "51:46",
            "10:13"
        ],
        "BIBLE": [
            "prophets:i%20kings:21:20",
            "prophets:i%20kings:9:13",
            "prophets:isaiah:65:1",
            "prophets:judges:15:18",
            "prophets:i%20kings:18:26",
            "prophets:jeremiah:14:9",
            "torah:genesis:29:33",
            "torah:genesis:30:6",
            "torah:genesis:38:18",
            "prophets:ii%20samuel:9:9"
        ]
    }
}