{
    "VERSE": "28:51",
    "ARABIC": "وَلَقَدْ وَصَّلْنَا لَهُمُ ٱلْقَوْلَ لَعَلَّهُمْ يَتَذَكَّرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "We have conveyed the Word to them so that hopefully they will pay heed.",
        "TRANSLATION_1": "We have been sending word to them that they may take a warning.\n",
        "TRANSLATION_2": "We have constantly conveyed them the word (of admonition) that they may take heed.\n",
        "TRANSLATION_3": "We sent Our guidance to them so that perhaps they might take heed.\n",
        "TRANSLATION_4": "And We indeed sent down the Word continuously for them, so that they may ponder.\n",
        "TRANSLATION_5": "And indeed now We have conveyed the Word to them, in order that they may remember.\n",
        "TRANSLATION_6": "And certainly We have made the word to reach them so that they may be mindful.\n",
        "TRANSLATION_7": "Now We have brought them the Word; haply they may remember.\n",
        "TRANSLATION_8": "And now verily We have caused the Word to reach them, that haply they may give heed.\n",
        "TRANSLATION_9": "We have conveyed Our Word to them, in succession, so that they may give heed.\n",
        "TRANSLATION_10": "And assuredly We have caused the Word to reach them in succession, that haply they may be admonished.\n",
        "TRANSLATION_11": "Certainly We have carried on this discourse for them so that they may take admonition.\n",
        "TRANSLATION_12": "Now have We caused the Word to reach them themselves, in order that they may receive admonition.\n",
        "TRANSLATION_13": "And indeed now We have conveyed the Word (this Quran in which is the news of everything to them), in order that they may remember (or receive admonition).\n",
        "TRANSLATION_14": "We have brought them the Word in order that they remember.\n",
        "TRANSLATION_15": "We have delivered the Word to them, that they may remember.\n",
        "TRANSLATION_16": "And We have [repeatedly] conveyed to them the Qur'an that they might be reminded.\n",
        "TRANSLATION_17": "[28:51] And now verily We have brought, We have explained [to], them the Word, the Qur’ān, that perhaps they might remember, [they might] be admonished and believe.\n",
        "TRANSLATION_18": "(And now verily We have caused the Word to reach them) We explained to them the Qur'an and its message of divine Oneness, (that haply they may give heed) so that they may take admonition from the Qur'an and believe in it.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "28:51",
            "15:9",
            "15:24",
            "37:72",
            "15:23",
            "37:75",
            "23:49",
            "37:165",
            "37:166",
            "26:55"
        ],
        "BIBLE": [
            "writings:ii%20chronicles:34:16",
            "writings:job:4:12",
            "prophets:hosea:10:6",
            "prophets:jeremiah:27:22",
            "writings:ii%20chronicles:28:5",
            "prophets:amos:1:6",
            "prophets:jeremiah:29:1",
            "writings:job:5:13",
            "prophets:isaiah:46:4",
            "writings:job:10:19"
        ],
        "KABBALAH": [
            
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:3"
        ]
    }
}