{
    "VERSE": "28:52",
    "ARABIC": "ٱلَّذِينَ ءَاتَيْنَٰهُمُ ٱلْكِتَٰبَ مِن قَبْلِهِۦ هُم بِهِۦ يُؤْمِنُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Those We gave the Book before this have iman in it.",
        "TRANSLATION_1": "Those to whom We gave the Book before this do believe in it;\n",
        "TRANSLATION_2": "Those on whom We bestowed the Book before do believe in this (to wit, the Qur'an).\n",
        "TRANSLATION_3": "(Some of) the followers of the Bible believe in the Quran.\n",
        "TRANSLATION_4": "Those to whom We gave the Book before it, accept faith in it. (Some scholars among Jews / Christians).\n",
        "TRANSLATION_5": "Those to whom We gave the Scripture before it, they believe in it.\n",
        "TRANSLATION_6": "(As to) those whom We gave the Book before it, they are believers in it.\n",
        "TRANSLATION_7": "Those to whom We gave the Book before this believe in it\n",
        "TRANSLATION_8": "Those unto whom We gave the Scripture before it, they believe in it,\n",
        "TRANSLATION_9": "Those to whom We gave the Book before this believe in it [the Quran],\n",
        "TRANSLATION_10": "Those unto whom We vouchsafed the Book before it, --they believe therein.\n",
        "TRANSLATION_11": "Those to whom We gave the Book before it are the ones who believe in it,\n",
        "TRANSLATION_12": "Those to whom We sent the Book before this,- they do believe in this (revelation):\n",
        "TRANSLATION_13": "Those to whom We gave the Scripture [i.e. the Taurat (Torah) and the Injeel (Gospel), etc.] before it, - they believe in it (the Quran).\n",
        "TRANSLATION_14": "Those to whom We gave the Book before, believe in it.\n",
        "TRANSLATION_15": "Those to whom We gave the Scripture before it believe in it.\n",
        "TRANSLATION_16": "Those to whom We gave the Scripture before it - they are believers in it.\n",
        "TRANSLATION_17": "[28:52] Those to whom We gave the Scripture before this, that is, [before] the Qur’ān, they believe in it, too. This was revealed regarding certain Jews who became Muslims, such as ‘Abd Allāh b. Salām and others, and   [certain] Christians who had come from Abyssinia and Syria [who also became Muslims].\n",
        "TRANSLATION_18": "(Those unto whom We gave the Scripture) the knowledge of the Scripture (before it) before the advent of Muhammad, Allah bless him and give peace, i.e. 'Abdullah Ibn Salam and his followers who were about 40 men, some of whom came from Historic Syria and others from Yemen, (they believe in it) they believe in Muhammad (pbuh) and in the Qur'an,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "28:52",
            "43:21",
            "29:48",
            "35:25",
            "34:44",
            "2:121",
            "40:70",
            "69:9",
            "10:94",
            "2:89"
        ],
        "BIBLE": [
            "writings:psalms:106:15",
            "writings:nehemiah:8:8",
            "torah:genesis:46:25",
            "prophets:joshua:21:43",
            "torah:genesis:25:5",
            "torah:deuteronomy:3:15",
            "prophets:jeremiah:24:10",
            "prophets:i%20samuel:22:10",
            "torah:numbers:32:40",
            "prophets:joshua:14:13"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:4:4",
            
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:1:3"
        ]
    }
}