{
    "VERSE": "28:57",
    "ARABIC": "وَقَالُوٓا۟ إِن نَّتَّبِعِ ٱلْهُدَىٰ مَعَكَ نُتَخَطَّفْ مِنْ أَرْضِنَآ أَوَلَمْ نُمَكِّن لَّهُمْ حَرَمًا ءَامِنًا يُجْبَىٰٓ إِلَيْهِ ثَمَرَٰتُ كُلِّ شَىْءٍ رِّزْقًا مِّن لَّدُنَّا وَلَٰكِنَّ أَكْثَرَهُمْ لَا يَعْلَمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "They say, 'If we follow the guidance with you, we shall be forcibly uprooted from our land.' Have We not established a safe haven for them to which produce of every kind is brought, provision direct from Us? But",
        "TRANSLATION_1": "They say: \"If we followed your guidance we would be driven from the land by force.\" Have We not set up a sanctuary for them, to which is brought a wealth of everything as provision from Us? But most of them do not understand.\n",
        "TRANSLATION_2": "They say: \"If we were to follow this guidance with you, we should be snatched away from our land.\" Have We not established for them a secure sanctuary to which fruits of all kinds are brought as a provision from Us? But most of them do not know.\n",
        "TRANSLATION_3": "They, (the pagans), say, \"If we were to follow your guidance we would be snatched away from our land. Have We not given them the secure, holy precinct wherein all types of fruits are brought to them as a sustenance from Us? However, many of them do not know it.\n",
        "TRANSLATION_4": "And they say, “If we follow the guidance along with you, people would snatch us away from our land”; did We not establish them in a safe Sacred Land, towards which are brought fruits of all kinds – the sustenance from Us? But most of them do not know.\n",
        "TRANSLATION_5": "And they say: \"If we follow the guidance with you, we would be snatched away from our land.\" Have We not established for them a secure sanctuary, to which are brought fruits of all kinds, a provision from Ourselves, but most of them know not.\n",
        "TRANSLATION_6": "And they say: If we follow the guidance with you, we shall be carried off from our country. What! have We not settled them in a safe, sacred territory to which fruits of every kind shall be drawn?-- a sustenance from Us; but most of them do not know.\n",
        "TRANSLATION_7": "They say, 'Should we follow the guidance with thee, we shall be snatched from our land.' Have We not established for them a sanctuary secure, to which are collected the fruits of everything, as a provision from Us? But most of them know not.\n",
        "TRANSLATION_8": "And they say: If we were to follow the Guidance with thee we should be torn out of our land. Have We not established for them a sure sanctuary, whereunto the produce of all things is brought (in trade), a provision from Our presence? But most of them know not.\n",
        "TRANSLATION_9": "They say, \"If we were to follow your guidance, we should be uprooted from our land.\" But have We not established for them a safe haven to which fruits of every kind are brought as a provision from Ourself? But most of them have no knowledge.\n",
        "TRANSLATION_10": "And they say: were we to follow the guidance with thee, We Shall be snatched away from our land. Have We not established for them an inviolable sanctuary whereunto fruits of every sort are brought: a provision from Our presence? But most of them know not.\n",
        "TRANSLATION_11": "They say, ‘If we follow the guidance with you, we will be forced out of our territory.’ Did We not establish a secure sanctuary for them where fruits of all kinds are brought as a provision from Us? But most of them do not know.\n",
        "TRANSLATION_12": "They say: \"If we were to follow the guidance with thee, we should be snatched away from our land.\" Have We not established for them a secure sanctuary, to which are brought as tribute fruits of all kinds,- a provision from Ourselves? but most of them understand not.\n",
        "TRANSLATION_13": "And they say: \"If we follow the guidance with you, we would be snatched away from our land.\" Have We not established for them a secure sanctuary (Makkah), to which are brought fruits of all kinds, a provision from Ourselves, but most of them know not.\n",
        "TRANSLATION_14": "They say: 'If we follow the guidance with you, we shall be driven from our land' But have We not given them a secure sanctuary from which fruits of every kind are collected as a provision from Us? Indeed, most of them do not know.\n",
        "TRANSLATION_15": "And they say, “If we follow the guidance with you, we will be snatched from our land.” Did We not establish for them a Safe Sanctuary, to which are brought all kinds of fruits, as provision from Ourselves? But most of them do not know.\n",
        "TRANSLATION_16": "And they say, \"If we were to follow the guidance with you, we would be swept from our land.\" Have we not established for them a safe sanctuary to which are brought the fruits of all things as provision from Us? But most of them do not know.\n",
        "TRANSLATION_17": "[28:57] And they, his people, say, ‘If we were to follow the Guidance with you, we will be deprived from our land’, torn out of it swiftly. God, exalted be He, says: Have We not established for them a secure Sanctuary, [one] in which they are secure from the raids and killings that occur among the Arab tribes, to which are brought (read tujbā or yujbā) fruits of all kinds, [fruits] from every direction, as a provision, for them, from Us? But most of them do not know, that what We say is the truth.\n",
        "TRANSLATION_18": "(And they say) i.e. Harth Ibn 'Amr al-Nawfali and his host: (If we were to follow the Guidance) the confession of Allah's divine Oneness (with thee) Muhammad (we should be torn out) expelled (of our land) Mecca. (Have We not established for them) We made them dwell in (a sure sanctuary) free of turmoil, (whereunto the produce of all things is brought (in trade), a provision from Our presence?) A sustenance for them from Us, so how am I to set the disbelievers on them if they were to believe? (But most of them know not) this nor believe in it.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "28:57",
            "42:12",
            "15:19",
            "21:30",
            "18:84",
            "16:73",
            "26:7",
            "29:62",
            "41:53",
            "5:40"
        ],
        "BIBLE": [
            "torah:numbers:11:12",
            "writings:i%20chronicles:29:14",
            "prophets:jeremiah:16:15",
            "torah:genesis:24:19",
            "prophets:jeremiah:52:9",
            "prophets:i%20kings:17:19",
            "prophets:jeremiah:29:14",
            "torah:genesis:24:43",
            "torah:deuteronomy:26:10",
            "torah:numbers:20:12"
        ]
    }
}