{
    "VERSE": "28:62",
    "ARABIC": "وَيَوْمَ يُنَادِيهِمْ فَيَقُولُ أَيْنَ شُرَكَآءِىَ ٱلَّذِينَ كُنتُمْ تَزْعُمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "On the Day when He summons them He will say, 'Where are they, those you claimed were My associates?'",
        "TRANSLATION_1": "That day God will call them and ask: \"Where are they you imagined were My compeers?\"\n",
        "TRANSLATION_2": "(Let them not forget) that the Day when Allah will call unto them, and say: \"Where are those whom you imagined to be My associates?\"\n",
        "TRANSLATION_3": "On the day when He will ask (the latter group), \"Where are those whom you had considered equal to Me?\"\n",
        "TRANSLATION_4": "On the day when He will call to them – He will therefore proclaim, “Where are those partners of Mine, whom you had assumed?”\n",
        "TRANSLATION_5": "And (remember) the Day when He will call to them and say: \"Where are My (so-called) partners whom you used to assert\"\n",
        "TRANSLATION_6": "And on the day when He will call them and say: Where are those whom you deemed to be My associates?\n",
        "TRANSLATION_7": "Upon the day when He shall call to them, and He shall say, 'Where now are My associates whom you were asserting?'\n",
        "TRANSLATION_8": "On the day when He will call unto them and say: Where are My partners whom ye imagined?\n",
        "TRANSLATION_9": "On that Day He will call to them, and say, \"Where are those whom you claimed to be My partners?\"\n",
        "TRANSLATION_10": "And on the Day whereon He shall call unto them and say: where are My associates whom ye were wont to assert?\n",
        "TRANSLATION_11": "The day He will call out to them and ask, ‘Where are My ‘partners’ that you used to claim?’\n",
        "TRANSLATION_12": "That Day (Allah) will call to them, and say \"Where are my 'partners'?- whom ye imagined (to be such)?\"\n",
        "TRANSLATION_13": "And (remember) the Day when He will call to them, and say: \"Where are My (so-called) partners whom you used to assert?\"\n",
        "TRANSLATION_14": "On that Day He will call to them, saying: 'Where are those whom you alleged to be My associates'\n",
        "TRANSLATION_15": "On the Day when He will call to them, and say, “Where are My associates whom you used to claim?”\n",
        "TRANSLATION_16": "And [warn of] the Day He will call them and say, \"Where are My 'partners' which you used to claim?\"\n",
        "TRANSLATION_17": "[28:62] And, mention, the day when He, God, will call to them and say, ‘Where [then] are My partners, those whom you used to claim?’, were partners of Mine.\n",
        "TRANSLATION_18": "(On the Day) which is the Day of Judgement (when He) i.e. Allah (will call unto them) Abu Jahl and his host (and say) and Allah, glorified is He, says: (Where are My partners whom you imagined) whom you worshipped and claimed they were my partners?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "28:74",
            "28:62",
            "6:22",
            "28:65",
            "18:52",
            "26:87",
            "16:27",
            "70:42",
            "43:83",
            "10:28"
        ],
        "BIBLE": [
            "prophets:hosea:2:25",
            "torah:deuteronomy:32:7",
            "prophets:ezekiel:38:14",
            "torah:genesis:32:27",
            "prophets:i%20kings:1:30",
            "prophets:ii%20samuel:11:12",
            "prophets:jeremiah:31:34",
            "prophets:jonah:3:4",
            "prophets:ii%20kings:2:17",
            "torah:deuteronomy:31:17"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:11",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:3"
        ]
    }
}