{
    "VERSE": "28:65",
    "ARABIC": "وَيَوْمَ يُنَادِيهِمْ فَيَقُولُ مَاذَآ أَجَبْتُمُ ٱلْمُرْسَلِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "On the Day when He summons them He will say, 'How did you respond to the Messengers?'",
        "TRANSLATION_1": "(God) will ask them on that day: \"What answer did you give the apostles?\"\n",
        "TRANSLATION_2": "(Let them not disregard) that the Day when Allah will call out to them saying: \"What was the answer you gave to the Messengers?\"\n",
        "TRANSLATION_3": "On the day when God will call them and ask them, \"What answer did you give to (Our) messengers?\"\n",
        "TRANSLATION_4": "And on the Day when He will call to them and proclaim, “What answer did you give to the Noble Messengers?”\n",
        "TRANSLATION_5": "And the Day He will call to them, and say: \"What answer gave you to the Messengers\"\n",
        "TRANSLATION_6": "And on the day when He shall call them and say: What was the answer you gave to the apostles?\n",
        "TRANSLATION_7": "Upon the day when He shall call to them, and He shall say, 'What answer gave you to the Envoys?'\n",
        "TRANSLATION_8": "And on the Day when He will call unto them and say: What answer gave ye to the messengers?\n",
        "TRANSLATION_9": "On that Day God will call out to them, saying, \"What answer did you give to Our messengers?\"\n",
        "TRANSLATION_10": "And on the Day whereon He shall call unto them and say: what answer gave ye to the sent ones?\n",
        "TRANSLATION_11": "The day He will call out to them and say, ‘What response did you give to the apostles?’\n",
        "TRANSLATION_12": "That Day (Allah) will call to them, and say: \"What was the answer ye gave to the messengers?\"\n",
        "TRANSLATION_13": "And (remember) the Day (Allah) will call to them, and say: \"What answer gave you to the Messengers?\"\n",
        "TRANSLATION_14": "On that Day He will call to them and He will say: 'What response did you give Our Messengers'\n",
        "TRANSLATION_15": "On the Day when He will call to them, and say, “What did you answer the Messengers?”\n",
        "TRANSLATION_16": "And [mention] the Day He will call them and say, \"What did you answer the messengers?\"\n",
        "TRANSLATION_17": "[28:65] And, mention, the day when He will call to them and say, ‘What response did you give to those [messengers] who were sent?’, to you.\n",
        "TRANSLATION_18": "(And on the Day) of Judgement (when He will call unto them) Allah will call unto the disbelievers (and say: What answer gave ye to the messengers) regarding that for which they invited you?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "28:65",
            "36:59",
            "85:2",
            "26:87",
            "79:6",
            "30:14",
            "82:17",
            "28:62",
            "28:74",
            "36:64"
        ],
        "BIBLE": [
            "torah:genesis:29:21",
            "prophets:i%20samuel:11:3",
            "writings:ii%20chronicles:25:9",
            "prophets:i%20kings:21:6",
            "prophets:jeremiah:44:20",
            "prophets:i%20kings:3:27",
            "prophets:ii%20kings:6:29",
            "writings:ii%20chronicles:35:21",
            "prophets:i%20kings:13:3",
            "prophets:ii%20kings:6:28"
        ]
    }
}