{
    "VERSE": "28:69",
    "ARABIC": "وَرَبُّكَ يَعْلَمُ مَا تُكِنُّ صُدُورُهُمْ وَمَا يُعْلِنُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Your Lord knows what their hearts conceal and what they divulge.",
        "TRANSLATION_1": "Your Lord well knows what they hide in their breasts and what they disclose.\n",
        "TRANSLATION_2": "Your Lord knows all that their hearts conceal and all that they reveal.\n",
        "TRANSLATION_3": "Your Lord knows all that their hearts hide or reveal.\n",
        "TRANSLATION_4": "And your Lord knows what is hidden in their breasts, and what they disclose.\n",
        "TRANSLATION_5": "And your Lord knows what their breasts conceal, and what they reveal.\n",
        "TRANSLATION_6": "And your Lord knows what their breasts conceal and what they manifest.\n",
        "TRANSLATION_7": "And thy Lord knows what their breasts conceal and what they publish.\n",
        "TRANSLATION_8": "And thy Lord knoweth what their breasts conceal, and what they publish.\n",
        "TRANSLATION_9": "Your Lord knows what they conceal in their hearts and what they disclose.\n",
        "TRANSLATION_10": "And thy Lord knoweth that which their breasts conceal and that which they make known.\n",
        "TRANSLATION_11": "Your Lord knows whatever their breasts conceal, and whatever they disclose.\n",
        "TRANSLATION_12": "And thy Lord knows all that their hearts conceal and all that they reveal.\n",
        "TRANSLATION_13": "And your Lord knows what their breasts conceal, and what they reveal.\n",
        "TRANSLATION_14": "Your Lord knows what their chests hide and what they reveal.\n",
        "TRANSLATION_15": "And your Lord knows what their hearts conceal, and what they reveal.\n",
        "TRANSLATION_16": "And your Lord knows what their breasts conceal and what they declare.\n",
        "TRANSLATION_17": "[28:69] And your Lord knows what their breasts conceal, [what] their hearts keep secret of disbelief and otherwise, and what they proclaim, by their tongues of such things.\n",
        "TRANSLATION_18": "(And thy Lord knoweth what you breasts conceal) of hatred and enmity, (and what they publish) of transgressions.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "28:69",
            "27:74",
            "20:25",
            "93:3",
            "74:3",
            "15:97",
            "29:59",
            "16:42",
            "100:10",
            "25:64"
        ],
        "BIBLE": [
            "writings:psalms:25:14",
            "prophets:ii%20samuel:7:21",
            "writings:psalms:51:8",
            "writings:ii%20chronicles:29:10",
            "writings:i%20chronicles:17:19",
            "writings:proverbs:27:11",
            "prophets:ezekiel:38:23",
            "prophets:jeremiah:32:40",
            "writings:daniel:5:15",
            "writings:psalms:89:2"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:12",
            "Sefer%20Yetzirah:6:4",
            
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:3:6",
            "Sefer%20Yetzirah:3:4",
            "Sefer%20Yetzirah:1:6"
        ]
    }
}