{
    "VERSE": "28:74",
    "ARABIC": "وَيَوْمَ يُنَادِيهِمْ فَيَقُولُ أَيْنَ شُرَكَآءِىَ ٱلَّذِينَ كُنتُمْ تَزْعُمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "On the Day when He summons them He will say, 'Where are they, those you claimed to be My associates?'",
        "TRANSLATION_1": "Upon a day He will call them and ask: \"Where are they you imagined were My compeers?\"\n",
        "TRANSLATION_2": "(Let them bear in mind) that on that Day when He will call out to them saying: \"Where are My associates, those whom you imagined to be so?\"\n",
        "TRANSLATION_3": "God will call the unbelievers on the Day of Judgment and ask them, \"Where are your idols in which you had faith?\n",
        "TRANSLATION_4": "On the day when He will call to them – He will therefore proclaim, “Where are those partners of Mine, whom you had assumed?”\n",
        "TRANSLATION_5": "And the Day when He will call to them, and will say: \"Where are My (so-called) partners, whom you used to assert\"\n",
        "TRANSLATION_6": "And on the day when He shall call them and say: Where are those whom you deemed to be My associates?\n",
        "TRANSLATION_7": "Upon the day when He shall call. to them, and He shall say, 'Where now are My associates whom you were asserting?'\n",
        "TRANSLATION_8": "And on the Day when He shall call unto them and say: Where are My partners whom ye pretended?\n",
        "TRANSLATION_9": "And on the Day He shall call out to them and say, \"Where are those whom you alleged were My partners.\"\n",
        "TRANSLATION_10": "And on the Day whereon He shall call unto them and say: where are My associates whom ye were wont to assert?\n",
        "TRANSLATION_11": "The day He will call out to them and say, ‘Where are My ‘partners’ that you used to claim?’\n",
        "TRANSLATION_12": "The Day that He will call on them, He will say: \"Where are my 'partners'? whom ye imagined (to be such)?\"\n",
        "TRANSLATION_13": "And (remember) the Day when He (your Lord Allah) will call them (those who worshipped others along with Allah), and will say: \"Where are My (so-called) partners, whom you used to assert?\"\n",
        "TRANSLATION_14": "Upon that Day He will call to them saying: 'Now, where are those whom you alleged to be My associates'\n",
        "TRANSLATION_15": "On the Day when He will call to them, and say, “Where are My associates whom you used to claim?”\n",
        "TRANSLATION_16": "And [warn of] the Day He will call them and say, \"Where are my 'partners' which you used to claim?\"\n",
        "TRANSLATION_17": "[28:74] And, mention, the day when He will call to them and say, ‘Where [now] are My associates those whom you used to claim?’ — this is mentioned again in order to expound upon it:\n",
        "TRANSLATION_18": "(And on the Day) which is the Day of Judgement (when He shall call unto them and say: Where are My partners whom ye pretended) whom you claimed were My partners?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "28:74",
            "28:62",
            "6:22",
            "28:65",
            "18:52",
            "26:87",
            "16:27",
            "43:83",
            "70:42",
            "10:28"
        ],
        "BIBLE": [
            "prophets:joshua:3:3",
            "prophets:isaiah:4:1",
            "prophets:ezekiel:28:22",
            "prophets:amos:5:16",
            "prophets:ezekiel:38:14",
            "torah:genesis:24:55",
            "prophets:i%20kings:1:30",
            "prophets:i%20samuel:20:12",
            "prophets:jeremiah:3:16",
            "torah:genesis:6:3"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:4:8",
            "Sefer%20Yetzirah:4:11",
            "Sefer%20Yetzirah:6:1"
        ]
    }
}