{
    "VERSE": "28:76",
    "ARABIC": "إِنَّ قَٰرُونَ كَانَ مِن قَوْمِ مُوسَىٰ فَبَغَىٰ عَلَيْهِمْ وَءَاتَيْنَٰهُ مِنَ ٱلْكُنُوزِ مَآ إِنَّ مَفَاتِحَهُۥ لَتَنُوٓأُ بِٱلْعُصْبَةِ أُو۟لِى ٱلْقُوَّةِ إِذْ قَالَ لَهُۥ قَوْمُهُۥ لَا تَفْرَحْ إِنَّ ٱللَّهَ لَا يُحِبُّ ٱلْفَرِحِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Qarun was one of the people of Musa but he lorded it over them. We gave him treasures, the keys alone to which were a heavy weight for a party of strong men. When his people said to him, 'Do not gloat. Allah does not love people who gloat.",
        "TRANSLATION_1": "Verily Qarun was of Moses' people, but he began to oppress them. We had given him treasures, so many that a team of wrestlers could hardly lift their keys. His people said to him: \"Do not be exultant. God does not like those who exult.\n",
        "TRANSLATION_2": "To be sure, Qarun (Korah) was one of Moses' people; then he transgressed against them. We had bestowed on him such treasure that their very keys would have been raised with difficulty by a whole group of strong people. Once when his people said to him: \"Do not exult, for Allah does not love those who exult (in their riches).\n",
        "TRANSLATION_3": "Korah was a man from the people of Moses. This man rebelled against them. We had given him so much treasure that the keys of the stores of his treasures could hardly even be carried by a group of strong people. His people told him, \"Do not be proud of your wealth; God does not love those who are proudly happy of their wealth.\n",
        "TRANSLATION_4": "Indeed Qaroon was from the people of Moosa – he then oppressed them; and We gave him so many treasures that their keys were a heavy burden for a strong group; when his people said to him, “Do not show off – indeed Allah does not like the boastful.”\n",
        "TRANSLATION_5": "Verily, Qarun was of Musa's people, but he behaved arrogantly towards them. And We gave him of the treasures, that of which the keys would have been a burden to a body of strong men. Remember when his people said to him: \"Do not exult. Verily, Allah likes not those who exult.\"\n",
        "TRANSLATION_6": "Surely Qaroun was of the people of Musa, but he rebelled against them, and We had given him of the treasures, so much so that his hoards of wealth would certainly weigh down a company of men possessed of great strength. When his people said to him: Do not exult, surely Allah does not love the exultant;\n",
        "TRANSLATION_7": "Now Korah was of the people of Moses; he became insolent to them, for We had given him treasures such that the very keys of them were too heavy a burden for a company of men endowed with strength. When his people said to him, 'Do not exult; God loves not those that exult;\n",
        "TRANSLATION_8": "Now Korah was of Moses' folk, but he oppressed them; and We gave him so much treasure that the stores thereof would verily have been a burden for a troop of mighty men. When his own folk said unto him: Exult not; lo! Allah loveth not the exultant;\n",
        "TRANSLATION_9": "Korah was one of Moses' people, but he behaved arrogantly towards them. We had given him such treasures that their very keys would have weighed down a band of strong men. His people said to him, \"Do not exult in your riches, for God does not love the exultant.\n",
        "TRANSLATION_10": "Verily Qarun was of the people of Musa; then he behaved arrogantly toward them. And We had vouchsafed him of the treasures whereof the keys would have weighed down a band of strong men. Recall what time his people said unto him: exult not; verily God loveth not the exultant.\n",
        "TRANSLATION_11": "Korah indeed belonged to the people of Moses, but he bullied them. We had given him so much treasures that their chests indeed proved heavy for a band of stalwarts. When his people said to him, ‘Do not boast! Indeed Allah does not like the boasters.\n",
        "TRANSLATION_12": "Qarun was doubtless, of the people of Moses; but he acted insolently towards them: such were the treasures We had bestowed on him that their very keys would have been a burden to a body of strong men, behold, his people said to him: \"Exult not, for Allah loveth not those who exult (in riches).\n",
        "TRANSLATION_13": "Verily, Qarun (Korah) was of Musa's (Moses) people, but he behaved arrogantly towards them. And We gave him of the treasures, that of which the keys would have been a burden to a body of strong men. When his people said to him: \"Do not be glad (with ungratefulness to Allah's Favours). Verily! Allah likes not those who are glad (with ungratefulness to Allah's Favours).\n",
        "TRANSLATION_14": ". Korah was one of Moses' nation. But he was insolent to them, for We had given him such treasures that their very keys were too heavy a burden for even the strong. His people said to him: 'Do not exult; Allah does not love the boastful.\n",
        "TRANSLATION_15": "Quaroon belonged to the clan of Moses, but he oppressed them. We had given him treasures, the keys of which would weigh down a group of strong men. His people said to him, “Do not exult; God does not love the exultant.\n",
        "TRANSLATION_16": "Indeed, Qarun was from the people of Moses, but he tyrannized them. And We gave him of treasures whose keys would burden a band of strong men; thereupon his people said to him, \"Do not exult. Indeed, Allah does not like the exultant.\n",
        "TRANSLATION_17": "[28:76] Indeed Korah belonged to the people of Moses — [being] his paternal and maternal cousin, and he had believed in him [in Moses] — but he became insolent towards them, through [his] disdain, haughtiness and great wealth. For We had given him so many treasures that [the number of] their keys would verily have burdened a group of strong men, in other words, they would have been too heavy for such [men] (the bā’ of [bi’l-‘usbati, ‘a group’] is to render transitive [the intransitive] verb); the number of such [men required] is estimated to be 70, 40 or 10; other estimates are also given. Mention, when his people, the believers among the Children of Israel, said to him, ‘Do not be exultant, in [your] great wealth, an exultation of insolence; truly God does not love the exultant, in such [things];\n",
        "TRANSLATION_18": "(Now Korah was of Moses folk) He was Moses' cousin, (but he oppressed them) but he transgressed against Moses, Aaron and their folk. He said: \"Moses has been given messengership and Aaron religious authority while have nothing; this I will not accept\", and he rejected Moses' prophethood (and We gave him so much treasure) wealth (that the stores thereof) the keys of his stores (would verily have been a burden for a troop of mighty men) 40 men carried the keys of his stores. (When his own folk) the folk of Moses (said unto him: Exult not) do not be too proud nor associate partners with Allah; (lo! Allah loveth not the exultant) Allah does not love those who are too proud because of their wealth;\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "28:76",
            "2:67",
            "10:85",
            "9:56",
            "7:138",
            "4:141",
            "5:51",
            "14:42",
            "14:4",
            "5:20"
        ],
        "BIBLE": [
            "prophets:i%20kings:17:19",
            "writings:ezra:5:12",
            "writings:ecclesiastes:5:18",
            "torah:deuteronomy:3:18",
            "writings:daniel:1:2",
            "torah:genesis:20:16",
            "prophets:ii%20samuel:18:11",
            "writings:ii%20chronicles:28:15",
            "prophets:i%20samuel:20:40",
            "prophets:joshua:6:2"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:4",
            
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:4:4"
        ]
    }
}