{
    "VERSE": "28:81",
    "ARABIC": "فَخَسَفْنَا بِهِۦ وَبِدَارِهِ ٱلْأَرْضَ فَمَا كَانَ لَهُۥ مِن فِئَةٍ يَنصُرُونَهُۥ مِن دُونِ ٱللَّهِ وَمَا كَانَ مِنَ ٱلْمُنتَصِرِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "We caused the earth to swallow up both him and his house. There was no group to come to his aid, besides Allah, and he was not someone who is helped.",
        "TRANSLATION_1": "So We opened up the earth and sunk him and his mansion. There was not a body that could help him against (the will) of God, nor was he able to save himself.\n",
        "TRANSLATION_2": "At last We caused the earth to swallow him and his house. Thereafter there was no group of people that could come to his aid against Allah; nor was he able to come to his own aid.\n",
        "TRANSLATION_3": "We caused the earth to swallow up him and his home. No one besides God could help him nor could he himself achieve victory.\n",
        "TRANSLATION_4": "We therefore buried him and his house into the earth; so he had no group to help save him from Allah; nor could he take revenge.\n",
        "TRANSLATION_5": "So, We caused the earth to swallow him and his dwelling place. Then he had no group to help him against Allah, nor was he one of those who could save themselves.\n",
        "TRANSLATION_6": "Thus We made the earth to swallow up him and his abode; so he had no body of helpers to assist him against Allah nor was he of those who can defend themselves.\n",
        "TRANSLATION_7": "So We made the earth to swallow him and his dwelling and there was no host to help him, apart from God, and he was helpless;\n",
        "TRANSLATION_8": "So We caused the earth to swallow him and his dwelling-place. Then he had no host to help him against Allah, nor was he of those who can save themselves.\n",
        "TRANSLATION_9": "Then We caused the earth to swallow up him and his home: there was no one to help him against God, nor could he defend himself.\n",
        "TRANSLATION_10": "Then We sank the earth with him and his dwelling-place. And he had no host to defend him against Allah, nor was he of those who could defend themselves.\n",
        "TRANSLATION_11": "So We caused the earth to swallow him and his house, and he had no party that might protect him from Allah, nor could he rescue himself.\n",
        "TRANSLATION_12": "Then We caused the earth to swallow up him and his house; and he had not (the least little) party to help him against Allah, nor could he defend himself.\n",
        "TRANSLATION_13": "So We caused the earth to swallow him and his dwelling place. Then he had no group or party to help him against Allah, nor was he one of those who could save themselves.\n",
        "TRANSLATION_14": "We caused the earth to swallow him, together with his dwelling, and there was no host to help him, other than Allah; and he was not amongst the victorious.\n",
        "TRANSLATION_15": "So We caused the earth to cave in on him and his mansion. He had no company to save him from God, and he could not defend himself.\n",
        "TRANSLATION_16": "And We caused the earth to swallow him and his home. And there was for him no company to aid him other than Allah, nor was he of those who [could] defend themselves.\n",
        "TRANSLATION_17": "[28:81] So We caused the earth to swallow him, Korah, and his dwelling, and he had no host to help him besides God, that is, other than Him, to protect him from destruction, nor was he of those who can rescue themselves, from it.\n",
        "TRANSLATION_18": "(So We caused the earth to swallow him and his dwelling-place) We cause the earth to swallow Korah and his house. (Then he had no host) no group or troop (to help him against Allah) against Allah's punishment when it came on him, (nor was he of those who can save themselves) from the torment.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "28:81",
            "18:43",
            "46:32",
            "42:31",
            "16:73",
            "29:22",
            "11:20",
            "39:36",
            "53:58",
            "10:106"
        ],
        "BIBLE": [
            "prophets:jeremiah:7:3",
            "prophets:isaiah:66:1",
            "prophets:i%20samuel:26:5",
            "prophets:ezekiel:36:3",
            "prophets:jeremiah:19:13",
            "prophets:ii%20kings:17:29",
            "writings:ii%20chronicles:6:18",
            "writings:psalms:106:17",
            "prophets:haggai:2:9",
            "prophets:judges:18:10"
        ]
    }
}