{
    "VERSE": "28:88",
    "ARABIC": "وَلَا تَدْعُ مَعَ ٱللَّهِ إِلَٰهًا ءَاخَرَ لَآ إِلَٰهَ إِلَّا هُوَ كُلُّ شَىْءٍ هَالِكٌ إِلَّا وَجْهَهُۥ لَهُ ٱلْحُكْمُ وَإِلَيْهِ تُرْجَعُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Do not call on any other god along with Allah. There is no god but Him. All things are passing except His Face. Judgement belongs to Him. You will be returned to Him.",
        "TRANSLATION_1": "And do not call on any other god apart from God. There is no god but He. All things will perish save His magnificence. His is the judgement, and to Him will you be brought back in the end.\n",
        "TRANSLATION_2": "and do not invoke any god beside Allah. There is no god but He. All will perish but He. To Him belongs the command. And to Him shall all of you return.\n",
        "TRANSLATION_3": "Do not worship anything besides God. He is the only God. Everything will be destroyed except God. To Him belongs Judgment and to Him you will all return.\n",
        "TRANSLATION_4": "And do not worship any other God along with Allah; there is no God except Him; all things are destructible except His Entity; only His is the command, and it is towards Him that you will be returned.\n",
        "TRANSLATION_5": "And invoke not any other god along with Allah, La ilaha illa Huwa. Everything will perish save His Face. His is the decision, and to Him you shall be returned.\n",
        "TRANSLATION_6": "And call not with Allah any other god; there is no god but He, every thing is perishable but He; His is the judgment, and to Him you shall be brought back.\n",
        "TRANSLATION_7": "And call not upon another god with God; there is no god but He. All things perish, except His Face. His is the Judgment, and unto Him you shall be returned.\n",
        "TRANSLATION_8": "And cry not unto any other god along with Allah. There is no Allah save Him. Everything will perish save His countenance. His is the command, and unto Him ye will be brought back.\n",
        "TRANSLATION_9": "Invoke no god other than God, for there is no god but Him. All things are bound to perish except Himself. His is the judgement, and to Him you shall be returned.\n",
        "TRANSLATION_10": "And invoke thou not any other god along with Allah. There is no god but he. Everything is perishable save His countenance His is the judgment, and unto Him ye shall be returned.\n",
        "TRANSLATION_11": "And do not invoke another god besides Allah; there is no god except Him. Everything is to perish except His Face. All judgement belongs to Him, and to Him you will be brought back.\n",
        "TRANSLATION_12": "And call not, besides Allah, on another god. There is no god but He. Everything (that exists) will perish except His own Face. To Him belongs the Command, and to Him will ye (all) be brought back.\n",
        "TRANSLATION_13": "And invoke not any other ilah (god) along with Allah, La ilaha illa Huwa (none has the right to be worshipped but He). Everything will perish save His Face. His is the Decision, and to Him you (all) shall be returned.\n",
        "TRANSLATION_14": "And do not call upon another god with Allah, there is no god except He. All things perish, except His Face, Judgement is His, and to Him all of you shall return.\n",
        "TRANSLATION_15": "And do not invoke with God any other god. There is no god but He. All things perish, except His presence. His is the judgment, and to Him you will be returned.\n",
        "TRANSLATION_16": "And do not invoke with Allah another deity. There is no deity except Him. Everything will be destroyed except His Face. His is the judgement, and to Him you will be returned.\n",
        "TRANSLATION_17": "[28:88] And do not call on, [do not] worship, another god with God; there is no god except Him. Everything will perish except His Countenance, except Him. His is the judgement, the effective decree, and to Him you will be brought back, by being raised from the grave. Meccan, except for verses 1 to 11 inclusive, which are Medinese; it consists of 69 verses revealed after [sūrat] al-Rūm.\n",
        "TRANSLATION_18": "(And cry not unto any other god along with Allah) do not worship any deity other than Allah nor call people to anyone or anything beside Allah. (There is no god save Him) alone without partners. (Everything) all works that are for other than Allah's Countenance (will perish) will not be accepted (save His Countenance) except that which is meant for the sake of His Countenance; it is also said that this means: every countenance changes except Allah's and every kingdom will vanish except His. (His is the command) the judgement between people, (and unto Him ye will be brought back) after death and he will requite each according to his works'. And of the surah in which the spider is mentioned, which is all Meccan and consists of 77 verses, 780 words and 4,145 letters: Surah 29: The Spider (al-'Ankabut) And of the surah in which the spider is mentioned, which is all Meccan and consists of 77 verses, 780 words and 4,145 letters:\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "28:88",
            "28:70",
            "48:21",
            "17:39",
            "6:102",
            "34:47",
            "12:67",
            "39:62",
            "20:98",
            "42:10"
        ],
        "BIBLE": [
            "torah:deuteronomy:4:30",
            "prophets:hosea:7:10",
            "writings:ii%20chronicles:30:9",
            "prophets:jeremiah:15:19",
            "prophets:hosea:11:9",
            "torah:exodus:32:8",
            "torah:deuteronomy:1:17",
            "writings:daniel:11:28",
            "torah:deuteronomy:6:15",
            "prophets:jeremiah:2:27"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:3:6",
            "Sefer%20Yetzirah:4:6"
        ]
    }
}