{
    "VERSE": "81:24",
    "ARABIC": "وَمَا هُوَ عَلَى ٱلْغَيْبِ بِضَنِينٍ",
    "ENGLISH": {
        "TRANSLATION_0": "Nor is he miserly with the Unseen.",
        "TRANSLATION_1": "He is not chary of making public what is unknown.\n",
        "TRANSLATION_2": "nor does he grudge (conveying this knowledge about) the Unseen;\n",
        "TRANSLATION_3": "He (Muhammad) is not accused of lying about the unseen.\n",
        "TRANSLATION_4": "And this Prophet is not miserly upon the hidden. (Allah gave the knowledge of the hidden to the Holy Prophet – peace and blessings be upon him.)\n",
        "TRANSLATION_5": "And he withholds not a knowledge of the Unseen.\n",
        "TRANSLATION_6": "Nor of the unseen is he a tenacious concealer.\n",
        "TRANSLATION_7": "he is not niggardly of the Unseen.\n",
        "TRANSLATION_8": "And he is not avid of the Unseen.\n",
        "TRANSLATION_9": "He is not avid of the Unseen.\n",
        "TRANSLATION_10": "And he is of the unseen not a tenacious concealer.\n",
        "TRANSLATION_11": "and he is not miserly concerning the Unseen.\n",
        "TRANSLATION_12": "Neither doth he withhold grudgingly a knowledge of the Unseen.\n",
        "TRANSLATION_13": "And he (Muhammad (Peace be upon him)) withholds not a knowledge of the unseen.\n",
        "TRANSLATION_14": "he is not grudging of the Unseen.\n",
        "TRANSLATION_15": "And He does not withhold knowledge of the Unseen.\n",
        "TRANSLATION_16": "And Muhammad is not a withholder of [knowledge of] the unseen.\n",
        "TRANSLATION_17": "[81:24] and he, Muhammad (s), is not to be accused of [knowing] the Unseen, what is hidden of the revelation and the tidings of the heaven (a variant reading [for bi-zanīnin] has bi-danīnin, meaning that he is not ‘niggardly’ [with the Unseen] so as to reduce something of it [and not disclose it]).\n",
        "TRANSLATION_18": "(And he is not) i.e. Muhammad (pbuh) (avid of the Unseen) he is accused with regard to the revelation; and it is also said this means: he is not avaricious.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "81:24",
            "26:114",
            "72:26",
            "2:3",
            "23:92",
            "26:138",
            "12:81",
            "85:7",
            "27:85",
            "36:17"
        ],
        "BIBLE": [
            "prophets:nahum:1:14",
            "prophets:ii%20samuel:22:36",
            "writings:psalms:32:5",
            "torah:leviticus:10:17",
            "prophets:i%20kings:5:26",
            "writings:esther:4:8",
            "torah:leviticus:17:11",
            "torah:numbers:8:19",
            "writings:ii%20chronicles:34:11",
            "prophets:hosea:2:14"
        ]
    }
}