{
    "VERSE": "85:7",
    "ARABIC": "وَهُمْ عَلَىٰ مَا يَفْعَلُونَ بِٱلْمُؤْمِنِينَ شُهُودٌ",
    "ENGLISH": {
        "TRANSLATION_0": "witnessing what they did to the muminun.",
        "TRANSLATION_1": "Witnessing what they had done to the believers!\n",
        "TRANSLATION_2": "and were witnessing what they did to the believers.\n",
        "TRANSLATION_3": "witnessing what they were doing.\n",
        "TRANSLATION_4": "And they themselves are witnesses to what they were doing to the Muslims!\n",
        "TRANSLATION_5": "And they witnessed what they were doing against the believers.\n",
        "TRANSLATION_6": "And they were witnesses of what they did with the believers.\n",
        "TRANSLATION_7": "and were themselves witnesses of what they did with the believers.\n",
        "TRANSLATION_8": "And were themselves the witnesses of what they did to the believers.\n",
        "TRANSLATION_9": "to watch what they were doing to the believers,\n",
        "TRANSLATION_10": "And to that which they did to the believers were witnesses.\n",
        "TRANSLATION_11": "as they were themselves witnesses to what they did to the faithful.\n",
        "TRANSLATION_12": "And they witnessed (all) that they were doing against the Believers.\n",
        "TRANSLATION_13": "And they witnessed what they were doing against the believers (i.e. burning them).\n",
        "TRANSLATION_14": "and they were witnesses of what they did to the believers\n",
        "TRANSLATION_15": "And were witnessing what they did to the believers.\n",
        "TRANSLATION_16": "And they, to what they were doing against the believers, were witnesses.\n",
        "TRANSLATION_17": "[85:7] and they themselves, to what they did to those who believed, in God, in the way of torturing them by hurling [them] into the fire when they did not recant their faith, were witnesses, [they were themselves] present [thereat]. It is reported [in a hadīth] that God saved the believers who had been thrown into the fire by taking their souls before they fell into it, and that the fire then rose up and burnt all those [sitting] around it.\n",
        "TRANSLATION_18": "(And were themselves the witnesses) they used to testify that the believers were folk of error (of what they did to the believers) and it is said this means: they were present when they did this to the believers.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "85:7",
            "27:85",
            "26:114",
            "83:33",
            "15:94",
            "6:129",
            "15:90",
            "19:72",
            "26:199",
            "26:19"
        ],
        "BIBLE": [
            "writings:proverbs:14:5",
            "writings:proverbs:26:23",
            "prophets:isaiah:8:2",
            "prophets:amos:2:1",
            "prophets:ii%20kings:10:26",
            "prophets:jeremiah:36:22",
            "prophets:isaiah:64:10",
            "prophets:isaiah:33:12",
            "prophets:isaiah:43:10",
            "prophets:joshua:11:9"
        ]
    }
}