{
    "VERSE": "85:8",
    "ARABIC": "وَمَا نَقَمُوا۟ مِنْهُمْ إِلَّآ أَن يُؤْمِنُوا۟ بِٱللَّهِ ٱلْعَزِيزِ ٱلْحَمِيدِ",
    "ENGLISH": {
        "TRANSLATION_0": "The only reason they punished them was because they had iman in Allah, the Almighty, the All- Praiseworthy -",
        "TRANSLATION_1": "They had no other reason for hating them except that they believed in God the mighty, worthy of praise,\n",
        "TRANSLATION_2": "Against these they had no grudge except that they believed in Allah, the Most Mighty, the Most Praiseworthy,\n",
        "TRANSLATION_3": "The only reason for which they tormented the believers was the latter's belief in God, the Majestic, and Praiseworthy.\n",
        "TRANSLATION_4": "And what did they dislike from the Muslims, except that the Muslims accepted faith in Allah the Most Honourable, the Most Praiseworthy?\n",
        "TRANSLATION_5": "And they had no fault except that they believed in Allah, the Almighty, Worthy of all praise!\n",
        "TRANSLATION_6": "And they did not take vengeance on them for aught except that they believed in Allah, the Mighty, the Praised,\n",
        "TRANSLATION_7": "They took revenge on them only because they believed in the All-mighty, the Al-laudable,\n",
        "TRANSLATION_8": "They had naught against them save that they believed in Allah, the Mighty, the Owner of Praise,\n",
        "TRANSLATION_9": "whom they hated for no other reason than that they believed in God, the Almighty, the Praiseworthy,\n",
        "TRANSLATION_10": "And they persecuted them for naught save that they believed in Allah, the Mighty, the Praiseworthy\n",
        "TRANSLATION_11": "They were vindictive towards them only because they had faith in Allah, the All-mighty and the All-laudable,\n",
        "TRANSLATION_12": "And they ill-treated them for no other reason than that they believed in Allah, Exalted in Power, Worthy of all Praise!-\n",
        "TRANSLATION_13": "They had nothing against them, except that they believed in Allah, the All-Mighty, Worthy of all Praise!\n",
        "TRANSLATION_14": "and their revenge on them was only because they believed in Allah, the Almighty, the Praised,\n",
        "TRANSLATION_15": "They begrudged them only because they believed in God the Almighty, the Praiseworthy.\n",
        "TRANSLATION_16": "And they resented them not except because they believed in Allah, the Exalted in Might, the Praiseworthy,\n",
        "TRANSLATION_17": "[85:8] And all that they were vindicative towards them of was that they believed in God, the Mighty, in His kingdom, the Praised,\n",
        "TRANSLATION_18": "(They had naught against them) against the believers nor did they find any fault with them (save that they believed in Allah, the Mighty) in His retribution against those who disbelieve in Him, (the Owner of Praise) for those who believe in Him,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "85:8",
            "30:5",
            "44:42",
            "35:17",
            "14:20",
            "39:37",
            "29:42",
            "35:2",
            "72:7",
            "3:126"
        ],
        "BIBLE": [
            "prophets:ezekiel:25:15",
            "prophets:ezekiel:25:12",
            "writings:job:27:2",
            "prophets:i%20samuel:30:19",
            "torah:leviticus:25:36",
            "torah:numbers:24:23",
            "prophets:joshua:11:19",
            "torah:genesis:33:11",
            "writings:psalms:7:2",
            "torah:genesis:4:19"
        ]
    }
}