{
    "VERSE": "85:9",
    "ARABIC": "ٱلَّذِى لَهُۥ مُلْكُ ٱلسَّمَٰوَٰتِ وَٱلْأَرْضِ وَٱللَّهُ عَلَىٰ كُلِّ شَىْءٍ شَهِيدٌ",
    "ENGLISH": {
        "TRANSLATION_0": "Him to whom the Kingdom of the heavens and the earth belongs. Allah is Witness of all things.",
        "TRANSLATION_1": "Whose kingdom spreads over the heavens and the earth. God is witness over everything.\n",
        "TRANSLATION_2": "to Whom belongs the dominion of the heavens and the earth. Allah witnesses everything.\n",
        "TRANSLATION_3": "and the One to whom belongs the heavens and the earth. God is the Witness of all things.\n",
        "TRANSLATION_4": "To Him only belongs the kingship of the heavens and the earth; and Allah is a Witness over all things.\n",
        "TRANSLATION_5": "To Whom belongs the dominion of the heavens and the earth! And Allah is Witness over everything.\n",
        "TRANSLATION_6": "Whose is the kingdom of the heavens and the earth; and Allah is a Witness of all things.\n",
        "TRANSLATION_7": "God to whom belongs the Kingdom of the heavens and the earth, and God is Witness over everything.\n",
        "TRANSLATION_8": "Him unto Whom belongeth the Sovereignty of the heavens and the earth; and Allah is of all things the Witness.\n",
        "TRANSLATION_9": "to whom belongs the kingdom of the heavens and the earth. God is witness over all things.\n",
        "TRANSLATION_10": "Him, Whose is the dominion of heavens and the earth. And Allah is over everything a Witness.\n",
        "TRANSLATION_11": "to whom belongs the kingdom of the heavens and the earth, and Allah is witness to all things.\n",
        "TRANSLATION_12": "Him to Whom belongs the dominion of the heavens and the earth! And Allah is Witness to all things.\n",
        "TRANSLATION_13": "Who, to Whom belongs the dominion of the heavens and the earth! And Allah is Witness over everything.\n",
        "TRANSLATION_14": "to whom belongs the Kingdom of the heavens and earth. And Allah is the Witness of all things.\n",
        "TRANSLATION_15": "To Whom belongs the sovereignty of the heavens and the earth. God is witness over everything.\n",
        "TRANSLATION_16": "To whom belongs the dominion of the heavens and the earth. And Allah, over all things, is Witness.\n",
        "TRANSLATION_17": "[85:9] to Whom belongs the kingdom of the heavens and the earth, and God is Witness to all things, in other words, all that the disbelievers disavowed of the believers was their faith.\n",
        "TRANSLATION_18": "(Him unto Whom belongeth the Sovereignty) the stores (of the heavens) rain (and the earth) plants; (and Allah is of all things the Witness) He is the Witness over their works.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "85:9",
            "5:120",
            "3:189",
            "64:1",
            "5:40",
            "57:2",
            "4:126",
            "25:2",
            "3:5",
            "3:29"
        ],
        "BIBLE": [
            "torah:deuteronomy:10:14",
            "writings:psalms:68:33",
            "writings:nehemiah:9:6",
            "writings:psalms:71:19",
            "writings:daniel:4:19",
            "prophets:joshua:1:17",
            "writings:i%20chronicles:16:26",
            "writings:psalms:96:5",
            "prophets:isaiah:37:16",
            "prophets:habakkuk:3:3"
        ]
    }
}