{
    "VERSE": "24:1",
    "ARABIC": "بِسْمِ ٱللَّهِ ٱلرَّحْمَٰنِ ٱلرَّحِيمِ سُورَةٌ أَنزَلْنَٰهَا وَفَرَضْنَٰهَا وَأَنزَلْنَا فِيهَآ ءَايَٰتٍۭ بَيِّنَٰتٍ لَّعَلَّكُمْ تَذَكَّرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "A sura We have sent down and imposed. We have sent down Clear Signs in it so that hopefully you will pay heed.",
        "TRANSLATION_1": "WE HAVE REVEALED this Surah and made it obligatory as We have sent down clear injunctions in it that you may be warned.\n",
        "TRANSLATION_2": "This is a Surah which We have sent down and We have made it mandatory, and We have sent down clear Commandments in it so that you may learn lessons.\n",
        "TRANSLATION_3": "This is a chapter which We have revealed to you and made obligatory for you to follow its guidance. We have revealed clear verses in it so that perhaps you may take heed.\n",
        "TRANSLATION_4": "This is a chapter which We have sent down and decreed its commands, and in which We have sent down clear verses, in order that you may ponder.\n",
        "TRANSLATION_5": "A Surah which We have sent down and which We have enjoined (Faradnaha), and in it We have revealed manifest Ayat, that you may remember.\n",
        "TRANSLATION_6": "(This is) a chapter which We have revealed and made obligatory and in which We have revealed clear communications that you may be mindful.\n",
        "TRANSLATION_7": "A sura that We have sent down and appointed; and We have sent down in it signs, clear signs, that haply you will remember.\n",
        "TRANSLATION_8": "(Here is) a surah which We have revealed and enjoined, and wherein We have revealed plain tokens, that haply ye may take heed.\n",
        "TRANSLATION_9": "This is a chapter which We have revealed and which We have made obligatory; We have sent down clear revelations in it, so that you may take heed.\n",
        "TRANSLATION_10": "This is a chapter which We have sent down, and which We have ordained; and therein We have sent down revelations manifest, that haply ye may be admonished.\n",
        "TRANSLATION_11": "[This is] a surah which We have sent down and prescribed, and We have sent down in it manifest signs so that you may take admonition.\n",
        "TRANSLATION_12": "A sura which We have sent down and which We have ordained in it have We sent down Clear Signs, in order that ye may receive admonition.\n",
        "TRANSLATION_13": "(This is) a Surah (chapter of the Quran) which We have sent down and which We have enjoined, (ordained its legal laws) and in it We have revealed manifest Ayat (proofs, evidences, verses, lessons, signs, revelations lawful and unlawful things, and set boundries of Islamic Religion), that you may remember.\n",
        "TRANSLATION_14": "This is a chapter which We have sent down and appointed; and in it We have sent down clear verses in order that you will remember.\n",
        "TRANSLATION_15": "A chapter that We have revealed, and made obligatory, and revealed in it clear Verses, that you may take heed.\n",
        "TRANSLATION_16": "[This is] a surah which We have sent down and made [that within it] obligatory and revealed therein verses of clear evidence that you might remember.\n",
        "TRANSLATION_17": "[24:1] This is, a sūra which We have revealed and prescribed (read faradnāhā, or [the intensive form] farradnāhā, on account of the large number of prescriptions contained in it) and wherein We have revealed manifest signs, [signs] containing clear indications, that perhaps you might remember (tadhakkarūna: the second tā’ [of tatadhakkarūna] has been assimilated with the dhāl), that you might be admonished.\n",
        "TRANSLATION_18": "385 And from his own narration on the authority of Ibn 'Abbas that he said regarding the interpretation of Allah's saying ((Here is) a surah which We have revealed): '((Here is) a surah which We have revealed) He says: We sent Gabriel with it (and enjoined) We exposited in it the lawful and the unlawful, (and wherein We have revealed plain tokens) containing commands and prohibitions, obligations and legal punishments, (that haply ye may take heed) that you may take admonition in the commands and prohibitions, so do not suspend the application of legal punishments.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "24:1",
            "29:35",
            "22:16",
            "2:39",
            "78:28",
            "7:36",
            "46:7",
            "15:81",
            "45:25",
            "28:36"
        ],
        "BIBLE": [
            "prophets:isaiah:44:7",
            "prophets:i%20kings:9:6",
            "prophets:ezekiel:7:20",
            "writings:psalms:101:3",
            "torah:numbers:4:15",
            "writings:psalms:50:21",
            "torah:deuteronomy:4:8",
            "torah:leviticus:14:11",
            "prophets:jeremiah:7:30",
            "prophets:jeremiah:32:20"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:5:2",
            
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:3:2"
        ]
    }
}