{
    "VERSE": "24:10",
    "ARABIC": "وَلَوْلَا فَضْلُ ٱللَّهِ عَلَيْكُمْ وَرَحْمَتُهُۥ وَأَنَّ ٱللَّهَ تَوَّابٌ حَكِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "Were it not for Allah's favour to you and His mercy ...and that Allah is Ever-Returning, All-Wise.",
        "TRANSLATION_1": "(This would not have been possible) if the grace and benevolence of God were not upon you; but God is compassionate and wise.\n",
        "TRANSLATION_2": "If Allah had not shown you His grace and mercy and if Allah had not been most Forgiving and All-Wise, (you would have been in a great fix because of accusing your wives).\n",
        "TRANSLATION_3": "Had it not been for God's favors and mercy upon you (your life would have been in chaos). God accepts repentance and He is All-wise.\n",
        "TRANSLATION_4": "And were it not for Allah’s munificence and His mercy upon you and that Allah is the Acceptor of Repentance, the Wise – He would then have unveiled you.\n",
        "TRANSLATION_5": "And had it not been for the grace of Allah and His mercy on you! And that Allah is the One Who forgives and accepts repentance, the All-Wise.\n",
        "TRANSLATION_6": "And were it not for Allah's grace upon you and His mercy-- and that Allah is Oft-returning (to mercy), Wise!\n",
        "TRANSLATION_7": "But for God's bounty to you and His mercy and that God turns, and is All-wise --\n",
        "TRANSLATION_8": "And had it not been for the grace of Allah and His mercy unto you, and that Allah is Clement, Wise, (ye had been undone).\n",
        "TRANSLATION_9": "Were it not for God's grace and His mercy upon you, [you would have come to grief] and God is wise, acceptor of repentance.\n",
        "TRANSLATION_10": "And had it not been for the grace of Allah and His mercy unto you and that Allah is Relenting, Wise, ye had been lost.\n",
        "TRANSLATION_11": "Were it not for Allah’s grace and His mercy upon you, and that Allah is all-clement, all-wise....\n",
        "TRANSLATION_12": "If it were not for Allah's grace and mercy on you, and that Allah is Oft-Returning, full of Wisdom,- (Ye would be ruined indeed).\n",
        "TRANSLATION_13": "And had it not been for the Grace of Allah and His Mercy on you (He would have hastened the punishment upon you)! And that Allah is the One Who accepts repentance, the All-Wise.\n",
        "TRANSLATION_14": "If it were not for the bounty of Allah to you and His Mercy, and that Allah turns, and is the Wise,\n",
        "TRANSLATION_15": "Were it not for God’s grace upon you, and His mercy, and that God is Conciliatory and Wise.\n",
        "TRANSLATION_16": "And if not for the favor of Allah upon you and His mercy... and because Allah is Accepting of repentance and Wise.\n",
        "TRANSLATION_17": "[24:10] And were it not for God’s bounty to you and His mercy, in shielding you [from being exposed] in such [situations], and that God is the Relenting, in His acceptance of repentance in such [situations] and otherwise, Wise, in the rulings He has given for this and other matters, that He might make clear the truth therein and hasten punishment for those deserving it.\n",
        "TRANSLATION_18": "(And had it not been for the grace of Allah and His mercy unto you) He would reveal who was lying of the two, (and that Allah is Clement) Allah forgives whoever repents, (Wise, (ye had been undone)) He decreed that this swearing and cursing takes place between the husband and his wife whom he accuses of adultery. This verse was revealed about 'Asim Ibn 'Adiyy al-Ansari who was afflicted with this.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "24:10",
            "24:20",
            "2:64",
            "4:175",
            "49:8",
            "3:74",
            "33:47",
            "10:58",
            "24:14",
            "4:113"
        ],
        "BIBLE": [
            "prophets:joel:2:13",
            "writings:psalms:66:20",
            "torah:genesis:19:19",
            "writings:psalms:69:17",
            "prophets:joel:2:14",
            "torah:deuteronomy:23:6",
            "writings:daniel:9:13",
            "torah:deuteronomy:13:18",
            "prophets:jonah:4:2",
            "prophets:jonah:3:9"
        ]
    }
}