{
    "VERSE": "24:11",
    "ARABIC": "إِنَّ ٱلَّذِينَ جَآءُو بِٱلْإِفْكِ عُصْبَةٌ مِّنكُمْ لَا تَحْسَبُوهُ شَرًّا لَّكُم بَلْ هُوَ خَيْرٌ لَّكُمْ لِكُلِّ ٱمْرِئٍ مِّنْهُم مَّا ٱكْتَسَبَ مِنَ ٱلْإِثْمِ وَٱلَّذِى تَوَلَّىٰ كِبْرَهُۥ مِنْهُمْ لَهُۥ عَذَابٌ عَظِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "There is a group of you who propagated the lie. Do not suppose it to be bad for you; rather it is good for you. Every one of them will incur the evil he has earned and the one who took it on himself to amplify it will receive a terrible punishment.",
        "TRANSLATION_1": "Those who spread lies were a clique among you. Do not think that it was bad for you: In fact it has been good for you. Each of them will pay for the sin he has committed, and he who had greater share (of guilt) will suffer grievous punishment.\n",
        "TRANSLATION_2": "Those who have invented the slander, are some of your own people. You should not, however, regard this matter as evil for it has good in it for you. Whoso took any part in this, he earned his share of the sin accordingly, and the one, who had the greatest share of responsibility in it, shall have a terrible punishment.\n",
        "TRANSLATION_3": "Those of you who have brought forward a false report (against Aisha) do not think that it will harm you. Rather it will be a benefit to you. Each one of you will face the result of his sin. The one among the group who was the chief instigator will face a great torment.\n",
        "TRANSLATION_4": "Indeed those who have brought this great accusation are a group from among you; do not consider it bad for you; on the contrary, it is good for you; for each man among them is the sin that he has earned; and for the one among them who played the greatest part in it – for him is a terrible punishment.\n",
        "TRANSLATION_5": "Verily, those who brought forth the slander are a group among you. Consider it not a bad thing for you. Nay, it is good for you. Unto every man among them will be paid that which he had earned of the sin, and as for him among them who had the greater share therein, his will be a great torment.\n",
        "TRANSLATION_6": "Surely they who concocted the lie are a party from among you. Do not regard it an evil to you; nay, it is good for you. Every man of them shall have what he has earned of sin; and (as for) him who took upon himself the main part thereof, he shall have a grievous chastisement.\n",
        "TRANSLATION_7": "Those who came with the slander are a band of you; do not reckon it evil for you; rather it is good for you. Every man of them shall have the sin that he has earned charged to him; and whosoever of them took upon himself the greater part of it, him there awaits a mighty chastisement.\n",
        "TRANSLATION_8": "Lo! they who spread the slander are a gang among you. Deem it not a bad thing for you; nay, it is good for you. Unto every man of them (will be paid) that which he hath earned of the sin; and as for him among them who had the greater share therein, his will be an awful doom.\n",
        "TRANSLATION_9": "Those who brought up that slander were a band from among you. Do not regard it as a misfortune, for it is good for you. Every one of them shall be held to account for the sin he has committed; and he who took the greater part in it shall have a terrible punishment.\n",
        "TRANSLATION_10": "Verily those who brought forward the calumny were a small band among Deem it not an evil for you; nay, it was good for you. Unto every one of them shall be that which he hath earned of the sin, and he among them who undertook the bulk of it---for him shall be a torment mighty.\n",
        "TRANSLATION_11": "Indeed those who initiated the calumny are a group from among yourselves. Do not suppose it is bad thing for you. No, it is for your good. Each man among them bears [the onus for] his share in the sin, and as for him who assumed its major burden from among them, there is a great punishment for him.\n",
        "TRANSLATION_12": "Those who brought forward the lie are a body among yourselves: think it not to be an evil to you; On the contrary it is good for you: to every man among them (will come the punishment) of the sin that he earned, and to him who took on himself the lead among them, will be a penalty grievous.\n",
        "TRANSLATION_13": "Verily! Those who brought forth the slander (against 'Aishah, the wife of the Prophet SAW) are a group among you. Consider it not a bad thing for you. Nay, it is good for you. Unto every man among them will be paid that which he had earned of the sin, and as for him among them who had the greater share therein, his will be a great torment.\n",
        "TRANSLATION_14": "those who came with the slander were a number of you. Do not regard it evil for you, rather it is good for you. Every person of them shall have the sin that he has earned charged to him. As for he who took upon himself the greater part there is a mightier punishment.\n",
        "TRANSLATION_15": "Those who perpetrated the slander are a band of you. Do not consider it bad for you, but it is good for you. Each person among them bears his share in the sin. As for him who played the major role—for him is a terrible punishment.\n",
        "TRANSLATION_16": "Indeed, those who came with falsehood are a group among you. Do not think it bad for you; rather it is good for you. For every person among them is what [punishment] he has earned from the sin, and he who took upon himself the greater portion thereof - for him is a great punishment.\n",
        "TRANSLATION_17": "[24:11] Truly those who initiated the slander, the worst calumny against ‘Ā’isha — mother of the believers, may God be pleased with her — accusing her [of fornication], are a band from among yourselves, a group from among the believers. She said [that these were] Hassān b. Thābit, ‘Abd Allāh b. Ubayy, Mistah [b. Uthātha], and Hamna bt. Jahsh. Do not suppose, O you believers other than the [mentioned] band, that it is bad for you; rather it is good for you, for God will reward you for it and reveal ‘Ā’isha’s innocence and [the innocence of] the one who [is supposed to have] committed it with her, namely, Safwān [b. al-Mu‘attal]. She [‘Ā’isha] related: ‘I accompanied the Prophet (s) during a raid, and this was after the [requirement to wear the] veil had been revealed. When he was through with it [the raid], he headed back [to the campsite] and one night, having drawn close to Medina, he announced that all should march off [home]. So I walked a distance [away from the campsite] and relieved myself. But when I came back to the campsite, [I realised that] my necklace (‘iqd meaning qilāda) had snapped. So I went back to look for it. In the meantime they had strapped my litter’ — in which one rides — ‘thinking that I was inside, for in those days women were slight and ate very small portions (‘ulqa). [Finally] I found my necklace, but when I went back to where I had been staying overnight, they had already departed. I sat in the place where I had camped; I assumed that the group would notice my absence and come back for me. But my eyes were overcome [by   drowsiness] and I fell asleep. Safwān had pitched camp behind the army to rest for some of the night (‘arrasa), then set off while it was still night until he reached the site of the camp. He saw what looked like a person sleeping and recognised me when he [eventually] saw me, having seen me on numerous occasions before the [requirement of the] veil. I woke up to the sound of him saying, ‘To God we belong and to Him we shall surely return’ (innā li’Llāhi wa-innā ilayhi rāji‘ūn), for he had recognised me. So I concealed my face with my gown (jilbāb) — in other words, I covered it up with my wrap (mulā’a). By God he did not so much as say a word to me, nor did I hear him say anything other than the words, ‘To God we belong and to Him we shall surely return’, as he brought his camel to its knees and pressed with his foot against its foreleg [for me to mount it]. I then mounted it and he set off leading me back on the camel until we reached the army which had stopped because of the extreme midday heat; some had died [searching] for me. The one who bore the greater share of it [the sinful accusation] was ‘Abd Allāh b. Ubayy b. Salūl’ … her [‘Ā’isha’s] words end here; this was reported by the two Shaykhs [al-Bukhārī and Muslim]. God, exalted be He, says: Upon every man of them shall be the [onus of the] sin which he has earned, in this [affair], and as for him who bore the greater share thereof, that is, [him who] assumed most of [the responsibility for] it, having initiated it and made it public, namely, ‘Abd Allah b. Ubayy: there will be an awful chastisement for him, namely, the Fire in the Hereafter.\n",
        "TRANSLATION_18": "(Lo! they who spread the slander) those who spread the lie (are a gang among you) this was revealed about 'Abdullah Ibn Ubayy Ibn Salul, the hypocrite, and Hassan Ibn Thabit al-Ansari, and Mistah Ibn Uthathah, the cousin of Abu Bakr al-Siddiq, and 'Ubadah Ibn 'Abd al-Muttalib and Hamnah Bint Jahsh al-Asadiyyah who slandered 'A'ishah and Safwan Ibn al-Mu'attal. (Deem it not) deem not the slandering of 'A'ishah and Safwan (a bad thing for you) in the Hereafter; (say, it is good for you) in terms of reward. (Unto every man of them) who engaged in slandering 'A'ishah and Safwan Ibn al-Mu'attal (will be paid that which he hath earned of the sin) in accordance to his engagement in the slander; (and as for him among them who had the greater share therein) the one who spread the matter and uttered abominable things concerning this matter, i.e. 'Abdullah Ibn Ubayy (his will be an awful doom) in this worldly life by imposing the legal punishment on him and in the Hereafter by being cast in hell.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "24:11",
            "3:178",
            "27:23",
            "24:23",
            "3:105",
            "6:120",
            "74:52",
            "17:10",
            "42:37",
            "98:7"
        ],
        "BIBLE": [
            "prophets:ii%20kings:8:9",
            "prophets:isaiah:57:1",
            "prophets:i%20kings:13:29",
            "prophets:ezekiel:3:21",
            "prophets:ezekiel:17:12",
            "torah:genesis:26:11",
            "prophets:i%20kings:18:31",
            "writings:job:42:11",
            "prophets:judges:18:27",
            "prophets:judges:21:22"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:3"
        ]
    }
}