{
    "VERSE": "24:12",
    "ARABIC": "لَّوْلَآ إِذْ سَمِعْتُمُوهُ ظَنَّ ٱلْمُؤْمِنُونَ وَٱلْمُؤْمِنَٰتُ بِأَنفُسِهِمْ خَيْرًا وَقَالُوا۟ هَٰذَآ إِفْكٌ مُّبِينٌ",
    "ENGLISH": {
        "TRANSLATION_0": "Why, when you heard it, did you not, as men and women of the muminun, instinctively think good thoughts and say, 'This is obviously a lie'?",
        "TRANSLATION_1": "Why did the faithful men and women not think well of their people when they heard this, and said: \"This is a clear lie?\"\n",
        "TRANSLATION_2": "When you heard of it, why didn't the Believing men and the Believing women have a good opinion of themselves, and why did they not say, \"This is a manifest slander?\"\n",
        "TRANSLATION_3": "Would that on your hearing this report, the believing men and woman among you had a favorable attitude towards it, and had said, \"This report is clearly false\".\n",
        "TRANSLATION_4": "Why was it not that the believing men and women, when you heard it, thought good of their own people, and had said, “This is a clear accusation”?\n",
        "TRANSLATION_5": "Why then, did not the believers, men and women, when you heard it, think good of their own people and say: \"This is an obvious lie\"\n",
        "TRANSLATION_6": "Why did not the believing men and the believing women, when you heard it, think well of their own people, and say: This is an evident falsehood?\n",
        "TRANSLATION_7": "Why, when you heard it, did the believing men and women not of their own account think good thoughts, and say, 'This is a manifest calumny'?\n",
        "TRANSLATION_8": "Why did not the believers, men and women, when ye heard it, think good of their own own folk, and say: It is a manifest untruth?\n",
        "TRANSLATION_9": "When you heard of it, why did not the believing men and believing women think well of their own people, and say, \"This is a manifest slander?\"\n",
        "TRANSLATION_10": "Wherefore, when ye heard it, did not the believing men and believing women imagine best of their own people and say: this is a calumny manifest!\n",
        "TRANSLATION_11": "When you [first] heard about it, why did not the faithful, men and women, think well of their folks, and say, ‘This is an obvious calumny’?\n",
        "TRANSLATION_12": "Why did not the believers - men and women - when ye heard of the affair,- put the best construction on it in their own minds and say, \"This (charge) is an obvious lie\"?\n",
        "TRANSLATION_13": "Why then, did not the believers, men and women, when you heard it (the slander) think good of their own people and say: \"This (charge) is an obvious lie?\"\n",
        "TRANSLATION_14": "Had you heard it, and the believing men and women, thought good thoughts about one another said: 'This is a clear falsehood'\n",
        "TRANSLATION_15": "Why, when you heard about it, the believing men and women did not think well of one another, and say, “This is an obvious lie”?\n",
        "TRANSLATION_16": "Why, when you heard it, did not the believing men and believing women think good of one another and say, \"This is an obvious falsehood\"?\n",
        "TRANSLATION_17": "[24:12] Why, when you [first] heard about it, did the believing men and women not think good of themselves, that is, [why did] some [not] think good of others, and say, ‘This is a manifest calumny?’, [this is] a patent lie? (there is a shift here in the address from the second to the third person), in other words, [why did] you [not] assume [good of them], O band [of believers] and say:\n",
        "TRANSLATION_18": "(Why did not the believers, men and women, when you heard it) i.e. the slander of 'A'ishah and Safwan, (think good of their own folk) think good of 'A'ishah as they would think good of their mothers; (and say: It) their slander (is a manifest untruth) is a manifest lie?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "24:12",
            "46:11",
            "9:88",
            "64:16",
            "81:7",
            "21:35",
            "23:61",
            "3:104",
            "70:21",
            "61:11"
        ],
        "BIBLE": [
            "torah:numbers:31:49",
            "prophets:i%20kings:13:26",
            "prophets:i%20kings:20:42",
            "writings:i%20chronicles:11:19",
            "prophets:ezekiel:9:1",
            "writings:ecclesiastes:9:16",
            "prophets:ii%20samuel:14:8",
            "torah:exodus:19:23",
            "torah:numbers:23:19",
            "prophets:ii%20kings:7:17"
        ]
    }
}