{
    "VERSE": "24:17",
    "ARABIC": "يَعِظُكُمُ ٱللَّهُ أَن تَعُودُوا۟ لِمِثْلِهِۦٓ أَبَدًا إِن كُنتُم مُّؤْمِنِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Allah warns you never to repeat the like of it again if you are muminun.",
        "TRANSLATION_1": "God counsels you not to do a thing like this, if you are believers.\n",
        "TRANSLATION_2": "Allah admonishes you that in future you should never repeat a thing like this, if you are true Believers.\n",
        "TRANSLATION_3": "God advises you never to do such things again if you have any faith.\n",
        "TRANSLATION_4": "Allah advises you never to speak like this again, if you have faith.\n",
        "TRANSLATION_5": "Allah forbids you from it and warns you not to repeat the like of it forever, if you are believers.\n",
        "TRANSLATION_6": "Allah admonishes you that you should not return to the like of it ever again if you are believers.\n",
        "TRANSLATION_7": "God admonishes you, that you shall never repeat the like of it again; if you are believers.\n",
        "TRANSLATION_8": "Allah admonisheth you that ye repeat not the like thereof ever, if ye are (in truth) believers.\n",
        "TRANSLATION_9": "God warns you never to repeat the like of it again, if you are true believers.\n",
        "TRANSLATION_10": "Allah exhorteth you lest ye may ever revert to the like thereof, if ye are believers indeed.\n",
        "TRANSLATION_11": "Allah advises you lest you should ever repeat the like of it, should you be faithful.\n",
        "TRANSLATION_12": "Allah doth admonish you, that ye may never repeat such (conduct), if ye are (true) Believers.\n",
        "TRANSLATION_13": "Allah forbids you from it and warns you not to repeat the like of it forever, if you are believers.\n",
        "TRANSLATION_14": "Allah exhorts you never again to repeat the like, if you are believers.\n",
        "TRANSLATION_15": "God cautions you never to return to the like of it, if you are believers.\n",
        "TRANSLATION_16": "Allah warns you against returning to the likes of this [conduct], ever, if you should be believers.\n",
        "TRANSLATION_17": "[24:17] God admonishes you, He forbids you, lest you should ever repeat the like of it, if you are [in truth] believers, [then] you will be admonished by this.\n",
        "TRANSLATION_18": "(Allah admonisheth you) Allah warns and prohibits you (that ye repeat not the like thereof ever) to ever engage in similar things, (if ye are (in truth) believers) if you are true believers.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "24:17",
            "7:194",
            "10:38",
            "16:74",
            "11:34",
            "49:17",
            "71:3",
            "18:3",
            "2:95",
            "62:7"
        ],
        "BIBLE": [
            "torah:deuteronomy:23:15",
            "prophets:isaiah:25:1",
            "prophets:jeremiah:23:20",
            "prophets:jeremiah:30:24",
            "writings:psalms:9:18",
            "prophets:i%20kings:13:33",
            "prophets:jeremiah:3:7",
            "prophets:joshua:22:24",
            "torah:deuteronomy:1:32",
            "prophets:ii%20kings:19:33"
        ]
    }
}