{
    "VERSE": "24:20",
    "ARABIC": "وَلَوْلَا فَضْلُ ٱللَّهِ عَلَيْكُمْ وَرَحْمَتُهُۥ وَأَنَّ ٱللَّهَ رَءُوفٌ رَّحِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "Were it not for Allah's favour to you and His mercy . . . and that Allah is All-Gentle, Most Merciful.",
        "TRANSLATION_1": "But for the grace of God and His mercy (much harm would have been done); yet God is compassionate and kind.\n",
        "TRANSLATION_2": "If Allah had not shown His grace and mercy to you, (this scandal would have produced very evil results): Allah is indeed very Kind and Merciful.\n",
        "TRANSLATION_3": "Were it not for the favor and mercy of God upon you (you would have faced painful punishment in this world and the life to come). God is Compassionate and Merciful.\n",
        "TRANSLATION_4": "And were it not for Allah’s munificence and His mercy upon you, and that Allah is Forgiving, Most Merciful – you would have tasted its outcome.\n",
        "TRANSLATION_5": "And had it not been for the grace of Allah and His mercy on you, and that Allah is full of kindness, Most Merciful.\n",
        "TRANSLATION_6": "And were it not for Allah's grace on you and His mercy, and that Allah is Compassionate, Merciful.\n",
        "TRANSLATION_7": "But for God's bounty to you and His mercy and that God is All-gentle, All-compassionate --\n",
        "TRANSLATION_8": "Had it not been for the grace of Allah and His mercy unto you, and that Allah is Clement, Merciful, (ye had been undone).\n",
        "TRANSLATION_9": "But for the grace of God and His mercy upon you, and were not God compassionate and merciful, [you would have come to grief].\n",
        "TRANSLATION_10": "And had there not been Allah's grace upon you and His mercy, and that Allah was Tender and Merciful, ye had Perished.\n",
        "TRANSLATION_11": "Were it not for Allah’s grace and His mercy upon you, and that Allah is all-kind, all-merciful…\n",
        "TRANSLATION_12": "Were it not for the grace and mercy of Allah on you, and that Allah is full of kindness and mercy, (ye would be ruined indeed).\n",
        "TRANSLATION_13": "And had it not been for the Grace of Allah and His Mercy on you, (Allah would have hastened the punishment upon you). And that Allah is full of kindness, Most Merciful.\n",
        "TRANSLATION_14": "If it was not for the bounty of Allah to you and His Mercy, and Allah is the Gentle, the Most Merciful.\n",
        "TRANSLATION_15": "Were it not for God’s grace upon you, and His mercy, and that God is Clement and Merciful.\n",
        "TRANSLATION_16": "And if it had not been for the favor of Allah upon you and His mercy... and because Allah is Kind and Merciful.\n",
        "TRANSLATION_17": "[24:20] And were it not for God’s bounty to you, O band [of accusers] and His mercy and that God is Gentle, Merciful, to you, He would have surely hastened to [bring about] your punishment.\n",
        "TRANSLATION_18": "(Had it not been for the grace of Allah and His mercy unto you) unto those who did not slander 'A'ishah and Safwan, (and that Allah is Clement, Merciful, (ye had been undone)) towards the believers.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "24:20",
            "24:10",
            "2:64",
            "4:175",
            "3:74",
            "10:58",
            "24:14",
            "4:16",
            "33:73",
            "33:47"
        ],
        "BIBLE": [
            "torah:genesis:19:19",
            "writings:psalms:103:4",
            "writings:ii%20chronicles:25:16",
            "prophets:jonah:4:2",
            "prophets:i%20kings:12:22",
            "writings:ezra:5:16",
            "prophets:i%20samuel:25:34",
            "prophets:joel:2:13",
            "prophets:isaiah:26:18",
            "writings:ruth:3:10"
        ]
    }
}