{
    "VERSE": "24:21",
    "ARABIC": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ لَا تَتَّبِعُوا۟ خُطُوَٰتِ ٱلشَّيْطَٰنِ وَمَن يَتَّبِعْ خُطُوَٰتِ ٱلشَّيْطَٰنِ فَإِنَّهُۥ يَأْمُرُ بِٱلْفَحْشَآءِ وَٱلْمُنكَرِ وَلَوْلَا فَضْلُ ٱللَّهِ عَلَيْكُمْ وَرَحْمَتُهُۥ مَا زَكَىٰ مِنكُم مِّنْ أَحَدٍ أَبَدًا وَلَٰكِنَّ ٱللَّهَ يُزَكِّى مَن يَشَآءُ وَٱللَّهُ سَمِيعٌ عَلِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "You who have iman! do not follow in the footsteps of Shaytan. Anyone who follows in Shaytan's footsteps should know that he commands indecency and wrongdoing. Were it not for Allah's favour to you and His All-Knowing.",
        "TRANSLATION_1": "O you who believe, do not follow in the footsteps of Satan, for he who follows in the footsteps of Satan will be induced by him to what is shameful and forbidden. But for the grace of God and His mercy upon you none of you would have escaped undefiled; but God makes whosoever He will grow in goodness, for God is all-hearing and all-knowing.\n",
        "TRANSLATION_2": "O Believers, do not follow in Satan's footsteps, for he will incite to indecency and wickedness any who will follow him. If Allah had not shown His Brace and mercy to you, none of you would have been able to cleanse yourself, for it is Allah alone Who cleanses whom He wills, and Allah is All-Hearing, All-Knowing.\n",
        "TRANSLATION_3": "Believers, do not follow the footsteps of satan; whoever does so will be made by satan to commit indecency and sin. Were it not for the favor and mercy of God, none of you would ever have been purified. God purifies whomever He wants. God is All-hearing and All-knowing.\n",
        "TRANSLATION_4": "O People who Believe! Do not follow the footsteps of the devil; and whoever follows the footsteps of the devil – so he will only bid the indecent and the evil; and were it not for Allah’s munificence and His mercy upon you, none of you would ever become pure – but Allah purifies whomever He wills; and Allah is All Hearing, All Knowing.\n",
        "TRANSLATION_5": "O you who believe! Follow not the Khutuwat of Shaytan. And whosoever follows the footsteps of Shaytan, then, verily, he commands Al-Fahsha' and the evil deeds. And had it not been for the grace of Allah and His mercy on you, not one of you would ever have been pure from sins. But Allah purifies whom He wills, and Allah is All-Hearer, All-Knower.\n",
        "TRANSLATION_6": "O you who believe! do not follow the footsteps of the Shaitan, and whoever follows the footsteps of the Shaitan, then surely he bids the doing of indecency and evil; and were it not for Allah's grace upon you and His mercy, not one of you would have ever been pure, but Allah purifies whom He pleases; and Allah is Hearing, Knowing.\n",
        "TRANSLATION_7": "O believers, follow not the steps of Satan; for whosoever follows the steps of Satan, assuredly he bids to indecency and dishonour. But for God's bounty to you and His mercy not one of you would have been pure ever; but God purifies whom He will; and God is All-hearing, All-knowing.\n",
        "TRANSLATION_8": "O ye who believe! Follow not the footsteps of the devil. Unto whomsoever followeth the footsteps of the devil, lo! he commandeth filthiness and wrong. Had it not been for the grace of Allah and His mercy unto you, not one of you would ever have grown pure. But Allah causeth whom He will to grow. And Allah is Hearer, Knower.\n",
        "TRANSLATION_9": "O you who believe, do not follow in the footsteps of Satan, and whoever follows in the footsteps of Satan should know that he enjoins only indecency and evil. But for the grace of God and His mercy upon you, not one of you would ever be purified; but God purifies whom He pleases. God is all hearing and all knowing.\n",
        "TRANSLATION_10": "O Ye who believe! follow not the footsteps of the Satan. And whosoever followeth the footsteps of the Satan, then he only urgeth to indecency and abomination. And had there not been the grace of Allah upon you and His mercy, not one of you would ever have been cleansed; but Allah cleanseth whomsoever He Will and Allah is Hearing, Knowing.\n",
        "TRANSLATION_11": "O you who have faith! Do not follow in Satan’s steps. Whoever follows in Satan’s steps [should know that] he indeed prompts [you to commit] indecent and wrongful acts. Were it not for Allah’s grace and His mercy upon you, not one of you would ever become pure. But Allah purifies whomever He wishes, and Allah is all-hearing, all-knowing.\n",
        "TRANSLATION_12": "O ye who believe! follow not Satan's footsteps: if any will follow the footsteps of Satan, he will (but) command what is shameful and wrong: and were it not for the grace and mercy of Allah on you, not one of you would ever have been pure: but Allah doth purify whom He pleases: and Allah is One Who hears and knows (all things).\n",
        "TRANSLATION_13": "O you who believe! Follow not the footsteps of Shaitan (Satan). And whosoever follows the footsteps of Shaitan (Satan), then, verily he commands Al-Fahsha' [i.e. to commit indecency (illegal sexual intercourse, etc.)], and Al-Munkar [disbelief and polytheism (i.e. to do evil and wicked deeds; to speak or to do what is forbidden in Islam, etc.)]. And had it not been for the Grace of Allah and His Mercy on you, not one of you would ever have been pure from sins. But Allah purifies (guides to Islam) whom He wills, and Allah is All-Hearer, All-Knower.\n",
        "TRANSLATION_14": "Believers, do not follow in the steps of satan, for those who follow the steps of satan, he bids to indecency and dishonor. But for the bounty of Allah to you, and His Mercy no one of you would ever have been purified; but Allah purifies whom He will; Allah is the Hearer, the Knower.\n",
        "TRANSLATION_15": "O you who believe! Do not follow Satan’s footsteps. Whoever follows Satan’s footsteps—he advocates obscenity and immorality. Were it not for God’s grace towards you, and His mercy, not one of you would have been pure, ever. But God purifies whomever He wills. God is All-Hearing, All-Knowing.\n",
        "TRANSLATION_16": "O you who have believed, do not follow the footsteps of Satan. And whoever follows the footsteps of Satan - indeed, he enjoins immorality and wrongdoing. And if not for the favor of Allah upon you and His mercy, not one of you would have been pure, ever, but Allah purifies whom He wills, and Allah is Hearing and Knowing.\n",
        "TRANSLATION_17": "[24:21] O you who believe, do not follow in the steps of Satan, that is, his ways of making things seem attractive. For whoever follows in the steps of Satan, assuredly he, the one being followed, enjoins indecency, that is, [he enjoins] vile acts, and what is reprehensible, if followed, according to the Law. And were it not for God’s bounty to you and His mercy not one of you, O band [of accusers], would ever have grown pure, after the calumny of which you spoke, that is to say, [not one of you] would have ever been reformed or purified from this sin by repenting of it. But God purifies whom He will, from sin, by accepting his repentance from him, and God is Hearer, of what you have said, Knower, of your intentions.\n",
        "TRANSLATION_18": "Allah then warned the believers from following Satan, saying: (0 ye who believe) in Muhammad (pbuh) and in the Qur'an! (Follow not the footsteps of the devil) do not follow Satan's embellishment and whisperings. (Unto whomsoever followeth the footsteps of the devil) whoever follows Satan's embellishment and whisperings, (lo! he commandeth filthiness) evil words and deeds (and wrong) that which is not in the Shari'ah or the Sunnah. (Had it not been for the grace of Allah and His mercy unto you) through preserving you from sins and giving you success, (not one of you would ever have grown pure) no one of you would profess Allah's divine Oneness or become righteous. (But Allah causeth whom He will to grow) but Allah gives success and makes righteous whoever deserves it. (And Allah is Hearer) He hears what you say, (Knower) He knows you and your works.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "24:21",
            "2:268",
            "6:142",
            "8:17",
            "41:36",
            "2:64",
            "9:28",
            "4:83",
            "4:32",
            "49:1"
        ],
        "BIBLE": [
            "writings:daniel:3:29",
            "prophets:ezekiel:39:7",
            "writings:i%20chronicles:21:3",
            "writings:daniel:5:15",
            "torah:deuteronomy:13:15",
            "torah:exodus:23:13",
            "torah:deuteronomy:4:23",
            "prophets:ii%20samuel:23:5",
            "writings:daniel:9:27",
            "torah:deuteronomy:4:25"
        ]
    }
}