{
    "VERSE": "24:25",
    "ARABIC": "يَوْمَئِذٍ يُوَفِّيهِمُ ٱللَّهُ دِينَهُمُ ٱلْحَقَّ وَيَعْلَمُونَ أَنَّ ٱللَّهَ هُوَ ٱلْحَقُّ ٱلْمُبِينُ",
    "ENGLISH": {
        "TRANSLATION_0": "On that Day Allah will pay them in full what is due to them, and they will know that Allah is the Clear Truth.",
        "TRANSLATION_1": "God will pay them on that day their just due in full, and they will come to know that God is the tangible Reality.\n",
        "TRANSLATION_2": "On that Day Allah will give them the full recompense they deserve, and they will realize that Allah is the very Truth, Who makes the Truth manifest.\n",
        "TRANSLATION_3": "On that day God will give them due recompense and they will know that God is the Supreme Judge.\n",
        "TRANSLATION_4": "On that day Allah will give them their true punishment, and they will know that Allah only is the Clear Truth.\n",
        "TRANSLATION_5": "On that Day Allah will pay them the recompense of their deeds in full, and they will know that Allah, He is the Manifest Truth.\n",
        "TRANSLATION_6": "On that day Allah will pay back to them in full their just reward, and they shall know that Allah is the evident Truth.\n",
        "TRANSLATION_7": "Upon that day God will pay them in full their just due, and they shall know that God is the manifest Truth.\n",
        "TRANSLATION_8": "On that day Allah will pay them their just due, and they will know that Allah, He is the Manifest Truth.\n",
        "TRANSLATION_9": "on that Day God will justly requite them, and they will realize that God is the truth, that makes all things manifest.\n",
        "TRANSLATION_10": "On that Day Allah shall pay them in full their recompense, and they shall know that Allah! He is the True, the Manifest.\n",
        "TRANSLATION_11": "On that day, Allah will pay them in full their due recompense, and they shall know that Allah is the Manifest Reality.\n",
        "TRANSLATION_12": "On that Day Allah will pay them back (all) their just dues, and they will realise that Allah is the (very) Truth, that makes all things manifest.\n",
        "TRANSLATION_13": "On that Day Allah will pay them the recompense of their deeds in full, and they will know that Allah, He is the Manifest Truth.\n",
        "TRANSLATION_14": "Upon that Day Allah will pay them their due in full, and they will know that Allah is the clear truth.\n",
        "TRANSLATION_15": "On that Day, God will pay them their account in full, and they will know that God is the Evident Reality.\n",
        "TRANSLATION_16": "That Day, Allah will pay them in full their deserved recompense, and they will know that it is Allah who is the perfect in justice.\n",
        "TRANSLATION_17": "[24:25] On that day God will pay them in full their just due, He will requite them with the requital they deserve, and   they shall know that God is the Manifest Truth, since He will have realised for them that requital of His whereof they had been in doubt. Among such [people] is ‘Abd Allāh b. Ubayy. The ‘honourable women’ mentioned above are the Prophet’s (s) wives, regarding whom no repentance has been mentioned [as being possible] in the case of their being falsely accused; those women regarding whom repentance has been mentioned, however, at the beginning of the sūra [verses 4-5], in the case of their being falsely accused, are women other these [wives of the Prophet].\n",
        "TRANSLATION_18": "(On that day) the Day of Judgement (Allah will pay them their just due) he will fairly requite them for their works, (and they will know that Allah, He is the Manifest Truth) they will know that what Allah said in the life of this world is true.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "24:25",
            "39:2",
            "40:14",
            "39:11",
            "39:14",
            "27:79",
            "48:28",
            "3:86",
            "22:62",
            "31:30"
        ],
        "BIBLE": [
            "prophets:isaiah:61:8",
            "torah:deuteronomy:32:35",
            "prophets:isaiah:38:19",
            "prophets:ezekiel:35:11",
            "torah:exodus:18:16",
            "prophets:nahum:3:6",
            "prophets:i%20kings:14:13",
            "prophets:ezekiel:43:27",
            "prophets:ii%20samuel:7:21",
            "torah:numbers:30:9"
        ]
    }
}