{
    "VERSE": "24:27",
    "ARABIC": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ لَا تَدْخُلُوا۟ بُيُوتًا غَيْرَ بُيُوتِكُمْ حَتَّىٰ تَسْتَأْنِسُوا۟ وَتُسَلِّمُوا۟ عَلَىٰٓ أَهْلِهَا ذَٰلِكُمْ خَيْرٌ لَّكُمْ لَعَلَّكُمْ تَذَكَّرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "You who have iman! do not enter houses other than your own until you have asked permission and greeted their inhabitants. That is better for you, so that hopefully you will pay heed.",
        "TRANSLATION_1": "O you who believe, do not enter other houses except yours without first asking permission and saluting the inmates. This is better for you: You may haply take heed.\n",
        "TRANSLATION_2": "O Believers, do not enter other houses than your own until you have the approval of the inmates and have wished them peace; this is the best way for you: it is expected that you will observe it.\n",
        "TRANSLATION_3": "Believers, do not enter other's houses until you have asked permission and have greeted the people therein. This is best for you so that perhaps you may remember (God's guidance).\n",
        "TRANSLATION_4": "O People who Believe! Do not enter the houses except your own until you obtain permission and have conveyed peace upon its inhabitants; this is better for you, in order that you may ponder.\n",
        "TRANSLATION_5": "O you who believe! Enter not houses other than your own, until you have asked permission and greeted those in them; that is better for you, in order that you may remember.\n",
        "TRANSLATION_6": "O you who believe! Do not enter houses other than your own houses until you have asked permission and saluted their inmates; this is better for you, that you may be mindful.\n",
        "TRANSLATION_7": "O believers, do not enter houses other than your houses until you first ask leave and, salute the people thereof; that is better for you; haply you will remember.\n",
        "TRANSLATION_8": "O ye who believe! Enter not houses other than your own without first announcing your presence and invoking peace upon the folk thereof. That is better for you, that ye may be heedful.\n",
        "TRANSLATION_9": "Believers, do not enter other people's houses until you have asked their owners' permission and greeted them. That will be the better for you, so that you may be heedful.\n",
        "TRANSLATION_10": "O Ye who believe! enter not houses other than your own until ye have asked leave and invoked peace on the inmates thereof. That is better for you, haply ye may take heed.\n",
        "TRANSLATION_11": "O you who have faith! Do not enter houses other than your own until you have announced [your arrival] and greeted their occupants. That is better for you. Maybe you will take admonition.\n",
        "TRANSLATION_12": "O ye who believe! enter not houses other than your own, until ye have asked permission and saluted those in them: that is best for you, in order that ye may heed (what is seemly).\n",
        "TRANSLATION_13": "O you who believe! Enter not houses other than your own, until you have asked permission and greeted those in them, that is better for you, in order that you may remember.\n",
        "TRANSLATION_14": "Believers, do not enter houses other than your houses until you first ask permission and greet with peace the people thereof; that is better for you in order that you remember.\n",
        "TRANSLATION_15": "O you who believe! Do not enter homes other than your own, until you have asked permission and greeted their occupants. That is better for you, that you may be aware.\n",
        "TRANSLATION_16": "O you who have believed, do not enter houses other than your own houses until you ascertain welcome and greet their inhabitants. That is best for you; perhaps you will be reminded.\n",
        "TRANSLATION_17": "[24:27] O you who believe, do not enter houses other than your houses until you have [first] asked permission and greeted their occupants. So a person must say, ‘Peace be upon you, may I enter?’, as is stated in one hadīth. That is better for you, than entering without permission, that perhaps you might remember (tadhakkarūna: the second tā’ [of tatadhakkarūna] has been assimilated with the dhāl) the superiority of such [conduct] and so follow it.\n",
        "TRANSLATION_18": "Allah then prohibited them from entering in on one another without first asking permission, saying: (0 ye who believe) in Muhammad (pbuh) and in the Qur'an! (Enter not houses other than your own) you are not permitted to enter houses (without first announcing your presence and invoking peace upon the folk thereof. That) announcing your presence and invoking peace (is better for you) and more akin to righteousness, (that ye may be heedful) that you may take admonition and not enter in on each other without permission.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "24:27",
            "22:77",
            "24:29",
            "28:12",
            "98:7",
            "41:8",
            "3:200",
            "12:62",
            "98:1",
            "62:9"
        ],
        "BIBLE": [
            "writings:nehemiah:13:14",
            "prophets:ezekiel:36:32",
            "prophets:jeremiah:16:5",
            "prophets:ezekiel:18:30",
            "writings:i%20chronicles:28:8",
            "prophets:isaiah:3:14",
            "prophets:isaiah:2:3",
            "torah:genesis:42:33",
            "prophets:ezekiel:18:25",
            "prophets:micah:6:16"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:2:1"
        ]
    }
}