{
    "VERSE": "24:3",
    "ARABIC": "ٱلزَّانِى لَا يَنكِحُ إِلَّا زَانِيَةً أَوْ مُشْرِكَةً وَٱلزَّانِيَةُ لَا يَنكِحُهَآ إِلَّا زَانٍ أَوْ مُشْرِكٌ وَحُرِّمَ ذَٰلِكَ عَلَى ٱلْمُؤْمِنِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "A man who has fornicated may only marry a woman who has fornicated or a woman of the idolaters. A woman who has fornicated may only marry a man who has fornicated or a man of the idolaters. Doing such a thing is haram for the muminun.",
        "TRANSLATION_1": "The adulterer can marry no one but an adulteress or his partner (in the act), and the adulteress cannot marry any but an adulterer or her partner (in the act). This is forbidden the believers,\n",
        "TRANSLATION_2": "A man guilty of adultery (or fornication) shall not marry any but the woman guilty of the same or a mushrik woman, and none shall marry a woman guilty of adultery (or fornication) but the man guilty of the same or a mushrik man: such marriages are forbidden to true believers.\n",
        "TRANSLATION_3": "No one should marry a fornicator except a fornicatress or a pagan woman. No one should marry a fornicatress except a fornicator or a pagan man. Such (marriage) is unlawful to the believers.\n",
        "TRANSLATION_4": "The adulterer shall not marry except an adulteress or a polytheist woman, and none shall marry an adulteress except an adulterer or a polytheist; and this is forbidden for the believers.\n",
        "TRANSLATION_5": "The Zani marries not but a Zaniyah or a Mushrikah; and the Zaniyah, none marries her except a Zani or a Mushrik. Such a thing is forbidden to the believers.\n",
        "TRANSLATION_6": "The fornicator shall not marry any but a fornicatress or idolatress, and (as for) the fornicatress, none shall marry her but a fornicator or an idolater; and it is forbidden to the believers.\n",
        "TRANSLATION_7": "The fornicator shall marry none but a fornicatress or an idolatress, and the fornicatress -- none shall marry her but a fornicator or an idolator; that is forbidden to the believers.\n",
        "TRANSLATION_8": "The adulterer shall not marry save an adulteress or an idolatress, and the adulteress none shall marry save an adulterer or an idolater. All that is forbidden unto believers.\n",
        "TRANSLATION_9": "The adulterer shall marry only an adulteress or a polytheist woman, and an adulteress shall marry only an adulterer or a polytheist man; such marriages are forbidden for believers.\n",
        "TRANSLATION_10": "The adulterer weddeth not but an adulteress or an associatoress: and the adulteress! --none weddeth her save an adulterer or an associator; and that is forbidden unto the believers.\n",
        "TRANSLATION_11": "The fornicator will not marry anyone but a fornicatress or an idolatress, and the fornicatress will be married by none except a fornicator or an idolater, and that is forbidden to the faithful.\n",
        "TRANSLATION_12": "Let no man guilty of adultery or fornication marry and but a woman similarly guilty, or an Unbeliever: nor let any but such a man or an Unbeliever marry such a woman: to the Believers such a thing is forbidden.\n",
        "TRANSLATION_13": "The adulterer marries not but an adulteress or a Mushrikah and the adulteress none marries her except an adulterer or a Muskrik [and that means that the man who agrees to marry (have a sexual relation with) a Mushrikah (female polytheist, pagan or idolatress) or a prostitute, then surely he is either an adulterer, or a Mushrik (polytheist, pagan or idolater, etc.) And the woman who agrees to marry (have a sexual relation with) a Mushrik (polytheist, pagan or idolater) or an adulterer, then she is either a prostitute or a Mushrikah (female polytheist, pagan, or idolatress, etc.)]. Such a thing is forbidden to the believers (of Islamic Monotheism).\n",
        "TRANSLATION_14": "The fornicator shall marry none but a fornicatress or an idolatress; and the fornicatress none shall marry her but a fornicator or an idolater; that is forbidden to the believers.\n",
        "TRANSLATION_15": "The adulterer shall marry none but an adulteress or an idolatress; and the adulteress shall marry none but an adulterer or an idolater. That has been prohibited for the believers.\n",
        "TRANSLATION_16": "The fornicator does not marry except a [female] fornicator or polytheist, and none marries her except a fornicator or a polytheist, and that has been made unlawful to the believers.\n",
        "TRANSLATION_17": "[24:3] The fornicator shall not marry anyone but a fornicatress or an idolatress, and the fornicatress shall be married by none except a fornicator or an idolator, in other words, what is suitable for each of the two [for the purposes of marriage] is the above-mentioned; and that, namely, marrying of fornicators, is forbidden to believers, who are better [than those]. This was revealed when the poor among the Emigrants resolved to marry the wealthy whores of the idolaters, so that they [the women] would provide for them. Thus it is said that the prohibition applies specifically to them; but it is also said to apply in general; but it was abrogated by God’s words: Marry off the spouseless among you [Q. 24:32].\n",
        "TRANSLATION_18": "(The adulterer) from the people of the Book who admits his crime (shall not marry save an adulteress) from the slaves of the people of the Book (or an idolatress) from the slaves of the Arab idolaters, (and the adulteress none shall marry save an adulterer) from the people of the Book (or an idolater) from the Arab idolaters. (All that) marrying the slaves of the people of the Book and the slaves of Arab idolaters (is forbidden unto believers) this verse was revealed about a group among the Companions of the Prophet (pbuh) who wanted to marry some slaves from the people of the Book and Arab idolaters in Medina. These slaves were known adulteresses but these prophetic Companions wanted to marry them in order to win them over. When this verse was revealed they refrained from marrying them.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "24:3",
            "26:99",
            "56:79",
            "69:37",
            "27:85",
            "38:74",
            "29:43",
            "26:114",
            "83:33",
            "87:13"
        ],
        "BIBLE": [
            "prophets:judges:21:11",
            "prophets:isaiah:47:13",
            "writings:ecclesiastes:3:14",
            "torah:leviticus:21:18",
            "torah:numbers:5:10",
            "torah:leviticus:22:10",
            "writings:daniel:6:13",
            "torah:deuteronomy:22:5",
            "torah:deuteronomy:17:5",
            "torah:exodus:12:16"
        ]
    }
}