{
    "VERSE": "24:30",
    "ARABIC": "قُل لِّلْمُؤْمِنِينَ يَغُضُّوا۟ مِنْ أَبْصَٰرِهِمْ وَيَحْفَظُوا۟ فُرُوجَهُمْ ذَٰلِكَ أَزْكَىٰ لَهُمْ إِنَّ ٱللَّهَ خَبِيرٌۢ بِمَا يَصْنَعُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Say to the muminun that they should lower their eyes and guard their private parts. That is purer for them. Allah is aware of what they do.",
        "TRANSLATION_1": "Tell the believing men to lower their eyes and guard their private parts. There is for them goodness in this. God is aware of what they do.\n",
        "TRANSLATION_2": "And O Prophet, enjoin the Believing men to restrain their gaze and guard their private parts. This is a more righteous way for them: Allah has knowledge of what they do.\n",
        "TRANSLATION_3": "(Muhammad), tell the believing men to cast down their eyes and guard their carnal desires; this will make them more pure. God is certainly aware of what they do.\n",
        "TRANSLATION_4": "Command the Muslim men to keep their gaze low and to protect their private organs; that is much purer for them; indeed Allah is Aware of their deeds.\n",
        "TRANSLATION_5": "Tell the believing men to lower their gaze, and protect their private parts. That is purer for them. Verily, Allah is All-Aware of what they do.\n",
        "TRANSLATION_6": "Say to the believing men that they cast down their looks and guard their private parts; that is purer for them; surely Allah is Aware of what they do.\n",
        "TRANSLATION_7": "Say to the believers, that they cast down their eyes and guard their private parts; that is purer for them. God is aware of the things they work.\n",
        "TRANSLATION_8": "Tell the believing men to lower their gaze and be modest. That is purer for them. Lo! Allah is aware of what they do.\n",
        "TRANSLATION_9": "Tell believing men to lower their gaze and remain chaste. That is purer for them. God is aware of what they do.\n",
        "TRANSLATION_10": "Say thou unto the believers that they shall lower their sights and guard their private parts, that is cleaner for them; verlly Allah is Aware of that which they perform.\n",
        "TRANSLATION_11": "Tell the faithful men to cast down their looks and to guard their private parts. That is more decent for them. Allah is indeed well aware of what they do.\n",
        "TRANSLATION_12": "Say to the believing men that they should lower their gaze and guard their modesty: that will make for greater purity for them: And Allah is well acquainted with all that they do.\n",
        "TRANSLATION_13": "Tell the believing men to lower their gaze (from looking at forbidden things), and protect their private parts (from illegal sexual acts, etc.). That is purer for them. Verily, Allah is All-Aware of what they do.\n",
        "TRANSLATION_14": "Say to the believers they should lower their gaze and guard their private parts that is purer for them. Allah is Aware of the things they do.\n",
        "TRANSLATION_15": "Tell the believing men to restrain their looks, and to guard their privates. That is purer for them. God is cognizant of what they do.\n",
        "TRANSLATION_16": "Tell the believing men to reduce [some] of their vision and guard their private parts. That is purer for them. Indeed, Allah is Acquainted with what they do.\n",
        "TRANSLATION_17": "[24:30] Tell believing men to lower their gaze, from what is unlawful for them to look at (min [of min absārihim, ‘their gaze’] is extra) and to guard their private parts, from doing with them what is unlawful [for them to do]. That is purer, in other words, better, for them. Truly God is Aware of what they do, with their gazes and private parts, and He will requite them for it.\n",
        "TRANSLATION_18": "Allah then commanded them to protect their gaze and chastity, saying: (Tell the believing men) Muhammad (to lower their gaze) from that which is unlawful (and be modest) and also refrain from unlawful sexual intercourse. (That) protecting their gaze and chastity (is purer for them) is better and more akin to righteousness as far as they are concerned. (Lo! Allah is Aware of what they do) of good and evil. 389\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "24:30",
            "33:2",
            "2:110",
            "14:42",
            "64:2",
            "42:27",
            "47:23",
            "33:47",
            "35:31",
            "40:44"
        ],
        "BIBLE": [
            "writings:i%20chronicles:17:19",
            "prophets:ii%20samuel:23:5",
            "prophets:ii%20kings:7:19",
            "writings:psalms:71:16",
            "torah:deuteronomy:4:25",
            "prophets:ii%20kings:7:2",
            "prophets:ezekiel:24:16",
            "torah:exodus:34:10",
            "prophets:isaiah:43:19",
            "writings:daniel:6:13"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:1:8"
        ]
    }
}