{
    "VERSE": "24:32",
    "ARABIC": "وَأَنكِحُوا۟ ٱلْأَيَٰمَىٰ مِنكُمْ وَٱلصَّٰلِحِينَ مِنْ عِبَادِكُمْ وَإِمَآئِكُمْ إِن يَكُونُوا۟ فُقَرَآءَ يُغْنِهِمُ ٱللَّهُ مِن فَضْلِهِۦ وَٱللَّهُ وَٰسِعٌ عَلِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "Marry off those among you who are unmarried and those of your slaves and slavegirls who are righteous. If they are poor, Allah will enrich them from His bounty. Allah is All-Encompassing, All-Knowing.",
        "TRANSLATION_1": "Marry off those who are single among you, and those of your male and female servants who are righteous. If they are poor, God will enrich them of His grace, for God is bounteous and all-knowing.\n",
        "TRANSLATION_2": "Arrange marriages between the single men and women among your and between your slave men and slave women, who are righteous,, if they be indigent, Allah will provide means for them out of His bounty: Allah has boundless resources and He is AllKnowing.\n",
        "TRANSLATION_3": "Marry the single people among you and the righteous slaves and slave-girls. If you are poor, God will make you rich through His favor; He is Bountiful and All-knowing.\n",
        "TRANSLATION_4": "And enjoin in marriage those among you who are not married, and your deserving slaves and bondwomen; if they are poor, Allah will make them wealthy by His munificence; and Allah is Most Capable, All Knowing.\n",
        "TRANSLATION_5": "And marry those among you who are single (Al-Ayama) and the pious of your servants and maidservants. If they be poor, Allah will enrich them out of His bounty. And Allah is All-Sufficent, All-Knowing.\n",
        "TRANSLATION_6": "And marry those among you who are single and those who are fit among your male slaves and your female slaves; if they are needy, Allah will make them free from want out of His grace; and Allah is Ample-giving, Knowing.\n",
        "TRANSLATION_7": "Marry the spouseless among you, and your slaves and handmaidens that are righteous; if they are poor, God will enrich them of His bounty; God is All-embracing, All-knowing.\n",
        "TRANSLATION_8": "And marry such of you as are solitary and the pious of your slaves and maid-servants. If they be poor, Allah will enrich them of His bounty. Allah is of ample means, Aware.\n",
        "TRANSLATION_9": "Marry those among you who are single, and those of your male and female slaves who are fit [for marriage]. If they are poor, God will provide for them from His bounty, for God's bounty is infinite and He is all knowing.\n",
        "TRANSLATION_10": "And wed the single among you and the fit ones among your male and female slaves; if they are poor, Allah will enrich them of His grace; Allah is Ample, Knowing.\n",
        "TRANSLATION_11": "Marry off those who are single among you, and the upright among your male and female slaves. If they are poor, Allah will enrich them out of His grace, and Allah is all-bounteous, all-knowing.\n",
        "TRANSLATION_12": "Marry those among you who are single, or the virtuous ones among yourselves, male or female: if they are in poverty, Allah will give them means out of His grace: for Allah encompasseth all, and he knoweth all things.\n",
        "TRANSLATION_13": "And marry those among you who are single (i.e. a man who has no wife and the woman who has no husband) and (also marry) the Salihun (pious, fit and capable ones) of your (male) slaves and maid-servants (female slaves). If they be poor, Allah will enrich them out of His Bounty. And Allah is All-Sufficent for His creatures' needs, All-Knowing (about the state of the people).\n",
        "TRANSLATION_14": "Marry those among you who are spouseless and the virtuous among your male and female slaves (thereby freeing them), if they are poor, Allah will enrichthem of His bounty; Allah is Embracing, Knowing.\n",
        "TRANSLATION_15": "And wed the singles among you, and those who are fit among your servants and maids. If they are poor, God will enrich them from His bounty. God is All-Encompassing, All-Knowing.\n",
        "TRANSLATION_16": "And marry the unmarried among you and the righteous among your male slaves and female slaves. If they should be poor, Allah will enrich them from His bounty, and Allah is all-Encompassing and Knowing.\n",
        "TRANSLATION_17": "[24:32] And marry off the spouseless among you (ayāmā is the plural form of ayyim, namely, a spouseless female, whether she be a virgin or one previously married, or a spouseless male), this [stipulation] relates to free men and free women, and the righteous ones, the believers, among your male slaves and your female slaves (‘ibād is one plural form of ‘abd). If they, the free men, are poor, God will enrich them, through marriage, out of His bounty. God is Embracing, of [the needs of] His creatures, Knowing, of them.\n",
        "TRANSLATION_18": "Then Allah guided them to marry their boys and girls, brothers and sisters, who do not have spouses, saying: (And marry such of you as are solitary) your daughters and sisters; and it is said that this means: your children and brothers and sisters who are still unmarried (and the pious of your slaves and maid servants) and also get your pious slave men and women married. (If they) i.e. those who are free (be poor; Allah will enrich them of His bounty) of His provision. (Allah is of ample means) He provides for both those who are free as well as for the slaves, (Aware) and He is Aware of the provision of all of them.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "24:32",
            "2:268",
            "59:8",
            "9:75",
            "4:70",
            "29:62",
            "10:107",
            "2:64",
            "33:47",
            "30:54"
        ],
        "BIBLE": [
            "prophets:jeremiah:34:9",
            "torah:leviticus:11:43",
            "prophets:ii%20samuel:23:5",
            "prophets:ii%20kings:7:19",
            "writings:i%20chronicles:17:21",
            "torah:genesis:2:18",
            "prophets:isaiah:38:16",
            "prophets:ezekiel:30:12",
            "prophets:ii%20kings:10:5",
            "torah:numbers:16:13"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:3:5",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:6:3"
        ]
    }
}