{
    "VERSE": "24:35",
    "ARABIC": "ٱللَّهُ نُورُ ٱلسَّمَٰوَٰتِ وَٱلْأَرْضِ مَثَلُ نُورِهِۦ كَمِشْكَوٰةٍ فِيهَا مِصْبَاحٌ ٱلْمِصْبَاحُ فِى زُجَاجَةٍ ٱلزُّجَاجَةُ كَأَنَّهَا كَوْكَبٌ دُرِّىٌّ يُوقَدُ مِن شَجَرَةٍ مُّبَٰرَكَةٍ زَيْتُونَةٍ لَّا شَرْقِيَّةٍ وَلَا غَرْبِيَّةٍ يَكَادُ زَيْتُهَا يُضِىٓءُ وَلَوْ لَمْ تَمْسَسْهُ نَارٌ نُّورٌ عَلَىٰ نُورٍ يَهْدِى ٱللَّهُ لِنُورِهِۦ مَن يَشَآءُ وَيَضْرِبُ ٱللَّهُ ٱلْأَمْثَٰلَ لِلنَّاسِ وَٱللَّهُ بِكُلِّ شَىْءٍ عَلِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "Allah is the Light of the heavens and the earth. The metaphor of His Light is that of a niche in which is a lamp, the lamp inside a glass, the glass like a brilliant star, lit from a blessed tree, an olive, neither of the east nor of the west, its oil all but giving off light even if no fire touches it. Light upon Light. Allah guides to His Light whoever He wills and Allah makes metaphors for mankind and Allah has knowledge of all things.",
        "TRANSLATION_1": "God is the light of the heavens and the earth. The semblance of His light is that of a niche in which is a lamp, the flame within a glass, the glass a glittering star as it were, lit with the oil of a blessed tree, the olive, neither of the East nor of the West, whose oil appears to light up even though fire touches it not, -- light upon light. God guides to His light whom He will. So does God advance precepts of wisdom for men, for God has knowledge of everything.\n",
        "TRANSLATION_2": "Allah is the light of the heavens and the earth: His light (in the universe) may be likened (to the light of) a lamp in a niche: the lamp is in a glass shade: the glass shade is like a glittering star and lamp is lit with the olive oil of a blessed tree which is neither eastern nor western: its oil is (so fine) as if it were going to shine forth by itself though no fire touched it (as though all the means of increasing) light upon light (were provided); Allah guides to His light whomever He wills. He cites parables to make the Message clear to the people; He has perfect knowledge of everything.\n",
        "TRANSLATION_3": "God is the light of the heavens and the earth. A metaphor for His light is a niche in which there is a lamp placed in a glass. The glass is like a shining star which is lit from a blessed olive tree that is neither eastern nor western. Its oil almost lights up even though it has not been touched by the fire. It is light upon light. God guides to His light whomever He wants. God uses various metaphors. He has the knowledge of all things.\n",
        "TRANSLATION_4": "Allah is the Light of the heavens and the earth; the example of His light is like a niche in which is a lamp; the lamp is in a glass; the glass is as if it were a star shining like a pearl, kindled by the blessed olive tree, neither of the east nor of the west – it is close that the oil itself get ablaze although the fire does not touch it; light upon light; Allah guides towards His light whomever He wills; and Allah illustrates examples for mankind; and Allah knows everything. (The Holy Prophet is a light from Allah)\n",
        "TRANSLATION_5": "Allah is the Light of the heavens and the earth. The parable of His Light is as a niche and within it a lamp: the lamp is in a glass, the glass as it were a star Durriyyun, lit from a blessed tree, an olive, neither of the east nor of the west, whose oil would almost glow forth, though no fire touched it. Light upon Light! Allah guides to His Light whom He wills. And Allah sets forth parables for mankind, and Allah is All-Knower of everything.\n",
        "TRANSLATION_6": "Allah is the light of the heavens and the earth; a likeness of His light is as a niche in which is a lamp, the lamp is in a glass, (and) the glass is as it were a brightly shining star, lit from a blessed olive-tree, neither eastern nor western, the oil whereof almost gives light though fire touch it not-- light upon light-- Allah guides to His light whom He pleases, and Allah sets forth parables for men, and Allah is Cognizant of all things.\n",
        "TRANSLATION_7": "God is the Light of the heavens and the earth; the likeness of His Light is as a niche wherein is a lamp (the lamp in a glass, the glass as it were a glittering star) kindled from a Blessed Tree, an olive that is neither of the East nor of the West whose oil wellnigh would shine, even if no fire touched it; Light upon Light; (God guides to His Light whom He will.) (And God strikes similitudes for men, and God has knowledge of everything.)\n",
        "TRANSLATION_8": "Allah is the Light of the heavens and the earth. The similitude of His light is as a niche wherein is a lamp. The lamp is in a glass. The glass is as it were a shining star. (This lamp is) kindled from a blessed tree, an olive neither of the East nor of the West, whose oil would almost glow forth (of itself) though no fire touched it. Light upon light. Allah guideth unto His light whom He will. And Allah speaketh to mankind in allegories, for Allah is Knower of all things.\n",
        "TRANSLATION_9": "God is the light of the heavens and the earth. His light may be compared to a niche containing a lamp, the lamp inside a crystal of star-like brilliance lit from a blessed olive tree, neither of the east nor of the west. The [luminous] oil is as if ready to burn without even touching it. Light upon light; God guides to His light whom He will. God draws such comparisons for mankind; God has full knowledge of everything.\n",
        "TRANSLATION_10": "Allah is the light of the heavens and the earth: the likeness of His light is as a niche wherein is a lamp; the lamp is in glass; the glass is as though it were a star brilliant; lit from a tree blest, an olive, neither in the east nor in the west; well-nigh its oil would glow forth even though fire touch it not. light upon light. Allah guideth unto His light whomsoever He will: And Allah propoundeth similitudes for mankind: verily Allah is of everything the Knower.\n",
        "TRANSLATION_11": "Allah is the Light of the heavens and the earth. The parable of His Light is a niche wherein is a lamp—the lamp is in a glass, the glass as it were a glittering star—lit from a blessed olive tree, neither eastern nor western, whose oil almost lights up, though fire should not touch it. Light upon light. Allah guides to His Light whomever He wishes. Allah draws parables for mankind, and Allah has knowledge of all things.\n",
        "TRANSLATION_12": "Allah is the Light of the heavens and the earth. The Parable of His Light is as if there were a Niche and within it a Lamp: the Lamp enclosed in Glass: the glass as it were a brilliant star: Lit from a blessed Tree, an Olive, neither of the east nor of the west, whose oil is well-nigh luminous, though fire scarce touched it: Light upon Light! Allah doth guide whom He will to His Light: Allah doth set forth Parables for men: and Allah doth know all things.\n",
        "TRANSLATION_13": "Allah is the Light of the heavens and the earth. The parable of His Light is as (if there were) a niche and within it a lamp, the lamp is in glass, the glass as it were a brilliant star, lit from a blessed tree, an olive, neither of the east (i.e. neither it gets sun-rays only in the morning) nor of the west (i.e. nor it gets sun-rays only in the afternoon, but it is exposed to the sun all day long), whose oil would almost glow forth (of itself), though no fire touched it. Light upon Light! Allah guides to His Light whom He wills. And Allah sets forth parables for mankind, and Allah is All-Knower of everything.\n",
        "TRANSLATION_14": "Allah is the Lighter of the heavens and the earth. The example of His Light is like a tube, in which there is a wick. The wick is in a lamp and the lamp is as a glittering planet kindled from a Blessed Tree, an olive that is neither of the East nor of the West. Its oil would almost shine forth though no fire touched it. Light upon light; Allah guides to His Light whom He will. Allah strikes parables for people. Allah has knowledge of all things.\n",
        "TRANSLATION_15": "God is the Light of the heavens and the earth. The allegory of His light is that of a pillar on which is a lamp. The lamp is within a glass. The glass is like a brilliant planet, fueled by a blessed tree, an olive tree, neither eastern nor western. Its oil would almost illuminate, even if no fire has touched it. Light upon Light. God guides to His light whomever He wills. God thus cites the parables for the people. God is cognizant of everything.\n",
        "TRANSLATION_16": "Allah is the Light of the heavens and the earth. The example of His light is like a niche within which is a lamp, the lamp is within glass, the glass as if it were a pearly [white] star lit from [the oil of] a blessed olive tree, neither of the east nor of the west, whose oil would almost glow even if untouched by fire. Light upon light. Allah guides to His light whom He wills. And Allah presents examples for the people, and Allah is Knowing of all things.\n",
        "TRANSLATION_17": "[24:35] God is the Light of the heavens and the earth, in other words, He illumines both of them with the sun and the moon. The likeness of His Light, that is, the description of it [as it resides] in the heart of a believer, is as a niche wherein is a lamp. The lamp is in a glass — this [glass] is the [case for the] lantern and the misbāh is the torch, that is, the wick that is lit; al-mishkāt is a recess that does not penetrate [to the other side], in other words, the tube inside the lantern, the glass, with the light inside it [is], as it were a glittering star, that is, a light-giving [star] (read dirrī’un or durrī’un, derived from al-dar‘, ‘to repel’, because it repels darkness; or read durriyyun, derived from al-durr, ‘pearls’) kindled, is this lamp (read past tense tawaqqada; a variant reading has the imperfect tense of awqada, in the passive voice: yūqadu; another reading has tūqadu, in which case the reference is to al-zujāja, ‘the glass’) from, the oil of, a Blessed Tree, an olive neither of the east nor of the west, but in between the two, so that no harmful cold or heat affects it; whose oil would almost glow forth [of itself], though no fire touched it, because of [the extent of] its purity. Light, by Him, upon light, by fire; the light of God is His guidance of the believer, light upon the light of faith. God guides to His Light, that is, [to] the religion of Islam, whom He will. And God strikes, He illustrates, similitudes for men, by approximating [such similitudes] to their comprehension, so that they might take heed and believe; and God is Knower of all things, including [knowledge of] how to strike similitudes.\n",
        "TRANSLATION_18": "Allah then mentioned the honour and blessings that He had bestowed upon the believers, saying: (Allah is the Light of the heavens and the earth) He is the guide of the dwellers of the heaves and earth. Guidance from Allah is of two types: clarification and making things known; it is also said that the verse means: Allah is the embellisher of the heavens by means of the stars and the embellisher of the earth by means of plants and water; it is also said that this means: Allah enlightens the hearts of the believers among the dwellers of the heavens and the earth. (The similitude of His light) the light of the believers; it is also said that this means: the light of Allah in the heart of the believer (is as a niche wherein is a lamp. The lamp is in a glass) made of gems. (The glass is as it were a shining star) one of the following five planets: Mercury, Jupiter, Venus, Mars and Saturn. All these planets are luminous. ((This lamp is) kindled from a blessed tree) from the oil of a blessed tree, (an olive neither of the East nor of the West) in an open space, not touched by the shade of the East nor by the shade of the West; it is also said that this means: in a location which is untouched by the sun when it rises and when it sets, (whose oil) the oil of the tree (would almost glow forth (of itself)) from behind its rind (though no fire touched it. Light upon light) the lamp emits light and the glass emits light and the oil emits light, (Allah guideth unto His light) Allah honours with knowledge; it is also said that this means: Allah honours with His religion (whom He will) whoever deserves it; it is also said that the verse means: the likeness of the light of Muhammad in the loins of his forefathers is like this, up to Allah's saying (... kindled from a blessed tree). He says: the light of Muhammad in Abraham was an upright religion (olive tree), and Abraham was neither Jew nor Christian (neither of the East nor of the West), the works of Abraham would almost glow forth in the loins of his forefathers like this (would almost glow forth (of itself)), up until Allah's saying (kindled from a blessed tree) He says: as if it is the light of Muhammad (pbuh) and if Abraham was not a prophet, he would still have this light (though no fire touched it); it is also said that the latter passage means: Had Allah not honoured Abraham, he would not have had this light; it is also said: if Allah had not honoured His believing servant with this light, he would not have had it. (And Allah speaketh to mankind in allegories) in this way does Allah show to people the trait of knowledge, (for Allah is knower of all things) regarding the honour He bestows upon His servants. Allah struck this similitude of knowledge and clarified its benefit and its praiseworthiness in order that they give thanks to it. Allah says here that just as one uses a lamp to find his way in the dark, so is the light of knowledge used for one's guidance; and just as one uses the stars and planets to find one's way in the darkness of the seas and land, one also uses the light of knowledge for guidance in the darkness of disbelief and idolatry; and just as the oil of a lamp is taken from the blessed olive tree, so too is knowledge from Allah, Exalted is He, for His servant; and just as the olive tree is neither from the East nor from the West, so too is the believer an upright Muslim, neither Jew nor Christian; and just as the oil of the olive tree would almost glow forth of itself even when no fire touches it, so too the faith of the believer is praiseworthy even when there are no virtuous works to accompany it; and just as the niche and the glass and the lamp are light upon light, so too is knowledge light, and the heart of the believer is light and his chest is light and his incoming is light and his outgoing is light: light upon light; and Allah honours with this light whomever He wills. Such is Allah's description of knowledge.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "24:35",
            "49:16",
            "24:64",
            "42:12",
            "5:97",
            "24:41",
            "18:45",
            "2:284",
            "5:40",
            "31:20"
        ],
        "BIBLE": [
            "prophets:isaiah:13:10",
            "writings:ecclesiastes:1:13",
            "prophets:ezekiel:32:7",
            "torah:exodus:36:6",
            "prophets:ii%20kings:7:19",
            "prophets:isaiah:42:16",
            "torah:genesis:24:43",
            "torah:genesis:1:26",
            "writings:ruth:4:7",
            "writings:ecclesiastes:8:15"
        ]
    }
}