{
    "VERSE": "24:42",
    "ARABIC": "وَلِلَّهِ مُلْكُ ٱلسَّمَٰوَٰتِ وَٱلْأَرْضِ وَإِلَى ٱللَّهِ ٱلْمَصِيرُ",
    "ENGLISH": {
        "TRANSLATION_0": "The kingdom of the heavens and earth belongs to Allah and Allah is the final destination.",
        "TRANSLATION_1": "For God's is the kingdom of the heavens and the earth, and the returning is to God.\n",
        "TRANSLATION_2": "The kingdom of the heavens and the earth belongs to Allah alone, and all shall have to return to Him.\n",
        "TRANSLATION_3": "To God belongs the kingdom of the heavens and the earth, and to Him do all things return.\n",
        "TRANSLATION_4": "And for Allah only is the kingship of the heavens and the earth; and towards Allah is the return.\n",
        "TRANSLATION_5": "And to Allah belongs the sovereignty of the heavens and the earth, and to Allah is the return.\n",
        "TRANSLATION_6": "And Allah's is the kingdom of the heavens and the earth, and to Allah is the eventual coming.\n",
        "TRANSLATION_7": "To God belongs the Kingdom of the heavens and the earth, and to Him is the homecoming.\n",
        "TRANSLATION_8": "And unto Allah belongeth the Sovereignty of the heavens and the earth, and unto Allah is the journeying.\n",
        "TRANSLATION_9": "To God belongs the kingdom of the heavens and the earth, and to God shall all things return.\n",
        "TRANSLATION_10": "And Allah's is the dominion of the heavens and the earth, and unto Allah is the return.\n",
        "TRANSLATION_11": "To Allah belongs the kingdom of the heavens and the earth, and toward Allah is the destination.\n",
        "TRANSLATION_12": "Yea, to Allah belongs the dominion of the heavens and the earth; and to Allah is the final goal (of all).\n",
        "TRANSLATION_13": "And to Allah belongs the sovereignty of the heavens and the earth, and to Allah is the return (of all).\n",
        "TRANSLATION_14": "To Allah belongs the Kingdom of the heavens and the earth. To Him is the arrival.\n",
        "TRANSLATION_15": "To God belongs the dominion of the heavens and the earth, and to God is the ultimate return.\n",
        "TRANSLATION_16": "And to Allah belongs the dominion of the heavens and the earth, and to Allah is the destination.\n",
        "TRANSLATION_17": "[24:42] And to God belongs the kingdom of the heavens and the earth, the treasuries of rain, provision and vegetation, and with God is the journey’s end, the [final] return.\n",
        "TRANSLATION_18": "(And Unto Allah belongeth the sovereignty) the storehouses (of the heavens) rain (and the earth) vegetation, (and unto Allah is the journeying) the return after death.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "24:42",
            "57:5",
            "45:27",
            "42:49",
            "48:14",
            "39:44",
            "85:9",
            "3:189",
            "3:109",
            "9:116"
        ],
        "BIBLE": [
            "writings:daniel:11:9",
            "writings:daniel:11:28",
            "prophets:isaiah:23:17",
            "torah:deuteronomy:10:14",
            "prophets:isaiah:10:21",
            "prophets:isaiah:65:17",
            "prophets:jeremiah:10:11",
            "torah:genesis:18:14",
            "writings:proverbs:6:16",
            "prophets:i%20kings:12:24"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:3:3"
        ]
    }
}