{
    "VERSE": "24:47",
    "ARABIC": "وَيَقُولُونَ ءَامَنَّا بِٱللَّهِ وَبِٱلرَّسُولِ وَأَطَعْنَا ثُمَّ يَتَوَلَّىٰ فَرِيقٌ مِّنْهُم مِّنۢ بَعْدِ ذَٰلِكَ وَمَآ أُو۟لَٰٓئِكَ بِٱلْمُؤْمِنِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "They say, 'We have iman in Allah and in the Messenger and we obey.' Then after that a group of them turn away. Such people are not muminun.",
        "TRANSLATION_1": "They say they believe in God and the Prophet, and have come to believe, yet a section of them turns back even after this; and these are not believers.\n",
        "TRANSLATION_2": "These people say \"We have believed in Allah and the Messenger and we have submitted\"; but soon after this, some of them turn away (from obedience): such people are not true Believers.\n",
        "TRANSLATION_3": "They say, \"We have believed in God and the Messenger and we have obeyed them.\" Then a group of them turn away from their (belief). They are not believers.\n",
        "TRANSLATION_4": "And they say, “We have accepted faith in Allah and His Noble Messenger, and we obey”; then after that a group among them turns away; and they are not Muslims.\n",
        "TRANSLATION_5": "They say: \"We have believed in Allah and in the Messenger, and we obey,\" then a party of them turn away thereafter, such are not believers.\n",
        "TRANSLATION_6": "And they say: We believe in Allah and in the apostle and we obey; then a party of them turn back after this, and these are not believers.\n",
        "TRANSLATION_7": "They say, 'We believe in God and the Messenger, and we obey.' Then after that a party of them turn away; those -- they are not believers.\n",
        "TRANSLATION_8": "And they say: We believe in Allah and the messenger, and we obey; then after that a faction of them turn away. Such are not believers.\n",
        "TRANSLATION_9": "They say, \"We believe in God and in the Messenger, and we obey.\" But then, even after that a group of them will turn away. Those are surely not believers\n",
        "TRANSLATION_10": "And they say: we have believed in Allah and in the apostle and we have obeyed; then there backslide a party of them thereafter: and these are not believers.\n",
        "TRANSLATION_11": "They say, ‘We have faith in Allah and His Apostle, and we obey.’ Then, after that, a part of them refuse to comply, and they do not have faith.\n",
        "TRANSLATION_12": "They say, \"We believe in Allah and in the messenger, and we obey\": but even after that, some of them turn away: they are not (really) Believers.\n",
        "TRANSLATION_13": "They (hypocrites) say: \"We have believed in Allah and in the Messenger (Muhammad SAW), and we obey,\" then a party of them turn away thereafter, such are not believers.\n",
        "TRANSLATION_14": "They say: 'We believe in Allah and the Messenger and obey' But a party of them turn away after this. Those are not believers.\n",
        "TRANSLATION_15": "And they say, “We have believed in God and the Messenger, and we obey,” but some of them turn away afterwards. These are not believers.\n",
        "TRANSLATION_16": "But the hypocrites say, \"We have believed in Allah and in the Messenger, and we obey\"; then a party of them turns away after that. And those are not believers.\n",
        "TRANSLATION_17": "[24:47]   And they, the hypocrites, say, ‘We believe in, we affirm [the truth of], God, [of] His Oneness, and the Messenger, Muhammad (s), and we obey’, them in what rulings they [God and Muhammad] give. Then after that a party of them turn away, they are averse to it, and those, those who are averse, they are not believers, as [believers] should be, [believers] whose hearts agree with [the words of] their tongues.\n",
        "TRANSLATION_18": "Allah then revealed the following about the folk of 'Uthman who told the latter: \"do not go to the Prophet (pbuh) in order to settle your dispute with 'AN regarding a piece of land, because He will take 'All's side\", and 'Uthman rebuked them for saying this: (And they say) i.e. the people of 'Uthman: (We believe in Allah and the messenger) we are sincere in our belief in Allah and the Messenger, (and we obey) that with which we have been commanded; (then after that) after saying this about obeying Allah (a faction of them) of the people of 'Uthman (turn away. Such are not believers) who are sincere in their faith.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "24:47",
            "3:172",
            "24:48",
            "4:80",
            "2:75",
            "24:52",
            "2:27",
            "3:132",
            "8:13",
            "59:4"
        ],
        "BIBLE": [
            "prophets:isaiah:42:17",
            "prophets:i%20samuel:15:30",
            "prophets:jonah:3:9",
            "prophets:ezekiel:14:6",
            "prophets:hosea:2:25",
            "torah:deuteronomy:30:3",
            "prophets:judges:20:8",
            "torah:genesis:42:28",
            "prophets:jeremiah:42:2",
            "torah:deuteronomy:9:12"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:1:13"
        ]
    }
}