{
    "VERSE": "24:48",
    "ARABIC": "وَإِذَا دُعُوٓا۟ إِلَى ٱللَّهِ وَرَسُولِهِۦ لِيَحْكُمَ بَيْنَهُمْ إِذَا فَرِيقٌ مِّنْهُم مُّعْرِضُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "When they are summoned to Allah and His Messenger, so that he can judge between them, a group of them immediately turn away.",
        "TRANSLATION_1": "When they are called to God and His Prophet, that he may judge between them, a section of them turns away.\n",
        "TRANSLATION_2": "When they are called to Allah and His Messenger so that the Messenger may judge between them, a party of them turns away.\n",
        "TRANSLATION_3": "When they are called to God and His Messenger so that they will judge among them, suddenly, some of them turn away.\n",
        "TRANSLATION_4": "And when called towards Allah and His Noble Messenger in order that the Noble Messenger may judge between them, thereupon a group among them turns away.\n",
        "TRANSLATION_5": "And when they are called to Allah and His Messenger, to judge between them, lo! a party of them refuses and turns away.\n",
        "TRANSLATION_6": "And when they are called to Allah and His Apostle that he may judge between them, lo! a party of them turn aside.\n",
        "TRANSLATION_7": "When they are called to God and His Messenger that he may judge between them, lo, a party of them are swerving aside;\n",
        "TRANSLATION_8": "And when they appeal unto Allah and His messenger to judge between them, lo! a faction of them are averse;\n",
        "TRANSLATION_9": "and when they are called to God and His Messenger so that he may judge between them, some of them turn away.\n",
        "TRANSLATION_10": "And when they are called to Allah and His apostle that he may judge between them, lo! a party of them are averters.\n",
        "TRANSLATION_11": "When they are summoned to Allah and His Apostle that He may judge between them, behold, a part of them turn aside.\n",
        "TRANSLATION_12": "When they are summoned to Allah and His messenger, in order that He may judge between them, behold some of them decline (to come).\n",
        "TRANSLATION_13": "And when they are called to Allah (i.e. His Words, the Quran) and His Messenger (SAW), to judge between them, lo! a party of them refuse (to come) and turn away.\n",
        "TRANSLATION_14": "And when they are called to Allah and His Messenger so that he judges between them, a party of them swerve away.\n",
        "TRANSLATION_15": "And when they are called to God and His Messenger, in order to judge between them, some of them refuse.\n",
        "TRANSLATION_16": "And when they are called to [the words of] Allah and His Messenger to judge between them, at once a party of them turns aside [in refusal].\n",
        "TRANSLATION_17": "[24:48] And when they are summoned to God and His Messenger, who conveys His words, that he may judge between them, behold, a party of them are averse, to come to him.\n",
        "TRANSLATION_18": "(And when they appeal unto Allah) when they are called to the Book of Allah (and His messenger to judge between them) by Allah's Book, (lo! a faction of them are averse) from the Book of Allah and the judgement of the Messenger;\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "24:48",
            "24:51",
            "8:24",
            "8:1",
            "3:23",
            "4:150",
            "24:47",
            "48:9",
            "4:152",
            "9:1"
        ],
        "BIBLE": [
            "torah:exodus:3:4",
            "torah:exodus:19:7",
            "writings:esther:9:26",
            "prophets:jeremiah:36:16",
            "prophets:jeremiah:15:16",
            "writings:ii%20chronicles:35:22",
            "torah:deuteronomy:28:14",
            "prophets:malachi:3:24",
            "prophets:jeremiah:19:6",
            "prophets:jeremiah:34:15"
        ]
    }
}