{
    "VERSE": "24:51",
    "ARABIC": "إِنَّمَا كَانَ قَوْلَ ٱلْمُؤْمِنِينَ إِذَا دُعُوٓا۟ إِلَى ٱللَّهِ وَرَسُولِهِۦ لِيَحْكُمَ بَيْنَهُمْ أَن يَقُولُوا۟ سَمِعْنَا وَأَطَعْنَا وَأُو۟لَٰٓئِكَ هُمُ ٱلْمُفْلِحُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "The reply of the muminun when they are summoned to Allah and His Messenger so that he can judge between them, is to say, 'We hear and we obey.' They are ones who are successful.",
        "TRANSLATION_1": "The answer of the believers when they are called to God and His Apostle that he may judge between them, is: \"We hear and obey.\" And they are the ones who will prosper.\n",
        "TRANSLATION_2": "As regards the Believers, when they are called towards Allah and His Messenger so that the Messenger may judge between them, they say, \"We have heard and obeyed\"; such are the people who attain true success,\n",
        "TRANSLATION_3": "When the believers are called to God and His Messenger to be judged, their only words are, \"We have listened and obeyed.\" They will have everlasting happiness.\n",
        "TRANSLATION_4": "The saying of the Muslims when they are called towards Allah and His Noble Messenger in order that the Noble Messenger judge between them is that they submit, “We hear and we obey”; and it is they who have attained the goal.\n",
        "TRANSLATION_5": "The only saying of the faithful believers, when they are called to Allah and His Messenger, to judge between them, is that they say: \"We hear and we obey.\" And such are the successful.\n",
        "TRANSLATION_6": "The response of the believers, when they are invited to Allah and His Apostle that he may judge between them, is only to say: We hear and we obey; and these it is that are the successful.\n",
        "TRANSLATION_7": "All that the believers say, when they are called to God and His Messenger, that he may judge between them, is that they say, 'We hear, and we obey'; those -- they are the prosperers.\n",
        "TRANSLATION_8": "The saying of (all true) believers when they appeal unto Allah and His messenger to judge between them is only that they say: We hear and we obey. And such are the successful.\n",
        "TRANSLATION_9": "The response of the believers, when they are called to God and His Messenger in order that he may judge between them, is only, \"We hear and we obey.\" It is they who will prosper:\n",
        "TRANSLATION_10": "-The only saying of the believers when they were called to Allah and His apostle thathe might judge between them was that they said: We hear and we obey. And these! they are the very ones blissful.\n",
        "TRANSLATION_11": "All the response of the faithful, when they are summoned to Allah and His Apostle that He may judge between them, is to say, ‘We hear and obey.’ It is they who are the felicitous.\n",
        "TRANSLATION_12": "The answer of the Believers, when summoned to Allah and His Messenger, in order that He may judge between them, is no other than this: they say, \"We hear and we obey\": it is such as these that will attain felicity.\n",
        "TRANSLATION_13": "The only saying of the faithful believers, when they are called to Allah (His Words, the Quran) and His Messenger (SAW), to judge between them, is that they say: \"We hear and we obey.\" And such are the prosperous ones (who will live forever in Paradise).\n",
        "TRANSLATION_14": "But when the believers are called to Allah and His Messenger, in order that he judges between them, their reply is: 'We hear and obey' Such are theprosperous.\n",
        "TRANSLATION_15": "The response of the believers, when they are called to God and His Messenger in order to judge between them, is to say, “We hear and we obey.” These are the successful.\n",
        "TRANSLATION_16": "The only statement of the [true] believers when they are called to Allah and His Messenger to judge between them is that they say, \"We hear and we obey.\" And those are the successful.\n",
        "TRANSLATION_17": "[24:51] All that the believers say, when they are summoned to God and His Messenger, that he may judge between them, is that they say, in other words, the saying that befits them is [to say]: ‘We hear and we obey’, by responding [to the summons]. And those, then, are the successful, the ones who will be saved.\n",
        "TRANSLATION_18": "Allah then mentioned what the sincere believers say, saying: (The saying of (all true) believers) such as 'Uthman who said to 'AN: \"rather, I will come with you to the Prophet (pbuh) and I will accept his judgement whatever it is\", and so Allah praised him for saying so, (when they appeal unto Allah) when they are called to the Book of Allah (and His messenger) and to the wont of His Messenger (to judge) for the Prophet to judge (between them) by Allah's Book (is only that they say: We hear and we obey) what we have been commanded with. (And such are the successful) such are the ones, i.e. 'Uthman Ibn 'Affan, who will escape Allah's wrath and chastisement. 393\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "24:51",
            "24:48",
            "4:150",
            "8:24",
            "63:1",
            "58:20",
            "4:61",
            "8:1",
            "58:5",
            "24:52"
        ],
        "BIBLE": [
            "torah:genesis:21:17",
            "torah:deuteronomy:5:25",
            "torah:genesis:3:9",
            "writings:i%20chronicles:4:10",
            "prophets:jeremiah:15:16",
            "prophets:judges:16:28",
            "torah:exodus:19:9",
            "prophets:jeremiah:35:17",
            "prophets:jeremiah:42:4",
            "writings:nehemiah:8:9"
        ]
    }
}