{
    "VERSE": "24:57",
    "ARABIC": "لَا تَحْسَبَنَّ ٱلَّذِينَ كَفَرُوا۟ مُعْجِزِينَ فِى ٱلْأَرْضِ وَمَأْوَىٰهُمُ ٱلنَّارُ وَلَبِئْسَ ٱلْمَصِيرُ",
    "ENGLISH": {
        "TRANSLATION_0": "Do not imagine that those who are kafir are able to escape Allah on earth. Their shelter will be the Fire. What an evil destination!",
        "TRANSLATION_1": "Do not think that unbelievers will subvert (the authority of God) on earth. Their abode is Hell; and what an evil destination!\n",
        "TRANSLATION_2": "Do not think about those who have disbelieved that they will be able to frustrate Allah in the land; their abode is Hell and it is a very evil abode.\n",
        "TRANSLATION_3": "The unbelievers should not think that they can defeat God on earth. Their dwelling will be hell, the most terrible abode.\n",
        "TRANSLATION_4": "Do not ever think that the disbelievers can escape from Our control in the land; and their destination is the fire; and indeed what a wretched outcome!\n",
        "TRANSLATION_5": "Consider not that the disbelievers can escape in the land. Their abode shall be the Fire -- and worst indeed is that destination.\n",
        "TRANSLATION_6": "Think not that those who disbelieve shall escape in the earth, and their abode is the fire; and certainly evil is the resort!\n",
        "TRANSLATION_7": "Think not the unbelievers able to frustrate God in the earth; their refuge is the Fire -- an evil homecoming.\n",
        "TRANSLATION_8": "Think not that the disbelievers can escape in the land. Fire will be their home - a hapless journey's end!\n",
        "TRANSLATION_9": "Do not think that those who deny the truth can frustrate Our plan on earth; their abode shall be Hell; and it is indeed an evil resort.\n",
        "TRANSLATION_10": "Deem not those who disbelieve able to frustrate His Purpose on the earth; and their abode shall be the Fire--an ill retreat!\n",
        "TRANSLATION_11": "Do not suppose that those who are faithless can frustrate [Allah] on the earth. Their refuge shall be the Fire, and it is surely an evil destination.\n",
        "TRANSLATION_12": "Never think thou that the Unbelievers are going to frustrate (Allah's Plan) on earth: their abode is the Fire,- and it is indeed an evil refuge!\n",
        "TRANSLATION_13": "Consider not that the disbelievers can escape in the land. Their abode shall be the Fire, and worst indeed is that destination.\n",
        "TRANSLATION_14": "Never think that the unbelievers will be able to frustrate (Us) in the earth. Their refuge is the Fire, an evil arrival.\n",
        "TRANSLATION_15": "Never think that those who disbelieve can escape on earth. Their place is the Fire; a miserable destination.\n",
        "TRANSLATION_16": "Never think that the disbelievers are causing failure [to Allah] upon the earth. Their refuge will be the Fire - and how wretched the destination.\n",
        "TRANSLATION_17": "[24:57] And do not suppose (read tahsabanna or yahsabanna, the subject of the verb being the Messenger) that those who disbelieve can escape, Us, in the land, by eluding us. For their abode will be, their return will be [to], the Fire, and it is surely an evil destination, it is an [evil] place of return.\n",
        "TRANSLATION_18": "(Think not) Muhammad (that the disbelievers) of Mecca (can escape) from Allah's punishment (in the land. Fire) in the Hereafter (will be their home) their abode, (a hapless journey's end) to which they will return with the satans! This verse was revealed about Abu Jahl and his host.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "24:57",
            "26:152",
            "57:15",
            "10:8",
            "38:28",
            "64:10",
            "26:183",
            "23:79",
            "3:131",
            "29:9"
        ],
        "BIBLE": [
            "prophets:zephaniah:2:11",
            "prophets:ii%20samuel:7:23",
            "prophets:ii%20kings:5:11",
            "torah:deuteronomy:16:6",
            "prophets:jeremiah:44:14",
            "prophets:isaiah:16:4",
            "writings:ii%20chronicles:6:18",
            "writings:psalms:9:7",
            "prophets:i%20kings:8:27",
            "writings:ecclesiastes:7:14"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:12",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:14",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:3:2"
        ]
    }
}