{
    "VERSE": "24:64",
    "ARABIC": "أَلَآ إِنَّ لِلَّهِ مَا فِى ٱلسَّمَٰوَٰتِ وَٱلْأَرْضِ قَدْ يَعْلَمُ مَآ أَنتُمْ عَلَيْهِ وَيَوْمَ يُرْجَعُونَ إِلَيْهِ فَيُنَبِّئُهُم بِمَا عَمِلُوا۟ وَٱللَّهُ بِكُلِّ شَىْءٍ عَلِيمٌۢ",
    "ENGLISH": {
        "TRANSLATION_0": "Everything in the heavens and the earth belongs to Allah. He knows what you are engaged upon. On the Day when they are returned to Him, He will inform them of what they did. Allah has knowledge of all things.",
        "TRANSLATION_1": "Does not everything in the heavens and the earth belong to God? He surely knows what state you are in; and on the day they go back to Him. He will tell them what they used to do, for God has knowledge of everything.\n",
        "TRANSLATION_2": "Beware! whatever is in the heavens and the earth belongs to Allah. He knows whatever you are doing. On the Day you shall return to Him, He will let you know what you have. done: He has full knowledge of everything.\n",
        "TRANSLATION_3": "The heavens and the earth, certainly, belong to God. He surely knows all about you in this life. On the day when you return to Him, He will tell you all about whatever you have done. God has the knowledge of all things.\n",
        "TRANSLATION_4": "Pay heed! Indeed to Allah only belong whatsoever is in the heavens and in the earth; He knows the condition you are in; and on the Day when they are returned to Him, He will then inform them of whatever they did; and Allah knows all things.\n",
        "TRANSLATION_5": "Certainly, to Allah belongs all that is in the heavens and the earth. Indeed, He knows your condition and the Day when they will be brought back to Him, then He will inform them of what they did. And Allah is All-Knower of everything.\n",
        "TRANSLATION_6": "Now surely Allah's is whatever is in the heavens and the earth; He knows indeed that to which you are conforming yourselves; and on the day on which they are returned to Him He will inform them of what they did; and Allah is Cognizant of all things.\n",
        "TRANSLATION_7": "Why, surely to God belongs whatsoever is in the heavens and the earth; He ever knows what state you are upon; and the day when they shall be returned to Him, then He will tell them of what they did; and God knows everything.\n",
        "TRANSLATION_8": "Lo! verily unto Allah belongeth whatsoever is in the heavens and the earth. He knoweth your condition. And (He knoweth) the Day when they are returned unto Him so that He may inform them of what they did. Allah is Knower of all things.\n",
        "TRANSLATION_9": "Surely, whatever is in the heavens and on the earth belongs to God. God knows well what condition you are in. On the Day when they return to Him, He will declare to them all that they have done. God has full knowledge of all things.\n",
        "TRANSLATION_10": "Lo! verily Allah's is whatsoever is in the heavens and the earth; surely He knoweth that which ye are about and the Day whereon they shall be made to return unto Him; then He shall declare unto them that which they worked; and Allah is of everything the Knower.\n",
        "TRANSLATION_11": "Behold! To Allah indeed belongs whatever is in the heavens and the earth. He certainly knows your present state. The day they are brought back to Him He will inform them about what they have done, and Allah has knowledge of all things.\n",
        "TRANSLATION_12": "Be quite sure that to Allah doth belong whatever is in the heavens and on earth. Well doth He know what ye are intent upon: and one day they will be brought back to Him, and He will tell them the truth of what they did: for Allah doth know all things.\n",
        "TRANSLATION_13": "Certainly, to Allah belongs all that is in the heavens and the earth. Surely, He knows your condition and (He knows) the Day when they will be brought back to Him, then He will inform them of what they did. And Allah is All-Knower of everything.\n",
        "TRANSLATION_14": "To Allah belongs all that is in the heavens and the earth. He has Knowledge of what state you are upon. On the Day when they shall be returned to Him, He will tell them all what they have done. And Allah has knowledge of everything.\n",
        "TRANSLATION_15": "Surely, to God belongs everything in the heavens and the earth. He knows what you are about. And on the Day they are returned to Him, He will inform them of what they did. God has full knowledge of all things.\n",
        "TRANSLATION_16": "Unquestionably, to Allah belongs whatever is in the heavens and earth. Already He knows that upon which you [stand] and [knows] the Day when they will be returned to Him and He will inform them of what they have done. And Allah is Knowing of all things.\n",
        "TRANSLATION_17": "[24:64] Lo! surely to God belongs all that is in the heavens and the earth, by way of possession, creation and servitude. He is ever aware of how you, O you who are obligated to [the prescriptions of] the Law, are behaving, with regard to faith or hypocrisy, and, He knows, the day when they shall be returned to Him (there is a shift here from the second person address [to that of the third person]), in other words, [He knows] when this [day] will be — He will inform them, thereupon, of what they did, of good and evil, and God is Knower of all things, which they do and otherwise. Meccan, except for verses 68, 69 and 70, which are Medinese; it consists of 77 verses, and was revealed after [sūrat] Yāsīn.\n",
        "TRANSLATION_18": "Lo! verily Unto Allah belongeth whatsoever is in the heavens and the earth) of created beings. (He knoweth your condition) whether it is disbelief or faith, trueness or denial, sincerity or hypocrisy, uprightness or crookedness, etc. (And (He knoweth) the Day when they are returned unto Him) unto Allah on the Day of Judgement (so that He may inform them of what they did) in this worldly life. (Allah is Knower of all things) concerning their works'. And of the surah in which the Criterion is mentioned, which is all Meccan and consists of 97 verses, 392 words and 3,763 letters: Surah 25: the Criterion (al-Furqan) And of the surah in which the Criterion is mentioned, which is all Meccan and consists of 97 verses, 392 words and 3,763 letters:\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "24:64",
            "4:126",
            "49:16",
            "24:41",
            "3:5",
            "42:12",
            "2:284",
            "27:87",
            "5:120",
            "3:29"
        ],
        "BIBLE": [
            "torah:deuteronomy:17:4",
            "torah:deuteronomy:31:18",
            "prophets:ezekiel:7:13",
            "writings:daniel:7:16",
            "prophets:isaiah:41:22",
            "prophets:ii%20kings:5:15",
            "prophets:jeremiah:42:4",
            "prophets:habakkuk:1:5",
            "torah:exodus:9:16",
            "writings:psalms:40:6"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:6:2"
        ]
    }
}