{
    "VERSE": "24:7",
    "ARABIC": "وَٱلْخَٰمِسَةُ أَنَّ لَعْنَتَ ٱللَّهِ عَلَيْهِ إِن كَانَ مِنَ ٱلْكَٰذِبِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "and a fifth time that Allah's curse will be upon them if they are lying.",
        "TRANSLATION_1": "And (swear) a fifth time that if he tell a lie the curse of God be on him.\n",
        "TRANSLATION_2": "Then the fifth time he shall declare that Allah's curse be upon him if he be false (in his charge).\n",
        "TRANSLATION_3": "They should say on the fifth time, \"Let God's curse be upon me if I am a liar\".\n",
        "TRANSLATION_4": "And the fifth time, that the curse of Allah be upon him if he is a liar.\n",
        "TRANSLATION_5": "And the fifth (testimony); invoking of the curse of Allah on him if he be of those who tell a lie.\n",
        "TRANSLATION_6": "And the fifth (time) that the curse of Allah be on him if he is one of the liars.\n",
        "TRANSLATION_7": "and a fifth time, that the curse of God shall be upon him, if he should be of the liars.\n",
        "TRANSLATION_8": "And yet a fifth, invoking the curse of Allah on him if he is of those who lie.\n",
        "TRANSLATION_9": "and the fifth time, that God's curse may be upon him if he is telling a lie.\n",
        "TRANSLATION_10": "And the fifth, that the curse of Allah be upon him if he be of the liars.\n",
        "TRANSLATION_11": "and a fifth [oath] that Allah’s wrath shall be upon him if he were lying.\n",
        "TRANSLATION_12": "And the fifth (oath) (should be) that they solemnly invoke the curse of Allah on themselves if they tell a lie.\n",
        "TRANSLATION_13": "And the fifth (testimony) (should be) the invoking of the Curse of Allah on him if he be of those who tell a lie (against her).\n",
        "TRANSLATION_14": "and the fifth time, that the curse of Allah shall be upon him, if he should be of the liars.\n",
        "TRANSLATION_15": "And the fifth time, that God’s curse be upon him, if he is a liar.\n",
        "TRANSLATION_16": "And the fifth [oath will be] that the curse of Allah be upon him if he should be among the liars.\n",
        "TRANSLATION_17": "[24:7] and a fifth time that God’s wrath shall be upon him if he were lying, in this (the predicate of the subject [fashahādatu ahadihim, ‘then the testimony of one of them’] is [the implicit] ‘will spare him the prescribed [legal] punishment for [false] accusation’).\n",
        "TRANSLATION_18": "(And yet a fifth, invoking the curse of Allah on him) and on the fifth the man should invoke Allah's curse on himself (if he is of those who lie) about his wife having committed adultery.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "24:7",
            "24:9",
            "39:57",
            "33:64",
            "3:87",
            "8:61",
            "41:33",
            "40:79",
            "39:66",
            "2:103"
        ],
        "BIBLE": [
            "writings:daniel:2:7",
            "prophets:jeremiah:27:4",
            "writings:psalms:109:8",
            "torah:numbers:18:5",
            "torah:deuteronomy:22:17",
            "torah:leviticus:18:30",
            "torah:numbers:1:53",
            "prophets:i%20kings:19:2",
            "prophets:isaiah:46:10",
            "writings:daniel:2:9"
        ]
    }
}