{
    "VERSE": "24:8",
    "ARABIC": "وَيَدْرَؤُا۟ عَنْهَا ٱلْعَذَابَ أَن تَشْهَدَ أَرْبَعَ شَهَٰدَٰتٍۭ بِٱللَّهِ إِنَّهُۥ لَمِنَ ٱلْكَٰذِبِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "And the punishment is removed from her if she testifies four times by Allah that he is lying",
        "TRANSLATION_1": "The woman's punishment can be averted if she swears four times by God as testimony that her husband is a liar,\n",
        "TRANSLATION_2": "(As for the woman), it shall avert the punishment from her if she swears four times by Allah that the man is false (in his charge)\n",
        "TRANSLATION_3": "The spouse will be acquitted of the punishment if she challenges his testimony by saying four times, \"God is my witness that he is a liar\".\n",
        "TRANSLATION_4": "And the punishment shall be averted from the woman if she bears the testimony four times by the name of Allah, that the man is a liar.\n",
        "TRANSLATION_5": "But she shall avert the punishment from her, if she bears witness four times by Allah, that he is telling a lie.\n",
        "TRANSLATION_6": "And it shall avert the chastisement from her if she testify four times, bearing Allah to witness that he is most surely one of the liars;\n",
        "TRANSLATION_7": "It shall avert from her the chastisement if she testify by God four times that he is of the liars,\n",
        "TRANSLATION_8": "And it shall avert the punishment from her if she bear witness before Allah four times that the thing he saith is indeed false,\n",
        "TRANSLATION_9": "The wife shall receive no punishment, if she bears witness four times in the name of God that her husband has lied\n",
        "TRANSLATION_10": "And it will revert the chastisement from her if she testifieth by Allah four times that verily he is of the liars.\n",
        "TRANSLATION_11": "The punishment shall be averted from her by her testifying with four oaths [sworn] by Allah that he is indeed lying,\n",
        "TRANSLATION_12": "But it would avert the punishment from the wife, if she bears witness four times (with an oath) By Allah, that (her husband) is telling a lie;\n",
        "TRANSLATION_13": "But it shall avert the punishment (of stoning to death) from her, if she bears witness four times by Allah, that he (her husband) is telling a lie.\n",
        "TRANSLATION_14": "But the punishment will be averted from her if she swears four times that he is of the liars,\n",
        "TRANSLATION_15": "But punishment shall be averted from her, if she swears four times by God, that he is a liar.\n",
        "TRANSLATION_16": "But it will prevent punishment from her if she gives four testimonies [swearing] by Allah that indeed, he is of the liars.\n",
        "TRANSLATION_17": "[24:8] And the punishment, namely, the prescribed [legal] punishment for fornication that is established upon his testimony, shall be averted from her if she testify [swearing] by God four times that he is indeed lying, in accusing her of having fornicated;\n",
        "TRANSLATION_18": "(And it shall avert) the judge will abstain from applying (the punishment from her) the punishment of stoning on the accused wife (if she bear witness before Allah four times) if the woman swears four times by Allah with Whom there is no other god (that the thing he) her husband (saith is indeed false) is untrue, 386\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "24:8",
            "24:6",
            "29:54",
            "9:67",
            "58:15",
            "3:76",
            "88:24",
            "37:152",
            "52:27",
            "29:29"
        ],
        "BIBLE": [
            "writings:nehemiah:7:2",
            "torah:genesis:12:20",
            "writings:job:34:13",
            "prophets:jeremiah:44:20",
            "torah:deuteronomy:31:23",
            "torah:genesis:30:18",
            "torah:deuteronomy:16:17",
            "torah:genesis:3:12",
            "torah:deuteronomy:3:18",
            "torah:numbers:18:8"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:2"
        ]
    }
}