{
    "VERSE": "114:4",
    "ARABIC": "مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ",
    "ENGLISH": {
        "TRANSLATION_0": "from the evil of the insidious whisperer",
        "TRANSLATION_1": "From the evil of him who breathes temptations into the minds of men,\n",
        "TRANSLATION_2": "from the mischief of the whispering, elusive prompter who returns again and again,\n",
        "TRANSLATION_3": "against the evil of the temptations of the satans,\n",
        "TRANSLATION_4": "“From the evil of the one who instils evil thoughts in the hearts – and stays hidden.”\n",
        "TRANSLATION_5": "From the evil of the whisperer who withdraws.\"\n",
        "TRANSLATION_6": "From the evil of the whisperings of the slinking (Shaitan),\n",
        "TRANSLATION_7": "from the evil of the slinking whisperer\n",
        "TRANSLATION_8": "From the evil of the sneaking whisperer,\n",
        "TRANSLATION_9": "from the mischief of every sneaking whis-perer,\n",
        "TRANSLATION_10": "From the evil of the sneaking whisperer\n",
        "TRANSLATION_11": "from the evil of the sneaky tempter\n",
        "TRANSLATION_12": "From the mischief of the Whisperer (of Evil), who withdraws (after his whisper),-\n",
        "TRANSLATION_13": "From the evil of the whisperer (devil who whispers evil in the hearts of men) who withdraws (from his whispering in one's heart after one remembers Allah),\n",
        "TRANSLATION_14": "from the evil of the slinking whisperer.\n",
        "TRANSLATION_15": "From the evil of the sneaky whisperer.\n",
        "TRANSLATION_16": "From the evil of the retreating whisperer -\n",
        "TRANSLATION_17": "[114:4] from the evil of the slinking whisperer, Satan — he is referred to by the name of the action [waswasa] on account of his repeated engaging in it — who slinks [away] and recoils from the heart whenever God is mentioned,\n",
        "TRANSLATION_18": "(From the evil of the sneaking whisperer) i.e. Satan who runs away and hides himself whenever Allah is mentioned,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "114:4",
            "113:2",
            "17:11",
            "81:15",
            "113:5",
            "113:3",
            "41:49",
            "17:83",
            "41:51",
            "113:4"
        ],
        "BIBLE": [
            "prophets:jeremiah:48:31",
            "torah:deuteronomy:20:8",
            "prophets:jeremiah:23:20",
            "prophets:jeremiah:30:24",
            "prophets:jeremiah:24:7",
            "torah:genesis:6:5",
            "prophets:hosea:11:9",
            "writings:proverbs:28:14",
            "writings:psalms:109:16",
            "prophets:isaiah:57:1"
        ]
    }
}