{
    "VERSE": "73:10",
    "ARABIC": "وَٱصْبِرْ عَلَىٰ مَا يَقُولُونَ وَٱهْجُرْهُمْ هَجْرًا جَمِيلًا",
    "ENGLISH": {
        "TRANSLATION_0": "Be steadfast in the face of what they say and cut yourself off from them - but courteously.",
        "TRANSLATION_1": "Bear with patience what they say, and gracefully come away from them.\n",
        "TRANSLATION_2": "And bear patiently the vain things they utter, and gracefully forsake them.\n",
        "TRANSLATION_3": "Bear patiently whatever they say, do not yield to them and keep on preaching decently to them.\n",
        "TRANSLATION_4": "And patiently endure upon what the disbelievers say, and leave them for good.\n",
        "TRANSLATION_5": "And be patient with what they say, and keep away from them in a good way.\n",
        "TRANSLATION_6": "And bear patiently what they say and avoid them with a becoming avoidance.\n",
        "TRANSLATION_7": "And bear thou patiently what they say, and forsake them graciously.\n",
        "TRANSLATION_8": "And bear with patience what they utter, and part from them with a fair leave-taking.\n",
        "TRANSLATION_9": "Bear patiently with what they say, and ignore them politely.\n",
        "TRANSLATION_10": "And bear thou with patience whatsoever they say, and depart from them with a becoming departure.\n",
        "TRANSLATION_11": "and be patient over what they say, and distance yourself from them in a graceful manner.\n",
        "TRANSLATION_12": "And have patience with what they say, and leave them with noble (dignity).\n",
        "TRANSLATION_13": "And be patient (O Muhammad SAW) with what they say, and keep away from them in a good way.\n",
        "TRANSLATION_14": "Bear patiently with what they say and with a fine abandonment forsake them.\n",
        "TRANSLATION_15": "And endure patiently what they say, and withdraw from them politely.\n",
        "TRANSLATION_16": "And be patient over what they say and avoid them with gracious avoidance.\n",
        "TRANSLATION_17": "[73:10] and bear patiently what they say, that is, the disbelievers of Mecca, in the way of their maltreatment [of you], and part with them in a gracious manner, without any anguish — this was [revealed] before the command to fight them.\n",
        "TRANSLATION_18": "(And bear with patience) Muhammad (what they utter) of vilification and denial, (and part from them with a fair leave-taking) steer clear of them in a fair way, neither grieving nor reciprocating with indecency.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "73:10",
            "83:33",
            "6:9",
            "85:7",
            "56:21",
            "26:112",
            "33:49",
            "33:61",
            "70:5",
            "16:23"
        ],
        "BIBLE": [
            "prophets:jeremiah:3:5",
            "writings:ruth:1:12",
            "torah:deuteronomy:1:14",
            "torah:exodus:18:17",
            "prophets:i%20samuel:3:17",
            "prophets:ezekiel:33:8",
            "prophets:i%20samuel:26:25",
            "writings:daniel:12:8",
            "prophets:ii%20kings:5:19",
            "writings:ezra:9:10"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:2",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:1:1"
        ]
    }
}