{
    "VERSE": "73:12",
    "ARABIC": "إِنَّ لَدَيْنَآ أَنكَالًا وَجَحِيمًا",
    "ENGLISH": {
        "TRANSLATION_0": "With Us there are shackles and a Blazing Fire",
        "TRANSLATION_1": "Verily We shall have fetters with Us, and a roaring furnace,\n",
        "TRANSLATION_2": "We have heavy fetters and a blazing Fire in store for them;\n",
        "TRANSLATION_3": "We have prepared for them fetters, flaming fire,\n",
        "TRANSLATION_4": "Indeed We have heavy fetters and a blazing fire.\n",
        "TRANSLATION_5": "Verily, with Us are Ankal, and Jahim.\n",
        "TRANSLATION_6": "Surely with Us are heavy fetters and a flaming fire,\n",
        "TRANSLATION_7": "for with Us there are fetters, and a furnace,\n",
        "TRANSLATION_8": "Lo! with Us are heavy fetters and a raging fire,\n",
        "TRANSLATION_9": "We have in store for them heavy fetters and a blazing Fire,\n",
        "TRANSLATION_10": "Verily with us are heavy fetters and Scorch.\n",
        "TRANSLATION_11": "Indeed with Us are heavy fetters and a fierce fire,\n",
        "TRANSLATION_12": "With Us are Fetters (to bind them), and a Fire (to burn them),\n",
        "TRANSLATION_13": "Verily, with Us are fetters (to bind them), and a raging Fire.\n",
        "TRANSLATION_14": "We have fetters (for them) and a blazing fire,\n",
        "TRANSLATION_15": "With Us are shackles, and a Fierce Fire.\n",
        "TRANSLATION_16": "Indeed, with Us [for them] are shackles and burning fire\n",
        "TRANSLATION_17": "[73:12] [For] indeed with Us are heavy fetters (ankāl is the plural of nikl), heavy shackles, and a hell-fire, a scorching Fire,\n",
        "TRANSLATION_18": "(Lo! with Us) for them in the Hereafter (are heavy fetters) with which their hands will be tied to their necks and chains will also be put around their necks (and a raging fire) which they will enter,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "73:12",
            "56:94",
            "83:16",
            "82:14",
            "26:91",
            "81:12",
            "69:31",
            "36:32",
            "79:36",
            "37:68"
        ],
        "BIBLE": [
            "torah:leviticus:6:6",
            "prophets:ezekiel:24:10",
            "prophets:isaiah:33:12",
            "prophets:isaiah:43:2",
            "torah:exodus:12:10",
            "writings:lamentations:2:3",
            "prophets:ezekiel:46:15",
            "writings:daniel:3:17",
            "writings:psalms:11:6",
            "prophets:ii%20samuel:23:7"
        ]
    }
}