{
    "VERSE": "73:15",
    "ARABIC": "إِنَّآ أَرْسَلْنَآ إِلَيْكُمْ رَسُولًا شَٰهِدًا عَلَيْكُمْ كَمَآ أَرْسَلْنَآ إِلَىٰ فِرْعَوْنَ رَسُولًا",
    "ENGLISH": {
        "TRANSLATION_0": "We have sent you a Messenger to bear witness against you just as We sent Pharaoh a Messenger.",
        "TRANSLATION_1": "We have sent an Apostle to you as a witness against you, as We had sent an apostle to the Pharaoh.\n",
        "TRANSLATION_2": "Surely We have sent to you a Messenger as a witness over you, just as We had sent a Messenger to Pharaoh.\n",
        "TRANSLATION_3": "We have sent you a Messenger, who will witness your deeds, just as We sent a Messenger to the Pharaoh.\n",
        "TRANSLATION_4": "We have indeed sent a Noble Messenger towards you, a present witness over you – the way We had sent a Noble Messenger towards Firaun.\n",
        "TRANSLATION_5": "Verily, We have sent to you a Messenger to be a witness over you, as We did send a Messenger to Fir`awn.\n",
        "TRANSLATION_6": "Surely We have sent to you an Apostle, a witness against you, as We sent an apostle to Firon.\n",
        "TRANSLATION_7": "Surely We have sent unto you a Messenger as a witness over you, even as We sent to Pharaoh a Messenger,\n",
        "TRANSLATION_8": "Lo! We have sent unto you a messenger as witness against you, even as We sent unto Pharaoh a messenger.\n",
        "TRANSLATION_9": "We have sent a messenger who is a witness over you, just as We sent a messenger to Pharoah before you.\n",
        "TRANSLATION_10": "Verily We! We have sent Unto you an apostle, a witness over you, even as We sent Unto Fir'awn an apostle.\n",
        "TRANSLATION_11": "Indeed We have sent to you an apostle, to be a witness to you, just as We sent an apostle to Pharaoh.\n",
        "TRANSLATION_12": "We have sent to you, (O men!) a messenger, to be a witness concerning you, even as We sent a messenger to Pharaoh.\n",
        "TRANSLATION_13": "Verily, We have sent to you (O men) a Messenger (Muhammad SAW) to be a witness over you, as We did send a Messenger [Musa (Moses)] to Fir'aun (Pharaoh).\n",
        "TRANSLATION_14": "Indeed, We have sent to you a Messenger as a witness over you, just as We sent a Messenger to Pharaoh.\n",
        "TRANSLATION_15": "We have sent to you a messenger, a witness over you, as We sent to Pharaoh a messenger.\n",
        "TRANSLATION_16": "Indeed, We have sent to you a Messenger as a witness upon you just as We sent to Pharaoh a messenger.\n",
        "TRANSLATION_17": "[73:15] We have indeed sent to you, O people of Mecca, a Messenger, namely, Muhammad (s), to be a witness against you, on the Day of Resurrection to any disobedience that you engage in, just as We sent to Pharaoh a messenger, namely, Moses, peace be upon him.\n",
        "TRANSLATION_18": "Lo! We have sent unto you a messenger) i.e. Muhammad (pbuh) (as witness against you) that he has conveyed the message, (even as We sent unto Pharaoh a messenger) i.e. Moses.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "73:15",
            "26:27",
            "64:12",
            "5:92",
            "26:125",
            "26:178",
            "26:162",
            "26:143",
            "26:107",
            "73:16"
        ],
        "BIBLE": [
            "prophets:ezekiel:33:8",
            "writings:psalms:142:5",
            "writings:proverbs:2:12",
            "prophets:jeremiah:26:3",
            "prophets:jeremiah:10:23",
            "torah:genesis:44:15",
            "writings:proverbs:14:14",
            "writings:psalms:77:14",
            "prophets:i%20kings:21:11",
            "prophets:ii%20kings:6:19"
        ]
    }
}