{
    "VERSE": "73:16",
    "ARABIC": "فَعَصَىٰ فِرْعَوْنُ ٱلرَّسُولَ فَأَخَذْنَٰهُ أَخْذًا وَبِيلًا",
    "ENGLISH": {
        "TRANSLATION_0": "But Pharaoh disobeyed the Messenger, so We seized him with terrible severity.",
        "TRANSLATION_1": "But the Pharaoh disobeyed the apostle; so We seized him with a grievous punishment.\n",
        "TRANSLATION_2": "But Pharaoh disobeyed Our Messenger, so We seized him with a terrible seizing.\n",
        "TRANSLATION_3": "However, the Pharaoh disobeyed the Messenger and We seized him with a severe retribution.\n",
        "TRANSLATION_4": "In response Firaun disobeyed the Noble Messenger, so We seized him with a severe seizure.\n",
        "TRANSLATION_5": "But Fir`awn disobeyed the Messenger; so We seized him with a severe punishment.\n",
        "TRANSLATION_6": "But Firon disobeyed the apostle, so We laid on him a violent hold.\n",
        "TRANSLATION_7": "but Pharaoh rebelled against the Messenger, so We seized him remorselessly.\n",
        "TRANSLATION_8": "But Pharaoh rebelled against the messenger, whereupon We seized him with no gentle grip.\n",
        "TRANSLATION_9": "But Pharoah rebelled against the messenger, so We seized him with a strong, crushing grip.\n",
        "TRANSLATION_10": "Then Fir'awn disobeyed the apostle, wherefore We laid hold of him with a painful hold.\n",
        "TRANSLATION_11": "But Pharaoh disobeyed the apostle; so We seized him with a terrible seizing.\n",
        "TRANSLATION_12": "But Pharaoh disobeyed the messenger; so We seized him with a heavy Punishment.\n",
        "TRANSLATION_13": "But Fir'aun (Pharaoh) disobeyed the Messenger [Musa (Moses)], so We seized him with a severe punishment.\n",
        "TRANSLATION_14": "Pharaoh disobeyed Our Messenger, so We seized him remorselessly.\n",
        "TRANSLATION_15": "But Pharaoh defied the Messenger, so We seized him with a terrible seizing.\n",
        "TRANSLATION_16": "But Pharaoh disobeyed the messenger, so We seized him with a ruinous seizure.\n",
        "TRANSLATION_17": "[73:16] But Pharaoh disobeyed the messenger, so We seized him with a severe seizing.\n",
        "TRANSLATION_18": "(But Pharaoh rebelled against the messenger) i.e. Moses, and did not accept his call, (whereupon We seized him with no gentle grip) therefore We punished him with a severe punishment, i.e. by drowning.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "73:16",
            "26:16",
            "24:52",
            "3:53",
            "5:92",
            "73:15",
            "64:12",
            "64:8",
            "77:11",
            "40:70"
        ],
        "BIBLE": [
            "prophets:ii%20samuel:11:25",
            "writings:lamentations:1:20",
            "prophets:i%20kings:11:30",
            "torah:exodus:5:9",
            "torah:exodus:4:4",
            "prophets:isaiah:53:5",
            "prophets:jeremiah:49:24",
            "writings:job:33:7",
            "torah:genesis:19:16",
            "prophets:isaiah:53:10"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:6:5"
        ]
    }
}