{
    "VERSE": "73:17",
    "ARABIC": "فَكَيْفَ تَتَّقُونَ إِن كَفَرْتُمْ يَوْمًا يَجْعَلُ ٱلْوِلْدَٰنَ شِيبًا",
    "ENGLISH": {
        "TRANSLATION_0": "How will you safeguard yourselves, if you are kafir, against a Day which will turn children grey,",
        "TRANSLATION_1": "How then, if you disbelieve, will you preserve yourselves on the day which will even turn the children hoary?\n",
        "TRANSLATION_2": "If you persist in disbelieving, how will you guard yourself against the (woe of the) Day that will turn children grey-haired,\n",
        "TRANSLATION_3": "If you, disbelieve, how will you be able to protect yourselves from the hardships of the day which would even turn children grey-headed?\n",
        "TRANSLATION_4": "So how will you save yourselves, if you disbelieve, on a day that will turn children old?\n",
        "TRANSLATION_5": "Then how can you protect yourselves from the punishment, if you disbelieve, on a Day that will make the children gray-headed\n",
        "TRANSLATION_6": "How, then, will you guard yourselves, if you disbelieve, on the day which shall make children grey-headed?\n",
        "TRANSLATION_7": "If therefore you disbelieve, how will you guard yourselves against a day that shall make the children grey-headed?\n",
        "TRANSLATION_8": "Then how, if ye disbelieve, will ye protect yourselves upon the day which will turn children grey,\n",
        "TRANSLATION_9": "If you persist in denying the truth how will you escape the Day that will turn the children's hair grey.\n",
        "TRANSLATION_10": "How then, if ye disbelieve, shall ye escape, on a Day which shall make children grey-headed.\n",
        "TRANSLATION_11": "So, if you disbelieve, how will you avoid the day, which will make children white-headed,\n",
        "TRANSLATION_12": "Then how shall ye, if ye deny (Allah), guard yourselves against a Day that will make children hoary-headed?-\n",
        "TRANSLATION_13": "Then how can you avoid the punishment, if you disbelieve, on a Day that will make the children grey-headed (i.e. the Day of Resurrection)?\n",
        "TRANSLATION_14": "If you disbelieve, how will you guard yourself against the Day that will make children gray haired,\n",
        "TRANSLATION_15": "So how will you, if you persist in unbelief, save yourself from a Day which will turn the children gray-haired?\n",
        "TRANSLATION_16": "Then how can you fear, if you disbelieve, a Day that will make the children white- haired?\n",
        "TRANSLATION_17": "[73:17] So, if you disbelieve, in this world, how will you guard against a day (yawman is the direct object of tattaqūna, ‘you guard against’) that is, against the chastisement thereof, by what defence will you defend yourselves against the chastisement of a day, that will make the children grey-haired (shīb is the plural of ashyab) by the severity of its terrors, this being the Day of Resurrection (the shīn of shīb should actually have a damma, but it is given a kasra because of its [phonetic] affinity with the yā’) — a distressing day is described as being ‘a day that makes the forelocks of children turn grey’, which is [usually] understood figuratively; but it may be that in the case of this verse it is meant literally —\n",
        "TRANSLATION_18": "(Then how) will you ward off disbelief, idolatry and indecencies, people of Mecca (if ye disbelieve) in the life of the world, (will ye protect yourselves upon the day) the Day of Judgement (which will turn children grey) when they hear Allah say to Adam: \"0 Adam! Send a group from your progeny to the Fire\". Adam will say: \"0 Lord! How many?\" Allah will say: \"From every one thousand, send 999 to the Fire and one person to the Garden\",\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "73:17",
            "20:64",
            "14:41",
            "37:73",
            "36:59",
            "28:65",
            "23:113",
            "79:6",
            "19:29",
            "47:27"
        ],
        "BIBLE": [
            "prophets:jeremiah:31:13",
            "prophets:isaiah:38:19",
            "writings:esther:9:22",
            "writings:job:41:20",
            "torah:exodus:23:27",
            "prophets:zephaniah:3:20",
            "torah:leviticus:11:43",
            "writings:ii%20chronicles:6:24",
            "prophets:jeremiah:30:11",
            "torah:numbers:30:9"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:11",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:6:2"
        ]
    }
}