{
    "VERSE": "73:19",
    "ARABIC": "إِنَّ هَٰذِهِۦ تَذْكِرَةٌ فَمَن شَآءَ ٱتَّخَذَ إِلَىٰ رَبِّهِۦ سَبِيلًا",
    "ENGLISH": {
        "TRANSLATION_0": "This truly is a reminder, so let anyone who wills take the Way towards his Lord.",
        "TRANSLATION_1": "Verily this is a reminder. So let him who desires take the way to his Lord.\n",
        "TRANSLATION_2": "Indeed this is nothing but a Good Counsel; so let him who will take a way leading to his Lord.\n",
        "TRANSLATION_3": "This is a reminder. Let anyone who wants, seek guidance from his Lord.\n",
        "TRANSLATION_4": "This is indeed an advice; so whoever wishes may take the path towards his Lord.\n",
        "TRANSLATION_5": "Verily, this is an admonition, therefore whosoever wills, let him take a path to His Lord!\n",
        "TRANSLATION_6": "Surely this is a reminder, then let him, who will take the way to his Lord.\n",
        "TRANSLATION_7": "Surely this is a Reminder; so let him who will take unto his Lord a way.\n",
        "TRANSLATION_8": "Lo! This is a Reminder. Let him who will, then, choose a way unto his Lord.\n",
        "TRANSLATION_9": "This, surely, is an admonition. So let him who will, take the right path to his Lord.\n",
        "TRANSLATION_10": "Verily this is an admonition; let him therefore, who will, choose a way Unto his Lord.\n",
        "TRANSLATION_11": "This is indeed a reminder. So let anyone who wishes take the way toward his Lord.\n",
        "TRANSLATION_12": "Verily this is an Admonition: therefore, whoso will, let him take a (straight) path to his Lord!\n",
        "TRANSLATION_13": "Verily, this is an admonition, therefore whosoever will, let him take a Path to His Lord!\n",
        "TRANSLATION_14": "This is indeed a Reminder. Let whosoever will take the Path to his Lord.\n",
        "TRANSLATION_15": "This is a reminder. So whoever wills, let him take a path to his Lord.\n",
        "TRANSLATION_16": "Indeed, this is a reminder, so whoever wills may take to his Lord a way.\n",
        "TRANSLATION_17": "[73:19] Indeed these, threatening verses, are a reminder, an admonition for all creatures. Let him who will, then, choose a way to his Lord, a path [to Him], through faith and obedience.\n",
        "TRANSLATION_18": "(Lo! This) surah (is a Reminder) is an admonition and clarification for you. (Let him who will, then, choose a way unto his Lord) a way to head towards Allah; it is also said this means: let him who will use this to return to his Lord.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "73:19",
            "76:29",
            "68:7",
            "23:107",
            "6:117",
            "36:25",
            "7:125",
            "54:10",
            "20:74",
            "37:31"
        ],
        "BIBLE": [
            "prophets:hosea:14:10",
            "writings:proverbs:12:15",
            "writings:psalms:5:9",
            "writings:psalms:107:7",
            "prophets:jeremiah:6:16",
            "writings:proverbs:16:29",
            "writings:psalms:34:11",
            "writings:psalms:27:11",
            "writings:job:34:4",
            "writings:ezra:8:21"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:5:1"
        ]
    }
}