{
    "VERSE": "73:4",
    "ARABIC": "أَوْ زِدْ عَلَيْهِ وَرَتِّلِ ٱلْقُرْءَانَ تَرْتِيلًا",
    "ENGLISH": {
        "TRANSLATION_0": "or a little more, and recite the Qur'an distinctly.",
        "TRANSLATION_1": "Or a little more, and recite the Qur'an slowly and distinctly.\n",
        "TRANSLATION_2": "or add to it a little; and recite the Qur'an slowly and distinctly.\n",
        "TRANSLATION_3": "and recite the Quran in a distinct tone;\n",
        "TRANSLATION_4": "Or increase a little upon it, and recite the Qur’an slowly in stages.\n",
        "TRANSLATION_5": "Or a little more. And Rattil the Qur'an Tartil.\n",
        "TRANSLATION_6": "Or add to it, and recite the Quran as it ought to be recited.\n",
        "TRANSLATION_7": "or add a little), and chant the Koran very distinctly;\n",
        "TRANSLATION_8": "Or add (a little) thereto - and chant the Qur'an in measure,\n",
        "TRANSLATION_9": "or a little more, but recite the Quran slowly and distinctly.\n",
        "TRANSLATION_10": "Or increase thereto. And intone the Qur'an with a measured intontion. s\n",
        "TRANSLATION_11": "or add to it, and recite the Quran in a measured tone.\n",
        "TRANSLATION_12": "Or a little more; and recite the Qur'an in slow, measured rhythmic tones.\n",
        "TRANSLATION_13": "Or a little more; and recite the Quran (aloud) in a slow, (pleasant tone and) style.\n",
        "TRANSLATION_14": "or a little more; and with recitation, recite the Koran.\n",
        "TRANSLATION_15": "Or add to it; and chant the Quran rhythmically.\n",
        "TRANSLATION_16": "Or add to it, and recite the Qur'an with measured recitation.\n",
        "TRANSLATION_17": "[73:4]   or add to it, up to two thirds (aw implies [free] choice), and recite the Qur’ān, recite it carefully, in a measured tone.\n",
        "TRANSLATION_18": "(Or add (a little) thereto) or pray more than half of the night, up to two thirds of the night, thus giving him a choice, and then He said: (and chant the Qur'an in measure) recite the Qur'an deliberately, unhurriedly and with gravity, i.e. reciting two or three verses each time until you finish the whole recitation,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "73:4",
            "84:21",
            "76:23",
            "55:2",
            "20:2",
            "36:69",
            "54:32",
            "54:22",
            "54:17",
            "54:40"
        ],
        "BIBLE": [
            "prophets:ezekiel:40:35",
            "prophets:zechariah:5:6",
            "prophets:ezekiel:40:28",
            "prophets:zechariah:5:10",
            "prophets:ezekiel:40:32",
            "prophets:i%20kings:7:11",
            "prophets:ezekiel:45:3",
            "writings:proverbs:20:10",
            "writings:job:11:9",
            "prophets:ezekiel:40:24"
        ]
    }
}