{
    "VERSE": "73:5",
    "ARABIC": "إِنَّا سَنُلْقِى عَلَيْكَ قَوْلًا ثَقِيلًا",
    "ENGLISH": {
        "TRANSLATION_0": "We will impose a weighty Word upon you.",
        "TRANSLATION_1": "We shall soon entrust to you a message heavy (with solemnity).\n",
        "TRANSLATION_2": "Behold, We shall cast upon you a Weighty Word.\n",
        "TRANSLATION_3": "We are about to reveal to you a mighty word.\n",
        "TRANSLATION_4": "Indeed We shall soon ordain a heavy responsibility upon you.\n",
        "TRANSLATION_5": "Verily, We shall send down to you a Word Thaqil.\n",
        "TRANSLATION_6": "Surely We will make to light upon you a weighty Word.\n",
        "TRANSLATION_7": "Behold, We shall cast upon thee a weighty word;\n",
        "TRANSLATION_8": "For we shall charge thee with a word of weight.\n",
        "TRANSLATION_9": "For We are about to send down to you a message of considerable gravity.\n",
        "TRANSLATION_10": "Verily We! anon We shall cast upon thee a weighty word.\n",
        "TRANSLATION_11": "Indeed soon We shall cast on you a weighty discourse.\n",
        "TRANSLATION_12": "Soon shall We send down to thee a weighty Message.\n",
        "TRANSLATION_13": "Verily, We shall send down to you a weighty Word (i.e. obligations, legal laws, etc.).\n",
        "TRANSLATION_14": "We are about to cast upon you a weighty Word.\n",
        "TRANSLATION_15": "We are about to give you a heavy message.\n",
        "TRANSLATION_16": "Indeed, We will cast upon you a heavy word.\n",
        "TRANSLATION_17": "[73:5] Verily [soon] We shall cast on you a weighty, an awe-inspiring or stern, word, [a weighty] Qur’ān, because of the prescriptions [imposed] in it.\n",
        "TRANSLATION_18": "(For We shall charge thee) for We shall send you Gabriel (with a word of weight) with mighty words containing commands and prohibitions, promises and threats, the lawful and unlawful; it is also said this means: with a tremendous word; and it is also said this means: a word that is heavy on whoever contravenes it; and it is also said this means: a weighty word in the prayer of the night.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "73:5",
            "55:31",
            "15:95",
            "77:46",
            "76:23",
            "56:35",
            "76:27",
            "7:15",
            "88:26",
            "15:58"
        ],
        "BIBLE": [
            "writings:job:33:7",
            "prophets:nahum:3:6",
            "prophets:micah:4:7",
            "writings:job:40:27",
            "prophets:obadiah:1:2",
            "writings:daniel:2:9",
            "writings:proverbs:22:21",
            "writings:esther:4:8",
            "torah:leviticus:26:6",
            "torah:exodus:34:10"
        ]
    }
}