{
    "VERSE": "73:6",
    "ARABIC": "إِنَّ نَاشِئَةَ ٱلَّيْلِ هِىَ أَشَدُّ وَطْـًٔا وَأَقْوَمُ قِيلًا",
    "ENGLISH": {
        "TRANSLATION_0": "Certainly rising at night has a stronger effect and is more conducive to concentration.",
        "TRANSLATION_1": "Surely in the watches of the night the soul is most receptive and words more telling.\n",
        "TRANSLATION_2": "Surely getting up at night is the best means of subduing the self and is more suitable for uprightness in speech.\n",
        "TRANSLATION_3": "Prayer at night leaves the strongest impression on one's soul and the words spoken are more consistent.\n",
        "TRANSLATION_4": "Indeed getting up in the night is tougher, and the words flow with strength.\n",
        "TRANSLATION_5": "Verily, rising (Nashi'ah) at night is better for understanding and more suitable for speech (recitation).\n",
        "TRANSLATION_6": "Surely the rising by night is the firmest way to tread and the best corrective of speech.\n",
        "TRANSLATION_7": "surely the first part of the night is heavier in tread, more upright in speech,\n",
        "TRANSLATION_8": "Lo! the vigil of the night is (a time) when impression is more keen and speech more certain.\n",
        "TRANSLATION_9": "Surely, getting up at night [for worship] is the most potent means of subduing the self and most suitable for the word [of prayer].\n",
        "TRANSLATION_10": "Verily the rising by night! it is most curbing and most conducive to right speech.\n",
        "TRANSLATION_11": "Indeed the watch of the night is firmer in tread and more upright in respect to speech,\n",
        "TRANSLATION_12": "Truly the rising by night is most potent for governing (the soul), and most suitable for (framing) the Word (of Prayer and Praise).\n",
        "TRANSLATION_13": "Verily, the rising by night (for Tahajjud prayer) is very hard and most potent and good for governing (the soul), and most suitable for (understanding) the Word (of Allah).\n",
        "TRANSLATION_14": "Indeed, the first part of night is heavier in tread, and more upright in speech.\n",
        "TRANSLATION_15": "The vigil of night is more effective, and better suited for recitation.\n",
        "TRANSLATION_16": "Indeed, the hours of the night are more effective for concurrence [of heart and tongue] and more suitable for words.\n",
        "TRANSLATION_17": "[73:6] Assuredly rising in the night, to wake up after [having been in] sleep, is firmer in tread, [more] conducive to [establishing] harmony between the hearing and the heart for the purpose of comprehending the Qur’ān, and more upright in respect to speech, clearer for utterance [of devotions].\n",
        "TRANSLATION_18": "(Lo! the vigil of the night) spent in praying (is (a time) when impression is more keen) the vigil of the night and praying at this time give a person more vigour in his prayer, when he seeks by it Allah's sake alone; it is also said this means: it is gentler and milder on the heart (and speech more certain) the recitation of the Qur'an is clearer and firmer.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "73:6",
            "71:5",
            "23:16",
            "10:67",
            "43:8",
            "91:4",
            "53:5",
            "40:32",
            "27:86",
            "81:17"
        ],
        "BIBLE": [
            "prophets:ezekiel:3:6",
            "writings:job:33:3",
            "prophets:joshua:23:14",
            "prophets:i%20kings:2:4",
            "prophets:judges:19:9",
            "prophets:isaiah:50:4",
            "writings:proverbs:11:20",
            "prophets:ezekiel:36:5",
            "prophets:i%20kings:3:12",
            "prophets:isaiah:32:4"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:1",
            
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:2:1"
        ]
    }
}