{
    "VERSE": "73:8",
    "ARABIC": "وَٱذْكُرِ ٱسْمَ رَبِّكَ وَتَبَتَّلْ إِلَيْهِ تَبْتِيلًا",
    "ENGLISH": {
        "TRANSLATION_0": "Remember the Name of your Lord, and devote yourself to Him completely.",
        "TRANSLATION_1": "But recite the name of your Lord withdrawing yourself from everything, devoting yourself exclusively to Him.\n",
        "TRANSLATION_2": "So remember the name of your Lord and devote yourself to Him with exclusive devotion.\n",
        "TRANSLATION_3": "Glorify the Name of your Lord, the Lord of the eastern and western regions, with due sincerity.\n",
        "TRANSLATION_4": "And remember the name of your Lord and, leaving others, devote yourself solely to Him.\n",
        "TRANSLATION_5": "And remember the Name of your Lord and (Tabattil) devote yourself to Him with complete devotion.\n",
        "TRANSLATION_6": "And remember the name of your Lord and devote yourself to Him with (exclusive) devotion.\n",
        "TRANSLATION_7": "And remember the Name of thy Lord, and devote thyself unto Him very devoutly.\n",
        "TRANSLATION_8": "So remember the name of thy Lord and devote thyself with a complete devotion -\n",
        "TRANSLATION_9": "Remember the name of your Lord, and devote yourself to Him wholeheartedly.\n",
        "TRANSLATION_10": "And remember thou the name of thy Lord, and devote thyself to Him with an exclusive devotion.\n",
        "TRANSLATION_11": "So celebrate the Name of your Lord and dedicate yourself to Him with total dedication.\n",
        "TRANSLATION_12": "But keep in remembrance the name of thy Lord and devote thyself to Him whole-heartedly.\n",
        "TRANSLATION_13": "And remember the Name of your Lord and devote yourself to Him with a complete devotion.\n",
        "TRANSLATION_14": "Remember the Name of your Lord and dedicate yourself devoutly to Him.\n",
        "TRANSLATION_15": "So remember the Name of your Lord, and devote yourself to Him wholeheartedly.\n",
        "TRANSLATION_16": "And remember the name of your Lord and devote yourself to Him with [complete] devotion.\n",
        "TRANSLATION_17": "[73:8] And mention the Name of your Lord, that is, say, bi’smi’Llāhi’l-rahmāni’l-rahīm, ‘In the Name of God, the Compassionate, the Merciful’, to begin your recitation, and devote yourself [exclusively] to Him with complete devotion (tabtīlan is the verbal noun from batala, used here [instead of tabattulan] in order to concord with the end-rhyme of the verses) for he [the Prophet] is obliged to devote himself to God.\n",
        "TRANSLATION_18": "(So remember the name of thy Lord) so pray by the command of your Lord; and it is also said this means: 703 remember your Lord's divine Oneness (and devote thyself with a complete devotion) be completely sincere to Allah in your prayers, supplications and acts of worship.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "73:8",
            "87:15",
            "96:1",
            "79:19",
            "94:8",
            "55:78",
            "76:25",
            "74:7",
            "87:1",
            "74:3"
        ],
        "BIBLE": [
            "writings:psalms:106:4",
            "writings:psalms:86:12",
            "writings:psalms:86:9",
            "writings:psalms:37:4",
            "prophets:jeremiah:2:2",
            "prophets:ezekiel:39:28",
            "torah:deuteronomy:18:13",
            "writings:psalms:25:6",
            "prophets:amos:1:9",
            "prophets:i%20samuel:25:31"
        ]
    }
}