{
    "VERSE": "92:18",
    "ARABIC": "ٱلَّذِى يُؤْتِى مَالَهُۥ يَتَزَكَّىٰ",
    "ENGLISH": {
        "TRANSLATION_0": "those who give their wealth to purify themselves -",
        "TRANSLATION_1": "And gives of his wealth that he may grow in virtue,\n",
        "TRANSLATION_2": "the Godfearing who spends his wealth to purify himself;\n",
        "TRANSLATION_3": "and purify themselves will be safe from this fire.\n",
        "TRANSLATION_4": "Who gives his wealth in order to be pure.\n",
        "TRANSLATION_5": "He who gives of his wealth for self-purification.\n",
        "TRANSLATION_6": "Who gives away his wealth, purifying himself\n",
        "TRANSLATION_7": "even he who gives his wealth. to purify himself\n",
        "TRANSLATION_8": "Who giveth his wealth that he may grow (in goodness).\n",
        "TRANSLATION_9": "one who gives his wealth to become purified,\n",
        "TRANSLATION_10": "Who giveth away his substance that he may be cleansed,\n",
        "TRANSLATION_11": "—he who gives his wealth to purify himself\n",
        "TRANSLATION_12": "Those who spend their wealth for increase in self-purification,\n",
        "TRANSLATION_13": "He who spends his wealth for increase in self-purification,\n",
        "TRANSLATION_14": "He who gives his wealth to be purified,\n",
        "TRANSLATION_15": "He who gives his money to become pure.\n",
        "TRANSLATION_16": "[He] who gives [from] his wealth to purify himself\n",
        "TRANSLATION_17": "[92:18]   he who gives his wealth to purify himself, offering it as a [means of self] purification before God, exalted be He, by making this payment for the sake of God, exalted be He, and not for show or the sake of reputation, so that he [or the offering] stands purified in the sight of God. This [verse] was revealed regarding the truthful one (al-siddīq) [Abū Bakr], may God be pleased with him, when he purchased Bilāl [the Ethiopian], who was being tortured on account of his faith, and then freed him, whereat the disbelievers said, ‘He only did this in return for a favour which he [must have] owed him’, and so the following was revealed:\n",
        "TRANSLATION_18": "Who giveth his wealth) in the way of Allah, i.e. Abu Bakr al-Siddiq (that he may grow (in goodness)) intending by that Allah's Countenance alone,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "92:18",
            "104:2",
            "104:3",
            "111:2",
            "69:28",
            "92:11",
            "74:12",
            "90:6",
            "70:24",
            "23:55"
        ],
        "BIBLE": [
            "writings:psalms:111:5",
            "torah:deuteronomy:26:12",
            "writings:ii%20chronicles:32:29",
            "torah:genesis:47:16",
            "torah:leviticus:6:10",
            "writings:psalms:78:46",
            "writings:proverbs:9:9",
            "torah:genesis:9:3",
            "writings:psalms:60:6",
            "writings:ecclesiastes:5:18"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:5:2"
        ]
    }
}