{
    "VERSE": "33:10",
    "ARABIC": "إِذْ جَآءُوكُم مِّن فَوْقِكُمْ وَمِنْ أَسْفَلَ مِنكُمْ وَإِذْ زَاغَتِ ٱلْأَبْصَٰرُ وَبَلَغَتِ ٱلْقُلُوبُ ٱلْحَنَاجِرَ وَتَظُنُّونَ بِٱللَّهِ ٱلظُّنُونَا۠",
    "ENGLISH": {
        "TRANSLATION_0": "When they came at you from above you and below you, when your eyes rolled and your hearts rose to your throats, and you thought unworthy thoughts about Allah,",
        "TRANSLATION_1": "When they came upon you from above and below you, when the eyes were stupefied with horror, and hearts jumped to the throats, and you made wild suppositions about God.\n",
        "TRANSLATION_2": "When they came upon you from above you and from below you, when your eyes were stupefied with horror and your hearts leapt to your throats, and you began to entertain diverse thoughts about Allah.\n",
        "TRANSLATION_3": "Eyes became dull and hearts almost reached the throat when they attacked you from above and below and you started to think of God with suspicion.\n",
        "TRANSLATION_4": "When the disbelievers came upon you from above you and from below you, and when the eyes became fixed in stare and the hearts came up to the throats, and you were imagining matters regarding Allah.\n",
        "TRANSLATION_5": "When they came upon you from above you and from below you, and when the eyes grew wild and the hearts reached to the throats, and you were harboring doubts about Allah.\n",
        "TRANSLATION_6": "When they came upon you from above you and from below you, and when the eyes turned dull, and the hearts rose up to the throats, and you began to think diverse thoughts of Allah.\n",
        "TRANSLATION_7": "When they came against you from above you and from below you, and when your eyes swerved and your hearts reached your throats, while you thought thoughts about God;\n",
        "TRANSLATION_8": "When they came upon you from above you and from below you, and when eyes grew wild and hearts reached to the throats, and ye were imagining vain thoughts concerning Allah.\n",
        "TRANSLATION_9": "When they came against you both from above you and from below you, your eyes rolled [with fear] and your hearts leapt up to your throats, and you entertained [ill] thoughts about God.\n",
        "TRANSLATION_10": "When they came upon you from above you and from below you, and when eyes turned aside and hearts reached to the gullets, and of Allah ye were imagining various things.\n",
        "TRANSLATION_11": "When they came at you from above and below you, and when the eyes rolled [with fear] and the hearts leapt to the throats, and you entertained misgivings about Allah,\n",
        "TRANSLATION_12": "Behold! they came on you from above you and from below you, and behold, the eyes became dim and the hearts gaped up to the throats, and ye imagined various (vain) thoughts about Allah!\n",
        "TRANSLATION_13": "When they came upon you from above you and from below you, and when the eyes grew wild and the hearts reached to the throats, and you were harbouring doubts about Allah.\n",
        "TRANSLATION_14": "They came on you from above and from below, and when your eyes swerved and your hearts leapt to your throats, and you thought thoughts about Allah;\n",
        "TRANSLATION_15": "When they came upon you, from above you, and from beneath you; and the eyes became dazed, and the hearts reached the throats, and you harbored doubts about God.\n",
        "TRANSLATION_16": "[Remember] when they came at you from above you and from below you, and when eyes shifted [in fear], and hearts reached the throats and you assumed about Allah [various] assumptions.\n",
        "TRANSLATION_17": "[33:10] When they came at you from above you and from below you, in other words, from the higher side of the valley and from its lower side, from the east and from the west, and when the eyes turned away [in fear], from everything, to [gaze at] their enemies [approaching] from every side, and the hearts lept to the throats (hanājir, the plural of hunjura, which lies at the bottom of the gullet) out of intense fear, while you entertained all sorts of, different, thoughts concerning God, [some] of assistance, some of despair;\n",
        "TRANSLATION_18": "(When they) the disbelievers of Mecca (came upon you from above you) from above the valley: Talhah Ibn Khuwaylid al-Asdi and his host (and from below you) from below the valley: Abu'l-A'war al-Aslami and his host and Abu Sufyan and his host, (and when eyes grew wild) when the eyes of the hypocrites grew wild (and hearts) the hearts of the hypocrites (reached to the throats) because of fear, (and ye were imagining vain thoughts concerning Allah) and thought, host of hypocrites, that Allah will not help His prophet.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "33:10",
            "16:108",
            "13:28",
            "22:35",
            "40:18",
            "39:45",
            "9:64",
            "6:46",
            "16:88",
            "39:16"
        ],
        "BIBLE": [
            "prophets:i%20kings:11:4",
            "prophets:i%20samuel:12:21",
            "writings:ecclesiastes:2:20",
            "prophets:i%20kings:15:5",
            "prophets:malachi:3:24",
            "prophets:i%20samuel:10:9",
            "writings:ezra:10:14",
            "writings:proverbs:23:33",
            "writings:daniel:7:8",
            "torah:deuteronomy:11:16"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:2",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:5:2",
            
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:2:5"
        ]
    }
}