{
    "VERSE": "33:11",
    "ARABIC": "هُنَالِكَ ٱبْتُلِىَ ٱلْمُؤْمِنُونَ وَزُلْزِلُوا۟ زِلْزَالًا شَدِيدًا",
    "ENGLISH": {
        "TRANSLATION_0": "at that point the muminun were tested and severely shaken.",
        "TRANSLATION_1": "The faithful were sorely tried there and were shaken completely,\n",
        "TRANSLATION_2": "The believers were then put to a severe test and were most violently convulsed.\n",
        "TRANSLATION_3": "There the believers were tested and tremendously shaken.\n",
        "TRANSLATION_4": "That proved be the testing ground for the Muslims, and they were subjected to a severe shake.\n",
        "TRANSLATION_5": "There, the believers were tried and shaken with a mighty shaking.\n",
        "TRANSLATION_6": "There the believers were tried and they were shaken with severe shaking.\n",
        "TRANSLATION_7": "there it was that the believers were tried, and shaken most mightily.\n",
        "TRANSLATION_8": "There were the believers sorely tried, and shaken with a mighty shock.\n",
        "TRANSLATION_9": "There the faithful were put to the proof and they were shaken as if by an earthquake.\n",
        "TRANSLATION_10": "There were the believers proven and shaken with a mighty shaking\n",
        "TRANSLATION_11": "it was there that the faithful were tested and jolted with a severe agitation.\n",
        "TRANSLATION_12": "In that situation were the Believers tried: they were shaken as by a tremendous shaking.\n",
        "TRANSLATION_13": "There, the believers were tried and shaken with a mighty shaking.\n",
        "TRANSLATION_14": "there the believers were tried, they were shaken, a severe quake.\n",
        "TRANSLATION_15": "There and then the believers were tested, and were shaken most severely.\n",
        "TRANSLATION_16": "There the believers were tested and shaken with a severe shaking.\n",
        "TRANSLATION_17": "[33:11] it was there that the believers were [sorely] tried, [there] they were tested, to distinguish the sincere individual from the one otherwise, and were shaken with a mighty shock, because of the severity of the terror.\n",
        "TRANSLATION_18": "(There) at that point of fear (were the believers sorely tried) they were tested with a trial, (and shaken with a mighty shock) they were terribly exhausted and violently moved.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "33:11",
            "99:1",
            "42:26",
            "7:119",
            "53:5",
            "81:8",
            "43:8",
            "53:53",
            "7:120",
            "37:116"
        ],
        "BIBLE": [
            "writings:psalms:18:8",
            "writings:psalms:95:9",
            "prophets:judges:3:4",
            "writings:psalms:17:3",
            "writings:job:38:13",
            "prophets:isaiah:2:21",
            "prophets:isaiah:2:19",
            "torah:exodus:22:5",
            "writings:psalms:48:3",
            "prophets:jeremiah:10:14"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:2:3",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:4:12"
        ]
    }
}