{
    "VERSE": "33:12",
    "ARABIC": "وَإِذْ يَقُولُ ٱلْمُنَٰفِقُونَ وَٱلَّذِينَ فِى قُلُوبِهِم مَّرَضٌ مَّا وَعَدَنَا ٱللَّهُ وَرَسُولُهُۥٓ إِلَّا غُرُورًا",
    "ENGLISH": {
        "TRANSLATION_0": "When the hypocrites and people with sickness in their hearts said, 'What Allah and His Messenger promised us was mere delusion.'",
        "TRANSLATION_1": "When the hypocrites and those who were filled with doubt, said: \"The promise of God and His Apostle was nothing but deceit.\"\n",
        "TRANSLATION_2": "And call to mind when the hypocrites and all those with diseased hearts said: “All that Allah and His Messenger had promised us was nothing but deceit.”\n",
        "TRANSLATION_3": "It was there that the hypocrites and those whose hearts were sick, said, \"The promise of God and His Messenger has proved to be nothing but deceit\".\n",
        "TRANSLATION_4": "And when the hypocrites, and those in whose hearts is a disease, began saying, “Allah and His Noble Messenger have not given us a promise except one of deceit.”\n",
        "TRANSLATION_5": "And when the hypocrites and those in whose hearts is a disease said: \"Allah and His Messenger promised us nothing but delusion!\"\n",
        "TRANSLATION_6": "And when the hypocrites and those in whose hearts was a disease began to say: Allah and His Apostle did not promise us (victory) but only to deceive.\n",
        "TRANSLATION_7": "And when tile hypocrites, and those in whose hearts is sickness, said, 'God and His Messenger promised us only delusion.'\n",
        "TRANSLATION_8": "And when the hypocrites, and those in whose hearts is a disease, were saying: Allah and His messenger promised us naught but delusion.\n",
        "TRANSLATION_9": "The hypocrites and people with sickness in their hearts said, \"God and His Messenger have promised us nothing but delusions.\"\n",
        "TRANSLATION_10": "And when the hypocrites and those in whose hearts is disease were saying: Allah and His apostle have promised us nought but delusion.\n",
        "TRANSLATION_11": "When the hypocrites, as well as those in whose hearts is a sickness, were saying, ‘Allah and His Apostle did not promise us [anything] except delusion.’\n",
        "TRANSLATION_12": "And behold! The Hypocrites and those in whose hearts is a disease (even) say: \"Allah and His Messenger promised us nothing but delusion!\"\n",
        "TRANSLATION_13": "And when the hypocrites and those in whose hearts is a disease (of doubts) said: \"Allah and His Messenger (SAW) promised us nothing but delusions!\"\n",
        "TRANSLATION_14": "The hypocrites and those in whose hearts there is a disease said: 'Allah and His Messenger promised nothing but delusion'\n",
        "TRANSLATION_15": "When the hypocrites and those in whose hearts is sickness said, “God and His Messenger promised us nothing but illusion.”\n",
        "TRANSLATION_16": "And [remember] when the hypocrites and those in whose hearts is disease said, \"Allah and His Messenger did not promise us except delusion,\"\n",
        "TRANSLATION_17": "[33:12] And, mention, when the hypocrites, and those in whose hearts is sickness, namely, weakness of conviction, were saying, ‘What God and His Messenger promised us, of assistance [to victory], was [nothing] but delusion’, falsehood.\n",
        "TRANSLATION_18": "(And When the hypocrites) 'Abdullah Ibn Ubayy Ibn Salul and his host, (and those in whose hearts is a disease) doubt and hypocrisy, i.e. Mu'attib Ibn Qushayr and his host, (were saying: Allah and His messenger promised us naught) the conquests of lands and the coming of the believers (but delusion) falsehood.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "33:12",
            "24:50",
            "47:29",
            "33:22",
            "8:24",
            "5:99",
            "13:28",
            "22:35",
            "24:54",
            "9:1"
        ],
        "BIBLE": [
            "prophets:jeremiah:44:20",
            "writings:i%20chronicles:23:25",
            "torah:genesis:1:29",
            "torah:numbers:11:13",
            "torah:genesis:15:3",
            "prophets:i%20kings:3:9",
            "writings:psalms:21:3",
            "torah:exodus:5:16",
            "prophets:i%20kings:3:12",
            "torah:deuteronomy:9:23"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:2:5"
        ]
    }
}