{
    "VERSE": "33:27",
    "ARABIC": "وَأَوْرَثَكُمْ أَرْضَهُمْ وَدِيَٰرَهُمْ وَأَمْوَٰلَهُمْ وَأَرْضًا لَّمْ تَطَـُٔوهَا وَكَانَ ٱللَّهُ عَلَىٰ كُلِّ شَىْءٍ قَدِيرًا",
    "ENGLISH": {
        "TRANSLATION_0": "He bequeathed their land, their houses and their wealth to you, and another land you had not yet trodden on. Allah has power over all things.",
        "TRANSLATION_1": "And He made you inherit their lands and mansions and wealth, and a country you had not traversed before, for God has power over everything.\n",
        "TRANSLATION_2": "Allah made you inherit their land, their dwellings, and their goods, and a piece of land on which you had not yet trodden. Verily Allah has power over all things.\n",
        "TRANSLATION_3": "God made you inherit their land, houses, property, and a land on which you had never walked. God has power over all things.\n",
        "TRANSLATION_4": "And He bequeathed you their lands and their houses and their wealth, and land that you have not yet set foot upon; and Allah is Able to do all things.\n",
        "TRANSLATION_5": "And He caused you to inherit their lands, and their houses, and their riches, and a land which you had not trodden. And Allah is able to do all things.\n",
        "TRANSLATION_6": "And He made you heirs to their land and their dwellings and their property, and (to) a land which you have not yet trodden, and Allah has power over all things.\n",
        "TRANSLATION_7": "And He bequeathed upon you their lands, their habitations, and their possessions, and a land you never trod. God is powerful over everything.\n",
        "TRANSLATION_8": "And He caused you to inherit their land and their houses and their wealth, and land ye have not trodden. Allah is ever Able to do all things.\n",
        "TRANSLATION_9": "He made you heirs to their lands, and their houses, and their possessions and lands on which you had not set foot before. God has power over all things.\n",
        "TRANSLATION_10": "And He caused you to inherit their land and their houses and their riches, and land which ye have not yet trodden. And Allah is over everything ever potent.\n",
        "TRANSLATION_11": "He bequeathed you their land, their houses and their possessions, and a territory you had not trodden, and Allah has power over all things.\n",
        "TRANSLATION_12": "And He made you heirs of their lands, their houses, and their goods, and of a land which ye had not frequented (before). And Allah has power over all things.\n",
        "TRANSLATION_13": "And He caused you to inherit their lands, and their houses, and their riches, and a land which you had not trodden (before). And Allah is Able to do all things.\n",
        "TRANSLATION_14": "He made you inheritors of their land, their houses, and their possessions, and another land on which you had never set foot before. Truly, Allah is Powerful over everything.\n",
        "TRANSLATION_15": "And He made you inherit their land, and their homes, and their possessions, and a region you have never stepped on. God has power over all things.\n",
        "TRANSLATION_16": "And He caused you to inherit their land and their homes and their properties and a land which you have not trodden. And ever is Allah, over all things, competent.\n",
        "TRANSLATION_17": "[33:27] And He made you inherit their land and their homes and their possessions, and a land you had not trodden, thitherto, and this was [the territory of] Khaybar, which was captured after [that of] Qurayza. And God has power over all things.\n",
        "TRANSLATION_18": "(And He caused you to inherit their land) their mansions (and their houses and their wealth) He made their wealth booty for you, (and land) the land of Khaybar (ye have not trodden) which did not belong to you but which will soon belong to you. (Allah is Able to do all things) whether it is a conquest or assistance.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "33:27",
            "48:21",
            "5:40",
            "3:189",
            "5:120",
            "3:29",
            "64:1",
            "11:4",
            "42:9",
            "57:2"
        ],
        "BIBLE": [
            "prophets:ezekiel:5:5",
            "writings:ii%20chronicles:19:3",
            "prophets:isaiah:14:1",
            "writings:i%20chronicles:29:2",
            "prophets:ezekiel:28:14",
            "prophets:ezekiel:7:20",
            "prophets:ezekiel:40:2",
            "writings:job:1:10",
            "writings:ii%20chronicles:33:7",
            "writings:ii%20chronicles:23:19"
        ]
    }
}