{
    "VERSE": "33:28",
    "ARABIC": "يَٰٓأَيُّهَا ٱلنَّبِىُّ قُل لِّأَزْوَٰجِكَ إِن كُنتُنَّ تُرِدْنَ ٱلْحَيَوٰةَ ٱلدُّنْيَا وَزِينَتَهَا فَتَعَالَيْنَ أُمَتِّعْكُنَّ وَأُسَرِّحْكُنَّ سَرَاحًا جَمِيلًا",
    "ENGLISH": {
        "TRANSLATION_0": "O Prophet, tell your wives: 'If you desire the life of the dunya and its finery, come and I will give you all you need and release you with kindness.",
        "TRANSLATION_1": "O Prophet, say to your wives: \"In case you desire the life and pomp of this world, come, I will provide you handsomely, and let you go with a grace.\n",
        "TRANSLATION_2": "O Prophet, tell your wives: “If you seek the world and its embellishments, then come and I will make some provision for you and release you in an honourable way.\n",
        "TRANSLATION_3": "Prophet, tell your wives, \"If you want the worldly life and its beauty, I shall allow you to enjoy it and set you free in an honorable manner,\n",
        "TRANSLATION_4": "O Herald of the Hidden! Say to your wives, “If you desire the worldly life and its adornment – therefore come, I shall give you wealth and a befitting release!”\n",
        "TRANSLATION_5": "O Prophet! Say to your wives: \"If you desire the life of this world, and its glitter, then come! I will make a provision for you and set you free in a handsome manner.\"\n",
        "TRANSLATION_6": "O Prophet! say to your wives: If you desire this world's life and its adornment, then come, I will give you a provision and allow you to depart a goodly departing\n",
        "TRANSLATION_7": "O Prophet, say to thy wives: 'If you desire the present life and its adornment, come now, I will make you provision, and set you free with kindliness.\n",
        "TRANSLATION_8": "O Prophet! Say unto thy wives: If ye desire the world's life and its adornment, come! I will content you and will release you with a fair release.\n",
        "TRANSLATION_9": "O Prophet, say to your wives, \"If you seek the life of this world and all its finery then come, I will make provision for you, and release you honourably.\n",
        "TRANSLATION_10": "Prophet! say unto thy wives: if it be that ye seek the world's life and the adornment thereof, then come I shall make a provision for you and I shall release you with a handsome release.\n",
        "TRANSLATION_11": "O Prophet! Say to your wives, ‘If you desire the life of the world and its glitter, come, I will provide for you and release you in a graceful manner.\n",
        "TRANSLATION_12": "O Prophet! Say to thy Consorts: \"If it be that ye desire the life of this World, and its glitter,- then come! I will provide for your enjoyment and set you free in a handsome manner.\n",
        "TRANSLATION_13": "O Prophet (Muhammad SAW)! Say to your wives: If you desire the life of this world, and its glitter, Then come! I will make a provision for you and set you free in a handsome manner (divorce).\n",
        "TRANSLATION_14": "O Prophet, say to your wives: 'If you seek this life and its finery, come, I will release you with a fine release.\n",
        "TRANSLATION_15": "O Prophet! Say to your wives, “If you desire the life of this world and its finery, then let me compensate you, and release you kindly.\n",
        "TRANSLATION_16": "O Prophet, say to your wives, \"If you should desire the worldly life and its adornment, then come, I will provide for you and give you a gracious release.\n",
        "TRANSLATION_17": "[33:28] O Prophet! Say to your wives: — who were nine, and they had asked him for some of the adornments of this world, which he did not possess — ‘If you desire the life of this world and its adornment, come [now], I will provide for you, in other words, the compensation [to be provided] for divorce, and release you in a gracious manner, I will divorce you and will not coerce [you to stay].\n",
        "TRANSLATION_18": "(O Prophet!) i.e. Muhammad (pbuh) (Say unto thy wives: If ye desire the world's life) what is in the life of this world (and its adornment) and its splendour, (come! I will content you) with divorce (and will release you with a fair release) according to the Sunnah.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "33:28",
            "11:15",
            "66:1",
            "79:38",
            "33:59",
            "33:49",
            "23:37",
            "30:7",
            "6:29",
            "53:29"
        ],
        "BIBLE": [
            "torah:numbers:21:8",
            "prophets:i%20kings:19:2",
            "prophets:ii%20kings:18:23",
            "prophets:isaiah:36:8",
            "prophets:ezekiel:12:23",
            "torah:genesis:48:20",
            "prophets:joshua:7:19",
            "prophets:joel:2:17",
            "prophets:joshua:9:6",
            "writings:daniel:6:13"
        ]
    }
}