{
    "VERSE": "33:3",
    "ARABIC": "وَتَوَكَّلْ عَلَى ٱللَّهِ وَكَفَىٰ بِٱللَّهِ وَكِيلًا",
    "ENGLISH": {
        "TRANSLATION_0": "And put your trust in Allah. Allah suffices as a Guardian.",
        "TRANSLATION_1": "Trust in God. God is sufficient as guardian.\n",
        "TRANSLATION_2": "Put your trust in Allah: Allah is sufficient as Guardian.\n",
        "TRANSLATION_3": "Trust in God and be sure that He is a Sufficient Guardian.\n",
        "TRANSLATION_4": "And trust Allah; and Allah is Sufficient as a Trustee.\n",
        "TRANSLATION_5": "And put your trust in Allah, and sufficient is Allah as a Trustee.\n",
        "TRANSLATION_6": "And rely on Allah; and Allah is sufficient for a Protector.\n",
        "TRANSLATION_7": "And put thy trust in God; God suffices as a guardian.\n",
        "TRANSLATION_8": "And put thy trust in Allah, for Allah is sufficient as Trustee.\n",
        "TRANSLATION_9": "Put your trust in God; God is sufficient as a Guardian.\n",
        "TRANSLATION_10": "And put thy trust in Allah and Allah sufficeth as a Trustee.\n",
        "TRANSLATION_11": "And put your trust in Allah; Allah suffices as trustee.\n",
        "TRANSLATION_12": "And put thy trust in Allah, and enough is Allah as a disposer of affairs.\n",
        "TRANSLATION_13": "And put your trust in Allah, and Sufficient is Allah as a Wakil (Trustee, or Disposer of affairs).\n",
        "TRANSLATION_14": "put your trust in Allah; Allah suffices as a Guardian.\n",
        "TRANSLATION_15": "And put your trust in God. God is enough as a trustee.\n",
        "TRANSLATION_16": "And rely upon Allah; and sufficient is Allah as Disposer of affairs.\n",
        "TRANSLATION_17": "[33:3] And put your trust in God, regarding this affair of yours; and God suffices as Guardian, to preserve you. And [the members of] his [the Prophet’s] community are subject to the same [admonitions] in all of the above.\n",
        "TRANSLATION_18": "(And put thy trust in Allah, for Allah is Sufficient as Trustee) He is sufficient to fulfil His promise to you: to give you victory and the upper hand; it is also said that this means: He is sufficient to protect you from them.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "33:3",
            "6:107",
            "33:48",
            "39:62",
            "2:15",
            "42:6",
            "4:132",
            "11:33",
            "6:102",
            "53:62"
        ],
        "BIBLE": [
            "writings:psalms:146:3",
            "prophets:isaiah:26:4",
            "writings:psalms:27:9",
            "prophets:jeremiah:17:7",
            "writings:proverbs:28:25",
            "writings:psalms:4:6",
            "writings:psalms:62:9",
            "prophets:malachi:2:16",
            "prophets:jeremiah:39:18",
            "writings:proverbs:29:25"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:14",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:8",
            
            "Sefer%20Yetzirah:6:1"
        ]
    }
}