{
    "VERSE": "33:34",
    "ARABIC": "وَٱذْكُرْنَ مَا يُتْلَىٰ فِى بُيُوتِكُنَّ مِنْ ءَايَٰتِ ٱللَّهِ وَٱلْحِكْمَةِ إِنَّ ٱللَّهَ كَانَ لَطِيفًا خَبِيرًا",
    "ENGLISH": {
        "TRANSLATION_0": "And remember the Signs of Allah and the wise words which are recited in your rooms. Allah is All- Pervading, All-Aware.",
        "TRANSLATION_1": "Remember God's revelations and the wisdom that are recited in your homes. God is indeed all perceiving, well-informed.\n",
        "TRANSLATION_2": "Remember the Signs of Allah and the words of wisdom which are rehearsed in your homes. Verily Allah is All-Subtle, All-Aware.\n",
        "TRANSLATION_3": "Wives of the Prophet, remember the revelations of God and Words of wisdom that are recited in your homes. God is Most Kind and All-aware.\n",
        "TRANSLATION_4": "And remember what is recited in your houses, from Allah’s verses and wisdom*; indeed Allah knows the minutest things, is All Aware. (The Holy Qur’an and the sayings- hadith – of the Holy Prophet.)\n",
        "TRANSLATION_5": "And remember, that which is recited in your houses of the Ayat of Allah and Al-Hikmah. Verily, Allah is Ever Most Courteous, Well-Acquainted with all things.\n",
        "TRANSLATION_6": "And keep to mind what is recited in your houses of the communications of Allah and the wisdom; surely Allah is Knower of subtleties, Aware.\n",
        "TRANSLATION_7": "And remember that which is recited in your houses of the signs of God and the Wisdom; God is All-subtle, All-aware.\n",
        "TRANSLATION_8": "And bear in mind that which is recited in your houses of the revelations of Allah and wisdom. Lo! Allah is Subtile, Aware.\n",
        "TRANSLATION_9": "Bear in mind all that is recited in your homes of the revelations of God and of wisdom. God is all pervading and all aware.\n",
        "TRANSLATION_10": "And bear in mind that which is rehearsed in your homes of the revelations of Allah and the wisdom. Verily Allah is ever Subtile, Aware.\n",
        "TRANSLATION_11": "And remember what is recited in your homes of the signs of Allah and wisdom. Indeed Allah is all-attentive, all-aware.\n",
        "TRANSLATION_12": "And recite what is rehearsed to you in your homes, of the Signs of Allah and His Wisdom: for Allah understands the finest mysteries and is well-acquainted (with them).\n",
        "TRANSLATION_13": "And remember (O you the members of the Prophet's family, the Graces of your Lord), that which is recited in your houses of the Verses of Allah and AlHikmah (i.e. Prophet's Sunnah legal ways, etc. so give your thanks to Allah and glorify His Praises for this Quran and the Sunnah). Verily, Allah is Ever Most Courteous, WellAcquainted with all things.\n",
        "TRANSLATION_14": "And remember that which is recited in your houses of the verses of Allah and the Wisdom. Allah is the Subtle, the Knower.\n",
        "TRANSLATION_15": "And remember what is recited in your homes of God's revelations and wisdom. God is Kind and Informed.\n",
        "TRANSLATION_16": "And remember what is recited in your houses of the verses of Allah and wisdom. Indeed, Allah is ever Subtle and Acquainted [with all things].\n",
        "TRANSLATION_17": "[33:34] And remember that which is recited in your houses of the revelations of God, [of] the Qur’ān, and wisdom, the Sunna. Truly God is Kind, to His friends, Aware, of all His creatures.\n",
        "TRANSLATION_18": "And bear in mind) and remember (that which is recited in your houses of the revelations of Allah) the Qur'an (and wisdom) the commands and prohibitions, the lawful and the unlawful. (Lo! Allah is Subtile) He knows what is in their hearts, (Aware) of their works; it is also said: He is Subtile in that He commanded the Prophet (pbuh) to divorce them, and He is Aware of their righteousness.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "33:34",
            "24:18",
            "33:2",
            "24:30",
            "16:105",
            "4:35",
            "17:39",
            "2:151",
            "35:22",
            "34:1"
        ],
        "BIBLE": [
            "prophets:ezekiel:36:32",
            "prophets:ezekiel:20:44",
            "prophets:jeremiah:44:29",
            "prophets:ezekiel:12:25",
            "prophets:jeremiah:36:8",
            "writings:i%20chronicles:23:28",
            "prophets:ii%20samuel:14:20",
            "prophets:hosea:14:10",
            "torah:deuteronomy:29:28",
            "writings:proverbs:1:2"
        ]
    }
}