{
    "VERSE": "33:36",
    "ARABIC": "وَمَا كَانَ لِمُؤْمِنٍ وَلَا مُؤْمِنَةٍ إِذَا قَضَى ٱللَّهُ وَرَسُولُهُۥٓ أَمْرًا أَن يَكُونَ لَهُمُ ٱلْخِيَرَةُ مِنْ أَمْرِهِمْ وَمَن يَعْصِ ٱللَّهَ وَرَسُولَهُۥ فَقَدْ ضَلَّ ضَلَٰلًا مُّبِينًا",
    "ENGLISH": {
        "TRANSLATION_0": "When Allah and His Messenger have decided something it is not for any man or woman of the muminin to have a choice about it. Anyone who disobeys Allah and His Messenger is clearly misguided.",
        "TRANSLATION_1": "No believing men and women have any choice in a matter after God and His Apostle have decided it. Whoever disobeys God and His Apostle has clearly lost the way and gone astray.\n",
        "TRANSLATION_2": "It does not behove a believer, male or female, that when Allah and His Messenger have decided an affair they should exercise their choice. And whoever disobeys Allah and His Messenger has strayed to manifest error.\n",
        "TRANSLATION_3": "The believing men and women must not feel free to do something in their affairs other than that which has been already decided for them by God and His Messenger. One who disobeys God and His Messenger is in plain error.\n",
        "TRANSLATION_4": "And no Muslim man or woman has any right in the affair, when Allah and His Noble Messenger have decreed a command regarding it; and whoever does not obey the command of Allah and His Noble Messenger, has indeed clearly gone very astray.\n",
        "TRANSLATION_5": "It is not for a believer, man or woman, when Allah and His Messenger have decreed a matter that they should have any option in their decision. And whoever disobeys Allah and His Messenger, he has indeed strayed into a plain error.\n",
        "TRANSLATION_6": "And it behoves not a believing man and a believing woman that they should have any choice in their matter when Allah and His Apostle have decided a matter; and whoever disobeys Allah and His Apostle, he surely strays off a manifest straying.\n",
        "TRANSLATION_7": "It is not for any believer, man or woman, when God and His Messenger have decreed a matter, to have the choice in the affair. Whosoever disobeys God and His Messenger has gone astray into manifest error.\n",
        "TRANSLATION_8": "And it becometh not a believing man or a believing woman, when Allah and His messenger have decided an affair (for them), that they should (after that) claim any say in their affair; and whoso is rebellious to Allah and His messenger, he verily goeth astray in error manifest.\n",
        "TRANSLATION_9": "It is not fitting for a believing man or woman to exercise any choice in his or her own affairs once God and His Messenger have reached a decision upon them. Anyone who disobeys God and His Messenger is in manifest error.\n",
        "TRANSLATION_10": "And it is not for a believing man or a believing woman, when Allah and His apostle have decreed an affair, that they should have any choice in their affair. And whosoever disobeyeth Allah and His apostle hath strayed with a manifest straying.\n",
        "TRANSLATION_11": "A faithful man or woman may not have any option in their matter, when Allah and His Apostle have decided on a matter, and whoever disobeys Allah and His Apostle has certainly strayed into manifest error.\n",
        "TRANSLATION_12": "It is not fitting for a Believer, man or woman, when a matter has been decided by Allah and His Messenger to have any option about their decision: if any one disobeys Allah and His Messenger, he is indeed on a clearly wrong Path.\n",
        "TRANSLATION_13": "It is not for a believer, man or woman, when Allah and His Messenger have decreed a matter that they should have any option in their decision. And whoever disobeys Allah and His Messenger, he has indeed strayed in a plain error.\n",
        "TRANSLATION_14": "It is not for any believer man or woman to have the choice in the affair when a matter is decreed by Allah and His Prophet. Whosoever disobeys Allah and His Messenger strays into clear error.\n",
        "TRANSLATION_15": "It is not for any believer, man or woman, when God and His Messenger have decided a matter, to have liberty of choice in their decision. Whoever disobeys God and His Messenger has gone far astray.\n",
        "TRANSLATION_16": "It is not for a believing man or a believing woman, when Allah and His Messenger have decided a matter, that they should [thereafter] have any choice about their affair. And whoever disobeys Allah and His Messenger has certainly strayed into clear error.\n",
        "TRANSLATION_17": "[33:36] And it is not [fitting] for any believing man or believing woman, when God and His Messenger have decided on a matter, to have (read takūna or yakūna) a choice in their matter, in contravention of the decision of God and His Messenger. This [verse] was revealed regarding ‘Abd Allāh b. Jahsh and his sister Zaynab, whose hand the Prophet had asked for in marriage, but meaning on behalf of Zayd b. Hāritha. They were loathe to this [proposal] when they found out [that it was on the latter’s behalf], for they had thought that the Prophet (s) wanted to marry her himself. But afterwards they consented because of the [following part of the] verse: And whoever disobeys God and His Messenger has certainly strayed into manifest error. Thus the Prophet (s) gave her in marriage to Zayd. Then on one occasion he [the Prophet] caught sight of her and felt love for her, whereafter [when he realised that] Zayd lost his affection for her and so said to the Prophet (s), ‘I want to part with her’. But the Prophet said to him, ‘Retain your wife for yourself’, as God, exalted be He, says:\n",
        "TRANSLATION_18": "(And it becometh not a believing man) Zayd (or a believing woman) Zaynab, (when Allah and His messenger have decided and affair (for them)) to marry them, (that they should (after that) claim any say in their affair) they should not have any choice other than what Allah and His Messenger chose for them; (and whoso is rebellious to Allah and His messenger) and whoever disobeys Allah and His Messenger in what he is commanded with, (he verily goeth astray in error manifest) he is in manifest error regarding Allah's command.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "33:36",
            "35:4",
            "47:21",
            "40:78",
            "4:61",
            "24:52",
            "4:80",
            "9:94",
            "24:62",
            "48:13"
        ],
        "BIBLE": [
            "torah:numbers:5:19",
            "prophets:i%20kings:13:26",
            "prophets:i%20samuel:9:6",
            "prophets:isaiah:59:8",
            "writings:ii%20chronicles:28:9",
            "writings:daniel:6:6",
            "prophets:judges:13:6",
            "torah:numbers:31:21",
            "writings:job:34:9",
            "prophets:i%20kings:13:12"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:3:5",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:3:6",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:2:5"
        ]
    }
}