{
    "VERSE": "33:37",
    "ARABIC": "وَإِذْ تَقُولُ لِلَّذِىٓ أَنْعَمَ ٱللَّهُ عَلَيْهِ وَأَنْعَمْتَ عَلَيْهِ أَمْسِكْ عَلَيْكَ زَوْجَكَ وَٱتَّقِ ٱللَّهَ وَتُخْفِى فِى نَفْسِكَ مَا ٱللَّهُ مُبْدِيهِ وَتَخْشَى ٱلنَّاسَ وَٱللَّهُ أَحَقُّ أَن تَخْشَىٰهُ فَلَمَّا قَضَىٰ زَيْدٌ مِّنْهَا وَطَرًا زَوَّجْنَٰكَهَا لِكَىْ لَا يَكُونَ عَلَى ٱلْمُؤْمِنِينَ حَرَجٌ فِىٓ أَزْوَٰجِ أَدْعِيَآئِهِمْ إِذَا قَضَوْا۟ مِنْهُنَّ وَطَرًا وَكَانَ أَمْرُ ٱللَّهِ مَفْعُولًا",
    "ENGLISH": {
        "TRANSLATION_0": "When you said to him whom Allah has blessed and you yourself have greatly favoured, 'Keep your wife to yourself and have taqwa of Allah,' while concealing something in yourself which Allah wished to bring to light, you were fearing people when Allah has more right to your fear. Then when Zayd divorced her We married her to you so that there should be no restriction for the muminun regarding the wives of their adopted sons when they have divorced them. Allah's command is always carried out.",
        "TRANSLATION_1": "When you said to him who had been favoured by God and was favoured by you: \"Keep your wife to yourself and fear God,\" you were hiding something God was about to bring to light, for you had fear of men, though you should fear God more. And when Zaid was through with her, We gave her to you in marriage, so that it may not remain a sin for the faithful (to marry) the wives of their adopted sons when they are through with them. God's command is to be fulfilled.\n",
        "TRANSLATION_2": "(O Prophet), call to mind when you said to him whom Allah had favoured and you had favoured: “Cleave to your wife and fear Allah,” and you concealed within yourself for fear of people what Allah was to reveal, although Allah has greater right that you fear Him. So when Zayd had accomplished what he would of her, We gave her in marriage to you so that there should not be any constraint for the believers regarding the wives of their adopted sons after they had accomplished whatever they would of them. And Allah's command was bound to be accomplished.\n",
        "TRANSLATION_3": "Say to the person to whom you and God have granted favor, \"Keep your wife and have fear of God. You hide within yourself what God wants to make public. You are afraid of people while it is God whom one should fear.\" When Zayd set her free, We gave her in marriage to you so that the believers would not face difficulties about the wives of their adopted sons when they are divorced. God's decree has already been issued.\n",
        "TRANSLATION_4": "And O dear Prophet, remember when you said to him upon whom Allah has bestowed favour and you had bestowed favour, “Keep your wife with you, and fear Allah”, and you kept in your heart what Allah willed to make known, and you feared criticism from the people; and Allah has more right that you should fear Him; so when Zaid became unconcerned with her, We gave her to you in marriage, so that there may be no sin upon believers in respect of the wives of their adopted sons when they have become unconcerned with them; and the command of Allah must be carried out.\n",
        "TRANSLATION_5": "And (remember) when you said to him on whom Allah has bestowed grace and you have done a favor: \"Keep your wife to yourself, and have Taqwa of Allah.\" But you did hide in yourself that which Allah will make manifest, you did fear the people whereas Allah had a better right that you should fear Him. So, when Zayd had completed his aim with her, We gave her to you in marriage, so that there may be no difficulty to the believers in respect of the wives of their adopted sons when the latter have no desire to keep them. And Allah's command must be fulfilled.\n",
        "TRANSLATION_6": "And when you said to him to whom Allah had shown favor and to whom you had shown a favor: Keep your wife to yourself and be careful of (your duty to) Allah; and you concealed in your soul what Allah would bring to light, and you feared men, and Allah had a greater right that you should fear Him. But when Zaid had accomplished his want of her, We gave her to you as a wife, so that there should be no difficulty for the believers in respect of the wives of their adopted sons, when they have accomplished their want of them; and Allah's command shall be performed.\n",
        "TRANSLATION_7": "When thou saidst to him whom God had blessed and thou hadst favoured, 'Keep thy wife to thyself, and fear God,' and thou wast concealing within thyself what God should reveal, fearing other men; and God has better right for thee to fear Him. So when Zaid had accomplished what he would of her, then We gave her in marriage to thee, so that there should not be any fault in the believers, touching the wives of their adopted sons, when they have accomplished what they would of them; and God's commandment must be performed.\n",
        "TRANSLATION_8": "And when thou saidst unto him on whom Allah hath conferred favour and thou hast conferred favour: Keep thy wife to thyself, and fear Allah. And thou didst hide in thy mind that which Allah was to bring to light, and thou didst fear mankind whereas Allah hath a better right that thou shouldst fear Him. So when Zeyd had performed that necessary formality (of divorce) from her, We gave her unto thee in marriage, so that (henceforth) there may be no sin for believers in respect of wives of their adopted sons, when the latter have performed the necessary formality (of release) from them. The commandment of Allah must be fulfilled.\n",
        "TRANSLATION_9": "You said to the man who had been favoured by God and by you, \"Keep your wife to yourself and have fear of God.\" You sought to hide in your heart what God wished to reveal. You were afraid of people, whereas it would have been more proper to fear God. When Zayd divorced his wife, We gave her to you in marriage, so that there should be no restriction on believers marrying the spouses of their adopted sons when they have divorced them. The commandment of God must be fulfilled.\n",
        "TRANSLATION_10": "And recall what time thou wast saying unto him on whom Allah had conferred favour and thou hadst conferred favour: keep thy wife to thyself and fear Allah; so and thou wast concealing in thy mind that which Allah was going to disclose, and thou wast fearing mankind, whereas Allah had a better right that Him thou shouldst fear. Then when Zaid had performed his purpose concerning her, We wedded her to thee, that there should be no blame for believers in respect of wives of their adopted sons, when they have performed their purpose concerning them. And the ordinance of Allah was to be fulfilled.\n",
        "TRANSLATION_11": "When you said to him whom Allah had blessed, and whom you [too] had blessed, ‘Retain your wife for yourself, and be wary of Allah,’ and you had hidden in your heart what Allah was to divulge, and you feared the people though Allah is worthier that you should fear Him, so when Zayd had got through with her, We wedded her to you, so that there may be no blame on the faithful in respect of the wives of their adopted sons, when the latter have got through with them, and Allah’s command is bound to be fulfilled.\n",
        "TRANSLATION_12": "Behold! Thou didst say to one who had received the grace of Allah and thy favour: \"Retain thou (in wedlock) thy wife, and fear Allah.\" But thou didst hide in thy heart that which Allah was about to make manifest: thou didst fear the people, but it is more fitting that thou shouldst fear Allah. Then when Zaid had dissolved (his marriage) with her, with the necessary (formality), We joined her in marriage to thee: in order that (in future) there may be no difficulty to the Believers in (the matter of) marriage with the wives of their adopted sons, when the latter have dissolved with the necessary (formality) (their marriage) with them. And Allah's command must be fulfilled.\n",
        "TRANSLATION_13": "And (remember) when you said to him (Zaid bin Harithah, the freedslave of the Prophet SAW) on whom Allah has bestowed Grace (by guiding him to Islam) and you (O Muhammad SAW too) have done favour (by manumitting him) \"Keep your wife to yourself, and fear Allah.\" But you did hide in yourself (i.e. what Allah has already made known to you that He will give her to you in marriage) that which Allah will make manifest, you did fear the people (i.e., Muhammad SAW married the divorced wife of his manumitted slave) whereas Allah had a better right that you should fear Him. So when Zaid had accomplished his desire from her (i.e. divorced her), We gave her to you in marriage, so that (in future) there may be no difficulty to the believers in respect of (the marriage of) the wives of their adopted sons when the latter have no desire to keep them (i.e. they have divorced them). And Allah's Command must be fulfilled.\n",
        "TRANSLATION_14": "And when you said to he whom Allah had favored and yourself have favored: 'Keep your wife and fear Allah' and you sought to hide in yourself what Allah was to reveal, fearing people; although Allah has a better right for you to fear Him. And when Zayd had accomplished what he would of her (divorce), We gave her to you (Prophet Muhammad) in marriage, so that there is no fault in believers concerning (marriage to) the former spouse of their foster children if they divorced them. The decree of Allah must be done.\n",
        "TRANSLATION_15": "When you said to him whom God had blessed, and you had favored, “Keep your wife to yourself, and fear God.” But you hid within yourself what God was to reveal. And you feared the people, but it was God you were supposed to fear. Then, when Zaid ended his relationship with her, We gave her to you in marriage, that there may be no restriction for believers regarding the wives of their adopted sons, when their relationship has ended. The command of God was fulfilled.\n",
        "TRANSLATION_16": "And [remember, O Muhammad], when you said to the one on whom Allah bestowed favor and you bestowed favor, \"Keep your wife and fear Allah,\" while you concealed within yourself that which Allah is to disclose. And you feared the people, while Allah has more right that you fear Him. So when Zayd had no longer any need for her, We married her to you in order that there not be upon the believers any discomfort concerning the wives of their adopted sons when they no longer have need of them. And ever is the command of Allah accomplished.\n",
        "TRANSLATION_17": "[33:37] And when (idh is dependent because of [an implied preceding] udhkur, ‘mention [when]’) you said to him to whom God had shown favour, by [guiding him to] Islam, and to whom you [too] had shown favour: by manumitting him — this was Zayd b. Hāritha, who had been a prisoner of war before [the coming of] Islam (in the period of al-jāhiliyya). The Messenger of God (s) purchased him before his call to prophethood, and then manumitted him and adopted him as his son — ‘Retain your wife for yourself and fear God’, before divorcing her. But you had hidden in your heart what God was to disclose, [what] He was to manifest of your love for her and of [the fact] that should Zayd part with her you would marry her, and you feared people, would say, ‘He has married his son’s wife!’, though God is worthier that you should fear Him, in all things, so take her in marriage and do not be concerned with what people say. Zayd subsequently divorced her and her [obligatory] waiting period was completed. God, exalted be He, says: So when Zayd had fulfilled whatever need he had of her, We joined her in marriage to you — the Prophet consummated his marriage with her without [the customary] permission [from her legal guardian] and gratified the Muslims with [a feast of] bread and meat — so that there may not be any restriction for the believers in respect of the wives of their adopted sons, when the latter have fulfilled whatever wish they have of them. And God’s commandment, that which He has decreed, is bound to be realised.\n",
        "TRANSLATION_18": "(And when thou saidst unto him on whom Allah hath conferred favour) through Islam, i.e. Zayd (and thou hast conferred favour) on him by emancipating him: (Keep thy wife to thyself) and do not divorce her, (and fear Allah) and fear Allah and do not let her go. (And thou didst hide in your mind) her love and the desire to marry her (that which Allah was to bring to light) in the Qur'an, (and thou didst fear mankind) and you feel ashamed of people because of this (whereas Allah had a better right that thou shouldst fear Him) whereas you should be ashamed of Allah. (So when Zayd had performed the necessary formality (of divorce) from her) when she has finished her waiting period after her divorce from Zayd, (We gave her unto thee in marriage, so that (henceforth)) after you (there may be no sin for believers about wives of their adopted sons, when the latter have performed the necessary formality (of release) from them) when they had finished their waiting period after they are divorced or after the death of their husband. (The commandment of Allah) marrying Zayd to Muhammad (pbuh) (must be fulfilled) must take place. 477\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "33:37",
            "14:22",
            "24:6",
            "4:108",
            "5:52",
            "33:38",
            "33:4",
            "33:50",
            "6:125",
            "12:51"
        ],
        "BIBLE": [
            "torah:exodus:36:6",
            "writings:daniel:6:13",
            "prophets:nahum:1:14",
            "prophets:i%20kings:3:6",
            "prophets:ii%20kings:10:5",
            "prophets:ezekiel:3:20",
            "prophets:ii%20kings:10:15",
            "prophets:ezekiel:11:15",
            "prophets:i%20kings:5:23",
            "torah:exodus:32:1"
        ]
    }
}