{
    "VERSE": "33:40",
    "ARABIC": "مَّا كَانَ مُحَمَّدٌ أَبَآ أَحَدٍ مِّن رِّجَالِكُمْ وَلَٰكِن رَّسُولَ ٱللَّهِ وَخَاتَمَ ٱلنَّبِيِّۦنَ وَكَانَ ٱللَّهُ بِكُلِّ شَىْءٍ عَلِيمًا",
    "ENGLISH": {
        "TRANSLATION_0": "Muhammad is not the father of any of your men, but the Messenger of Allah and the Final Seal of the Prophets. Allah has knowledge of all things.",
        "TRANSLATION_1": "Muhammad is not the father of any man among you, but a messenger of God, and the seal of the prophets. God has knowledge of everything.\n",
        "TRANSLATION_2": "Muhammad is not the father of any of your men, but he is the Messenger of Allah and the seal of the Prophets. Allah has full knowledge of everything.\n",
        "TRANSLATION_3": "Muhammad is not the father of any of your males. He is the Messenger of God and the last Prophet. God has the knowledge of all things.\n",
        "TRANSLATION_4": "Mohammed (peace and blessings be upon him) is not the father of any man among you – but he is the Noble Messenger of Allah and the Last of the Prophets*; and Allah knows all things. (* Prophet Mohammed – peace and blessings be upon him – is the Last Prophet. There can be no new Prophet after him).\n",
        "TRANSLATION_5": "Muhammad is not the father of any of your men, but he is the Messenger of Allah and the last of the Prophets. And Allah is Ever All-Aware of everything.\n",
        "TRANSLATION_6": "Muhammad is not the father of any of your men, but he is the Apostle of Allah and the Last of the prophets; and Allah is cognizant of all things.\n",
        "TRANSLATION_7": "Muhammad is not the father of any one of your men, but the Messenger of God, and the Seal of the Prophets; God has knowledge of everything.\n",
        "TRANSLATION_8": "Muhammad is not the father of any man among you, but he is the messenger of Allah and the Seal of the Prophets; and Allah is ever Aware of all things.\n",
        "TRANSLATION_9": "Muhammad is not the father of any of your men, but is God's Messenger and the seal of the Prophets. God has knowledge of all things.\n",
        "TRANSLATION_10": "Muhammad is not the father of any of your males, but the apostle of Allah and the seal of the prophets; and Allah of everything is ever the Knower.\n",
        "TRANSLATION_11": "Muhammad is not the father of any man among you, but he is the Apostle of Allah and the Seal of the Prophets, and Allah has knowledge of all things.\n",
        "TRANSLATION_12": "Muhammad is not the father of any of your men, but (he is) the Messenger of Allah, and the Seal of the Prophets: and Allah has full knowledge of all things.\n",
        "TRANSLATION_13": "Muhammad (SAW) is not the father of any man among you, but he is the Messenger of Allah and the last (end) of the Prophets. And Allah is Ever AllAware of everything.\n",
        "TRANSLATION_14": "Muhammad is not the father of any of your men. He is the Messenger of Allah and the Seal of the Prophets. Allah has knowledge of all things.\n",
        "TRANSLATION_15": "Muhammad is not the father of any of your men; but he is the Messenger of God, and the seal of the prophets. God is Cognizant of everything.\n",
        "TRANSLATION_16": "Muhammad is not the father of [any] one of your men, but [he is] the Messenger of Allah and last of the prophets. And ever is Allah, of all things, Knowing.\n",
        "TRANSLATION_17": "[33:40] Muhammad is not the father of any man among you: he is not Zayd’s biological father and so it is not unlawful for him to marry his [former] wife Zaynab [after him]; but, he is, the Messenger of God and the Seal of the Prophets, and so he will not have a son that is a [fully grown] man to be a prophet after him (a variant reading [for khātim al-nabiyyīna] has khātam al-nabiyyīn, as in the instrument [known as a] ‘seal’, in other words, their [prophethood] has been sealed by him). And God has knowledge of all things, among these is the fact that there will be no prophet after him, and even when the lord Jesus descends [at the end of days] he will rule according to his [Muhammad’s] Law.\n",
        "TRANSLATION_18": "(Muhammad is not the father of any man among you) i.e. Zayd, (but he is the Messenger of Allah) but Muhammad is the Messenger of Allah (and the Seal of the Prophets) with him Allah has sealed the advent of prophets, such that there is no prophet after him; (and Allah is Aware of all things) of your words and works.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "33:40",
            "4:32",
            "49:16",
            "29:62",
            "33:54",
            "9:115",
            "9:61",
            "64:11",
            "57:3",
            "48:26"
        ],
        "BIBLE": [
            "torah:deuteronomy:4:32",
            "writings:daniel:11:38",
            "torah:deuteronomy:28:64",
            "writings:ecclesiastes:12:13",
            "prophets:isaiah:40:28",
            "writings:ecclesiastes:7:14",
            "prophets:judges:11:39",
            "writings:ecclesiastes:3:14",
            "torah:numbers:5:10",
            "prophets:i%20samuel:22:15"
        ]
    }
}