{
    "VERSE": "33:44",
    "ARABIC": "تَحِيَّتُهُمْ يَوْمَ يَلْقَوْنَهُۥ سَلَٰمٌ وَأَعَدَّ لَهُمْ أَجْرًا كَرِيمًا",
    "ENGLISH": {
        "TRANSLATION_0": "Their greeting on the Day they meet Him will be 'Peace!' and He has prepared a generous reward for them.",
        "TRANSLATION_1": "Their greeting on the day they meet Him will be: \"Peace;\" and He has a generous reward ready for them.\n",
        "TRANSLATION_2": "On the Day they meet Him they will be greeted with: “Peace.” He has prepared for them a generous reward.\n",
        "TRANSLATION_3": "On the day when they will be brought into the presence of their Lord, their greeting to each other will be, \"Peace be with you.\" God has prepared an honorable reward for them.\n",
        "TRANSLATION_4": "For them the salutation upon their meeting* is “Peace”; and an honourable reward is kept prepared for them. (* Upon death / while entering Paradise / meeting with Allah).\n",
        "TRANSLATION_5": "Their greeting on the Day they shall meet Him will be \"Salam (Peace!)\" And He has prepared for them a generous reward.\n",
        "TRANSLATION_6": "Their salutation on the day that they meet Him shall be, Peace, and He has prepared for them an honourable reward.\n",
        "TRANSLATION_7": "Their greeting, on the day when they shall meet Him, will be 'Peace!' And He has prepared for them a generous wage.\n",
        "TRANSLATION_8": "Their salutation on the day when they shall meet Him will be: Peace. And He hath prepared for them a goodly recompense.\n",
        "TRANSLATION_9": "On the Day they meet Him, they will be welcomed with the greeting, \"Peace!\" He has prepared an honourable reward for them.\n",
        "TRANSLATION_10": "Their greeting on the Day whereon they meet Him will be: peace. And He hath gotten ready for them a generous hire.\n",
        "TRANSLATION_11": "The day they encounter Him, their greeting will be, ‘Peace,’ and He holds in store for them a noble reward.\n",
        "TRANSLATION_12": "Their salutation on the Day they meet Him will be \"Peace!\"; and He has prepared for them a generous Reward.\n",
        "TRANSLATION_13": "Their greeting on the Day they shall meet Him will be \"Salam: Peace (i.e. the angels will say to them: Salamu 'Alaikum)!\" And He has prepared for them a generous reward (i.e. Paradise).\n",
        "TRANSLATION_14": "On the Day they meet Him, their greeting shall be 'Peace' A generous recompense He has prepared for them.\n",
        "TRANSLATION_15": "Their greeting on the Day they meet Him is, “Peace,” and He has prepared for them a generous reward.\n",
        "TRANSLATION_16": "Their greeting the Day they meet Him will be, \"Peace.\" And He has prepared for them a noble reward.\n",
        "TRANSLATION_17": "[33:44] Their greeting, from Him, exalted be He, on the day they encounter Him will be ‘Peace’, [extended to them] by the tongues of the angels. And He has prepared for them a noble reward, namely, Paradise.\n",
        "TRANSLATION_18": "(Their salutation) the believers' salutation (on the day when they shall meet Him will be: Peace) from Allah and the angels will greet them at the gates of Paradise. (And He hath prepared for them a goodly recompense) a fair reward in Paradise.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "33:44",
            "19:15",
            "57:18",
            "33:31",
            "19:33",
            "57:11",
            "12:104",
            "51:25",
            "26:87",
            "84:25"
        ],
        "BIBLE": [
            "writings:nehemiah:8:11",
            "torah:exodus:14:14",
            "writings:psalms:116:3",
            "prophets:zephaniah:1:7",
            "prophets:ii%20kings:7:9",
            "torah:leviticus:10:3",
            "torah:exodus:16:32",
            "writings:daniel:9:15",
            "writings:ii%20chronicles:22:9",
            "torah:numbers:30:8"
        ]
    }
}