{
    "VERSE": "33:45",
    "ARABIC": "يَٰٓأَيُّهَا ٱلنَّبِىُّ إِنَّآ أَرْسَلْنَٰكَ شَٰهِدًا وَمُبَشِّرًا وَنَذِيرًا",
    "ENGLISH": {
        "TRANSLATION_0": "O Prophet! We have sent you as a witness, and a bringer of good news and a warner,",
        "TRANSLATION_1": "O Prophet, We have sent you as a witness and a bearer of happy tidings and an admonisher,\n",
        "TRANSLATION_2": "O Prophet, We have sent you forth as a witness, a bearer of good tidings, and a warner,\n",
        "TRANSLATION_3": "Prophet, We have sent you as a witness, a bearer of glad news, a warner,\n",
        "TRANSLATION_4": "O Herald of the Hidden! We have indeed sent you as an observing present witness and a Herald of glad tidings and warning.\n",
        "TRANSLATION_5": "O Prophet! Verily, We have sent you as witness, and a bearer of glad tidings, and a warner,\n",
        "TRANSLATION_6": "O Prophet! surely We have sent you as a witness, and as a bearer of good news and as a warner,\n",
        "TRANSLATION_7": "O Prophet, We have sent thee as a witness, and good tidings to bear and warning,\n",
        "TRANSLATION_8": "O Prophet! Lo! We have sent thee as a witness and a bringer of good tidings and a warner.\n",
        "TRANSLATION_9": "O Prophet, We have sent forth you as a witness, as a bearer of good news and a warner.\n",
        "TRANSLATION_10": "Prophet! verily We have sent thee a witness and a bearer of glad tidings and a warner.\n",
        "TRANSLATION_11": "O Prophet! Indeed We have sent you as a witness, as a bearer of good news and as a warner\n",
        "TRANSLATION_12": "O Prophet! Truly We have sent thee as a Witness, a Bearer of Glad Tidings, and Warner,-\n",
        "TRANSLATION_13": "O Prophet (MuhammadSAW)! Verily, We have sent you as witness, and a bearer of glad tidings, and a warner,\n",
        "TRANSLATION_14": "O Prophet, We have sent you as a witness, a bearer of glad tidings, and to bear warning;\n",
        "TRANSLATION_15": "O prophet! We have sent you as a witness, and a bearer of good news, and a warner.\n",
        "TRANSLATION_16": "O Prophet, indeed We have sent you as a witness and a bringer of good tidings and a warner.\n",
        "TRANSLATION_17": "[33:45] O Prophet! Indeed We have sent you as a witness, against those to whom you have were sent, and as a bearer of good tidings, for those who affirm your sincerity, of Paradise, and as a warner, for those who deny you, of the [punishment of the] Fire,\n",
        "TRANSLATION_18": "(O Prophet!) He means Muhammad (pbuh) (Lo! We have sent thee as a witness) that you have conveyed the message to your nation (and a bringer of good tidings) i.e. Paradise to whoever believes in Allah (and a warner) against the Fire for those who disbelieve in Him.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "33:45",
            "48:8",
            "15:89",
            "25:56",
            "37:112",
            "22:49",
            "8:64",
            "33:56",
            "15:95",
            "17:105"
        ],
        "BIBLE": [
            "writings:ii%20chronicles:24:19",
            "torah:genesis:24:12",
            "writings:psalms:34:9",
            "prophets:jeremiah:29:19",
            "prophets:i%20samuel:20:12",
            "prophets:judges:3:18",
            "prophets:ezekiel:17:8",
            "writings:psalms:16:2",
            "writings:psalms:143:9",
            "torah:leviticus:5:1"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:5:1"
        ]
    }
}