{
    "VERSE": "33:46",
    "ARABIC": "وَدَاعِيًا إِلَى ٱللَّهِ بِإِذْنِهِۦ وَسِرَاجًا مُّنِيرًا",
    "ENGLISH": {
        "TRANSLATION_0": "and a caller to Allah by His permission and a light-giving lamp.",
        "TRANSLATION_1": "And to call (men) to God by His leave, and as a lamp resplendent.\n",
        "TRANSLATION_2": "as one who calls people to Allah by His leave, and as a bright, shining lamp.\n",
        "TRANSLATION_3": "a preacher for God by His permission and as a shining torch.\n",
        "TRANSLATION_4": "And as a caller towards Allah, by His command, and as a sun that enlightens. (The Holy Prophet is a light from Allah.)\n",
        "TRANSLATION_5": "And as one who invites to Allah by His leave, and as a lamp spreading light.\n",
        "TRANSLATION_6": "And as one inviting to Allah by His permission, and as a light-giving torch.\n",
        "TRANSLATION_7": "calling unto God by His leave, and as a light-giving lamp.\n",
        "TRANSLATION_8": "And as a summoner unto Allah by His permission, and as a lamp that giveth light.\n",
        "TRANSLATION_9": "As one who calls people to God by His leave, and guides them like a shining light.\n",
        "TRANSLATION_10": "And a summoner unto Allah by His command and an illuminating lamp.\n",
        "TRANSLATION_11": "and as a summoner to Allah by His permission, and as a radiant lamp.\n",
        "TRANSLATION_12": "And as one who invites to Allah's (grace) by His leave, and as a lamp spreading light.\n",
        "TRANSLATION_13": "And as one who invites to Allah [Islamic Monotheism, i.e. to worship none but Allah (Alone)] by His Leave, and as a lamp spreading light (through your instructions from the Quran and the Sunnah the legal ways of the Prophet SAW).\n",
        "TRANSLATION_14": "a caller to Allah by His permission and as a light shedding lamp.\n",
        "TRANSLATION_15": "And a caller towards God by His leave, and an illuminating beacon.\n",
        "TRANSLATION_16": "And one who invites to Allah, by His permission, and an illuminating lamp.\n",
        "TRANSLATION_17": "[33:46] and as a summoner to God, to obedience to Him, by His leave, by His command, and as a illuminating lamp, in other words, the equivalent of it, in terms of one’s being able to find guidance therewith.\n",
        "TRANSLATION_18": "(And as a summoner unto Allah) unto the religion and obedience of Allah (by His permission) by His command, (and as a lamp that giveth light) and taken as an example to follow.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "33:46",
            "10:100",
            "2:15",
            "5:16",
            "23:38",
            "59:5",
            "2:156",
            "85:20",
            "51:50",
            "9:1"
        ],
        "BIBLE": [
            "prophets:isaiah:35:8",
            "prophets:i%20kings:1:10",
            "prophets:isaiah:51:4",
            "prophets:i%20samuel:25:22",
            "prophets:isaiah:42:6",
            "torah:genesis:3:20",
            "prophets:i%20samuel:9:9",
            "torah:genesis:3:9",
            "prophets:i%20samuel:23:8",
            "torah:genesis:1:5"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:1"
        ]
    }
}