{
    "VERSE": "33:47",
    "ARABIC": "وَبَشِّرِ ٱلْمُؤْمِنِينَ بِأَنَّ لَهُم مِّنَ ٱللَّهِ فَضْلًا كَبِيرًا",
    "ENGLISH": {
        "TRANSLATION_0": "Give good news to the muminun that they will receive immense favour from Allah.",
        "TRANSLATION_1": "Give glad tidings to the believers that there is great bounty for them from God.\n",
        "TRANSLATION_2": "Announce to the believers the good tidings that Allah has kept bounteous blessings in store for them.\n",
        "TRANSLATION_3": "Give glad news to the believers of their receiving great favor from God.\n",
        "TRANSLATION_4": "And give glad tidings to the believers that for them is Allah’s extreme munificence.\n",
        "TRANSLATION_5": "And announce to the believers the glad tidings, that they will have from Allah a great bounty.\n",
        "TRANSLATION_6": "And give to the believers the good news that they shall have a great grace from Allah.\n",
        "TRANSLATION_7": "Give good tidings to the believers that there awaits them with God great bounty.\n",
        "TRANSLATION_8": "And announce unto the believers the good tidings that they will have great bounty from Allah.\n",
        "TRANSLATION_9": "Convey to the believers the good news that God has bounteous blessings in store for them.\n",
        "TRANSLATION_10": "And bear thou unto the believers the glad tidings that theirs is from Allah a great grace.\n",
        "TRANSLATION_11": "Announce to the faithful the good news that there will be for them a great grace from Allah.\n",
        "TRANSLATION_12": "Then give the Glad Tidings to the Believers, that they shall have from Allah a very great Bounty.\n",
        "TRANSLATION_13": "And announce to the believers (in the Oneness of Allah and in His Messenger Muhammad SAW) the glad tidings, that they will have from Allah a Great Bounty.\n",
        "TRANSLATION_14": "Give to the believers the glad tidings that with Allah there is for them a great bounty.\n",
        "TRANSLATION_15": "And give the believers the good news that for them is a great reward.\n",
        "TRANSLATION_16": "And give good tidings to the believers that they will have from Allah great bounty.\n",
        "TRANSLATION_17": "[33:47] And give good tidings to the believers that there will be for them a great bounty from God, namely, Paradise.\n",
        "TRANSLATION_18": "When Allah's words (Lo! We have given thee (0 Muhammad) a signal victory, that Allah may forgive you of 478 your sins that which is past and that which is to come) [al-Fath, 48:1] were revealed the believers said: \"Congratulations to you, Messenger of Allah, for being forgiven. But what do we get from Allah?\" And so Allah said: (And announce) Muhammad (unto the believers the good tidings that they will have great bounty from Allah) an abundant reward in Paradise.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "33:47",
            "3:171",
            "45:12",
            "9:75",
            "35:32",
            "62:10",
            "31:30",
            "22:62",
            "24:10",
            "57:7"
        ],
        "BIBLE": [
            "torah:deuteronomy:8:10",
            "torah:deuteronomy:16:17",
            "torah:genesis:28:4",
            "writings:job:29:21",
            "torah:deuteronomy:26:11",
            "prophets:ii%20samuel:4:10",
            "writings:esther:2:18",
            "prophets:judges:11:24",
            "writings:ezra:9:13",
            "prophets:ii%20samuel:17:7"
        ]
    }
}