{
    "VERSE": "33:48",
    "ARABIC": "وَلَا تُطِعِ ٱلْكَٰفِرِينَ وَٱلْمُنَٰفِقِينَ وَدَعْ أَذَىٰهُمْ وَتَوَكَّلْ عَلَى ٱللَّهِ وَكَفَىٰ بِٱللَّهِ وَكِيلًا",
    "ENGLISH": {
        "TRANSLATION_0": "Do not obey the kafirun and hypocrites and disregard their abuse of you. Put your trust in Allah. Allah suffices as a Protector.",
        "TRANSLATION_1": "Do not listen to the unbelievers and the hypocrites. Ignore what they do to hurt you, and put your trust in God. God is sufficient as protector.\n",
        "TRANSLATION_2": "Do not yield to the unbelievers and the hypocrites, and disregard the hurt that comes from them, and put your trust in Allah. Allah suffices as the Guardian to entrust one's affairs to.\n",
        "TRANSLATION_3": "Do not yield to the disbelievers or the hypocrites. Ignore their annoying you. Trust in God. God is your all Sufficient Protector.\n",
        "TRANSLATION_4": "And do not please the disbelievers and the hypocrites, and overlook the pain they cause and rely upon Allah; and Allah suffices as a Trustee.\n",
        "TRANSLATION_5": "And obey not the disbelievers and the hypocrites, and harm them not. And put your trust in Allah, and sufficient is Allah as a Trustee.\n",
        "TRANSLATION_6": "And be not compliant to the unbelievers and the hypocrites, and leave unregarded their annoying talk, and rely on Allah; and Allah is sufficient as a Protector.\n",
        "TRANSLATION_7": "And obey not the unbelievers and the hypocrites; heed not their hurt, but put thy trust in God; God suffices as a guardian.\n",
        "TRANSLATION_8": "And incline not to the disbelievers and the hypocrites. Disregard their noxious talk, and put thy trust in Allah. Allah is sufficient as Trustee.\n",
        "TRANSLATION_9": "Do not yield to those who deny the truth and the hypocrites: ignore their hurtful talk. Put your trust in God; God is your all sufficient guardian.\n",
        "TRANSLATION_10": "And obey thou not the infidels and the hypocrites, and heed not their annoyances, and trust in Allah; and Allah sufficeth as a Trustee.\n",
        "TRANSLATION_11": "Do not obey the faithless and the hypocrites, and disregard their torments, and put your trust in Allah, and Allah suffices as trustee.\n",
        "TRANSLATION_12": "And obey not (the behests) of the Unbelievers and the Hypocrites, and heed not their annoyances, but put thy Trust in Allah. For enough is Allah as a Disposer of affairs.\n",
        "TRANSLATION_13": "And obey not the disbelievers and the hypocrites, and harm them not (till you are ordered). And put your trust in Allah, and Sufficient is Allah as a Wakil (Trustee, or Disposer of affairs).\n",
        "TRANSLATION_14": "Do not obey the unbelievers and the hypocrites, pay no attention to their hurt. Put your trust in Allah; Allah suffices as a Guardian.\n",
        "TRANSLATION_15": "And do not obey the blasphemers and the hypocrites, and ignore their insults, and rely on God. God is a sufficient protector.\n",
        "TRANSLATION_16": "And do not obey the disbelievers and the hypocrites but do not harm them, and rely upon Allah. And sufficient is Allah as Disposer of affairs.\n",
        "TRANSLATION_17": "[33:48] And do not obey the disbelievers and the hypocrites, in [assenting to do] what contravenes your Law; and disregard, leave aside, their injuriousness — do not retaliate against them for it until you receive a command [from God] regarding [how to deal with] them. And put your trust in God, for He will suffice you, and God suffices as Guardian, One to Whom matters are entrusted.\n",
        "TRANSLATION_18": "Allah then went back to the subject of the beginning of the surah, saying: (And incline not) Muhammad (to the disbelievers) of Mecca: Abu Sufyan and his host (and the hypocrites) of Medina. (Disregard their noxious talk) and do not proceed to kill them, Muhammad, (and put thy trust in Allah) rely on Allah. (Allah is sufficient as Trustee) He is sufficient to fulfil His promise to give you victory; it is also said that this means: He is sufficient as a Protector.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "33:48",
            "33:3",
            "6:107",
            "39:62",
            "2:15",
            "42:6",
            "47:11",
            "3:141",
            "2:222",
            "10:95"
        ],
        "BIBLE": [
            "writings:ii%20chronicles:14:10",
            "torah:deuteronomy:26:13",
            "torah:deuteronomy:14:29",
            "prophets:jeremiah:38:25",
            "prophets:obadiah:1:5",
            "writings:i%20chronicles:17:17",
            "writings:daniel:6:13",
            "writings:ruth:2:11",
            "writings:ii%20chronicles:35:21",
            "writings:ii%20chronicles:25:16"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:1:1"
        ]
    }
}