{
    "VERSE": "33:50",
    "ARABIC": "يَٰٓأَيُّهَا ٱلنَّبِىُّ إِنَّآ أَحْلَلْنَا لَكَ أَزْوَٰجَكَ ٱلَّٰتِىٓ ءَاتَيْتَ أُجُورَهُنَّ وَمَا مَلَكَتْ يَمِينُكَ مِمَّآ أَفَآءَ ٱللَّهُ عَلَيْكَ وَبَنَاتِ عَمِّكَ وَبَنَاتِ عَمَّٰتِكَ وَبَنَاتِ خَالِكَ وَبَنَاتِ خَٰلَٰتِكَ ٱلَّٰتِى هَاجَرْنَ مَعَكَ وَٱمْرَأَةً مُّؤْمِنَةً إِن وَهَبَتْ نَفْسَهَا لِلنَّبِىِّ إِنْ أَرَادَ ٱلنَّبِىُّ أَن يَسْتَنكِحَهَا خَالِصَةً لَّكَ مِن دُونِ ٱلْمُؤْمِنِينَ قَدْ عَلِمْنَا مَا فَرَضْنَا عَلَيْهِمْ فِىٓ أَزْوَٰجِهِمْ وَمَا مَلَكَتْ أَيْمَٰنُهُمْ لِكَيْلَا يَكُونَ عَلَيْكَ حَرَجٌ وَكَانَ ٱللَّهُ غَفُورًا رَّحِيمًا",
    "ENGLISH": {
        "TRANSLATION_0": "O Prophet! We have made halal for you: your wives to whom you have given dowries and any slavegirls you own from the booty Allah has allotted you and the daughters of your paternal uncles and the daughters of your paternal aunts and the daughters of your maternal uncles and the daughters of your maternal aunts who have made hijra with you and any mumin woman who gives herself to the Prophet if the Prophet desires to prescribed for them regarding their wives and any slavegirls they possess - in order that there be no restriction on you. Allah is Ever-Forgiving, Most Merciful.",
        "TRANSLATION_1": "We have made lawful for you, O Prophet, wives to whom you have given their dower, and God-given maids and captives you have married, and the daughters of your father's brothers and daughters of your father's sisters, and daughters of your mother's brothers and sisters, who migrated with you; and a believing woman who offers herself to the Prophet if the Prophet desires to marry her. This is a privilege only for you and not the other believers. We know what We have ordained for them about their wives and maids they possess, so that you may be free of blame, for God is forgiving and kind.\n",
        "TRANSLATION_2": "O Prophet, We have made lawful for you your wives whose bridal dues you have paid, and the slave-girls you possess from among the prisoners of war, and the daughters of your paternal uncles and paternal aunts, and the daughters of your maternal uncles and maternal aunts who have migrated with you, and a believing woman who gives herself to the Prophet and whom he wants to take in marriage. (O Prophet), this privilege is yours alone to the exclusion of other believers. We know well what restrictions We have imposed upon them as regards their wives and those whom their right hands possess, (and have exempted you from those restrictions) that there may be no constraint upon you. Allah is Most Forgiving, Most Merciful.\n",
        "TRANSLATION_3": "Prophet, We have made lawful for you your wives whom you have given their dowry, slave girls whom God has given to you as gifts, the daughters of your uncles and aunts, both paternal and maternal, who have migrated with you. The believing woman, who has offered herself to the Prophet and whom the Prophet may want to marry, will be specially for him, not for other believers. We knew what to make obligatory for them concerning their wives and slave girls so that you would face no hardship (because we have given distinction to you over the believers). God is All-forgiving and All-merciful.\n",
        "TRANSLATION_4": "O Herald of the Hidden! We have indeed made lawful for you the wives to whom you have paid their bridal money, and the bondwomen you possess whom Allah gave you as war booty, and the daughters of your paternal uncles, and the daughters of your paternal aunts, and the daughters of your maternal uncles, and the daughters of your maternal aunts, those who migrated with you; and the believing woman if she gifts her life to the Prophet, if the Prophet desires to take her in marriage; this is exclusively for you, not for your followers; We indeed know what We have enjoined upon the Muslims concerning their wives and the bondwomen they possess – this exclusivity for you is so that you may not have constraints; and Allah is Oft Forgiving, Most Merciful.\n",
        "TRANSLATION_5": "O Prophet! Verily, We have made lawful to you your wives, to whom you have paid their due (dowery), and those (slaves) whom your right hand possesses -- whom Allah has given to you, and the daughters of your paternal uncles and the daughters of your paternal aunts and the daughters of your maternal uncles and the daughters of your maternal aunts who migrated with you, and a believing woman if she offers herself to the Prophet, and the Prophet wishes to marry her -- a privilege for you only, not for the (rest of) the believers. Indeed We know what We have enjoined upon them about their wives and those (slaves) whom their right hands possess, in order that there should be no difficulty on you. And Allah is Ever Oft-Forgiving, Most Merciful.\n",
        "TRANSLATION_6": "O Prophet! surely We have made lawful to you your wives whom you have given their dowries, and those whom your right hand possesses out of those whom Allah has given to you as prisoners of war, and the daughters of your paternal uncles and the daughters of your paternal aunts, and the daughters of your maternal uncles and the daughters of your maternal aunts who fled with you; and a believing woman if she gave herself to the Prophet, if the Prophet desired to marry her-- specially for you, not for the (rest of) believers; We know what We have ordained for them concerning their wives and those whom their right hands possess in order that no blame may attach to you; and Allah is Forgiving, Merciful.\n",
        "TRANSLATION_7": "O Prophet, We have made lawful for thee thy wives whom thou hast given their wages and what thy right hand owns, spoils of war that God has given thee, and the daughters of thy uncles paternal and aunts paternal, thy uncles maternal and aunts maternal, who have emigrated with thee, and any woman believer, if she give herself to the Prophet and if the Prophet desire to take her in marriage, for thee exclusively, apart from the believers -- We know what We have imposed upon them touching their wives and what their right hands own -- that there may be no fault in thee; God is All-forgiving, All-compassionate.\n",
        "TRANSLATION_8": "O Prophet! Lo! We have made lawful unto thee thy wives unto whom thou hast paid their dowries, and those whom thy right hand possesseth of those whom Allah hath given thee as spoils of war, and the daughters of thine uncle on the father's side and the daughters of thine aunts on the father's side, and the daughters of thine uncle on the mother's side and the daughters of thine aunts on the mother's side who emigrated with thee, and a believing woman if she give herself unto the Prophet and the Prophet desire to ask her in marriage - a privilege for thee only, not for the (rest of) believers - We are Aware of that which We enjoined upon them concerning their wives and those whom their right hands possess - that thou mayst be free from blame, for Allah is ever Forgiving, Merciful.\n",
        "TRANSLATION_9": "Prophet, We have made lawful for you the wives to whom you have given their dowers, as well as those whom your right hand possesses from among the captives of war whom God has bestowed upon you. and [We have made lawful to you] the daughters of your paternal uncles and aunts, and the daughters of your maternal uncles and aunts, who have migrated with you; and any believing woman who gives herself to the Prophet, provided the Prophet wants to marry her. This applies only to you and not to the rest of the believers. We know what We have prescribed for them concerning their wives and those whom their right hands may possess, in order that there may be no blame on you. God is most forgiving, most merciful.\n",
        "TRANSLATION_10": "O Prophet! verily We have allowed unto thee thy wives unto whom thou hast given their hires, and also those whomsoever thy right hand ownEth of those whomsoever Allah hath given thee as spoils of war, and the daughters of thy paternal uncle, and the daughters of thy paternal aunts, and the daughters of thy maternal uncle, and the daughters of thy maternal aunts, who migrated with thee, and any believing woman, when she offereth herself unto the Prophet if the Prophet desire to wed her --purely for thee, above the rest of the believers. Surely We know that which We have ordained unto them concerning their wives and those whom their right hands won: in order that there may be no blame upon thee: And Allah is ever Forgiving, Merciful.\n",
        "TRANSLATION_11": "O Prophet! Indeed We have made lawful to you your wives whom you have given their dowries, and those whom your right hand owns, of those whom Allah gave you as spoils of war, and the daughters of your paternal uncle, and the daughters of your paternal aunts, and the daughters of your maternal uncle, and the daughters of your maternal aunts who migrated with you, and a faithful woman if she offers herself to the Prophet and the Prophet desires to take her in marriage (a privilege exclusively for you, not for [the rest of] the faithful; We know what We have made lawful for them with respect to their wives and those whom their right hands own, so that there may be no blame on you ), and Allah is all-forgiving, all-merciful.\n",
        "TRANSLATION_12": "O Prophet! We have made lawful to thee thy wives to whom thou hast paid their dowers; and those whom thy right hand possesses out of the prisoners of war whom Allah has assigned to thee; and daughters of thy paternal uncles and aunts, and daughters of thy maternal uncles and aunts, who migrated (from Makka) with thee; and any believing woman who dedicates her soul to the Prophet if the Prophet wishes to wed her;- this only for thee, and not for the Believers (at large); We know what We have appointed for them as to their wives and the captives whom their right hands possess;- in order that there should be no difficulty for thee. And Allah is Oft-Forgiving, Most Merciful.\n",
        "TRANSLATION_13": "O Prophet (Muhammad SAW)! Verily, We have made lawful to you your wives, to whom you have paid their Mahr (bridal money given by the husband to his wife at the time of marriage), and those (captives or slaves) whom your right hand possesses - whom Allah has given to you, and the daughters of your 'Amm (paternal uncles) and the daughters of your 'Ammah (paternal aunts) and the daughters of your Khal (maternal uncles) and the daughters of your Khalah (maternal aunts) who migrated (from Makkah) with you, and a believing woman if she offers herself to the Prophet, and the Prophet wishes to marry her; a privilege for you only, not for the (rest of) the believers. Indeed We know what We have enjoined upon them about their wives and those (captives or slaves) whom their right hands possess, - in order that there should be no difficulty on you. And Allah is Ever OftForgiving, Most Merciful.\n",
        "TRANSLATION_14": "O Prophet, We have made lawful to you the wives to whom you have given dowries and those whom your right hand possesses, of whatever spoils of war that Allah has given you; and the daughters of your paternal uncles and paternal aunts, and of your paternal and maternal aunts who migrated with you; and any believing woman who gives herself to the Prophet, if the Prophet wishes to take her in marriage. This is only for you and not any other believer. We know the duties We have imposed on them concerning their wives and those whom their right hand possesses, so that there should be no fault in you. Allah is the Forgiving and Merciful.\n",
        "TRANSLATION_15": "O Prophet! We have permitted to you your wives to whom you have given their dowries, and those you already have, as granted to you by God, and the daughters of your paternal uncle, and the daughters of your paternal aunts, and the daughters of your maternal uncle, and the daughters of your maternal aunts who emigrated with you, and a believing woman who has offered herself to the Prophet, if the Prophet desires to marry her, exclusively for you, and not for the believers. We know what We have ordained for them regarding their wives and those their right-hands possess. This is to spare you any difficulty. God is Forgiving and Merciful.\n",
        "TRANSLATION_16": "O Prophet, indeed We have made lawful to you your wives to whom you have given their due compensation and those your right hand possesses from what Allah has returned to you [of captives] and the daughters of your paternal uncles and the daughters of your paternal aunts and the daughters of your maternal uncles and the daughters of your maternal aunts who emigrated with you and a believing woman if she gives herself to the Prophet [and] if the Prophet wishes to marry her, [this is] only for you, excluding the [other] believers. We certainly know what We have made obligatory upon them concerning their wives and those their right hands possess, [but this is for you] in order that there will be upon you no discomfort. And ever is Allah Forgiving and Merciful.\n",
        "TRANSLATION_17": "[33:50] O Prophet! Indeed We have made lawful for you your wives whom you have given their dowries and what   your right hand owns, of those whom God has given you as spoils of war, from the disbelievers, [whom you have] taken captive, such as Safiyya and Juwayriyya, and the daughters of your paternal uncles and the daughters of your paternal aunts, and the daughters of your maternal uncles and the daughters of your maternal aunts who emigrated with you, as opposed to those who did not emigrate, and any believing woman if she gift herself [in marriage] to the Prophet and if the Prophet desire to take her in marriage, and ask for her hand in marriage without paying [her] a dowry — a privilege for you exclusively, not for the [rest of the] believers (nikāh, ‘marriage’, when expressed by the term hiba, ‘gift’, denotes [marriage] without dowry). Indeed We know what We have imposed upon them, namely, the believers, with respect to their wives, in the way of rulings, to the effect that they should not take more than four wives and should only marry with [the consent of] a legal guardian, [the presence of] witnesses and [the payment of] a dowry, and, with respect to, what their right hands own, of slavegirls, in the way of purchase or otherwise, so that the handmaiden be one lawful for her master, such as a slavegirl belonging to the People of the Scripture (kitābiyya), and not a Magian or an idolater, and that she should be ascertained [as not carrying child] with the necessary waiting period (istibrā’) before copulation; so that (li-kaylā is semantically connected to what came before [this last statement]) there may be no [unnecessary] restriction for you, [no] constraint in marriage [for you]. And God is Forgiving, of what is difficult to guard against, Merciful, in giving dispensations [allowing for latitude] in this respect.\n",
        "TRANSLATION_18": "(O Prophet! Lo! We have made lawful unto thee thy wives unto whom thou hast paid their dowries, and those whom thy right hand possesseth) Maria the Copt (of those whom Allah hath given thee as spoils of war, and the daughters of thine uncles on the father's side) and it is lawful for you to marry the daughters of your paternal uncle (and the daughters of thine aunts on the father's side) from the Banu 'Abd al-Muttalib, (and the daughters of thine uncles on the mother's side) from the Banu 'Abd Manaf Ibn Zahrah (who emigrated with thee) from Mecca to Medina, (and a believing woman) who believes in Allah's divine Oneness: i.e. Umm Sharik Bint Jabir al-'Amiriyyah (if she give herself unto the Prophet and the Prophet desire to ask her in marriage, a privilege for thee only) and a dispensation for you only, (not for the (rest of) believers. We are aware of that which We enjoined upon them) what We have made lawful for and enjoined upon the believers (concerning their wives) concerning marrying up to four wives after giving them their dowry and making a proper marriage contract (and those whom their right hands possess) without limit (that thou mayst be free from blame) regarding marrying that which Allah has made lawful for you to marry, (for Allah is Forgiving) of that which has ensued from you, (Merciful) regarding that which He made a dispensation for you.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "33:50",
            "33:59",
            "66:1",
            "64:14",
            "4:23",
            "33:37",
            "8:70",
            "60:12",
            "39:53",
            "4:29"
        ],
        "BIBLE": [
            "torah:leviticus:17:11",
            "writings:daniel:2:23",
            "prophets:joshua:1:15",
            "prophets:nahum:1:14",
            "torah:genesis:3:6",
            "writings:esther:4:8",
            "prophets:i%20samuel:1:4",
            "prophets:ezekiel:20:31",
            "writings:daniel:6:13",
            "writings:ii%20chronicles:14:6"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:5:1"
        ]
    }
}