{
    "VERSE": "33:54",
    "ARABIC": "إِن تُبْدُوا۟ شَيْـًٔا أَوْ تُخْفُوهُ فَإِنَّ ٱللَّهَ كَانَ بِكُلِّ شَىْءٍ عَلِيمًا",
    "ENGLISH": {
        "TRANSLATION_0": "Whether you divulge a thing or conceal it, Allah has knowledge of all things.",
        "TRANSLATION_1": "Whether you discuss a thing or conceal it, surely God has knowledge of everything.\n",
        "TRANSLATION_2": "(It does not matter) whether you disclose something or conceal it, for Allah certainly knows everything.\n",
        "TRANSLATION_3": "Whether you reveal something or hid it, God has the knowledge of all things.\n",
        "TRANSLATION_4": "Whether you disclose a thing or keep it hidden – then indeed Allah knows all things.\n",
        "TRANSLATION_5": "Whether you reveal anything or conceal it, verily, Allah is Ever All-Knower of everything.\n",
        "TRANSLATION_6": "If you do a thing openly or do it in secret, then surely Allah is Cognizant of all things.\n",
        "TRANSLATION_7": "Whether you reveal anything, or whether you conceal it, surely God has knowledge of everything.\n",
        "TRANSLATION_8": "Whether ye divulge a thing or keep it hidden, lo! Allah is ever Knower of all things.\n",
        "TRANSLATION_9": "Whether you reveal anything or hide it, God is aware of everything.\n",
        "TRANSLATION_10": "Whether ye disclose a thing or conceal it, verily Allah is of everything ever Knower.\n",
        "TRANSLATION_11": "Whether you disclose anything or hide it, Allah indeed knows all things.\n",
        "TRANSLATION_12": "Whether ye reveal anything or conceal it, verily Allah has full knowledge of all things.\n",
        "TRANSLATION_13": "Whether you reveal anything or conceal it, verily, Allah is Ever AllKnower of everything.\n",
        "TRANSLATION_14": "Whether you reveal a thing or conceal it, Allah has knowledge of all things.\n",
        "TRANSLATION_15": "Whether you declare a thing, or hide it, God is Aware of all things.\n",
        "TRANSLATION_16": "Whether you reveal a thing or conceal it, indeed Allah is ever, of all things, Knowing.\n",
        "TRANSLATION_17": "[33:54] Whether you disclose anything or keep it hidden, regarding marrying them after him, truly God has knowledge of all things, and will requite you for it.\n",
        "TRANSLATION_18": "(Whether ye divulge a thing) of this intent (or keep it hidden, lo! Allah is ever Knower) He takes you to task (of all things) regarding all things, whether they are made public or kept hidden.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "33:54",
            "20:98",
            "29:62",
            "64:11",
            "3:63",
            "24:64",
            "9:115",
            "22:68",
            "3:92",
            "10:79"
        ],
        "BIBLE": [
            "prophets:isaiah:41:23",
            "prophets:isaiah:48:6",
            "writings:job:42:3",
            "writings:job:13:20",
            "prophets:isaiah:41:22",
            "writings:proverbs:30:18",
            "prophets:i%20samuel:3:17",
            "writings:daniel:2:11",
            "writings:ecclesiastes:3:14",
            "prophets:ii%20samuel:14:20"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:2",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:1:3"
        ]
    }
}