{
    "VERSE": "33:56",
    "ARABIC": "إِنَّ ٱللَّهَ وَمَلَٰٓئِكَتَهُۥ يُصَلُّونَ عَلَى ٱلنَّبِىِّ يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ صَلُّوا۟ عَلَيْهِ وَسَلِّمُوا۟ تَسْلِيمًا",
    "ENGLISH": {
        "TRANSLATION_0": "Allah and His angels call down blessings on the Prophet. You who have iman! call down blessings on him and ask for complete peace and safety for him.",
        "TRANSLATION_1": "God and His angels shower their blessings on the Prophet. O believers, you should also send your blessings on him, and salute him with a worthy greeting.\n",
        "TRANSLATION_2": "Allah and His angels bless the Prophet. Believers, invoke blessings and peace on him.\n",
        "TRANSLATION_3": "God showers His blessings upon the Prophet and the angels seek forgiveness for him. Believers, pray for the Prophet and greet him with, \"Peace be with you.\"\n",
        "TRANSLATION_4": "Indeed Allah and His angels send blessings on the Prophet; O People who Believe! Send blessings and abundant salutations upon him. (Everlasting peace and unlimited blessings be upon the Holy Prophet Mohammed.)\n",
        "TRANSLATION_5": "Allah sends His Salah on the Prophet, and also His angels (do so). O you who believe! Send your Salah on him, and greet him with Taslim.\n",
        "TRANSLATION_6": "Surely Allah and His angels bless the Prophet; O you who believe! call for (Divine) blessings on him and salute him with a (becoming) salutation.\n",
        "TRANSLATION_7": "God and His angels bless the Prophet. O believers, do you also bless him, and pray him peace.\n",
        "TRANSLATION_8": "Lo! Allah and His angels shower blessings on the Prophet. O ye who believe! Ask blessings on him and salute him with a worthy salutation.\n",
        "TRANSLATION_9": "God and His angels bestow blessings on the Prophet. O believers, you also should invoke blessings on him and give him greetings of peace.\n",
        "TRANSLATION_10": "Verily Allah and His angels send their benedictions upon the prophet. O ye who believe! send your benedictions upon him and salute him with a goodly Salutation.\n",
        "TRANSLATION_11": "Indeed Allah and His angels bless the Prophet; O you who have faith! Invoke blessings on him and invoke Peace upon him in a worthy manner.\n",
        "TRANSLATION_12": "Allah and His angels send blessings on the Prophet: O ye that believe! Send ye blessings on him, and salute him with all respect.\n",
        "TRANSLATION_13": "Allah sends His Salat (Graces, Honours, Blessings, Mercy, etc.) on the Prophet (Muhammad SAW) and also His angels too (ask Allah to bless and forgive him). O you who believe! Send your Salat on (ask Allah to bless) him (Muhammad SAW), and (you should) greet (salute) him with the Islamic way of greeting (salutation i.e. AsSalamu 'Alaikum).\n",
        "TRANSLATION_14": "Allah and His angels praise and venerate the Prophet. Believers, praise and venerate him and pronounce peace upon him in abundance.\n",
        "TRANSLATION_15": "God and His angels give blessings to the Prophet. O you who believe, call for blessings on him, and greet him with a prayer of peace.\n",
        "TRANSLATION_16": "Indeed, Allah confers blessing upon the Prophet, and His angels [ask Him to do so]. O you who have believed, ask [Allah to confer] blessing upon him and ask [Allah to grant him] peace.\n",
        "TRANSLATION_17": "[33:56] Indeed God and His angels bless the Prophet, Muhammad (s). O you who believe, invoke blessings on him and invoke peace upon him in a worthy manner, in other words, say: ‘O God, bless our master Muhammad and grant him peace’ (Allāhumma sallī ‘alā sayyidinā Muhammad wa-sallim).\n",
        "TRANSLATION_18": "(Lo! Allah and His angels shower blessings on the Prophet. ye who believe! Ask blessings on him) pray for him (and salute him with a worthy salutation) and resign yourselves to his command.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "33:56",
            "9:119",
            "3:200",
            "41:30",
            "8:64",
            "3:42",
            "33:1",
            "5:35",
            "5:20",
            "2:278"
        ],
        "BIBLE": [
            "writings:psalms:69:14",
            "torah:exodus:33:13",
            "writings:ii%20chronicles:6:19",
            "prophets:jeremiah:36:7",
            "writings:i%20chronicles:16:36",
            "prophets:isaiah:58:2",
            "prophets:jonah:4:2",
            "prophets:i%20kings:8:28",
            "writings:psalms:106:48",
            "writings:ii%20chronicles:6:27"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:1:12",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:5"
        ]
    }
}