{
    "VERSE": "33:60",
    "ARABIC": "لَّئِن لَّمْ يَنتَهِ ٱلْمُنَٰفِقُونَ وَٱلَّذِينَ فِى قُلُوبِهِم مَّرَضٌ وَٱلْمُرْجِفُونَ فِى ٱلْمَدِينَةِ لَنُغْرِيَنَّكَ بِهِمْ ثُمَّ لَا يُجَاوِرُونَكَ فِيهَآ إِلَّا قَلِيلًا",
    "ENGLISH": {
        "TRANSLATION_0": "If the hypocrites and those with sickness in their hearts and the rumour-mongers in Madina do not desist, We will set you onto them. Then they will only be your neighbours there a very short time.",
        "TRANSLATION_1": "If the hypocrites and perverts, and the rumour-mongers of Madinah, do not desist even now, We shall rouse you against them, so they would not be able to live but a short time in the city with you.\n",
        "TRANSLATION_2": "If the hypocrites and those in whose hearts there is a sickness, and the scandal mongers in Madinah do not desist from their vile acts, We shall urge you to take action against them, and then they will hardly be able to stay in the city with you.\n",
        "TRANSLATION_3": "If the hypocrites, those whose hearts are sick and those who encourage the spread of evil in the city, will not desist, We shall arouse you against them and they will only be allowed to be your neighbors for a short while.\n",
        "TRANSLATION_4": "If the hypocrites, and those in whose hearts is a disease, and the rumour mongers in Medinah do not desist, We shall then surely impel you against them, so then they will not remain your neighbours in Medinah except for a few days.\n",
        "TRANSLATION_5": "If the hypocrites and those in whose hearts is a disease, and those who spread false news among the people in Al-Madinah stop not, We shall certainly let you overpower them, then they will not be able to stay in it as your neighbors but a little while.\n",
        "TRANSLATION_6": "If the hypocrites and those in whose hearts is a disease and the agitators in the city do not desist, We shall most certainly set you over them, then they shall not be your neighbors in it but for a little while;\n",
        "TRANSLATION_7": "Now; if the hypocrites do not give over, and those in whose hearts there is sickness and they that make commotion in the city, We shall assuredly urge thee against them and then they will be thy neighbours there only a little;\n",
        "TRANSLATION_8": "If the hypocrites, and those in whose hearts is a disease, and the alarmists in the city do not cease, We verily shall urge thee on against them, then they will be your neighbours in it but a little while.\n",
        "TRANSLATION_9": "If the hypocrites and those who have tainted hearts and the scandal mongers of Madinah do not desist, We shall surely give you authority over them and their days in that city will be numbered.\n",
        "TRANSLATION_10": "If the hypocrites and those in whose hearts is a disease and the raisers of commotion in Madina desist not, We shall surely set thee up against them; thenceforth they shall not be suffered to neighbour thee therein except for a little while.\n",
        "TRANSLATION_11": "If the hypocrites and those in whose hearts is a sickness, and the rumourmongers in the city do not desist, We will prompt you [to take action] against them; then they will not be your neighbours in it except briefly.\n",
        "TRANSLATION_12": "Truly, if the Hypocrites, and those in whose hearts is a disease, and those who stir up sedition in the City, desist not, We shall certainly stir thee up against them: Then will they not be able to stay in it as thy neighbours for any length of time:\n",
        "TRANSLATION_13": "If the hypocrites, and those in whose hearts is a disease (evil desire for adultery, etc.), and those who spread false news among the people in AlMadinah, cease not, We shall certainly let you overpower them, then they will not be able to stay in it as your neighbours but a little while.\n",
        "TRANSLATION_14": "If the hypocrites and those who have a disease in their hearts, and those who make a commotion in the City do not desist, We will surely urge you against them. Then they will be your neighbors for only a little (while),\n",
        "TRANSLATION_15": "If the hypocrites, and those with sickness in their hearts, and the rumormongers in the City, do not desist, We will incite you against them; then they will not be your neighbors there except for a short while.\n",
        "TRANSLATION_16": "If the hypocrites and those in whose hearts is disease and those who spread rumors in al-Madinah do not cease, We will surely incite you against them; then they will not remain your neighbors therein except for a little.\n",
        "TRANSLATION_17": "[33:60] If (la-in, the lām is for oaths) the hypocrites do not desist, from their hypocrisy, and likewise those in whose hearts is a sickness, [in their urge] to fornicate, as well as the scaremongers in the city, who alarm the believers by saying [to them things like], ‘Your enemy is here and your raiding parties have been massacred!’, or [they say to them], ‘They have been defeated!’. Assuredly We will urge you [to take action] against them, We will give you sway over them, then they will not be your neighbours, they will not dwell near you, in it except for a little [while], after which they will depart.\n",
        "TRANSLATION_18": "(If the hypocrites) 'Abdullah Ibn Ubayy and his host in their scheming and treachery, (and those in whose hearts is a disease) the desire to fornicate, (and the alarmists) those who follow the faults of the believers; these are the people won over to Islam through gifts and money (al-mu'allafah) (in the city) in Medina (do not cease, We verify shall urge thee on against them) We shall set you against them, (then they will be your neighbours in it) they will not live in the same city of Medina (but a little while) except for a short period.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "33:60",
            "17:76",
            "33:32",
            "33:12",
            "22:53",
            "47:29",
            "9:125",
            "29:9",
            "59:12",
            "13:28"
        ],
        "BIBLE": [
            "prophets:ezekiel:26:20",
            "prophets:jeremiah:31:33",
            "prophets:ii%20kings:18:23",
            "prophets:isaiah:36:8",
            "prophets:ii%20kings:4:10",
            "prophets:i%20samuel:25:28",
            "prophets:ii%20samuel:11:25",
            "prophets:hosea:11:8",
            "writings:daniel:10:14",
            "prophets:joshua:1:8"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:4:1"
        ]
    }
}