{
    "VERSE": "33:64",
    "ARABIC": "إِنَّ ٱللَّهَ لَعَنَ ٱلْكَٰفِرِينَ وَأَعَدَّ لَهُمْ سَعِيرًا",
    "ENGLISH": {
        "TRANSLATION_0": "Allah has cursed the kafirun and prepared a Searing Blaze for them",
        "TRANSLATION_1": "Verily God has cursed the infidels, and prepared a blazing fire for them.\n",
        "TRANSLATION_2": "Allah has cursed the unbelievers and has prepared for them a Blazing Fire;\n",
        "TRANSLATION_3": "God has condemned the unbelievers and prepared for them a burning torment\n",
        "TRANSLATION_4": "Allah has indeed cursed the disbelievers, and has kept prepared for them a blazing fire.\n",
        "TRANSLATION_5": "Verily, Allah has cursed the disbelievers, and has prepared for them a flaming Fire.\n",
        "TRANSLATION_6": "Surely Allah has cursed the unbelievers and has prepared for them a burning fire,\n",
        "TRANSLATION_7": "God has cursed the unbelievers, and prepared for them a Blaze,\n",
        "TRANSLATION_8": "Lo! Allah hath cursed the disbelievers, and hath prepared for them a flaming fire,\n",
        "TRANSLATION_9": "God has rejected those who deny the truth and prepared for them a blazing Fire.\n",
        "TRANSLATION_10": "Verily Allah hath cursed the infidels, and hath gotten ready for them a Blaze.\n",
        "TRANSLATION_11": "Indeed Allah has cursed the faithless and prepared for them a blaze,\n",
        "TRANSLATION_12": "Verily Allah has cursed the Unbelievers and prepared for them a Blazing Fire,-\n",
        "TRANSLATION_13": "Verily, Allah has cursed the disbelievers, and has prepared for them a flaming Fire (Hell).\n",
        "TRANSLATION_14": "Allah has cursed the unbelievers and prepared for them a Blaze.\n",
        "TRANSLATION_15": "God has cursed the disbelievers, and has prepared for them a Blaze.\n",
        "TRANSLATION_16": "Indeed, Allah has cursed the disbelievers and prepared for them a Blaze.\n",
        "TRANSLATION_17": "[33:64] God has indeed cursed the disbelievers, He has banished them [from His mercy], and prepared for them a blaze, a violent fire into which they shall be admitted,\n",
        "TRANSLATION_18": "(Lo! Allah hath cursed) chastises (the disbelievers) the disbelievers of Mecca on the Day of Badr, (and hath prepared for them a flaming fire,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "33:64",
            "48:13",
            "3:132",
            "37:152",
            "41:33",
            "71:19",
            "76:4",
            "16:74",
            "28:56",
            "87:7"
        ],
        "BIBLE": [
            "torah:leviticus:6:6",
            "writings:proverbs:20:21",
            "writings:job:20:18",
            "torah:leviticus:5:23",
            "prophets:ezekiel:18:9",
            "prophets:ezekiel:28:4",
            "prophets:amos:2:4",
            "torah:numbers:14:40",
            "prophets:i%20samuel:21:6",
            "writings:job:31:25"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:12",
            "Sefer%20Yetzirah:1:14",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:1:5"
        ]
    }
}