{
    "VERSE": "33:68",
    "ARABIC": "رَبَّنَآ ءَاتِهِمْ ضِعْفَيْنِ مِنَ ٱلْعَذَابِ وَٱلْعَنْهُمْ لَعْنًا كَبِيرًا",
    "ENGLISH": {
        "TRANSLATION_0": "Our Lord, give them double the punishment and curse them many times over!'",
        "TRANSLATION_1": "O Lord, give them a double punishment, and put a grievous curse upon them.\"\n",
        "TRANSLATION_2": "Our Lord, mete out to them a double chastisement and lay upon them a mighty curse.”\n",
        "TRANSLATION_3": "Lord, make them to suffer double torment and subject them to the greatest condemnation.\"\n",
        "TRANSLATION_4": "“Our Lord! Give them double the punishment of the fire and send upon them a mighty curse!”\n",
        "TRANSLATION_5": "Our Lord! Give them double torment and curse them with a mighty curse!\"\n",
        "TRANSLATION_6": "O our Lord! give them a double punishment and curse them with a great curse.\n",
        "TRANSLATION_7": "Our Lord, give them chastisement twofold, and curse them with a mighty curse!'\n",
        "TRANSLATION_8": "Our Lord! Oh, give them double torment and curse them with a mighty curse.\n",
        "TRANSLATION_9": "Our Lord, give them double punishment and curse them with a mighty curse.\"\n",
        "TRANSLATION_10": "Our Lord! give them double torment and curse them with a great curse.\n",
        "TRANSLATION_11": "Our Lord! Give them a double punishment and curse them with a mighty curse.’\n",
        "TRANSLATION_12": "Our Lord! Give them double Penalty and curse them with a very great Curse!\"\n",
        "TRANSLATION_13": "Our Lord! give them double torment and curse them with a mighty curse!\"\n",
        "TRANSLATION_14": "Our Lord, let their punishment be doubled; and curse them with a mighty curse'\n",
        "TRANSLATION_15": "Lord, give them double the punishment, and curse them with a great curse.”\n",
        "TRANSLATION_16": "Our Lord, give them double the punishment and curse them with a great curse.\"\n",
        "TRANSLATION_17": "[33:68] Our Lord, give them a double chastisement, in other words, twice the like of our chastisement, and curse them, chastise them, with numerous curses!’, with the equivalent number [of chastisements] (la‘nan kathīran, ‘numerous curses’, is also read la‘nan kabīran, [which means] ‘with a mighty curse’).\n",
        "TRANSLATION_18": "(Our Lord!) they say: our Lord! (Oh, give them) the leaders and chieftains (double torment) double of what You give us of torment (and curse them with a mighty curse) and chastise them with a great chastisement.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "33:68",
            "38:61",
            "70:27",
            "44:12",
            "23:76",
            "42:22",
            "52:18",
            "32:21",
            "39:54",
            "3:16"
        ],
        "BIBLE": [
            "prophets:ii%20samuel:22:36",
            "torah:leviticus:10:17",
            "torah:leviticus:17:11",
            "torah:numbers:8:19",
            "prophets:hosea:2:14",
            "writings:psalms:40:14",
            "prophets:jeremiah:18:19",
            "prophets:nahum:1:14",
            "writings:psalms:70:2",
            "writings:ii%20chronicles:14:6"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:1:10",
            "Sefer%20Yetzirah:4:3",
            
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:13",
            "Sefer%20Yetzirah:2:2",
            "Sefer%20Yetzirah:6:4"
        ]
    }
}