{
    "VERSE": "33:7",
    "ARABIC": "وَإِذْ أَخَذْنَا مِنَ ٱلنَّبِيِّۦنَ مِيثَٰقَهُمْ وَمِنكَ وَمِن نُّوحٍ وَإِبْرَٰهِيمَ وَمُوسَىٰ وَعِيسَى ٱبْنِ مَرْيَمَ وَأَخَذْنَا مِنْهُم مِّيثَٰقًا غَلِيظًا",
    "ENGLISH": {
        "TRANSLATION_0": "When We made a covenant with all the Prophets - with you and with Nuh and Ibrahim and Musa and 'Isa son of Maryam - We made a binding covenant with them,",
        "TRANSLATION_1": "When We made the covenant with the prophets, and with you, as with Noah and Abraham, Moses and Jesus son of Mary, a binding covenant,\n",
        "TRANSLATION_2": "And call to mind, (O Prophet), when We took the covenant from all Prophets; and also from you and Noah and Abraham, Moses, and Jesus the son of Mary. We took from them a solemn covenant\n",
        "TRANSLATION_3": "We had a solemn covenant with you (Muhammad), and the Prophets: Noah, Abraham, Moses, and Jesus, the son of Mary.\n",
        "TRANSLATION_4": "And remember O dear Prophet (Mohammed – peace and blessings be upon him) when We took a covenant from the Prophets – and from you – and from Nooh, and Ibrahim, and Moosa, and Eisa the son of Maryam; and We took a firm covenant from them.\n",
        "TRANSLATION_5": "And when We took from the Prophets their covenant, and from you, and from Nuh, Ibrahim, Musa, and `Isa son of Maryam. We took from them a strong covenant.\n",
        "TRANSLATION_6": "And when We made a covenant with the prophets and with you, and with Nuh and Ibrahim and Musa and Isa, son of Marium, and We made with them a strong covenant\n",
        "TRANSLATION_7": "And when We took compact from the Prophets, and from thee, and from Noah, and Abraham, Moses, and Jesus, Mary's son; We took from them a solemn compact,\n",
        "TRANSLATION_8": "And when We exacted a covenant from the prophets, and from thee (O Muhammad) and from Noah and Abraham and Moses and Jesus son of Mary. We took from them a solemn covenant;\n",
        "TRANSLATION_9": "We took a solemn pledge from the prophets, from you and Noah, Abraham, Moses and Jesus, the son of Mary -- We took a solemn pledge from all of them.\n",
        "TRANSLATION_10": "And recall what time We took a bond from the prophets and from thee and from Nuh and Ibrahim and Musa and 'Isa son of Maryam. And We took from them a solemn bond;\n",
        "TRANSLATION_11": "[Recall] when We took a pledge from the prophets, and from you and from Noah and Abraham and Moses and Jesus son of Mary, and We took from them a solemn pledge,\n",
        "TRANSLATION_12": "And remember We took from the prophets their covenant: As (We did) from thee: from Noah, Abraham, Moses, and Jesus the son of Mary: We took from them a solemn covenant:\n",
        "TRANSLATION_13": "And (remember) when We took from the Prophets their covenant, and from you (O Muhammad SAW), and from Nuh (Noah), Ibrahim (Abraham), Musa (Moses), and 'Iesa (Jesus), son of Maryam (Mary). We took from them a strong covenant.\n",
        "TRANSLATION_14": "We took from the Prophets their covenant and from you (Prophet Muhammad), from Noah and Abraham, from Moses and Jesus the son of Mary. We took a solemn covenant from them,\n",
        "TRANSLATION_15": "Recall that We received a pledge from the prophets, and from you, and from Noah, and Abraham, and Moses, and Jesus son of Mary. We received from them a solemn pledge.\n",
        "TRANSLATION_16": "And [mention, O Muhammad], when We took from the prophets their covenant and from you and from Noah and Abraham and Moses and Jesus, the son of Mary; and We took from them a solemn covenant.\n",
        "TRANSLATION_17": "[33:7] And, mention, when We took a pledge from the prophets, at the point when they were brought forth from the loins of Adam, the size of atoms, and from you, and from Noah and Abraham and Moses and Jesus son of Mary, that they worship [only] God and call others to worship Him (the mention of the five [names] is an instance of supplementing the specific to the general). And We took from them a solemn pledge, a solid [one], that they fulfil what they have been charged with, and this was [effected] by [swearing] an oath to God, after which the pledge was consummated;\n",
        "TRANSLATION_18": "(And when We exacted a covenant from the Prophets) to honour their pledges and that they should convey the message to one another, (and from thee (0 Muhammad)) and We exacted from you that you should convey to your people the events of the messengers and Scriptures before you and that you should command them to believe in it (and from Noah) and We exacted from Noah [the same] (and Abraham) and exacted from Abraham [the same] (and Moses) and exacted from Moses [the same] (and Jesus son of Mary) and exacted from Jesus of Mary [the same]. (We took from them a solemn covenant) that they should convey the message, the first to the last and that the last should believe in the first, and also command their respective people to believe in it;\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "33:7",
            "37:112",
            "43:57",
            "4:154",
            "4:21",
            "43:6",
            "3:44",
            "26:69",
            "28:3",
            "5:27"
        ],
        "BIBLE": [
            "torah:exodus:24:8",
            "prophets:ii%20samuel:22:6",
            "prophets:joshua:11:19",
            "prophets:ii%20kings:23:19",
            "prophets:joshua:7:11",
            "writings:daniel:7:12",
            "prophets:ezekiel:17:13",
            "torah:numbers:20:9",
            "torah:exodus:24:7",
            "prophets:jeremiah:16:5"
        ]
    }
}