{
    "VERSE": "33:70",
    "ARABIC": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ ٱتَّقُوا۟ ٱللَّهَ وَقُولُوا۟ قَوْلًا سَدِيدًا",
    "ENGLISH": {
        "TRANSLATION_0": "You who have iman! have taqwa of Allah and speak words which hit the mark.",
        "TRANSLATION_1": "O you who believe, obey the commands of God, and say straightforward things\n",
        "TRANSLATION_2": "Believers, fear Allah and speak the truth:\n",
        "TRANSLATION_3": "Believers, have fear of God and speak righteous words.\n",
        "TRANSLATION_4": "O People who Believe! Fear Allah, and speak rightly.\n",
        "TRANSLATION_5": "O you who believe! Have Taqwa of Allah and speak (always) the truth.\n",
        "TRANSLATION_6": "O you who believe! be careful of (your duty to) Allah and speak the right word,\n",
        "TRANSLATION_7": "O believers, fear God, and speak words hitting the mark,\n",
        "TRANSLATION_8": "O ye who believe! Guard your duty to Allah, and speak words straight to the point;\n",
        "TRANSLATION_9": "Believers, fear God, and say the right word.\n",
        "TRANSLATION_10": "O Ye who believe! fear Allah, and speak a straight speech.\n",
        "TRANSLATION_11": "O you who have faith! Be wary of Allah, and speak upright words.\n",
        "TRANSLATION_12": "O ye who believe! Fear Allah, and (always) say a word directed to the Right:\n",
        "TRANSLATION_13": "O you who believe! Keep your duty to Allah and fear Him, and speak (always) the truth.\n",
        "TRANSLATION_14": "O you who believe, fear Allah and say sound statements,\n",
        "TRANSLATION_15": "O you who believe! Be conscious of God, and speak in a straightforward manner.\n",
        "TRANSLATION_16": "O you who have believed, fear Allah and speak words of appropriate justice.\n",
        "TRANSLATION_17": "[33:70] O you who believe, fear God and speak words of integrity, what is proper.\n",
        "TRANSLATION_18": "(0 ye who believe! Guard your duty to Allah) obey Allah in that which He commands you, (and speak words straight to the point) and speak fair words: \"there is no deity except Allah\";\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "33:70",
            "3:200",
            "9:119",
            "47:7",
            "33:41",
            "8:20",
            "18:4",
            "16:19",
            "3:141",
            "16:128"
        ],
        "BIBLE": [
            "prophets:i%20samuel:15:24",
            "prophets:malachi:2:17",
            "writings:job:42:7",
            "torah:numbers:22:38",
            "writings:daniel:10:11",
            "torah:exodus:20:1",
            "torah:genesis:44:7",
            "prophets:i%20kings:13:21",
            "torah:numbers:36:5",
            "torah:exodus:19:9"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:13",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:4:2"
        ]
    }
}