{
    "VERSE": "33:71",
    "ARABIC": "يُصْلِحْ لَكُمْ أَعْمَٰلَكُمْ وَيَغْفِرْ لَكُمْ ذُنُوبَكُمْ وَمَن يُطِعِ ٱللَّهَ وَرَسُولَهُۥ فَقَدْ فَازَ فَوْزًا عَظِيمًا",
    "ENGLISH": {
        "TRANSLATION_0": "He will put your actions right for you and forgive you your wrong deeds. All who obey Allah and His",
        "TRANSLATION_1": "That He may straighten your affairs for you and forgive your sins; and he who obeys God and His Prophet will be successful.\n",
        "TRANSLATION_2": "Allah will set your deeds right for you and will forgive you your sins. Whoever obeys Allah and His Messenger has achieved a great triumph.\n",
        "TRANSLATION_3": "God will reform your deeds and forgive your sins. One who obeys God and His Messenger will certainly achieve a great success.\n",
        "TRANSLATION_4": "He will rectify your deeds for you and forgive you your sins; and whoever obeys Allah and His Noble Messenger, has indeed achieved a great success.\n",
        "TRANSLATION_5": "He will direct you to do righteous good deeds and will forgive you your sins. And whosoever obeys Allah and His Messenger, he has indeed achieved a great victory.\n",
        "TRANSLATION_6": "He will put your deeds into a right state for you, and forgive you your faults; and whoever obeys Allah and His Apostle, he indeed achieves a mighty success.\n",
        "TRANSLATION_7": "and He will set right your deeds for you and will forgive you your sins. Whosoever obeys God and His Messenger has won a mighty triumph.\n",
        "TRANSLATION_8": "He will adjust your works for you and will forgive you your sins. Whosoever obeyeth Allah and His messenger, he verily hath gained a signal victory.\n",
        "TRANSLATION_9": "He will bless your works for you and forgive you your sins. Whoever obeys God and His Messenger has indeed achieved a great success.\n",
        "TRANSLATION_10": "He WiLL rectify for you your works, and forgive you your sins. And Whosoever obeyeth Allah and His apostle, he hath indeed achieved a mighty achievement.\n",
        "TRANSLATION_11": "He will rectify your conduct for you and forgive you your sins. Whoever obeys Allah and His Apostle will certainly achieve a great success.\n",
        "TRANSLATION_12": "That He may make your conduct whole and sound and forgive you your sins: He that obeys Allah and His Messenger, has already attained the highest achievement.\n",
        "TRANSLATION_13": "He will direct you to do righteous good deeds and will forgive you your sins. And whosoever obeys Allah and His Messenger (SAW) he has indeed achieved a great achievement (i.e. he will be saved from the Hell-fire and made to enter Paradise).\n",
        "TRANSLATION_14": "and He will mend your deeds for you and forgive your sins. Whosoever obeys Allah and His Messenger shall win a great victory.\n",
        "TRANSLATION_15": "He will rectify your conduct for you, and will forgive you your sins. Whoever obeys God and His Messenger has won a great victory.\n",
        "TRANSLATION_16": "He will [then] amend for you your deeds and forgive you your sins. And whoever obeys Allah and His Messenger has certainly attained a great attainment.\n",
        "TRANSLATION_17": "[33:71]   He will rectify your deeds for you, He will accept them, and will forgive you your sins. And whoever obeys God and His Messenger has verily achieved a great success, he has attained his ultimate goal.\n",
        "TRANSLATION_18": "(He will adjust your works) He will accept your works which are carried out because of belief in Allah's divine Oneness (for you and will forgive you your sins) due to your profession of Allah's divine Oneness. (Whosoever obeyeth Allah) in that which He commands him (and His messenger) in that which he commands him, (he verily hath gained a signal victory) he gained Paradise and is clearly safe from the Fire.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "33:71",
            "9:63",
            "4:13",
            "24:52",
            "47:33",
            "9:105",
            "33:29",
            "4:14",
            "48:13",
            "2:139"
        ],
        "BIBLE": [
            "torah:genesis:48:20",
            "prophets:ezekiel:32:8",
            "writings:ecclesiastes:7:13",
            "writings:daniel:9:24",
            "writings:daniel:11:17",
            "writings:psalms:71:16",
            "prophets:joshua:1:8",
            "torah:leviticus:5:10",
            "writings:psalms:106:8",
            "torah:leviticus:19:22"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:1:5",
            
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:1:1"
        ]
    }
}