{
    "VERSE": "33:72",
    "ARABIC": "إِنَّا عَرَضْنَا ٱلْأَمَانَةَ عَلَى ٱلسَّمَٰوَٰتِ وَٱلْأَرْضِ وَٱلْجِبَالِ فَأَبَيْنَ أَن يَحْمِلْنَهَا وَأَشْفَقْنَ مِنْهَا وَحَمَلَهَا ٱلْإِنسَٰنُ إِنَّهُۥ كَانَ ظَلُومًا جَهُولًا",
    "ENGLISH": {
        "TRANSLATION_0": "We offered the Trust to the heavens, the earth and the mountains but they refused to take it on and shrank from it. But man took it on. He is indeed wrongdoing and ignorant.",
        "TRANSLATION_1": "We had offered the Trust (of divine responsibilities) to the heavens, the earth, the mountains, but they refrained from bearing the burden and were frightened of it; but man took it on himself. He is a faithless ignoramus.\n",
        "TRANSLATION_2": "We offered the trust to the heavens and the earth and the mountains, but they refused to carry it and were afraid of doing so; but man carried it. Surely he is wrong-doing, ignorant.\n",
        "TRANSLATION_3": "We offered Our Trust (Our deputation) to the heavens, to the earth, and to the mountains, but they could not bear this burden and were afraid to accept it. Mankind was able to accept this offer but he was unjust to himself and ignorant of the significance of this Trust.\n",
        "TRANSLATION_4": "We indeed offered the trust to the heavens and the earth and the mountains, but they refused it and were afraid of it – and man accepted it; indeed he is one who puts himself into hardship, is extremely unwise.\n",
        "TRANSLATION_5": "Truly, We did offer the Amanah to the heavens and the earth, and the mountains, but they declined to bear it and were afraid of it. But man bore it. Verily, he was unjust and ignorant.\n",
        "TRANSLATION_6": "Surely We offered the trust to the heavens and the earth and the mountains, but they refused to be unfaithful to it and feared from it, and man has turned unfaithful to it; surely he is unjust, ignorant;\n",
        "TRANSLATION_7": "We offered the trust to the heavens and the earth and the mountains, but they refused to carry it and were afraid of it; and man carried it. Surely he is sinful, very foolish.\n",
        "TRANSLATION_8": "Lo! We offered the trust unto the heavens and the earth and the hills, but they shrank from bearing it and were afraid of it. And man assumed it. Lo! he hath proved a tyrant and a fool.\n",
        "TRANSLATION_9": "We offered the Trust to the heavens and the earth and the mountains, but they refused to bear it, because they were afraid of it. But man bore it: he surely proved unjust and ignorant.\n",
        "TRANSLATION_10": "Verily We! We offered the trust unto the heavens and the earth and the mountains, but they refused to bear it and shrank therefor. And man bore it; verily he was very iniquitous and very ignorant-\n",
        "TRANSLATION_11": "Indeed We presented the Trust to the heavens and the earth and the mountains, but they refused to undertake it and were apprehensive of it; but man undertook it. Indeed he is most unjust and ignorant.\n",
        "TRANSLATION_12": "We did indeed offer the Trust to the Heavens and the Earth and the Mountains; but they refused to undertake it, being afraid thereof: but man undertook it;- He was indeed unjust and foolish;-\n",
        "TRANSLATION_13": "Truly, We did offer AlAmanah (the trust or moral responsibility or honesty and all the duties which Allah has ordained) to the heavens and the earth, and the mountains, but they declined to bear it and were afraid of it (i.e. afraid of Allah's Torment). But man bore it. Verily, he was unjust (to himself) and ignorant (of its results).\n",
        "TRANSLATION_14": "We offered the trust to the heavens, and the earth, and the mountains, but they refused to bear it, and were afraid of it, and the human carried it. Surely, he is a harmdoer, and ignorant.\n",
        "TRANSLATION_15": "We offered the Trust to the heavens, and the earth, and the mountains; but they refused to bear it, and were apprehensive of it; but the human being accepted it. He was unfair and ignorant.\n",
        "TRANSLATION_16": "Indeed, we offered the Trust to the heavens and the earth and the mountains, and they declined to bear it and feared it; but man [undertook to] bear it. Indeed, he was unjust and ignorant.\n",
        "TRANSLATION_17": "[33:72] Indeed We offered the Trust — [the obligation to] prayer and other matters which, when performed, result in reward and when neglected, result in punishment — to the heavens and the earth and the mountains, and created in them the power of comprehension and speech [at the time of that offer], but they refused to bear it and were apprehensive of it; but man, Adam, undertook it, when it was offered to him. Truly he is a wrongdoer, to his own soul because of what he undertook, ignorant, of [the responsibility that comes with] it —\n",
        "TRANSLATION_18": "(Lo! We offered the trust) obedience and worship (unto the heavens) unto the inhabitants of the heavens (and the earth and the hills) by way of choice and selection, (but they shrank from bearing it) through reward and punishment (and were afraid of it) and were afraid of bearing it. (And man assumed it) Adam assumed it, accepting both the possibility of reward and punishment. (Lo! he hath proved a tyrant) by assuming its bearing; it is also said that this means: he has proved a tyrant by eating from the tree (and a fool) and ignorant of its consequence.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "33:72",
            "19:90",
            "23:18",
            "44:29",
            "6:79",
            "3:5",
            "20:4",
            "21:56",
            "11:107",
            "51:48"
        ],
        "BIBLE": [
            "prophets:ii%20kings:23:16",
            "writings:ii%20chronicles:28:15",
            "prophets:ii%20kings:17:6",
            "prophets:jeremiah:52:9",
            "torah:genesis:50:25",
            "writings:ecclesiastes:3:14",
            "prophets:ii%20kings:25:6",
            "torah:leviticus:9:15",
            "torah:exodus:13:19",
            "prophets:ezekiel:3:21"
        ],
        "KABBALAH": [
            
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:2:5"
        ]
    }
}