{
    "VERSE": "33:73",
    "ARABIC": "لِّيُعَذِّبَ ٱللَّهُ ٱلْمُنَٰفِقِينَ وَٱلْمُنَٰفِقَٰتِ وَٱلْمُشْرِكِينَ وَٱلْمُشْرِكَٰتِ وَيَتُوبَ ٱللَّهُ عَلَى ٱلْمُؤْمِنِينَ وَٱلْمُؤْمِنَٰتِ وَكَانَ ٱللَّهُ غَفُورًا رَّحِيمًۢا",
    "ENGLISH": {
        "TRANSLATION_0": "This was so that Allah might punish the men and women of the hypocrites, and the men and women of the idolaters, and turn towards the men and women of the muminun. Allah is Ever-Forgiving, Most Merciful.",
        "TRANSLATION_1": "So that God punishes men and women hypocrites, the idolaters and idolatrous women, but He turns to faithful men and women in forgiveness, for God is forgiving and kind.\n",
        "TRANSLATION_2": "(The consequence of man's carrying the trust is) that Allah may chastise hypocritical men and hypocritical women and accept the repentance of believing men and believing women. He is Most Forgiving, Most Merciful.\n",
        "TRANSLATION_3": "(As a result of this) God will punish the hypocrites and the pagans, but He will accept the repentance of the believers. God is All-forgiving and All-merciful.\n",
        "TRANSLATION_4": "In order that Allah may punish the hypocrite men, and the hypocrite women, and the polytheist men, and the polytheist women – and accept the repentance of believing men and believing women; and Allah is Oft Forgiving, Most Merciful.\n",
        "TRANSLATION_5": "So that Allah will punish the hypocrites, men and women, and the men and women who are idolators. And Allah will pardon the believers, men and women. And Allah is Ever Oft-Forgiving, Most Merciful.\n",
        "TRANSLATION_6": "So Allah will chastise the hypocritical men and the hypocritical women and the polytheistic men and the polytheistic women, and Allah will turn (mercifully) to the believing women, and Allah is Forgiving, Merciful.\n",
        "TRANSLATION_7": "That God may chastise the hypocrites, men and women alike, and the idolaters, men and women alike; and that God may turn again unto the believers, men and women alike. God is All-forgiving, All-compassionate.\n",
        "TRANSLATION_8": "So Allah punisheth hypocritical men and hypocritical women, and idolatrous men and idolatrous women. But Allah pardoneth believing men and believing women, and Allah is ever Forgiving, Merciful.\n",
        "TRANSLATION_9": "God will punish the hypocrites, both men and women, and polytheists, both men and women, but God will turn in His mercy to believing men and believing women; God is most forgiving and most merciful.\n",
        "TRANSLATION_10": "So that Allah will torment the hypocritical men and the hypocritical women and the associators and the associatoresses and Allah will relent toward believing men and the believing women; and Allah is ever Forgiving, Merciful\n",
        "TRANSLATION_11": "Allah will surely punish the hypocrites, men and women, and the polytheists, men and women, and Allah will turn clemently to the faithful, men and women, and Allah is all-forgiving, all-merciful.\n",
        "TRANSLATION_12": "(With the result) that Allah has to punish the Hypocrites, men and women, and the Unbelievers, men and women, and Allah turns in Mercy to the Believers, men and women: for Allah is Oft-Forgiving, Most Merciful.\n",
        "TRANSLATION_13": "So that Allah will punish the hypocrites, men and women, and the men and women who are AlMushrikun (the polytheists, idolaters, pagans, disbelievers in the Oneness of Allah, and in His Messenger Muhammad SAW). And Allah will pardon (accept the repentance of) the true believers of the Islamic Monotheism, men and women. And Allah is Ever OftForgiving, Most Merciful.\n",
        "TRANSLATION_14": "Allah punishes the hypocrites, men and women alike, and the idolaters, both men and women alike; and Allah turns to the believers, men and women alike. Allah is the Forgiver, the Most Merciful.\n",
        "TRANSLATION_15": "God will punish the hypocrites, men and women, and the idolaters, men and women. And God will redeem the believers, men and women. God is Ever-Forgiving, Most Merciful.\n",
        "TRANSLATION_16": "[It was] so that Allah may punish the hypocrite men and hypocrite women and the men and women who associate others with Him and that Allah may accept repentance from the believing men and believing women. And ever is Allah Forgiving and Merciful.\n",
        "TRANSLATION_17": "[33:73] so that God may chastise (li-yu‘adhdhiba, the lām therein is semantically connected to ‘aradnā, ‘We offered’, which resulted in ‘Adam’s undertaking’) the hypocrites, men and women, and the idolaters, men and women, those who forsake the Trust, and that God may relent to the believing men and believing women, who fulfil the Trust. And God is Forgiving, to believers, Merciful, to them. Meccan, except for verse 6, which is Medinese; it consists of 54 or 55 verses, revealed after [sūrat] Luqmān.\n",
        "TRANSLATION_18": "And when Allah revealed His glad tidings to the believers that He will bestow His favour upon them, the hypocrites asked: \"and what do we get, Messenger of Allah?\" Allah said: (Allah punisheth hypocritical men and hypocritical women) it is also said that this means: Adam accepted the trust so that Allah punishes the hypocrites among men and women, (and idolatrous men and idolatrous women) because they rejected the trust, since they were in the loins of Adam when he accepted this trust. (But Allah pardoneth believing men and believing women) who are true in their faith in relation to any shortcomings regarding the bearing of this trust, (and Allah is Forgiving) He forgives whoever repents from amongst them, (Merciful) towards the believers'. And of the surah in which Sheba is mentioned, which is all Meccan and consists of 54 verses, 883 words and 1,512 letters: Surah 34: Sheba {Saba') 482 And of the surah in which Sheba is mentioned, which is all Meccan and consists of 54 verses, 883 words and 1,512 letters:\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "33:73",
            "33:24",
            "4:106",
            "9:27",
            "5:74",
            "4:96",
            "3:129",
            "48:14",
            "2:199",
            "5:98"
        ],
        "BIBLE": [
            "prophets:joel:2:13",
            "writings:psalms:40:5",
            "prophets:i%20kings:8:50",
            "prophets:jeremiah:29:14",
            "torah:deuteronomy:13:18",
            "prophets:i%20kings:8:46",
            "prophets:jeremiah:26:3",
            "prophets:isaiah:53:4",
            "writings:ii%20chronicles:6:36",
            "prophets:jeremiah:40:7"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:4:10"
        ]
    }
}