{
    "VERSE": "33:8",
    "ARABIC": "لِّيَسْـَٔلَ ٱلصَّٰدِقِينَ عَن صِدْقِهِمْ وَأَعَدَّ لِلْكَٰفِرِينَ عَذَابًا أَلِيمًا",
    "ENGLISH": {
        "TRANSLATION_0": "so that He would be able to question the sadiqun about their sincerity; and He has prepared a painful punishment for the kafirun.",
        "TRANSLATION_1": "(It was) so that God may ask the truthful of their sincerity. As for the infidels, He has prepared a painful punishment for them.\n",
        "TRANSLATION_2": "so that (their Lord) may question the truthful about their truthfulness. As for the unbelievers, He has kept a painful chastisement in store for them.\n",
        "TRANSLATION_3": "This was a firm agreement. God will ask the truthful ones about their truthfulness and prepare a painful torment for the disbelievers.\n",
        "TRANSLATION_4": "So that He may question the truthful regarding their truth; and He has kept prepared a painful punishment for the disbelievers.\n",
        "TRANSLATION_5": "That He may ask the truthful about their truth. And He has prepared for the disbelievers a painful torment.\n",
        "TRANSLATION_6": "That He may question the truthful of their truth, and He has prepared for the unbelievers a painful punishment.\n",
        "TRANSLATION_7": "that He might question the truthful concerning their truthfulness; and He has prepared for the unbelievers a painful chastisement.\n",
        "TRANSLATION_8": "That He may ask the loyal of their loyalty. And He hath prepared a painful doom for the unfaithful.\n",
        "TRANSLATION_9": "So that God might ask those men of truth as to [what response] their truthfulness [had received on earth]. But for those who deny the truth, He has prepared a woeful punishment.\n",
        "TRANSLATION_10": "That he may question the truthful of their truth. And for the Infidels He hath gotten ready a torment afflictive.\n",
        "TRANSLATION_11": "so that He may question the truthful concerning their truthfulness. And He has prepared for the faithless a painful punishment.\n",
        "TRANSLATION_12": "That (Allah) may question the (custodians) of Truth concerning the Truth they (were charged with): And He has prepared for the Unbelievers a grievous Penalty.\n",
        "TRANSLATION_13": "That He may ask the truthfuls (Allah's Messengers and His Prophets) about their truth (i.e. the conveyance of Allah's Message that which they were charged with). And He has prepared for the disbelievers a painful torment (Hell-fire).\n",
        "TRANSLATION_14": "so that Allah might question the truthful about their truthfulness. But for the unbelievers He has prepared a painful punishment.\n",
        "TRANSLATION_15": "That He may ask the sincere about their sincerity. He has prepared for the disbelievers a painful punishment.\n",
        "TRANSLATION_16": "That He may question the truthful about their truth. And He has prepared for the disbelievers a painful punishment.\n",
        "TRANSLATION_17": "[33:8] that He, God, may question the truthful about their truthfulness, in delivering the Message, as a way thereby to [justifiably] reproach the disbelievers; and He, exalted be He, has prepared for those who disbelieve, in them, a painful chastisement (‘adhāban alīman is a supplement to akhadhnā, ‘We took’).\n",
        "TRANSLATION_18": "(That He may ask the loyal of their loyalty) that He may ask the conveyors of the message about their conveyance, and the loyal about their loyalty and the believers about their faith. (And He hath prepared a painful doom) whose pain extends to their hearts (for the unfaithful) for the disbelievers in Scriptures and messengers.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "33:8",
            "4:138",
            "26:201",
            "9:79",
            "15:50",
            "51:37",
            "84:24",
            "2:104",
            "76:31",
            "17:10"
        ],
        "BIBLE": [
            "prophets:i%20kings:2:43",
            "prophets:i%20samuel:25:34",
            "prophets:jeremiah:7:28",
            "prophets:jeremiah:48:36",
            "writings:job:27:13",
            "writings:ecclesiastes:2:8",
            "prophets:i%20kings:13:21",
            "writings:i%20chronicles:22:13",
            "prophets:i%20kings:13:26",
            "prophets:ezekiel:11:15"
        ]
    }
}