{
    "VERSE": "33:9",
    "ARABIC": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ ٱذْكُرُوا۟ نِعْمَةَ ٱللَّهِ عَلَيْكُمْ إِذْ جَآءَتْكُمْ جُنُودٌ فَأَرْسَلْنَا عَلَيْهِمْ رِيحًا وَجُنُودًا لَّمْ تَرَوْهَا وَكَانَ ٱللَّهُ بِمَا تَعْمَلُونَ بَصِيرًا",
    "ENGLISH": {
        "TRANSLATION_0": "You who have iman! remember Allah's blessing to you when forces came against you and We sent a wind against them and other forces you could not see.* Allah sees what you do.",
        "TRANSLATION_1": "O you who believe, remember the favours of God to you when an army came against you and We sent a wind against them and forces that you did not see. But God sees all that you do.\n",
        "TRANSLATION_2": "Believers, call to mind Allah's favour to you when enemy hosts invaded you. Then We sent against them a wind and hosts that you did not see although Allah was observing all that you were then doing.\n",
        "TRANSLATION_3": "Believers, recall God's favor to you when the army attacked you. We sent a wind and the armies, which you did not see, to support you. God sees all that you do.\n",
        "TRANSLATION_4": "O People who believe! Remember the favour of Allah upon you when some armies came against you, so We sent against them a windstorm and the armies you could not see; and Allah sees your deeds.\n",
        "TRANSLATION_5": "O you who believe! Remember Allah's favor to you, when there came against you hosts, and We sent against them a wind and forces that you saw not. And Allah is Ever All-Seer of what you do.\n",
        "TRANSLATION_6": "O you who believe! call to mind the favor of Allah to you when there came down upon you hosts, so We sent against them a strong wind and hosts, that you saw not, and Allah is Seeing what you do.\n",
        "TRANSLATION_7": "O believers, remember God's blessing upon you when hosts came against you, and We loosed against them a wind, and hosts you saw not; and God sees the things you do.\n",
        "TRANSLATION_8": "O ye who believe! Remember Allah's favour unto you when there came against you hosts, and We sent against them a great wind and hosts ye could not see. And Allah is ever Seer of what ye do.\n",
        "TRANSLATION_9": "You who have attained to faith, remember God's blessings upon you when mighty armies massed against you. We sent a violent wind against them and hosts that you could not see. God sees all that you do.\n",
        "TRANSLATION_10": "O Ye who believe! remember Allah's favour unto you when there came unto you hosts, and We sent against them a wind and hosts which ye saw not, and Allah was of that which ye were working a Beholder.\n",
        "TRANSLATION_11": "O you who have faith! Remember Allah’s blessing upon you when the hosts came at you, and We sent against them a gale and hosts whom you did not see, and Allah sees best what you do.\n",
        "TRANSLATION_12": "O ye who believe! Remember the Grace of Allah, (bestowed) on you, when there came down on you hosts (to overwhelm you): But We sent against them a hurricane and forces that ye saw not: but Allah sees (clearly) all that ye do.\n",
        "TRANSLATION_13": "O you who believe! Remember Allah's Favour to you, when there came against you hosts, and We sent against them a wind and forces that you saw not [i.e. troops of angels during the battle of AlAhzab (the Confederates)]. And Allah is Ever AllSeer of what you do.\n",
        "TRANSLATION_14": "Believers, remember the Favor of Allah to you when there came against you hosts (armies). We unleashed against them a wind and hosts (angels) you could not see. Allah sees the things you do.\n",
        "TRANSLATION_15": "O you who believe! Remember God’s blessings upon you, when forces came against you, and We sent against them a wind, and forces you did not see. God is Observant of what you do.\n",
        "TRANSLATION_16": "O you who have believed, remember the favor of Allah upon you when armies came to [attack] you and We sent upon them a wind and armies [of angels] you did not see. And ever is Allah, of what you do, Seeing.\n",
        "TRANSLATION_17": "[33:9] O you who believe! Remember God’s favour to you when hosts, of disbelievers, came against you, as confederates, at the time the Ditch (al-khandaq) was being dug, and We unleashed against them a [great] wind and hosts, of angels, you did not see. And God is ever Seer of what you do (read ta‘malūna to imply ‘in the way of [your] digging of the ditch’; or read ya‘malūna, ‘[of what] they do’, to imply ‘the idolaters’ forming of a confederation’).\n",
        "TRANSLATION_18": "(0 ye who believe Remember Allah's favour unto you) preserve Allah's favour in that He repelled the enemy from you by sending the east wind and angels (when there came against you hosts) the host of disbelievers, (and We sent against them a great wind) the east wind (and hosts) and a row of angels (you could not see. And Allah is ever Seer of what ye do) whether it is the digging of the trench or other things. 473\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "33:9",
            "5:11",
            "3:163",
            "5:7",
            "5:20",
            "48:24",
            "64:2",
            "40:79",
            "2:278",
            "48:2"
        ],
        "BIBLE": [
            "prophets:jeremiah:41:13",
            "prophets:zechariah:5:9",
            "torah:numbers:18:32",
            "prophets:judges:3:24",
            "writings:ii%20chronicles:9:6",
            "writings:ii%20chronicles:31:8",
            "writings:i%20chronicles:29:17",
            "torah:genesis:34:7",
            "prophets:i%20kings:10:7",
            "torah:genesis:1:25"
        ]
    }
}