{
    "VERSE": "100:11",
    "ARABIC": "إِنَّ رَبَّهُم بِهِمْ يَوْمَئِذٍ لَّخَبِيرٌۢ",
    "ENGLISH": {
        "TRANSLATION_0": "that Day their Lord will certainly be aware of them.",
        "TRANSLATION_1": "Surely their Lord will be aware of their (deeds).\n",
        "TRANSLATION_2": "Surely on that Day will their Lord be fully informed about them.\n",
        "TRANSLATION_3": "their Lord will examine his deeds?\n",
        "TRANSLATION_4": "On that day their Lord surely knows all about them!\n",
        "TRANSLATION_5": "Verily, that Day their Lord will be Well-Acquainted with them.\n",
        "TRANSLATION_6": "Most surely their Lord that day shall be fully aware of them.\n",
        "TRANSLATION_7": "surely on that day their Lord shall be aware of them!\n",
        "TRANSLATION_8": "On that day will their Lord be perfectly informed concerning them.\n",
        "TRANSLATION_9": "Surely, on that Day, they will know that their Lord had full knowledge of them all.\n",
        "TRANSLATION_10": "Verily their Lord on that Day will be of them Aware.\n",
        "TRANSLATION_11": "on that day their Lord will be well informed about them [and their deeds]?\n",
        "TRANSLATION_12": "That their Lord had been Well-acquainted with them, (even to) that Day?\n",
        "TRANSLATION_13": "Verily, that Day (i.e. the Day of Resurrection) their Lord will be Well-Acquainted with them (as to their deeds), (and will reward them for their deeds).\n",
        "TRANSLATION_14": "indeed, on that Day their Lord will be aware of them!\n",
        "TRANSLATION_15": "Their Lord, on that Day, is fully informed of them.\n",
        "TRANSLATION_16": "Indeed, their Lord with them, that Day, is [fully] Acquainted.\n",
        "TRANSLATION_17": "[100:11] on that day their Lord will indeed be Aware of them, Knower [of them] and will requite them for their disbelief (the pronoun reverts to the plural because of the [collective] import of the term ‘man’; this sentence indicates the direct object of [the verb] ya‘lamu, ‘[does he not] know’, that is to say, ‘We will requite him at the time mentioned’; khabīrun, ‘Aware’, is semantically connected to yawma’idhin, ‘on that day’, even though [in fact] God is ever Aware, because that is the Day of Requital.\n",
        "TRANSLATION_18": "On that day) the Day of Judgement (will their Lord be perfectly informed concerning them) their Lord is perfectly Aware'. And of the surah in which the Calamity is mentioned, which is all Meccan and consists of 8 verses, 36 words and 152 letters: Surah 101: The Calamity (al-Qari'ah) And of the surah in which the Calamity is mentioned, which is all Meccan and consists of 8 verses, 36 words and 152 letters:\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "100:11",
            "83:15",
            "36:16",
            "11:111",
            "43:14",
            "7:125",
            "37:31",
            "89:14",
            "33:2",
            "36:25"
        ],
        "BIBLE": [
            "prophets:jeremiah:42:19",
            "writings:proverbs:22:19",
            "torah:deuteronomy:9:24",
            "writings:psalms:37:18",
            "prophets:ezekiel:39:22",
            "prophets:zechariah:2:15",
            "writings:psalms:56:10",
            "prophets:ezekiel:39:6",
            "prophets:i%20samuel:8:18",
            "prophets:amos:7:3"
        ]
    }
}