{
    "VERSE": "100:6",
    "ARABIC": "إِنَّ ٱلْإِنسَٰنَ لِرَبِّهِۦ لَكَنُودٌ",
    "ENGLISH": {
        "TRANSLATION_0": "truly man is ungrateful to his Lord",
        "TRANSLATION_1": "That man is ungrateful to his Lord\n",
        "TRANSLATION_2": "Verily man is most ungrateful to his Lord;\n",
        "TRANSLATION_3": "The human being is certainly ungrateful to his Lord.\n",
        "TRANSLATION_4": "Indeed man is very ungrateful towards his Lord.\n",
        "TRANSLATION_5": "Verily, man is ungrateful to his Lord.\n",
        "TRANSLATION_6": "Most surely man is ungrateful to his Lord.\n",
        "TRANSLATION_7": "Surely Man is ungrateful to his Lord,\n",
        "TRANSLATION_8": "Lo! man is an ingrate unto his Lord\n",
        "TRANSLATION_9": "surely, man is ungrateful to his Lord.\n",
        "TRANSLATION_10": "Verily man is Unto his Lord ungrateful.\n",
        "TRANSLATION_11": "Indeed man is ungrateful to his Lord,\n",
        "TRANSLATION_12": "Truly man is, to his Lord, ungrateful;\n",
        "TRANSLATION_13": "Verily! Man (disbeliever) is ungrateful to his Lord;\n",
        "TRANSLATION_14": "Indeed, the human is ungrateful to his Lord.\n",
        "TRANSLATION_15": "Indeed, the human being is ungrateful to his Lord.\n",
        "TRANSLATION_16": "Indeed mankind, to his Lord, is ungrateful.\n",
        "TRANSLATION_17": "[100:6] Verily man, the disbeliever, is ungrateful to his Lord, thankless, denying [the reality of] His graces, exalted be He,\n",
        "TRANSLATION_18": "(Lo! Man) i.e. the disbelieving man: Qurt Ibn 'Abdullah Ibn 'Amr; and it is also said it refers to Abu Hubahib (is an ingrate unto his Lord) He says: he is ungrateful for the blessings of his Lord; it is also said this means: He is disobedient of his Lord; and it is also said this means: he is stingy; and it is also said this means: he denies those who are dependent on him, starves his slaves, eats alone and does not give those who are his relatives among his folk.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "100:6",
            "84:6",
            "103:2",
            "96:6",
            "43:15",
            "89:14",
            "90:4",
            "82:6",
            "51:34",
            "43:49"
        ],
        "BIBLE": [
            "torah:exodus:15:3",
            "writings:psalms:118:6",
            "writings:proverbs:30:2",
            "writings:psalms:128:4",
            "writings:psalms:118:8",
            "prophets:jeremiah:17:7",
            "prophets:i%20samuel:2:17",
            "prophets:judges:6:16",
            "writings:psalms:84:13",
            "prophets:ezekiel:18:5"
        ]
    }
}