{
    "VERSE": "56:27",
    "ARABIC": "وَأَصْحَٰبُ ٱلْيَمِينِ مَآ أَصْحَٰبُ ٱلْيَمِينِ",
    "ENGLISH": {
        "TRANSLATION_0": "And the Companions of the Right: what of the Companions of the Right?",
        "TRANSLATION_1": "As for those of the right hand -- how (happy) those of the right hand --\n",
        "TRANSLATION_2": "As for the People on the Right, how fortunate shall be the people on the Right!\n",
        "TRANSLATION_3": "As for the people of the right hand, how happy they will be!\n",
        "TRANSLATION_4": "And those on the right – how (fortunate) are those on the right!\n",
        "TRANSLATION_5": "And those on the right -- how (fortunate) will be those on the right\n",
        "TRANSLATION_6": "And the companions of the right hand; how happy are the companions of the right hand!\n",
        "TRANSLATION_7": "The Companions of the Right (O Companions of the Right!)\n",
        "TRANSLATION_8": "And those on the right hand; what of those on the right hand?\n",
        "TRANSLATION_9": "Those on the Right, how fortunate are those on the Right!\n",
        "TRANSLATION_10": "And the fellows on the right hand; how be happy shall the fellows on the right hand be!\n",
        "TRANSLATION_11": "And the People of the Right Hand—what are the People of the Right Hand?!\n",
        "TRANSLATION_12": "The Companions of the Right Hand,- what will be the Companions of the Right Hand?\n",
        "TRANSLATION_13": "And those on the Right Hand, Who will be those on the Right Hand?\n",
        "TRANSLATION_14": "The Companions of the Right\n",
        "TRANSLATION_15": "And those on the Right—what of those on the Right?\n",
        "TRANSLATION_16": "The companions of the right - what are the companions of the right?\n",
        "TRANSLATION_17": "[56:27] And those of the right [hand] — what of those of the right [hand]?\n",
        "TRANSLATION_18": "(And those on the right hand) the inhabitants of Paradise; (what of those on the right hand) and what do you know, Muhammad, about the bliss and happiness of the people of Paradise?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "56:27",
            "56:8",
            "74:39",
            "56:38",
            "56:90",
            "90:18",
            "56:9",
            "56:41",
            "56:91",
            "26:176"
        ],
        "BIBLE": [
            "prophets:jeremiah:32:38",
            "prophets:jeremiah:30:22",
            "torah:genesis:13:9",
            "torah:leviticus:14:27",
            "prophets:isaiah:51:4",
            "writings:job:35:2",
            "prophets:zechariah:11:17",
            "writings:psalms:89:16",
            "torah:leviticus:7:33",
            "torah:leviticus:25:32"
        ]
    }
}