{
    "VERSE": "56:41",
    "ARABIC": "وَأَصْحَٰبُ ٱلشِّمَالِ مَآ أَصْحَٰبُ ٱلشِّمَالِ",
    "ENGLISH": {
        "TRANSLATION_0": "And the Companions of the Left: what of the Companions of the Left?",
        "TRANSLATION_1": "But those of the left hand -- how (unhappy) those of the left hand --\n",
        "TRANSLATION_2": "As for the People on the Left: how miserable will be the People on the Left!\n",
        "TRANSLATION_3": "As for the people on the left hand, how miserable they will be!\n",
        "TRANSLATION_4": "And those on the left – how (wretched) are those on the left!\n",
        "TRANSLATION_5": "And those on the left How will be those on the left\n",
        "TRANSLATION_6": "And those of the left hand, how wretched are those of the left hand!\n",
        "TRANSLATION_7": "The Companions of the Left (O Companions of the Left!)\n",
        "TRANSLATION_8": "And those on the left hand: What of those on the left hand?\n",
        "TRANSLATION_9": "Those on the Left: how unfortunate are those on the Left!\n",
        "TRANSLATION_10": "And the fellows on the left hand; how miserable Shall the fellows on the left hand be!\n",
        "TRANSLATION_11": "And the People of the Left Hand—what are the People of the Left Hand?!\n",
        "TRANSLATION_12": "The Companions of the Left Hand,- what will be the Companions of the Left Hand?\n",
        "TRANSLATION_13": "And those on the Left Hand Who will be those on the Left Hand?\n",
        "TRANSLATION_14": "As for the Companions of the Left\n",
        "TRANSLATION_15": "And those on the Left—what of those on the Left?\n",
        "TRANSLATION_16": "And the companions of the left - what are the companions of the left?\n",
        "TRANSLATION_17": "[56:41] And those of the left [hand] — what of those of the left [hand]?\n",
        "TRANSLATION_18": "642 (And those on the left hand) the inhabitants of the Fire: (What of those on the left hand) what do you know, Muhammad, about the degradation and punishment of the people of the Fire?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "56:41",
            "56:9",
            "56:27",
            "26:176",
            "56:8",
            "15:78",
            "56:90",
            "53:2",
            "56:38",
            "90:18"
        ],
        "BIBLE": [
            "writings:psalms:108:4",
            "writings:psalms:57:10",
            "writings:psalms:117:1",
            "writings:psalms:80:5",
            "writings:job:35:4",
            "prophets:ii%20samuel:16:6",
            "writings:psalms:68:8",
            "prophets:zechariah:3:8",
            "prophets:jeremiah:32:38",
            "writings:song%20of%20songs:1:7"
        ]
    }
}