{
    "VERSE": "56:47",
    "ARABIC": "وَكَانُوا۟ يَقُولُونَ أَئِذَا مِتْنَا وَكُنَّا تُرَابًا وَعِظَٰمًا أَءِنَّا لَمَبْعُوثُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "and saying, 'When we are dead and turned to dust and bones, shall we then be raised again",
        "TRANSLATION_1": "And said: \"What! When we are dead and turned to dust and bones, shall we then be raised again?\n",
        "TRANSLATION_2": "They used to say: “What! Once we are dead and are reduced to dust and bones, shall we still be raised to a new life from the dead?\n",
        "TRANSLATION_3": "It was they who said, \"Shall we be resurrected after we die and have turned into dust and bones?\n",
        "TRANSLATION_4": "And they used to say, “When we are dead and have turned into dust and bones, will we surely be raised again?”\n",
        "TRANSLATION_5": "And they used to say: \"When we die and become dust and bones, shall we then indeed be resurrected\"\n",
        "TRANSLATION_6": "And they used to say: What! when we die and have become dust and bones, shall we then indeed be raised?\n",
        "TRANSLATION_7": "ever saying, 'What, when we are dead and become dust and bones, shall we indeed be raised up?\n",
        "TRANSLATION_8": "And they used to say: When we are dead and have become dust and bones, shall we then, forsooth, be raised again,\n",
        "TRANSLATION_9": "and they used to say, \"What! After we have died and become dust and bones, shall we indeed be raised up again?\n",
        "TRANSLATION_10": "And they were wont to say: when we have died and become dust and bones, shall we, then, verily be raised?\n",
        "TRANSLATION_11": "And they used to say, ‘What! When we are dead and become dust and bones, shall we be resurrected?!\n",
        "TRANSLATION_12": "And they used to say, \"What! when we die and become dust and bones, shall we then indeed be raised up again?-\n",
        "TRANSLATION_13": "And they used to say: \"When we die and become dust and bones, shall we then indeed be resurrected?\n",
        "TRANSLATION_14": "and constantly said: 'What, when we are dead and become dust and bones, shall we then be restored to life?\n",
        "TRANSLATION_15": "And they used to say, “When we are dead and turned into dust and bones, are we to be resurrected?\n",
        "TRANSLATION_16": "And they used to say, \"When we die and become dust and bones, are we indeed to be resurrected?\n",
        "TRANSLATION_17": "[56:47] And they used to say, ‘What! When we are dead and have become dust and bones, shall we indeed be resurrected? (in both instances [a-idhā and a-innā] the two hamzas may be read either by pronouncing them fully, or by not pronouncing the second, and in either case inserting an intervening alif).\n",
        "TRANSLATION_18": "(And they used to say) in the life of the world: (When we are dead and have come) scattered (dust and) rotten (bones, shall we then, forsooth, be raised again) shall we then be given life again,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "56:47",
            "23:82",
            "37:53",
            "37:16",
            "23:35",
            "27:67",
            "17:49",
            "79:11",
            "50:3",
            "83:32"
        ],
        "BIBLE": [
            "prophets:i%20samuel:18:11",
            "prophets:ezekiel:33:14",
            "torah:genesis:42:28",
            "prophets:isaiah:42:17",
            "prophets:joshua:7:26",
            "prophets:jeremiah:29:15",
            "prophets:ii%20kings:20:2",
            "prophets:isaiah:12:1",
            "prophets:i%20kings:20:39",
            "prophets:joshua:7:8"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:8",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:6:5"
        ]
    }
}