{
    "VERSE": "56:50",
    "ARABIC": "لَمَجْمُوعُونَ إِلَىٰ مِيقَٰتِ يَوْمٍ مَّعْلُومٍ",
    "ENGLISH": {
        "TRANSLATION_0": "to the appointment of a specified Day.",
        "TRANSLATION_1": "Will be gathered together on a certain day which is predetermined.\n",
        "TRANSLATION_2": "shall all be brought together on an appointed Day.\n",
        "TRANSLATION_3": "will be brought together for an appointment on an appointed day.\n",
        "TRANSLATION_4": "“They will all be gathered together – on the appointed time of the known day.”\n",
        "TRANSLATION_5": "All will surely be gathered together for appointed meeting of a known Day.\"\n",
        "TRANSLATION_6": "Shall most surely be gathered together for the appointed hour of a known day.\n",
        "TRANSLATION_7": "shall be gathered to the appointed time of a known day.\n",
        "TRANSLATION_8": "Will all be brought together to the tryst of an appointed day.\n",
        "TRANSLATION_9": "will indeed be gathered together at a fixed time on an appointed Day.\n",
        "TRANSLATION_10": "Are going to be assembled on the appointed time of a Day Known.\n",
        "TRANSLATION_11": "will all be gathered for the tryst of a known day.\n",
        "TRANSLATION_12": "All will certainly be gathered together for the meeting appointed for a Day well-known.\n",
        "TRANSLATION_13": "All will surely be gathered together for appointed Meeting of a known Day.\n",
        "TRANSLATION_14": "shall be gathered together to the appointed time on a known Day'\n",
        "TRANSLATION_15": "Will be gathered for the appointment of a familiar Day.”\n",
        "TRANSLATION_16": "Are to be gathered together for the appointment of a known Day.\"\n",
        "TRANSLATION_17": "[56:50] will be gathered for the tryst, the time, of a known day, that is, the Day of Resurrection.\n",
        "TRANSLATION_18": "Will all be brought together to the tryst of an appointed day) a well-known day, which is the Day of Judgement, whereby the people of old and the people of later times will be brought all together.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "56:50",
            "15:38",
            "38:81",
            "26:38",
            "78:17",
            "7:14",
            "77:12",
            "37:144",
            "44:40",
            "79:6"
        ],
        "BIBLE": [
            "prophets:ezekiel:26:18",
            "writings:nehemiah:13:6",
            "torah:leviticus:4:14",
            "writings:job:18:20",
            "prophets:joshua:2:5",
            "torah:genesis:29:7",
            "prophets:judges:20:30",
            "torah:exodus:4:29",
            "writings:i%20chronicles:17:5",
            "prophets:hosea:6:3"
        ]
    }
}