{
    "VERSE": "56:62",
    "ARABIC": "وَلَقَدْ عَلِمْتُمُ ٱلنَّشْأَةَ ٱلْأُولَىٰ فَلَوْلَا تَذَكَّرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "You have known the first formation, so will you not pay heed?",
        "TRANSLATION_1": "You have known the first creation, then why do you not reflect?\n",
        "TRANSLATION_2": "You are well aware of the first creation; then, do you learn no lesson from it?\n",
        "TRANSLATION_3": "You certainly knew about (your) first development. Why do you not take heed?\n",
        "TRANSLATION_4": "And you have indeed learnt about the first creation, so why do you not ponder?\n",
        "TRANSLATION_5": "And indeed, you have already known the first form of creation, why then do you not remember\n",
        "TRANSLATION_6": "And certainly you know the first growth, why do you not then mind?\n",
        "TRANSLATION_7": "You have known the first growth; so why will you not remember?\n",
        "TRANSLATION_8": "And verily ye know the first creation. Why, then, do ye not reflect?\n",
        "TRANSLATION_9": "You have certainly known the first creation. Why, then, do you not take heed?\n",
        "TRANSLATION_10": "And assuredly ye have fully known the first Production Wherefore heed ye not?\n",
        "TRANSLATION_11": "Certainly you have known the first genesis, then why do you not take admonition?\n",
        "TRANSLATION_12": "And ye certainly know already the first form of creation: why then do ye not celebrate His praises?\n",
        "TRANSLATION_13": "And indeed, you have already known the first form of creation (i.e. the creation of Adam), why then do you not remember or take heed?\n",
        "TRANSLATION_14": "You have surely known of the first creation. Why then, will you not remember!\n",
        "TRANSLATION_15": "You have known the first formation; if only you would remember.\n",
        "TRANSLATION_16": "And you have already known the first creation, so will you not remember?\n",
        "TRANSLATION_17": "[56:62] For verily you have known the first creation (al-nashā’ata: a variant reading has al-nash’ata), why then will you not remember? (tadhakkarūna: the original second tā’ [of tatadhakkarūna] has been assimilated with the dhāl).\n",
        "TRANSLATION_18": "(And verily ye know) O people of Mecca (the first creation) in the wombs of mothers; and it is also said: the creation of Adam. (Why, then, do ye not reflect) upon the first creation and thus believe in the second creation?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "56:62",
            "54:41",
            "15:13",
            "15:10",
            "39:12",
            "15:24",
            "37:71",
            "26:184",
            "43:8",
            "8:38"
        ],
        "BIBLE": [
            "prophets:amos:3:2",
            "torah:deuteronomy:8:2",
            "prophets:habakkuk:3:2",
            "torah:deuteronomy:21:11",
            "prophets:jeremiah:31:20",
            "torah:genesis:39:6",
            "prophets:ezekiel:43:11",
            "writings:psalms:95:10",
            "prophets:jeremiah:42:19",
            "prophets:judges:3:2"
        ]
    }
}