{
    "VERSE": "56:65",
    "ARABIC": "لَوْ نَشَآءُ لَجَعَلْنَٰهُ حُطَٰمًا فَظَلْتُمْ تَفَكَّهُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "If We wished We could have made it broken stubble. You would then be left devoid of crops, distraught:",
        "TRANSLATION_1": "We could turn it, if We pleased, into straw; then you would rue the day,\n",
        "TRANSLATION_2": "If We so wished, We could have reduced your harvest to rubble, and you would have been left wonder-struck to exclaim:\n",
        "TRANSLATION_3": "Had We wanted, We could have crushed it to bits and you would have been left to lament,\n",
        "TRANSLATION_4": "If We will We can make it like dry trampled hay, so you would keep crying out.\n",
        "TRANSLATION_5": "Were it Our will, We could crumble it to dry pieces, and you would be Tafakkahun.\n",
        "TRANSLATION_6": "If We pleased, We should have certainly made it broken down into pieces, then would you begin to lament:\n",
        "TRANSLATION_7": "Did We will, We would make it broken orts, and you would remain bitterly jesting --\n",
        "TRANSLATION_8": "If We willed, We verily could make it chaff, then would ye cease not to exclaim:\n",
        "TRANSLATION_9": "If We so pleased, We could turn your harvest into chaff. Then you would start lamenting,\n",
        "TRANSLATION_10": "If We willed, surely We would make it chaff, so that ye would be left wondering.\n",
        "TRANSLATION_11": "If We wish, We turn it into chaff, whereat you are left stunned [saying to yourselves,]\n",
        "TRANSLATION_12": "Were it Our Will, We could crumble it to dry powder, and ye would be left in wonderment,\n",
        "TRANSLATION_13": "Were it Our Will, We could crumble it to dry pieces, and you would be regretful (or left in wonderment).\n",
        "TRANSLATION_14": "If We will, We would make it broken stubble and you would remain wondering,\n",
        "TRANSLATION_15": "If We will, We can turn it into rubble; then you will lament.\n",
        "TRANSLATION_16": "If We willed, We could make it [dry] debris, and you would remain in wonder,\n",
        "TRANSLATION_17": "[56:65] If We will, We could surely turn it into chaff, dried vegetation producing no seed, and you would remain (zaltum is actually zaliltum, the lām having a kasra inflection; but it has been omitted to soften it), that is to say, you spend all day, bemused (tafakkahūna: one of the original tā’ [tatafakkahūna] letters has been omitted), surprised by this, and you would say:\n",
        "TRANSLATION_18": "(If We willed, We verily could make it) the cultivation (chaff) and dry after being green, (then would ye cease not to exclaim) then you would wonder at its dryness and destruction, and exclaim:\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "56:65",
            "37:127",
            "56:70",
            "104:4",
            "37:32",
            "80:12",
            "74:55",
            "104:5",
            "68:26",
            "96:17"
        ],
        "BIBLE": [
            "prophets:isaiah:24:19",
            "writings:daniel:7:23",
            "prophets:jeremiah:25:34",
            "torah:leviticus:6:14",
            "prophets:jeremiah:48:12",
            "prophets:isaiah:30:14",
            "torah:leviticus:2:6",
            "prophets:ii%20kings:18:4",
            "prophets:zechariah:11:16",
            "writings:job:16:12"
        ]
    }
}