{
    "VERSE": "56:69",
    "ARABIC": "ءَأَنتُمْ أَنزَلْتُمُوهُ مِنَ ٱلْمُزْنِ أَمْ نَحْنُ ٱلْمُنزِلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Is it you who sent it down from the clouds or are We the Sender?",
        "TRANSLATION_1": "Do you send it down from the clouds, or We send it down?\n",
        "TRANSLATION_2": "Is it you who brought it down from the clouds or is it We Who brought it down?\n",
        "TRANSLATION_3": "Is it you who sent it down from the clouds or is it We who have sent it down?\n",
        "TRANSLATION_4": "Is it you who caused it to descend from the cloud, or is it We Who cause it to descend?\n",
        "TRANSLATION_5": "Is it you who cause it to come down from Al-Muzn, or are We the Cause of it coming down\n",
        "TRANSLATION_6": "Is it you that send it down from the clouds, or are We the senders?\n",
        "TRANSLATION_7": "Did you send it down from the clouds, or did We send it?\n",
        "TRANSLATION_8": "Is it ye who shed it from the raincloud, or are We the Shedder?\n",
        "TRANSLATION_9": "Is it you who cause it to descend from the clouds, or do We?\n",
        "TRANSLATION_10": "Send it down ye from the raincloud, or are We the Sender down?\n",
        "TRANSLATION_11": "Is it you who bring it down from the rain cloud, or is it We who bring [it] down?\n",
        "TRANSLATION_12": "Do ye bring it down (in rain) from the cloud or do We?\n",
        "TRANSLATION_13": "Is it you who cause it from the rainclouds to come down, or are We the Causer of it to come down?\n",
        "TRANSLATION_14": "Is it you that send it down from the clouds or We?\n",
        "TRANSLATION_15": "Is it you who sent it down from the clouds, or are We the Sender?\n",
        "TRANSLATION_16": "Is it you who brought it down from the clouds, or is it We who bring it down?\n",
        "TRANSLATION_17": "[56:69] Is it you who cause it to come down from the [rain] clouds (muzn is the plural of muzna) or are We the Causer of its coming down?\n",
        "TRANSLATION_18": "(Is it ye) people of Mecca (who shed it from the rain cloud, or are We the Shedder?) Indeed, it is We Who send it down to you.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "56:69",
            "56:59",
            "56:64",
            "27:27",
            "102:1",
            "83:21",
            "37:52",
            "37:143",
            "21:55",
            "56:72"
        ],
        "BIBLE": [
            "prophets:joel:4:11",
            "torah:numbers:27:5",
            "prophets:i%20samuel:6:21",
            "prophets:ii%20kings:5:6",
            "prophets:ii%20kings:17:3",
            "prophets:i%20samuel:5:10",
            "prophets:i%20kings:1:53",
            "prophets:ii%20samuel:10:16",
            "torah:exodus:9:19",
            "prophets:ii%20kings:1:6"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:3:7",
            "Sefer%20Yetzirah:3:6",
            "Sefer%20Yetzirah:3:8"
        ]
    }
}