{
    "VERSE": "56:72",
    "ARABIC": "ءَأَنتُمْ أَنشَأْتُمْ شَجَرَتَهَآ أَمْ نَحْنُ ٱلْمُنشِـُٔونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Is it you who make the trees that fuel it grow or are We the Grower?",
        "TRANSLATION_1": "Have you raised its tree, or We have raised it?\n",
        "TRANSLATION_2": "Did you make its tree grow or was it We Who made it grow?\n",
        "TRANSLATION_3": "Is it you who have produced its tree or is it We who have produced it?\n",
        "TRANSLATION_4": "Is it you who grew its tree, or is it We Who create?\n",
        "TRANSLATION_5": "Is it you who made the tree thereof to grow, or are We the Grower\n",
        "TRANSLATION_6": "Is it you that produce the trees for it, or are We the producers?\n",
        "TRANSLATION_7": "Did you make its timber to grow, or did We make it?\n",
        "TRANSLATION_8": "Was it ye who made the tree thereof to grow, or were We the grower?\n",
        "TRANSLATION_9": "Did you produce the tree that serves as fuel or do We?\n",
        "TRANSLATION_10": "Produce ye the tree thereof, or are We the Producer?\n",
        "TRANSLATION_11": "Was it you who caused its tree to grow, or were We the grower?\n",
        "TRANSLATION_12": "Is it ye who grow the tree which feeds the fire, or do We grow it?\n",
        "TRANSLATION_13": "Is it you who made the tree thereof to grow, or are We the Grower?\n",
        "TRANSLATION_14": "Is it you that originated its tree, or are We the Originator?\n",
        "TRANSLATION_15": "Is it you who produce its tree, or are We the Producer?\n",
        "TRANSLATION_16": "Is it you who produced its tree, or are We the producer?\n",
        "TRANSLATION_17": "[56:72] Was it you who created the tree thereof, [trees] such as the markh, the ‘afār or the kalkh [‘fennel’], or were We the Creator?\n",
        "TRANSLATION_18": "(Was it ye) people of Mecca (who made the tree thereof to grow) is it you who created the trees from which fire can be struck out, (or were We the Grower) or are We the Creator?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "56:72",
            "56:64",
            "56:59",
            "55:6",
            "37:146",
            "37:64",
            "79:7",
            "102:1",
            "27:27",
            "37:62"
        ],
        "BIBLE": [
            "prophets:jeremiah:29:15",
            "writings:psalms:107:25",
            "prophets:amos:2:11",
            "prophets:ii%20samuel:12:17",
            "prophets:i%20samuel:20:33",
            "prophets:i%20samuel:2:7",
            "writings:psalms:41:11",
            "prophets:joshua:5:7",
            "prophets:i%20kings:11:14",
            "prophets:isaiah:49:11"
        ]
    }
}