{
    "VERSE": "56:73",
    "ARABIC": "نَحْنُ جَعَلْنَٰهَا تَذْكِرَةً وَمَتَٰعًا لِّلْمُقْوِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "We have made it to be a reminder and a comfort for travellers in the wild.",
        "TRANSLATION_1": "We have made it as a reminder and convenience for the needy.\n",
        "TRANSLATION_2": "We made it a reminder and a provision for the needy.\n",
        "TRANSLATION_3": "It is We who have made it as a reminder and a means of comfort for the people.\n",
        "TRANSLATION_4": "We have made it as a reminder of hell and as a utility for travellers in the jungle.\n",
        "TRANSLATION_5": "We have made it a Reminder, and an article of use for the Muqwin.\n",
        "TRANSLATION_6": "We have made it a reminder and an advantage for the wayfarers of the desert.\n",
        "TRANSLATION_7": "We Ourselves made it for a reminder, and a boon to the desert-dwellers.\n",
        "TRANSLATION_8": "We, even We, appointed it a memorial and a comfort for the dwellers in the wilderness.\n",
        "TRANSLATION_9": "We have made it to be a reminder and a benefit for the wayfarers.\n",
        "TRANSLATION_10": "We! it is We Who made it a reminder and a provision Unto the campers.\n",
        "TRANSLATION_11": "It was We who made it a reminder and a boon for the desert-dwellers.\n",
        "TRANSLATION_12": "We have made it a memorial (of Our handiwork), and an article of comfort and convenience for the denizens of deserts.\n",
        "TRANSLATION_13": "We have made it a Reminder (for the Hell-fire, in the Hereafter); and an article of use for the travellers (and all the others, in this world).\n",
        "TRANSLATION_14": "We have made it a reminder, and a blessing to the traveler.\n",
        "TRANSLATION_15": "We have made it a reminder, and a comfort for the users.\n",
        "TRANSLATION_16": "We have made it a reminder and provision for the travelers,\n",
        "TRANSLATION_17": "[56:73] We made it a reminder, of the fire of Hell, and a boon, a provision, for the desert-travellers (al-muqwīn derives from [the expression] aqwā al-qawmu, ‘they have reached al-qawā or al-qawā’, that is, al-qafr, ‘desolate land’, which is a wilderness (mafāza) that has neither vegetation nor water).\n",
        "TRANSLATION_18": "(We, even We, appointed it) i.e. the Fire (a memorial) a reminder of the Fire of the Hereafter (and a comfort) a benefit (for the dwellers in the wilderness) for the travellers in the wilderness.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "56:73",
            "79:33",
            "80:32",
            "15:9",
            "94:4",
            "70:2",
            "70:25",
            "7:24",
            "2:241",
            "74:45"
        ],
        "BIBLE": [
            "prophets:isaiah:14:17",
            "prophets:isaiah:51:3",
            "prophets:jeremiah:9:1",
            "prophets:ii%20samuel:7:10",
            "torah:leviticus:16:21",
            "torah:exodus:17:1",
            "prophets:isaiah:29:14",
            "writings:psalms:132:15",
            "prophets:judges:20:10",
            "writings:i%20chronicles:17:9"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:3:7",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:3:5",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:7"
        ]
    }
}