{
    "VERSE": "56:74",
    "ARABIC": "فَسَبِّحْ بِٱسْمِ رَبِّكَ ٱلْعَظِيمِ",
    "ENGLISH": {
        "TRANSLATION_0": "So glorify the name of your Lord, the Magnificent!",
        "TRANSLATION_1": "So glorify your Lord, the most supreme.\n",
        "TRANSLATION_2": "Glorify, then, (O Prophet), the name of your Great Lord.\n",
        "TRANSLATION_3": "(Muhammad), glorify your Lord, the Great One.\n",
        "TRANSLATION_4": "Therefore (O dear Prophet Mohammed – peace and blessings be upon him) proclaim the Purity of the name of your Lord, the Greatest.\n",
        "TRANSLATION_5": "Then glorify with praises the Name of your Lord, the Most Great.\n",
        "TRANSLATION_6": "Therefore glorify the name of your Lord, the Great.\n",
        "TRANSLATION_7": "Then magnify the Name of thy Lord, the All-mighty.\n",
        "TRANSLATION_8": "Therefor (O Muhammad), praise the name of thy Lord, the Tremendous.\n",
        "TRANSLATION_9": "So glorify the name of your Lord, the Supreme.\n",
        "TRANSLATION_10": "Wherefore hallow thou the name of thy Lord, the Mighty.\n",
        "TRANSLATION_11": "So celebrate the Name of your Lord, the All-supreme.\n",
        "TRANSLATION_12": "Then celebrate with praises the name of thy Lord, the Supreme!\n",
        "TRANSLATION_13": "Then glorify with praises the Name of your Lord, the Most Great.\n",
        "TRANSLATION_14": "Then, exalt the Name of your Lord, the Great.\n",
        "TRANSLATION_15": "So glorify the Name of your Great Lord.\n",
        "TRANSLATION_16": "So exalt the name of your Lord, the Most Great.\n",
        "TRANSLATION_17": "[56:74] So glorify, exalt the transcendence [of], the Name (ism is extra) of your Lord, the Tremendous, God.\n",
        "TRANSLATION_18": "(Therefore (0 Muhammad), praise the name of thy Lord, the Tremendous) therefore pray in the name of your Lord, the Mighty; it is also said that this means: remember the divine Oneness of your Lord, the Mighty.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "56:74",
            "56:96",
            "69:52",
            "96:1",
            "87:1",
            "73:8",
            "23:86",
            "55:78",
            "87:15",
            "44:57"
        ],
        "BIBLE": [
            "writings:psalms:34:4",
            "writings:nehemiah:9:5",
            "writings:psalms:147:12",
            "prophets:jeremiah:10:6",
            "prophets:ii%20samuel:22:50",
            "torah:deuteronomy:20:10",
            "writings:psalms:21:14",
            "writings:psalms:86:9",
            "writings:psalms:18:50",
            "prophets:isaiah:54:13"
        ]
    }
}