{
    "VERSE": "56:76",
    "ARABIC": "وَإِنَّهُۥ لَقَسَمٌ لَّوْ تَعْلَمُونَ عَظِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "and that is a mighty oath if you only knew -",
        "TRANSLATION_1": "And this surely is great evidence if you can understand --\n",
        "TRANSLATION_2": "and this is indeed a mighty oath, if only you knew –\n",
        "TRANSLATION_3": "- which is indeed a great oath if only you knew it -\n",
        "TRANSLATION_4": "And that is indeed a tremendous oath, if you understand.\n",
        "TRANSLATION_5": "And verily that is indeed a great oath, if you but know.\n",
        "TRANSLATION_6": "And most surely it is a very great oath if you only knew;\n",
        "TRANSLATION_7": "(and that is indeed a mighty oath, did you but know it)\n",
        "TRANSLATION_8": "And lo! that verily is a tremendous oath, if ye but knew -\n",
        "TRANSLATION_9": "and, indeed, that is a most mighty oath, if you only knew --\n",
        "TRANSLATION_10": "And verily that is a mighty oath, if ye but knew!\n",
        "TRANSLATION_11": "And indeed it is a great oath, should you know.\n",
        "TRANSLATION_12": "And that is indeed a mighty adjuration if ye but knew,-\n",
        "TRANSLATION_13": "And verily, that is indeed a great oath, if you but know.\n",
        "TRANSLATION_14": "and that is a mighty oath, if you but knew\n",
        "TRANSLATION_15": "It is an oath, if you only knew, that is tremendous.\n",
        "TRANSLATION_16": "And indeed, it is an oath - if you could know - [most] great.\n",
        "TRANSLATION_17": "[56:76] And indeed it, the swearing by these [setting-places of stars], is a tremendous oath, if you only knew — if you were people of [deep] knowledge, you would realise the magnitude of this oath.\n",
        "TRANSLATION_18": "(And lo! That) i.e. the Qur'an (verily is a tremendous oath, if ye but knew) if you but believe.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "56:76",
            "68:4",
            "37:16",
            "37:53",
            "23:82",
            "56:47",
            "37:137",
            "23:35",
            "43:44",
            "69:49"
        ],
        "BIBLE": [
            "writings:job:15:9",
            "prophets:hosea:13:5",
            "prophets:micah:4:12",
            "prophets:isaiah:41:20",
            "prophets:isaiah:44:18",
            "writings:psalms:82:5",
            "writings:proverbs:4:1",
            "writings:proverbs:1:2",
            "writings:job:23:5",
            "prophets:isaiah:56:11"
        ]
    }
}