{
    "VERSE": "56:8",
    "ARABIC": "فَأَصْحَٰبُ ٱلْمَيْمَنَةِ مَآ أَصْحَٰبُ ٱلْمَيْمَنَةِ",
    "ENGLISH": {
        "TRANSLATION_0": "the Companions of the Right: what of the Companions of the Right",
        "TRANSLATION_1": "Those of the right hand -- how (happy) will be those of the right hand!\n",
        "TRANSLATION_2": "The People on the Right: and how fortunate will be the People on the Right!\n",
        "TRANSLATION_3": "The people of the right hand - those whose books of records will be placed in their right hands. How happy they will be!\n",
        "TRANSLATION_4": "So those on the right – how (fortunate) are those on the right!\n",
        "TRANSLATION_5": "So those on the right -- how (fortunate) will be those on the right!\n",
        "TRANSLATION_6": "Then (as to) the companions of the right hand; how happy are the companions of the right hand!\n",
        "TRANSLATION_7": "Companions of the Right (O Companions of the Right!)\n",
        "TRANSLATION_8": "(First) those on the right hand; what of those on the right hand?\n",
        "TRANSLATION_9": "Those on the Right -- how blessed are those on the Right!\n",
        "TRANSLATION_10": "Those on the right hand; how happy shall those on the right hand be!\n",
        "TRANSLATION_11": "The People of the Right Hand—and what are the People of the Right Hand?!\n",
        "TRANSLATION_12": "Then (there will be) the Companions of the Right Hand;- What will be the Companions of the Right Hand?\n",
        "TRANSLATION_13": "So those on the Right Hand (i.e. those who will be given their Records in their right hands), Who will be those on the Right Hand? (As a respect for them, because they will enter Paradise).\n",
        "TRANSLATION_14": "Companions of the Right, what are the Companions of the Right?\n",
        "TRANSLATION_15": "Those on the Right—what of those on the Right?\n",
        "TRANSLATION_16": "Then the companions of the right - what are the companions of the right?\n",
        "TRANSLATION_17": "[56:8] Those of the right [hand], those who are given their record [of deeds] in their right hand (fa-ashābu’lmaymanati is the subject, the predicate of which is [the following mā ashābu’l-maymanati]) — what of those   of the right [hand]? — a glorification of their status on account of their admittance into Paradise.\n",
        "TRANSLATION_18": "(First) those on the right hand) these are the inhabitants of the Garden who will be given their scrolls in their right hands; they are the ones about whom Allah said: \"These are destined for Paradise, and I care not\"; (what of those on the right hand) arousing by this expression the wonder of His Prophet: and what do you know, Muhammad, about the bliss, happiness and honour of the people of the Garden?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "56:8",
            "56:27",
            "90:18",
            "56:38",
            "74:39",
            "56:91",
            "56:90",
            "26:176",
            "56:41",
            "56:9"
        ],
        "BIBLE": [
            "writings:ii%20chronicles:4:8",
            "torah:numbers:15:26",
            "torah:genesis:26:4",
            "torah:deuteronomy:17:7",
            "torah:deuteronomy:33:29",
            "torah:numbers:22:6",
            "writings:nehemiah:7:5",
            "prophets:isaiah:61:9",
            "prophets:judges:18:10",
            "torah:genesis:13:9"
        ]
    }
}