{
    "VERSE": "56:87",
    "ARABIC": "تَرْجِعُونَهَآ إِن كُنتُمْ صَٰدِقِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "do you not send it back if you are telling the truth?",
        "TRANSLATION_1": "Can you not bring him back? (Answer) if you are truthful\n",
        "TRANSLATION_2": "why are you then not able to bring them back to life if you are truthful?\n",
        "TRANSLATION_3": "why can you not bring it (the soul) back (to life)?\n",
        "TRANSLATION_4": "That you bring it back, if you are truthful?\n",
        "TRANSLATION_5": "Return the soul, if you are truthful\n",
        "TRANSLATION_6": "That you send it (not) back-- if you are truthful?\n",
        "TRANSLATION_7": "do you not bring back his soul, if you speak truly?\n",
        "TRANSLATION_8": "Do ye not force it back, if ye are truthful?\n",
        "TRANSLATION_9": "do you not cause the soul to return to him if you are truthful in your claim?\n",
        "TRANSLATION_10": "Cause ye it not to return, if ye say sooth?\n",
        "TRANSLATION_11": "[to Divine dispensation], if you are truthful?\n",
        "TRANSLATION_12": "Call back the soul, if ye are true (in the claim of independence)?\n",
        "TRANSLATION_13": "Bring back the soul (to its body), if you are truthful?\n",
        "TRANSLATION_14": "do you not restore his soul, if you are truthful?\n",
        "TRANSLATION_15": "Then bring it back, if you are truthful.\n",
        "TRANSLATION_16": "Bring it back, if you should be truthful?\n",
        "TRANSLATION_17": "[56:87] do you not bring it back, [why] do you not restore the spirit to the body after it has reached the throat, if you are truthful?, in what you claim (the second law-lā, ‘why … if’, is [repeated] to emphasise the first one; idhā, ‘when’, is an adverbial particle qualifying tarji‘ūna, ‘bring it back’, to which both conditions are semantically connected). The meaning is: ‘Why do you not bring it back, when, in repudiating resurrection, you are being truthful in this repudiation?’ That is to say, ‘Let death also be repudiated [as impossible] in its case just as [you claim that] resurrection is [impossible]’.\n",
        "TRANSLATION_18": "(Do ye not force it back) force the soul back to the body, (if ye are truthful) that you are not legally bound? 646\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "56:87",
            "47:37",
            "102:1",
            "79:7",
            "71:18",
            "26:157",
            "26:40",
            "15:71",
            "23:84",
            "21:68"
        ],
        "BIBLE": [
            "torah:deuteronomy:17:16",
            "torah:numbers:22:37",
            "prophets:jeremiah:38:26",
            "prophets:i%20samuel:6:3",
            "prophets:judges:6:13",
            "prophets:ii%20kings:1:5",
            "prophets:jeremiah:18:11",
            "prophets:jeremiah:42:5",
            "writings:lamentations:3:58",
            "prophets:ii%20kings:8:1"
        ]
    }
}