{
    "VERSE": "56:89",
    "ARABIC": "فَرَوْحٌ وَرَيْحَانٌ وَجَنَّتُ نَعِيمٍ",
    "ENGLISH": {
        "TRANSLATION_0": "there is solace and sweetness and a Garden of Delight.",
        "TRANSLATION_1": "There will be peace and plenty, and gardens of tranquility for him.\n",
        "TRANSLATION_2": "then happiness and delight and Gardens of Bliss are his.\n",
        "TRANSLATION_3": "it will have rest, happiness, and a beautiful Paradise.\n",
        "TRANSLATION_4": "Then is relief, and flowers – and Gardens of peace.\n",
        "TRANSLATION_5": "Then Rawh, Rayhan and a Garden of Delights.\n",
        "TRANSLATION_6": "Then happiness and bounty and a garden of bliss.\n",
        "TRANSLATION_7": "there shall be repose and ease, and a Garden of Delight;\n",
        "TRANSLATION_8": "Then breath of life, and plenty, and a Garden of delight.\n",
        "TRANSLATION_9": "then for him there shall be comfort and plenty and a Garden of Bliss;\n",
        "TRANSLATION_10": "For him shall be comfort, and fragrance and a Garden of Delight.\n",
        "TRANSLATION_11": "then ease, abundance, and a garden of bliss.\n",
        "TRANSLATION_12": "(There is for him) Rest and Satisfaction, and a Garden of Delights.\n",
        "TRANSLATION_13": "(There is for him) rest and provision, and a Garden of delights (Paradise).\n",
        "TRANSLATION_14": "there shall be calmness and ease, a Garden of Delight.\n",
        "TRANSLATION_15": "Then happiness, and flowers, and Garden of Delights.\n",
        "TRANSLATION_16": "Then [for him is] rest and bounty and a garden of pleasure.\n",
        "TRANSLATION_17": "[56:89] then repose, that is, there will be for him relief, and a goodly provision, and a garden of Bliss (does this response belong to the ammā, ‘thus’, or to in, ‘if’, or to both? Different opinions [are given regarding this]).\n",
        "TRANSLATION_18": "(Then breath of life) then rest for them in the grave; and it is also said that this means: then there is mercy for them, (and plenty) when they come out of the grave; and it is also said this means: and provision, (and a Garden of Delight) on the Day of Judgement whose delight is perpetual.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "56:89",
            "52:17",
            "26:85",
            "37:43",
            "56:12",
            "31:8",
            "9:21",
            "26:134",
            "10:9",
            "26:57"
        ],
        "BIBLE": [
            "writings:psalms:132:15",
            "writings:psalms:17:14",
            "writings:psalms:37:11",
            "torah:genesis:6:17",
            "writings:esther:4:14",
            "torah:exodus:21:30",
            "prophets:zechariah:8:12",
            "writings:proverbs:3:2",
            "writings:proverbs:14:30",
            "prophets:isaiah:54:10"
        ]
    }
}