{
    "VERSE": "56:91",
    "ARABIC": "فَسَلَٰمٌ لَّكَ مِنْ أَصْحَٰبِ ٱلْيَمِينِ",
    "ENGLISH": {
        "TRANSLATION_0": "'Peace be upon you!' from the Companions of the Right",
        "TRANSLATION_1": "There will be the salutation by those of the right hand: \"Peace on you.\n",
        "TRANSLATION_2": "he will be welcomed by the words: “Peace to you” from the People on the Right.\n",
        "TRANSLATION_3": "it will be with the people of the right hand, living in peace and security.\n",
        "TRANSLATION_4": "Then upon you is the greetings of peace (O dear Prophet Mohammed – peace and blessings be upon him), from those on the right.\n",
        "TRANSLATION_5": "Then Salam (peace) to you from those on the right.\n",
        "TRANSLATION_6": "Then peace to you from those on the right hand.\n",
        "TRANSLATION_7": "Peace be upon thee, Companion of the Right!'\n",
        "TRANSLATION_8": "Then (the greeting) \"Peace be unto thee\" from those on the right hand.\n",
        "TRANSLATION_9": "he will be greeted with, \"Peace be to you,\" by those on the Right.\n",
        "TRANSLATION_10": "Then: peace Unto thee, for thou art of those on the right hand.\n",
        "TRANSLATION_11": "then [he will be told,] ‘Peace be on you, from the People of the Right Hand!’\n",
        "TRANSLATION_12": "(For him is the salutation), \"Peace be unto thee\", from the Companions of the Right Hand.\n",
        "TRANSLATION_13": "Then there is safety and peace (from the Punishment of Allah) for (you as you are from) those on the Right Hand.\n",
        "TRANSLATION_14": "(he will be greeted with): 'Peace be upon you, Companion of the Right'\n",
        "TRANSLATION_15": "Then, “Peace upon you,” from those on the Right.\n",
        "TRANSLATION_16": "Then [the angels will say], \"Peace for you; [you are] from the companions of the right.\"\n",
        "TRANSLATION_17": "[56:91] then ‘Peace be to you’, that is, [then] for him there will be [peace by way of] security (salām) from   chastisement, [a greeting] from those of the right [hand], [arising] from the fact that he is one of them.\n",
        "TRANSLATION_18": "(Then (the greeting) \"Peace be unto thee\" from those on the right hand) then peace and safety to you from the people of the right hand; Allah has taken charge of their matter and saved them; it is also said this means: the people of Paradise greet you with the greeting of peace.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "56:91",
            "56:38",
            "56:8",
            "74:39",
            "56:90",
            "56:27",
            "90:18",
            "29:15",
            "37:93",
            "69:45"
        ],
        "BIBLE": [
            "prophets:jeremiah:16:10",
            "torah:exodus:19:9",
            "prophets:hosea:2:25",
            "prophets:jeremiah:2:31",
            "prophets:ii%20kings:6:12",
            "torah:deuteronomy:27:26",
            "prophets:isaiah:51:16",
            "writings:daniel:10:11",
            "prophets:jonah:1:8",
            "torah:numbers:36:5"
        ]
    }
}