{
    "VERSE": "56:96",
    "ARABIC": "فَسَبِّحْ بِٱسْمِ رَبِّكَ ٱلْعَظِيمِ",
    "ENGLISH": {
        "TRANSLATION_0": "So glorify the Name of your Lord, the Magnificent!",
        "TRANSLATION_1": "Then praise your Lord, the most supreme.\n",
        "TRANSLATION_2": "So glorify the name of your Great Lord.\n",
        "TRANSLATION_3": "So glorify the name of your Lord, the Great One.\n",
        "TRANSLATION_4": "Therefore (O dear Prophet Mohammed – peace and blessings be upon him) proclaim the Purity of the name of your Lord, the Greatest.\n",
        "TRANSLATION_5": "So, glorify with praises the Name of your Lord, the Most Great.\n",
        "TRANSLATION_6": "Therefore glorify the name of your Lord, the Great.\n",
        "TRANSLATION_7": "Then magnify the Name of thy Lord, the All-mighty.\n",
        "TRANSLATION_8": "Therefor (O Muhammad) praise the name of thy Lord, the Tremendous.\n",
        "TRANSLATION_9": "So glorify the name of your Lord, the Supreme.\n",
        "TRANSLATION_10": "Wherefore hallow thou the name of thy Lord, the Mighty!\n",
        "TRANSLATION_11": "So celebrate the Name of your Lord, the All-supreme!\n",
        "TRANSLATION_12": "So celebrate with praises the name of thy Lord, the Supreme.\n",
        "TRANSLATION_13": "So glorify with praises the Name of your Lord, the Most Great.\n",
        "TRANSLATION_14": "So exalt the Name of your Lord, the Great.\n",
        "TRANSLATION_15": "So glorify the Name of your Lord, the Magnificent\n",
        "TRANSLATION_16": "So exalt the name of your Lord, the Most Great.\n",
        "TRANSLATION_17": "[56:96] So glorify the Name of your Lord, the Tremendous (as [explained] above [in verse 74]).\n",
        "TRANSLATION_18": "(Therefore (0 Muhammad) praise the name of thy Lord, the Tremendous) therefore pray by the command of your Lord, the Mighty; and it is also said that this means: remember the divine Oneness of your Lord, the Mighty, Who is more tremendous than all there is'. 0- And of the surah in which Iron is mentioned which is all Meccan or Medinan, and which consists of 29 verses, 544 words and 2,446 letters: Surah 57: Iron (al-Hadid) And of the surah in which Iron is mentioned which is all Meccan or Medinan, 26 and which consists of 29 verses, 544 words and 2,446 letters:\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "56:74",
            "56:96",
            "69:52",
            "96:1",
            "87:1",
            "73:8",
            "23:86",
            "55:78",
            "87:15",
            "44:57"
        ],
        "BIBLE": [
            "writings:psalms:34:4",
            "writings:nehemiah:9:5",
            "prophets:jeremiah:10:6",
            "torah:deuteronomy:20:10",
            "writings:psalms:147:12",
            "writings:psalms:21:14",
            "writings:psalms:86:9",
            "prophets:ii%20samuel:22:50",
            "prophets:isaiah:54:13",
            "prophets:isaiah:25:1"
        ]
    }
}