{
    "VERSE": "61:10",
    "ARABIC": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ هَلْ أَدُلُّكُمْ عَلَىٰ تِجَٰرَةٍ تُنجِيكُم مِّنْ عَذَابٍ أَلِيمٍ",
    "ENGLISH": {
        "TRANSLATION_0": "You who have iman! shall I direct you to a transaction which will save you from a painful punishment?",
        "TRANSLATION_1": "O you who believe, may I offer you a bargain which will save you from a painful punishment?\n",
        "TRANSLATION_2": "Believers, shall I direct you to a commerce that will deliver you from a grievous chastisement?\n",
        "TRANSLATION_3": "Believers, shall I show you a bargain which will save you from the painful torment?\n",
        "TRANSLATION_4": "O People who Believe! Shall I show you a trade that can save you from the painful punishment?\n",
        "TRANSLATION_5": "O you who believe! Shall I guide you to a trade that will save you from a painful torment\n",
        "TRANSLATION_6": "O you who believe! shall I lead you to a merchandise which may deliver you from a painful chastisement?\n",
        "TRANSLATION_7": "O believers, shall I direct you to a commerce that shall deliver you from a painful chastisement?\n",
        "TRANSLATION_8": "O ye who believe! Shall I show you a commerce that will save you from a painful doom?\n",
        "TRANSLATION_9": "Believers! Shall I guide you to a profitable course that will save you from a painful punishment?\n",
        "TRANSLATION_10": "O ye who believe! shall direct you to a merchandise that will deliver you from a torment afflictive?\n",
        "TRANSLATION_11": "O you who have faith! Shall I show you a deal that will deliver you from a painful punishment?\n",
        "TRANSLATION_12": "O ye who believe! Shall I lead you to a bargain that will save you from a grievous Penalty?-\n",
        "TRANSLATION_13": "O You who believe! Shall I guide you to a commerce that will save you from a painful torment.\n",
        "TRANSLATION_14": "Believers! Shall I direct you to a commerce that will save you from a painful punishment?\n",
        "TRANSLATION_15": "O you who believe! Shall I inform you of a trade that will save you from a painful torment?\n",
        "TRANSLATION_16": "O you who have believed, shall I guide you to a transaction that will save you from a painful punishment?\n",
        "TRANSLATION_17": "[61:10] O you who believe, shall I show you a commerce that will deliver you (read tunjīkum or tunajjīkum) from a painful chastisement? It is as if they had replied, ‘Yes’, so that He then says:\n",
        "TRANSLATION_18": "(0 ye who believe!) And He explained who they are at the beginning of the surah (Shall I show you a commerce that will save you from a painful doom) in the Hereafter?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "61:10",
            "2:104",
            "84:24",
            "26:201",
            "34:5",
            "4:138",
            "36:18",
            "51:37",
            "17:10",
            "37:38"
        ],
        "BIBLE": [
            "torah:deuteronomy:31:5",
            "writings:ii%20chronicles:32:15",
            "writings:psalms:109:21",
            "torah:numbers:15:14",
            "prophets:jeremiah:15:20",
            "torah:deuteronomy:28:37",
            "writings:i%20chronicles:29:14",
            "writings:psalms:59:3",
            "torah:exodus:23:11",
            "writings:daniel:12:1"
        ]
    }
}