{
    "VERSE": "61:11",
    "ARABIC": "تُؤْمِنُونَ بِٱللَّهِ وَرَسُولِهِۦ وَتُجَٰهِدُونَ فِى سَبِيلِ ٱللَّهِ بِأَمْوَٰلِكُمْ وَأَنفُسِكُمْ ذَٰلِكُمْ خَيْرٌ لَّكُمْ إِن كُنتُمْ تَعْلَمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "It is to have iman in Allah and His Messenger and do jihad in the Way of Allah with your wealth and your selves. That is better for you if you only knew.",
        "TRANSLATION_1": "Come to believe in God and His Apostle, and struggle in the cause of God, wealth and soul. This will be good for you, if you can understand.\n",
        "TRANSLATION_2": "Have faith in Allah and His Messenger and strive in the Way of Allah with your possessions and your lives. That is better for you if you only knew.\n",
        "TRANSLATION_3": "Have faith in God and His Messenger and strive hard for His cause with your wealth and in persons. This is better for you if only you knew it.\n",
        "TRANSLATION_4": "Have faith in Allah and His Noble Messenger, and fight in Allah’s cause with your wealth and your lives; this is better for you, if you understand.\n",
        "TRANSLATION_5": "That you believe in Allah and His Messenger, and that you strive hard and fight in the cause of Allah with your wealth and your lives, that will be better for you, if you but know!\n",
        "TRANSLATION_6": "You shall believe in Allah and His Apostle, and struggle hard in Allah's way with your property and your lives; that is better for you, did you but know!\n",
        "TRANSLATION_7": "You shall believe in God and His Messenger, and struggle in the way of God with your possessions and your selves. That is better for you, did you but know.\n",
        "TRANSLATION_8": "Ye should believe in Allah and His messenger, and should strive for the cause of Allah with your wealth and your lives. That is better for you, if ye did but know.\n",
        "TRANSLATION_9": "You should believe in God and His Messenger, and strive for God's cause with your possessions and your lives. That will be better for you, if you only knew --\n",
        "TRANSLATION_10": "It is that ye should believe in Allah and His apostle and strive in the way of Allah with your riches and Your lives That is best for you, if ye only knew!\n",
        "TRANSLATION_11": "Have faith in Allah and His Apostle, and wage jihad in the way of Allah with your persons and possessions. That is better for you, should you know.\n",
        "TRANSLATION_12": "That ye believe in Allah and His Messenger, and that ye strive (your utmost) in the Cause of Allah, with your property and your persons: That will be best for you, if ye but knew!\n",
        "TRANSLATION_13": "That you believe in Allah and His Messenger (Muhammad SAW), and that you strive hard and fight in the Cause of Allah with your wealth and your lives, that will be better for you, if you but know!\n",
        "TRANSLATION_14": "You shall believe in Allah and His Messenger and struggle for His Way with your possessions and yourselves. That is better for you, if you but knew.\n",
        "TRANSLATION_15": "That you believe in God and His Messenger, and strive in the cause of God with your possessions and yourselves. That is best for you, if you only knew.\n",
        "TRANSLATION_16": "[It is that] you believe in Allah and His Messenger and strive in the cause of Allah with your wealth and your lives. That is best for you, if you should know.\n",
        "TRANSLATION_17": "[61:11] You should believe, you should maintain faith, in God and His Messenger and struggle for the cause of God with your possessions and your lives. That is better for you, should you know, that it is better for you, then do it.\n",
        "TRANSLATION_18": "(Ye should believe in Allah and His messenger) you should be true in your faith in Allah and His Messenger, if this is understood to be a call to be the opposite of the hypocrites, (and should strive for the cause of Allah) in obedience of Allah (with your wealth and your lives) by spending your wealth and sacrificing your own persons. (That) striving (is better for you) wealth, (if ye did but know) if you believe in the reward of Allah.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "61:11",
            "9:41",
            "49:15",
            "9:88",
            "29:16",
            "9:81",
            "64:16",
            "9:20",
            "2:279",
            "3:157"
        ],
        "BIBLE": [
            "prophets:ezekiel:14:23",
            "prophets:ezekiel:7:4",
            "prophets:isaiah:43:10",
            "prophets:jeremiah:6:16",
            "prophets:ezekiel:7:9",
            "prophets:ezekiel:36:23",
            "prophets:jeremiah:12:16",
            "writings:psalms:143:8",
            "prophets:joel:2:27",
            "prophets:joshua:1:9"
        ]
    }
}