{
    "VERSE": "61:14",
    "ARABIC": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ كُونُوٓا۟ أَنصَارَ ٱللَّهِ كَمَا قَالَ عِيسَى ٱبْنُ مَرْيَمَ لِلْحَوَارِيِّۦنَ مَنْ أَنصَارِىٓ إِلَى ٱللَّهِ قَالَ ٱلْحَوَارِيُّونَ نَحْنُ أَنصَارُ ٱللَّهِ فَـَٔامَنَت طَّآئِفَةٌ مِّنۢ بَنِىٓ إِسْرَٰٓءِيلَ وَكَفَرَت طَّآئِفَةٌ فَأَيَّدْنَا ٱلَّذِينَ ءَامَنُوا۟ عَلَىٰ عَدُوِّهِمْ فَأَصْبَحُوا۟ ظَٰهِرِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "You who have iman! be helpers of Allah as 'Isa son of Maryam said to the Disciples, 'Who will be my helpers to Allah?' The Disciples said, 'We will be the helpers of Allah.' One faction of the tribe of Israel had iman and the other were kafir. So We supported those who had iman against their enemy and they became victorious.",
        "TRANSLATION_1": "O you who believe, be helpers of God, as Jesus, son of Mary, had said to the disciples: \"Who will help me in the way of God?\" and they had answered: \"We are the helpers of God.\" Then a section among the children of Israel believed, but a section among them did not. So We helped those who believed against their enemies, and they prevailed over them.\n",
        "TRANSLATION_2": "Believers, become Allah's helpers, as Jesus, son of Mary, said to the disciples: “Who is my helper in (calling people) to Allah?” The disciples had responded by saying: “We are Allah's helpers.” Then a section of the Children of Israel believed and a section rejected the call. Thereafter We aided the believers against their enemies, and they prevailed.\n",
        "TRANSLATION_3": "Believers, be the helpers of God just as when Jesus, the son of Mary, asked the disciples, \"Who will be my helpers for the cause of God?\" and the disciples replied, \"We are the helpers of God.\" A group of the Israelites believed in him and others rejected him. We helped the believers against their enemies and they became victorious.\n",
        "TRANSLATION_4": "O People who Believe! Become the aides of Allah’s religion, the way Eisa the son of Maryam had said to the disciples, “Who will help me, inclining towards Allah?” The disciples said, “We are the aides of Allah’s religion” – so a group among the Descendants of Israel accepted faith and another group disbelieved; We therefore aided the believers against their enemies, so they were victorious.\n",
        "TRANSLATION_5": "O you who believe! Be you helpers (in the cause) of Allah as said `Isa, son of Maryam, to the Hawariyyin (the disciples): \"Who are my helpers (in the cause) of Allah\" The Hawariyyun said: \"We are Allah's helpers\" (i.e., we will strive in His cause!). Then a group of the Children of Israel believed and a group disbelieved. So, We gave power to those who believed against their enemies, and they became the victorious (uppermost).\n",
        "TRANSLATION_6": "O you who believe! be helpers (in the cause) of Allah, as~ Isa son of Marium said to (his) disciples: Who are my helpers in the cause of Allah? The disciples said: We are helpers (in the cause) of Allah. So a party of the children of Israel believed and another party disbelieved; then We aided those who believed against their enemy, and they became uppermost.\n",
        "TRANSLATION_7": "O believers, be you God's helpers, as Jesus, Mary's son, said to the Apostles. 'Who will be my helpers unto God?' The Apostles said, 'We will be helpers of God.' And a party of the Children of Israel believed, and a party disbelieved. So We confirmed those who believed against their enemy, and they became masters.\n",
        "TRANSLATION_8": "O ye who believe! Be Allah's helpers, even as Jesus son of Mary said unto the disciples: Who are my helpers for Allah? They said: We are Allah's helpers. And a party of the Children of Israel believed, while a party disbelieved. Then We strengthened those who believed against their foe, and they became the uppermost.\n",
        "TRANSLATION_9": "Believers, be God's helpers, as Jesus, son of Mary, said to the disciples, \"Who will be my helpers in the cause of God?\" The disciples said, \"We shall be God's helpers.\" Some of the Children of Israel believed in him and some denied the truth; We supported the believers against their enemies and they triumphed over them.\n",
        "TRANSLATION_10": "O ye who believe! be Allah's helpers, even as 'Isa, son of Maryam, said Unto the disciples: who shall be my helpers Unto Allah? The disciples said: we are Allah's helpers. Then a part of the Children of Israil believed, and part disbelieved. Then We strengthened those who believed against their foe; wherefore they became triumphant.\n",
        "TRANSLATION_11": "O you who have faith! Be Allah’s helpers, just as Jesus son of Mary said to his disciples, ‘Who will be my helpers for Allah’s sake?’ The Disciples said, ‘We will be Allah’s helpers!’ So a group of the Children of Israel believed, and a group disbelieved. Then We strengthened the faithful against their enemies, and they came to prevail [over them].\n",
        "TRANSLATION_12": "O ye who believe! Be ye helpers of Allah: As said Jesus the son of Mary to the Disciples, \"Who will be my helpers to (the work of) Allah?\" Said the disciples, \"We are Allah's helpers!\" then a portion of the Children of Israel believed, and a portion disbelieved: But We gave power to those who believed, against their enemies, and they became the ones that prevailed.\n",
        "TRANSLATION_13": "O you who believe! Be you helpers (in the Cause) of Allah as said 'Iesa (Jesus), son of Maryam (Mary), to Al-Hawariun (the disciples): \"Who are my helpers (in the Cause) of Allah?\" Al-Hawarieen (the disciples) said: \"We are Allah's helpers\" (i.e. we will strive in His Cause!). Then a group of the Children of Israel believed and a group disbelieved. So We gave power to those who believed against their enemies, and they became the uppermost.\n",
        "TRANSLATION_14": "Believers, be the helpers of Allah. When (Prophet) Jesus, the son of Mary said to the disciples: 'Who will be my helpers unto Allah' The disciples replied:'We will be the helpers of Allah' A party of the Children of Israel believed, and a party disbelieved. So, We supported those who believed against their enemy, and they overcame.\n",
        "TRANSLATION_15": "O you who believe! Be supporters of God, as Jesus son of Mary said to the disciples, “Who are my supporters towards God?” The disciples said, “We are God's supporters.” So a group of the Children of Israel believed, while another group disbelieved. We supported those who believed against their foe, so they became dominant.\n",
        "TRANSLATION_16": "O you who have believed, be supporters of Allah, as when Jesus, the son of Mary, said to the disciples, \"Who are my supporters for Allah?\" The disciples said, \"We are supporters of Allah.\" And a faction of the Children of Israel believed and a faction disbelieved. So We supported those who believed against their enemy, and they became dominant.\n",
        "TRANSLATION_17": "[61:14] O you who believe, be helpers of God, of His religion (a variant reading [of ansāran li’Llāhi] has the genitive annexation ansāra’Llāhi) just as said (kamā qāla to the end [of the statement] means ‘just as the disciples were so’, as is indicated by [what follows]) Jesus son of Mary to the disciples, ‘Who will be my helpers unto God?’, that is to say, who [of you] will be helpers alongside me turning to help God? The disciples said, ‘We will be God’s helpers!’ [These] al-hawāriyyūn [were] the intimates of Jesus, for they were the first to believe in him. They were twelve men of pure white complexion (hawar); but it is also said that [their epithet derives from the fact that] they were bleachers (qassārūn) who bleached (yuhawwirūna) clothes. So a group of the Children of Israel believed, in Jesus, saying: ‘He is [indeed] the servant of God, [who has been] raised to heaven’, while a group disbelieved, because they said that he was the son of God, whom He had raised unto Himself. Thus the two groups waged war against one another. Then We strengthened those who believed, of the two groups, against their enemy, the disbelieving groups, and so they became the triumphant, the victors.\n",
        "TRANSLATION_18": "(0 ye who believe) in Muhammad (pbuh) and the Qur'an! (Be Allah's helpers) be helpers to Muhammad (pbuh) against his enemies; it is also said this means: be Allah's helpers against His enemies, (even as Jesus son of Mary said unto the disciples: Who are my helpers for Allah) who are my helpers, along with Allah, against His enemies? (They said) his disciples said: (We are Allah's helpers) we are your helpers, along with Allah, against His enemies. They were 12 male disciples, the first to believe in him and help him against his enemies. All of these men were believers. (And a party of the Children of Israel believed) in Jesus the son of Mary, (while a party disbelieved) in Jesus son of Mary. This is the party that was led astray by Paul and did not believe in him. (Then We strengthened) We helped and fortified (those who believed) in Jesus the son of Mary and did not oppose his religion (against their foe) those who opposed the religion of Jesus, (and they became the uppermost) in argument against their foes because of their prayer to Allah, and it is also said because they were among those who glorified Allah'. And of the surah in which Friday is mentioned, which is all Medinan and consists of 11 verses, 180 words and 748 letters: Surah 62: The Congregation (al-Jumu'ah) And of the surah in which Friday is mentioned, which is all Medinan and consists of 1 1 verses, 180 words and 748 letters: 666\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "61:14",
            "3:52",
            "5:72",
            "5:87",
            "7:138",
            "5:112",
            "41:19",
            "61:6",
            "11:113",
            "2:278"
        ],
        "BIBLE": [
            "prophets:ii%20samuel:9:9",
            "torah:numbers:20:12",
            "prophets:jeremiah:35:15",
            "prophets:jeremiah:7:14",
            "torah:genesis:30:6",
            "prophets:isaiah:65:1",
            "writings:ii%20chronicles:10:16",
            "prophets:ii%20kings:10:15",
            "torah:numbers:18:24",
            "prophets:isaiah:50:2"
        ]
    }
}