{
    "VERSE": "61:3",
    "ARABIC": "كَبُرَ مَقْتًا عِندَ ٱللَّهِ أَن تَقُولُوا۟ مَا لَا تَفْعَلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "It is deeply abhorrent to Allah that you should say what you do not do.",
        "TRANSLATION_1": "Saying what you do not practice is odious to God.\n",
        "TRANSLATION_2": "It is most loathsome in the sight of Allah that you should profess what you do not practise.\n",
        "TRANSLATION_3": "It is most hateful in the sight of God if you say something and do not practice it.\n",
        "TRANSLATION_4": "How despicable it is in the sight of Allah that you may preach what you do not practice.\n",
        "TRANSLATION_5": "Most hateful it is with Allah that you say that which you do not do.\n",
        "TRANSLATION_6": "It is most hateful to Allah that you should say that which you do not do.\n",
        "TRANSLATION_7": "Very hateful is it to God, that you say what you do not.\n",
        "TRANSLATION_8": "It is most hateful in the sight of Allah that ye say that which ye do not.\n",
        "TRANSLATION_9": "It is most hateful to God that you do not practise what you preach;\n",
        "TRANSLATION_10": "Most odious it is Unto Allah that ye should Say that which ye do not.\n",
        "TRANSLATION_11": "It is greatly outrageous to Allah that you should say what you do not do.\n",
        "TRANSLATION_12": "Grievously odious is it in the sight of Allah that ye say that which ye do not.\n",
        "TRANSLATION_13": "Most hateful it is with Allah that you say that which you do not do.\n",
        "TRANSLATION_14": "It is most hateful to Allah that you should say that which you do not do.\n",
        "TRANSLATION_15": "It is most hateful to God that you say what you do not do.\n",
        "TRANSLATION_16": "Great is hatred in the sight of Allah that you say what you do not do.\n",
        "TRANSLATION_17": "[61:3] It is greatly loathsome (maqtan is for specification) to God that you say (an taqūlū constitutes the agent of [the verb] kabura, ‘it is great[ly]’) what you do not do.\n",
        "TRANSLATION_18": "(It is most hateful in the sight of Allah that ye say that which ye do not) that you promise that which you cannot fulfil or speak of doing that which you cannot do.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "61:3",
            "13:39",
            "27:47",
            "46:23",
            "12:79",
            "2:76",
            "33:69",
            "8:55",
            "3:163",
            "67:26"
        ],
        "BIBLE": [
            "torah:genesis:8:15",
            "writings:psalms:79:10",
            "writings:psalms:115:2",
            "torah:genesis:9:8",
            "torah:exodus:33:17",
            "torah:genesis:21:12",
            "torah:genesis:23:8",
            "writings:job:34:9",
            "prophets:jeremiah:4:10",
            "prophets:malachi:2:17"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:14",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:6:3"
        ]
    }
}