{
    "VERSE": "61:4",
    "ARABIC": "إِنَّ ٱللَّهَ يُحِبُّ ٱلَّذِينَ يُقَٰتِلُونَ فِى سَبِيلِهِۦ صَفًّا كَأَنَّهُم بُنْيَٰنٌ مَّرْصُوصٌ",
    "ENGLISH": {
        "TRANSLATION_0": "Allah loves those who fight in His Way in ranks like well-built walls.",
        "TRANSLATION_1": "Surely God loves those who fight in His cause in full formations as though they were a compact wall.\n",
        "TRANSLATION_2": "Allah indeed loves those who fight in His Way as though they are a solid wall cemented with molten lead.\n",
        "TRANSLATION_3": "God loves those who fight for His cause in battlefield formations firm as an unbreakable concrete wall.\n",
        "TRANSLATION_4": "Indeed Allah likes those who fight in His cause, positioned in rows, as if they were an edifice fortified.\n",
        "TRANSLATION_5": "Verily, Allah loves those who fight in His cause in rows as if they were a solid structure.\n",
        "TRANSLATION_6": "Surely Allah loves those who fight in His way in ranks as if they were a firm and compact wall.\n",
        "TRANSLATION_7": "God loves those who fight in His way in ranks, as though they were a building well-compacted.\n",
        "TRANSLATION_8": "Lo! Allah loveth them who battle for His cause in ranks, as if they were a solid structure.\n",
        "TRANSLATION_9": "surely, God loves those who fight for His cause in ranks, as if they were a solid cemented structure.\n",
        "TRANSLATION_10": "Verily Allah loveth those who fight in His way drown up in ranks, as though they were a structure well compacted.\n",
        "TRANSLATION_11": "Indeed Allah loves those who fight in His way in ranks, as if they were a compact structure.\n",
        "TRANSLATION_12": "Truly Allah loves those who fight in His Cause in battle array, as if they were a solid cemented structure.\n",
        "TRANSLATION_13": "Verily, Allah loves those who fight in His Cause in rows (ranks) as if they were a solid structure.\n",
        "TRANSLATION_14": "Allah loves those who fight in His Way lining up as if they were a stacked building.\n",
        "TRANSLATION_15": "God loves those who fight in His cause, in ranks, as though they were a compact structure.\n",
        "TRANSLATION_16": "Indeed, Allah loves those who fight in His cause in a row as though they are a [single] structure joined firmly.\n",
        "TRANSLATION_17": "[61:4]   Indeed God loves, He assists and honours, those who fight for His cause in ranks (saffan is a circumstantial qualifier, in other words [understand it as] sāffīna), as if they were a solid structure, with all of its parts compacted together, firm.\n",
        "TRANSLATION_18": "Then He encouraged them to strive in His way, saying: (Lo! Allah loveth those who battle for His cause) in His obedience (in ranks, as if they were a solid structure) like a cemented block.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "61:4",
            "29:69",
            "16:57",
            "63:2",
            "4:150",
            "5:35",
            "2:190",
            "47:1",
            "9:9",
            "4:167"
        ],
        "BIBLE": [
            "writings:ecclesiastes:4:16",
            "prophets:ezekiel:14:23",
            "writings:psalms:143:10",
            "prophets:jeremiah:6:29",
            "writings:psalms:50:23",
            "prophets:ezekiel:39:2",
            "writings:job:19:24",
            "prophets:ezekiel:22:31",
            "prophets:ezekiel:11:21",
            "writings:ezra:8:21"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:1:14",
            "Sefer%20Yetzirah:2:3",
            "Sefer%20Yetzirah:4:4"
        ]
    }
}