{
    "VERSE": "61:5",
    "ARABIC": "وَإِذْ قَالَ مُوسَىٰ لِقَوْمِهِۦ يَٰقَوْمِ لِمَ تُؤْذُونَنِى وَقَد تَّعْلَمُونَ أَنِّى رَسُولُ ٱللَّهِ إِلَيْكُمْ فَلَمَّا زَاغُوٓا۟ أَزَاغَ ٱللَّهُ قُلُوبَهُمْ وَٱللَّهُ لَا يَهْدِى ٱلْقَوْمَ ٱلْفَٰسِقِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Remember when Musa said to his people, 'My people, why do you mistreat me when you know that I am the Messenger of Allah to you?' So when they deviated, Allah made their hearts deviate. Allah does not guide people who are deviators.",
        "TRANSLATION_1": "When Moses said to his people: \"O my people, why do you afflict me though you know that I have been sent to you by God?\" But when they turned aside God made their hearts turn farther away; for God does not show the transgressors the way.\n",
        "TRANSLATION_2": "And call to mind when Moses said to his people: “O my people, why do you torment me when you know well that I am Allah's Messenger to you?” So when they deviated, Allah made their hearts deviant. Allah does not direct the evil-doers to the Right Way.\n",
        "TRANSLATION_3": "Moses said to his people, \"Why do you create difficulties for me when you know that I am God's Messenger to you?\" When they deviated (from the right path), God led their hearts astray. God does not guide the evil-doing people.\n",
        "TRANSLATION_4": "And remember when Moosa said to his people, “O my people! Why do you trouble me, whereas you know that I am Allah’s Noble Messenger towards you?” So when they deviated, Allah deviated their hearts; and Allah does not guide the sinning people.\n",
        "TRANSLATION_5": "And when Musa said to his people: \"O my people! Why do you annoy me while you know certainly that I am the Messenger of Allah to you So, when they turned away (from the path of Allah), Allah turned their hearts away (from the right path). And Allah guides not the people who are rebellious.\n",
        "TRANSLATION_6": "And when Musa said to his people: O my people! why do you give me trouble? And you know indeed that I am Allah's apostle to you; but when they turned aside, Allah made their hearts turn aside, and Allah does not guide the transgressing people.\n",
        "TRANSLATION_7": "And when Moses said to his people, 'O my people, why do you hurt me, though you know I am the Messenger of God to you?' When they swerved, God caused their hearts to swerve; and God. guides never the people of the ungodly.\n",
        "TRANSLATION_8": "And (remember) when Moses said unto his people: O my people! Why persecute ye me, when ye well know that I am Allah's messenger unto you? So when they went astray Allah sent their hearts astray. And Allah guideth not the evil-living folk.\n",
        "TRANSLATION_9": "Remember when Moses said to his people, \"O my people, why do you cause me grief when you know that I am God's Messenger to you?\" When they wavered, God let their hearts waver too. God does not guide transgressors.\n",
        "TRANSLATION_10": "And recall what time Musa said Unto his people: O my people! wherefore hurt ye me, When surely ye know that verily I am Allah's apostle Unto you! Then when they sweryed, Allah made their hearts swerve; and Allah guideth not a transgressing people.\n",
        "TRANSLATION_11": "When Moses said to his people, ‘O my people! Why do you torment me, when you certainly know that I am Allah’s apostle to you?’ So when they swerved [from the right path], Allah made their hearts swerve, and Allah does not guide the transgressing lot.\n",
        "TRANSLATION_12": "And remember, Moses said to his people: \"O my people! why do ye vex and insult me, though ye know that I am the messenger of Allah (sent) to you?\" Then when they went wrong, Allah let their hearts go wrong. For Allah guides not those who are rebellious transgressors.\n",
        "TRANSLATION_13": "And (remember) when Musa (Moses) said to his people: \"O my people! Why do you hurt me while you know certainly that I am the Messenger of Allah to you? So when they turned away (from the Path of Allah), Allah turned their hearts away (from the Right Path). And Allah guides not the people who are Fasiqun (rebellious, disobedient to Allah).\n",
        "TRANSLATION_14": "And when Moses, said to his nation: 'Why do you harm me, when you know that I am the Messenger of Allah sent to you' But when they swerved away Allah caused their hearts to swerve. Allah never guides impious people.\n",
        "TRANSLATION_15": "When Moses said to his people, “O my people, why do you hurt me, although you know that I am God’s Messenger to you?” And when they swerved, God swerved their hearts. God does not guide the sinful people.\n",
        "TRANSLATION_16": "And [mention, O Muhammad], when Moses said to his people, \"O my people, why do you harm me while you certainly know that I am the messenger of Allah to you?\" And when they deviated, Allah caused their hearts to deviate. And Allah does not guide the defiantly disobedient people.\n",
        "TRANSLATION_17": "[61:5] And, mention, when Moses said to his people, ‘O my people, why do you harm me — [for] they had said that he had a hernia in his testicles, which he did not have, and they denied him — when certainly (qad is for confirmation) you know that I am the messenger of God to you?’ (annī rasūlu’Llāhi ilaykum: this sentence is a circumstantial qualifier) and [when you know that] messengers ought to be respected. So when they deviated, when they swerved away from the truth by harming him, God caused their hearts to deviate: He turned them away from guidance, in accordance to what He had preordained since pre-eternity, and God does not guide the immoral folk, those who, in His knowledge, are disbelievers.\n",
        "TRANSLATION_18": "(And (remember)) Muhammad (when Moses said unto his people) to his hypocritical people: (0 my people! Why persecute ye me) why do you hurt me with the things you say about me. They used to accuse him of having swollen testicles, and his story has already been explained in Surah of the Clans, (when ye well know that I am Allah's messenger unto you? So when they went astray) when they deviated from the Truth and guidance (Allah sent their hearts astray) from the Truth and guidance; it is also said that this means: when they lied about Moses, Allah turned away their hearts from the declaration of Allah's divine Oneness; and it is also said that this means: when they deviated from the Truth and guidance, Allah increased the deviance of their hearts. (And Allah guideth not) to His religion (the evil-living folk) the disbelievers, those whom Allah knows in His preeternal knowledge that they will not believe.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "61:5",
            "8:24",
            "9:80",
            "5:67",
            "9:96",
            "7:79",
            "9:127",
            "4:61",
            "57:8",
            "10:84"
        ],
        "BIBLE": [
            "prophets:ii%20kings:5:26",
            "prophets:judges:2:17",
            "torah:deuteronomy:8:2",
            "prophets:i%20kings:18:37",
            "torah:genesis:38:16",
            "prophets:i%20samuel:12:20",
            "prophets:isaiah:44:20",
            "writings:daniel:9:11",
            "writings:psalms:95:10",
            "prophets:i%20samuel:20:12"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:1:13",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:2:5"
        ]
    }
}