{
    "VERSE": "61:6",
    "ARABIC": "وَإِذْ قَالَ عِيسَى ٱبْنُ مَرْيَمَ يَٰبَنِىٓ إِسْرَٰٓءِيلَ إِنِّى رَسُولُ ٱللَّهِ إِلَيْكُم مُّصَدِّقًا لِّمَا بَيْنَ يَدَىَّ مِنَ ٱلتَّوْرَىٰةِ وَمُبَشِّرًۢا بِرَسُولٍ يَأْتِى مِنۢ بَعْدِى ٱسْمُهُۥٓ أَحْمَدُ فَلَمَّا جَآءَهُم بِٱلْبَيِّنَٰتِ قَالُوا۟ هَٰذَا سِحْرٌ مُّبِينٌ",
    "ENGLISH": {
        "TRANSLATION_0": "And when 'Isa son of Maryam said, 'Tribe of Israel, I am the Messenger of Allah to you, confirming the Torah which came before me and giving you the good news of a Messenger after me whose name is Ahmad.' When he brought them the Clear Signs, they said, 'This is downright magic'",
        "TRANSLATION_1": "And when Jesus, son of Mary, said: \"O children of Israel, I am sent to you by God to confirm the Torah (sent) before me, and to give you good tidings of an apostle who will come after me, whose name is Ahmad (the praised one).\" Yet when he has come to them with clear proofs, they say: \"This is only magic.\"\n",
        "TRANSLATION_2": "And call to mind when Jesus, son of Mary, said: “O Children of Israel, I am Allah's Messenger to you, I verify the Torah which has come before me, and I give you the glad tiding of a Messenger who shall come after me, his name being Ahmad.” Yet when he came to them with Clear Signs they said: “This is sheer trickery.”\n",
        "TRANSLATION_3": "Jesus, son of Mary, said to the Israelites, \"I am the Messenger of God sent to you. I confirm the Torah which is in existence and give you the glad news of the coming of a Messenger who will come after me named Ahmad.\" When this Messenger came to them with all the proofs (to support his truthfulness), they said, \"He is simply a magician\".\n",
        "TRANSLATION_4": "And remember when Eisa the son of Maryam said, “O Descendants of Israel! Indeed I am Allah’s Noble Messenger towards you, confirming the Book Torah which was before me, and heralding glad tidings of the Noble Messenger who will come after me – his name is Ahmed (the Praised One)”; so when Ahmed came to them with clear proofs, they said, “This is an obvious magic.”\n",
        "TRANSLATION_5": "And (remember) when `Isa, son of Maryam, said: \"O Children of Israel! I am the Messenger of Allah unto you, confirming the Tawrah [which came] before me, and giving glad tidings of a Messenger to come after me, whose name shall be Ahmad. \"But when he came to them with clear proofs, they said: \"This is plain magic.\"\n",
        "TRANSLATION_6": "And when Isa son of Marium said: O children of Israel! surely I am the apostle of Allah to you, verifying that which is before me of the Taurat and giving the good news of an Apostle who will come after me, his name being Ahmad, but when he came to them with clear arguments they said: This is clear magic.\n",
        "TRANSLATION_7": "And when Jesus son of Mary said, 'Children of Israel, I am indeed the Messenger of God to you, confirming the Torah that is before me, and giving good tidings of a Messenger who shall come after me, whose name shall be Ahmad.' Then, when he brought them the clear signs, they said, 'This is a manifest sorcery.'\n",
        "TRANSLATION_8": "And when Jesus son of Mary said: O Children of Israel! Lo! I am the messenger of Allah unto you, confirming that which was (revealed) before me in the Torah, and bringing good tidings of a messenger who cometh after me, whose name is the Praised One. Yet when he hath come unto them with clear proofs, they say: This is mere magic.\n",
        "TRANSLATION_9": "Remember when Jesus, son of Mary, said, \"O Children of Israel, I am sent to you by God, confirming the Torah that came before me and bringing good news of a messenger to follow me, whose name will be Ahmad.\" Yet when he came to them with clear signs, they said, \"This is merely sorcery.\"\n",
        "TRANSLATION_10": "And recall what time Isa, son of Maryam, said: children of Israi'l! verily I am Allah's apostle Unto you, confirming the Taurat which was before me, and giving the glad tidings of an apostle who cometh after me: his name will be Ahmad. Then when he brought Unto them evidences, they said: this is magic manifest.\n",
        "TRANSLATION_11": "And when Jesus son of Mary said, ‘O Children of Israel! Indeed I am the apostle of Allah to you, to confirm what is before me of the Torah, and to give the good news of an apostle who will come after me, whose name is Ahmad.’ But when he brought them manifest proofs, they said, ‘This is plain magic.’\n",
        "TRANSLATION_12": "And remember, Jesus, the son of Mary, said: \"O Children of Israel! I am the messenger of Allah (sent) to you, confirming the Law (which came) before me, and giving Glad Tidings of a Messenger to come after me, whose name shall be Ahmad.\" But when he came to them with Clear Signs, they said, \"this is evident sorcery!\"\n",
        "TRANSLATION_13": "And (remember) when 'Iesa (Jesus), son of Maryam (Mary), said: \"O Children of Israel! I am the Messenger of Allah unto you confirming the Taurat [(Torah) which came] before me, and giving glad tidings of a Messenger to come after me, whose name shall be Ahmad. But when he (Ahmad i.e. Muhammad SAW) came to them with clear proofs, they said: \"This is plain magic.\"\n",
        "TRANSLATION_14": "And when (Prophet) Jesus, the son of Mary said: 'Children of Israel, I am sent to you by Allah to confirm the Torah that was before me, and to give news of a Messenger (Prophet Muhammad) who will come after me whose name shall be Ahmad' Yet when he came to them with clear proofs, they said: 'This is clearsorcery'\n",
        "TRANSLATION_15": "And when Jesus son of Mary said, “O Children of Israel, I am God’s Messenger to you, confirming what preceded me of the Torah, and announcing good news of a messenger who will come after me, whose name is Ahmad.” But when he showed them the miracles, they said, “This is obvious sorcery.”\n",
        "TRANSLATION_16": "And [mention] when Jesus, the son of Mary, said, \"O children of Israel, indeed I am the messenger of Allah to you confirming what came before me of the Torah and bringing good tidings of a messenger to come after me, whose name is Ahmad.\" But when he came to them with clear evidences, they said, \"This is obvious magic.\"\n",
        "TRANSLATION_17": "[61:6] And, mention, when Jesus son of Mary said, ‘O Children of Israel — he did not say ‘O my people’ [as did Moses] because he was not related to them in any way — I am indeed God’s messenger to you, confirming what is before me of the Torah and bringing good tidings of a messenger who will come after me, whose name is Ahmad.’ God, exalted be He, says: Yet when he brought them, [when] Ahmad brought the disbelievers, the clear signs, the revelations and the indications, they said, ‘This, namely, what has been brought, is manifest sorcery!’ (sihrun: a variant reading has sāhirun, ‘a sorcerer’, meaning the one who has brought them [is a manifest sorcerer]).\n",
        "TRANSLATION_18": "(And when Jesus son of Mary said: Children of Israel! Lo! I am the messenger of Allah unto you, confirming) the profession of Allah divine Oneness and some of the laws (that which was (revealed) before me in the Torah, and bringing good tidings) and I have come to you with the good tidings (of a messenger who cometh after me, whose name is the Praised One. Yet when he) i.e. Jesus and it is also said: Muhammad (pbuh) (hath come unto them with clear proofs) with commands, prohibitions and the marvels which he displayed to them, (they say: This is mere magic) this is evident magic and lies.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "61:6",
            "2:253",
            "49:1",
            "3:50",
            "8:24",
            "24:51",
            "58:12",
            "41:14",
            "3:86",
            "61:14"
        ],
        "BIBLE": [
            "torah:deuteronomy:31:23",
            "torah:numbers:20:12",
            "torah:deuteronomy:3:18",
            "writings:i%20chronicles:19:2",
            "torah:genesis:38:18",
            "torah:genesis:48:9",
            "torah:exodus:3:13",
            "writings:ii%20chronicles:7:3",
            "writings:ii%20chronicles:35:21",
            "torah:numbers:18:24"
        ]
    }
}