{
    "VERSE": "61:7",
    "ARABIC": "وَمَنْ أَظْلَمُ مِمَّنِ ٱفْتَرَىٰ عَلَى ٱللَّهِ ٱلْكَذِبَ وَهُوَ يُدْعَىٰٓ إِلَى ٱلْإِسْلَٰمِ وَٱللَّهُ لَا يَهْدِى ٱلْقَوْمَ ٱلظَّٰلِمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Who could do greater wrong than someone who invents a lie against Allah when he has been called to Islam? Allah does not guide wrongdoing people.",
        "TRANSLATION_1": "Who is more unjust than he who invents a lie against God when he is called to submit? God does not show the evil-doers the way.\n",
        "TRANSLATION_2": "Who would be more unjust than he who invents a lie about Allah the while he is being called to Islam? Allah does not direct such evildoing folk to the Right Way.\n",
        "TRANSLATION_3": "Who is more unjust than one who creates falsehood against God when he has already been invited to Islam? God does not guide the unjust people.\n",
        "TRANSLATION_4": "And who is more unjust than one who fabricates a lie against Allah whereas he is being called towards Islam? And Allah does not guide the unjust people.\n",
        "TRANSLATION_5": "And who does more wrong than the one who invents a lie against Allah, while he is being invited to Islam And Allah guides not the people who are wrongdoers.\n",
        "TRANSLATION_6": "And who is more unjust than he who forges a lie against Allah and he is invited to Islam, and Allah does not guide the unjust people.\n",
        "TRANSLATION_7": "And who does greater evil than he who forges against God falsehood, when he is being called unto surrender? And God guides never the people of the evildoers.\n",
        "TRANSLATION_8": "And who doeth greater wrong than he who inventeth a lie against Allah when he is summoned unto Al-Islam? And Allah guideth not wrongdoing folk.\n",
        "TRANSLATION_9": "Who could be more wicked than one who invents lies about God when called to submit to Him? God does not guide the wrongdoers:\n",
        "TRANSLATION_10": "And who is a greater wrong-doer than he who fabricateth against Allah a lie even as he is summoned Unto Islam? And Allah guideth not a wrongdoing people.\n",
        "TRANSLATION_11": "Who is a greater wrongdoer than him who fabricates falsehoods against Allah, while he is being summoned to Islam? And Allah does not guide the wrongdoing lot.\n",
        "TRANSLATION_12": "Who doth greater wrong than one who invents falsehood against Allah, even as he is being invited to Islam? And Allah guides not those who do wrong.\n",
        "TRANSLATION_13": "And who does more wrong than the one who invents a lie against Allah, while he is being invited to Islam? And Allah guides not the people who are Zalimun (polytheists, wrong-doers and disbelievers) folk.\n",
        "TRANSLATION_14": "And who does greater evil than he who forges a lie against Allah, when he is being called to Islam? Allah does not guide the harmdoing people.\n",
        "TRANSLATION_15": "And who is a greater wrongdoer than he who attributes falsehoods to God, when he is being invited to Islam? God does not guide the wrongdoing people.\n",
        "TRANSLATION_16": "And who is more unjust than one who invents about Allah untruth while he is being invited to Islam. And Allah does not guide the wrongdoing people.\n",
        "TRANSLATION_17": "[61:7] And who does — that is to say, none does — greater wrong than he who invents lies against God, by ascribing a partner and a child to Him and describing His signs as being sorcery, when he is [actually] being summoned to submission [to God]? And God does not guide the wrongdoing folk, the disbelieving [folk].\n",
        "TRANSLATION_18": "(And who doth greater wrong) in his state of disbelief (than he who inventeth a lie against Allah) by ascribing to Him sons and partners (when he is summoned unto al-Islam) when he is summoned to believe in Allah's divine Oneness. The reference here is to the Jews whom the Prophet (pbuh) invited to embrace the profession of Allah's divine Oneness. (And Allah guideth not wrong-doing folk) He guides not to His religion those Jews whom He knew in His preeternal knowledge that they will die as Jews.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "61:7",
            "58:14",
            "6:21",
            "10:17",
            "10:69",
            "29:68",
            "18:15",
            "5:84",
            "11:18",
            "4:50"
        ],
        "BIBLE": [
            "prophets:isaiah:35:8",
            "writings:daniel:9:19",
            "writings:ii%20chronicles:7:14",
            "writings:esther:4:11",
            "prophets:amos:7:4",
            "prophets:zechariah:8:3",
            "torah:numbers:25:2",
            "prophets:i%20samuel:29:6",
            "prophets:isaiah:66:4",
            "prophets:malachi:1:4"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:13",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:2:2"
        ]
    }
}