{
    "VERSE": "61:8",
    "ARABIC": "يُرِيدُونَ لِيُطْفِـُٔوا۟ نُورَ ٱللَّهِ بِأَفْوَٰهِهِمْ وَٱللَّهُ مُتِمُّ نُورِهِۦ وَلَوْ كَرِهَ ٱلْكَٰفِرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "They desire to extinguish Allah's Light with their mouths but Allah will perfect His Light, though the kafirun hate it.",
        "TRANSLATION_1": "They want to extinguish the light of God by uttering blasphemies. But God wills to perfect His light, however the unbelievers may dislike it.\n",
        "TRANSLATION_2": "They seek to extinguish Allah's light (by blowing) with their mouths, but Allah shall spread His light in all its fullness, howsoever the unbelievers may abhor this.\n",
        "TRANSLATION_3": "They want to put out the light of God with their mouths, but God will certainly make His light shine forever - even though the disbelievers may dislike this.\n",
        "TRANSLATION_4": "They wish to put out Allah’s light with their mouths, whereas Allah will perfect His light even if the disbelievers get annoyed.\n",
        "TRANSLATION_5": "They intend to put out the Light of Allah with their mouths. But Allah will bring His Light to perfection even though the disbelievers hate (it).\n",
        "TRANSLATION_6": "They desire to put out the light of Allah with their mouths but Allah will perfect His light, though the unbelievers may be averse.\n",
        "TRANSLATION_7": "They desire to extinguish with their mouths, the light of God; but God will perfect His light, though the unbelievers be averse.\n",
        "TRANSLATION_8": "Fain would they put out the light of Allah with their mouths, but Allah will perfect His light however much the disbelievers are averse.\n",
        "TRANSLATION_9": "they wish to put His light out with their mouths. But He will perfect His light, much as those who deny the truth may dislike it;\n",
        "TRANSLATION_10": "Fain would they extinguish the light of Allah is with their mouths and Allah is going to perfect His light, even though averse may be the infidels.\n",
        "TRANSLATION_11": "They desire to put out the light of Allah with their mouths, but Allah will perfect His light though the faithless should be averse.\n",
        "TRANSLATION_12": "Their intention is to extinguish Allah's Light (by blowing) with their mouths: But Allah will complete (the revelation of) His Light, even though the Unbelievers may detest (it).\n",
        "TRANSLATION_13": "They intend to put out the Light of Allah (i.e. the religion of Islam, this Quran, and Prophet Muhammad SAW) with their mouths. But Allah will complete His Light even though the disbelievers hate (it).\n",
        "TRANSLATION_14": "They seek to extinguish the Light of Allah with their mouths; but Allah will complete His Light, much as the unbelievers dislike it.\n",
        "TRANSLATION_15": "They want to extinguish God’s Light with their mouths; but God will complete His Light, even though the disbelievers dislike it.\n",
        "TRANSLATION_16": "They want to extinguish the light of Allah with their mouths, but Allah will perfect His light, although the disbelievers dislike it.\n",
        "TRANSLATION_17": "[61:8] They desire to extinguish (li-yutfi’ū is in the subjunctive form because of an implicit an [sc. an yutfi’ū], the lām being extra) the light of God, His Law and His proofs, with their mouths, with their sayings, that this is sorcery, or poetry or soothsaying; but God will perfect, He will manifest, His light (mutimmun nūrahu: some have read this in the form of a genitive annextation, mutimmu nūrihi) though the disbelievers be averse, to this.\n",
        "TRANSLATION_18": "(Fain would they) i.e. the Jews and Christians (put out the light of Allah) to abort the religion of Allah; and it is said this means: to abort the Book of Allah: the Qur'an, (with their mouths) with their tongues and lies, (but Allah will perfect His light) but Allah will manifest His religion and Book (however much the disbelievers are averse) even though the Jews, Christians and pagan Arabs dislike its happening.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "61:8",
            "9:32",
            "104:6",
            "64:8",
            "14:30",
            "3:141",
            "8:30",
            "2:257",
            "41:19",
            "8:33"
        ],
        "BIBLE": [
            "prophets:ezekiel:32:7",
            "torah:exodus:23:13",
            "writings:psalms:37:6",
            "prophets:ezekiel:32:8",
            "torah:exodus:25:37",
            "prophets:isaiah:55:11",
            "prophets:ii%20samuel:23:5",
            "prophets:isaiah:42:16",
            "torah:deuteronomy:13:15",
            "writings:psalms:89:2"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:4:11",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:7"
        ]
    }
}