{
    "VERSE": "61:9",
    "ARABIC": "هُوَ ٱلَّذِىٓ أَرْسَلَ رَسُولَهُۥ بِٱلْهُدَىٰ وَدِينِ ٱلْحَقِّ لِيُظْهِرَهُۥ عَلَى ٱلدِّينِ كُلِّهِۦ وَلَوْ كَرِهَ ٱلْمُشْرِكُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "It is He who sent His Messenger with guidance and the Deen of Truth to exalt it over every other deen, though the idolaters hate it.",
        "TRANSLATION_1": "It is He who sent His Apostle with the guidance and the true way to raise it above all faiths, however the idolaters may dislike it.\n",
        "TRANSLATION_2": "He it is Who has sent forth the Messenger with the Guidance and the True Religion that He may make it prevail over all religion, however those that associate aught with Allah in His Divinity might dislike this.\n",
        "TRANSLATION_3": "It is He who has sent His Messenger with guidance and the true religion to stand supreme over all religions, even though the pagans may dislike it.\n",
        "TRANSLATION_4": "It is He Who has sent His Noble Messenger with guidance and the religion of truth, in order that He may make it prevail over all other religions, even if the polytheists get annoyed.\n",
        "TRANSLATION_5": "He it is Who has sent His Messenger with guidance and the religion of truth to make it victorious over all religions even though idolators hate (it).\n",
        "TRANSLATION_6": "He it is Who sent His Apostle with the guidance and the true religion, that He may make it overcome the religions, all of them, though the polytheists may be averse.\n",
        "TRANSLATION_7": "It is He who has sent His Messenger with the guidance and the religion of truth, that he may uplift it above every religion, though the unbelievers be averse.\n",
        "TRANSLATION_8": "He it is Who hath sent His messenger with the guidance and the religion of truth, that He may make it conqueror of all religion however much idolaters may be averse.\n",
        "TRANSLATION_9": "it is He who has sent His Messenger with guidance and the true religion, so that He may cause it to prevail over all religions, however much the polytheists may dislike it.\n",
        "TRANSLATION_10": "He it is Who hath sent His apostle with the guidance and the true religion, that He may make it triumph over all religion, even though averse may be associaters.\n",
        "TRANSLATION_11": "It is He who has sent His Apostle with guidance and the true religion that He may make it prevail over all religions though the polytheists should be averse.\n",
        "TRANSLATION_12": "It is He Who has sent His Messenger with Guidance and the Religion of Truth, that he may proclaim it over all religion, even though the Pagans may detest (it).\n",
        "TRANSLATION_13": "He it is Who has sent His Messenger (Muhammad SAW) with guidance and the religion of truth (Islamic Monotheism) to make it victorious over all (other) religions even though the Mushrikun (polytheists, pagans, idolaters, and disbelievers in the Oneness of Allah and in His Messenger Muhammed SAW) hate (it).\n",
        "TRANSLATION_14": "It is He who has sent His Messenger with guidance and the Religion of Truth, so that He raises it above all religions, much as the unbelievers dislike it.\n",
        "TRANSLATION_15": "It is He who sent His Messenger with the guidance and the true religion, to make it prevail over all religions, even though the idolaters dislike it.\n",
        "TRANSLATION_16": "It is He who sent His Messenger with guidance and the religion of truth to manifest it over all religion, although those who associate others with Allah dislike it.\n",
        "TRANSLATION_17": "[61:9] It is He Who has sent His Messenger with the guidance and the religion of truth, that He may make it prevail, that He may raise it, over all [other] religions, [over] all the religions which oppose it, though the disbelievers be averse, to this.\n",
        "TRANSLATION_18": "(He it is Who hath sent His messenger) Muhammad (pbuh) (with the guidance) with the message of Allah's divine Oneness; and it is also said this means: with the Qur'an (and the religion of truth) the testification that there is no deity except Allah, (that He may make it conqueror of all religion) such that the Hour will not come except that people are either among the Muslims or among those who pay the capitation tax to the 665 Muslims (however much idolaters may be averse) even though the Jews, Christians and Pagan Arabs dislike its happening.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "61:9",
            "9:33",
            "48:28",
            "10:103",
            "16:102",
            "11:120",
            "9:29",
            "9:62",
            "10:82",
            "40:5"
        ],
        "BIBLE": [
            "prophets:isaiah:49:11",
            "writings:ezra:8:21",
            "writings:ii%20chronicles:33:14",
            "prophets:malachi:3:1",
            "prophets:jeremiah:23:5",
            "writings:psalms:41:11",
            "prophets:jeremiah:25:32",
            "prophets:i%20kings:9:21",
            "prophets:amos:2:11",
            "prophets:i%20samuel:2:35"
        ]
    }
}