{
    "VERSE": "86:17",
    "ARABIC": "فَمَهِّلِ ٱلْكَٰفِرِينَ أَمْهِلْهُمْ رُوَيْدًۢا",
    "ENGLISH": {
        "TRANSLATION_0": "So bear with the kafirun - bear with them for a while.",
        "TRANSLATION_1": "So bear with unbelievers with patience, and give them respite for a while.\n",
        "TRANSLATION_2": "So leave the unbelievers to themselves; respite them awhile.\n",
        "TRANSLATION_3": "Give respite to the disbelievers and leave them alone for a while.\n",
        "TRANSLATION_4": "Therefore give them some respite – give them some time.\n",
        "TRANSLATION_5": "So, give a respite to the disbelievers; deal gently with them for a while.\n",
        "TRANSLATION_6": "So grant the unbelievers a respite: let them alone for a while.\n",
        "TRANSLATION_7": "So respite the unbelievers; delay with them awhile.\n",
        "TRANSLATION_8": "So give a respite to the disbelievers. Deal thou gently with them for a while.\n",
        "TRANSLATION_9": "so bear with those who deny the truth, and let them be for a little while.\n",
        "TRANSLATION_10": "So respite thou the infidels - respite them gently,\n",
        "TRANSLATION_11": "So respite the faithless; give them a gentle respite.\n",
        "TRANSLATION_12": "Therefore grant a delay to the Unbelievers: Give respite to them gently (for awhile).\n",
        "TRANSLATION_13": "So give a respite to the disbelievers. Deal you gently with them for a while.\n",
        "TRANSLATION_14": "Therefore respite the unbelievers, and delay them for a while.\n",
        "TRANSLATION_15": "Therefore, give the blasphemers respite, a brief respite.\n",
        "TRANSLATION_16": "So allow time for the disbelievers. Leave them awhile.\n",
        "TRANSLATION_17": "[86:17] So respite, O Muhammad (s), the disbelievers; grant them respite ([reiterated as] an emphasis, one enhanced by the use of a different form [mahhil, amhil]), that is to say, put them off, for a little (ruwaydā is a verbal noun emphasising the import of the operator, and is the diminutive form of rūd or irwad, with shortening of final consonant [ruwaydan, ruwaydā]). Surely enough God, exalted be He, seized them at Badr and abrogated [the dispensation of] ‘granting respite’ by the ‘sword’ verse, in other words, by the command to fight and struggle.\n",
        "TRANSLATION_18": "(So give a respite to the disbelievers. Deal thou gently with them for a while) give them a while until the Day of Badr'. And of the surah in which the Most High is mentioned, which is all Meccan and consists of 19 verses, 72 words and 284 letter: Surah 87: The Most High (al-A'la) And of the surah in which the Most High is mentioned, which is all Meccan and consists of 19 verses, 72 words and 284 letter:\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "86:17",
            "26:60",
            "68:21",
            "26:46",
            "37:116",
            "7:78",
            "30:15",
            "26:157",
            "23:48",
            "26:94"
        ],
        "BIBLE": [
            "prophets:malachi:2:15",
            "writings:psalms:60:6",
            "prophets:ezekiel:16:52",
            "writings:nehemiah:12:40",
            "torah:deuteronomy:26:11",
            "torah:leviticus:19:24",
            "prophets:i%20samuel:22:8",
            "writings:i%20chronicles:2:35",
            "prophets:ezekiel:18:13",
            "torah:numbers:3:9"
        ]
    }
}