{
    "VERSE": "86:2",
    "ARABIC": "وَمَآ أَدْرَىٰكَ مَا ٱلطَّارِقُ",
    "ENGLISH": {
        "TRANSLATION_0": "And what will convey to you what the Night-Comer is?",
        "TRANSLATION_1": "How will you comprehend what the night star is?\n",
        "TRANSLATION_2": "what do you know what the night-visitor is?\n",
        "TRANSLATION_3": "Do you know what al-tariq is?\n",
        "TRANSLATION_4": "And have you understood what the nightly arriver is?\n",
        "TRANSLATION_5": "And what will make you to know what At-Tariq is\n",
        "TRANSLATION_6": "And what will make you know what the comer by night is?\n",
        "TRANSLATION_7": "And what shall teach thee what is the night-star?\n",
        "TRANSLATION_8": "- Ah, what will tell thee what the Morning Star is!\n",
        "TRANSLATION_9": "and what could make you know what it is that comes in the night?\n",
        "TRANSLATION_10": "And what shall make thee know that which the night-comer is?-\n",
        "TRANSLATION_11": "(and what will show you what is the nightly visitor?\n",
        "TRANSLATION_12": "And what will explain to thee what the Night-Visitant is?-\n",
        "TRANSLATION_13": "And what will make you to know what At-Tariq (night-comer) is?\n",
        "TRANSLATION_14": "What could let you know what the nightly comer is!\n",
        "TRANSLATION_15": "But what will let you know what at-Tariq is?\n",
        "TRANSLATION_16": "And what can make you know what is the night comer?\n",
        "TRANSLATION_17": "[86:2] And what will tell you what the night-visitor is? (mā’l-tāriq is a subject and predicate, standing as the second object of [the verb] adrā, ‘tell’; and what comes after the first mā, ‘what’, is the predicate thereof [of this first mā]) — this [statement] emphasises the magnificence of the ‘night-visitor’, which is explained in what follows. It is:\n",
        "TRANSLATION_18": "(Ah, what will tell thee) Muhammad (what the Morning Star is!) this is to arouse his astonishment.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "86:2",
            "69:3",
            "104:5",
            "101:10",
            "53:53",
            "7:120",
            "101:3",
            "90:12",
            "74:27",
            "26:219"
        ],
        "BIBLE": [
            "torah:genesis:31:44",
            "writings:job:10:2",
            "prophets:isaiah:5:19",
            "torah:exodus:35:10",
            "prophets:i%20samuel:28:2",
            "writings:daniel:5:8",
            "writings:daniel:4:4",
            "writings:psalms:25:14",
            "writings:daniel:8:19",
            "prophets:i%20samuel:16:3"
        ]
    }
}