{
    "VERSE": "78:18",
    "ARABIC": "يَوْمَ يُنفَخُ فِى ٱلصُّورِ فَتَأْتُونَ أَفْوَاجًا",
    "ENGLISH": {
        "TRANSLATION_0": "the Day the Trumpet is blown and you come in droves,",
        "TRANSLATION_1": "The day the trumpet blast is sounded you will come in hordes;\n",
        "TRANSLATION_2": "the Day when the Trumpet shall be blown, and you will come forth in multitudes;\n",
        "TRANSLATION_3": "On that day the trumpet will be sounded and you will come (to Us) in huge groups.\n",
        "TRANSLATION_4": "The day when the Trumpet will be blown – you will therefore come forth in multitudes.\n",
        "TRANSLATION_5": "The Day when the Trumpet will be blown, and you shall come forth in crowds.\n",
        "TRANSLATION_6": "The day on which the trumpet shall be blown so you shall come forth in hosts,\n",
        "TRANSLATION_7": "the day the Trumpet is blown, and you shall come in troops,\n",
        "TRANSLATION_8": "A day when the trumpet is blown and ye come in multitudes,\n",
        "TRANSLATION_9": "On that Day when the trumpet shall be sounded, you shall come in droves,\n",
        "TRANSLATION_10": "It is a Day whereon the trumpet will be blown, and ye will come in multitudes.\n",
        "TRANSLATION_11": "the day the Trumpet will be blown, and you will come in groups,\n",
        "TRANSLATION_12": "The Day that the Trumpet shall be sounded, and ye shall come forth in crowds;\n",
        "TRANSLATION_13": "The Day when the Trumpet will be blown, and you shall come forth in crowds (groups);\n",
        "TRANSLATION_14": "the Day that the Horn is blown, and you shall come in crowds\n",
        "TRANSLATION_15": "The Day when the Trumpet is blown, and you will come in droves.\n",
        "TRANSLATION_16": "The Day the Horn is blown and you will come forth in multitudes\n",
        "TRANSLATION_17": "[78:18] the day the Trumpet, the Horn, is blown (yawma yunfakhu fī’l-sūri is either a substitution for, or an explication of, yawma’l-fasli, ‘the Day of Decision’, the blower being Isrāfīl) and you come, forth from your graves to the site [of the Resurrection], in droves, in diverse groups,\n",
        "TRANSLATION_18": "(A day when the trumpet is blown) the blowing of the resurrection, (and ye come in multitudes) host after 723 host and group after group,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "78:18",
            "50:20",
            "20:102",
            "36:59",
            "28:65",
            "36:64",
            "51:13",
            "38:53",
            "79:6",
            "54:48"
        ],
        "BIBLE": [
            "prophets:isaiah:27:13",
            "prophets:ezekiel:7:14",
            "prophets:joshua:6:4",
            "prophets:jeremiah:50:31",
            "torah:numbers:10:7",
            "torah:numbers:29:1",
            "prophets:amos:3:6",
            "prophets:zechariah:9:14",
            "prophets:zechariah:14:21",
            "prophets:ezekiel:33:3"
        ]
    }
}