{
    "VERSE": "78:20",
    "ARABIC": "وَسُيِّرَتِ ٱلْجِبَالُ فَكَانَتْ سَرَابًا",
    "ENGLISH": {
        "TRANSLATION_0": "and the mountains are shifted and become a mirage.",
        "TRANSLATION_1": "The mountains put in motion turning into a mirage.\n",
        "TRANSLATION_2": "and the mountains will be set in motion and become a mirage.\n",
        "TRANSLATION_3": "The mountains will be driven away and become like mirages.\n",
        "TRANSLATION_4": "And the mountains will be moved – they will therefore become like mirages.\n",
        "TRANSLATION_5": "And the mountains shall be moved away from their places and they will be as if they were a mirage.\n",
        "TRANSLATION_6": "And the mountains shall be moved off so that they shall remain a mere semblance.\n",
        "TRANSLATION_7": "and the mountains are set in motion, and become a vapour.\n",
        "TRANSLATION_8": "And the hills are set in motion and become as a mirage.\n",
        "TRANSLATION_9": "and the mountains shall be made to vanish, as if they had been a mirage.\n",
        "TRANSLATION_10": "And the mountains will have been removed away, and they will have become as mirage.\n",
        "TRANSLATION_11": "and the mountains will be set moving and become a mirage.\n",
        "TRANSLATION_12": "And the mountains shall vanish, as if they were a mirage.\n",
        "TRANSLATION_13": "And the mountains shall be moved away from their places and they will be as if they were a mirage.\n",
        "TRANSLATION_14": "and the mountains move, and vaporize.\n",
        "TRANSLATION_15": "And the mountains are set in motion, and become a mirage.\n",
        "TRANSLATION_16": "And the mountains are removed and will be [but] a mirage.\n",
        "TRANSLATION_17": "[78:20]   and the mountains are set in motion, dislocated from their positions, and become as a mirage, as fine dust, that is to say, like it in terms of its levity when in motion.\n",
        "TRANSLATION_18": "(And the hills are set in motion) on the face of the earth (and become as a mirage.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "78:20",
            "81:3",
            "79:32",
            "77:10",
            "52:10",
            "56:5",
            "70:9",
            "78:7",
            "20:105",
            "15:82"
        ],
        "BIBLE": [
            "prophets:jeremiah:29:14",
            "torah:numbers:2:17",
            "prophets:isaiah:6:12",
            "prophets:ezekiel:7:22",
            "writings:nehemiah:13:11",
            "prophets:jeremiah:8:3",
            "prophets:zechariah:5:11",
            "torah:deuteronomy:30:1",
            "prophets:ii%20samuel:6:17",
            "writings:ii%20chronicles:6:26"
        ]
    }
}