{
    "VERSE": "78:30",
    "ARABIC": "فَذُوقُوا۟ فَلَن نَّزِيدَكُمْ إِلَّا عَذَابًا",
    "ENGLISH": {
        "TRANSLATION_0": "So taste! We will increase you only in punishment.",
        "TRANSLATION_1": "So taste (the fruit of what you sowed), for We shall add nothing but torment,\n",
        "TRANSLATION_2": "So taste (the fruit of your deeds). We shall only increase your torment.\n",
        "TRANSLATION_3": "(They will be told), \"Suffer, We shall only increase the torment for you\".\n",
        "TRANSLATION_4": "Therefore taste it now – We shall not increase anything for you except the punishment.\n",
        "TRANSLATION_5": "So taste you. No increase shall We give you, except in torment.\n",
        "TRANSLATION_6": "So taste! for We will not add to you aught but chastisement.\n",
        "TRANSLATION_7": "Taste! We shall increase you not save in chastisement.'\n",
        "TRANSLATION_8": "So taste (of that which ye have earned). No increase do We give you save of torment.\n",
        "TRANSLATION_9": "[So We shall say], \"Taste, then, [the fruit of your evil doings,] for now We shall bestow on you nothing but more and more suffering!\"\n",
        "TRANSLATION_10": "Taste therefore. We shall not increase you in aught but torment.\n",
        "TRANSLATION_11": "So [now] taste! We shall increase you in nothing but punishment!\n",
        "TRANSLATION_12": "So taste ye (the fruits of your deeds); for no increase shall We grant you, except in Punishment.\"\n",
        "TRANSLATION_13": "So taste you (the results of your evil actions); no increase shall We give you, except in torment.\n",
        "TRANSLATION_14": "Taste! We shall not increase you except in punishment'\n",
        "TRANSLATION_15": "So taste! We will increase you only in suffering.\n",
        "TRANSLATION_16": "So taste [the penalty], and never will We increase you except in torment.\"\n",
        "TRANSLATION_17": "[78:30] ‘So [now] taste! — in other words, it will be said to them in the Hereafter, when the chastisement has befallen them: taste [now] your requital! For We will increase you in nothing but chastisement’, in addition to your [due] chastisement.\n",
        "TRANSLATION_18": "(So taste) the chastisement in the Fire. (No increase do We give you) in the Fire (save of torment) one kind 724 of torment after another.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "78:30",
            "54:39",
            "89:25",
            "43:50",
            "16:85",
            "70:1",
            "84:24",
            "37:9",
            "37:33",
            "39:40"
        ],
        "BIBLE": [
            "prophets:jonah:1:11",
            "torah:leviticus:25:20",
            "prophets:joshua:22:28",
            "torah:genesis:3:3",
            "prophets:joshua:22:27",
            "writings:proverbs:19:19",
            "prophets:ezekiel:18:13",
            "writings:psalms:115:14",
            "torah:exodus:16:8",
            "torah:numbers:18:30"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:5:1"
        ]
    }
}