{
    "VERSE": "78:35",
    "ARABIC": "لَّا يَسْمَعُونَ فِيهَا لَغْوًا وَلَا كِذَّٰبًا",
    "ENGLISH": {
        "TRANSLATION_0": "where they will hear no prattle and no denial,",
        "TRANSLATION_1": "They will hear no blasphemies there or disavowals:\n",
        "TRANSLATION_2": "Therein they shall hear no idle talk, nor any falsehood;\n",
        "TRANSLATION_3": "They will not hear therein any unnecessary words or lies.\n",
        "TRANSLATION_4": "In which they shall neither hear lewd talk, nor any lie.\n",
        "TRANSLATION_5": "No Laghw shall they hear therein, nor lying;\n",
        "TRANSLATION_6": "They shall not hear therein any vain words nor lying.\n",
        "TRANSLATION_7": "Therein they shall hear no idle talk, no cry of lies,\n",
        "TRANSLATION_8": "There hear they never vain discourse, nor lying -\n",
        "TRANSLATION_9": "There they shall not hear any idle talk, or any untruth:\n",
        "TRANSLATION_10": "They will hear therein no babble nor falsehood:\n",
        "TRANSLATION_11": "Therein they shall hear neither vain talk nor lies\n",
        "TRANSLATION_12": "No vanity shall they hear therein, nor Untruth:-\n",
        "TRANSLATION_13": "No Laghw (dirty, false, evil talk) shall they hear therein, nor lying;\n",
        "TRANSLATION_14": "There, they shall neither hear idle talk, nor yet any falsehood,\n",
        "TRANSLATION_15": "They will hear therein neither gossip, nor lies.\n",
        "TRANSLATION_16": "No ill speech will they hear therein or any falsehood -\n",
        "TRANSLATION_17": "[78:35] They will not hear in it, that is, [in] Paradise, when they drink wine and in other situations, any vain talk, any words of falsehood, or lies, between one another (read kidhāban, to mean kadhiban, ‘lies’, or kidhdhāban to mean takdhīban, ‘lying’), in contrast to what happens in this world when wine is drunk,\n",
        "TRANSLATION_18": "(There) in Paradise (hear they) the inhabitants of the Garden (never vain discourse) oaths or falsehood, (nor lying) they do not lie to each other.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "78:35",
            "56:25",
            "52:23",
            "37:47",
            "23:3",
            "43:75",
            "87:13",
            "56:19",
            "88:11",
            "25:76"
        ],
        "BIBLE": [
            "writings:psalms:19:4",
            "writings:job:33:1",
            "writings:ecclesiastes:7:21",
            "writings:job:36:4",
            "prophets:jeremiah:7:8",
            "writings:job:32:14",
            "prophets:ezekiel:2:7",
            "prophets:isaiah:37:6",
            "prophets:ii%20kings:19:6",
            "torah:exodus:5:9"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:1:10",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:12"
        ]
    }
}