{
    "VERSE": "78:39",
    "ARABIC": "ذَٰلِكَ ٱلْيَوْمُ ٱلْحَقُّ فَمَن شَآءَ ٱتَّخَذَ إِلَىٰ رَبِّهِۦ مَـَٔابًا",
    "ENGLISH": {
        "TRANSLATION_0": "That will be the True Day. So whoever wills should take the way back to his Lord.",
        "TRANSLATION_1": "That day is certain. So whosoever likes may prepare a way to his Lord.\n",
        "TRANSLATION_2": "That Day is sure to come. So let him who will seek a resort with his Lord.\n",
        "TRANSLATION_3": "That will be the Day of the Truth. So let those who want seek refuge from their Lord.\n",
        "TRANSLATION_4": "That is the True Day; therefore whoever wills may take the path towards his Lord.\n",
        "TRANSLATION_5": "That is the True Day. So, whosoever wills, let him seek a place with His Lord!\n",
        "TRANSLATION_6": "That is the sure day, so whoever desires may take refuge with his Lord.\n",
        "TRANSLATION_7": "That is the true day; so whosoever wills takes unto his Lord a resort.\n",
        "TRANSLATION_8": "That is the True Day. So whoso will should seek recourse unto his Lord.\n",
        "TRANSLATION_9": "That Day is sure to come, so whoever wishes to, let him take the path that leads towards his Lord.\n",
        "TRANSLATION_10": "That is the Sure Day. Whosoever therefore willeth, let him betake Unto his Lord a resort.\n",
        "TRANSLATION_11": "That day is true for certain. So let anyone who wishes take resort with his Lord.\n",
        "TRANSLATION_12": "That Day will be the sure Reality: Therefore, whoso will, let him take a (straight) return to his Lord!\n",
        "TRANSLATION_13": "That is without doubt the True Day, so, whosoever wills, let him seek a place with (or a way to) His Lord (by obeying Him in this worldly life)!\n",
        "TRANSLATION_14": "That is the Day, the truth, so whosoever wills takes a way to his Lord.\n",
        "TRANSLATION_15": "That is the Day of Reality. So whoever wills, let him take a way back to his Lord.\n",
        "TRANSLATION_16": "That is the True Day; so he who wills may take to his Lord a [way of] return.\n",
        "TRANSLATION_17": "[78:39] That is the True Day, whose coming to pass is definite, namely, the Day of Resurrection. So whoever wishes [to], let him seek resort with his Lord, a return [to Him], that is to say, [let him] return to God by being obedient to Him, so that he may be secure from chastisement in it.\n",
        "TRANSLATION_18": "(That is the True Day) in which will happen what I have mentioned. (So whoso will should seek recourse) whoever will believe in Allah's divine Oneness and seek through his belief in Allah's divine Oneness a way of return (unto his Lord.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "78:39",
            "38:79",
            "15:36",
            "3:60",
            "2:147",
            "46:34",
            "50:42",
            "28:21",
            "13:19",
            "44:22"
        ],
        "BIBLE": [
            "prophets:i%20kings:15:14",
            "writings:ii%20chronicles:17:6",
            "writings:psalms:71:1",
            "prophets:i%20samuel:21:7",
            "writings:ii%20chronicles:15:17",
            "torah:genesis:12:19",
            "writings:psalms:31:2",
            "prophets:jeremiah:19:6",
            "writings:lamentations:3:40",
            "writings:psalms:119:9"
        ]
    }
}