{
    "VERSE": "6:1",
    "ARABIC": "بِسْمِ ٱللَّهِ ٱلرَّحْمَٰنِ ٱلرَّحِيمِ ٱلْحَمْدُ لِلَّهِ ٱلَّذِى خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلْأَرْضَ وَجَعَلَ ٱلظُّلُمَٰتِ وَٱلنُّورَ ثُمَّ ٱلَّذِينَ كَفَرُوا۟ بِرَبِّهِمْ يَعْدِلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Praise belongs to Allah who created the heavens and the earth and appointed darkness and light. Then those who are kafir make others equal to their Lord!",
        "TRANSLATION_1": "ALL PRAISE BE to God who created the heavens and the earth, and ordained darkness and light. Yet the unbelievers make the others equal of their Lord.\n",
        "TRANSLATION_2": "All praise is for Allah alone, Who created the heavens and the earth, and brought into being light and darkness, and yet those who have rejected the call of the Truth ascribe others to be equals to their Lord.\n",
        "TRANSLATION_3": "Only God Who has created the heavens, the earth, darkness, and light deserves all praise. The disbelievers consider other things equal to Him.\n",
        "TRANSLATION_4": "All praise is to Allah, Who has created the heavens and the earth, and has created darkness and light; yet the disbelievers appoint equals (false deities) to their Lord!\n",
        "TRANSLATION_5": "All praise be to Allah, Who created the heavens and the earth, and originated the darkness and the light, yet those who disbelieve hold others as equal with their Lord.\n",
        "TRANSLATION_6": "All praise is due to Allah, Who created the heavens and the earth and made the darkness and the light; yet those who disbelieve set up equals with their Lord.\n",
        "TRANSLATION_7": "Praise belongs to God who created the heavens and the earth and appointed the shadows and light; then the unbelievers ascribe equals to their Lord.\n",
        "TRANSLATION_8": "Praise be to Allah, Who hath created the heavens and the earth, and hath appointed darkness and light. Yet those who disbelieve ascribe rivals unto their Lord.\n",
        "TRANSLATION_9": "Praise be to God, who has created the heavens and the earth and brought into being darkness and light. Yet those who deny the truth set up equals to their Lord!\n",
        "TRANSLATION_10": "All praise unto Allah, who created the heavens and the earth and made the darknesses and the light, yet those who disbelieve equalise others with their Lord.\n",
        "TRANSLATION_11": "All praise belongs to Allah who created the heavens and the earth and made the darkness and the light. Yet the faithless equate [others] with their Lord.\n",
        "TRANSLATION_12": "Praise be Allah, Who created the heavens and the earth, and made the darkness and the light. Yet those who reject Faith hold (others) as equal, with their Guardian-Lord.\n",
        "TRANSLATION_13": "All praises and thanks be to Allah, Who (Alone) created the heavens and the earth, and originated the darkness and the light, yet those who disbelieve hold others as equal with their Lord.\n",
        "TRANSLATION_14": "Praise is due to Allah, who has created the heavens and the earth and made darkness and light. Yet the unbelievers make (others) equal with their Lord.\n",
        "TRANSLATION_15": "Praise be to God, Who created the heavens and the earth, and made the darkness and the light. Yet those who disbelieve ascribe equals to their Lord.\n",
        "TRANSLATION_16": "[All] praise is [due] to Allah, who created the heavens and the earth and made the darkness and the light. Then those who disbelieve equate [others] with their Lord.\n",
        "TRANSLATION_17": "[6:1] Praise, which means to describe in beautiful terms, be, [ever] established, to God: is this meant to be informative, so that one believes in it? Or, is it meant as a eulogy, or both? These are three possibilities, the most likely of which is the last, as the Shaykh [Jalāl al-Dīn al-Mahallī] states in [his commentary on] sūrat alKahf [Q. 18:1]; Who created the heavens and the earth — He singles out these two for mention because for the observer they constitute the most awesome [visible] creation; and He appointed, He created, darknesses and light, that is, every darkness (zulma) and every light: the use of the plural only in the case of the former is because it [darkness] has many causes; and this is one of the proofs of His Oneness; then those who disbelieve, despite the existence of this proof, ascribe equals to their Lord, they worship others equally.\n",
        "TRANSLATION_18": "And on his authority from Ibn 'Abbas, regarding Allah's saying (Praise be to Allah) he said: '(Praise be to Allah) Allah says: gratitude and godhood are Allah's, (Who hath created the heavens) in two days: Sunday 131 and Monday (and the earth) in two days: Tuesday and Wednesday, (and has appointed darkness and light) He created faith and disbelief or night and day. (Yet those who disbelieve) the unbelievers of Mecca (ascribe rivals) idols (unto their Lord).\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "6:1",
            "45:36",
            "53:31",
            "31:26",
            "42:5",
            "34:1",
            "31:25",
            "39:63",
            "22:64",
            "16:49"
        ],
        "BIBLE": [
            "prophets:ezekiel:32:8",
            "torah:leviticus:20:25",
            "prophets:isaiah:42:16",
            "torah:deuteronomy:5:8",
            "torah:exodus:20:4",
            "prophets:isaiah:45:7",
            "prophets:ezekiel:35:14",
            "writings:ecclesiastes:7:13",
            "torah:deuteronomy:4:23",
            "torah:genesis:21:18"
        ]
    }
}