{
    "VERSE": "6:101",
    "ARABIC": "بَدِيعُ ٱلسَّمَٰوَٰتِ وَٱلْأَرْضِ أَنَّىٰ يَكُونُ لَهُۥ وَلَدٌ وَلَمْ تَكُن لَّهُۥ صَٰحِبَةٌ وَخَلَقَ كُلَّ شَىْءٍ وَهُوَ بِكُلِّ شَىْءٍ عَلِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "He is the Originator of the heavens and the earth. How could He have a son when He has no wife? He created all things and He has knowledge of all things.",
        "TRANSLATION_1": "Creator of the heavens and the earth from nothingness, how could He have a son when He has no mate? He created all things, and has knowledge of all things.\n",
        "TRANSLATION_2": "He is the Originator of the heavens and the earth. How can He have a son when He has had no mate? And He has created everything and He has full knowledge of all things.\n",
        "TRANSLATION_3": "How could the One Who is the Originator of the heavens and the earth and who has no companion, have a son? He created all things and has absolute knowledge of all things.\n",
        "TRANSLATION_4": "The Originator of the heavens and the earth; how can He possibly have a child when, in fact, He does not have a spouse? And He has created all things; and He knows everything.\n",
        "TRANSLATION_5": "He is the Badi` (Originator) of the heavens and the earth. How can He have children when He has no wife He created all things and He is the All-Knower of everything.\n",
        "TRANSLATION_6": "Wonderful Originator of the heavens and the earth! How could He have a son when He has no consort, and He (Himself) created everything, and He is the Knower of all things.\n",
        "TRANSLATION_7": "The Creator of the heavens and the earth -- how should He have a son, seeing that He has no consort, and He created all things, and He has knowledge of everything?\n",
        "TRANSLATION_8": "The Originator of the heavens and the earth! How can He have a child, when there is for Him no consort, when He created all things and is Aware of all things?\n",
        "TRANSLATION_9": "the Originator of the heavens and the earth. How could He have a son when He has no consort? He created everything and is aware of everything!\n",
        "TRANSLATION_10": "Originator of the heavens and the earth! How should He have a son when there is for Him no spouse? And He hath created everything and He is Knower of everything.\n",
        "TRANSLATION_11": "The originator of the heavens and the earth—how could He have a child when He has had no spouse? He created all things and He has knowledge of all things.\n",
        "TRANSLATION_12": "To Him is due the primal origin of the heavens and the earth: How can He have a son when He hath no consort? He created all things, and He hath full knowledge of all things.\n",
        "TRANSLATION_13": "He is the Originator of the heavens and the earth. How can He have children when He has no wife? He created all things and He is the All-Knower of everything.\n",
        "TRANSLATION_14": "He is the Creator of the heavens and the earth. How can He have a son when He had no female companion? He created all things and has knowledge of all things.\n",
        "TRANSLATION_15": "Originator of the heavens and the earth—how can He have a son when He never had a companion? He created all things, and He has knowledge of all things.\n",
        "TRANSLATION_16": "[He is] Originator of the heavens and the earth. How could He have a son when He does not have a companion and He created all things? And He is, of all things, Knowing.\n",
        "TRANSLATION_17": "[6:101] He is, the Originator of the heavens and the earth, which He originated uniquely without precedent; how should He have a son, when He has no consort, spouse, and He created everything, that was meant to be created, and He has knowledge of all things?\n",
        "TRANSLATION_18": "(The Originator) the Creator (of the heavens and the earth!) He created them when they were nothing before such creation. (How can He have a child, when there is for Him no consort) no wife, (when He created all things and is Aware of all things) of all created beings?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "6:101",
            "25:2",
            "42:12",
            "49:16",
            "4:126",
            "57:2",
            "2:29",
            "5:40",
            "24:64",
            "2:116"
        ],
        "BIBLE": [
            "writings:job:42:3",
            "torah:numbers:18:32",
            "torah:genesis:22:12",
            "writings:proverbs:30:18",
            "writings:i%20chronicles:29:17",
            "prophets:ezekiel:16:30",
            "prophets:isaiah:65:17",
            "prophets:i%20samuel:3:13",
            "writings:ii%20chronicles:2:5",
            "torah:deuteronomy:33:9"
        ]
    }
}