{
    "VERSE": "6:103",
    "ARABIC": "لَّا تُدْرِكُهُ ٱلْأَبْصَٰرُ وَهُوَ يُدْرِكُ ٱلْأَبْصَٰرَ وَهُوَ ٱللَّطِيفُ ٱلْخَبِيرُ",
    "ENGLISH": {
        "TRANSLATION_0": "Eyesight cannot perceive Him but He perceives eyesight. He is the All-Penetrating, the All-Aware.",
        "TRANSLATION_1": "No eyes can penetrate Him, but He penetrates all eyes, and He knows all the mysteries, for He is all-knowing.\n",
        "TRANSLATION_2": "No visual perception can encompass Him, even though He encompasses all visual perception. He is the All-Subtle, the All-Aware.\n",
        "TRANSLATION_3": "No mortal eyes can see Him, but He can see all eyes. He is All-kind and All-aware.\n",
        "TRANSLATION_4": "Eyes do not encompass Him – and all eyes are within His domain*; He is the Most Subtle, the Fully Aware. (* control / knowledge)\n",
        "TRANSLATION_5": "No vision can grasp Him, but His grasp is over all vision. He is the Most Subtle, Well-Acquainted (with all things).\n",
        "TRANSLATION_6": "Vision comprehends Him not, and He comprehends (all) vision; and He is the Knower of subtleties, the Aware.\n",
        "TRANSLATION_7": "The eyes attain Him not, but He attains the eyes; He is the All-subtle, the All-aware.\n",
        "TRANSLATION_8": "Vision comprehendeth Him not, but He comprehendeth (all) vision. He is the Subtile, the Aware.\n",
        "TRANSLATION_9": "No vision can grasp Him, but He takes in over all vision; He is the Subtle and Aware One.\n",
        "TRANSLATION_10": "Sights comprehend Him not, and He comprehendeth all sights. And He is the Subtle, the Aware.\n",
        "TRANSLATION_11": "The sights do not apprehend Him, yet He apprehends the sights, and He is the All-attentive, the All-aware.\n",
        "TRANSLATION_12": "No vision can grasp Him, but His grasp is over all vision: He is above all comprehension, yet is acquainted with all things.\n",
        "TRANSLATION_13": "No vision can grasp Him, but His Grasp is over all vision. He is the Most Subtle and Courteous, Well-Acquainted with all things.\n",
        "TRANSLATION_14": "No eye can see Him, though He sees all eyes. He is the Subtle, the Aware.\n",
        "TRANSLATION_15": "No vision can grasp Him, but His grasp is over all vision. He is the Subtle, the Expert.\n",
        "TRANSLATION_16": "Vision perceives Him not, but He perceives [all] vision; and He is the Subtle, the Acquainted.\n",
        "TRANSLATION_17": "[6:103] Vision cannot attain Him, that is, they [the eyes] cannot see Him — this is [a denial that applies] in particular [circumstances], since [it is accepted] that the believer will see Him in the Hereafter, as indicated   by God’s words, On that Day faces shall be radiant, gazing upon their Lord [Q. 75:22f.], and by the hadīth of the two Shaykhs [Bukhārī and Muslim]: ‘Verily you shall see your Lord, as clearly as you see the full moon at night’) — and it is also said [to mean] that it [vision] cannot encompass Him; but He attains [all] vision, that is to say, He perceives them, whereas they cannot perceive Him; it is not possible in [the case of] anyone other than Him to attain all vision while it [vision] cannot attain Him or encompass Him in knowledge. And He is the Subtle, [in dealing] with His friends, the Aware, of them.\n",
        "TRANSLATION_18": "(Vision comprehendeth Him not) in this world, nor do created beings see what He sees. Sights will not comprehend the modality of seeing Him in the Hereafter nor will created beings be able to see Him in this world, (but He comprehendeth (all) vision) in this world and in the Hereafter: He sees that which human beings do not see and nothing escapes or is hidden from Him. (He is the Subtile) in His actions whose knowledge surrounds His created beings, (the Aware) of His created beings and their actions.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "6:103",
            "67:14",
            "75:7",
            "53:17",
            "22:63",
            "79:9",
            "24:30",
            "33:34",
            "68:51",
            "17:30"
        ],
        "BIBLE": [
            "writings:ecclesiastes:3:14",
            "prophets:isaiah:52:5",
            "torah:deuteronomy:10:21",
            "prophets:isaiah:40:14",
            "writings:psalms:31:8",
            "writings:i%20chronicles:29:17",
            "prophets:ezekiel:23:13",
            "prophets:ezekiel:19:5",
            "prophets:isaiah:42:20",
            "prophets:isaiah:57:1"
        ]
    }
}