{
    "VERSE": "6:11",
    "ARABIC": "قُلْ سِيرُوا۟ فِى ٱلْأَرْضِ ثُمَّ ٱنظُرُوا۟ كَيْفَ كَانَ عَٰقِبَةُ ٱلْمُكَذِّبِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Say: 'Travel about the earth and see the final fate of the deniers.'",
        "TRANSLATION_1": "Say: \"Travel in the land and see what happened to those who disbelieved.\"\n",
        "TRANSLATION_2": "Say: 'Go about journeying the earth, and behold the end of those who gave the lie (to the Truth).'\n",
        "TRANSLATION_3": "(Muhammad), tell them to travel in the land and see what happened to those who rejected the Truth.\n",
        "TRANSLATION_4": "Proclaim, “Travel in the land, and see what sort of fate befell those who denied.”\n",
        "TRANSLATION_5": "Say: \"Travel in the land and see what was the end of those who rejected truth.\"\n",
        "TRANSLATION_6": "Say: Travel in the land, then see what was the end of the rejecters.\n",
        "TRANSLATION_7": "Say: 'Journey in the land, then behold how was the end of them that cried lies.'\n",
        "TRANSLATION_8": "Say (unto the disbelievers): Travel in the land, and see the nature of the consequence for the rejecters!\n",
        "TRANSLATION_9": "Say, \"Travel about the land and see what was the end of the deniers.\"\n",
        "TRANSLATION_10": "Say thou: go about in the earth and then see what wise hath been the end of the beliers.\n",
        "TRANSLATION_11": "Say, ‘Travel over the land, and then observe how was the fate of the deniers.’\n",
        "TRANSLATION_12": "Say: \"Travel through the earth and see what was the end of those who rejected Truth.\"\n",
        "TRANSLATION_13": "Say (O Muhammad SAW): \"Travel in the land and see what was the end of those who rejected truth.\"\n",
        "TRANSLATION_14": "Say: 'Travel the land and see what was the fate of those who belied'\n",
        "TRANSLATION_15": "Say, “Travel the earth and observe the final fate of the deniers.”\n",
        "TRANSLATION_16": "Say, \"Travel through the land; then observe how was the end of the deniers.\"\n",
        "TRANSLATION_17": "[6:11] Say, to them: ‘Travel in the land, and see the nature of the consequence for the deniers’, of the messengers, how they were destroyed through chastisement; perhaps they will take heed.\n",
        "TRANSLATION_18": "(Say) Muhammad, to the people of Mecca: (Travel in the land, and see) and reflect upon (the nature of the consequence for the rejecters!) what happened to those who denied Allah and His messengers.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "6:11",
            "27:69",
            "30:42",
            "3:137",
            "88:20",
            "37:73",
            "43:25",
            "10:14",
            "7:84",
            "47:10"
        ],
        "BIBLE": [
            "torah:deuteronomy:12:1",
            "prophets:joshua:19:49",
            "prophets:jeremiah:25:31",
            "prophets:ii%20kings:21:8",
            "torah:genesis:35:12",
            "torah:genesis:28:4",
            "writings:psalms:105:32",
            "torah:deuteronomy:26:10",
            "torah:deuteronomy:9:23",
            "torah:deuteronomy:26:12"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:3:7"
        ]
    }
}