{
    "VERSE": "6:116",
    "ARABIC": "وَإِن تُطِعْ أَكْثَرَ مَن فِى ٱلْأَرْضِ يُضِلُّوكَ عَن سَبِيلِ ٱللَّهِ إِن يَتَّبِعُونَ إِلَّا ٱلظَّنَّ وَإِنْ هُمْ إِلَّا يَخْرُصُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "If you obeyed most of those on earth, they would misguide you from Allah's Way. They follow nothing but conjecture. They are only guessing.",
        "TRANSLATION_1": "If you follow the majority of people on the earth, they will lead you astray from the path of God, for they follow only conjecture and surmise.\n",
        "TRANSLATION_2": "(O Muhammad!) If you obey the majority of those who live on earth, they will lead you away from Allah's path. They only follow idle fancies, indulging in conjecture.\n",
        "TRANSLATION_3": "Most of the people in the land will lead you away from God's guidance if you follow them; they only follow their own conjecture and preach falsehood.\n",
        "TRANSLATION_4": "And O listener, (followers of the Prophet) most of the people on earth are such that were you to obey them, they would mislead you from Allah’s way; they follow only assumptions and they only make guesses.\n",
        "TRANSLATION_5": "And if you obey most of those on the earth, they will mislead you far away from Allah's path. They follow nothing but conjecture, and they do nothing but lie.\n",
        "TRANSLATION_6": "And if you obey most of those in the earth, they will lead you astray from Allah's way; they follow but conjecture and they only lie.\n",
        "TRANSLATION_7": "If thou obeyest the most part of those on earth they will lead thee astray from the path of God; they follow only surmise, merely conjecturing.\n",
        "TRANSLATION_8": "If thou obeyedst most of those on earth they would mislead thee far from Allah's way. They follow naught but an opinion, and they do but guess.\n",
        "TRANSLATION_9": "If you obey the majority of those on earth, they will lead you astray from God's way. They follow nothing but conjecture. They are only guessing.\n",
        "TRANSLATION_10": "And if thou obeyedest most of those on the earth, they would lead thee astray from the way of Allah; they follow not but their fancy, and they only conjecture.\n",
        "TRANSLATION_11": "If you obey most of those on the earth, they will lead you astray from the way of Allah. They follow nothing but conjectures and they do nothing but surmise.\n",
        "TRANSLATION_12": "Wert thou to follow the common run of those on earth, they will lead thee away from the way of Allah. They follow nothing but conjecture: they do nothing but lie.\n",
        "TRANSLATION_13": "And if you obey most of those on earth, they will mislead you far away from Allah's Path. They follow nothing but conjectures, and they do nothing but lie.\n",
        "TRANSLATION_14": "If you obeyed most of those on earth, they would lead you astray from the Path of Allah. They follow only supposition and they are but conjecturing.\n",
        "TRANSLATION_15": "If you were to obey most of those on earth, they would divert you from God’s path. They follow nothing but assumptions, and they only conjecture.\n",
        "TRANSLATION_16": "And if you obey most of those upon the earth, they will mislead you from the way of Allah. They follow not except assumption, and they are not but falsifying.\n",
        "TRANSLATION_17": "[6:116] If you obey most of those on earth, that is, the disbelievers, they will lead you astray from the way of God, [from] His religion; they follow only supposition, when they dispute with you concerning [the status of] carrion, saying: ‘What God has killed is more worthy of your consumption than what you kill yourselves!’; they are merely guessing, speaking falsehood in this [matter].\n",
        "TRANSLATION_18": "(If thou obeyedst) Muhammad (most of those on earth) i.e. the Meccan leaders who were Abu'l-Ahwas Malik Ibn 'Awf al-Jushami, Budayl Ibn Warqa' al-Khuza'i and Julays Ibn Warqa' al-Khuza'i (they would mislead thee far from Allah's way) in the Sacred Precinct. (They follow naught but an opinion) they pronounce nothing but surmise, (and they do but guess) they lie to the believers when they say to them: that which Allah immolates is better than that which you slaughter with your own knives.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "6:116",
            "31:25",
            "10:66",
            "12:106",
            "3:146",
            "27:65",
            "10:36",
            "71:19",
            "4:160",
            "29:63"
        ],
        "BIBLE": [
            "prophets:ii%20samuel:7:23",
            "torah:exodus:34:15",
            "prophets:i%20kings:16:21",
            "torah:exodus:34:10",
            "prophets:isaiah:26:13",
            "prophets:ezekiel:26:20",
            "prophets:joel:2:17",
            "torah:deuteronomy:32:43",
            "torah:deuteronomy:28:21",
            "writings:i%20chronicles:17:22"
        ]
    }
}