{
    "VERSE": "6:131",
    "ARABIC": "ذَٰلِكَ أَن لَّمْ يَكُن رَّبُّكَ مُهْلِكَ ٱلْقُرَىٰ بِظُلْمٍ وَأَهْلُهَا غَٰفِلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "That was because their Lord would never have destroyed the cities unjustly while their people were unaware.",
        "TRANSLATION_1": "And this (so that it may be clear) that your Lord does not destroy towns and cities arbitrarily while the citizens remain unaware.\n",
        "TRANSLATION_2": "(They will be made to bear this witness to show that) it is not the way of your Lord to destroy cities unjustly while their people were unaware of the Truth.\n",
        "TRANSLATION_3": "Your Lord did not want to destroy the towns, unjustly, without informing their inhabitants (of His guidance).\n",
        "TRANSLATION_4": "This is because your Lord does not unjustly destroy townships for their people may be unaware.\n",
        "TRANSLATION_5": "This is because your Lord would not destroy the (populations of) towns for their wrongdoing while their people were unaware.\n",
        "TRANSLATION_6": "This is because your Lord would not destroy towns unjustly while their people were negligent.\n",
        "TRANSLATION_7": "That is because thy Lord would never destroy the cities unjustly, while their inhabitants were heedless.\n",
        "TRANSLATION_8": "This is because thy Lord destroyeth not the townships arbitrarily while their people are unconscious (of the wrong they do).\n",
        "TRANSLATION_9": "Your Lord would not destroy a community for its wrongdoing, so long as its people were still unaware.\n",
        "TRANSLATION_10": "This is because thy Lord is not one to destroy a town for its wrong-doing while its people are unaware.\n",
        "TRANSLATION_11": "This is because your Lord would never destroy the towns unjustly while their people were unaware.\n",
        "TRANSLATION_12": "(The messengers were sent) thus, for thy Lord would not destroy for their wrong-doing men's habitations whilst their occupants were unwarned.\n",
        "TRANSLATION_13": "This is because your Lord would not destroy the (populations of) towns for their wrong-doing (i.e. associating others in worship along with Allah) while their people were unaware (so the Messengers were sent).\n",
        "TRANSLATION_14": "That is because your Lord will not destroy villages unjustly, while their inhabitants were inattentive.\n",
        "TRANSLATION_15": "That is because your Lord would not destroy towns for injustice while their inhabitants are unaware.\n",
        "TRANSLATION_16": "That is because your Lord would not destroy the cities for wrongdoing while their people were unaware.\n",
        "TRANSLATION_17": "[6:131] That, sending of the messengers, is because (an, [phonetically] lightened, with the lām [of li-annahu] implied, thus [read as] li-annahu, ‘because’) your Lord would never destroy the towns through injustice, on their part, while their inhabitants were heedless, not having had any Messenger to make [things] clear to them.\n",
        "TRANSLATION_18": "(This) i.e. sending messengers (is because your Lord destroyeth not the townships) the people of the townships (arbitrarily) because of their idolatry or transgression; it is also said that this means: out of injustice (while their people are unconscious) of the commands and prohibitions and the conveyance of the messengers.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "6:131",
            "11:117",
            "28:59",
            "11:102",
            "7:97",
            "7:98",
            "29:31",
            "32:22",
            "26:169",
            "29:34"
        ],
        "BIBLE": [
            "prophets:zephaniah:3:6",
            "prophets:jeremiah:18:11",
            "torah:deuteronomy:1:22",
            "prophets:jeremiah:44:22",
            "prophets:joshua:6:17",
            "prophets:jeremiah:33:10",
            "writings:esther:1:22",
            "prophets:i%20kings:8:44",
            "torah:numbers:9:13",
            "prophets:isaiah:43:9"
        ]
    }
}