{
    "VERSE": "6:143",
    "ARABIC": "ثَمَٰنِيَةَ أَزْوَٰجٍ مِّنَ ٱلضَّأْنِ ٱثْنَيْنِ وَمِنَ ٱلْمَعْزِ ٱثْنَيْنِ قُلْ ءَآلذَّكَرَيْنِ حَرَّمَ أَمِ ٱلْأُنثَيَيْنِ أَمَّا ٱشْتَمَلَتْ عَلَيْهِ أَرْحَامُ ٱلْأُنثَيَيْنِ نَبِّـُٔونِى بِعِلْمٍ إِن كُنتُمْ صَٰدِقِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "There are eight in pairs: A pair of sheep and a pair of goats - Say: 'Is it the two males He has made haram, or the two females, or what the wombs of the two females contain? Tell me with knowledge if you are being truthful.'",
        "TRANSLATION_1": "There are eight pairs, two of the species of sheep and two of goats. Ask them which has He forbidden, the two males or the two females, or what the females carry in their wombs? Produce the sanction if you are truthful.\n",
        "TRANSLATION_2": "These are eight couples, two of sheep, two of goats. Now ask them: 'Is it either the two males that Allah has forbidden or the two females, or what the wombs of the two females may contain? Tell me about this on the basis of sure knowledge, if you speak the truth.'\n",
        "TRANSLATION_3": "(Supposing) that there are eight pairs of cattle, two pairs of sheep, and two pairs of goats. Tell Me (which is lawful and which is not)? Are the two males unlawful (to eat) or the two females or those that are in the wombs of the females? If you are truthful, then, answer Me exactly.\n",
        "TRANSLATION_4": "“Eight males and females; one pair of sheep and one of goats”; say, “Has He forbidden the two males or the two females, or what the two females carry in their wombs? Answer with some knowledge, if you are truthful.”\n",
        "TRANSLATION_5": "Eight pairs: of the sheep two (male and female), and of the goats two (male and female). Say: \"Has He forbidden the two males or the two females, or (the young) which the wombs of the two females enclose Inform me with knowledge if you are truthful. \"\n",
        "TRANSLATION_6": "Eight in pairs-- two of sheep and two of goats. Say: Has He forbidden the two males or the two females or that which the wombs of the two females contain? Inform me with knowledge if you are truthful.\n",
        "TRANSLATION_7": "Eight couples: two of sheep, of goats two. Say: 'Is it the two males He has forbidden or the two females? Or what the wombs of the two females contain? Tell me with knowledge, if you speak truly.'\n",
        "TRANSLATION_8": "Eight pairs: Of the sheep twain, and of the goats twain. Say: Hath He forbidden the two males or the two females, or that which the wombs of the two females contain? Expound to me (the case) with knowledge, if ye are truthful.\n",
        "TRANSLATION_9": "God has created four kinds of livestock of either sex: two of sheep and two of goats. Ask them, \"Is it the two males He has forbidden or the two females or what the wombs of the two females contain? Tell me on the basis of knowledge, if you are truthful.\"\n",
        "TRANSLATION_10": "He hath created eight pairs of the sheep a twain, and of the goats a twain. Say thou: is it the two males He hath forbidden or the two females, or that which the wombs of the two females contain? Declare unto me with knowledge, if ye are truth-tellers.\n",
        "TRANSLATION_11": "Eight mates: two of sheep, and two of goats. Say, ‘Is it the two males that He has forbidden or the two females, or what is contained in the wombs of the two females? Inform me with knowledge, should you be truthful.’\n",
        "TRANSLATION_12": "(Take) eight (head of cattle) in (four) pairs: of sheep a pair, and of goats a pair; say, hath He forbidden the two males, or the two females, or (the young) which the wombs of the two females enclose? Tell me with knowledge if ye are truthful:\n",
        "TRANSLATION_13": "Eight pairs; of the sheep two (male and female), and of the goats two (male and female). Say: \"Has He forbidden the two males or the two females, or (the young) which the wombs of the two females enclose? Inform me with knowledge if you are truthful.\"\n",
        "TRANSLATION_14": "(He has given you) eight couples, a pair of sheep and a pair of goats. Say: 'Of these, has He forbidden you the males, the females, or what the wombs of the two females contain? Tell me with knowledge, if you are truthful'\n",
        "TRANSLATION_15": "Eight pairs: two of the sheep, and two of the goats. Say, “Did He forbid the two males, or the two females, or what the wombs of the two females contain? Inform me with knowledge, if you are truthful.”\n",
        "TRANSLATION_16": "[They are] eight mates - of the sheep, two and of the goats, two. Say, \"Is it the two males He has forbidden or the two females or that which the wombs of the two females contain? Inform me with knowledge, if you should be truthful.\"\n",
        "TRANSLATION_17": "[6:143] Eight pairs, types (thamāniyata azwājin substitutes for hamūlatan wa-farshan, ‘some for burdens and some for light support’): two of sheep, a male and a female; and of goats (read ma‘az or ma‘z) two. Say, O   Muhammad (s) to those who on one occasion deem male cattle forbidden, and on another, the females thereof, and then ascribe such [rules] to God: ‘Is it the two males, of the sheep and goats, He has forbidden, you, or the two females, of these two [types], or that which the wombs of the two females contain, be they male or female? Inform Me with knowledge, of the details of such prohibitions, if you speak truly’, in this [matter], meaning: on what basis has the prohibition been made? If it is on the basis of maleness, then all males are forbidden; if on the basis of femaleness, then all females are so [forbidden]; if on what the womb may contain, then both genders are prohibited. So, on what basis are such specifications made? (the interrogative is meant as a repudiation).\n",
        "TRANSLATION_18": "(Eight pairs) He created eight pairs: (Of the sheep twain) male and female, (and of the goats twain) male and female. (Say) to Malik, Muhammad: (Hath He forbidden the two males or the two females) is the prohibition of the Bahirah and Wasilah because of the fluids of the two males or those of the two females, (or that which the wombs of the two females contain) before copulation? (Expound to me (the case) with knowledge, if ye are truthful) that Allah has made unlawful that which you claim.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "6:143",
            "75:39",
            "53:45",
            "6:144",
            "26:165",
            "53:21",
            "92:3",
            "43:20",
            "6:139",
            "26:112"
        ],
        "BIBLE": [
            "prophets:i%20kings:17:19",
            "prophets:ii%20kings:25:6",
            "torah:genesis:31:9",
            "writings:i%20chronicles:10:9",
            "prophets:jeremiah:52:9",
            "prophets:i%20samuel:10:1",
            "torah:genesis:50:25",
            "prophets:ezekiel:18:13",
            "prophets:i%20kings:18:26",
            "prophets:ii%20kings:10:15"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:3:8",
            "Sefer%20Yetzirah:6:4",
            
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:3:4",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:1:4"
        ]
    }
}