{
    "VERSE": "6:145",
    "ARABIC": "قُل لَّآ أَجِدُ فِى مَآ أُوحِىَ إِلَىَّ مُحَرَّمًا عَلَىٰ طَاعِمٍ يَطْعَمُهُۥٓ إِلَّآ أَن يَكُونَ مَيْتَةً أَوْ دَمًا مَّسْفُوحًا أَوْ لَحْمَ خِنزِيرٍ فَإِنَّهُۥ رِجْسٌ أَوْ فِسْقًا أُهِلَّ لِغَيْرِ ٱللَّهِ بِهِۦ فَمَنِ ٱضْطُرَّ غَيْرَ بَاغٍ وَلَا عَادٍ فَإِنَّ رَبَّكَ غَفُورٌ رَّحِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "Say: 'I do not find, in what has been revealed to me, any food it is haram to eat except for carrion, flowing blood, and pork - for that is unclean - or some deviance consecrated to other than Allah. But if anyone is forced to eat it, without desiring to or going to excess in it, your Lord is Ever-Forgiving, Most",
        "TRANSLATION_1": "You tell them: \"In all the commands revealed to me I find nothing which men have been forbidden to eat except carrion and running blood and flesh of the swine for it is unclean, or meat consecrated in the name of some other than God, which is profane. But if one is constrained to eat of these without craving or reverting to it, then surely your Lord is forgiving and kind.\"\n",
        "TRANSLATION_2": "Tell them (O Muhammad!): 'I do not find in what has been revealed to me anything forbidden for anyone who wants to eat unless it is carrion, outpoured blood and the flesh of swine, all of which is unclean; or that which is profane having been slaughtered in a name other than that of Allah. But whosoever is constrained to it by necessity - neither desiring to disobey nor exceeding the limit of necessity - your Lord is surely AllForgiving, All-Compassionate.\n",
        "TRANSLATION_3": "(Muhammad), tell them, \"I do not find anything which has been made unlawful to eat in what has been revealed to me except carrion, blood flowing from the body, pork [for pork is absolutely filthy] and the flesh of the animals slaughtered without the mention of the name of God. However, in an emergency, when one does not have any intention of rebelling or transgressing against the law, your Lord will be All-forgiving and All-merciful.\n",
        "TRANSLATION_4": "Say (O dear Prophet Mohammed – peace and blessings be upon him), “I do not find in what is sent down to me any eatable prohibited to a consumer, except if it is carrion, or blood flowing from blood vessels, or the flesh of swine – for that is indeed foul, or the sin causing animal over which the name of any other than Allah is taken at the time of slaughtering; so for one compelled by circumstances, neither himself desiring nor eating more than necessary, indeed your Lord is Oft Forgiving, Most Merciful.”\n",
        "TRANSLATION_5": "Say: \"I find not in that which has been revealed to me anything forbidden to be eaten by one who wishes to eat it, unless it be Maytah (a dead animal) or blood poured forth, or the flesh of swine; for that surely, is unclean (Rijs), or immorally slaughtered in the name of other than Allah. But whosoever is forced by necessity without willful disobedience, nor transgressing due limits; (for him) certainly, your Lord is Oft-Forgiving, Most Merciful.\"\n",
        "TRANSLATION_6": "Say: I do not find in that which has been revealed to me anything forbidden for an eater to eat of except that it be what has died of itself, or blood poured forth, or flesh of swine-- for that surely is unclean-- or that which is a transgression, other than (the name of) Allah having been invoked on it; but whoever is driven to necessity, not desiring nor exceeding the limit, then surely your Lord is Forgiving, Merciful.\n",
        "TRANSLATION_7": "Say: 'I do not find, in what is revealed to me, aught forbidden to him who eats thereof except it be carrion, or blood outpoured, or the flesh of swine -- that is an abomination -- or an ungodly thing that has been hallowed to other than God; yet whoso is constrained, not desiring nor transgressing, surely thy Lord is All-forgiving, All-compassionate.'\n",
        "TRANSLATION_8": "Say: I find not in that which is revealed unto me aught prohibited to an eater that he eat thereof, except it be carrion, or blood poured forth, or swineflesh - for that verily is foul - or the abomination which was immolated to the name of other than Allah. But whoso is compelled (thereto), neither craving nor transgressing, (for him) lo! thy Lord is Forgiving, Merciful.\n",
        "TRANSLATION_9": "Say [O Prophet], \"In all that has been revealed to me, I do not find a ban on anything to eat, except for carrion, flowing blood and pork, all these being unclean or profane, on which the name of someone other than God has been invoked.\" But if anyone is forced by necessity, being neither disobedient nor exceeding the limit, then surely your Lord is most forgiving and merciful.\n",
        "TRANSLATION_10": "Say thou: I find not in that which hath been revealed unto me aught forbidden unto an eater that eateth thereof, except it be carcass, or blood poured forth, or flesh of swine, for that verily is foul, or an abomination over which is invoked the name of other than that of Allah. Then whosoever is driven thereto, neither lusting nor transgressing, verily thy Lord is Forgiving, Merciful.\n",
        "TRANSLATION_11": "Say, ‘I do not find in what has been revealed to me that anyone be forbidden to eat anything except carrion or spilt blood, or the flesh of swine—for that is indeed unclean—or an impiety offered to other than Allah.’ But should someone be compelled, without being rebellious or aggressive, indeed your Lord is all-forgiving, all-merciful.\n",
        "TRANSLATION_12": "Say: \"I find not in the message received by me by inspiration any (meat) forbidden to be eaten by one who wishes to eat it, unless it be dead meat, or blood poured forth, or the flesh of swine,- for it is an abomination - or, what is impious, (meat) on which a name has been invoked, other than Allah's\". But (even so), if a person is forced by necessity, without wilful disobedience, nor transgressing due limits,- thy Lord is Oft-forgiving, Most Merciful.\n",
        "TRANSLATION_13": "Say (O Muhammad SAW): \"I find not in that which has been inspired to me anything forbidden to be eaten by one who wishes to eat it, unless it be Maytatah (a dead animal) or blood poured forth (by slaughtering or the like), or the flesh of swine (pork, etc.) for that surely is impure, or impious (unlawful) meat (of an animal) which is slaughtered as a sacrifice for others than Allah (or has been slaughtered for idols, etc., or on which Allah's Name has not been mentioned while slaughtering). But whosoever is forced by necessity without wilful disobedience, nor transgressing due limits, (for him) certainly, your Lord is Oft-Forgiving, Most Merciful.\"\n",
        "TRANSLATION_14": "Say: 'I find nothing in what has been revealed to me that forbids any one to eat of any food except the dead, running blood, and the flesh of swine for these are unclean and that which has been hallowed in its slaughter to other than Allah. But whoever is constrained to eat of any of these, not intending to sin or transgress, then your Lord is Forgiving, the Most Merciful.\n",
        "TRANSLATION_15": "Say, “In what was revealed to me, I find nothing forbidden to a consumer who eats it, except carrion, or spilled blood, or the flesh of swine—because it is impure—or a sinful offering dedicated to other than God. But if someone is compelled by necessity, without being deliberate or malicious—your Lord is Forgiving and Merciful.\n",
        "TRANSLATION_16": "Say, \"I do not find within that which was revealed to me [anything] forbidden to one who would eat it unless it be a dead animal or blood spilled out or the flesh of swine - for indeed, it is impure - or it be [that slaughtered in] disobedience, dedicated to other than Allah. But whoever is forced [by necessity], neither desiring [it] nor transgressing [its limit], then indeed, your Lord is Forgiving and Merciful.\"\n",
        "TRANSLATION_17": "[6:145] Say: ‘I do not find, in what is revealed to me, anything forbidden to him who eats thereof except it be (read yakūn or takūn) carrion (maytatan; or if read maytatun, then with the form yakūn, ‘it be’, preceding it) or blood poured forth, flowing, as opposed to [the case of] a liver or a spleen; or the flesh of swine — that indeed is an abomination, forbidden, or, except it be, a wicked thing that has been hallowed to other than God, that is to say, it has been slaughtered in the name of someone else. But whoever is constrained, to do any of what has been mentioned, and he consumes it, neither coveting nor transgressing, then surely your Lord is Forgiving, to him for what he has consumed, Merciful’, towards him. To these [prohibited things] the Sunna adds all beasts of prey with canine teeth and birds [of prey] with talons.\n",
        "TRANSLATION_18": "Malik Ibn 'Awf understood what was required of him and kept silent. Instead, he said: \"Let me hear from you, Muhammad, why our forefathers forbade them\". So Allah said: (Say) Muhammad: (I find not in that which is revealed unto me) i.e. the Qur'an (aught prohibited to an eater that he eat thereof, except it be carrion, or blood poured forth, or swine flesh for that verily is foul) unlawful (or the abomination) an immolated animal (which was immolated to the name of other than Allah) intentionally. (But whoso is compelled (thereto)) whoever is forced to eat the meat of carrion, (neither craving) i.e. without infringement on Muslims nor deeming the meat of carrion lawful in other than necessity (nor transgressing) nor committing highway robbery or intentionally eating of the meat of carrion without being compelled to do so, ((for him) lo! your Lord is Forgiving) if he eats to satiety, (Merciful) in that which He made dispensation for him. However, he ought not to eat to satiety, and if he does, Allah will pardon him.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "6:145",
            "16:115",
            "2:173",
            "5:3",
            "11:41",
            "11:63",
            "2:182",
            "5:39",
            "6:164",
            "10:107"
        ],
        "BIBLE": [
            "writings:ecclesiastes:3:14",
            "prophets:ii%20kings:5:20",
            "torah:leviticus:4:35",
            "torah:deuteronomy:12:27",
            "torah:leviticus:7:21",
            "prophets:i%20samuel:6:15",
            "prophets:ezekiel:3:21",
            "prophets:isaiah:66:3",
            "prophets:i%20kings:18:36",
            "torah:deuteronomy:30:1"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:4:3"
        ]
    }
}