{
    "VERSE": "6:15",
    "ARABIC": "قُلْ إِنِّىٓ أَخَافُ إِنْ عَصَيْتُ رَبِّى عَذَابَ يَوْمٍ عَظِيمٍ",
    "ENGLISH": {
        "TRANSLATION_0": "Say: 'I fear, were I to disobey my Lord, the punishment of a dreadful Day.'",
        "TRANSLATION_1": "Say: \"If I disobey my Lord, I fear the punishment of a grievous Day.\"\n",
        "TRANSLATION_2": "Say: 'Surely do I fear, if I disobey my Lord, the chastisement of an awesome Day.\n",
        "TRANSLATION_3": "(Muhammad), say, \"Because of the torment of the Great Day, I am afraid to disobey my Lord\".\n",
        "TRANSLATION_4": "Say, “If I disobey my Lord, I then fear the punishment of the Great Day (of Resurrection).”\n",
        "TRANSLATION_5": "Say: \"I fear, if I disobey my Lord, the torment of a Mighty Day.\"\n",
        "TRANSLATION_6": "Say: Surely I fear, if I disobey my Lord, the chastisement of a grievous day.\n",
        "TRANSLATION_7": "Say: 'Indeed I fear, if I should rebel against thy Lord, the chastisement of a dreadful day.'\n",
        "TRANSLATION_8": "Say: I fear, if I rebel against my Lord, the retribution of an Awful Day.\n",
        "TRANSLATION_9": "Say, \"I will never disobey my Lord, for I fear the punishment of a dreadful Day.\"\n",
        "TRANSLATION_10": "Say thou: verily fear, if disobey my Lord, the torment of a Mighty Day.\n",
        "TRANSLATION_11": "Say, ‘Indeed, should I disobey my Lord, I fear the punishment of a tremendous day.’\n",
        "TRANSLATION_12": "Say: \"I would, if I disobeyed my Lord, indeed have fear of the penalty of a Mighty Day.\n",
        "TRANSLATION_13": "Say: \"I fear, if I disobey my Lord, the torment of a Mighty Day.\"\n",
        "TRANSLATION_14": "Say: 'Indeed I fear, if I should disobey my Lord, the punishment of a great Day'\n",
        "TRANSLATION_15": "Say, “I fear, should I defy my Lord, the punishment of a tremendous Day.”\n",
        "TRANSLATION_16": "Say, \"Indeed I fear, if I should disobey my Lord, the punishment of a tremendous Day.\"\n",
        "TRANSLATION_17": "[6:15] Say: ‘Indeed I fear, if I should rebel against my Lord, by worshipping other than Him, the chastisement of a dreadful day’, namely, the Day of Resurrection.\n",
        "TRANSLATION_18": "(Say) Muhammad: (I fear) I know, (if I rebel against my Lord) and worship other than Him, I would be reverting back to your religion, (the retribution of an Awful Day) I would face then a tremendous torment on an Awful Day; it is also said that this means: I would be facing torment on an Awful Day.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "39:13",
            "6:15",
            "26:135",
            "26:189",
            "26:156",
            "52:7",
            "83:5",
            "44:12",
            "15:36",
            "38:79"
        ],
        "BIBLE": [
            "torah:genesis:4:13",
            "torah:genesis:18:20",
            "writings:psalms:2:7",
            "prophets:hosea:10:3",
            "prophets:isaiah:25:9",
            "prophets:i%20kings:1:30",
            "prophets:jeremiah:4:10",
            "prophets:ii%20samuel:6:9",
            "prophets:isaiah:39:8",
            "torah:genesis:32:27"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:11",
            "Sefer%20Yetzirah:1:13"
        ]
    }
}