{
    "VERSE": "6:155",
    "ARABIC": "وَهَٰذَا كِتَٰبٌ أَنزَلْنَٰهُ مُبَارَكٌ فَٱتَّبِعُوهُ وَٱتَّقُوا۟ لَعَلَّكُمْ تُرْحَمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "And this is a Book We have sent down and blessed, so follow it and have taqwa so that hopefully you will gain mercy.",
        "TRANSLATION_1": "Blessed is this Book We have revealed; so follow it and preserve yourself from evil that you may qualify for grace,\n",
        "TRANSLATION_2": "And likewise We revealed this (Book) - a blessed one. Follow it, then, and become God-fearing; you may be shown mercy.\n",
        "TRANSLATION_3": "This Book (Quran) which We have revealed is a blessed one. Follow its guidance and have piety so that you perhaps may receive mercy\n",
        "TRANSLATION_4": "And this (the Qur’an) is the blessed Book which We have sent down; so follow it and be pious, so there may be mercy upon you.\n",
        "TRANSLATION_5": "And this is a blessed Book (the Qur'an) which We have sent down, so follow it and have Taqwa, so that you may receive mercy.\n",
        "TRANSLATION_6": "And this is a Book We have revealed, blessed; therefore follow it and guard (against evil) that mercy may be shown to you.\n",
        "TRANSLATION_7": "This is a Book We have sent down, blessed; so follow it, and be godfearing; haply so you will find mercy;\n",
        "TRANSLATION_8": "And this is a blessed Scripture which We have revealed. So follow it and ward off (evil), that ye may find mercy.\n",
        "TRANSLATION_9": "This is a Book which We have revealed as a blessing, follow it and fear your Lord, so that you may receive mercy,\n",
        "TRANSLATION_10": "And this is a Book We have sent down, blest, follow it then and fear God, haply ye may be shewn mercy.\n",
        "TRANSLATION_11": "And this Book that We have sent down is a blessed one; so follow it, and be Godwary so that you may receive [His] mercy.\n",
        "TRANSLATION_12": "And this is a Book which We have revealed as a blessing: so follow it and be righteous, that ye may receive mercy:\n",
        "TRANSLATION_13": "And this is a blessed Book (the Quran) which We have sent down, so follow it and fear Allah (i.e. do not disobey His Orders), that you may receive mercy (i.e. saved from the torment of Hell).\n",
        "TRANSLATION_14": "And We have sent down this blessed Book (the Holy Koran). Follow it and be cautious in order that you receive mercy,\n",
        "TRANSLATION_15": "This too is a blessed Scripture that We revealed; so follow it, and be righteous, that you may receive mercy.\n",
        "TRANSLATION_16": "And this [Qur'an] is a Book We have revealed [which is] blessed, so follow it and fear Allah that you may receive mercy.\n",
        "TRANSLATION_17": "[6:155] And this, Qur’ān, is a blessed Book which We have revealed; so follow it, O people of Mecca, by implementing what is in it, and be wary, of disbelief, that perhaps you might find mercy.\n",
        "TRANSLATION_18": "(And this is a blessed) comprises mercy and forgiveness for the person who believes (Scripture) i.e. the Qur'an (which We have revealed) which We have sent Gabriel with. (So follow it) follow its lawful and unlawful, commands and prohibitions (and ward off (evil)) ward off other than it, (that ye may find mercy) and not be tormented.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "6:155",
            "37:117",
            "52:2",
            "68:37",
            "37:157",
            "23:49",
            "83:20",
            "83:9",
            "2:53",
            "43:21"
        ],
        "BIBLE": [
            "writings:psalms:24:5",
            "torah:genesis:19:19",
            "prophets:i%20samuel:12:14",
            "writings:ruth:3:10",
            "writings:psalms:57:4",
            "torah:deuteronomy:12:30",
            "torah:deuteronomy:7:4",
            "prophets:jonah:4:2",
            "writings:psalms:23:6",
            "prophets:i%20kings:18:21"
        ]
    }
}