{
    "VERSE": "6:157",
    "ARABIC": "أَوْ تَقُولُوا۟ لَوْ أَنَّآ أُنزِلَ عَلَيْنَا ٱلْكِتَٰبُ لَكُنَّآ أَهْدَىٰ مِنْهُمْ فَقَدْ جَآءَكُم بَيِّنَةٌ مِّن رَّبِّكُمْ وَهُدًى وَرَحْمَةٌ فَمَنْ أَظْلَمُ مِمَّن كَذَّبَ بِـَٔايَٰتِ ٱللَّهِ وَصَدَفَ عَنْهَا سَنَجْزِى ٱلَّذِينَ يَصْدِفُونَ عَنْ ءَايَٰتِنَا سُوٓءَ ٱلْعَذَابِ بِمَا كَانُوا۟ يَصْدِفُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Nor can you say: 'If the Book had been sent down to us, We would have been better guided than they were.' For a Clear Sign has come to you from your Lord, and guidance and mercy. Who could do greater wrong than someone who denies Allah's Signs and turns away from them? We will repay those who turn away from Our Signs with the worst kind of punishment because they turned away.",
        "TRANSLATION_1": "Or that: \"Had the Book been sent down to us we would surely have been guided better than they.\" So you have now received from your Lord a clear proof and a guidance and grace. Then who is more wicked than he who denies the signs of God and turns away from them? We shall punish those severely who turn away: A requital indeed for having turned aside.\n",
        "TRANSLATION_2": "Nor may you claim that: 'Had the Book been revealed to us, we would have been better guided than they.' Surely clear evidence has come to you from your Lord, which is both a guidance and a mercy. Who, then, is more unjust than he who gave the lie to the signs of Allah and turned away from them? And We shall soon requite those who turn away from Our signs with a severe chastisement for having turned away.\n",
        "TRANSLATION_3": "or proclaim, \"Had the Book been revealed to us, we would have followed its guidance better than the (Jews and Christians). Evidence, guidance, and mercy have already come to you from your Lord. Who are more unjust than those who reject God's revelations and turn away from them? We will give an evil recompense to those who turn away from Our revelations and a terrible torment for their disregard (of Our guidance)\n",
        "TRANSLATION_4": "Or may say that, “If the Book had been sent down to us, we would have been more upon guidance than them”; so the clear proof and guidance and mercy has come to you, from your Lord; so who is more unjust than one who denies the signs of Allah, and turns away from them? We shall soon punish those who turn away from Our signs with a great punishment, the recompense of their turning away.\n",
        "TRANSLATION_5": "Or lest you should say: \"If only the Book had been sent down to us, we would surely have been better guided than they.\" So now has come unto you a clear proof from your Lord, and a guidance and a mercy. Who then does more wrong than one who rejects the Ayat of Allah and Sadafa away therefrom We shall requite those who turn away from Our Ayat with an evil torment, because of their turning away.\n",
        "TRANSLATION_6": "Or lest you should say: If the Book had been revealed to us, we would certainly have been better guided than they, so indeed there has come to you clear proof from your Lord, and guidance and mercy. Who then is more unjust than he who rejects Allah's communications and turns away from them? We will reward those who turn away from Our communications with an evil chastisement because they turned away.\n",
        "TRANSLATION_7": "or lest you say, 'If the Book had been sent down upon us, we had surely been more rightly guided than they.' Yet indeed a clear sign has come to you from your Lord, and a guidance and a mercy; and who does greater evil than he who cries lies to God's signs, and turns away from them? We shall surely recompense those who turn away from Our signs with an evil chastisement for their turning away.\n",
        "TRANSLATION_8": "Or lest ye should say: If the Scripture had been revealed unto us, we surely had been better guided than are they. Now hath there come unto you a clear proof from your Lord, a guidance and mercy; and who doeth greater wrong than he who denieth the revelations of Allah, and turneth away from them? We award unto those who turn away from Our revelations an evil doom because of their aversion.\n",
        "TRANSLATION_9": "or you may say, \"If the Book had been sent down to us, we would surely have followed its guidance better than they did.\" There has now come to you clear evidence from your Lord, and guidance and mercy. Who, then, is more unjust than one who rejects the signs of God and turns away from them? We shall requite those who turn away from Our signs with a painful punishment, for their turning away.\n",
        "TRANSLATION_10": "Or lest ye should say. if only the Book had been sent down to us, we should surely have been better guided than they. So now surely there hath come unto you an evidence from Your Lord and a guidance and a mercy. Who then doth greater wrong than he who belieth the signs of Allah and shunneth them? Anon We will requite those who shun Our signs with an evil torment in as much as they were wont to shun them.\n",
        "TRANSLATION_11": "or [lest] you should say, ‘If the Book had been sent down to us, surely we would have been better-guided than them.’ There has already come to you a manifest proof from your Lord and a guidance and mercy. So who is a greater wrongdoer than him who denies the signs of Allah, and turns away from them? Soon We shall requite those who turn away from Our signs with a terrible punishment because of what they used to evade.\n",
        "TRANSLATION_12": "Or lest ye should say: \"If the Book had only been sent down to us, we should have followed its guidance better than they.\" Now then hath come unto you a clear (sign) from your Lord,- and a guide and a mercy: then who could do more wrong than one who rejecteth Allah's signs, and turneth away therefrom? In good time shall We requite those who turn away from Our signs, with a dreadful penalty, for their turning away.\n",
        "TRANSLATION_13": "Or lest you (pagan Arabs) should say: \"If only the Book had been sent down to us, we would surely have been better guided than they (Jews and Christians).\" So now has come unto you a clear proof (the Quran) from your Lord, and a guidance and a mercy. Who then does more wrong than one who rejects the Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) of Allah and turns away therefrom? We shall requite those who turn away from Our Ayat with an evil torment, because of their turning away (from them). [Tafsir At-Tabari, Vol. 8, Page 95]\n",
        "TRANSLATION_14": "Or (you say), 'Had the Book been sent down to us, we would have been better guided than they' Indeed a clear sign has now come to you from your Lord; a guidance and a mercy. And who is more harmful than he who belies the verses of Allah and turns away from them! We shall recompense those who turn away from Our verses with an evil punishment for their turning away.\n",
        "TRANSLATION_15": "Or lest you say, “Had the Scripture been revealed to us, we would have been better guided than they.” Clarification has come to you from your Lord, and guidance, and mercy. Who then does greater wrong than he who gives the lie to God's messages, and turns away from them? We will repay those who turn away from Our messages with the worst kind of punishment, because of their turning away.\n",
        "TRANSLATION_16": "Or lest you say, \"If only the Scripture had been revealed to us, we would have been better guided than they.\" So there has [now] come to you a clear evidence from your Lord and a guidance and mercy. Then who is more unjust than one who denies the verses of Allah and turns away from them? We will recompense those who turn away from Our verses with the worst of punishment for their having turned away.\n",
        "TRANSLATION_17": "[6:157] Or lest you should say, ‘If the Scripture had been revealed to us, we would have surely been more rightly guided than they are’, because of the excellence of our minds. Now indeed a clear proof, a [clear] statement, has come to you from your Lord, and a guidance and a mercy, for him who follows it; and who, that is, none, does greater evil than he who denies God’s signs and turns away from them? We shall surely requite those who turn away from Our signs with dreadful, the most severe, chastisement for their aversion.\n",
        "TRANSLATION_18": "(Or lest you should say) and so that you will not say on the Day of Judgement: (If the Scripture had been revealed unto us) as it was revealed to the Jews and Christians, (we surely had been better guided than are they) we would be swifter in answering the Messenger and we would also have a sounder religion. (Now hath there come unto you a clear proof) a clarification (from your Lord) i.e. the Qur'an and the Messenger, (a guidance) from error (and a mercy) for the one who believes in him; (and who doeth greater wrong) who is more insolent and more daring vis-a-vis Allah (than he who denieth the revelations of Allah) who denies Muhammad (pbuh) and the Qur'an, (and turneth away from them? We award unto those who turn away from Our revelations) Muhammad (pbuh) and the Qur'an (an evil doom) a severe torment (because of their aversion) vis-a-vis Muhammad and the Qur'an.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "6:157",
            "7:37",
            "57:9",
            "6:54",
            "2:159",
            "5:44",
            "10:17",
            "58:5",
            "3:50",
            "6:21"
        ],
        "BIBLE": [
            "prophets:i%20samuel:10:9",
            "prophets:ezekiel:3:20",
            "writings:ezra:5:3",
            "writings:job:1:21",
            "prophets:i%20kings:14:8",
            "torah:genesis:38:18",
            "prophets:ezekiel:18:13",
            "writings:ii%20chronicles:35:21",
            "prophets:joshua:17:4",
            "torah:deuteronomy:26:13"
        ]
    }
}