{
    "VERSE": "6:159",
    "ARABIC": "إِنَّ ٱلَّذِينَ فَرَّقُوا۟ دِينَهُمْ وَكَانُوا۟ شِيَعًا لَّسْتَ مِنْهُمْ فِى شَىْءٍ إِنَّمَآ أَمْرُهُمْ إِلَى ٱللَّهِ ثُمَّ يُنَبِّئُهُم بِمَا كَانُوا۟ يَفْعَلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "As for those who divide up their deen and form into sects, you have nothing whatsoever to do with them. Their affair will go back to Allah and then He will inform them about what they did.",
        "TRANSLATION_1": "As for those who have created schisms in their order, and formed different sects, you have no concern with them. Their affair is with God. He will tell them the truth of what they were doing.\n",
        "TRANSLATION_2": "Surely you have nothing to do with those who have made divisions in their religion and become factions. Their matter is with Allah and He will indeed tell them (in time) what they have been doing.\n",
        "TRANSLATION_3": "Some of those who have divided their religion into different sects are not your concern. Their affairs are in the hands of God Who will show them all that they have done.\n",
        "TRANSLATION_4": "You (O dear Prophet Mohammed – peace and blessings be upon him) have no concern with those who divided their religion and became several groups; their case is only with Allah – He will then inform them of what they used to do.\n",
        "TRANSLATION_5": "Verily, those who divide their religion and break up into sects, you have no concern with them in the least. Their affair is only with Allah, Who then will tell them what they used to do.\n",
        "TRANSLATION_6": "Surely they who divided their religion into parts and became sects, you have no concern with them; their affair is only with Allah, then He will inform them of what they did.\n",
        "TRANSLATION_7": "Those who have made divisions in their religion and become sects, thou art not of them in anything; their affair is unto God, then He will tell them what they have been doing.\n",
        "TRANSLATION_8": "Lo! As for those who sunder their religion and become schismatics, no concern at all hast thou with them. Their case will go to Allah, Who then will tell them what they used to do.\n",
        "TRANSLATION_9": "Have nothing to do with those who have split up their religion into sects. Their case rests with God; He will tell them about what they used to do.\n",
        "TRANSLATION_10": "Verily those who have split their religion and become sects, thou art not amongst them in aught: their affair is only with Allah. Then He will declare unto them that which they were wont to do.\n",
        "TRANSLATION_11": "Indeed those who split up their religion and became sects, you will not have anything to do with them. Their matter rests only with Allah; then He will inform them concerning what they used to do.\n",
        "TRANSLATION_12": "As for those who divide their religion and break up into sects, thou hast no part in them in the least: their affair is with Allah: He will in the end tell them the truth of all that they did.\n",
        "TRANSLATION_13": "Verily, those who divide their religion and break up into sects (all kinds of religious sects), you (O Muhammad SAW) have no concern in them in the least. Their affair is only with Allah, Who then will tell them what they used to do.\n",
        "TRANSLATION_14": "You have nothing to do with those who have made divisions in their religion and become sects. Their affair is with Allah and He will inform them of what they have done.\n",
        "TRANSLATION_15": "As for those who divided their religion and became sects—you have nothing to do with them. Their case rests with God; then He will inform them of what they used to do.\n",
        "TRANSLATION_16": "Indeed, those who have divided their religion and become sects - you, [O Muhammad], are not [associated] with them in anything. Their affair is only [left] to Allah; then He will inform them about what they used to do.\n",
        "TRANSLATION_17": "[6:159] Those who have sundered their religion, by being at variance over it, accepting some [aspects] of it and rejecting others, and have become differing parties, sects with regard to such [matters] (a variant reading [for farraqū, ‘they have sundered’] has fāraqū, meaning that they have abandoned the religion to which they were enjoined, and they are the Jews and the Christians), you have no concern with them at all, in other words, do not be concerned with them. Their case will go to God — He will take charge of it — then He will inform them, in the Hereafter, of what they used to do, and requite them for it: this was abrogated by the ‘sword’ verse [Q. 9:5].\n",
        "TRANSLATION_18": "(Lo! As for those who sunder their religion) those who have left the religion of their forefathers; it is also said that this means: those turned back on their pledge on the Day of the primordial Covenant; it can also be understood to mean: those who differed in their religion (and become schismatics) they became different groups: Judaism, Christianity and Zoroastrianism, (no concern at all hast thou with them) you are not required to fight them. However, he was later commanded to fight them. It is also said that this means: their repentance or punishment are not in your hands. (Their case will go to Allah, who then will tell them what they used to do) of good and evil.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "6:159",
            "16:20",
            "60:8",
            "42:13",
            "47:26",
            "9:4",
            "60:9",
            "22:76",
            "29:42",
            "49:16"
        ],
        "BIBLE": [
            "writings:psalms:40:6",
            "prophets:zechariah:8:13",
            "torah:deuteronomy:15:10",
            "torah:deuteronomy:28:8",
            "writings:ezra:6:12",
            "prophets:isaiah:37:20",
            "writings:ii%20chronicles:25:15",
            "prophets:joshua:7:7",
            "writings:lamentations:2:20",
            "prophets:jeremiah:38:4"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:2:5",
            
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:6"
        ]
    }
}