{
    "VERSE": "6:161",
    "ARABIC": "قُلْ إِنَّنِى هَدَىٰنِى رَبِّىٓ إِلَىٰ صِرَٰطٍ مُّسْتَقِيمٍ دِينًا قِيَمًا مِّلَّةَ إِبْرَٰهِيمَ حَنِيفًا وَمَا كَانَ مِنَ ٱلْمُشْرِكِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Say: 'My Lord has guided me to a straight path, a well-founded deen, the religion of Ibrahim, a man of pure natural belief. He was not one of the idolaters.'",
        "TRANSLATION_1": "Tell them: \"My Lord has directed me to a path that is straight, a supreme law, the creed of Abraham the upright who was not an idolater.\"\n",
        "TRANSLATION_2": "Say: 'As for me, my Lord has guided me on to a straight way, a right religion, the way of Abraham who adopted it in exclusive devotion to Allah, and he was not of those who associated others with Allah in His divinity.'\n",
        "TRANSLATION_3": "(Muhammad), tell them, \"My Lord has guided me to the right path, a well established religion and the upright tradition of Abraham who was not a pagan\".\n",
        "TRANSLATION_4": "Say, “Indeed my Lord has guided me to the Straight Path; the right religion, (of) the community of Ibrahim who was free from all falsehood; and was not a polytheist.”\n",
        "TRANSLATION_5": "Say: \"Truly, my Lord has guided me to a straight path, a right religion, the religion of Ibrahim, Hanifan (monotheism) and he was not of the Mushrikin.\"\n",
        "TRANSLATION_6": "Say: Surely, (as for) me, my Lord has guided me to the right path; (to) a most right religion, the faith of Ibrahim the upright one, and he was not of the polytheists.\n",
        "TRANSLATION_7": "Say: 'As for me, my Lord has guided me to a straight path, a right religion, the creed of Abraham, a man of pure faith; he was no idolater.'\n",
        "TRANSLATION_8": "Say: Lo! As for me, my Lord hath guided me unto a straight path, a right religion, the community of Abraham, the upright, who was no idolater.\n",
        "TRANSLATION_9": "Say, \"My Lord has guided me to a straight path, and to an upright religion, the religion of Abraham the upright, who was not of those who associate partners with God.\"\n",
        "TRANSLATION_10": "Say thou as for me, my Lord hath guided me unto a straight path, a right religion, the faith of Ibrahim, the upright, and he was not of the associaters.\n",
        "TRANSLATION_11": "Say, ‘Indeed my Lord has guided me to a straight path, the upright religion, the creed of Abraham, a Hanif, and he was not one of the polytheists.’\n",
        "TRANSLATION_12": "Say: \"Verily, my Lord hath guided me to a way that is straight,- a religion of right,- the path (trod) by Abraham the true in Faith, and he (certainly) joined not gods with Allah.\"\n",
        "TRANSLATION_13": "Say (O Muhammad SAW): \"Truly, my Lord has guided me to a Straight Path, a right religion, the religion of Ibrahim (Abraham), Hanifa [i.e. the true Islamic Monotheism - to believe in One God (Allah i.e. to worship none but Allah, Alone)] and he was not of Al-Mushrikun (see V. 2:105).\"\n",
        "TRANSLATION_14": "Say: 'My Lord has guided me to a Straight Path, an upright religion, the creed of Abraham, he was upright, not from the idolaters'\n",
        "TRANSLATION_15": "Say, “My Lord has guided me to a straight path, an upright religion, the creed of Abraham the Monotheist, who was not a polytheist.”\n",
        "TRANSLATION_16": "Say, \"Indeed, my Lord has guided me to a straight path - a correct religion - the way of Abraham, inclining toward truth. And he was not among those who associated others with Allah.\"\n",
        "TRANSLATION_17": "[6:161] Say: ‘As for me, my Lord has guided me to a straight path (ilā sirātin mustaqīm is substituted by [the following, dīnan qiyaman]) a right religion, an upright [one], the creed of Abraham, a hanīf; and he was not of the idolaters’.\n",
        "TRANSLATION_18": "(Say) Muhammad, to the people of Mecca, the Jews and to the Christians: (Lo! As for me, my Lord hath guided me unto a straight path) my Lord has honoured me with His religion and has commanded me to call people to His religion; it is also said that this means: my Lord has shown how to call people to His to (a right religion, the community of Abraham) the religion of Abraham, (the upright) who surrendered to Allah and (who was no idolater) he did not follow the idolaters in their religion. 155\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "6:161",
            "16:123",
            "2:135",
            "28:21",
            "29:30",
            "3:95",
            "26:117",
            "32:25",
            "40:27",
            "23:94"
        ],
        "BIBLE": [
            "prophets:jeremiah:10:23",
            "writings:psalms:37:23",
            "writings:ii%20chronicles:6:16",
            "prophets:isaiah:40:27",
            "prophets:isaiah:26:7",
            "prophets:i%20kings:2:4",
            "prophets:i%20kings:8:25",
            "writings:proverbs:21:8",
            "prophets:habakkuk:1:12",
            "writings:ii%20chronicles:14:10"
        ]
    }
}