{
    "VERSE": "6:162",
    "ARABIC": "قُلْ إِنَّ صَلَاتِى وَنُسُكِى وَمَحْيَاىَ وَمَمَاتِى لِلَّهِ رَبِّ ٱلْعَٰلَمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Say: 'My salat and my rites, my living and my dying, are for Allah alone, the Lord of all the worlds,",
        "TRANSLATION_1": "Tell them: \"My service and sacrifice, my life and my death, are all of them for God, the creator and Lord of all the worlds.\n",
        "TRANSLATION_2": "Say: 'Surely my Prayer, all my acts of worship, and my living and my dying are for Allah alone, the Lord of the whole universe.\n",
        "TRANSLATION_3": "Say, \"My prayer, sacrifice, life, and death are all for God, the Lord of the Universe.\n",
        "TRANSLATION_4": "Say, “Undoubtedly my prayers and my sacrifices, and my living and my dying are all for Allah, the Lord Of The Creation.”\n",
        "TRANSLATION_5": "Say: \"Verily, my Salah, my sacrifice, my living, and my dying are for Allah, the Lord of all that exists.\"\n",
        "TRANSLATION_6": "Say. Surely my prayer and my sacrifice and my life and my death are (all) for Allah, the Lord of the worlds;\n",
        "TRANSLATION_7": "Say: 'My prayer, my ritual sacrifice, my living, my dying -- all belongs to God, the Lord of all Being.\n",
        "TRANSLATION_8": "Say: Lo! my worship and my sacrifice and my living and my dying are for Allah, Lord of the Worlds.\n",
        "TRANSLATION_9": "Say, \"My prayer and my sacrifice and my life and my death are all for God, the Lord of the worlds;\n",
        "TRANSLATION_10": "Say thou: verily my prayer and my rites and my living and my dying are all for Allah, Lord of the worlds.\n",
        "TRANSLATION_11": "Say, ‘Indeed my prayer and my worship, my life and my death are for the sake of Allah, the Lord of all the worlds.\n",
        "TRANSLATION_12": "Say: \"Truly, my prayer and my service of sacrifice, my life and my death, are (all) for Allah, the Cherisher of the Worlds:\n",
        "TRANSLATION_13": "Say (O Muhammad SAW): \"Verily, my Salat (prayer), my sacrifice, my living, and my dying are for Allah, the Lord of the 'Alamin (mankind, jinns and all that exists).\n",
        "TRANSLATION_14": "Say: 'My prayers and my worship (for example, pilgrimage and sacrifice), my life and my death, are all for Allah, the Lord of the Worlds.\n",
        "TRANSLATION_15": "Say, “My prayer and my worship, and my life and my death, are devoted to God, the Lord of the Worlds.\n",
        "TRANSLATION_16": "Say, \"Indeed, my prayer, my rites of sacrifice, my living and my dying are for Allah, Lord of the worlds.\n",
        "TRANSLATION_17": "[6:162] Say: ‘My prayer and my rituals, my devotions, in the way of pilgrimage and otherwise, and my living, my life, and my dying, my death, are all for God, the Lord of the Worlds.\n",
        "TRANSLATION_18": "(Say) Muhammad: (Lo! my worship) the five daily prayers (and, my sacrifice) my religion, proof, sacrifice and worship (and my living and my dying are for Allah) in this world are for the sake of Allah's obedience and pleasure, (Lord of the Worlds) the Master of the jinn and human beings.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "6:162",
            "37:182",
            "40:66",
            "1:2",
            "35:22",
            "40:65",
            "45:36",
            "20:14",
            "6:95",
            "5:28"
        ],
        "BIBLE": [
            "prophets:joshua:22:27",
            "writings:ii%20chronicles:30:22",
            "prophets:i%20kings:20:42",
            "writings:psalms:42:9",
            "prophets:amos:4:5",
            "prophets:ii%20samuel:15:8",
            "torah:deuteronomy:17:1",
            "torah:exodus:10:25",
            "prophets:ii%20kings:19:15",
            "writings:ezra:6:10"
        ]
    }
}