{
    "VERSE": "6:24",
    "ARABIC": "ٱنظُرْ كَيْفَ كَذَبُوا۟ عَلَىٰٓ أَنفُسِهِمْ وَضَلَّ عَنْهُم مَّا كَانُوا۟ يَفْتَرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "See how they lie against themselves and how what they invented has forsaken them!",
        "TRANSLATION_1": "You will see how they will lie against themselves, and all their slanderings will be vain.\n",
        "TRANSLATION_2": "Behold, how they will lie against themselves and how their forged deities will forsake them!\n",
        "TRANSLATION_3": "Consider, how they have lied against their own souls and have lost their gods.\n",
        "TRANSLATION_4": "Observe how they lied against themselves, and how they lost the things they fabricated!\n",
        "TRANSLATION_5": "Look! How they lie against themselves! But the (lie) which they invented will disappear from them.\n",
        "TRANSLATION_6": "See how they lie against their own souls, and that which they forged has passed away from them.\n",
        "TRANSLATION_7": "Behold how they lie against themselves, and how that which they were forging has gone astray from them!\n",
        "TRANSLATION_8": "See how they lie against themselves, and (how) the thing which they devised hath failed them!\n",
        "TRANSLATION_9": "See how they lie to themselves, and how those [the deities] they invented have deserted them.\n",
        "TRANSLATION_10": "Behold! how they lied against themselves! and then failed them that which they had been fabricating.\n",
        "TRANSLATION_11": "Look, how they forswear themselves, and what they used to fabricate has forsaken them!\n",
        "TRANSLATION_12": "Behold! how they lie against their own souls! But the (lie) which they invented will leave them in the lurch.\n",
        "TRANSLATION_13": "Look! How they lie against themselves! But the (lie) which they invented will disappear from them.\n",
        "TRANSLATION_14": "Look how they lie against themselves, and how that which they were forging has gone astray from them!\n",
        "TRANSLATION_15": "Look how they lied to themselves. And what they invented deserted them.\n",
        "TRANSLATION_16": "See how they will lie about themselves. And lost from them will be what they used to invent.\n",
        "TRANSLATION_17": "[6:24] God, exalted be He, says: See, O Muhammad (s), how they lie against themselves, by denying that their idolatry, and how that which they were forging, against God, in the way of associates, has failed, is absent [before], them!\n",
        "TRANSLATION_18": "(See) Muhammad; and it is also said the address here is to the angels (how they lie against themselves) how they have prescribed upon themselves the punishment of their lies, (and (how) the thing which they devised) how what they falsely worshipped; it is also said that this means: how what they invented has become void (hath failed them!) in that they are busy with their own plight.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "6:24",
            "11:21",
            "91:7",
            "82:5",
            "14:45",
            "81:14",
            "16:111",
            "30:44",
            "18:68",
            "20:41"
        ],
        "BIBLE": [
            "prophets:joshua:23:14",
            "prophets:ii%20kings:4:25",
            "prophets:isaiah:49:21",
            "prophets:i%20kings:13:25",
            "torah:deuteronomy:1:31",
            "prophets:ii%20kings:6:20",
            "torah:genesis:39:13",
            "writings:psalms:42:5",
            "prophets:ezekiel:1:1",
            "torah:exodus:2:11"
        ]
    }
}