{
    "VERSE": "6:26",
    "ARABIC": "وَهُمْ يَنْهَوْنَ عَنْهُ وَيَنْـَٔوْنَ عَنْهُ وَإِن يُهْلِكُونَ إِلَّآ أَنفُسَهُمْ وَمَا يَشْعُرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "They keep others from it and avoid it themselves. They are only destroying themselves but they are not aware of it.",
        "TRANSLATION_1": "And they forbid others from (believing in) it, and themselves keep away from it. But they ruin none but themselves, and do not understand.\n",
        "TRANSLATION_2": "As for others, they prevent them from embracing the Truth; and themselves, they flee from it (so as to harm you). But they court their own ruin, although they do not realize it.\n",
        "TRANSLATION_3": "They keep away from the faith and forbid others to accept it. They destroy no one except themselves, yet they do not realize it.\n",
        "TRANSLATION_4": "And they stop (others) from it and run away from it; and they ruin none except themselves, and they do not have sense.\n",
        "TRANSLATION_5": "And they prevent others from him and they themselves keep away from him, and (by doing so) they destroy none but themselves, yet they perceive (it) not.\n",
        "TRANSLATION_6": "And they prohibit (others) from it and go far away from it, and they only bring destruction upon their own souls while they do not perceive.\n",
        "TRANSLATION_7": "And they forbid it, and keep afar from it, and it is only themselves they destroy, but they are not aware.\n",
        "TRANSLATION_8": "And they forbid (men) from it and avoid it, and they ruin none save themselves, though they perceive not.\n",
        "TRANSLATION_9": "and they bar others from believing and themselves keep away. But they ruin no one but themselves, though they fail to realize this.\n",
        "TRANSLATION_10": "And they prohibit others therefrom, and they withdraw therefrom, and they destroy not but their own souls while they perceive not.\n",
        "TRANSLATION_11": "They dissuade [others] from [following] him, and [themselves] avoid him; yet they destroy no one except themselves, but they are not aware.\n",
        "TRANSLATION_12": "Others they keep away from it, and themselves they keep away; but they only destroy their own souls, and they perceive it not.\n",
        "TRANSLATION_13": "And they prevent others from him (from following Prophet Muhammad SAW) and they themselves keep away from him, and (by doing so) they destroy not but their ownselves, yet they perceive (it) not.\n",
        "TRANSLATION_14": "They forbid from it (the Koran) and keep away from it. They destroy none except themselves, though they do not sense it.\n",
        "TRANSLATION_15": "They keep others from it, and avoid it themselves; but they ruin only their own souls, and they do not realize.\n",
        "TRANSLATION_16": "And they prevent [others] from him and are [themselves] remote from him. And they do not destroy except themselves, but they perceive [it] not.\n",
        "TRANSLATION_17": "[6:26] And, to people, they forbid it, the following of the Prophet (s), and keep away from it, and so they do not believe in him: it is said that this was revealed regarding Abū Tālib, who used to forbid [people from] hurting him, but did not [himself] believe in him; and it is only themselves they destroy, when they keep away from him, because the harm thereof will befall them, but they do not perceive, this.\n",
        "TRANSLATION_18": "(And they) Abu Jahl and his folk (forbid (men) from it) from Muhammad and the Qur'an (and avoid it) prevent people from it and steer away from it; it is also said that this relates to Abu Talib [the Prophet's uncle] who used to warn against harming the Prophet (pbuh) even though he did not accept his message, (and they ruin none save themselves, though they perceive not) they do not realise that they carry the same sins of the men they are warning.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "6:26",
            "2:9",
            "11:21",
            "91:7",
            "82:5",
            "20:41",
            "6:24",
            "21:102",
            "7:192",
            "12:32"
        ],
        "BIBLE": [
            "prophets:ii%20kings:6:19",
            "torah:exodus:21:22",
            "torah:deuteronomy:4:3",
            "torah:genesis:19:8",
            "torah:genesis:44:4",
            "torah:deuteronomy:7:4",
            "torah:genesis:24:5",
            "prophets:i%20kings:14:8",
            "torah:genesis:24:8",
            "prophets:i%20kings:9:6"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:3:5",
            "Sefer%20Yetzirah:1:6"
        ]
    }
}