{
    "VERSE": "6:29",
    "ARABIC": "وَقَالُوٓا۟ إِنْ هِىَ إِلَّا حَيَاتُنَا ٱلدُّنْيَا وَمَا نَحْنُ بِمَبْعُوثِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "They say, 'There is nothing but this life and we will not be raised again.'",
        "TRANSLATION_1": "They say: \"There is no other life but that of this world, and we will not be raised (from the dead).\"\n",
        "TRANSLATION_2": "They say now: 'There is nothing but the life of this world, and we shall not be raised from the dead.'\n",
        "TRANSLATION_3": "They have said that this life is the only life and that there will be no Resurrection.\n",
        "TRANSLATION_4": "And they said, “There is no other life except our life of this world, and we are not to be raised.”\n",
        "TRANSLATION_5": "And they said: \"There is no (other life) but our (present) life of this world, and never shall we be resurrected.\"\n",
        "TRANSLATION_6": "And they say: There is nothing but our life of this world, and we shall not be raised.\n",
        "TRANSLATION_7": "And they say, 'There is only our present life; we shall not be raised.'\n",
        "TRANSLATION_8": "And they say: There is naught save our life of the world, and we shall not be raised (again).\n",
        "TRANSLATION_9": "They say, \"There is nothing beyond our life in this world: we shall not be raised up again from the dead.\"\n",
        "TRANSLATION_10": "And they say: there is naught but our life of the world, nor are we to be raised.\n",
        "TRANSLATION_11": "They say, ‘There is nothing but our life of this world, and we shall not be resurrected.’\n",
        "TRANSLATION_12": "And they (sometimes) say: \"There is nothing except our life on this earth, and never shall we be raised up again.\"\n",
        "TRANSLATION_13": "And they said: \"There is no (other life) but our (present) life of this world, and never shall we be resurrected (on the Day of Resurrection).\"\n",
        "TRANSLATION_14": "They say: 'There is only but our present life; we shall not be resurrected'\n",
        "TRANSLATION_15": "And they say, “There is nothing but our life in this world, and we will not be resurrected.”\n",
        "TRANSLATION_16": "And they say, \"There is none but our worldly life, and we will not be resurrected.\"\n",
        "TRANSLATION_17": "[6:29] And they, those who deny the Resurrection, say, ‘There is no other, life, than our present life; we shall not be resurrected’.\n",
        "TRANSLATION_18": "(And they say) i.e. the disbelievers of Mecca: (There is naught save our life of the world, and we shall not be raised (again)) after we die.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "6:29",
            "23:37",
            "53:29",
            "79:38",
            "45:24",
            "10:7",
            "20:72",
            "30:7",
            "87:16",
            "14:27"
        ],
        "BIBLE": [
            "prophets:hosea:6:2",
            "prophets:jeremiah:29:15",
            "prophets:isaiah:25:9",
            "torah:numbers:22:30",
            "torah:genesis:47:9",
            "prophets:ii%20samuel:18:20",
            "prophets:i%20kings:14:14",
            "prophets:isaiah:14:9",
            "torah:genesis:47:8",
            "prophets:jeremiah:25:32"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:3:7",
            "Sefer%20Yetzirah:4:8",
            "Sefer%20Yetzirah:3:6",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:11",
            "Sefer%20Yetzirah:3:5"
        ]
    }
}