{
    "VERSE": "6:34",
    "ARABIC": "وَلَقَدْ كُذِّبَتْ رُسُلٌ مِّن قَبْلِكَ فَصَبَرُوا۟ عَلَىٰ مَا كُذِّبُوا۟ وَأُوذُوا۟ حَتَّىٰٓ أَتَىٰهُمْ نَصْرُنَا وَلَا مُبَدِّلَ لِكَلِمَٰتِ ٱللَّهِ وَلَقَدْ جَآءَكَ مِن نَّبَإِى۟ ٱلْمُرْسَلِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Messengers before you were also denied but they were steadfast in the face of the denial and injury they suffered until Our help arrived. There is no changing the Words of Allah. And news of other Messengers has come to you.",
        "TRANSLATION_1": "Many an apostle has been accused of lies before you. Yet they bore with fortitude the falsehoods and the hurt until our help arrived. There is no changing the word of God: The news of (past) apostles has come to you already.\n",
        "TRANSLATION_2": "Messengers before you have been given the lie to, and they endured with patience their being given the lie to and being persecuted until the time when Our help reached them. None has the power to alter the words of Allah. Indeed some account of the Messengers has already reached you.\n",
        "TRANSLATION_3": "The Messengers who lived before you were also accused of lying, but they exercised patience. They were cruelly persecuted before We gave them victory. No one can change the words of God. You have already received news about the Messengers.\n",
        "TRANSLATION_4": "And indeed Noble Messengers have been denied before you, so they patiently bore the denial and torture till Our help reached them; and there is none to alter the decisions of Allah; and the news of the Noble Messengers have already reached you.\n",
        "TRANSLATION_5": "Verily, (many) Messengers were denied before you, but with patience they bore the denial, and they were hurt, till Our help reached them, and none can alter the Words of Allah. Surely, there has reached you the information about the Messengers (before you).\n",
        "TRANSLATION_6": "And certainly apostles before you were rejected, but they were patient on being rejected and persecuted until Our help came to them; and there is none to change the words of Allah, and certainly there has come to you some information about the apostles.\n",
        "TRANSLATION_7": "Messengers indeed were cried lies to before thee, yet they endured patiently that they were cried lies to, and were hurt, until Our help came unto them. No man can change the words of God; and there has already come to thee some tiding of the Envoys.\n",
        "TRANSLATION_8": "Messengers indeed have been denied before thee, and they were patient under the denial and the persecution till Our succour reached them. There is none to alter the decisions of Allah. Already there hath reached thee (somewhat) of the tidings of the messengers (We sent before).\n",
        "TRANSLATION_9": "Other messengers have been denied before you, and they bore their rejection and persecution steadfastly, until Our help came to them. There is no one who can change the words of God. You have already received some account of those messengers.\n",
        "TRANSLATION_10": "And apostles have assuredly been belied before thee, but they patiently bare that wherefore they were belied, and they were hurt, until Our succour came to them. And none can change the words of Allah; and assuredly there hath come unto thee some tidings of the sent ones.\n",
        "TRANSLATION_11": "Apostles were certainly denied before you, yet they patiently bore being denied and tormented until Our help came to them. Nothing can change the words of Allah, and there have certainly come to you some of the accounts of the apostles.\n",
        "TRANSLATION_12": "Rejected were the messengers before thee: with patience and constancy they bore their rejection and their wrongs, until Our aid did reach them: there is none that can alter the words (and decrees) of Allah. Already hast thou received some account of those messengers.\n",
        "TRANSLATION_13": "Verily, (many) Messengers were denied before you (O Muhammad SAW), but with patience they bore the denial, and they were hurt, till Our Help reached them, and none can alter the Words (Decisions) of Allah. Surely there has reached you the information (news) about the Messengers (before you).\n",
        "TRANSLATION_14": "Messengers indeed were belied before you, yet they became patient with that which they were belied, and were hurt until Our help came to them. There is none to alter the Words of Allah; and there has already come to you some news of the Messengers.\n",
        "TRANSLATION_15": "Other messengers before you were rejected, but they endured rejection and persecution until Our help came to them. There can be no change to God’s words. News of the Messengers has already reached you.\n",
        "TRANSLATION_16": "And certainly were messengers denied before you, but they were patient over [the effects of] denial, and they were harmed until Our victory came to them. And none can alter the words of Allah. And there has certainly come to you some information about the [previous] messengers.\n",
        "TRANSLATION_17": "[6:34] Messengers indeed have been denied before you — herein is a consolation for the Prophet (s) — yet they endured patiently the denial and the persecution until Our victorious help came to them, through the destruction of their peoples, so be patient until the victorious help comes to you through the destruction of   your people. There is none to change the words of God, His promises, and there has already come to you tidings of the messengers, [tidings] through which your heart can be at peace.\n",
        "TRANSLATION_18": "(Messengers indeed have been denied before thee) their people denied them as your people deny you now, (and they were patient under the denial) of their own people (and the persecution) and they were patient in the face of their people's harm (till Our succour reached them) through the destruction of their people. (There is none to alter the decisions of Allah) in that He helps His friends against His enemies. (Already there hath reached thee) Muhammad ((somewhat) of the tidings of the messengers (We sent before)) how their people denied them, as your people deny you now, and how they were patient.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "6:34",
            "4:164",
            "7:101",
            "29:3",
            "35:4",
            "30:47",
            "4:80",
            "21:41",
            "40:78",
            "12:110"
        ],
        "BIBLE": [
            "writings:ecclesiastes:1:13",
            "writings:ecclesiastes:5:18",
            "prophets:i%20kings:13:5",
            "writings:ii%20chronicles:35:21",
            "writings:job:42:11",
            "prophets:i%20samuel:2:15",
            "prophets:i%20kings:3:12",
            "writings:ecclesiastes:3:10",
            "writings:daniel:2:37",
            "torah:deuteronomy:16:17"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:4:10"
        ]
    }
}