{
    "VERSE": "6:36",
    "ARABIC": "إِنَّمَا يَسْتَجِيبُ ٱلَّذِينَ يَسْمَعُونَ وَٱلْمَوْتَىٰ يَبْعَثُهُمُ ٱللَّهُ ثُمَّ إِلَيْهِ يُرْجَعُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Only those who can hear respond. As for the dead, Allah will raise them up, then to Him they will be returned.",
        "TRANSLATION_1": "Only they will respond who can hear. As for the dead, raised they will be by God, then to Him they will be returned.\n",
        "TRANSLATION_2": "Only they who listen can respond to the call of the Truth; as for the dead, Allah will raise them and then to Him they will be returned.\n",
        "TRANSLATION_3": "Only those who have understanding will accept your faith. (Those who have no understanding) are like the dead whom God will resurrect and to Him will all return.\n",
        "TRANSLATION_4": "It is only those who hear (with sincere hearts) that accept faith; and Allah will raise these people dead of heart, then towards Him they will be herded.\n",
        "TRANSLATION_5": "It is only those who listen, that will respond, but as for the dead, Allah will raise them up, then to Him they will be returned.\n",
        "TRANSLATION_6": "Only those accept who listen; and (as to) the dead, Allah will raise them, then to Him they shall be returned.\n",
        "TRANSLATION_7": "Answer only will those who hear; as for the dead, God will raise them up, then unto Him they will be returned.\n",
        "TRANSLATION_8": "Only those can accept who hear. As for the dead, Allah will raise them up; then unto Him they will be returned.\n",
        "TRANSLATION_9": "Only they who listen can respond to a call; and as for the dead, God will raise them up, and then they will all return to Him.\n",
        "TRANSLATION_10": "Only those respond who hearken. And as to the dead, Allah will raise them, and thereafter unto Him they shall be returned.\n",
        "TRANSLATION_11": "Only those who listen will respond [to you]. As for the dead, Allah will resurrect them, then they will be brought back to Him.\n",
        "TRANSLATION_12": "Those who listen (in truth), be sure, will accept: as to the dead, Allah will raise them up; then will they be turned unto Him.\n",
        "TRANSLATION_13": "It is only those who listen (to the Message of Prophet Muhammad SAW), will respond (benefit from it), but as for the dead (disbelievers), Allah will raise them up, then to Him they will be returned (for their recompense).\n",
        "TRANSLATION_14": "Those who listen will surely answer. As for the dead, Allah will revive them. To Him they shall return.\n",
        "TRANSLATION_15": "Only those who listen will respond. As for the dead, God will resurrect them; then to Him they will be returned.\n",
        "TRANSLATION_16": "Only those who hear will respond. But the dead - Allah will resurrect them; then to Him they will be returned.\n",
        "TRANSLATION_17": "[6:36] Only those who hear, in such a way so as to understand and take heed, will answer, your call to faith; as for the dead, that is, the disbelievers — they are likened to them on account of their inability to hear — God will resurrect them, in the Hereafter, and then to Him they will be returned, and He will requite them for their deeds.\n",
        "TRANSLATION_18": "(Only those can accept) believe and obey (who hear) who give their assent; it is also said: those who comprehend admonition. (As for the dead) the dead of the Battle Badr, Uhud, and the Battle of the Confederates; it is also said that this means: the dead of heart, (Allah will raise them up) after death; (then unto Him they will be returned) in the place of mustering and He will reward them for their works.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "6:36",
            "2:156",
            "25:71",
            "35:22",
            "2:28",
            "3:141",
            "16:128",
            "9:43",
            "16:23",
            "7:180"
        ],
        "BIBLE": [
            "prophets:i%20samuel:2:35",
            "prophets:jeremiah:24:7",
            "writings:daniel:11:28",
            "prophets:i%20kings:18:37",
            "prophets:jeremiah:31:18",
            "torah:deuteronomy:30:3",
            "prophets:ii%20samuel:19:15",
            "writings:psalms:105:25",
            "prophets:i%20samuel:18:11",
            "torah:genesis:42:28"
        ]
    }
}