{
    "VERSE": "6:37",
    "ARABIC": "وَقَالُوا۟ لَوْلَا نُزِّلَ عَلَيْهِ ءَايَةٌ مِّن رَّبِّهِۦ قُلْ إِنَّ ٱللَّهَ قَادِرٌ عَلَىٰٓ أَن يُنَزِّلَ ءَايَةً وَلَٰكِنَّ أَكْثَرَهُمْ لَا يَعْلَمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "They ask, 'Why has no Sign been sent down to him from his Lord?' Say, 'Allah has the power to send down a Sign.' But most of them do not know it.",
        "TRANSLATION_1": "They say: \"How is it no miracle was sent down to him from his Lord?\" Say: \"God certainly has power to send down a miracle; but most men cannot understand.\"\n",
        "TRANSLATION_2": "And they say: 'Why has no miraculous sign been sent down to him from his Lord?' Say: 'Surely Allah has the power to send down a sign, but most of them do not know.\n",
        "TRANSLATION_3": "They say, \"Why have not some miracles been given to him, (Muhammad), from his Lord.\" Tell them, (Muhammad), \"God certainly has the Power to show such miracles but many of them are ignorant.\"\n",
        "TRANSLATION_4": "And they said, “Why has no sign been sent down upon him from his Lord?” Say, “Indeed Allah is Able to send down a sign”, but most of them are totally ignorant.\n",
        "TRANSLATION_5": "And they said: \"Why is not a sign sent down to him from his Lord\" Say: \"Allah is certainly able to send down a sign, but most of them know not.\"\n",
        "TRANSLATION_6": "And they say: Why has not a sign been sent down to him from his Lord? Say: Surely Allah is able to send down a sign, but most of them do not know.\n",
        "TRANSLATION_7": "They also say, 'Why has no sign been sent down upon him from his Lord?' Say: 'Surely God is able to send down a sign, but most of them know not.'\n",
        "TRANSLATION_8": "They say: Why hath no portent been sent down upon him from his Lord? Say: Lo! Allah is Able to send down a portent. But most of them know not.\n",
        "TRANSLATION_9": "They ask, \"Why has no sign been sent down to him from his Lord?\" Say, \"God alone has the power to send down a sign.\" But most of them do not understand:\n",
        "TRANSLATION_10": "And they say: wherefore is not a sign sent down upon him from his Lord? Say thou: verily Allah is able to send down a sign, howbeit most of them know not.\n",
        "TRANSLATION_11": "They say, ‘Why has not a sign been sent down to him from his Lord?’ Say, ‘Allah is indeed able to send down a sign,’ but most of them do not know.\n",
        "TRANSLATION_12": "They say: \"Why is not a sign sent down to him from his Lord?\" Say: \"Allah hath certainly power to send down a sign: but most of them understand not.\n",
        "TRANSLATION_13": "And they said: \"Why is not a sign sent down to him from his Lord?\" Say: \"Allah is certainly Able to send down a sign, but most of them know not.\"\n",
        "TRANSLATION_14": "They ask: 'Why has no sign been sent down to him from his Lord' Say: 'Allah is Able to send down a sign' But most of them do not know.\n",
        "TRANSLATION_15": "And they say, “If only a sign could come down to him from his Lord.” Say, “God is Able to send down a sign, but most of them do not know.”\n",
        "TRANSLATION_16": "And they say, \"Why has a sign not been sent down to him from his Lord?\" Say, \"Indeed, Allah is Able to send down a sign, but most of them do not know.\"\n",
        "TRANSLATION_17": "[6:37] And they, the disbelievers of Mecca, say, ‘Why has a sign not been sent down to him from his Lord?’, [a sign] such as the she-camel [of the prophet Sālih] or the staff [of Moses] or the Table [of Jesus]. Say, to them: ‘Surely God has the power to send down (read yunazzil or yunzil) a sign, from among those they have requested, but most of them do not know’, that its sending down would be a trial for them, for if they then [still] denied it, they would necessarily be destroyed.\n",
        "TRANSLATION_18": "(They say) i.e. the disbelievers of Mecca: al-Harth Ibn 'Amir and his folk: Abu Jahl Ibn Hisham, al-Walid Ibn al-Mughira, Umayyah and Ubayy the sons of Khalaf: (Why hath no portent been sent down upon him from his Lord) to prove his prophethood? (Say) to them, Muhammad: (Lo! Allah is Able to send down a portent) as they have asked. (But most of them know not) they have no knowledge of it being sent.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "6:37",
            "13:27",
            "10:20",
            "8:2",
            "29:50",
            "6:33",
            "6:4",
            "6:21",
            "26:139",
            "46:13"
        ],
        "BIBLE": [
            "writings:ii%20chronicles:25:9",
            "prophets:joshua:2:9",
            "torah:deuteronomy:16:17",
            "prophets:i%20kings:13:5",
            "writings:ii%20chronicles:35:21",
            "prophets:ezekiel:20:12",
            "writings:ii%20chronicles:19:6",
            "writings:ecclesiastes:5:18",
            "torah:deuteronomy:3:18",
            "prophets:ezekiel:4:15"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:11"
        ]
    }
}