{
    "VERSE": "6:43",
    "ARABIC": "فَلَوْلَآ إِذْ جَآءَهُم بَأْسُنَا تَضَرَّعُوا۟ وَلَٰكِن قَسَتْ قُلُوبُهُمْ وَزَيَّنَ لَهُمُ ٱلشَّيْطَٰنُ مَا كَانُوا۟ يَعْمَلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "If only they had humbled themselves when Our violent force came upon them! However, their hearts were hard and Shaytan made what they were doing seem attractive to them.",
        "TRANSLATION_1": "Then why did they not submit when Our punishment came upon them? But their hearts were hardened, and Satan made things they were doing look attractive to them.\n",
        "TRANSLATION_2": "But when misfortune befell them from Us why did they not humble themselves? Their hearts had hardened and Satan had made their deeds seem fair to them.\n",
        "TRANSLATION_3": "Why did they not submit themselves (to God) when Our torment struck them. Instead, their hearts were hardened and Satan made their evil deeds seem attractive to them.\n",
        "TRANSLATION_4": "So why did they not humbly plead when Our punishment came to them? But their hearts were hardened and the devil made all their deeds appear good to them!\n",
        "TRANSLATION_5": "When Our torment reached them, why then did they not believe with humility But their hearts became hardened, and Shaytan made fair-seeming to them that which they used to do.\n",
        "TRANSLATION_6": "Yet why did they not, when Our punishment came to them, humble themselves? But their hearts hardened and the Shaitan made what they did fair-seeming to them.\n",
        "TRANSLATION_7": "if only, when Our might came upon them, they had been humble! But their hearts were hard, and Satan decked out fair to them what they were doing.\n",
        "TRANSLATION_8": "If only, when Our disaster came on them, they had been humble! But their hearts were hardened and the devil made all that they used to do seem fair unto them!\n",
        "TRANSLATION_9": "When the affliction decreed by Us befell them, they did not humble themselves, but rather their hearts hardened, for Satan had made all their doings seem fair to them.\n",
        "TRANSLATION_10": "Wherefore then did they not, when the affliction from us came upon them, humble themselves? But their hearts became hardened, and the Satan made fair-seeming unto them that which they were wont to do.\n",
        "TRANSLATION_11": "Why did they not entreat when Our punishment overtook them! But their hearts had hardened, and Satan had made what they had been doing seem decorous to them.\n",
        "TRANSLATION_12": "When the suffering reached them from us, why then did they not learn humility? On the contrary their hearts became hardened, and Satan made their (sinful) acts seem alluring to them.\n",
        "TRANSLATION_13": "When Our Torment reached them, why then did they not believe with humility? But their hearts became hardened, and Shaitan (Satan) made fair-seeming to them that which they used to do.\n",
        "TRANSLATION_14": "If only they humbled themselves when Our scourge overtook them! But their hearts were hardened, and satan decorated to them what they were doing.\n",
        "TRANSLATION_15": "If only, when Our calamity came upon them, they humbled themselves. But their hearts hardened, and Satan made their deeds appear good to them.\n",
        "TRANSLATION_16": "Then why, when Our punishment came to them, did they not humble themselves? But their hearts became hardened, and Satan made attractive to them that which they were doing.\n",
        "TRANSLATION_17": "[6:43] If only, when Our might, Our punishment, came upon them, they had been humble, in other words, they were not so, even though the necessitating factor was there. But their hearts were hard, and would not yield to faith, and Satan adorned for them what they were doing, in the way of disobedient acts, and so they persisted in them.\n",
        "TRANSLATION_18": "(If only, when our disaster) punishment (came on them, they had been humble) they had believed! (But their hearts were hardened) their hearts dried up (and the devil made all that they used to do) in their disbelief that such is the state of life: hardship alternates with ease and comfort (seem fair unto them!)\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "6:43",
            "7:175",
            "7:201",
            "26:210",
            "22:53",
            "22:35",
            "40:84",
            "13:28",
            "21:12",
            "4:63"
        ],
        "BIBLE": [
            "prophets:i%20samuel:4:13",
            "prophets:ii%20kings:8:9",
            "writings:daniel:10:12",
            "torah:deuteronomy:1:32",
            "prophets:i%20samuel:25:37",
            "prophets:joshua:21:45",
            "prophets:i%20samuel:25:15",
            "writings:i%20chronicles:12:18",
            "writings:ecclesiastes:9:2",
            "prophets:zechariah:8:17"
        ]
    }
}