{
    "VERSE": "6:48",
    "ARABIC": "وَمَا نُرْسِلُ ٱلْمُرْسَلِينَ إِلَّا مُبَشِّرِينَ وَمُنذِرِينَ فَمَنْ ءَامَنَ وَأَصْلَحَ فَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "We do not send the Messengers except to bring good news and to give warning. As for those who have iman and put things right, they will feel no fear and will know no sorrow.",
        "TRANSLATION_1": "We do not send apostles but to give good tidings and to warn. Then those who believe or reform will have neither fear nor regret.\n",
        "TRANSLATION_2": "We do not send Messengers except as bearers of glad tidings and warners. So, he who believes in their message and mends his conduct need have no fear and need not grieve;\n",
        "TRANSLATION_3": "We did not send the Messengers for any other reason than to bring (people) the glad news (of God's mercy) and to warn (them of the torment brought on by disobedience to God). Whoever accepts the faith and lives a righteous life will have nothing to fear, nor will he be grieved.\n",
        "TRANSLATION_4": "And We did not send Noble Messengers except as Heralds of glad tidings and warnings; so upon those who accept faith and reform themselves, shall be no fear nor shall they grieve.\n",
        "TRANSLATION_5": "And We send not the Messengers but as givers of glad tidings and as warners. So whosoever believes and does righteous good deeds, upon such shall come no fear, nor shall they grieve.\n",
        "TRANSLATION_6": "And We send not apostles but as announcers of good news and givers of warning, then whoever believes and acts aright, they shall have no fear, nor shall they grieve.\n",
        "TRANSLATION_7": "We do not send the Envoys, except good tidings to bear, and warning; whoever believes and makes amends -- no fear shall be on them, neither shall they sorrow.\n",
        "TRANSLATION_8": "We send not the messengers save as bearers of good news and warners. Whoso believeth and doeth right, there shall no fear come upon them neither shall they grieve.\n",
        "TRANSLATION_9": "We send the messengers only to give good news and to warn, so those who believe and reform themselves need have no fear, nor will they grieve.\n",
        "TRANSLATION_10": "And We send not the sent ones except as bearers of glad tidings and warners. Then whosoever believeth and amendeth, on such shell come no fear nor they shall grieve.\n",
        "TRANSLATION_11": "We do not send the apostles except as bearers of good news and warners. As for those who are faithful and righteous, they will have no fear, nor will they grieve.\n",
        "TRANSLATION_12": "We send the messengers only to give good news and to warn: so those who believe and mend (their lives),- upon them shall be no fear, nor shall they grieve.\n",
        "TRANSLATION_13": "And We send not the Messengers but as givers of glad tidings and as warners. So whosoever believes and does righteous good deeds, upon such shall come no fear, nor shall they grieve.\n",
        "TRANSLATION_14": "We send forth Our Messengers only to give glad tidings to mankind and to warn them. Those who believe and mend their ways shall have nothing to fear or to be saddened.\n",
        "TRANSLATION_15": "We sent the messengers only as bearers of good news and as warners. Those who believe and reform have nothing to fear, nor shall they grieve.\n",
        "TRANSLATION_16": "And We send not the messengers except as bringers of good tidings and warners. So whoever believes and reforms - there will be no fear concerning them, nor will they grieve.\n",
        "TRANSLATION_17": "[6:48] We do not send messengers, except as bearers of good tidings, to those who believe, [good tidings] of Paradise, and as warners, to those who disbelieve, [warning] of the Fire. Whoever believes, in them, and makes amends, in his deeds, no fear shall befall them, neither shall they grieve, in the Hereafter.\n",
        "TRANSLATION_18": "(We send not the messengers save as bearers of good news) of Paradise for whoever believes (and warners) of the Fire for whoever disbelieves. (Whoso believeth) in the messengers and Scriptures (and doeth right) regarding that which is between him and his Lord, (there shall no fear come upon them) when fear comes upon the folk of hell (neither shall they grieve) when the people of hell grieve.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "6:48",
            "2:38",
            "27:85",
            "51:45",
            "26:99",
            "83:33",
            "24:3",
            "5:69",
            "26:94",
            "7:35"
        ],
        "BIBLE": [
            "prophets:i%20kings:19:2",
            "torah:deuteronomy:28:29",
            "prophets:jeremiah:15:20",
            "prophets:ii%20kings:10:5",
            "writings:psalms:71:16",
            "writings:daniel:6:13",
            "prophets:ezekiel:39:26",
            "torah:exodus:32:30",
            "torah:leviticus:5:26",
            "prophets:joshua:1:8"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:1"
        ]
    }
}