{
    "VERSE": "6:50",
    "ARABIC": "قُل لَّآ أَقُولُ لَكُمْ عِندِى خَزَآئِنُ ٱللَّهِ وَلَآ أَعْلَمُ ٱلْغَيْبَ وَلَآ أَقُولُ لَكُمْ إِنِّى مَلَكٌ إِنْ أَتَّبِعُ إِلَّا مَا يُوحَىٰٓ إِلَىَّ قُلْ هَلْ يَسْتَوِى ٱلْأَعْمَىٰ وَٱلْبَصِيرُ أَفَلَا تَتَفَكَّرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Say: 'I do not say to you that I possess the treasuries of Allah, nor do I know the Unseen, nor do I say to you that I am an angel. I only follow what has been revealed to me.' Say: 'Are the blind the same as those who can see? So will you not reflect?'",
        "TRANSLATION_1": "Tell them: \"I do not say that I possess the treasures of God, or have knowledge of the Unknown, or that I am an angel. I only follow what is sent down to me.\" And say: \"How can a blind man and a man who can see, be alike? Will you not reflect?\"\n",
        "TRANSLATION_2": "(O Muhammad!) Say: 'I do not say to you I have the treasures of Allah. Nor do I have knowledge of what is beyond the reach of human perception. Nor do I say to you: I am an angel. I only follow what is revealed to me.' Then ask them: 'Are the blind and the seeing alike?' Do you not then reflect?\n",
        "TRANSLATION_3": "(Muhammad), tell them, \"I do not claim to have all the treasures of God in my hands, nor to know the unseen, nor do I claim to be an angel. I follow only what is revealed to me (from God).\" Say to them, \"Are the blind and the seeing equal?\" Why then do you not think?\n",
        "TRANSLATION_4": "Say (O dear Prophet Mohammed – peace and blessings be upon him), “I do not say to you that I possess the treasures of Allah, nor do I say that I gain knowledge of the hidden on my own, nor do I say to you that I am an angel; I only follow what is divinely revealed to me”; say, “Will the blind and the sighted ever be equal? So do you not think?”\n",
        "TRANSLATION_5": "Say: \"I don't tell you that with me are the treasures of Allah, nor (that) I know the Unseen; nor do I tell you that I am an angel. I but follow what is revealed to me.\" Say: \"Are the blind and the one who sees equal Will you not then consider\"\n",
        "TRANSLATION_6": "Say: I do not say to you, I have with me the treasures of Allah, nor do I know the unseen, nor do I say to you that I am an angel; I do not follow aught save that which is revealed to me. Say: Are the blind and the seeing one alike? Do you not then reflect?\n",
        "TRANSLATION_7": "Say: 'I do not say to you, \"I possess the treasuries of God\"; I know not the Unseen. And I say not to you, \"I am an angel\"; I only follow what is revealed to me. Say: 'Are the blind and the seeing man equal? Will you not reflect?'\n",
        "TRANSLATION_8": "Say (O Muhammad, to the disbelievers): I say not unto you (that) I possess the treasures of Allah, nor that I have knowledge of the Unseen; and I say not unto you: Lo! I am an angel. I follow only that which is inspired in me. Say: Are the blind man and the seer equal? Will ye not then take thought?\n",
        "TRANSLATION_9": "Say, \"I do not say to you that I possess the treasures of God, nor do I know the unseen, nor do I say to you that I am an angel. I follow only that which is revealed to me.\" Say, \"Are the blind and the seeing alike? Can you not then think?\"\n",
        "TRANSLATION_10": "Say thou: I say not unto you, that with me are the treasures of Allah, nor I know the Unseen, nor say unto you that I am an angel; I but follow that which hath been revealed unto me. Say thou: are the blind and the seeing equal? Will ye not then consider?\n",
        "TRANSLATION_11": "Say, ‘I do not say to you that I possess the treasuries of Allah, nor do I know the Unseen, nor do I say to you that I am an angel. I follow only what is revealed to me.’ Say, ‘Are the blind one and the seer equal? So do you not reflect?’\n",
        "TRANSLATION_12": "Say: \"I tell you not that with me are the treasures of Allah, nor do I know what is hidden, nor do I tell you I am an angel. I but follow what is revealed to me.\" Say: \"can the blind be held equal to the seeing?\" Will ye then consider not?\n",
        "TRANSLATION_13": "Say (O Muhammad SAW): \"I don't tell you that with me are the treasures of Allah, nor (that) I know the unseen; nor I tell you that I am an angel. I but follow what is revealed to me by inspiration.\" Say: \"Are the blind and the one who sees equal? will you not then take thought?\"\n",
        "TRANSLATION_14": "Say: 'I do not tell you that I have the treasuries of Allah or know the unseen, nor do I claim to be an angel. I follow only that which is revealed to me' Say: 'Are the blind and the seeing alike? Will you not think'\n",
        "TRANSLATION_15": "Say, “I do not say to you that I possess the treasuries of God, nor do I know the future, nor do I say to you that I am an angel. I only follow what is inspired to me.” Say, “Are the blind and the seeing alike? Do you not think?”\n",
        "TRANSLATION_16": "Say, [O Muhammad], \"I do not tell you that I have the depositories [containing the provision] of Allah or that I know the unseen, nor do I tell you that I am an angel. I only follow what is revealed to me.\" Say, \"Is the blind equivalent to the seeing? Then will you not give thought?\"\n",
        "TRANSLATION_17": "[6:50] Say, to them: ‘I do not say to you, “I possess the treasure houses of God”, from which He provides sustenance; and I do not have knowledge of the Unseen, that which is hidden from me and has not been revealed to me. And I do not say to you, “I am an angel”, from among the angels; I only follow what is revealed to me.’ Say: ‘Is the blind man, the disbeliever, equal to the seeing man, the believer? No! Will you   not then reflect’ upon this and believe?\n",
        "TRANSLATION_18": "(Say) Muhammad, to the people of Mecca: (I say not unto you (that) I possess) the keys to (the treasures of Allah): vegetations, fruits, rain or punishment, (nor that I have knowledge of the Unseen) when punishment is inflicted; (and I say not unto you: Lo! I am an angel) from heaven. (I follow) I do and say (only that which is inspired in me) only that which I am commanded with in the Qur'an. (Say) Muhammad: (Are the blind man and the seer equal?) Are the believer and disbeliever equal in acts of obedience and reward? (Will ye not then take thought) about the similes of the Qur'an? This verse was revealed about Abu Jahl and his companions al-Nadr Ibn al-Harith and 'Uyaynah, and then it was revealed about the clients.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "6:50",
            "11:31",
            "49:18",
            "2:110",
            "6:57",
            "40:44",
            "63:7",
            "2:76",
            "3:163",
            "35:19"
        ],
        "BIBLE": [
            "torah:genesis:22:12",
            "prophets:i%20kings:20:13",
            "writings:ii%20chronicles:25:15",
            "torah:genesis:33:10",
            "torah:genesis:31:42",
            "prophets:i%20samuel:5:7",
            "torah:deuteronomy:21:7",
            "writings:i%20chronicles:12:18",
            "prophets:ezekiel:8:15",
            "prophets:ii%20kings:5:21"
        ]
    }
}