{
    "VERSE": "6:51",
    "ARABIC": "وَأَنذِرْ بِهِ ٱلَّذِينَ يَخَافُونَ أَن يُحْشَرُوٓا۟ إِلَىٰ رَبِّهِمْ لَيْسَ لَهُم مِّن دُونِهِۦ وَلِىٌّ وَلَا شَفِيعٌ لَّعَلَّهُمْ يَتَّقُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Warn by it those who fear they will be gathered to their Lord, having no protector or intercessor apart from Him, so that hopefully they will have taqwa.",
        "TRANSLATION_1": "Warn those who fear, through this (Qur'an), that they will be gathered before their Lord, and they will have none to protect or intercede for them apart from Him. They may haply take heed for themselves.\n",
        "TRANSLATION_2": "And warn with this (revealed message) those who fear that they shall be mustered to their Lord, that there will be none apart from Allah to act as their protector and intercessor; then maybe they will become God-fearing.\n",
        "TRANSLATION_3": "Preach the Quran to those who are concerned about the Day of Judgment at which time they will be brought before their Lord. Tell them that their only guardian and intercessor is God so that they may become pious.\n",
        "TRANSLATION_4": "And with this Qur’an warn those who fear, that they will be raised towards their Lord in a state when, except Allah, there will be no protector for them nor an intercessor, so that they may be pious.\n",
        "TRANSLATION_5": "And warn therewith those who fear that they will be gathered before their Lord, when there will be neither a protector nor an intercessor for them besides Him, so that they may have Taqwa.\n",
        "TRANSLATION_6": "And warn with it those who fear that they shall be gathered to their Lord-- there is no guardian for them, nor any intercessor besides Him-- that they may guard (against evil).\n",
        "TRANSLATION_7": "And warn therewith those who fear they shall be mustered to their Lord; they have, apart from God, no protector and no intercessor; haply they will be godfearing.\n",
        "TRANSLATION_8": "Warn hereby those who fear (because they know) that they will be gathered unto their Lord, for whom there is no protecting ally nor intercessor beside Him, that they may ward off (evil).\n",
        "TRANSLATION_9": "Warn by it those who fear to be gathered before their Lord, when they have no guardian or intercessor besides God, so that they may become God-fearing.\n",
        "TRANSLATION_10": "And warn thou therewith those who fear that they shall be gathered unto their Lord, when there shall be for them no patron nor intercessor beside Him; haply they may become God-fearing.\n",
        "TRANSLATION_11": "And warn by its means those who fear being mustered toward their Lord, besides whom they shall have neither any guardian nor any intercessor, so that they may be Godwary.\n",
        "TRANSLATION_12": "Give this warning to those in whose (hearts) is the fear that they will be brought (to judgment) before their Lord: except for Him they will have no protector nor intercessor: that they may guard (against evil).\n",
        "TRANSLATION_13": "And warn therewith (the Quran) those who fear that they will be gathered before their Lord, when there will be neither a protector nor an intercessor for them besides Him, so that they may fear Allah and keep their duty to Him (by abstaining from committing sins and by doing all kinds of good deeds which He has ordained).\n",
        "TRANSLATION_14": "And warn with it those who fear to be brought before their Lord that they have no guardian or intercessor, other than Allah, in order that they are cautious.\n",
        "TRANSLATION_15": "And warn with it those who fear to be gathered before their Lord—they have no protector or intercessor apart from him—perhaps they will grow in piety.\n",
        "TRANSLATION_16": "And warn by the Qur'an those who fear that they will be gathered before their Lord - for them besides Him will be no protector and no intercessor - that they might become righteous.\n",
        "TRANSLATION_17": "[6:51] And warn, threaten, therewith, that is, [with] the Qur’ān, those who fear they shall be gathered to their Lord: apart from Him, other than Him, they have no protector, to help them, and no intercessor, to intercede for them (the negative sentence stands as a circumstantial qualifier referring to the subject of [the verb] yuhsharū, ‘they shall be gathered’, and constitutes the object of [what they] fear) — the sinning believers are meant here; so that they might be wary, of God, by desisting from what they engage in and performing deeds of obedience.\n",
        "TRANSLATION_18": "(Warn hereby) warn by the Qur'an; it is also said that this means: warn by Allah (those who fear) those who know and have certainty, among them Bilal Ibn Rabah, Suhayb Ibn Sinan, Mihja' Ibn Salih, 'Ammar Ibn Yasir, Salman al-Farisi, 'Amir Ibn Fuhayrah, Khabbab Ibn al-Aratt and Salim, the client of Abu Hudhayfah, (that they will be gathered unto their Lord) after death, (for whom there is no protecting friend) to protect them (nor intercessor beside Him) to interceded for them or save them from the torment, (that they may ward off (evil)) ward off transgressions, and this will help them perform works of obedience.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "6:51",
            "7:3",
            "43:86",
            "23:59",
            "18:27",
            "19:48",
            "2:46",
            "11:113",
            "6:127",
            "42:6"
        ],
        "BIBLE": [
            "prophets:ezekiel:3:20",
            "prophets:ezekiel:16:52",
            "torah:deuteronomy:29:3",
            "torah:deuteronomy:26:11",
            "prophets:joshua:23:16",
            "prophets:joshua:23:15",
            "prophets:isaiah:47:8",
            "writings:ecclesiastes:1:13",
            "writings:daniel:2:23",
            "prophets:isaiah:50:4"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:5"
        ]
    }
}