{
    "VERSE": "6:52",
    "ARABIC": "وَلَا تَطْرُدِ ٱلَّذِينَ يَدْعُونَ رَبَّهُم بِٱلْغَدَوٰةِ وَٱلْعَشِىِّ يُرِيدُونَ وَجْهَهُۥ مَا عَلَيْكَ مِنْ حِسَابِهِم مِّن شَىْءٍ وَمَا مِنْ حِسَابِكَ عَلَيْهِم مِّن شَىْءٍ فَتَطْرُدَهُمْ فَتَكُونَ مِنَ ٱلظَّٰلِمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Do not chase away those who call on their Lord morning and evening, seeking His Face. Their reckoning is in no way your responsibility and your reckoning is in no way their responsibility. Indeed if you did chase them away, you would be among the wrongdoers.",
        "TRANSLATION_1": "Do not turn away those who supplicate their Lord morning and evening, seeking His magnificence. You are not accountable for them in the least, nor they for you at all. If you drive them away you will only be unjust.\n",
        "TRANSLATION_2": "And do not drive away those who invoke their Lord in the morning and the evening, seeking His pleasure all the time. You are by no means accountable for them just as they are by no means accountable for you. If you still drive them away, you will become among the wrong-doers.\n",
        "TRANSLATION_3": "Do not disregard those who pray to their Lord in the mornings and evenings, seeking their Lord's pleasure. You will not be held responsible for them nor will they be held responsible for you. Do not disregard them lest you become unjust.\n",
        "TRANSLATION_4": "And do not repel those who call upon their Lord in the morning and evening, seeking His pleasure; you are not responsible for their account nor are they responsible for your account – then your repelling them would be far from justice.\n",
        "TRANSLATION_5": "And turn not away those who invoke their Lord, morning and evening seeking His Face. You are accountable for them in nothing, and they are accountable for you in nothing, that you may turn them away, and thus become of the wrongdoers.\n",
        "TRANSLATION_6": "And do not drive away those who call upon their Lord in the morning and the evening, they desire only His favor; neither are you answerable for any reckoning of theirs, nor are they answerable for any reckoning of yours, so that you should drive them away and thus be of the unjust.\n",
        "TRANSLATION_7": "And do not drive away those who call upon their Lord at morning and evening desiring His countenance; nothing of their account falls upon thee, and nothing of thy account falls upon them, that thou shouldst drive them away, and so become one of the evildoers.\n",
        "TRANSLATION_8": "Repel not those who call upon their Lord at morn and evening, seeking His Countenance. Thou art not accountable for them in aught, nor are they accountable for thee in aught, that thou shouldst repel them and be of the wrong-doers.\n",
        "TRANSLATION_9": "Do not send away those who call upon their Lord in the morning and in the evening, seeking only His grace. You are not by any means accountable for them, nor are they accountable for you. If you turn them away, you yourself will become one of the unjust.\n",
        "TRANSLATION_10": "And drive not away those who call upon their Lord morning and evening, seeking His countenance. Not on thee is aught of their reckoning, nor on them aught of thine reckoning, so that thou mayest drive them away and thus become of the wrong-doers.\n",
        "TRANSLATION_11": "Do not drive away those who supplicate their Lord morning and evening desiring His face. Neither are you accountable for them in any way, nor are they accountable for you in any way, so that you may drive them away and thus become one of the wrongdoers.\n",
        "TRANSLATION_12": "Send not away those who call on their Lord morning and evening, seeking His face. In naught art thou accountable for them, and in naught are they accountable for thee, that thou shouldst turn them away, and thus be (one) of the unjust.\n",
        "TRANSLATION_13": "And turn not away those who invoke their Lord, morning and afternoon seeking His Face. You are accountable for them in nothing, and they are accountable for you in nothing, that you may turn them away, and thus become of the Zalimun (unjust).\n",
        "TRANSLATION_14": "Do not drive away those who call on their Lord morning and evening, seeking only His Face. Nothing of their account falls upon you, and nothing of your account falls upon them, that you should drive them away and so become one of the harmdoers.\n",
        "TRANSLATION_15": "And do not drive away those who call upon their Lord, morning and evening, seeking His attention. You are not accountable for them in any way, nor are they accountable for you in any way. If you drive them away, you would be one of the unjust.\n",
        "TRANSLATION_16": "And do not send away those who call upon their Lord morning and afternoon, seeking His countenance. Not upon you is anything of their account and not upon them is anything of your account. So were you to send them away, you would [then] be of the wrongdoers.\n",
        "TRANSLATION_17": "[6:52] And do not drive away those who call upon their Lord at morning and evening desiring, through their worship, His countenance, exalted be He, and not [desiring] any of the transient things of this world — and these are the poor. The idolaters had reviled them and demanded that he [the Prophet] expel them, so that they could sit with him. The Prophet (s) wanted [to do] this, because of his desire that they become Muslims. You are not accountable for them in anything (min shay’in: min is extra), if what they hide in themselves be displeasing; nor are they accountable for you in anything, that you should drive them away (this is the response to the negative sentence) and be of the evildoers, if you do this.\n",
        "TRANSLATION_18": "(Repel not) Muhammad, because of what 'Uyaynah Ibn Hisn al-Fazari has said-he said: \"repel these from you so that the nobles of Mecca come to you, hear you and believe in you\"-and these nobles also asked 'Umar to request the Prophet (pbuh) to allocate one day for them and another for weak believers, but Allah rejected this and warned them against such a deed, (those who call upon their Lord) Salman and his fellow believers, among the clients, who worship their Lord (at morn and evening) through performing the five daily prayers, (seeking His Countenance) and by doing so they only seek Allah's Countenance and good pleasure. (Thou art not accountable for them) for their provision (in aught, nor are they accountable for you) for your provision (in aught, that thou shouldst repel them and be of the wrong-doers) of those who harm themselves.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "6:52",
            "18:28",
            "23:59",
            "14:38",
            "21:49",
            "55:27",
            "36:27",
            "10:40",
            "7:205",
            "68:50"
        ],
        "BIBLE": [
            "writings:daniel:11:19",
            "writings:ii%20chronicles:7:14",
            "torah:genesis:3:24",
            "writings:job:23:11",
            "prophets:joshua:7:10",
            "torah:genesis:4:6",
            "torah:deuteronomy:31:29",
            "prophets:ii%20samuel:14:20",
            "prophets:ezekiel:18:30",
            "writings:daniel:9:13"
        ]
    }
}