{
    "VERSE": "6:56",
    "ARABIC": "قُلْ إِنِّى نُهِيتُ أَنْ أَعْبُدَ ٱلَّذِينَ تَدْعُونَ مِن دُونِ ٱللَّهِ قُل لَّآ أَتَّبِعُ أَهْوَآءَكُمْ قَدْ ضَلَلْتُ إِذًا وَمَآ أَنَا۠ مِنَ ٱلْمُهْتَدِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Say: 'I am forbidden to worship those you call upon besides Allah.' Say: 'I do not follow your whims and desires. If I did I would go astray and not be among the guided.'",
        "TRANSLATION_1": "Tell them: \"I am forbidden to worship those you invoke apart from God.\" And say: \"I will not follow your wishes. If I do, I shall be lost and not be one of those who follow the right path.\"\n",
        "TRANSLATION_2": "Say (O Muhanimad!): 'I have been forbidden to serve those to whom you call other than Allah.' Say: 'I do not follow your desires, for were I to do that, I would go astray and would not be of those who are rightly guided.'\n",
        "TRANSLATION_3": "(Muhammad), tell them, \"I am commanded not to worship the idols instead of God. I do not follow your desires lest I go astray and miss the true guidance\"\n",
        "TRANSLATION_4": "Say, “I have been forbidden to worship those whom you worship other than Allah”; say, “I do not follow your desires – if it were, I would then go astray and not be on the right path.”\n",
        "TRANSLATION_5": "Say: \"I have been forbidden to worship those whom you invoke (worship) besides Allah.\" Say: \"I will not follow your vain desires. If I did, I would go astray, and I would not be one of the rightly guided.\"\n",
        "TRANSLATION_6": "Say: I am forbidden to serve those whom you call upon besides Allah. Say: I do not follow your low desires. for then indeed I should have gone astray and I should not be of those who go aright.\n",
        "TRANSLATION_7": "Say: 'I am forbidden to serve those you call on apart from God.' Say: 'I do not follow your caprices, or else I had gone astray, and would not be of the right-guided.'\n",
        "TRANSLATION_8": "Say: I am forbidden to worship those on whom ye call instead of Allah. Say: I will not follow your desires, for then should I go astray and I should not be of the rightly guided.\n",
        "TRANSLATION_9": "Say, \"I am forbidden to worship those you call upon besides God.\" Say, \"I do not follow your whims and desires. If I did, I would go astray and cease to be rightly guided.\"\n",
        "TRANSLATION_10": "Say thou: verily I am forbidden to worship those whom ye call upon beside Allah. Say thou: I shall not follow your vain desires, for then I shall be gone astray, and shall not remain of the guided.\n",
        "TRANSLATION_11": "Say, ‘I have been forbidden to worship those whom you invoke besides Allah.’ Say, ‘I do not follow your desires, for then I will have gone astray, and I will not be among the [rightly] guided.’\n",
        "TRANSLATION_12": "Say: \"I am forbidden to worship those - others than Allah - whom ye call upon.\" Say: \"I will not follow your wain desires: If I did, I would stray from the path, and be not of the company of those who receive guidance.\"\n",
        "TRANSLATION_13": "Say (O Muhammad SAW): \"I have been forbidden to worship those whom you invoke (worship) besides Allah.\" Say: \"I will not follow your vain desires. If I did, I would go astray, and I would not be one of the rightly guided.\"\n",
        "TRANSLATION_14": "Say: 'I am forbidden to worship whom you call upon instead of Allah' Say: 'I will not yield to your wishes, for then I should have strayed and should not be of those guided'\n",
        "TRANSLATION_15": "Say, “I am forbidden from worshiping those you pray to besides God.” Say, “I will not follow your desires; else I would be lost and not be of those guided.”\n",
        "TRANSLATION_16": "Say, \"Indeed, I have been forbidden to worship those you invoke besides Allah.\" Say, \"I will not follow your desires, for I would then have gone astray, and I would not be of the [rightly] guided.\"\n",
        "TRANSLATION_17": "[6:56] Say: ‘Truly I have been forbidden to worship those whom you call upon, [those whom] you worship, besides God.’ Say: ‘I shall not follow your whims, by worshipping them, for then, if I did follow them, verily I would have gone astray and I would not be of the rightly guided’.\n",
        "TRANSLATION_18": "(Say) Muhammad to 'Uyaynah and his folk: (I am forbidden) in the Qur'an (to worship those on whom you call) you worship (instead of Allah) i.e. idols. (Say) Muhammad to 'Uyaynah and his folk: (I will not follow your desires) by worshipping idols and repelling Salman and his fellow believers from me, (for then) for if I do that (should I go astray) from guidance (and I should not be of the rightly guided) to that which is right if I were to do so.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "6:56",
            "10:106",
            "60:8",
            "53:58",
            "16:20",
            "72:22",
            "40:66",
            "21:29",
            "21:66",
            "4:48"
        ],
        "BIBLE": [
            "torah:deuteronomy:12:30",
            "prophets:ii%20samuel:2:27",
            "torah:deuteronomy:17:3",
            "prophets:i%20kings:9:6",
            "torah:genesis:44:4",
            "prophets:joshua:23:16",
            "prophets:ii%20kings:17:12",
            "prophets:jeremiah:5:19",
            "writings:daniel:3:28",
            "prophets:i%20samuel:12:14"
        ]
    }
}