{
    "VERSE": "6:64",
    "ARABIC": "قُلِ ٱللَّهُ يُنَجِّيكُم مِّنْهَا وَمِن كُلِّ كَرْبٍ ثُمَّ أَنتُمْ تُشْرِكُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Say: 'Allah rescues you from it, and from every plight. Then you associate others with Him.'",
        "TRANSLATION_1": "Say: \"God delivers you from this and every calamity. Even then you ascribe compeers (to Him)!\"\n",
        "TRANSLATION_2": "Say: \"It is Allah alone Who delivers you from this and from every distress, and yet you associate others with Allah in His divinity.\"\n",
        "TRANSLATION_3": "Say, \"It is God who always saves you from (such hardship) and from all kinds of distress. Even then, you consider idols equal to God.\"\n",
        "TRANSLATION_4": "Say, “Allah delivers you from these and from all distresses – yet you ascribe partners to Him!”\n",
        "TRANSLATION_5": "Say: \"Allah rescues you from these (dangers) and from all distress, and yet you commit Shirk.\"\n",
        "TRANSLATION_6": "Say: Allah delivers you from them and from every distress, but again you set up others (with Him).\n",
        "TRANSLATION_7": "Say: 'God delivers you from them and from every distress; then you assign Him associates.'\n",
        "TRANSLATION_8": "Say: Allah delivereth you from this and from all affliction. Yet ye attribute partners unto Him.\n",
        "TRANSLATION_9": "Say, \"It is God who delivers you from it and from every other distress, yet you associate partners with Him.\"\n",
        "TRANSLATION_10": "Say thou: Allah delivereth you therefrom and from every pain, yet ye thereafter associate.\n",
        "TRANSLATION_11": "Say, ‘It is Allah who delivers you from them and from every agony, [but] then you ascribe partners [to Him].’\n",
        "TRANSLATION_12": "Say \"It is Allah that delivereth you from these and all (other) distresses: and yet ye worship false gods!\"\n",
        "TRANSLATION_13": "Say (O Muhammad SAW): \"Allah rescues you from it and from all (other) distresses, and yet you worship others besides Allah.\"\n",
        "TRANSLATION_14": "Say: 'Allah saves you from them, and from all afflictions. Then, you associate (with Him)'\n",
        "TRANSLATION_15": "Say, “It is God who delivers you from it, and from every disaster. Yet then you associate others with Him.”\n",
        "TRANSLATION_16": "Say, \"It is Allah who saves you from it and from every distress; then you [still] associate others with Him.\"\n",
        "TRANSLATION_17": "[6:64] Say, to them: ‘God delivers you (read yunjīkum or yunajjīkum) from that and from every distress, [from   every] other anxiety. Yet you associate others with Him’.\n",
        "TRANSLATION_18": "(Say) to them, Muhammad: (Allah delivereth you from this) from the hardships of the sea and the land (and from all afflictions) from all grief and turmoil. (Yet ye) people of Mecca (attribute partners) idols (unto Him).\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "6:64",
            "21:99",
            "53:62",
            "2:15",
            "16:19",
            "6:102",
            "39:62",
            "48:9",
            "48:21",
            "33:3"
        ],
        "BIBLE": [
            "prophets:isaiah:44:17",
            "writings:daniel:3:18",
            "writings:daniel:3:12",
            "writings:i%20chronicles:16:35",
            "prophets:jeremiah:11:13",
            "writings:psalms:107:6",
            "writings:daniel:3:14",
            "torah:genesis:28:22",
            "writings:psalms:7:2",
            "writings:nehemiah:9:27"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:6:3"
        ]
    }
}