{
    "VERSE": "6:67",
    "ARABIC": "لِّكُلِّ نَبَإٍ مُّسْتَقَرٌّ وَسَوْفَ تَعْلَمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "When you see people engrossed in mockery of Our Signs, turn from them until they start to talk of other things. And if Shaytan should ever cause you to forget, once you remember, do not stay sitting with the wrongdoers.",
        "TRANSLATION_1": "A time is fixed for every prophecy; you will come to know in time.\n",
        "TRANSLATION_2": "Every tiding has its appointed time; you yourselves will soon know (the end).\"\n",
        "TRANSLATION_3": "and that for every prophecy (about you which comes from God) there is an appointed time (to come true) and that they will soon experience it.\n",
        "TRANSLATION_4": "All matters have a fixed time and soon you will come to know.\n",
        "TRANSLATION_5": "For every news there is a reality and you will come to know.\n",
        "TRANSLATION_6": "For every prophecy is a term, and you will come to know (it).\n",
        "TRANSLATION_7": "Every tiding has its time appointed; you will surely know.'\n",
        "TRANSLATION_8": "For every announcement there is a term, and ye will come to know.\n",
        "TRANSLATION_9": "Every prophecy has its fixed time to be fulfilled: and soon you will come to know.\"\n",
        "TRANSLATION_10": "For every announcement is a set time; and presently ye shall know.\n",
        "TRANSLATION_11": "For every prophecy there is a [preordained] setting, and soon you will know.\n",
        "TRANSLATION_12": "For every message is a limit of time, and soon shall ye know it.\"\n",
        "TRANSLATION_13": "For every news there is a fact, i.e. for everything there is an appointed term (and it is also said that for every deed there is a recompense) and you will come to know.\n",
        "TRANSLATION_14": "Every news has its appointed time; you will surely know'\n",
        "TRANSLATION_15": "For every happening is a finality, and you will surely know.\n",
        "TRANSLATION_16": "For every happening is a finality; and you are going to know.\n",
        "TRANSLATION_17": "[6:67] Every tiding, [every] announcement, has a conclusion, a [fixed] time in which it will take place and be concluded, including [the tiding concerning] your punishment. And you will come to know’ — this is a threat for them.\n",
        "TRANSLATION_18": "(For every announcement there is a term) for every saying from Allah, and for every command, prohibition, promise, threat, glad tiding of victory or punishment that you receive from Me, there is a term-it is an act and fact from Him, some of which will happen in this world and some in the Hereafter, (and ye will come to know) of all of it in this world or in the Hereafter; it is also said that (For every announcement there is a 140 term) means: every action and speech reflects a true meaning that is in your hearts, and you shall see what will be done with you.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "6:67",
            "50:32",
            "26:6",
            "19:49",
            "26:69",
            "28:66",
            "3:161",
            "83:12",
            "25:31",
            "21:72"
        ],
        "BIBLE": [
            "writings:daniel:8:19",
            "prophets:isaiah:41:22",
            "prophets:habakkuk:2:3",
            "prophets:isaiah:46:10",
            "prophets:i%20kings:18:36",
            "prophets:hosea:6:3",
            "writings:ezra:10:14",
            "writings:i%20chronicles:12:18",
            "writings:psalms:121:8",
            "torah:genesis:6:13"
        ]
    }
}