{
    "VERSE": "6:7",
    "ARABIC": "وَلَوْ نَزَّلْنَا عَلَيْكَ كِتَٰبًا فِى قِرْطَاسٍ فَلَمَسُوهُ بِأَيْدِيهِمْ لَقَالَ ٱلَّذِينَ كَفَرُوٓا۟ إِنْ هَٰذَآ إِلَّا سِحْرٌ مُّبِينٌ",
    "ENGLISH": {
        "TRANSLATION_0": "Even if We were to send down a book to you on parchment pages and they were actually to touch it with their own hands, those who are kafir would still say, 'This is nothing but downright magic'",
        "TRANSLATION_1": "Even if We had sent you a transcript on paper which they could feel with their hands, the unbelievers would have said: \"This is nothing but clear sorcery.\"\n",
        "TRANSLATION_2": "(O Messenger!) Had We sent down to you a book incribed on parchment, and had they even touched it with their own hands, the unbelievers would still have said: 'This is nothing but plain magic.'\n",
        "TRANSLATION_3": "(Muhammad), had We sent you a Book on paper, the unbelievers would have touched it with their hands but would still have said, \"It is no more than plain sorcery\".\n",
        "TRANSLATION_4": "And had We sent down to you (O dear Prophet Mohammed – peace and blessings be upon him) something written on paper so that they could feel it with their hands, even then the disbelievers would have said, “This is nothing but clear magic.”\n",
        "TRANSLATION_5": "And even if We had sent down unto you a Message written on paper so that they could touch it with their hands, the disbelievers would have said: \"This is nothing but obvious magic!\"\n",
        "TRANSLATION_6": "And if We had sent to you a writing on a paper, then they had touched it with their hands, certainly those who disbelieve would have said: This is nothing but clear enchantment.\n",
        "TRANSLATION_7": "Had We sent down on thee a Book on parchment and so they touched it with their hands, yet the unbelievers would have said, 'This is naught but manifest sorcery.'\n",
        "TRANSLATION_8": "Had we sent down unto thee (Muhammad) (actual) writing upon parchment, so that they could feel it with their hands, those who disbelieve would have said: This is naught else than mere magic.\n",
        "TRANSLATION_9": "But even if We had sent down to you a Book written on parchment, and they had touched it with their own hands -- those who deny the truth would still have said, \"This is mere magic.\"\n",
        "TRANSLATION_10": "And had We sent down unto thee a Book written upon parchment so that they could have touched it with their hands, those who disbelieve would have said: this is naught but magic manifest.\n",
        "TRANSLATION_11": "Had We sent down to you a Book on paper so they could touch it with their [own] hands, [still] the faithless would have said, ‘This is nothing but plain magic.’\n",
        "TRANSLATION_12": "If We had sent unto thee a written (message) on parchment, so that they could touch it with their hands, the Unbelievers would have been sure to say: \"This is nothing but obvious magic!\"\n",
        "TRANSLATION_13": "And even if We had sent down unto you (O Muhammad SAW) a Message written on paper so that they could touch it with their hands, the disbelievers would have said: \"This is nothing but obvious magic!\"\n",
        "TRANSLATION_14": "Had We sent down to you a Book on parchment and they touched it with their own hands, those who disbelieved would say: 'This is nothing but plain magic'\n",
        "TRANSLATION_15": "Had We sent down upon you a book on paper, and they had touched it with their hands, those who disbelieve would have said, “This is nothing but plain magic.”\n",
        "TRANSLATION_16": "And even if We had sent down to you, [O Muhammad], a written scripture on a page and they touched it with their hands, the disbelievers would say, \"This is not but obvious magic.\"\n",
        "TRANSLATION_17": "[6:7] And had We revealed to you a Scripture, inscribed, on parchment, as they requested, and had they then touched it with their hands — this is more powerful than saying, ‘had they seen it with their eyes’, since it [touch] is more effective in eliminating doubt; the disbelievers would have said, in disobedience and obduracy: ‘This is nothing but manifest sorcery’.\n",
        "TRANSLATION_18": "(Had we sent down unto thee (Muhammad)) if Gabriel had brought down the Qur'an to you in one bulk ((actual) writing upon parchment) as asked for by 'Abdullah Ibn Umayyah al-Makhzumi and his friends, (so that they could feel it with their hands) so that they would hold and read it, (those who disbelieve) i.e. 'Abdullah Ibn Umayyah al-Makhzumi (would have said: This is naught else than mere magic) a clear lie.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "6:7",
            "37:15",
            "74:24",
            "16:64",
            "6:92",
            "29:47",
            "15:4",
            "3:3",
            "7:52",
            "6:155"
        ],
        "BIBLE": [
            "writings:job:19:21",
            "writings:ii%20chronicles:25:15",
            "prophets:jeremiah:1:9",
            "writings:nehemiah:6:9",
            "torah:genesis:44:17",
            "writings:i%20chronicles:21:17",
            "prophets:judges:13:23",
            "prophets:judges:7:2",
            "torah:exodus:10:21",
            "prophets:zechariah:8:13"
        ]
    }
}