{
    "VERSE": "6:72",
    "ARABIC": "وَأَنْ أَقِيمُوا۟ ٱلصَّلَوٰةَ وَٱتَّقُوهُ وَهُوَ ٱلَّذِىٓ إِلَيْهِ تُحْشَرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "It is He Who created the heavens and the earth with truth. The day He says 'Be!' it is.",
        "TRANSLATION_1": "Observe (your) devotional obligations and fear (God), for it is He before whom you will be gathered (in the end).\"\n",
        "TRANSLATION_2": "and to establish Prayer, and to have fear of Him. It is to Him that all of you shall be gathered.\n",
        "TRANSLATION_3": "Be steadfast in prayer and have fear of God; before Him alone you will all be brought together.\n",
        "TRANSLATION_4": "“And to keep the (obligatory) prayer established and to fear Him; and it is to Him that you are to be raised.”\n",
        "TRANSLATION_5": "And to perform the Salah, and have Taqwa of Him, and it is He to Whom you shall be gathered.\n",
        "TRANSLATION_6": "And that you should keep up prayer and be careful of (your duty to) Him; and He it is to Whom you shall be gathered.\n",
        "TRANSLATION_7": "and: \"Perform the prayer, and fear Him; it is unto Him you shall be mustered.\"\n",
        "TRANSLATION_8": "And to establish worship and be dutiful to Him, and He it is unto Whom ye will be gathered.\n",
        "TRANSLATION_9": "say our prayers regularly and to fear God.\" He it is to whom you will be gathered.\"\n",
        "TRANSLATION_10": "And that: establish prayer and fear Him; and it is He unto whom ye shall be gathered.\n",
        "TRANSLATION_11": "and that ‘‘Maintain the prayer and be wary of Him, and it is He toward whom you will be gathered.’’ ’\n",
        "TRANSLATION_12": "To establish regular prayers and to fear Allah: for it is to Him that we shall be gathered together.\"\n",
        "TRANSLATION_13": "And to perform As-Salat (Iqamat-as-Salat)\", and to be obedient to Allah and fear Him, and it is He to Whom you shall be gathered.\n",
        "TRANSLATION_14": "and to establish prayer, and fear Him. Before Him you shall all be assembled'\n",
        "TRANSLATION_15": "“And to perform the prayers, and to revere Him; it is to Him that you will be gathered.”\n",
        "TRANSLATION_16": "And to establish prayer and fear Him.\" And it is He to whom you will be gathered.\n",
        "TRANSLATION_17": "[6:72] and to, that is, [to submit] by, establishing prayer and fearing Him, exalted be He; He it is to Whom you shall be gathered’, you shall be brought together, on the Day of Resurrection for reckoning.\n",
        "TRANSLATION_18": "141 (And to establish worship) the five daily prayers (and ward off (evil)) obey Allah, (and He it is unto Whom ye will be gathered) after you die and will reward you for your works.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "6:72",
            "30:31",
            "8:3",
            "23:9",
            "70:34",
            "2:3",
            "2:43",
            "70:23",
            "23:2",
            "107:5"
        ],
        "BIBLE": [
            "prophets:isaiah:43:9",
            "prophets:jeremiah:29:15",
            "prophets:joshua:5:7",
            "torah:exodus:3:12",
            "torah:genesis:38:8",
            "writings:i%20chronicles:16:35",
            "torah:deuteronomy:25:7",
            "torah:genesis:9:17",
            "prophets:ezekiel:11:7",
            "writings:daniel:7:5"
        ]
    }
}