{
    "VERSE": "6:74",
    "ARABIC": "وَإِذْ قَالَ إِبْرَٰهِيمُ لِأَبِيهِ ءَازَرَ أَتَتَّخِذُ أَصْنَامًا ءَالِهَةً إِنِّىٓ أَرَىٰكَ وَقَوْمَكَ فِى ضَلَٰلٍ مُّبِينٍ",
    "ENGLISH": {
        "TRANSLATION_0": "Remember when Ibrahim said to his father, Azar. 'Do you take idols as gods? I see that you and your people are clearly misguided.'",
        "TRANSLATION_1": "Remember when Abraham said to Azar, his father: \"Why do you take idols for God? I certainly find you and your people in error.\"\n",
        "TRANSLATION_2": "And recall when Abraham said to his father, Azar: 'Do you take idols for gods? I see you and your people in obvious error.'\n",
        "TRANSLATION_3": "Consider when Abraham asked his father, Azar, \"Why do you believe idols to be your gods? I find you and your people in absolute error\".\n",
        "TRANSLATION_4": "And remember when Ibrahim said to his father (paternal uncle) Azar, “What! You appoint idols as Gods? Indeed I find you and your people in open error.” (Prophet Ibrahim was rightly guided since birth).\n",
        "TRANSLATION_5": "And (remember) when Ibrahim said to his father Azar: \"Do you take idols as gods Verily, I see you and your people in manifest error.\"\n",
        "TRANSLATION_6": "And when Ibrahim said to his sire, Azar: Do you take idols for gods? Surely I see you and your people in manifest error.\n",
        "TRANSLATION_7": "And when Abraham said to his father Azar, 'Takest thou idols for gods? I see thee, and thy people, in manifest error.'\n",
        "TRANSLATION_8": "(Remember) when Abraham said unto his father Azar: Takest thou idols for gods? Lo! I see thee and thy folk in error manifest.\n",
        "TRANSLATION_9": "Remember when Abraham said to his father, Azar, \"Do you take idols as your gods? I see that you and your people have clearly gone astray.\"\n",
        "TRANSLATION_10": "And recall what time Ibrahim said unto his father Azar: takest thou idols for gods! Verily I see thee and thy people in error manifest.\n",
        "TRANSLATION_11": "When Abraham said to Azar, his father, ‘Do you take idols for gods? Indeed I see you and your people in manifest error.’\n",
        "TRANSLATION_12": "Lo! Abraham said to his father Azar: \"Takest thou idols for gods? For I see thee and thy people in manifest error.\"\n",
        "TRANSLATION_13": "And (remember) when Ibrahim (Abraham) said to his father Azar: \"Do you take idols as aliha (gods)? Verily, I see you and your people in manifest error.\n",
        "TRANSLATION_14": "(And remember) when Abraham said to his father Azar: 'Will you take idols for gods, surely I see you and your people are in clear error'\n",
        "TRANSLATION_15": "Abraham said to his father Azar, “Do you take idols for gods? I see that you and your people are in evident error.”\n",
        "TRANSLATION_16": "And [mention, O Muhammad], when Abraham said to his father Azar, \"Do you take idols as deities? Indeed, I see you and your people to be in manifest error.\"\n",
        "TRANSLATION_17": "[6:74] And, mention, when Abraham said to his father Āzar, which was his cognomen, his [first] name being Terah (Tārikh): ‘Do you take idols as gods, to worship? (an interrogative meant as a rebuke). I see you and your people, by [this act of] taking them [as gods], in manifest error’, far from the truth.\n",
        "TRANSLATION_18": "((Remember) when Abraham said unto his father Azar) who was Terah the son of Nahur: (Takest thou idols) do you worship idols (for gods) so many gods: small and large, male and female? (Lo! I see thee) my father (and thy folk in error manifest) in manifest disbelief and wrong in so worshipping idols.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "6:74",
            "37:85",
            "43:26",
            "26:70",
            "7:138",
            "7:60",
            "27:43",
            "2:67",
            "29:16",
            "12:8"
        ],
        "BIBLE": [
            "prophets:joshua:24:2",
            "torah:deuteronomy:26:5",
            "prophets:ii%20samuel:3:7",
            "prophets:ii%20samuel:2:27",
            "writings:i%20chronicles:29:10",
            "prophets:i%20samuel:20:12",
            "writings:ii%20chronicles:20:20",
            "writings:i%20chronicles:21:17",
            "writings:ruth:1:15",
            "prophets:i%20kings:18:36"
        ]
    }
}