{
    "VERSE": "6:79",
    "ARABIC": "إِنِّى وَجَّهْتُ وَجْهِىَ لِلَّذِى فَطَرَ ٱلسَّمَٰوَٰتِ وَٱلْأَرْضَ حَنِيفًا وَمَآ أَنَا۠ مِنَ ٱلْمُشْرِكِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "I have turned my face to Him Who brought the heavens and earth into being, a pure natural believer. I am not one of the mushrikun.'",
        "TRANSLATION_1": "I have truly turned my face towards Him who created the heavens and the earth: I have chosen one way and am not an idolater.\"\n",
        "TRANSLATION_2": "Behold, I have turned my face in exclusive devotion to the One Who originated the heavens and the earth, and I am certainly not one of those who associate others with Allah in His divinity.'\n",
        "TRANSLATION_3": "I have up-rightly submitted myself to the One who has created the heavens and the earth and I am not an idol worshipper.\"\n",
        "TRANSLATION_4": "“I have directed my attention towards Him Who has created the heavens and the earth, am devoted solely to Him, and am not of the polytheists.”\n",
        "TRANSLATION_5": "Verily, I have turned my face towards Him Who has created the heavens and the earth, Hanifan, and I am not of the idolators.\"\n",
        "TRANSLATION_6": "Surely I have turned myself, being upright, wholly to Him Who originated the heavens and the earth, and I am not of the polytheists.\n",
        "TRANSLATION_7": "I have turned my face to Him who originated the heavens and the earth, a man of pure faith; I am not of the idolaters.'\n",
        "TRANSLATION_8": "Lo! I have turned my face toward Him Who created the heavens and the earth, as one by nature upright, and I am not of the idolaters.\n",
        "TRANSLATION_9": "I have set my face with single-minded devotion, towards Him who has created the heavens and the earth, and I am not one of the polytheists.\"\n",
        "TRANSLATION_10": "Verily I have set my countenance towards Him who hath created the heavens and the earth, upright, and am not of the associaters.\n",
        "TRANSLATION_11": "‘Indeed I have turned my face toward Him who originated the heavens and the earth, as a Hanif, and I am not one of the polytheists.’\n",
        "TRANSLATION_12": "For me, I have set my face, firmly and truly, towards Him Who created the heavens and the earth, and never shall I give partners to Allah.\"\n",
        "TRANSLATION_13": "Verily, I have turned my face towards Him Who has created the heavens and the earth Hanifa (Islamic Monotheism, i.e. worshipping none but Allah Alone) and I am not of Al-Mushrikun (see V. 2:105)\".\n",
        "TRANSLATION_14": "I have turned my face to Him who has created the heavens and the earth, uprightly, and I am not among the idolaters'\n",
        "TRANSLATION_15": "I have directed my attention towards Him Who created the heavens and the earth—a monotheist—and I am not of the idolaters.”\n",
        "TRANSLATION_16": "Indeed, I have turned my face toward He who created the heavens and the earth, inclining toward truth, and I am not of those who associate others with Allah.\"\n",
        "TRANSLATION_17": "[6:79] He said: Verily I have turned my face to, I am seeking in worship, Him Who originated, created, the heavens and the earth, namely, God; a hanīf, inclining towards the upright religion, and I am not of those that associate others’, with Him.\n",
        "TRANSLATION_18": "When they asked him: who do you worship? He said: (Lo! I have turned my face towards) I have made my religion and works sincere to (him Who created the heavens and the earth, as one by nature upright) Muslim, (and I am not of the idolaters) who follows their religion.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "6:79",
            "44:29",
            "11:107",
            "53:31",
            "16:3",
            "3:109",
            "34:2",
            "44:38",
            "21:16",
            "4:132"
        ],
        "BIBLE": [
            "prophets:ezekiel:21:21",
            "writings:lamentations:3:35",
            "writings:proverbs:21:29",
            "writings:job:37:12",
            "torah:deuteronomy:31:18",
            "prophets:ezekiel:6:2",
            "prophets:jonah:3:8",
            "prophets:jeremiah:26:3",
            "prophets:ezekiel:35:2",
            "writings:ii%20chronicles:7:14"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:3:5",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:1:11"
        ]
    }
}