{
    "VERSE": "6:84",
    "ARABIC": "وَوَهَبْنَا لَهُۥٓ إِسْحَٰقَ وَيَعْقُوبَ كُلًّا هَدَيْنَا وَنُوحًا هَدَيْنَا مِن قَبْلُ وَمِن ذُرِّيَّتِهِۦ دَاوُۥدَ وَسُلَيْمَٰنَ وَأَيُّوبَ وَيُوسُفَ وَمُوسَىٰ وَهَٰرُونَ وَكَذَٰلِكَ نَجْزِى ٱلْمُحْسِنِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "We gave him Ishaq and Ya'qub, each of whom We guided. And before him We had guided Nuh. And among his descendants were Dawud and Sulayman, and Ayyub, Yusuf, Musa and Harun. That is how We recompense the good-doers.",
        "TRANSLATION_1": "And We gave him Isaac and Jacob and guided them, as We had guided Noah before them, and of his descendants, David and Solomon and Job and Joseph and Moses and Aaron. Thus We reward those who are upright and do good.\n",
        "TRANSLATION_2": "And We bestowed upon Abraham (offspring) Ishaq (Isaac) and Ya'qub (Jacob) and each of them did We guide to the right way as We had earlier guided Noah to the right way; and (of his descendants We guided) Da'ud (David) and Sulayman (Solomon), Ayyub (Job), Yusuf (Joseph), Musa (Moses) and Harun (Aaron). Thus do We reward those who do good.\n",
        "TRANSLATION_3": "We gave (Abraham) Isaac and Jacob. Both had received Our guidance. Noah received Our guidance before Abraham and so did his descendants: David, Solomon, Job, Joseph, Moses, and Aaron. Thus is the reward for the righteous people.\n",
        "TRANSLATION_4": "And We bestowed upon him Ishaq (Isaac) and Yaqub (Jacob); We guided all of them; and We guided Nooh before them and of his descendants, Dawud and Sulaiman and Ayyub and Yusuf and Moosa and Haroon; and this is the way We reward the virtuous.\n",
        "TRANSLATION_5": "And We bestowed upon him Ishaq and Ya`qub, each of them We guided, and before him, We guided Nuh and among his progeny Dawud, Sulayman, Ayyub, Yusuf, Musa, and Harun. Thus do We reward the good-doers.\n",
        "TRANSLATION_6": "And We gave to him Ishaq and Yaqoub; each did We guide, and Nuh did We guide before, and of his descendants, Dawood and Sulaiman and Ayub and Yusuf and Musa and Haroun; and thus do We reward those who do good (to others).\n",
        "TRANSLATION_7": "And We gave to him Isaac and Jacob -- each one We guided, And Noah We guided before; and of his seed David and Solomon, Job and Joseph, Moses and Aaron -- even so We recompense the good-doers --\n",
        "TRANSLATION_8": "And We bestowed upon him Isaac and Jacob; each of them We guided; and Noah did We guide aforetime; and of his seed (We guided) David and Solomon and Job and Joseph and Moses and Aaron. Thus do We reward the good.\n",
        "TRANSLATION_9": "We gave him Isaac and Jacob, each of whom We guided as We had guided Noah before. Among his descendants were David and Solomon, and Job, Joseph, Moses and Aaron. Thus do We reward the righteous.\n",
        "TRANSLATION_10": "And We bestowed upon him Is-haq and Ya'qub: each one We guided. And Nuh We had guided afore, and of his progeny Da-ud and Sulaiman and Ayyub and Yusuf and Musa and Harun. And thus We recompense the well-doers.\n",
        "TRANSLATION_11": "And We gave him Isaac and Jacob and guided each of them. And Noah We had guided before, and from his offspring, David and Solomon, Job, Joseph, Moses and Aaron—thus do We reward the virtuous—\n",
        "TRANSLATION_12": "We gave him Isaac and Jacob: all (three) guided: and before him, We guided Noah, and among his progeny, David, Solomon, Job, Joseph, Moses, and Aaron: thus do We reward those who do good:\n",
        "TRANSLATION_13": "And We bestowed upon him Ishaque (Isaac) and Ya'qub (Jacob), each of them We guided, and before him, We guided Nuh (Noah), and among his progeny Dawud (David), Sulaiman (Solomon), Ayub (Job), Yusuf (Joseph), Musa (Moses), and Harun (Aaron). Thus do We reward the good-doers.\n",
        "TRANSLATION_14": "We gave him Isaac and Jacob and guided both; and We guided Noah before them, among his descendants were David and Solomon, Job, Joseph, Moses and Aaron as such, We recompense the gooddoers,\n",
        "TRANSLATION_15": "And We gave him Isaac and Jacob—each of them We guided. And We guided Noah previously; and from his descendants David, and Solomon, and Job, and Joseph, and Moses, and Aaron. Thus We reward the righteous.\n",
        "TRANSLATION_16": "And We gave to Abraham, Isaac and Jacob - all [of them] We guided. And Noah, We guided before; and among his descendants, David and Solomon and Job and Joseph and Moses and Aaron. Thus do We reward the doers of good.\n",
        "TRANSLATION_17": "[6:84] And We bestowed upon him Isaac and, his son, Jacob; each one, of the two, We guided. And Noah We   guided before, that is, before Abraham, and of his seed, that is, Noah’s [seed], David and, his son, Solomon, and Job and Joseph, son of Jacob, and Moses and Aaron; and so, in the same way that We have requited them, We requite the virtuous.\n",
        "TRANSLATION_18": "(And We bestowed upon him) upon Abraham (Isaac) as a son (and Jacob) as a grandson; (each of them) i.e. Abraham, Isaac and Jacob (We guided) We honoured by bestowing upon them prophethood and Islam (surrender to Allah); (and Noah did We guide) We honoured him by bestowing upon him prophethood and Islam (aforetime) i.e. before Abraham; (and of his seed) of the seed of Noah; it is also said that this means: of the seed of Abraham ((We guided) David and Solomon and Job and Joseph and Moses and Aaron) We guided all of them by bestowing upon them prophethood and Islam. (Thus do We reward the good) in their works and speech; it is also said that this means: those who confess Allah's divine Oneness.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "6:84",
            "37:77",
            "21:72",
            "69:9",
            "15:27",
            "25:39",
            "37:113",
            "21:76",
            "41:48",
            "10:91"
        ],
        "BIBLE": [
            "torah:genesis:35:12",
            "prophets:joshua:13:8",
            "torah:genesis:45:21",
            "prophets:i%20kings:8:36",
            "writings:ii%20chronicles:6:27",
            "torah:genesis:25:5",
            "prophets:joshua:18:7",
            "writings:esther:3:11",
            "torah:genesis:25:34",
            "prophets:isaiah:42:24"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:5:2"
        ]
    }
}