{
    "VERSE": "6:85",
    "ARABIC": "وَزَكَرِيَّا وَيَحْيَىٰ وَعِيسَىٰ وَإِلْيَاسَ كُلٌّ مِّنَ ٱلصَّٰلِحِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "And Zakariyya, Yahya, 'Isa and llyas. All of them were among the salihun.",
        "TRANSLATION_1": "Zachariah and John We guided, and guided Jesus and Elias who were all among the upright.\n",
        "TRANSLATION_2": "(And of his descendants We guided) Zakariya (Zachariah), Yahya (John), Isa (Jesus) and Ilyas (Elias): each one of them was of the righteous.\n",
        "TRANSLATION_3": "We also gave guidance to Zacharias, John, Jesus, and Elias, who were all pious people,\n",
        "TRANSLATION_4": "And (We guided) Zakaria and Yahya (John) and Eisa and Elias; all these are worthy of Our proximity.\n",
        "TRANSLATION_5": "And Zakariyya, and Yahya and `Isa and Iliyas, each one of them was of the righteous.\n",
        "TRANSLATION_6": "And Zakariya and Yahya and Isa and Ilyas; every one was of the good;\n",
        "TRANSLATION_7": "Zachariah and John, Jesus and Elias; each was of the righteous;\n",
        "TRANSLATION_8": "And Zachariah and John and Jesus and Elias. Each one (of them) was of the righteous.\n",
        "TRANSLATION_9": "Zachariah, John, Jesus, and Elijah, every one of them was righteous,\n",
        "TRANSLATION_10": "And also Zakariyya and Yahya and Isa and llyas: each one was of the righteous.\n",
        "TRANSLATION_11": "and Zechariah, John, Jesus and Ilyas—each of them among the righteous—\n",
        "TRANSLATION_12": "And Zakariya and John, and Jesus and Elias: all in the ranks of the righteous:\n",
        "TRANSLATION_13": "And Zakariya (Zachariya), and Yahya (John) and 'Iesa (Jesus) and Iliyas (Elias), each one of them was of the righteous.\n",
        "TRANSLATION_14": "and (Prophets) Zachariah, John, Jesus and Elias, each was of the righteous,\n",
        "TRANSLATION_15": "And Zechariah, and John, and Jesus, and Elias—every one of them was of the upright.\n",
        "TRANSLATION_16": "And Zechariah and John and Jesus and Elias - and all were of the righteous.\n",
        "TRANSLATION_17": "[6:85] And Zachariah and, his son, John, and Jesus, son of Mary — this shows that [the term] ‘seed’ (dhurriyya) can include offspring from the female [side] — and Elias, the paternal nephew of Aaron, brother of Moses; all, of them, were of the righteous.\n",
        "TRANSLATION_18": "(And Zachariah and John and Jesus and Elias. Each one (of them)) We guided by bestowing upon them prophethood and Islam; and all of them were of the seed of Abraham (was of the righteous) i.e. they were messengers.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "6:85",
            "21:85",
            "25:39",
            "38:48",
            "6:86",
            "37:123",
            "38:19",
            "15:19",
            "37:8",
            "38:74"
        ],
        "BIBLE": [
            "writings:psalms:78:62",
            "prophets:ezekiel:20:25",
            "writings:ii%20chronicles:33:10",
            "writings:esther:3:11",
            "prophets:ezekiel:36:28",
            "writings:ezra:3:11",
            "prophets:i%20kings:8:36",
            "writings:psalms:135:12",
            "prophets:i%20samuel:22:10",
            "writings:i%20chronicles:23:25"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:12"
        ]
    }
}