{
    "VERSE": "6:86",
    "ARABIC": "وَإِسْمَٰعِيلَ وَٱلْيَسَعَ وَيُونُسَ وَلُوطًا وَكُلًّا فَضَّلْنَا عَلَى ٱلْعَٰلَمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "And Isma'il, al-Yasa', Yunus and Lut. All of them We favoured over all beings.",
        "TRANSLATION_1": "We gave guidance to Ishmael, Elisha and Jonah and Lot; And We favoured them over the other people of the world,\n",
        "TRANSLATION_2": "(And of his descendants We guided) Isma'il (Ishmael), al-Yasa' (Elisha), Yunus (Jonah), and Lut (Lot). And each one of them We favoured over all mankind.\n",
        "TRANSLATION_3": "and Ishmael, Elisha, Jonah, and Lot whom We exalted over all people.\n",
        "TRANSLATION_4": "And Ismael (Ishmael) and Yasa’a (Elisha) and Yunus (Jonah) and Lut (Lot); and to each one during their times, We gave excellence over all others.\n",
        "TRANSLATION_5": "And Isma`il and Al-Yasa`, and Yunus and Lut, and each one of them We preferred above the `Alamin (mankind and Jinns, of their times).\n",
        "TRANSLATION_6": "And Ismail and Al-Yasha and Yunus and Lut; and every one We made to excel (in) the worlds:\n",
        "TRANSLATION_7": "Ishmael and Elisha, Jonah and Lot-each one We preferred above all beings;\n",
        "TRANSLATION_8": "And Ishmael and Elisha and Jonah and Lot. Each one (of them) did We prefer above (Our) creatures,\n",
        "TRANSLATION_9": "Ishmael, Elisha, Jonah, and Lot -- We favoured each one of them above other people,\n",
        "TRANSLATION_10": "And Ismai'l and Alyas'a and Yunus and Lut: each one of them We preferred above the worlds.\n",
        "TRANSLATION_11": "and Ishmael, Elisha, Jonah and Lot—each We graced over all the nations—\n",
        "TRANSLATION_12": "And Isma'il and Elisha, and Jonas, and Lot: and to all We gave favour above the nations:\n",
        "TRANSLATION_13": "And Isma'il (Ishmael) and Al-Yas'a (Elisha), and Yunus (Jonah) and Lout (Lot), and each one of them We preferred above the 'Alamin (mankind and jinns) (of their times).\n",
        "TRANSLATION_14": "and Ishmael, Elisha, Jonah and Lot. Each We preferred above the worlds,\n",
        "TRANSLATION_15": "And Ishmael, and Elijah, and Jonah, and Lot—We favored each one of them over all other people.\n",
        "TRANSLATION_16": "And Ishmael and Elisha and Jonah and Lot - and all [of them] We preferred over the worlds.\n",
        "TRANSLATION_17": "[6:86] And Ishmael, son of Abraham, and Elisha (Ilyasa‘, the lām is extra), and Jonah and Lot, son of Hārān, brother of Abraham, all, of them, We preferred above all the worlds, through prophethood.\n",
        "TRANSLATION_18": "143 (And Ishmael and Elisha and Jonah and Lot. Each one of them) all these prophets (did We prefer) by means of prophethood and Islam (above (Our) creatures) above the people of their own time, both believers and unbelievers.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "6:86",
            "10:79",
            "44:32",
            "25:39",
            "7:112",
            "21:71",
            "39:70",
            "6:85",
            "37:8",
            "21:79"
        ],
        "BIBLE": [
            "torah:exodus:11:3",
            "prophets:ezekiel:36:28",
            "prophets:joshua:19:49",
            "writings:psalms:135:12",
            "writings:ii%20chronicles:35:8",
            "writings:psalms:78:62",
            "writings:i%20chronicles:6:50",
            "prophets:i%20samuel:1:4",
            "writings:psalms:106:41",
            "torah:exodus:12:36"
        ]
    }
}