{
    "VERSE": "6:87",
    "ARABIC": "وَمِنْ ءَابَآئِهِمْ وَذُرِّيَّٰتِهِمْ وَإِخْوَٰنِهِمْ وَٱجْتَبَيْنَٰهُمْ وَهَدَيْنَٰهُمْ إِلَىٰ صِرَٰطٍ مُّسْتَقِيمٍ",
    "ENGLISH": {
        "TRANSLATION_0": "And some of their forebears, descendants and brothers; We chose them and guided them to a straight path.",
        "TRANSLATION_1": "As We did some of their fathers and progeny and brethren, and chose them, and showed them the right path.\n",
        "TRANSLATION_2": "And likewise We elected for Our cause and guided on to a straight way some of their forefathers and their offspring and their brethren.\n",
        "TRANSLATION_3": "From their fathers, descendants, and brothers, We chose (certain) people and guided them to the right path.\n",
        "TRANSLATION_4": "And some of their ancestors and their descendants and their brothers; and We chose them and guided them to the Straight Path.\n",
        "TRANSLATION_5": "And also some of their fathers and their progeny and their brethren, We chose them, and We guided them to a straight path.\n",
        "TRANSLATION_6": "And from among their fathers and their descendants and their brethren, and We chose them and guided them into the right way.\n",
        "TRANSLATION_7": "and of their fathers, and of their seed, and of their brethren; and We elected them, and We guided them to a straight path.\n",
        "TRANSLATION_8": "With some of their forefathers and their offspring and their brethren; and We chose them and guided them unto a straight path.\n",
        "TRANSLATION_9": "and also some of their forefathers, their offspring, and their brothers: We chose them and guided them to a straight path.\n",
        "TRANSLATION_10": "And also some of their fathers and their progeny and their brethren: We chose them and guided them onto the right path.\n",
        "TRANSLATION_11": "and from among their fathers, their descendants and brethren—We chose them and guided them to a straight path.\n",
        "TRANSLATION_12": "(To them) and to their fathers, and progeny and brethren: We chose them, and we guided them to a straight way.\n",
        "TRANSLATION_13": "And also some of their fathers and their progeny and their brethren, We chose them, and We guided them to a Straight Path.\n",
        "TRANSLATION_14": "as We did their fathers, their descendants, and their brothers. We chose them and guided them to a Straight Path.\n",
        "TRANSLATION_15": "And of their ancestors, and their descendants, and their siblings—We chose them, and guided them to a straight path.\n",
        "TRANSLATION_16": "And [some] among their fathers and their descendants and their brothers - and We chose them and We guided them to a straight path.\n",
        "TRANSLATION_17": "[6:87] And of their fathers, and of their seed, and of their brethren (this [clause] is a supplement either to [the previous] kullan, ‘all of them’, or to Nūhan, ‘Noah’; min, ‘of’, is partitive, because some of them did not have offspring, while others had disbelievers among their offspring); and We chose them and We guided them to a straight path.\n",
        "TRANSLATION_18": "(With some of their forefathers) Adam, Seth, Enoch, Noah, Hud, and Salih: We guided all of them by bestowing prophethood and Islam upon them, (and their offspring) i.e. the offspring of Jacob (and their brethren) i.e. the brothers of Joseph: We guided them all to prophethood and Islam; (and We chose them and guided them unto a straight path) i.e. We made them firm on a straight path:\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "6:87",
            "4:68",
            "21:53",
            "37:118",
            "23:73",
            "12:8",
            "22:24",
            "70:12",
            "1:6",
            "12:63"
        ],
        "BIBLE": [
            "torah:deuteronomy:10:15",
            "writings:psalms:5:9",
            "writings:ii%20chronicles:21:13",
            "prophets:jeremiah:31:9",
            "prophets:isaiah:3:12",
            "writings:ii%20chronicles:35:5",
            "writings:psalms:25:4",
            "writings:proverbs:12:26",
            "prophets:isaiah:26:7",
            "writings:proverbs:12:15"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:3:6",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:13"
        ]
    }
}