{
    "VERSE": "6:9",
    "ARABIC": "وَلَوْ جَعَلْنَٰهُ مَلَكًا لَّجَعَلْنَٰهُ رَجُلًا وَلَلَبَسْنَا عَلَيْهِم مَّا يَلْبِسُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "And if We had made him an angel We would still have made him a man, and further confused for them the very thing they are confused about!",
        "TRANSLATION_1": "Even if We had sent down an angel as messenger he would have appeared in the garb of a man and filled them with confusion, like the one they are filled with.\n",
        "TRANSLATION_2": "Had We appointed an angel, We would have sent him down in the form of a man - and thus We would have caused them the same doubt which they now entertain.\n",
        "TRANSLATION_3": "Were We to have made him (Our Messenger) an angel, We would have made him resemble a human being and they would have again complained that the matter was as confusing to them as it is to them now.\n",
        "TRANSLATION_4": "And had we appointed an angel as a Prophet, We would still have made him as a man and would keep them in the same doubt, as they are now in.\n",
        "TRANSLATION_5": "And had We appointed him an angel, We indeed would have made him a man, and We would have certainly caused them confusion in a matter which they have already covered with confusion.\n",
        "TRANSLATION_6": "And if We had made him angel, We would certainly have made him a man, and We would certainly have made confused to them what they make confused.\n",
        "TRANSLATION_7": "And had We made him an angel, yet assuredly We would have made him a man, and confused for them the thing which they themselves are confusing.\n",
        "TRANSLATION_8": "Had we appointed him (Our messenger) an angel, We assuredly had made him (as) a man (that he might speak to men); and (thus) obscured for them (the truth) they (now) obscure.\n",
        "TRANSLATION_9": "Indeed, if We had sent an angel as messenger, We would have made him in the form of a man as well, and would have thus added to their confusion.\n",
        "TRANSLATION_10": "And had We made him an angel, We would still have made him a man, and We would have confounded for them that which they are confounding.\n",
        "TRANSLATION_11": "Had We made him an angel, We would have surely made him a man, and We would have surely confounded them just as they confound [the truth now].\n",
        "TRANSLATION_12": "If We had made it an angel, We should have sent him as a man, and We should certainly have caused them confusion in a matter which they have already covered with confusion.\n",
        "TRANSLATION_13": "And had We appointed him an angel, We indeed would have made him a man, and We would have certainly caused them confusion in a matter which they have already covered with confusion (i.e. the Message of Prophet Muhammad SAW).\n",
        "TRANSLATION_14": "If We had made him an angel, We would have given him the resemblance of a man, and would have as such confused them with that in which they are already confused.\n",
        "TRANSLATION_15": "Had We made him an angel, We would have made him a man, and confused them when they are already confused.\n",
        "TRANSLATION_16": "And if We had made him an angel, We would have made him [appear as] a man, and We would have covered them with that in which they cover themselves.\n",
        "TRANSLATION_17": "[6:9] And had We appointed him, the one who is sent down to them, an angel, We would assuredly have made him, the angel, a man, that is, [We would have sent him] in the form of a man, so that they would be able to see him, since no human being is capable of seeing an angel; and, had We sent him down and made him a man, We would have assuredly confused, obscured, for them what they are confusing, for themselves, when they say, ‘This is but a mere mortal like the rest of you’.\n",
        "TRANSLATION_18": "(Had We appointed an angel) as Our messenger, (We assuredly had made him (as) a man) in the form of a man such that they are able to look at him; (and (thus) obscured for them) the real form of the angel ((as) they (now) obscure) the traits and description of Muhammad.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "6:9",
            "6:8",
            "43:60",
            "15:7",
            "23:75",
            "23:95",
            "73:10",
            "17:95",
            "38:62",
            "7:11"
        ],
        "BIBLE": [
            "torah:exodus:36:6",
            "torah:deuteronomy:13:15",
            "torah:leviticus:17:11",
            "prophets:ii%20samuel:19:43",
            "writings:esther:4:8",
            "torah:genesis:38:14",
            "prophets:ezekiel:24:17",
            "torah:deuteronomy:4:25",
            "torah:exodus:18:16",
            "prophets:ezekiel:18:7"
        ]
    }
}