{
    "VERSE": "6:90",
    "ARABIC": "أُو۟لَٰٓئِكَ ٱلَّذِينَ هَدَى ٱللَّهُ فَبِهُدَىٰهُمُ ٱقْتَدِهْ قُل لَّآ أَسْـَٔلُكُمْ عَلَيْهِ أَجْرًا إِنْ هُوَ إِلَّا ذِكْرَىٰ لِلْعَٰلَمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "They are the ones Allah has guided, so be guided by their guidance. Say, 'I do not ask you for any wage for it. It is simply a reminder to all beings.'",
        "TRANSLATION_1": "Those were the people who were guided by God; so follow their way. Say: \"I ask no recompense of you for this. It is but a reminder for all the people of the world.\"\n",
        "TRANSLATION_2": "(O Muhammad!) Those are the ones Allah guided to the right way. Follow, then, their way, and say: 'I ask of you no reward (for carrying on this mission); it is merely an admonition to all mankind.'\n",
        "TRANSLATION_3": "We had guided the Prophets. (Muhammad), follow their guidance and say (to the people), \"I do not ask any reward for what I have preached to you. It is my duty to awaken the world.\"\n",
        "TRANSLATION_4": "These are the ones whom Allah guided, so follow their guidance; say (O dear Prophet Mohammed – peace and blessings be upon him), “I do not ask from you any fee for the Qur’an; it is nothing but an advice to the entire world.”\n",
        "TRANSLATION_5": "They are those whom Allah had guided. So follow their guidance. Say: \"No reward I ask of you for this (the Qur'an). It is only a reminder for the `Alamin (mankind and Jinns).\"\n",
        "TRANSLATION_6": "These are they whom Allah guided, therefore follow their guidance. Say: I do not ask you for any reward for it; it is nothing but a reminder to the nations.\n",
        "TRANSLATION_7": "Those are they whom God has guided; so follow their guidance. Say: 'I ask of you no wage for it; it is but a reminder unto all beings.'\n",
        "TRANSLATION_8": "Those are they whom Allah guideth, so follow their guidance. Say (O Muhammad, unto mankind): I ask of you no fee for it. Lo! it is naught but a Reminder to (His) creatures.\n",
        "TRANSLATION_9": "Those [the previous prophets] were the people whom God guided. Follow their guidance then and say, \"I ask no reward for this from you: it is only a reminder for all mankind.\"\n",
        "TRANSLATION_10": "Those are they whom Allah had guided, so follow thou their guidance, Say thou: no hire I ask therefor; it is but an admonition unto the worlds.\n",
        "TRANSLATION_11": "They are the ones whom Allah has guided. So follow their guidance. Say, ‘I do not ask you any recompense for it. It is just an admonition for all the nations.’\n",
        "TRANSLATION_12": "Those were the (prophets) who received Allah's guidance: Copy the guidance they received; Say: \"No reward for this do I ask of you: This is no less than a message for the nations.\"\n",
        "TRANSLATION_13": "They are those whom Allah had guided. So follow their guidance. Say: \"No reward I ask of you for this (the Quran). It is only a reminder for the 'Alamin (mankind and jinns).\"\n",
        "TRANSLATION_14": "Those were whom Allah guided. Follow then their guidance and say: 'I do not ask you a wage for it. Surely, it is a reminder to the worlds'\n",
        "TRANSLATION_15": "Those are they whom God has guided, so follow their guidance. Say, “I ask of you no compensation for it; it is just a reminder for all mankind.”\n",
        "TRANSLATION_16": "Those are the ones whom Allah has guided, so from their guidance take an example. Say, \"I ask of you for this message no payment. It is not but a reminder for the worlds.\"\n",
        "TRANSLATION_17": "[6:90] They are the ones whom God has guided; so follow their guidance, their way of affirming God’s Oneness and of [exercising] patience (read iqtadih, ‘follow’, with the silent hā’, whether pausing or continuing the recitation; a variant reading omits it in continuous recitation). Say, to the people of Mecca: ‘I do not ask of you, to give me, any wage for it, the Qur’ān; it, the Qur’ān, is only a reminder, an admonition, to all the worlds’, of mankind and jinn.\n",
        "TRANSLATION_18": "(Those) prophets whom We have told you about (are they whom Allah guideth) to the most noble of character traits, (so follow their guidance) follow their most noble character, such as patience, endurance, good will, contentment, and other similar traits. (Say) Muhammad, to the people of Mecca: (I ask of you no fee) no wage (for it) for Allah's divine Oneness or for the Qur'an. (Lo! It) the Qur'an (is naught but a Reminder) an admonition (to (His) creatures) the jinn and human beings.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "6:90",
            "12:104",
            "4:146",
            "10:72",
            "40:65",
            "16:37",
            "62:7",
            "26:127",
            "26:164",
            "26:180"
        ],
        "BIBLE": [
            "prophets:ii%20kings:17:26",
            "prophets:jeremiah:4:10",
            "torah:deuteronomy:14:24",
            "prophets:jeremiah:28:6",
            "torah:numbers:11:12",
            "prophets:i%20kings:21:13",
            "writings:i%20chronicles:15:2",
            "torah:deuteronomy:12:30",
            "prophets:ii%20samuel:2:27",
            "prophets:ii%20kings:6:19"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:3:6"
        ]
    }
}