{
    "VERSE": "6:94",
    "ARABIC": "وَلَقَدْ جِئْتُمُونَا فُرَٰدَىٰ كَمَا خَلَقْنَٰكُمْ أَوَّلَ مَرَّةٍ وَتَرَكْتُم مَّا خَوَّلْنَٰكُمْ وَرَآءَ ظُهُورِكُمْ وَمَا نَرَىٰ مَعَكُمْ شُفَعَآءَكُمُ ٱلَّذِينَ زَعَمْتُمْ أَنَّهُمْ فِيكُمْ شُرَكَٰٓؤُا۟ لَقَد تَّقَطَّعَ بَيْنَكُمْ وَضَلَّ عَنكُم مَّا كُنتُمْ تَزْعُمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "'You have come to Us all alone just as We created you at first, leaving behind you everything We bestowed on you. We do not see your intercessors accompanying you. those you claimed were your partners with Allah. The link between you is cut. Those you made such claims for have forsaken you.'",
        "TRANSLATION_1": "You have come before Us all alone,\" (God will say), \"as when you were created first, leaving behind all that We had bestowed on you. We do not see your intercessors with you who, you imagined, had partnership with you. Shattered lie your ties with them now, and gone are the claims you made.\"\n",
        "TRANSLATION_2": "(And Allah will say): 'Now you have come to Us all alone even as We had created you in the first instance, and you have left behind all that We had bestowed upon you in the world. We do not see with you your intercessors whom you imagined to have a share with Allah in your affairs. You have now been cut off from one another and all those whom you imagined (to be Allah's associates in your affairs) have failed you.'\n",
        "TRANSLATION_3": "God will say, \"You have come to Us alone just as We created you at first. You have left behind all those whom We made your friends and We do not see with you any of the intercessors whom you believed to be your partners. Your relations with them have certainly been destroyed and your belief in them has left you (in the dark).\"\n",
        "TRANSLATION_4": "“And indeed you (the disbelievers) have now come to Us alone as We had created you at first, and you have left behind you all the wealth and riches We had bestowed upon you; and We do not see your intercessors along with you, whom you claimed to possess a share in you; indeed the link between yourselves is cut off, and you have lost all what you contended.”\n",
        "TRANSLATION_5": "And truly you have come unto Us alone, as We created you the first time. You have left behind you all that which We had bestowed on you. We see not with you your intercessors whom you claimed to be your partners. Now you and they have been cut off, and all that you used to claim has vanished from you.\n",
        "TRANSLATION_6": "And certainly you have come to Us alone as We created you at first, and you have left behind your backs the things which We gave you, and We do not see with you your intercessors about whom you asserted that they were (Allah's) associates in respect to you; certainly the ties between you are now cut off and what you asserted is gone from you.\n",
        "TRANSLATION_7": "Now you have come to Us one by one, as We created you upon the first time, and you have left what We conferred on you behind your backs. We do not see with you your intercessors, those you asserted to be associates in you; the bond between you is now broken; that which you ever asserted has now gone astray from you.\n",
        "TRANSLATION_8": "Now have ye come unto Us solitary as We did create you at the first, and ye have left behind you all that We bestowed upon you, and We behold not with you those your intercessors, of whom ye claimed that they possessed a share in you. Now is the bond between you severed, and that which ye presumed hath failed you.\n",
        "TRANSLATION_9": "And now you have returned to Us, alone as We created you at first, leaving behind all that We gave you. Nor do We see with you your intercessors, those you claimed were your partners with God. The link between you is cut and that which you presumed has failed you.\n",
        "TRANSLATION_10": "And now ye are come unto us singly even as We had created you for the first time, and ye have left behind your backs that which We had granted unto you, and We see not along with you your intercessors who ye fancied were Our associates in respect of you as ye asserted. Now are the ties betwixt you severed and strayed from you is that which ye were wont to assert.\n",
        "TRANSLATION_11": "‘Certainly you have come to Us alone, just as We created you the first time, and left behind whatever We had bestowed on you. We do not see your intercessors with you—those whom you claimed to be [Our] partners in [deciding] you[r] [fate]. Certainly all links between you have been cut, and what you used to claim has forsaken you!’\n",
        "TRANSLATION_12": "And behold! ye come to us bare and alone as We created you for the first time: ye have left behind you all (the favours) which We bestowed on you: We see not with you your intercessors whom ye thought to be partners in your affairs: so now all relations between you have been cut off, and your (pet) fancies have left you in the lurch!\"\n",
        "TRANSLATION_13": "And truly you have come unto Us alone (without wealth, companions or anything else) as We created you the first time. You have left behind you all that which We had bestowed on you. We see not with you your intercessors whom you claimed to be partners with Allah. Now all relations between you and them have been cut off, and all that you used to claim has vanished from you.\n",
        "TRANSLATION_14": "Now you have returned to Us, alone, as We created you at first, leaving behind all that We have bestowed on you. Nor do We see with you your intercessors, those whom you asserted to be your associates. The ties which bound you are broken, and that which you asserted has gone astray from you'\n",
        "TRANSLATION_15": "“You have come to Us individually, just as We created you the first time, leaving behind you everything We gave you. We do not see with you your intercessors—those you claimed were your partners. The link between you is cut, and what you had asserted has failed you.”\n",
        "TRANSLATION_16": "[It will be said to them], \"And you have certainly come to Us alone as We created you the first time, and you have left whatever We bestowed upon you behind you. And We do not see with you your 'intercessors' which you claimed that they were among you associates [of Allah]. It has [all] been severed between you, and lost from you is what you used to claim.\"\n",
        "TRANSLATION_17": "[6:94] And, it is said to them upon their resurrection: ‘And now you have come to Us singly, each alone without family, possessions or children, as We created you the first time, that is, barefoot, naked and with foreskins, and you have left what We conferred on you, of wealth, behind your backs, in the world, without you having any choice; and — it is said to them in rebuke — We do not see with you your intercessors, the idols, whom you claimed to be associates, of God, amongst you, that is, in deserving your worship; it has been severed between you, that is to say, your bond has been dissolved (a variant reading [for baynukum, ‘your union’] has baynakum, ‘between you’, making it an adverbial qualifier, that is, the bond ‘between you’ [has been severed]’), and that, intercession of theirs, which you claimed, in the world, has failed, abandoned, you’.\n",
        "TRANSLATION_18": "(Now have ye come unto Us solitary) with nothing: no wealth and no offspring (as We did create you at the first) in the world, without wealth or offspring, (and ye have left behind you) in the worldly life (all that We bestowed upon you, and We behold not with you those your intercessors) your gods, (of whom ye claimed that they possessed a share in you) they were your intercessors. (Now is the bond) the connection and love (between you severed, and that which ye presumed) you worshipped and say that they are your intercessors, i.e. idols (hath failed you) for they are occupied with their own selves.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "6:94",
            "18:48",
            "6:110",
            "10:28",
            "18:52",
            "2:101",
            "30:13",
            "42:21",
            "10:45",
            "41:21"
        ],
        "BIBLE": [
            "torah:exodus:32:24",
            "writings:ii%20chronicles:31:1",
            "prophets:ezekiel:17:18",
            "prophets:jeremiah:8:14",
            "writings:daniel:12:7",
            "writings:ezra:10:2",
            "writings:ezra:5:3",
            "prophets:ezekiel:39:23",
            "torah:deuteronomy:31:16",
            "prophets:isaiah:27:11"
        ]
    }
}