{
    "VERSE": "37:101",
    "ARABIC": "فَبَشَّرْنَٰهُ بِغُلَٰمٍ حَلِيمٍ",
    "ENGLISH": {
        "TRANSLATION_0": "And We gave him the good news of a forbearing boy.",
        "TRANSLATION_1": "So We gave him the good news of a clement son.\n",
        "TRANSLATION_2": "(In response to this prayer) We gave him the good news of a prudent boy;\n",
        "TRANSLATION_3": "We gave him the glad news of the birth of a forbearing son.\n",
        "TRANSLATION_4": "We therefore gave him the glad tidings of an intelligent son.\n",
        "TRANSLATION_5": "So, We gave him the glad tidings of a forbearing boy.\n",
        "TRANSLATION_6": "So We gave him the good news of a boy, possessing forbearance.\n",
        "TRANSLATION_7": "Then We gave him the good tidings of a prudent boy;\n",
        "TRANSLATION_8": "So We gave him tidings of a gentle son.\n",
        "TRANSLATION_9": "We gave him the good news that he would have a patient, forbearing son.\n",
        "TRANSLATION_10": "Wherefore We gave him the glad tidings of a boy gentle.\n",
        "TRANSLATION_11": "So We gave him the good news of a forbearing son.\n",
        "TRANSLATION_12": "So We gave him the good news of a boy ready to suffer and forbear.\n",
        "TRANSLATION_13": "So We gave him the glad tidings of a forbearing boy.\n",
        "TRANSLATION_14": "And We gave him the glad tidings of a very gentle son (Ishmael).\n",
        "TRANSLATION_15": "So We gave him good news of a clement boy.\n",
        "TRANSLATION_16": "So We gave him good tidings of a forbearing boy.\n",
        "TRANSLATION_17": "[37:101] So We gave him the good tidings of a forbearing son.\n",
        "TRANSLATION_18": "(So We gave him tidings of a gentle son) a son who is knowledgeable in his youth, gentle in his old age.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "37:101",
            "15:53",
            "51:28",
            "52:32",
            "12:44",
            "37:90",
            "18:80",
            "52:24",
            "19:7",
            "21:5"
        ],
        "BIBLE": [
            "prophets:ezekiel:20:25",
            "prophets:isaiah:43:28",
            "torah:numbers:32:40",
            "torah:numbers:33:53",
            "prophets:i%20samuel:27:6",
            "writings:psalms:106:15",
            "torah:leviticus:19:24",
            "prophets:joshua:21:12",
            "prophets:joshua:14:13",
            "prophets:ii%20samuel:17:7"
        ]
    }
}