{
    "VERSE": "37:103",
    "ARABIC": "فَلَمَّآ أَسْلَمَا وَتَلَّهُۥ لِلْجَبِينِ",
    "ENGLISH": {
        "TRANSLATION_0": "Then when they had both submitted and he had lain him face down on the ground,",
        "TRANSLATION_1": "When they submitted to the will of God, and (Abraham) laid (his son) down prostrate on his temple,\n",
        "TRANSLATION_2": "When both surrendered (to Allah's command) and Abraham flung the son down on his forehead,\n",
        "TRANSLATION_3": "When they both agreed and Abraham had lain down his son on the side of his face (for slaughtering),\n",
        "TRANSLATION_4": "Then (remember) when they both submitted to Allah’s command, and Ibrahim lay his son facing downwards. (The knife did not hurt Ismail)\n",
        "TRANSLATION_5": "Then, when they had both submitted themselves, and he had laid him prostrate on his forehead;\n",
        "TRANSLATION_6": "So when they both submitted and he threw him down upon his forehead,\n",
        "TRANSLATION_7": "When they had surrendered, and he flung him upon his brow,\n",
        "TRANSLATION_8": "Then, when they had both surrendered (to Allah), and he had flung him down upon his face,\n",
        "TRANSLATION_9": "When they had both submitted to God, and he had laid his son down on his face,\n",
        "TRANSLATION_10": "Then when the twain had submitted themselves and he had prostrated him upon his temple.\n",
        "TRANSLATION_11": "So when they had both surrendered [to Allah’s will], and he had laid him down on his forehead,\n",
        "TRANSLATION_12": "So when they had both submitted their wills (to Allah), and he had laid him prostrate on his forehead (for sacrifice),\n",
        "TRANSLATION_13": "Then, when they had both submitted themselves (to the Will of Allah), and he had laid him prostrate on his forehead (or on the side of his forehead for slaughtering);\n",
        "TRANSLATION_14": "And when they had both submitted, and his son had laid down prostrate upon his forehead,\n",
        "TRANSLATION_15": "Then, when they had submitted, and he put his forehead down.\n",
        "TRANSLATION_16": "And when they had both submitted and he put him down upon his forehead,\n",
        "TRANSLATION_17": "[37:103] And when they had both submitted, [when] they had submitted to and were prepared to comply with God’s command, exalted be He, and he had laid him down on his forehead, [when] he had pushed him down to the ground thereon — every human being has two brows (jabīn) between which is the forehead (jabha); this was at Minā. Abraham passed the knife across his [son’s] throat but it did not do anything, by some impediment of the Divine Power,\n",
        "TRANSLATION_18": "(Then, when they had both surrendered (to Allah)) when they both agreed and consigned the matter to Allah, (and he had flung him down upon his face) and it is said: on his side,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "37:103",
            "26:94",
            "10:80",
            "37:116",
            "76:26",
            "70:25",
            "70:2",
            "52:49",
            "26:21",
            "68:50"
        ],
        "BIBLE": [
            "torah:genesis:24:48",
            "prophets:joshua:22:28",
            "torah:deuteronomy:6:15",
            "torah:deuteronomy:31:17",
            "writings:ii%20chronicles:6:42",
            "prophets:i%20samuel:15:2",
            "torah:genesis:48:11",
            "prophets:ezekiel:11:7",
            "torah:genesis:50:24",
            "torah:exodus:21:13"
        ]
    }
}