{
    "VERSE": "37:105",
    "ARABIC": "قَدْ صَدَّقْتَ ٱلرُّءْيَآ إِنَّا كَذَٰلِكَ نَجْزِى ٱلْمُحْسِنِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "you have discharged your vision.' That is how We recompense good-doers.",
        "TRANSLATION_1": "You have fulfilled your dream.\" Thus do We reward the good.\n",
        "TRANSLATION_2": "you have indeed fulfilled your dream. Thus do We reward the good-doers.”\n",
        "TRANSLATION_3": "you have fulfilled what you were commanded to do in your dream.\" Thus do We reward the righteous ones.\n",
        "TRANSLATION_4": "“You have indeed made the dream come true”; and this is how We reward the virtuous.\n",
        "TRANSLATION_5": "You have fulfilled the dream!\" Verily, thus do We reward the doers of good.\n",
        "TRANSLATION_6": "You have indeed shown the truth of the vision; surely thus do We reward the doers of good:\n",
        "TRANSLATION_7": "thou hast confirmed the vision; even so We recompense the good-doers.\n",
        "TRANSLATION_8": "Thou hast already fulfilled the vision. Lo! thus do We reward the good.\n",
        "TRANSLATION_9": "you have fulfilled the dream.\" It is thus indeed that We reward those who do good,\n",
        "TRANSLATION_10": "Of a surety thou hast fulfilled the vision. Verily We! thus We recompense the well-doers.\n",
        "TRANSLATION_11": "You have indeed fulfilled your vision! Thus indeed do We reward the virtuous!\n",
        "TRANSLATION_12": "Thou hast already fulfilled the vision!\" - thus indeed do We reward those who do right.\n",
        "TRANSLATION_13": "You have fulfilled the dream (vision)!\" Verily! Thus do We reward the Muhsinun (good-doers - see V. 2:112).\n",
        "TRANSLATION_14": "you have confirmed your vision' As such We recompense the gooddoers.\n",
        "TRANSLATION_15": "You have fulfilled the vision.” Thus We reward the doers of good.\n",
        "TRANSLATION_16": "You have fulfilled the vision.\" Indeed, We thus reward the doers of good.\n",
        "TRANSLATION_17": "[37:105] Verily you have fulfilled the vision’, by what you have done, in that you were able to go through with the act of sacrifice. In other words, that [which you have done] suffices for you [as redemption] (the statement nādaynāhu, ‘We called to him’, is the response to the lammā, ‘when’, so that the wāw [in wa-nādaynāhu, ‘We called to him’] is extra). So, in the same way that We have rewarded you, do We reward those who are virtuous, to their own souls in obeying the Command [of God], by removing from them their distress.\n",
        "TRANSLATION_18": "Thou hast already fulfilled the vision) you have fulfilled what you were commanded in the dream vision. (Lo! thus do We reward the good) in their words and works.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "37:105",
            "37:131",
            "77:44",
            "37:121",
            "37:80",
            "37:34",
            "15:95",
            "76:23",
            "7:174",
            "7:15"
        ],
        "BIBLE": [
            "writings:daniel:8:26",
            "prophets:i%20samuel:24:18",
            "torah:genesis:31:24",
            "prophets:ii%20samuel:7:28",
            "torah:genesis:41:22",
            "writings:daniel:2:2",
            "prophets:i%20samuel:29:6",
            "prophets:i%20samuel:15:13",
            "prophets:i%20kings:13:21",
            "writings:ecclesiastes:9:2"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:13",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:5:1"
        ]
    }
}