{
    "VERSE": "37:125",
    "ARABIC": "أَتَدْعُونَ بَعْلًا وَتَذَرُونَ أَحْسَنَ ٱلْخَٰلِقِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Do you call on Baal and abandon the Best of Creators?",
        "TRANSLATION_1": "Would you call on Baal and leave the best of creators,\n",
        "TRANSLATION_2": "Do you call upon Baal and forsake the Best of the Creators?\n",
        "TRANSLATION_3": "Do you worship Ba`al and abandon the Best Creator.\n",
        "TRANSLATION_4": "“What! You worship Baal (an idol) and leave the Best Creator?” –\n",
        "TRANSLATION_5": "Will you call upon `Ba`l and forsake the Best of creators,\n",
        "TRANSLATION_6": "What! do you call upon Ba'l and forsake the best of the creators,\n",
        "TRANSLATION_7": "Do you call on Baal, and abandon the Best of creators?\n",
        "TRANSLATION_8": "Will ye cry unto Baal and forsake the Best of creators,\n",
        "TRANSLATION_9": "Do you call on Baal and abandon the Best of Creators,\n",
        "TRANSLATION_10": "Call ye upon Bal and forsake the Best of creators.\n",
        "TRANSLATION_11": "Do you invoke Baal and abandon the best of creators,\n",
        "TRANSLATION_12": "Will ye call upon Baal and forsake the Best of Creators,-\n",
        "TRANSLATION_13": "Will you call upon Ba'l (a well- known idol of his nation whom they used to worship) and forsake the Best of creators,\n",
        "TRANSLATION_14": "Do you call on Ba'lan (the idol Baal) and abandon the Best Creator,\n",
        "TRANSLATION_15": "Do you call on Baal, and forsake the Best of creators?\n",
        "TRANSLATION_16": "Do you call upon Ba'l and leave the best of creators -\n",
        "TRANSLATION_17": "[37:125] Do you call on Baal — this was the name of an idol of theirs which was made of gold, from which the name of their city derives, with the addition of [the suffix] bak — that is to say, do you worship him, and abandon the Best of Creators, and not worship Him,\n",
        "TRANSLATION_18": "(Will ye cry unto Baal) will you worship other deities beside Allah; it is also said that this means: will you worship a bull instead of worshipping Allah; it is also said that his people had an idol called Baal which was 30 cubits tall and had four faces (and forsake the best of Creators) and forsake the worship of the greatest of Creators, such that you do not worship him at all,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "37:125",
            "92:9",
            "92:6",
            "41:33",
            "13:29",
            "56:64",
            "56:59",
            "23:96",
            "39:18",
            "29:7"
        ],
        "BIBLE": [
            "prophets:isaiah:45:4",
            "torah:genesis:30:20",
            "prophets:jeremiah:33:3",
            "prophets:jeremiah:14:9",
            "prophets:isaiah:55:6",
            "prophets:ezekiel:39:28",
            "prophets:isaiah:48:8",
            "prophets:isaiah:62:4",
            "prophets:amos:9:12",
            "torah:genesis:17:5"
        ]
    }
}