{
    "VERSE": "37:127",
    "ARABIC": "فَكَذَّبُوهُ فَإِنَّهُمْ لَمُحْضَرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "they denied him and so they will be among those arraigned -",
        "TRANSLATION_1": "They denied him, and will surely be brought to punishment,\n",
        "TRANSLATION_2": "But they denounced him as a liar, so they will surely be arraigned (for punishment),\n",
        "TRANSLATION_3": "They called him a liar. Thus, all of them will suffer torment\n",
        "TRANSLATION_4": "In response they denied him, so they will surely be brought forth as captives.\n",
        "TRANSLATION_5": "But they denied him, so they will certainly be brought forth,\n",
        "TRANSLATION_6": "But they called him a liar, therefore they shall most surely be brought up.\n",
        "TRANSLATION_7": "But they cried him lies; so they will be among the arraigned,\n",
        "TRANSLATION_8": "But they denied him, so they surely will be haled forth (to the doom)\n",
        "TRANSLATION_9": "but they rejected him, and thus will certainly be called to account;\n",
        "TRANSLATION_10": "Then they belied him, so verily they are to be brought up.\n",
        "TRANSLATION_11": "they impugned him. So they will indeed be mustered [in hell]\n",
        "TRANSLATION_12": "But they rejected him, and they will certainly be called up (for punishment),-\n",
        "TRANSLATION_13": "But they denied him [Iliyas (Elias)], so they will certainly be brought forth (to the punishment),\n",
        "TRANSLATION_14": "But they belied him, so they will be among the arraigned (in Hell),\n",
        "TRANSLATION_15": "But they called him a liar, and thus they will be brought forward.\n",
        "TRANSLATION_16": "And they denied him, so indeed, they will be brought [for punishment],\n",
        "TRANSLATION_17": "[37:127] But they denied him. So they will indeed be arraigned, in the Fire,\n",
        "TRANSLATION_18": "(But they denied him) they denied his message, (so they surely will be haled forth (to the doom)) they will be brought in order to be tormented in the Fire,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "37:127",
            "44:59",
            "68:26",
            "26:60",
            "68:21",
            "44:34",
            "88:21",
            "37:90",
            "37:32",
            "32:30"
        ],
        "BIBLE": [
            "torah:genesis:20:9",
            "prophets:i%20samuel:19:7",
            "prophets:isaiah:54:6",
            "prophets:jeremiah:35:17",
            "prophets:isaiah:66:4",
            "torah:genesis:41:14",
            "prophets:isaiah:62:4",
            "torah:genesis:39:14",
            "torah:deuteronomy:28:10",
            "writings:psalms:119:146"
        ]
    }
}