{
    "VERSE": "37:142",
    "ARABIC": "فَٱلْتَقَمَهُ ٱلْحُوتُ وَهُوَ مُلِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "Then the fish devoured him and he was to blame.",
        "TRANSLATION_1": "Then he was swallowed by a large fish as he was worthy of blame.\n",
        "TRANSLATION_2": "Then a fish swallowed him, and he was blameworthy.\n",
        "TRANSLATION_3": "The fish swallowed him up and he deserved (all this).\n",
        "TRANSLATION_4": "The fish then swallowed him and he blamed himself. (For not waiting for Allah’s command.)\n",
        "TRANSLATION_5": "Then a (big) fish swallowed him as he had done an act worthy of blame.\n",
        "TRANSLATION_6": "So the fish swallowed him while he did that for which he blamed himself\n",
        "TRANSLATION_7": "then the whale swallowed him down, and he blameworthy.\n",
        "TRANSLATION_8": "And the fish swallowed him while he was blameworthy;\n",
        "TRANSLATION_9": "and the fish swallowed him while he was blaming himself.\n",
        "TRANSLATION_10": "And a fish swallowed him, and he was reproaching himself.\n",
        "TRANSLATION_11": "Then the fish swallowed him while he was blameworthy.\n",
        "TRANSLATION_12": "Then the big Fish did swallow him, and he had done acts worthy of blame.\n",
        "TRANSLATION_13": "Then a (big) fish swallowed him and he had done an act worthy of blame.\n",
        "TRANSLATION_14": "So the whale swallowed him, for he was blameworthy,\n",
        "TRANSLATION_15": "Then the fish swallowed him, and he was to blame.\n",
        "TRANSLATION_16": "Then the fish swallowed him, while he was blameworthy.\n",
        "TRANSLATION_17": "[37:142] Then the whale swallowed him while he was blameworthy, that is, while he was guilty of a blameworthy thing, having gone to sea and embarked the ship without his Lord’s permission.\n",
        "TRANSLATION_18": "(And the fish swallowed him while be was blameworthy) he reproached himself for fleeing from his folk;\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "37:142",
            "68:48",
            "26:46",
            "83:21",
            "15:73",
            "15:83",
            "3:143",
            "96:17",
            "80:33",
            "68:8"
        ],
        "BIBLE": [
            "writings:psalms:124:3",
            "prophets:joshua:11:15",
            "prophets:isaiah:49:19",
            "torah:exodus:7:12",
            "writings:psalms:119:6",
            "prophets:i%20kings:5:20",
            "writings:psalms:35:25",
            "writings:job:37:20",
            "torah:genesis:41:24",
            "writings:psalms:107:27"
        ]
    }
}