{
    "VERSE": "37:144",
    "ARABIC": "لَلَبِثَ فِى بَطْنِهِۦٓ إِلَىٰ يَوْمِ يُبْعَثُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "he would have remained inside its belly until the Day they are raised again.",
        "TRANSLATION_1": "He would have stayed in its belly till the day the dead are raised.\n",
        "TRANSLATION_2": "he would certainly have remained in its belly till the Day of Resurrection.\n",
        "TRANSLATION_3": "he would certainly have remained inside the fish until the Day of Resurrection.\n",
        "TRANSLATION_4": "He would have remained in its belly till the day when all will be raised.\n",
        "TRANSLATION_5": "He would have indeed remained inside its belly (the fish) till the Day of Resurrection.\n",
        "TRANSLATION_6": "He would certainly have tarried in its belly to the day when they are raised.\n",
        "TRANSLATION_7": "he would have tarried in its belly until the day they shall be raised;\n",
        "TRANSLATION_8": "He would have tarried in its belly till the day when they are raised;\n",
        "TRANSLATION_9": "he would certainly have remained inside the fish till the Day of Resurrection.\n",
        "TRANSLATION_10": "He would have tarried in the belly thereof till the Day when they are raised.\n",
        "TRANSLATION_11": "he would have surely remained in its belly till the day they will be resurrected.\n",
        "TRANSLATION_12": "He would certainly have remained inside the Fish till the Day of Resurrection.\n",
        "TRANSLATION_13": "He would have indeed remained inside its belly (the fish) till the Day of Resurrection.\n",
        "TRANSLATION_14": "he would have lingered in its belly till the Day they are resurrected.\n",
        "TRANSLATION_15": "He would have stayed in its belly until the Day they are raised.\n",
        "TRANSLATION_16": "He would have remained inside its belly until the Day they are resurrected.\n",
        "TRANSLATION_17": "[37:144] he would have tarried in its belly until the day when they are raised, in other words, the whale’s belly would have been his tomb until the Day of Resurrection.\n",
        "TRANSLATION_18": "516 (He would have tarried in its belly) he would have remained in the belly of the fish (till the day when they are raised) from the graves;\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "37:144",
            "7:14",
            "52:45",
            "52:13",
            "15:36",
            "38:79",
            "77:12",
            "77:35",
            "37:66",
            "51:13"
        ],
        "BIBLE": [
            "prophets:hosea:6:2",
            "prophets:i%20kings:14:14",
            "writings:psalms:107:25",
            "prophets:judges:2:18",
            "writings:psalms:30:2",
            "writings:ii%20chronicles:8:8",
            "prophets:jeremiah:29:15",
            "writings:psalms:41:11",
            "prophets:i%20kings:9:21",
            "prophets:isaiah:49:11"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:3:7",
            "Sefer%20Yetzirah:4:11",
            "Sefer%20Yetzirah:3:4",
            "Sefer%20Yetzirah:4:12",
            
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:1:6"
        ]
    }
}