{
    "VERSE": "37:159",
    "ARABIC": "سُبْحَٰنَ ٱللَّهِ عَمَّا يَصِفُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Glory be to Allah above what they describe -",
        "TRANSLATION_1": "God is too glorious for what they ascribe to Him\n",
        "TRANSLATION_2": "(They say): “Exalted be Allah above what they attribute to Him,\n",
        "TRANSLATION_3": "God is too glorious to be described as they describe Him\n",
        "TRANSLATION_4": "Purity is to Allah from the matters they fabricate.\n",
        "TRANSLATION_5": "Glorified be Allah! (He is free) from what they attribute unto Him!\n",
        "TRANSLATION_6": "Glory be to Allah (for freedom) from what they describe;\n",
        "TRANSLATION_7": "Glory be to God above that they describe,\n",
        "TRANSLATION_8": "Glorified be Allah from that which they attribute (unto Him),\n",
        "TRANSLATION_9": "God is far above what they attribute to Him,\n",
        "TRANSLATION_10": "Hallowed be Allah from that which they ascribe to Him.\n",
        "TRANSLATION_11": "Clear is Allah of whatever they allege [about Him]\n",
        "TRANSLATION_12": "Glory to Allah! (He is free) from the things they ascribe (to Him)!\n",
        "TRANSLATION_13": "Glorified is Allah! (He is Free) from what they attribute unto Him!\n",
        "TRANSLATION_14": "Exaltations to Allah above what they describe,\n",
        "TRANSLATION_15": "God be glorified, far above what they allege.\n",
        "TRANSLATION_16": "Exalted is Allah above what they describe,\n",
        "TRANSLATION_17": "[37:159] Glory be to God, affirming that He is exalted, above what they attribute, [to Him] in the way of His having a child,\n",
        "TRANSLATION_18": "(Glorified be Allah) Allah exonerates Himself (from that which they attribute (unto Him)) from the lies they attribute to Him,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "37:159",
            "52:43",
            "16:1",
            "16:57",
            "28:68",
            "30:40",
            "30:17",
            "21:22",
            "47:1",
            "23:91"
        ],
        "BIBLE": [
            "writings:proverbs:25:2",
            "prophets:i%20samuel:3:17",
            "torah:leviticus:9:6",
            "writings:daniel:12:8",
            "torah:genesis:22:1",
            "torah:leviticus:8:5",
            "writings:proverbs:30:15",
            "prophets:i%20samuel:4:7",
            "prophets:ezekiel:20:7",
            "writings:psalms:57:6"
        ]
    }
}