{
    "VERSE": "37:168",
    "ARABIC": "لَوْ أَنَّ عِندَنَا ذِكْرًا مِّنَ ٱلْأَوَّلِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "'If we had only had a Reminder from the previous peoples,",
        "TRANSLATION_1": "If we had the account of earlier people with us,\n",
        "TRANSLATION_2": "“If only we had the Reminder which had been granted to the people of yore\n",
        "TRANSLATION_3": "Had we received guidance from the people living before us,\n",
        "TRANSLATION_4": "“If we had some advice from the earlier generations,” –\n",
        "TRANSLATION_5": "If we had a reminder as had the men of old,\"\n",
        "TRANSLATION_6": "Had we a reminder from those of yore,\n",
        "TRANSLATION_7": "If only we had had a Reminder from the ancients,\n",
        "TRANSLATION_8": "If we had but a reminder from the men of old\n",
        "TRANSLATION_9": "If we had had with us a Book like that of the people of old,\n",
        "TRANSLATION_10": "Had we but an admonition as had the ancients.\n",
        "TRANSLATION_11": "‘Had we possessed a Reminder from our predecessors,\n",
        "TRANSLATION_12": "If only we had had before us a Message from those of old,\n",
        "TRANSLATION_13": "If we had a reminder as had the men of old (before the coming of Prophet Muhammad SAW as a Messenger of Allah).\n",
        "TRANSLATION_14": "If only we had a reminder from the ancients,\n",
        "TRANSLATION_15": "“Had we received advice from the ancients.\n",
        "TRANSLATION_16": "If we had a message from [those of] the former peoples,\n",
        "TRANSLATION_17": "[37:168] ‘If we had but a reminder, a scripture, from the ancients, that is, from among the scriptures of past communities,\n",
        "TRANSLATION_18": "(If we had but a reminder from the men of old) if we had a messenger as the people of old had.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "37:168",
            "53:50",
            "53:15",
            "44:5",
            "43:6",
            "38:47",
            "56:13",
            "56:39",
            "51:34",
            "53:56"
        ],
        "BIBLE": [
            "torah:genesis:5:1",
            "prophets:jeremiah:2:31",
            "writings:psalms:102:19",
            "writings:daniel:9:2",
            "writings:nehemiah:8:3",
            "torah:deuteronomy:2:14",
            "prophets:ii%20kings:23:2",
            "writings:psalms:90:1",
            "writings:job:27:13",
            "prophets:ezekiel:1:5"
        ]
    }
}