{
    "VERSE": "37:170",
    "ARABIC": "فَكَفَرُوا۟ بِهِۦ فَسَوْفَ يَعْلَمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "But they have rejected it and they will soon know!",
        "TRANSLATION_1": "Yet now (that it has come) they refuse to believe in it; but they will come to know soon.\n",
        "TRANSLATION_2": "But when it came to them, they rejected it. They shall soon come to know (the end of such an attitude).\n",
        "TRANSLATION_3": "They have rejected the Quran. They will soon know the consequences (of their disbelief).\n",
        "TRANSLATION_4": "They therefore denied it, so they will soon come to know.\n",
        "TRANSLATION_5": "But (now) they disbelieve therein, so they will come to know!\n",
        "TRANSLATION_6": "But (now) they disbelieve in it, so they will come to know.\n",
        "TRANSLATION_7": "But they disbelieved in it; soon they shall know!\n",
        "TRANSLATION_8": "Yet (now that it is come) they disbelieve therein; but they will come to know.\n",
        "TRANSLATION_9": "but they have rejected it, [the Quran] and they shall soon learn!\n",
        "TRANSLATION_10": "Yet they disbelieve therein. Presently they shall come to know.\n",
        "TRANSLATION_11": "But they disbelieved it [when it came to them]. Soon they will know!\n",
        "TRANSLATION_12": "But (now that the Qur'an has come), they reject it: But soon will they know!\n",
        "TRANSLATION_13": "But (now that the Quran has come) they disbelieve therein (i.e. in the Quran and in Prophet Muhammad SAW, and all that which he brought, the Divine Revelation), so they will come to know!\n",
        "TRANSLATION_14": "But they disbelieve in it (the Koran), but soon they shall know!\n",
        "TRANSLATION_15": "But they rejected it, so they will find out.\n",
        "TRANSLATION_16": "But they disbelieved in it, so they are going to know.\n",
        "TRANSLATION_17": "[37:170] God, exalted be He, says: Yet they disbelieved in it, in other words, in the Book that came to them, namely, the Qur’ān, more glorious than [all] those other scriptures; but they will come to know, the consequences of their disbelief.\n",
        "TRANSLATION_18": "(Yet (now that it is come) the, disbelieve therein) they disbelieve in Muhammad (pbuh) and in the Qur'an when they came to them: (but they will come to know) what will be done to them when they die, in the grave and on the Day of Judgement.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "37:170",
            "37:179",
            "37:175",
            "16:55",
            "30:34",
            "29:66",
            "37:94",
            "51:54",
            "26:60",
            "68:21"
        ],
        "BIBLE": [
            "prophets:isaiah:41:22",
            "torah:genesis:27:30",
            "prophets:hosea:6:3",
            "prophets:i%20samuel:13:10",
            "prophets:ii%20samuel:24:8",
            "prophets:ii%20samuel:3:25",
            "writings:psalms:51:2",
            "writings:psalms:77:9",
            "prophets:ezekiel:7:6",
            "prophets:i%20samuel:10:13"
        ]
    }
}