{
    "VERSE": "37:177",
    "ARABIC": "فَإِذَا نَزَلَ بِسَاحَتِهِمْ فَسَآءَ صَبَاحُ ٱلْمُنذَرِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "When it descends in their courtyard - how evil will be the morning of those who were warned!",
        "TRANSLATION_1": "When it comes down on their plains, it will be an evil dawn for those who had been warned.\n",
        "TRANSLATION_2": "When that chastisement will descend upon their courtyard, evil shall that Day be for those who had been warned.\n",
        "TRANSLATION_3": "When it descends into their courtyard, it will be terrible for those who have already been warned.\n",
        "TRANSLATION_4": "So when it does descend in their courtyards – so what an evil morning it will be for those who were warned!\n",
        "TRANSLATION_5": "Then, when it descends in their courtyard, evil will be the morning for those who had warned!\n",
        "TRANSLATION_6": "But when it shall descend in their court, evil shall then be the morning of the warned ones.\n",
        "TRANSLATION_7": "When it lights in their courtyard, how evil will be the morning of them that are warned!\n",
        "TRANSLATION_8": "But when it cometh home to them, then it will be a hapless morn for those who have been warned.\n",
        "TRANSLATION_9": "When it descends on their courtyards, how terrible that morning will be for those who were warned!\n",
        "TRANSLATION_10": "Then when it descendeth Unto them face to, face, a hapless morn that shall be for those who were Warned.\n",
        "TRANSLATION_11": "But when it descends in their courtyard it will be a dismal dawn for those who had been warned.\n",
        "TRANSLATION_12": "But when it descends into the open space before them, evil will be the morning for those who were warned (and heeded not)!\n",
        "TRANSLATION_13": "Then, when it descends into their courtyard (i.e. near to them), evil will be the morning for those who had been warned!\n",
        "TRANSLATION_14": "When it descends upon their courtyards, evil will be the morning of those forewarned.\n",
        "TRANSLATION_15": "When it descends into their yard, miserable will be the morning of those forewarned.\n",
        "TRANSLATION_16": "But when it descends in their territory, then evil is the morning of those who were warned.\n",
        "TRANSLATION_17": "[37:177] But when it descends in their courtyard — al-Farrā’ said that the Arabs find it sufficient to refer to a people by referring to ‘their courtyard’ — how awful, how terrible a morning, will be the morning for those who were warned (the overt noun [al-mundharīn] has replaced the [third person] pronominalisation [in sāhatihim]).\n",
        "TRANSLATION_18": "(But when it cometh home to them, then it will be a hapless morn for those who have been warned) when the punishment comes, what an evil morning it is for those whom the messengers warned but rejected faith.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "37:177",
            "81:18",
            "74:34",
            "80:33",
            "100:3",
            "69:5",
            "43:50",
            "15:83",
            "15:73",
            "75:7"
        ],
        "BIBLE": [
            "writings:psalms:73:14",
            "torah:deuteronomy:31:17",
            "torah:exodus:10:10",
            "writings:esther:4:11",
            "prophets:judges:16:2",
            "torah:genesis:4:14",
            "writings:job:41:5",
            "prophets:i%20kings:8:29",
            "torah:deuteronomy:31:18",
            "prophets:malachi:3:23"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:2:6"
        ]
    }
}