{
    "VERSE": "37:180",
    "ARABIC": "سُبْحَٰنَ رَبِّكَ رَبِّ ٱلْعِزَّةِ عَمَّا يَصِفُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Glory be to your Lord, the Lord of Might, beyond anything they describe.",
        "TRANSLATION_1": "Too glorious is your Lord, the Lord of power, for what they ascribe to Him.\n",
        "TRANSLATION_2": "Exalted be your Lord, the Lord of Glory, above what they attribute to Him,\n",
        "TRANSLATION_3": "Your Lord, the Lord of Honor, is too exalted to be considered as they describe Him.\n",
        "TRANSLATION_4": "Purity is to your Lord, the Lord of Honour, from all what they say.\n",
        "TRANSLATION_5": "Glorified be your Lord, the Lord of Al-`Izzah! (He is free) from what they attribute unto Him!\n",
        "TRANSLATION_6": "Glory be to your Lord, the Lord of Honor, above what they describe.\n",
        "TRANSLATION_7": "Glory be to thy Lord, the Lord of Glory, above that they describe!\n",
        "TRANSLATION_8": "Glorified be thy Lord, the Lord of Majesty, from that which they attribute (unto Him)\n",
        "TRANSLATION_9": "Glory be to your Lord: the Lord of Glory is far above what they attribute to Him.\n",
        "TRANSLATION_10": "Hallowed be thine Lord, the Lord of Majesty, from that which they ascribe!\n",
        "TRANSLATION_11": "Clear is your Lord, the Lord of Might, of whatever they allege [concerning Him].\n",
        "TRANSLATION_12": "Glory to thy Lord, the Lord of Honour and Power! (He is free) from what they ascribe (to Him)!\n",
        "TRANSLATION_13": "Glorified be your Lord, the Lord of Honour and Power! (He is free) from what they attribute unto Him!\n",
        "TRANSLATION_14": "Exaltations be to your Lord, the Lord of Might, above that they describe!\n",
        "TRANSLATION_15": "Exalted be your Lord, the Lord of Glory, beyond their allegations.\n",
        "TRANSLATION_16": "Exalted is your Lord, the Lord of might, above what they describe.\n",
        "TRANSLATION_17": "[37:180] Glory be to your Lord, the Lord of Might, of Triumph, [exalted is He] above what they allege!, in the way of His having a child.\n",
        "TRANSLATION_18": "519 (Glorified be thy Lord) Allah exonerated Himself from having a son or partner, (the Lord of Majesty) the Lord of might and power, (from that which they attribute (unto Him)) from the lies they invent about Him.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "37:180",
            "68:29",
            "28:68",
            "43:82",
            "23:39",
            "23:26",
            "21:22",
            "28:63",
            "60:5",
            "36:27"
        ],
        "BIBLE": [
            "writings:i%20chronicles:17:18",
            "writings:daniel:4:27",
            "writings:psalms:21:14",
            "prophets:zechariah:4:6",
            "torah:numbers:14:17",
            "writings:i%20chronicles:29:11",
            "writings:psalms:147:5",
            "torah:deuteronomy:13:13",
            "writings:job:1:12",
            "torah:numbers:9:8"
        ]
    }
}