{
    "VERSE": "37:182",
    "ARABIC": "وَٱلْحَمْدُ لِلَّهِ رَبِّ ٱلْعَٰلَمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "And praise be to Allah, the Lord of all the worlds!",
        "TRANSLATION_1": "And all praise to God, the Lord of all the worlds.\n",
        "TRANSLATION_2": "and all praise be to Allah, the Lord of the Universe.\n",
        "TRANSLATION_3": "It is only God, the Lord of the Universe, who deserves all praise.\n",
        "TRANSLATION_4": "And all praise is to Allah, the Lord Of The Creation.\n",
        "TRANSLATION_5": "And all the praises and thanks be to Allah, Lord of all that exists.\n",
        "TRANSLATION_6": "And all praise is due to Allah, the Lord of the worlds.\n",
        "TRANSLATION_7": "and praise belongs to God, the Lord of all Being.\n",
        "TRANSLATION_8": "And praise be to Allah, Lord of the Worlds!\n",
        "TRANSLATION_9": "and praise be to God, the Lord of all the Worlds.\n",
        "TRANSLATION_10": "And all praise Unto Allah the Lord of the worlds.\n",
        "TRANSLATION_11": "All praise belongs to Allah, Lord of all the worlds.\n",
        "TRANSLATION_12": "And Praise to Allah, the Lord and Cherisher of the Worlds.\n",
        "TRANSLATION_13": "And all the praise and thanks be to Allah, Lord of the 'Alamin (mankind, jinns and all that exists).\n",
        "TRANSLATION_14": "And praise belongs to Allah, Lord of the Worlds.\n",
        "TRANSLATION_15": "And praise be to God, the Lord of the Worlds.\n",
        "TRANSLATION_16": "And praise to Allah, Lord of the worlds.\n",
        "TRANSLATION_17": "[37:182] And praise be to God, Lord of the Worlds, for granting these [messengers] victory and destroying the disbelievers. Meccan: it consists of 86 or 88 verses, revealed after [sūrat] al-Qamar.\n",
        "TRANSLATION_18": "(And praise be to Allah) thanks and divine Oneness belong to Allah for the safety of the messenger and destruction of their folks, (Lord of the Worlds) the Master of the jinn and human beings!' And of the surah in which Sad is mentioned, which is all Meccan and consists of 89 verses, 732 words and 3,066 letters: Surah 38: Sad And of the surah in which Sad is mentioned, which is all Meccan and consists of 89 verses, 732 words and 3,066 letters:\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "37:182",
            "1:2",
            "45:36",
            "6:45",
            "40:65",
            "10:10",
            "39:75",
            "27:93",
            "69:43",
            "56:80"
        ],
        "BIBLE": [
            "writings:psalms:146:2",
            "writings:psalms:104:33",
            "writings:psalms:68:33",
            "writings:psalms:106:47",
            "writings:psalms:30:13",
            "writings:psalms:68:5",
            "writings:psalms:147:7",
            "torah:deuteronomy:29:28",
            "writings:psalms:18:50",
            "prophets:joshua:1:17"
        ]
    }
}