{
    "VERSE": "37:19",
    "ARABIC": "فَإِنَّمَا هِىَ زَجْرَةٌ وَٰحِدَةٌ فَإِذَا هُمْ يَنظُرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "There will be but one Great Blast and then their eyes will open.",
        "TRANSLATION_1": "There will only be a single jerk, and they will gape,\n",
        "TRANSLATION_2": "There will be a single stern rebuff and lo, they will be observing with their own eyes (all that they had been warned against).\n",
        "TRANSLATION_3": "The Day of Judgment will come within a single roar and they will remain gazing at it.\n",
        "TRANSLATION_4": "So that is just a single jolt, thereupon they will begin staring.\n",
        "TRANSLATION_5": "It will be a single Zajrah, and behold, they will be staring!\n",
        "TRANSLATION_6": "So it shall only be a single cry, when lo! they shall see.\n",
        "TRANSLATION_7": "For it is only a single scaring, then behold, they are watching\n",
        "TRANSLATION_8": "There is but one Shout, and lo! they behold,\n",
        "TRANSLATION_9": "There will be but a single blast and then their eyes will open.\n",
        "TRANSLATION_10": "It shall be but one shout, lo! they shall be staring.\n",
        "TRANSLATION_11": "It will be only a single shout and, behold, they will look on,\n",
        "TRANSLATION_12": "Then it will be a single (compelling) cry; and behold, they will begin to see!\n",
        "TRANSLATION_13": "It will be a single Zajrah [shout (i.e. the second blowing of the Trumpet)], and behold, they will be staring!\n",
        "TRANSLATION_14": "It will be but one Shout, then see, they are watching\n",
        "TRANSLATION_15": "It will be a single nudge, and they will be staring.\n",
        "TRANSLATION_16": "It will be only one shout, and at once they will be observing.\n",
        "TRANSLATION_17": "[37:19] For it will be only (innamā hiya, this [hiya] is a demonstrative pronoun explained by [the following, zajratun) a single cry and, lo! they, all creatures, will be, alive, watching, [to see] what will be done with them.\n",
        "TRANSLATION_18": "(There is but one Shout) it is but one single blow, which is the blowing of the Resurrection, (and lo!) they emerge from the graves and (they behold) what they will be commanded to do.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "37:19",
            "79:13",
            "88:21",
            "44:59",
            "21:92",
            "21:108",
            "23:52",
            "36:53",
            "69:13",
            "36:49"
        ],
        "BIBLE": [
            "prophets:ii%20kings:6:20",
            "torah:numbers:24:14",
            "prophets:jeremiah:51:47",
            "prophets:ii%20samuel:13:34",
            "prophets:isaiah:60:4",
            "torah:genesis:19:8",
            "writings:psalms:121:1",
            "torah:leviticus:14:35",
            "prophets:jeremiah:51:52",
            "prophets:i%20samuel:20:21"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:2:6",
            "Sefer%20Yetzirah:4:4"
        ]
    }
}