{
    "VERSE": "37:28",
    "ARABIC": "قَالُوٓا۟ إِنَّكُمْ كُنتُمْ تَأْتُونَنَا عَنِ ٱلْيَمِينِ",
    "ENGLISH": {
        "TRANSLATION_0": "One group will say, 'You used to come at us from a position of power.'",
        "TRANSLATION_1": "Saying: \"It were you who imposed yourselves upon us.\"\n",
        "TRANSLATION_2": "(The followers will say to their leaders): “You used to come to us from the right hand.”\n",
        "TRANSLATION_3": "It was you who tried to mislead us from righteousness\".\n",
        "TRANSLATION_4": "They said, “It is you who used to come to us from our right, in order to sway.”\n",
        "TRANSLATION_5": "They will say: \"It was you who used to come to us from the right side.\"\n",
        "TRANSLATION_6": "They shall say: Surely you used to come to us from the right side.\n",
        "TRANSLATION_7": "These say, 'Why, you of old would come to us from the right hand.'\n",
        "TRANSLATION_8": "They say: Lo! ye used to come unto us, imposing, (swearing that ye spoke the truth).\n",
        "TRANSLATION_9": "They will say, \"You used to come at us from the right.\"\n",
        "TRANSLATION_10": "They will say: verily ye! ye were wont to come Unto us Imposing.\n",
        "TRANSLATION_11": "They will say, ‘Indeed you used to accost us peremptorily.’\n",
        "TRANSLATION_12": "They will say: \"It was ye who used to come to us from the right hand (of power and authority)!\"\n",
        "TRANSLATION_13": "They will say: \"It was you who used to come to us from the right side [i.e. from the right side of one of us and beautify for us every evil, order us for polytheism, and stop us from the truth i.e. Islamic Monotheism and from every good deed].\"\n",
        "TRANSLATION_14": "saying: 'You used to come to us from the right hand'\n",
        "TRANSLATION_15": "They will say, “You used to come at us from the right.”\n",
        "TRANSLATION_16": "They will say, \"Indeed, you used to come at us from the right.\"\n",
        "TRANSLATION_17": "[37:28] They, that is, the followers among them, will say, to those whom they followed: ‘Indeed you used to approach us from the right’, in other words, from that aspect in which we used to trust you, for you used to swear that you followed the truth, and so we believed you and we followed you — in other words, ‘Indeed, you have led us astray!’\n",
        "TRANSLATION_18": "(They say) i.e. the humans say to the satans: (Lo! ye used to come unto us, imposing, (swearing that ye spoke the Truth)) and enticing us to reject Religion.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "37:28",
            "69:45",
            "68:39",
            "37:93",
            "56:38",
            "37:172",
            "15:95",
            "20:69",
            "23:65",
            "56:90"
        ],
        "BIBLE": [
            "torah:numbers:22:38",
            "prophets:jeremiah:32:7",
            "torah:genesis:31:29",
            "torah:numbers:10:29",
            "torah:deuteronomy:2:4",
            "prophets:ii%20kings:6:33",
            "prophets:i%20samuel:29:6",
            "torah:numbers:22:20",
            "torah:genesis:47:18",
            "torah:deuteronomy:26:3"
        ]
    }
}