{
    "VERSE": "37:30",
    "ARABIC": "وَمَا كَانَ لَنَا عَلَيْكُم مِّن سُلْطَٰنٍۭ بَلْ كُنتُمْ قَوْمًا طَٰغِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "We had no authority over you. Rather you were unbridled people.",
        "TRANSLATION_1": "We had no power over you. In fact, you were a people rebellious.\n",
        "TRANSLATION_2": "We had no power over you. You were a rebellious people,\n",
        "TRANSLATION_3": "We had no authority over you, in fact, you were a rebellious people.\n",
        "TRANSLATION_4": "“And we did not have any control over you; but in fact you yourselves were rebellious.”\n",
        "TRANSLATION_5": "And we had no authority over you. Nay! But you were a transgressing people.\"\n",
        "TRANSLATION_6": "And we had no authority over you, but you were an inordinate people;\n",
        "TRANSLATION_7": "we had no authority over you; no, you were an insolent people.\n",
        "TRANSLATION_8": "We had no power over you, but ye were wayward folk.\n",
        "TRANSLATION_9": "we had no power over you; but you yourselves were a rebellious people.\n",
        "TRANSLATION_10": "And we had over you no authority, but ye were a people exorbitant.\n",
        "TRANSLATION_11": "We had no authority over you. No, you [yourselves] were a rebellious lot.\n",
        "TRANSLATION_12": "Nor had we any authority over you. Nay, it was ye who were a people in obstinate rebellion!\n",
        "TRANSLATION_13": "And we had no authority over you. Nay! But you were transgressing people (disobedient, polytheists, and disbelievers).\n",
        "TRANSLATION_14": "We had no authority over you, but you were an insolent nation.\n",
        "TRANSLATION_15": "We had no authority over you. You yourselves were rebellious people.\n",
        "TRANSLATION_16": "And we had over you no authority, but you were a transgressing people.\n",
        "TRANSLATION_17": "[37:30] And we did not have any warrant, any sway or power, over you, to compel you to follow us. Nay, but you [yourselves] were a rebellious folk, astray, like us.\n",
        "TRANSLATION_18": "(We had no power over you) we had no reason or proof to win you over, (but ye were wayward folk) but you were disbelievers in Allah.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "37:30",
            "37:164",
            "20:79",
            "26:166",
            "37:156",
            "51:25",
            "51:53",
            "26:70",
            "51:46",
            "37:124"
        ],
        "BIBLE": [
            "writings:ii%20chronicles:36:14",
            "torah:leviticus:18:24",
            "writings:ezra:10:13",
            "writings:daniel:8:24",
            "torah:deuteronomy:32:9",
            "prophets:ezekiel:2:3",
            "writings:ii%20chronicles:32:13",
            "writings:psalms:33:12",
            "prophets:jeremiah:33:24",
            "writings:psalms:111:6"
        ]
    }
}