{
    "VERSE": "37:31",
    "ARABIC": "فَحَقَّ عَلَيْنَا قَوْلُ رَبِّنَآ إِنَّا لَذَآئِقُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Our Lord's Word has been carried out against us, that we would taste it.",
        "TRANSLATION_1": "The sentence of our Lord has come true for us. We have certainly to taste (the punishment),\n",
        "TRANSLATION_2": "and so we became deserving of the Word of our Lord that we shall be made to suffer chastisement.\n",
        "TRANSLATION_3": "Thus, the words of Our Lord about us have come true and now we are suffering the torment.\n",
        "TRANSLATION_4": "“So the Word of our Lord has proved true upon us; we will surely have to taste (the punishment).”\n",
        "TRANSLATION_5": "So now the Word of our Lord has been justified against us, that we shall certainly taste (the torment).\"\n",
        "TRANSLATION_6": "So the sentence of our Lord has come to pass against us: (now) we shall surely taste;\n",
        "TRANSLATION_7": "So our Lord's Word is realised against us; we are tasting it.\n",
        "TRANSLATION_8": "Now the Word of our Lord hath been fulfilled concerning us. Lo! we are about to taste (the doom).\n",
        "TRANSLATION_9": "But now our Lord's word has come true against us: truly, we are bound to taste [the punishment].\n",
        "TRANSLATION_10": "So on us hath been justified the sentence of our Lord: verily we are to taste.\n",
        "TRANSLATION_11": "So our Lord’s word became due against us that we shall indeed taste [the punishment].\n",
        "TRANSLATION_12": "So now has been proved true, against us, the word of our Lord that we shall indeed (have to) taste (the punishment of our sins).\n",
        "TRANSLATION_13": "So now the Word of our Lord has been justified against us, that we shall certainly (have to) taste (the torment).\n",
        "TRANSLATION_14": "The statement of Our Lord is realized against us, and we are tasting it,\n",
        "TRANSLATION_15": "The Word of our Lord has been realized against us. We are tasting it.\n",
        "TRANSLATION_16": "So the word of our Lord has come into effect upon us; indeed, we will taste [punishment].\n",
        "TRANSLATION_17": "[37:31] So our Lord’s Words, of chastisement — namely, His Words: ‘Verily I shall fill Hell with jinn and mankind together’ [Q. 11:119] — have become due against us, both. Indeed we shall, both, taste, the chastisement with these Words — which prompts them to say:\n",
        "TRANSLATION_18": "(Now the Word of our Lord) that His chastisement and wrath will be enjoined upon us (hath been fulfilled concerning us. Lo! we are about to taste (the doom)) of the Fire.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "37:31",
            "36:16",
            "23:107",
            "36:25",
            "43:14",
            "7:125",
            "20:45",
            "54:10",
            "108:2",
            "83:15"
        ],
        "BIBLE": [
            "prophets:jeremiah:28:9",
            "prophets:jeremiah:16:10",
            "prophets:judges:13:12",
            "torah:deuteronomy:18:19",
            "prophets:zechariah:6:15",
            "torah:genesis:42:16",
            "prophets:ii%20samuel:7:28",
            "prophets:jeremiah:42:4",
            "writings:daniel:2:29",
            "prophets:isaiah:7:7"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:4",
            
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:5:2"
        ]
    }
}