{
    "VERSE": "37:35",
    "ARABIC": "إِنَّهُمْ كَانُوٓا۟ إِذَا قِيلَ لَهُمْ لَآ إِلَٰهَ إِلَّا ٱللَّهُ يَسْتَكْبِرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "When they were told, There is no god but Allah,' they were arrogant.",
        "TRANSLATION_1": "They were those who, when it was said to them, \"There is no god but God,\" behaved with insolence,\n",
        "TRANSLATION_2": "Whenever it was said to them: “There is no true deity apart from Allah,” they waxed proud\n",
        "TRANSLATION_3": "They were the ones, who on being told, \"God is only One,\" become puffed-up with pride\n",
        "TRANSLATION_4": "Indeed, when it was said to them, “There is no God except Allah”, they were haughty.\n",
        "TRANSLATION_5": "Truly, when it was said to them: \"La ilaha illallah,\" they puffed themselves up with pride.\n",
        "TRANSLATION_6": "Surely they used to behave proudly when it was said to them: There is no god but Allah;\n",
        "TRANSLATION_7": "for when it was said to them, 'There is no god but God,' they were ever waxing proud,\n",
        "TRANSLATION_8": "For when it was said unto them, There is no Allah save Allah, they were scornful\n",
        "TRANSLATION_9": "When they were told, \"There is no deity but God,\" they turned away with disdain,\n",
        "TRANSLATION_10": "Verily when it was said Unto them: there is no god but Allah, they ever grew stiff-necked.\n",
        "TRANSLATION_11": "Indeed, it was they who, when they were told, ‘There is no god except Allah,’ used to be disdainful,\n",
        "TRANSLATION_12": "For they, when they were told that there is no god except Allah, would puff themselves up with Pride,\n",
        "TRANSLATION_13": "Truly, when it was said to them: La ilaha ill-Allah \"(none has the right to be worshipped but Allah),\" they puffed themselves up with pride (i.e. denied it).\n",
        "TRANSLATION_14": "For when it was said to them: 'There is no god except Allah' they were always proud\n",
        "TRANSLATION_15": "When it was said to them, “There is no god except God,” they grew arrogant.\n",
        "TRANSLATION_16": "Indeed they, when it was said to them, \"There is no deity but Allah,\" were arrogant\n",
        "TRANSLATION_17": "[37:35] For truly it was they who, in other words, [it was] these [sinners] who — given the context that follows — when it was said to them, ‘There is no god except God’, used to be scornful,\n",
        "TRANSLATION_18": "(For when it was said unto them) in the life of the world, say: (There is no god save Allah, they were scornful) they were too proud to say it\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "37:35",
            "2:156",
            "20:14",
            "4:168",
            "7:186",
            "37:152",
            "64:13",
            "23:87",
            "23:85",
            "10:69"
        ],
        "BIBLE": [
            "prophets:isaiah:49:4",
            "torah:exodus:32:8",
            "prophets:i%20samuel:15:30",
            "prophets:isaiah:42:17",
            "prophets:ezekiel:33:14",
            "prophets:jonah:3:10",
            "prophets:judges:6:14",
            "torah:genesis:42:28",
            "torah:exodus:14:5",
            "prophets:jeremiah:31:18"
        ]
    }
}