{
    "VERSE": "37:37",
    "ARABIC": "بَلْ جَآءَ بِٱلْحَقِّ وَصَدَّقَ ٱلْمُرْسَلِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Rather he has brought the truth and confirmed the Messengers.",
        "TRANSLATION_1": "Not in the least. He has brought the truth and confirmed the other messengers.\n",
        "TRANSLATION_2": "(They say so although) he brought the Truth and confirmed the veracity of the Messengers.\n",
        "TRANSLATION_3": "In fact, he had brought them the truth and had acknowledged the Messengers (who were sent before him).\n",
        "TRANSLATION_4": "In fact he has brought the Truth, and testified for the Noble Messengers!\n",
        "TRANSLATION_5": "Nay! he has come with the truth and he confirms the Messengers.\n",
        "TRANSLATION_6": "Nay: he has come with the truth and verified the apostles.\n",
        "TRANSLATION_7": "No indeed; but he brought the truth, and confirmed the Envoys.\n",
        "TRANSLATION_8": "Nay, but he brought the Truth, and he confirmed those sent (before him).\n",
        "TRANSLATION_9": "Surely, he has brought the truth, confirming those who were sent before;\n",
        "TRANSLATION_10": "Aye! he hath come with the truth, and he confesseth to the sent ones.\n",
        "TRANSLATION_11": "Indeed, he has brought [them] the truth, and confirmed the [earlier] apostles.\n",
        "TRANSLATION_12": "Nay! he has come with the (very) Truth, and he confirms (the Message of) the messengers (before him).\n",
        "TRANSLATION_13": "Nay! he (Muhammad SAW) has come with the truth (i.e. Allah's Religion - Islamic Monotheism and this Quran) and he confirms the Messengers (before him who brought Allah's religion - Islamic Monotheism).\n",
        "TRANSLATION_14": "No, indeed, he has brought the truth, and confirmed the Messengers.\n",
        "TRANSLATION_15": "In fact, he came with the truth, and he confirmed the messengers.\n",
        "TRANSLATION_16": "Rather, the Prophet has come with the truth and confirmed the [previous] messengers.\n",
        "TRANSLATION_17": "[37:37] God, exalted be He, says: Nay, but he has brought [them] the truth and confirmed the [earlier] messengers, namely, those who had also brought this [truth], which is that there is no god except God.\n",
        "TRANSLATION_18": "(Nay, but he) Muhammad (pbuh) (brought the Truth) he brought the Qur'an and the profession of Allah's divine Oneness, (and he confirmed those sent (before him)) and he brought a confirmation of the messengers who were sent before him.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "37:37",
            "23:90",
            "38:84",
            "34:49",
            "2:42",
            "15:64",
            "21:18",
            "24:49",
            "21:55",
            "8:8"
        ],
        "BIBLE": [
            "prophets:haggai:2:1",
            "prophets:i%20samuel:5:10",
            "prophets:jeremiah:49:34",
            "prophets:ii%20kings:5:8",
            "prophets:ii%20samuel:13:30",
            "prophets:ii%20kings:5:6",
            "prophets:judges:21:5",
            "prophets:ezekiel:24:1",
            "prophets:i%20kings:1:53",
            "prophets:ezekiel:29:17"
        ]
    }
}