{
    "VERSE": "37:39",
    "ARABIC": "وَمَا تُجْزَوْنَ إِلَّا مَا كُنتُمْ تَعْمَلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "and you will only be repaid for what you did -",
        "TRANSLATION_1": "And be rewarded but only for what you had done,\n",
        "TRANSLATION_2": "You will only be recompensed according to your deeds.”\n",
        "TRANSLATION_3": "and will be recompensed only for what you deserve.\n",
        "TRANSLATION_4": "“And you will not be compensated except for your deeds.”\n",
        "TRANSLATION_5": "And you will be requited nothing except for what you used to do.\n",
        "TRANSLATION_6": "And you shall not be rewarded except (for) what you did.\n",
        "TRANSLATION_7": "and not be recompensed, except according to what you were doing.'\n",
        "TRANSLATION_8": "Ye are requited naught save what ye did -\n",
        "TRANSLATION_9": "and be rewarded only according to your deeds.\"\n",
        "TRANSLATION_10": "And ye shall be required not except for that which ye have been doing;\n",
        "TRANSLATION_11": "and you will be requited only for what you used to do\n",
        "TRANSLATION_12": "But it will be no more than the retribution of (the Evil) that ye have wrought;-\n",
        "TRANSLATION_13": "And you will be requited nothing except for what you used to do (evil deeds, sins, and Allah's disobedience which you used to do in this world);\n",
        "TRANSLATION_14": "but you shall not be recompensed except for what you were doing.\n",
        "TRANSLATION_15": "And you will be repaid only for what you used to do.\n",
        "TRANSLATION_16": "And you will not be recompensed except for what you used to do -\n",
        "TRANSLATION_17": "[37:39] and you will only be requited, the requital for, what you used to do’.\n",
        "TRANSLATION_18": "(Ye are requited) in the Hereafter (naught save what ye did) in the life of the world in your state of idolatry and disbelief.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "37:39",
            "69:39",
            "109:4",
            "109:5",
            "109:3",
            "26:99",
            "34:25",
            "53:60",
            "109:2",
            "26:132"
        ],
        "BIBLE": [
            "prophets:micah:3:4",
            "prophets:isaiah:3:9",
            "prophets:ezekiel:20:44",
            "prophets:isaiah:26:18",
            "prophets:joshua:7:15",
            "torah:exodus:34:10",
            "torah:genesis:34:7",
            "torah:deuteronomy:31:18",
            "torah:numbers:14:11",
            "prophets:habakkuk:1:5"
        ]
    }
}