{
    "VERSE": "37:48",
    "ARABIC": "وَعِندَهُمْ قَٰصِرَٰتُ ٱلطَّرْفِ عِينٌ",
    "ENGLISH": {
        "TRANSLATION_0": "There will be dark-eyed maidens with them, with eyes reserved for them alone,",
        "TRANSLATION_1": "And with them maidens of modest look and large lustrous eyes,\n",
        "TRANSLATION_2": "Theirs shall be wide-eyed maidens with bashful, restrained glances,\n",
        "TRANSLATION_3": "They will have with them loving wives with big black and white eyes\n",
        "TRANSLATION_4": "And with them are those who do not set gaze upon men except their husbands, the maidens with gorgeous eyes.\n",
        "TRANSLATION_5": "And beside them will be Qasirat-At-Tarf with (wide and beautiful) eyes.\n",
        "TRANSLATION_6": "And with them shall be those who restrain the eyes, having beautiful eyes;\n",
        "TRANSLATION_7": "and with them wide-eyed maidens restraining their glances\n",
        "TRANSLATION_8": "And with them are those of modest gaze, with lovely eyes,\n",
        "TRANSLATION_9": "With them will be spouses, modest of gaze and beautiful of eye,\n",
        "TRANSLATION_10": "And with them shall be damsels of refraining looks, large- eyed\n",
        "TRANSLATION_11": "and with them will be maidens, of restrained glances with big [beautiful] eyes,\n",
        "TRANSLATION_12": "And besides them will be chaste women, restraining their glances, with big eyes (of wonder and beauty).\n",
        "TRANSLATION_13": "And with them will be chaste females, restraining their glances (desiring none except their husbands), with wide and beautiful eyes.\n",
        "TRANSLATION_14": "And with them will be maidens (houris) who restrain their wide glances\n",
        "TRANSLATION_15": "With them will be bashful women with lovely eyes.\n",
        "TRANSLATION_16": "And with them will be women limiting [their] glances, with large, [beautiful] eyes,\n",
        "TRANSLATION_17": "[37:48] and with them will be maidens of restrained glances, who reserved their glances [exclusively] for their spouses and do not look upon any other — because of the beauty they [the maidens] see in them — with beautiful eyes (‘īn means with large and beautiful eyes),\n",
        "TRANSLATION_18": "(And with them) in Paradise (are those of modest gaze) wives who lower their gaze, content with their husbands and wish no man instead of their husband, (with lovely eyes) and beautiful faces, 508\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "37:48",
            "38:52",
            "38:47",
            "52:41",
            "68:47",
            "53:14",
            "51:34",
            "52:37",
            "40:19",
            "40:83"
        ],
        "BIBLE": [
            "writings:psalms:101:3",
            "torah:numbers:5:30",
            "writings:ecclesiastes:3:11",
            "torah:numbers:2:17",
            "prophets:jeremiah:32:20",
            "torah:leviticus:14:11",
            "prophets:amos:9:4",
            "prophets:ezekiel:40:4",
            "prophets:ezekiel:5:5",
            "prophets:jeremiah:13:21"
        ]
    }
}