{
    "VERSE": "37:5",
    "ARABIC": "رَّبُّ ٱلسَّمَٰوَٰتِ وَٱلْأَرْضِ وَمَا بَيْنَهُمَا وَرَبُّ ٱلْمَشَٰرِقِ",
    "ENGLISH": {
        "TRANSLATION_0": "Lord of the heavens and the earth and everything between them; Lord of the Easts.",
        "TRANSLATION_1": "The Lord of the heavens and the earth and all that lies between them, and the Lord of the Easts.\n",
        "TRANSLATION_2": "the Lord of the heavens and the earth and of whatever lies between the two, the Lord of the Easts.\n",
        "TRANSLATION_3": "He is the Lord of the heavens and the earth and all that is between them, the Lord of the Eastern regions.\n",
        "TRANSLATION_4": "Lord of the heavens and the earth and all that is between them – and the Lord of the sun’s rising points.\n",
        "TRANSLATION_5": "Lord of the heavens and of the earth, and all that is between them, and Lord of every point of the sun's risings.\n",
        "TRANSLATION_6": "The Lord of the heavens and the earth and what is between them, and Lord of the easts.\n",
        "TRANSLATION_7": "Lord of the heavens and the earth, and of what between them is Lord of the Easts.\n",
        "TRANSLATION_8": "Lord of the heavens and of the earth and all that is between them, and Lord of the sun's risings.\n",
        "TRANSLATION_9": "Lord of the heavens and the earth and everything between them; Lord of the Easts.\n",
        "TRANSLATION_10": "Lord of the heavens and the earth and whatsoever is in- between the twain, and Lord of the easts.\n",
        "TRANSLATION_11": "the Lord of the heavens and the earth and whatever is between them, and the Lord of the easts.\n",
        "TRANSLATION_12": "Lord of the heavens and of the earth and all between them, and Lord of every point at the rising of the sun!\n",
        "TRANSLATION_13": "Lord of the heavens and of the earth, and all that is between them, and Lord of every point of the sun's risings. (None has the right to be worshipped but Allah).\n",
        "TRANSLATION_14": "the Lord of the heavens and the earth and of all that is between them; the Lord of the Easts.\n",
        "TRANSLATION_15": "Lord of the heavens and the earth, and everything between them; and Lord of the Easts.\n",
        "TRANSLATION_16": "Lord of the heavens and the earth and that between them and Lord of the sunrises.\n",
        "TRANSLATION_17": "[37:5] Lord of the heavens and the earth and all that is between them, and Lord of the sun’s risings, that is, as well as the sun’s settings — each day it [the sun] has a rising and a setting.\n",
        "TRANSLATION_18": "(Lord of the heavens and of the earth) the Creator of the heavens and of the earth (and all that is between them) of created beings and marvels, (and Lord of the sun's risings) the risings of winter and summer.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "37:5",
            "26:24",
            "44:7",
            "21:16",
            "44:38",
            "38:66",
            "19:65",
            "78:37",
            "26:28",
            "20:6"
        ],
        "BIBLE": [
            "prophets:i%20samuel:14:5",
            "writings:nehemiah:9:6",
            "torah:genesis:19:23",
            "prophets:ii%20samuel:23:4",
            "torah:exodus:34:8",
            "prophets:ezekiel:21:20",
            "writings:job:20:25",
            "writings:psalms:88:16",
            "writings:ecclesiastes:5:15",
            "writings:job:20:27"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:13",
            "Sefer%20Yetzirah:4:2",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:5"
        ]
    }
}