{
    "VERSE": "37:57",
    "ARABIC": "وَلَوْلَا نِعْمَةُ رَبِّى لَكُنتُ مِنَ ٱلْمُحْضَرِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "If it were not for the blessing of my Lord, I would have been among those arraigned.",
        "TRANSLATION_1": "Had it not been for the grace of my Lord I too would have been there (in Hell).\n",
        "TRANSLATION_2": "But for Allah's favour, I should be one of those who have been mustered here.\n",
        "TRANSLATION_3": "Had I not the guidance of my Lord, I would certainly have been brought into torment\".\n",
        "TRANSLATION_4": "“And were it not for the munificence of my Lord, I too would have been seized and brought forth (captive)!”\n",
        "TRANSLATION_5": "Had it not been for the grace of my Lord, I would certainly have been among those brought forth (to Hell).\"\n",
        "TRANSLATION_6": "And had it not been for the favor of my Lord, I would certainly have been among those brought up.\n",
        "TRANSLATION_7": "But for my Lord's blessing, I were one of the arraigned.\n",
        "TRANSLATION_8": "And had it not been for the favour of my Lord, I too had been of those haled forth (to doom).\n",
        "TRANSLATION_9": "If it had not been for the blessing of my Lord, I would also have been taken to Hell.\"\n",
        "TRANSLATION_10": "And but for the favourcf my lord, I should have been of those brought forward.\n",
        "TRANSLATION_11": "Had it not been for my Lord’s blessing, I too would have been among those mustered [in hell]!’\n",
        "TRANSLATION_12": "Had it not been for the Grace of my Lord, I should certainly have been among those brought (there)!\n",
        "TRANSLATION_13": "Had it not been for the Grace of my Lord, I would certainly have been among those brought forth (to Hell).\"\n",
        "TRANSLATION_14": "But for the Favor of Allah I should have surely been among those who were arraigned (with you in Hell).\n",
        "TRANSLATION_15": "Were it not for the grace of my Lord, I would have been among the arraigned.”\n",
        "TRANSLATION_16": "If not for the favor of my Lord, I would have been of those brought in [to Hell].\n",
        "TRANSLATION_17": "[37:57] And had it not been for the favour of my Lord, His grace to me in giving me faith, I [too] would have been of those arraigned’, with you, in the Fire. The inhabitants of Paradise will say:\n",
        "TRANSLATION_18": "(And had it not been for the favour of my Lord) Who bestowed faith upon me and protected me from disbelief, (I too had been of those haled forth (to doom)) I too would be tormented with you in the Fire.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "37:57",
            "68:49",
            "93:11",
            "37:100",
            "36:27",
            "68:2",
            "26:85",
            "7:23",
            "52:29",
            "68:50"
        ],
        "BIBLE": [
            "prophets:malachi:1:13",
            "prophets:ii%20kings:2:10",
            "torah:genesis:27:35",
            "prophets:ezekiel:33:5",
            "torah:deuteronomy:4:20",
            "torah:genesis:27:36",
            "writings:ii%20chronicles:28:11",
            "torah:genesis:2:22",
            "torah:genesis:27:33",
            "writings:i%20chronicles:9:28"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:13",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:12"
        ]
    }
}