{
    "VERSE": "37:59",
    "ARABIC": "إِلَّا مَوْتَتَنَا ٱلْأُولَىٰ وَمَا نَحْنُ بِمُعَذَّبِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "except for our first death? Are we not going to be punished?",
        "TRANSLATION_1": "Other than our first death, and we shall not be punished?\n",
        "TRANSLATION_2": "except for our first death? And shall we suffer no chastisement?'”\n",
        "TRANSLATION_3": "and that we would not be punished?\"\n",
        "TRANSLATION_4": "“Except our earlier death, and nor will we be punished?”\n",
        "TRANSLATION_5": "Except our first death, and we shall not be punished\"\n",
        "TRANSLATION_6": "Except our previous death? And we shall not be chastised?\n",
        "TRANSLATION_7": "except for our first death, and are we not chastised?\n",
        "TRANSLATION_8": "Saving our former death, and are we not to be punished?\n",
        "TRANSLATION_9": "except for our first death? Are we not going to be punished?\n",
        "TRANSLATION_10": "Save our first death, and are we not to be tormented?\n",
        "TRANSLATION_11": "aside from our earlier death, and that we shall not be punished?\n",
        "TRANSLATION_12": "Except our first death, and that we shall not be punished?\"\n",
        "TRANSLATION_13": "Except our first death, and we shall not be punished? (after we have entered Paradise).\"\n",
        "TRANSLATION_14": "except our first death, and shall we not be punished'\n",
        "TRANSLATION_15": "Except for our first death, and we will not be punished.”\n",
        "TRANSLATION_16": "Except for our first death, and we will not be punished?\"\n",
        "TRANSLATION_17": "[37:59] aside from our first death, that is, the one [which we suffered] in this world, and are we not to be chastised?’ — this interrogative statement is one made out of [sheer] delight and in order to speak [at length] of the graces of God, exalted be He, in [His] granting of everlasting life and refraining from inflicting any punishment.\n",
        "TRANSLATION_18": "(Saving our former death) after our death in the life of the world. They would say to him: \"Yes, indeed!\" Thereupon he will hear a crier crying: \"0 people of hell! The fire is now closed; none will enter it or leave it\", and he will say to his brothers: (and are we not to be punished) after the Fire is closed? And their answer will be in the affirmative.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "37:59",
            "44:35",
            "44:56",
            "56:60",
            "17:59",
            "26:99",
            "26:114",
            "39:12",
            "15:13",
            "43:6"
        ],
        "BIBLE": [
            "prophets:ii%20kings:2:21",
            "writings:proverbs:7:27",
            "torah:numbers:21:23",
            "writings:job:18:20",
            "prophets:i%20kings:2:8",
            "prophets:jeremiah:44:14",
            "prophets:joshua:15:4",
            "torah:numbers:5:19",
            "prophets:i%20samuel:30:22",
            "writings:proverbs:19:19"
        ]
    }
}