{
    "VERSE": "37:65",
    "ARABIC": "طَلْعُهَا كَأَنَّهُۥ رُءُوسُ ٱلشَّيَٰطِينِ",
    "ENGLISH": {
        "TRANSLATION_0": "Its fruits are just like the heads of shaytans.",
        "TRANSLATION_1": "Its spathes are like the prickly pear.\n",
        "TRANSLATION_2": "Its spathes are like the heads of satans.\n",
        "TRANSLATION_3": "and its fruits are like the heads of devils.\n",
        "TRANSLATION_4": "Its fruit like the heads of demons.\n",
        "TRANSLATION_5": "The shoots of its fruit stalks are like the heads of Shayatin.\n",
        "TRANSLATION_6": "Its produce is as it were the heads of the serpents.\n",
        "TRANSLATION_7": "its spathes are as the heads of Satans,\n",
        "TRANSLATION_8": "Its crop is as it were the heads of devils\n",
        "TRANSLATION_9": "and its fruits are like devils' heads.\n",
        "TRANSLATION_10": "The fruit thereof is as though the hoods of the serpents.\n",
        "TRANSLATION_11": "Its spathes are as if they were devils’ heads.\n",
        "TRANSLATION_12": "The shoots of its fruit-stalks are like the heads of devils:\n",
        "TRANSLATION_13": "The shoots of its fruit-stalks are like the heads of Shayatin (devils);\n",
        "TRANSLATION_14": "its spathes are like the heads of satans\n",
        "TRANSLATION_15": "Its fruits are like the devils’ heads.\n",
        "TRANSLATION_16": "Its emerging fruit as if it was heads of the devils.\n",
        "TRANSLATION_17": "[37:65] Its spathes, likened to the spathes of a date-palm, are like the heads of devils, [as] vile-looking snakes.\n",
        "TRANSLATION_18": "(Its crop) its fruit (is as it were the heads of devils) the heads of snakes which resemble devils. This kind of snakes is found near Yemen.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "37:65",
            "43:62",
            "7:201",
            "19:83",
            "26:210",
            "19:44",
            "4:120",
            "26:221",
            "17:27",
            "35:6"
        ],
        "BIBLE": [
            "prophets:joshua:22:14",
            "torah:exodus:28:32",
            "writings:psalms:110:7",
            "torah:deuteronomy:33:5",
            "torah:leviticus:1:15",
            "writings:proverbs:16:31",
            "writings:psalms:44:15",
            "prophets:micah:3:11",
            "torah:exodus:29:7",
            "writings:i%20chronicles:8:10"
        ]
    }
}