{
    "VERSE": "37:67",
    "ARABIC": "ثُمَّ إِنَّ لَهُمْ عَلَيْهَا لَشَوْبًا مِّنْ حَمِيمٍ",
    "ENGLISH": {
        "TRANSLATION_0": "Then they will have a boiling brew to drink on top of it.",
        "TRANSLATION_1": "Washing it down with boiling water.\n",
        "TRANSLATION_2": "Then on top of it they will have a brew of boiling water.\n",
        "TRANSLATION_3": "Then they will have on top of it a mixture of boiling water.\n",
        "TRANSLATION_4": "Then after it, indeed for them is the drink of boiling hot water.\n",
        "TRANSLATION_5": "Then on the top of that they will be given boiling Hamim.\n",
        "TRANSLATION_6": "Then most surely they shall have after it to drink of a mixture prepared in boiling water.\n",
        "TRANSLATION_7": "then on top of it they have a brew of boiling water,\n",
        "TRANSLATION_8": "And afterward, lo! thereupon they have a drink of boiling water\n",
        "TRANSLATION_9": "then in addition to it they shall have a draught of boiling water to drink;\n",
        "TRANSLATION_10": "And thereafter verily they shall have thereon a draught of balling water.\n",
        "TRANSLATION_11": "On top of that they will take a solution of scalding water.\n",
        "TRANSLATION_12": "Then on top of that they will be given a mixture made of boiling water.\n",
        "TRANSLATION_13": "Then on the top of that they will be given boiling water to drink so that it becomes a mixture (of boiling water and Zaqqum in their bellies).\n",
        "TRANSLATION_14": "On top of it they shall have a brew of boiling water,\n",
        "TRANSLATION_15": "Then, on top of it, they will have a brew of boiling liquid.\n",
        "TRANSLATION_16": "Then indeed, they will have after it a mixture of scalding water.\n",
        "TRANSLATION_17": "[37:67] Then, lo!, on top of it they will have a brew of boiling water, which they drink and which mixes with what they have eaten and becomes a brew thereof.\n",
        "TRANSLATION_18": "(And afterward, lo! thereupon they have a drink of boiling water) to go with the Zaqqum.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "37:67",
            "56:54",
            "26:55",
            "83:16",
            "88:26",
            "40:72",
            "7:21",
            "37:137",
            "71:9",
            "36:3"
        ],
        "BIBLE": [
            "torah:numbers:19:7",
            "torah:leviticus:16:28",
            "torah:leviticus:15:17",
            "torah:leviticus:16:26",
            "writings:psalms:75:9",
            "torah:exodus:30:20",
            "torah:leviticus:15:10",
            "torah:leviticus:15:6",
            "torah:leviticus:15:22",
            "torah:leviticus:15:27"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:3:4",
            "Sefer%20Yetzirah:3:7",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:1:12",
            "Sefer%20Yetzirah:2:5"
        ]
    }
}