{
    "VERSE": "37:75",
    "ARABIC": "وَلَقَدْ نَادَىٰنَا نُوحٌ فَلَنِعْمَ ٱلْمُجِيبُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Nuh called out to Us and what an excellent Responder We are!",
        "TRANSLATION_1": "Noah had verily called to Us. And how gracious was He who answered (him).\n",
        "TRANSLATION_2": "Noah had called upon Us (earlier). See, how excellent We were in answering him!\n",
        "TRANSLATION_3": "Noah called for help. How blessed was the answer which he received.\n",
        "TRANSLATION_4": "And indeed Nooh prayed to Us – so what an excellent Acceptor of Prayer We are!\n",
        "TRANSLATION_5": "And indeed Nuh invoked Us, and We are the best of those who answer.\n",
        "TRANSLATION_6": "And Nuh did certainly call upon Us, and most excellent answerer of prayer are We.\n",
        "TRANSLATION_7": "Noah called to Us; and how excellent were the Answerers!\n",
        "TRANSLATION_8": "And Noah verily prayed unto Us, and gracious was the Hearer of his prayer\n",
        "TRANSLATION_9": "Noah cried to Us, and how excellent was Our response!\n",
        "TRANSLATION_10": "And assuredly Nuh cried Unto us; and We are the Best of answerers!\n",
        "TRANSLATION_11": "Certainly Noah called out to Us, and how well did We respond!\n",
        "TRANSLATION_12": "(In the days of old), Noah cried to Us, and We are the best to hear prayer.\n",
        "TRANSLATION_13": "And indeed Nuh (Noah) invoked Us, and We are the Best of those who answer (the request).\n",
        "TRANSLATION_14": "Noah called to Us, and We are the Best to answer.\n",
        "TRANSLATION_15": "And Noah called out to Us, and We are the Best of responders.\n",
        "TRANSLATION_16": "And Noah had certainly called Us, and [We are] the best of responders.\n",
        "TRANSLATION_17": "[37:75]   And verily Noah called to Us, when he said, ‘My Lord: I have been overcome, so help [me] [Q. 54:10], and how excellent were the Hearers of the prayer, for him, were We: in other words he invoked Us against his people, so We destroyed them by drowning [them].\n",
        "TRANSLATION_18": "(And Noah verily prayed unto Us) Noah prayed against his folk, saying: (My Lord! Leave not one of the disbelievers in the land...) [Noah, 71: 26-27], (and gracious was the Hearer of his prayer) by destroying his folk.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "37:75",
            "15:24",
            "28:51",
            "15:23",
            "77:23",
            "37:72",
            "37:165",
            "37:166",
            "37:114",
            "15:9"
        ],
        "BIBLE": [
            "prophets:ii%20samuel:1:7",
            "writings:job:9:16",
            "torah:genesis:1:10",
            "torah:genesis:5:2",
            "writings:esther:9:26",
            "prophets:isaiah:66:4",
            "writings:ii%20chronicles:20:26",
            "prophets:i%20samuel:3:4",
            "prophets:jeremiah:7:13",
            "prophets:i%20kings:2:42"
        ]
    }
}