{
    "VERSE": "37:8",
    "ARABIC": "لَّا يَسَّمَّعُونَ إِلَى ٱلْمَلَإِ ٱلْأَعْلَىٰ وَيُقْذَفُونَ مِن كُلِّ جَانِبٍ",
    "ENGLISH": {
        "TRANSLATION_0": "They cannot eavesdrop on the Highest Assembly and they are stoned from every side,",
        "TRANSLATION_1": "So that they are not able to listen to the angels of higher (echelons), and are pelted from all sides\n",
        "TRANSLATION_2": "These satans cannot listen to what transpires in the High Council for they are pelted away from every side\n",
        "TRANSLATION_3": "The devils cannot hear those high above. They would be struck from all sides\n",
        "TRANSLATION_4": "They cannot listen to the speech of those on higher elevations and they are targeted from every side.\n",
        "TRANSLATION_5": "They cannot listen to the higher group for they are pelted from every side.\n",
        "TRANSLATION_6": "They cannot listen to the exalted assembly and they are thrown at from every side,\n",
        "TRANSLATION_7": "they listen not to the High Council, for they are pelted from every side,\n",
        "TRANSLATION_8": "They cannot listen to the Highest Chiefs for they are pelted from every side,\n",
        "TRANSLATION_9": "they cannot overhear the Higher Assembly for they are pelted from every side,\n",
        "TRANSLATION_10": "They cannot listen to the exalted assembly, and they are darted at from every side.\n",
        "TRANSLATION_11": "They do not eavesdrop on the Supernal Elite—they are shot at from every side,\n",
        "TRANSLATION_12": "(So) they should not strain their ears in the direction of the Exalted Assembly but be cast away from every side,\n",
        "TRANSLATION_13": "They cannot listen to the higher group (angels) for they are pelted from every side.\n",
        "TRANSLATION_14": "so they cannot listen to the High Assembly, for they are pelted from every side.\n",
        "TRANSLATION_15": "They cannot eavesdrop on the Supernal Elite, for they get bombarded from every side.\n",
        "TRANSLATION_16": "[So] they may not listen to the exalted assembly [of angels] and are pelted from every side,\n",
        "TRANSLATION_17": "[37:8] They, namely, the devils (lā yasma‘ūna, this is [the beginning of] a new sentence) cannot listen in — this ‘listening’ of theirs represents that faculty with which they memorise [what they hear] — on the High Council, the angels in the heavens (the [normally transitive verb] al-samā‘ is complemented with the preposition ilā, ‘to’ [here ‘in on’] because it includes the additional sense of ‘paying attention’ [while listening]; a variant reading has yassamma‘una, which is actually yatasamma‘ūna, the tā’ have been assimilated with the sīn), for they, the devils, are pelted, with flames, from every side, from the remotest regions of the heavens,\n",
        "TRANSLATION_18": "(They cannot listen) so that they do not listen (to the Highest Chiefs) to the speech of the angels, i.e. the guardian angels, regarding that which is communicated amongst them (for they are pelted from every side) they rise up to,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "37:8",
            "38:69",
            "6:86",
            "46:19",
            "11:38",
            "25:39",
            "7:112",
            "40:27",
            "17:29",
            "8:56"
        ],
        "BIBLE": [
            "writings:psalms:141:6",
            "writings:job:13:17",
            "prophets:ezekiel:31:5",
            "writings:psalms:17:6",
            "writings:proverbs:6:1",
            "writings:psalms:64:8",
            "prophets:ii%20samuel:11:20",
            "prophets:i%20samuel:26:8",
            "prophets:ii%20samuel:20:10",
            "torah:exodus:15:1"
        ]
    }
}