{
    "VERSE": "37:87",
    "ARABIC": "فَمَا ظَنُّكُم بِرَبِّ ٱلْعَٰلَمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "So what are your thoughts about the Lord of all the worlds?'",
        "TRANSLATION_1": "What do you imagine the Lord of the worlds to be?\"\n",
        "TRANSLATION_2": "What do you think of the Lord of the whole Universe?”\n",
        "TRANSLATION_3": "What do you think about the Lord of the Universe?\"\n",
        "TRANSLATION_4": "“So what do you assume regarding the Lord Of The Creation?” (That He will not punish you?)\n",
        "TRANSLATION_5": "Then what think you about the Lord of the all that exists\"\n",
        "TRANSLATION_6": "What is then your idea about the Lord of the worlds?\n",
        "TRANSLATION_7": "What think you then of the Lord of all Being?'\n",
        "TRANSLATION_8": "What then is your opinion of the Lord of the Worlds?\n",
        "TRANSLATION_9": "What do you think of the Lord of the Worlds?\"\n",
        "TRANSLATION_10": "what, then, is your opinion of the Lord of the worlds?\n",
        "TRANSLATION_11": "Then what is your idea about the Lord of all the worlds?’\n",
        "TRANSLATION_12": "Then what is your idea about the Lord of the worlds?\"\n",
        "TRANSLATION_13": "Then what do you think about the Lord of the 'Alamin (mankind, jinns, and all that exists)?\"\n",
        "TRANSLATION_14": "What do you think of the Lord of the Worlds'\n",
        "TRANSLATION_15": "So what is your opinion about the Lord of the Worlds?”\n",
        "TRANSLATION_16": "Then what is your thought about the Lord of the worlds?\"\n",
        "TRANSLATION_17": "[37:87] What then is your supposition regarding the Lord of the Worlds?’, having worshipped other than Him, [do you think] that He will leave you without punishment? No! They were a people of astrologers. On one occasion, they went out to celebrate a festival of theirs and left their food behind with their idols, claiming that they were securing thereby blessings for it and that they would eat it upon their return. They had said to the lord Abraham: ‘Come out with us’.\n",
        "TRANSLATION_18": "(What then is your opinion of the Lord of the Worlds) what do you think He will do to you if you worship other than Him?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "37:87",
            "26:98",
            "26:47",
            "7:121",
            "69:43",
            "56:80",
            "26:188",
            "2:131",
            "41:23",
            "26:23"
        ],
        "BIBLE": [
            "torah:leviticus:4:13",
            "prophets:jeremiah:5:9",
            "prophets:jeremiah:5:29",
            "prophets:jeremiah:9:8",
            "writings:psalms:96:10",
            "prophets:jeremiah:29:11",
            "prophets:isaiah:45:17",
            "torah:deuteronomy:22:5",
            "writings:psalms:118:6",
            "writings:psalms:24:1"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:3:5",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:5:1"
        ]
    }
}