{
    "VERSE": "37:96",
    "ARABIC": "وَٱللَّهُ خَلَقَكُمْ وَمَا تَعْمَلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "when Allah created both you and what you do?'",
        "TRANSLATION_1": "When God has created you and what you make?\"\n",
        "TRANSLATION_2": "while it is Allah Who has created you and all that you make?”\n",
        "TRANSLATION_3": "even though God created both you and that which you have made?\"\n",
        "TRANSLATION_4": "“Whereas Allah has created you and your actions?”\n",
        "TRANSLATION_5": "While Allah has created you and what you make!\"\n",
        "TRANSLATION_6": "And Allah has created you and what you make.\n",
        "TRANSLATION_7": "and God created you and what you make?'\n",
        "TRANSLATION_8": "When Allah hath created you and what ye make?\n",
        "TRANSLATION_9": "when it is God who has created you and all your handiwork?\"\n",
        "TRANSLATION_10": "Whereas Allah hath created you and that which ye make?\n",
        "TRANSLATION_11": "when Allah has created you and whatever you make?’\n",
        "TRANSLATION_12": "But Allah has created you and your handwork!\"\n",
        "TRANSLATION_13": "While Allah has created you and what you make!\"\n",
        "TRANSLATION_14": "when it is Allah who created you and all that you do'\n",
        "TRANSLATION_15": "When God created you, and what you manufacture?”\n",
        "TRANSLATION_16": "While Allah created you and that which you do?\"\n",
        "TRANSLATION_17": "[37:96] when God created you and whatever you make?’, [whether it be] your act of carving and that which you have carved? So worship Him alone! (the mā [in wa-mā ta‘malūna, ‘and whatever you make’] is that of the verbal noun; but it is also said to introduce a relative clause, or it is adjectivally qualified).\n",
        "TRANSLATION_18": "(When Allah hath created you) and leave the worship of Allah Who created you (and what ye make) and He also created your act of carving as well as that which you carve?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "37:96",
            "16:19",
            "26:144",
            "26:163",
            "26:108",
            "26:110",
            "26:150",
            "26:179",
            "26:126",
            "15:69"
        ],
        "BIBLE": [
            "writings:ecclesiastes:7:13",
            "prophets:ezekiel:15:8",
            "torah:exodus:34:17",
            "torah:exodus:23:32",
            "prophets:jeremiah:16:20",
            "prophets:isaiah:26:13",
            "torah:genesis:21:13",
            "writings:psalms:71:12",
            "torah:deuteronomy:29:13",
            "torah:genesis:9:12"
        ]
    }
}