{
    "VERSE": "37:97",
    "ARABIC": "قَالُوا۟ ٱبْنُوا۟ لَهُۥ بُنْيَٰنًا فَأَلْقُوهُ فِى ٱلْجَحِيمِ",
    "ENGLISH": {
        "TRANSLATION_0": "They said, 'Build a pyre for him and fling him into the blaze!'",
        "TRANSLATION_1": "Build a pyre for him and throw him into the raging fire.\"\n",
        "TRANSLATION_2": "They spoke among themselves: “Build him a pyre and then throw him into the furnace.”\n",
        "TRANSLATION_3": "They said, \"Let us build a fire and throw him into the flames\".\n",
        "TRANSLATION_4": "They said, “Construct a building (furnace) for him, and then cast him in the blazing fire!”\n",
        "TRANSLATION_5": "They said: \"Build for him a building and throw him into the blazing fire!\"\n",
        "TRANSLATION_6": "They said: Build for him a furnace, then cast him into the burning fire.\n",
        "TRANSLATION_7": "They said, 'Build him a building, and cast him into the furnace!'\n",
        "TRANSLATION_8": "They said: Build for him a building and fling him in the red-hotfire.\n",
        "TRANSLATION_9": "They said, \"Build a pyre for him and throw him into the blaze!\"\n",
        "TRANSLATION_10": "They said. build for him a building and cast him into the flaming fire.\n",
        "TRANSLATION_11": "They said, ‘Build a structure for him and cast him into a huge fire.’\n",
        "TRANSLATION_12": "They said, \"Build him a furnace, and throw him into the blazing fire!\"\n",
        "TRANSLATION_13": "They said: \"Build for him a building (it is said that the building was like a furnace) and throw him into the blazing fire!\"\n",
        "TRANSLATION_14": "They replied: 'Build for him a building and cast him into the fire'\n",
        "TRANSLATION_15": "They said, “Build a pyre for him, and throw him into the furnace.”\n",
        "TRANSLATION_16": "They said, \"Construct for him a furnace and throw him into the burning fire.\"\n",
        "TRANSLATION_17": "[37:97]   They said, amongst themselves: ‘Build for him a structure, then fill it with firewood and set it on fire, and when it is ablaze, then cast him into the fierce fire’.\n",
        "TRANSLATION_18": "(They said: Build for him a building) a furnace (and fling him in the red hot fire.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "37:97",
            "69:31",
            "26:91",
            "44:47",
            "37:55",
            "79:36",
            "81:12",
            "22:51",
            "83:16",
            "82:14"
        ],
        "BIBLE": [
            "torah:exodus:9:8",
            "prophets:joshua:22:26",
            "writings:daniel:3:26",
            "writings:daniel:3:11",
            "writings:daniel:3:6",
            "writings:daniel:3:21",
            "writings:daniel:3:20",
            "prophets:i%20kings:18:30",
            "prophets:i%20kings:18:24",
            "prophets:ii%20kings:4:41"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:1:12",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:3:3",
            
            "Sefer%20Yetzirah:2:4"
        ]
    }
}