{
    "VERSE": "37:98",
    "ARABIC": "فَأَرَادُوا۟ بِهِۦ كَيْدًا فَجَعَلْنَٰهُمُ ٱلْأَسْفَلِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "They tried to outwit him but We made them the lowest.",
        "TRANSLATION_1": "So they contrived a plot against him, but We made them abject.\n",
        "TRANSLATION_2": "They had contrived an evil plan against him, but We abased them all.\n",
        "TRANSLATION_3": "They plotted against him, but We brought humiliation upon them.\n",
        "TRANSLATION_4": "So they tried to execute their evil scheme upon him – We therefore degraded them. (Allah saved him, by commanding the fire to turn cool).\n",
        "TRANSLATION_5": "So, they plotted a plot against him, but We made them the lowest.\n",
        "TRANSLATION_6": "And they desired a war against him, but We brought them low.\n",
        "TRANSLATION_7": "They desired to outwit him; so We made them the lower ones.\n",
        "TRANSLATION_8": "And they designed a snare for him, but We made them the undermost.\n",
        "TRANSLATION_9": "They wanted to harm him, but We humiliated them all.\n",
        "TRANSLATION_10": "And they devised a plot for him, but We made them the humble.\n",
        "TRANSLATION_11": "So they sought to outwit him, but We made them the lowermost.\n",
        "TRANSLATION_12": "(This failing), they then sought a stratagem against him, but We made them the ones most humiliated!\n",
        "TRANSLATION_13": "So they plotted a plot against him, but We made them the lowest.\n",
        "TRANSLATION_14": "Their desire was to outwit him, but We made them to be the humiliated.\n",
        "TRANSLATION_15": "They wished him ill, but We made them the losers.\n",
        "TRANSLATION_16": "And they intended for him a plan, but We made them the most debased.\n",
        "TRANSLATION_17": "[37:98] So they sought to outwit him, by flinging him into the fire, so that it may destroy him, but We made them the lowermost, the vanquished, as he came out of the fire unharmed.\n",
        "TRANSLATION_18": "And they designed a snare for him) to burn him in the Fire, (but We made them the undermost) of those who dwell in the bottom of the Fire; it is also said that this means: We made them of the losers by subjecting them to chastisement.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "37:98",
            "21:70",
            "52:42",
            "20:60",
            "95:5",
            "23:48",
            "86:15",
            "86:16",
            "37:116",
            "12:34"
        ],
        "BIBLE": [
            "writings:psalms:35:4",
            "torah:deuteronomy:5:29",
            "prophets:i%20kings:15:5",
            "writings:psalms:70:3",
            "prophets:ezekiel:17:6",
            "torah:deuteronomy:9:12",
            "prophets:zephaniah:1:6",
            "writings:ii%20chronicles:9:12",
            "writings:ii%20chronicles:15:4",
            "prophets:jeremiah:2:27"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:7"
        ]
    }
}