{
    "VERSE": "87:15",
    "ARABIC": "وَذَكَرَ ٱسْمَ رَبِّهِۦ فَصَلَّىٰ",
    "ENGLISH": {
        "TRANSLATION_0": "He who invokes the Name of his Lord and prays.",
        "TRANSLATION_1": "And recites the name of his Lord and serves with devotion.\n",
        "TRANSLATION_2": "remembering his Lord's name and praying.\n",
        "TRANSLATION_3": "remember the name of the Lord, and pray to Him.\n",
        "TRANSLATION_4": "And who mentioned the name of his Lord, then offered prayer.\n",
        "TRANSLATION_5": "And remembers the Name of his Lord, and performs Salah.\n",
        "TRANSLATION_6": "And magnifies the name of his Lord and prays.\n",
        "TRANSLATION_7": "and mentions the Name of his Lord, and prays.\n",
        "TRANSLATION_8": "And remembereth the name of his Lord, so prayeth,\n",
        "TRANSLATION_9": "who remembers the name of his Lord and prays, shall indeed be successful.\n",
        "TRANSLATION_10": "And who remembereth the name of his Lord, and then prayeth.\n",
        "TRANSLATION_11": "celebrates the Name of his Lord, and prays.\n",
        "TRANSLATION_12": "And glorify the name of their Guardian-Lord, and (lift their hearts) in prayer.\n",
        "TRANSLATION_13": "And remembers (glorifies) the Name of his Lord (worships none but Allah), and prays (five compulsory prayers and Nawafil additional prayers).\n",
        "TRANSLATION_14": "and remembers the Name of his Lord, so he prays.\n",
        "TRANSLATION_15": "And mentions the name of his Lord, and prays.\n",
        "TRANSLATION_16": "And mentions the name of his Lord and prays.\n",
        "TRANSLATION_17": "[87:15] and mentions the Name of his Lord, saying Allāhu akbar, ‘God is Great’, and prays, the five prayers — and such are the concerns of [one working towards] the Hereafter, [concerns] which the Meccan disbelievers shun.\n",
        "TRANSLATION_18": "(And remembereth the name) the command (of his Lord) regarding the five daily prayers and other things, (so prayeth) the five daily prayers in congregation; this verse can also be understood to mean: he is successful and saved he who gives the charity of Fitr before going out to pray and mentions the name of his Lord saying \"there is no deity save Allah\" and upon going to prayer and returning from it says \"Allah is the Most Great\" and then prays the 'Id prayer with the Imam. 749\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "87:15",
            "73:8",
            "96:1",
            "55:78",
            "74:3",
            "20:122",
            "76:25",
            "87:1",
            "79:19",
            "74:7"
        ],
        "BIBLE": [
            "writings:ii%20chronicles:32:25",
            "writings:psalms:27:6",
            "writings:i%20chronicles:29:9",
            "prophets:isaiah:26:11",
            "prophets:judges:5:9",
            "prophets:i%20kings:9:3",
            "torah:numbers:15:39",
            "prophets:ii%20samuel:19:20",
            "writings:daniel:11:12",
            "prophets:jeremiah:31:20"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:13",
            "Sefer%20Yetzirah:1:9"
        ]
    }
}