{
    "VERSE": "10:10",
    "ARABIC": "دَعْوَىٰهُمْ فِيهَا سُبْحَٰنَكَ ٱللَّهُمَّ وَتَحِيَّتُهُمْ فِيهَا سَلَٰمٌ وَءَاخِرُ دَعْوَىٰهُمْ أَنِ ٱلْحَمْدُ لِلَّهِ رَبِّ ٱلْعَٰلَمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Their call there is: 'Glory be to You, O Allah!' Their greeting there is: 'Peace!' The end of their call is: 'Praise be to Allah, the Lord of all the worlds!'",
        "TRANSLATION_1": "Their invocation will be: \"All glory to you, O God,\" and \"Peace\" will be their salutation, and the end of their prayer (will be): \"All praise be to God, the Lord of all the worlds.\"\n",
        "TRANSLATION_2": "Their cry in it will be: 'Glory be to You, Our Lord!', and their greeting: 'Peace!'; and their cry will always end with: 'All praise be to Allah, the Lord of the universe.\n",
        "TRANSLATION_3": "Their prayer shall be, \"Glory be to you Lord,\" and their greeting, \"Peace be with you,\" and the only other words (of worldly speech) they will speak will be, \"It is God, Lord of the Universe, who deserves all praise.\"\n",
        "TRANSLATION_4": "Their prayers in it will be, “Purity is to You, O Allah” and their greetings in it will be, “Peace”; and the conclusion of their prayers is, “All praise is to Allah, the Lord Of The Creation.”\n",
        "TRANSLATION_5": "Their way of request therein will be: \"Glory to You, O Allah!\" and \"Salam\" (peace, safety from evil) will be their greetings therein! And the close of their request will be: \"All praise is due to Allah, the Lord of all that exists.\"\n",
        "TRANSLATION_6": "Their cry in it shall be: Glory to Thee, O Allah! and their greeting in it shall be: Peace; and the last of their cry shall be: Praise be to Allah, the Lord of the worlds.\n",
        "TRANSLATION_7": "their cry therein, 'Glory to Thee, O God,' their greeting, 'Peace,' and their cry ends, 'Praise belongs to God, the Lord of all Being.'\n",
        "TRANSLATION_8": "Their prayer therein will be: Glory be to Thee, O Allah! and their greeting therein will be: Peace. And the conclusion of their prayer will be: Praise be to Allah, Lord of the Worlds!\n",
        "TRANSLATION_9": "In that [state of happiness] they will call out; \"Glory be to You, O God!\", while their greeting in it will be: \"Peace!\" And the close of their call will be, \"All praise is due to God, the Lord of the Universe!\"\n",
        "TRANSLATION_10": "Their cry therein will be: hallowed be Thou! O Allah! and their greeting therein: peace! And the end of their Cry Will be: all praise unto Allah, the Lord of the worlds\n",
        "TRANSLATION_11": "Their call therein will be, ‘O Allah! Immaculate are You!’ and their greeting therein will be, ‘Peace!’ and their concluding call, ‘All praise belongs to Allah, the Lord of all the worlds.’\n",
        "TRANSLATION_12": "(This will be) their cry therein: \"Glory to Thee, O Allah!\" And \"Peace\" will be their greeting therein! and the close of their cry will be: \"Praise be to Allah, the Cherisher and Sustainer of the worlds!\"\n",
        "TRANSLATION_13": "Their way of request therein will be Subhanaka Allahumma (Glory to You, O Allah!) and Salam (peace, safe from each and every evil) will be their greetings therein (Paradise)! and the close of their request will be: Al-Hamdu Lillahi Rabbil-'Alamin [All the praises and thanks are to Allah, the Lord of 'Alamin (mankind, jinns and all that exists)].\n",
        "TRANSLATION_14": "(In it) their supplication will be: 'Exaltations to You, Allah' And their greeting will be: 'Peace' They will end their supplication with 'Praise be to Allah, Lord of the all the Worlds'\n",
        "TRANSLATION_15": "Their call therein is, “Glory be to You, our God.” And their greeting therein is, “Peace.” And the last of their call is, “Praise be to God, Lord of the Worlds.”\n",
        "TRANSLATION_16": "Their call therein will be, \"Exalted are You, O Allah,\" and their greeting therein will be, \"Peace.\" And the last of their call will be, \"Praise to Allah, Lord of the worlds!\"\n",
        "TRANSLATION_17": "[10:10] their prayer therein, their request for what they desire in Paradise will be to say: ‘Glory be to You, O God!’, so that, lo!, what they request they find before them; and their greeting, between them, therein will be: ‘Peace.’ And their final prayer will be: ‘Praise be to God, Lord of the Worlds’.\n",
        "TRANSLATION_18": "(Their prayer) their words (therein) in Paradise when they desire anything (will be: Glory be to Thee, O Allah!) following which servants will bring them whatever they desire (and their greeting therein will be: Peace) they greet one another by saying: Peace. (And the conclusion of their prayer) their words after eating and drinking (will be: Praise be to Allah, Lord of the Worlds!)\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "10:10",
            "37:182",
            "1:2",
            "45:36",
            "27:8",
            "6:45",
            "28:68",
            "14:39",
            "27:59",
            "27:93"
        ],
        "BIBLE": [
            "prophets:jeremiah:16:10",
            "prophets:isaiah:45:17",
            "writings:psalms:30:13",
            "writings:job:16:3",
            "torah:deuteronomy:29:28",
            "prophets:jeremiah:43:1",
            "prophets:jeremiah:3:5",
            "writings:psalms:40:6",
            "torah:deuteronomy:32:45",
            "prophets:zephaniah:2:5"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:3:3"
        ]
    }
}