{
    "VERSE": "10:102",
    "ARABIC": "فَهَلْ يَنتَظِرُونَ إِلَّا مِثْلَ أَيَّامِ ٱلَّذِينَ خَلَوْا۟ مِن قَبْلِهِمْ قُلْ فَٱنتَظِرُوٓا۟ إِنِّى مَعَكُم مِّنَ ٱلْمُنتَظِرِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "What are they waiting for but the same fate as those who passed away before them? Say: 'Wait. I will be among the people waiting with you.'",
        "TRANSLATION_1": "Can they expect anything but what the people before them had known? Say: \"Then wait. I am waiting with you.\"\n",
        "TRANSLATION_2": "What are they waiting for except to witness the repetition of the days of calamity that their predecessors witnessed? Tell them: 'Wait; I too am waiting with you.\n",
        "TRANSLATION_3": "What can they expect other than the kind of (punishment that befell the disbelieving people) who had gone before them? (Muhammad), tell them, \"Wait and I too will be waiting with you.\"\n",
        "TRANSLATION_4": "So what are they waiting for, except the days similar to the days of those who passed away before them? Say, “Then wait! I too am waiting with you.”\n",
        "TRANSLATION_5": "Then do they wait save for the likes of the days of men who passed away before them Say: \"Wait then, I am waiting with you among those who wait.\"\n",
        "TRANSLATION_6": "What do they wait for then but the like of the days of those who passed away before them? Say: Wait then; surely I too am with you of those who wait.\n",
        "TRANSLATION_7": "So do they watch and wait for aught but the like of the days of those who passed away before them? Say: 'Then watch and wait; I shall be with you watching and waiting.'\n",
        "TRANSLATION_8": "What expect they save the like of the days of those who passed away before them? Say: Expect then! I am with you among the expectant.\n",
        "TRANSLATION_9": "What can they be waiting for but the punishment that came to those before them? Say, \"So wait; I am one of those waiting with you.\"\n",
        "TRANSLATION_10": "Wait they then aught but the days of those who have passed away before them. Say thou: wait then, verily I am with you among those who wait.\n",
        "TRANSLATION_11": "Do they await anything except the like of the days of those who passed away before them? Say, ‘Then wait! I too am waiting along with you.’\n",
        "TRANSLATION_12": "Do they then expect (any thing) but (what happened in) the days of the men who passed away before them? Say: \"Wait ye then: for I, too, will wait with you.\"\n",
        "TRANSLATION_13": "Then do they wait for (anything) save for (destruction) like the days of the men who passed away before them? Say: \"Wait then, I am (too) with you among those who wait.\"\n",
        "TRANSLATION_14": "Do they watch and wait for anything except for days similar to those who passed away before them? Say: 'Wait; I shall be with you among those who arewaiting'\n",
        "TRANSLATION_15": "Do they expect anything but the likes of the days of those who passed away before them? Say, “Then wait, I will be waiting with you.”\n",
        "TRANSLATION_16": "So do they wait except for like [what occurred in] the days of those who passed on before them? Say, \"Then wait; indeed, I am with you among those who wait.\"\n",
        "TRANSLATION_17": "[10:102] What do they await, when they deny you, but the like of the days of those who passed away before them?, of communities, that is, the like of chastisements that befell them. Say: ‘Then await, this: I shall indeed be with you among the waiting’.\n",
        "TRANSLATION_18": "(What expect they) is there any sign left for them (save the like of the days of those who passed away) except the punishment of those who passed away (before them) among the disbelievers? (Say) Muhammad: (Expect then!) the descent of punishment and my own destruction! (I am with you among the expectant) of the descent of punishment and destruction upon you.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "10:102",
            "40:30",
            "23:111",
            "51:60",
            "52:31",
            "2:183",
            "23:65",
            "70:36",
            "43:83",
            "52:45"
        ],
        "BIBLE": [
            "prophets:i%20samuel:28:1",
            "prophets:joshua:2:5",
            "prophets:i%20kings:18:36",
            "writings:ruth:3:18",
            "writings:daniel:6:13",
            "prophets:ezekiel:36:20",
            "prophets:i%20samuel:9:27",
            "prophets:jeremiah:41:4",
            "prophets:ii%20samuel:15:24",
            "prophets:ii%20kings:23:17"
        ]
    }
}