{
    "VERSE": "10:104",
    "ARABIC": "قُلْ يَٰٓأَيُّهَا ٱلنَّاسُ إِن كُنتُمْ فِى شَكٍّ مِّن دِينِى فَلَآ أَعْبُدُ ٱلَّذِينَ تَعْبُدُونَ مِن دُونِ ٱللَّهِ وَلَٰكِنْ أَعْبُدُ ٱللَّهَ ٱلَّذِى يَتَوَفَّىٰكُمْ وَأُمِرْتُ أَنْ أَكُونَ مِنَ ٱلْمُؤْمِنِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Say: 'Mankind! if you are in any doubt about my deen, I do not worship those you worship besides Allah. Rather I worship Allah who will take you back to Him and I am commanded to be one of the muminun:",
        "TRANSLATION_1": "Say: \"O men, if you have doubt about my faith, then (know) I do not worship those you worship apart from God, but I worship God who makes you die; and I am commanded to be a believer,\n",
        "TRANSLATION_2": "(O Prophet!) Tell them: 'Men! If you are still in doubt concerning my religion, know that I do not serve those whom you serve beside Allah. I only serve Allah Who will cause (all of) you to die. I have been commanded to be one of those who believe,\n",
        "TRANSLATION_3": "(Muhammad), say, \"People, if you have doubt about my religion, know that I, certainly, do not worship the idols which you worship instead of God, but I worship God who causes you to die. I am commanded to believe (in His existence),\n",
        "TRANSLATION_4": "Say (O dear Prophet Mohammed – peace and blessings be upon him), “O people! If you are in doubt concerning my religion, then (know that) I will never worship those whom you worship instead of Allah – but I worship Allah Who will give you death; and I am commanded to be of the believers.”\n",
        "TRANSLATION_5": "Say:\"O people! If you are in doubt about my religion - I will never worship those whom you worship besides Allah, rather, I will worship Allah, the One Who cause you to die. And I was commanded to be one of the believers.\n",
        "TRANSLATION_6": "Say: O people! if you are in doubt as to my religion, then (know that) I do not serve those whom you serve besides Allah but I do serve Allah, Who will cause you to die, and I am commanded that I should be of the believers.\n",
        "TRANSLATION_7": "Say: 'O men, if you are in doubt regarding my religion, I serve not those you serve apart from God, but I serve God, who will gather you to Him, and I am commanded to be of the believers, and:\n",
        "TRANSLATION_8": "Say (O Muhammad): O mankind! If ye are in doubt of my religion, then (know that) I worship not those whom ye worship instead of Allah, but I worship Allah Who causeth you to die, and I have been commanded to be of the believers.\n",
        "TRANSLATION_9": "Say, \"O people, if you are in doubt concerning my religion, then [know that] I do not worship those whom you worship instead of God, but rather I worship God who will cause you to die, for I am commanded to be one of the believers.\"\n",
        "TRANSLATION_10": "Say thou: ye men! if ye are in doubt concerning my religion-- then worship not those ye worship beside Allah, but I worship Allah who causeth you to die; and I am commanded that I should be of the believers.\n",
        "TRANSLATION_11": "Say, ‘O people! if you are in doubt about my religion, then [know that] I do not worship those whom you worship besides Allah. Rather, I worship only Allah, who causes you to die, and I have been commanded to be among the faithful,\n",
        "TRANSLATION_12": "Say: \"O ye men! If ye are in doubt as to my religion, (behold!) I worship not what ye worship, other than Allah! But I worship Allah - Who will take your souls (at death): I am commanded to be (in the ranks) of the Believers,\n",
        "TRANSLATION_13": "Say (O Muhammad SAW): \"O you mankind! If you are in doubt as to my religion (Islam), then (know that) I will never worship those whom you worship, besides Allah. But I worship Allah Who causes you to die, I am commanded to be one of the believers.\n",
        "TRANSLATION_14": "Say: 'O people! If you are in doubt concerning my religion, I worship none of those you worship, other than Allah but I worship Allah, who will cause you to die, for I am commanded to be among the believers,\n",
        "TRANSLATION_15": "Say, “O people, if you are in doubt about my religion—I do not serve those you serve apart from God. But I serve God, the one who will terminate your lives. And I was commanded to be of the believers.”\n",
        "TRANSLATION_16": "Say, [O Muhammad], \"O people, if you are in doubt as to my religion - then I do not worship those which you worship besides Allah; but I worship Allah, who causes your death. And I have been commanded to be of the believers\n",
        "TRANSLATION_17": "[10:104] Say: ‘O people, that is, O people of Mecca, if you are in doubt of my religion, [and] whether it is true, then [know that] I do not worship those whom you worship besides God, that is, [worshipping] other than Him — namely, idols — for you have doubts concerning God; but I worship God Who will take you to Him, [Who] will seize your souls, and I have been commanded to be of the believers.\n",
        "TRANSLATION_18": "(Say) O Muhammad: (O mankind!) O people of Mecca (If ye are in doubt of my religion) Islam, (then (know that) I worship not those whom ye worship) those upon whom you call, of idols, (instead of Allah, but I worship Allah who causeth you to die) Allah who takes away your souls and brings you back to life after He makes you die, (and I have been commanded to be of the believers) with the believers, following their faith.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "10:104",
            "22:73",
            "60:8",
            "10:106",
            "40:14",
            "62:6",
            "16:20",
            "110:2",
            "6:56",
            "60:9"
        ],
        "BIBLE": [
            "torah:exodus:32:1",
            "torah:exodus:34:10",
            "torah:genesis:2:18",
            "writings:daniel:6:13",
            "writings:job:10:2",
            "prophets:joshua:23:7",
            "torah:exodus:32:23",
            "prophets:joel:2:17",
            "prophets:joshua:7:19",
            "prophets:amos:6:10"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:3:7",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:4:10"
        ]
    }
}