{
    "VERSE": "10:105",
    "ARABIC": "وَأَنْ أَقِمْ وَجْهَكَ لِلدِّينِ حَنِيفًا وَلَا تَكُونَنَّ مِنَ ٱلْمُشْرِكِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Turn your face towards the deen in pure natural faith, and on no account be among the idolaters.",
        "TRANSLATION_1": "And to set my face toward the way, as one upright, and not be one of those who associate others with God.\n",
        "TRANSLATION_2": "and to adhere exclusively and sincerely to the true faith, and not to be one of those who associate others with Allah in His divinity.\n",
        "TRANSLATION_3": "to have firm belief in the up-right religion and not to be an idolater\n",
        "TRANSLATION_4": "“And that ‘Set your face straight* for religion, apart from all others; and never be of those who ascribe partners (to Allah)’.” (* Your intention sincerely for religion.)\n",
        "TRANSLATION_5": "And (I was commanded), \"Direct your face toward the Hanif (monotheism) religion, and not be one of the idolators.\"\n",
        "TRANSLATION_6": "And that you should keep your course towards the religion uprightly; and you should not be of the polytheists.\n",
        "TRANSLATION_7": "Set thy face to the religion, a man of pure faith, and be thou not of the idolaters;\n",
        "TRANSLATION_8": "And, (O Muhammad) set thy purpose resolutely for religion, as a man by nature upright, and be not of those who ascribe partners (to Allah).\n",
        "TRANSLATION_9": "And set your face towards the [true] faith in all uprightness, and do not be one of those who ascribe partners to God;\n",
        "TRANSLATION_10": "And that: keep thy countenance straight toward the religion, Upright; and by no means be of the associators.\n",
        "TRANSLATION_11": "and that: ‘‘Dedicate yourself to the religion, as a Hanif, and never be one of the polytheists.\n",
        "TRANSLATION_12": "And further (thus): 'set thy face towards religion with true piety, and never in any wise be of the Unbelievers;\n",
        "TRANSLATION_13": "And (it is inspired to me): Direct your face (O Muhammad SAW) entirely towards the religion Hanifa (Islamic Monotheism, i.e. to worship none but Allah Alone), and never be one of the Mushrikun (those who ascribe partners to Allah, polytheists, idolaters, disbelievers in the Oneness of Allah, and those who worship others along with Allah).\n",
        "TRANSLATION_14": "and, set your face towards the religion, being of pure faith, and do not be among the idolaters.\n",
        "TRANSLATION_15": "And dedicate yourself to the true religion—a monotheist—and never be of the polytheists.\n",
        "TRANSLATION_16": "And [commanded], 'Direct your face toward the religion, inclining to truth, and never be of those who associate others with Allah;\n",
        "TRANSLATION_17": "[10:105] And, it has been said to me: “Set your purpose for religion, as a hanīf, inclining towards it, and do not be of the idolaters;\n",
        "TRANSLATION_18": "(And, set thy purpose resolutely for religion) make your religion and works sincere to Allah, (as a man by nature upright) surrendered to Allah, (and be not of those who ascribe partners (to Allah)) do not be among the idolaters, following their religion.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "10:105",
            "4:125",
            "6:79",
            "30:30",
            "110:2",
            "15:88",
            "109:6",
            "82:17",
            "74:46",
            "23:104"
        ],
        "BIBLE": [
            "prophets:ezekiel:21:21",
            "writings:psalms:5:9",
            "prophets:ezekiel:21:2",
            "prophets:ezekiel:35:2",
            "writings:proverbs:21:29",
            "prophets:ezekiel:6:2",
            "torah:deuteronomy:17:15",
            "prophets:ezekiel:28:21",
            "prophets:ezekiel:38:2",
            "prophets:jeremiah:52:25"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:3:6",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:4:7"
        ]
    }
}