{
    "VERSE": "10:11",
    "ARABIC": "وَلَوْ يُعَجِّلُ ٱللَّهُ لِلنَّاسِ ٱلشَّرَّ ٱسْتِعْجَالَهُم بِٱلْخَيْرِ لَقُضِىَ إِلَيْهِمْ أَجَلُهُمْ فَنَذَرُ ٱلَّذِينَ لَا يَرْجُونَ لِقَآءَنَا فِى طُغْيَٰنِهِمْ يَعْمَهُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "If Allah were to hasten evil for people the way they try to hasten good, their term would already have been completed for them. We abandon those who do not expect to meet Us to wander blindly in their excessive insolence.",
        "TRANSLATION_1": "If God were to hasten the evil, as men try to hasten the good, their term would come to end. So We leave those who do not expect to meet Us to wander perplexed in transgression.\n",
        "TRANSLATION_2": "Were Allah to hasten to bring upon men (the consequence of) evil in the way men hasten in seeking the wealth of this world, their term would have long since expired. (But that is not Our way.) So We leave alone those who do not expect to meet Us that they may blindly stumble in their transgression.\n",
        "TRANSLATION_3": "Had God been as hasty to punish people as they were hasty to achieve good, their life would have already ended. We will leave those who have no hope of receiving Our mercy, in the life hereafter, to continue blindly in their transgression.\n",
        "TRANSLATION_4": "Were Allah to send misfortune to the people as quickly as they hasten for the good*, their appointed term would have been finished; so We leave those who do not expect to meet Us, to wander in their rebellion. (* The way they wish the good to reach them quickly.)\n",
        "TRANSLATION_5": "And were Allah to hasten for mankind the evil as He hastens for them the good then they would have been ruined. So We leave those who expect not their meeting with Us, in their trespasses, wandering blindly in distraction.\n",
        "TRANSLATION_6": "And if Allah should hasten the evil to men as they desire the hastening on of good, their doom should certainly have been decreed for them; but We leave those alone who hope not for Our meeting in their inordinacy, blindly wandering on.\n",
        "TRANSLATION_7": "If God should hasten unto men evil as they would hasten good, their term would be already decided for them. But We leave those, who look not to encounter Us, in their insolence wandering blindly.\n",
        "TRANSLATION_8": "If Allah were to hasten on for men the ill (that they have earned) as they would hasten on the good, their respite would already have expired. But We suffer those who look not for the meeting with Us to wander blindly on in their contumacy.\n",
        "TRANSLATION_9": "Had God hastened the punishment of men as He hastens the good, the end of their term of life would already have been reached. We leave those who do not hope to meet Us groping along in their arrogance.\n",
        "TRANSLATION_10": "And were Allah to hasten the ill unto mankind as their desire for hastening the good, their term would surely have been decreed unto them. So we let alone those who hope not for the meeting with Us, wandering in their exorbitance perplexed.\n",
        "TRANSLATION_11": "Were Allah to hasten ill for mankind with their haste for good, their term would have been over. But We leave those who do not expect to encounter Us bewildered in their rebellion.\n",
        "TRANSLATION_12": "If Allah were to hasten for men the ill (they have earned) as they would fain hasten on the good,- then would their respite be settled at once. But We leave those who rest not their hope on their meeting with Us, in their trespasses, wandering in distraction to and fro.\n",
        "TRANSLATION_13": "And were Allah to hasten for mankind the evil (they invoke for themselves and for their children, etc. while in a state of anger) as He hastens for them the good (they invoke) then they would have been ruined. So We leave those who expect not their meeting with Us, in their trespasses, wandering blindly in distraction. (Tafsir At-Tabari; Vol. 11, Page 91)\n",
        "TRANSLATION_14": "If Allah should hasten evil to people as they would hasten good, their term would already have been decided. But We leave those who do not expect to meet Us to wander blindly in their insolence.\n",
        "TRANSLATION_15": "If God were to accelerate the ill for the people, as they wish to accelerate the good, their term would have been fulfilled. But We leave those who do not expect Our encounter to blunder in their excesses.\n",
        "TRANSLATION_16": "And if Allah was to hasten for the people the evil [they invoke] as He hastens for them the good, their term would have been ended for them. But We leave the ones who do not expect the meeting with Us, in their transgression, wandering blindly\n",
        "TRANSLATION_17": "[10:11] When the idolaters sought to hasten [their] chastisement, the following was revealed: And if God should hasten for mankind evil as they would hasten good, their term [of life] would already have been concluded for them (read as the passive, with nominative ajaluhum [sc. la-qudiya ajaluhum]; or read as the active with accusative ajalahum [sc. la-qadā ajalahum, ‘He would have already concluded their term’]), by His destroying them, but He gives them respite. But We leave those, who do not expect to encounter Us, to wander blindly in their insolence, hesistant and perplexed.\n",
        "TRANSLATION_18": "(If Allah were to hasten on for men the ill) they pray for (as they would hasten on the good) they ask for, (their respite would already have expired) they would already be destroyed. (But We suffer those who look not for the meeting with Us) We leave those who do not fear resurrection after death (to wander blindly on in their contumacy) in their disbelief and error.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "10:11",
            "8:23",
            "47:21",
            "3:54",
            "3:110",
            "8:30",
            "10:109",
            "4:108",
            "16:61",
            "7:87"
        ],
        "BIBLE": [
            "writings:psalms:17:14",
            "prophets:isaiah:49:21",
            "writings:ecclesiastes:12:14",
            "prophets:ezekiel:7:3",
            "prophets:i%20samuel:25:34",
            "prophets:ezekiel:31:14",
            "prophets:zephaniah:1:12",
            "writings:daniel:12:7",
            "prophets:hosea:11:9",
            "writings:psalms:53:3"
        ]
    }
}