{
    "VERSE": "10:2",
    "ARABIC": "أَكَانَ لِلنَّاسِ عَجَبًا أَنْ أَوْحَيْنَآ إِلَىٰ رَجُلٍ مِّنْهُمْ أَنْ أَنذِرِ ٱلنَّاسَ وَبَشِّرِ ٱلَّذِينَ ءَامَنُوٓا۟ أَنَّ لَهُمْ قَدَمَ صِدْقٍ عِندَ رَبِّهِمْ قَالَ ٱلْكَٰفِرُونَ إِنَّ هَٰذَا لَسَٰحِرٌ مُّبِينٌ",
    "ENGLISH": {
        "TRANSLATION_0": "Do people find it so surprising that We should reveal to a man among them: 'Warn mankind and give good news to those who have iman that they are on a sure footing with their Lord'? The kafirun say, This is downright magic!'",
        "TRANSLATION_1": "Are the people astonished that a man who is one of them was commanded by Us to warn them and to bring glad tidings to those who believe that they have a true precedence with their Lord? (Yet) the unbelievers say: \"He is a clear sorcerer.\"\n",
        "TRANSLATION_2": "Does it seem strange to people that We should have revealed to a man from among themselves, directing him to warn the people (who lie engrossed in heedlessness); and to give good news to the believers that they shall enjoy true honour and an exalted status with their Lord? (Is this so strange that) the deniers of the truth should say: 'This man is indeed an evident sorcerer'?\n",
        "TRANSLATION_3": "Why should it seem strange to mankind that We sent revelations to a mortal among them, who would warn others and give to the believers the glad news of their high rank in the sight of God. The unbelievers have said, \"He (Muhammad) is certainly a magician.\"\n",
        "TRANSLATION_4": "Are people amazed that We have sent to a man among them, the divine revelation that “Warn the people and convey glad tidings to the believers that for them with their Lord is the place* of truth”? The disbelievers say, “Indeed he is an open magician.” (* Positions of honour on the Day of Resurrection or in heaven.)\n",
        "TRANSLATION_5": "Is it a wonder for mankind that We have sent Our revelation to a man from among themselves (saying): \"Warn mankind, and give good news to those who believe that they shall have with their Lord the rewards of their good deeds\" (But) the disbelievers say: \"This is indeed an evident sorcerer!\"\n",
        "TRANSLATION_6": "What! is it a wonder to the people that We revealed to a man from among themselves, saying: Warn the people and give good news to those who believe that theirs is a footing of firmness with their Lord. The unbelievers say: This is most surely a manifest enchanter.\n",
        "TRANSLATION_7": "Was it a wonder to the people that We revealed to a man from among them: 'Warn the people, and give thou good tidings to the believers that they have a sure footing with their Lord'? The unbelievers say, 'This is a manifest sorcerer.'\n",
        "TRANSLATION_8": "Is it a wonder for mankind that We have inspired a man among them, saying: Warn mankind and bring unto those who believe the good tidings that they have a sure footing with their Lord? The disbelievers say: Lo! this is a mere wizard.\n",
        "TRANSLATION_9": "Does it seem strange to people that We have sent revelation to a man from among themselves, saying, \"Warn mankind and give glad tidings to the believers that they have a true rank [of honour] with their Lord?\" Those who deny the truth say, \"This man is clearly a sorcerer.\"\n",
        "TRANSLATION_10": "It is a matter of wonderment to the mankind that we should reveal unto a man among them saying: warn thou the man kind, and bear those who have believed the glad tidings that theirs shall be a sure footing. with their Lord! The infidels say: verily this in a sorcerer manifest.\n",
        "TRANSLATION_11": "Does it seem odd to these people that We have revealed to a man from among themselves, [declaring], ‘Warn mankind, and give good news to the faithful that they are in good standing with their Lord’? The faithless say, ‘This is indeed a plain magician.’\n",
        "TRANSLATION_12": "Is it a matter of wonderment to men that We have sent Our inspiration to a man from among themselves?- that he should warn mankind (of their danger), and give the good news to the Believers that they have before their Lord the lofty rank of truth. (But) say the Unbelievers: \"This is indeed an evident sorcerer!\"\n",
        "TRANSLATION_13": "Is it wonder for mankind that We have sent Our Inspirationto a man from among themselves (i.e. Prophet Muhammad SAW) (saying): \"Warn mankind (of the coming torment in Hell), and give good news to those who believe (in the Oneness of Allah and in His Prophet Muhammad SAW) that they shall have with their Lord the rewards of their good deeds?\" (But) the disbelievers say: \"This is indeed an evident sorcerer (i.e. Prophet Muhammad SAW and the Quran)!\n",
        "TRANSLATION_14": "Is it a wonder to the people that We revealed to a man from among themselves: 'Warn mankind, and bear the glad tidings to those who believe that they stand firm with their Lord' (Yet) the unbelievers say: 'This is a clear sorcerer'\n",
        "TRANSLATION_15": "Is it a wonder to the people that We inspired a man from among them: “Warn mankind, and give good news to those who believe that they are on a sound footing with their Lord”? The disbelievers said, “This is a manifest sorcerer.”\n",
        "TRANSLATION_16": "Have the people been amazed that We revealed [revelation] to a man from among them, [saying], \"Warn mankind and give good tidings to those who believe that they will have a [firm] precedence of honor with their Lord\"? [But] the disbelievers say, \"Indeed, this is an obvious magician.\"\n",
        "TRANSLATION_17": "[10:2] Is it for the people, the people of Mecca (this interrogative is meant as a disavowal; the preposition [li-, ‘for’] and its dependent genitive noun [al-nās, ‘the people’] constitute a circumstantial qualifier of His saying): a wonder (‘ajaban: read in the accusative as a predicate of kāna; or if read in the nominative [‘ajabun] as its subject: its predicate, which is also its subject if read according to the former [accusative] reading, is [the following, an awhaynā]) that We have inspired a man from among them, Muhammad (s), [saying] (an, ‘that’, is explicative): ‘Warn, threaten, the people, the disbelievers, with chastisement, and give good tidings to those who believe that they have a prior, a preceding, [promise of] truth with their Lord’?, that is a [preceding] fair reward, in return for the deeds they have sent forward. The disbelievers say, ‘Truly this, Qur’ān that comprises all of that [mentioned], is manifest sorcery’: a variant reading [for la-sihrun] has lasāhirun, ‘a sorcerer’, where it is the Prophet (s) to whom they are referring [as being ‘a manifest sorcerer’].\n",
        "TRANSLATION_18": "(Is it a wonder for mankind) for the people of Mecca (that We have inspired a man among them) a human being like them, (saying: Warn mankind) warn the people of Mecca by means of the Qur'an (and bring unto those who believe the good tidings that they have a sure footing) a good reward; it is also said that their faith in the life of this world is their sure footing with their Lord in the Hereafter; it is also said that this means: they have a true prophet; as it is said that this means: they have a true intercessor (with their Lord? The disbelievers) the disbelievers of Mecca (say: Lo! This) Qur'an (is a mere wizard) a mere lie.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "10:2",
            "43:49",
            "13:5",
            "41:50",
            "2:21",
            "57:19",
            "47:3",
            "11:119",
            "38:47",
            "6:127"
        ],
        "BIBLE": [
            "prophets:joshua:3:3",
            "writings:daniel:6:13",
            "prophets:ii%20kings:6:9",
            "torah:numbers:10:29",
            "prophets:ii%20kings:5:8",
            "prophets:i%20samuel:29:6",
            "torah:exodus:13:3",
            "prophets:i%20kings:2:42",
            "writings:ii%20chronicles:25:15",
            "prophets:i%20kings:17:18"
        ]
    }
}