{
    "VERSE": "10:21",
    "ARABIC": "وَإِذَآ أَذَقْنَا ٱلنَّاسَ رَحْمَةً مِّنۢ بَعْدِ ضَرَّآءَ مَسَّتْهُمْ إِذَا لَهُم مَّكْرٌ فِىٓ ءَايَاتِنَا قُلِ ٱللَّهُ أَسْرَعُ مَكْرًا إِنَّ رُسُلَنَا يَكْتُبُونَ مَا تَمْكُرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "When We let people taste mercy after hardship has afflicted them, immediately they plot against Our Signs. Say: 'Allah is swifter at plotting.' Your plotting is recorded by Our messengers.",
        "TRANSLATION_1": "When We let them taste Our mercy after affliction, they contrive against Our signs. Say: \"God is swifter at contriving,\" for Our angels record everything you plan.\n",
        "TRANSLATION_2": "No sooner than We bestow mercy on a people after hardship has hit them than they begin to scheme against Our signs. Tell them: 'Allah is swifter in scheming. Our angels are recording all your intriguing.\n",
        "TRANSLATION_3": "When people are granted mercy after having suffered hardship, they begin to plot against Our revelations. Say, \"God is the most swift in His plans.\" Our angelic messengers record all that you plot.\n",
        "TRANSLATION_4": "And when We give mankind the taste of mercy after some hardship which had afflicted them, they immediately start conspiring against Our signs; proclaim, “The secret plan of Allah is the fastest”; indeed Our angels record your scheming.\n",
        "TRANSLATION_5": "And when We let mankind taste mercy after some adversity has afflicted them, behold! They take to plotting against Our Ayat! Say: \"Allah is more swift in planning!\" Certainly, Our messengers (angels) record all of that which you plot.\n",
        "TRANSLATION_6": "And when We make people taste of mercy after an affliction touches them, lo! they devise plans against Our communication. Say: Allah is quicker to plan; surely Our apostles write down what you plan.\n",
        "TRANSLATION_7": "When We let the people taste mercy after hardship has visited them, lo, they have a device concerning Our signs. Say: 'God is swifter at devising; surely Our messengers are writing down what you are devising.'\n",
        "TRANSLATION_8": "And when We cause mankind to taste of mercy after some adversity which had afflicted them, behold! they have some plot against Our revelations. Say: Allah is more swift in plotting. Lo! Our messengers write down that which ye plot.\n",
        "TRANSLATION_9": "Whenever We let mankind taste mercy after some adversity has afflicted them, they forthwith turn to devising false arguments against Our signs. Say, \"God is swifter in His devising! Our angels are recording your intrigues.\"\n",
        "TRANSLATION_10": "And when We let mankind taste of mercy after an adversity hath touched them, forthwith they have a plot with regard to his signs. Say thou: Allah is swifter in plotting. Verily Our mesengers write down that which ye plot.\n",
        "TRANSLATION_11": "When We let people taste [Our] mercy after a distress that has befallen them, behold, they scheme against Our signs! Say, ‘Allah is more swift at devising.’ Indeed Our messengers write down what you scheme.\n",
        "TRANSLATION_12": "When We make mankind taste of some mercy after adversity hath touched them, behold! they take to plotting against Our Signs! Say: \"Swifter to plan is Allah!\" Verily, Our messengers record all the plots that ye make!\n",
        "TRANSLATION_13": "And when We let mankind taste of mercy after some adversity has afflicted them, behold! They take to plotting against Our Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.)! Say: \"Allah is more Swift in planning!\" Certainly, Our Messengers (angels) record all of that which you plot.\n",
        "TRANSLATION_14": "When We let people taste (Our) mercy after they had been afflicted by hardship, they devise against Our verses. Say: 'Allah is more swift in devising' Indeed, Our Messengers (the angels) are writing down whatever you devise.\n",
        "TRANSLATION_15": "When We make the people taste mercy after some adversity has touched them, they begin to scheme against Our revelations. Say, “God is swifter in scheming.” Our envoys are writing down what you scheme.\n",
        "TRANSLATION_16": "And when We give the people a taste of mercy after adversity has touched them, at once they conspire against Our verses. Say, \"Allah is swifter in strategy.\" Indeed, Our messengers record that which you conspire\n",
        "TRANSLATION_17": "[10:21] And when We made people, that is, the disbelievers of Mecca, taste of mercy, [of] rain and fertility, after adversity, misery and drought, that had afflicted them, behold! they have some plot concerning Our signs, in the way of mockery and denial. Say, to them: ‘God is swifter at plotting, at requiting; surely Our, guardian, messengers are writing down that which you are plotting’ (tamkurūn, is also read yamkurūn, ‘they are plotting’).\n",
        "TRANSLATION_18": "(And when We cause mankind) when We enable the idolaters (to taste of mercy) blessings (after some adversity) hardship (which had afflicted them, behold! they have some plot against) they give the lie to (Our revelations) Muhammad (pbuh) and the Qur'an. (Say: Allah is more swift in plotting) Allah's punishment is more severe. Allah destroyed them on the Day of Badr. (Lo! Our messengers) who record the deeds of mankind (write down that which you plot) the lies you utter and the transgressions you commit.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "10:21",
            "35:2",
            "2:159",
            "3:172",
            "3:134",
            "57:17",
            "4:165",
            "25:37",
            "28:43",
            "30:36"
        ],
        "BIBLE": [
            "writings:daniel:6:13",
            "prophets:joel:2:17",
            "torah:exodus:34:10",
            "prophets:joshua:7:19",
            "torah:deuteronomy:7:2",
            "torah:exodus:36:6",
            "writings:i%20chronicles:17:22",
            "writings:psalms:32:5",
            "prophets:ezekiel:12:23",
            "prophets:jeremiah:15:11"
        ]
    }
}