{
    "VERSE": "10:22",
    "ARABIC": "هُوَ ٱلَّذِى يُسَيِّرُكُمْ فِى ٱلْبَرِّ وَٱلْبَحْرِ حَتَّىٰٓ إِذَا كُنتُمْ فِى ٱلْفُلْكِ وَجَرَيْنَ بِهِم بِرِيحٍ طَيِّبَةٍ وَفَرِحُوا۟ بِهَا جَآءَتْهَا رِيحٌ عَاصِفٌ وَجَآءَهُمُ ٱلْمَوْجُ مِن كُلِّ مَكَانٍ وَظَنُّوٓا۟ أَنَّهُمْ أُحِيطَ بِهِمْ دَعَوُا۟ ٱللَّهَ مُخْلِصِينَ لَهُ ٱلدِّينَ لَئِنْ أَنجَيْتَنَا مِنْ هَٰذِهِۦ لَنَكُونَنَّ مِنَ ٱلشَّٰكِرِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "It is He who conveys you on both land and sea so that when some of you are on a boat, running before a fair wind, rejoicing at it, and then a violent squall comes upon them and the waves come at them from every side and they realise there is no way of escape, they call on Allah, making their deen sincerely His: 'If You rescue us from this, we will truly be among the thankful.'",
        "TRANSLATION_1": "It is He who enables you to travel over land and sea. When you sail in ships in a favourable breeze, you rejoice. But when a gale begins to blow and the waves dash against them from every side they realise that they have been caught in it, (and) they call on God in all faith: \"If You save us from this we shall ever be grateful.\"\n",
        "TRANSLATION_2": "He it is Who enables you to journey through the land and the sea. And so it happens that when you have boarded the ships and they set sail with a favourable wind, and the passengers rejoice at the pleasant voyage, then suddenly a fierce gale appears, and wave upon wave surges upon them from every side, and people believe that they are surrounded from all directions, and all of them cry out to Allah in full sincerity of faith: 'If You deliver us from this we shall surely be thankful.\n",
        "TRANSLATION_3": "When you are rejoicing in a boat, a favorable breeze and a violent storm arises with waves surrounding you from all sides. Thinking that you will not survive, you start to pray sincerely to God. In prayer, you say, \"If You rescue us from this we shall certainly be grateful\".\n",
        "TRANSLATION_4": "It is He Who transports you over the land and the sea; to the extent that when you are in ships – and the ships sail with them with a favourable breeze and they rejoice at it – a gust of strong wind reaches them and waves come to them from every side and they realise that they are surrounded, – thereupon they pray to Allah as His sincere bondmen that, “If You rescue us from this, we will surely be thankful.”\n",
        "TRANSLATION_5": "He it is Who enables you to travel through land and sea, till when you are in the ships, and they sail with them with a favorable wind, and they are glad therein, then comes a stormy wind and the waves come to them from all sides, and they think that they are encircled therein. Then they invoke Allah, making their faith pure for Him (alone), (saying): \"If You (Allah) deliver us from this, we shall truly, be of the grateful.\"\n",
        "TRANSLATION_6": "He it is Who makes you travel by land and sea; until when you are in the ships, and they sail on with them in a pleasant breeze, and they rejoice, a violent wind overtakes them and the billows surge in on them from all sides, and they become certain that they are encompassed about, they pray to Allah, being sincere to Him in obedience: If Thou dost deliver us from this, we will most certainly be of the grateful ones.\n",
        "TRANSLATION_7": "It is He who conveys you on the land and the sea; and when you are in the ship -- and the ships run with them with a fair breeze, and they rejoice in it, there comes upon them a strong wind, and waves come on them from every side, and they think they are encompassed; they call upon God, making their religion His sincerely: 'If Thou deliverest us from these, surely we shall be among the thankful.'\n",
        "TRANSLATION_8": "He it is Who maketh you to go on the land and the sea till, when ye are in the ships and they sail with them with a fair breeze and they are glad therein, a storm-wind reacheth them and the wave cometh unto them from every side and they deem that they are overwhelmed therein; (then) they cry unto Allah, making their faith pure for Him only: If Thou deliver us from this, we truly will be of the thankful.\n",
        "TRANSLATION_9": "It is God who enables you to travel on land and sea. And when you are sailing on ships and rejoicing in the favourable wind, a storm arrives, and the waves surge upon those on board from every side and they think they are encompassed, then they make a fervent appeal to God, saying in all sincerity, \"If You deliver us from this, we will surely be of the thankful.\"\n",
        "TRANSLATION_10": "He it is who enableth you to travel by land and sea until when ye are in ships and they run away with them with a goodly wind and they rejoice thereat, there cometh upon them a tempestuous wind and there cometh unto them a billow from every side, and they imagine that they are encompassed therein, they cry unto Allah making there faith pure for Him: If Thou deliverest us from this. we would surely be of those who are thankful.\n",
        "TRANSLATION_11": "It is He who carries you across land and sea. When you are in the ships, and they sail along with them with a favourable wind, exulting in it, there comes upon them a tempestuous wind and waves assail them from every side, and they think that they are besieged, they invoke Allah putting exclusive faith in Him, ‘If You deliver us from this, we will surely be among the grateful.’\n",
        "TRANSLATION_12": "He it is Who enableth you to traverse through land and sea; so that ye even board ships;- they sail with them with a favourable wind, and they rejoice thereat; then comes a stormy wind and the waves come to them from all sides, and they think they are being overwhelmed: they cry unto Allah, sincerely offering (their) duty unto Him saying, \"If thou dost deliver us from this, we shall truly show our gratitude!\"\n",
        "TRANSLATION_13": "He it is Who enables you to travel through land and sea, till when you are in the ships and they sail with them with a favourable wind, and they are glad therein, then comes a stormy wind and the waves come to them from all sides, and they think that they are encircled therein, they invoke Allah, making their Faith pure for Him Alone, saying: \"If You (Allah) deliver us from this, we shall truly be of the grateful.\n",
        "TRANSLATION_14": "It is He who conveys you by land and sea. When you are on board the ship and the ships run with them upon a fair breeze they are joyful. (But when) a strong wind and waves come upon them from every side, and they think they are encompassed, they supplicate to Allah, making their religion His sincerely, (saying): 'If You save us from this, we will indeed be among the thankful'\n",
        "TRANSLATION_15": "It is He who transports you across land and sea. Until, when you are on ships, sailing in a favorable wind, and rejoicing in it, a raging wind arrives. The waves surge over them from every side, and they realize that they are besieged. Thereupon they pray to God, professing sincere devotion to Him: “If You save us from this, we will be among the appreciative.”\n",
        "TRANSLATION_16": "It is He who enables you to travel on land and sea until, when you are in ships and they sail with them by a good wind and they rejoice therein, there comes a storm wind and the waves come upon them from everywhere and they assume that they are surrounded, supplicating Allah, sincere to Him in religion, \"If You should save us from this, we will surely be among the thankful.\"\n",
        "TRANSLATION_17": "[10:22] He it is Who conveys you (yusayyirukum: a variant reading has yanshurukum) across the land and the sea, until when you are in ships and they sail with them (there is a shift of address from second [to third] person) with a fair, gentle, breeze and they rejoice therein, there comes upon them a stormy wind, blowing violently, destroying everything, and waves come on them from every side, and they think that they are overwhelmed, that is, [that] they shall perish, they call upon God, secure in their faith, their supplication, only to Him: ‘If (la-in: the lām is for oaths) You deliver us from these, terrors, we shall verily be of the thankful’, [of those] who affirm [Your] Oneness.\n",
        "TRANSLATION_18": "(He it is Who maketh you to go) it is He Who protects you when you travel (on the land) on mounting beasts (and the sea) on ships (till, when ye are in the ships and they sail with them) with people aboard (with a fair breeze) gentle and calm (and they are glad therein) the sailors are happy with the gentle breeze, (a storm wind reaches them) i.e. the ships (and the wave cometh unto them from every side and they deem) they know (that they are overwhelmed) destroyed (therein; (then) they cry unto Allah, making their faith pure for Him only) singling Him out alone in their supplication; (If Thou deliver us from this) storm and hardship, (we truly will be of the thankful) among the obedient believers.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "10:22",
            "29:65",
            "31:32",
            "31:31",
            "45:12",
            "2:164",
            "8:39",
            "27:63",
            "23:28",
            "110:2"
        ],
        "BIBLE": [
            "writings:ii%20chronicles:6:37",
            "prophets:i%20kings:8:47",
            "prophets:isaiah:57:13",
            "torah:numbers:21:8",
            "torah:exodus:32:1",
            "torah:numbers:17:11",
            "torah:deuteronomy:17:14",
            "prophets:isaiah:30:6",
            "prophets:isaiah:45:20",
            "torah:exodus:34:10"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:4:12"
        ]
    }
}