{
    "VERSE": "10:24",
    "ARABIC": "إِنَّمَا مَثَلُ ٱلْحَيَوٰةِ ٱلدُّنْيَا كَمَآءٍ أَنزَلْنَٰهُ مِنَ ٱلسَّمَآءِ فَٱخْتَلَطَ بِهِۦ نَبَاتُ ٱلْأَرْضِ مِمَّا يَأْكُلُ ٱلنَّاسُ وَٱلْأَنْعَٰمُ حَتَّىٰٓ إِذَآ أَخَذَتِ ٱلْأَرْضُ زُخْرُفَهَا وَٱزَّيَّنَتْ وَظَنَّ أَهْلُهَآ أَنَّهُمْ قَٰدِرُونَ عَلَيْهَآ أَتَىٰهَآ أَمْرُنَا لَيْلًا أَوْ نَهَارًا فَجَعَلْنَٰهَا حَصِيدًا كَأَن لَّمْ تَغْنَ بِٱلْأَمْسِ كَذَٰلِكَ نُفَصِّلُ ٱلْءَايَٰتِ لِقَوْمٍ يَتَفَكَّرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "The metaphor of the life of this world is that of water which We send down from the sky, and which then loveliest and takes on its fairest guise and its people think they have it under their control, Our command comes upon it by night or day and We reduce it to dried-out stubble, as though it had not been flourishing just the day before! In this way We make Our Signs clear for people who reflect.",
        "TRANSLATION_1": "The life of the world is like the rain that waters the crops of the earth which are used as food by men and cattle. But when the earth is embellished and adorned with gold, and its tillers begin to feel that (the crops) are under control, Our command descends suddenly at night or in the day, and We mow them down as though there was nothing there yesterday. This is how We distinctly explain Our signs to those who think.\n",
        "TRANSLATION_2": "The example of the life of this world (which has enamoured you into becoming heedless to Our signs) is that of water that We sent down from the heaven which causes the vegetation of the earth, which sustains men and cattle, to grow luxuriantly. But when the earth took on its golden raiment and became well adorned and the owners believed that they had full control over their lands Our command came upon them by night or by day, and We convened it into a stubble, as though it had not blossomed yesterday. Thus do We expound the signs for a people who reflect.\n",
        "TRANSLATION_3": "The example of the worldly life is like the water sent down from the sky which becomes mixed with the earth's produce that people and cattle consume. When the land becomes fertile and pleasant, people think that they have control over it. At Our command during the night or day, the land becomes as barren as if it had no richness the day before. Thus, do We explain the evidence (of the truth) for the people who reflect.\n",
        "TRANSLATION_4": "The example of the life of this world is similar to the water which We sent down from the sky, so due to it the earth’s vegetation grew in abundance – that which men and cattle eat; to the extent that when the earth has taken on her ornaments and is well beautified, and her owners thought that it is within their control, Our command came to it at night or at day – so We made it harvested as if it had not existed yesterday; this is how We explain the verses for the people who ponder.\n",
        "TRANSLATION_5": "Verily, the parable of the life of the world is as the water which We send down from the sky; so by it arises the intermingled produce of the earth of which men and cattle eat: until when the earth is clad in its adornments and is beautified, and its people think that they have all the powers of disposal over it, Our command reaches it by night or by day and We make it like a clean-mown harvest, as if it had not flourished yesterday! Thus do We explain the Ayat in detail for the people who reflect.\n",
        "TRANSLATION_6": "The likeness of this world's life is only as water which We send down from the cloud, then the herbage of the earth of which men and cattle eat grows luxuriantly thereby, until when the earth puts on its golden raiment and it becomes garnished, and its people think that they have power over it, Our command comes to it, by night or by day, so We render it as reaped seed; produce, as though it had not been in existence yesterday; thus do We make clear the communications for a people who reflect.\n",
        "TRANSLATION_7": "The likeness of this present life is as water that We send down out of heaven, and the plants of the earth mingle with it whereof men and cattle eat, till, when the earth has taken on its glitter and has decked itself fair, and its inhabitants think they have power over it, Our command comes upon it by night or day, and We make it stubble, as though yesterday it flourished not. Even so We distinguish the signs for a people who reflect.\n",
        "TRANSLATION_8": "The similitude of the life of the world is only as water which We send down from the sky, then the earth's growth of that which men and cattle eat mingleth with it till, when the earth hath taken on her ornaments and is embellished, and her people deem that they are masters of her, Our commandment cometh by night or by day and We make it as reaped corn as if it had not flourished yesterday. Thus do we expound the revelations for people who reflect.\n",
        "TRANSLATION_9": "The life of the world is like the water which We send down from the sky, and which is absorbed by the plants of the earth, from which men and cattle eat. But when the earth has taken on its finest appearance, and looks beautiful, and its people think they have it under their control, then by day or by night, Our command comes to it and We convert it into a field of stubble, as if nothing had existed there the day before. Thus We make plain Our revelations for those who reflect.\n",
        "TRANSLATION_10": "The similitude of the life of the world is only as the rain which We send down from heaven, wherewith maingleth the growth of the earth, of which men and cattle eat, until, when the earth putteth on her oranament and is adorned, and the inhabitants thereof imgine that they are potent over it, there cometh unto it Our command by night or by day, then We make it stubble as though it had not flourished yesterday. Thus We detail the signs unto a people who ponder.\n",
        "TRANSLATION_11": "The parable of the life of this world is that of water which We send down from the sky. It mingles with the earth’s vegetation from which humans and cattle eat. When the earth puts on its luster and is adorned, and its inhabitants think they have power over it, Our edict comes to it, by night or day, whereat We turn it into a mown field, as if it did not flourish the day before. Thus do We elaborate the signs for a people who reflect.\n",
        "TRANSLATION_12": "The likeness of the life of the present is as the rain which We send down from the skies: by its mingling arises the produce of the earth- which provides food for men and animals: (It grows) till the earth is clad with its golden ornaments and is decked out (in beauty): the people to whom it belongs think they have all powers of disposal over it: There reaches it Our command by night or by day, and We make it like a harvest clean-mown, as if it had not flourished only the day before! thus do We explain the Signs in detail for those who reflect.\n",
        "TRANSLATION_13": "Verily the likeness of (this) worldly life is as the water (rain) which We send down from the sky, so by it arises the intermingled produce of the earth of which men and cattle eat until when the earth is clad with its adornments and is beautified, and its people think that they have all the powers of disposal over it, Our Command reaches it by night or by day and We make it like a clean-mown harvest, as if it had not flourished yesterday! Thus do We explain the Ayat (proofs, evidences, verses, lessons, signs, revelations, laws, etc.) in detail for the people who reflect.\n",
        "TRANSLATION_14": "This present life is like the water We send down from the sky. The plants of the earth mix with it and from it mankind and cattle eat; then when the earth has become lush and adorned, its inhabitants think they have power over it, Our command comes upon it by night or day, and We cause it to be stubble, just as though it had not flourished the day before. In this way We distinguish Our verses for those who reflect.\n",
        "TRANSLATION_15": "The likeness of the present life is this: water that We send down from the sky is absorbed by the plants of the earth, from which the people and the animals eat. Until, when the earth puts on its fine appearance, and is beautified, and its inhabitants think that they have mastered it, Our command descends upon it by night or by day, and We turn it into stubble, as if it had not flourished the day before. We thus clarify the revelations for people who reflect.\n",
        "TRANSLATION_16": "The example of [this] worldly life is but like rain which We have sent down from the sky that the plants of the earth absorb - [those] from which men and livestock eat - until, when the earth has taken on its adornment and is beautified and its people suppose that they have capability over it, there comes to it Our command by night or by day, and We make it as a harvest, as if it had not flourished yesterday. Thus do We explain in detail the signs for a people who give thought.\n",
        "TRANSLATION_17": "[10:24] The likeness, the description, of the life of this world is only as water, rain, which We send down from the heaven, then the plants of the earth mingle with it, [they mingle] because of it, attaching themselves one to another, whereof mankind eat, [plants] such as wheat and barley and so on, and cattle [eat], of pasture, until, when the earth has taken on its ornaments, its splendour of plants, and has adorned itself, with flowers (izzayyanat, ‘adorned itself’, is originally tazayyanat, but the tā’ has been substituted with the zāy and assimilated with it) and its inhabitants think that they are masters of it, fully capable of harvesting its fruits, Our command, Our decree or Our chastisement, comes upon it by night or day, and We make it, that is, its crops, as reaped corn, like that which has been reaped with sickles, as though (ka-an is softened, in other words [read it as] ka-annahā) the previous day it had not flourished, [as though] it never were. Thus do We detail, [do] We make clear, the signs for a people who reflect.\n",
        "TRANSLATION_18": "(The similitude of the life of the world) in terms of its permanence and evanescence (is only as water) rain (which We send down from the sky, then the earth's growth of that which men and cattle eat) grains and fruits for men and plants and abundant grass for cattle (mingles with it till, when the earth hath taken on her ornaments and is embellished) with the colours red, yellow and green, (and her people) the plowmen (deem that they are masters of her) of her yielding, (Our commandment) Our punishment (cometh by night or by day) just as if sheep have trampled on its enclosure destroying all the plowmen's plantations (and we make it as reaped corn) in the summer (as if it had not flourished yesterday) as if they had not existed yesterday. (Thus do We expound the revelation) We explain in the Qur'an the evanescence of the life of this world (for people who reflect) upon the matter of this world and the Hereafter.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "10:24",
            "18:45",
            "45:5",
            "10:6",
            "16:65",
            "2:164",
            "30:24",
            "27:86",
            "13:17",
            "30:23"
        ],
        "BIBLE": [
            "writings:daniel:6:13",
            "prophets:isaiah:50:2",
            "prophets:ii%20samuel:21:10",
            "prophets:joshua:8:20",
            "prophets:amos:9:14",
            "prophets:joshua:1:8",
            "prophets:ezekiel:21:24",
            "prophets:judges:9:43",
            "prophets:ezekiel:26:20",
            "prophets:ezekiel:4:9"
        ]
    }
}