{
    "VERSE": "10:29",
    "ARABIC": "فَكَفَىٰ بِٱللَّهِ شَهِيدًۢا بَيْنَنَا وَبَيْنَكُمْ إِن كُنَّا عَنْ عِبَادَتِكُمْ لَغَٰفِلِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Allah is a sufficient witness between us and you. We were unaware of your worship.'",
        "TRANSLATION_1": "For God is sufficient as witness between us and you we were not aware of your worship.\"\n",
        "TRANSLATION_2": "Allah's witness suffices between you and us that (even if you worshipped us) we were totally unaware of your worshipping us.\n",
        "TRANSLATION_3": "God is Sufficient Witness for us that we were not aware of your worship\".\n",
        "TRANSLATION_4": "“Therefore Allah suffices as a Witness between us and you, that we were not even aware that you worshipped us!”\n",
        "TRANSLATION_5": "So sufficient is Allah as a witness between us and you that we indeed knew nothing of your worship of us.\"\n",
        "TRANSLATION_6": "Therefore Allah is sufficient as a witness between us and you that we were quite unaware of your serving (us).\n",
        "TRANSLATION_7": "God is a sufficient witness between us and you; assuredly we were heedless of your service.'\n",
        "TRANSLATION_8": "Allah sufficeth as a witness between us and you, that we were unaware of your worship.\n",
        "TRANSLATION_9": "God suffices as a witness between us and you. We were entirely unaware that you worshipped us.\"\n",
        "TRANSLATION_10": "And God sufficieth as witness between you and us, of your worship, we have been ever unaware.\n",
        "TRANSLATION_11": "Allah suffices as a witness between you and us. We were indeed unaware of your worship.’\n",
        "TRANSLATION_12": "Enough is Allah for a witness between us and you: we certainly knew nothing of your worship of us!\"\n",
        "TRANSLATION_13": "So sufficient is Allah for a witness between us and you, that We indeed knew nothing of your worship of us.\"\n",
        "TRANSLATION_14": "Allah is a Sufficient witness between us and you, surely, we were heedless of your worship.\n",
        "TRANSLATION_15": "“God is sufficient witness between us and you. We were unaware of your worshiping us.”\n",
        "TRANSLATION_16": "And sufficient is Allah as a witness between us and you that we were of your worship unaware.\"\n",
        "TRANSLATION_17": "[10:29] God suffices as a witness between us and you, that indeed (in is softened, so [read as] innā) we were unaware of your worship’.\n",
        "TRANSLATION_18": "The disbelievers answer back and say: \"you have indeed commanded us to worship\", at which point the idols respond: (Allah sufficeth as a witness between us and you, that we were unaware of your worship) we were ignorant of your worship of us.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "10:29",
            "17:96",
            "46:8",
            "37:169",
            "13:43",
            "76:6",
            "2:23",
            "6:58",
            "29:52",
            "4:118"
        ],
        "BIBLE": [
            "torah:deuteronomy:29:25",
            "writings:ii%20chronicles:12:8",
            "prophets:isaiah:43:10",
            "torah:numbers:8:24",
            "writings:job:42:3",
            "torah:numbers:4:4",
            "prophets:isaiah:44:8",
            "torah:genesis:29:27",
            "prophets:joshua:22:27",
            "torah:numbers:4:35"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:14",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:1"
        ]
    }
}