{
    "VERSE": "10:32",
    "ARABIC": "فَذَٰلِكُمُ ٱللَّهُ رَبُّكُمُ ٱلْحَقُّ فَمَاذَا بَعْدَ ٱلْحَقِّ إِلَّا ٱلضَّلَٰلُ فَأَنَّىٰ تُصْرَفُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "That is Allah, your Lord, the Truth, and what is there after truth except misguidance? So how have you been distracted?",
        "TRANSLATION_1": "Such then is God, your true Lord; and when truth is gone what is left but error? So why do you turn away?\n",
        "TRANSLATION_2": "Such, then, is Allah, your true Lord. And what is there after truth but error? How, then, are you being turned away?\n",
        "TRANSLATION_3": "Thus is God your true Lord. In the absence of truth there is nothing but falsehood. Then where are you turning?\n",
        "TRANSLATION_4": "So such is Allah, your True Lord; therefore what remains after the truth, except error? So where are you reverting?\n",
        "TRANSLATION_5": "Such is Allah, your Lord in truth. So after the truth, what else can there be, save error How then are you turned away\n",
        "TRANSLATION_6": "This then is Allah, your true Lord; and what is there after the truth but error; how are you then turned back?\n",
        "TRANSLATION_7": "That then is God, your Lord, the True; what is there, after truth, but error? Then how are you turned about?\n",
        "TRANSLATION_8": "Such then is Allah, your rightful Lord. After the Truth what is there saving error? How then are ye turned away!\n",
        "TRANSLATION_9": "That is God, your true Lord. What is there, besides the truth, but error? How then can you turn away?\"\n",
        "TRANSLATION_10": "Such is Allah, your rightful Lord. What then is there after the truth but error? Whither away then are ye drifting!\n",
        "TRANSLATION_11": "That, then, is Allah, your true Lord. So what is there after the truth except error? Then where are you being led away?\n",
        "TRANSLATION_12": "Such is Allah, your real Cherisher and Sustainer: apart from truth, what (remains) but error? How then are ye turned away?\n",
        "TRANSLATION_13": "Such is Allah, your Lord in truth. So after the truth, what else can there be, save error? How then are you turned away?\n",
        "TRANSLATION_14": "Such is Allah, your Lord, the True. What, is there after truth, anything except error. Then how are you turned around (from faith)'\n",
        "TRANSLATION_15": "Such is God, your Lord—the True. What is there, beyond the truth, except falsehood? How are you turned away?\n",
        "TRANSLATION_16": "For that is Allah, your Lord, the Truth. And what can be beyond truth except error? So how are you averted?\n",
        "TRANSLATION_17": "[10:32] That, Doer of all these things, then is God, your true, established, Lord: so what is there, after truth, except error? (the interrogative is meant as an affirmative, in other words, there is nothing after it [truth] other than that [error]; thus he who mistakes the truth, which is the worship of God, has fallen into error). How then are you turned away, from faith, despite the proofs having been established?\n",
        "TRANSLATION_18": "(Such then is Allah, your rightful Lord) the one who is able to do so is your Lord, Who is the Truth and whose worship is the Truth. (After the Truth what is there saving error) after worship of Allah what is your worship if not worship of the devil? (How then are ye turned away) from whence do you invent lies about Allah!\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "10:32",
            "40:62",
            "45:6",
            "23:116",
            "7:105",
            "2:64",
            "27:79",
            "22:12",
            "28:87",
            "81:29"
        ],
        "BIBLE": [
            "torah:numbers:22:26",
            "torah:deuteronomy:5:29",
            "prophets:ii%20samuel:2:19",
            "writings:song%20of%20songs:6:1",
            "prophets:jeremiah:50:6",
            "prophets:ezekiel:14:6",
            "prophets:ezekiel:1:12",
            "prophets:joel:2:14",
            "torah:genesis:18:22",
            "prophets:ezekiel:1:17"
        ]
    }
}