{
    "VERSE": "10:33",
    "ARABIC": "كَذَٰلِكَ حَقَّتْ كَلِمَتُ رَبِّكَ عَلَى ٱلَّذِينَ فَسَقُوٓا۟ أَنَّهُمْ لَا يُؤْمِنُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "In that way the Word of your Lord is realised against those who are deviators, in that they do not have iman.",
        "TRANSLATION_1": "Thus the word of your Lord about those who disobey comes true, that they do not believe.\n",
        "TRANSLATION_2": "Thus the word of your Lord is fulfilled concerning the transgressors that they shall not believe.\n",
        "TRANSLATION_3": "The decree of your Lord that the evil-doers will not have faith has already been issued.\n",
        "TRANSLATION_4": "This is how the Word of your Lord is proved concerning the sinful, so they will not believe.\n",
        "TRANSLATION_5": "Thus is the Word of your Lord justified against those who rebel (disobey Allah), that they will not believe.\n",
        "TRANSLATION_6": "Thus does the word of your Lord prove true against those who transgress that they do not believe.\n",
        "TRANSLATION_7": "Thus the word of thy Lord is realized against the ungodly that they believe not.\n",
        "TRANSLATION_8": "Thus is the Word of thy Lord justified concerning those who do wrong: that they believe not.\n",
        "TRANSLATION_9": "Thus the Word of your Lord is proved true against those who are disobedient. They will not believe.\n",
        "TRANSLATION_10": "In this wise is the word of thy Lord justified on those who transgress: that they shall not come to believe.\n",
        "TRANSLATION_11": "Thus the word of your Lord became due against those who transgress, that they shall not have faith.\n",
        "TRANSLATION_12": "Thus is the word of thy Lord proved true against those who rebel: Verily they will not believe.\n",
        "TRANSLATION_13": "Thus is the Word of your Lord justified against those who rebel (disobey Allah) that they will not believe (in the Oneness of Allah and in Muhammad SAW as the Messenger of Allah).\n",
        "TRANSLATION_14": "So the Word of your Lord is realized against the evildoers that they do not believe.\n",
        "TRANSLATION_15": "Thus your Lord’s Word proved true against those who disobeyed, for they do not believe.\n",
        "TRANSLATION_16": "Thus the word of your Lord has come into effect upon those who defiantly disobeyed - that they will not believe.\n",
        "TRANSLATION_17": "[10:33] Thus, just as those are turned away from faith so, the Word of your Lord is justified concerning those who are wicked, [those who] disbelieve, and this [Word] is [either] the verse, [Q. 32:13]‘Verily I shall fill Hell [with jinn and mankind, together]’, or it is [the following:] that they do not believe.\n",
        "TRANSLATION_18": "(Thus is the Word of your Lord) to impose His chastisement (justified) enjoined (concerning those who do wrong) concerning the disbelievers: (that they believe not) as it is in Allah's foreknowledge. 216\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "10:33",
            "10:96",
            "40:6",
            "23:59",
            "28:63",
            "16:42",
            "29:59",
            "2:46",
            "99:5",
            "10:40"
        ],
        "BIBLE": [
            "prophets:ii%20samuel:7:28",
            "prophets:i%20kings:13:21",
            "prophets:jeremiah:14:1",
            "prophets:jeremiah:46:1",
            "prophets:jeremiah:42:5",
            "torah:numbers:22:20",
            "prophets:jeremiah:13:12",
            "prophets:i%20kings:2:30",
            "prophets:i%20kings:17:2",
            "prophets:i%20kings:17:8"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:4"
        ]
    }
}