{
    "VERSE": "10:34",
    "ARABIC": "قُلْ هَلْ مِن شُرَكَآئِكُم مَّن يَبْدَؤُا۟ ٱلْخَلْقَ ثُمَّ يُعِيدُهُۥ قُلِ ٱللَّهُ يَبْدَؤُا۟ ٱلْخَلْقَ ثُمَّ يُعِيدُهُۥ فَأَنَّىٰ تُؤْفَكُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Say: 'Can any of your partner-gods bring creation out of nothing and then regenerate it?' Say: 'Allah brings creation out of nothing and then regenerates it. So how have you been perverted?'",
        "TRANSLATION_1": "Ask them: \"Is there among the partners (you ascribe to God) one who first originates then reverts it? Say: \"It is God alone who first creates and then reverts it. So where do you stray?\"\n",
        "TRANSLATION_2": "Ask them: 'Is there any among those whom you associate with Allah in His divinity who brings about the creation of all beings in the first instance and will then repeat it?' Tell them: 'It is Allah Who brings about the creation of all beings and will then repeat it. How are you, then, being misled?\n",
        "TRANSLATION_3": "(Muhammad), ask them,\"Can any of your idols create something (cause it to die), and then bring it back to life again?\" Say, \"Only God can originate the creation and bring it to life again. Where have you strayed?\"\n",
        "TRANSLATION_4": "Say, “Is there any one among your partners (false deities) that can create for the first time and then after its extinction, create it again?” Proclaim, “Allah creates for the first time and then after its extinction, creates it again – so where are you reverting?”\n",
        "TRANSLATION_5": "Say: \"Is there of your partners one that originates the creation and then repeats it\" Say: \"Allah originates the creation and then He repeats it. Then how are you deluded away (from the truth)\"\n",
        "TRANSLATION_6": "Say: Is there any one among your associates who can bring into existence the creation in the first instance, then reproduce it? Say: Allah brings the creation into existence, then He reproduces it; how are you then turned away?\n",
        "TRANSLATION_7": "Say: 'Is there any of your associates who originates creation, then brings it back again?' Say: 'God -- He originates creation, then brings it back again; so how are you perverted?'\n",
        "TRANSLATION_8": "Say: Is there of your partners (whom ye ascribe unto Allah) one that produceth Creation and then reproduceth it? Say: Allah produceth Creation, then reproduceth it. How then, are ye misled!\n",
        "TRANSLATION_9": "Ask then, \"Can any of your partner-gods originate creation, and then reproduce it?\" Say, \"It is God who originates creation and then restores it: how then are you so misled?\"\n",
        "TRANSLATION_10": "Say thou: is there any of your associate-gods who originateth the creation and then repeateth it? Say thou: Allah originateth the creation and then shall repeat it. Whither away then are ye deviating?\n",
        "TRANSLATION_11": "Say, ‘Is there anyone among your partners who originates the creation and then brings it back?’ Say, ‘Allah originates the creation, then He will bring it back.’ Then where do you stray?\n",
        "TRANSLATION_12": "Say: \"Of your 'partners', can any originate creation and repeat it?\" Say: \"It is Allah Who originates creation and repeats it: then how are ye deluded away (from the truth)?\"\n",
        "TRANSLATION_13": "Say: \"Is there of your (Allah's so-called) partners one that originates the creation and then repeats it?\" Say: \"Allah originates the creation and then He repeats it. Then how are you deluded away (from the truth)?\"\n",
        "TRANSLATION_14": "Say: 'Is there any (among) your associates who originates creation, then cause it to be revived yet again' Say: 'Allah, He originates creation, then revives it yet again. How is it that you are so perverted'\n",
        "TRANSLATION_15": "Say, “Can any of your partners initiate creation, and then repeat it?” Say, “God initiates creation, and then repeats it. How are you so deluded?”\n",
        "TRANSLATION_16": "Say, \"Are there of your 'partners' any who begins creation and then repeats it?\" Say, \"Allah begins creation and then repeats it, so how are you deluded?\"\n",
        "TRANSLATION_17": "[10:34] Say: ‘Is there of those whom you associate [with God] one that originates creation, then recreated it?’ Say: ‘God originates creation, then recreates it. How then are you deviated?’, turned away from worshipping Him, despite proof having been established.\n",
        "TRANSLATION_18": "(Say) to them, Muhammad: (Is there of your partners) your idols ((whom ye ascribe unto Allah) one that produceth Creation) from a sperm drop and imbues it with the spirit (and then reproduceth it) after death, on the Day of Judgement? If they answer you, fine, if not (Say: Allah produceth creation) from a sperm drop, (then reproduceth it) then brings back to life on the Day of Judgement. (How then, are ye misled) from whence do you invent lies; it is also said that this means: See, Muhammad, how they are misled by lies!\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "10:34",
            "30:11",
            "10:35",
            "30:40",
            "23:89",
            "31:11",
            "7:190",
            "43:87",
            "27:64",
            "2:223"
        ],
        "BIBLE": [
            "prophets:isaiah:42:17",
            "torah:deuteronomy:9:12",
            "prophets:i%20kings:20:39",
            "torah:genesis:42:28",
            "prophets:isaiah:12:1",
            "writings:daniel:9:13",
            "torah:genesis:38:16",
            "prophets:jeremiah:46:21",
            "torah:exodus:32:8",
            "prophets:ezekiel:3:20"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:4:8",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:4:1"
        ]
    }
}