{
    "VERSE": "10:36",
    "ARABIC": "وَمَا يَتَّبِعُ أَكْثَرُهُمْ إِلَّا ظَنًّا إِنَّ ٱلظَّنَّ لَا يُغْنِى مِنَ ٱلْحَقِّ شَيْـًٔا إِنَّ ٱللَّهَ عَلِيمٌۢ بِمَا يَفْعَلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Most of them follow nothing but conjecture. Conjecture is of no use whatsoever against the truth. Allah",
        "TRANSLATION_1": "Many of them follow nothing but illusion; yet illusion cannot replace the reality. God verily knows what they do.\n",
        "TRANSLATION_2": "Most of them only follow conjectures; and surely conjecture can be no substitute for truth. Allah is well aware of whatever they do.\n",
        "TRANSLATION_3": "Most of the unbelievers follow only conjecture which certainly cannot serve as a substitute for the Truth. God knows well what they do.\n",
        "TRANSLATION_4": "And most of them do not follow anything except assumptions; indeed assumption does not serve the least purpose (in place) of the truth; indeed Allah knows their deeds.\n",
        "TRANSLATION_5": "And most of them follow nothing but conjecture. Certainly, conjecture can be of no avail against the truth. Surely, Allah is All-Aware of what they do.\n",
        "TRANSLATION_6": "And most of them do not follow (anything) but conjecture; surely conjecture will not avail aught against the truth; surely Allah is cognizant of what they do.\n",
        "TRANSLATION_7": "And the most of them follow only surmise, and surmise avails naught against truth. Surely God knows the things they do.\n",
        "TRANSLATION_8": "Most of them follow not but conjecture. Assuredly conjecture can by no means take the place of truth. Lo! Allah is Aware of what they do.\n",
        "TRANSLATION_9": "Most of them follow nothing but mere conjecture. But conjecture is of no use against the Truth. God is well aware of what they do.\n",
        "TRANSLATION_10": "And most of them follow naught but an opinion; verily opinion availeth not against the truth; verily Allah is the Knower of that which they do.\n",
        "TRANSLATION_11": "Most of them just follow conjecture; indeed conjecture is no substitute for the truth. Indeed Allah knows best what they do.\n",
        "TRANSLATION_12": "But most of them follow nothing but fancy: truly fancy can be of no avail against truth. Verily Allah is well aware of all that they do.\n",
        "TRANSLATION_13": "And most of them follow nothing but conjecture. Certainly, conjecture can be of no avail against the truth. Surely, Allah is All-Aware of what they do.\n",
        "TRANSLATION_14": "Most of them follow nothing except conjecture. But conjecture does not help against the truth. Allah knows the things they do.\n",
        "TRANSLATION_15": "Most of them follow nothing but assumptions; and assumptions avail nothing against the truth. God is fully aware of what they do.\n",
        "TRANSLATION_16": "And most of them follow not except assumption. Indeed, assumption avails not against the truth at all. Indeed, Allah is Knowing of what they do.\n",
        "TRANSLATION_17": "[10:36] And most of them, in worshipping idols, follow nothing but conjecture, since they imitate their fathers therein; truly conjecture avails nothing against truth, when what is sought is knowledge. Surely God is Knower of what they do, and will requite them for it.\n",
        "TRANSLATION_18": "(Most of them follow) worship (naught but conjecture) i.e. except through conjecture. (Assuredly conjecture) their worship through conjecture (can by no means take the place of truth) can by no means dispense them from Allah's chastisement. (Lo! Allah is Aware of what they do) in their state of idolatry, in terms of worshipping idols, and other things.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "10:36",
            "53:28",
            "40:20",
            "44:39",
            "45:32",
            "16:101",
            "16:38",
            "12:106",
            "12:68",
            "29:62"
        ],
        "BIBLE": [
            "torah:deuteronomy:12:2",
            "torah:deuteronomy:7:4",
            "writings:job:18:21",
            "writings:psalms:38:21",
            "torah:deuteronomy:12:30",
            "prophets:i%20samuel:12:14",
            "torah:deuteronomy:12:26",
            "writings:daniel:11:38",
            "writings:ii%20chronicles:34:33",
            "prophets:jeremiah:5:1"
        ]
    }
}