{
    "VERSE": "10:4",
    "ARABIC": "إِلَيْهِ مَرْجِعُكُمْ جَمِيعًا وَعْدَ ٱللَّهِ حَقًّا إِنَّهُۥ يَبْدَؤُا۟ ٱلْخَلْقَ ثُمَّ يُعِيدُهُۥ لِيَجْزِىَ ٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّٰلِحَٰتِ بِٱلْقِسْطِ وَٱلَّذِينَ كَفَرُوا۟ لَهُمْ شَرَابٌ مِّنْ حَمِيمٍ وَعَذَابٌ أَلِيمٌۢ بِمَا كَانُوا۟ يَكْفُرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Each and every one of you will return to Him. Allah's promise is true. He brings creation out of nothing and then regenerates it so that he can repay with justice those who had iman and did right actions. Those who were kafir will have a drink of scalding water and a painful punishment because of their kufr.",
        "TRANSLATION_1": "To Him will you all return: God's promise is true. It is He who originates creation, then will revert it, so that He may reward those who believe and do good things in all justice. But those who deny the truth will receive boiling water to drink and grievous punishment, for they disbelieved.\n",
        "TRANSLATION_2": "To Him is your return. This is Allah's promise that will certainly come true. Surely it is He Who brings about the creation of all and He will repeat it so that He may justly reward those who believe and do righteous deeds; and that those who disbelieve may have a draught of boiling water and suffer a painful chastisement for their denying the truth.\n",
        "TRANSLATION_3": "People, you will all return to God. The promise of God is true; He creates all things and (after their death) brings them to life again so that He may justly reward the righteously striving believers. The disbelievers will drink boiling filthy water and suffer painful torment as a recompense for their disbelief.\n",
        "TRANSLATION_4": "Towards Him only you all are to return; the promise of Allah; indeed He creates for the first time and then after its extinction creates it again, in order to give those who believe and do good deeds, the reward of justice; and for the disbelievers, boiling water to drink and a painful punishment – the recompense of their disbelief.\n",
        "TRANSLATION_5": "To Him is the return of all of you. The promise of Allah is true. It is He Who begins the creation and then will repeat it, that He may reward with justice those who believed and did deeds of righteousness. But those who disbelieved will have a drink of boiling fluids and painful torment because they used to disbelieve.\n",
        "TRANSLATION_6": "To Him is your return, of all (of you); the promise of Allah (made) in truth; surely He begins the creation in the first instance, then He reproduces it, that He may with justice recompense those who believe and do good; and (as for) those who disbelieve, they shall have a drink of hot water and painful punishment because they disbelieved.\n",
        "TRANSLATION_7": "To Him shall you return, all together -- God's promise, in truth. He originates creation, then He brings it back again that He may recompense those who believe and do deeds of righteousness, justly. And those who disbelieve -- for them awaits a draught of boiling water, and a painful chastisement, for their disbelieving.\n",
        "TRANSLATION_8": "Unto Him is the return of all of you; it is a promise of Allah in truth. Lo! He produceth creation, then reproduceth it, that He may reward those who believe and do good works with equity; while, as for those who disbelieve, theirs will be a boiling drink and painful doom because they disbelieved.\n",
        "TRANSLATION_9": "To Him you shall all return. God's promise is true; He originates Creation, then He restores it, so that He may reward with justice those who believe and do good works. Those who have denied the truth shall have boiling water to drink, and a painful punishment, because of their denial.\n",
        "TRANSLATION_10": "Unto Him is the return of you all--the promise of Allah is truth. Verily He beginneth the creation, then He shall repeat it, that he may recompense those who believed and did righteous works with equity. And those who disbelieved -- for them shall be draught of boiling water and a torment afflictive for they were wont to disbelieve.\n",
        "TRANSLATION_11": "To Him will be the return of you all; [that is] Allah’s true promise. Indeed, He originates the creation, then He will bring it back that He may reward with justice those who have faith and do righteous deeds. As for the faithless, they shall have boiling water for drink, and a painful punishment because of what they used to defy.\n",
        "TRANSLATION_12": "To Him will be your return- of all of you. The promise of Allah is true and sure. It is He Who beginneth the process of creation, and repeateth it, that He may reward with justice those who believe and work righteousness; but those who reject Him will have draughts of boiling fluids, and a penalty grievous, because they did reject Him.\n",
        "TRANSLATION_13": "To Him is the return of all of you. The Promise of Allah is true. It is He Who begins the creation and then will repeat it, that He may reward with justice those who believed (in the Oneness of Allah - Islamic Monotheism) and did deeds of righteousness. But those who disbelieved will have a drink of boiling fluids and painful torment because they used to disbelieve.\n",
        "TRANSLATION_14": "To Him all of you will return together. This is, in truth, the promise of Allah. He originates creation, then He revives it so that He may recompense those who believe and do righteous deeds. As for the unbelievers, theirs is a drink of boiling water and a painful punishment for their disbelief.\n",
        "TRANSLATION_15": "To Him is your return, altogether. The promise of God is true. He originates creation, and then He repeats it, to reward those who believe and do good deeds with equity. As for those who disbelieve, for them is a drink of boiling water, and agonizing torment, on account of their disbelief.\n",
        "TRANSLATION_16": "To Him is your return all together. [It is] the promise of Allah [which is] truth. Indeed, He begins the [process of] creation and then repeats it that He may reward those who have believed and done righteous deeds, in justice. But those who disbelieved will have a drink of scalding water and a painful punishment for what they used to deny.\n",
        "TRANSLATION_17": "[10:4] To Him, exalted be He, is the return of all of you: God’s promise, in truth (both [wa‘da and haqqan] are verbal nouns, and in the accusative because of the verbs implicit in them). Truly He (read innahu as a new sentence, or annahu with an implied lām [sc. li-annahu, ‘Because He’] originates creation, that is, He began it by originating [it], then recreates it, through resurrection, that He may requite, reward, those who believe and perform righteous deeds, justly. And those who disbelieve, for them will be a draught of boiling water and a painful chastisement because they disbelieved.\n",
        "TRANSLATION_18": "(Unto Him is the return of all of you) after death; (it is a promise of Allah in truth) this is the Truth which will surely take place. (Lo! He produceth creation) from a sperm drop, (then reproduces it) after death, (that He may reward those who believe) in Muhammad (pbuh) and in the Qur'an (and do good works) between themselves and their Lord (with equity) with justice: [i.e. they will earn as a reward] Paradise; (while, as for those who disbelieve) in Muhammad (pbuh) and in the Qur'an, (theirs will be a boiling drink and painful doom) whose pain will reach to their hearts (because they disbelieved) in Muhammad (pbuh) and in the Qur'an.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "10:4",
            "3:21",
            "9:90",
            "14:22",
            "22:54",
            "29:23",
            "16:104",
            "40:20",
            "9:79",
            "24:19"
        ],
        "BIBLE": [
            "prophets:zechariah:8:8",
            "prophets:jeremiah:5:3",
            "prophets:ezekiel:47:9",
            "torah:genesis:34:7",
            "writings:i%20chronicles:11:19",
            "prophets:joshua:20:6",
            "writings:ii%20chronicles:5:1",
            "prophets:ezekiel:46:9",
            "writings:ezra:10:6",
            "writings:ecclesiastes:2:17"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:2:1"
        ]
    }
}