{
    "VERSE": "10:40",
    "ARABIC": "وَمِنْهُم مَّن يُؤْمِنُ بِهِۦ وَمِنْهُم مَّن لَّا يُؤْمِنُ بِهِۦ وَرَبُّكَ أَعْلَمُ بِٱلْمُفْسِدِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Among them there are some who have iman in it and some who do not. Your Lord best knows the corrupters.",
        "TRANSLATION_1": "Some of them will believe in it, some will not. Your Lord knows the transgressors well.\n",
        "TRANSLATION_2": "Of those some will believe and others will not. Your Lord knows best the mischief-makers.\n",
        "TRANSLATION_3": "Some of them believe in the Quran and others do not. Your Lord knows best the evil doers.\n",
        "TRANSLATION_4": "And among them is one who accepts faith in it, and among them is one who does not accept faith in it; and your Lord well knows the mischievous.\n",
        "TRANSLATION_5": "And of them there are some who believe therein; and of them there are some who believe not therein, and your Lord is All-Aware of the mischief-makers.\n",
        "TRANSLATION_6": "And of them is he who believes in it, and of them is he who does not believe in it, and your Lord best knows the mischief-makers.\n",
        "TRANSLATION_7": "And some of them believe in it, and some believe not in it. Thy Lord knows very well those who do corruption.\n",
        "TRANSLATION_8": "And of them is he who believeth therein, and of them is he who believeth not therein, and thy Lord is Best Aware of the corrupters.\n",
        "TRANSLATION_9": "Some of them will believe in it [the Quran], while others will not. And your Lord is fully aware of the evil-doers.\n",
        "TRANSLATION_10": "And of them are some who will believe therein, and of them are some who will not believe therein; and thy Lord is the Best Knower of the corrupters.\n",
        "TRANSLATION_11": "Some of them believe in it, and some of them do not believe in it, and your Lord best knows the agents of corruption.\n",
        "TRANSLATION_12": "Of them there are some who believe therein, and some who do not: and thy Lord knoweth best those who are out for mischief.\n",
        "TRANSLATION_13": "And of them there are some who believe therein, and of them there are some who believe not therein, and your Lord is All-Aware of the Mufsidun (evil-doers, liars, etc.).\n",
        "TRANSLATION_14": "Some believe in it, while others do not believe it. Your Lord knows well the corrupters.\n",
        "TRANSLATION_15": "Among them are those who believe in it, and among them are those who do not believe in it. Your Lord is fully aware of the mischief-makers.\n",
        "TRANSLATION_16": "And of them are those who believe in it, and of them are those who do not believe in it. And your Lord is most knowing of the corrupters\n",
        "TRANSLATION_17": "[10:40] And of them, that is, [of] the people of Mecca, are some who believe in it, God being aware of this in their case, and some who would never believe therein. And your Lord knows very well the corrupters: this is a threat for them.\n",
        "TRANSLATION_18": "(And of them) of the Jews (is he who believeth therein) he who believes in Muhammad (pbuh) and the Qur'an, i.e. before his death, (and of them) of the Jews (is he who believeth not therein) does not believe in 217 Muhammad (pbuh) or in the Qur'an and dies in a state of disbelief, (and your Lord is best aware of the corrupters) of the Jews, and of those who believe and those who do not believe; it is also said that this verse was revealed about the idolaters.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "10:40",
            "6:117",
            "7:121",
            "26:47",
            "26:188",
            "53:30",
            "11:47",
            "23:59",
            "56:80",
            "69:43"
        ],
        "BIBLE": [
            "prophets:hosea:14:10",
            "prophets:malachi:1:9",
            "prophets:hosea:2:22",
            "writings:psalms:51:5",
            "prophets:jeremiah:29:11",
            "prophets:joshua:22:22",
            "writings:psalms:9:11",
            "torah:exodus:9:30",
            "prophets:i%20samuel:20:13",
            "prophets:ezekiel:6:10"
        ]
    }
}