{
    "VERSE": "10:44",
    "ARABIC": "إِنَّ ٱللَّهَ لَا يَظْلِمُ ٱلنَّاسَ شَيْـًٔا وَلَٰكِنَّ ٱلنَّاسَ أَنفُسَهُمْ يَظْلِمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Allah does not wrong people in any way; rather it is people who wrong themselves.",
        "TRANSLATION_1": "Surely God does not wrong anyone; they wrong themselves.\n",
        "TRANSLATION_2": "Surely Allah does not wrong men; they rather wrong themselves.\n",
        "TRANSLATION_3": "God does not do the least bit of injustice to anyone but people wrong themselves.\n",
        "TRANSLATION_4": "Indeed Allah does not oppress men at all, but they do wrong themselves.\n",
        "TRANSLATION_5": "Truly, Allah wrongs not mankind in aught; but mankind wrong themselves.\n",
        "TRANSLATION_6": "Surely Allah does not do any injustice to men, but men are unjust to themselves.\n",
        "TRANSLATION_7": "Surely God wrongs not men anything, but themselves men wrong.\n",
        "TRANSLATION_8": "Lo! Allah wrongeth not mankind in aught; but mankind wrong themselves.\n",
        "TRANSLATION_9": "Surely, God does not wrong people at all, but people wrong themselves.\n",
        "TRANSLATION_10": "Verily Allah wrongeth not mankind in aught but mankind wrong themselves.\n",
        "TRANSLATION_11": "Indeed Allah does not wrong people in the least; rather, it is people who wrong themselves.\n",
        "TRANSLATION_12": "Verily Allah will not deal unjustly with man in aught: It is man that wrongs his own soul.\n",
        "TRANSLATION_13": "Truly! Allah wrongs not mankind in aught; but mankind wrong themselves.\n",
        "TRANSLATION_14": "Indeed, Allah does not wrong mankind a thing, but they wrong themselves.\n",
        "TRANSLATION_15": "God does not wrong the people in the least, but the people wrong their own selves.\n",
        "TRANSLATION_16": "Indeed, Allah does not wrong the people at all, but it is the people who are wronging themselves.\n",
        "TRANSLATION_17": "[10:44] Verily God does not wrong mankind in any way, but mankind wrong themselves.\n",
        "TRANSLATION_18": "(Lo! Allah wrongeth not mankind in aught) He neither decreases their good works nor increases their evil deeds; (but mankind wrong themselves) through disbelief, idolatry and transgressions.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "10:44",
            "12:68",
            "82:19",
            "30:6",
            "16:20",
            "45:19",
            "3:5",
            "59:19",
            "22:73",
            "110:2"
        ],
        "BIBLE": [
            "writings:proverbs:29:27",
            "writings:proverbs:28:5",
            "torah:leviticus:7:21",
            "writings:job:33:29",
            "prophets:ezekiel:22:25",
            "prophets:jeremiah:7:23",
            "torah:leviticus:27:29",
            "writings:i%20chronicles:16:26",
            "writings:psalms:96:5",
            "prophets:i%20samuel:30:6"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:3:6",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:12"
        ]
    }
}