{
    "VERSE": "10:46",
    "ARABIC": "وَإِمَّا نُرِيَنَّكَ بَعْضَ ٱلَّذِى نَعِدُهُمْ أَوْ نَتَوَفَّيَنَّكَ فَإِلَيْنَا مَرْجِعُهُمْ ثُمَّ ٱللَّهُ شَهِيدٌ عَلَىٰ مَا يَفْعَلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Whether We show you something of what We have promised them or take you back to Us, they will still return to Us. Then Allah will be witness against what they are doing.",
        "TRANSLATION_1": "Whether We show you some of the promise (of punishment in wait) for them, or take you to Ourself, their returning is to Us in the end; and God is a witness to all they do.\n",
        "TRANSLATION_2": "Whether We let you see (during your lifetime) some of the chastisement with which We threaten them, or We call you unto Us (before the chastisement strikes them), in any case they are bound to return to Us. Allah is witness to all what they do.\n",
        "TRANSLATION_3": "When if We show you them suffering Our retribution or you die before their suffering, (they will not be able to escape Our punishment) they will all return to Us. God bears witness to whatever they do.\n",
        "TRANSLATION_4": "And whether We show you (O dear Prophet Mohammed – peace and blessings be upon him) part of what We promise them or whether We call you towards Us before it – in any case they have to return to Us – then Allah is the Witness of their deeds.\n",
        "TRANSLATION_5": "Whether We show you some of what We promise them (the torment), or We cause you to die -- still unto Us is their return, and moreover Allah is Witness over what they used to do.\n",
        "TRANSLATION_6": "And if We show you something of what We threaten them with, or cause you to die, yet to Us is their return, and Allah is the bearer of witness to what they do.\n",
        "TRANSLATION_7": "Whether We show thee a part of that We promise them, or We call thee unto Us, to Us they shall return; then God is witness of the things they do\n",
        "TRANSLATION_8": "Whether We let thee (O Muhammad) behold something of that which We promise them or (whether We) cause thee to die, still unto Us is their return, and Allah, moreover, is Witness over what they do.\n",
        "TRANSLATION_9": "Whether We show you something of what We have promised them or cause you to die [before that], to Us they shall return. God is Witness to all that they do.\n",
        "TRANSLATION_10": "And whether We shew thee soome of that which We have promised them, or We cause thee to die, Unto us is their return, and Allah is witness of that which they do.\n",
        "TRANSLATION_11": "Whether We show you a part of what We promise them, or take you away [before that], [in any case] their return will be to Us and Allah will be witness to what they do.\n",
        "TRANSLATION_12": "Whether We show thee (realised in thy life-time) some part of what We promise them,- or We take thy soul (to Our Mercy) (Before that),- in any case, to Us is their return: ultimately Allah is witness, to all that they do.\n",
        "TRANSLATION_13": "Whether We show you (in your lifetime, O Muhammad SAW) some of what We promise them (the torment), - or We cause you to die, - still unto Us is their return, and moreover Allah is Witness over what they used to do.\n",
        "TRANSLATION_14": "Whether We let you see some of that with which We promised them, or We call you to Us, to Us they shall return. Allah is witness of the things they do.\n",
        "TRANSLATION_15": "Whether We show you some of what We promise them, or take you, to Us is their return. God is witness to everything they do.\n",
        "TRANSLATION_16": "And whether We show you some of what We promise them, [O Muhammad], or We take you in death, to Us is their return; then, [either way], Allah is a witness concerning what they are doing\n",
        "TRANSLATION_17": "[10:46] And whether (wa-immā: the nūn of the conditional particle in has been assimiliated with the extra mā) We show you something of that which We promise them, of chastisement, during your lifetime (the response to the conditional statement has been omitted, in other words [understand it as being] fa-dhāka, ‘then so shall it be’), or We take you [to Us], before punishing them, to Us they shall return, and God, moreover, is Witness, Aware, of what they do, in the way of their denials and disbelief, and so will chastise them with the severest punishment.\n",
        "TRANSLATION_18": "(Whether We let thee) O Muhammad (behold something of that which We promise them) of chastisement (or (whether We) cause thee to die) before We show you, O Muhammad, that which We promise them of chastisement, (still unto Us is their return) after they die, (and Allah, moreover, is Witness over what they do) of good and evil.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "10:46",
            "40:77",
            "2:76",
            "13:40",
            "9:67",
            "31:23",
            "10:29",
            "47:26",
            "29:11",
            "24:13"
        ],
        "BIBLE": [
            "torah:deuteronomy:4:30",
            "prophets:ezekiel:18:23",
            "prophets:joshua:23:14",
            "writings:psalms:6:5",
            "torah:numbers:4:15",
            "writings:psalms:116:7",
            "prophets:jeremiah:42:4",
            "prophets:zechariah:1:4",
            "prophets:i%20samuel:26:25",
            "prophets:ii%20samuel:17:3"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:10"
        ]
    }
}