{
    "VERSE": "10:51",
    "ARABIC": "أَثُمَّ إِذَا مَا وَقَعَ ءَامَنتُم بِهِۦٓ ءَآلْـَٰٔنَ وَقَدْ كُنتُم بِهِۦ تَسْتَعْجِلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "And then, when it actually comes about: 'Now do you have iman in it? It was this that you were trying to hasten!'",
        "TRANSLATION_1": "Will you believe it when it comes to pass? Indeed, you will believe it then. How impatient you were to hasten it!\n",
        "TRANSLATION_2": "Is it only when this chastisement has actually overtaken you that you will believe in it? (And when the chastisement will surprise you), you will try to get away from it, although it is you who had sought to hasten its coming.'\n",
        "TRANSLATION_3": "Besides, if He was to send them the punishment which they want to quickly experience, would they then have faith?\n",
        "TRANSLATION_4": "“So will you believe it only when it has occurred? What! You believe in it now, whereas you were impatient* for it before? (* Eagerly demanding for it to occur.)\n",
        "TRANSLATION_5": "Is it then that when it has actually befallen, you will believe in it What! Now (you believe) And you used (aforetime) to hasten it on!\"\n",
        "TRANSLATION_6": "And when it comes to pass, will you believe in it? What! now (you believe), and already you wished to have it hastened on.\n",
        "TRANSLATION_7": "What, when it has come to pass, will you then believe in it? Now, when already you seek to hasten it!'\n",
        "TRANSLATION_8": "Is it (only) then, when it hath befallen you, that ye will believe? What! (Believe) now, when (until now) ye have been hastening it on (through disbelief)?\n",
        "TRANSLATION_9": "Will you believe in it only after it has overtaken you, although it was your wish to hurry it on?\"\n",
        "TRANSLATION_10": "Is It, then, when it hath befallen, that ye will believe therein Now?- whereas ye have surely been hastening it On.\n",
        "TRANSLATION_11": "‘What! Do you believe it when it has befallen? Now? While you would seek to hasten it [earlier]?!’\n",
        "TRANSLATION_12": "Would ye then believe in it at last, when it actually cometh to pass? (It will then be said): 'Ah! now? and ye wanted (aforetime) to hasten it on!'\n",
        "TRANSLATION_13": "Is it then, that when it has actually befallen, that you will believe in it? What! Now (you believe)? And you used (aforetime) to hasten it on!\"\n",
        "TRANSLATION_14": "And when it overtakes you, is it then that you will believe in it, now, when you already try to hasten it!\n",
        "TRANSLATION_15": "“Then, when it falls, will you believe in it? Now? When before you tried to hasten it?”\n",
        "TRANSLATION_16": "Then is it that when it has [actually] occurred you will believe in it? Now? And you were [once] for it impatient\n",
        "TRANSLATION_17": "[10:51] Is it [only] then, when it has come to pass, [when] it has befallen you, that you will believe therein?, that is, in God, or [it means] in the chastisement, when it has come down (the [use of] hamza [in a-thumma, ‘is it then’] is to deny [the possibility of] deferrment [of chastisement], in other words, it [your belief] will not be accepted from you [in that instance] and it will be said to you: Now, do you believe, when [until now] you have been hastening it on?’, in mockery [of it].\n",
        "TRANSLATION_18": "Say to them, Muhammad: (Is it (only) then, when it hath befallen you) when the punishment has befallen you, (that you will believe?) They said: \"Yes!\" Say to them, Muhammad, that it is said to them: (What! (Believe) now) in the punishment, (when (until now) ye have been hastening it) the punishment (on (through disbelief)) out of mockery?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "10:51",
            "26:132",
            "85:7",
            "26:92",
            "40:73",
            "10:91",
            "83:30",
            "37:95",
            "15:24",
            "26:114"
        ],
        "BIBLE": [
            "writings:ruth:1:19",
            "prophets:ii%20samuel:17:21",
            "prophets:nahum:3:7",
            "prophets:i%20samuel:16:6",
            "torah:genesis:29:25",
            "prophets:isaiah:14:24",
            "prophets:jeremiah:5:19",
            "prophets:jeremiah:36:16",
            "torah:genesis:46:33",
            "writings:esther:6:13"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:5:1"
        ]
    }
}