{
    "VERSE": "10:53",
    "ARABIC": "وَيَسْتَنۢبِـُٔونَكَ أَحَقٌّ هُوَ قُلْ إِى وَرَبِّىٓ إِنَّهُۥ لَحَقٌّ وَمَآ أَنتُم بِمُعْجِزِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "They will ask you to tell them if this is true. Say: 'Yes indeed, by my Lord, it certainly is true and you can do nothing to prevent it.'",
        "TRANSLATION_1": "Yet they want to be informed if it is true. Say: \"By my Lord, it is the truth. You cannot invalidate it.\"\n",
        "TRANSLATION_2": "They ask you if what you say is true? Tell them: 'Yes, by my Lord, this is altogether true, and you have no power to prevent the chastisement from befalling.'\n",
        "TRANSLATION_3": "They ask you, \"Is that (punishment) true?\" Tell them, \"It certainly is. I swear by my Lord. You can not escape from (God's retribution)\".\n",
        "TRANSLATION_4": "And they ask you “Is it a reality*?” Say, “Yes, by oath of my Lord, indeed surely it is a reality, and you will not be able to escape.” (* The punishment of the hereafter.)\n",
        "TRANSLATION_5": "And they ask you to inform them (saying): \"Is it true\" Say: \"Yes! By my Lord! It is the very truth! And you cannot escape it!\"\n",
        "TRANSLATION_6": "And they ask you: Is that true? Say: Aye! by my Lord! it is most surely the truth, and you will not escape.\n",
        "TRANSLATION_7": "They ask thee to tell them, 'Is it true?' Say: 'Yes, by my Lord! It is true; you cannot frustrate Him.'\n",
        "TRANSLATION_8": "And they ask thee to inform them (saying): Is it true? Say: Yea, by my Lord, verily it is true, and ye cannot escape.\n",
        "TRANSLATION_9": "They enquire of you if this will really happen. Tell them, \"Yes, by my Lord. Most certainly it will happen, and you cannot avert it.\"\n",
        "TRANSLATION_10": "And they ask thee to tell them if it be-true. Say thou: yeal by my Lord, It, Is the veary truth, and ye shall not be able to escape.\n",
        "TRANSLATION_11": "They inquire of you, ‘Is it true?’ Say, ‘Yes! By my Lord, it is true, and you cannot frustrate [Him].’\n",
        "TRANSLATION_12": "They seek to be informed by thee: \"Is that true?\" Say: \"Aye! by my Lord! it is the very truth! and ye cannot frustrate it!\"\n",
        "TRANSLATION_13": "And they ask you (O Muhammad SAW) to inform them (saying): \"Is it true (i.e. the torment and the establishment of the Hour; - the Day of Resurrection)?\" Say: \"Yes! By my Lord! It is the very truth! and you cannot escape from it!\"\n",
        "TRANSLATION_14": "They ask you to tell them if it is true. Say: 'Yes, by my Lord! It is true, and you cannot frustrate it'\n",
        "TRANSLATION_15": "And they inquire of you, “Is it true?” Say, “Yes, by my Lord, it is true, and you cannot evade it.”\n",
        "TRANSLATION_16": "And they ask information of you, [O Muhammad], \"Is it true?\" Say, \"Yes, by my Lord. Indeed, it is truth; and you will not cause failure [to Allah].\"\n",
        "TRANSLATION_17": "[10:53] And they ask you to tell, to inform, them, ‘Is it true?’, that which you promise us in the way of chastisement and resurrection? Say: ‘Aye, indeed, by my Lord! Verily it is true and you cannot escape’, [you cannot] elude   the chastisement.\n",
        "TRANSLATION_18": "(And they ask thee) O Muhammad (to inform them) i.e. about the punishment and the Qur'an ((saying): Is it true) i.e. the punishment and the Qur'an? (Say: Yea, by my Lord) say: yes, by my Lord, (verily it is true) the punishment will truly happen, (and ye cannot escape) Allah's punishment.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "10:53",
            "15:64",
            "28:53",
            "72:20",
            "23:90",
            "93:3",
            "2:147",
            "6:30",
            "44:20",
            "11:79"
        ],
        "BIBLE": [
            "prophets:joshua:14:9",
            "prophets:ii%20kings:20:19",
            "torah:deuteronomy:8:18",
            "prophets:i%20kings:1:30",
            "prophets:i%20kings:8:28",
            "torah:deuteronomy:34:4",
            "writings:ii%20chronicles:20:6",
            "prophets:i%20samuel:28:10",
            "prophets:ii%20samuel:7:25",
            "torah:deuteronomy:27:9"
        ]
    }
}