{
    "VERSE": "10:59",
    "ARABIC": "قُلْ أَرَءَيْتُم مَّآ أَنزَلَ ٱللَّهُ لَكُم مِّن رِّزْقٍ فَجَعَلْتُم مِّنْهُ حَرَامًا وَحَلَٰلًا قُلْ ءَآللَّهُ أَذِنَ لَكُمْ أَمْ عَلَى ٱللَّهِ تَفْتَرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Say: 'What do you think about the things Allah has sent down to you as provision which you have then designated as halal and haram?' Say: 'Has Allah given you authority to do this or are you inventing lies against Allah?'",
        "TRANSLATION_1": "Say: \"Have you thought of what God has sent you for food, of which you have labelled some as lawful and some forbidden?\" And ask: \"Has God commanded this, or you are imputing lies to God?\"\n",
        "TRANSLATION_2": "Did you consider that the sustenance which Allah had sent down for you of your own accord you have declared some of it as unlawful and some as lawful? Ask them: 'Did Allah bestow upon you any authority for this or do you forge lies against Allah?\n",
        "TRANSLATION_3": "Ask them, \"Have you considered that out of the sustenance which God has given you, you made some of it lawful and some unlawful? Did God permit you to do this or are you ascribing falsehood to Him?\"\n",
        "TRANSLATION_4": "Say, “What is your opinion – (regarding) the sustenance that Allah has sent down for you? So you have, on your own, deemed lawful and unlawful in it!”; say, “Has Allah given you permission for it, or do you fabricate a lie against Allah?”\n",
        "TRANSLATION_5": "Say: \"Tell me, what provision Allah has sent down to you! And you have made of it lawful and unlawful.\" Say: \"Has Allah permitted you (to do so), or do you invent a lie against Allah\"\n",
        "TRANSLATION_6": "Say: Tell me what Allah has sent down for you of sustenance, then you make (a part) of it unlawful and (a part) lawful. Say: Has Allah commanded you, or do you forge a lie against Allah?\n",
        "TRANSLATION_7": "Say: 'Have you considered the provision God has sent down for you, and you have made some of it unlawful, and some lawful?' Say: 'Has God given you leave, or do you forge against God?'\n",
        "TRANSLATION_8": "Say: Have ye considered what provision Allah hath sent down for you, how ye have made of it lawful and unlawful? Hath Allah permitted you, or do ye invent a lie concerning Allah?\n",
        "TRANSLATION_9": "Say, \"Have you considered the provision God has sent down for you, and have you made some of it unlawful and some lawful?\" Say, \"Has God given you permission [to do this], or are you inventing falsehoods about God?\"\n",
        "TRANSLATION_10": "Say thou: bethink ye of that which Allah hath sent down unto you of provision, and ye have then made thereof allowable and forbidden? Say thou: is it that Allah hath given you leave, or fabricate ye a lie against Allah?\n",
        "TRANSLATION_11": "Say, ‘Have you regarded what Allah has sent down for you of [His] provision, whereupon you have made some of it unlawful and [some] lawful?’ Say, ‘Did Allah give you the sanction [to do so], or do you fabricate a lie against Allah?’\n",
        "TRANSLATION_12": "Say: \"See ye what things Allah hath sent down to you for sustenance? Yet ye hold forbidden some things thereof and (some things) lawful.\" Say: \"Hath Allah indeed permitted you, or do ye invent (things) to attribute to Allah?\"\n",
        "TRANSLATION_13": "Say (O Muhammad SAW to these polytheists): \"Tell me, what provision Allah has sent down to you! And you have made of it lawful and unlawful.\" Say (O Muhammad SAW): \"Has Allah permitted you (to do so), or do you invent a lie against Allah?\"\n",
        "TRANSLATION_14": "Say: 'Have you considered the provision that Allah has sent down for you, and some you have made unlawful and some lawful' Say: 'Has Allah given you His permission, or do you forge (falsehood) against Allah'\n",
        "TRANSLATION_15": "Say, “Have you considered the sustenance God has sent down for you, some of which you made unlawful, and some lawful?” Say, “Did God give you permission, or do you fabricate lies and attribute them to God?”\n",
        "TRANSLATION_16": "Say, \"Have you seen what Allah has sent down to you of provision of which you have made [some] lawful and [some] unlawful?\" Say, \"Has Allah permitted you [to do so], or do you invent [something] about Allah?\"\n",
        "TRANSLATION_17": "[10:59] Say: ‘Have you considered, inform me, what provision God has revealed, has created, for you, how you have made some of it unlawful and some lawful?’, as in the case of [the camels called] al-Bahīra or al-Sā’iba, and carrion. Say: ‘Has God given you permission, to make that lawful or unlawful? No! Or do you, nay [you], invent lies concerning God?’, by attributing that to Him.\n",
        "TRANSLATION_18": "(Say) Muhammad, to the people of Mecca: (Have ye considered what provision) what crops and cattle (Allah hath sent down for you) Allah has created for you, (how ye have made of it lawful) for men (and unlawful) for women: i.e. the benefit of al-Bahirah, al-Sa'ibah and al-Ham? (Say) to them, Muhammad: (Hath Allah permitted you) has Allah commanded this, (or do ye invent a lie concerning Allah) indeed you are inventing lies?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "10:59",
            "5:88",
            "16:116",
            "16:19",
            "33:31",
            "16:114",
            "8:69",
            "11:88",
            "39:37",
            "36:47"
        ],
        "BIBLE": [
            "writings:ii%20chronicles:14:6",
            "torah:leviticus:10:17",
            "torah:deuteronomy:26:13",
            "torah:genesis:3:6",
            "prophets:nahum:1:14",
            "writings:daniel:6:13",
            "torah:exodus:23:13",
            "writings:daniel:4:15",
            "writings:daniel:2:26",
            "writings:esther:4:8"
        ]
    }
}