{
    "VERSE": "10:6",
    "ARABIC": "إِنَّ فِى ٱخْتِلَٰفِ ٱلَّيْلِ وَٱلنَّهَارِ وَمَا خَلَقَ ٱللَّهُ فِى ٱلسَّمَٰوَٰتِ وَٱلْأَرْضِ لَءَايَٰتٍ لِّقَوْمٍ يَتَّقُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "In the alternation of night and day and what Allah has created in the heavens and the earth there are Signs for people who have taqwa.",
        "TRANSLATION_1": "In the alternation of night and day, and all that He has created in the heavens and the earth, are certainly signs for people who fear God.\n",
        "TRANSLATION_2": "Surely in the alternation of the night and the day and in all that Allah has created in the heavens and the earth there are signs for the people who seek to avoid (error of outlook and conduct).\n",
        "TRANSLATION_3": "The alternation of the day and night and all that God has created in the heavens and earth are evidence (of the existence of God) for the pious people.\n",
        "TRANSLATION_4": "Indeed in the alternation of the day and night, and all that Allah has created in the heavens and the earth, are signs for people who are pious.\n",
        "TRANSLATION_5": "Verily, in the alternation of the night and the day and in all that Allah has created in the heavens and the earth are Ayat for those who have Taqwa.\n",
        "TRANSLATION_6": "Most surely in the variation of the night and the day, and what Allah has created in the heavens and the earth, there are signs for a people who guard (against evil).\n",
        "TRANSLATION_7": "In the alternation of night and day, and what God has created in the heavens and the earth -- surely there are signs for a godfearing people.\n",
        "TRANSLATION_8": "Lo! in the difference of day and night and all that Allah hath created in the heavens and the earth are portents, verily, for folk who ward off (evil).\n",
        "TRANSLATION_9": "In the alternation of night and day, and in all that God has created in the heavens and the earth, there are signs for a God-fearing people.\n",
        "TRANSLATION_10": "Verily in the alteration of he night and the day and in that which Allah hath created in the heavens and the earth are surely signs unto a people who fear.\n",
        "TRANSLATION_11": "Indeed in the alternation of night and day, and whatever Allah has created in the heavens and the earth, there are surely signs for a people who are Godwary.\n",
        "TRANSLATION_12": "Verily, in the alternation of the night and the day, and in all that Allah hath created, in the heavens and the earth, are signs for those who fear Him.\n",
        "TRANSLATION_13": "Verily, in the alternation of the night and the day and in all that Allah has created in the heavens and the earth are Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) for those people who keep their duty to Allah, and fear Him much.\n",
        "TRANSLATION_14": "In the alternation of the night and day, and in all that Allah has created in the heavens and the earth, surely there are signs for people who are cautious.\n",
        "TRANSLATION_15": "In the alternation of night and day, and in what God created in the heavens and the earth, are signs for people who are aware.\n",
        "TRANSLATION_16": "Indeed, in the alternation of the night and the day and [in] what Allah has created in the heavens and the earth are signs for a people who fear Allah\n",
        "TRANSLATION_17": "[10:6] Truly in the alternation of night and day, in [their] coming and going, increasing and diminishing, and [in] what God has created in the heavens, of angels, sun, moon, stars and other things, and, in, the earth, of animals, mountains, seas, rivers, trees, and other things, there are signs, indications of His power, exalted be He, for a people who fear, Him, and so believe: He singles these out for mention because they are the ones to benefit from them [such signs].\n",
        "TRANSLATION_18": "(Lo! in the difference of day and night) in the changing of the day and night, their increase and decrease, their advent and elapsing (and all that Allah hath created in the heavens) and in that which Allah has created: the sun, the moon, the stars, etc., (and the earth) the trees, beasts, mountains, oceans, etc., (are portents) are signs for the divine Oneness of the Lord, (verily, for folk who ward off (evil)) for people who obey.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "10:6",
            "10:67",
            "45:5",
            "29:44",
            "45:13",
            "3:190",
            "16:13",
            "27:86",
            "16:65",
            "45:3"
        ],
        "BIBLE": [
            "torah:genesis:2:4",
            "prophets:jeremiah:33:25",
            "torah:deuteronomy:4:32",
            "torah:genesis:1:14",
            "torah:exodus:31:17",
            "prophets:i%20kings:8:59",
            "prophets:i%20kings:8:27",
            "prophets:isaiah:42:5",
            "writings:psalms:76:9",
            "torah:deuteronomy:27:9"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:4"
        ]
    }
}