{
    "VERSE": "10:62",
    "ARABIC": "أَلَآ إِنَّ أَوْلِيَآءَ ٱللَّهِ لَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Yes, the friends of Allah will feel no fear and will know no sorrow:",
        "TRANSLATION_1": "Remember, there is neither fear nor regret for the friends of God.\n",
        "TRANSLATION_2": "Oh, surely the friends of Allah have nothing to fear, nor shall they grieve -\n",
        "TRANSLATION_3": "The friends of God will certainly have nothing to fear, nor will they be grieved.\n",
        "TRANSLATION_4": "Pay heed! Indeed upon the friends of Allah is neither any fear, nor any grief. (The friends of Allah are the best in the creation.)\n",
        "TRANSLATION_5": "Behold! The Awliya' of Allah, no fear shall come upon them nor shall they grieve.\n",
        "TRANSLATION_6": "Now surely the friends of Allah-- they shall have no fear nor shall they grieve.\n",
        "TRANSLATION_7": "Surely God's friends -- no fear shall be on them, neither shall they sorrow.\n",
        "TRANSLATION_8": "Lo! verily the friends of Allah are (those) on whom fear (cometh) not, nor do they grieve?\n",
        "TRANSLATION_9": "Those who are close to God shall certainly have no fear, nor shall they grieve.\n",
        "TRANSLATION_10": "Lo! verily the friends of Allah! no fear shall come upon them nor shall they grieve.\n",
        "TRANSLATION_11": "Look! The friends of Allah will indeed have no fear nor will they grieve\n",
        "TRANSLATION_12": "Behold! verily on the friends of Allah there is no fear, nor shall they grieve;\n",
        "TRANSLATION_13": "No doubt! Verily, the Auliya' of Allah [i.e. those who believe in the Oneness of Allah and fear Allah much (abstain from all kinds of sins and evil deeds which he has forbidden), and love Allah much (perform all kinds of good deeds which He has ordained)], no fear shall come upon them nor shall they grieve,\n",
        "TRANSLATION_14": "Indeed, there shall be neither fear nor sorrow upon the guided by Allah.\n",
        "TRANSLATION_15": "Unquestionably, God’s friends have nothing to fear, nor shall they grieve.\n",
        "TRANSLATION_16": "Unquestionably, [for] the allies of Allah there will be no fear concerning them, nor will they grieve\n",
        "TRANSLATION_17": "[10:62] Assuredly God’s friends, no fear shall befall them, neither shall they grieve, in the Hereafter.\n",
        "TRANSLATION_18": "(Lo! verily the) believing (friends of Allah are (those) on whom fear (cometh) not) regarding any future punishment, (nor do they grieve) about that which they have left behind.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "10:62",
            "46:13",
            "47:11",
            "45:19",
            "5:69",
            "37:152",
            "27:49",
            "7:196",
            "2:15",
            "7:49"
        ],
        "BIBLE": [
            "writings:nehemiah:13:14",
            "prophets:jeremiah:14:10",
            "torah:genesis:9:16",
            "torah:exodus:20:17",
            "prophets:ezekiel:21:29",
            "torah:deuteronomy:31:17",
            "prophets:isaiah:65:17",
            "prophets:jeremiah:31:34",
            "prophets:jeremiah:5:12",
            "torah:numbers:32:23"
        ]
    }
}