{
    "VERSE": "10:69",
    "ARABIC": "قُلْ إِنَّ ٱلَّذِينَ يَفْتَرُونَ عَلَى ٱللَّهِ ٱلْكَذِبَ لَا يُفْلِحُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Say: 'People who invent lies against Allah will not be successful.'",
        "TRANSLATION_1": "Say: \"Those who fabricate lies about God will never succeed.\"\n",
        "TRANSLATION_2": "Tell them (O Muhammad!): 'Indeed those who invent lies against Allah will never prosper.\n",
        "TRANSLATION_3": "(Muhammad), tell them, \"Those who invent falsehood against God will have no happiness\".\n",
        "TRANSLATION_4": "Say, “Indeed those who fabricate lies against Allah will never succeed.”\n",
        "TRANSLATION_5": "Say: \"Verily, those who invent a lie against Allah will never be successful.\"\n",
        "TRANSLATION_6": "Say: Those who forge a lie against Allah shall not be successful.\n",
        "TRANSLATION_7": "Say: 'Those who forge against God falsehood shall not prosper.\n",
        "TRANSLATION_8": "Say: Verily those who invent a lie concerning Allah will not succeed.\n",
        "TRANSLATION_9": "Say, \"Those who invent falsehoods about God shall not prosper.\"\n",
        "TRANSLATION_10": "Say thou: verily those who fabricate a lie against Allah shall not fare well.\n",
        "TRANSLATION_11": "Say, ‘Indeed those who fabricate lies against Allah will not be felicitous.’\n",
        "TRANSLATION_12": "Say: \"Those who invent a lie against Allah will never prosper.\"\n",
        "TRANSLATION_13": "Say: \"Verily, those who invent lie against Allah will never be successful\"\n",
        "TRANSLATION_14": "Say: 'Those who forge falsehoods against Allah shall not prosper'\n",
        "TRANSLATION_15": "Say, “Those who fabricate lies about God will not succeed.”\n",
        "TRANSLATION_16": "Say, \"Indeed, those who invent falsehood about Allah will not succeed.\"\n",
        "TRANSLATION_17": "[10:69] Say: ‘Truly those who invent lies concerning God, by attributing offspring to Him, shall not prosper’, they shall not find happiness.\n",
        "TRANSLATION_18": "(Say) Muhammad: (Verily those who invent a lie concerning Allah will not succeed) they will not escape Allah's punishment nor will they be safe.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "10:69",
            "16:105",
            "58:14",
            "10:17",
            "6:21",
            "16:116",
            "72:5",
            "61:7",
            "30:59",
            "4:50"
        ],
        "BIBLE": [
            "prophets:amos:7:6",
            "prophets:jeremiah:45:2",
            "writings:ezra:9:10",
            "prophets:hosea:2:25",
            "writings:ii%20chronicles:20:20",
            "torah:genesis:15:2",
            "torah:deuteronomy:13:13",
            "prophets:ii%20samuel:7:25",
            "prophets:jeremiah:10:11",
            "prophets:isaiah:45:15"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:4:12"
        ]
    }
}