{
    "VERSE": "10:72",
    "ARABIC": "فَإِن تَوَلَّيْتُمْ فَمَا سَأَلْتُكُم مِّنْ أَجْرٍ إِنْ أَجْرِىَ إِلَّا عَلَى ٱللَّهِ وَأُمِرْتُ أَنْ أَكُونَ مِنَ ٱلْمُسْلِمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "If you turn your backs, I have not asked you for any wage. My wage is the responsibility of Allah alone. I am commanded to be one of the Muslims.'",
        "TRANSLATION_1": "If you turn away from me (remember) I do not ask any recompense from you. My reward is with God; I have been commanded to be one of those who submit to Him.\"\n",
        "TRANSLATION_2": "When you turned your back on my admonition (what harm did you cause me?) I had asked of you no reward, for my reward lies only with Allah, and I am commanded to be of those who totally submit (to Allah)\n",
        "TRANSLATION_3": "If you turn away from my preaching, it will not harm me; I shall receive my reward from God who has commanded me to become a Muslim.\"\n",
        "TRANSLATION_4": "“Then if you turn away, I do not ask any fee from you; my reward is only upon Allah, and I am commanded to be of the Muslims.”\n",
        "TRANSLATION_5": "But if you turn away, then no reward have I asked of you, my reward is only from Allah, and I have been commanded to be of the Muslims.\"\n",
        "TRANSLATION_6": "But if you turn back, I did not ask for any reward from you; my reward is only with Allah, and I am commanded that I should be of those who submit.\n",
        "TRANSLATION_7": "Then if you turn your backs, I have not asked you for any wage; my wage falls only on God, and I have been commanded to be of those that surrender.'\n",
        "TRANSLATION_8": "But if ye are averse I have asked of you no wage. My wage is the concern of Allah only, and I am commanded to be of those who surrender (unto Him).\n",
        "TRANSLATION_9": "If you turn away from me, remember I demand no recompense from you. Only God will reward me and I have been commanded to submit completely to Him.\"\n",
        "TRANSLATION_10": "If then ye turn away, I have asked of you no hire, my hire is only with Allah, and I am commanded to be of those who submit.\n",
        "TRANSLATION_11": "If you turn your back [on me], I do not ask any reward from you; my reward lies only with Allah and I have been commanded to be of those who submit [to Allah].’\n",
        "TRANSLATION_12": "But if ye turn back, (consider): no reward have I asked of you: my reward is only due from Allah, and I have been commanded to be of those who submit to Allah's will (in Islam).\"\n",
        "TRANSLATION_13": "But if you turn away [from accepting my doctrine of Islamic Monotheism, i.e. to worship none but Allah], then no reward have I asked of you, my reward is only from Allah, and I have been commanded to be one of the Muslims (those who submit to Allah's Will).\"\n",
        "TRANSLATION_14": "Then, if you turn your backs, I have not asked of you a wage. My wage falls only on Allah. I am commanded to be from those who surrender (Muslims)'\n",
        "TRANSLATION_15": "“But if you turn away, I have not asked you for any wage. My wage falls only on God, and I was commanded to be of those who submit.”\n",
        "TRANSLATION_16": "And if you turn away [from my advice] then no payment have I asked of you. My reward is only from Allah, and I have been commanded to be of the Muslims.\"\n",
        "TRANSLATION_17": "[10:72] But if you turn away, from my reminding [you], I have not asked you for any wage, any reward for it, so turn [and go] away: my wage, my reward, falls only on God, and I have been commanded to be of those who submit [to God]’.\n",
        "TRANSLATION_18": "(But if ye are averse) from believing in that which I brought (I have asked of you) in exchange for believing (no wage) no payment. (My wage) my reward for calling you to believe (is the concern of Allah only, and I am commanded to be of those who surrender (unto Him)) and to follow His religion.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "10:72",
            "11:115",
            "34:47",
            "38:86",
            "3:57",
            "24:54",
            "26:145",
            "26:127",
            "26:164",
            "26:109"
        ],
        "BIBLE": [
            "prophets:joshua:7:12",
            "prophets:jeremiah:32:33",
            "torah:deuteronomy:5:29",
            "writings:psalms:22:28",
            "torah:numbers:14:43",
            "prophets:zephaniah:2:7",
            "prophets:ezekiel:3:20",
            "prophets:i%20samuel:15:30",
            "writings:daniel:11:19",
            "writings:proverbs:10:8"
        ]
    }
}