{
    "VERSE": "10:77",
    "ARABIC": "قَالَ مُوسَىٰٓ أَتَقُولُونَ لِلْحَقِّ لَمَّا جَآءَكُمْ أَسِحْرٌ هَٰذَا وَلَا يُفْلِحُ ٱلسَّٰحِرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Musa said, 'Do you say to the truth when it comes to you, \"This is magic\"? Magicians are not successful.'",
        "TRANSLATION_1": "You say this of the truth,\" said Moses, \"after it has come to you. Is this magic? But sorcerers do not ever prosper.\"\n",
        "TRANSLATION_2": "Moses said: 'Do you say this about the truth after it has come to you? Is this sorcery? You call this sorcery although sorcerers never come to a happy end.\n",
        "TRANSLATION_3": "Moses asked, \"Why do you call the Truth which has come to you magic? Magicians, certainly, will not have happiness\".\n",
        "TRANSLATION_4": "Said Moosa, “What! You speak in this manner regarding the truth when it has come to you? Is this magic? And magicians never succeed.”\n",
        "TRANSLATION_5": "Musa said: \"Say you (this) about the truth when it has come to you Is this magic But the magicians will never be successful.\"\n",
        "TRANSLATION_6": "Musa said: Do you say (this) of the truth when it has come to you? Is it magic? And the magicians are not successful.\n",
        "TRANSLATION_7": "Moses said, 'What, do you say this to the truth, when it has come to you? Is this a sorcery? But sorcerers do not prosper.'\n",
        "TRANSLATION_8": "Moses said: Speak ye (so) of the Truth when it hath come unto you? Is this magic? Now magicians thrive not.\n",
        "TRANSLATION_9": "Moses replied, \"Do you speak thus of the truth after it has been brought to you? Can this be sorcery? Sorcerers never prosper.\"\n",
        "TRANSLATION_10": "Musa said: say ye this of the truth after it hath come unto you? Is this magic? and the magicians fare not well.\n",
        "TRANSLATION_11": "Moses said, ‘Do you say of the truth when it comes to you [that it is magic]? Is this magic? Magicians do not find salvation.’\n",
        "TRANSLATION_12": "Said Moses: \"Say ye (this) about the truth when it hath (actually) reached you? Is sorcery (like) this? But sorcerers will not prosper.\"\n",
        "TRANSLATION_13": "Musa (Moses) said: \"Say you (this) about the truth when it has come to you? Is this magic? But the magicians will never be successful.\"\n",
        "TRANSLATION_14": "Moses said: 'Is this what you say of the truth when it has come to you? Is this sorcery? Sorcerers do not prosper'\n",
        "TRANSLATION_15": "Moses said, “Is this what you say of the truth when it has come to you? Is this sorcery? Sorcerers do not succeed.”\n",
        "TRANSLATION_16": "Moses said, \"Do you say [thus] about the truth when it has come to you? Is this magic? But magicians will not succeed.\"\n",
        "TRANSLATION_17": "[10:77] Moses said, ‘Do you say [so] of the Truth when it has come to you, that it is sorcery? Is this sorcery?, when the one who has brought it has indeed prospered and has invalidated the sorcery of the sorcerers? Now sorcerers do not prosper’ (the interrogative in both instances is meant as a disavowal).\n",
        "TRANSLATION_18": "(Moses said) to them: (Speak ye (so) of the Truth) the Scripture, Messenger and revelations (when it hath come unto you? Is this magic? Now magicians thrive not) they have neither escape nor safety from Allah's chastisement.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "10:77",
            "43:30",
            "52:15",
            "46:7",
            "2:42",
            "10:76",
            "34:49",
            "37:15",
            "51:18",
            "24:49"
        ],
        "BIBLE": [
            "prophets:i%20samuel:24:17",
            "prophets:jeremiah:26:8",
            "prophets:ezekiel:20:3",
            "prophets:jeremiah:16:19",
            "prophets:isaiah:41:22",
            "torah:exodus:2:18",
            "prophets:isaiah:43:6",
            "prophets:ii%20kings:5:6",
            "prophets:i%20kings:2:30",
            "torah:deuteronomy:32:20"
        ]
    }
}