{
    "VERSE": "10:80",
    "ARABIC": "فَلَمَّا جَآءَ ٱلسَّحَرَةُ قَالَ لَهُم مُّوسَىٰٓ أَلْقُوا۟ مَآ أَنتُم مُّلْقُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "When the magicians came, Musa said to them, 'Throw whatever you have to throw!'",
        "TRANSLATION_1": "So when the magicians arrived, Moses said to them: \"Cast whatever (spell) you have to cast.\"\n",
        "TRANSLATION_2": "And when the sorcerers came Moses said to them: 'Cast whatever you wish to cast.'\n",
        "TRANSLATION_3": "When all the magicians were brought to his court, Moses asked them to cast down what they wanted to.\n",
        "TRANSLATION_4": "So when the magicians came, Moosa said to them, “Cast whatever you intend to cast.”\n",
        "TRANSLATION_5": "And when the sorcerers came, Musa said to them: \"Cast down what you want to cast!\"\n",
        "TRANSLATION_6": "And when the magicians came, Musa said to them: Cast down what you have to cast.\n",
        "TRANSLATION_7": "Then, when the sorcerers came, Moses said to them, 'Cast you down what you will cast.'\n",
        "TRANSLATION_8": "And when the wizards came, Moses said unto them: Cast your cast!\n",
        "TRANSLATION_9": "When the magicians came, Moses said to them, \"Cast down whatever you are going to cast down.\"\n",
        "TRANSLATION_10": "Then when the magicians were come, Musa said unto them: cast down that which ye are going to cast down.\n",
        "TRANSLATION_11": "So when the magicians came, Moses said to them, ‘Throw down what you have to throw.’\n",
        "TRANSLATION_12": "When the sorcerers came, Moses said to them: \"Throw ye what ye (wish) to throw!\"\n",
        "TRANSLATION_13": "And when the sorcerers came, Musa (Moses) said to them: \"Cast down what you want to cast!\"\n",
        "TRANSLATION_14": "When the sorcerers came, Moses said to them: 'Cast down what you will cast'\n",
        "TRANSLATION_15": "And when the sorcerers came, Moses said to them, “Throw whatever you have to throw.”\n",
        "TRANSLATION_16": "So when the magicians came, Moses said to them, \"Throw down whatever you will throw.\"\n",
        "TRANSLATION_17": "[10:80] And when the sorcerers came, Moses said to them, after they had said to him, Either you cast, or we shall be the casters! [Q. 7:115]: ‘Cast your cast!’\n",
        "TRANSLATION_18": "(And when the wizards came, Moses said unto them: Cast your cast) cast your staffs and ropes!\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "10:80",
            "26:43",
            "74:49",
            "23:36",
            "70:2",
            "52:11",
            "15:94",
            "107:4",
            "80:33",
            "26:46"
        ],
        "BIBLE": [
            "prophets:i%20samuel:9:10",
            "prophets:i%20kings:1:53",
            "prophets:ii%20kings:20:4",
            "prophets:ezekiel:9:7",
            "writings:ruth:1:19",
            "prophets:i%20samuel:19:22",
            "prophets:joshua:9:6",
            "writings:i%20chronicles:17:16",
            "prophets:ii%20samuel:11:10",
            "prophets:i%20kings:2:30"
        ]
    }
}