{
    "VERSE": "10:82",
    "ARABIC": "وَيُحِقُّ ٱللَّهُ ٱلْحَقَّ بِكَلِمَٰتِهِۦ وَلَوْ كَرِهَ ٱلْمُجْرِمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Allah confirms the Truth by His words, even though the evildoers hate it.",
        "TRANSLATION_1": "God vindicates the truth by His commands, however the sinners may dislike it.\"\n",
        "TRANSLATION_2": "Allah vindicates the truth by His commands, howsoever much the guilty might detest that.'\n",
        "TRANSLATION_3": "God will make the Truth stand supreme by His words, even though the wicked people dislike it.\"\n",
        "TRANSLATION_4": "“And Allah will prove the truth by His Words, even if the guilty get annoyed.”\n",
        "TRANSLATION_5": "And Allah will establish and make apparent the truth by His Words, however much the criminals may hate (it).\"\n",
        "TRANSLATION_6": "And Allah will show the truth to be the truth by His words, though the guilty may be averse (to it).\n",
        "TRANSLATION_7": "God verifies the truth by His words, though sinners be averse.'\n",
        "TRANSLATION_8": "And Allah will vindicate the Truth by His words, however much the guilty be averse.\n",
        "TRANSLATION_9": "God establishes the truth by His words, however much the sinners may dislike it.\"\n",
        "TRANSLATION_10": "And Allah justifieth the truth according to His words, even though the culprits may detest.\n",
        "TRANSLATION_11": "Allah will confirm the truth with His words, though the guilty should be averse.’\n",
        "TRANSLATION_12": "And Allah by His words doth prove and establish His truth, however much the sinners may hate it!\"\n",
        "TRANSLATION_13": "And Allah will establish and make apparent the truth by His Words, however much the Mujrimun (criminals, disbelievers, polytheists, sinners, etc.) may hate it.\"\n",
        "TRANSLATION_14": "Allah verifies the truth by His Words, even though the sinners hate it.\n",
        "TRANSLATION_15": "“And God upholds the truth with His words, even though the sinners detest it.”\n",
        "TRANSLATION_16": "And Allah will establish the truth by His words, even if the criminals dislike it.\"\n",
        "TRANSLATION_17": "[10:82] And God will vindicate, He will establish and make prevail, the Truth by His words, by His promises, however much the sinners be averse’.\n",
        "TRANSLATION_18": "(And Allah will vindicate) Allah will manifest for His religion (the Truth by His words) vindication, (however much the guilty be averse) even though the idolaters dislike this.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "10:82",
            "42:24",
            "27:79",
            "22:6",
            "8:7",
            "2:15",
            "29:68",
            "9:6",
            "24:25",
            "24:49"
        ],
        "BIBLE": [
            "writings:proverbs:22:21",
            "prophets:jeremiah:5:14",
            "writings:job:24:25",
            "torah:deuteronomy:4:10",
            "writings:job:40:27",
            "writings:i%20chronicles:17:22",
            "torah:deuteronomy:29:8",
            "writings:ii%20chronicles:30:5",
            "prophets:ii%20kings:19:4",
            "torah:leviticus:5:26"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:5:2"
        ]
    }
}