{
    "VERSE": "10:83",
    "ARABIC": "فَمَآ ءَامَنَ لِمُوسَىٰٓ إِلَّا ذُرِّيَّةٌ مِّن قَوْمِهِۦ عَلَىٰ خَوْفٍ مِّن فِرْعَوْنَ وَمَلَإِي۟هِمْ أَن يَفْتِنَهُمْ وَإِنَّ فِرْعَوْنَ لَعَالٍ فِى ٱلْأَرْضِ وَإِنَّهُۥ لَمِنَ ٱلْمُسْرِفِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "No one had iman in Musa except for a few of his people out of fear that Pharaoh, and the elders, would persecute them. Pharaoh was high and mighty in the land. He was one of the profligate.",
        "TRANSLATION_1": "But none of them put faith in Moses except some youths among his people who were nonetheless afraid lest the Pharaoh and his nobles should persecute them; for the Pharaoh was mighty in the land, and guilty of excesses.\n",
        "TRANSLATION_2": "None but a few youths of Moses' people accepted him, fearing that Pharaoh and their own chiefs would persecute them. Indeed Pharaoh was mighty in the land, he was among those who exceed all limits.\n",
        "TRANSLATION_3": "No one believed in Moses except some young people of his own tribe who were at the same time very afraid of the persecution of the Pharaoh and his people. The Pharaoh was certainly a tyrant and a transgressor.\n",
        "TRANSLATION_4": "So none accepted faith in Moosa, except a few descendants of his people, fearing Firaun and his court members, that they would force them to revert; and indeed Firaun was a rebel in the land; and indeed he crossed the limits.\n",
        "TRANSLATION_5": "But none believed in Musa except the offspring of his people, because of the fear of Fir`awn and his chiefs, lest they should persecute them; and verily, Fir`awn was an arrogant tyrant on the earth, he was indeed one of the transgressors.\n",
        "TRANSLATION_6": "But none believed in Musa except the offspring of his people, on account of the fear of Firon and their chiefs, lest he should persecute them; and most surely Firon was lofty in the land; and most surely he was of the extravagant.\n",
        "TRANSLATION_7": "So none believed in Moses, save a seed of his people, for fear of Pharaoh and their Council, that they would persecute them; and Pharaoh was high in the land, and he was one of the prodigals.\n",
        "TRANSLATION_8": "But none trusted Moses, save some scions of his people, (and they were) in fear of Pharaoh and their chiefs, that he would persecute them. Lo! Pharaoh was verily a tyrant in the land, and lo! he verily was of the wanton.\n",
        "TRANSLATION_9": "But none save a few youths declared their faith in Moses, [while others held back] for fear that Pharaoh and his nobles would persecute them. Pharaoh was high and mighty in the land. And one who transgressed all bounds.\n",
        "TRANSLATION_10": "Then none believed in Musa save a posterity of his people, through fear of Fir'awn and their chiefs, lest he should persecute them; and verily Fir'awn was lofty in the land, and verily he was of the extravagant.\n",
        "TRANSLATION_11": "But none believed in Moses except some youths from among his people, for the fear of Pharaoh and his elite that he would persecute them. For Pharaoh was indeed a tyrant in the land, and indeed he was an unrestrained [despot].\n",
        "TRANSLATION_12": "But none believed in Moses except some children of his people, because of the fear of Pharaoh and his chiefs, lest they should persecute them; and certainly Pharaoh was mighty on the earth and one who transgressed all bounds.\n",
        "TRANSLATION_13": "But none believed in Musa (Moses) except the offspring of his people, because of the fear of Fir'aun (Pharaoh) and his chiefs, lest they should persecute them; and verily, Fir'aun (Pharaoh) was arrogant tyrant on the earth, he was indeed one of the Musrifun (polytheists, sinners and transgressors, those who give up the truth and follow the evil, and commit all kinds of great sins).\n",
        "TRANSLATION_14": "So none believed Moses except a few of his nation because they feared that Pharaoh and their Council would persecute them. Pharaoh was mighty in theland, and one of the evildoers.\n",
        "TRANSLATION_15": "But none believed in Moses except some children of his people, for fear that Pharaoh and his chiefs would persecute them. Pharaoh was high and mighty in the land. He was a tyrant.\n",
        "TRANSLATION_16": "But no one believed Moses, except [some] youths among his people, for fear of Pharaoh and his establishment that they would persecute them. And indeed, Pharaoh was haughty within the land, and indeed, he was of the transgressors\n",
        "TRANSLATION_17": "[10:83] But with Moses, none believed save a few descendants, a party, of, the children of, his, that is, Pharaoh’s, folk, out of fear of Pharaoh and their council, that he [Pharaoh] might persecute them, turn them away from his [Moses’s] religion by torturing them; and truly Pharaoh was despotic, arrogant, in the land, the land of Egypt, and truly he was of the prodigal, [of] those who transgress the bounds by claiming to be Lords.\n",
        "TRANSLATION_18": "(But none trusted) none believed (Moses, save some scions of his people) from the people of Pharaoh: their fathers were Copts and their mothers were Israelites, and so they believed in Moses, ((and they were) in fear of Pharaoh and their chiefs, that they would persecute them) kill them. (Lo! Pharaoh was verily a tyrant) a foe (in the land) to the religion of Moses, (and Lo! he verily was of the wanton) he was of the 222 idolaters.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "10:83",
            "7:90",
            "16:13",
            "7:66",
            "23:46",
            "11:38",
            "7:60",
            "45:13",
            "7:127",
            "11:27"
        ],
        "BIBLE": [
            "prophets:isaiah:57:11",
            "prophets:joshua:14:9",
            "torah:leviticus:20:2",
            "writings:daniel:12:1",
            "torah:deuteronomy:1:36",
            "prophets:jeremiah:2:13",
            "writings:psalms:5:11",
            "torah:exodus:5:1",
            "writings:ruth:3:10",
            "writings:ii%20chronicles:34:33"
        ]
    }
}