{
    "VERSE": "10:84",
    "ARABIC": "وَقَالَ مُوسَىٰ يَٰقَوْمِ إِن كُنتُمْ ءَامَنتُم بِٱللَّهِ فَعَلَيْهِ تَوَكَّلُوٓا۟ إِن كُنتُم مُّسْلِمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Musa said, 'My people! if you have iman in Allah, then put your trust in Him, if you are Muslims.'",
        "TRANSLATION_1": "Moses said: \"O my people, if you do believe in God place your trust in Him if you are obedient.\"\n",
        "TRANSLATION_2": "Moses said: 'My people! If you believe in Allah and are truly Muslims then place your reliance on Him alone.'\n",
        "TRANSLATION_3": "Moses told his people, \"If you have submitted yourselves to God and have faith in Him, put your trust in Him\".\n",
        "TRANSLATION_4": "And Moosa said, “O my people! If you have accepted faith in Allah, then you should rely only upon Him, if you are Muslims.”\n",
        "TRANSLATION_5": "And Musa said: \"O my people! If you have believed in Allah, then put your trust in Him if you are Muslims.\"\n",
        "TRANSLATION_6": "And Musa said: O my people! if you believe in Allah, then rely on Him (alone) if you submit (to Allah).\n",
        "TRANSLATION_7": "Moses said, 'O my people, if you believe in God, in Him put your trust, if you have surrendered.'\n",
        "TRANSLATION_8": "And Moses said: O my people! If ye have believed in Allah then put trust in Him, if ye have indeed surrendered (unto Him)!\n",
        "TRANSLATION_9": "Moses said, \"O my people; if you believe in God, [and] if you have surrendered yourselves to Him, then in Him alone put your trust.\"\n",
        "TRANSLATION_10": "And Musa said: my people! if ye have been believing in Allah, then on Him rely, if ye are muslims.\n",
        "TRANSLATION_11": "And Moses said, ‘O my people! If you have faith in Allah, put your trust in Him, if you have submitted [to Him].’\n",
        "TRANSLATION_12": "Moses said: \"O my people! If ye do (really) believe in Allah, then in Him put your trust if ye submit (your will to His).\"\n",
        "TRANSLATION_13": "And Musa (Moses) said: \"O my people! If you have believed in Allah, then put your trust in Him if you are Muslims (those who submit to Allah's Will).\"\n",
        "TRANSLATION_14": "Moses said: 'O my nation, if you believe in Allah, put your trust in Him, if you have surrendered (Muslims)'\n",
        "TRANSLATION_15": "Moses said, “O my people, if you have believed in God, then put your trust in Him, if you have submitted.”\n",
        "TRANSLATION_16": "And Moses said, \"O my people, if you have believed in Allah, then rely upon Him, if you should be Muslims.\"\n",
        "TRANSLATION_17": "[10:84] And Moses said, ‘O my people, if you have believed in God then put your trust in Him, if you have [truly] submitted [to Him]’.\n",
        "TRANSLATION_18": "(And Moses said: my people! If you have believed in Allah then put trust in Him, if ye have indeed surrendered (unto Him)) because you have indeed surrendered to Allah!\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "10:84",
            "11:30",
            "29:16",
            "11:63",
            "26:144",
            "26:163",
            "9:96",
            "26:108",
            "26:179",
            "26:110"
        ],
        "BIBLE": [
            "prophets:jeremiah:14:13",
            "prophets:ezekiel:36:2",
            "torah:numbers:23:27",
            "torah:genesis:50:19",
            "torah:genesis:20:11",
            "prophets:joshua:3:3",
            "writings:psalms:31:15",
            "torah:genesis:1:9",
            "prophets:zephaniah:2:11",
            "prophets:jeremiah:4:10"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:2:1"
        ]
    }
}