{
    "VERSE": "10:86",
    "ARABIC": "وَنَجِّنَا بِرَحْمَتِكَ مِنَ ٱلْقَوْمِ ٱلْكَٰفِرِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "and rescue us, by Your mercy, from this kafir people!'",
        "TRANSLATION_1": "And deliver us by Your grace from a people who do not believe.\"\n",
        "TRANSLATION_2": "and deliver us, through Your mercy, from the unbelievers.'\n",
        "TRANSLATION_3": "Lord, save us, through Your mercy, from the disbelieving people.\"\n",
        "TRANSLATION_4": "“And with Your mercy, rescue us from the disbelievers.”\n",
        "TRANSLATION_5": "And save us by Your mercy from the disbelieving folk.\"\n",
        "TRANSLATION_6": "And do Thou deliver us by Thy mercy from the unbelieving people.\n",
        "TRANSLATION_7": "and deliver us by Thy mercy from the people of the unbelievers.'\n",
        "TRANSLATION_8": "And, of Thy mercy, save us from the folk that disbelieve.\n",
        "TRANSLATION_9": "And deliver us by Your mercy from the people who deny the truth.\"\n",
        "TRANSLATION_10": "And deliver us in Thine mercy from the disbelieving people.\n",
        "TRANSLATION_11": "and deliver us by Your mercy from the faithless lot.’\n",
        "TRANSLATION_12": "And deliver us by Thy Mercy from those who reject (Thee).\"\n",
        "TRANSLATION_13": "And save us by Your Mercy from the disbelieving folk.\"\n",
        "TRANSLATION_14": "Save us, through Your Mercy, from the unbelieving nation'\n",
        "TRANSLATION_15": "“And deliver us, by Your mercy, from the disbelieving people.”\n",
        "TRANSLATION_16": "And save us by Your mercy from the disbelieving people.\"\n",
        "TRANSLATION_17": "[10:86] and deliver us by Your mercy from the unbelieving folk’.\n",
        "TRANSLATION_18": "(And, of Thy mercy, save us from the folk that disbelieve) from Pharaoh and his folk.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "10:86",
            "21:86",
            "21:75",
            "28:46",
            "37:115",
            "16:64",
            "19:18",
            "26:10",
            "21:107",
            "41:2"
        ],
        "BIBLE": [
            "writings:psalms:109:21",
            "prophets:jeremiah:1:8",
            "writings:psalms:6:5",
            "torah:deuteronomy:20:16",
            "writings:ii%20chronicles:32:15",
            "torah:deuteronomy:7:16",
            "writings:psalms:71:2",
            "writings:psalms:86:13",
            "writings:psalms:109:26",
            "writings:psalms:31:3"
        ]
    }
}