{
    "VERSE": "10:87",
    "ARABIC": "وَأَوْحَيْنَآ إِلَىٰ مُوسَىٰ وَأَخِيهِ أَن تَبَوَّءَا لِقَوْمِكُمَا بِمِصْرَ بُيُوتًا وَٱجْعَلُوا۟ بُيُوتَكُمْ قِبْلَةً وَأَقِيمُوا۟ ٱلصَّلَوٰةَ وَبَشِّرِ ٱلْمُؤْمِنِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "We revealed to Musa and his brother: 'Settle your people in houses in Egypt and make your houses places of worship and establish salat and give good news to the muminun.'",
        "TRANSLATION_1": "We commanded Moses and his brother: \"Build homes for your people in Egypt, and make your houses places of worship, perform your acts of prayer and give happy tidings to those who believe.\"\n",
        "TRANSLATION_2": "And We directed Moses and his brother: 'Prepare a few houses for your people in Egypt, and make your houses a direction for men to pray, and establish Prayer, and give glad tidings to the men of faith.\n",
        "TRANSLATION_3": "We sent a revelation to Moses and his brother to build houses for their people in the Pharaoh's town and to build them facing one another. (We told him) that therein they should pray and that Moses should give the glad news (of God's mercy) to the faithful ones.\n",
        "TRANSLATION_4": "And We sent the divine revelation to Moosa and his brother that, “Build houses for your people in Egypt and make your houses as places of worship, and keep the prayer established, and give glad tidings to the Muslims.”\n",
        "TRANSLATION_5": "And We revealed to Musa and his brother (saying): \"Provide dwellings for your people in Egypt, and make your dwellings as places for your worship, and perform the Salah, and give glad tidings to the believers.\"\n",
        "TRANSLATION_6": "And We revealed to Musa and his brother, saying: Take for your people houses to abide in Egypt and make your houses places of worship and keep up prayer and give good news to the believers.\n",
        "TRANSLATION_7": "And We revealed to Moses and his brother, 'Take you, for your people, in Egypt certain houses; and make your houses a direction for men to pray to; and perform the prayer; and do thou give good tidings to the believers.'\n",
        "TRANSLATION_8": "And We inspired Moses and his brother, (saying): Appoint houses for your people in Egypt and make your houses oratories, and establish worship. And give good news to the believers.\n",
        "TRANSLATION_9": "We revealed [Our will] to Moses and his brother, saying, \"Set aside for your people some houses in the city and turn them into places of worship, and be constant in prayer! And give [O Moses] the good news to the believers.\"\n",
        "TRANSLATION_10": "And We Revealed unto Musa and his brother: inhabit houses for your people in Misr, and make your houses a place of Worship, and establish prayer, and give glad tidings to the believers.\n",
        "TRANSLATION_11": "We revealed to Moses and his brother [saying], ‘Settle your people in the city, and let your houses face each other, and maintain the prayer, and give good news to the faithful.’\n",
        "TRANSLATION_12": "We inspired Moses and his brother with this Message: \"Provide dwellings for your people in Egypt, make your dwellings into places of worship, and establish regular prayers: and give glad tidings to those who believe!\"\n",
        "TRANSLATION_13": "And We inspired Musa (Moses) and his brother (saying): \"Take dwellings for your people in Egypt, and make your dwellings as places for your worship, and perform As-Salat (Iqamat-as-Salat), and give glad tidings to the believers.\"\n",
        "TRANSLATION_14": "We revealed to Moses and his brother: 'Take certain houses for your people in Egypt. Make your houses a direction (for pray); establish the prayer; and give glad tidings to the believers'\n",
        "TRANSLATION_15": "And We inspired Moses and his brother, “Settle your people in Egypt, and make your homes places of worship, and perform the prayer, and give good news to the believers.”\n",
        "TRANSLATION_16": "And We inspired to Moses and his brother, \"Settle your people in Egypt in houses and make your houses [facing the] qiblah and establish prayer and give good tidings to the believers.\"\n",
        "TRANSLATION_17": "[10:87] And We inspired Moses and his brother [saying]: ‘Appoint houses for your people in Egypt and make your houses oratories, places in which to perform prayers, so that you might be secure from fear — for Pharaoh had prohibited them from performing prayers — and establish, fulfil, worship; and give good tidings to the believers’, of victory and Paradise.\n",
        "TRANSLATION_18": "(And We inspired Moses and his brother) Aaron, ((saying): Appoint houses) places of worship in the interior of your houses (for your people in Egypt and make your houses oratories) faced towards the direction of prayer, (and establish worship) perform the five daily prayers. (And give good news to the believers) that they shall obtain triumph, salvation and Paradise.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "10:87",
            "6:72",
            "9:11",
            "2:125",
            "28:12",
            "24:36",
            "7:142",
            "5:58",
            "2:67",
            "30:31"
        ],
        "BIBLE": [
            "writings:ezra:5:15",
            "writings:i%20chronicles:17:25",
            "prophets:judges:19:15",
            "prophets:ii%20kings:10:5",
            "prophets:i%20kings:20:34",
            "prophets:amos:6:10",
            "torah:genesis:2:18",
            "prophets:jeremiah:30:18",
            "prophets:joel:2:17",
            "writings:ezra:8:17"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:1:8"
        ]
    }
}