{
    "VERSE": "10:91",
    "ARABIC": "ءَآلْـَٰٔنَ وَقَدْ عَصَيْتَ قَبْلُ وَكُنتَ مِنَ ٱلْمُفْسِدِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "'What, now! When previously you rebelled and were one of the corrupters?",
        "TRANSLATION_1": "Yes, now\" (was the answer), \"though before this you were disobedient and rebellious.\n",
        "TRANSLATION_2": "(Thereupon came the response): 'Now you believe, although you disobeyed earlier and were one of the mischief-makers.\n",
        "TRANSLATION_3": "(God replied), \"Now you declare belief in Me! but before this you were a disobedient rebel.\n",
        "TRANSLATION_4": "“What! Now?* Whereas you were disobedient from the start and you were mischievous!” (This was said to Firaun.* Accepting faith at the time of death is of no use.)\n",
        "TRANSLATION_5": "Now (you believe) while you refused to believe before and you were one of the mischief-makers.\n",
        "TRANSLATION_6": "What! now! and indeed you disobeyed before and you were of the mischief-makers.\n",
        "TRANSLATION_7": "Now? And before thou didst rebel, being of those that did corruption.\n",
        "TRANSLATION_8": "What! Now! When hitherto thou hast rebelled and been of the wrong-doers?\n",
        "TRANSLATION_9": "Only now? When you had always been a rebel, and a wrongdoer.\n",
        "TRANSLATION_10": "Now indeed! whereas thou hast rebelled afore, and wast of the corrupters.\n",
        "TRANSLATION_11": "[He was told,] ‘What! Now? When you have been disobedient heretofore and were among the agents of corruption?!\n",
        "TRANSLATION_12": "(It was said to him): \"Ah now!- But a little while before, wast thou in rebellion!- and thou didst mischief (and violence)!\n",
        "TRANSLATION_13": "Now (you believe) while you refused to believe before and you were one of the Mufsidun (evil-doers, corrupts, etc.).\n",
        "TRANSLATION_14": "(Allah said): 'Now (you believe)! But before this you rebelled and were of the corrupt.\n",
        "TRANSLATION_15": "Now? When you have rebelled before, and been of the mischief-makers?\n",
        "TRANSLATION_16": "Now? And you had disobeyed [Him] before and were of the corrupters?\n",
        "TRANSLATION_17": "[10:91] ‘Now, do you believe, when hitherto you have disobeyed and been of those who do corruption?, on account of your being astray and your leading [others] astray, away from belief.\n",
        "TRANSLATION_18": "The Archangel Gabriel said to him: (What! Now!) will you believe now upon drowning (When hitherto) before this drowning (thou hast rebelled) disbelieved in Allah (and been of the wrong-doers) in the land of Egypt, killing, associating partners with Allah and calling for the worship of other than Allah?\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "10:91",
            "39:65",
            "69:9",
            "15:10",
            "29:3",
            "41:48",
            "17:77",
            "2:4",
            "36:31",
            "21:41"
        ],
        "BIBLE": [
            "prophets:jeremiah:38:25",
            "writings:ii%20chronicles:16:7",
            "writings:ruth:2:11",
            "torah:genesis:43:20",
            "prophets:i%20samuel:4:20",
            "prophets:ii%20kings:4:40",
            "prophets:ii%20kings:23:17",
            "prophets:ezekiel:11:16",
            "prophets:ii%20kings:4:17",
            "prophets:judges:13:6"
        ]
    }
}