{
    "VERSE": "10:93",
    "ARABIC": "وَلَقَدْ بَوَّأْنَا بَنِىٓ إِسْرَٰٓءِيلَ مُبَوَّأَ صِدْقٍ وَرَزَقْنَٰهُم مِّنَ ٱلطَّيِّبَٰتِ فَمَا ٱخْتَلَفُوا۟ حَتَّىٰ جَآءَهُمُ ٱلْعِلْمُ إِنَّ رَبَّكَ يَقْضِى بَيْنَهُمْ يَوْمَ ٱلْقِيَٰمَةِ فِيمَا كَانُوا۟ فِيهِ يَخْتَلِفُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "We settled the tribe of Israel in a noble place and gave them good things as provision. They did not differ until knowledge came to them. Your Lord will decide between them on the Day of Rising regarding the things about which they differed.",
        "TRANSLATION_1": "We gave the people of Israel a settled abode, and bestowed good things on them to eat and use. So they did not differ until they came to have knowledge. Your Lord will assuredly settle their differences on the Day of Resurrection.\n",
        "TRANSLATION_2": "We settled the Children of Israel in a blessed land, and provided them with all manner of good things. They only disagreed among themselves after knowledge (of the truth had) come to them. Surely your Lord will judge between them on the Day of Resurrection concerning their disagreements.\n",
        "TRANSLATION_3": "We settled the children of Israel in a blessed land and provided them with pure sustenance. They did not create differences among themselves until after the knowledge had come to them. God will judge their differences on the Day of Judgment.\n",
        "TRANSLATION_4": "And indeed We provided the Descendants of Israel a place of honour, and bestowed good sustenance to them; and they did not fall into dispute except after the knowledge had come to them; indeed your Lord will judge between them on the Day of Resurrection concerning the matters in which they used to differ.\n",
        "TRANSLATION_5": "And indeed We settled the Children of Israel in an honorable dwelling place, and provided them with good things, and they differed not until the knowledge came to them. Verily, your Lord will judge between them on the Day of Resurrection in that in which they used to differ.\n",
        "TRANSLATION_6": "And certainly We lodged the children of Israel in a goodly abode and We provided them with good things; but they did not disagree until the knowledge had come to them; surely your Lord will judge between them on the resurrection day concerning that in which they disagreed.\n",
        "TRANSLATION_7": "And We settled the Children of Israel in a sure settlement, and We provided them with good things; so they differed not until the knowledge came to them. Surely thy Lord will decide between them on the Day of Resurrection touching their differences.\n",
        "TRANSLATION_8": "And We verily did allot unto the Children of Israel a fixed abode, and did provide them with good things; and they differed not until the knowledge came unto them. Lo! thy Lord will judge between them on the Day of Resurrection concerning that wherein they used to differ.\n",
        "TRANSLATION_9": "We settled the Children of Israel in a blessed land, and We provided them with good things. And it was not until knowledge [of God's revelation] was granted to them that they began to hold divergent views. Your Lord will judge between them on the Day of Resurrection concerning that in which they differed.\n",
        "TRANSLATION_10": "And assuredly We settled the Children of Isra'il into a secure settlement, and We provided them with good things; nor they differed until there had come unto them the knowledge. Verily thine Lord shall judge between them on the Day of Resurrection as to that wherein they have been differing.\n",
        "TRANSLATION_11": "Certainly We settled the Children of Israel in a worthy settlement and We provided them with all the good things, and they did not differ until [after] the knowledge had come to them. Your Lord will indeed judge between them on the Day of Resurrection concerning that about which they used to differ.\n",
        "TRANSLATION_12": "We settled the Children of Israel in a beautiful dwelling-place, and provided for them sustenance of the best: it was after knowledge had been granted to them, that they fell into schisms. Verily Allah will judge between them as to the schisms amongst them, on the Day of Judgment.\n",
        "TRANSLATION_13": "And indeed We settled the Children of Israel in an honourable dwelling place (Sham and Misr), and provided them with good things, and they differed not until the knowledge came to them. Verily, Allah will judge between them on the Day of Resurrection in that in which they used to differ.\n",
        "TRANSLATION_14": "(Thereafter) We settled the Children of Israel in a blessed land and provided them with good things. They did not differ until knowledge was given them. Indeed, your Lord will decide between them on the Day of Resurrection.\n",
        "TRANSLATION_15": "And We settled the Children of Israel in a position of honor, and provided them with good things. They did not differ until knowledge came to them. Your Lord will judge between them on the Day of Resurrection regarding their differences.\n",
        "TRANSLATION_16": "And We had certainty settled the Children of Israel in an agreeable settlement and provided them with good things. And they did not differ until [after] knowledge had come to them. Indeed, your Lord will judge between them on the Day of Resurrection concerning that over which they used to differ\n",
        "TRANSLATION_17": "[10:93] And verily We appointed for the Children of Israel an excellent abode, a noble [place of] residence, namely, Syria and Egypt, and We provided them with good things; and they did not differ, such that some believed while others disbelieved, until the knowledge came to them. Truly your Lord will judge between them on the Day of Resurrection concerning that wherein they used to differ.\n",
        "TRANSLATION_18": "(And We verily did allot unto) We verily did send to (the Children of Israel a fixed abode) a noble land: Jordan and Palestine, (and did provide them with good things) honey, quails and spoils of war (and they differed not) i.e. the Jews and Christians regarding Muhammad (pbuh) and the Qur'an (until knowledge) the exposition of what is their Scriptures about the traits and description of Muhammad (pbuh) (came unto them. Lo! your Lord) Muhammad (will judge between them) between the Jews and Christians (on the Day of Resurrection concerning that wherein they used to differ) regarding religion.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "10:93",
            "45:17",
            "32:25",
            "16:124",
            "3:194",
            "11:110",
            "41:45",
            "22:69",
            "3:55",
            "39:31"
        ],
        "BIBLE": [
            "prophets:judges:18:10",
            "prophets:joshua:23:15",
            "writings:i%20chronicles:29:14",
            "torah:deuteronomy:1:3",
            "prophets:jeremiah:30:3",
            "torah:deuteronomy:8:10",
            "prophets:jeremiah:51:47",
            "torah:deuteronomy:12:21",
            "torah:numbers:20:24",
            "torah:numbers:11:4"
        ]
    }
}