{
    "VERSE": "10:96",
    "ARABIC": "إِنَّ ٱلَّذِينَ حَقَّتْ عَلَيْهِمْ كَلِمَتُ رَبِّكَ لَا يُؤْمِنُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Those against whom the words of your Lord are justly carried out will never have iman -",
        "TRANSLATION_1": "Verily those against whom the word of your Lord is pronounced will never believe,\n",
        "TRANSLATION_2": "Surely those against whom the word of your Lord has been fulfilled will not believed\n",
        "TRANSLATION_3": "(Even though all kinds of miracles will be shown to them) those about whom the word of your Lord has been ordained, will not have faith\n",
        "TRANSLATION_4": "Indeed those for whom the Word of your Lord has proved true, will not believe.\n",
        "TRANSLATION_5": "Truly, those, against whom the Word of your Lord has been justified, will not believe.\n",
        "TRANSLATION_6": "Surely those against whom the word of your Lord has proved true will not believe,\n",
        "TRANSLATION_7": "Those against whom thy Lord's word is realized will not believe,\n",
        "TRANSLATION_8": "Lo! those for whom the word of thy Lord (concerning sinners) hath effect will not believe,\n",
        "TRANSLATION_9": "Those against whom your Lord's word has been confirmed will never believe;\n",
        "TRANSLATION_10": "Verily those on whom the word of thy Lord hath been justified shall not believe.\n",
        "TRANSLATION_11": "Indeed those against whom your Lord’s judgement has become due will not have faith,\n",
        "TRANSLATION_12": "Those against whom the word of thy Lord hath been verified would not believe-\n",
        "TRANSLATION_13": "Truly! Those, against whom the Word (Wrath) of your Lord has been justified, will not believe.\n",
        "TRANSLATION_14": "Those against whom the Word of your Lord will be realized will not believe,\n",
        "TRANSLATION_15": "Those against whom your Lord’s Word is justified will not believe.\n",
        "TRANSLATION_16": "Indeed, those upon whom the word of your Lord has come into effect will not believe,\n",
        "TRANSLATION_17": "[10:96] Truly those against whom your Lord’s Word, of chastisement, is justified, [against whom] it is due, will not believe,\n",
        "TRANSLATION_18": "(Lo! those for whom the word of your Lord) that they will be punished (hath effect) has been enjoined (will not believe) as it is in Allah's foreknowledge,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "10:96",
            "10:33",
            "40:6",
            "23:59",
            "16:42",
            "29:59",
            "7:125",
            "10:40",
            "16:99",
            "43:77"
        ],
        "BIBLE": [
            "prophets:ezekiel:13:6",
            "writings:daniel:9:12",
            "prophets:jeremiah:42:5",
            "prophets:jeremiah:38:21",
            "prophets:ii%20kings:22:13",
            "prophets:jeremiah:28:9",
            "prophets:jeremiah:16:10",
            "prophets:i%20kings:2:27",
            "torah:numbers:27:21",
            "prophets:jeremiah:23:38"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:1:3"
        ]
    }
}