{
    "VERSE": "10:97",
    "ARABIC": "وَلَوْ جَآءَتْهُمْ كُلُّ ءَايَةٍ حَتَّىٰ يَرَوُا۟ ٱلْعَذَابَ ٱلْأَلِيمَ",
    "ENGLISH": {
        "TRANSLATION_0": "not even if every Sign were to come to them - until they see the painful punishment.",
        "TRANSLATION_1": "Even though all the signs came to them, not till they face the grievous punishment.\n",
        "TRANSLATION_2": "even if they witness every single sign that might come to them until they are face to face with the painful chastisement,\n",
        "TRANSLATION_3": "until they face the most painful torment.\n",
        "TRANSLATION_4": "Even if every sign comes to them, until they witness the painful punishment.\n",
        "TRANSLATION_5": "Even if every sign should come to them, until they see the painful torment.\n",
        "TRANSLATION_6": "Though every sign should come to them, until they witness the painful chastisement.\n",
        "TRANSLATION_7": "though every sign come to them, till they see the painful chastisement.\n",
        "TRANSLATION_8": "Though every token come unto them, till they see the painful doom.\n",
        "TRANSLATION_9": "not even if every Sign were to come to them -- until they see the painful punishment.\n",
        "TRANSLATION_10": "Even though every sign should come unto them, until they hehold an afflictive torment.\n",
        "TRANSLATION_11": "even though every sign were to come to them, until they sight the painful punishment.\n",
        "TRANSLATION_12": "Even if every Sign was brought unto them,- until they see (for themselves) the penalty grievous.\n",
        "TRANSLATION_13": "Even if every sign should come to them, - until they see the painful torment.\n",
        "TRANSLATION_14": "even though every sign comes to them, until they see the painful punishment.\n",
        "TRANSLATION_15": "Even if every sign comes to them—until they see the painful punishment.\n",
        "TRANSLATION_16": "Even if every sign should come to them, until they see the painful punishment.\n",
        "TRANSLATION_17": "[10:97] though every sign come to them, until they see the painful chastisement, at which time it [their belief] will be of no use to them.\n",
        "TRANSLATION_18": "(Though every token) they asked you to provide (come unto them) they will not believe, (till they see the painful doom) the Day of Badr, Uhud and the day of the confederates.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "10:97",
            "51:37",
            "26:201",
            "15:50",
            "16:104",
            "6:49",
            "4:138",
            "84:24",
            "34:5",
            "34:38"
        ],
        "BIBLE": [
            "prophets:ezekiel:20:35",
            "torah:numbers:24:14",
            "prophets:jeremiah:49:9",
            "prophets:isaiah:66:7",
            "torah:exodus:35:22",
            "torah:numbers:25:6",
            "prophets:isaiah:60:4",
            "prophets:micah:1:15",
            "torah:genesis:8:13",
            "writings:psalms:73:14"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:7"
        ]
    }
}