{
    "VERSE": "11:101",
    "ARABIC": "وَمَا ظَلَمْنَٰهُمْ وَلَٰكِن ظَلَمُوٓا۟ أَنفُسَهُمْ فَمَآ أَغْنَتْ عَنْهُمْ ءَالِهَتُهُمُ ٱلَّتِى يَدْعُونَ مِن دُونِ ٱللَّهِ مِن شَىْءٍ لَّمَّا جَآءَ أَمْرُ رَبِّكَ وَمَا زَادُوهُمْ غَيْرَ تَتْبِيبٍ",
    "ENGLISH": {
        "TRANSLATION_0": "We did not wrong them; rather they wronged themselves. The gods they called upon besides Allah did not help them at all when Allah's command came upon them. They did nothing but increase their ruin.",
        "TRANSLATION_1": "We did not wrong them; they wronged themselves. When your Lord's chastisement descended upon them, their gods, on whom they called apart from God, were not of the least avail, and all they did was only to add to their destruction.\n",
        "TRANSLATION_2": "We did not wrong them; it is rather they who wronged themselves. And when the command of your Lord came to pass, the gods besides Allah whom they had called upon, did not avail them in the least. They added nothing to them except ruin.\n",
        "TRANSLATION_3": "We were not unjust to them but they were unjust to themselves. The idols which they worshipped instead of God were of no help to them when Our decree came to pass. The idols only brought about their destruction.\n",
        "TRANSLATION_4": "And We did not oppress them at all, but it is they who wronged themselves – therefore their deities, whom they worshipped other than Allah, did not in the least benefit them when your Lord’s command came; and due to them, they increased nothing but ruin.\n",
        "TRANSLATION_5": "We wronged them not, but they wronged themselves. So their gods whom they call upon besides Allah, profited them naught when there came the command of your Lord, nor did they add aught to them but destruction.\n",
        "TRANSLATION_6": "And We did not do them injustice, but they were unjust to themselves, so their gods whom they called upon besides Allah did not avail them aught when the decree of your Lord came to pass; and they added but to their ruin.\n",
        "TRANSLATION_7": "And We wronged them not, but they wronged themselves; their gods availed them not that they called upon, apart from God, anything, when the command of thy Lord came; and they increased them not, save in destruction.\n",
        "TRANSLATION_8": "We wronged them not, but they did wrong themselves; and their gods on whom they call beside Allah availed them naught when came thy Lord's command; they added to them naught save ruin.\n",
        "TRANSLATION_9": "We did not wrong them; they wronged themselves; the deities they called on besides God availed them nothing: when God's command came upon them, they only added to their ruin.\n",
        "TRANSLATION_10": "And We wronged them not but they wronged themselves. So their gods, whom they called upon beside Allah, availed them not in aught, when there came the decree of thy Lord, and they added unto them naught but perdition.\n",
        "TRANSLATION_11": "We did not wrong them, but they wronged themselves. When your Lord’s edict came, their gods whom they would invoke besides Allah were of no avail to them in any wise, and they did not increase them in anything but ruin.\n",
        "TRANSLATION_12": "It was not We that wronged them: They wronged their own souls: the deities, other than Allah, whom they invoked, profited them no whit when there issued the decree of thy Lord: Nor did they add aught (to their lot) but perdition!\n",
        "TRANSLATION_13": "We wronged them not, but they wronged themselves. So their aliha (gods), other than Allah, whom they invoked, profited them naught when there came the Command of your Lord, nor did they add aught (to their lot) but destruction.\n",
        "TRANSLATION_14": "We did not wrong them, rather, they wronged themselves. Their gods that they called upon, other than Allah, did not help them when your Lord's command came they did not increased them except in their destruction.\n",
        "TRANSLATION_15": "We did not wrong them, but they wronged themselves. Their gods, whom they invoked besides God, availed them nothing when the command of your Lord arrived. In fact, they added only to their ruin.\n",
        "TRANSLATION_16": "And We did not wrong them, but they wronged themselves. And they were not availed at all by their gods which they invoked other than Allah when there came the command of your Lord. And they did not increase them in other than ruin.\n",
        "TRANSLATION_17": "[11:101] And We did not wrong them, destroying them for not having committed any sins, but they wronged themselves, through idolatry. Their gods did not avail, defend, them in any way (min shay’in: min is extra), those [gods] upon whom they called, [whom] they worshipped, besides God, that is, other than Him, when the command of your Lord, His chastisement, came; and they [their gods] — through their [the disbelievers’] worship of these [gods], did not increase them in anything but ruin, [but] loss.\n",
        "TRANSLATION_18": "(We wronged them not) when We destroyed them, (but they did wrong themselves) by engaging in disbelief, idolatry and idol worship; (and their gods on whom they call) they worship (beside Allah) when Allah's chastisement seized them (availed them naught then came your Lords command) your Lord's punishment; (they added to them) the worship of idols (naught save ruin) loss.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "11:101",
            "16:20",
            "16:33",
            "82:19",
            "21:43",
            "21:66",
            "6:164",
            "14:38",
            "13:11",
            "35:18"
        ],
        "BIBLE": [
            "torah:genesis:35:18",
            "torah:genesis:27:1",
            "prophets:zechariah:7:13",
            "prophets:jeremiah:14:9",
            "torah:exodus:33:7",
            "prophets:judges:16:18",
            "prophets:joshua:10:24",
            "writings:i%20chronicles:15:26",
            "torah:genesis:19:5",
            "torah:genesis:38:29"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:1:1"
        ]
    }
}