{
    "VERSE": "11:105",
    "ARABIC": "يَوْمَ يَأْتِ لَا تَكَلَّمُ نَفْسٌ إِلَّا بِإِذْنِهِۦ فَمِنْهُمْ شَقِىٌّ وَسَعِيدٌ",
    "ENGLISH": {
        "TRANSLATION_0": "On the Day it comes, no self will speak except by His permission. Some of them will be wretched and others glad.",
        "TRANSLATION_1": "The day it comes no soul will dare say a word but by His leave; and some will be wretched, some will be blessed.\n",
        "TRANSLATION_2": "And when the appointed Day comes, no one shall even dare to speak except by the leave of Allah. Then some will be declared wretched, others blessed.\n",
        "TRANSLATION_3": "On the Day of Judgment no one will speak without the permission of God. Some will be condemned and others blessed.\n",
        "TRANSLATION_4": "When that day comes, no one will speak without His permission; so among them are the ill-fated and the fortunate.\n",
        "TRANSLATION_5": "On the Day when it comes, no person shall speak except by His (Allah's) leave. Some among them will be wretched and (others) blessed.\n",
        "TRANSLATION_6": "On the day when it shall come, no soul shall speak except with His permission, then (some) of them shall be unhappy and (others) happy.\n",
        "TRANSLATION_7": "the day it comes, no soul shall speak save by His leave; some of them shall be wretched and some happy.\n",
        "TRANSLATION_8": "On the day when it cometh no soul will speak except by His permission; some among them will be wretched, (others) glad.\n",
        "TRANSLATION_9": "and when that Day arrives, no soul shall speak but by His leave. Among those some shall be damned, and others shall be blessed.\n",
        "TRANSLATION_10": "The day it cometh no soul shall speak save by His leave: then of them some shall be wretched and some blessed.\n",
        "TRANSLATION_11": "The day it comes, no one shall speak except by His leave. [On that day,] some of them will be wretched and [some] felicitous.\n",
        "TRANSLATION_12": "The day it arrives, no soul shall speak except by His leave: of those (gathered) some will be wretched and some will be blessed.\n",
        "TRANSLATION_13": "On the Day when it comes, no person shall speak except by His (Allah's) Leave. Some among them will be wretched and (others) blessed.\n",
        "TRANSLATION_14": "When that Day arrives no soul shall speak except by His permission. Some shall be wretched, and others happy.\n",
        "TRANSLATION_15": "On the Day when it arrives, no soul will speak without His permission. Some will be miserable, and some will be happy.\n",
        "TRANSLATION_16": "The Day it comes no soul will speak except by His permission. And among them will be the wretched and the prosperous.\n",
        "TRANSLATION_17": "[11:105] The day it, that day, comes, no soul shall speak (takallamu: one of the tā’ letters [of tatakallamu] has been omitted) except by His permission, exalted be He. Some of them, that is, [some] creatures, will be wretched, and [some], of them, joyous, each having been determined [to be thus] from pre-eternity.\n",
        "TRANSLATION_18": "(On the day when it cometh no soul will speak) no righteous soul will intercede in favour of anyone (except by His permission) except by His command; (some among them) some of the people on that day (will be wretched) it was decreed that they will be damned, ((others) glad) it was decreed that they will be felicitous.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "11:105",
            "36:54",
            "2:48",
            "2:123",
            "16:111",
            "6:26",
            "26:87",
            "39:15",
            "2:281",
            "34:30"
        ],
        "BIBLE": [
            "prophets:ezekiel:24:1",
            "prophets:haggai:2:1",
            "prophets:ezekiel:26:1",
            "prophets:ezekiel:29:1",
            "prophets:ezekiel:30:20",
            "prophets:ezekiel:31:1",
            "prophets:haggai:2:20",
            "prophets:ii%20kings:2:4",
            "prophets:ezekiel:29:17",
            "prophets:ezekiel:32:17"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:3:7"
        ]
    }
}