{
    "VERSE": "11:106",
    "ARABIC": "فَأَمَّا ٱلَّذِينَ شَقُوا۟ فَفِى ٱلنَّارِ لَهُمْ فِيهَا زَفِيرٌ وَشَهِيقٌ",
    "ENGLISH": {
        "TRANSLATION_0": "As for those who are wretched, they will be in the Fire, where they will sigh and gasp,",
        "TRANSLATION_1": "And those who are doomed, will be in Hell: For them will be sighing and sobbing,\n",
        "TRANSLATION_2": "As for the wretched, they shall be in the Fire, and in it they shall sigh and groan.\n",
        "TRANSLATION_3": "The condemned ones will live in hell fire, sighing and groaning\n",
        "TRANSLATION_4": "So those who are ill-fated, are in the fire – they will bray like donkeys in it.\n",
        "TRANSLATION_5": "As for those who are wretched, they will be in the Fire, in it they will experience Zafir and Shahiq.\n",
        "TRANSLATION_6": "So as to those who are unhappy, they shall be in the fire; for them shall be sighing and groaning in it:\n",
        "TRANSLATION_7": "As for the wretched, they shall be in the Fire, wherein there shall be for them moaning and sighing, therein dwelling forever,\n",
        "TRANSLATION_8": "As for those who will be wretched (on that day) they will be in the Fire; sighing and wailing will be their portion therein,\n",
        "TRANSLATION_9": "The wretched ones will be in the Fire sighing and groaning,\n",
        "TRANSLATION_10": "As for those who shall be wretched. they shall be in the Fire, wherein for them shall be panting and roaring.\n",
        "TRANSLATION_11": "As for the wretched, they shall be in the Fire: their lot therein will be groaning and wailing.\n",
        "TRANSLATION_12": "Those who are wretched shall be in the Fire: There will be for them therein (nothing but) the heaving of sighs and sobs:\n",
        "TRANSLATION_13": "As for those who are wretched, they will be in the Fire, sighing in a high and low tone.\n",
        "TRANSLATION_14": "The wretched shall be (cast) in the Fire where they will moan and sigh,\n",
        "TRANSLATION_15": "As for those who are miserable, they will be in the Fire. They will have therein sighing and wailing.\n",
        "TRANSLATION_16": "As for those who were [destined to be] wretched, they will be in the Fire. For them therein is [violent] exhaling and inhaling.\n",
        "TRANSLATION_17": "[11:106] As for those who are damned, according to God’s [prior] knowledge, they will be in the Fire; their lot therein will be wailing, which is a loud sound, and sighing, which is a faint sound;\n",
        "TRANSLATION_18": "(As for those who will be wretched (on that day) they will be in the Fire; sighing) like the sighing heard from a donkey when about to bray (and wailing) like the exhaling of a donkey when he stops braying (will be their portion therein).\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "11:106",
            "21:100",
            "3:131",
            "23:104",
            "30:15",
            "41:24",
            "55:15",
            "26:94",
            "11:16",
            "32:20"
        ],
        "BIBLE": [
            "torah:leviticus:13:46",
            "writings:esther:9:19",
            "prophets:jeremiah:8:16",
            "writings:ecclesiastes:2:21",
            "torah:numbers:29:1",
            "torah:exodus:8:18",
            "torah:leviticus:23:27",
            "prophets:zechariah:2:15",
            "prophets:jeremiah:30:24",
            "prophets:zechariah:14:4"
        ]
    }
}