{
    "VERSE": "11:113",
    "ARABIC": "وَلَا تَرْكَنُوٓا۟ إِلَى ٱلَّذِينَ ظَلَمُوا۟ فَتَمَسَّكُمُ ٱلنَّارُ وَمَا لَكُم مِّن دُونِ ٱللَّهِ مِنْ أَوْلِيَآءَ ثُمَّ لَا تُنصَرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Do not rely on those who do wrong thus causing the Fire to afflict you, for you have no protector besides Allah; then you will not be helped.",
        "TRANSLATION_1": "Do not lean towards the wicked, or you will be caught in the flames of Hell, and have none to befriend you other than God, nor will you be given help.\n",
        "TRANSLATION_2": "And do not incline towards the wrong-doers lest the Fire might seize you and you will have none as your protector against Allah; and then you will not be helped from anywhere.\n",
        "TRANSLATION_3": "Do not be inclined towards the unjust ones lest you will be afflicted by the hell fire. Besides God, no one can be your protector nor will anyone be able to help you.\n",
        "TRANSLATION_4": "And do not incline towards the unjust, for the fire will touch you – and you do not have any supporter other than Allah – then you will not be helped.\n",
        "TRANSLATION_5": "And incline not toward those who do wrong, lest the Fire should touch you, and you have no protectors other than Allah, nor would you then be helped.\n",
        "TRANSLATION_6": "And do not incline to those who are unjust, lest the fire touch you, and you have no guardians besides Allah, then you shall not be helped.\n",
        "TRANSLATION_7": "And lean not on the evildoers, so that the Fire touches you -- you have no protectors apart from God -- and then you will not be helped.\n",
        "TRANSLATION_8": "And incline not toward those who do wrong lest the Fire touch you, and ye have no protecting friends against Allah, and afterward ye would not be helped.\n",
        "TRANSLATION_9": "Do not incline toward those who do wrong, lest the Fire touch you. For [then] you would have none to protect you from God, and you will not be helped.\n",
        "TRANSLATION_10": "And lean not toward those who do wrong, lest the Fire should touch you, and ye have no protectors beside Allah nor ye would then be succoured.\n",
        "TRANSLATION_11": "Do not incline toward the wrongdoers, lest the Fire should touch you, and you will not have any friend besides Allah; then you will not be helped.\n",
        "TRANSLATION_12": "And incline not to those who do wrong, or the Fire will seize you; and ye have no protectors other than Allah, nor shall ye be helped.\n",
        "TRANSLATION_13": "And incline not toward those who do wrong, lest the Fire should touch you, and you have no protectors other than Allah, nor you would then be helped.\n",
        "TRANSLATION_14": "And do not incline to the wrongdoers lest you are touched by the Fire, for then you shall not be helped. You have no guardians other than Allah.\n",
        "TRANSLATION_15": "And do not incline towards those who do wrong, or the Fire may touch you; and you will have no protectors besides God, and you will not be saved.\n",
        "TRANSLATION_16": "And do not incline toward those who do wrong, lest you be touched by the Fire, and you would not have other than Allah any protectors; then you would not be helped.\n",
        "TRANSLATION_17": "[11:113] And do not incline toward the evildoers, through affection or adulation, or [by showing] satisfaction with their actions, lest the Fire touch, smite, you, and you have, besides God, other than Him, no protectors (min awliyā’: min is extra), to guard you from Him; and then you will not be helped, you will [not] be protected from His chastisement.\n",
        "TRANSLATION_18": "(And incline not towards those who do wrong) themselves by means of disbelief, idolatry and transgression (lest the Fire touch you) as it has touched them, (and ye have no protecting friends) no relatives to help you (against Allah) against Allah's chastisement, (and afterward ye would not be helped) you will not be prevented from what is wanted with you.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "11:113",
            "42:6",
            "42:46",
            "42:31",
            "16:20",
            "4:144",
            "46:32",
            "10:106",
            "47:11",
            "60:8"
        ],
        "BIBLE": [
            "prophets:haggai:2:13",
            "torah:leviticus:11:31",
            "torah:numbers:16:26",
            "writings:lamentations:4:15",
            "torah:genesis:3:3",
            "prophets:ii%20kings:4:27",
            "writings:job:19:21",
            "prophets:isaiah:13:15",
            "prophets:jeremiah:50:24",
            "prophets:judges:8:14"
        ]
    }
}