{
    "VERSE": "11:114",
    "ARABIC": "وَأَقِمِ ٱلصَّلَوٰةَ طَرَفَىِ ٱلنَّهَارِ وَزُلَفًا مِّنَ ٱلَّيْلِ إِنَّ ٱلْحَسَنَٰتِ يُذْهِبْنَ ٱلسَّيِّـَٔاتِ ذَٰلِكَ ذِكْرَىٰ لِلذَّٰكِرِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Establish salat at each end of the day and in the first part of the night. Good actions eradicate bad actions. This is a reminder for people who pay heed.",
        "TRANSLATION_1": "Stand up for the service of prayer at the two ends of day and the first watch of night. Remember that good deeds nullify the bad. This is a reminder for those who are observant.\n",
        "TRANSLATION_2": "And establish the Prayer at the two ends of the day and in the first hours of the night. Indeed the good deeds drive away the evil deeds. This is a Reminder to those who are mindful of Allah.\n",
        "TRANSLATION_3": "Say your prayers in the morning, the last portion of the day, and at the beginning of the night. Good deeds do away with the bad deeds. This is a reminder for those who take heed.\n",
        "TRANSLATION_4": "And keep the prayer established at the two ends of the day and in some parts of the night; indeed good deeds wipe out the evil deeds; this is an advice to those who heed it.\n",
        "TRANSLATION_5": "And perform the Salah, at the two ends of the day and in some hours of the night. Verily, the good deeds remove the evil deeds. That is a reminder for the mindful.\n",
        "TRANSLATION_6": "And keep up prayer in the two parts of the day and in the first hours of the night; surely good deeds take away evil deeds this is a reminder to the mindful.\n",
        "TRANSLATION_7": "And perform the prayer at the two ends of the day and nigh of the night; surely the good deeds will drive away the evil deeds. That is a remembrance unto the mindful.\n",
        "TRANSLATION_8": "Establish worship at the two ends of the day and in some watches of the night. Lo! good deeds annul ill-deeds. This is reminder for the mindful.\n",
        "TRANSLATION_9": "Say your prayers morning and evening, and during parts of the night; surely good makes amends for evil. This is a reminder for people who pay heed.\n",
        "TRANSLATION_10": "And establish thou the prayer at the two ends of the day, and in the neighbouring watches of the night verily virtues take away vices. That is a reminder unto the mindful.\n",
        "TRANSLATION_11": "Maintain the prayer at the two ends of the day, and during the early hours of the night. Indeed good deeds efface misdeeds. That is an admonition for the mindful.\n",
        "TRANSLATION_12": "And establish regular prayers at the two ends of the day and at the approaches of the night: For those things, that are good remove those that are evil: Be that the word of remembrance to those who remember (their Lord):\n",
        "TRANSLATION_13": "And perform As-Salat (Iqamat-as-Salat), at the two ends of the day and in some hours of the night [i.e. the five compulsory Salat (prayers)]. Verily, the good deeds remove the evil deeds (i.e. small sins). That is a reminder (an advice) for the mindful (those who accept advice).\n",
        "TRANSLATION_14": "And establish your prayer at the two edges of the day and in part of the night. Good deeds will repel evil deeds. That is a remembrance for those whoremember.\n",
        "TRANSLATION_15": "Perform the prayer at the borders of the day, and during the approaches of the night. The good deeds take away the bad deeds. This is a reminder for those who remember.\n",
        "TRANSLATION_16": "And establish prayer at the two ends of the day and at the approach of the night. Indeed, good deeds do away with misdeeds. That is a reminder for those who remember.\n",
        "TRANSLATION_17": "[11:114] And establish prayer at the two ends of the day, at first light and before sunset, that is, [pray] in the morning, at noon, and in the afternoon, and in some watches (zulafan is the plural of zulfa), a portion, of the night, that is, at sunset and late evening. Indeed good deeds, such as the five prayers, annul misdeeds, minor sins: this was revealed regarding one who kissed a female stranger and told the Prophet (s) about it, and then asked him, ‘Is this [verse true] for me?’ and the Prophet said to him, ‘It is [so] for every person of my community’, as reported by the two Shaykhs [Bukhārī and Muslim]. That is a remembrance for the mindful, an admonition for those who heed them.\n",
        "TRANSLATION_18": "(Establish worship) fulfil the prayer (at the two ends of the day) the morning prayer and the Zuhr; it is also 240 said that the reference here is to the morning prayer and the prayers of Zuhr and 'Asr (and in some watches of the night) at the advent of the night, i.e. the prayers of Maghrib and 'Isha'. (Lo! good deeds) the five daily prayers (annul ill deeds) sins other than the enormities; it is also said that the good deeds refer to the formulas: \"Glory be to Allah\", \"Praise be to Allah\", \"there is no god save Allah\" and \"Allah is the greatest\". (This is a reminder for the mindful) this is an act of repentance for those who repent; it is also said that this means: these expiate the sins of the repentant. This verse was revealed about a man called Abu'l-Yusr Ibn 'Umar.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "11:114",
            "13:10",
            "36:37",
            "21:20",
            "25:62",
            "30:23",
            "10:67",
            "28:73",
            "24:44",
            "23:80"
        ],
        "BIBLE": [
            "prophets:isaiah:38:13",
            "torah:deuteronomy:4:10",
            "writings:i%20chronicles:21:3",
            "prophets:jeremiah:5:18",
            "prophets:jeremiah:31:33",
            "prophets:joshua:1:8",
            "torah:exodus:36:5",
            "prophets:ezekiel:12:23",
            "prophets:i%20samuel:9:27",
            "prophets:ezekiel:43:27"
        ]
    }
}