{
    "VERSE": "11:115",
    "ARABIC": "وَٱصْبِرْ فَإِنَّ ٱللَّهَ لَا يُضِيعُ أَجْرَ ٱلْمُحْسِنِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "And be steadfast. Allah does not let the wage of good-doers go to waste.",
        "TRANSLATION_1": "Be steadfast, for verily God does not let the reward of those who are upright and do good to go waste.\n",
        "TRANSLATION_2": "And be patient; for indeed Allah never lets the reward of those who do good go to waste.\n",
        "TRANSLATION_3": "Exercise patience; God does not ignore the reward of those who do good.\n",
        "TRANSLATION_4": "And have patience, for Allah does not waste the wages of the righteous.\n",
        "TRANSLATION_5": "And be patient; verily, Allah wastes not the reward of the doers of good.\n",
        "TRANSLATION_6": "And be patient, for surely Allah does not waste the reward of the good-doers.\n",
        "TRANSLATION_7": "And be thou patient; God will not leave to waste the wage of the good-doers.\n",
        "TRANSLATION_8": "And have patience, (O Muhammad), for lo! Allah loseth not the wages of the good.\n",
        "TRANSLATION_9": "Be steadfast; for surely, God does not let the wages of the righteous be wasted.\n",
        "TRANSLATION_10": "And be patient thou; verily Allah wasteth not the hire of the welldoers.\n",
        "TRANSLATION_11": "And be patient; indeed Allah does not waste the reward of the virtuous.\n",
        "TRANSLATION_12": "And be steadfast in patience; for verily Allah will not suffer the reward of the righteous to perish.\n",
        "TRANSLATION_13": "And be patient; verily, Allah loses not the reward of the good-doers.\n",
        "TRANSLATION_14": "Therefore have patience; Allah will not let the wage of the gooddoers go to waste.\n",
        "TRANSLATION_15": "And be patient. God will not waste the reward of the virtuous.\n",
        "TRANSLATION_16": "And be patient, for indeed, Allah does not allow to be lost the reward of those who do good.\n",
        "TRANSLATION_17": "[11:115] And be patient, O Muhammad (s), in [enduring] the harm inflicted [upon you] by your people, or in [performing] prayer, for indeed God does not waste the wage of those who are virtuous, by patiently enduring through [acts of] obedience [to God].\n",
        "TRANSLATION_18": "(And have patience), Muhammad, regarding that with which you have been commanded and also in the face of their harm (for lo! Allah loseth not) thwarts not (the wages of the good) the reward of the believers who do good in their works and speech.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "11:115",
            "3:57",
            "10:72",
            "16:23",
            "3:32",
            "12:90",
            "42:40",
            "16:74",
            "39:66",
            "3:171"
        ],
        "BIBLE": [
            "writings:psalms:125:4",
            "writings:ii%20chronicles:6:41",
            "prophets:joshua:1:9",
            "torah:deuteronomy:9:6",
            "prophets:i%20kings:8:57",
            "writings:ezra:9:15",
            "prophets:ii%20samuel:7:29",
            "writings:ii%20chronicles:6:17",
            "writings:psalms:37:33",
            "torah:deuteronomy:7:20"
        ]
    }
}