{
    "VERSE": "11:116",
    "ARABIC": "فَلَوْلَا كَانَ مِنَ ٱلْقُرُونِ مِن قَبْلِكُمْ أُو۟لُوا۟ بَقِيَّةٍ يَنْهَوْنَ عَنِ ٱلْفَسَادِ فِى ٱلْأَرْضِ إِلَّا قَلِيلًا مِّمَّنْ أَنجَيْنَا مِنْهُمْ وَٱتَّبَعَ ٱلَّذِينَ ظَلَمُوا۟ مَآ أُتْرِفُوا۟ فِيهِ وَكَانُوا۟ مُجْرِمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Would that there had been more people with a vestige of good among the generations of those who came before you, who forbade corruption in the earth, other than the few among them whom We saved. Those who did wrong gladly pursued the life of luxury that they were given and were evildoers.",
        "TRANSLATION_1": "If only there had been men endued with virtue in the ages before you, who could preserve men from doing evil in the world, other than the few We saved from among them. Those who were wicked followed that which made them dissolute, and became sinners.\n",
        "TRANSLATION_2": "Why were there not, out of the generations that passed away before you, righteous men who would forbid others from causing corruption on the earth? And if such were there, they were only a few whom We had saved from those generations, or else the wrong-doers kept pursuing the ease and comfort which had been conferred upon them, thus losing themselves in sinfulness.\n",
        "TRANSLATION_3": "Why were there no people of understanding among those people of the destroyed towns of the past except for a few, whom we saved from destruction, to prevent people from committing evil in the land? The unjust among them indulged in worldly pleasures and so became guilty.\n",
        "TRANSLATION_4": "So why were not there some people, from the generations before you, who had some goodness remaining in them in order to prevent (others) from causing turmoil in the earth? Except a few among them – the very ones whom We had rescued; and the unjust remained pursuing what they were given, and they were guilty.\n",
        "TRANSLATION_5": "If only there had been among the generations before you persons having wisdom, prohibiting (others) from Fasad (corruption) in the earth, except a few of those whom We saved from among them! Those who did wrong pursued the enjoyment of good things of (this worldly) life, and were criminals.\n",
        "TRANSLATION_6": "But why were there not among the generations before you those possessing understanding, who should have forbidden the making of mischief in the earth, except a few of those whom We delivered from among them? And those who were unjust went after what they are made to enjoy of plenty, and they were guilty.\n",
        "TRANSLATION_7": "Or if there had been, of the generations before you, men of a remainder forbidding corruption in the earth -- except a few of those whom We delivered of them; but the evildoers followed the ease they were given to exult in and became sinners.\n",
        "TRANSLATION_8": "If only there had been among the generations before you men possessing a remnant (of good sense) to warn (their people) from corruption in the earth, as did a few of those whom We saved from them! The wrong-doers followed that by which they were made sapless, and were guilty.\n",
        "TRANSLATION_9": "Why, then, were there not among the generations before you upright men who would speak out against the [spread of] corruption on earth -- except for the few whom We saved? But the wrongdoers pursued their worldly pleasures and thus became guilty.\n",
        "TRANSLATION_10": "Why were there not of the generations before you owner of wisdom restraining others from corruption on the earth, except a few of those whom We delivered from amongst them! And those who did wrong followed that in which they luxuriated, and they had been sinners.\n",
        "TRANSLATION_11": "Why were there not among the generations before you a remnant [of the wise] who might forbid corruption in the earth, except a few of those whom We delivered from among them? Those who were wrongdoers pursued that in which they had been granted affluence, and they were a guilty lot.\n",
        "TRANSLATION_12": "Why were there not, among the generations before you, persons possessed of balanced good sense, prohibiting (men) from mischief in the earth - except a few among them whom We saved (from harm)? But the wrong-doers pursued the enjoyment of the good things of life which were given them, and persisted in sin.\n",
        "TRANSLATION_13": "If only there had been among the generations before you, persons having wisdom, prohibiting (others) from Al-Fasad (disbelief, polytheism, and all kinds of crimes and sins) in the earth, except a few of those whom We saved from among them. Those who did wrong pursued the enjoyment of good things of (this worldly) life, and were Mujrimun (criminals, disbelievers in Allah, polytheists, sinners, etc.).\n",
        "TRANSLATION_14": "If (only) there had been except for a few among them whom We saved among the generations that have gone before you, some that remained forbidding corruption in the land, but the wrongdoers pursued the ease they had been given to delight in and became sinners.\n",
        "TRANSLATION_15": "If only there were, among the generations before you, people with wisdom, who spoke against corruption on earth—except for the few whom We saved. But the wrongdoers pursued the luxuries they were indulged in, and thus became guilty.\n",
        "TRANSLATION_16": "So why were there not among the generations before you those of enduring discrimination forbidding corruption on earth - except a few of those We saved from among them? But those who wronged pursued what luxury they were given therein, and they were criminals.\n",
        "TRANSLATION_17": "[11:116] If only there had been among the generations, past communities, before you men possessing a remnant [of good sense], men of religion and virtue, forbidding corruption in the earth (this [statement] is intended to be a negation, in other words, ‘there never were such [men] among them’), except, but, a few of those whom (mimman: min is explicative) We delivered from among them, did forbid [corruption] and were thus delivered. But those who did wrong, through corruption and neglecting to forbid, followed that by which they were made profligate, and were sinners.\n",
        "TRANSLATION_18": "(If only there had been among the generations before you) He says: there were not among the nations before you believing (men possessing a remnant (of good sense) to warn (their people) from corruption in the earth) warning them against disbelief, idolatry, idol worship and all kinds of transgressions, (as did a few of those whom We saved from them) from among the believers! (The wrong-doers followed) the idolaters engaged in (that by which they were made sapless) the comfort and wealth which they were given in this world, (and were guilty) idolaters.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "11:116",
            "8:73",
            "8:26",
            "50:36",
            "3:137",
            "23:79",
            "7:129",
            "30:42",
            "40:82",
            "20:51"
        ],
        "BIBLE": [
            "prophets:i%20kings:14:8",
            "prophets:joshua:23:15",
            "writings:ii%20chronicles:6:27",
            "torah:exodus:21:29",
            "writings:ii%20chronicles:2:11",
            "writings:ecclesiastes:8:15",
            "prophets:i%20kings:8:36",
            "prophets:ezekiel:3:20",
            "prophets:i%20kings:20:39",
            "prophets:i%20kings:19:21"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:4:4"
        ]
    }
}