{
    "VERSE": "11:117",
    "ARABIC": "وَمَا كَانَ رَبُّكَ لِيُهْلِكَ ٱلْقُرَىٰ بِظُلْمٍ وَأَهْلُهَا مُصْلِحُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Your Lord would never have destroyed the cities wrongfully as long as their inhabitants were putting things right.",
        "TRANSLATION_1": "Your Lord would not surely destroy unjustly human habitations so long as the people are righteous.\n",
        "TRANSLATION_2": "And your Lord is not such as would wrongfully destroy human habitations while their inhabitants are righteous.\n",
        "TRANSLATION_3": "Your Lord would not have destroyed those people (of the towns) for their injustice if they had tried to reform themselves.\n",
        "TRANSLATION_4": "And your Lord is not such as to destroy townships without reason, while their people are righteous.\n",
        "TRANSLATION_5": "And your Lord would never destroy the towns wrongfully, while their people were doers of good.\n",
        "TRANSLATION_6": "And it did not beseem your Lord to have destroyed the towns tyrannously, while their people acted well.\n",
        "TRANSLATION_7": "Yet thy Lord would never destroy the cities unjustly, while as yet their people were putting things right.\n",
        "TRANSLATION_8": "In truth thy Lord destroyed not the townships tyrannously while their folk were doing right.\n",
        "TRANSLATION_9": "Your Lord would never unjustly destroy communities while their people were trying to reform.\n",
        "TRANSLATION_10": "And thy Lord is not one to destroy cities wrongously while the inhabitants thereof are rectifiers.\n",
        "TRANSLATION_11": "Your Lord would never destroy the townships unjustly while their inhabitants were bringing about reform.\n",
        "TRANSLATION_12": "Nor would thy Lord be the One to destroy communities for a single wrong-doing, if its members were likely to mend.\n",
        "TRANSLATION_13": "And your Lord would never destroy the towns wrongfully, while their people were right-doers.\n",
        "TRANSLATION_14": "Your Lord would never destroy the villages unjustly, whilst their people were reforming.\n",
        "TRANSLATION_15": "Your Lord would never destroy the towns wrongfully, while their inhabitants are righteous.\n",
        "TRANSLATION_16": "And your Lord would not have destroyed the cities unjustly while their people were reformers.\n",
        "TRANSLATION_17": "[11:117] Yet your Lord would never destroy the towns through injustice, on His part, against them, while their inhabitants were righteous, that is, believers.\n",
        "TRANSLATION_18": "(In truth thy Lord destroyed not) the people of (the townships tyrannously) because of the tyranny they committed (while their folk were doing right) while there were among them those who enjoined good and forbade evil; it is also said that this means: your Lord would not have destroyed the people of the townships through an injustice from Him while their people were doing right, i.e. engaged in acts of obedience and holding firm to them.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "11:117",
            "6:131",
            "28:59",
            "26:169",
            "11:102",
            "32:22",
            "7:94",
            "93:3",
            "29:31",
            "41:46"
        ],
        "BIBLE": [
            "prophets:joshua:23:15",
            "prophets:isaiah:43:9",
            "torah:deuteronomy:25:16",
            "writings:ii%20chronicles:12:12",
            "writings:i%20chronicles:19:13",
            "prophets:ii%20samuel:10:12",
            "prophets:ii%20kings:17:9",
            "prophets:jeremiah:32:42",
            "prophets:jeremiah:12:1",
            "prophets:jeremiah:40:3"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:4:2",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:6"
        ]
    }
}