{
    "VERSE": "11:12",
    "ARABIC": "فَلَعَلَّكَ تَارِكٌۢ بَعْضَ مَا يُوحَىٰٓ إِلَيْكَ وَضَآئِقٌۢ بِهِۦ صَدْرُكَ أَن يَقُولُوا۟ لَوْلَآ أُنزِلَ عَلَيْهِ كَنزٌ أَوْ جَآءَ مَعَهُۥ مَلَكٌ إِنَّمَآ أَنتَ نَذِيرٌ وَٱللَّهُ عَلَىٰ كُلِّ شَىْءٍ وَكِيلٌ",
    "ENGLISH": {
        "TRANSLATION_0": "Perhaps you are leaving aside part of what has been revealed to you and your breast is constricted by this because they say, 'Why has treasure not been sent down to him or an angel not accompanied him?' You are only a warner and Allah is Guardian over all things.",
        "TRANSLATION_1": "You may haply omit some of what has been revealed to you, and may be disheartened because they say: \"Why was no treasure sent down to him, or an angel accompanied him?\" Yet you have been sent to warn alone, for God takes care of everything.\n",
        "TRANSLATION_2": "(O Messenger!) Let it not happen that you omit (to expound) a portion of what was revealed to you. And do not be distressed that they will say: 'Why was a treasure not bestowed upon him?' or 'Why did no angel accompany him?' For you are merely a warner, whereas Allah has control over everything.\n",
        "TRANSLATION_3": "Perhaps you, (Muhammad), may by chance leave (untold) a part of that which is revealed to you and feel grieved because they say, \"Why has some treasure not been sent to him or an angel sent down with him?\" Say, \"I have come only to warn you.\" God is the Guardian of all things.\n",
        "TRANSLATION_4": "So will you forsake part of what is divinely revealed to you and be disheartened because they say, “Why has not a treasure been sent down along with him?”, or “An angel should have come with him”? You are purely a Herald of Warning*; and Allah is the Guardian over all things. (* Therefore do not grieve over their sayings.)\n",
        "TRANSLATION_5": "So perchance you may give up a part of what is revealed unto you, and that your breast feels straitened for it because they say, \"Why has not a treasure been sent down unto him, or an angel come with him\" But you are only a warner. And Allah is a Guardian over all things.\n",
        "TRANSLATION_6": "Then, it may be that you will give up part of what is revealed to you and your breast will become straitened by it because they say: Why has not a treasure been sent down upon him or an angel come with him? You are only a warner; and Allah is custodian over all things.\n",
        "TRANSLATION_7": "Perchance thou art leaving part of what is revealed to thee, and thy breast is straitened by it, because they say, 'Why has a treasure not been sent down upon him, or an angel not come with him?' Thou art only a warner; and God is a Guardian over everything.\n",
        "TRANSLATION_8": "A likely thing, that thou wouldst forsake aught of that which hath been revealed unto thee, and that thy breast should be straitened for it, because they say: Why hath not a treasure been sent down for him, or an angel come with him? Thou art but a warner, and Allah is in charge of all things.\n",
        "TRANSLATION_9": "You may [feel the inclination] to leave aside a part of what is revealed to you and you may be distressed because they say, \"Why has no treasure been sent down to him, why has no angel come with him?\" But you are only to give warning. God is the guardian of all things.\n",
        "TRANSLATION_10": "So hapoy thou mayest abandon part of that hich hath been revealed unto thee, and thy breast is straitened thereby, because they say: wherefore hath not a treasure been sent down unto him, or an angel come with him! Thou art but a warner, and of everything Allah is the Trustee.\n",
        "TRANSLATION_11": "[Look out] lest you should disregard aught of what has been revealed to you, and be upset because they say, ‘Why has not a treasure been sent down to him, or [why does] not an angel accompany him?’ You are only a warner, and Allah watches over all things.\n",
        "TRANSLATION_12": "Perchance thou mayest (feel the inclination) to give up a part of what is revealed unto thee, and thy heart feeleth straitened lest they say, \"Why is not a treasure sent down unto him, or why does not an angel come down with him?\" But thou art there only to warn! It is Allah that arrangeth all affairs!\n",
        "TRANSLATION_13": "So perchance you (Muhammad SAW) may give up a part of what is revealed unto you, and that your breast feels straitened for it because they say, \"Why has not a treasure been sent down unto him, or an angel has come with him?\" But you are only a warner. And Allah is a Wakil (Disposer of affairs, Trustee, Guardian, etc.) over all things.\n",
        "TRANSLATION_14": "Perhaps you are leaving part of what has been sent down to you, and your chest is straitened by it, because they say: 'Why has no treasure been sent down to him, or an angel come with him' You are only a warner, and Allah is a Guardian over everything.\n",
        "TRANSLATION_15": "Perhaps you wish to disregard some of what is revealed to you, and you may be stressed because of it, since they say, “If only a treasure was sent down to him, or an angel came with him.” You are only a warner, and God is Responsible for all things.\n",
        "TRANSLATION_16": "Then would you possibly leave [out] some of what is revealed to you, or is your breast constrained by it because they say, \"Why has there not been sent down to him a treasure or come with him an angel?\" But you are only a warner. And Allah is Disposer of all things.\n",
        "TRANSLATION_17": "[11:12] Perhaps, O Muhammad (s), you might [think to] leave out some of what is revealed to you, such that you do not convey it to them, for they do not take it seriously, and that your breast should be straitened by it, by   reciting it to them, because they say, ‘Why has a treasure not been sent down for him, or an angel not come with him?’, to confirm his sincerity, as we had requested? You are but a warner, and yours is only to convey [the Message], not to produce what they have requested; and God is Guardian over all things, He is Preserver [of all things], so He will requite them [accordingly].\n",
        "TRANSLATION_18": "(A likely thing, that thou) Muhammad (wouldst forsake aught of that which hath been revealed unto thee) that which you were commanded in the Qur'an of conveying the message and of reviling and denigrating their idols, (and that thy breast should be straitened for it) and that you are annoyed with what you were commanded, (because they say) because the disbelievers of Mecca say: (Why hath not a treasure) wealth from heaven (been sent down for him) for Muhammad to support himself with, (or an angel come with him) to testify in his favour? (Thou art) Muhammad (but a warner) a warning Messenger, (and Allah is in charge) Allah is Custodian; it is also said this means: witness (of all things) of their saying and chastisement.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "11:12",
            "39:62",
            "3:29",
            "4:32",
            "33:54",
            "24:45",
            "6:102",
            "24:64",
            "8:75",
            "29:50"
        ],
        "BIBLE": [
            "prophets:ii%20kings:2:9",
            "writings:nehemiah:6:8",
            "torah:deuteronomy:22:14",
            "prophets:ii%20kings:2:10",
            "torah:numbers:31:49",
            "prophets:jeremiah:36:14",
            "torah:deuteronomy:15:10",
            "writings:i%20chronicles:17:25",
            "prophets:ii%20kings:10:15",
            "torah:genesis:24:7"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:5:1"
        ]
    }
}