{
    "VERSE": "11:120",
    "ARABIC": "وَكُلًّا نَّقُصُّ عَلَيْكَ مِنْ أَنۢبَآءِ ٱلرُّسُلِ مَا نُثَبِّتُ بِهِۦ فُؤَادَكَ وَجَآءَكَ فِى هَٰذِهِ ٱلْحَقُّ وَمَوْعِظَةٌ وَذِكْرَىٰ لِلْمُؤْمِنِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "We have given you all this news about the Messengers so We can make your heart firm by means of it. The truth has come to you in this and an admonishment and reminder to the muminun.",
        "TRANSLATION_1": "The histories of apostles that We relate to you are (meant) to strengthen your heart. Through them has the truth come to you, and guidance, and reminder to those who believe.\n",
        "TRANSLATION_2": "(O Muhammad!) We narrate these anecdotes of Messengers to you that We may strengthen through them your heart. In these anecdotes come to you the truth, and an exhortation, and a reminder for the believers.\n",
        "TRANSLATION_3": "(Muhammad), We tell you all the stories of the Messengers which will strengthen your heart. In the Quran We have revealed the Truth to you with good advice and reminders for the faithful ones.\n",
        "TRANSLATION_4": "And We relate to you all the accounts of Noble Messengers, in order to steady your heart with it; and in this the truth has come to you, and for the Muslims a preaching and advice.\n",
        "TRANSLATION_5": "And all that We relate to you of the news of the Messengers is in order that We may make strong and firm your heart thereby. And in this has come to you the truth, as well as an admonition and a reminder for the believers.\n",
        "TRANSLATION_6": "And all we relate to you of the accounts of the apostles is to strengthen your heart therewith; and in this has come to you the truth and an admonition, and a reminder to the believers.\n",
        "TRANSLATION_7": "And all that We relate to thee of the tidings of the Messengers is that whereby We strengthen thy heart; in these there has come to thee the truth and an admonition, and a reminder to the believers.\n",
        "TRANSLATION_8": "And all that We relate unto thee of the story of the messengers is in order that thereby We may make firm thy heart. And herein hath come unto thee the Truth and an exhortation and a reminder for believers.\n",
        "TRANSLATION_9": "We have told you the stories of the prophets to make your heart firm and in these accounts truth has come to you, with an exhortation and a reminder for the believers.\n",
        "TRANSLATION_10": "And all that We recount unto thee of the stories of the apostles is in order that We may make firm thy heart thereby. And in this there hath come to thee truth and an exhortation and an admonition unto the believers.\n",
        "TRANSLATION_11": "Whatever We relate to you of the accounts of the apostles are those by which We strengthen your heart, and there has come to you in this [surah] the truth and an advice and admonition for the faithful.\n",
        "TRANSLATION_12": "All that we relate to thee of the stories of the messengers,- with it We make firm thy heart: in them there cometh to thee the Truth, as well as an exhortation and a message of remembrance to those who believe.\n",
        "TRANSLATION_13": "And all that We relate to you (O Muhammad SAW) of the news of the Messengers is in order that We may make strong and firm your heart thereby. And in this (chapter of the Quran) has come to you the truth, as well as an admonition and a reminder for the believers.\n",
        "TRANSLATION_14": "And all We relate to you of the tidings of the Messengers is that whereby We strengthen your heart and through these the truth has come to you, and anadmonition and a reminder to the believers.\n",
        "TRANSLATION_15": "Everything We narrate to you of the history of the messengers is to strengthen your heart therewith. The truth has come to you in this, and a lesson, and a reminder for the believers.\n",
        "TRANSLATION_16": "And each [story] We relate to you from the news of the messengers is that by which We make firm your heart. And there has come to you, in this, the truth and an instruction and a reminder for the believers.\n",
        "TRANSLATION_17": "[11:120] And all that (kullān is in the accusative because [it is the direct object] of naqussu, ‘We relate’; and the nunation compensates for a [missing] genitive annexation), that is, all that is necessary, We relate to you of the accounts of the messengers, that (mā substitutes for kullan, ‘all that’) with which We might strengthen, reassure, your heart. And in these, accounts, or verses, there has come to you the Truth and an admonition and a reminder to the believers: they are specifically mentioned here because they are the ones to benefit from them, through their belief [in them], in contrast to [the case with] the disbelievers.\n",
        "TRANSLATION_18": "(And all that We relate unto thee) as We have explained to you (of the story of the messengers) of the events of the messengers (is in order that thereby We may make firm your heart) in order to gladden your heart, that what was done to you was also done to other prophets. (And herein hath come unto thee) in this surah (the Truth) the news of the Truth (and an exhortation) to avoid transgression (and a reminder) an admonition (for believers).\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "11:120",
            "9:33",
            "28:3",
            "61:9",
            "43:29",
            "10:103",
            "48:28",
            "25:31",
            "19:54",
            "17:36"
        ],
        "BIBLE": [
            "prophets:jeremiah:32:40",
            "prophets:ezekiel:18:31",
            "torah:genesis:40:14",
            "writings:i%20chronicles:12:39",
            "torah:exodus:31:6",
            "prophets:ii%20samuel:11:25",
            "prophets:jeremiah:49:16",
            "torah:exodus:20:21",
            "writings:daniel:4:4",
            "prophets:ii%20samuel:23:5"
        ]
    }
}