{
    "VERSE": "11:121",
    "ARABIC": "وَقُل لِّلَّذِينَ لَا يُؤْمِنُونَ ٱعْمَلُوا۟ عَلَىٰ مَكَانَتِكُمْ إِنَّا عَٰمِلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Say to those who have no iman: 'Do as you think best. That is what we are doing.",
        "TRANSLATION_1": "Say to the infidels. \"Act as best you can, we are acting too;\n",
        "TRANSLATION_2": "As for those who are bent on not believing, tell them: 'Work according to your way and we are working according to our way.\n",
        "TRANSLATION_3": "Tell the unbelievers, \"Do as you wish and I will do as I believe.\n",
        "TRANSLATION_4": "And say to the disbelievers, “Keep on with your works in your places; we are carrying out ours.”\n",
        "TRANSLATION_5": "And say to those who do not believe: \"Act according to your ability and way, We are acting.\n",
        "TRANSLATION_6": "And say to those who do not believe: Act according to your state; surely we too are acting.\n",
        "TRANSLATION_7": "And say to the unbelievers: 'Act you according to your station; we are acting.\n",
        "TRANSLATION_8": "And say unto those who believe not: Act according to your power. Lo! We (too) are acting.\n",
        "TRANSLATION_9": "Say to those who do not believe, you do things in your way and we are doing things in our way,\n",
        "TRANSLATION_10": "And say thou unto those who believe not: work according to your condition verily We, going to work in our way.\n",
        "TRANSLATION_11": "Say to those who do not have faith, ‘Act according to your ability; we too are acting.\n",
        "TRANSLATION_12": "Say to those who do not believe: \"Do what ever ye can: We shall do our part;\n",
        "TRANSLATION_13": "And say to those who do not believe: \"Act according to your ability and way, We are acting (in our way).\n",
        "TRANSLATION_14": "Say to those who disbelieve: 'Do according to your station; we are doing according to our station'\n",
        "TRANSLATION_15": "And say to those who do not believe, “Act according to your ability; and so will we.”\n",
        "TRANSLATION_16": "And say to those who do not believe, \"Work according to your position; indeed, we are working.\n",
        "TRANSLATION_17": "[11:121] And say to those who do not believe: ‘Act according to your ability, [according] to your status, we are acting, according to our status — [this is] a threat for them.\n",
        "TRANSLATION_18": "(And say unto those who believe not) in Allah and the Last Day nor in the revealed Scriptures and prophets: 241 (Act according to your power) in your dwellings act according to your religion so as to destroy me. (Lo! we (too) are acting) to destroy you.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "11:121",
            "36:67",
            "7:76",
            "37:137",
            "8:21",
            "37:24",
            "11:122",
            "34:25",
            "52:47",
            "77:36"
        ],
        "BIBLE": [
            "prophets:i%20samuel:26:25",
            "prophets:ii%20kings:5:11",
            "torah:exodus:34:10",
            "prophets:ezekiel:23:30",
            "prophets:ezekiel:42:13",
            "prophets:ezekiel:24:19",
            "prophets:habakkuk:1:5",
            "prophets:jeremiah:2:23",
            "prophets:ii%20kings:17:11",
            "prophets:isaiah:26:12"
        ]
    }
}