{
    "VERSE": "11:19",
    "ARABIC": "ٱلَّذِينَ يَصُدُّونَ عَن سَبِيلِ ٱللَّهِ وَيَبْغُونَهَا عِوَجًا وَهُم بِٱلْءَاخِرَةِ هُمْ كَٰفِرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "those who bar access to the way of Allah desiring to make it crooked and reject the Next Woeld.",
        "TRANSLATION_1": "Who obstruct others from the way of God and seek obliquity in it, and do not believe in the life to come.\n",
        "TRANSLATION_2": "upon those who bar people from the way of Allah, and seek in it crookedness, and disbelieve in the Hereafter.\n",
        "TRANSLATION_3": "who prevent others from the way of God, seek to make it appear crooked, and who have no faith in the life hereafter.\n",
        "TRANSLATION_4": "Those who prevent from the way of Allah and wish deviation in it; and it is they who disbelieve in the Hereafter.\n",
        "TRANSLATION_5": "Those who hinder (others) from the path of Allah, and seek a crookedness therein, while they are disbelievers in the Hereafter.\n",
        "TRANSLATION_6": "Who turn away from the path of Allah and desire to make it crooked; and they are disbelievers in the hereafter.\n",
        "TRANSLATION_7": "who bar from God's way, desiring to make it crooked; they disbelieve in the world to come;\n",
        "TRANSLATION_8": "Who debar (men) from the way of Allah and would have it crooked, and who are disbelievers in the Hereafter.\n",
        "TRANSLATION_9": "Such as those who turn others away from the path of God and seek to make it appear crooked: these are the ones who deny the Hereafter.\n",
        "TRANSLATION_10": "Who hinder others from the way of Allah and would seek crockedness therein, and they: in the Hereafter they are disbelievers.\n",
        "TRANSLATION_11": "—those who bar [others] from the way of Allah, and seek to make it crooked, and disbelieve in the Hereafter.\n",
        "TRANSLATION_12": "Those who would hinder (men) from the path of Allah and would seek in it something crooked: these were they who denied the Hereafter!\"\n",
        "TRANSLATION_13": "Those who hinder (others) from the Path of Allah (Islamic Monotheism), and seek a crookedness therein, while they are disbelievers in the Hereafter.\n",
        "TRANSLATION_14": "who bar others from the Path of Allah and seek to make it crooked, they disbelieve in the Everlasting Life.\n",
        "TRANSLATION_15": "Those who hinder others from the path of God, and seek to make it crooked; and regarding the Hereafter, they are in denial.\n",
        "TRANSLATION_16": "Who averted [people] from the way of Allah and sought to make it [seem] deviant while they, concerning the Hereafter, were disbelievers.\n",
        "TRANSLATION_17": "[11:19] they who bar [people] from God’s way, [from] the religion of Islam, desiring [to have] it, seeking that the   way be, crooked; and in the Hereafter they (hum, ‘they’, is [reiterated] for emphasis) are disbelievers.\n",
        "TRANSLATION_18": "(Who debar (men)) who prevent people (from the way of Allah) from Allah's religion and obedience (and would have it crooked) they would have it deviated from the Truth; it is also said that this means: they would have it other than what it is, (and who are disbelievers in) deniers of (the Hereafter) resurrection after death. 228\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "11:19",
            "7:45",
            "14:3",
            "47:1",
            "16:88",
            "2:190",
            "3:99",
            "29:69",
            "8:47",
            "47:34"
        ],
        "BIBLE": [
            "torah:genesis:3:24",
            "prophets:jeremiah:26:3",
            "writings:ezra:10:14",
            "prophets:ii%20samuel:14:20",
            "torah:deuteronomy:3:1",
            "prophets:ezekiel:3:19",
            "prophets:ezekiel:33:9",
            "prophets:joshua:8:20",
            "writings:job:34:27",
            "prophets:jonah:3:8"
        ]
    }
}