{
    "VERSE": "11:2",
    "ARABIC": "أَلَّا تَعْبُدُوٓا۟ إِلَّا ٱللَّهَ إِنَّنِى لَكُم مِّنْهُ نَذِيرٌ وَبَشِيرٌ",
    "ENGLISH": {
        "TRANSLATION_0": "'Do not worship anyone but Allah! I am a warner and bringer of good news to you from Him",
        "TRANSLATION_1": "(Proclaiming) that you should worship none but God. Verily I bring to you from Him a message of warning and rejoicing,\n",
        "TRANSLATION_2": "that you may worship none but Allah. Verily, I have come to you as a warner and a bearer of good news from Him\n",
        "TRANSLATION_3": "(It teaches), \"People, do not worship anyone besides God. I, (Muhammad), am His Messenger sent to warn you and to give you the glad news.\n",
        "TRANSLATION_4": "“That do not worship anyone except Allah; indeed I am for you a Herald of Warning and Glad Tidings, from Him.”\n",
        "TRANSLATION_5": "(Saying) worship none but Allah. Verily, I (Muhammad) am unto you from Him a warner and a bringer of glad tidings.\n",
        "TRANSLATION_6": "That you shall not serve (any) but Allah; surely I am a warner for you from Him and a giver of good news,\n",
        "TRANSLATION_7": "Serve you none but God' (I am to you a warner from Him and a bearer of good tidings)\n",
        "TRANSLATION_8": "(Saying): Serve none but Allah. Lo! I am unto you from Him a warner and a bringer of good tidings.\n",
        "TRANSLATION_9": "[It teaches] that you should worship none but God. I am sent to you from Him to warn you and to give you good tidings.\n",
        "TRANSLATION_10": "Saying: ye shall not worship ought except Allah. Verily I am unto you from Him a warner and a bearer of glad tidings.\n",
        "TRANSLATION_11": "declaring: ‘Worship no one but Allah. I am indeed a warner to you from Him and a bearer of good news.\n",
        "TRANSLATION_12": "(It teacheth) that ye should worship none but Allah. (Say): \"Verily I am (sent) unto you from Him to warn and to bring glad tidings:\n",
        "TRANSLATION_13": "(Saying) worship none but Allah. Verily, I (Muhammad SAW) am unto you from Him a warner and a bringer of glad tidings.\n",
        "TRANSLATION_14": "Worship none except Allah. I am for you, a warner sent from Him and a bearer of glad tidings.\n",
        "TRANSLATION_15": "That you shall worship none but God. “I am a warner to you from Him, and a bearer of good news.”\n",
        "TRANSLATION_16": "[Through a messenger, saying], \"Do not worship except Allah. Indeed, I am to you from Him a warner and a bringer of good tidings,\"\n",
        "TRANSLATION_17": "[11:2] [Saying:] ‘Worship none but God. Truly I am to you a warner from Him, of chastisement, if you disbelieve, and a bearer of good tidings’, of reward, if you believe.\n",
        "TRANSLATION_18": "((Saying): Serve) declare the divine Oneness of (none but Allah. Lo! I am Unto you from Him) from Allah (a warner) from the Fire (and a bringer of good tidings) to enter Paradise.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "11:2",
            "51:50",
            "51:51",
            "11:34",
            "71:3",
            "12:96",
            "37:35",
            "71:4",
            "35:24",
            "10:72"
        ],
        "BIBLE": [
            "torah:exodus:3:12",
            "torah:exodus:7:16",
            "prophets:jeremiah:5:19",
            "prophets:jeremiah:42:20",
            "torah:exodus:10:8",
            "prophets:joshua:24:16",
            "torah:exodus:14:12",
            "torah:exodus:9:1",
            "prophets:joshua:23:16",
            "torah:deuteronomy:8:19"
        ]
    }
}