{
    "VERSE": "11:22",
    "ARABIC": "لَا جَرَمَ أَنَّهُمْ فِى ٱلْءَاخِرَةِ هُمُ ٱلْأَخْسَرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Without question they will be the greatest losers in the Next World.",
        "TRANSLATION_1": "Undoubtedly they will be losers in the life to come.\n",
        "TRANSLATION_2": "Doubtlessly, they shall be the greatest losers in the Hereafter.\n",
        "TRANSLATION_3": "In the life to come they will certainly lose a great deal.\n",
        "TRANSLATION_4": "They will be, unnecessarily, the greatest losers in the Hereafter.\n",
        "TRANSLATION_5": "Certainly, they are those who will be the greatest losers in the Hereafter.\n",
        "TRANSLATION_6": "Truly in the hereafter they are the greatest losers.\n",
        "TRANSLATION_7": "they without doubt will be the greatest losers in the world to come.\n",
        "TRANSLATION_8": "Assuredly in the Hereafter they will be the greatest losers.\n",
        "TRANSLATION_9": "In the Hereafter, it is they who shall be the greatest losers.\n",
        "TRANSLATION_10": "Undoubtedly they! in the Hereafter they shall be the greatest losers.\n",
        "TRANSLATION_11": "Undoubtedly, they are the ones who will be the biggest losers in the Hereafter.\n",
        "TRANSLATION_12": "Without a doubt, these are the very ones who will lose most in the Hereafter!\n",
        "TRANSLATION_13": "Certainly, they are those who will be the greatest losers in the Hereafter.\n",
        "TRANSLATION_14": "without doubt they will be the greatest losers in the Everlasting Life.\n",
        "TRANSLATION_15": "Without a doubt, in the Hereafter, they will be the biggest losers.\n",
        "TRANSLATION_16": "Assuredly, it is they in the Hereafter who will be the greatest losers.\n",
        "TRANSLATION_17": "[11:22] Without doubt, verily, they will be the greatest losers in the Hereafter.\n",
        "TRANSLATION_18": "(Assuredly in the Hereafter they will be the greatest losers) of Paradise and that which is in it.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "11:22",
            "16:109",
            "74:53",
            "77:17",
            "16:23",
            "27:4",
            "37:129",
            "37:78",
            "37:119",
            "37:108"
        ],
        "BIBLE": [
            "torah:numbers:35:31",
            "prophets:ezekiel:47:9",
            "writings:psalms:96:13",
            "writings:daniel:12:2",
            "prophets:judges:21:5",
            "torah:numbers:24:14",
            "torah:deuteronomy:12:23",
            "prophets:zechariah:14:18",
            "writings:proverbs:12:28",
            "writings:psalms:90:2"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:8",
            "Sefer%20Yetzirah:3:6",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:3:5",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:2:6",
            "Sefer%20Yetzirah:4:10"
        ]
    }
}