{
    "VERSE": "11:29",
    "ARABIC": "وَيَٰقَوْمِ لَآ أَسْـَٔلُكُمْ عَلَيْهِ مَالًا إِنْ أَجْرِىَ إِلَّا عَلَى ٱللَّهِ وَمَآ أَنَا۠ بِطَارِدِ ٱلَّذِينَ ءَامَنُوٓا۟ إِنَّهُم مُّلَٰقُوا۟ رَبِّهِمْ وَلَٰكِنِّىٓ أَرَىٰكُمْ قَوْمًا تَجْهَلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "My people! I do not ask you for any wealth for it. My wage is the responsibility of Allah alone. I will not chase away those who have iman. They are surely going to meet their Lord. However, I see you as ignorant people.",
        "TRANSLATION_1": "I do not demand for it any wealth from you, O my people. My reward is with God. And I will not drive those away who believe. They have also to meet their Lord. But I see you are an ignorant people.\n",
        "TRANSLATION_2": "My people! I seek no recompense from you. My recompense is only with Allah. Nor will I drive away those who believe. They are destined to meet their Lord. But I find you to be an ignorant people.\n",
        "TRANSLATION_3": "My people I do not ask any payment for what I preach to you. No one except God has to give me any reward. I do not drive away those who have faith (in my teaching); they will all receive mercy from their Lord. I know that you are ignorant people.\n",
        "TRANSLATION_4": "“And O my people! I do not ask any wealth from you for it; my reward is only upon Allah, and I am not going to repel the Muslims; indeed they will meet their Lord, but I find you people completely ignorant.”\n",
        "TRANSLATION_5": "And O my people! I ask of you no wealth for it, my reward is from none but Allah. I am not going to drive away those who have believed. Surely, they are going to meet their Lord, but I see that you are a people that are ignorant.\n",
        "TRANSLATION_6": "And, O my people! I ask you not for wealth in return for it; my reward is only with Allah and I am not going to drive away those who believe; surely they shall meet their Lord, but I consider you a people who are ignorant:\n",
        "TRANSLATION_7": "O my people, I do not ask of you wealth for this; my wage falls only upon God. I will not drive away those who believe; they shall surely meet their Lord. But I see you are an ignorant people.\n",
        "TRANSLATION_8": "And O my people! I ask of you no wealth therefor. My reward is the concern only of Allah, and I am not going to thrust away those who believe - Lo! they have to meet their Lord! - but I see you a folk that are ignorant.\n",
        "TRANSLATION_9": "O my people, I do not ask you for any money for this; my reward comes only from God. I will not drive away those who believe; they shall surely meet their Lord. Yet I see that you are a people who act out of ignorance.\n",
        "TRANSLATION_10": "And, O my people, I ask not of you any riches therefor; my hire is not but with Allah. And I am not going to drive away those who have believed; verily they are going to meet their Lord; but I behold you a people ignorant!\n",
        "TRANSLATION_11": "O my people! I do not ask you any material reward for it. My reward lies only with Allah. But I will not drive away those who have faith: they will indeed encounter their Lord. But I see that you are an ignorant lot.\n",
        "TRANSLATION_12": "And O my people! I ask you for no wealth in return: my reward is from none but Allah: But I will not drive away (in contempt) those who believe: for verily they are to meet their Lord, and ye I see are the ignorant ones!\n",
        "TRANSLATION_13": "And O my people! I ask of you no wealth for it, my reward is from none but Allah. I am not going to drive away those who have believed. Surely, they are going to meet their Lord, but I see that you are a people that are ignorant.\n",
        "TRANSLATION_14": "My nation, for this I do not ask you for your wealth for my wage is only with Allah. Nor will I drive away the believers, for they will surely meet their Lord. But, I can see that you are ignorant.\n",
        "TRANSLATION_15": "“O my people! I ask of you no money for it. My reward lies only with God. And I am not about to dismiss those who believed; they will surely meet their Lord. And I see that you are ignorant people.”\n",
        "TRANSLATION_16": "And O my people, I ask not of you for it any wealth. My reward is not but from Allah. And I am not one to drive away those who have believed. Indeed, they will meet their Lord, but I see that you are a people behaving ignorantly.\n",
        "TRANSLATION_17": "[11:29] And O my people, I do not ask of you any wealth, which you should give me, for this, for conveying the Message. My wage, my reward, falls only upon God and I will not drive away those who believe, as you have commanded me; they shall surely meet their Lord, at the Resurrection, and He will requite them and exact vengeance for them from those who wronged them and drove them away. But I see you are a people who are ignorant, of the consequence of your affair.\n",
        "TRANSLATION_18": "(And my people! I ask of you no wealth) price (therefore) in exchange for believing in Allah's divine Oneness. (My reward is the concern only of Allah, and I am not going to thrust away those who believe) because of what you say. (Lo! they have to meet their Lord) and report me to Him, (but I see you a folk that are ignorant) of the command of Allah.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "11:29",
            "11:51",
            "43:88",
            "10:84",
            "11:30",
            "11:88",
            "12:37",
            "9:56",
            "11:92",
            "11:63"
        ],
        "BIBLE": [
            "prophets:jeremiah:23:2",
            "prophets:ii%20kings:1:6",
            "prophets:hosea:6:3",
            "torah:numbers:22:6",
            "prophets:ii%20samuel:7:23",
            "prophets:ezekiel:36:22",
            "prophets:isaiah:40:10",
            "writings:i%20chronicles:17:21",
            "prophets:i%20kings:11:2",
            "torah:numbers:22:11"
        ]
    }
}