{
    "VERSE": "11:33",
    "ARABIC": "قَالَ إِنَّمَا يَأْتِيكُم بِهِ ٱللَّهُ إِن شَآءَ وَمَآ أَنتُم بِمُعْجِزِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "He said, 'Allah will bring it to you if He wills and you will not be able to prevent it.",
        "TRANSLATION_1": "He replied: \"Only God will bring it on you if He please, and you cannot prevail against Him.\n",
        "TRANSLATION_2": "Noah said: 'Only Allah will bring it upon you if He so wills, and you will be utterly unable to frustrate that.\n",
        "TRANSLATION_3": "(Noah) replied, \"God will bring torment down on you whenever He wants and you will not be able to make His (plans) fail.\n",
        "TRANSLATION_4": "He said, “Allah will surely bring that upon you if He wills, and you will not be able to escape.”\n",
        "TRANSLATION_5": "He said: \"Only Allah will bring it (the punishment) on you, if He wills, and then you will escape not.\n",
        "TRANSLATION_6": "He said: Allah only will bring it to you if He please, and you will not escape:\n",
        "TRANSLATION_7": "He said, 'God will bring you it if He will; you cannot frustrate Him.\n",
        "TRANSLATION_8": "He said: Only Allah will bring it upon you if He will, and ye can by no means escape.\n",
        "TRANSLATION_9": "He said, \"It is God who will bring it down upon you, if He wishes, and you will not be able to escape.\n",
        "TRANSLATION_10": "He said: only Allah will bring it on you if He will, and ye shall not escape.\n",
        "TRANSLATION_11": "He said, ‘Allah will indeed bring it on you if He wishes, and you cannot frustrate [Him].\n",
        "TRANSLATION_12": "He said: \"Truly, Allah will bring it on you if He wills,- and then, ye will not be able to frustrate it!\n",
        "TRANSLATION_13": "He said: \"Only Allah will bring it (the punishment) on you, if He will, and then you will escape not.\n",
        "TRANSLATION_14": "He replied: 'Allah will bring it (down) upon you if He will; you will never frustrate Him.\n",
        "TRANSLATION_15": "He said, “It is God who will bring it upon you, if He wills, and you will not be able to escape.”\n",
        "TRANSLATION_16": "He said, \"Allah will only bring it to you if He wills, and you will not cause [Him] failure.\n",
        "TRANSLATION_17": "[11:33] He said, ‘Only God will bring it upon you, if He wills, to hasten it on for you, for the decision is His, not mine; and you cannot escape Him, elude God.\n",
        "TRANSLATION_18": "(He said) Noah said: (Only Allah will bring it Upon you) he said: the One who will bring chastisement on you is Allah (if He will) to punish you, (and ye can by no means escape) His chastisement.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "11:33",
            "2:15",
            "16:19",
            "3:158",
            "37:152",
            "72:7",
            "9:56",
            "37:96",
            "53:62",
            "21:68"
        ],
        "BIBLE": [
            "writings:i%20chronicles:21:3",
            "torah:deuteronomy:30:12",
            "torah:genesis:2:18",
            "torah:exodus:32:23",
            "prophets:ii%20samuel:3:13",
            "writings:nehemiah:2:4",
            "prophets:jeremiah:3:16",
            "torah:deuteronomy:30:13",
            "prophets:ii%20samuel:15:14",
            "torah:genesis:9:12"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:5",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:4:10"
        ]
    }
}