{
    "VERSE": "11:35",
    "ARABIC": "أَمْ يَقُولُونَ ٱفْتَرَىٰهُ قُلْ إِنِ ٱفْتَرَيْتُهُۥ فَعَلَىَّ إِجْرَامِى وَأَنَا۠ بَرِىٓءٌ مِّمَّا تُجْرِمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Or do they say, 'He has invented it'? Say: 'If I have invented it the crime will be laid at my door, but I am innocent of the crimes which you commit.'",
        "TRANSLATION_1": "Do they say you have fabricated it? Tell them: \"If I have fabricated it, then mine is the guilt; but I am clear of what you are guilty.\"\n",
        "TRANSLATION_2": "(O Muhammad!) Do they say that he himself has forged this message? Tell them: 'If I have forged this, the guilt of it will fall upon me, but I am not responsible for the crimes you are committing.\n",
        "TRANSLATION_3": "Do they say that Muhammad has falsely ascribed (the Quran) to God? (Muhammad), tell them \"Had I falsely ascribed it to God, I shall be responsible for my own sins. I am certainly not responsible for whatever sins you commit!\n",
        "TRANSLATION_4": "What! They dare say that, “He has fabricated it”? Say, “If I may have fabricated it, then my sin is upon me, and I am unconcerned with your sins.”\n",
        "TRANSLATION_5": "Or they (the pagans of Makkah) say: \"He has fabricated it.\" Say: \"If I have fabricated it, upon me be my crimes, but I am innocent of (all) those crimes which you commit.\n",
        "TRANSLATION_6": "Or do they say: He has forged it? Say: If I have forged it, on me is my guilt, and I am clear of that of which you are guilty.\n",
        "TRANSLATION_7": "(Or do they say, 'He has forged it'? Say: 'If I have forged it, upon me falls my sin; and I am quit of the sins you do.')\n",
        "TRANSLATION_8": "Or say they (again): He hath invented it? Say: If I have invented it, upon me be my crimes, but I am innocent of (all) that ye commit.\n",
        "TRANSLATION_9": "If they say, \"He has invented it himself,\" say to them, \"If I have indeed invented this myself, then may I be punished for my sin; I am innocent of the crimes that you commit.\"\n",
        "TRANSLATION_10": "Or say they: he hath fabricated it? Say thou: on me then be my guilt, and I am quit of that whereof ye are guilty.\n",
        "TRANSLATION_11": "Do they say, ‘He has fabricated it?’ Say, ‘Should I have fabricated it, then my guilt will be upon me, and I am absolved of your guilty conduct.’\n",
        "TRANSLATION_12": "Or do they say, \"He has forged it\"? Say: \"If I had forged it, on me were my sin! and I am free of the sins of which ye are guilty!\n",
        "TRANSLATION_13": "Or they (the pagans of Makkah) say: \"He (Muhammad SAW) has fabricated it (the Quran).\" Say: \"If I have fabricated it, upon me be my crimes, but I am innocent of (all) those crimes which you commit.\"\n",
        "TRANSLATION_14": "Or do they say: 'He has fabricated it (himself)' Say: 'If I had fabricated it, then the sin rests upon me. I reject the sins you do'\n",
        "TRANSLATION_15": "Or do they say, “He made it up?” Say, “If I made it up, upon me falls my crime, and I am innocent of the crimes you commit.”\n",
        "TRANSLATION_16": "Or do they say [about Prophet Muhammad], \"He invented it\"? Say, \"If I have invented it, then upon me is [the consequence of] my crime; but I am innocent of what [crimes] you commit.\"\n",
        "TRANSLATION_17": "[11:35] God, exalted be He, says: Or do they, the disbelievers of Mecca, say, ‘He has invented it’?, Muhammad (s) has invented the Qur’ān? Say: ‘If I have invented it, then my crime will be upon me, my sin [will be upon me], that is, the punishment for it; and I am innocent of what you commit’, of crime, when you attribute invention to me.\n",
        "TRANSLATION_18": "(Or say they (again)) indeed the people of Noah say: (He hath invented it) Noah has invented that which he has brought us? (Say) to them, Noah: (If I have invented it, upon me be my crimes) my sins, (but I am innocent of (all) that ye commit) of crimes. It is said that this verse was revealed about Muhammad (pbuh).\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "11:35",
            "26:216",
            "10:41",
            "51:45",
            "21:109",
            "43:26",
            "44:21",
            "23:110",
            "11:54",
            "20:13"
        ],
        "BIBLE": [
            "writings:ii%20chronicles:25:16",
            "prophets:amos:8:14",
            "torah:numbers:16:22",
            "writings:ruth:3:18",
            "prophets:jeremiah:16:10",
            "writings:job:1:16",
            "writings:psalms:5:11",
            "prophets:ezekiel:13:12",
            "writings:esther:6:13",
            "prophets:jeremiah:8:4"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:4"
        ]
    }
}