{
    "VERSE": "11:37",
    "ARABIC": "وَٱصْنَعِ ٱلْفُلْكَ بِأَعْيُنِنَا وَوَحْيِنَا وَلَا تُخَٰطِبْنِى فِى ٱلَّذِينَ ظَلَمُوٓا۟ إِنَّهُم مُّغْرَقُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Build the Ark under Our supervision and as We reveal and do not address Me concerning the wrongdoers. They shall be drowned.'",
        "TRANSLATION_1": "Build an ark under Our eye and as We instruct. Do not plead for those who have been wicked, for they shall certainly be drowned.\"\n",
        "TRANSLATION_2": "and build the Ark under Our eyes and Our direction. And do not supplicate Me concerning those who have engaged in wrong-doing. They are doomed to be drowned.\n",
        "TRANSLATION_3": "but to build the Ark under the supervision and guidance of his Lord. He was also told not to address any words to Him concerning the unjust for they were all to be drowned.\n",
        "TRANSLATION_4": "“And build the ship in front of Us, and by Our command, and do not speak to Me regarding the unjust; they will surely be drowned.”\n",
        "TRANSLATION_5": "And construct the ship under Our Eyes and with Our revelation, and address Me not on behalf of those who did wrong; they are surely to be drowned.\"\n",
        "TRANSLATION_6": "And make the ark before Our eyes and (according to) Our revelation, and do not speak to Me in respect of those who are unjust; surely they shall be drowned.\n",
        "TRANSLATION_7": "Make thou the Ark under Our eyes, and as We reveal; and address Me not concerning those who have done evil; they shall be drowned.'\n",
        "TRANSLATION_8": "Build the ship under Our eyes and by Our inspiration, and speak not unto Me on behalf of those who do wrong. Lo! they will be drowned.\n",
        "TRANSLATION_9": "Build the Ark under Our eyes and in accordance with Our revelation. Do not plead with Me concerning the evil-doers. They shall certainly be drowned.\"\n",
        "TRANSLATION_10": "And make thou the ark under Our eyes and Our Revelation; and address Me not regarding those that have done wrong; verily they are to be drowned.\n",
        "TRANSLATION_11": "Build the ark before Our eyes and by Our revelation, and do not plead with Me for those who are wrongdoers: they shall indeed be drowned.’\n",
        "TRANSLATION_12": "But construct an Ark under Our eyes and Our inspiration, and address Me no (further) on behalf of those who are in sin: for they are about to be overwhelmed (in the Flood).\"\n",
        "TRANSLATION_13": "And construct the ship under Our Eyes and with Our Inspiration, and address Me not on behalf of those who did wrong; they are surely to be drowned.\"\n",
        "TRANSLATION_14": "Build the Ark with Our seeing (and protection), and as We reveal. Do not speak to Me concerning the evildoers; they shall be drowned'\n",
        "TRANSLATION_15": "“And build the Ark, under Our eyes, and with Our inspiration, and do not address Me regarding those who did wrong; they are to be drowned.”\n",
        "TRANSLATION_16": "And construct the ship under Our observation and Our inspiration and do not address Me concerning those who have wronged; indeed, they are [to be] drowned.\"\n",
        "TRANSLATION_17": "[11:37] Build the Ark, the ship, under Our eyes, under Our watch and protection, and by Our inspiration, [by] Our command, and do not address Me concerning those who have done evil, [those who] have disbelieved, [by asking] that I should refrain from destroying them; lo! they shall be drowned’.\n",
        "TRANSLATION_18": "(Build the ship) start the construction of the ship (under Our Eyes) under Our care (and by Our inspiration) and by Our command, (and speak not unto Me) plead not with Me (on behalf of those who do wrong) about saving those disbelieved. (Lo! they will be drowned) by the flood.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "11:37",
            "23:27",
            "7:64",
            "83:28",
            "21:45",
            "26:119",
            "10:7",
            "77:41",
            "18:101",
            "15:88"
        ],
        "BIBLE": [
            "torah:exodus:30:37",
            "torah:numbers:5:7",
            "writings:psalms:32:5",
            "writings:job:40:27",
            "writings:daniel:2:9",
            "torah:numbers:12:6",
            "torah:exodus:34:10",
            "prophets:ezekiel:12:23",
            "torah:deuteronomy:4:25",
            "prophets:ii%20samuel:7:21"
        ]
    }
}