{
    "VERSE": "11:39",
    "ARABIC": "فَسَوْفَ تَعْلَمُونَ مَن يَأْتِيهِ عَذَابٌ يُخْزِيهِ وَيَحِلُّ عَلَيْهِ عَذَابٌ مُّقِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "You will soon know who will receive a punishment which disgraces him and find unleashed against himself an everlasting punishment.'",
        "TRANSLATION_1": "You will soon come to know who suffers the punishment that would put him to shame, and who suffers lasting torment.\"\n",
        "TRANSLATION_2": "You will come to know who will be struck by a humiliating chastisement, and who will be subjected to an unceasing torment.\n",
        "TRANSLATION_3": "You will soon learn who will face a humiliating punishment and will be encompassed by an everlasting torment.\"\n",
        "TRANSLATION_4": "“So now you will come to know – upon whom comes the punishment that disgraces him, and upon whom descends the punishment that continues forever.”\n",
        "TRANSLATION_5": "And you will know who it is on whom will come a torment that will cover him with disgrace and on whom will fall a lasting torment.\"\n",
        "TRANSLATION_6": "So shall you know who it is on whom will come a chastisement which will disgrace him, and on whom will lasting chastisement come down.\n",
        "TRANSLATION_7": "and you shall know to whom will come a chastisement degrading him, and upon whom there shall alight a lasting chastisement.'\n",
        "TRANSLATION_8": "And ye shall know to whom a punishment that will confound him cometh, and upon whom a lasting doom will fall.\n",
        "TRANSLATION_9": "you will soon come to know who will receive a humiliating punishment, and find unleashed against him an everlasting punishment.\"\n",
        "TRANSLATION_10": "So presently ye shall know on whom cometh a torment that humiliateth him, and on whom is let loose a torment lasting.\n",
        "TRANSLATION_11": "Soon you will know whom a disgraceful punishment will overtake and on whom a lasting punishment will descend.’\n",
        "TRANSLATION_12": "But soon will ye know who it is on whom will descend a penalty that will cover them with shame,- on whom will be unloosed a penalty lasting:\"\n",
        "TRANSLATION_13": "And you will know who it is on whom will come a torment that will cover him with disgrace and on whom will fall a lasting torment.\"\n",
        "TRANSLATION_14": "You shall know to whom a degrading punishment will come, and upon whom an everlasting punishment will fall'\n",
        "TRANSLATION_15": "“You will surely know upon whom will come a torment that will abase him, and upon whom will fall a lasting torment.”\n",
        "TRANSLATION_16": "And you are going to know who will get a punishment that will disgrace him [on earth] and upon whom will descend an enduring punishment [in the Hereafter].\"\n",
        "TRANSLATION_17": "[11:39] and you shall know to whom (man introduces the relative clause which constitutes the direct object of the [action of] ‘knowing’) will come a chastisement degrading him, and upon whom an enduring, an everlasting, chastisement will fall’.\n",
        "TRANSLATION_18": "(And ye shall know to whom a punishment that will confound) humiliate and destroy (him cometh, and upon whom a lasting doom) in the Hereafter (will fall) will be enjoined upon.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "11:39",
            "39:40",
            "37:9",
            "20:48",
            "19:79",
            "22:4",
            "11:93",
            "70:1",
            "29:21",
            "70:27"
        ],
        "BIBLE": [
            "prophets:hosea:6:3",
            "writings:proverbs:10:8",
            "prophets:joshua:2:5",
            "torah:genesis:9:23",
            "prophets:ii%20samuel:3:25",
            "prophets:judges:13:20",
            "prophets:ezekiel:13:14",
            "prophets:micah:3:7",
            "torah:genesis:15:12",
            "prophets:jeremiah:44:12"
        ]
    }
}