{
    "VERSE": "11:44",
    "ARABIC": "وَقِيلَ يَٰٓأَرْضُ ٱبْلَعِى مَآءَكِ وَيَٰسَمَآءُ أَقْلِعِى وَغِيضَ ٱلْمَآءُ وَقُضِىَ ٱلْأَمْرُ وَٱسْتَوَتْ عَلَى ٱلْجُودِىِّ وَقِيلَ بُعْدًا لِّلْقَوْمِ ٱلظَّٰلِمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "It was said, 'Earth, swallow up your water!' and, 'Heaven, hold back your rain!' And the water subsided and the affair was concluded and the Ark came to land on al-Judi. And it was said, 'Away with the people of the wrongdoers!'",
        "TRANSLATION_1": "Then it was said: \"O earth, swallow back your water; and, O sky, desist.\" And the water subsided, and the decree was accomplished. The ark came to rest on Judi (Mount Ararat), and it was said: \"Away with the cursed people!\"\n",
        "TRANSLATION_2": "And the command was given: 'Earth! Swallow up your water'; and: 'Heaven! Abate!' So the water subsided, the command was fulfilled, and the Ark settled on Mount Judi, and it was said: 'Away with the wrong-doing folk!'\n",
        "TRANSLATION_3": "Then the earth was told to swallow-up its water and the sky was ordered to stop raining. The water abated and God's command had been fulfilled. The Ark came to rest on Mount Judi. A voice said, \"The unjust people are far away from the mercy of God.\"\n",
        "TRANSLATION_4": "And it was commanded, “O earth, swallow your water and, O sky, stop” – and the water was dried up and the matter was completed – and the ship stopped upon the mount Al-Judi and it was said, “Away with the unjust nation!”\n",
        "TRANSLATION_5": "And it was said: \"O earth! Swallow up your water, and O sky! Withhold (your rain).\" And the water was made to subside and the decree was fulfilled. And it rested on (Mount) Judi, and it was said: \"Away with the people who are wrongdoing!\"\n",
        "TRANSLATION_6": "And it was said: O earth, swallow down your water, and O cloud, clear away; and the water was made to abate and the affair was decided, and the ark rested on the Judi, and it was said: Away with the unjust people.\n",
        "TRANSLATION_7": "And it was said, 'Earth, swallow thy waters; and, heaven, abate!' And the waters subsided, the affair was accomplished, and the Ark settled on El-Judi, and it was said: 'Away with the people of the evildoers!'\n",
        "TRANSLATION_8": "And it was said: O earth! Swallow thy water and, O sky! be cleared of clouds! And the water was made to subside. And the commandment was fulfilled. And it (the ship) came to rest upon (the mount) Al-Judi and it was said: A far removal for wrongdoing folk!\n",
        "TRANSLATION_9": "A voice cried out, \"Earth, swallow up your waters. O sky, cease your rain.\" The waters receded. The command was fulfilled. The Ark came to rest on Mount Judi. It was said, \"Away with the wrong-doing people.\"\n",
        "TRANSLATION_10": "And it was said: O earth! swallow up thy water, and cease, O heaven! And the water abated; and fulfilled was the decree. And it rested upon the Judi; and it was said: away with the wrong-doing people!\n",
        "TRANSLATION_11": "Then it was said, ‘O earth, swallow your water! O sky, leave off!’ The waters receded; the edict was carried out, and it settled on [Mount] Judi. Then it was said, ‘Away with the wrongdoing lot!’\n",
        "TRANSLATION_12": "Then the word went forth: \"O earth! swallow up thy water, and O sky! Withhold (thy rain)!\" and the water abated, and the matter was ended. The Ark rested on Mount Judi, and the word went forth: \"Away with those who do wrong!\"\n",
        "TRANSLATION_13": "And it was said: \"O earth! Swallow up your water, and O sky! Withhold (your rain).\" And the water was diminished (made to subside) and the Decree (of Allah) was fulfilled (i.e. the destruction of the people of Nuh (Noah). And it (the ship) rested on Mount Judi, and it was said: \"Away with the people who are Zalimun (polytheists and wrong-doing)!\"\n",
        "TRANSLATION_14": "And it was said: 'Earth, swallow up your waters. Heaven, cease' The water subsided and the matter was accomplished. And the Ark came to rest upon (the mountain of) AlJudi, and it was said: 'Be gone, evildoing nation'\n",
        "TRANSLATION_15": "And it was said, “O earth, swallow your waters,” and “O heaven, clear up.” And the waters receded, and the event was concluded, and it settled on Judi, and it was proclaimed: “Away with the wicked people.”\n",
        "TRANSLATION_16": "And it was said, \"O earth, swallow your water, and O sky, withhold [your rain].\" And the water subsided, and the matter was accomplished, and the ship came to rest on the [mountain of] Judiyy. And it was said, \"Away with the wrongdoing people.\"\n",
        "TRANSLATION_17": "[11:44] And it was said, ‘O earth, swallow your waters, that have sprung forth from you — and it reabsorbed it [all] except for what came down from the sky and formed rivers and seas — and O heaven, abate!’, withhold the   rain, and it did. And the waters subsided, decreased. And the affair was accomplished, the matter of the destruction of Noah’s people was complete, and it settled, [and] the ship came to rest, upon al-Jūdī, a mountain in Mespotamia (al-jazīra), near Mosul; and it was said: ‘Away with — perish — the evildoing, the disbelieving, folk!’\n",
        "TRANSLATION_18": "(And it was said: earth! Swallow your water) dry your water (and, sky! be cleared of clouds!) stop your 231 rain! (And the water was made to subside. And the commandment was fulfilled) the destruction of those people was accomplished, i.e. those who were supposed to be destroyed were destroyed and those who were supposed to be saved were saved. (And it) the ship (came to rest upon (the mount) Al-Judi) a mountain in Nisibin in the land of Mosul (and it was said: A far removal) from Allah's mercy (for wrong-doing folk!) for the idolaters, the people of Noah.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "11:44",
            "16:65",
            "57:5",
            "3:109",
            "54:12",
            "12:9",
            "2:117",
            "44:29",
            "30:24",
            "23:18"
        ],
        "BIBLE": [
            "torah:deuteronomy:5:19",
            "torah:deuteronomy:9:23",
            "writings:ezra:5:12",
            "torah:deuteronomy:26:14",
            "prophets:jeremiah:25:31",
            "torah:exodus:24:3",
            "writings:ii%20chronicles:35:21",
            "prophets:i%20kings:18:26",
            "torah:deuteronomy:26:13",
            "prophets:i%20kings:21:13"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:3"
        ]
    }
}