{
    "VERSE": "11:47",
    "ARABIC": "قَالَ رَبِّ إِنِّىٓ أَعُوذُ بِكَ أَنْ أَسْـَٔلَكَ مَا لَيْسَ لِى بِهِۦ عِلْمٌ وَإِلَّا تَغْفِرْ لِى وَتَرْحَمْنِىٓ أَكُن مِّنَ ٱلْخَٰسِرِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "He said, 'My Lord, I seek refuge with You from asking You for anything about which I have no knowledge. If You do not forgive me and have mercy on me, I will be among the lost.'",
        "TRANSLATION_1": "Preserve me, O Lord,\" said (Noah), \"from asking You that of which I have no knowledge. If You do not forgive me and have mercy on me I shall be among those who perish.\"\n",
        "TRANSLATION_2": "Noah said: 'My Lord! I take refuge with You that I should ask you for that concerning which I have no knowledge. And if You do not forgive me and do not show mercy to me, I shall be among the losers.\n",
        "TRANSLATION_3": "Noah said, \"Lord, I ask You to prevent me from asking You ignorant questions and beg you for pardon and mercy or else I shall certainly be lost\".\n",
        "TRANSLATION_4": "He submitted, “My Lord! I seek your refuge from asking you the thing of which I do not have knowledge; and if You do not forgive me and do not have mercy on me, I would then be a loser.”\n",
        "TRANSLATION_5": "Nuh said: \"O my Lord! I seek refuge with You from asking You that of which I have no knowledge. And unless You forgive me and have mercy on me, I would indeed be one of the losers.\"\n",
        "TRANSLATION_6": "He said: My Lord! I seek refuge in Thee from asking Thee that of which I have no knowledge; and if Thou shouldst not forgive me and have mercy on me, I should be of the losers.\n",
        "TRANSLATION_7": "He said, 'My Lord, I take refuge with Thee, lest I should ask of Thee that whereof I have no knowledge; for if Thou forgivest me not, and hast not mercy on me, I shall be among the losers.'\n",
        "TRANSLATION_8": "He said: My Lord! Lo! in Thee do I seek refuge (from the sin) that I should ask of Thee that whereof I have no knowledge. Unless Thou forgive me and have mercy on me I shall be among the lost.\n",
        "TRANSLATION_9": "He said, \"My Lord, I take refuge with You from asking You something of which I have no knowledge. If You do not forgive me and show me mercy, I shall be one of the losers.\"\n",
        "TRANSLATION_10": "Nuh said: my Lord! verily take refuge with Thee lest I may ask Thee that whereof I have no knowledge. And if Thou forgivest me not and hast not mercy on me, I shall be of the losers.\n",
        "TRANSLATION_11": "He said, ‘My Lord! I seek Your protection lest I should ask You something of which I have no knowledge. If You do not forgive me and have mercy upon me I shall be among the losers.’\n",
        "TRANSLATION_12": "Noah said: \"O my Lord! I do seek refuge with Thee, lest I ask Thee for that of which I have no knowledge. And unless thou forgive me and have Mercy on me, I should indeed be lost!\"\n",
        "TRANSLATION_13": "Nuh (Noah) said: \"O my Lord! I seek refuge with You from asking You that of which I have no knowledge. And unless You forgive me and have Mercy on me, I would indeed be one of the losers.\"\n",
        "TRANSLATION_14": "He said: 'My Lord, I seek refuge with You from asking You of that which I have no knowledge. If You do not forgive me and have mercy on me, I shall be among the losers'\n",
        "TRANSLATION_15": "He said, “O My Lord, I seek refuge with You, from asking You about what I have no knowledge of. Unless You forgive me, and have mercy on me, I will be one of the losers.”\n",
        "TRANSLATION_16": "[Noah] said, \"My Lord, I seek refuge in You from asking that of which I have no knowledge. And unless You forgive me and have mercy upon me, I will be among the losers.\"\n",
        "TRANSLATION_17": "[11:47] He said, ‘My Lord, I seek refuge in You, from [the sin], that I should ask of You that whereof I have no knowledge. Unless You forgive me, my excess, and have mercy on me I shall be among the losers’.\n",
        "TRANSLATION_18": "(He said) Noah said: (My Lord!) my Lord! (Lo! in Thee do I seek refuge (from the sin) that I should ask of Thee) to save (that whereof I have no knowledge) that he deserves to be saved. (Unless Thou forgive me) Noah says: unless you overlook my error (and have mercy on me) such that You do not punish me (I shall be among the lost) through being punished.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "11:47",
            "36:27",
            "10:40",
            "6:117",
            "26:23",
            "26:188",
            "44:20",
            "53:30",
            "26:180",
            "26:164"
        ],
        "BIBLE": [
            "writings:psalms:32:5",
            "torah:genesis:19:21",
            "prophets:ii%20kings:2:10",
            "torah:genesis:22:16",
            "prophets:ii%20kings:17:12",
            "writings:daniel:12:8",
            "prophets:jonah:4:2",
            "torah:exodus:33:17",
            "prophets:i%20samuel:3:17",
            "writings:psalms:40:12"
        ]
    }
}