{
    "VERSE": "11:50",
    "ARABIC": "وَإِلَىٰ عَادٍ أَخَاهُمْ هُودًا قَالَ يَٰقَوْمِ ٱعْبُدُوا۟ ٱللَّهَ مَا لَكُم مِّنْ إِلَٰهٍ غَيْرُهُۥٓ إِنْ أَنتُمْ إِلَّا مُفْتَرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "And to 'Ad We sent their brother Hud. He said, 'My people! worship Allah. You have no god apart from Him. You are merely fabricators.",
        "TRANSLATION_1": "We sent to the people of 'Ad their brother Hud, who said: \"O my people, worship God; you have no other god but He. (As for the idols,) you are only inventing lies.\n",
        "TRANSLATION_2": "And to 'Ad We sent their brother Hud. He said: 'My people! Serve Allah: you have no god save Him. (In attributing partners to Allah) you have merely been fabricating lies.\n",
        "TRANSLATION_3": "To the tribe of Ad We sent their brother Hud who told them, \"Worship God; He is your only Lord. The idols that you worship are plainly false.\n",
        "TRANSLATION_4": "And towards the people of A’ad, their fellow man Hud; he said, “O my people! Worship Allah – there is no other True God except Him; you are purely fabricators.”\n",
        "TRANSLATION_5": "And to the `Ad (people We sent) their brother Hud. He said, \"O my people! Worship Allah! You have no other god but Him. Certainly, you do nothing but invent lies!\n",
        "TRANSLATION_6": "And to Ad (We sent) their brother Hud. He said: O my people! serve Allah, you have no god other than He; you are nothing but forgers (of lies).\n",
        "TRANSLATION_7": "And to Ad their brother Hood; he said, 'O my people, serve God! You have no god other than He; you are but forgers.\n",
        "TRANSLATION_8": "And unto (the tribe of) A'ad (We sent) their brother, Hud. He said: O my people! Serve Allah! Ye have no other Allah save Him. Lo! ye do but invent.\n",
        "TRANSLATION_9": "To 'Ad We sent their brother Hud. He said, \"O my people, worship God alone; you have no god but Him. You do nothing but fabricate lies.\n",
        "TRANSLATION_10": "And unto 'Aad We sent their brother Hud. He said: O my people! worship Allah; ` there is no god for you but he; ye are but fabricators.\n",
        "TRANSLATION_11": "And to ‘Ad [We sent] Hud, their brother. He said, ‘O my people! Worship Allah. You have no other god besides Him: you merely fabricate [the deities that you worship].\n",
        "TRANSLATION_12": "To the 'Ad People (We sent) Hud, one of their own brethren. He said: \"O my people! worship Allah! ye have no other god but Him. (Your other gods) ye do nothing but invent!\n",
        "TRANSLATION_13": "And to 'Ad (people We sent) their brother Hud. He said, \"O my people! Worship Allah! You have no other Ilah (God) but Him. Certainly, you do nothing but invent (lies)!\n",
        "TRANSLATION_14": "To Aad (We sent) their brother Hood. He said: 'My nation, worship Allah; you have no god except He. You are only forgers.\n",
        "TRANSLATION_15": "And to Aad, their brother Hud. He said, “O my people, worship God, you have no other god besides Him. You do nothing but invent lies.”\n",
        "TRANSLATION_16": "And to 'Aad [We sent] their brother Hud. He said, \"O my people, worship Allah; you have no deity other than Him. You are not but inventors [of falsehood].\n",
        "TRANSLATION_17": "[11:50] And, We sent, to ‘Ād their brother, from the tribe, Hūd. He said, ‘O my people, worship God!, affirm His Oneness. You have no god (min ilāhin: min is extra) other than He. You, in your worship of graven images, do but invent, [you do but] invent lies against God.\n",
        "TRANSLATION_18": "(And unto (the tribe of) 'Aad) and We sent to 'Aad (their brother) their Prophet, (Hud. He said: O my people! Serve Allah!) confess Allah's divine Oneness (ye have no other God save Him) save the One I am 232 commanding you to believe in. (Lo! ye do) in your worship of idols (but invent!) lies about Allah for He never commanded you to worship them.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "11:50",
            "7:65",
            "23:23",
            "11:61",
            "11:84",
            "12:87",
            "7:59",
            "11:63",
            "11:30",
            "29:16"
        ],
        "BIBLE": [
            "prophets:ii%20kings:17:12",
            "torah:exodus:3:12",
            "prophets:joshua:24:16",
            "prophets:joshua:24:19",
            "torah:exodus:10:7",
            "prophets:joshua:24:21",
            "torah:exodus:9:1",
            "torah:exodus:7:16",
            "prophets:ii%20kings:22:15",
            "writings:ii%20chronicles:34:23"
        ]
    }
}