{
    "VERSE": "11:53",
    "ARABIC": "قَالُوا۟ يَٰهُودُ مَا جِئْتَنَا بِبَيِّنَةٍ وَمَا نَحْنُ بِتَارِكِىٓ ءَالِهَتِنَا عَن قَوْلِكَ وَمَا نَحْنُ لَكَ بِمُؤْمِنِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "They said, 'Hud, you have not brought us any clear sign. We will not forsake our gods for what you say. We do not believe you.",
        "TRANSLATION_1": "They said: \"O Hud, you have come to us with no proofs. We shall not abandon our gods because you say so, nor believe in you.\n",
        "TRANSLATION_2": "They said: 'O Hud! You have not brought to us any clear evidence, and we are not going to forsake our gods merely because you say so. We are not going to believe you.\n",
        "TRANSLATION_3": "They said, \"Hud, you have not shown us any miracles. We shall not give up our idols because of what you say and we shall not have any faith in you.\n",
        "TRANSLATION_4": "They said, “O Hud! You have not come to us with any proof and we will not forsake our deities upon your saying, nor will we believe you.”\n",
        "TRANSLATION_5": "They said: \"O Hud! No evidence have you brought us, and we shall not leave our gods for your (mere) saying! And we are not believers in you.\n",
        "TRANSLATION_6": "They said: O Hud! you have not brought to us any clear argument and we are not going to desert our gods for your word, and we are not believers in you:\n",
        "TRANSLATION_7": "They said, 'Hood, thou hast not brought us a clear sign, and we will not leave our gods for what thou sayest; we do not believe thee.\n",
        "TRANSLATION_8": "They said: O Hud! Thou hast brought us no clear proof and we are not going to forsake our gods on thy (mere) saying, and we are not believers in thee.\n",
        "TRANSLATION_9": "They replied, \"Hud, you have not brought us any clear evidence and we shall not forsake our deities merely at your behest, nor will we believe in you.\n",
        "TRANSLATION_10": "They sai: O Hud! thou hast not brought us an evidence, and we are not going to abandon our gods thy saying, nor are we going to be believers in thee.\n",
        "TRANSLATION_11": "They said, ‘O Hud, you have not brought us any manifest proof. We are not going to abandon our gods for what you say, and we are not going to believe you.\n",
        "TRANSLATION_12": "They said: \"O Hud! No Clear (Sign) that hast thou brought us, and we are not the ones to desert our gods on thy word! Nor shall we believe in thee!\n",
        "TRANSLATION_13": "They said: \"O Hud! No evidence have you brought us, and we shall not leave our gods for your (mere) saying! And we are not believers in you.\n",
        "TRANSLATION_14": "They replied: 'Hood, you have not brought us a clear sign. We will not forsake our gods because of what you say. We do not believe you.\n",
        "TRANSLATION_15": "They said, “O Hud, you did not bring us any evidence, and we are not about to abandon our gods at your word, and we are not believers in you.”\n",
        "TRANSLATION_16": "They said, \"O Hud, you have not brought us clear evidence, and we are not ones to leave our gods on your say-so. Nor are we believers in you.\n",
        "TRANSLATION_17": "[11:53] They said, ‘O Hūd, you have not brought us any clear proof, [any] evidence for what you say, and we are not going to forsake our gods on [the basis of] your saying, that is, because of what you say, and we are not believers in you.\n",
        "TRANSLATION_18": "(They said: Hud! Thou hast brought us no clear proof) for what you claim (and we are not going to forsake our gods) the worship of our gods (on thy (mere) saying, and we are not believers in thee) we are not believers in your message.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "11:53",
            "21:62",
            "2:172",
            "2:15",
            "18:43",
            "9:43",
            "6:107",
            "5:87",
            "11:50",
            "22:16"
        ],
        "BIBLE": [
            "prophets:ii%20kings:1:16",
            "writings:i%20chronicles:17:16",
            "prophets:ii%20samuel:7:18",
            "torah:numbers:22:35",
            "prophets:ii%20samuel:7:25",
            "torah:numbers:22:20",
            "writings:ezra:9:10",
            "prophets:i%20kings:17:20",
            "prophets:ii%20kings:2:2",
            "prophets:ezekiel:37:21"
        ]
    }
}