{
    "VERSE": "11:55",
    "ARABIC": "مِن دُونِهِۦ فَكِيدُونِى جَمِيعًا ثُمَّ لَا تُنظِرُونِ",
    "ENGLISH": {
        "TRANSLATION_0": "So scheme against me, all of you together, and then grant me no respite.",
        "TRANSLATION_1": "Apart from Him. Contrive against me as much as you like, and give me no respite.\n",
        "TRANSLATION_2": "others than Him in His divinity. So conspire against me, all of you, and give me no respite.\n",
        "TRANSLATION_3": "with the idols that you worship besides God. So plan against me without delay.\n",
        "TRANSLATION_4": "“Besides Him – therefore all of you scheme against me and do not give me respite.”\n",
        "TRANSLATION_5": "Besides Him (Allah). So plot against me, all of you, and give me no respite.\"\n",
        "TRANSLATION_6": "Besides Him, therefore scheme against me all together; then give me no respite:\n",
        "TRANSLATION_7": "apart from Him; so try your guile on me, all together, then you shall give me no respite.\n",
        "TRANSLATION_8": "Beside Him. So (try to) circumvent me, all of you, give me no respite.\n",
        "TRANSLATION_9": "So scheme against me, all of you together, and then grant me no respite.\n",
        "TRANSLATION_10": "Beside Him, so plot against me all tcgether, and then respite me not.\n",
        "TRANSLATION_11": "besides Him. Now try out your stratagems against me, together, without granting me any respite.\n",
        "TRANSLATION_12": "Other gods as partners! so scheme (your worst) against me, all of you, and give me no respite.\n",
        "TRANSLATION_13": "With Him (Allah). So plot against me, all of you, and give me no respite.\n",
        "TRANSLATION_14": "other than Him, so all of you, scheme against me, then you shall give me no respite.\n",
        "TRANSLATION_15": "Besides Him. So scheme against me, all of you, and do not hesitate.\n",
        "TRANSLATION_16": "Other than Him. So plot against me all together; then do not give me respite.\n",
        "TRANSLATION_17": "[11:55] beside Him; so plot against me, devise ways to destroy me, all together, you and your graven images, then give me no respite, grant me [no] reprieve.\n",
        "TRANSLATION_18": "And I am innocent of your worship of these idols (Beside Him. So (try to) circumvent me) work to destroy me, you and your idols, (all of you, give me no respite) neither delay nor pity on me.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "11:55",
            "43:55",
            "54:44",
            "2:38",
            "7:197",
            "17:56",
            "20:123",
            "4:139",
            "55:62",
            "21:29"
        ],
        "BIBLE": [
            "torah:deuteronomy:6:16",
            "prophets:zephaniah:2:11",
            "prophets:jeremiah:22:9",
            "prophets:ii%20kings:17:38",
            "torah:deuteronomy:5:22",
            "prophets:ii%20kings:10:19",
            "writings:psalms:81:10",
            "writings:ii%20chronicles:32:15",
            "prophets:joshua:23:16",
            "prophets:i%20kings:9:6"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:6:4"
        ]
    }
}