{
    "VERSE": "11:57",
    "ARABIC": "فَإِن تَوَلَّوْا۟ فَقَدْ أَبْلَغْتُكُم مَّآ أُرْسِلْتُ بِهِۦٓ إِلَيْكُمْ وَيَسْتَخْلِفُ رَبِّى قَوْمًا غَيْرَكُمْ وَلَا تَضُرُّونَهُۥ شَيْـًٔا إِنَّ رَبِّى عَلَىٰ كُلِّ شَىْءٍ حَفِيظٌ",
    "ENGLISH": {
        "TRANSLATION_0": "If you turn your backs, I have transmitted to you what I was sent to you with, and my Lord will replace you with another people, and you will not harm Him at all. My Lord is the Preserver of everything.'",
        "TRANSLATION_1": "If you turn away, then (remember) I have delivered to you the message I was sent with. My Lord will put other people in your place, and you will not be able to prevail against Him. Indeed my Lord keeps a watch over all things.\"\n",
        "TRANSLATION_2": "If you, then, turn away (from the truth), know that I have delivered the message with which I was sent to you. Now my Lord will set up another people in place of you and you shall in no way be able to harm Him. Surely my Lord keeps a watch over everything.'\n",
        "TRANSLATION_3": "If you turn away from Him (since I have already preached to you the message that I carry), He will replace you with another nation. You cannot harm Him the least. My Lord is the Protector of all things.\"\n",
        "TRANSLATION_4": "“Then if you turn away, I have conveyed to you what I was sent with towards you; and my Lord will bring others in your stead; and you will not be able to cause Him any harm; indeed my Lord is a Guardian over all things.”\n",
        "TRANSLATION_5": "So if you turn away, still I have conveyed the Message with which I was sent to you. My Lord will make another people succeed you, and you will not harm Him in the least. Surely, my Lord is Guardian over all things.\n",
        "TRANSLATION_6": "But if you turn back, then indeed I have delivered to you the message with which I have been sent to you, and my Lord will bring another people in your place, and you cannot do Him any harm; surely my Lord is the Preserver of all things.\n",
        "TRANSLATION_7": "But if you turn your backs, I have delivered to you that I was sent with unto you, and my Lord will make a people other than you successors; you will not hurt Him anything. My Lord is Guardian over everything.'\n",
        "TRANSLATION_8": "And if ye turn away, still I have conveyed unto you that wherewith I was sent unto you, and my Lord will set in place of you a folk other than you. Ye cannot injure Him at all. Lo! my Lord is Guardian over all things.\n",
        "TRANSLATION_9": "If you turn away, I have conveyed to you the message with which I was sent. My Lord will make another people your successors and you cannot harm Him in the least. For my Lord is guardian over all things.\"\n",
        "TRANSLATION_10": "If then ye turn away, I have surely preached unto you that wherewith I was sent unto you. And my Lord will set up in succession a people other than you, and ye shall not harm Him at all, verily my Lord is over everything a Guardian.\n",
        "TRANSLATION_11": "But if you turn your backs [on me], then [know that] I have communicated to you whatever I was sent to you with. My Lord will make another people succeed you, and you will not hurt Allah in the least. Indeed my Lord is watchful over all things.’\n",
        "TRANSLATION_12": "If ye turn away,- I (at least) have conveyed the Message with which I was sent to you. My Lord will make another people to succeed you, and you will not harm Him in the least. For my Lord hath care and watch over all things.\"\n",
        "TRANSLATION_13": "So if you turn away, still I have conveyed the Message with which I was sent to you. My Lord will make another people succeed you, and you will not harm Him in the least. Surely, my Lord is Guardian over all things.\"\n",
        "TRANSLATION_14": "If you turn away, I have delivered to you that with which I was sent, and my Lord will cause people other than you to be your successors. You cannot harm Him a thing. My Lord is the Guardian over every thing'\n",
        "TRANSLATION_15": "If you turn away, I have conveyed to you what I was sent to you with; and my Lord will replace you with another people, and you will not cause Him any harm. My Lord is Guardian over all things.”\n",
        "TRANSLATION_16": "But if they turn away, [say], \"I have already conveyed that with which I was sent to you. My Lord will give succession to a people other than you, and you will not harm Him at all. Indeed my Lord is, over all things, Guardian.\"\n",
        "TRANSLATION_17": "[11:57] And if you turn away (tawallaw: one of the two tā’ letters [of tatawallaw] has been omitted), that is, if you object, still I have conveyed to you that wherewith I was sent to you, and my Lord will set in place of you a folk other than you. You cannot injure Him in any way, by your idolatry. Truly My Lord is Preserver, Watcher, over all things’.\n",
        "TRANSLATION_18": "(And if ye turn away) from faith and repentance, (still I have conveyed unto you that wherewith I was sent unto you) of the message and about your destruction, (and my Lord will set in place of you a folk other than you) who are better and more obedient than you. (Ye cannot injure Him at all) your destruction will not harm Allah in any way. (Lo! my Lord is Guardian) and Witness (over all things) related to your works.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "11:57",
            "6:80",
            "13:7",
            "11:63",
            "9:39",
            "46:25",
            "6:102",
            "40:27",
            "6:164",
            "23:88"
        ],
        "BIBLE": [
            "prophets:jeremiah:29:14",
            "prophets:isaiah:42:16",
            "prophets:i%20kings:8:47",
            "prophets:jeremiah:27:22",
            "prophets:isaiah:43:19",
            "prophets:zephaniah:3:20",
            "torah:deuteronomy:14:24",
            "writings:i%20chronicles:21:3",
            "writings:daniel:3:29",
            "torah:exodus:23:27"
        ]
    }
}