{
    "VERSE": "11:59",
    "ARABIC": "وَتِلْكَ عَادٌ جَحَدُوا۟ بِـَٔايَٰتِ رَبِّهِمْ وَعَصَوْا۟ رُسُلَهُۥ وَٱتَّبَعُوٓا۟ أَمْرَ كُلِّ جَبَّارٍ عَنِيدٍ",
    "ENGLISH": {
        "TRANSLATION_0": "That was 'Ad. They denied the Signs of their Lord and disobeyed His Messengers and followed the command of every obdurate tyrant.",
        "TRANSLATION_1": "These were the people of 'Ad who denied the word of their Lord and rebelled against His apostles, and followed the bidding of every perverse tyrant.\n",
        "TRANSLATION_2": "Such were 'Ad. They repudiated the signs of their Lord, disobeyed His Messengers, and followed the bidding of every tyrannical enemy of the truth.\n",
        "TRANSLATION_3": "It was the tribe of `Ad who denied the miracles of their Lord, disobeyed His Messenger and followed the orders of every transgressing tyrant.\n",
        "TRANSLATION_4": "And these are the A’ad – they denied the signs of their Lord and disobeyed His Noble Messengers and followed the commands of every stubborn disobedient.\n",
        "TRANSLATION_5": "Such were [the people of] `Ad. They rejected the Ayat of their Lord and disobeyed His Messengers, and followed the command of every proud, obstinate (oppressor of the truth from their leaders).\n",
        "TRANSLATION_6": "And this was Ad; they denied the communications of their Lord, and disobeyed His apostles and followed the bidding of every insolent opposer (of truth).\n",
        "TRANSLATION_7": "That was Ad; they denied the signs of their Lord, and rebelled against His Messengers, and followed the command of every froward tyrant.\n",
        "TRANSLATION_8": "And such were A'ad. They denied the revelations of their Lord and flouted His messengers and followed the command of every froward potentate.\n",
        "TRANSLATION_9": "Such were the 'Ad who denied the signs of their Lord and disobeyed His messengers and followed the bidding of every headstrong enemy of truth.\n",
        "TRANSLATION_10": "And such were 'Aad. They gainsaid the signs of their Lord, and disobeyed His apostles, and followed the bidding of any tyrant froward.\n",
        "TRANSLATION_11": "Such were [the people of] Ad: they impugned the signs of their Lord and disobeyed His apostles, and followed the dictates of every obstinate tyrant.\n",
        "TRANSLATION_12": "Such were the 'Ad People: they rejected the Signs of their Lord and Cherisher; disobeyed His messengers; And followed the command of every powerful, obstinate transgressor.\n",
        "TRANSLATION_13": "Such were 'Ad (people). They rejected the Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) of their Lord and disobeyed His Messengers, and followed the command of every proud obstinate (oppressor of the truth, from their leaders).\n",
        "TRANSLATION_14": "Such was Aad. They disbelieved the verses of their Lord, rebelled against His Messengers, and did the bidding of every rebellious tyrant.\n",
        "TRANSLATION_15": "That was Aad; they denied the signs of their Lord, and defied His messengers, and followed the lead of every stubborn tyrant.\n",
        "TRANSLATION_16": "And that was 'Aad, who rejected the signs of their Lord and disobeyed His messengers and followed the order of every obstinate tyrant.\n",
        "TRANSLATION_17": "[11:59] And that was ‘Ād — [this is] an allusion to their remains; in other words, go forth in the land and look at these [remains]. God then describes their case, saying: they knowingly denied the signs of their Lord and disobeyed His messengers (rusulahu is in the plural, because when a person disobeys a messenger he has [effectively] disobeyed all of them, since they share a common principle in that [Message] with which they come, namely, [the principle of] God’s Oneness); and they, that is, the riffraff, followed the command of every rebellious tyrant, [every] leader of theirs who is obstinate with regard to the truth.\n",
        "TRANSLATION_18": "233 (And such were 'Aad. They denied the revelations of their Lord) which were brought to them by Hud (and flouted His messengers) concerning the declaration of Allah's divine Oneness (and followed the command of every froward) and they followed the words of every tyrant who kills upon being angry (potentate) and who turns away from Allah.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "11:59",
            "14:15",
            "40:35",
            "17:38",
            "57:19",
            "23:58",
            "13:7",
            "21:93",
            "46:25",
            "69:10"
        ],
        "BIBLE": [
            "prophets:isaiah:59:13",
            "prophets:i%20samuel:15:24",
            "prophets:i%20kings:18:21",
            "writings:ii%20chronicles:36:16",
            "writings:ecclesiastes:4:16",
            "torah:exodus:4:30",
            "prophets:i%20samuel:12:14",
            "writings:i%20chronicles:11:2",
            "prophets:i%20kings:18:18",
            "prophets:judges:2:12"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:5:2"
        ]
    }
}