{
    "VERSE": "11:6",
    "ARABIC": "وَمَا مِن دَآبَّةٍ فِى ٱلْأَرْضِ إِلَّا عَلَى ٱللَّهِ رِزْقُهَا وَيَعْلَمُ مُسْتَقَرَّهَا وَمُسْتَوْدَعَهَا كُلٌّ فِى كِتَٰبٍ مُّبِينٍ",
    "ENGLISH": {
        "TRANSLATION_0": "There is no creature on the earth which is not dependent upon Allah for its provision. He knows where it lives and where it dies. They are all in a Clear Book.",
        "TRANSLATION_1": "There is not a creature that moves on the earth whose nourishment is not provided by God, whose place of sojourning and depositing is not known to Him. All things conform to a manifest law.\n",
        "TRANSLATION_2": "There is not a single moving creature on the earth but Allah is responsible for providing its sustenance. He knows where it dwells and where it will permanently rest. All this is recorded in a clear Book.\n",
        "TRANSLATION_3": "There is no living creature on earth that does not receive sustenance from God. He knows its dwelling and resting place. Everything is recorded in the glorious Book.\n",
        "TRANSLATION_4": "And there is none that walks upon the earth whose sustenance does not depend on the mercy of Allah – He knows where it shall stay and where it shall be deposited; everything is in a clearly explaining Book.\n",
        "TRANSLATION_5": "And no moving creature is there on earth but its provision is due from Allah. And He knows its dwelling place and its deposit. All is in a Clear Book.\n",
        "TRANSLATION_6": "And there is no animal in the earth but on Allah is the sustenance of it, and He knows its resting place and its depository all (things) are in a manifest book.\n",
        "TRANSLATION_7": "No creature is there crawling on the earth, but its provision rests on God; He knows its lodging-place and its repository. All is in a Manifest Book.\n",
        "TRANSLATION_8": "And there is not a beast in the earth but the sustenance thereof dependeth on Allah. He knoweth its habitation and its repository. All is in a clear Record.\n",
        "TRANSLATION_9": "There is not a living creature on the earth but it is for God to provide its sustenance. He knows its dwelling and its [final] resting place. All this is recorded in a clear book.\n",
        "TRANSLATION_10": "And there is not a moving creature on the earth but upon Allah is the sustenance thereof, and He knoweth its habitation and its resting-place: everything is in a Book luminous.\n",
        "TRANSLATION_11": "There is no animal on the earth, but that its sustenance lies with Allah, and He knows its [enduring] abode and its temporary place of lodging. Everything is in a manifest Book.\n",
        "TRANSLATION_12": "There is no moving creature on earth but its sustenance dependeth on Allah: He knoweth the time and place of its definite abode and its temporary deposit: All is in a clear Record.\n",
        "TRANSLATION_13": "And no (moving) living creature is there on earth but its provision is due from Allah. And He knows its dwelling place and its deposit (in the uterous, grave, etc.). all is in a Clear Book (Al-Lauh Al-Mahfuz - the Book of Decrees with Allah).\n",
        "TRANSLATION_14": "There is not a crawling (creature) on the earth whose provision is not by Allah. He knows its resting place and its repository. All is in a Clear Book.\n",
        "TRANSLATION_15": "There is no moving creature on earth but its sustenance depends on God. And He knows where it lives and where it rests. Everything is in a Clear Book.\n",
        "TRANSLATION_16": "And there is no creature on earth but that upon Allah is its provision, and He knows its place of dwelling and place of storage. All is in a clear register.\n",
        "TRANSLATION_17": "[11:6] And there is not (wa-mā min: min is extra) a creature (dābba is that [creature] which treads [dabba]) in the earth but the sustenance thereof rests on God, [sustenance] which He has undertaken [to provide], out of His bounty, exalted be He. And He knows its habitation, its dwelling-place in this world — or in the loins — and its repository, after death, or in the womb. All, that which is mentioned, is in a manifest, a clear, Book, which is the Preserved Tablet (al-lawh al-mahfūz).\n",
        "TRANSLATION_18": "226 (And there is not a beast in the earth but the sustenance thereof dependeth on Allah) Allah takes charge of its sustenance. (He knoweth its habitation) when it retires at night (and its repository) when it dies and is buried. (All) i.e. the sustenance of each beast, its lifespan and course (is in a clear record) is recorded in the Guarded Tablet; all this is clear, well known and decreed.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "11:6",
            "57:22",
            "16:49",
            "29:60",
            "27:75",
            "22:70",
            "16:73",
            "50:7",
            "15:19",
            "6:64"
        ],
        "BIBLE": [
            "writings:ezra:4:15",
            "prophets:micah:7:17",
            "prophets:zephaniah:2:11",
            "prophets:ezekiel:26:20",
            "writings:nehemiah:9:3",
            "prophets:ezekiel:42:13",
            "torah:exodus:18:23",
            "writings:ii%20chronicles:34:31",
            "writings:daniel:2:9",
            "writings:daniel:11:38"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:4:2",
            "Sefer%20Yetzirah:4:4"
        ]
    }
}