{
    "VERSE": "11:61",
    "ARABIC": "وَإِلَىٰ ثَمُودَ أَخَاهُمْ صَٰلِحًا قَالَ يَٰقَوْمِ ٱعْبُدُوا۟ ٱللَّهَ مَا لَكُم مِّنْ إِلَٰهٍ غَيْرُهُۥ هُوَ أَنشَأَكُم مِّنَ ٱلْأَرْضِ وَٱسْتَعْمَرَكُمْ فِيهَا فَٱسْتَغْفِرُوهُ ثُمَّ تُوبُوٓا۟ إِلَيْهِ إِنَّ رَبِّى قَرِيبٌ مُّجِيبٌ",
    "ENGLISH": {
        "TRANSLATION_0": "To Thamud We sent their brother Salih. He said, 'My people, worship Allah! You have no god apart from Him. He brought you into being from the earth and made you its inhabitants. So ask His forgiveness and then",
        "TRANSLATION_1": "Be warned! Accursed are the people of 'Ad who were Hud's. To Thamud We Sent their brother Saleh. \"O my people,\" he said, \"worship God; you have no other god but He. It is He who raised you from the earth and settled you upon it. So beg your Lord to forgive you, and turn to Him in repentance. Surely my Lord is near and answers.\"\n",
        "TRANSLATION_2": "And to Thamud We sent their brother Sali'h. He said: 'My people! Serve Allah; you have no god other than Him. He brought you into being out of the earth, and has made you dwell in it. So ask Him to forgive you, and do turn towards Him in repentance. Indeed My Lord is near, responsive to prayers.\n",
        "TRANSLATION_3": "To Thamud We sent their brother Salih who told them, \"My people, worship God; He is your only Lord. It is He who has created you from the earth and has settled you therein. Seek forgiveness from Him and turn to Him in repentance. My Lord is certainly close to everyone and He hears all prayers.\"\n",
        "TRANSLATION_4": "And to the Thamud tribe, We sent their fellow man Saleh; he said, “O my people! Worship Allah, there is no other True God except Him; He created you from the earth and established you in it, so seek forgiveness from Him and incline towards Him in repentance; indeed my Lord is Close, Acceptor of Prayer.”\n",
        "TRANSLATION_5": "And to Thamud (people We sent) their brother Salih. He said: \"O my people! Worship Allah: you have no other god but Him. He brought you forth from the earth and settled you therein, then ask forgiveness of Him and turn to Him in repentance. Certainly, my Lord is Near (to all by His knowledge), Responsive.\"\n",
        "TRANSLATION_6": "And to Samood (We sent) their brother Salih. He said: O my people! serve Allah, you have no god other than He; He brought you into being from the earth, and made you dwell in it, therefore ask forgiveness of Him, then turn to Him; surely my Lord is Nigh, Answering.\n",
        "TRANSLATION_7": "And to Thamood their brother Salih; he said, 'O my people, serve God! You have no god other than He. It is He who produced you from the earth and has given you to live therein; so ask forgiveness of Him, then repent to Him; surely my Lord is nigh, and answers prayer.\n",
        "TRANSLATION_8": "And unto (the tribe of) Thamud (We sent) their brother Salih. He said: O my people! Serve Allah, Ye have no other Allah save Him. He brought you forth from the earth and hath made you husband it. So ask forgiveness of Him and turn unto Him repentant. Lo! my Lord is Nigh, Responsive.\n",
        "TRANSLATION_9": "To the Thamud We sent their brother Salih. He said, \"My people, worship God! You have no god but Him. It was He who brought you into being from the earth and settled you upon it and so ask His forgiveness. Turn to Him in repentance. My Lord is near and responsive.\"\n",
        "TRANSLATION_10": "And unto Thamud We sent their brother Saleh. He said: O my people! worship Allah; there is no god for you but he. He hath caused you to spring out of the earth, and hath made you dwell therein. Wherefore ask forgiveness of Him, then repent toward Him; verily my Lord is Nigh, Responsive.\n",
        "TRANSLATION_11": "And to Thamud [We sent] Salih, their brother. He said, ‘O my people! Worship Allah. You have no other god besides Him. He brought you forth from the earth and made it your habitation. So plead with Him for forgiveness, then turn to Him penitently. My Lord is indeed nearmost [and] responsive.’\n",
        "TRANSLATION_12": "To the Thamud People (We sent) Salih, one of their own brethren. He said: \"O my people! Worship Allah: ye have no other god but Him. It is He Who hath produced you from the earth and settled you therein: then ask forgiveness of Him, and turn to Him (in repentance): for my Lord is (always) near, ready to answer.\"\n",
        "TRANSLATION_13": "And to Thamud (people, We sent) their brother Salih (Saleh). He said: \"O my people! Worship Allah, you have no other Ilah (God) but Him. He brought you forth from the earth and settled you therein, then ask forgiveness of Him and turn to Him in repentance. Certainly, my Lord is Near (to all by His Knowledge), Responsive.\"\n",
        "TRANSLATION_14": "And to Thamood, (We sent) their brother Salih. He said: 'My nation, worship Allah; you have no god except He. It is He who made you from the earth and let you live upon it. Ask His forgiveness then repent to Him. Indeed, my Lord is near and answers (prayers)'\n",
        "TRANSLATION_15": "And to Thamood, their brother Saleh. He said, “O my people, worship God, you have no god other than Him. He initiated you from the earth, and settled you in it. So seek His forgiveness, and repent to Him. My Lord is Near and Responsive.”\n",
        "TRANSLATION_16": "And to Thamud [We sent] their brother Salih. He said, \"O my people, worship Allah; you have no deity other than Him. He has produced you from the earth and settled you in it, so ask forgiveness of Him and then repent to Him. Indeed, my Lord is near and responsive.\"\n",
        "TRANSLATION_17": "[11:61] And, We sent, to Thamūd their brother, from the tribe, Sālih. He said, ‘O my people, worship God!, affirm His Oneness. You have no god other than He. He it is Who produced you, [Who] began your creation, from the earth, by creating your father Adam from it, and has given you to live therein, He has made you inhabitants, living therein; so ask forgiveness of Him, from idolatry, then turn, return, to Him repentant, through [acts of] obedience. Truly my Lord is Near, to His creation by [virtue of] His knowledge, Responsive’, to those who ask of Him.\n",
        "TRANSLATION_18": "(And unto (the tribe of) Thamud) and We sent to Thamud (their brother) their Prophet (Salih. He said: my people! Serve Allah) declare the divine Oneness of Allah, (You have no other God save Him) you have no god except the One in Whom I command you to believe. (He brought you forth from the earth) He created you from Adam and Adam is from the earth (and hath made you husband it) He made you thrive in the earth and made its inhabitants thrive on it too. (So ask forgiveness of Him) confess His divine Oneness (and turn unto Him repentant) turn to Him by believing in His divine Oneness, repenting and being sincere to Him. (Lo, my Lord is Nigh) in His answer, (Responsive) to the one who declares His divine Oneness.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "11:61",
            "7:73",
            "11:50",
            "7:85",
            "7:65",
            "29:36",
            "11:63",
            "11:84",
            "12:87",
            "23:23"
        ],
        "BIBLE": [
            "prophets:jeremiah:35:15",
            "prophets:joshua:22:4",
            "writings:ii%20chronicles:25:9",
            "torah:genesis:27:37",
            "prophets:joshua:23:16",
            "prophets:ezekiel:11:15",
            "torah:deuteronomy:3:20",
            "prophets:ezekiel:3:20",
            "prophets:i%20kings:21:20",
            "torah:exodus:3:12"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:5"
        ]
    }
}