{
    "VERSE": "11:63",
    "ARABIC": "قَالَ يَٰقَوْمِ أَرَءَيْتُمْ إِن كُنتُ عَلَىٰ بَيِّنَةٍ مِّن رَّبِّى وَءَاتَىٰنِى مِنْهُ رَحْمَةً فَمَن يَنصُرُنِى مِنَ ٱللَّهِ إِنْ عَصَيْتُهُۥ فَمَا تَزِيدُونَنِى غَيْرَ تَخْسِيرٍ",
    "ENGLISH": {
        "TRANSLATION_0": "He said, 'My people! What do you think? If I were to possess a Clear Sign from my Lord and He had given me mercy from Him: who would help me against Allah if I disobeyed Him? You would not increase me in anything but loss.",
        "TRANSLATION_1": "He said: \"O my people, have you considered that if my Lord has clearly shown me the way, and I have His blessings too, who will save me then from God if I disobey? You will only add to my ruin.\n",
        "TRANSLATION_2": "Salih said: 'My people! What do you think? If I had a clear evidence from my Lord, and then He also bestowed His mercy upon me, who will rescue me from the punishment of Allah if I still disobey Him? You can only make me lose even more.\n",
        "TRANSLATION_3": "He said, \"My people, think. I have received authoritative evidence and mercy from my Lord, so who will protect me from God if I disobey Him? You certainly want to destroy me.\n",
        "TRANSLATION_4": "He said, “O my people! What is your opinion – if I am on clear proof from my Lord and He has bestowed upon me mercy from Him, so who will rescue me from Allah if I disobey Him? So you will not increase anything for me, except loss!”\n",
        "TRANSLATION_5": "He said: \"O my people! Tell me, if I have a clear proof from my Lord, and there has come to me a mercy from Him, who then can help me against Allah, if I were to disobey Him Then you increase me not but in loss.\"\n",
        "TRANSLATION_6": "He said: O my people! tell me if I have clear proof from my Lord and He has granted to me mercy from Himself-- who will then help me against Allah if I disobey Him? Therefore you do not add to me other than loss:\n",
        "TRANSLATION_7": "He said, 'O my people, what think you? If I stand upon a clear sign from my Lord, and He has given me mercy from Him, who shall help me against God if I rebel against Him? You would do nothing for me, except increase my loss.\n",
        "TRANSLATION_8": "He said: O my people! Bethink you: if I am (acting) on clear proof from my Lord and there hath come unto me a mercy from Him, who will save me from Allah if I disobey Him? Ye would add to me naught save perdition.\n",
        "TRANSLATION_9": "He said, \"O my people, tell me: if I have clear evidence from my Lord, and He has granted His mercy, who then will support me against God, if I disobey Him? You would only make my loss greater.\n",
        "TRANSLATION_10": "He said; O my people! bethink if I rest on an evidence from my Lord, and there hath come to me from Him a mercy, then who will succour me against Allah, if I disobey Him? Ye then increase me not save in loss.\n",
        "TRANSLATION_11": "He said, ‘O my people! Tell me, should I stand on a manifest proof from my Lord, and He has granted me His own mercy, who will protect me from Allah should I disobey Him? For then you will increase me in nothing but loss.\n",
        "TRANSLATION_12": "He said: \"O my people! do ye see? if I have a Clear (Sign) from my Lord and He hath sent Mercy unto me from Himself,- who then can help me against Allah if I were to disobey Him? What then would ye add to my (portion) but perdition?\n",
        "TRANSLATION_13": "He said: \"O my people! Tell me, if I have a clear proof from my Lord, and there has come to me a Mercy (Prophethood, etc.) from Him, who then can help me against Allah, if I were to disobey Him? Then you increase me not but in loss.\n",
        "TRANSLATION_14": "He said: 'My nation, think! If I have a clear proof from my Lord and He has given me His Mercy, who would help me against Allah if I rebel against Him? Indeed, you would do nothing for me except increase my loss'\n",
        "TRANSLATION_15": "He said, “O my people, have you considered? If I stand upon clear evidence from my Lord, and He has given me mercy from Him, who would protect me from God, if I disobeyed Him? You add nothing for me except loss.”\n",
        "TRANSLATION_16": "He said, \"O my people, have you considered: if I should be upon clear evidence from my Lord and He has given me mercy from Himself, who would protect me from Allah if I disobeyed Him? So you would not increase me except in loss.\n",
        "TRANSLATION_17": "[11:63] He said, ‘O my people, have you considered: if I am [acting] upon a clear proof, a [clear] statement, from my Lord, and He has given me from Him mercy, prophethood, who will help me, [who will] defend me, against God, [against] His chastisement, if I disobey Him? You would only be adding, by commanding me to do that, to my loss, [my] misguidance.\n",
        "TRANSLATION_18": "(He said: my people! Bethink you: if I am (acting) on clear proof from my Lord) a clear exposition that has come down from my Lord (and there hath come unto me a mercy from Him) and He has favoured me with prophethood and Islam, (who will save me) who will defend me (from Allah) from Allah's chastisement (if I disobey Him) and shun His command? (Ye would add to me naught save perdition) I only increase in insight about your loss.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "11:63",
            "11:88",
            "11:28",
            "11:30",
            "10:84",
            "23:23",
            "11:61",
            "11:57",
            "11:29",
            "7:65"
        ],
        "BIBLE": [
            "writings:ii%20chronicles:14:6",
            "writings:esther:4:8",
            "prophets:nahum:1:14",
            "torah:exodus:34:10",
            "prophets:joel:2:17",
            "torah:leviticus:10:17",
            "prophets:joshua:7:19",
            "prophets:jeremiah:35:15",
            "prophets:hosea:2:14",
            "prophets:ii%20samuel:22:36"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:5:1"
        ]
    }
}