{
    "VERSE": "11:65",
    "ARABIC": "فَعَقَرُوهَا فَقَالَ تَمَتَّعُوا۟ فِى دَارِكُمْ ثَلَٰثَةَ أَيَّامٍ ذَٰلِكَ وَعْدٌ غَيْرُ مَكْذُوبٍ",
    "ENGLISH": {
        "TRANSLATION_0": "But they hamstrung her, so he said, 'Enjoy yourselves in your land for three more days. That is a promise which will not be belied.'",
        "TRANSLATION_1": "But they hamstrung her. Then (Saleh) said: \"You have but three days to enjoy life in your homes. Infallible is this promise.\n",
        "TRANSLATION_2": "But they slaughtered her. Thereupon Salih warned them: 'Enjoy yourselves in your homes for a maximum of three days. This is a promise which shall not be belied.'\n",
        "TRANSLATION_3": "When they slew the she-camel, Salih told them, \"You have only three days to enjoy living in your homes (before you will be struck by the torment). This is an inevitable prophecy.\"\n",
        "TRANSLATION_4": "In response they hamstrung her, he therefore said, “Enjoy a further three days in your homes; this is a promise that will not be untrue.”\n",
        "TRANSLATION_5": "But they slaughtered her. So he said: \"Enjoy yourselves in your homes for three days. This is a promise (a threat) that will not be belied.\"\n",
        "TRANSLATION_6": "But they slew her, so he said: Enjoy yourselves in your abode for three days, that is a promise not to be belied.\n",
        "TRANSLATION_7": "But they hamstrung her; and he said, 'Take your joy in your habitation three days -- that is a promise not to be belied.'\n",
        "TRANSLATION_8": "But they hamstrung her, and then he said: Enjoy life in your dwelling-place three days! This is a threat that will not be belied.\n",
        "TRANSLATION_9": "But they hamstrung her. He [Salih] said, \"Enjoy yourselves in your homes for three more days. This warning will not prove false.\"\n",
        "TRANSLATION_10": "Yet they hamstrang her. Then he said: enjoy yourselves in your dwellings three days: that is a promise, not to be falsified.\n",
        "TRANSLATION_11": "But they hamstrung her, whereupon he said, ‘Enjoy yourselves in your homes for three days: that is a promise not to be belied!’\n",
        "TRANSLATION_12": "But they did ham-string her. So he said: \"Enjoy yourselves in your homes for three days: (Then will be your ruin): (Behold) there a promise not to be belied!\"\n",
        "TRANSLATION_13": "But they killed her. So he said: \"Enjoy yourselves in your homes for three days. This is a promise (i.e. a threat) that will not be belied.\"\n",
        "TRANSLATION_14": "Yet they hamstrung her. He (Salih) said: 'Take your enjoyment in your homes for three days! This is a promise that cannot be belied'\n",
        "TRANSLATION_15": "But they hamstrung her, and so He said, “Enjoy yourselves in your homes for three days. This is a prophecy that is infallible.”\n",
        "TRANSLATION_16": "But they hamstrung her, so he said, \"Enjoy yourselves in your homes for three days. That is a promise not to be denied.\"\n",
        "TRANSLATION_17": "[11:65] But they hamstrung her, Qudār hamstrung her at their command, and he, Sālih, said, ‘Enjoy [yourselves], live, in your dwellings for three days, whereafter you will be destroyed. That is a promise that will not be belied’.\n",
        "TRANSLATION_18": "(But they hamstrung her) they killed her. She was killed by Qudar Ibn Salif and Musda' Ibn Zahr who divided its meat on 1500 homes, (and then he said) Salih said to them after they killed the camel: (Enjoy life in your dwelling-place) in your township (three days!) for Allah's chastisement will come upon you on the fourth day. They asked him: \"What is the sign of this chastisement?\" He said: \"You will wake up the first day with pale faces; on the second day your faces will be red and on the third your faces will become dark. Chastisement will come upon you on the fourth day\". (This) chastisement (is a threat that will not be belied) will not be repelled.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "11:65",
            "30:55",
            "50:20",
            "52:45",
            "38:39",
            "41:19",
            "43:83",
            "51:60",
            "70:42",
            "7:14"
        ],
        "BIBLE": [
            "prophets:ii%20samuel:14:7",
            "torah:genesis:47:9",
            "torah:exodus:1:16",
            "torah:exodus:16:4",
            "prophets:judges:16:2",
            "prophets:i%20samuel:24:11",
            "prophets:i%20samuel:26:8",
            "prophets:ii%20samuel:15:21",
            "prophets:ii%20kings:7:9",
            "torah:genesis:6:3"
        ]
    }
}