{
    "VERSE": "11:67",
    "ARABIC": "وَأَخَذَ ٱلَّذِينَ ظَلَمُوا۟ ٱلصَّيْحَةُ فَأَصْبَحُوا۟ فِى دِيَٰرِهِمْ جَٰثِمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "The Great Blast seized hold of those who did wrong and morning found them lying flattened in their homes.",
        "TRANSLATION_1": "The sinners were seized by a blast from heaven, and lay overturned in their homes in the morning,\n",
        "TRANSLATION_2": "And the Blast overtook those who were wont to do wrong, and then they lay lifeless in their homes\n",
        "TRANSLATION_3": "A blast struck the unjust and they were found lying motionless on their faces\n",
        "TRANSLATION_4": "And the terrible scream seized the unjust – so at morning they remained lying flattened in their homes.\n",
        "TRANSLATION_5": "And As-Sayhah (awful cry) overtook the wrongdoers, so they lay (dead), prostrate in their homes.\n",
        "TRANSLATION_6": "And the rumbling overtook those who were unjust, so they became motionless bodies in their abodes,\n",
        "TRANSLATION_7": "And the evildoers were seized by the Cry, and morning found them in their habitations fallen prostrate\n",
        "TRANSLATION_8": "And the (awful) Cry overtook those who did wrong, so that morning found them prostrate in their dwellings,\n",
        "TRANSLATION_9": "The wrongdoers were overtaken by a dreadful blast and they lay dead in their homes,\n",
        "TRANSLATION_10": "And the shout overtook those who had done wrong; so they lay in their dwellings crouching\n",
        "TRANSLATION_11": "The Cry seized those who were wrongdoers, and they lay lifeless prostrate in their homes,\n",
        "TRANSLATION_12": "The (mighty) Blast overtook the wrong-doers, and they lay prostrate in their homes before the morning,-\n",
        "TRANSLATION_13": "And As-Saihah (torment - awful cry, etc.) overtook the wrong-doers, so they lay (dead), prostrate in their homes,\n",
        "TRANSLATION_14": "And the harmdoers were seized by the Shout (of the angel), and in the morning, they were found crouched in their dwellings, dead,\n",
        "TRANSLATION_15": "And the Scream struck those who transgressed, and they became motionless bodies in their homes.\n",
        "TRANSLATION_16": "And the shriek seized those who had wronged, and they became within their homes [corpses] fallen prone\n",
        "TRANSLATION_17": "[11:67] And those who did evil were seized by the Cry, so that they ended up lying lifeless prostrate in their habitations, keeled over their knees, dead,\n",
        "TRANSLATION_18": "(And the (Awful) Cry) the Chastisement (overtook those who did wrong) the idolaters, (so that morning found them prostrate) lifeless, i.e. they became dust (in their dwellings) in their houses,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "11:67",
            "11:94",
            "15:73",
            "15:83",
            "7:78",
            "29:37",
            "7:91",
            "26:94",
            "19:72",
            "2:39"
        ],
        "BIBLE": [
            "prophets:isaiah:14:12",
            "prophets:ii%20kings:19:35",
            "prophets:isaiah:37:36",
            "prophets:jeremiah:44:12",
            "prophets:jeremiah:46:12",
            "prophets:i%20samuel:17:49",
            "prophets:judges:13:20",
            "prophets:i%20samuel:5:4",
            "prophets:ezekiel:31:12",
            "writings:job:1:19"
        ]
    }
}