{
    "VERSE": "11:7",
    "ARABIC": "وَهُوَ ٱلَّذِى خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلْأَرْضَ فِى سِتَّةِ أَيَّامٍ وَكَانَ عَرْشُهُۥ عَلَى ٱلْمَآءِ لِيَبْلُوَكُمْ أَيُّكُمْ أَحْسَنُ عَمَلًا وَلَئِن قُلْتَ إِنَّكُم مَّبْعُوثُونَ مِنۢ بَعْدِ ٱلْمَوْتِ لَيَقُولَنَّ ٱلَّذِينَ كَفَرُوٓا۟ إِنْ هَٰذَآ إِلَّا سِحْرٌ مُّبِينٌ",
    "ENGLISH": {
        "TRANSLATION_0": "It is He who created the heavens and the earth in six days when His Throne was on the water, in order to test which of you has the best actions. If you say, 'You will be raised up after death,' those who are kafir will say, 'This is nothing but downright magic'",
        "TRANSLATION_1": "It is He who created the heavens and the earth In six spans, and has control over the waters (of life) so that he may bring out the best that everyone of you could do. Yet if you said to them: \"You shall certainly be raised from the dead,\" the unbelievers will say: \"This will be nothing but sorcery.\"\n",
        "TRANSLATION_2": "And He it is Who created the heavens and the earth in six days - and [before that] His Throne was upon the water that He may test you, who of you is better in conduct If you were to say (O Muhammad): 'All of you will surely be raised after death', then those who disbelieve will certainly say: 'This is nothing but plain sorcery.\n",
        "TRANSLATION_3": "God created the heavens and the earth in six days. His Throne existed on water so that He could test you and find out those among you who do good deeds. (Muhammad), if you were to tell them that after death they would be brought back to life again, the unbelievers would say, \"This is nothing but obvious magic.\"\n",
        "TRANSLATION_4": "And it is He Who created the heavens and the earth in six days – and His Throne was upon the water – so that He might test you, as to who among you have the best deeds*; and if you (O dear Prophet Mohammed – peace and blessings be upon him) say, “Indeed you will be raised again after death”, the disbelievers will surely say, “This is nothing but clear magic.” (* The creation of all things is in order to test mankind.)\n",
        "TRANSLATION_5": "And He it is Who has created the heavens and the earth in six Days and His Throne was over the water, that He might try you, which of you is the best in deeds. But if you were to say to them: \"You shall indeed be raised up after death,\" those who disbelieve would be sure to say, \"This is nothing but obvious magic.\"\n",
        "TRANSLATION_6": "And He it is Who created the heavens and the earth in six periods-- and His dominion (extends) on the water-- that He might manifest to you, which of you is best in action, and if you say, surely you shall be raised up after death, those who disbelieve would certainly say: This is nothing but clear magic.\n",
        "TRANSLATION_7": "And it is He who created the heavens and the earth in six days, and His Throne was upon the waters -- that He might try you, which one of you is fairer in works. And if thou sayest, 'you shall surely be raised up after death,' the unbelievers will say, 'This is naught but a manifest sorcery.'\n",
        "TRANSLATION_8": "And He it is Who created the heavens and the earth in six Days - and His Throne was upon the water - that He might try you, which of you is best in conduct. Yet if thou (O Muhammad) sayest: Lo! ye will be raised again after death! those who disbelieve will surely say: This is naught but mere magic.\n",
        "TRANSLATION_9": "Enthroned above the waters, it was He who created the heavens and the earth in six Days [periods], in order to test which of you is best in conduct. If you say, \"You will [all] be raised up after death,\" those who deny the truth will say, \"This is just sheer sorcery!\"\n",
        "TRANSLATION_10": "And He it is who hath created the heavens and the earth in six days -and His throne was upon the water--that he might prove you, as to which of you is excellent in work. And if thou sayest: ye shall verily be raised after death, surely those who disbelieve will say: naught is this but sorcery manifest.\n",
        "TRANSLATION_11": "It is He who created the heavens and the earth in six days—and His Throne was [then] upon the waters—that He may test you [to see] which of you is best in conduct. Yet if you say, ‘You will indeed be raised up after death,’ the faithless will surely say, ‘This is nothing but plain magic.’\n",
        "TRANSLATION_12": "He it is Who created the heavens and the earth in six Days - and His Throne was over the waters - that He might try you, which of you is best in conduct. But if thou wert to say to them, \"Ye shall indeed be raised up after death\", the Unbelievers would be sure to say, \"This is nothing but obvious sorcery!\"\n",
        "TRANSLATION_13": "And He it is Who has created the heavens and the earth in six Days and His Throne was on the water, that He might try you, which of you is the best in deeds. But if you were to say to them: \"You shall indeed be raised up after death,\" those who disbelieve would be sure to say, \"This is nothing but obvious magic.\"\n",
        "TRANSLATION_14": "It is He who created the heavens and the earth in six days and His Throne was upon the waters that He might try you, (and see) which of you excel in works. If you say: 'After death you shall be raised up' the unbelievers will say: 'This is nothing but clear sorcery'\n",
        "TRANSLATION_15": "It is He who created the heavens and the earth in six days—and His Throne was upon the waters—in order to test you—which of you is best in conduct. And if you were to say, “You will be resurrected after death,” those who disbelieve would say, “This is nothing but plain witchcraft.”\n",
        "TRANSLATION_16": "And it is He who created the heavens and the earth in six days - and His Throne had been upon water - that He might test you as to which of you is best in deed. But if you say, \"Indeed, you are resurrected after death,\" those who disbelieve will surely say, \"This is not but obvious magic.\"\n",
        "TRANSLATION_17": "[11:7] And He it is Who created the heavens and the earth in six days, the first of which was Sunday and the last, Friday — and His Throne, before creating them, was upon the water, borne by the winds — that He might try you (li-yabluwakum is semantically connected to khalaqa, ‘He [Who] created’), in other words, He created them and all that is beneficial and good for you in them, in order to test you: which of you is best in conduct, that is, [which of you] is most obedient to God. And if you were to say, O Muhammad (s), to them: ‘Truly you shall be raised again after death’, those who disbelieve will say, ‘This, Qur’ān that speaks of resurrection — or, [this] that you are saying — is nothing but manifest, clear, sorcery’ (sihrun: a variant reading has sāhirun, ‘sorcerer’, in which case the reference is to the Prophet (s).\n",
        "TRANSLATION_18": "(And He it is Who created the heavens and the earth in six Days) six days of the beginning of this world: each day the equivalent of one thousand years, the first day being Sunday and the last Friday (and His Throne) before the creation of the heavens and earth (was upon the water) and Allah was before the Throne and before water (that He might try you) that He may test you in the interval between life and death, (which of you is best in conduct) which of you is more sincere in his works. (Yet if thou (0 Muhammad) sayst) to the people of Mecca: (Lo! ye will be raised again) you will be brought back to life again (after death! those who disbelieve) the disbelievers of Mecca (will surely say: This) which Muhammad (pbuh) is saying (is naught but mere magic) manifest lies which will never happen.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "11:7",
            "10:3",
            "57:4",
            "16:65",
            "29:63",
            "32:4",
            "30:24",
            "25:59",
            "18:7",
            "50:38"
        ],
        "BIBLE": [
            "torah:genesis:6:17",
            "writings:i%20chronicles:11:19",
            "writings:psalms:40:6",
            "torah:deuteronomy:4:32",
            "prophets:jeremiah:16:19",
            "torah:deuteronomy:30:19",
            "prophets:jeremiah:14:13",
            "prophets:ii%20kings:20:19",
            "prophets:ii%20kings:7:9",
            "writings:daniel:6:13"
        ]
    }
}