{
    "VERSE": "11:71",
    "ARABIC": "وَٱمْرَأَتُهُۥ قَآئِمَةٌ فَضَحِكَتْ فَبَشَّرْنَٰهَا بِإِسْحَٰقَ وَمِن وَرَآءِ إِسْحَٰقَ يَعْقُوبَ",
    "ENGLISH": {
        "TRANSLATION_0": "His wife was standing there and she laughed out loud. So We gave her the good news of Ishaq, and beyond Ishaq, Ya'qub.",
        "TRANSLATION_1": "His wife who stood near, laughed as We gave her the good news of Isaac, and after Isaac of Jacob.\n",
        "TRANSLATION_2": "And Abraham's wife was standing by and on hearing this she laughed. And We gave her the good news of (the birth of) Isaac, and after Isaac, of Jacob.\n",
        "TRANSLATION_3": "His wife who was standing nearby, smiled and so We gave her the glad news that she would give birth to Isaac who would have a son, Jacob.\n",
        "TRANSLATION_4": "And his wife was standing by and she started laughing*, so We gave her glad tidings regarding Ishaq, and following Ishaq, regarding Yaqub.** (* She was glad that the disbelieving people of Lut would be destroyed.** The birth of these two.)\n",
        "TRANSLATION_5": "And his wife was standing (there), and she laughed. But We gave her glad tidings of Ishaq, and after Ishaq, of Ya`qub.\n",
        "TRANSLATION_6": "And his wife was standing (by), so she laughed, then We gave her the good news of Ishaq and after Ishaq of (a son's son) Yaqoub.\n",
        "TRANSLATION_7": "And his wife was standing by; she laughed, therefore We gave her the glad tidings of Isaac, and, after Isaac, of Jacob.\n",
        "TRANSLATION_8": "And his wife, standing by laughed when We gave her good tidings (of the birth) of Isaac, and, after Isaac, of Jacob.\n",
        "TRANSLATION_9": "His wife, who was standing nearby, laughed when We gave her the good news of Isaac, and after Isaac, Jacob.\n",
        "TRANSLATION_10": "And his wife was standing. she laughed. Then We gave her the glad tidings of Is'haq, and after Is'haq, Ya'qub.\n",
        "TRANSLATION_11": "His wife, standing by, laughed as We gave her the good news of [the birth of] Isaac, and of Jacob, after Isaac.\n",
        "TRANSLATION_12": "And his wife was standing (there), and she laughed: But we gave her glad tidings of Isaac, and after him, of Jacob.\n",
        "TRANSLATION_13": "And his wife was standing (there), and she laughed (either, because the Messengers did not eat their food or for being glad for the destruction of the people of Lout (Lot). But We gave her glad tidings of Ishaque (Isaac), and after him, of Ya'qub (Jacob).\n",
        "TRANSLATION_14": "His wife (Sarah), who was standing nearby, laughed. Thereupon, We gave her the good news of Isaac, and after Isaac of Jacob.\n",
        "TRANSLATION_15": "His wife was standing by, so she laughed. And We gave her good news of Isaac; and after Isaac, Jacob.\n",
        "TRANSLATION_16": "And his Wife was standing, and she smiled. Then We gave her good tidings of Isaac and after Isaac, Jacob.\n",
        "TRANSLATION_17": "[11:71] And his wife, that is, Abraham’s wife, Sarah, standing by, serving them, laughed, at the good tiding of their destruction; and so We gave her the good tiding of Isaac, and, after Isaac, of Jacob, his son, whom she would live to see.\n",
        "TRANSLATION_18": "(And his wife) Sarah, (standing by) to serve them, (laughed) in astonishment that Abraham was afraid (when We gave her good tidings (of the birth) of Isaac, and, after Isaac, of Jacob) a grandchild.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "11:71",
            "27:57",
            "19:5",
            "7:83",
            "85:20",
            "15:60",
            "14:16",
            "51:29",
            "11:94",
            "37:112"
        ],
        "BIBLE": [
            "prophets:i%20kings:19:21",
            "torah:genesis:25:5",
            "prophets:i%20samuel:4:19",
            "torah:genesis:35:12",
            "torah:genesis:25:6",
            "prophets:joshua:23:15",
            "torah:deuteronomy:8:10",
            "prophets:ezekiel:20:25",
            "torah:genesis:29:28",
            "writings:ezra:3:11"
        ]
    }
}