{
    "VERSE": "11:73",
    "ARABIC": "قَالُوٓا۟ أَتَعْجَبِينَ مِنْ أَمْرِ ٱللَّهِ رَحْمَتُ ٱللَّهِ وَبَرَكَٰتُهُۥ عَلَيْكُمْ أَهْلَ ٱلْبَيْتِ إِنَّهُۥ حَمِيدٌ مَّجِيدٌ",
    "ENGLISH": {
        "TRANSLATION_0": "They said, 'Are you astonished at Allah's command? May Allah's mercy and His blessings be upon you, People of the House! He is Praiseworthy, All-Glorious.'",
        "TRANSLATION_1": "Why are you surprised at the command of God? God's mercy and blessings be upon you, O members of this household,\" they said. \"Verily He is worthy of praise and glory.\"\n",
        "TRANSLATION_2": "They said: 'Do you wonder at Allah's decree? Allah's mercy and His blessings be upon you, O people of the house. Surely, He is Praiseworthy, Glorious.'\n",
        "TRANSLATION_3": "They replied, \"Would you be surprised at God's decree? People of the house, may God's mercy and blessings be with you. God is Appreciative and Glorious.\"\n",
        "TRANSLATION_4": "The angels said, “Do you wonder at the command of Allah? Allah’s mercy and His blessings be upon you, O people of this house; indeed He only is Most Praiseworthy, Most Honourable.”\n",
        "TRANSLATION_5": "They said: \"Do you wonder at the decree of Allah The mercy of Allah and His blessings be on you, O the family [of Ibrahim]. Surely, He (Allah) is All-Praiseworthy, All-Glorious.\"\n",
        "TRANSLATION_6": "They said: Do you wonder at Allah's bidding? The mercy of Allah and His blessings are on you, O people of the house, surely He is Praised, Glorious.\n",
        "TRANSLATION_7": "They said, 'What, dost thou marvel at God's command? The mercy of God and His blessings be upon you, O people of the House! Surely He is All-laudable, All-glorious.'\n",
        "TRANSLATION_8": "They said: Wonderest thou at the commandment of Allah? The mercy of Allah and His blessings be upon you, O people of the house! Lo! He is Owner of Praise, Owner of Glory!\n",
        "TRANSLATION_9": "They said, \"Are you astonished at God's command? May the mercy of God and His blessings be upon you, O people of this house. Surely, He is praiseworthy and glorious.\"\n",
        "TRANSLATION_10": "They said marvellest thou at the decree of Allah? Mercy of Allah and His blessings be upon you, people of the house, verily He is Praiseworthy, Glorious.\n",
        "TRANSLATION_11": "They said, ‘Are you amazed at Allah’s dispensation? [That is] Allah’s mercy and His blessings upon you, members of the household. Indeed He is all-laudable, all-glorious.’\n",
        "TRANSLATION_12": "They said: \"Dost thou wonder at Allah's decree? The grace of Allah and His blessings on you, o ye people of the house! for He is indeed worthy of all praise, full of all glory!\"\n",
        "TRANSLATION_13": "They said: \"Do you wonder at the Decree of Allah? The Mercy of Allah and His Blessings be on you, O the family [of Ibrahim (Abraham)]. Surely, He (Allah) is All-Praiseworthy, All-Glorious.\"\n",
        "TRANSLATION_14": "They said: 'What, do you marvel at the command of Allah? The Mercy of Allah and His Blessings be upon you, O people of the House. Indeed, He isPraised, Exalted'\n",
        "TRANSLATION_15": "They said, “Do you marvel at the decree of God? The mercy and blessings of God are upon you, O people of the house. He is Praiseworthy and Glorious.”\n",
        "TRANSLATION_16": "They said, \"Are you amazed at the decree of Allah? May the mercy of Allah and His blessings be upon you, people of the house. Indeed, He is Praiseworthy and Honorable.\"\n",
        "TRANSLATION_17": "[11:73] They said, ‘Are you astonished by God’s command?, [by] His power? The mercy of God and His blessings be upon you, O, people of the House!, the House of Abraham. Truly He is Praised, Glorious!’, Generous.\n",
        "TRANSLATION_18": "(They said) to her: (Wonderest thou at the commandment of Allah) are you amazed with the power of Allah? (The mercy of Allah and His blessings be upon you, people of the house) the people of the house of Abraham! (Lo! He is Owner of Praise) for your works, (Owner of Glory!) He is Generous and will favour you with a righteous son.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "11:73",
            "9:104",
            "28:12",
            "18:16",
            "33:34",
            "27:59",
            "27:30",
            "2:105",
            "12:92",
            "4:35"
        ],
        "BIBLE": [
            "writings:i%20chronicles:21:17",
            "prophets:ii%20samuel:7:25",
            "writings:nehemiah:9:5",
            "prophets:ezekiel:44:6",
            "torah:genesis:15:2",
            "writings:daniel:9:4",
            "torah:genesis:24:27",
            "torah:exodus:8:5",
            "prophets:jonah:4:2",
            "prophets:isaiah:7:13"
        ]
    }
}