{
    "VERSE": "11:74",
    "ARABIC": "فَلَمَّا ذَهَبَ عَنْ إِبْرَٰهِيمَ ٱلرَّوْعُ وَجَآءَتْهُ ٱلْبُشْرَىٰ يُجَٰدِلُنَا فِى قَوْمِ لُوطٍ",
    "ENGLISH": {
        "TRANSLATION_0": "When the feeling of fear left Ibrahim, and the good news reached him, he disputed with Us about the people of Lut.",
        "TRANSLATION_1": "When Abraham's fear was dispelled, and the good news had come to him, he pleaded for the people of Lot with Us.\n",
        "TRANSLATION_2": "Thus when fear had left Abraham and the good news had been conveyed to him, he began to dispute with Us concerning the people of Lot.\n",
        "TRANSLATION_3": "When Abraham had controlled his fear and received the glad news, he started to plead with Us for the people of Lot;\n",
        "TRANSLATION_4": "And when Ibrahim’s fear abated and the glad tidings reached him, he argued with Us regarding the people of Lut.\n",
        "TRANSLATION_5": "Then when the fear had gone away from (the mind of) Ibrahim, and the glad tidings had reached him, he began to plead with Us (Our messengers) for the people of Lut.\n",
        "TRANSLATION_6": "So when fear had gone away from Ibrahim and good news came to him, he began to plead with Us for Lut's people.\n",
        "TRANSLATION_7": "So, when the awe departed from Abraham and the good tidings came to him, he was disputing with Us concerning the people of Lot;\n",
        "TRANSLATION_8": "And when the awe departed from Abraham, and the glad news reached him, he pleaded with Us on behalf of the folk of Lot.\n",
        "TRANSLATION_9": "When the fear had left Abraham, and the glad tidings had been conveyed to him, he began to plead with Us for Lot's people,\n",
        "TRANSLATION_10": "Then when the alarm had departed from Ibrahim and the glad tidings had come home unto him, he took to disputing with us for the people of Lut\n",
        "TRANSLATION_11": "So when the awe had left Abraham and the good news had reached him, he pleaded with Us concerning the people of Lot.\n",
        "TRANSLATION_12": "When fear had passed from (the mind of) Abraham and the glad tidings had reached him, he began to plead with us for Lut's people.\n",
        "TRANSLATION_13": "Then when the fear had gone away from (the mind of) Ibrahim (Abraham), and the glad tidings had reached him, he began to plead with Us (Our Messengers) for the people of Lout (Lot).\n",
        "TRANSLATION_14": "And when the wonderment departed from Abraham and the glad tidings reached him, he pleaded with Us for the nation of Lot;\n",
        "TRANSLATION_15": "When Abraham's fear subsided, and the good news had reached him, he started pleading with Us concerning the people of Lot.\n",
        "TRANSLATION_16": "And when the fright had left Abraham and the good tidings had reached him, he began to argue with Us concerning the people of Lot.\n",
        "TRANSLATION_17": "[11:74] And when the awe, the fear, departed from Abraham and the good tiding came to him, of a child, he began to plead with Us, pleading with Our messengers, concerning the, matter of the, people of Lot.\n",
        "TRANSLATION_18": "(And when the awe) fear (departed from Abraham, and the glad news) that he will have a son (reached him, he pleaded with Us) he argued with Us (on behalf of the folk of Lot) about the destruction of the people of Lot.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "11:74",
            "26:160",
            "22:43",
            "27:54",
            "26:10",
            "20:79",
            "37:115",
            "25:69",
            "10:86",
            "26:105"
        ],
        "BIBLE": [
            "torah:genesis:29:23",
            "writings:ruth:1:19",
            "prophets:ii%20kings:2:9",
            "torah:genesis:12:5",
            "torah:numbers:22:41",
            "prophets:i%20samuel:17:20",
            "prophets:i%20samuel:16:23",
            "prophets:joshua:6:20",
            "prophets:i%20kings:16:18",
            "torah:genesis:11:31"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:13",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:6:2"
        ]
    }
}