{
    "VERSE": "11:77",
    "ARABIC": "وَلَمَّا جَآءَتْ رُسُلُنَا لُوطًا سِىٓءَ بِهِمْ وَضَاقَ بِهِمْ ذَرْعًا وَقَالَ هَٰذَا يَوْمٌ عَصِيبٌ",
    "ENGLISH": {
        "TRANSLATION_0": "When Our messengers came to Lut, he was distressed for them, and very concerned for them, and said, 'This is a dreadful day.'",
        "TRANSLATION_1": "So when Our angels came to Lot, he grieved for them, and felt powerless to help them, and said: \"This is a day of sorrow.\n",
        "TRANSLATION_2": "And when Our messengers came to Lot, he was perturbed by their coming and felt troubled on their account, and said: 'This is a distressing day.\n",
        "TRANSLATION_3": "When Our Messengers came to Lot, he became sorrowful and felt totally helpless. He said, \"This is indeed a distressful day\".\n",
        "TRANSLATION_4": "And when Our angels came to Lut, he was distressed for them and was disheartened due to them, and said, “This is a day of great hardship.”\n",
        "TRANSLATION_5": "And when Our messengers came to Lut, he was grieved on account of them and was concerned for them. He said: \"This is a distressful day.\"\n",
        "TRANSLATION_6": "And when Our apostles came to Lut, he was grieved for them, and he lacked strength to protect them, and said: This is a hard day.\n",
        "TRANSLATION_7": "And when Our messengers came to Lot, he was troubled on their account and distressed for them, and he said, 'This is a fierce day.'\n",
        "TRANSLATION_8": "And when Our messengers came unto Lot, he was distressed and knew not how to protect them. He said: This is a distressful day.\n",
        "TRANSLATION_9": "When Our messengers came to Lot, he was uneasy on this account and felt powerless to protect them. He said, \"This is a dreadful day.\"\n",
        "TRANSLATION_10": "And when Our messengers came unto Lut, he was distressed on their account, and he felt straitened on their account, and he said: this is a lay dreadful.\n",
        "TRANSLATION_11": "When Our messengers came to Lot, he was distressed on their account and in a predicament for their sake, and he said, ‘This is a terrible day!’\n",
        "TRANSLATION_12": "When Our messengers came to Lut, he was grieved on their account and felt himself powerless (to protect) them. He said: \"This is a distressful day.\"\n",
        "TRANSLATION_13": "And when Our Messengers came to Lout (Lot), he was grieved on their account and felt himself straitened for them (lest the town people should approach them to commit sodomy with them). He said: \"This is a distressful day.\"\n",
        "TRANSLATION_14": "And when Our messengers came to Lot, he was troubled and distressed for them, and said: 'This is a harsh day'\n",
        "TRANSLATION_15": "And when Our envoys came to Lot, he was anxious for them, and concerned for them. He said, “This is a dreadful day.”\n",
        "TRANSLATION_16": "And when Our messengers, [the angels], came to Lot, he was anguished for them and felt for them great discomfort and said, \"This is a trying day.\"\n",
        "TRANSLATION_17": "[11:77] And when Our messengers came to Lot, he was distressed, he was grieved on their account, and felt constrained in his power to protect them, because they had handsome faces and were dressed as [visiting] guests, and so he feared for them from his people, and he said, ‘This is a distressful, a very difficult, day’.\n",
        "TRANSLATION_18": "(And when Our messengers) Gabriel and the angels with him (came unto Lot, he was distressed) he did not like their coming (and knew not how to protect them) from his people. (He said) within himself: (This is a distressful day) for me.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "11:77",
            "29:33",
            "25:37",
            "3:194",
            "40:51",
            "19:38",
            "54:8",
            "32:14",
            "25:27",
            "29:31"
        ],
        "BIBLE": [
            "torah:exodus:19:15",
            "writings:nehemiah:8:10",
            "torah:exodus:13:3",
            "prophets:ii%20kings:6:33",
            "prophets:ii%20samuel:3:35",
            "prophets:ii%20kings:6:18",
            "prophets:i%20kings:12:5",
            "prophets:i%20kings:20:13",
            "prophets:isaiah:37:3",
            "prophets:ii%20kings:19:3"
        ]
    }
}