{
    "VERSE": "11:80",
    "ARABIC": "قَالَ لَوْ أَنَّ لِى بِكُمْ قُوَّةً أَوْ ءَاوِىٓ إِلَىٰ رُكْنٍ شَدِيدٍ",
    "ENGLISH": {
        "TRANSLATION_0": "He said, 'If only I had the strength to combat you or could take refuge in some powerful support!'",
        "TRANSLATION_1": "I wish I had the power to resist you,\" said (Lot), \"or powerful support.\"\n",
        "TRANSLATION_2": "He said: 'Would that I had the strength to set you straight, or could seek refuge in some powerful support.'\n",
        "TRANSLATION_3": "He said, \"Would that I had the power (to overcome you) or could seek strong protection.\"\n",
        "TRANSLATION_4": "He said, “If only I had the strength against you or were able to get the refuge of some strong support!”\n",
        "TRANSLATION_5": "He said: \"Would that I had strength to overpower you, or that I could betake myself to some powerful support.\"\n",
        "TRANSLATION_6": "He said: Ah! that I had power to suppress you, rather I shall have recourse to a strong support.\n",
        "TRANSLATION_7": "He said, 'O would that I had power against you, or might take refuge in a strong pillar!'\n",
        "TRANSLATION_8": "He said: Would that I had strength to resist you or had some strong support (among you)!\n",
        "TRANSLATION_9": "He said, \"If only I had the strength to stop you or could take refuge in some powerful support!\"\n",
        "TRANSLATION_10": "He said. Would that I had strength against you or could betake me to a powerful support!\n",
        "TRANSLATION_11": "He said, ‘If only I had the power to deter you, or could take refuge in a mighty support!’\n",
        "TRANSLATION_12": "He said: \"Would that I had power to suppress you or that I could betake myself to some powerful support.\"\n",
        "TRANSLATION_13": "He said: \"Would that I had strength (men) to overpower you, or that I could betake myself to some powerful support (to resist you).\"\n",
        "TRANSLATION_14": "He said: 'Would that I were powerful over you, or might take refuge in a strong pillar'\n",
        "TRANSLATION_15": "He said, “If only I had the strength to stop you, or could rely on some strong support.”\n",
        "TRANSLATION_16": "He said, \"If only I had against you some power or could take refuge in a strong support.\"\n",
        "TRANSLATION_17": "[11:80] He said, ‘Would that I had strength, power, to resist you or could resort to some strong support!’, [to] some clan that would help me, I would surely fall upon you. So, when the angels saw this,\n",
        "TRANSLATION_18": "(He said) Lot said within himself: (Would that I had strength) physical strength and sons to help me (to resist you or had some strong support (among you)!) or that I could rely on a strong clan such that I defend myself from you.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "11:80",
            "53:5",
            "51:39",
            "47:13",
            "27:33",
            "40:22",
            "86:10",
            "4:66",
            "2:165",
            "18:2"
        ],
        "BIBLE": [
            "writings:ii%20chronicles:14:10",
            "torah:exodus:7:1",
            "writings:psalms:86:14",
            "prophets:ezekiel:40:4",
            "prophets:joshua:10:18",
            "writings:psalms:18:2",
            "prophets:ezekiel:9:4",
            "prophets:ezekiel:33:2",
            "prophets:ii%20kings:4:43",
            "torah:genesis:41:41"
        ]
    }
}