{
    "VERSE": "11:82",
    "ARABIC": "فَلَمَّا جَآءَ أَمْرُنَا جَعَلْنَا عَٰلِيَهَا سَافِلَهَا وَأَمْطَرْنَا عَلَيْهَا حِجَارَةً مِّن سِجِّيلٍ مَّنضُودٍ",
    "ENGLISH": {
        "TRANSLATION_0": "When Our command came, We turned their cities upside down and rained down on them stones of hard baked clay,",
        "TRANSLATION_1": "So when the decreed moment arrived, We turned the habitations upside down, and rained upon them stones of hardened lava in quick succession,\n",
        "TRANSLATION_2": "And when Our command came to pass, We turned the town upside down, and rained on it stones of baked clay, one on another,\n",
        "TRANSLATION_3": "When Our decree came to pass, We turned the town upside-down and showered unto it lumps of baked clay,\n",
        "TRANSLATION_4": "So when Our command came, We turned that township upside down and showered it continuously with stones of fired clay.\n",
        "TRANSLATION_5": "So when Our commandment came, We turned them upside down, and rained on them stones of clay, in an array.\n",
        "TRANSLATION_6": "So when Our decree came to pass, We turned them upside down and rained down upon them stones, of what had been decreed, one after another.\n",
        "TRANSLATION_7": "So when Our command came, We turned it uppermost nethermost, and rained on it stones of baked clay, one on another,\n",
        "TRANSLATION_8": "So when Our commandment came to pass We overthrew (that township) and rained upon it stones of clay, one after another,\n",
        "TRANSLATION_9": "When Our command came, We turned that town upside down and We rained upon it stones of clay, layer upon layer,\n",
        "TRANSLATION_10": "Then when Our decree came to pass, We turned the upside thereof downward, and We rained thereon stones of baked clay, piled up.\n",
        "TRANSLATION_11": "So when Our edict came, We made its topmost part its nethermost, and We rained on it stones of laminar shale,\n",
        "TRANSLATION_12": "When Our Decree issued, We turned (the cities) upside down, and rained down on them brimstones hard as baked clay, spread, layer on layer,-\n",
        "TRANSLATION_13": "So when Our Commandment came, We turned (the towns of Sodom in Palestine) upside down, and rained on them stones of baked clay, piled up;\n",
        "TRANSLATION_14": "And when Our command came, We turned it upside down, and rained on it, stone after stone of baked clay,\n",
        "TRANSLATION_15": "And when Our command came about, We turned it upside down, and We rained down on it stones of baked clay.\n",
        "TRANSLATION_16": "So when Our command came, We made the highest part [of the city] its lowest and rained upon them stones of layered hard clay, [which were]\n",
        "TRANSLATION_17": "[11:82] So when Our command, for their destruction, came to pass We made their uppermost, that is, their cities, the nethermost — when Gabriel raised them to the sky and dropped them upside down to the earth, and We rained upon them stones of baked clay, clay baked in fire, one after another,\n",
        "TRANSLATION_18": "(So when Our commandment) when Our chastisement (came to pass) to destroy them (We overthrew (that township)) We turned it upside down (and rained upon it) upon its sodomites and those who travelled there (stones of clay) mixed with manure and mud, like bricks; it is also said that this means: from the first heaven, (one after another) in succession, one after another,\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "11:82",
            "15:74",
            "105:4",
            "20:26",
            "43:79",
            "32:24",
            "20:32",
            "40:68",
            "18:88",
            "3:128"
        ],
        "BIBLE": [
            "prophets:judges:20:48",
            "prophets:i%20kings:11:4",
            "writings:ruth:3:8",
            "torah:genesis:38:1",
            "prophets:judges:20:42",
            "prophets:i%20samuel:10:9",
            "torah:deuteronomy:10:5",
            "torah:deuteronomy:9:15",
            "prophets:jeremiah:36:16",
            "prophets:judges:2:17"
        ]
    }
}