{
    "VERSE": "11:86",
    "ARABIC": "بَقِيَّتُ ٱللَّهِ خَيْرٌ لَّكُمْ إِن كُنتُم مُّؤْمِنِينَ وَمَآ أَنَا۠ عَلَيْكُم بِحَفِيظٍ",
    "ENGLISH": {
        "TRANSLATION_0": "What endures with Allah is better for you if you are muminun. I am not set over you as your keeper.'",
        "TRANSLATION_1": "That which is left to you by God is better, if you are true believers; yet I am not a warden over you.\"\n",
        "TRANSLATION_2": "The gains that Allah lets you retain are better for you, if you indeed believe. In any case, I have not been appointed a keeper over you.\n",
        "TRANSLATION_3": "If you are true believers then know that the profit which God has left for you is better for you (than what you may gain through deceitful ways). I am not responsible for your deeds.\"\n",
        "TRANSLATION_4": "“That which remains from Allah’s bestowal is better for you, if you believe; and I am not at all a guardian over you.”\n",
        "TRANSLATION_5": "That which is left by Allah is better for you, if you are believers. And I am not a guardian over you.\"\n",
        "TRANSLATION_6": "What remains with Allah is better for you if you are believers, and I am not a keeper over you.\n",
        "TRANSLATION_7": "God's remainder is better for you, if you are believers. And I am not a guardian over you.\n",
        "TRANSLATION_8": "That which Allah leaveth with you is better for you if ye are believers; and I am not a keeper over you.\n",
        "TRANSLATION_9": "What God leaves with you is the best for you, if you are believers. I have not been appointed as your keeper.\"\n",
        "TRANSLATION_10": "And the remainder of Allah is better for you, if ye believers, and I am not over you a guardian.\n",
        "TRANSLATION_11": "‘What remains of Allah’s provision is better for you, should you be faithful, and I am not a keeper over you.’\n",
        "TRANSLATION_12": "That which is left you by Allah is best for you, if ye (but) believed! but I am not set over you to keep watch!\"\n",
        "TRANSLATION_13": "That which is left by Allah for you (after giving the rights of the people) is better for you, if you are believers. And I am not set over you as a guardian.\n",
        "TRANSLATION_14": "What remains with Allah is better for you, if you are believers. I am not your guardian'\n",
        "TRANSLATION_15": "What is left by God is best for you, if you are believers. And I am not a guardian over you.”\n",
        "TRANSLATION_16": "What remains [lawful] from Allah is best for you, if you would be believers. But I am not a guardian over you.\"\n",
        "TRANSLATION_17": "[11:86] The remainder [which is] from God, that provision of His which remains for you after you have given full measure and weight, is better for you, than fraud, if you are believers; and I am not a guardian over you’, a watcher, that I should requite you for your deeds: I was sent only as a warner.\n",
        "TRANSLATION_18": "(That which Allah leaveth with you) Allah's reward for being honest in measure and weight (is better for you) it is said that this means: that which Allah leaves for you of the lawful is better than that which you steal by cheating in measure and weight (if ye are believers) if you believe in what I tell you; (and I am not a keeper over you) to protect, for Jethro was not commanded to fight them.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "11:86",
            "29:16",
            "20:73",
            "11:33",
            "10:109",
            "3:54",
            "8:23",
            "16:95",
            "2:271",
            "6:17"
        ],
        "BIBLE": [
            "prophets:ii%20kings:4:43",
            "prophets:i%20samuel:22:8",
            "prophets:i%20kings:8:36",
            "torah:deuteronomy:26:10",
            "torah:deuteronomy:26:11",
            "writings:ii%20chronicles:6:27",
            "prophets:joshua:15:19",
            "torah:genesis:45:21",
            "writings:ezra:8:17",
            "prophets:jeremiah:40:5"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:13",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:1:8"
        ]
    }
}