{
    "VERSE": "11:88",
    "ARABIC": "قَالَ يَٰقَوْمِ أَرَءَيْتُمْ إِن كُنتُ عَلَىٰ بَيِّنَةٍ مِّن رَّبِّى وَرَزَقَنِى مِنْهُ رِزْقًا حَسَنًا وَمَآ أُرِيدُ أَنْ أُخَالِفَكُمْ إِلَىٰ مَآ أَنْهَىٰكُمْ عَنْهُ إِنْ أُرِيدُ إِلَّا ٱلْإِصْلَٰحَ مَا ٱسْتَطَعْتُ وَمَا تَوْفِيقِىٓ إِلَّا بِٱللَّهِ عَلَيْهِ تَوَكَّلْتُ وَإِلَيْهِ أُنِيبُ",
    "ENGLISH": {
        "TRANSLATION_0": "He said, 'My people! What do you think? If I do possess a Clear Sign from my Lord and He has given me His good provision, I would clearly not want to go behind your backs and do something I have forbidden you to do. I only want to put things right as far as I can. My success is with Allah alone. I have put my trust in Him and I turn to Him.",
        "TRANSLATION_1": "He said: \"O my people, think. I have a clear sign from my Lord, who has also given me a goodly provision, and I do not wish for myself what I forbid you: I only wish to reform you as best I can. My success is from God alone. In Him I have placed my trust, and to Him I turn.\n",
        "TRANSLATION_2": "Shu'ayb said: 'My people! What do you think? If I stand on clear evidence from my Lord, and He has also provided me a handsome provision from Himself -(should I be ungrateful to Him and share your error and iniquity?) Nor do I desire to act contrary to what I admonish you. I desire nothing but to set things right as far as I can. My succour is only with Allah. In Him have I put my trust, and to Him do I always turn.\n",
        "TRANSLATION_3": "He said, \"My people, do you not realize that I have received authoritative evidence from my Lord and have been granted a noble gift from Him? I do not want to oppose or ignore what I have prohibited you not to do. I only intend to reform you as much as I can. My success is in the hands of God. I trust Him and turn to Him in repentance.\n",
        "TRANSLATION_4": "He said, “O my people! What is your opinion – if I am on a clear proof from my Lord and He has bestowed me with an excellent sustenance from Him (shall I ignore all this?); and the matter I forbid you to do, I do not wish that I myself act against it; I only intend to make improvements as far possible; my guidance is only from Allah; I rely only upon Him and towards Him only do I incline.”\n",
        "TRANSLATION_5": "He said: \"O my people! Tell me if I have a clear evidence from my Lord and He has given me a good sustenance from Himself (shall I corrupt it by mixing it with the unlawfully earned money). I wish not, in contradiction to you, to do that which I forbid you. I only desire reform to the best of my power. And my guidance cannot come except from Allah, in Him I put my trust and unto Him I repent.\"\n",
        "TRANSLATION_6": "He said: O my people! have you considered if I have a clear proof from my Lord and He has given me a goodly sustenance from Himself, and I do not desire that in opposition to you I should betake myself to that which I forbid you: I desire nothing but reform so far as I am able, and with none but Allah is the direction of my affair to a right issue; on Him do I rely and to Him do I turn:\n",
        "TRANSLATION_7": "He said, 'O my people, what think you? If I stand upon a clear sign from my Lord, and He has provided me with fair provision from Him -- and I desire not to come behind you, betaking me to that I forbid you; I desire only to set things right, so far as I am able. My succour is only with God; in Him I have put my trust, and to Him I turn, penitent.\n",
        "TRANSLATION_8": "He said: O my people! Bethink you: if I am (acting) on a clear proof from my Lord and He sustaineth me with fair sustenance from Him (how can I concede aught to you)? I desire not to do behind your backs that which I ask you not to do. I desire naught save reform so far as I am able. My welfare is only in Allah. In Him I trust and unto Him I turn (repentant).\n",
        "TRANSLATION_9": "[Shu'ayb] said, \"O my people! What do you think? If I have clear evidence from my Lord, and He has sustained me with fair sustenance from Himself [should I not guide you?]. I have no desire to do, out of opposition to you, what I am asking you not to do. I only want to reform you as far as I can. Nor can I succeed without God's help. In Him I have put my trust and to Him I turn.\n",
        "TRANSLATION_10": "He said: O my people! bethink if I rested on an evidence from my Lord, and He hath provided me with a goodly provision from Himself, shell I fail to deliver His message! And I desire not, in order to oppose you, to do that which I forbid I desire not but rectification, so far you as I am able, and my hope of success is not save with Allah; in Him I rely and unto Him I turn penitently.\n",
        "TRANSLATION_11": "He said, ‘O my people! Have you considered, should I stand on a manifest proof from my Lord, who has provided me a good provision from Himself? I do not wish to oppose you by what I forbid you. I only desire to put things in order, as far as I can, and my success lies only with Allah: in Him I have put my trust, and to Him I turn penitently.\n",
        "TRANSLATION_12": "He said: \"O my people! see ye whether I have a Clear (Sign) from my Lord, and He hath given me sustenance (pure and) good as from Himself? I wish not, in opposition to you, to do that which I forbid you to do. I only desire (your) betterment to the best of my power; and my success (in my task) can only come from Allah. In Him I trust, and unto Him I look.\n",
        "TRANSLATION_13": "He said: \"O my people! Tell me, if I have a clear evidence from my Lord, and He has given me a good sustenance from Himself (shall I corrupt it by mixing it with the unlawfully earned money). I wish not, in contradiction to you, to do that which I forbid you. I only desire reform so far as I am able, to the best of my power. And my guidance cannot come except from Allah, in Him I trust and unto Him I repent.\n",
        "TRANSLATION_14": "He said: 'Think, my nation! If I have a clear sign from my Lord and He has provided me with good provision, I do not desire to go behind you, taking for myself that which I forbid you. I seek but to reform as much as I can, my help comes only from Allah. In Him I have put my trust and to Him I turn in penitence.\n",
        "TRANSLATION_15": "He said, “O my people, have you considered? What if I have clear evidence from my Lord, and He has given me good livelihood from Himself? I have no desire to do what I forbid you from doing. I desire nothing but reform, as far as I can. My success lies only with God. In Him I trust, and to Him I turn.”\n",
        "TRANSLATION_16": "He said, \"O my people, have you considered: if I am upon clear evidence from my Lord and He has provided me with a good provision from Him...? And I do not intend to differ from you in that which I have forbidden you; I only intend reform as much as I am able. And my success is not but through Allah. Upon him I have relied, and to Him I return.\n",
        "TRANSLATION_17": "[11:88] He said, ‘O my people, have you considered that I might be [acting] upon a clear proof from my Lord and that He has provided me with fair, wholesome, sustenance from Him?, should I then blemish it with what is unlawful, in the way of fraud or stinting? And I do not desire to be inconsistent, and then partake, in what I forbid you, thus committing the same. I desire only to set things right, in your case, by way of [enjoining] justice, so far as I am able. My success, my ability to do this [successfully] and [to enjoin] other acts of obedience, is only with God. In Him I trust and to Him I turn, I return, [repentant].\n",
        "TRANSLATION_18": "(He said: my people! Bethink you: if I am) He says: I am ((acting) on a clear proof from my Lord) on a clear exposition that has come down to me from my Lord (and He sustaineth me with fair sustenance from Him) and He has favoured me with prophethood and Islam and further gave me a lawful property ((how can I concede aught to you)? I desire not to do behind your backs that which I ask you not to do) he says: I do not want to engage in that which I am warning you against: cheating in measure and weighing. (I desire naught save) I only desire (reform) justice in measure and weighing (so far as I am able. My welfare) in upholding right measurement and weighing (is only in Allah) is only from Allah. (In Him I trust) I entrust my matter to Him (and unto Him I turn) in complete devotion.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "11:88",
            "11:63",
            "5:84",
            "11:29",
            "11:30",
            "10:84",
            "5:67",
            "11:34",
            "11:92",
            "40:28"
        ],
        "BIBLE": [
            "prophets:joshua:9:11",
            "torah:genesis:3:6",
            "prophets:ezekiel:3:20",
            "writings:job:1:21",
            "prophets:ii%20kings:10:15",
            "prophets:i%20samuel:30:23",
            "torah:exodus:23:27",
            "prophets:ii%20kings:18:30",
            "prophets:isaiah:36:15",
            "writings:daniel:6:13"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:5:2",
            
            "Sefer%20Yetzirah:1:3",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:12"
        ]
    }
}