{
    "VERSE": "11:92",
    "ARABIC": "قَالَ يَٰقَوْمِ أَرَهْطِىٓ أَعَزُّ عَلَيْكُم مِّنَ ٱللَّهِ وَٱتَّخَذْتُمُوهُ وَرَآءَكُمْ ظِهْرِيًّا إِنَّ رَبِّى بِمَا تَعْمَلُونَ مُحِيطٌ",
    "ENGLISH": {
        "TRANSLATION_0": "He said, 'My people! Do you esteem my clan more than you do Allah? You have made Him into something to cast disdainfully behind your backs! But my Lord encompasses everything that you do!",
        "TRANSLATION_1": "He said: \"My clan seems mightier to you than God whom you neglect and push behind your backs. Surely what you do is within the power of my Lord.\n",
        "TRANSLATION_2": "Shu'ayb said: 'My people! Are my kinsmen mightier with you than Allah that you (hold the kinsmen in awe while) you cast Allah behind your back? Surely my Lord encompasses all what you do.\n",
        "TRANSLATION_3": "He asked them, \"My people, is my tribe more respectable to you than God whom you have completely ignored? My Lord certainly has full control over your deeds.\n",
        "TRANSLATION_4": "He said, “O my people! Is the pressure upon you from my relatives, worth more than Allah? And you put Him* behind your backs; indeed whatever you do is all within my Lords’ control.” (* His command / my preaching.)\n",
        "TRANSLATION_5": "He said: \"O my people! Is then my family of more weight with you than Allah And you have cast Him away behind your backs. Verily, my Lord is surrounding all that you do.\"\n",
        "TRANSLATION_6": "He said: O my people! is my family more esteemed by you than Allah? And you neglect Him as a thing cast behind your back; surely my Lord encompasses what you do:\n",
        "TRANSLATION_7": "He said, 'O my people, is my tribe stronger against you than God? And Him -- have you taken Him as something to be thrust behind you? My Lord encompasses the things you do.\n",
        "TRANSLATION_8": "He said: O my people! Is my family more to be honoured by you than Allah? and ye put Him behind you, neglected! Lo! my Lord surroundeth what ye do.\n",
        "TRANSLATION_9": "He said, \"My people, is my tribe mightier to you than God? You put Him behind you, turning your backs on Him! Surely, my Lord encompasses all that you do.\n",
        "TRANSLATION_10": "He said: O my people! is my company mightier with you than Allah? Him ye have cast behind your backs neglected; verily my Lord is of that which ye work Encompasser.\n",
        "TRANSLATION_11": "He said, ‘O my people! Is my tribe more formidable in your sight than Allah, to whom you pay no regard? Indeed my Lord comprehends whatever you do.\n",
        "TRANSLATION_12": "He said: \"O my people! is then my family of more consideration with you than Allah? For ye cast Him away behind your backs (with contempt). But verily my Lord encompasseth on all sides all that ye do!\n",
        "TRANSLATION_13": "He said: \"O my people! Is then my family of more weight with you than Allah? And you have cast Him away behind your backs. Verily, my Lord is surrounding all that you do.\n",
        "TRANSLATION_14": "He said: 'My nation, is my tribe stronger against you than Allah? You have taken Him to be thrown behind you, my Lord encompasses all that you do.\n",
        "TRANSLATION_15": "He said, “O my people, is my tribe more important to you than God? And you have turned your backs on Him? My Lord comprehends everything you do.”\n",
        "TRANSLATION_16": "He said, \"O my people, is my family more respected for power by you than Allah? But you put Him behind your backs [in neglect]. Indeed, my Lord is encompassing of what you do.\n",
        "TRANSLATION_17": "[11:92] He said, ‘O my people, is my clan more venerable in your sight than God?, such that you refrain from killing me because of them, instead of [your] protecting me for [being the Messenger of] God? And do you put Him, God, behind you, neglected?, rejected, behind your backs, not mindful of Him? Truly my Lord encompasses, in knowledge, what you do, and will requite you.\n",
        "TRANSLATION_18": "(He said: my people! Is my family) my clan (more to be honoured by you than Allah) than Allah's Book and religion; it is also said that this means: is the punishment of my clan more severe to you than Allah's chastisement? (And ye put Him) you placed Him (behind you, neglected) behind your back, i.e. you put that which I brought of the Book behind your backs. (Lo! my Lord surroundeth) knows (what ye do) the punishment you deserve for what you do.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "11:92",
            "11:29",
            "11:63",
            "11:88",
            "10:84",
            "11:30",
            "33:2",
            "9:56",
            "5:84",
            "6:80"
        ],
        "BIBLE": [
            "prophets:ii%20kings:2:10",
            "prophets:ii%20kings:2:16",
            "writings:ii%20chronicles:29:6",
            "torah:numbers:16:15",
            "torah:exodus:4:7",
            "writings:psalms:40:6",
            "prophets:isaiah:41:9",
            "prophets:ii%20kings:23:16",
            "prophets:jeremiah:6:11",
            "prophets:jeremiah:33:24"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:2",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:4:1"
        ]
    }
}