{
    "VERSE": "11:95",
    "ARABIC": "كَأَن لَّمْ يَغْنَوْا۟ فِيهَآ أَلَا بُعْدًا لِّمَدْيَنَ كَمَا بَعِدَتْ ثَمُودُ",
    "ENGLISH": {
        "TRANSLATION_0": "as if they had never lived there at all. Yes indeed! Away with Madyan just like Thamud!",
        "TRANSLATION_1": "As though they had not dwelt there at all. Beware! Condemmed were the people of Midian as those of Thamud had been before them!\n",
        "TRANSLATION_2": "as though they had never dwelt in them before. Lo! Away with (the people of) Midian, even as the Thamud were done away with!\n",
        "TRANSLATION_3": "as though they had never existed. How far from (the mercy of God) had the people of Midian gone, just as those of Thamud?\n",
        "TRANSLATION_4": "As if they had never lived there; away with the Madyan, just as the Thamud were removed afar!\n",
        "TRANSLATION_5": "As if they had never lived there! So away with Madyan just as Thamud went away!\n",
        "TRANSLATION_6": "As though they had never dwelt in them; now surely perdition overtook Madyan as had perished Samood.\n",
        "TRANSLATION_7": "as if they had never dwelt there: 'So away with Midian, even as Thamood was done away!'\n",
        "TRANSLATION_8": "As though they had not dwelt there. A far removal for Midian, even as Thamud had been removed afar!\n",
        "TRANSLATION_9": "as though they had never dwelt therein. Oh, away with the people of Midian, just as happened with the Thamud!\n",
        "TRANSLATION_10": "As though they had never lived at ease therein. Lo! a far removal for Madyan, even as Thamud were removed afar!\n",
        "TRANSLATION_11": "as if they had never lived there. Behold, away with Midian!—just as Thamud was done away with!\n",
        "TRANSLATION_12": "As if they had never dwelt and flourished there! Ah! Behold! How the Madyan were removed (from sight) as were removed the Thamud!\n",
        "TRANSLATION_13": "As if they had never lived there! So away with Madyan (Midian)! As away with Thamud! (All these nations were destroyed).\n",
        "TRANSLATION_14": "as if they had never have lived there. Begone, the nation of Midian, just as Thamood are gone.\n",
        "TRANSLATION_15": "As though they never flourished therein. Away with Median, as was done away with Thamood.\n",
        "TRANSLATION_16": "As if they had never prospered therein. Then, away with Madyan as Thamud was taken away.\n",
        "TRANSLATION_17": "[11:95] as if (ka-an is softened, in other words [understand it as] ka-annahum) they had never dwelt there: ‘Lo! Away with Midian, just as Thamūd was done away with!’\n",
        "TRANSLATION_18": "(As though they had not dwelt there) it was as if they never lived on this earth. (A far removal for Midian) the people of Shu'ayb from the mercy of Allah, (even as Thamud) the people of Salih (had been removed afar) from the mercy of Allah! The people of Salih and the people of Shu'ayb were punished by the same chastisement. They were seized by the Cry that announced their chastisement, followed by extreme heat. This heat came to the people of Salih from beneath their feet while it came to the people of Shu'ayb from above their heads.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "11:95",
            "11:68",
            "7:92",
            "70:6",
            "27:72",
            "25:16",
            "88:11",
            "20:118",
            "7:13",
            "72:7"
        ],
        "BIBLE": [
            "prophets:judges:18:24",
            "writings:ii%20chronicles:20:21",
            "prophets:ii%20samuel:13:8",
            "writings:i%20chronicles:17:13",
            "prophets:jeremiah:23:2",
            "prophets:jeremiah:16:5",
            "prophets:jeremiah:13:7",
            "prophets:ii%20samuel:12:29",
            "torah:numbers:32:39",
            "torah:genesis:18:31"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:14",
            "Sefer%20Yetzirah:1:8"
        ]
    }
}