{
    "VERSE": "11:96",
    "ARABIC": "وَلَقَدْ أَرْسَلْنَا مُوسَىٰ بِـَٔايَٰتِنَا وَسُلْطَٰنٍ مُّبِينٍ",
    "ENGLISH": {
        "TRANSLATION_0": "We sent Musa with Our Signs and clear authority",
        "TRANSLATION_1": "We sent Moses with Our signs and full authority\n",
        "TRANSLATION_2": "And indeed We sent Moses with Our signs and with a clear authority\n",
        "TRANSLATION_3": "We sent Moses to the Pharaoh and his nobles with Our miracles and a clear authority.\n",
        "TRANSLATION_4": "And indeed We sent Moosa with Our revelations and a clear domination.\n",
        "TRANSLATION_5": "And indeed We sent Musa with Our Ayat and a manifest authority.\n",
        "TRANSLATION_6": "And certainly We sent Musa with Our communications and a clear authority,\n",
        "TRANSLATION_7": "And We sent Moses with Our signs, and a manifest authority,\n",
        "TRANSLATION_8": "And verily We sent Moses with Our revelations and a clear warrant\n",
        "TRANSLATION_9": "We sent forth Moses with Our signs and with manifest authority,\n",
        "TRANSLATION_10": "And assuredly We sent Musa with Our signs and a manifest warranty.\n",
        "TRANSLATION_11": "Certainly We sent Moses with Our signs and a manifest authority\n",
        "TRANSLATION_12": "And we sent Moses, with Our Clear (Signs) and an authority manifest,\n",
        "TRANSLATION_13": "And indeed We sent Musa (Moses) with Our Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) and a manifest authority;\n",
        "TRANSLATION_14": "We sent Moses with Our signs and with clear authority\n",
        "TRANSLATION_15": "And We sent Moses with Our signs and a clear mandate.\n",
        "TRANSLATION_16": "And We did certainly send Moses with Our signs and a clear authority\n",
        "TRANSLATION_17": "[11:96] And verily We sent Moses with Our signs and a clear warrant, a manifest and evident proof,\n",
        "TRANSLATION_18": "(And verily We sent Moses with Our revelations) with nine signs (and a clear warrant) and a clear proof, the signs being themselves clear proof.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "11:96",
            "40:23",
            "23:45",
            "78:28",
            "54:15",
            "51:38",
            "23:30",
            "43:69",
            "20:56",
            "43:46"
        ],
        "BIBLE": [
            "torah:deuteronomy:34:11",
            "writings:psalms:135:9",
            "prophets:jeremiah:10:2",
            "torah:exodus:7:3",
            "torah:exodus:4:28",
            "writings:nehemiah:9:10",
            "torah:deuteronomy:6:22",
            "writings:daniel:3:33",
            "torah:exodus:10:1",
            "torah:deuteronomy:4:34"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:5:2"
        ]
    }
}