{
    "VERSE": "11:98",
    "ARABIC": "يَقْدُمُ قَوْمَهُۥ يَوْمَ ٱلْقِيَٰمَةِ فَأَوْرَدَهُمُ ٱلنَّارَ وَبِئْسَ ٱلْوِرْدُ ٱلْمَوْرُودُ",
    "ENGLISH": {
        "TRANSLATION_0": "He will go ahead of his people on the Day of Rising and lead them down into the Fire. What an evil watering-hole to be led to!",
        "TRANSLATION_1": "He shall be at the head of his people on the Day of Resurrection, and drive them into Hell like cattle driven to water -- what an evil watering-place to reach!\n",
        "TRANSLATION_2": "He shall stand at the head of his people on the Day of Resurrection, and will bring them down to the Fire. What a wretched destination to be led to!\n",
        "TRANSLATION_3": "On the Day of Judgment he will lead his people down into the hell fire. His leadership is evil and terrible is the place to which he leads!\n",
        "TRANSLATION_4": "He will lead his people on the Day of Resurrection, therefore landing them into hell; and what a wretched place to land into!\n",
        "TRANSLATION_5": "He will go ahead of his people on the Day of Resurrection, and will lead them into the Fire, and evil indeed is the place to which they are led.\n",
        "TRANSLATION_6": "He shall lead his people on the resurrection day, and bring them down to the fire; and evil the place to which they are brought.\n",
        "TRANSLATION_7": "He shall go before his people on the Day of Resurrection, and will have led them down to the Fire-evil the watering-place to be led down to!\n",
        "TRANSLATION_8": "He will go before his people on the Day of Resurrection and will lead them to the Fire for watering-place. Ah, hapless is the watering-place (whither they are) led.\n",
        "TRANSLATION_9": "He shall stand at the head of his people on the Day of Resurrection, and shall lead them into the Fire. Evil is the place to which they shall be led.\n",
        "TRANSLATION_10": "He shall head his people on the Day of Resurrection and cause them to descend into the Fire, ill is the descent, descended!\n",
        "TRANSLATION_11": "On the Day of Resurrection he will lead his people and conduct them into the Fire: an evil goal for the incoming!\n",
        "TRANSLATION_12": "He will go before his people on the Day of Judgment, and lead them into the Fire (as cattle are led to water): But woeful indeed will be the place to which they are led!\n",
        "TRANSLATION_13": "He will go ahead of his people on the Day of Resurrection, and will lead them into the Fire, and evil indeed is the place to which they are led.\n",
        "TRANSLATION_14": "He shall go before his nation on the Day of Resurrection and lead them into the Fire. Evil is the wateringplace to be led down to!\n",
        "TRANSLATION_15": "He will precede his people on the Day of Resurrection, and will lead them into the Fire. Miserable is the place he placed them in.\n",
        "TRANSLATION_16": "He will precede his people on the Day of Resurrection and lead them into the Fire; and wretched is the place to which they are led.\n",
        "TRANSLATION_17": "[11:98] He will go before his people on the Day of Resurrection, and they will follow him, as they did in this world, and he will lead them, he will admit them, to the Fire — an evil place, it is, for those entering it!\n",
        "TRANSLATION_18": "(He will go before his people) he will lead his people (on the Day of Resurrection and will lead them to the Fire for watering-place. Ah, hapless is the watering-place (whither they are) led) evil is the leader and evil are those that were led; it is also said that this means: evil are those entering, Pharaoh and his people, and evil is that where they will enter: the Fire. 238\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "11:98",
            "28:41",
            "51:13",
            "19:95",
            "23:16",
            "52:13",
            "28:65",
            "75:6",
            "28:42",
            "11:99"
        ],
        "BIBLE": [
            "prophets:ii%20kings:6:31",
            "torah:deuteronomy:29:9",
            "prophets:ezekiel:22:31",
            "writings:psalms:66:12",
            "prophets:obadiah:1:15",
            "torah:leviticus:4:24",
            "prophets:joel:4:7",
            "prophets:jeremiah:8:23",
            "writings:ezra:2:68",
            "torah:leviticus:4:33"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:3:8",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:3:4",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:1:6"
        ]
    }
}