{
    "VERSE": "45:11",
    "ARABIC": "هَٰذَا هُدًى وَٱلَّذِينَ كَفَرُوا۟ بِـَٔايَٰتِ رَبِّهِمْ لَهُمْ عَذَابٌ مِّن رِّجْزٍ أَلِيمٌ",
    "ENGLISH": {
        "TRANSLATION_0": "This is guidance. And those who reject the Signs of their Lord will have a punishment of agonising pain.",
        "TRANSLATION_1": "This is guidance. Those who deny the revelations of their Lord will suffer a dreadful doom.\n",
        "TRANSLATION_2": "This (Qur'an) is the true guidance. Those who deny the Signs of their Lord shall suffer the torment of a woeful scourge.\n",
        "TRANSLATION_3": "This (Quran) is a guidance. Those who reject the revelations of their Lord will suffer the most painful punishment.\n",
        "TRANSLATION_4": "This is the (true) guidance; and for those who disbelieve in the verses of their Lord is the severest of painful punishments.\n",
        "TRANSLATION_5": "This is guidance. And those who disbelieve in the Ayat of their Lord, for them there is a painful torment of Rijz.\n",
        "TRANSLATION_6": "This is guidance; and (as for) those who disbelieve in the communications of their Lord, they shall have a painful punishment on account of uncleanness.\n",
        "TRANSLATION_7": "This is guidance; and those who disbelieve in the signs of their Lord, there awaits them a painful chastisement of wrath.\n",
        "TRANSLATION_8": "This is guidance. And those who disbelieve the revelations of their Lord, for them there is a painful doom of wrath.\n",
        "TRANSLATION_9": "Such is Our guidance; those who reject their Lord's revelations shall suffer a woeful punishment.\n",
        "TRANSLATION_10": "This Book is guidance, and those who disbelieve in the revelations of their Lord, theirs shall be torment of calamity, afflictive.\n",
        "TRANSLATION_11": "This is [true] guidance, and there is a painful punishment due to defilement for those who defy the signs of their Lord.\n",
        "TRANSLATION_12": "This is (true) Guidance and for those who reject the Signs of their Lord, is a grievous Penalty of abomination.\n",
        "TRANSLATION_13": "This (Quran) is a guidance. And those who disbelieve in the Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) of their Lord, for them there is a painful torment of Rijz (a severe kind of punishment).\n",
        "TRANSLATION_14": "This is guidance; for those who disbelieve in the verses of their Lord the anger of the painful punishment awaits them.\n",
        "TRANSLATION_15": "This is guidance. Those who blaspheme their Lord’s revelations will have a punishment of agonizing pain.\n",
        "TRANSLATION_16": "This [Qur'an] is guidance. And those who have disbelieved in the verses of their Lord will have a painful punishment of foul nature.\n",
        "TRANSLATION_17": "[45:11] This, that is, the Qur’ān, is a guidance, from error; and those who disbelieve in the signs of their Lord, for them there will be a torture, a lot, of a painful, an excruciating, chastisement.\n",
        "TRANSLATION_18": "(This) i.e. this Qur'an (is guidance) from error. (And those who disbelieve the revelations of their Lord) those who disbelieve in Muhammad (pbuh) and the Qur'an, i.e. al-Nadr Ibn al-Harith and his host, (for them there is a painful doom of wrath) for them there is a painful punishment.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "45:11",
            "34:5",
            "29:23",
            "51:37",
            "16:104",
            "23:58",
            "22:57",
            "70:27",
            "10:97",
            "6:49"
        ],
        "BIBLE": [
            "torah:deuteronomy:29:19",
            "prophets:ezekiel:36:15",
            "prophets:ezekiel:5:15",
            "prophets:isaiah:38:7",
            "prophets:ezekiel:5:11",
            "writings:esther:10:2",
            "torah:deuteronomy:24:4",
            "writings:proverbs:19:19",
            "writings:daniel:12:1",
            "prophets:ii%20kings:22:13"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:1"
        ]
    }
}