{
    "VERSE": "45:14",
    "ARABIC": "قُل لِّلَّذِينَ ءَامَنُوا۟ يَغْفِرُوا۟ لِلَّذِينَ لَا يَرْجُونَ أَيَّامَ ٱللَّهِ لِيَجْزِىَ قَوْمًۢا بِمَا كَانُوا۟ يَكْسِبُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Tell those who have iman that they should forgive those who feel no fear about the Days of Allah, when He will repay people according to what they earned.",
        "TRANSLATION_1": "Tell the believers to forgive those who do not fear the visitations of God, so that He may requite the people for their deeds.\n",
        "TRANSLATION_2": "(O Prophet), tell the believers to indulge those who have no fear of any evil days coming upon them from Allah so that Allah may Himself requite them for their deeds.\n",
        "TRANSLATION_3": "Tell the believers to forgive those who do not have faith in the days of God (Day of Judgment) and Resurrection. God will give due recompense to all the people for their deeds.\n",
        "TRANSLATION_4": "Tell the believers to ignore those who do not expect the days of Allah, in order that Allah may give a nation the reward of what they used to earn.\n",
        "TRANSLATION_5": "Say to the believers to forgive those who hope not for the Days of Allah, that He may recompense people, according to what they have earned.\n",
        "TRANSLATION_6": "Say to those who believe (that) they forgive those who do not fear the days of Allah that He may reward a people for what they earn.\n",
        "TRANSLATION_7": "Say unto those who believe, that they forgive those who do not look for the days of God, that He may recompense a people for that they have been earning.\n",
        "TRANSLATION_8": "Tell those who believe to forgive those who hope not for the days of Allah; in order that He may requite folk what they used to earn.\n",
        "TRANSLATION_9": "Tell the believers to ignore those who do not believe in the coming of the days of God. He will requite people for what they have done.\n",
        "TRANSLATION_10": "Say thou Unto those who believe, let them forgive those who hope not for the days of Allah, that He may requite a community for that which they have been earning.\n",
        "TRANSLATION_11": "Say to the faithful to forgive those who do not expect Allah’s days, that He may [Himself] requite every people for what they used to earn.\n",
        "TRANSLATION_12": "Tell those who believe, to forgive those who do not look forward to the Days of Allah: It is for Him to recompense (for good or ill) each People according to what they have earned.\n",
        "TRANSLATION_13": "Say (O Muhammad SAW) to the believers to forgive those who (harm them and) hope not for the Days of Allah (i.e. His Recompense), that He may recompense people according to what they have earned (i.e. to punish these disbelievers, who harm the believers).\n",
        "TRANSLATION_14": "Tell the believers to forgive those who do not look for the Days of Allah, so that He recompenses the people for what they have earned.\n",
        "TRANSLATION_15": "Tell those who believe to forgive those who do not hope for the Days of God. He will fully recompense people for whatever they have earned.\n",
        "TRANSLATION_16": "Say, [O Muhammad], to those who have believed that they [should] forgive those who expect not the days of Allah so that He may recompense a people for what they used to earn.\n",
        "TRANSLATION_17": "[45:14] Tell those who believe to forgive those who do not anticipate, [those who do not] fear, the days of God, the events which He precipitates, that is to say, forgive the disbelievers the harm which they have caused you — this was before the command to struggle against them [had been revealed] — that He, God, may requite (a variant reading [for li-yajziya] has li-najziya, ‘that We may requite’) a people for what they used to earn, when they used to forgive disbelievers the harm which they did.\n",
        "TRANSLATION_18": "(Tell) Muhammad (those who believe) 'Umar and his fellow believers (to forgive those who hope not for) those who fear not (the days of Allah) the torment of Allah, the reference here is to the people of Mecca; (in order that He may requite folk) i.e. 'Umar and his fellow believers (what they used to earn) what they used to do of good deeds. This forgiveness relates to the period before the migration to Medina. They were later commanded to fight the disbelievers. 581\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "45:14",
            "40:33",
            "9:96",
            "9:77",
            "22:69",
            "9:56",
            "14:42",
            "4:168",
            "11:30",
            "12:92"
        ],
        "BIBLE": [
            "torah:numbers:24:14",
            "prophets:hosea:9:7",
            "prophets:isaiah:40:10",
            "prophets:ezekiel:36:22",
            "torah:deuteronomy:26:3",
            "prophets:ezekiel:38:16",
            "prophets:jeremiah:16:19",
            "prophets:i%20kings:18:36",
            "prophets:zechariah:2:15",
            "prophets:ezekiel:22:3"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:10",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:4:6",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:4:3"
        ]
    }
}