{
    "VERSE": "45:15",
    "ARABIC": "مَنْ عَمِلَ صَٰلِحًا فَلِنَفْسِهِۦ وَمَنْ أَسَآءَ فَعَلَيْهَا ثُمَّ إِلَىٰ رَبِّكُمْ تُرْجَعُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Whoever acts rightly, it is to his own good. Whoever does evil, it is to his detriment. Then you will be returned to your Lord.",
        "TRANSLATION_1": "He who does good does so for himself; and he who does evil suffers the consequence thereof. You have then to go back to your Lord.\n",
        "TRANSLATION_2": "Whoever acts righteously, does so to his own good; and whoever commits an evil will suffer its consequence. All of you will then be sent back to your Lord.\n",
        "TRANSLATION_3": "One who acts righteously does so for his own benefit and one who commits evil does so against his own soul. To your Lord you will all return.\n",
        "TRANSLATION_4": "Whoever does a good deed, so it is for his own good; and whoever commits evil, does for his own harm; and you will then be returned towards your Lord.\n",
        "TRANSLATION_5": "Whosoever does a good deed, it is for himself, and whosoever does evil, it is against (himself). Then to your Lord you will be made to return.\n",
        "TRANSLATION_6": "Whoever does good, it is for his own soul, and whoever does evil, it is against himself; then you shall be brought back to your-- Lord.\n",
        "TRANSLATION_7": "Whoso does righteousness, it is to his own gain, and whoso does evil, it is to his own loss; then to your Lord you shall be returned.\n",
        "TRANSLATION_8": "Whoso doeth right, it is for his soul, and whoso doeth wrong, it is against it. And afterward unto your Lord ye will be brought back.\n",
        "TRANSLATION_9": "Whoever does what is just and right, does so for his own good; and whoever does evil, does so to his own detriment, and you shall all return to your Lord.\n",
        "TRANSLATION_10": "Whosoever worketh righteously, worketh for himself; and whosoever doth evil, doth against himself; then Unto your Lord ye will be made to return.\n",
        "TRANSLATION_11": "Whoever acts righteously, it is for his own soul, and whoever does evil, it is to its own detriment, then you will be brought back to your Lord.\n",
        "TRANSLATION_12": "If any one does a righteous deed, it ensures to the benefit of his own soul; if he does evil, it works against (his own soul). In the end will ye (all) be brought back to your Lord.\n",
        "TRANSLATION_13": "Whosoever does a good deed, it is for his ownself, and whosoever does evil, it is against (his ownself). Then to your Lord you will be made to return.\n",
        "TRANSLATION_14": "He who does what is right does it for his own gain, and he who does evil does so at his own loss, then to your Lord you shall all return.\n",
        "TRANSLATION_15": "Whoever does a good deed, it is for his soul; and whoever commits evil, it is against it; then to your Lord you will be returned.\n",
        "TRANSLATION_16": "Whoever does a good deed - it is for himself; and whoever does evil - it is against the self. Then to your Lord you will be returned.\n",
        "TRANSLATION_17": "[45:15] Whoever acts righteously, it is for [the benefit of] his own soul, that he acts [so], and whoever does evil, it is to the detriment thereof, that he has done evil; then to your Lord you will be returned, [with your Lord] you shall end up, whereupon He will requite the one of righteous deeds and the evildoer.\n",
        "TRANSLATION_18": "(Whoso doeth right) sincerely in his capacity as a believer, (it is for his soul) the reward of that, (and whoso doeth wrong) and whosoever ascribes partners to Allah, (it is against it) the punishment of this is against his own soul. (And afterward unto your Lord ye will be brought back) after you die and He will requite you each according to his works.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "45:15",
            "6:104",
            "30:44",
            "41:46",
            "34:50",
            "108:2",
            "20:122",
            "84:2",
            "84:5",
            "10:108"
        ],
        "BIBLE": [
            "prophets:hosea:3:5",
            "writings:proverbs:16:3",
            "prophets:joshua:24:5",
            "prophets:jeremiah:23:20",
            "prophets:jeremiah:15:19",
            "prophets:jeremiah:30:24",
            "torah:exodus:31:15",
            "prophets:zechariah:1:3",
            "prophets:isaiah:1:27",
            "prophets:micah:3:4"
        ]
    }
}