{
    "VERSE": "45:19",
    "ARABIC": "إِنَّهُمْ لَن يُغْنُوا۟ عَنكَ مِنَ ٱللَّهِ شَيْـًٔا وَإِنَّ ٱلظَّٰلِمِينَ بَعْضُهُمْ أَوْلِيَآءُ بَعْضٍ وَٱللَّهُ وَلِىُّ ٱلْمُتَّقِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "They will not help you in any way against Allah. The wrongdoers are protectors of one another but Allah is the Protector of those who have taqwa.",
        "TRANSLATION_1": "They will not avail you in the least against God. Surely the wicked are each other's friends, but God befriends those who fear and follow the right path.\n",
        "TRANSLATION_2": "Surely they will be of no avail to you against Allah. Indeed the wrong-doers are friends of each other, whereas Allah is the friend of the God-fearing.\n",
        "TRANSLATION_3": "They will never be sufficient (protection) for you in place of God. The unjust are each other's friends, but God is the guardian of the pious ones.\n",
        "TRANSLATION_4": "Indeed they cannot benefit you at all against Allah; and indeed the unjust are the friends of each other; and Allah is the Friend of the pious.\n",
        "TRANSLATION_5": "Verily, they can avail you nothing against Allah. Verily, the wrongdoers are protecting friends of one another, but Allah is the Protector of those who have Taqwa.\n",
        "TRANSLATION_6": "Surely they shall not avail you in the least against Allah; and surely the unjust are friends of each other, and Allah is the guardian of those who guard (against evil).\n",
        "TRANSLATION_7": "Surely they will not avail thee aught against God. Surely the evildoers are friends one of the other; God is the friend of the godfearing.\n",
        "TRANSLATION_8": "Lo! they can avail thee naught against Allah. And lo! as for the wrong-doers, some of them are friends of others; and Allah is the Friend of those who ward off (evil).\n",
        "TRANSLATION_9": "They can be of no avail to you against God. The wrongdoers are friends of one another, while the friend of the righteous is God.\n",
        "TRANSLATION_10": "Verily they cannot avail thee at all against Allah. And verily the wrong doers! friends are they one Unto another. And Allah is the Friend of the God-fearing.\n",
        "TRANSLATION_11": "Indeed they will not avail you in any way against Allah. Indeed the wrongdoers are allies of one another, but Allah is the ally of the Godwary.\n",
        "TRANSLATION_12": "They will be of no use to thee in the sight of Allah: it is only Wrong-doers (that stand as) protectors, one to another: but Allah is the Protector of the Righteous.\n",
        "TRANSLATION_13": "Verily, they can avail you nothing against Allah (if He wants to punish you). Verily, the Zalimun (polytheists, wrong-doers, etc.) are Auliya' (protectors, helpers, etc.) to one another, but Allah is the Wali (Helper, Protector, etc.) of the Muttaqun (pious - see V. 2:2).\n",
        "TRANSLATION_14": "Indeed, they will not help you at all against Allah. The harmdoers are guides of each other; but Allah is the Guide of the cautious.\n",
        "TRANSLATION_15": "They will not help you against God in any way. The wrongdoers are allies of one another, while God is the Protector of the righteous.\n",
        "TRANSLATION_16": "Indeed, they will never avail you against Allah at all. And indeed, the wrongdoers are allies of one another; but Allah is the protector of the righteous.\n",
        "TRANSLATION_17": "[45:19] Assuredly they will not avail, they [will not] protect, you in any way against God, against His chastisement. And assuredly the wrongdoers, the disbelievers, are allies of one another; but God is the ally [only] of the God-fearing.\n",
        "TRANSLATION_18": "(Lo! they can avail you naught against Allah) against Allah's punishment if you follow their whims. (And lo! as for the wrong-doers) the disbelievers, (some of them are friends of others) some of them follow the religion of others; (and Allah is the Friend of those who ward off (evil)) disbelief, idolatry and indecencies.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "45:19",
            "9:67",
            "5:51",
            "3:116",
            "14:38",
            "58:17",
            "47:11",
            "7:196",
            "16:20",
            "3:5"
        ],
        "BIBLE": [
            "writings:proverbs:12:26",
            "torah:deuteronomy:31:29",
            "prophets:ii%20kings:6:19",
            "prophets:ezekiel:5:8",
            "prophets:joshua:14:9",
            "writings:psalms:139:24",
            "prophets:ezekiel:7:4",
            "writings:ezra:9:15",
            "torah:deuteronomy:17:2",
            "prophets:i%20kings:8:25"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:7",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:4:9",
            "Sefer%20Yetzirah:4:5"
        ]
    }
}