{
    "VERSE": "45:21",
    "ARABIC": "أَمْ حَسِبَ ٱلَّذِينَ ٱجْتَرَحُوا۟ ٱلسَّيِّـَٔاتِ أَن نَّجْعَلَهُمْ كَٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّٰلِحَٰتِ سَوَآءً مَّحْيَاهُمْ وَمَمَاتُهُمْ سَآءَ مَا يَحْكُمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Or do those who perpetrate evil deeds suppose that We will make them like those who have iman and do right actions, so that their lives and deaths will be the same? How bad their judgement is!",
        "TRANSLATION_1": "Do those who seek evil think that We shall make them equal in life and death to those who believe and do good? How bad is the judgement that they make!\n",
        "TRANSLATION_2": "Do the evil-doers imagine that We shall make them equal to those who believe and do good, making their lives and deaths alike? How vile is their judgement!\n",
        "TRANSLATION_3": "Do the people who commit evil think that We shall make their life and death like that of the righteously striving believers? How terrible is their Judgment!\n",
        "TRANSLATION_4": "Do those who commit evil assume that We will make them equal to those who believe and do good deeds, therefore both becoming equal in life and death? What an evil judgement they impose!\n",
        "TRANSLATION_5": "Or do those who earn evil deeds think that We shall hold them equal with those who believe and do righteous good deeds, in their present life and after their death Worst is the judgement that they make.\n",
        "TRANSLATION_6": "Nay! do those who have wrought evil deeds think that We will make them like those who believe and do good-- that their life and their death shall be equal? Evil it is that they judge.\n",
        "TRANSLATION_7": "Or do those who commit evil deeds think that We shall make them as those who believe and do righteous deeds, equal their living and their dying? How ill they judge!\n",
        "TRANSLATION_8": "Or do those who commit ill-deeds suppose that We shall make them as those who believe and do good works, the same in life and death? Bad is their judgment!\n",
        "TRANSLATION_9": "Do those who commit evil deeds imagine that We shall deal with them in the same way as We deal with those who have attained to faith and do righteous deeds, that they will be alike in their living and their dying? How badly they judge!\n",
        "TRANSLATION_10": "Deem those who commit ill deeds that We shall make them as those who believe and work righteous Works? Equal is their life and their death! How ill they judge!\n",
        "TRANSLATION_11": "Do those who have perpetrated misdeeds suppose that We shall treat them like those who have faith and do righteous deeds, their life and death being equal? Evil is the judgement that they make!\n",
        "TRANSLATION_12": "What! Do those who seek after evil ways think that We shall hold them equal with those who believe and do righteous deeds,- that equal will be their life and their death? Ill is the judgment that they make.\n",
        "TRANSLATION_13": "Or do those who earn evil deeds think that We shall hold them equal with those who believe (in the Oneness of Allah Islamic Monotheism) and do righteous good deeds, in their present life and after their death? Worst is the judgement that they make.\n",
        "TRANSLATION_14": "Do those who commit evil deeds think that We will make them (equal) to the believers who do good works, so that in life and death they shall be alike? How evil they judge!\n",
        "TRANSLATION_15": "Do those who perpetrate the evil deeds assume that We will regard them as equal to those who believe and do righteous deeds, whether in their life or their death? Evil is their judgment!\n",
        "TRANSLATION_16": "Or do those who commit evils think We will make them like those who have believed and done righteous deeds - [make them] equal in their life and their death? Evil is that which they judge.\n",
        "TRANSLATION_17": "[45:21] Or (am has the significance of the [rhetorical] hamza of denial) do those who have perpetrated evil acts, [such as] disbelief and disobedience, suppose that We shall treat them as those who believe and perform righteous deeds, equally (sawā’an is the predicate) in their life and in their death? (mahyāhum wamamātuhum, [this clause] constitutes the subject and a supplement; the sentence [itself] is a substitution for the kāf [of ka’lladhīna, ‘as those’], and both [suffixed] pronouns [-hum] refer to the disbelievers). The meaning is: do they suppose that in the Hereafter We will assign them [a] good [fate] like believers, [that they will enjoy] a life of plenty, one equal to their life in this world, as when they said to the believers: ‘Surely if we were to be resurrected, we will be given the same good things that you will be given!’ God, exalted be He, says, in accordance with His denial [implicit] in the [rhetorical interrogative] hamza: How evil is that judgement which they make! In other words, it will not be so, for in the Hereafter they will be [suffering] in the chastisement, in contrast to their lives in this world; the believers, on the other hand, will be [delighting] in the Reward in the Hereafter because of their righteous deeds in this world, such as [their observance of] prayers, [their] alms-giving, fasting and otherwise (the mā, ‘that … which’, relates to the verbal action, that is to say, ba’isa hukman hukmuhum hādhā, ‘awful as a judgement is this judgement of theirs’).\n",
        "TRANSLATION_18": "(Or do those who commit ill deeds) or do those who ascribes partners to Allah, i.e. 'Utbah and Shaybah and al-Walid Ibn 'Utbah who fought duals against 'AN, Hamzah and 'Ubaydah Ibn al-Harth on the Day of Badr, and who had said: \"If what Muhammad says about the Hereafter is true, then we will surely be better than them in the Hereafter, as we are better than them in the life of the world\". And so Allah said: or do they (suppose that We shall make them) that We shall make the disbelievers in terms of reward in the Hereafter (as those who believe) 'AN and his two fellow believers (and do good works) and do acts of obedience privately between themselves and their Lord, (the same life and death?) the life of the believer in his state of faith and his death in a state of faith cannot be the same as the life of the disbeliever who lives and dies in transgression and disbelief while Allah is angry with him. (Bad is their judgement) evil is that which they judge for themselves! 582\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "45:21",
            "29:4",
            "39:48",
            "45:33",
            "16:34",
            "29:7",
            "77:26",
            "13:21",
            "16:21",
            "39:51"
        ],
        "BIBLE": [
            "torah:exodus:34:10",
            "torah:deuteronomy:16:18",
            "writings:psalms:85:14",
            "torah:leviticus:20:25",
            "writings:psalms:119:27",
            "prophets:isaiah:10:2",
            "prophets:joshua:1:8",
            "prophets:hosea:2:8",
            "writings:job:11:3",
            "torah:genesis:21:18"
        ]
    }
}