{
    "VERSE": "45:28",
    "ARABIC": "وَتَرَىٰ كُلَّ أُمَّةٍ جَاثِيَةً كُلُّ أُمَّةٍ تُدْعَىٰٓ إِلَىٰ كِتَٰبِهَا ٱلْيَوْمَ تُجْزَوْنَ مَا كُنتُمْ تَعْمَلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "You will see every nation on its knees, every nation summoned to its Book: 'Today you will be repaid for what you did.",
        "TRANSLATION_1": "You will see each community kneeling down; and each community will be summoned to its ledger (of good and evil deeds). You will receive upon that day your recompense for what you had done.\n",
        "TRANSLATION_2": "On that Day you shall see every people fallen on their knees. Every people will be summoned to come forth and see its Record and will be told: “Today you shall be requited for your deeds.\n",
        "TRANSLATION_3": "You will see all the people kneeling down. Everyone will be summoned to the Book (containing the record of their deeds). They will be told, \"On this day you will be recompensed for what you have done\".\n",
        "TRANSLATION_4": "And you will see every group down on its knees; every group will be called towards its book of deeds; “This day you will be repaid for what you did.”\n",
        "TRANSLATION_5": "And you will see each nation humbled to their knees (Jathiyah), each nation will be called to its Record (of deeds). This Day you shall be recompensed for what you used to do.\n",
        "TRANSLATION_6": "And you shall see every nation kneeling down; every nation shall be called to its book: today you shall be rewarded for what you did.\n",
        "TRANSLATION_7": "And thou shalt see every nation hobbling on their knees, every nation being summoned unto its Book: 'Today you shall be recompensed for that you were doing.\n",
        "TRANSLATION_8": "And thou wilt see each nation crouching, each nation summoned to its record. (And it will be said unto them): This day ye are requited what ye used to do.\n",
        "TRANSLATION_9": "You will see every people on their knees, every people shall be summoned to its Record [and a voice will say], \"Today you will be requited for your deeds.\n",
        "TRANSLATION_10": "And thou shalt behold each community kneeling; each community shall be summoned to its Book. Today, shall be recompensed for that which ye have been working.\n",
        "TRANSLATION_11": "And you will see every nation fallen on its knees. Every nation will be summoned to its book: ‘Today you will be requited for what you used to do.\n",
        "TRANSLATION_12": "And thou wilt see every sect bowing the knee: Every sect will be called to its Record: \"This Day shall ye be recompensed for all that ye did!\n",
        "TRANSLATION_13": "And you will see each nation humbled to their knees (kneeling), each nation will be called to its Record (of deeds). This Day you shall be recompensed for what you used to do.\n",
        "TRANSLATION_14": "You shall see every nation hobbling on their knees. Each nation shall be summoned to its Book. (And it will be said:) 'This Day, you shall be recompensedfor what you were doing.\n",
        "TRANSLATION_15": "You will see every community on its knees; every community will be called to its Book: “Today you are being repaid for what you used to do.\n",
        "TRANSLATION_16": "And you will see every nation kneeling [from fear]. Every nation will be called to its record [and told], \"Today you will be recompensed for what you used to do.\n",
        "TRANSLATION_17": "[45:28] And you will see every community, that is, [all] members of a religion, crouching, on their knees — or [jāthiya means] ‘gathered together’. Every community will be summoned to its record, the record of its deeds and it will be said to them: ‘Today you will be requited for what you used to do, that is, [you will be given] the desert thereof.\n",
        "TRANSLATION_18": "(And thou wilt see each nation) the adherents of each religion (crouching) gathered, (each nation) the adherents of each religion (summoned to its record) to read the record of their good and bad deeds; some will be given their record in their right hands and others in their left. ((And it will be said unto them): This day ye are requited what ye used to do) and say in the life of the world.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "45:28",
            "17:13",
            "17:71",
            "36:64",
            "16:84",
            "27:83",
            "16:111",
            "40:27",
            "36:59",
            "78:29"
        ],
        "BIBLE": [
            "torah:genesis:21:17",
            "torah:exodus:34:10",
            "prophets:joshua:6:10",
            "prophets:jonah:2:3",
            "torah:exodus:14:13",
            "prophets:i%20kings:9:13",
            "prophets:zephaniah:3:7",
            "prophets:i%20samuel:14:45",
            "prophets:jeremiah:7:28",
            "writings:lamentations:3:57"
        ]
    }
}