{
    "VERSE": "45:3",
    "ARABIC": "إِنَّ فِى ٱلسَّمَٰوَٰتِ وَٱلْأَرْضِ لَءَايَٰتٍ لِّلْمُؤْمِنِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "In the heavens and earth there are certainly Signs for the muminun.",
        "TRANSLATION_1": "Indeed there are signs for believers in the heavens and the earth.\n",
        "TRANSLATION_2": "Behold, for those who believe there are (myriad) Signs in the heavens and the earth\n",
        "TRANSLATION_3": "In the heavens and the earth there is evidence (of the Truth) for the believers.\n",
        "TRANSLATION_4": "Indeed in the heavens and the earth are signs for believers.\n",
        "TRANSLATION_5": "Verily, in the heavens and the earth are signs for the believers.\n",
        "TRANSLATION_6": "Most surely in the heavens and the earth there are signs for the believers.\n",
        "TRANSLATION_7": "Surely in the heavens and earth there are signs for the believers;\n",
        "TRANSLATION_8": "Lo! in the heavens and the earth are portents for believers.\n",
        "TRANSLATION_9": "There are signs in the heavens and the earth for those who believe:\n",
        "TRANSLATION_10": "Verily in the heavens and the earth are signs Unto the believers.\n",
        "TRANSLATION_11": "In the heavens and the earth there are indeed signs for the faithful,\n",
        "TRANSLATION_12": "Verily in the heavens and the earth, are Signs for those who believe.\n",
        "TRANSLATION_13": "Verily, in the heavens and the earth are signs for the believers.\n",
        "TRANSLATION_14": "Indeed, there are signs in the heavens and earth for believers,\n",
        "TRANSLATION_15": "In the heavens and the earth are proofs for the believers.\n",
        "TRANSLATION_16": "Indeed, within the heavens and earth are signs for the believers.\n",
        "TRANSLATION_17": "[45:3] Truly in the heavens and the earth, that is to say, in their creation, there are signs, indicating the power of God and His Oneness, exalted be He, for believers.\n",
        "TRANSLATION_18": "(Lo! in the heavens) in that which is in the heavens of sun, moon, stars, clouds, etc., (and the earth) and that which is in the earth of trees, mountains, seas, etc., (are portents) are signs and lessons (for believers) who are true in their faith.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "45:3",
            "29:44",
            "51:20",
            "45:13",
            "12:105",
            "30:22",
            "3:190",
            "10:6",
            "30:26",
            "11:107"
        ],
        "BIBLE": [
            "torah:deuteronomy:10:14",
            "writings:psalms:146:6",
            "prophets:i%20kings:8:27",
            "writings:daniel:6:28",
            "torah:exodus:31:17",
            "writings:ii%20chronicles:6:18",
            "prophets:jeremiah:4:23",
            "writings:psalms:85:12",
            "writings:psalms:124:8",
            "writings:psalms:89:12"
        ]
    }
}