{
    "VERSE": "45:30",
    "ARABIC": "فَأَمَّا ٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّٰلِحَٰتِ فَيُدْخِلُهُمْ رَبُّهُمْ فِى رَحْمَتِهِۦ ذَٰلِكَ هُوَ ٱلْفَوْزُ ٱلْمُبِينُ",
    "ENGLISH": {
        "TRANSLATION_0": "As for those who had iman and did right actions, their Lord will admit them into His mercy. That is the Clear Victory.",
        "TRANSLATION_1": "So, those who believed and did good things will be admitted to His favour by their Lord. This will be a clear triumph.\n",
        "TRANSLATION_2": "As for those who believe and act righteously, their Lord shall admit them to His Mercy. That indeed is the manifest triumph.\n",
        "TRANSLATION_3": "The Lord will admit the righteously striving, believing people into His mercy. This is certainly a clear victory.\n",
        "TRANSLATION_4": "So those who believed and did good deeds – their Lord will admit them into His mercy; this is the clear triumph.\n",
        "TRANSLATION_5": "Then, as for those who believed and did good deeds, their Lord will admit them to His mercy. That will be the evident success.\n",
        "TRANSLATION_6": "Then as to those who believed and did good, their Lord will make them enter into His mercy; that is the manifest achievement.\n",
        "TRANSLATION_7": "And as for those who have believed and done deeds of righteousness, their Lord shall admit them into His mercy; that is the manifest triumph.\n",
        "TRANSLATION_8": "Then, as for those who believed and did good works, their Lord will bring them in unto His mercy. That is the evident triumph.\n",
        "TRANSLATION_9": "Those who believed and did good deeds will be admitted by their Lord into His mercy -- that shall be the manifest triumph.\n",
        "TRANSLATION_10": "Then, as for those who believed and worked righteous works, their Lord will cause them to enter into His mercy: that is a manifest achievement.\n",
        "TRANSLATION_11": "As for those who have faith and do righteous deeds, their Lord will admit them into His mercy. That is the manifest success!\n",
        "TRANSLATION_12": "Then, as to those who believed and did righteous deeds, their Lord will admit them to His Mercy that will be the achievement for all to see.\n",
        "TRANSLATION_13": "Then, as for those who believed (in the Oneness of Allah Islamic Monotheism) and did righteous good deeds, their Lord will admit them to His Mercy. That will be the evident success.\n",
        "TRANSLATION_14": "As for those who have believed and done good works, their Lord will admit them into His Mercy that is a mighty triumph!\n",
        "TRANSLATION_15": "As for those who believed and did righteous deeds, their Lord will admit them into His mercy. That is the clear triumph.\n",
        "TRANSLATION_16": "So as for those who believed and did righteous deeds, their Lord will admit them into His mercy. That is what is the clear attainment.\n",
        "TRANSLATION_17": "[45:30] So as for those who believed and performed righteous deeds, their Lord will admit them into His mercy, His Paradise. That is the manifest triumph, the clear and evident [triumph].\n",
        "TRANSLATION_18": "Then, as for those who believed) Muhammad (pbuh) and the Qur'an (and did good works) privately between them and their Lord, (their Lord will bring them in unto His mercy) into His Paradise. (That is the evident triumph) that is the Supreme Triumph: they earned the Garden and escaped the torment of the Fire and all that which is in it; these will be given their records in their right hands.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "45:30",
            "15:56",
            "17:28",
            "2:157",
            "7:151",
            "2:160",
            "68:50",
            "20:70",
            "30:15",
            "27:19"
        ],
        "BIBLE": [
            "torah:exodus:34:10",
            "writings:psalms:71:16",
            "prophets:i%20kings:14:13",
            "prophets:ezekiel:15:8",
            "writings:ecclesiastes:9:1",
            "prophets:i%20samuel:2:24",
            "writings:i%20chronicles:17:22",
            "torah:deuteronomy:7:2",
            "torah:deuteronomy:16:18",
            "prophets:zephaniah:3:20"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:2",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:2:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:5:1"
        ]
    }
}