{
    "VERSE": "45:31",
    "ARABIC": "وَأَمَّا ٱلَّذِينَ كَفَرُوٓا۟ أَفَلَمْ تَكُنْ ءَايَٰتِى تُتْلَىٰ عَلَيْكُمْ فَٱسْتَكْبَرْتُمْ وَكُنتُمْ قَوْمًا مُّجْرِمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "But as for those who were kafir: 'Were My Signs not recited to you and yet you proved arrogant; you were a people of evildoers?",
        "TRANSLATION_1": "As for the infidels, (it will be said): \"Were not My messages read out to you? But you behaved with self-conceit, and became a sinful people.\n",
        "TRANSLATION_2": "But those who denied the Truth, they shall be told: “Were My Signs not rehearsed to you? But you waxed proud and became a guilty people.”\n",
        "TRANSLATION_3": "To the unbelievers the Lord will say, \"Were not Our revelations recited to you and did not you arrogantly reject them? You were a sinful people\".\n",
        "TRANSLATION_4": "And to those who disbelieved, it will be said “Was it not that Our verses were recited to you? In response you were haughty and were a guilty people.”\n",
        "TRANSLATION_5": "But as for those who disbelieved (it will be said to them): \"Were not Our Ayat recited to you But you were proud, and you were a people who were criminals.\"\n",
        "TRANSLATION_6": "As to those who disbelieved: What! were not My communications recited to you? But you were proud and you were a guilty people.\n",
        "TRANSLATION_7": "But as for those who have disbelieved: 'Were not My signs recited to you, and you waxed proud, and were a sinful people?\n",
        "TRANSLATION_8": "And as for those who disbelieved (it will be said unto them): Were not Our revelations recited unto you? But ye were scornful and became a guilty folk.\n",
        "TRANSLATION_9": "But those who rejected the truth [will be asked], \"When My revelations were recited to you, were you not arrogant and did you not persist in wicked deeds?\n",
        "TRANSLATION_10": "And as for those who disbelieved: Were not My revelations rehearsed Unto you? but ye were stiff necked, and ye were a people guilty.\n",
        "TRANSLATION_11": "But as for the faithless, [they will be asked,] ‘Were not My signs recited to you? But you were disdainful, and you were a guilty lot.\n",
        "TRANSLATION_12": "But as to those who rejected Allah, (to them will be said): \"Were not Our Signs rehearsed to you? But ye were arrogant, and were a people given to sin!\n",
        "TRANSLATION_13": "But as for those who disbelieved (it will be said to them): \"Were not Our Verses recited to you? But you were proud, and you were a people who were Mujrimun (polytheists, disbelievers, sinners, criminals).\"\n",
        "TRANSLATION_14": "But, to the unbelievers (it will be said): 'Were My verses not recited to you, but you were proud and were you not a sinful nation'\n",
        "TRANSLATION_15": "But as for those who disbelieved: “Were My revelations not recited to you? But you turned arrogant, and were guilty people.”\n",
        "TRANSLATION_16": "But as for those who disbelieved, [it will be said], \"Were not Our verses recited to you, but you were arrogant and became a people of criminals?\n",
        "TRANSLATION_17": "[45:31]   But as for those who disbelieved, it will be said to them: ‘Were not My signs, [was not] the Qur’ān, recited to you, but you were disdainful, you were arrogant, and were a guilty, a disbelieving, lot?\n",
        "TRANSLATION_18": "(And as for those who disbelieved (it will be said unto them): Were not Our revelations recited unto you) in the life of the world? (But ye were scornful) but you were too proud to believe in them (and became a guilty folk) and became idolatrous folk.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "45:31",
            "23:105",
            "25:36",
            "11:30",
            "6:98",
            "6:105",
            "11:51",
            "29:35",
            "15:81",
            "21:77"
        ],
        "BIBLE": [
            "prophets:jeremiah:30:3",
            "prophets:i%20samuel:10:9",
            "torah:numbers:11:18",
            "prophets:ezekiel:3:20",
            "prophets:isaiah:65:1",
            "prophets:i%20samuel:14:41",
            "prophets:i%20kings:13:3",
            "torah:deuteronomy:2:9",
            "torah:numbers:20:12",
            "writings:i%20chronicles:23:25"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:1"
        ]
    }
}