{
    "VERSE": "45:33",
    "ARABIC": "وَبَدَا لَهُمْ سَيِّـَٔاتُ مَا عَمِلُوا۟ وَحَاقَ بِهِم مَّا كَانُوا۟ بِهِۦ يَسْتَهْزِءُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "The evil deeds they did will appear before them and the things they mocked at will engulf them.",
        "TRANSLATION_1": "The evil of what they had done will become clear to them, and they will be seized by what they had scorned.\n",
        "TRANSLATION_2": "(On that Day) the evil of their deeds will become apparent to them and what they had mocked at will encompass them,\n",
        "TRANSLATION_3": "Their evil deeds will be revealed to them and (the torment) which they had mocked will surround them.\n",
        "TRANSLATION_4": "And the evils of their deeds appeared to them, and the punishment they used to mock at encompassed them.\n",
        "TRANSLATION_5": "And the evil of what they did will appear to them, and that which they used to mock at will completely encircle them.\n",
        "TRANSLATION_6": "And the evil (consequences) of what they did shall become manifest to them and that which they mocked shall encompass them.\n",
        "TRANSLATION_7": "And the evil deeds that they have done shall appear to them, and they shall be encompassed by that they mocked at.\n",
        "TRANSLATION_8": "And the evils of what they did will appear unto them, and that which they used to deride will befall them.\n",
        "TRANSLATION_9": "The evil of their actions will then become clear to them. The punishment they mocked will engulf them.\n",
        "TRANSLATION_10": "And there will appear Unto them the evils Of that which they had worked, and there will surround them that whereat they had been mocking.\n",
        "TRANSLATION_11": "The evils of what they had done will appear to them, and they will be besieged by what they used to deride.\n",
        "TRANSLATION_12": "Then will appear to them the evil (fruits) of what they did, and they will be completely encircled by that which they used to mock at!\n",
        "TRANSLATION_13": "And the evil of what they did will appear to them, and they will be completely encircled by that which they used to mock at!\n",
        "TRANSLATION_14": "The evil of their deeds will appear to them, and they shall be encompassed by that they mocked,\n",
        "TRANSLATION_15": "The evils of what they did will become evident to them, and the very thing they ridiculed will haunt them.\n",
        "TRANSLATION_16": "And the evil consequences of what they did will appear to them, and they will be enveloped by what they used to ridicule.\n",
        "TRANSLATION_17": "[45:33] And there will appear before them, in the Hereafter, the evils of what they did, in this world, that is to say, the requital thereof, and they will be besieged by, there shall befall [them], what they used to deride, namely, the chastisement [of the Hereafter].\n",
        "TRANSLATION_18": "(And the evils of what they did) their most evil deeds (will appear unto them, and that which they used to deride) the punishment for deriding the messengers and Scriptures (will befall them) will descend upon them:\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "45:33",
            "39:48",
            "16:34",
            "39:51",
            "29:4",
            "29:7",
            "85:7",
            "28:84",
            "13:21",
            "26:211"
        ],
        "BIBLE": [
            "torah:deuteronomy:31:18",
            "writings:psalms:141:4",
            "torah:leviticus:23:3",
            "torah:exodus:35:2",
            "torah:exodus:31:15",
            "prophets:habakkuk:1:5",
            "torah:genesis:34:7",
            "prophets:micah:3:4",
            "prophets:joshua:7:15",
            "torah:numbers:19:14"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:2:5",
            
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:5:1"
        ]
    }
}