{
    "VERSE": "45:36",
    "ARABIC": "فَلِلَّهِ ٱلْحَمْدُ رَبِّ ٱلسَّمَٰوَٰتِ وَرَبِّ ٱلْأَرْضِ رَبِّ ٱلْعَٰلَمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "All praise belongs to Allah, the Lord of the heavens and the Lord of the earth, Lord of all the worlds.",
        "TRANSLATION_1": "All praise be to God, Lord of the heavens, Lord of the earth, Lord of all the worlds.\n",
        "TRANSLATION_2": "So all praise be to Allah, the Lord of the heavens, the Lord of the earth, the Lord of the whole Universe.\n",
        "TRANSLATION_3": "It is only God, Lord of the heavens and the earth and Lord of the Universe who deserves all praise.\n",
        "TRANSLATION_4": "So all praise is for Allah only, the Lord of the heavens and the Lord of the earth, the Lord of the Creation!\n",
        "TRANSLATION_5": "So all praise is due to Allah, the Lord of the heavens and the Lord of the earth, and the Lord of all that exists.\n",
        "TRANSLATION_6": "Therefore to Allah is due (all) praise, the Lord of the heavens and the Lord of the earth, the Lord of the worlds.\n",
        "TRANSLATION_7": "So to God belongs praise, the Lord of the heavens and the Lord of the earth, Lord of all Being.\n",
        "TRANSLATION_8": "Then praise be to Allah, Lord of the heavens and Lord of the earth, the Lord of the Worlds.\n",
        "TRANSLATION_9": "Praise, then, be to God, Lord of the heavens, and Lord of the earth, the Lord of all the worlds.\n",
        "TRANSLATION_10": "All praise, then, Unto Allah, Lord of the heavens and Lord of the earth, Lord of the worlds.\n",
        "TRANSLATION_11": "So all praise belongs to Allah, the Lord of the heavens and the Lord of the earth, the Lord of all the worlds.\n",
        "TRANSLATION_12": "Then Praise be to Allah, Lord of the heavens and Lord of the earth,- Lord and Cherisher of all the Worlds!\n",
        "TRANSLATION_13": "So all the praises and thanks are to Allah, the Lord of the heavens and the Lord of the earth, and the Lord of the 'Alamin (mankind, jinns and all that exists).\n",
        "TRANSLATION_14": "Praise, belongs to Allah, the Lord of the heavens and the earth, the Lord of the Worlds.\n",
        "TRANSLATION_15": "Praise belongs to God; Lord of the heavens, Lord of the earth, Lord of humanity.\n",
        "TRANSLATION_16": "Then, to Allah belongs [all] praise - Lord of the heavens and Lord of the earth, Lord of the worlds.\n",
        "TRANSLATION_17": "[45:36] So to God belongs [all] praise, the attribution to Him of what is beautiful [in words] for fulfilling His promise regarding the deniers; Lord of the heavens and Lord of the earth, the Lord of the Worlds, the Creator of all that has been mentioned (‘ālam, ‘world’, denotes everything other than God; it is in the plural [‘ālamīn] because of the different types [of beings] in them; rabbi, ‘Lord’, [in the last clause] is a substitution [for the previous ones]).\n",
        "TRANSLATION_18": "(Then praise be to Allah) gratitude and favour belong to Allah, (Lord of the heavens and Lords of the earth) the Creator of the heavens and the earth, (the Lord of the Worlds) and Lord of all that has a soul which moves about on the surface of the earth.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "45:36",
            "37:182",
            "1:2",
            "6:1",
            "40:64",
            "6:45",
            "21:4",
            "64:4",
            "31:26",
            "34:1"
        ],
        "BIBLE": [
            "torah:deuteronomy:10:14",
            "prophets:habakkuk:3:3",
            "torah:genesis:2:4",
            "writings:psalms:68:33",
            "writings:psalms:146:2",
            "writings:psalms:89:12",
            "writings:psalms:124:8",
            "writings:nehemiah:9:6",
            "writings:psalms:30:13",
            "torah:leviticus:11:44"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:3:7",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:3"
        ]
    }
}