{
    "VERSE": "45:9",
    "ARABIC": "وَإِذَا عَلِمَ مِنْ ءَايَٰتِنَا شَيْـًٔا ٱتَّخَذَهَا هُزُوًا أُو۟لَٰٓئِكَ لَهُمْ عَذَابٌ مُّهِينٌ",
    "ENGLISH": {
        "TRANSLATION_0": "When he does learn something of Our Signs, he makes a mockery of them. Such people will have a humiliating punishment.",
        "TRANSLATION_1": "When he comes to know something of Our messages he makes fun of them: For them is shameful punishment.\n",
        "TRANSLATION_2": "Whenever he comes to know anything of Our Signs, he makes them an object of jest. For such there awaits a humiliating chastisement.\n",
        "TRANSLATION_3": "When he learns about some of Our revelations, he mocks them. Such people will suffer a humiliating torment.\n",
        "TRANSLATION_4": "And when he comes to know about any of the verses, he mocks at it; for them is a disgraceful punishment.\n",
        "TRANSLATION_5": "And when he learns something of Our Ayat, he makes them a jest. For such there will be a humiliating torment.\n",
        "TRANSLATION_6": "And when he comes to know of any of Our communications, he takes it for a jest; these it is that shall have abasing chastisement.\n",
        "TRANSLATION_7": "And when he knows anything of Our signs, he takes them in mockery; those for them awaits a humbling chastisement.\n",
        "TRANSLATION_8": "And when he knoweth aught of Our revelations he maketh it a jest. For such there is a shameful doom.\n",
        "TRANSLATION_9": "When he learns something of Our revelations, he derides them: for such there will be humiliating torment.\n",
        "TRANSLATION_10": "And when he cometh to know aught of Our revelations, he taketh it scoffingly. These! theirs shall be a torment ignominous;\n",
        "TRANSLATION_11": "Should he learn anything about Our signs, he takes them in derision. For such there is a humiliating punishment.\n",
        "TRANSLATION_12": "And when he learns something of Our Signs, he takes them in jest: for such there will be a humiliating Penalty.\n",
        "TRANSLATION_13": "And when he learns something of Our Verses (this Quran), he makes them a jest. For such there will be a humiliating torment.\n",
        "TRANSLATION_14": "As for he who knows something of Our verses and then mocks them for those there is a humiliating punishment.\n",
        "TRANSLATION_15": "And when he learns something of Our revelations, he takes them in mockery. For such there is a shameful punishment.\n",
        "TRANSLATION_16": "And when he knows anything of Our verses, he takes them in ridicule. Those will have a humiliating punishment.\n",
        "TRANSLATION_17": "[45:9] And should he come to know anything of Our signs, namely, the Qur’ān, he takes them in mockery. For such, liars — there is a degrading chastisement.\n",
        "TRANSLATION_18": "(And when he knoweth) and when he hears (aught of Our revelations he maketh it a jest) a mockery. (For such) for people like al-Nadr Ibn al-Harith (there is a shameful doom) there is a severe torment.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "45:9",
            "22:57",
            "34:38",
            "34:5",
            "6:49",
            "51:37",
            "37:9",
            "30:16",
            "29:23",
            "37:14"
        ],
        "BIBLE": [
            "prophets:ezekiel:39:7",
            "prophets:joshua:6:18",
            "writings:daniel:5:15",
            "writings:daniel:5:8",
            "prophets:ezekiel:27:5",
            "torah:leviticus:4:35",
            "torah:exodus:23:27",
            "torah:leviticus:4:10",
            "prophets:ezekiel:15:3",
            "torah:leviticus:4:31"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:5:2",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:12"
        ]
    }
}