{
    "VERSE": "Sefer%20Yetzirah:5:2",
    "HEBREW": "שתים עשרה פשוטות ה\"ו ז\"ח ט\"י ל\"נ ס\"ע צ\"ק חקקן חצבן שקלן צרפן המירן וצר בהם שנים עשר מזלות בעולם סימן טש\"ת סא\"ב מע\"ק גד\"ד. ואלו הן שנים עשר חדשים בשנה ניסן אייר סיון תמוז אב אלול תשרי מרחשון כסלו טבת שבט אדר. ואלו הן שנים עשר מנהיגין בנפש שתי ידים ושתי רגלים שתי כליות טחול כבד מרה המסס קיבה קרקבן [שתי לועזים ושתי עליזים שתי יועצים ושתי יעוצים שתי טורפין ושתי ציידים]. עשאן כמין (מדינה) [מריבה] וערכן כמין מלחמה גם את זה לעומת זה עשה האלהים:<br>כיצד צרפן. המליך אות ה' וקשר לו כתר וצר בו טלה בעולם וניסן בשנה ויד ימין בנפש זכר ונקבה. המליך אות ו' וקשר לו כתר וצר בו שור בעולם ואייר בשנה ויד שמאל בנפש. המליך אות ז' וקשר לו כתר וצר בו תאומים בעולם וסיון בשנה ורגל ימין בנפש. המליך אות ח' וקשר לו כתר וצר בו סרטן בעולם ותמוז בשנה ורגל שמאל בנפש. המליך אות ט' וקשר לו כתר וצר בו אריה בעולם ואב בשנה וכוליא ימין בנפש. המליך אות י' וקשר לו כתר וצר בו בתולה בעולם ואלול בשנה וכוליא שמאל בנפש. המליך אות ל' וקשר לו כתר וצר בו מאזנים בעולם ותשרי בשנה וכבד בנפש. המליך אות נ' וקשר לו כתר וצר בו עקרב בעולם ומרחשוון בשנה וטחול בנפש. המליך אות ס' וקשר לו כתר וצר בו קשת בעולם וכסלו בשנה ומרה בנפש. המליך אות ע' וקשר לו כתר וצר בו גדי בעולם וטבת בשנה והמסס בנפש. המליך אות צ' וקשר לו כתר וצר בו דלי בעולם ושבט בשנה וקיבה בנפש. המליך אות ק' וקשר לו כתר וצר בו דגים בעולם ואדר בשנה וקרקבן בנפש:   ",
    "ENGLISH": "These twelve letters, he designed, formed, combined, weighed, and changed, and created with them the twelve divisions of the heavens (namely, the zodiacal constellations), the twelve months of the year, and the twelve important organs of the frame of man, namely the right and left hands, the right and left feet, two kidneys, the liver, the gall, the spleen, the intestines, the gullet, and the stomach. God produced Hei, predominant in Speech, crowned, combined, and formed Aries in the world, Nisan in the year, and the right foot of man. God produced Vav, predominant in Mind, crowned, combined, and formed Taurus in the world, Yiar in the year, and the right kidney of man. God produced Zayin, predominant in movement, crowned, combined, and formed Gemini in the world, Sivan in the year, and the left foot of man. He produced Chet, predominant in Sight, crowned, combined, and formed Cancer in the world, Tammuz in the year, and the right hand of man. He produced Tet, predominant in Hearing, crowned, combined, and formed Leo in the world, Ab in the year, and the left kidney in man. He produced Yud, predominant in Labor, crowned, combined, and formed Virgo in the world, Elul in the year, and the left hand of man. He produced Lamed, predominant in sexual desire, crowned, combined, and formed Libra in the world, Tishrei in the year, and the gall in man. He produced Nun, predominant in smell, crowned, combined, and formed Scorpio in the world, Marchesvan in the year, and the intestines in man. He produced Samech, predominant in sleep, crowned, combined, and formed Sagittarius in the world, Kislev in the year, and the stomach of man. He produced Ayin, predominant in Anger, crowned, combined, and formed Capricornus in the world, Tebet in the year, and the liver in man. He produced Tsade, predominant in Taste, crowned, combined, and formed Aquarius in the world, Shevat in the year, and the gullet in man. He produced Quph, predominant in Mirth, crowned, combined, and formed Pisces in the world, Adar in the year, and the spleen in man."
}