{
    "VERSE": "30:11",
    "ARABIC": "ٱللَّهُ يَبْدَؤُا۟ ٱلْخَلْقَ ثُمَّ يُعِيدُهُۥ ثُمَّ إِلَيْهِ تُرْجَعُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Allah originates creation, then will regenerate it, then you will be returned to Him.",
        "TRANSLATION_1": "God originates creation, and then will revert it, then you will go back to Him.\n",
        "TRANSLATION_2": "Allah creates in the first instance and will later repeat it. Thereafter it is to Him that you shall be sent back.\n",
        "TRANSLATION_3": "God begins the creation then causes it to turn back and to Him you will all return.\n",
        "TRANSLATION_4": "Allah initiates the creation, then will create it again – then it is to Him that you will return.\n",
        "TRANSLATION_5": "Allah originates the creation, then He will repeat it, then to Him you will be returned.\n",
        "TRANSLATION_6": "Allah originates the creation, then reproduces it, then to Him you shall be brought back.\n",
        "TRANSLATION_7": "God originates creation, then brings it back again, then unto Him you shall be returned.\n",
        "TRANSLATION_8": "Allah produceth creation, then He reproduceth it, then unto Him ye will be returned.\n",
        "TRANSLATION_9": "God originates the creation, and shall repeat it, then to Him you shall be returned.\n",
        "TRANSLATION_10": "Allah originateth the creation, then He shall restore it, then unto Him ye shall be returned.\n",
        "TRANSLATION_11": "Allah originates the creation, then He will bring it back, then you will be brought back to Him.\n",
        "TRANSLATION_12": "It is Allah Who begins (the process of) creation; then repeats it; then shall ye be brought back to Him.\n",
        "TRANSLATION_13": "Allah (Alone) originates the creation, then He will repeat it, then to Him you will be returned.\n",
        "TRANSLATION_14": "Allah originates creation, then brings it back again, then to Him you shall be returned.\n",
        "TRANSLATION_15": "God originates creation, and then repeats it. Then to Him you will be returned.\n",
        "TRANSLATION_16": "Allah begins creation; then He will repeat it; then to Him you will be returned.\n",
        "TRANSLATION_17": "[30:11] God originates creation, in other words, He produces the creation of mankind, then He will reproduce it, that is, the creation of them, after their death, then to Him you shall be returned (read turja‘ūna; or yurja‘ūna, ‘they shall be returned’).\n",
        "TRANSLATION_18": "(Allah produceth creation) from a sperm drop, (then He reproduceth it) on the Day of Judgement, (then unto Him ye will be returned) in the Hereafter and then He will requite each according to his works.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "30:11",
            "10:34",
            "29:19",
            "10:109",
            "31:11",
            "27:64",
            "53:62",
            "71:3",
            "2:15",
            "9:1"
        ],
        "BIBLE": [
            "prophets:jeremiah:15:19",
            "prophets:ii%20samuel:3:16",
            "writings:daniel:11:28",
            "prophets:zechariah:1:3",
            "writings:job:6:29",
            "prophets:micah:5:2",
            "prophets:ii%20samuel:17:3",
            "writings:psalms:9:18",
            "writings:ii%20chronicles:30:9",
            "writings:nehemiah:1:9"
        ]
    }
}