{
    "VERSE": "30:12",
    "ARABIC": "وَيَوْمَ تَقُومُ ٱلسَّاعَةُ يُبْلِسُ ٱلْمُجْرِمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "On the Day the Hour arrives the evildoers will be in despair.",
        "TRANSLATION_1": "The day the Resurrection comes the sinners will be overwhelmed with despair.\n",
        "TRANSLATION_2": "On that Day when the Hour will come to pass, the criminals shall be dumbfounded.\n",
        "TRANSLATION_3": "On the day when the Hour of Doom comes, the criminals will despair.\n",
        "TRANSLATION_4": "And on the Last Day– when it is established, the guilty* will lose all hope. (* The disbelievers.)\n",
        "TRANSLATION_5": "And on the Day when the Hour will be established, the criminals will be plunged into destruction with despair.\n",
        "TRANSLATION_6": "And at the time when the hour shall come the guilty shall be in despair.\n",
        "TRANSLATION_7": "Upon the day when the Hour is come, the sinners shall be confounded\n",
        "TRANSLATION_8": "And in the day when the Hour riseth the unrighteous will despair.\n",
        "TRANSLATION_9": "On the Day the Hour arrives, the guilty will be struck dumb with despair,\n",
        "TRANSLATION_10": "And on the day whereon the Hour arriveth, dumb-struck will be the culprits.\n",
        "TRANSLATION_11": "And when the Hour sets in, the guilty will despair.\n",
        "TRANSLATION_12": "On the Day that the Hour will be established, the guilty will be struck dumb with despair.\n",
        "TRANSLATION_13": "And on the Day when the Hour will be established, the Mujrimun (disbelievers, sinners, criminals, polytheists, etc.) will be plunged into destruction with deep regrets, sorrows, and despair.\n",
        "TRANSLATION_14": "On the Day when the Hour comes, the wrongdoers will be speechless.\n",
        "TRANSLATION_15": "On the Day when the Hour takes place, the guilty will despair.\n",
        "TRANSLATION_16": "And the Day the Hour appears the criminals will be in despair.\n",
        "TRANSLATION_17": "[30:12] And on the Day when the Hour comes, the sinners will be dumbfounded, the idolaters will be fall into silence, as their [line of] argument can no longer be continued.\n",
        "TRANSLATION_18": "(And in the day when the Hour) which is the Day of Judgement (riseth the criminals will despair) the idolaters will despair of any good.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "30:12",
            "30:14",
            "85:2",
            "30:55",
            "36:59",
            "79:6",
            "34:30",
            "54:1",
            "28:65",
            "86:9"
        ],
        "BIBLE": [
            "prophets:isaiah:7:23",
            "prophets:zechariah:12:9",
            "prophets:i%20samuel:10:5",
            "prophets:ezekiel:38:18",
            "prophets:isaiah:24:18",
            "writings:i%20chronicles:17:11",
            "prophets:isaiah:16:12",
            "prophets:isaiah:30:32",
            "prophets:ezekiel:39:11",
            "prophets:i%20kings:21:19"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:5:1",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:13",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:1:1"
        ]
    }
}