{
    "VERSE": "30:13",
    "ARABIC": "وَلَمْ يَكُن لَّهُم مِّن شُرَكَآئِهِمْ شُفَعَٰٓؤُا۟ وَكَانُوا۟ بِشُرَكَآئِهِمْ كَٰفِرِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "None of their partner-gods will intercede for them. They will reject their partner-gods.",
        "TRANSLATION_1": "No intercessor will they have among those they associated (with God), and will reject their partners.\n",
        "TRANSLATION_2": "None whom they had associated with Allah in His Divinity will intercede on their behalf; rather, they will disown those whom they had set up as Allah's associates in His Divinity.\n",
        "TRANSLATION_3": "None of the idols will intercede for them and they will reject their idols.\n",
        "TRANSLATION_4": "And the partners they ascribed will not be their intercessors – and they will deny their partners.\n",
        "TRANSLATION_5": "No intercessors will they have from those whom they made equal with Allah, and they will reject and deny their partners.\n",
        "TRANSLATION_6": "And they shall not have any intercessors from among their gods they have joined with Allah, and they shall be deniers of their associate-gods.\n",
        "TRANSLATION_7": "no intercessors shall they have amongst their associates, and they shall disbelieve in their associates.\n",
        "TRANSLATION_8": "There will be none to intercede for them of those whom they made equal with Allah. And they will reject their partners (whom they ascribed unto Him).\n",
        "TRANSLATION_9": "and they will have no intercessors among those partners they ascribed to God. They will deny these partners.\n",
        "TRANSLATION_10": "And not from their associate-gods, there will be intercessors for them, and unto their associate-gods they will be unbelievers.\n",
        "TRANSLATION_11": "None of those whom they ascribed as partners [to Allah] will intercede for them, and they will disavow their partners.\n",
        "TRANSLATION_12": "No intercessor will they have among their \"Partners\" and they will (themselves) reject their \"Partners\".\n",
        "TRANSLATION_13": "No intercessor will they have from those whom they made equal with Allah (partners i.e. their so-called associate gods), and they will (themselves) reject and deny their partners.\n",
        "TRANSLATION_14": "They shall have none to intercede for them amongst their associates, and they shall disbelieve in their associates.\n",
        "TRANSLATION_15": "They will have no intercessors from among their idols, and they will disown their partners.\n",
        "TRANSLATION_16": "And there will not be for them among their [alleged] partners any intercessors, and they will [then] be disbelievers in their partners.\n",
        "TRANSLATION_17": "[30:13] And none from among those partners of theirs, those whom they ascribed as partners of God, namely, the idols, to intercede for them, shall be intercessors for them and they shall disavow these partners of theirs, in other words, they shall dissociate from them.\n",
        "TRANSLATION_18": "(There will be none to intercede) in order to escape Allah's punishment (for them) for the worshippers of idols (of those whom they made equal with Allah) of their deities. (And they will reject their partners (whom they ascribed unto Him)) they will reject their deities, saying: by Allah! We were not idolaters.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "30:13",
            "68:41",
            "28:64",
            "6:51",
            "36:73",
            "20:109",
            "36:72",
            "74:48",
            "26:211",
            "51:45"
        ],
        "BIBLE": [
            "torah:genesis:28:22",
            "prophets:hosea:8:4",
            "writings:daniel:3:18",
            "prophets:ezekiel:14:3",
            "prophets:i%20kings:15:4",
            "prophets:isaiah:10:11",
            "prophets:ezekiel:39:15",
            "writings:psalms:20:6",
            "prophets:ezekiel:34:23",
            "prophets:jeremiah:11:13"
        ]
    }
}