{
    "VERSE": "30:15",
    "ARABIC": "فَأَمَّا ٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّٰلِحَٰتِ فَهُمْ فِى رَوْضَةٍ يُحْبَرُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "As for those who had iman and did right actions, they will be made joyful in a verdant meadow.",
        "TRANSLATION_1": "Those who believed and did the right will be feasted in a rich, well-watered meadow.\n",
        "TRANSLATION_2": "Then those who believed and acted righteously will be placed in a Garden and will be happy and jubilant.\n",
        "TRANSLATION_3": "The righteously striving believers will happily live in paradise.\n",
        "TRANSLATION_4": "So those who believed and did good deeds – they will be hosted in the Garden.\n",
        "TRANSLATION_5": "Then as for those who believed and did righteous good deeds, such shall be honored and made to enjoy a luxurious life in a Garden of Delight.\n",
        "TRANSLATION_6": "Then as to those who believed and did good, they shall be made happy in a garden.\n",
        "TRANSLATION_7": "as for those who believed, and did deeds of righteousness, they shall walk with joy in a green meadow,\n",
        "TRANSLATION_8": "As for those who believed and did good works, they will be made happy in a Garden.\n",
        "TRANSLATION_9": "those who believed and did good deeds will rejoice in a Garden,\n",
        "TRANSLATION_10": "Then as for those who believed and worked righteous works, they shall be in a meadow made happy.\n",
        "TRANSLATION_11": "As for those who have faith and do righteous deeds, they shall be in a garden, rejoicing.\n",
        "TRANSLATION_12": "Then those who have believed and worked righteous deeds, shall be made happy in a Mead of Delight.\n",
        "TRANSLATION_13": "Then as for those who believed (in the Oneness of Allah Islamic Monotheism) and did righteous good deeds, such shall be honoured and made to enjoy luxurious life (forever) in a Garden of delight (Paradise).\n",
        "TRANSLATION_14": "those who believe and did good deeds shall be well pleased in a garden,\n",
        "TRANSLATION_15": "As for those who believed and did good deeds—they will be delighted in meadows.\n",
        "TRANSLATION_16": "And as for those who had believed and done righteous deeds, they will be in a garden [of Paradise], delighted.\n",
        "TRANSLATION_17": "[30:15] As for those who believed and performed righteous deeds, they shall be made happy in a garden [of Paradise].\n",
        "TRANSLATION_18": "(As for those who believed) in Muhammad (pbuh) and in the Qur'an (and did good works) acts of obedience between themselves and their Lord, (they will be made happy in a Garden) they will be in Paradise, honoured and showered with gifts.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "30:15",
            "26:94",
            "37:116",
            "28:67",
            "19:72",
            "69:5",
            "11:106",
            "7:6",
            "45:30",
            "86:17"
        ],
        "BIBLE": [
            "writings:ecclesiastes:2:17",
            "writings:ecclesiastes:2:11",
            "prophets:isaiah:57:12",
            "prophets:habakkuk:1:5",
            "torah:genesis:3:24",
            "writings:ii%20chronicles:31:20",
            "torah:exodus:34:10",
            "prophets:zephaniah:3:5",
            "writings:job:36:6",
            "writings:psalms:73:28"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:13",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:2:4"
        ]
    }
}