{
    "VERSE": "30:22",
    "ARABIC": "وَمِنْ ءَايَٰتِهِۦ خَلْقُ ٱلسَّمَٰوَٰتِ وَٱلْأَرْضِ وَٱخْتِلَٰفُ أَلْسِنَتِكُمْ وَأَلْوَٰنِكُمْ إِنَّ فِى ذَٰلِكَ لَءَايَٰتٍ لِّلْعَٰلِمِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "Among His Signs is the creation of the heavens and earth and the variety of your languages and colours. There are certainly Signs in that for every being.",
        "TRANSLATION_1": "Among other signs of His is the creation of the heavens and the earth, and the variety of your tongues and complexions. Surely there are signs in this for those who understand.\n",
        "TRANSLATION_2": "And of His Signs is the creation of the heavens and the earth and the diversity of your tongues and colours. Indeed there are Signs in this for the wise.\n",
        "TRANSLATION_3": "Other evidence of His existence are the creation of the heavens and the earth and the differences of languages and colors. In this there is evidence (of the truth) for the worlds (mankind).\n",
        "TRANSLATION_4": "And among His signs is the creation of the heavens and the earth, and the differences in your languages and colours; indeed in this are signs for people who know.\n",
        "TRANSLATION_5": "And among His signs is the creation of the heavens and the earth, and the difference of your languages and colors. Verily, in that are indeed signs for men of sound knowledge.\n",
        "TRANSLATION_6": "And one of His signs is the creation of the heavens and the earth and the diversity of your tongues and colors; most surely there are signs in this for the learned.\n",
        "TRANSLATION_7": "And of His signs is the creation of the heavens and earth and the variety of your tongues and hues. Surely in that are signs for all living beings.\n",
        "TRANSLATION_8": "And of His signs is the creation of the heavens and the earth, and the difference of your languages and colours. Lo! herein indeed are portents for men of knowledge.\n",
        "TRANSLATION_9": "Another of His signs is that He created the heavens and earth, and the diversity of your languages and colours. There truly are signs in this for those who know.\n",
        "TRANSLATION_10": "And of His signs are the creation of the heavens and the earth, and the variation of your languages and complexions; verily herein are signs for men of knowledge.\n",
        "TRANSLATION_11": "Among His signs is the creation of the heavens and the earth, and the difference of your languages and colours. There are indeed signs in that for those who know.\n",
        "TRANSLATION_12": "And among His Signs is the creation of the heavens and the earth, and the variations in your languages and your colours: verily in that are Signs for those who know.\n",
        "TRANSLATION_13": "And among His Signs is the creation of the heavens and the earth, and the difference of your languages and colours. Verily, in that are indeed signs for men of sound knowledge.\n",
        "TRANSLATION_14": "And His signs are the creation of heavens and earth and the diversity of your tongues and colors. Surely, there are signs in this for all the worlds.\n",
        "TRANSLATION_15": "And of His signs is the creation of the heavens and the earth, and the diversity of your languages and colors. In this are signs for those who know.\n",
        "TRANSLATION_16": "And of His signs is the creation of the heavens and the earth and the diversity of your languages and your colors. Indeed in that are signs for those of knowledge.\n",
        "TRANSLATION_17": "[30:22] And of His signs is the creation of the heavens and the earth and the differences of your tongues, that is, your languages, such as Arabic, non-Arabic and so on, and your colours, such as white or black or otherwise, even though [all of] you are [originally] the offspring of the same man and woman. Surely in that there are signs, indications of His power, exalted be He, for all peoples ([this may be vocalised either as] li’l‘ālamīna or li’l-‘ālimīna, so [it means] either rational creatures, or people of knowledge [respectively]).\n",
        "TRANSLATION_18": "(And of His signs) of the signs of His divine Oneness and power (is the creation of the heavens and the earth, and the difference of your languages) Arabic, Persians and others languages (and colours) the colours of your forms: the red, the black, etc. (Lo! Herein) in the differences that I have mentioned (indeed are portents) signs (for men of knowledge) for the jinn and human beings.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "30:22",
            "45:3",
            "16:13",
            "45:13",
            "3:190",
            "29:44",
            "12:105",
            "42:29",
            "10:6",
            "30:24"
        ],
        "BIBLE": [
            "torah:exodus:11:7",
            "prophets:ezekiel:3:6",
            "prophets:jeremiah:4:22",
            "writings:daniel:4:14",
            "prophets:isaiah:51:7",
            "torah:deuteronomy:4:32",
            "prophets:jeremiah:10:12",
            "torah:exodus:33:16",
            "torah:deuteronomy:28:49",
            "writings:ii%20chronicles:6:18"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:4",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:3:5",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:2:3",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:5:2"
        ]
    }
}