{
    "VERSE": "30:26",
    "ARABIC": "وَلَهُۥ مَن فِى ٱلسَّمَٰوَٰتِ وَٱلْأَرْضِ كُلٌّ لَّهُۥ قَٰنِتُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Everyone in the heavens and earth belongs to Him. All are submissive to Him.",
        "TRANSLATION_1": "All those who are in the heavens and the earth are His, and they are all obedient to Him.\n",
        "TRANSLATION_2": "To Him belong all who are in the heavens and all who are on the earth. All are in obedience to Him.\n",
        "TRANSLATION_3": "Everyone in the heavens and the earth belongs to Him and is subservient to Him.\n",
        "TRANSLATION_4": "And to Him only belong all those who are in the heavens and the earth; all are submissive to Him.\n",
        "TRANSLATION_5": "To Him belongs whatever is in the heavens and the earth. All are obedient to Him.\n",
        "TRANSLATION_6": "And His is whosoever is in the heavens and the earth; all are obedient to Him.\n",
        "TRANSLATION_7": "To Him belongs whosoever is in the heavens and the earth; all obey His will.\n",
        "TRANSLATION_8": "Unto Him belongeth whosoever is in the heavens and the earth. All are obedient unto Him.\n",
        "TRANSLATION_9": "All those in the heavens and on the earth belong to Him. All are obedient to Him.\n",
        "TRANSLATION_10": "His is whosoever is in the heavens and the earth; all are unto Him obedient.\n",
        "TRANSLATION_11": "To Him belongs whoever is in the heavens and the earth. All are obedient to Him.\n",
        "TRANSLATION_12": "To Him belongs every being that is in the heavens and on earth: all are devoutly obedient to Him.\n",
        "TRANSLATION_13": "To Him belongs whatever is in the heavens and the earth. All are obedient to Him.\n",
        "TRANSLATION_14": "To Him belongs whosoever is in the heavens and the earth. All are obedient to His Will.\n",
        "TRANSLATION_15": "To Him belongs everyone in the heavens and the earth. All are submissive to Him.\n",
        "TRANSLATION_16": "And to Him belongs whoever is in the heavens and earth. All are to Him devoutly obedient.\n",
        "TRANSLATION_17": "[30:26] And to Him belongs whoever is in the heavens and the earth, as possessions, creatures and servants. All are obedient to Him.\n",
        "TRANSLATION_18": "Unto Him belongeth whosoever is in the heavens and in the earth) whosoever is in the heavens and in the earth are His slaves. (All are obedient unto Him) except the disbelievers.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "30:26",
            "55:29",
            "19:93",
            "4:126",
            "27:87",
            "20:4",
            "57:2",
            "4:132",
            "42:4",
            "5:120"
        ],
        "BIBLE": [
            "torah:deuteronomy:10:14",
            "writings:psalms:146:6",
            "writings:psalms:73:25",
            "prophets:isaiah:55:9",
            "writings:nehemiah:9:6",
            "writings:job:28:24",
            "writings:psalms:124:8",
            "torah:deuteronomy:4:17",
            "writings:psalms:16:3",
            "writings:job:20:27"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:3:3",
            "Sefer%20Yetzirah:1:11",
            "Sefer%20Yetzirah:5:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:3:7",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:6:1"
        ]
    }
}