{
    "VERSE": "30:3",
    "ARABIC": "فِىٓ أَدْنَى ٱلْأَرْضِ وَهُم مِّنۢ بَعْدِ غَلَبِهِمْ سَيَغْلِبُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "in the land nearby, but after their defeat they will themselves be victorious",
        "TRANSLATION_1": "In the neighbouring land. But having been conquered they will conquer\n",
        "TRANSLATION_2": "in the neighbouring land; but after their defeat they shall gain victory in a few years.\n",
        "TRANSLATION_3": "(within a few years) they will be victorious.\n",
        "TRANSLATION_4": "In the nearby land, and after their defeat they will soon be victorious.\n",
        "TRANSLATION_5": "In the nearest land, and they, after their defeat, will be victorious.\n",
        "TRANSLATION_6": "In a near land, and they, after being vanquished, shall overcome,\n",
        "TRANSLATION_7": "in the nearer part of the land; and, after their vanquishing, they shall be the victors\n",
        "TRANSLATION_8": "In the nearer land, and they, after their defeat will be victorious\n",
        "TRANSLATION_9": "in a nearby land. They will reverse their defeat with a victory\n",
        "TRANSLATION_10": "In a nearer land; and they, after the overcoming of them, shall soon overcome.\n",
        "TRANSLATION_11": "in a nearby land, but they, after their defeat, will be victorious\n",
        "TRANSLATION_12": "In a land close by; but they, (even) after (this) defeat of theirs, will soon be victorious-\n",
        "TRANSLATION_13": "In the nearer land (Syria, Iraq, Jordan, and Palestine), and they, after their defeat, will be victorious.\n",
        "TRANSLATION_14": "in a land close by. But, in a few years after their defeat they shall become the victors.\n",
        "TRANSLATION_15": "In a nearby territory. But following their defeat, they will be victorious.\n",
        "TRANSLATION_16": "In the nearest land. But they, after their defeat, will overcome.\n",
        "TRANSLATION_17": "[30:3] in the nearer [part of the] land, that is, in the Byzantine land [that lies] nearest to Persia in Mesopotamia (al-Jazīra). There the two armies met and the Persians were the ones who had begun the invasion. But they, that is the Byzantines, after their vanquishing (ghalabihim: the verbal noun [ghalab] has been annexed to the direct object [hum], in other words, ghalabatu fāris iyyāhum, ‘the Persians’ vanquishing of them’) shall be the victors, over the Persians,\n",
        "TRANSLATION_18": "(In the nearer land) close to Persia and, as a consequence, the believers were aggrieved while the idolaters rejoiced, saying: \"We shall defeat the believers just as the Persians defeated the Romans\", but then Allah proceeded to mention their victory (and they) i.e. the Romans, (after their defeat) at the hand of the Persians (will be victorious) over the Persians.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "30:3",
            "79:30",
            "17:90",
            "10:14",
            "14:14",
            "2:27",
            "38:28",
            "26:152",
            "7:129",
            "21:105"
        ],
        "BIBLE": [
            "prophets:jeremiah:42:16",
            "torah:genesis:45:6",
            "torah:deuteronomy:16:20",
            "torah:numbers:32:11",
            "torah:numbers:14:24",
            "torah:deuteronomy:1:36",
            "torah:genesis:24:5",
            "prophets:joshua:14:9",
            "prophets:jeremiah:3:19",
            "torah:genesis:41:30"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:2:2",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:3:7",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:1:4",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:8"
        ]
    }
}