{
    "VERSE": "30:30",
    "ARABIC": "فَأَقِمْ وَجْهَكَ لِلدِّينِ حَنِيفًا فِطْرَتَ ٱللَّهِ ٱلَّتِى فَطَرَ ٱلنَّاسَ عَلَيْهَا لَا تَبْدِيلَ لِخَلْقِ ٱللَّهِ ذَٰلِكَ ٱلدِّينُ ٱلْقَيِّمُ وَلَٰكِنَّ أَكْثَرَ ٱلنَّاسِ لَا يَعْلَمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "So set your face firmly towards the Deen, as a pure natural believer, Allah's natural pattern on which He",
        "TRANSLATION_1": "So keep yourself exclusively on the true way, the creational law of God according to which He created man with the quality of choosing right or wrong. There is no altering of God's creation. This is the supreme law. But most men do not understand.\n",
        "TRANSLATION_2": "(O Prophet and his followers), turn your face singlemindedly to the true Faith and adhere to the true nature on which Allah has created human beings. The mould fashioned by Allah cannot be altered. That is the True, Straight Faith, although most people do not know.\n",
        "TRANSLATION_3": "(Muhammad), be devoted to the upright religion. It is harmonious with the nature which God has designed for people. The design of God cannot be altered. Thus is the upright religion, but many people do not know.\n",
        "TRANSLATION_4": "Therefore set your attention for obeying Allah, devoted solely to Him; the foundation set by Allah, upon which He created man; do not change what Allah has created; this is the proper religion – but most people do not know.\n",
        "TRANSLATION_5": "So, set you your face towards the religion as a Hanif. Allah's Fitrah with which He has created mankind. No change let there be in Allah's Khalq, that is the straight religion, but most men know not.\n",
        "TRANSLATION_6": "Then set your face upright for religion in the right state-- the nature made by Allah in which He has made men; there is no altering of Allah's creation; that is the right religion, but most people do not know--\n",
        "TRANSLATION_7": "So set thy face to the religion, a man of pure faith -- God's original upon which He originated mankind. There is no changing God's creation. That is the right religion; but most men know it not --\n",
        "TRANSLATION_8": "So set thy purpose (O Muhammad) for religion as a man by nature upright - the nature (framed) of Allah, in which He hath created man. There is no altering (the laws of) Allah's creation. That is the right religion, but most men know not -\n",
        "TRANSLATION_9": "Devote yourself single-mindedly to the Religion. And follow the nature [constitution] as made by God, that nature in which He has created mankind. There is no altering the creation of God. That is the right religion. But most people do not realize it.\n",
        "TRANSLATION_10": "Wherefore set thou thy face towards the true religion uprightly. And follow thou the constitution of Allah according to which He hath constituted mankind. No altering let there be in Allah's creation. That is the right religion, but most men know not.\n",
        "TRANSLATION_11": "So set your heart as a person of pure faith on this religion, the original nature endowed by Allah according to which He originated mankind (There is no altering Allah’s creation; that is the upright religion, but most people do not know.)\n",
        "TRANSLATION_12": "So set thou thy face steadily and truly to the Faith: (establish) Allah's handiwork according to the pattern on which He has made mankind: no change (let there be) in the work (wrought) by Allah: that is the standard Religion: but most among mankind understand not.\n",
        "TRANSLATION_13": "So set you (O Muhammad SAW) your face towards the religion of pure Islamic Monotheism Hanifa (worship none but Allah Alone) Allah's Fitrah (i.e. Allah's Islamic Monotheism), with which He has created mankind. No change let there be in Khalq-illah (i.e. the Religion of Allah Islamic Monotheism), that is the straight religion, but most of men know not. [Tafsir At-Tabari, Vol 21, Page 41]\n",
        "TRANSLATION_14": "Therefore set your face to the religion purely, the upright creation upon which He originated people. There is no changing of the creation of Allah. This is the valuable religion, although most people do not know?\n",
        "TRANSLATION_15": "So devote yourself to the religion of monotheism—the natural instinct God has instilled in mankind. There is no altering God’s creation. This is the true religion, but most people do not know.\n",
        "TRANSLATION_16": "So direct your face toward the religion, inclining to truth. [Adhere to] the fitrah of Allah upon which He has created [all] people. No change should there be in the creation of Allah. That is the correct religion, but most of the people do not know.\n",
        "TRANSLATION_17": "[30:30] So set your purpose, O Muhammad (s), for religion, as a hanīf, as one inclining to it — in other words, devote your religion, you and whoever follows you, purely to God — a nature given by God, upon which He originated mankind, and this [nature] is His religion: in other words, adhere to it. There is no changing God’s creation, His religion, that is to say, do not change it by becoming idolaters. That is the upright religion, the belief in God’s Oneness, but most people, namely, the Meccan disbelievers, do not know, [anything of] God’s Oneness —\n",
        "TRANSLATION_18": "(So set thy purpose) your own self and work ((0 Muhammad) for religion as a man by nature upright) He says: make your religion and work sincere to Allah and be straight in following the religion of Islam (the nature (framed) of Allah) the religion of Allah, (in which He hath created man) in the wombs of their mothers; it is also said that this means: follow the Day of the Covenant. (There is no altering (the laws of) Allah's creation) there is no altering of the religion of Allah. (That is the right religion) the straight truth, (but most men know not) that the true religion of Allah is Islam.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "30:30",
            "12:40",
            "98:5",
            "45:26",
            "110:2",
            "30:43",
            "30:6",
            "16:38",
            "10:60",
            "4:125"
        ],
        "BIBLE": [
            "prophets:ezekiel:13:17",
            "prophets:i%20kings:18:37",
            "prophets:ezekiel:20:44",
            "writings:ecclesiastes:3:11",
            "writings:proverbs:24:12",
            "prophets:isaiah:50:7",
            "prophets:ii%20samuel:14:20",
            "prophets:jonah:3:8",
            "prophets:ezekiel:28:2",
            "torah:deuteronomy:30:10"
        ]
    }
}