{
    "VERSE": "30:31",
    "ARABIC": "مُنِيبِينَ إِلَيْهِ وَٱتَّقُوهُ وَأَقِيمُوا۟ ٱلصَّلَوٰةَ وَلَا تَكُونُوا۟ مِنَ ٱلْمُشْرِكِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "turning towards Him. Have taqwa of Him and establish salat. Do not be among the idolaters:",
        "TRANSLATION_1": "Turn towards Him and be dutiful to Him; be firm in devotion, and do not become an idolater,\n",
        "TRANSLATION_2": "(Adhere to the True Faith and) turn to Him, and hold Him in awe, and establish Prayer, and do not be of those who associate others with Allah in His Divinity,\n",
        "TRANSLATION_3": "Turn in repentance to Him. Have fear of Him. Be steadfast in your prayer. Do not be like the pagans\n",
        "TRANSLATION_4": "Inclining towards Him – and fear Him, and keep the prayer established, and never be of the polytheists.\n",
        "TRANSLATION_5": "(And remain always) turning in repentance to Him and have Taqwa of Him; and perform the Salah and be not of idolators.\n",
        "TRANSLATION_6": "Turning to Him, and be careful of (your duty to) Him and keep up prayer and be not of the polytheists\n",
        "TRANSLATION_7": "turning to Him. And fear you Him, and perform the prayer, and be not of the idolaters,\n",
        "TRANSLATION_8": "Turning unto Him (only); and be careful of your duty unto Him and establish worship, and be not of those who ascribe partners (unto Him);\n",
        "TRANSLATION_9": "Turn to Him and fear Him, and be steadfast in prayer, and do not be one of those who associate partners with God,\n",
        "TRANSLATION_10": "And remain turning penitently unto Him, and fear Him, and establish prayer, and be not of the associaters:\n",
        "TRANSLATION_11": "—turning to Him in penitence, and be wary of Him, and maintain the prayer, and do not be one of the polytheists\n",
        "TRANSLATION_12": "Turn ye back in repentance to Him, and fear Him: establish regular prayers, and be not ye among those who join gods with Allah,-\n",
        "TRANSLATION_13": "(Always) Turning in repentance to Him (only), and be afraid and dutiful to Him; and perform As-Salat (Iqamat-as-Salat) and be not of Al-Mushrikun (the disbelievers in the Oneness of Allah, polytheists, idolaters, etc.).\n",
        "TRANSLATION_14": "turning to Him. And fear Him, establish the prayer and do not be of the idolaters,\n",
        "TRANSLATION_15": "Turning towards Him—and be conscious of Him, and perform the prayer, and do not be of the idolaters.\n",
        "TRANSLATION_16": "[Adhere to it], turning in repentance to Him, and fear Him and establish prayer and do not be of those who associate others with Allah\n",
        "TRANSLATION_17": "[30:31] turning, referring, to Him, exalted be He, concerning what He has commanded and what He has forbidden (munībīna, ‘turning’ is a circumstantial qualifier referring to the subject [of the verb] aqim, ‘set up’, in other words [addressing the third plural person] aqīmū, ‘set up’) and fear Him and establish prayer and do not be among the idolaters,\n",
        "TRANSLATION_18": "(Turning unto Him (only)) be believers in Him, i.e. turning towards Him with acts of obedience; (and be careful of your duty unto Him) and obey Him in that which He commanded you, (and establish worship) perform the five daily prayers, (and be not of those who ascribe partners (unto Him)) do not be with the idolaters in their religion;\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "30:31",
            "6:72",
            "8:3",
            "2:43",
            "70:34",
            "23:9",
            "26:181",
            "2:3",
            "10:56",
            "2:238"
        ],
        "BIBLE": [
            "prophets:isaiah:57:11",
            "writings:job:23:11",
            "prophets:jeremiah:31:18",
            "prophets:isaiah:44:8",
            "writings:lamentations:5:22",
            "writings:psalms:66:20",
            "prophets:i%20samuel:15:30",
            "writings:lamentations:5:21",
            "prophets:isaiah:42:17",
            "prophets:ezekiel:33:11"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:1:6",
            
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:6:3",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:5:2"
        ]
    }
}