{
    "VERSE": "30:40",
    "ARABIC": "ٱللَّهُ ٱلَّذِى خَلَقَكُمْ ثُمَّ رَزَقَكُمْ ثُمَّ يُمِيتُكُمْ ثُمَّ يُحْيِيكُمْ هَلْ مِن شُرَكَآئِكُم مَّن يَفْعَلُ مِن ذَٰلِكُم مِّن شَىْءٍ سُبْحَٰنَهُۥ وَتَعَٰلَىٰ عَمَّا يُشْرِكُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "Allah is He who created you, then provides for you, then will cause you to die and then bring you back to life. Can any of your partner-gods do any of that? Glory be to Him and may He be exalted above anything they associate with Him!",
        "TRANSLATION_1": "It is God who created you, then gave you sustenance, then He will make you die, and bring you back to life. Is there one among those you associate with Him who can do the least of these things? Too high and exalted is He for what they associate with Him!\n",
        "TRANSLATION_2": "It is Allah Who created you, then bestowed upon you your sustenance, and He will cause you to die and then will bring you back to life. Can any of those whom you associate with Allah in His Divinity! do any such thing? Glory be to Him and exalted be He above whatever they associate with Allah in His Divinity.\n",
        "TRANSLATION_3": "It is God who has created you and given you sustenance. He will make you die and will bring you back to life. Can any of your idols do such things? God is too Exalted to be considered equal to anything else.\n",
        "TRANSLATION_4": "It is Allah Who created you and then provided you sustenance, then will cause you to die, and will then give you life again; is there any among your ascribed partners that can do any of these things? Purity and Supremacy are to Him, above their ascribing of partners (to Him)!\n",
        "TRANSLATION_5": "Allah is He Who created you, then provided food for you, then will cause you to die, then He will give you life. Is there any of your partners that do anything of that Glory be to Him! And Exalted be He above all that they associate.\n",
        "TRANSLATION_6": "Allah is He Who created you, then gave you sustenance, then He causes you to die, then brings you to life. Is there any of your associate-gods who does aught of it? Glory be to Him, and exalted be He above what they associate (with Him).\n",
        "TRANSLATION_7": "God is He that created you, then He provided for you, then He shall make you dead, then He shall give you life; is there any of your associates does aught of that? Glory be to Him! High be He exalted above that they associate!\n",
        "TRANSLATION_8": "Allah is He Who created you and then sustained you, then causeth you to die, then giveth life to you again. Is there any of your (so-called) partners (of Allah) that doeth aught of that? Praised and Exalted be He above what they associate (with Him)!\n",
        "TRANSLATION_9": "God is He who created you, then provides for you, then will cause you to die and then bring you back to life. Can any of your \"partners\" do any one of these things? Glory be to Him and exalted be He above anything they associate with Him!\n",
        "TRANSLATION_10": "Allah is He Who created you and provided food for you, then He causeth you to die, and then He shall quicken you. Is there any of your associate-gods that doth aught of that? Hallowed and exalted be He above that which they associate!\n",
        "TRANSLATION_11": "It is Allah who created you and then He provided for you, then He makes you die, then He will bring you to life. Is there anyone among your ‘partners’ who does anything of that kind? Immaculate is He and exalted above [having] any partners that they ascribe [to Him]!\n",
        "TRANSLATION_12": "It is Allah Who has created you: further, He has provided for your sustenance; then He will cause you to die; and again He will give you life. Are there any of your (false) \"Partners\" who can do any single one of these things? Glory to Him! and high is He above the partners they attribute (to him)!\n",
        "TRANSLATION_13": "Allah is He Who created you, then provided food for you, then will cause you to die, then (again) He will give you life (on the Day of Resurrection). Is there any of your (so-called) partners (of Allah) that do anything of that? Glory be to Him! And Exalted be He above all that (evil) they associate (with Him).\n",
        "TRANSLATION_14": "It is Allah who has created you and given you your provision. He will cause you to die, and will then revive you. Can any of your associates do any of that? Exalted is He above what they associate.\n",
        "TRANSLATION_15": "God is He who created you, then provides for you, then makes you die, then brings you back to life. Can any of your idols do any of that? Glorified is He, and Exalted above what they associate.\n",
        "TRANSLATION_16": "Allah is the one who created you, then provided for you, then will cause you to die, and then will give you life. Are there any of your \"partners\" who does anything of that? Exalted is He and high above what they associate with Him.\n",
        "TRANSLATION_17": "[30:40] God is the One Who created you, then provided for you, then makes you die, then gives you life: is there anyone among your associates, of those whom you have associated with God, who does anything of the kind? No! Glory be to Him and exalted be He above what they associate, with Him.\n",
        "TRANSLATION_18": "(Allah is He Who created you) as living beings in the wombs of your mothers and then He made you emerge from there possessed of a spirit (and then sustained you) provided you with sustenance until you die, (then causeth you to die) when your lifespan expires, (then giveth life to you again) for the resurrection after you die. (Is there any of your (so called) partners (of Allah)) of your idols, O people of Mecca, (that doeth aught of that) who is able to do any of this? (Praised) He exonerated Himself from having a son or partners (and exalted be He above what they associate (with Him)) of idols!\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "30:40",
            "37:159",
            "16:1",
            "42:10",
            "16:57",
            "52:43",
            "10:34",
            "6:100",
            "7:190",
            "28:68"
        ],
        "BIBLE": [
            "torah:leviticus:17:11",
            "prophets:hosea:2:14",
            "writings:ii%20chronicles:14:6",
            "prophets:joshua:23:15",
            "prophets:ii%20samuel:22:36",
            "writings:ecclesiastes:8:15",
            "prophets:i%20kings:5:23",
            "torah:genesis:9:3",
            "torah:exodus:36:6",
            "torah:genesis:27:4"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:4:2",
            
            "Sefer%20Yetzirah:1:1",
            "Sefer%20Yetzirah:5:2"
        ]
    }
}