{
    "VERSE": "30:49",
    "ARABIC": "وَإِن كَانُوا۟ مِن قَبْلِ أَن يُنَزَّلَ عَلَيْهِم مِّن قَبْلِهِۦ لَمُبْلِسِينَ",
    "ENGLISH": {
        "TRANSLATION_0": "even though before He sent it down on them they were in despair.",
        "TRANSLATION_1": "Although before it came down they were despondent.\n",
        "TRANSLATION_2": "although before that they were given to despair.\n",
        "TRANSLATION_3": "at the rainfall, though before that they had been in despair.\n",
        "TRANSLATION_4": "Although they had lost hope before it was sent down upon them.\n",
        "TRANSLATION_5": "And verily, before that -- just before it was sent down upon them -- they were in despair!\n",
        "TRANSLATION_6": "Though they were before this, before it was sent down upon them, confounded in sure despair.\n",
        "TRANSLATION_7": "although before it was sent down on them before that they had been in despair.\n",
        "TRANSLATION_8": "Though before that, even before it was sent down upon them, they were in despair.\n",
        "TRANSLATION_9": "though before that, before it was sent down upon them, they were in despair.\n",
        "TRANSLATION_10": "Even though before it was sent down upon them, before that, they were surely despairing.\n",
        "TRANSLATION_11": "and indeed they had been despondent earlier, before it was sent down upon them.\n",
        "TRANSLATION_12": "Even though, before they received (the rain) - just before this - they were dumb with despair!\n",
        "TRANSLATION_13": "And verily before that (rain), just before it was sent down upon them, they were in despair!\n",
        "TRANSLATION_14": "though before its coming they had despaired.\n",
        "TRANSLATION_15": "Although they were before this—before it was sent down upon them—in despair.\n",
        "TRANSLATION_16": "Although they were, before it was sent down upon them - before that, in despair.\n",
        "TRANSLATION_17": "[30:49] Though indeed before it was sent down upon them, before that (min qablihi is [repeated] for emphasis) they had been despondent, despairing of its sending down.\n",
        "TRANSLATION_18": "(Though before that) before the rain, (even before it was sent down upon them, they were in despair) about the rain.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "30:49",
            "41:48",
            "6:28",
            "6:156",
            "39:65",
            "21:51",
            "21:41",
            "37:167",
            "29:3",
            "51:46"
        ],
        "BIBLE": [
            "prophets:i%20kings:9:12",
            "prophets:ezekiel:16:33",
            "writings:esther:2:13",
            "prophets:joshua:13:8",
            "writings:i%20chronicles:29:14",
            "prophets:jeremiah:13:20",
            "writings:psalms:105:32",
            "torah:genesis:38:18",
            "torah:exodus:34:32",
            "writings:nehemiah:2:9"
        ]
    }
}