{
    "VERSE": "30:54",
    "ARABIC": "ٱللَّهُ ٱلَّذِى خَلَقَكُم مِّن ضَعْفٍ ثُمَّ جَعَلَ مِنۢ بَعْدِ ضَعْفٍ قُوَّةً ثُمَّ جَعَلَ مِنۢ بَعْدِ قُوَّةٍ ضَعْفًا وَشَيْبَةً يَخْلُقُ مَا يَشَآءُ وَهُوَ ٱلْعَلِيمُ ٱلْقَدِيرُ",
    "ENGLISH": {
        "TRANSLATION_0": "It is Allah who created you from a weak beginning then after weakness gave you strength then after strength ordained weakness and grey hair. He creates whatever He wills. He is All-Knowing, Ail-Powerful.",
        "TRANSLATION_1": "It is God who created you of weakness, then after weakness gave you strength, then after strength will give you weakness and grey hair. Surely He makes whatever He wills. He is all-knowing and all-powerful.\n",
        "TRANSLATION_2": "It is Allah Who created you in a state of weakness; then after weakness He gave you strength, then after strength He made you weak and old. He creates what He pleases. He is All-Knowing, All-Powerful.\n",
        "TRANSLATION_3": "It is God who has created you weak, then, given you strength after your weakness and caused you to become weak and old after being strong. He creates whatever He wants. He is All-knowing and All-powerful.\n",
        "TRANSLATION_4": "It is Allah Who created you weak, then after weakness gave you strength, then after strength gave you weakness and old age; He creates whatever He wills; and only He is the All Knowing, the Able.\n",
        "TRANSLATION_5": "Allah is He Who created you in weakness, then gave you strength after weakness, then after strength gave (you) weakness and grey hair. He creates what He wills. And He is the All-Knowing, the All-Powerful.\n",
        "TRANSLATION_6": "Allah is He Who created you from a state of weakness then He gave strength after weakness, then ordained weakness and hoary hair after strength; He creates what He pleases, and He is the Knowing, the Powerful.\n",
        "TRANSLATION_7": "God is He that created you of weakness, then He appointed after weakness strength, then after strength He appointed weakness and grey hairs; He creates what He will, and He is the All-knowing, the All-powerful.\n",
        "TRANSLATION_8": "Allah is He Who shaped you out of weakness, then appointed after weakness strength, then, after strength, appointed weakness and grey hair. He createth what He will. He is the Knower, the Mighty.\n",
        "TRANSLATION_9": "God is the One who has created you in a state of weakness; then He has granted you strength following [your] weakness; later on He has given you infirmity and grey hairs in place of strength. He creates whatever He wishes; He is the All Knowing and All Powerful.\n",
        "TRANSLATION_10": "Allah it is Who created you in weakness, then He appointed strength after weakness, then after strength appointed weakness and grey hair. He createth whatsoever He listeth: and He is Knower, the Potent.\n",
        "TRANSLATION_11": "It is Allah who created you from [a state of] weakness, then He gave you power after weakness. Then, after power, He ordained weakness and old age: He creates whatever He wishes, and He is the All-knowing, the All-powerful.\n",
        "TRANSLATION_12": "It is Allah Who created you in a state of (helpless) weakness, then gave (you) strength after weakness, then, after strength, gave (you weakness and a hoary head: He creates as He wills, and it is He Who has all knowledge and power.\n",
        "TRANSLATION_13": "Allah is He Who created you in (a state of) weakness, then gave you strength after weakness, then after strength gave (you) weakness and grey hair. He creates what He wills. And it is He Who is the All-Knowing, the All-Powerful (i.e. Able to do all things).\n",
        "TRANSLATION_14": "Allah creates you weak; after weakness He gives you strength and after strength weakness and gray hairs. He creates whatever He will. He is the Knower, the Capable.\n",
        "TRANSLATION_15": "God is He Who created you weak, then after weakness gave you strength, then after strength gave you weakness and gray hair. He creates whatever He wills. He is the Omniscient, the Omnipotent.\n",
        "TRANSLATION_16": "Allah is the one who created you from weakness, then made after weakness strength, then made after strength weakness and white hair. He creates what He wills, and He is the Knowing, the Competent.\n",
        "TRANSLATION_17": "[30:54] God is the One Who created you from [a state of] weakness, [from] a ‘base fluid’ [cf. Q. 32:8], then He ordained after, a second, weakness, which is the weakness of [the period of] childhood, strength, that is, the strength of youth, then after strength He appointed weakness [again] and grey hair, the weakness of old age and the grey hairs of decrepitude (read [vocalised as] du‘f, ‘weakness’, in all three places). He creates what He will, of weakness and strength, youth and grey hairs, and He is the Knower, of how to manage His creatures, the Omnipotent.\n",
        "TRANSLATION_18": "(Allah is He who shaped you out of weakness) from a weak sperm, (then appointed after weakness strength) a strong, young man, (then, after strength, appointed weakness) old age (and grey hair) after enjoying youth. (He createth what He will) He transforms His created beings as He wills from one state to another. (He is the Knower) of His creation, (the Mighty) He is able to transform them.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "30:54",
            "16:70",
            "35:44",
            "9:115",
            "8:75",
            "64:4",
            "24:47",
            "26:227",
            "3:61",
            "2:27"
        ],
        "BIBLE": [
            "torah:deuteronomy:28:13",
            "torah:deuteronomy:1:13",
            "prophets:jeremiah:18:16",
            "writings:daniel:7:6",
            "prophets:jeremiah:22:6",
            "prophets:nahum:1:14",
            "writings:daniel:2:38",
            "torah:leviticus:21:5",
            "writings:i%20chronicles:29:12",
            "torah:numbers:6:7"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:3:8",
            "Sefer%20Yetzirah:3:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:2",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:3",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:4:1"
        ]
    }
}