{
    "VERSE": "30:57",
    "ARABIC": "فَيَوْمَئِذٍ لَّا يَنفَعُ ٱلَّذِينَ ظَلَمُوا۟ مَعْذِرَتُهُمْ وَلَا هُمْ يُسْتَعْتَبُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "On that Day the excuses of those who did wrong will not help them nor will they be able to appease Allah.",
        "TRANSLATION_1": "Their excuses will be of no avail to the sinners on that day, and they will not be allowed to beg for favour.\n",
        "TRANSLATION_2": "So that will be the Day when the excuses of the wrong-doers will not avail them, nor will they be asked to make amends.\n",
        "TRANSLATION_3": "The excuses of the unjust on this day will be of no avail to them and they will not be able to please God.\n",
        "TRANSLATION_4": "So on that day the unjust will not benefit from their excuses, nor will anyone ask them for compensation.\n",
        "TRANSLATION_5": "So, on that Day no excuse of theirs will avail those who did wrong, nor will they be allowed to return to seek (Allah's) pleasure.\n",
        "TRANSLATION_6": "But on that day their excuse shall not profit those who were unjust, nor shall they be regarded with goodwill.\n",
        "TRANSLATION_7": "So that day their excuses will not profit the evildoers, nor will they be suffered to make amends.\n",
        "TRANSLATION_8": "In that day their excuses will not profit those who did injustice, nor will they be allowed to make amends.\n",
        "TRANSLATION_9": "So on that Day their pleas shall be of no avail, nor will they be allowed to make amends.\n",
        "TRANSLATION_10": "On that Day the excusing of themselves will not profit those who did wrong, nor shall they be suffered to please Allah.\n",
        "TRANSLATION_11": "On that day, the excuses of the wrongdoers will not benefit them, nor will they be asked to propitiate [Allah].\n",
        "TRANSLATION_12": "So on that Day no excuse of theirs will avail the transgressors, nor will they be invited (then) to seek grace (by repentance).\n",
        "TRANSLATION_13": "So on that Day no excuse of theirs will avail those who did wrong (by associating partners in worship with Allah, and by denying the Day of Resurrection), nor will they be allowed (then) to return to seek Allah's Pleasure (by having Islamic Faith with righteous deeds and by giving up polytheism, sins and crimes with repentance).\n",
        "TRANSLATION_14": "On that Day, excuses shall not benefit the harmdoers, nor shall they be asked to make amends.\n",
        "TRANSLATION_15": "On that Day, the sinners’ excuses will not benefit them, nor will they be excused.\n",
        "TRANSLATION_16": "So that Day, their excuse will not benefit those who wronged, nor will they be asked to appease [Allah].\n",
        "TRANSLATION_17": "[30:57] So on that day their excuses, for denying it, will not profit (read lā yanfa‘u or lā tanfa‘u) the evildoers, nor will they be asked to make amends (yusta‘tabūna means ‘they will [not] be asked for al-‘utbā’, which denotes ‘a return to that which pleases God’).\n",
        "TRANSLATION_18": "(In that day) which is the Day of Judgement (their excuses) for the sins they committed (will not profit those who did injustice) those who associated partners with Allah, (nor will they be allowed to make amends) their repentance will not be accepted and they will not be returned to the life of this world.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "30:57",
            "16:85",
            "7:119",
            "109:3",
            "37:13",
            "109:5",
            "89:25",
            "10:63",
            "68:18",
            "51:45"
        ],
        "BIBLE": [
            "prophets:isaiah:55:11",
            "writings:ezra:5:5",
            "prophets:ezekiel:20:31",
            "prophets:ezekiel:43:27",
            "torah:leviticus:16:34",
            "prophets:ezekiel:35:9",
            "torah:leviticus:16:16",
            "writings:psalms:32:5",
            "torah:deuteronomy:21:16",
            "prophets:jeremiah:34:22"
        ]
    }
}