{
    "VERSE": "30:59",
    "ARABIC": "كَذَٰلِكَ يَطْبَعُ ٱللَّهُ عَلَىٰ قُلُوبِ ٱلَّذِينَ لَا يَعْلَمُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "In that way Allah seals up the hearts of those who do not know.",
        "TRANSLATION_1": "That is how God seals the hearts of those who do not know.\n",
        "TRANSLATION_2": "Thus does Allah seal the hearts of those who have no knowledge.\n",
        "TRANSLATION_3": "Thus does God seal the hearts of those who do not know.\n",
        "TRANSLATION_4": "This is how Allah sets seal upon the hearts of the ignorant.\n",
        "TRANSLATION_5": "Thus does Allah seal up the hearts of those who know not.\n",
        "TRANSLATION_6": "Thus does Allah set a seal on the hearts of those who do not know.\n",
        "TRANSLATION_7": "Even so God seals the hearts of those that know not.\n",
        "TRANSLATION_8": "Thus doth Allah seal the hearts of those who know not.\n",
        "TRANSLATION_9": "In this way God seals the hearts of those who do not [want to] know [the truth],\n",
        "TRANSLATION_10": "In this wise Allah sealeth the hearts of those who believe not.\n",
        "TRANSLATION_11": "Thus does Allah seal the hearts of those who do not know.\n",
        "TRANSLATION_12": "Thus does Allah seal up the hearts of those who understand not.\n",
        "TRANSLATION_13": "Thus does Allah seal up the hearts of those who know not [the proofs and evidence of the Oneness of Allah i.e. those who try not to understand true facts that which you (Muhammad SAW) have brought to them].\n",
        "TRANSLATION_14": "As such Allah seals the hearts of those who do not know.\n",
        "TRANSLATION_15": "God thus seals the hearts of those who do not know.\n",
        "TRANSLATION_16": "Thus does Allah seal the hearts of those who do not know.\n",
        "TRANSLATION_17": "[30:59] Thus does God seal the hearts of those who do not know, [anything of] God’s Oneness, in the same way that He has sealed the hearts of these [aforementioned individuals].\n",
        "TRANSLATION_18": "(Thus doth Allah seal the hearts of those who know not) Allah's divine Oneness and disbelieve in it.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "30:59",
            "13:28",
            "40:63",
            "22:35",
            "16:108",
            "10:69",
            "47:29",
            "9:64",
            "26:89",
            "63:3"
        ],
        "BIBLE": [
            "writings:psalms:139:23",
            "prophets:ezekiel:28:6",
            "prophets:isaiah:44:18",
            "writings:ii%20chronicles:12:14",
            "writings:psalms:119:30",
            "writings:daniel:10:12",
            "writings:ii%20chronicles:32:31",
            "writings:song%20of%20songs:8:6",
            "prophets:isaiah:50:7",
            "writings:proverbs:19:18"
        ]
    }
}