{
    "VERSE": "30:60",
    "ARABIC": "فَٱصْبِرْ إِنَّ وَعْدَ ٱللَّهِ حَقٌّ وَلَا يَسْتَخِفَّنَّكَ ٱلَّذِينَ لَا يُوقِنُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "So be steadfast. Allah's promise is true. Do not let those who have no certainty belittle you.",
        "TRANSLATION_1": "So have patience. The promise of God is surely true; and let not those who do not believe make you relax (your endeavours).\n",
        "TRANSLATION_2": "Therefore, (O Prophet), have patience. Surely Allah's promise is true. Let those who lack certainty not cause you to be unsteady.\n",
        "TRANSLATION_3": "Be patient. The promise of God is certainly true. Let not the faithless make you despair of the promise of God.\n",
        "TRANSLATION_4": "Therefore patiently endure, indeed the promise of Allah is true; and may not those who do not have faith make you impatient.\n",
        "TRANSLATION_5": "So be patient. Verily, the promise of Allah is true; and let not those who have no certainty of faith discourage you (from conveying Allah's Message).\n",
        "TRANSLATION_6": "Therefore be patient; surely the promise of Allah is true and let not those who have no certainty hold you in light estimation.\n",
        "TRANSLATION_7": "So be thou patient; surely God's promise is true; and let not those who have not sure faith make thee unsteady.\n",
        "TRANSLATION_8": "So have patience (O Muhammad)! Allah's promise is the very truth, and let not those who have no certainty make thee impatient.\n",
        "TRANSLATION_9": "so have patience [O Muhammad]! God's promise is true; let not those who will not be convinced make you discouraged.\n",
        "TRANSLATION_10": "So have thou patience; verily the promise of Allah is true. And let not make thee impatient those who have no conviction.\n",
        "TRANSLATION_11": "So be patient! Allah’s promise is indeed true. And do not let yourself be upset by those who have no conviction.\n",
        "TRANSLATION_12": "So patiently persevere: for verily the promise of Allah is true: nor let those shake thy firmness, who have (themselves) no certainty of faith.\n",
        "TRANSLATION_13": "So be patient (O Muhammad SAW). Verily, the Promise of Allah is true, and let not those who have no certainty of faith, discourage you from conveying Allah's Message (which you are obliged to convey)\n",
        "TRANSLATION_14": "Therefore, have patience. The promise of Allah is true. Do not let those who are uncertain make you unsteady.\n",
        "TRANSLATION_15": "So be patient. The promise of God is true. And do not let those who lack certainty belittle you.\n",
        "TRANSLATION_16": "So be patient. Indeed, the promise of Allah is truth. And let them not disquiet you who are not certain [in faith].\n",
        "TRANSLATION_17": "[30:60] So be patient. Surely God’s promise, to give you victory over them, is true. And do not let them cause you to be inconstant, those who are uncertain, of the Resurrection, in other words, do not let them cause you to succumb to inconstancy and frivolity by abandoning patience, that is to say, do not abandon it. Meccan, except for verses 27, 28 and 29, which are Medinese; it consists of 34 verses revealed after [sūrat] al-Sāffāt.\n",
        "TRANSLATION_18": "(So have patience) Muhammad! (Allah's promise) to help you, give you the upper hand and to destroy them (is the very truth) it will surely happen, (and let not those who have no certainty) those who do not believe (make thee impatient) make you swerve from faith on the day of Judgement'. And of the surah in which Luqman is mentioned, which is all Meccan and consists of 34 verses, 748 words and 2,110 letters: Surah 31: Luqman And of the surah in which Luqman is mentioned, which is all Meccan and consists of 34 verses, 748 words and 2,1 10 letters:\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "30:60",
            "40:77",
            "27:79",
            "3:102",
            "10:55",
            "35:5",
            "14:47",
            "28:13",
            "16:128",
            "37:152"
        ],
        "BIBLE": [
            "writings:job:11:3",
            "writings:job:10:2",
            "torah:genesis:21:18",
            "torah:deuteronomy:13:15",
            "torah:leviticus:20:25",
            "prophets:jeremiah:20:9",
            "prophets:jeremiah:30:10",
            "prophets:i%20samuel:28:15",
            "prophets:isaiah:26:13",
            "torah:leviticus:25:46"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:1:8",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:6:5",
            "Sefer%20Yetzirah:1:9",
            "Sefer%20Yetzirah:3:2",
            "Sefer%20Yetzirah:2:1",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:6"
        ]
    }
}