{
    "VERSE": "30:7",
    "ARABIC": "يَعْلَمُونَ ظَٰهِرًا مِّنَ ٱلْحَيَوٰةِ ٱلدُّنْيَا وَهُمْ عَنِ ٱلْءَاخِرَةِ هُمْ غَٰفِلُونَ",
    "ENGLISH": {
        "TRANSLATION_0": "They know an outward aspect of the life of this world but are heedless of the Next World.",
        "TRANSLATION_1": "They only know the palpable life of this world, and are oblivious of the Hereafter.\n",
        "TRANSLATION_2": "People simply know the outward aspect of the worldly life but are utterly heedless of the Hereafter.\n",
        "TRANSLATION_3": "They only know the superficial realities of the worldly life and they are unaware of the life to come.\n",
        "TRANSLATION_4": "They know only the visible worldly life; and are totally neglectful of the Hereafter.\n",
        "TRANSLATION_5": "They know only the outer appearance of the life of the world, and they are heedless of the Hereafter.\n",
        "TRANSLATION_6": "They know the outward of this world's life, but of the hereafter they are absolutely heedless.\n",
        "TRANSLATION_7": "They know an outward part of the present life, but of the Hereafter they are heedless.\n",
        "TRANSLATION_8": "They know only some appearance of the life of the world, and are heedless of the Hereafter.\n",
        "TRANSLATION_9": "they only know the outward appearance of the life of this world, and they are neglectful of the Hereafter.\n",
        "TRANSLATION_10": "They know only the outward appearance of the life of the world, and they! of the Hereafter, they are neglecetful.\n",
        "TRANSLATION_11": "They know just an outward aspect of the life of the world, but they are oblivious of the Hereafter.\n",
        "TRANSLATION_12": "They know but the outer (things) in the life of this world: but of the End of things they are heedless.\n",
        "TRANSLATION_13": "They know only the outside appearance of the life of the world (i.e. the matters of their livelihood, like irrigating or sowing or reaping, etc.), and they are heedless of the Hereafter.\n",
        "TRANSLATION_14": "They know an outward part of this life, but of the Everlasting Life they are inattentive.\n",
        "TRANSLATION_15": "They know an outer aspect of the worldly life, but they are heedless of the Hereafter.\n",
        "TRANSLATION_16": "They know what is apparent of the worldly life, but they, of the Hereafter, are unaware.\n",
        "TRANSLATION_17": "[30:7] They know [merely] an outward aspect of the life of this world, that is to say, its various means of [securing] livelihood, such as commerce, agriculture, construction and cultivation and so on; but they, of the Hereafter, they are oblivious (this repetition of hum, ‘they’, is for emphasis).\n",
        "TRANSLATION_18": "(They) i.e. the people of Mecca (know only some appearance of the life of the world) the dealings of the life of this world, such as earning a livelihood, trade, buying and selling and counting from one to 1,000, and also that which they need in winter and summer, (and are heedless) ignorant (of the Hereafter) of the matter of the Hereafter and do not strive for it.\n"
    },
    "CROSS_REFERENCE": {
        "QURAN": [
            "30:7",
            "14:27",
            "2:86",
            "79:38",
            "41:31",
            "16:107",
            "10:7",
            "23:37",
            "53:29",
            "6:29"
        ],
        "BIBLE": [
            "prophets:isaiah:41:22",
            "prophets:isaiah:41:23",
            "prophets:ezekiel:7:6",
            "writings:daniel:7:16",
            "prophets:isaiah:34:1",
            "prophets:jeremiah:43:1",
            "prophets:isaiah:40:28",
            "prophets:jeremiah:16:19",
            "prophets:ezekiel:1:5",
            "writings:proverbs:30:18"
        ],
        "KABBALAH": [
            "Sefer%20Yetzirah:6:1",
            "Sefer%20Yetzirah:1:7",
            "Sefer%20Yetzirah:2:5",
            "Sefer%20Yetzirah:4:12",
            "Sefer%20Yetzirah:4:1",
            "Sefer%20Yetzirah:1:5",
            "Sefer%20Yetzirah:1:6",
            "Sefer%20Yetzirah:6:4",
            "Sefer%20Yetzirah:4:2",
            "Sefer%20Yetzirah:5:1"
        ]
    }
}